[{"file": "1601.06187.tex", "nexttext": "\n\nwhere $c_1$, $c_2$ are annihilation operators describing the particles\nof the coupled system, and $g$ is their interaction strength. If the\nparticles described by $c_i$ have a decay rate $\\gamma_i$, and are\nfreely evolving with a Hamiltonian $H_i$, $i=1,2$, the master equation\ndescribing the dynamics of this system is:\n\n\n", "itemtype": "equation", "pos": 11749, "prevtext": " \n\\title{Exciting with Quantum Light. I.~Exciting an harmonic oscillator.}\n\n\n\n\n\n\\author{J.~C.~L\\'{o}pez~Carre\\~{n}o} \n\\affiliation{Departamento\nde F\\'isica Te\\'orica de la Materia Condensada, Universidad\nAut\\'onoma de Madrid, 28049 Madrid, Spain}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\author{F.~P.~Laussy} \n\\affiliation{Russian Quantum Center, Novaya 100, 143025 Skolkovo, Moscow Region, Russia}\n\\affiliation{Departamento de F\\'isica Te\\'orica de la Materia Condensada, Universidad Aut\\'onoma de Madrid, 28049 Madrid, Spain} \n\n\\begin{abstract} \n  We start a series of studies of the excitation of an optical target\n  by quantum light. In this first part, we introduce the problematic\n  and address the first case of interest, that of exciting the quantum\n  harmonic oscillator, corresponding to, e.g., a single-mode passive\n  cavity or a non-interacting bosonic field. We introduce a mapping of\n  the Hilbert space that allows to chart usefully the accessible\n  regions. We then consider the quantum excitation from single photon\n  sources in the form of a two-level system under various regimes of\n  (classical) pumping: incoherent, coherent and in the Mollow triplet\n  regime.  We close this first opus with an overview of the material\n  to be covered in the subsequent papers.\n\\end{abstract}\n\n\\date{\\today} \n\\maketitle \n\n\\section{Introduction} \n\nPhotonics has been highly successful in the engineering of quantum\nsources since the proof-of-principle production of quantum light in\nthe mid-seventies~\\cite{clauser74b,kimble77a}. Befitting its status of\nthe elementary brick of the light field, the single photon was the\nfirst type of genuinely non-classical type of light and gave rise to\nthe concept of a single photon source (SPS). Nowadays, SPS abound with\never increasing figures of\nmerit~\\cite{kuhlmann15a,portalupi15a,ding16a} and are even\ncommercially available. The motivations for SPS are\nmany~\\cite{chunnilall14a}, from metrology to input for quantum\ninformation processing, passing by bio-technology, sensing and a\nwealth of imaging applications. In most cases, the technology is still\nunder development and quantum light is not yet deployed on the\nmarket. For this reason, the focus is still largely on the source\nitself rather than on its direct use as part of a technological\ncomponent\n\n. There is however an increasing interest in using quantum light for\ndirect applications, as is often the case for a healthy and maturing\nfield of physics. For instance, there have been recently converging\npropositions from independent groups to use quantum light for\nspectroscopy~\\cite{kira06a,assmann11b,assmann15a,mukamel15a,lopezcarreno15a}.\n\nRecently, thanks to the theory of frequency-resolved photon\ncorrelations~\\cite{delvalle12a}, it was shown how quantum sources can\nbe greatly tuned in their characteristics by selecting light in astute\nfrequency windows, revealed by the theory in the form of so-called\n``two-photon correlations\nspectra''~\\cite{delvalle13a,gonzaleztudela13a}.  This can be used to\nidentify and exploit unsuspected types of quantum\ncorrelations~\\cite{sanchezmunoz14b} and/or enhance them by learned\ncombination of timescales and frequencies~\\cite{gonzaleztudela15a}.\nBeyond optimizing parameters to find the best compromises for sought\napplications, the theory also reveals that interesting quantum signal\nis typically not found at the expected spectral locations such as\npeaks, that correspond to classical-like de-excitation of the emitter\nbetween real states at the one-photon level. Instead, strong quantum\ncorrelations arise from, e.g., two-photon de-excitation involving\nintermediate virtual states.  Such channels of de-excitation were\ntermed ``\\emph{leapfrog\n  processes}''~\\cite{delvalle13a,gonzaleztudela13a}. They are emitted\nin unremarkable frequency windows at the photo-luminescence level. At\nthe quantum-optical level, however, they are the quintessence of\nquantum emission. This picture has been recently confirmed\nexperimentally by A.~M\\\"uller's group~\\cite{peiris15a}.  A closer look\nat, and proper selection of, the photons emitted by quantum sources\nthus appears fundamental for state-of-the-art quantum applications,\ntheir correlations being otherwise averaged over often competing\ntypes. This viewpoint of frequency-resolved photon correlations\ntherefore poses in a new light the problem of the excitation of\noptical targets with such inside-knowledge of the features of the\nsources. This revives a question put to close scrutiny by\nGardiner~\\cite{gardiner93a} and Carmichael~\\cite{carmichael93b} in\n1993 following the emergence of sources of squeezed\nlight~\\cite{walls83a}, which appeared sufficiently more elaborate as\ncompared to SPS to warrant a direct investigation of how they would\naffect optical targets as compared to conventional types of excitation\n(classical fields, possibly stochastic). Gardiner and Carmichael's\n(independent) treatment of the problem in two consecutives Letters in\nthe Physical Review~\\cite{gardiner93a,carmichael93b} achieved the\nsetting up of a formalism---named the ``\\emph{cascaded formalism}'' by\nCarmichael---that allows to excite a system (which we will call the\n``target'') by an other (the ``source'') without back-action from the\ntarget to the source. This permits to think separately of the quantum\nsource, which properties can be first studied (through the two-photon\nspectrum, for instance) and then directed onto a target.  For\nhistorical accuracy, let us mention that the problem was first\ncontemplated by Kolobov and Sokolov~\\cite{kolobov87a} who tackled it\nby providing all the correlations of the exciting quantum field.  This\nwas recognized as an overkill by Gardiner and\nCarmichael~\\cite{gardiner93a,carmichael93b} (Gardiner had made prior\nattempts along these lines). They proposed instead to model the\nquantum source dynamics as well as the response of the target, even if\nonly the latter is of interest. From our point of view, such a\ntreatment is essential since the frequency correlations of the source\nare too complicated to be treated otherwise than fully and explicitly\nby solving the complete problem. Also, such correlations are dynamical\nin character, and cannot be well approximated by quantum states as\ninitial conditions. Instead, they must be dealt with through the full\napparatus of dissipative quantum optics, feeding the target with the\ncomplete treatment of virtual states and other types of strongly\ncorrelated quantum input. The cascaded formalism is therefore\nparticularly apposite for exciting optical systems with the knowledge\nof the two-photon correlations spectrum of an emitter.\n\nDespite the conceptual importance of quantum excitation, there have\nbeen a moderate follow-up of this cascaded formalism, which we believe\nis a deep and far-reaching contribution to the problem of light-matter\ninteraction.  Even though it became textbook material (see the last\nchapter from one of the pioneering authors~\\cite{gardiner_book00a})\nand generated a sizable amount of citations, few texts do actually\nfully exploit the idea. Gardiner and Parkins (the formalism is\nsometimes also named after these two authors) undertook a more\nthorough analysis of various types of non-standard statistics of the\nsource~\\cite{gardiner94a} and Cirac \\emph{et al.}~used it to describe\nperfect transmission in their proposal for a quantum\nnetwork~\\cite{cirac97b}, but overall, the core of the literature using\nthe formalism focuses on specialized particular cases, such as driving\nwith squeezed light~\\cite{smyth99a,messikh00a}. Typically, the\ndiscussion is then held at the level of correlations from a quantum\nstate (namely a squeezed state), as opposed to dynamical correlations\nfrom a quantum source.  The other studies, already evoked, turned to\napproximate or indirect approaches, quite similar to the earlier\nattempts before the cascaded formalism was set up. The reasons for\nthis is certainly a mix between convenience of using well-known and\nestablished formalisms and the as-yet unclear advantages of the\nalternative one.\n\nIn this series of texts, we make an extensive study of exciting with\nquantum light (with no feedback of the target to the source), and show\nthat some new features of light-matter interaction emerge, making the\noverall problem in need of scrupulous attention. The formalism itself\nneeds little further development and we will mainly adapt it to new\ncases and with the additional knowledge provided by frequency-resolved\ncorrelations (we will extend the formalism in the following papers to\nconsider sequences of cascades and multiple sources). We briefly\nintroduce its core machinery in a self-contained way in\nSection~\\ref{sec:marnov24124242CET2015} as a convenience for the\nreader, and refer to the original works for details of the\nderivation~\\cite{gardiner93a,carmichael93b} or to the Supplementary\nMaterial of Ref.~\\cite{lopezcarreno15a}, where it is cast in the\nproblematic of the present\ntext. Section~\\ref{sec:lunnov30100948CET2015} gives an overview of the\nmany possibilities one can study in this workframe as well as details\nof the configurations we focus on in the following of the\nseries. After what can be seen as a long introduction,\nSection~\\ref{sec:lunnov30101947CET2015} introduces the first important\nresults by providing a way to characterize quantum states of the\nHarmonic oscillator in a space of diagonal quantum-optical\ncorrelators, which will be helpful to later characterize the sources,\nand with effect to disprove a popular criterion for single-photon\nstates.  Section~\\ref{sec:vieoct23172746CEST2015} and\n\\ref{sec:marnov24163921CET2015} characterize the incoherent and\ncoherent SPS, respectively. As the latter will prove to be more\ninteresting, we devote most of our attention to this case.\nSection~\\ref{sec:lunnov30102926CET2015} shows that the advantages of\nthe cascaded coupling over the conventional Hamiltonian coupling\n(which will have been presented by then) remain present even when\nconsidering alternative descriptions of coupling between the source\nand the target.  Section \\ref{sec:jueoct29112554CET2015} draws the\nconclusions for the cases studied here while\nSection~\\ref{sec:jueoct29112601CET2015} does so for the wider picture\nof cascaded coupling and introduces the other cases to be investigated\nin follow-up papers.\n\n\n\n\n\\begin{figure}\n    \\includegraphics[width=0.8\\linewidth]{figures/Fig-1-0.pdf}\n    \\caption{(Color online). Upper part: The two main types of\n      classical excitation. The harmonic oscillator can be implemented\n      by a single-mode cavity, sketched here as two distributed Bragg\n      reflectors facing each other. The SPS can be implemented by a\n      quantum dot, sketched here as a little pyramid, as it would be\n      grown by self-assembly~\\cite{grundmann95a}. (a) Incoherent\n      excitation, typically corresponding to thermal light. (b)\n      Coherent excitation, typically corresponding to driving the\n      system with a laser. Lower part: Upgrading the classical sources\n      of the upper panel with SPS. (c) is the counterpart of~(a), to\n      be referred to as the ``incoherent SPS''. The coherent case\n      yields two very different types of quantum light at low and high\n      pumpings: (d) the coherent SPS and (e) the Mollow PS which can\n      emit more than one photon at a time.  Other types of quantum\n      sources and other types of targets constitute the topic of the\n      following texts in the series.}\n  \\label{fig:jueoct29162857CET2015}\n\\end{figure}\n\n\\section{Theoretical background}\n\\label{sec:marnov24124242CET2015}\n\nThe coupling between two quantum systems is typically given by an\ninteraction Hamiltonian. In the second quantization formalism, such a\nHamiltonian reads in its most simple form (we take $\\hbar =1$ along\nthe paper):\n\n\n", "index": 1, "text": "\\begin{equation}\n  H_{I} = g({{c_1}^{\\dagger}}c_2+{{c_2}^{\\dagger}}c_1)\\,,\n  \\label{Eq.InteractionHamiltonian}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H_{I}=g({{c_{1}}^{\\dagger}}c_{2}+{{c_{2}}^{\\dagger}}c_{1})\\,,\" display=\"block\"><mrow><mrow><msub><mi>H</mi><mi>I</mi></msub><mo>=</mo><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mmultiscripts><mi>c</mi><mn>1</mn><none/><none/><mo>†</mo></mmultiscripts><mo>⁢</mo><msub><mi>c</mi><mn>2</mn></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>c</mi><mn>2</mn><none/><none/><mo>†</mo></mmultiscripts><mo>⁢</mo><msub><mi>c</mi><mn>1</mn></msub></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nwhere $\\mathcal{L}_c \\rho = (2 c\\rho {{c}^{\\dagger}} - {{c}^{\\dagger}}c\\rho - \\rho\n{{c}^{\\dagger}}c)$. Depending on whether the coupling~$H_I$ or the\ndissipation~$\\gamma_i$ dominates, one speaks of strong or weak\ncoupling, respectively. If one of the two systems, say, 1, is itself\nexcited externally, for instance being driven by a laser, or merely\nbeing given a non-vacuum initial condition, then one has a crude\npicture of system 1 exciting system 2. This is fairly correct in the\nweak-coupling limit where the dynamics is irreversible (we discuss in\nSection~\\ref{sec:lunnov30102926CET2015} when this becomes exact).\n\nThe coupling between quantum systems can also correspond to the\nscenario of a source and its target, embedding the deep asymmetry\nbetween them. For instance, one can physically remove the target from\nthe beam of the source, which leaves the latter unaffected while the\nformer passes from being irradiated to the vacuum. Note that such an\nasymmetry does not have to hold on logical grounds. In fact, in\nelectronics, while an ideal source should not be affected by the\ncircuit it powers, in reality, there is a load and every component\naffects all the others to some extent. In photonics, the picture of a\nflying qubit, left to propagate long enough before it meets its\ntarget, makes it intuitively clear that it should be possible to\nforbid back-action. This is achieved theoretically by cascaded\ncoupling~\\cite{gardiner_book00a}. The equations of motion are\nexpressed in the quantum Langevin form, thus allowing to set the\noutput field of one of the systems (the source) as the input field for\nthe other (the target). This can be brought to a master equation type\nof description, with both coherent and Lindblad terms that contrive to\ndirect the flow of excitation from the source to target only. This\nmakes all the operators of the source independent from those of the\ntarget, while in turn these depend on operators of the source. The\ngeneric case where the source (resp.~target) is described by the\nHamiltonian $H_1$ (resp.~$H_2$) and has a decay rate~$\\gamma_1$\n(resp.~$\\gamma_2$) is ruled by the following master\nequation~\\cite{gardiner_book00a}:\n\n\n", "itemtype": "equation", "pos": 12198, "prevtext": "\n\nwhere $c_1$, $c_2$ are annihilation operators describing the particles\nof the coupled system, and $g$ is their interaction strength. If the\nparticles described by $c_i$ have a decay rate $\\gamma_i$, and are\nfreely evolving with a Hamiltonian $H_i$, $i=1,2$, the master equation\ndescribing the dynamics of this system is:\n\n\n", "index": 3, "text": "\\begin{equation}\n\\partial_t \\rho = i [\\rho, H_1 +H_2+H_I] + \\frac{\\gamma_1}{2}\\mathcal{L}_{c_1}\\rho+\\frac{\\gamma_2}{2}\\mathcal{L}_{c_2} \\rho\\, ,\n\\label{Eq.MasterEquationNormal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\partial_{t}\\rho=i[\\rho,H_{1}+H_{2}+H_{I}]+\\frac{\\gamma_{1}}{2}\\mathcal{L}_{c_%&#10;{1}}\\rho+\\frac{\\gamma_{2}}{2}\\mathcal{L}_{c_{2}}\\rho\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>ρ</mi></mrow><mo>=</mo><mrow><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>ρ</mi><mo>,</mo><mrow><msub><mi>H</mi><mn>1</mn></msub><mo>+</mo><msub><mi>H</mi><mn>2</mn></msub><mo>+</mo><msub><mi>H</mi><mi>I</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><mrow><mfrac><msub><mi>γ</mi><mn>1</mn></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>c</mi><mn>1</mn></msub></msub><mo>⁢</mo><mi>ρ</mi></mrow><mo>+</mo><mrow><mfrac><msub><mi>γ</mi><mn>2</mn></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>c</mi><mn>2</mn></msub></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>ρ</mi></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nPutting Eq.~(\\ref{Eq.MasterEquationCascaded}) in the Lindblad form\ncontributes a Hamiltonian part.  The formalism thus corresponds to a\nquantum coherent coupling, allowing the description of continuous wave\n(cw) and resonant excitation of quantum states.  Importantly, in\ncontrast to the Hamiltonian coupling in\nEq.~(\\ref{Eq.InteractionHamiltonian}), the coupling strength is now\nfixed by the decay rate of the source and of the target. An\ninfinitely-lived target cannot be excited. The stronger one wishes to\nmake the coupling between a source and its target, the stronger has to\nbe their (geometric) mean dissipation. This imposes some fundamental\nconstrains on external driving (or driving without feedback). In\ncontrast, Hamiltonian coupling sets the coupling strength and decay\nrates independently. While it would therefore appear that the\nHamiltonian coupling has the upper hand, and that one should strive\nfor the standard strong-coupling regime, we will show in the following\nthat the cascaded architecture can be superior to the other types of\ncoupling in some cases.\n\n\\section{Quantum Sources and Optical Targets}\n\\label{sec:lunnov30100948CET2015}\n\nThe general problem of excitation with quantum light has obviously\nnumerous ramifications. To the already large variety of optical\ntargets, one now has to combine a much enlarged set of quantum\nsources. This literally opens a new dimension to optics.  Indeed,\nclassical excitation could arguably be limited to a rather small set\nof categories:\n\n\\begin{enumerate}\n\\item[(a)] Coherent excitation (driving with a laser)\n\\item[(b)] Incoherent excitation (incoherent pumping, Boltzmann\n  dynamics, thermal baths, equilibrium, etc.)\n\\end{enumerate}\n\n(we postpone to part~V the discussion of time-dependent and pulsed\nexcitation and consider until then the case of continuous wave\nexcitation, cf.~Section~\\ref{sec:jueoct29112601CET2015}). Quantum\nlight, on the other hand, encompasses not only the above---if only\nbecause it is a more general case that includes classical excitation\nas a particular case---but also comes with many more and higher\ndegrees of freedom. This did not lead so far, to the best of our\nknowledge, to a classification. Tentatively, this could be provided in\na first approximation by~$g^{(2)}$ (antibunching, uncorrelated,\nbunching, superbunching). Since squeezed states have the correlations\nof coherent states, however, and they are precisely the type of input\nthat motivated a new formalism, it is clear that this is still far\nfrom appropriate. We decided to approach this general problem by\nconsidering:\n\n\\begin{itemize}\n\\addtolength{\\itemsep}{-0.5\\baselineskip}\n\\item the same optical target (here an harmonic oscillator, in the next\n  paper a two-level system),\n\\item the same type of quantum source (here and in the next paper, a SPS, in the third paper, an $N$-photon emitter),\n\\item both coherent and incoherent regimes,\n\\item both low and high pumping.\n\\end{itemize}\n\n\\begin{table*}[thpb]\n  \\begin{ruledtabular}\n    \\begin{tabular}{l|c|c|c|c|c}\n      Source & Pumping & Population~$n_\\sigma$ & $g_\\sigma^{(2)}(\\tau)$ & Lineshape & Linewidth \\\\\n      \\hline\n      Incoherent SPS & $P_\\sigma$ & $P_\\sigma/(\\gamma_\\sigma+P_\\sigma)$ & $1-\\exp\\big(-(\\gamma_\\sigma+P_\\sigma)\\tau\\big)$ & Lorentzian & $\\gamma_\\sigma+P_\\sigma$ \\\\\n      Coherent SPS & small $\\Omega_\\sigma$ & $4\\Omega_\\sigma^2/\\gamma_\\sigma^2$ & $(1-\\exp(-\\gamma_\\sigma\\tau/2))^2$ & Lorentzian & $\\gamma_\\sigma$ \\\\\n      Coherent SPS & large $\\Omega_\\sigma$ & $4\\Omega_\\sigma^2/(\\gamma_\\sigma^2+8\\Omega_\\sigma^2)$ & $\\displaystyle 1-e^{-\\frac{3\\gamma_\\sigma\\tau}{4}}\\Big[\\cosh(\\frac{\\Gamma_\\sigma\\tau}{4})+\\frac{3\\gamma_\\sigma}{\\Gamma_\\sigma}\\sinh(\\frac{\\Gamma_\\sigma\\tau}{4})\\Big]$ & Triplet & $\\left\\{\\pbox{20cm}{$\\gamma_\\sigma$ (central)\\\\$3\\gamma_\\sigma/2$ (satellites)}\\right.$ \\\\\n    \\end{tabular}\n  \\end{ruledtabular}\n  \\caption{Characteristic of a SPS driven incoherently or coherently. In the latter case, for clarity, we also consider separately the low-driving intensity (middle row) from the general case (bottom row) that covers all pumpings, to highlight the strong qualitative features of the Mollow regime. \\label{tab:vieoct23142648CEST2015}}\n\\end{table*}\n\nThe SPS is a good starting point because it is the paradigm of quantum\nlight and is the most common light of this type in the\nlaboratory. Exciting the harmonic oscillator makes the problem both\nsimple and fundamental, so this is also a good starting point. While\nwe have considerably restrained the possibilities, there still remains\nmuch to be explored and the following will only address the main\nresults. The two types of excitations aforementionned~(a--b) yield\nquite different types of SPS, that are introduced in the beginning of\ntheir respective Sections, and are summarized in\ntable~\\ref{tab:vieoct23142648CEST2015}. Note that in the table, the\nlast row also includes the second one (which is the limit of small\npumping). They are however so distinct qualitatively that it is\nhelpful to think of them as separate sources. As we will show, the\nsecond row (small coherent pumping) leads to the best antibunching in\nthe target.\n\n\\section{Charting the Hilbert space}\n\\label{sec:lunnov30101947CET2015}\n\nPrior to considering which quantum states of the harmonic oscillator\none can access by exciting it with various types of SPS, one needs a\nroadmap to characterize all of the states at a glance. The Hilbert\nspace is a big place. Human's capacity of abstraction gives a\ndeceivingly simple picture of it. The canonical basis of Fock\nstates~$\\left| {n}\\right\\rangle$ with~$n\\in\\mathbb{N}$ provides a comprehensive and\nconcise map of the states in the harmonic oscillator's Hilbert\nspace~$\\mathcal{H}_\\infty$:\n\n\n", "itemtype": "equation", "pos": 14565, "prevtext": "\n\nwhere $\\mathcal{L}_c \\rho = (2 c\\rho {{c}^{\\dagger}} - {{c}^{\\dagger}}c\\rho - \\rho\n{{c}^{\\dagger}}c)$. Depending on whether the coupling~$H_I$ or the\ndissipation~$\\gamma_i$ dominates, one speaks of strong or weak\ncoupling, respectively. If one of the two systems, say, 1, is itself\nexcited externally, for instance being driven by a laser, or merely\nbeing given a non-vacuum initial condition, then one has a crude\npicture of system 1 exciting system 2. This is fairly correct in the\nweak-coupling limit where the dynamics is irreversible (we discuss in\nSection~\\ref{sec:lunnov30102926CET2015} when this becomes exact).\n\nThe coupling between quantum systems can also correspond to the\nscenario of a source and its target, embedding the deep asymmetry\nbetween them. For instance, one can physically remove the target from\nthe beam of the source, which leaves the latter unaffected while the\nformer passes from being irradiated to the vacuum. Note that such an\nasymmetry does not have to hold on logical grounds. In fact, in\nelectronics, while an ideal source should not be affected by the\ncircuit it powers, in reality, there is a load and every component\naffects all the others to some extent. In photonics, the picture of a\nflying qubit, left to propagate long enough before it meets its\ntarget, makes it intuitively clear that it should be possible to\nforbid back-action. This is achieved theoretically by cascaded\ncoupling~\\cite{gardiner_book00a}. The equations of motion are\nexpressed in the quantum Langevin form, thus allowing to set the\noutput field of one of the systems (the source) as the input field for\nthe other (the target). This can be brought to a master equation type\nof description, with both coherent and Lindblad terms that contrive to\ndirect the flow of excitation from the source to target only. This\nmakes all the operators of the source independent from those of the\ntarget, while in turn these depend on operators of the source. The\ngeneric case where the source (resp.~target) is described by the\nHamiltonian $H_1$ (resp.~$H_2$) and has a decay rate~$\\gamma_1$\n(resp.~$\\gamma_2$) is ruled by the following master\nequation~\\cite{gardiner_book00a}:\n\n\n", "index": 5, "text": "\\begin{multline}\n\\partial_t\\rho = i [\\rho, H_{1}+H_{2}] + \\frac{\\gamma_1}{2}\\mathcal{L}_{c_1} \\rho  + \\frac{\\gamma_2}{2}\\mathcal{L}_{c_2} \\rho  \\\\- \\sqrt{\\gamma_1 \\gamma_2}\\left ( [{{c_2}^{\\dagger}},c_1\\rho]+[\\rho{{c_1}^{\\dagger}}, c_2] \\right)\\,.\n\\label{Eq.MasterEquationCascaded}\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\partial_{t}\\rho=i[\\rho,H_{1}+H_{2}]+\\frac{\\gamma_{1}}{2}\\mathcal%&#10;{L}_{c_{1}}\\rho+\\frac{\\gamma_{2}}{2}\\mathcal{L}_{c_{2}}\\rho\\\\&#10;\\displaystyle-\\sqrt{\\gamma_{1}\\gamma_{2}}\\left([{{c_{2}}^{\\dagger}},c_{1}\\rho]%&#10;+[\\rho{{c_{1}}^{\\dagger}},c_{2}]\\right)\\,.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>ρ</mi></mrow><mo>=</mo><mrow><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>ρ</mi><mo>,</mo><mrow><msub><mi>H</mi><mn>1</mn></msub><mo>+</mo><msub><mi>H</mi><mn>2</mn></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><mrow><mfrac><msub><mi>γ</mi><mn>1</mn></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>c</mi><mn>1</mn></msub></msub><mo>⁢</mo><mi>ρ</mi></mrow><mo>+</mo><mrow><mfrac><msub><mi>γ</mi><mn>2</mn></msub><mn>2</mn></mfrac><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>c</mi><mn>2</mn></msub></msub><mo>⁢</mo><mi>ρ</mi></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>-</mo><mrow><msqrt><mrow><msub><mi>γ</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>γ</mi><mn>2</mn></msub></mrow></msqrt><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mmultiscripts><mi>c</mi><mn>2</mn><none/><none/><mo>†</mo></mmultiscripts><mo>,</mo><mrow><msub><mi>c</mi><mn>1</mn></msub><mo>⁢</mo><mi>ρ</mi></mrow><mo stretchy=\"false\">]</mo></mrow><mo>+</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>ρ</mi><mo>⁢</mo><mmultiscripts><mi>c</mi><mn>1</mn><none/><none/><mo>†</mo></mmultiscripts></mrow><mo>,</mo><msub><mi>c</mi><mn>2</mn></msub><mo stretchy=\"false\">]</mo></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nwith~$\\alpha_n\\in\\mathbb{C}$ such that\n$\\sum_{n=0}^\\infty|\\alpha_n|^2=1$. This is as precise as it is\nmisleading, since this fails to provide a qualitative map of the possible\nstates. Instead, one uses families of particular cases. Beyond Fock\nstates per se, one makes a great use of the coherent states of\nclassical physics, for\nwhich~$\\alpha_n=\\alpha^n\\exp(-|\\alpha|^2)/\\sqrt{n!}$ for some complex\nnumber~$\\alpha$ that defines the amplitude and phase of a classical\nfield. The next family of important states requires the concept of\nmixity that involves statistical averages and upgrades the\nwavefunction to a density matrix:\n\n\n", "itemtype": "equation", "pos": 20591, "prevtext": "\n\nPutting Eq.~(\\ref{Eq.MasterEquationCascaded}) in the Lindblad form\ncontributes a Hamiltonian part.  The formalism thus corresponds to a\nquantum coherent coupling, allowing the description of continuous wave\n(cw) and resonant excitation of quantum states.  Importantly, in\ncontrast to the Hamiltonian coupling in\nEq.~(\\ref{Eq.InteractionHamiltonian}), the coupling strength is now\nfixed by the decay rate of the source and of the target. An\ninfinitely-lived target cannot be excited. The stronger one wishes to\nmake the coupling between a source and its target, the stronger has to\nbe their (geometric) mean dissipation. This imposes some fundamental\nconstrains on external driving (or driving without feedback). In\ncontrast, Hamiltonian coupling sets the coupling strength and decay\nrates independently. While it would therefore appear that the\nHamiltonian coupling has the upper hand, and that one should strive\nfor the standard strong-coupling regime, we will show in the following\nthat the cascaded architecture can be superior to the other types of\ncoupling in some cases.\n\n\\section{Quantum Sources and Optical Targets}\n\\label{sec:lunnov30100948CET2015}\n\nThe general problem of excitation with quantum light has obviously\nnumerous ramifications. To the already large variety of optical\ntargets, one now has to combine a much enlarged set of quantum\nsources. This literally opens a new dimension to optics.  Indeed,\nclassical excitation could arguably be limited to a rather small set\nof categories:\n\n\\begin{enumerate}\n\\item[(a)] Coherent excitation (driving with a laser)\n\\item[(b)] Incoherent excitation (incoherent pumping, Boltzmann\n  dynamics, thermal baths, equilibrium, etc.)\n\\end{enumerate}\n\n(we postpone to part~V the discussion of time-dependent and pulsed\nexcitation and consider until then the case of continuous wave\nexcitation, cf.~Section~\\ref{sec:jueoct29112601CET2015}). Quantum\nlight, on the other hand, encompasses not only the above---if only\nbecause it is a more general case that includes classical excitation\nas a particular case---but also comes with many more and higher\ndegrees of freedom. This did not lead so far, to the best of our\nknowledge, to a classification. Tentatively, this could be provided in\na first approximation by~$g^{(2)}$ (antibunching, uncorrelated,\nbunching, superbunching). Since squeezed states have the correlations\nof coherent states, however, and they are precisely the type of input\nthat motivated a new formalism, it is clear that this is still far\nfrom appropriate. We decided to approach this general problem by\nconsidering:\n\n\\begin{itemize}\n\\addtolength{\\itemsep}{-0.5\\baselineskip}\n\\item the same optical target (here an harmonic oscillator, in the next\n  paper a two-level system),\n\\item the same type of quantum source (here and in the next paper, a SPS, in the third paper, an $N$-photon emitter),\n\\item both coherent and incoherent regimes,\n\\item both low and high pumping.\n\\end{itemize}\n\n\\begin{table*}[thpb]\n  \\begin{ruledtabular}\n    \\begin{tabular}{l|c|c|c|c|c}\n      Source & Pumping & Population~$n_\\sigma$ & $g_\\sigma^{(2)}(\\tau)$ & Lineshape & Linewidth \\\\\n      \\hline\n      Incoherent SPS & $P_\\sigma$ & $P_\\sigma/(\\gamma_\\sigma+P_\\sigma)$ & $1-\\exp\\big(-(\\gamma_\\sigma+P_\\sigma)\\tau\\big)$ & Lorentzian & $\\gamma_\\sigma+P_\\sigma$ \\\\\n      Coherent SPS & small $\\Omega_\\sigma$ & $4\\Omega_\\sigma^2/\\gamma_\\sigma^2$ & $(1-\\exp(-\\gamma_\\sigma\\tau/2))^2$ & Lorentzian & $\\gamma_\\sigma$ \\\\\n      Coherent SPS & large $\\Omega_\\sigma$ & $4\\Omega_\\sigma^2/(\\gamma_\\sigma^2+8\\Omega_\\sigma^2)$ & $\\displaystyle 1-e^{-\\frac{3\\gamma_\\sigma\\tau}{4}}\\Big[\\cosh(\\frac{\\Gamma_\\sigma\\tau}{4})+\\frac{3\\gamma_\\sigma}{\\Gamma_\\sigma}\\sinh(\\frac{\\Gamma_\\sigma\\tau}{4})\\Big]$ & Triplet & $\\left\\{\\pbox{20cm}{$\\gamma_\\sigma$ (central)\\\\$3\\gamma_\\sigma/2$ (satellites)}\\right.$ \\\\\n    \\end{tabular}\n  \\end{ruledtabular}\n  \\caption{Characteristic of a SPS driven incoherently or coherently. In the latter case, for clarity, we also consider separately the low-driving intensity (middle row) from the general case (bottom row) that covers all pumpings, to highlight the strong qualitative features of the Mollow regime. \\label{tab:vieoct23142648CEST2015}}\n\\end{table*}\n\nThe SPS is a good starting point because it is the paradigm of quantum\nlight and is the most common light of this type in the\nlaboratory. Exciting the harmonic oscillator makes the problem both\nsimple and fundamental, so this is also a good starting point. While\nwe have considerably restrained the possibilities, there still remains\nmuch to be explored and the following will only address the main\nresults. The two types of excitations aforementionned~(a--b) yield\nquite different types of SPS, that are introduced in the beginning of\ntheir respective Sections, and are summarized in\ntable~\\ref{tab:vieoct23142648CEST2015}. Note that in the table, the\nlast row also includes the second one (which is the limit of small\npumping). They are however so distinct qualitatively that it is\nhelpful to think of them as separate sources. As we will show, the\nsecond row (small coherent pumping) leads to the best antibunching in\nthe target.\n\n\\section{Charting the Hilbert space}\n\\label{sec:lunnov30101947CET2015}\n\nPrior to considering which quantum states of the harmonic oscillator\none can access by exciting it with various types of SPS, one needs a\nroadmap to characterize all of the states at a glance. The Hilbert\nspace is a big place. Human's capacity of abstraction gives a\ndeceivingly simple picture of it. The canonical basis of Fock\nstates~$\\left| {n}\\right\\rangle$ with~$n\\in\\mathbb{N}$ provides a comprehensive and\nconcise map of the states in the harmonic oscillator's Hilbert\nspace~$\\mathcal{H}_\\infty$:\n\n\n", "index": 7, "text": "\\begin{equation}\n  \\label{eq:miÃ©oct21094346CEST2015}\n  \\left| {\\psi}\\right\\rangle=\\sum_{n=0}^\\infty\\alpha_n\\left| {n}\\right\\rangle\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\left|{\\psi}\\right\\rangle=\\sum_{n=0}^{\\infty}\\alpha_{n}\\left|{n}\\right\\rangle\\,,\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\">|</mo><mi>ψ</mi><mo>⟩</mo></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>α</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>n</mi><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\n\n\n\nThis allows the introduction of thermal states, for which\n$\\beta_{nm}=(1-\\theta)\\theta^n\\delta_{nm}$ for some reduced\ntemperature~$\\theta\\in[0,1]$. These two families can be united into a\nlarger class of ``cothermal~\\cite{laussy06a}'' states that interpolate\nbetween the two and describe, e.g., single-mode Bose condensates not\ntoo far from threshold. From there on, one essentially deals with\nquantum states of light with popular examples such as squeezed\nstates~\\cite{lvovsky_inbook15a}, cat states~\\cite{haroche_book06a},\netc., and other less popular such as binomial states~\\cite{stoler85a}\nor displaced Fock states~\\cite{nieto97a}. Such a zoology of states is\nfamiliar to every quantum physicist, but it fails to provide the\nsought mapping of the Hilbert space. In particular, it is restricted\nto known (and popular) cases and leaves most of\nEqs.~(\\ref{eq:miÃ©oct21094346CEST2015}--\\ref{eq:miÃ©oct21095538CEST2015})\nuncharted.\n\nWe introduce a map of the Hilbert space based on important observables\nfor the quantum state, namely, the $n$-th order correlation functions:\n\n\n", "itemtype": "equation", "pos": 21371, "prevtext": "\n\nwith~$\\alpha_n\\in\\mathbb{C}$ such that\n$\\sum_{n=0}^\\infty|\\alpha_n|^2=1$. This is as precise as it is\nmisleading, since this fails to provide a qualitative map of the possible\nstates. Instead, one uses families of particular cases. Beyond Fock\nstates per se, one makes a great use of the coherent states of\nclassical physics, for\nwhich~$\\alpha_n=\\alpha^n\\exp(-|\\alpha|^2)/\\sqrt{n!}$ for some complex\nnumber~$\\alpha$ that defines the amplitude and phase of a classical\nfield. The next family of important states requires the concept of\nmixity that involves statistical averages and upgrades the\nwavefunction to a density matrix:\n\n\n", "index": 9, "text": "\\begin{equation}\n  \\label{eq:miÃ©oct21095538CEST2015}\n  \\rho=\\sum_{n,m=0}^\\infty\\beta_{nm}\\left| {n}\\right\\rangle\\left\\langle {m}\\right|\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\rho=\\sum_{n,m=0}^{\\infty}\\beta_{nm}\\left|{n}\\right\\rangle\\left\\langle{m}%&#10;\\right|\\,.\" display=\"block\"><mrow><mrow><mi>ρ</mi><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msub><mi>β</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>n</mi><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mi>m</mi><mo fence=\"true\" rspace=\"4.2pt\">|</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nSince we consider only the quantum states and not their dynamics,\nnormalization makes $g^{(1)}$ trivially unity. We therefore use\ninstead the normalization itself, which is an important\nobservable---the population of the state (average number of\nexcitations)---and for which we introduce the notation:\n\n\n", "itemtype": "equation", "pos": 22606, "prevtext": "\n\n\n\n\nThis allows the introduction of thermal states, for which\n$\\beta_{nm}=(1-\\theta)\\theta^n\\delta_{nm}$ for some reduced\ntemperature~$\\theta\\in[0,1]$. These two families can be united into a\nlarger class of ``cothermal~\\cite{laussy06a}'' states that interpolate\nbetween the two and describe, e.g., single-mode Bose condensates not\ntoo far from threshold. From there on, one essentially deals with\nquantum states of light with popular examples such as squeezed\nstates~\\cite{lvovsky_inbook15a}, cat states~\\cite{haroche_book06a},\netc., and other less popular such as binomial states~\\cite{stoler85a}\nor displaced Fock states~\\cite{nieto97a}. Such a zoology of states is\nfamiliar to every quantum physicist, but it fails to provide the\nsought mapping of the Hilbert space. In particular, it is restricted\nto known (and popular) cases and leaves most of\nEqs.~(\\ref{eq:miÃ©oct21094346CEST2015}--\\ref{eq:miÃ©oct21095538CEST2015})\nuncharted.\n\nWe introduce a map of the Hilbert space based on important observables\nfor the quantum state, namely, the $n$-th order correlation functions:\n\n\n", "index": 11, "text": "\\begin{equation}\n\\label{eq:jueoct29094202CET2015}\ng^{(n)}=\\frac{\\langle a^{\\dagger n}a^n\\rangle}{\\langle{{a}^{\\dagger}}a\\rangle^n}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"g^{(n)}=\\frac{\\langle a^{\\dagger n}a^{n}\\rangle}{\\langle{{a}^{\\dagger}}a%&#10;\\rangle^{n}}\\,.\" display=\"block\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi>a</mi><mrow><mi/><mo>†</mo><mi>n</mi></mrow></msup><mo>⁢</mo><msup><mi>a</mi><mi>n</mi></msup></mrow><mo stretchy=\"false\">⟩</mo></mrow><msup><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi>a</mi><mo>†</mo></msup><mo>⁢</mo><mi>a</mi></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>n</mi></msup></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nNote that only the diagonal elements~$p(m)=|\\alpha_m|^2$ are needed so\nthere is no distinction between pure and mixed states in this\ndiscussion. The $n$-th order correlators read:\n\n\n", "itemtype": "equation", "pos": 23059, "prevtext": "\n\nSince we consider only the quantum states and not their dynamics,\nnormalization makes $g^{(1)}$ trivially unity. We therefore use\ninstead the normalization itself, which is an important\nobservable---the population of the state (average number of\nexcitations)---and for which we introduce the notation:\n\n\n", "index": 13, "text": "\\begin{equation}\n  \\label{eq:jueoct29094507CET2015}\n  n_a\\equiv\\langle{{a}^{\\dagger}}a\\rangle\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"n_{a}\\equiv\\langle{{a}^{\\dagger}}a\\rangle\\,.\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>≡</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi>a</mi><mo>†</mo></msup><mo>⁢</mo><mi>a</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nA convenient mapping of the Hilbert space is to chart it with the\n$n_a$ and $g^{(2)}$ ``rulers'', that is, tag the possible quantum\nstates through their joint statistical properties and population. The\nvalue of~$g^{(2)}$ allows to tell apart classical from quantum states\ndepending on whether $g^{(2)}$ is larger (bunching) or smaller\n(antibunching) than unity. This is meant in the sense of whether a\nclassical, possibly stochastic, description is possible, or whether\nsome ``quantum'' features such as violation of Cauchy--Schwarz\ninequalities or negative probabilities in the phase space are\nmanifest. The population gives another meaning to quantumness, in the\nsense of few-particle effects vs macroscopic occupation. It is\ntherefore particularly interesting to contrast these two attributes\nand consider, e.g., highly occupied genuinely quantum states.  There\nis a physical limit to such states and for populations~$n_a>1$, some\nvalues of antibunching are out of reach.  This is expected on physical\ngrounds from familiar features of the Fock states popularly known as\nbeing the ``most quantum'' states, with their $g^{(2)}$ tending to one\nas the number of excitations increases. Also, macroscopic quantum\nstates, such as a BEC, are essentially coherent states in most\nformulations. Here we make this notion precise by providing the\ncomplete picture, in Fig.~\\ref{fig:miÃ©nov25113249CET2015}, along with\nthe closed-form expression for the boundary that separates accessible\ncombinations from impossible ones (this is proved in\nAppendix~\\ref{sec:marnov24122827CET2015}):\n\n\n", "itemtype": "equation", "pos": 23353, "prevtext": "\n\nNote that only the diagonal elements~$p(m)=|\\alpha_m|^2$ are needed so\nthere is no distinction between pure and mixed states in this\ndiscussion. The $n$-th order correlators read:\n\n\n", "index": 15, "text": "\\begin{equation}\n  \\label{eq:jueoct29095412CET2015}\n  g^{(n)}=\\frac{\\sum_{m=0}^\\infty m!p(m)/(m-n)!}{\\big(\\sum_{m=0}^\\infty mp(m)\\big)^n}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"g^{(n)}=\\frac{\\sum_{m=0}^{\\infty}m!p(m)/(m-n)!}{\\big{(}\\sum_{m=0}^{\\infty}mp(m%&#10;)\\big{)}^{n}}\\,.\" display=\"block\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mrow><mrow><mi>m</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>m</mi><mo>-</mo><mi>n</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mrow></mrow><msup><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>0</mn></mrow><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mi>m</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow><mi>n</mi></msup></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nThis boundary is provided by superpositions of contiguous Fock states,\ni.e., of the type:\n\n\n", "itemtype": "equation", "pos": 25086, "prevtext": "\n\nA convenient mapping of the Hilbert space is to chart it with the\n$n_a$ and $g^{(2)}$ ``rulers'', that is, tag the possible quantum\nstates through their joint statistical properties and population. The\nvalue of~$g^{(2)}$ allows to tell apart classical from quantum states\ndepending on whether $g^{(2)}$ is larger (bunching) or smaller\n(antibunching) than unity. This is meant in the sense of whether a\nclassical, possibly stochastic, description is possible, or whether\nsome ``quantum'' features such as violation of Cauchy--Schwarz\ninequalities or negative probabilities in the phase space are\nmanifest. The population gives another meaning to quantumness, in the\nsense of few-particle effects vs macroscopic occupation. It is\ntherefore particularly interesting to contrast these two attributes\nand consider, e.g., highly occupied genuinely quantum states.  There\nis a physical limit to such states and for populations~$n_a>1$, some\nvalues of antibunching are out of reach.  This is expected on physical\ngrounds from familiar features of the Fock states popularly known as\nbeing the ``most quantum'' states, with their $g^{(2)}$ tending to one\nas the number of excitations increases. Also, macroscopic quantum\nstates, such as a BEC, are essentially coherent states in most\nformulations. Here we make this notion precise by providing the\ncomplete picture, in Fig.~\\ref{fig:miÃ©nov25113249CET2015}, along with\nthe closed-form expression for the boundary that separates accessible\ncombinations from impossible ones (this is proved in\nAppendix~\\ref{sec:marnov24122827CET2015}):\n\n\n", "index": 17, "text": "\\begin{equation}\n  \\label{eq:miÃ©oct21181551CEST2015}\n  g^{(2)}=\\frac{\\lfloor n_a\\rfloor(2n_a-\\lfloor n_a\\rfloor-1)}{n_a^2}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"g^{(2)}=\\frac{\\lfloor n_{a}\\rfloor(2n_{a}-\\lfloor n_{a}\\rfloor-1)}{n_{a}^{2}}\\,.\" display=\"block\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msubsup><mi>n</mi><mi>a</mi><mn>2</mn></msubsup></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nfor~$n\\in\\mathbb{N}$, $p(n)\\in[0,1]$ and~$\\theta\\in[0,2\\pi[$ an\n(irrelevant) phase. (As already commented, this includes also mixed\nstates of the type $p(n)\\left| {n}\\right\\rangle\\left\\langle {n}\\right|+(1-p(n))\\left| {n+1}\\right\\rangle\\left\\langle {n+1}\\right|$ and\nall others with the same diagonal but different off-diagonal\nelements. We will not make this distinction anymore in the following.)\nWe call these states, Eq.~(\\ref{eq:marnov24092156CET2015}),\n``\\emph{Fock duos}''.  They set the continuous lower limit of the\nspace of available quantum states in our charted Hilbert space. Their\nantibunching~(\\ref{eq:miÃ©oct21181551CEST2015}) is a generalization to\nnon-integer~$n_a$ of the formula $g^{(2)}=1-1/n_a\n$ for the Fock state~$\\left| {n_a}\\right\\rangle$ to which it reduces\nfor~$n_a\\in\\mathbb{N}$.  It shows that the popular ``single-particle\ncriterion'' that asserts that $g^{(2)}<0.5$ ensures a one particle\nstate~\\cite{michler00a,dong07a,verma11a,dimartino12a,leifgen14a} is\nwrong, as demonstrated, e.g., for the case~$n_a=1.5$ for which\n$g^{(2)}=4/9\\approx0.44$.  The generalization to higher orders is\nstraigthforward. Namely, the $n$th-order correlation frontier for\nreal~$n_a$ is given by:\n\n\n", "itemtype": "equation", "pos": 25320, "prevtext": "\n\nThis boundary is provided by superpositions of contiguous Fock states,\ni.e., of the type:\n\n\n", "index": 19, "text": "\\begin{equation}\n  \\label{eq:marnov24092156CET2015}\n  \\sqrt{p(n)}\\left| {n}\\right\\rangle+\\sqrt{1-p(n)}e^{i\\theta}\\left| {n+1}\\right\\rangle\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\sqrt{p(n)}\\left|{n}\\right\\rangle+\\sqrt{1-p(n)}e^{i\\theta}\\left|{n+1}\\right%&#10;\\rangle\\,,\" display=\"block\"><mrow><mrow><mrow><msqrt><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>n</mi><mo>⟩</mo></mrow></mrow><mo>+</mo><mrow><msqrt><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>θ</mi></mrow></msup><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nthat generalizes the Fock state formula $g^{(n)}=(1/n_a^n)m!/(m-n_a)!$\nvalid for integer~$n_a$ where it agrees with\nEq.~(\\ref{eq:jueoct29102628CET2015}). Interestingly, the lower limit\nis also set, for all~$n$, by Fock duos (not ``$n$-plets'').\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig7.pdf}\n  \\caption{(Color online). Charting the Hilbert space. The shaded area\n    shows the region where a physical quantum state exist with the\n    corresponding joint population and antibunching. It is delimited\n    by the boundary Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}) of ``Fock\n    duos'', defined by Eq.~(\\ref{eq:marnov24092156CET2015}).  Higher\n    order correlators (thin dashed) set other boundaries, also\n    delimited by Fock duos.}\n  \\label{fig:miÃ©nov25113249CET2015}\n\\end{figure}\n\nOne can also consider other charts of the Hilbert space, such as\n$(g^{(2)}, g^{(3)})$, this time contrasting two- and three-particle\ncorrelations together. This time there are no boundaries in this space\n(one can find state with any joint values of $g^{(2)}$ and\n$g^{(3)}$). The proof of this statement is left to the reader. Since\nthe excitation of an harmonic oscillator by the SPS leads to strong\ncorrelations between various $g^{(n)}$, we will focus on the\n$(n_a,g^{(2)})$ space.\n\n\\section{Exciting with an Incoherent SPS}\n\\label{sec:vieoct23172746CEST2015}\n\nNow that we can conveniently characterize the states that we can\nexcite, we come back to the dynamical problem of the quantum driving\nof an harmonic oscillator and how close can one get to the limit set\nby Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}).  We first consider the case\nof excitation with an incoherent SPS, i.e., where the two-level system\n(2LS) that acts as the source, is itself driven incoherently, as\nsketched in Fig.~\\ref{fig:jueoct29162857CET2015}(c). Namely, there is\na constant rate~$P_\\sigma$ at which the 2LS is put in its excited\nstate, and is otherwise left to decay. The system is thus described by\nthe master\nequations~(\\ref{Eq.MasterEquationNormal}--\\ref{Eq.MasterEquationCascaded}),\nwith $c_1=\\sigma$ the 2LS and $c_2=a$ the harmonic oscillator\nannihilation operators, respectively. The 2LS pumping is described by\na Lindblad term $(P_\\sigma/2)\\mathcal{L}_{{{\\sigma}^{\\dagger}}}\\rho$. Thanks to\nthe absence of feedback, the dynamics is ruled by closed equations\nwhich allows us to obtain exact solutions for the observables of\ninterest. Namely, we find that the cavity population~$n_a$ and\nstatistics~$g^{(2)}$ of the target are given by\n(cf.~Table~\\ref{tab:vieoct23142648CEST2015} for the source):\n\n\\begin{subequations}\n  \\label{eq:juedic17123703CET2015}\n  \n", "itemtype": "equation", "pos": 26687, "prevtext": "\n\nfor~$n\\in\\mathbb{N}$, $p(n)\\in[0,1]$ and~$\\theta\\in[0,2\\pi[$ an\n(irrelevant) phase. (As already commented, this includes also mixed\nstates of the type $p(n)\\left| {n}\\right\\rangle\\left\\langle {n}\\right|+(1-p(n))\\left| {n+1}\\right\\rangle\\left\\langle {n+1}\\right|$ and\nall others with the same diagonal but different off-diagonal\nelements. We will not make this distinction anymore in the following.)\nWe call these states, Eq.~(\\ref{eq:marnov24092156CET2015}),\n``\\emph{Fock duos}''.  They set the continuous lower limit of the\nspace of available quantum states in our charted Hilbert space. Their\nantibunching~(\\ref{eq:miÃ©oct21181551CEST2015}) is a generalization to\nnon-integer~$n_a$ of the formula $g^{(2)}=1-1/n_a\n$ for the Fock state~$\\left| {n_a}\\right\\rangle$ to which it reduces\nfor~$n_a\\in\\mathbb{N}$.  It shows that the popular ``single-particle\ncriterion'' that asserts that $g^{(2)}<0.5$ ensures a one particle\nstate~\\cite{michler00a,dong07a,verma11a,dimartino12a,leifgen14a} is\nwrong, as demonstrated, e.g., for the case~$n_a=1.5$ for which\n$g^{(2)}=4/9\\approx0.44$.  The generalization to higher orders is\nstraigthforward. Namely, the $n$th-order correlation frontier for\nreal~$n_a$ is given by:\n\n\n", "index": 21, "text": "\\begin{equation}\n  \\label{eq:jueoct29102628CET2015}\n  g^{(n)} =\\frac{\\lfloor n_a\\rfloor!}{(\\lfloor n_a\\rfloor-n)!n_a^n}\\left [1+\\frac{n(n_a-\\lfloor n_a\\rfloor)}{\\lfloor n_a\\rfloor+1-n} \\right ]\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"g^{(n)}=\\frac{\\lfloor n_{a}\\rfloor!}{(\\lfloor n_{a}\\rfloor-n)!n_{a}^{n}}\\left[%&#10;1+\\frac{n(n_{a}-\\lfloor n_{a}\\rfloor)}{\\lfloor n_{a}\\rfloor+1-n}\\right]\\,,\" display=\"block\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mfrac><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><mi>n</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mo>⁢</mo><msubsup><mi>n</mi><mi>a</mi><mi>n</mi></msubsup></mrow></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo>-</mo><mi>n</mi></mrow></mfrac></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\\end{subequations}\n\nOnly two parameters are required to describe fully the system: i)~the\nratio between the decay rate of the cavity and the emission rate of\nthe 2LS, $\\gamma_a/\\gamma_\\sigma$, and ii)~the intensity (or pumping\nrate) of the 2LS, $P_\\sigma$, also normalized to $\\gamma_\\sigma$ to\nkeep the parameters dimensionless. Eliminating~$P_\\sigma$ from\nEqs.~(\\ref{eq:juedic17123703CET2015}), this gives the equation for the\ntrajectory in the $(n_a,g^{(2)})$ space as function of the\nparameter~$\\gamma_a/\\gamma_\\sigma$:\n\n\n", "itemtype": "equation", "pos": 29550, "prevtext": "\n\nthat generalizes the Fock state formula $g^{(n)}=(1/n_a^n)m!/(m-n_a)!$\nvalid for integer~$n_a$ where it agrees with\nEq.~(\\ref{eq:jueoct29102628CET2015}). Interestingly, the lower limit\nis also set, for all~$n$, by Fock duos (not ``$n$-plets'').\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig7.pdf}\n  \\caption{(Color online). Charting the Hilbert space. The shaded area\n    shows the region where a physical quantum state exist with the\n    corresponding joint population and antibunching. It is delimited\n    by the boundary Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}) of ``Fock\n    duos'', defined by Eq.~(\\ref{eq:marnov24092156CET2015}).  Higher\n    order correlators (thin dashed) set other boundaries, also\n    delimited by Fock duos.}\n  \\label{fig:miÃ©nov25113249CET2015}\n\\end{figure}\n\nOne can also consider other charts of the Hilbert space, such as\n$(g^{(2)}, g^{(3)})$, this time contrasting two- and three-particle\ncorrelations together. This time there are no boundaries in this space\n(one can find state with any joint values of $g^{(2)}$ and\n$g^{(3)}$). The proof of this statement is left to the reader. Since\nthe excitation of an harmonic oscillator by the SPS leads to strong\ncorrelations between various $g^{(n)}$, we will focus on the\n$(n_a,g^{(2)})$ space.\n\n\\section{Exciting with an Incoherent SPS}\n\\label{sec:vieoct23172746CEST2015}\n\nNow that we can conveniently characterize the states that we can\nexcite, we come back to the dynamical problem of the quantum driving\nof an harmonic oscillator and how close can one get to the limit set\nby Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}).  We first consider the case\nof excitation with an incoherent SPS, i.e., where the two-level system\n(2LS) that acts as the source, is itself driven incoherently, as\nsketched in Fig.~\\ref{fig:jueoct29162857CET2015}(c). Namely, there is\na constant rate~$P_\\sigma$ at which the 2LS is put in its excited\nstate, and is otherwise left to decay. The system is thus described by\nthe master\nequations~(\\ref{Eq.MasterEquationNormal}--\\ref{Eq.MasterEquationCascaded}),\nwith $c_1=\\sigma$ the 2LS and $c_2=a$ the harmonic oscillator\nannihilation operators, respectively. The 2LS pumping is described by\na Lindblad term $(P_\\sigma/2)\\mathcal{L}_{{{\\sigma}^{\\dagger}}}\\rho$. Thanks to\nthe absence of feedback, the dynamics is ruled by closed equations\nwhich allows us to obtain exact solutions for the observables of\ninterest. Namely, we find that the cavity population~$n_a$ and\nstatistics~$g^{(2)}$ of the target are given by\n(cf.~Table~\\ref{tab:vieoct23142648CEST2015} for the source):\n\n\\begin{subequations}\n  \\label{eq:juedic17123703CET2015}\n  \n", "index": 23, "text": "\\begin{align}\n    n_a &= \\frac{4 P_\\sigma \\gamma_\\sigma}{(\\gamma_\\sigma+P_\\sigma)(\n        \\gamma_\\sigma+P_\\sigma+\\gamma_a)}\\,,\\label{eq:vieene15123031CET2016}\\\\\n    g^{(2)} &=\n    \\frac{2(\\gamma_\\sigma+P_\\sigma)}{\\gamma_\\sigma+P_\\sigma+3\\gamma_a}\\,.\\label{eq:vieene15123037CET2016}\n  \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle n_{a}\" display=\"inline\"><msub><mi>n</mi><mi>a</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{4P_{\\sigma}\\gamma_{\\sigma}}{(\\gamma_{\\sigma}+P_{\\sigma})(%&#10;\\gamma_{\\sigma}+P_{\\sigma}+\\gamma_{a})}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mn>4</mn><mo>⁢</mo><msub><mi>P</mi><mi>σ</mi></msub><mo>⁢</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>P</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>P</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>γ</mi><mi>a</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle g^{(2)}\" display=\"inline\"><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{2(\\gamma_{\\sigma}+P_{\\sigma})}{\\gamma_{\\sigma}+P_{\\sigma}+%&#10;3\\gamma_{a}}\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>P</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>γ</mi><mi>σ</mi></msub><mo>+</mo><msub><mi>P</mi><mi>σ</mi></msub><mo>+</mo><mrow><mn>3</mn><mo>⁢</mo><msub><mi>γ</mi><mi>a</mi></msub></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nThese trajectories in the Hilbert space are plotted in\nFig.~\\ref{fig:juedic17170852CET2015}. The curves start from the point\n\n\n", "itemtype": "equation", "pos": 30372, "prevtext": "\n\\end{subequations}\n\nOnly two parameters are required to describe fully the system: i)~the\nratio between the decay rate of the cavity and the emission rate of\nthe 2LS, $\\gamma_a/\\gamma_\\sigma$, and ii)~the intensity (or pumping\nrate) of the 2LS, $P_\\sigma$, also normalized to $\\gamma_\\sigma$ to\nkeep the parameters dimensionless. Eliminating~$P_\\sigma$ from\nEqs.~(\\ref{eq:juedic17123703CET2015}), this gives the equation for the\ntrajectory in the $(n_a,g^{(2)})$ space as function of the\nparameter~$\\gamma_a/\\gamma_\\sigma$:\n\n\n", "index": 25, "text": "\\begin{equation}\n  \\label{eq:juedic17155545CET2015}\n  n_a=\\frac23\\frac{(2-g^{(2)})(3g^{(2)}(\\gamma_a/\\gamma_\\sigma)-(2-g^{(2)}))}{g^{(2)}(1+g^{(2)})(\\gamma_a/\\gamma_\\sigma)}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"n_{a}=\\frac{2}{3}\\frac{(2-g^{(2)})(3g^{(2)}(\\gamma_{a}/\\gamma_{\\sigma})-(2-g^{%&#10;(2)}))}{g^{(2)}(1+g^{(2)})(\\gamma_{a}/\\gamma_{\\sigma})}\\,.\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mrow><mfrac><mn>2</mn><mn>3</mn></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>-</mo><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>-</mo><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nat vanishing pumping, reach a turning point with coordinates:\n\n\n", "itemtype": "equation", "pos": 30691, "prevtext": "\n\nThese trajectories in the Hilbert space are plotted in\nFig.~\\ref{fig:juedic17170852CET2015}. The curves start from the point\n\n\n", "index": 27, "text": "\\begin{equation}\n  \\label{eq:juedic17173145CET2015}\n  \\left(n_a=0,g^{(2)}=\\frac{2}{1+3\\gamma_a/\\gamma_\\sigma}\\right)\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\left(n_{a}=0,g^{(2)}=\\frac{2}{1+3\\gamma_{a}/\\gamma_{\\sigma}}\\right)\\,,\" display=\"block\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mn>0</mn></mrow><mo>,</mo><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mfrac><mn>2</mn><mrow><mn>1</mn><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><msub><mi>γ</mi><mi>a</mi></msub></mrow><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow></mfrac></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nwhen $P_\\sigma=\\sqrt{\\gamma_\\sigma (\\gamma_a + \\gamma_\\sigma)}$ and\nconverge at~$(n_a=0,g^{(2)}=2)$ at large pumpings, where the source\ngets quenched. For each value of~$\\gamma_a/\\gamma_\\sigma$, there are\ntwo values of pumping that result in the same population but two\nvalues of~$g^{(2)}$.  The curve of\nEq.~(\\ref{eq:juedic17155545CET2015}) is fairly constant till the\nturning point and, from Eq.~(\\ref{eq:juedic17173145CET2015}), leads to\na genuine quantum state (i.e., featuring antibunching) as long\nas~$\\gamma_a/\\gamma_\\sigma>1/3$, which means that one can imprint\nantibunching in a system with a substantially longer lifetime.  The\noptimum antibunching/population for a given $\\gamma_a/\\gamma_\\sigma$\nis achieved slightly earlier than the turning point, namely, when\n$P_\\sigma = \\gamma_\\sigma$. The envelope of all the curves in\nFig.~\\ref{fig:juedic17170852CET2015} is the closest one can get to the\nFock-duos limit, and is given by $g^{(2)} = 2 n_a /(3-2n_a)$. This is\nthe thick dark green line in Fig.~\\ref{fig:juedic17170852CET2015}.\n\n\\begin{figure}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig9.pdf}\n    \\caption{(Color online). Trajectories in the Hilbert space charted\n      by~$n_a$ and~$g^{(2)}$ for the states excited by an incoherent\n      SPS, for various values of~$\\gamma_a/\\gamma_\\sigma$. The\n      implicit parameter is pumping. Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-1}$ (blue), 1 (green), 10\n      (yellow) and $10^2$ (red). The dark green thick envelope shows\n      the closest one can get in this configuration to the ideal\n      antibunching, which is zero. All the states, and only these\n      states, above this line and below~$g^{(2)}=2$, are accessible\n      with an incoherent SPS.}\n  \\label{fig:juedic17170852CET2015}\n\\end{figure}\n\n\\begin{figure*}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig1a.pdf}\n    \\caption{(Color online). Upper row: Populations (isolines) and\n      $g^{(2)}$ (color) of the target excited by an incoherent SPS,\n      through (a) the cascaded coupling or (b,c) the Hamiltonian\n      coupling with (b) and without (c) decay of the 2LS. (d) Minimum\n      $g^{(2)}$ that can be reached at a given population for all\n      these cases.  The color circles mark the parameters\n      $P_\\sigma/\\gamma_\\sigma$ and $\\gamma_a/\\gamma_\\sigma$ at which\n      the population isoline meets the minimum $g^{(2)}$.  Lower row:\n      Same but for a coherent SPS, with (e) the cascaded coupling and\n      (f,g) the Hamiltonian coupling with (f) and without (g) decay of\n      the 2LS.  (h) Minimum $g^{(2)}$ that can be reached at a given\n      population for all these cases. The color circles mark the\n      parameters $\\Omega_\\sigma/\\gamma_\\sigma$ and $\\gamma_a\n      /\\gamma_\\sigma$ at which the population isoline meets the\n      minimum $g^{(2)}$.}\n  \\label{fig1}\n\\end{figure*}\n\nThe above solution gives an already substantial description of the\nresponse of an harmonic oscillator to an incoherent SPS. We can\ncomplement it with alternative descriptions that approach the solution\nfrom different viewpoints and manifest the advantage of cascaded\ncoupling over other types of excitation. A natural comparison is with\nthe standard Hamiltonian coupling, that is the usual way to couple\ndifferent systems.  For instance, it is convenient to lay out the\nobservables as function of the parameters in 2D~density, as shown in\nthe upper row of Fig.~\\ref{fig1}. Panels~(a--c) show the photon\nstatistics (color code) and the population of the cavity (isolines)\nusing the (a) cascaded coupling and (b, c) the Hamiltonian\ncoupling. For the later case, we consider two configurations: (b) when\nthe 2LS has the same decay term as when acting as a source in the\ncascaded scheme, and (c) when the 2LS has no decay term, so that all\nits excitation is directed towards the cavity, corresponding to the\nideal excitation of the cascaded scheme. Interestingly, (a) and~(b)\ntypes of excitation present a qualitatively similar photon statistics\nlayout, but the topography of the resulting population yields largely\ndiffering states, as evident once reported in the $(n_a,g^{(2)})$\nspace, panel~(d).  The color circles along the isolines mark the\npoints with strongest antibunching (i.e., smallest~$g^{(2)}$) for a\ngiven population. It is seen that for a given signal, the antibunching\nis significantly larger with the cascaded coupling. In both cases the\nantibunching is marred before the cavity population reaches one photon\non average. At larger populations, the photon statistics of the cavity\nbecome bunched, i.e., $g^{(2)}=2$.  On can contemplate other\nconfigurations but they result in worse results: detuning the cavity\nfrom the 2LS leaves the photon statistics unchanged, but\nreduces the population of the cavity, so the antibunching in lost at\neven smaller cavity populations. Dephasing the 2LS\nincreases the broadening of the emission peak, but also drives the\ncavity towards a coherent state faster.  Hamiltonian coupling with no\ndecay of the 2LS, case~(c), differs qualitatively from the former\ncases and provides a substantially better antibunching than\nHamiltonian coupling with decay of the 2LS. It even becomes better\nthan the cascaded coupling when $n_a\\gtrsim 2/3$.  This situation can\nbe much improved with the coherent SPS.\n\n\\begin{figure*}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig8-fabrice.pdf}\n    \\caption{(Color online). Same as\n      Fig.~\\ref{fig:juedic17170852CET2015} but for the excitation from\n      a coherent SPS. In (a,c) the implicit parameter is pumping and\n      the green line shows the closest one can get from the Fock-duos\n      limit from the case at resonance.  In~(d) the implicit parameter\n      is the detuning between the source and its target. (a) Exciting\n      at resonance. The optimum antibunching is the envelope in this\n      configuration of the family of curves varying\n      with~$\\gamma_a/\\gamma_\\sigma$.  Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-2}$ (blue), $10^{-1}$\n      (green), 1 (chartreuse), 10 (yellow) and $10^2$ (red).  (b-d)\n      Exciting in other configurations, namely (b) with the leapfrog\n      processes, (c) with the satellite and (d) as a function of\n      frequency. Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-1}$ (blue), $0.5$\n      (chartreuse), 1 (green), 5 (orange) and $10$ (red). The\n      dashed-dotted line in panel (b) and the dashed line in panel (c)\n      show the limit of large intensities and are merely a visual aid\n      rather than a physical boundary. They are also shown in\n      panel~(d), along with the black solid line for the envelope of\n      the curves at $\\omega_a=\\omega_\\sigma$. }\n  \\label{fig:domnov29120929CET2015}\n\\end{figure*}\n\n\\section{Exciting with a Coherent SPS}\n\\label{sec:marnov24163921CET2015}\n\nWe now consider excitation by a coherent SPS, i.e., when the 2LS that\nacts as the source is driven coherently by an external laser, as\nsketched in Fig.~\\ref{fig:jueoct29162857CET2015}~d). This driving is\ndescribed by the Hamiltonian:\n\n\n", "itemtype": "equation", "pos": 30890, "prevtext": "\n\nat vanishing pumping, reach a turning point with coordinates:\n\n\n", "index": 29, "text": "\\begin{multline}\n  \\label{eq:juedic17174537CET2015}\n  \\left(n_a=\\frac{4(2+(\\gamma_a/\\gamma_\\sigma)-2\\sqrt{1+(\\gamma_a/\\gamma_\\sigma)})}{(\\gamma_a/\\gamma_\\sigma)^2},\\right.\\\\\n  \\left.g^{(2)}=\\frac{2}{3\\sqrt{1+\\gamma_a/\\gamma_\\sigma}-2}\\right)\\,,\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\left(n_{a}=\\frac{4(2+(\\gamma_{a}/\\gamma_{\\sigma})-2\\sqrt{1+(%&#10;\\gamma_{a}/\\gamma_{\\sigma})})}{(\\gamma_{a}/\\gamma_{\\sigma})^{2}},\\right.\\\\&#10;\\displaystyle\\left.g^{(2)}=\\frac{2}{3\\sqrt{1+\\gamma_{a}/\\gamma_{\\sigma}}-2}%&#10;\\right)\\,,\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mo>(</mo><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msqrt><mrow><mn>1</mn><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mfrac><mn>2</mn><mrow><mrow><mn>3</mn><mo>⁢</mo><msqrt><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow></msqrt></mrow><mo>-</mo><mn>2</mn></mrow></mfrac><mo rspace=\"4.2pt\">)</mo><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": " \n\nwhere $\\omega_\\sigma$ is the energy of the 2LS, and\n$\\omega_\\mathrm{L}$ and $\\Omega_\\sigma$ are the frequency and\nintensity of the driving laser, respectively.  The system is otherwise\nstill described by the master\nequations~(\\ref{Eq.MasterEquationNormal}--\\ref{Eq.MasterEquationCascaded}),\nwith $c_1=\\sigma$ the 2LS (source) and $c_2=a$ the harmonic oscillator\n(target). Here again, one can obtain the cavity observables in\nclosed-form, although it takes slightly more cumbersome\nexpressions. At resonance (out-of resonance cases can also be obtained\nbut get even more bulky):\n\n\\begin{widetext}\n  \\begin{subequations}\n    \\label{eq:juedic17152741CET2015}\n    \n", "itemtype": "equation", "pos": -1, "prevtext": "\n\nwhen $P_\\sigma=\\sqrt{\\gamma_\\sigma (\\gamma_a + \\gamma_\\sigma)}$ and\nconverge at~$(n_a=0,g^{(2)}=2)$ at large pumpings, where the source\ngets quenched. For each value of~$\\gamma_a/\\gamma_\\sigma$, there are\ntwo values of pumping that result in the same population but two\nvalues of~$g^{(2)}$.  The curve of\nEq.~(\\ref{eq:juedic17155545CET2015}) is fairly constant till the\nturning point and, from Eq.~(\\ref{eq:juedic17173145CET2015}), leads to\na genuine quantum state (i.e., featuring antibunching) as long\nas~$\\gamma_a/\\gamma_\\sigma>1/3$, which means that one can imprint\nantibunching in a system with a substantially longer lifetime.  The\noptimum antibunching/population for a given $\\gamma_a/\\gamma_\\sigma$\nis achieved slightly earlier than the turning point, namely, when\n$P_\\sigma = \\gamma_\\sigma$. The envelope of all the curves in\nFig.~\\ref{fig:juedic17170852CET2015} is the closest one can get to the\nFock-duos limit, and is given by $g^{(2)} = 2 n_a /(3-2n_a)$. This is\nthe thick dark green line in Fig.~\\ref{fig:juedic17170852CET2015}.\n\n\\begin{figure}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig9.pdf}\n    \\caption{(Color online). Trajectories in the Hilbert space charted\n      by~$n_a$ and~$g^{(2)}$ for the states excited by an incoherent\n      SPS, for various values of~$\\gamma_a/\\gamma_\\sigma$. The\n      implicit parameter is pumping. Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-1}$ (blue), 1 (green), 10\n      (yellow) and $10^2$ (red). The dark green thick envelope shows\n      the closest one can get in this configuration to the ideal\n      antibunching, which is zero. All the states, and only these\n      states, above this line and below~$g^{(2)}=2$, are accessible\n      with an incoherent SPS.}\n  \\label{fig:juedic17170852CET2015}\n\\end{figure}\n\n\\begin{figure*}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig1a.pdf}\n    \\caption{(Color online). Upper row: Populations (isolines) and\n      $g^{(2)}$ (color) of the target excited by an incoherent SPS,\n      through (a) the cascaded coupling or (b,c) the Hamiltonian\n      coupling with (b) and without (c) decay of the 2LS. (d) Minimum\n      $g^{(2)}$ that can be reached at a given population for all\n      these cases.  The color circles mark the parameters\n      $P_\\sigma/\\gamma_\\sigma$ and $\\gamma_a/\\gamma_\\sigma$ at which\n      the population isoline meets the minimum $g^{(2)}$.  Lower row:\n      Same but for a coherent SPS, with (e) the cascaded coupling and\n      (f,g) the Hamiltonian coupling with (f) and without (g) decay of\n      the 2LS.  (h) Minimum $g^{(2)}$ that can be reached at a given\n      population for all these cases. The color circles mark the\n      parameters $\\Omega_\\sigma/\\gamma_\\sigma$ and $\\gamma_a\n      /\\gamma_\\sigma$ at which the population isoline meets the\n      minimum $g^{(2)}$.}\n  \\label{fig1}\n\\end{figure*}\n\nThe above solution gives an already substantial description of the\nresponse of an harmonic oscillator to an incoherent SPS. We can\ncomplement it with alternative descriptions that approach the solution\nfrom different viewpoints and manifest the advantage of cascaded\ncoupling over other types of excitation. A natural comparison is with\nthe standard Hamiltonian coupling, that is the usual way to couple\ndifferent systems.  For instance, it is convenient to lay out the\nobservables as function of the parameters in 2D~density, as shown in\nthe upper row of Fig.~\\ref{fig1}. Panels~(a--c) show the photon\nstatistics (color code) and the population of the cavity (isolines)\nusing the (a) cascaded coupling and (b, c) the Hamiltonian\ncoupling. For the later case, we consider two configurations: (b) when\nthe 2LS has the same decay term as when acting as a source in the\ncascaded scheme, and (c) when the 2LS has no decay term, so that all\nits excitation is directed towards the cavity, corresponding to the\nideal excitation of the cascaded scheme. Interestingly, (a) and~(b)\ntypes of excitation present a qualitatively similar photon statistics\nlayout, but the topography of the resulting population yields largely\ndiffering states, as evident once reported in the $(n_a,g^{(2)})$\nspace, panel~(d).  The color circles along the isolines mark the\npoints with strongest antibunching (i.e., smallest~$g^{(2)}$) for a\ngiven population. It is seen that for a given signal, the antibunching\nis significantly larger with the cascaded coupling. In both cases the\nantibunching is marred before the cavity population reaches one photon\non average. At larger populations, the photon statistics of the cavity\nbecome bunched, i.e., $g^{(2)}=2$.  On can contemplate other\nconfigurations but they result in worse results: detuning the cavity\nfrom the 2LS leaves the photon statistics unchanged, but\nreduces the population of the cavity, so the antibunching in lost at\neven smaller cavity populations. Dephasing the 2LS\nincreases the broadening of the emission peak, but also drives the\ncavity towards a coherent state faster.  Hamiltonian coupling with no\ndecay of the 2LS, case~(c), differs qualitatively from the former\ncases and provides a substantially better antibunching than\nHamiltonian coupling with decay of the 2LS. It even becomes better\nthan the cascaded coupling when $n_a\\gtrsim 2/3$.  This situation can\nbe much improved with the coherent SPS.\n\n\\begin{figure*}\n    \\includegraphics[width=0.95\\linewidth]{figures/fig8-fabrice.pdf}\n    \\caption{(Color online). Same as\n      Fig.~\\ref{fig:juedic17170852CET2015} but for the excitation from\n      a coherent SPS. In (a,c) the implicit parameter is pumping and\n      the green line shows the closest one can get from the Fock-duos\n      limit from the case at resonance.  In~(d) the implicit parameter\n      is the detuning between the source and its target. (a) Exciting\n      at resonance. The optimum antibunching is the envelope in this\n      configuration of the family of curves varying\n      with~$\\gamma_a/\\gamma_\\sigma$.  Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-2}$ (blue), $10^{-1}$\n      (green), 1 (chartreuse), 10 (yellow) and $10^2$ (red).  (b-d)\n      Exciting in other configurations, namely (b) with the leapfrog\n      processes, (c) with the satellite and (d) as a function of\n      frequency. Highlighted are the\n      cases~$\\gamma_a/\\gamma_\\sigma=10^{-1}$ (blue), $0.5$\n      (chartreuse), 1 (green), 5 (orange) and $10$ (red). The\n      dashed-dotted line in panel (b) and the dashed line in panel (c)\n      show the limit of large intensities and are merely a visual aid\n      rather than a physical boundary. They are also shown in\n      panel~(d), along with the black solid line for the envelope of\n      the curves at $\\omega_a=\\omega_\\sigma$. }\n  \\label{fig:domnov29120929CET2015}\n\\end{figure*}\n\n\\section{Exciting with a Coherent SPS}\n\\label{sec:marnov24163921CET2015}\n\nWe now consider excitation by a coherent SPS, i.e., when the 2LS that\nacts as the source is driven coherently by an external laser, as\nsketched in Fig.~\\ref{fig:jueoct29162857CET2015}~d). This driving is\ndescribed by the Hamiltonian:\n\n\n", "index": 31, "text": "\\begin{equation}\n  H_\\sigma = \\omega_\\sigma {{\\sigma}^{\\dagger}}\\sigma + \\Omega_\\sigma ({{\\sigma}^{\\dagger}}e^{-i\\omega_\\mathrm{L} t} + \\sigma e^{i\\omega_\\mathrm{L} t})\\,,\n\\label{Eq.CoherentExcitationDot}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"H_{\\sigma}=\\omega_{\\sigma}{{\\sigma}^{\\dagger}}\\sigma+\\Omega_{\\sigma}({{\\sigma}%&#10;^{\\dagger}}e^{-i\\omega_{\\mathrm{L}}t}+\\sigma e^{i\\omega_{\\mathrm{L}}t})\\,,\" display=\"block\"><mrow><mrow><msub><mi>H</mi><mi>σ</mi></msub><mo>=</mo><mrow><mrow><msub><mi>ω</mi><mi>σ</mi></msub><mo>⁢</mo><msup><mi>σ</mi><mo>†</mo></msup><mo>⁢</mo><mi>σ</mi></mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>σ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>σ</mi><mo>†</mo></msup><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ω</mi><mi mathvariant=\"normal\">L</mi></msub><mo>⁢</mo><mi>t</mi></mrow></mrow></msup></mrow><mo>+</mo><mrow><mi>σ</mi><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ω</mi><mi mathvariant=\"normal\">L</mi></msub><mo>⁢</mo><mi>t</mi></mrow></msup></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n  \\end{subequations}\n\\end{widetext}\n\nwhere we have introduced the notation $\\gamma_{\\widetilde{ij}}=i\n\\gamma_a + j\\gamma_\\sigma$ (e.g.,\n$\\gamma_{\\widetilde{31}}=3\\gamma_a+\\gamma_\\sigma$).\nEliminating~$\\Omega^2$ from Eqs.~(\\ref{eq:juedic17152741CET2015})\nyields, for a given~$\\gamma_a/\\gamma_\\sigma$, solutions of the type\n$g^{(2)}=(P[3]\\pm\\sqrt{P[6]})/(P[2]n_a^2)$ where $P[n]$ is an $n$-th\norder polynomial of the variable~$n_a$. The $\\pm$ terms provide the\ntwo branches of the curve as seen in\nFig.~\\ref{fig:domnov29120929CET2015}(a). The lower branch corresponds\nto low pumping, where the PL of the source is still a single line as\nshown in the bottom inset, while the upper branch corresponds to high\npumping where the PL has split into a Mollow triplet, shown in the\nupper inset.  Each curve starts from the point:\n\n\n", "itemtype": "equation", "pos": 39093, "prevtext": " \n\nwhere $\\omega_\\sigma$ is the energy of the 2LS, and\n$\\omega_\\mathrm{L}$ and $\\Omega_\\sigma$ are the frequency and\nintensity of the driving laser, respectively.  The system is otherwise\nstill described by the master\nequations~(\\ref{Eq.MasterEquationNormal}--\\ref{Eq.MasterEquationCascaded}),\nwith $c_1=\\sigma$ the 2LS (source) and $c_2=a$ the harmonic oscillator\n(target). Here again, one can obtain the cavity observables in\nclosed-form, although it takes slightly more cumbersome\nexpressions. At resonance (out-of resonance cases can also be obtained\nbut get even more bulky):\n\n\\begin{widetext}\n  \\begin{subequations}\n    \\label{eq:juedic17152741CET2015}\n    \n", "index": 33, "text": "\\begin{align}\n      &n_a = \\frac{16 \\gamma_{\\widetilde{01}} \\Omega^2 \\left( \\gamma_{\\widetilde{11}}^2\\gamma_{\\widetilde{12}}+8\\gamma_{\\widetilde{10}} \\Omega^2\\right)}{\\gamma_{\\widetilde{10}}\\gamma_{\\widetilde{11}}(\\gamma_{\\widetilde{01}}^2+8\\Omega^2)(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{12}}+16\\Omega^2)}\\,,\\\\\n      &\\nonumber\\\\\n      &g^{(2)}=\\nonumber\\\\\n      &\\frac{\\gamma_{\\widetilde{11}}(\\gamma_{\\widetilde{01}}^2+8\\Omega^2)(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{12}}+16\\Omega^2)(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{21}}^2\\gamma_{\\widetilde{31}}^2\\gamma_{\\widetilde{12}}\\gamma_{\\widetilde{32}}+8\\gamma_{\\widetilde{10}}\\gamma_{\\widetilde{31}}(17\\gamma_{\\widetilde{10}}^3+29\\gamma_{\\widetilde{10}}^2\\gamma_{\\widetilde{01}}+18\\gamma_{\\widetilde{10}}\\gamma_{\\widetilde{01}}^2+4\\gamma_{\\widetilde{01}}^3)\\Omega^2+192\\gamma_{\\widetilde{10}}^2\\gamma_{\\widetilde{21}}\\Omega^4)}{\\gamma_{\\widetilde{21}}\\gamma_{\\widetilde{31}}(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{21}}+8\\Omega^2)(\\gamma_{\\widetilde{31}}\\gamma_{\\widetilde{32}}+16\\Omega^2)(\\gamma_{\\widetilde{11}}^2\\gamma_{\\widetilde{12}}+8\\gamma_{\\widetilde{10}}\\Omega^2)^2}\\,,\n    \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle n_{a}=\\frac{16\\gamma_{\\widetilde{01}}\\Omega^{2}\\left(\\gamma_{%&#10;\\widetilde{11}}^{2}\\gamma_{\\widetilde{12}}+8\\gamma_{\\widetilde{10}}\\Omega^{2}%&#10;\\right)}{\\gamma_{\\widetilde{10}}\\gamma_{\\widetilde{11}}(\\gamma_{\\widetilde{01}%&#10;}^{2}+8\\Omega^{2})(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{12}}+16\\Omega^{2}%&#10;)}\\,,\" display=\"inline\"><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mn>16</mn><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msubsup><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>12</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo>)</mo></mrow></mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>12</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>16</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle g^{(2)}=\" display=\"inline\"><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{\\gamma_{\\widetilde{11}}(\\gamma_{\\widetilde{01}}^{2}+8\\Omega%&#10;^{2})(\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{12}}+16\\Omega^{2})(\\gamma_{%&#10;\\widetilde{11}}\\gamma_{\\widetilde{21}}^{2}\\gamma_{\\widetilde{31}}^{2}\\gamma_{%&#10;\\widetilde{12}}\\gamma_{\\widetilde{32}}+8\\gamma_{\\widetilde{10}}\\gamma_{%&#10;\\widetilde{31}}(17\\gamma_{\\widetilde{10}}^{3}+29\\gamma_{\\widetilde{10}}^{2}%&#10;\\gamma_{\\widetilde{01}}+18\\gamma_{\\widetilde{10}}\\gamma_{\\widetilde{01}}^{2}+4%&#10;\\gamma_{\\widetilde{01}}^{3})\\Omega^{2}+192\\gamma_{\\widetilde{10}}^{2}\\gamma_{%&#10;\\widetilde{21}}\\Omega^{4})}{\\gamma_{\\widetilde{21}}\\gamma_{\\widetilde{31}}(%&#10;\\gamma_{\\widetilde{11}}\\gamma_{\\widetilde{21}}+8\\Omega^{2})(\\gamma_{\\widetilde%&#10;{31}}\\gamma_{\\widetilde{32}}+16\\Omega^{2})(\\gamma_{\\widetilde{11}}^{2}\\gamma_{%&#10;\\widetilde{12}}+8\\gamma_{\\widetilde{10}}\\Omega^{2})^{2}}\\,,\" display=\"inline\"><mrow><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>12</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>16</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>21</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>31</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>12</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>32</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>31</mn><mo>~</mo></mover></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>17</mn><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover><mn>3</mn></msubsup></mrow><mo>+</mo><mrow><mn>29</mn><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>18</mn><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover></msub><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover><mn>2</mn></msubsup></mrow><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>01</mn><mo>~</mo></mover><mn>3</mn></msubsup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow><mo>+</mo><mrow><mn>192</mn><mo>⁢</mo><msubsup><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>21</mn><mo>~</mo></mover></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>4</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>21</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>31</mn><mo>~</mo></mover></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>21</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>γ</mi><mover accent=\"true\"><mn>31</mn><mo>~</mo></mover></msub><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>32</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>16</mn><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mi>γ</mi><mover accent=\"true\"><mn>11</mn><mo>~</mo></mover><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>12</mn><mo>~</mo></mover></msub></mrow><mo>+</mo><mrow><mn>8</mn><mo>⁢</mo><msub><mi>γ</mi><mover accent=\"true\"><mn>10</mn><mo>~</mo></mover></msub><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mstyle></mpadded><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nshowing that coherent SPS provide a much stronger antibunching than\ntheir incoherent counterpart, Eq.~(\\ref{eq:juedic17173145CET2015}),\nalready at vanishing pumping. At high pumping, in contrast to the\nincoherent case that vanishes the population of its target, the\ncoherent SPS quenches it to a nonzero value and featuring bunching:\n\n\n", "itemtype": "equation", "pos": 41074, "prevtext": "\n  \\end{subequations}\n\\end{widetext}\n\nwhere we have introduced the notation $\\gamma_{\\widetilde{ij}}=i\n\\gamma_a + j\\gamma_\\sigma$ (e.g.,\n$\\gamma_{\\widetilde{31}}=3\\gamma_a+\\gamma_\\sigma$).\nEliminating~$\\Omega^2$ from Eqs.~(\\ref{eq:juedic17152741CET2015})\nyields, for a given~$\\gamma_a/\\gamma_\\sigma$, solutions of the type\n$g^{(2)}=(P[3]\\pm\\sqrt{P[6]})/(P[2]n_a^2)$ where $P[n]$ is an $n$-th\norder polynomial of the variable~$n_a$. The $\\pm$ terms provide the\ntwo branches of the curve as seen in\nFig.~\\ref{fig:domnov29120929CET2015}(a). The lower branch corresponds\nto low pumping, where the PL of the source is still a single line as\nshown in the bottom inset, while the upper branch corresponds to high\npumping where the PL has split into a Mollow triplet, shown in the\nupper inset.  Each curve starts from the point:\n\n\n", "index": 35, "text": "\\begin{equation}\n  \\label{eq:vieene15153629CET2016}\n  \\left(n_a=0,g^{(2)}=\\frac{1}{(1+\\gamma_a/\\gamma_\\sigma)^2}\\right)\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\left(n_{a}=0,g^{(2)}=\\frac{1}{(1+\\gamma_{a}/\\gamma_{\\sigma})^{2}}\\right)\\,,\" display=\"block\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mn>0</mn></mrow><mo>,</mo><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mfrac><mn>1</mn><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nEliminating~$\\gamma_a/\\gamma_\\sigma$ here leads to the curve\n$g^{(2)}=3/(3-2 n_a)$, shown in thick black in\nFig.~\\ref{fig:domnov29120929CET2015}(a).  The expression for the lower\nenvelope of maximum antibunching, in blue, is too complicated to be\nderived fully in closed-form but we can find simple asymptotic\nexpressions by series expansion of\nEqs.~(\\ref{eq:juedic17152741CET2015}), namely, $g^{(2)}\\approx\n27n_a^{2}/16$ when~$n_a\\ll1$ and $g^{(2)}\\approx 1-1/(3(n_a+1))$\nwhen~$n_a\\gg1$.  The states thus get close to the ideal Fock limit for\nlarge populations, approaching unity as~$1/(3n_a)$ rather\nthan~$1/n_a$. There is no limit in the population that can be excited\nin the target by the coherent SPS, in stark contrast to the incoherent\nSPS that is bounded by unity. Although the accessible states in\nthe~$(n_a,g^{(2)})$ space remain quite some distance away from the\nideal limit, the coherent SPS provides a much better antibunching than\nits incoherent counterpart, as can be seen by comparing\nFigs.~\\ref{fig:juedic17170852CET2015}\nand~\\ref{fig:domnov29120929CET2015}. Namely, it is still antibunched\nwhen population is unity (with a maximum antibunching slightly over\n1/2) and we have alreay commented how it allows for arbitrary large\npopulations, that still feature antibunching. This is achieved by\nexciting at resonance targets of very long lifetimes as compared to\nthe source.\n\nThis describes the resonant situation. Since the coherent SPS has a\nrich spectral structure, it opens new configurations of excitation in\nthe Mollow triplet regime beyond the central peak, such as exciting\nwith a satellite peak (as shown in\nFig.~\\ref{fig:domnov29120929CET2015}(c)) or with the leapfrog window\n(Fig.~\\ref{fig:domnov29120929CET2015}(b)). In these cases we show the\nresults in log-log plots as only small populations are within reach\n(unlike the case of resonance) and, in the case of leapfrog\nexcitation, also a huge bunching can be imparted to the target. The\nenvelope of optimum antibunching as obtained in resonance is reported\nin these panels (also in green) for comparison, showing that these\nalternative schemes do not enhance antibunching.  The excitation with\nleapfrog processes allows to access new regions of the Hilbert space\nrelated to superbunching, so it is a configuration that presents its\nown interest.  This is achieved at the price of small\npopulations. Exciting with a satellite peak also conquers new\nterritories in the $(n_a,g^{(2)})$ space not accessible through either\nthe central peak or leapfrog emission in a small region $(n_a\\approx\n0.6,g^{(2)}\\lesssim2)$. Panel~(d) shows the trajectories when varying\nthe frequency of emission, where the cases just discussed---resonance,\nleapfrog and satellites---appear as boundaries of the complete\npicture, thus showing that these configurations already give access to\nall the accessible states.\n\nWe can also compare in the parameter space the coherent SPS with its\nHamiltonian counterpart, as we did for the incoherent SPS. This is\nshown in the bottom row of Fig.~\\ref{fig1}, that is also usefully\ncompared with the upper row (incoherent SPS excitation). For the\ncoherent SPS as well, both cascaded and Hamiltonian coupling are\nqualitatively similar in their statistical layout when the 2LS has a\ndecay term, but also differ notably from the topography of the\nassociated intensities. This is, again, clear on the $(n_a,g^{(2)})$\nspace, with the maximum antibunching that can be obtained for a given\ncavity population with cascaded coupling (green line) and Hamiltonian\ncoupling (red line). The Hamiltonian coupling with no decay of the 2LS\nalso results in qualitative differences and an enhanced\nantibunching. However, in this case, the Hamiltonian coupling never\ncomes to surpass the cascaded scheme.  Instead, in all the range of\npopulation, the antibunching obtained through the cascaded coupling is\nlarger than the one obtained with any type of normal (Hamiltonian)\ncoupling, for a given population. When the cavity is detuned from the\n2LS, the antibunching is lost before the cavity's population reaches\none photon. Also, when the cavity is in resonance with the leapfrog\nprocess emission, the photon statistics of the cavity is superbunched\nbut its population remains well below unity. Including a dephasing\nrate to the dynamics of the 2LS increases the broadening of each\nemission line in the triplet, and even a small dephasing rate, spoils\nthe antibunching. Thus, the best antibunching with a coherent SPS is\nobtained exciting the cavity at low pumping and in resonance with the\n2LS, using the cascaded coupling.\n\n\\begin{figure}\n    \\includegraphics[width=0.9\\linewidth]{figures/fig3.pdf}\n    \\caption{(Color online). Wigner function~(a--c)~and density\n      matrix~(d--f) for the states marked by black circles along the\n      green line in Fig.~\\ref{fig1}(h). These states have\n      populations~$n_a=1$, $1.5$ and~$3$ from top to bottom and all\n      feature antibunching.}\n  \\label{fig4}\n\\end{figure}\n\nOne of the departing features of the coherent SPS excitation, is that\nit allows to populate its target with more than one excitation on\naverage, therefore triggering Bose stimulation effects. There is a\nphase locking (of $0$, as determined by the Hamiltonian) of the\nincident photons from the quantum source that accumulate while still\nexhibiting some features of Fock states, in particular being\nantibunched. A picture of the resulting quantum states beyond the\ndiagonal elements is given Fig.~\\ref{fig4} for the states marked with\nblack circles in Fig.~\\ref{fig1}(f), both through the Wigner\nrepresentation, Fig.~\\ref{fig4}(a-c), and through their matrix\nrepresentation, Fig.~\\ref{fig4}(d-f). The Wigner representation\nexhibits negative values at the origin, a mark of a genuine quantum\nstate with no classical counterpart, for the states with $n_a=1$ and\n$n_a=1.5$ (the blue spot at the center in Fig.~\\ref{fig4}(b)) but is\npositive everywhere for~$n_a=3$, although the state is still\nantibunched.  Also, one can see that the phase uncertainty decreases\nas the population increases, in agreement with the ``classical\nlimit''. Moreover, the matrix elements in these cases also satisfy the\nrelation $\\rho_{22} > \\max(\\rho_{11}/2,\\rho_{33})$, which means that\nfluctuations are smaller than could be expected from rate equation\narguments, since two excitations are twice as much likely to decay\nthan one excitation, making the probability to find one excitation\nonly in principle at least twice as large than double\noccupation~\\cite{lopezcarreno15a}.\n\nWe conclude this Section on driving an harmonic oscillator with the\ncoherent SPS by considering states in the $(g^{(2)},g^{(3)})$\nspace. This is shown in Fig.~\\ref{fig:vieoct23155212CEST2015} for the\nmost notable configurations of exciting with the central peak of the\nMollow triplet or the leapfrog region between the central peak and a\nsatellite. All points are physical on this map, including cases with\n$g^{(2)}\\ll 1$ and $g^{(3)}\\gg 1$ (and vice-versa), although the\naccessible regions are strongly confined along curves that we can fit\nin monomial form, leading in good approximation to~$g^{(3)}\\approx 0.2\n[g^{(2)}]^2$ at low pumping (in the antibunching corner)\nand~$g^{(3)}\\approx 4.5 g^{(2)}$ at large pumpings (in the\nsuperbunching corner). We indicate positions of popular quantum\nstates such as Fock states, coherent states, thermal states and their\ncombinations. Driving with a SPS spans over great distances in this\nspace, especially when exciting with leapfrog processes, as seen in\npanel~(a) of the figure. This shows, again, how the central peak\nremains confined essentially to the antibunched corner of the map\n(excursions to bunching cases are up to~$g^{(2)}=3$). Panel~(b) is a\nzoom around small values in linear scale.  The leapfrog processes, on\nthe contrary, allow one to reach large joint values of $g^{(2)}$\nand~$g^{(3)}$. Interestingly, while the points accessible in\nthe~$(n_a,g^{(2)})$ space extend over 2D~areas, in the\n$(g^{(2)},g^{(3)})$ space they are confined to 1D~curves, showing how\nthese correlators are strongly inter-dependent, and thus making\nthe~$(n_a,g^{(2)})$ representation more prominent.\n\n\\begin{figure}\n  \\includegraphics[width=0.8\\linewidth]{figures/fig4.pdf}\n  \\caption{(Color online).  States accessible in the\n    $(g^{(2)},g^{(3)})$ space by coherent SPS excitation, at resonance\n    with the central peak (orange line) or with the leapfrog emission\n    (red line). The dashed blue line corresponds to the ``Fock duos'',\n    Eq.~(\\ref{eq:vieoct23174124CEST2015}). The same result is shown in\n    both (a) log-log and~(b) linear scales.}\n  \\label{fig:vieoct23155212CEST2015}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Variations in the type of coupling}\n\\label{sec:lunnov30102926CET2015}\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig2.pdf}\n  \\caption{(Color online). Variations in the model. (a,~b)~Adding a\n    dissipative channel to the source in the cascaded coupling spoils\n    the antibunching. (c,~d)~Increasing the coupling strength $g$ in\n    the Hamiltonian coupling (with decay in the source) enhances the\n    antibunching until it reaches the one obtained for the Hamiltonian\n    coupling without decay of the source (when $g^\\ast \\approx\n    10g$). However, the enhancement is never enough to top the\n    antibunching obtained using the coherently driven 2LS and the\n    cascaded coupling.}\n  \\label{fig2}\n\\end{figure}\n\nThe comparison between both rows of Fig.~\\ref{fig1} shows that the\ncoherent SPS is a much better quantum drive to generate bright\nantibunching than the incoherent one, even in the region where\n$n_a<1$.  The coherent SPS exciting the cavity still remains some\ndistance away from the Fock duos boundary, but it gets significantly\ncloser than with the Hamiltonian coupling.  We complete our\njuxtaposition between the two types of coupling, cascaded and\nHamiltonian, by comparing with other variations in the way the source\ncouples to its target.\n\nFirst, we consider another source of decay for the source in the\ncascaded coupling scheme, i.e., with an extra term\n$(\\gamma_\\sigma^\\ast/2)\\mathcal{L}_{\\sigma}\\rho$ in the master\nequation, leaving the coupling strength constant and equal to\n$\\sqrt{\\gamma_a \\gamma_\\sigma}/2$. This describes the situation where\nnot all the light that is lost from the source is redirected to the\ntarget. Figure~\\ref{fig2}(a-b) shows how this other source of decay\nspoils the antibunching and drives the cavity faster toward a coherent\nstate (for the coherent SPS) or to a thermal state (for the incoherent\nSPS). At $\\gamma_\\sigma^\\ast=10\\gamma_\\sigma$, the antibunching is\nworse than that obtained using the Hamiltonian coupling (without any\nadditional dissipative channel). This shows that it is better to\nminimize losses from the quantum emitter, but that unless these are\ndrastic, the impact is moderately detrimental.  Note that the cascaded\ncoupling strength can only be smaller or at most equal to\n$\\sqrt{\\gamma_1\\gamma_2}$, unlike some statements in the\nliterature~\\cite{flayac14a} that refer to ``arbitrary coupling\nstrengths''. This leads, however, to unphysical states for the target.\nSecond, in the Hamiltonian coupling, we increase the coupling strength\nand bring the system into the strong-coupling regime. This is one\nconsiderable degree of freedom of the Hamiltonian coupling that is\nlost when considering some external excitation, since photons that\ndrive the system from outside can couple to it in the first place\nbecause it is dissipative. The more efficient is the source--target\ncoupling, the more dissipative becomes the target. But a dissipative\ntarget cannot sustain quantum effects for long, as the states do\nindeed decay. Therefore there is a compromise for the target's\nlifetime to allow simultaneously an efficient driving from the source\nwhile still allowing to store long enough the imprinted quantum\nattributes. In the Hamiltonian coupling, however, coupling and decay\nare independent and one can consider a pure Hamiltonian picture with\nno decay whatsoever. We will see later in this series how one can\nremedy to this vicious circle to some extent by considering other\ntypes of quantum sources. For now, we show that, surprisingly,\ncascaded coupling indeed provides a better quantum driving than the\nHamiltonian coupling brought in the strong-coupling regime. This is\nbecause in the latter case, the reversible process from the ``target''\nback to the ``source'' acts like an effective decay. This is shown in\nFig.~\\ref{fig2}(c,d), where we compare again the maximum antibunching\nobtained in the configuration of Sec.~\\ref{sec:marnov24163921CET2015}\n(green lines) with a magnified Hamiltonian coupling $g^\\ast = N\n\\sqrt{\\gamma_a \\gamma_\\sigma}/2$ for various $N$. For both the\ncoherent and incoherent excitation cases, the antibunching is improved\nby raising the coupling strength. However, this improvement is still\nnot large enough to overcome the cascaded coupling. As seen in the\nfigure, even for large Hamiltonian coupling strengths, the\nantibunching obtained with the cascaded coupling (green line) is\nalways significantly better.  Increasing even further the value of $N$\ndoes not improve the antibunching, but makes it occur at larger\n$(\\Omega_\\sigma,\\gamma_a)$ values. At this limiting case, the\nantibunching obtained for the Hamiltonian coupling with the decay of\nthe source coincides with the antibunching for the Hamiltonian without\nthe decay of the source.  Therefore, Fid.~\\ref{fig2}(c) shows the\noptimum antibunching that can be obtained using both the cascaded and\nHamiltonian couplings.\n\nIncreasing the coupling has a much stronger effect in the case of\nincoherent excitation, as shown in Fig.~\\ref{fig2}(d). Even a small\nvariation of the coupling strength, $N=1.5$, changes significantly the\ncurvature of the antibunching curve. Increasing the value of $N$ makes\nthe system enter the ``one-atom laser'' regime~\\cite{delvalle11a}, and\nthe state in the cavity becomes coherent. As for the coherent\nexcitation, the best antibunching saturates with increasing coupling\n(converging at roughly $g^\\ast=10g$), with larger values of the\ncoupling strength merely occuring at larger $(P_\\sigma,\\gamma_a)$\nvalues. Nevertheless, although raising the coupling strength improves\nthe antibunching, and at large $g^\\ast$ the $g^{(2)}$ of the cavity at\nlarge population goes to $1$, the best antibunching is still obtained\nwith the cascaded coupling in the coherent excitation regime (green\nline in Fig.~\\ref{fig2}(d)). Overall, it is therefore established that\noptimum antibunching is obtained in the cascaded architecture. This\ncould have important consequences in the design of future\nquantum-optical devices.\n\n\\section{Summary and Conclusions}\n\\label{sec:jueoct29112554CET2015}\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig10.pdf}\n  \\caption{(Color online). Summary of our results: the Hilbert space\n    of an harmonic oscillator charted by the~$n_a$ (population)\n    and~$g^{(2)}$ (second-order correlation function) is accessible\n    for any point in the blue region~I (the white region is\n    forbidden). Of this region, the wider span is achieved by exciting\n    with a coherent SPS, covering the green region. This region breaks\n    down into~II, the region achieved at resonance between the source\n    and the target, III, that achieved with the excitation from a\n    satellite of the Mollow triplet and~IV that achieved with the\n    leapfrog emission. The incoherent SPS covers a smaller region,\n    deliminited by the red dotted curve. The hamiltonian coupling,\n    between the two dotted-dash yellow curves, also covers a large\n    span of the Hilbert space and is neither included nor fully\n    encludes the SPS area.  In particular, the excitation by a SPS\n    allows to provide a stronger antibunching for any given population\n    as compared to a Hamiltonian coupling, although it still remains\n    some distance away from the ideal limit.}\n  \\label{fig:miÃ©ene13175933CET2016}\n\\end{figure}\n\nOur analysis of the excitation by a SPS of a quantum harmonic\noscillator can be summarized by Fig.~\\ref{fig:miÃ©ene13175933CET2016}.\nHere we show again the charting of the Hilbert space of the quantum\nharmonic oscillator that we have introduced, along with the various\nareas that can be accessed with a SPS. First, the region~I of physical\nstates, shown in light blue, delimited by Fock duos\n(Eq.~(\\ref{eq:marnov24092156CET2015})) according to\nEq.~(\\ref{eq:miÃ©oct21181551CEST2015}). No state exists that can provide\nthe corresponding joint population and antibunching in the white\nregion.  In contrast to popular belief, states do exist in the region\nabove this boundary that satisfy~$g^{(2)}<1/2$ and $n_a>1$ which shows\nthat on mathematical grounds, the criterion $g^{(2)}<1/2$ cannot be\nused to exclude states with more than one particle. In this region of\nphysical states, the green area can be accessed in the steady state by\nexciting a cavity with a SPS, provided an\nadequate~$\\gamma_a/\\gamma_\\sigma$ ratio and pumping. The largest span\nis realized by a coherent SPS (i.e., a 2LS itself driven by a laser)\nat resonance with its target. This gives access to the light green\nregion~II. Not all states are accesible in this configuration, in\nparticular the limit of Fock duos remains some distance away from the\ndriven dissipative case. It remains an open question at this time\nwhether one can get closer using other quantum sources. States of\narbitrary populations can be reached with the coherent SPS (by using\ntargets with long enough lifetimes) that still retain\nantibunching. One can also realize states of arbitrary high bunching,\nby using leapfrog emission of the SPS in the Mollow triplet\nregime. This is the region~IV shown in dark green in\nFig.~\\ref{fig:miÃ©ene13175933CET2016}. Exciting with the satellite\npeaks covers the region~III that gives access to a small patch not\nwithin reach of~II and~IV. Other frequencies do not lead to areas not\nalready covered by these cases. The incoherent SPS does not extend\nthis territory either, as it is contained in the\narea~$2n_a/(3-2n_a)\\le g^{(2)}\\le2$, shown in dotted red.  Notably,\nthe region accessible by the Hamiltonian regime does not include nor\nis included by that accessible with the cascaded coupling.  They do\nshare some common area.  In fact, cascaded coupling reduces to\nHamiltonian coupling whenever\n$g/\\gamma_\\sigma\\ll\\gamma_a/\\gamma_\\sigma$ which, for the cascaded\ncoupling constrain of\n$g/\\gamma_\\sigma=\\sqrt{\\gamma_a/\\gamma_\\sigma}/2$, provides the\ncriterion~${\\gamma_a}/{\\gamma_\\sigma}\\gg1/4$ for which the\nconventional formalism is enough to describe excitation with no\nfeedback. This criterion allows, for instance, to develop the theory\nof frequency correlation~\\cite{delvalle12a} in a conventional setting\nwithout the explicit need of the cascaded formalism to prevent\nfeedback, a point that has not always been fully\nappreciated~\\cite{flayac14a}.  In other cases, we have shown that\ncascaded coupling allows, surprisingly, to reach regions of the\nHilbert space out of reach of a conventional Hamiltonian dynamics and,\nin particular, to improve the possible antibunching for a given\npopulation.\n\n\\section{Perspectives}\n\\label{sec:jueoct29112601CET2015}\n\nWe have considered only one aspect of the general picture of quantum\nexcitation of optical targets. Namely, various types of SPS exciting\nan harmonic oscillator. In the laboratory, this can take the form of\nexciting a passive cavity mode, or a non-interacting boson field. This\nis the configuration sketched in\nFig.~\\ref{fig:vieoct30160938CET2015}~I.~and that we addressed in this\ntext, the opening one of a series that will carry on similar studies\nto other configurations of interest, as sketched in the rest of\nFig.~\\ref{fig:vieoct30160938CET2015} and summarized here.  In the next\ntext, II., we consider the problem of exciting a 2LS rather than the\nharmonic oscillator. In part~III., we increase one step more the level\nof complexity of the target by exciting polaritons, i.e., coupled\nlight--matter systems. This focuses on different targets subjected to\nthe (quantum) light of the same type of source. In part~IV., we\nrevisit all these targets together but now excited by an even ``more\nquantum'' source than the SPS, namely, $N$-photon\nemitters~\\cite{sanchezmunoz14a}. In Section~V., we come back to all\nthe combinations dealt with so far but turning to pulsed excitation\nrather than cw, addressing the problem of quantum state\npreparation. Even with the five texts taken together, we do not\nexhaust the topic and much remains to be studied even in the\nconfigurations put to scrutiny. For instance, we considered one\nparticular type of SPS only, the simplest one as realized by a single\nemitter, while implementations from pairs of photons with one\nheralding the other (mainly through parametric down conversion~(PDC)\nand four-wave mixing (FWM)) are extremely popular and with advantages\nof their own, such as determinism. It is clear that there is much\nengineering to be done with such sources as well, and certainly some\nimprovements in their operating conditions to be gained from the\ncascaded architecture, e.g., helping to fix their principal drawback\nso far: the nonzero probability to emit more than a single\nphoton. \n\n\n\nAlso, this extended exploration of the general problem of quantum\nexcitation will give us many occasions to revisit the same aspects\nfrom different angles. For instance, in part~V., we will provide a\nclear physical picture of why the cascaded architecture allows such an\nenhancement as compared to the Hamiltonian coupling by considering the\ntime-resolved excitation of the target by the spontaneous emission of\nan initial condition prepared in the source, which can be solved\nexactly. This brings much clarification into the nature of the target\nand the source and their interrelationship in a quantum context.\n\n\\begin{figure}\n    \\includegraphics[width=.85\\linewidth]{figures/fig-last.pdf}\n    \\caption{(Color online). Exciting with Quantum Light: the basic\n      configurations we propose to study in this series of\n      texts. Part~I is the current work, exciting an harmonic\n      oscillator (single cavity mode) with a SPS. Part~II addresses\n      the excitation of a 2LS with a SPS. Part~III is exciting coupled\n      light-matter systems, or polaritons, still with a SPS. Following\n      the comprehensive treatments of these several targets under the\n      cw excitation from a SPS, we then trade this simple quantum\n      source for, IV, a $N$--photon emitter (bundler) and, V, a pulsed\n      quantum source, impinging on all the targets previously\n      considered.}\n  \\label{fig:vieoct30160938CET2015}\n\\end{figure}\n\n\\begin{acknowledgments}\n  We thank C. S\\'anchez Mu\\~noz and E. del Valle for constant\n  discussions. Funding by the POLAFLOW ERC project No.~308136 is\n  acknowledged.\n\\end{acknowledgments}\n\n\\appendix\n\\section{Proof that Fock duos bound the $(n_a,g^{(2)})$ space}\n\\label{sec:marnov24122827CET2015}\n\nWe prove mathematically that there are no states below the boundary\nset by Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}) but at least one for\nevery point above, thus showing that our charting of the Hilbert space\nin the $(n_a,g^{(2)})$ space as defined by this boundary is\ncomplete.\\\\%  Readers satisfied with the physical and numerical arguments\n\n\n\n\\begin{proposition}\n  \\emph{For a given population $n_a\\in\\mathbb{R}$, the maximum\n    antibunching is given by a superposition of at most two\n    consecutive Fock states.}\n\\end{proposition}\n\nFirst, for any~$n_a\\in\\mathbb{R}$, there exists a superposition of at most\ntwo consecutive Fock states that provides this population, namely:\n\n\n", "itemtype": "equation", "pos": 41548, "prevtext": "\n\nshowing that coherent SPS provide a much stronger antibunching than\ntheir incoherent counterpart, Eq.~(\\ref{eq:juedic17173145CET2015}),\nalready at vanishing pumping. At high pumping, in contrast to the\nincoherent case that vanishes the population of its target, the\ncoherent SPS quenches it to a nonzero value and featuring bunching:\n\n\n", "index": 37, "text": "\\begin{equation}\n  \\label{eq:vieene15155413CET2016}\n  \\left(n_a=\\frac{1}{1+\\gamma_a/\\gamma_\\sigma},g^{(2)}=3\\frac{1+\\gamma_a/\\gamma_\\sigma}{1+3\\gamma_a/\\gamma_\\sigma}\\right)\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\left(n_{a}=\\frac{1}{1+\\gamma_{a}/\\gamma_{\\sigma}},g^{(2)}=3\\frac{1+\\gamma_{a}%&#10;/\\gamma_{\\sigma}}{1+3\\gamma_{a}/\\gamma_{\\sigma}}\\right)\\,.\" display=\"block\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>=</mo><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow></mfrac></mrow><mo>,</mo><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mn>3</mn><mo>⁢</mo><mfrac><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>γ</mi><mi>a</mi></msub><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><msub><mi>γ</mi><mi>a</mi></msub></mrow><mo>/</mo><msub><mi>γ</mi><mi>σ</mi></msub></mrow></mrow></mfrac></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nWe can write without loss of generality the generic\nstate~(\\ref{eq:miÃ©oct21094346CEST2015}) as:\n\n\n", "itemtype": "equation", "pos": 65451, "prevtext": "\n\nEliminating~$\\gamma_a/\\gamma_\\sigma$ here leads to the curve\n$g^{(2)}=3/(3-2 n_a)$, shown in thick black in\nFig.~\\ref{fig:domnov29120929CET2015}(a).  The expression for the lower\nenvelope of maximum antibunching, in blue, is too complicated to be\nderived fully in closed-form but we can find simple asymptotic\nexpressions by series expansion of\nEqs.~(\\ref{eq:juedic17152741CET2015}), namely, $g^{(2)}\\approx\n27n_a^{2}/16$ when~$n_a\\ll1$ and $g^{(2)}\\approx 1-1/(3(n_a+1))$\nwhen~$n_a\\gg1$.  The states thus get close to the ideal Fock limit for\nlarge populations, approaching unity as~$1/(3n_a)$ rather\nthan~$1/n_a$. There is no limit in the population that can be excited\nin the target by the coherent SPS, in stark contrast to the incoherent\nSPS that is bounded by unity. Although the accessible states in\nthe~$(n_a,g^{(2)})$ space remain quite some distance away from the\nideal limit, the coherent SPS provides a much better antibunching than\nits incoherent counterpart, as can be seen by comparing\nFigs.~\\ref{fig:juedic17170852CET2015}\nand~\\ref{fig:domnov29120929CET2015}. Namely, it is still antibunched\nwhen population is unity (with a maximum antibunching slightly over\n1/2) and we have alreay commented how it allows for arbitrary large\npopulations, that still feature antibunching. This is achieved by\nexciting at resonance targets of very long lifetimes as compared to\nthe source.\n\nThis describes the resonant situation. Since the coherent SPS has a\nrich spectral structure, it opens new configurations of excitation in\nthe Mollow triplet regime beyond the central peak, such as exciting\nwith a satellite peak (as shown in\nFig.~\\ref{fig:domnov29120929CET2015}(c)) or with the leapfrog window\n(Fig.~\\ref{fig:domnov29120929CET2015}(b)). In these cases we show the\nresults in log-log plots as only small populations are within reach\n(unlike the case of resonance) and, in the case of leapfrog\nexcitation, also a huge bunching can be imparted to the target. The\nenvelope of optimum antibunching as obtained in resonance is reported\nin these panels (also in green) for comparison, showing that these\nalternative schemes do not enhance antibunching.  The excitation with\nleapfrog processes allows to access new regions of the Hilbert space\nrelated to superbunching, so it is a configuration that presents its\nown interest.  This is achieved at the price of small\npopulations. Exciting with a satellite peak also conquers new\nterritories in the $(n_a,g^{(2)})$ space not accessible through either\nthe central peak or leapfrog emission in a small region $(n_a\\approx\n0.6,g^{(2)}\\lesssim2)$. Panel~(d) shows the trajectories when varying\nthe frequency of emission, where the cases just discussed---resonance,\nleapfrog and satellites---appear as boundaries of the complete\npicture, thus showing that these configurations already give access to\nall the accessible states.\n\nWe can also compare in the parameter space the coherent SPS with its\nHamiltonian counterpart, as we did for the incoherent SPS. This is\nshown in the bottom row of Fig.~\\ref{fig1}, that is also usefully\ncompared with the upper row (incoherent SPS excitation). For the\ncoherent SPS as well, both cascaded and Hamiltonian coupling are\nqualitatively similar in their statistical layout when the 2LS has a\ndecay term, but also differ notably from the topography of the\nassociated intensities. This is, again, clear on the $(n_a,g^{(2)})$\nspace, with the maximum antibunching that can be obtained for a given\ncavity population with cascaded coupling (green line) and Hamiltonian\ncoupling (red line). The Hamiltonian coupling with no decay of the 2LS\nalso results in qualitative differences and an enhanced\nantibunching. However, in this case, the Hamiltonian coupling never\ncomes to surpass the cascaded scheme.  Instead, in all the range of\npopulation, the antibunching obtained through the cascaded coupling is\nlarger than the one obtained with any type of normal (Hamiltonian)\ncoupling, for a given population. When the cavity is detuned from the\n2LS, the antibunching is lost before the cavity's population reaches\none photon. Also, when the cavity is in resonance with the leapfrog\nprocess emission, the photon statistics of the cavity is superbunched\nbut its population remains well below unity. Including a dephasing\nrate to the dynamics of the 2LS increases the broadening of each\nemission line in the triplet, and even a small dephasing rate, spoils\nthe antibunching. Thus, the best antibunching with a coherent SPS is\nobtained exciting the cavity at low pumping and in resonance with the\n2LS, using the cascaded coupling.\n\n\\begin{figure}\n    \\includegraphics[width=0.9\\linewidth]{figures/fig3.pdf}\n    \\caption{(Color online). Wigner function~(a--c)~and density\n      matrix~(d--f) for the states marked by black circles along the\n      green line in Fig.~\\ref{fig1}(h). These states have\n      populations~$n_a=1$, $1.5$ and~$3$ from top to bottom and all\n      feature antibunching.}\n  \\label{fig4}\n\\end{figure}\n\nOne of the departing features of the coherent SPS excitation, is that\nit allows to populate its target with more than one excitation on\naverage, therefore triggering Bose stimulation effects. There is a\nphase locking (of $0$, as determined by the Hamiltonian) of the\nincident photons from the quantum source that accumulate while still\nexhibiting some features of Fock states, in particular being\nantibunched. A picture of the resulting quantum states beyond the\ndiagonal elements is given Fig.~\\ref{fig4} for the states marked with\nblack circles in Fig.~\\ref{fig1}(f), both through the Wigner\nrepresentation, Fig.~\\ref{fig4}(a-c), and through their matrix\nrepresentation, Fig.~\\ref{fig4}(d-f). The Wigner representation\nexhibits negative values at the origin, a mark of a genuine quantum\nstate with no classical counterpart, for the states with $n_a=1$ and\n$n_a=1.5$ (the blue spot at the center in Fig.~\\ref{fig4}(b)) but is\npositive everywhere for~$n_a=3$, although the state is still\nantibunched.  Also, one can see that the phase uncertainty decreases\nas the population increases, in agreement with the ``classical\nlimit''. Moreover, the matrix elements in these cases also satisfy the\nrelation $\\rho_{22} > \\max(\\rho_{11}/2,\\rho_{33})$, which means that\nfluctuations are smaller than could be expected from rate equation\narguments, since two excitations are twice as much likely to decay\nthan one excitation, making the probability to find one excitation\nonly in principle at least twice as large than double\noccupation~\\cite{lopezcarreno15a}.\n\nWe conclude this Section on driving an harmonic oscillator with the\ncoherent SPS by considering states in the $(g^{(2)},g^{(3)})$\nspace. This is shown in Fig.~\\ref{fig:vieoct23155212CEST2015} for the\nmost notable configurations of exciting with the central peak of the\nMollow triplet or the leapfrog region between the central peak and a\nsatellite. All points are physical on this map, including cases with\n$g^{(2)}\\ll 1$ and $g^{(3)}\\gg 1$ (and vice-versa), although the\naccessible regions are strongly confined along curves that we can fit\nin monomial form, leading in good approximation to~$g^{(3)}\\approx 0.2\n[g^{(2)}]^2$ at low pumping (in the antibunching corner)\nand~$g^{(3)}\\approx 4.5 g^{(2)}$ at large pumpings (in the\nsuperbunching corner). We indicate positions of popular quantum\nstates such as Fock states, coherent states, thermal states and their\ncombinations. Driving with a SPS spans over great distances in this\nspace, especially when exciting with leapfrog processes, as seen in\npanel~(a) of the figure. This shows, again, how the central peak\nremains confined essentially to the antibunched corner of the map\n(excursions to bunching cases are up to~$g^{(2)}=3$). Panel~(b) is a\nzoom around small values in linear scale.  The leapfrog processes, on\nthe contrary, allow one to reach large joint values of $g^{(2)}$\nand~$g^{(3)}$. Interestingly, while the points accessible in\nthe~$(n_a,g^{(2)})$ space extend over 2D~areas, in the\n$(g^{(2)},g^{(3)})$ space they are confined to 1D~curves, showing how\nthese correlators are strongly inter-dependent, and thus making\nthe~$(n_a,g^{(2)})$ representation more prominent.\n\n\\begin{figure}\n  \\includegraphics[width=0.8\\linewidth]{figures/fig4.pdf}\n  \\caption{(Color online).  States accessible in the\n    $(g^{(2)},g^{(3)})$ space by coherent SPS excitation, at resonance\n    with the central peak (orange line) or with the leapfrog emission\n    (red line). The dashed blue line corresponds to the ``Fock duos'',\n    Eq.~(\\ref{eq:vieoct23174124CEST2015}). The same result is shown in\n    both (a) log-log and~(b) linear scales.}\n  \\label{fig:vieoct23155212CEST2015}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Variations in the type of coupling}\n\\label{sec:lunnov30102926CET2015}\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig2.pdf}\n  \\caption{(Color online). Variations in the model. (a,~b)~Adding a\n    dissipative channel to the source in the cascaded coupling spoils\n    the antibunching. (c,~d)~Increasing the coupling strength $g$ in\n    the Hamiltonian coupling (with decay in the source) enhances the\n    antibunching until it reaches the one obtained for the Hamiltonian\n    coupling without decay of the source (when $g^\\ast \\approx\n    10g$). However, the enhancement is never enough to top the\n    antibunching obtained using the coherently driven 2LS and the\n    cascaded coupling.}\n  \\label{fig2}\n\\end{figure}\n\nThe comparison between both rows of Fig.~\\ref{fig1} shows that the\ncoherent SPS is a much better quantum drive to generate bright\nantibunching than the incoherent one, even in the region where\n$n_a<1$.  The coherent SPS exciting the cavity still remains some\ndistance away from the Fock duos boundary, but it gets significantly\ncloser than with the Hamiltonian coupling.  We complete our\njuxtaposition between the two types of coupling, cascaded and\nHamiltonian, by comparing with other variations in the way the source\ncouples to its target.\n\nFirst, we consider another source of decay for the source in the\ncascaded coupling scheme, i.e., with an extra term\n$(\\gamma_\\sigma^\\ast/2)\\mathcal{L}_{\\sigma}\\rho$ in the master\nequation, leaving the coupling strength constant and equal to\n$\\sqrt{\\gamma_a \\gamma_\\sigma}/2$. This describes the situation where\nnot all the light that is lost from the source is redirected to the\ntarget. Figure~\\ref{fig2}(a-b) shows how this other source of decay\nspoils the antibunching and drives the cavity faster toward a coherent\nstate (for the coherent SPS) or to a thermal state (for the incoherent\nSPS). At $\\gamma_\\sigma^\\ast=10\\gamma_\\sigma$, the antibunching is\nworse than that obtained using the Hamiltonian coupling (without any\nadditional dissipative channel). This shows that it is better to\nminimize losses from the quantum emitter, but that unless these are\ndrastic, the impact is moderately detrimental.  Note that the cascaded\ncoupling strength can only be smaller or at most equal to\n$\\sqrt{\\gamma_1\\gamma_2}$, unlike some statements in the\nliterature~\\cite{flayac14a} that refer to ``arbitrary coupling\nstrengths''. This leads, however, to unphysical states for the target.\nSecond, in the Hamiltonian coupling, we increase the coupling strength\nand bring the system into the strong-coupling regime. This is one\nconsiderable degree of freedom of the Hamiltonian coupling that is\nlost when considering some external excitation, since photons that\ndrive the system from outside can couple to it in the first place\nbecause it is dissipative. The more efficient is the source--target\ncoupling, the more dissipative becomes the target. But a dissipative\ntarget cannot sustain quantum effects for long, as the states do\nindeed decay. Therefore there is a compromise for the target's\nlifetime to allow simultaneously an efficient driving from the source\nwhile still allowing to store long enough the imprinted quantum\nattributes. In the Hamiltonian coupling, however, coupling and decay\nare independent and one can consider a pure Hamiltonian picture with\nno decay whatsoever. We will see later in this series how one can\nremedy to this vicious circle to some extent by considering other\ntypes of quantum sources. For now, we show that, surprisingly,\ncascaded coupling indeed provides a better quantum driving than the\nHamiltonian coupling brought in the strong-coupling regime. This is\nbecause in the latter case, the reversible process from the ``target''\nback to the ``source'' acts like an effective decay. This is shown in\nFig.~\\ref{fig2}(c,d), where we compare again the maximum antibunching\nobtained in the configuration of Sec.~\\ref{sec:marnov24163921CET2015}\n(green lines) with a magnified Hamiltonian coupling $g^\\ast = N\n\\sqrt{\\gamma_a \\gamma_\\sigma}/2$ for various $N$. For both the\ncoherent and incoherent excitation cases, the antibunching is improved\nby raising the coupling strength. However, this improvement is still\nnot large enough to overcome the cascaded coupling. As seen in the\nfigure, even for large Hamiltonian coupling strengths, the\nantibunching obtained with the cascaded coupling (green line) is\nalways significantly better.  Increasing even further the value of $N$\ndoes not improve the antibunching, but makes it occur at larger\n$(\\Omega_\\sigma,\\gamma_a)$ values. At this limiting case, the\nantibunching obtained for the Hamiltonian coupling with the decay of\nthe source coincides with the antibunching for the Hamiltonian without\nthe decay of the source.  Therefore, Fid.~\\ref{fig2}(c) shows the\noptimum antibunching that can be obtained using both the cascaded and\nHamiltonian couplings.\n\nIncreasing the coupling has a much stronger effect in the case of\nincoherent excitation, as shown in Fig.~\\ref{fig2}(d). Even a small\nvariation of the coupling strength, $N=1.5$, changes significantly the\ncurvature of the antibunching curve. Increasing the value of $N$ makes\nthe system enter the ``one-atom laser'' regime~\\cite{delvalle11a}, and\nthe state in the cavity becomes coherent. As for the coherent\nexcitation, the best antibunching saturates with increasing coupling\n(converging at roughly $g^\\ast=10g$), with larger values of the\ncoupling strength merely occuring at larger $(P_\\sigma,\\gamma_a)$\nvalues. Nevertheless, although raising the coupling strength improves\nthe antibunching, and at large $g^\\ast$ the $g^{(2)}$ of the cavity at\nlarge population goes to $1$, the best antibunching is still obtained\nwith the cascaded coupling in the coherent excitation regime (green\nline in Fig.~\\ref{fig2}(d)). Overall, it is therefore established that\noptimum antibunching is obtained in the cascaded architecture. This\ncould have important consequences in the design of future\nquantum-optical devices.\n\n\\section{Summary and Conclusions}\n\\label{sec:jueoct29112554CET2015}\n\n\\begin{figure}\n  \\includegraphics[width=0.95\\linewidth]{figures/fig10.pdf}\n  \\caption{(Color online). Summary of our results: the Hilbert space\n    of an harmonic oscillator charted by the~$n_a$ (population)\n    and~$g^{(2)}$ (second-order correlation function) is accessible\n    for any point in the blue region~I (the white region is\n    forbidden). Of this region, the wider span is achieved by exciting\n    with a coherent SPS, covering the green region. This region breaks\n    down into~II, the region achieved at resonance between the source\n    and the target, III, that achieved with the excitation from a\n    satellite of the Mollow triplet and~IV that achieved with the\n    leapfrog emission. The incoherent SPS covers a smaller region,\n    deliminited by the red dotted curve. The hamiltonian coupling,\n    between the two dotted-dash yellow curves, also covers a large\n    span of the Hilbert space and is neither included nor fully\n    encludes the SPS area.  In particular, the excitation by a SPS\n    allows to provide a stronger antibunching for any given population\n    as compared to a Hamiltonian coupling, although it still remains\n    some distance away from the ideal limit.}\n  \\label{fig:miÃ©ene13175933CET2016}\n\\end{figure}\n\nOur analysis of the excitation by a SPS of a quantum harmonic\noscillator can be summarized by Fig.~\\ref{fig:miÃ©ene13175933CET2016}.\nHere we show again the charting of the Hilbert space of the quantum\nharmonic oscillator that we have introduced, along with the various\nareas that can be accessed with a SPS. First, the region~I of physical\nstates, shown in light blue, delimited by Fock duos\n(Eq.~(\\ref{eq:marnov24092156CET2015})) according to\nEq.~(\\ref{eq:miÃ©oct21181551CEST2015}). No state exists that can provide\nthe corresponding joint population and antibunching in the white\nregion.  In contrast to popular belief, states do exist in the region\nabove this boundary that satisfy~$g^{(2)}<1/2$ and $n_a>1$ which shows\nthat on mathematical grounds, the criterion $g^{(2)}<1/2$ cannot be\nused to exclude states with more than one particle. In this region of\nphysical states, the green area can be accessed in the steady state by\nexciting a cavity with a SPS, provided an\nadequate~$\\gamma_a/\\gamma_\\sigma$ ratio and pumping. The largest span\nis realized by a coherent SPS (i.e., a 2LS itself driven by a laser)\nat resonance with its target. This gives access to the light green\nregion~II. Not all states are accesible in this configuration, in\nparticular the limit of Fock duos remains some distance away from the\ndriven dissipative case. It remains an open question at this time\nwhether one can get closer using other quantum sources. States of\narbitrary populations can be reached with the coherent SPS (by using\ntargets with long enough lifetimes) that still retain\nantibunching. One can also realize states of arbitrary high bunching,\nby using leapfrog emission of the SPS in the Mollow triplet\nregime. This is the region~IV shown in dark green in\nFig.~\\ref{fig:miÃ©ene13175933CET2016}. Exciting with the satellite\npeaks covers the region~III that gives access to a small patch not\nwithin reach of~II and~IV. Other frequencies do not lead to areas not\nalready covered by these cases. The incoherent SPS does not extend\nthis territory either, as it is contained in the\narea~$2n_a/(3-2n_a)\\le g^{(2)}\\le2$, shown in dotted red.  Notably,\nthe region accessible by the Hamiltonian regime does not include nor\nis included by that accessible with the cascaded coupling.  They do\nshare some common area.  In fact, cascaded coupling reduces to\nHamiltonian coupling whenever\n$g/\\gamma_\\sigma\\ll\\gamma_a/\\gamma_\\sigma$ which, for the cascaded\ncoupling constrain of\n$g/\\gamma_\\sigma=\\sqrt{\\gamma_a/\\gamma_\\sigma}/2$, provides the\ncriterion~${\\gamma_a}/{\\gamma_\\sigma}\\gg1/4$ for which the\nconventional formalism is enough to describe excitation with no\nfeedback. This criterion allows, for instance, to develop the theory\nof frequency correlation~\\cite{delvalle12a} in a conventional setting\nwithout the explicit need of the cascaded formalism to prevent\nfeedback, a point that has not always been fully\nappreciated~\\cite{flayac14a}.  In other cases, we have shown that\ncascaded coupling allows, surprisingly, to reach regions of the\nHilbert space out of reach of a conventional Hamiltonian dynamics and,\nin particular, to improve the possible antibunching for a given\npopulation.\n\n\\section{Perspectives}\n\\label{sec:jueoct29112601CET2015}\n\nWe have considered only one aspect of the general picture of quantum\nexcitation of optical targets. Namely, various types of SPS exciting\nan harmonic oscillator. In the laboratory, this can take the form of\nexciting a passive cavity mode, or a non-interacting boson field. This\nis the configuration sketched in\nFig.~\\ref{fig:vieoct30160938CET2015}~I.~and that we addressed in this\ntext, the opening one of a series that will carry on similar studies\nto other configurations of interest, as sketched in the rest of\nFig.~\\ref{fig:vieoct30160938CET2015} and summarized here.  In the next\ntext, II., we consider the problem of exciting a 2LS rather than the\nharmonic oscillator. In part~III., we increase one step more the level\nof complexity of the target by exciting polaritons, i.e., coupled\nlight--matter systems. This focuses on different targets subjected to\nthe (quantum) light of the same type of source. In part~IV., we\nrevisit all these targets together but now excited by an even ``more\nquantum'' source than the SPS, namely, $N$-photon\nemitters~\\cite{sanchezmunoz14a}. In Section~V., we come back to all\nthe combinations dealt with so far but turning to pulsed excitation\nrather than cw, addressing the problem of quantum state\npreparation. Even with the five texts taken together, we do not\nexhaust the topic and much remains to be studied even in the\nconfigurations put to scrutiny. For instance, we considered one\nparticular type of SPS only, the simplest one as realized by a single\nemitter, while implementations from pairs of photons with one\nheralding the other (mainly through parametric down conversion~(PDC)\nand four-wave mixing (FWM)) are extremely popular and with advantages\nof their own, such as determinism. It is clear that there is much\nengineering to be done with such sources as well, and certainly some\nimprovements in their operating conditions to be gained from the\ncascaded architecture, e.g., helping to fix their principal drawback\nso far: the nonzero probability to emit more than a single\nphoton. \n\n\n\nAlso, this extended exploration of the general problem of quantum\nexcitation will give us many occasions to revisit the same aspects\nfrom different angles. For instance, in part~V., we will provide a\nclear physical picture of why the cascaded architecture allows such an\nenhancement as compared to the Hamiltonian coupling by considering the\ntime-resolved excitation of the target by the spontaneous emission of\nan initial condition prepared in the source, which can be solved\nexactly. This brings much clarification into the nature of the target\nand the source and their interrelationship in a quantum context.\n\n\\begin{figure}\n    \\includegraphics[width=.85\\linewidth]{figures/fig-last.pdf}\n    \\caption{(Color online). Exciting with Quantum Light: the basic\n      configurations we propose to study in this series of\n      texts. Part~I is the current work, exciting an harmonic\n      oscillator (single cavity mode) with a SPS. Part~II addresses\n      the excitation of a 2LS with a SPS. Part~III is exciting coupled\n      light-matter systems, or polaritons, still with a SPS. Following\n      the comprehensive treatments of these several targets under the\n      cw excitation from a SPS, we then trade this simple quantum\n      source for, IV, a $N$--photon emitter (bundler) and, V, a pulsed\n      quantum source, impinging on all the targets previously\n      considered.}\n  \\label{fig:vieoct30160938CET2015}\n\\end{figure}\n\n\\begin{acknowledgments}\n  We thank C. S\\'anchez Mu\\~noz and E. del Valle for constant\n  discussions. Funding by the POLAFLOW ERC project No.~308136 is\n  acknowledged.\n\\end{acknowledgments}\n\n\\appendix\n\\section{Proof that Fock duos bound the $(n_a,g^{(2)})$ space}\n\\label{sec:marnov24122827CET2015}\n\nWe prove mathematically that there are no states below the boundary\nset by Eq.~(\\ref{eq:miÃ©oct21181551CEST2015}) but at least one for\nevery point above, thus showing that our charting of the Hilbert space\nin the $(n_a,g^{(2)})$ space as defined by this boundary is\ncomplete.\\\\%  Readers satisfied with the physical and numerical arguments\n\n\n\n\\begin{proposition}\n  \\emph{For a given population $n_a\\in\\mathbb{R}$, the maximum\n    antibunching is given by a superposition of at most two\n    consecutive Fock states.}\n\\end{proposition}\n\nFirst, for any~$n_a\\in\\mathbb{R}$, there exists a superposition of at most\ntwo consecutive Fock states that provides this population, namely:\n\n\n", "index": 39, "text": "\\begin{equation}\n  \\label{eq:vieoct23174124CEST2015}\n  \\sqrt{\\lfloor n_a \\rfloor-n_a+1}\\left| {\\lfloor n_a \\rfloor}\\right\\rangle+\\sqrt{n_a-\\lfloor n_a \\rfloor}\\left| {\\lfloor n_a \\rfloor+1}\\right\\rangle\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\sqrt{\\lfloor n_{a}\\rfloor-n_{a}+1}\\left|{\\lfloor n_{a}\\rfloor}\\right\\rangle+%&#10;\\sqrt{n_{a}-\\lfloor n_{a}\\rfloor}\\left|{\\lfloor n_{a}\\rfloor+1}\\right\\rangle\\,.\" display=\"block\"><mrow><mrow><mrow><msqrt><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow></msqrt><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⟩</mo></mrow></mrow><mo>+</mo><mrow><msqrt><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow></msqrt><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nwhere we remind that $p(n)=|\\alpha_n|^2$ and is such that\n$\\sum_{n=0}^\\infty p(n)=1$. Restricting ourselves to states with the\nsame population implies:\n\n\n", "itemtype": "equation", "pos": 65771, "prevtext": "\n\nWe can write without loss of generality the generic\nstate~(\\ref{eq:miÃ©oct21094346CEST2015}) as:\n\n\n", "index": 41, "text": "\\begin{equation}\n  \\label{eq:vieoct23175317CEST2015}\n \\sum_{k=-\\lfloor n_a \\rfloor}^\\infty\\sqrt{p(\\lfloor n_a \\rfloor+k)}\\left| {\\lfloor n_a \\rfloor+k}\\right\\rangle\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\sum_{k=-\\lfloor n_{a}\\rfloor}^{\\infty}\\sqrt{p(\\lfloor n_{a}\\rfloor+k)}\\left|{%&#10;\\lfloor n_{a}\\rfloor+k}\\right\\rangle\\,,\" display=\"block\"><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><msqrt><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo rspace=\"4.2pt\">⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nThe second order correlation function for such states is then found as:\n\n\n", "itemtype": "equation", "pos": 66108, "prevtext": "\n\nwhere we remind that $p(n)=|\\alpha_n|^2$ and is such that\n$\\sum_{n=0}^\\infty p(n)=1$. Restricting ourselves to states with the\nsame population implies:\n\n\n", "index": 43, "text": "\\begin{equation}\n  \\label{eq:vieoct23181019CEST2015}\n  \\sum_{k=-\\lfloor n_a \\rfloor}^\\infty p({\\lfloor n_a \\rfloor+k})(\\lfloor n_a \\rfloor+k)=n_a\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\sum_{k=-\\lfloor n_{a}\\rfloor}^{\\infty}p({\\lfloor n_{a}\\rfloor+k})(\\lfloor n_{%&#10;a}\\rfloor+k)=n_{a}\\,.\" display=\"block\"><mrow><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msub><mi>n</mi><mi>a</mi></msub></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nSince $n_a$ is the same for both\nstates~(\\ref{eq:vieoct23174124CEST2015})\nand~(\\ref{eq:vieoct23175317CEST2015}) when\nEq.~(\\ref{eq:vieoct23181019CEST2015}) is satisfied, it is enough for\nthe comparison of their antibunching to consider the difference of\ntheir $n_a^2g^{(2)}$ (effectively getting rid of the denominator,\nwhich simplifies the notations). We call this difference~$\\Delta\nG^{(2)}$ and find, from Eq.~(\\ref{eq:miÃ©oct21181551CEST2015})\nand~(\\ref{eq:vieoct23181207CEST2015}):\n\n\\begin{widetext}\n  \n", "itemtype": "equation", "pos": 66346, "prevtext": "\n\nThe second order correlation function for such states is then found as:\n\n\n", "index": 45, "text": "\\begin{equation}\n  \\label{eq:vieoct23181207CEST2015}\n  g^{(2)}=\\sum_{k=-\\lfloor n_a \\rfloor}^\\infty (\\lfloor n_a \\rfloor+k)(\\lfloor n_a \\rfloor+k-1)p(\\lfloor n_a \\rfloor+k)/n_a^2\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"g^{(2)}=\\sum_{k=-\\lfloor n_{a}\\rfloor}^{\\infty}(\\lfloor n_{a}\\rfloor+k)(%&#10;\\lfloor n_{a}\\rfloor+k-1)p(\\lfloor n_{a}\\rfloor+k)/n_{a}^{2}\\,.\" display=\"block\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow></mrow><mi mathvariant=\"normal\">∞</mi></munderover><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mpadded width=\"+1.7pt\"><msubsup><mi>n</mi><mi>a</mi><mn>2</mn></msubsup></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\\end{widetext}\n\nwhere we have separated the terms $k=0,1$ from the sum and re-arranged\nthe factors. Now, since $p(\\lfloor n_a \\rfloor+1) = 1-p(\\lfloor n_a\n\\rfloor) -\\sum_{k\\neq \\lbrace 0,1\\rbrace} p({\\lfloor n_a \\rfloor+k})$\nfrom the probability normalization, we arrive to:\n\n\n", "itemtype": "equation", "pos": 67050, "prevtext": "\n\nSince $n_a$ is the same for both\nstates~(\\ref{eq:vieoct23174124CEST2015})\nand~(\\ref{eq:vieoct23175317CEST2015}) when\nEq.~(\\ref{eq:vieoct23181019CEST2015}) is satisfied, it is enough for\nthe comparison of their antibunching to consider the difference of\ntheir $n_a^2g^{(2)}$ (effectively getting rid of the denominator,\nwhich simplifies the notations). We call this difference~$\\Delta\nG^{(2)}$ and find, from Eq.~(\\ref{eq:miÃ©oct21181551CEST2015})\nand~(\\ref{eq:vieoct23181207CEST2015}):\n\n\\begin{widetext}\n  \n", "index": 47, "text": "\\begin{align*}\n    \\Delta G^{(2)} &= \\sum_{k=-\\lfloor n_a \\rfloor}^\\infty (\\lfloor n_a \\rfloor+k)(\\lfloor n_a \\rfloor+k-1)p({\\lfloor n_a \\rfloor+k}) -\\lfloor n_a \\rfloor(\\lfloor n_a \\rfloor-1)(\\lfloor n_a \\rfloor-n_a+1)-\\lfloor n_a \\rfloor(\\lfloor n_a \\rfloor+1)(n_a-\\lfloor n_a \\rfloor)+{}\\,,\\\\\n    &\n    \\begin{aligned}\n      {}=&\\left[\\sum_{k\\neq \\lbrace 0,1\\rbrace}(\\lfloor n_a\n        \\rfloor+k)(\\lfloor n_a \\rfloor+k-1)p({\\lfloor n_a\n          \\rfloor+k})\\right]+{}\\\\&{}+\\lfloor n_a \\rfloor(\\lfloor n_a\n      \\rfloor-1)(p({\\lfloor n_a \\rfloor})-\\lfloor n_a\n      \\rfloor+n_a)+\\lfloor n_a \\rfloor(\\lfloor n_a\n      \\rfloor+1)(p({\\lfloor n_a \\rfloor+1})-(n_a-\\lfloor n_a\n      \\rfloor))\\, ,\n    \\end{aligned}\n  \\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Delta G^{(2)}\" display=\"inline\"><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>G</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{k=-\\lfloor n_{a}\\rfloor}^{\\infty}(\\lfloor n_{a}\\rfloor+k)(%&#10;\\lfloor n_{a}\\rfloor+k-1)p({\\lfloor n_{a}\\rfloor+k})-\\lfloor n_{a}\\rfloor(%&#10;\\lfloor n_{a}\\rfloor-1)(\\lfloor n_{a}\\rfloor-n_{a}+1)-\\lfloor n_{a}\\rfloor(%&#10;\\lfloor n_{a}\\rfloor+1)(n_{a}-\\lfloor n_{a}\\rfloor)+{}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow></mrow><mi mathvariant=\"normal\">∞</mi></munderover></mstyle><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\">+</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\begin{aligned} \\displaystyle{}=&amp;\\displaystyle\\left[\\sum_{k\\neq\\{%&#10;0,1\\}}(\\lfloor n_{a}\\rfloor+k)(\\lfloor n_{a}\\rfloor+k-1)p({\\lfloor n_{a}%&#10;\\rfloor+k})\\right]+\\\\&#10;&amp;\\displaystyle{}+\\lfloor n_{a}\\rfloor(\\lfloor n_{a}\\rfloor-1)(p({\\lfloor n_{a}%&#10;\\rfloor})-\\lfloor n_{a}\\rfloor+n_{a})+\\lfloor n_{a}\\rfloor(\\lfloor n_{a}%&#10;\\rfloor+1)(p({\\lfloor n_{a}\\rfloor+1})-(n_{a}-\\lfloor n_{a}\\rfloor))\\,,\\end{aligned}\" display=\"inline\"><mtable columnspacing=\"0pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>[</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>≠</mo><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo>,</mo><mn>1</mn><mo stretchy=\"false\">}</mo></mrow></mrow></munder></mstyle><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>+</mo></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mrow><mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo>+</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nOn the other hand, from Eq.~(\\ref{eq:vieoct23181019CEST2015}), we can isolate:\n\n\n", "itemtype": "equation", "pos": 68054, "prevtext": "\n\\end{widetext}\n\nwhere we have separated the terms $k=0,1$ from the sum and re-arranged\nthe factors. Now, since $p(\\lfloor n_a \\rfloor+1) = 1-p(\\lfloor n_a\n\\rfloor) -\\sum_{k\\neq \\lbrace 0,1\\rbrace} p({\\lfloor n_a \\rfloor+k})$\nfrom the probability normalization, we arrive to:\n\n\n", "index": 49, "text": "\\begin{multline}\n  \\label{eq:vieoct23190530CEST2015}\n  \\Delta G^{(2)}=\n  \\left[\\sum_{k\\neq \\lbrace 0,1\\rbrace} (k-1)(2\\lfloor n_a \\rfloor+k)p({\\lfloor n_a \\rfloor+k})\\right]\\\\{}-2\\lfloor n_a \\rfloor (p({\\lfloor n_a \\rfloor})-{\\lfloor n_a \\rfloor}+n_a-1)\\,.\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Delta G^{(2)}=\\left[\\sum_{k\\neq\\{0,1\\}}(k-1)(2\\lfloor n_{a}%&#10;\\rfloor+k)p({\\lfloor n_{a}\\rfloor+k})\\right]\\\\&#10;\\displaystyle{}-2\\lfloor n_{a}\\rfloor(p({\\lfloor n_{a}\\rfloor})-{\\lfloor n_{a}%&#10;\\rfloor}+n_{a}-1)\\,.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>G</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo>=</mo><mrow><mo>[</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>≠</mo><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo>,</mo><mn>1</mn><mo stretchy=\"false\">}</mo></mrow></mrow></munder><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo>+</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo>-</mo><mn>1</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nwhich, injected back in Eq.~(\\ref{eq:vieoct23190530CEST2015}), yields:\n\n\n", "itemtype": "equation", "pos": 68407, "prevtext": "\n\nOn the other hand, from Eq.~(\\ref{eq:vieoct23181019CEST2015}), we can isolate:\n\n\n", "index": 51, "text": "\\begin{equation}\n p({\\lfloor n_a \\rfloor}) = \\lfloor n_a \\rfloor-n_a+1+\\sum_{k\\neq \\lbrace 0,1\\rbrace }(k-1)p({\\lfloor n_a \\rfloor+k})\\,,\\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"p({\\lfloor n_{a}\\rfloor})=\\lfloor n_{a}\\rfloor-n_{a}+1+\\sum_{k\\neq\\{0,1\\}}(k-1%&#10;)p({\\lfloor n_{a}\\rfloor+k})\\,,\\\\&#10;\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo>+</mo><mn>1</mn><mo>+</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>≠</mo><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo>,</mo><mn>1</mn><mo stretchy=\"false\">}</mo></mrow></mrow></munder><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nThis is the final result, since all the terms in the sum are\nnon-negative, we can conlude that~$\\Delta G^{(2)}\\ge 0$. The\ninequality is maximized when \\emph{all} the probabilities $p({\\lfloor\n  n_a \\rfloor+k})=0$ for $k\\neq\\lbrace0,1\\rbrace$, i.e., for the\nstates of type~(\\ref{eq:vieoct23174124CEST2015}).  When $n_a$ is an\ninteger, i.e., $\\lfloor n_a \\rfloor=n_a$, the maximum antibunching is\nobtained with the Fock state $\\left| {n_a}\\right\\rangle$. QED.\n\n\\begin{proposition}\n  \\emph{For a given population $n_a\\in\\mathbb{R}$ and any positive\n    real number~$\\delta$, there is at least one state such that\n    $\\Delta G^{(2)}=\\delta$.}\n\\end{proposition}\n\nLet's consider the set of states with population $n_a=\\sum_n n p(n)$. We can \nconstruct a state $\\rho_0$ with population $n_a$ in the following way:\n\n", "itemtype": "equation", "pos": 68635, "prevtext": "\n\nwhich, injected back in Eq.~(\\ref{eq:vieoct23190530CEST2015}), yields:\n\n\n", "index": 53, "text": "\\begin{align*}\n  \\Delta G^{(2)}=\\sum_{k\\neq \\lbrace 0,1\\rbrace} k(k-1)p({\\lfloor n_a \\rfloor+k})\\, .\\\\\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Delta G^{(2)}=\\sum_{k\\neq\\{0,1\\}}k(k-1)p({\\lfloor n_{a}\\rfloor+k%&#10;})\\,.\" display=\"inline\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>G</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>≠</mo><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo>,</mo><mn>1</mn><mo stretchy=\"false\">}</mo></mrow></mrow></munder></mstyle><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>+</mo><mi>k</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nImposing the population constraint, we obtain the following condition:\n\n", "itemtype": "equation", "pos": 69560, "prevtext": "\n\nThis is the final result, since all the terms in the sum are\nnon-negative, we can conlude that~$\\Delta G^{(2)}\\ge 0$. The\ninequality is maximized when \\emph{all} the probabilities $p({\\lfloor\n  n_a \\rfloor+k})=0$ for $k\\neq\\lbrace0,1\\rbrace$, i.e., for the\nstates of type~(\\ref{eq:vieoct23174124CEST2015}).  When $n_a$ is an\ninteger, i.e., $\\lfloor n_a \\rfloor=n_a$, the maximum antibunching is\nobtained with the Fock state $\\left| {n_a}\\right\\rangle$. QED.\n\n\\begin{proposition}\n  \\emph{For a given population $n_a\\in\\mathbb{R}$ and any positive\n    real number~$\\delta$, there is at least one state such that\n    $\\Delta G^{(2)}=\\delta$.}\n\\end{proposition}\n\nLet's consider the set of states with population $n_a=\\sum_n n p(n)$. We can \nconstruct a state $\\rho_0$ with population $n_a$ in the following way:\n\n", "index": 55, "text": "\\begin{multline*}\n\\rho_0 = p(0) \\left| {{0}}\\right\\rangle\\left\\langle {{0}}\\right| +p(\\lfloor n_a \\rfloor) \\left| {{\\lfloor n_a \\rfloor}}\\right\\rangle\\left\\langle {{\\lfloor n_a \\rfloor}}\\right| \\\\\n+ (1-p(0) - p(\\lfloor n_a \\rfloor))\\left| {{k}}\\right\\rangle\\left\\langle {{k}}\\right|\\, .\n\\end{multline*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"p28.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\rho_{0}=p(0)\\left|{{0}}\\right\\rangle\\left\\langle{{0}}\\right|+p(%&#10;\\lfloor n_{a}\\rfloor)\\left|{{\\lfloor n_{a}\\rfloor}}\\right\\rangle\\left\\langle{{%&#10;\\lfloor n_{a}\\rfloor}}\\right|\\\\&#10;\\displaystyle+(1-p(0)-p(\\lfloor n_{a}\\rfloor))\\left|{{k}}\\right\\rangle\\left%&#10;\\langle{{k}}\\right|\\,.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><msub><mi>ρ</mi><mn>0</mn></msub><mo>=</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mn>0</mn><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mn>0</mn><mo fence=\"true\">|</mo><mrow><mo>+</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\">|</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo fence=\"true\">|</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>k</mi><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mi>k</mi><mo fence=\"true\" rspace=\"4.2pt\">|</mo></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nwhere we have assumed that $\\lfloor n_a \\rfloor < k \\in \\mathbb{N}$. The $g^{(2)}=g^{(2)}_\\ast+\\delta$ of this state is given by,\n\n", "itemtype": "equation", "pos": 69934, "prevtext": "\nImposing the population constraint, we obtain the following condition:\n\n", "index": 57, "text": "\\begin{equation*}\np(0) = \\left( \\frac{k-n_a}{k}\\right)-p(\\lfloor n_a \\rfloor)\\left(\\frac{k-\\lfloor n_a \\rfloor}{k} \\right)\\, ,\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"p(0)=\\left(\\frac{k-n_{a}}{k}\\right)-p(\\lfloor n_{a}\\rfloor)\\left(\\frac{k-%&#10;\\lfloor n_{a}\\rfloor}{k}\\right)\\,,\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mfrac><mrow><mi>k</mi><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mi>k</mi></mfrac><mo>)</mo></mrow><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mi>k</mi><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mi>k</mi></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nfrom which we can obtain $p(\\lfloor n_a \\rfloor)$:\n\n", "itemtype": "equation", "pos": 70207, "prevtext": "\nwhere we have assumed that $\\lfloor n_a \\rfloor < k \\in \\mathbb{N}$. The $g^{(2)}=g^{(2)}_\\ast+\\delta$ of this state is given by,\n\n", "index": 59, "text": "\\begin{multline*}\ng^{(2)} n_a^2 = \\lfloor n_a \\rfloor(\\lfloor n_a \\rfloor-1)p(\\lfloor n_a \\rfloor) \\\\\n+ k(k-1)(1-p(0)-p(\\lfloor n_a \\rfloor))\\, ,\n\\end{multline*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"p30.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle g^{(2)}n_{a}^{2}=\\lfloor n_{a}\\rfloor(\\lfloor n_{a}\\rfloor-1)p(%&#10;\\lfloor n_{a}\\rfloor)\\\\&#10;\\displaystyle+k(k-1)(1-p(0)-p(\\lfloor n_{a}\\rfloor))\\,,\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>n</mi><mi>a</mi><mn>2</mn></msubsup></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo>+</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nIf $\\delta>0$ we can find an integer number $k> \\textrm{max}(n_a\ng^{(2)},\\lfloor n_a \\rfloor)$ such that $0\\leq p(\\lfloor n_a\n\\rfloor)\\leq 1$. Considering that this state is not made of two\nconsecutive Fock states, the accessible $g^{(2)}$s are larger than\n$g^{(2)}_\\ast$. Of course, when $p(0)=0$ and $k=\\lfloor n_a\n\\rfloor+1$, $\\rho_0$ is the maximally antibunched state and $g^{(2)} =\ng^{(2)}_\\ast$.  When $n_a<1$, $\\lfloor n_a \\rfloor=0$, and the\nprocedure above fails. In such case, we can build another state,\n\n", "itemtype": "equation", "pos": 70420, "prevtext": "\nfrom which we can obtain $p(\\lfloor n_a \\rfloor)$:\n\n", "index": 61, "text": "\\begin{equation*}\np(\\lfloor n_a \\rfloor) = \\frac{n_a\\left( k-1-n_a g^{(2)}\\right)}{\\lfloor n_a \\rfloor(k-\\lfloor n_a \\rfloor)}\\, .\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"p(\\lfloor n_{a}\\rfloor)=\\frac{n_{a}\\left(k-1-n_{a}g^{(2)}\\right)}{\\lfloor n_{a%&#10;}\\rfloor(k-\\lfloor n_{a}\\rfloor)}\\,.\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn><mo>-</mo><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>⁢</mo><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup></mrow></mrow><mo>)</mo></mrow></mrow><mrow><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mrow><mo stretchy=\"false\">⌊</mo><msub><mi>n</mi><mi>a</mi></msub><mo stretchy=\"false\">⌋</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nsuch that $n_a = p(1) + k(1-p(0)-p(1))$. From this constraint we\nobtain the following condition:\n\n\n", "itemtype": "equation", "pos": 71083, "prevtext": "\nIf $\\delta>0$ we can find an integer number $k> \\textrm{max}(n_a\ng^{(2)},\\lfloor n_a \\rfloor)$ such that $0\\leq p(\\lfloor n_a\n\\rfloor)\\leq 1$. Considering that this state is not made of two\nconsecutive Fock states, the accessible $g^{(2)}$s are larger than\n$g^{(2)}_\\ast$. Of course, when $p(0)=0$ and $k=\\lfloor n_a\n\\rfloor+1$, $\\rho_0$ is the maximally antibunched state and $g^{(2)} =\ng^{(2)}_\\ast$.  When $n_a<1$, $\\lfloor n_a \\rfloor=0$, and the\nprocedure above fails. In such case, we can build another state,\n\n", "index": 63, "text": "\\begin{equation*}\n\\rho_1 = p(0) \\left| {{0}}\\right\\rangle\\left\\langle {{0}}\\right| + p(1) \\left| {{1}}\\right\\rangle\\left\\langle {{1}}\\right| + (1-p(0)-p(1))\\left| {{k}}\\right\\rangle\\left\\langle {{k}}\\right|\\, ,\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"\\rho_{1}=p(0)\\left|{{0}}\\right\\rangle\\left\\langle{{0}}\\right|+p(1)\\left|{{1}}%&#10;\\right\\rangle\\left\\langle{{1}}\\right|+(1-p(0)-p(1))\\left|{{k}}\\right\\rangle%&#10;\\left\\langle{{k}}\\right|\\,,\" display=\"block\"><mrow><mrow><msub><mi>ρ</mi><mn>1</mn></msub><mo>=</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mn>0</mn><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mn>0</mn><mo fence=\"true\">|</mo><mrow><mo>+</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo fence=\"true\">|</mo><mn>1</mn><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mn>1</mn><mo fence=\"true\">|</mo><mrow><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo fence=\"true\">|</mo><mi>k</mi><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>⟨</mo><mi>k</mi><mo fence=\"true\" rspace=\"4.2pt\">|</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\n\nThe $g^{(2)}$ of this state is given by,\n\n", "itemtype": "equation", "pos": 71408, "prevtext": "\nsuch that $n_a = p(1) + k(1-p(0)-p(1))$. From this constraint we\nobtain the following condition:\n\n\n", "index": 65, "text": "\\begin{equation*}\np(1) = \\frac{k(1-p(0))-n_a}{k-1}\\, .\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex10.m1\" class=\"ltx_Math\" alttext=\"p(1)=\\frac{k(1-p(0))-n_{a}}{k-1}\\,.\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nfrom which we conclude that:\n \n", "itemtype": "equation", "pos": 71521, "prevtext": "\n\nThe $g^{(2)}$ of this state is given by,\n\n", "index": 67, "text": "\\begin{align*}\ng^{(2)}n_a^2 &= k(k-1)(1-p(0)-p(1))\\, ,\\\\\n\t&= k(n_a+p(0)-1)\\, ,\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle g^{(2)}n_{a}^{2}\" display=\"inline\"><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>n</mi><mi>a</mi><mn>2</mn></msubsup></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=k(k-1)(1-p(0)-p(1))\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex12.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=k(n_{a}+p(0)-1)\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>n</mi><mi>a</mi></msub><mo>+</mo><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06187.tex", "nexttext": "\nAgain, we can always find an integer $k>1$, such that $0\\leq p(0) \\leq 1$. \n\n\n\\bibliographystyle{naturemag}\n\\bibliography{Sci,arXiv,books}\n\n\n", "itemtype": "equation", "pos": 71643, "prevtext": "\nfrom which we conclude that:\n \n", "index": 69, "text": "\\begin{equation*}\n p(0) = \\frac{g^{(2)}n_a^2+k(1-n_a)}{k}\\, .  \n \\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex13.m1\" class=\"ltx_Math\" alttext=\"p(0)=\\frac{g^{(2)}n_{a}^{2}+k(1-n_{a})}{k}\\,.\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>n</mi><mi>a</mi><mn>2</mn></msubsup></mrow><mo>+</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>n</mi><mi>a</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mi>k</mi></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}]