[{"file": "1601.04051.tex", "nexttext": "\n\n\\noindent where $S(f)$ is the spectral density (i.e. power spectrum), $\\gamma$ is \ntypically between 0.5-2,\nand $f_{\\rm{min}}$ and $f_{\\rm{max}}$ are cutoffs beyond which the power law \ndoes not hold. In this paper will describe these distributions as having flicker noise. \n\nIn the case of a time-domain astronomical \nsource, this results in uniformity on short timescales, i.e. a burst of \nclustered events followed by extended periods of quiescence. \nIf FRBs were to exhibit such flicker noise then their repetition would \nnot only be non-periodic, but would also have a time-varying \npulse rate and, more importantly, variance. Therefore the number of events\nseen in a follow-up observation would depend strongly on \nthe time passed since the initial event.\n\nIn \\cite{2015MNRAS.454..457P}\nthe fields of eight FRBs discovered between 2009 and 2013\nwere followed up from April to October of 2014, for an average \nof 11.4 hours per field. During this follow-up programme \nFRB 140514 was found in the same beam as FRB 110220, however\nthe authors argue that it is likely a new source due to its lower DM. \nAfter its discovery, the field of 140514 was monitored \nfive more times, starting 41 days later on 2014-06-24, without seeing anything.\nUnder the assumption that 140514 was a new FRB \nthat only showed up in the same field \ncoincidentally and that the repeat rate is constant,\n \\cite{2015MNRAS.454..457P} rule out repetition with a period $P \\le$ 8.6 \nhours and reject 8.6 $<$ $P$ $<$ 21 hours with 90$\\%$ confidence.\nHowever it is possible that one or both of those premises \nis invalid, so it is useful to explore the possibility of non-stationary \nrepeat rate statistics and repeating FRBs with variable DM. \n\nIf the statistics of the FRB's repeat rate were\nnon-Poissonian and initial bursts from FRBs were to have aftershocks\nsimilar to earthquakes, then the non-immediate follow-up observations \nimpose far weaker repeat rate limits than has been suggested. We \nconstructed a mock follow-up observation of the eight FRBs whose\nfields were observed in \\cite{2015MNRAS.454..457P}. We then \nasked how many bursts are seen to repeat if we do an immediate\nfollow-up vs. a follow-up several years after the initial event \nat times corresponding \nto the actual observations carried out. \n\nWe run a simple Monte Carlo \nsimulation with one sample per hour and a probability of 0.5 \nthat a given sample has a burst in it. The repeat rate of once per two hours\nis chosen arbitrarily and should not affect the comparison. To get the \n1$/f^{\\gamma}$ distribution we\ntake an uncorrelated Gaussian time stream centred on 0 and move to Fourier space, then \nmultiply by $f^{\\gamma / 2}$, which gives a power spectrum with the desired shape. \nWe then inverse Fourier transform back to get the pink or red time stream.\nWe then take samples with a positive value to contain a pulse and samples with a negative value to contain none.. \nIn the stationary Poisson case, the rate of bursts in \nthe immediate follow-up is the same as the multi-year follow-up \nsince all times are \nstatistically equivalent. However with flicker noise \nthe variance is strongly time-dependent. If we imagine an object that \nrepeated on average once per two hours, then if those pulses were Poisson-distributed \nthe probability of seeing zero bursts in 11.4 hours or longer is $\\sim0.007$. With \npink noise one expects this roughly 20$\\%$ of the time, since the system \nprefers either to be in ``on\" or ``off\" mode. If the average repeat period were more \nlike 5-20 hours, then we would often see nothing in a multi-day follow-up \nobservation that took place weeks or years after the initial event.\n\nThis is consistent with what \\cite{2015MNRAS.454..457P} saw, though the \nconclusions differ depending on the assumed statistics. In Figure \\ref{FIG-RATE}\nwe show a sample from this simulation for three repeat distributions. The right panel \nshows how, if an FRB's burst rate has long-term correlations (1$/f^\\gamma$), \nthe likelihood of a repeat is greatly increased if the follow-up observation is \nimmediately after the initial event, rather than months or years after. \n\n\n\\begin{figure}\n  \\centering\n   \\includegraphics[trim={1in, 0in, 1in, 0in}, width=0.45\\textwidth, height=0.29\\textwidth]{frb_sim_pink24.png}\n   \\caption{Realization of our mock follow-up Monte Carlo. \\textit{Left panel}: Power spectrum for pulse arrival times of a single FRB.\n   Grey shows a flat spectrum, corresponding to the often assumed Poissonian \n   repetition rate. The red and blue spectra show flicker noise, with pink (1/$f$) \n   noise and Brownian (1/$f^2$) noise respectively. \\textit{Right panel}: \n   We found the first ``event\" in our Monte Carlo (represented by a star) for the three different spectra \n   and plotted their behaviour in the subsequent 48 hours of follow-up. Though the average\n   probability over the whole simulation is 0.5 for each distribution, when we zoom in \n   on this short period the strong time-like correlations \n   in the $1/f^\\gamma$ cases means there are many repetitions: they are in an ``on\" state at this time.}\n   \\label{FIG-RATE}\n\\end{figure}\n\n\n\\subsection{FRBs 110220 and 140514}\nUsing the event rate of roughly $10^4$ sky$^{-1}$ day$^{-1}$\nfrom \\cite{2013Sci...341...53T}, it \nwas originally reported that the probability of seeing a \nnew FRB in the field of 110220 during the 85 hours of follow-up \nwas $0.32$  \n\\citep{2015MNRAS.447..246P}. It was then pointed out by \\cite{2015arXiv150701002M} \nthat this underestimated the coincidence by an order of magnitude, \nsince they estimated the rate in any one of the 13 beams, \nwhile the new event occurred in the identical beam.\nThe probability also dropped due to the updated daily event rate,\ngiven the \\cite{2013Sci...341...53T} estimate is now thought likely to be too high. \nIn general we expect the true rate of FRBs to be lower than what is \nreported due to non-publication bias: If archival data are searched and \nnothing is found, it is less likely to be published than if something is found. \nThat said, using the rate calculated by \\cite{2015arXiv150500834R} and following\nthe procedure of \\cite{2015arXiv150701002M}, we find the likelihood of finding a new burst to be \nbetween 0.25-2.5$\\%$.\n\nGiven the relatively low probability of finding \na new FRB in the same field and since there are models that predict\nburst repetition with variable DMs \\citep{2015arXiv150505535C, 2015arXiv150701002M}\none can ask the question: If one FRB out of eight is found to\nrepeat during 110 hours of follow-up (including extra time spent on 140514), \nwhat are the limits on the average\nrepeat period? Another way of asking this question is what is the probability of \n some number of repetitions during the 110 hours, given a repeat rate. The answer to \nthis question depends strongly on the power spectrum's shape. For the sake of example, if the average \nrepeat rate is once per two hours, then the probability of one repeat or fewer in the Poisson\ncase is effectively zero. With a pink distribution it is closer to $5\\%$, even though \nthe expected number would be 55. This is \nshown in Figure \\ref{FIG-hist}, in which we plot the probability of seeing zero or one repeat burst \n(the two options for FRB 140514), given some average repetition period, $P$. \nWe generate the pink distribution in the same way described in Section \\ref{flicker}, \nusing one-hour samples and a long-wavelength cutoff at 1.2 million hours. Though \nit was taken arbitrarily, the probability of seeing no bursts should depend only \nweakly on this cutoff. Since the variance scales logarithmically with this number, \nthere is only roughly a factor of three \ndifference in total power between our choice and $f_{\\rm{min}}\\sim$ an inverse Hubble time. \nWhile we remain agnostic about the relationship between 140514 and 110220, with \nnon-Poissonian repetition it is possible to have a relatively high repeat rate \nand to see either one or zero repeat bursts in several days of observation. \n\n\n\\begin{figure}\n  \\centering\n   \\includegraphics[trim={0in, 0in, 0in, 0in}, width=0.43\\textwidth, height=0.3\\textwidth]{repeat_rate_limit.png}\n   \\caption{The probability of seeing zero (blue curve) or one (red curve) repeat burst\n   in 110 hours of follow-up, assuming a 1/$f$ distribution.  \n   The curves are derived from a simple Monte Carlo in which a\n   pink distribution was generated with one sample per hour, \n   and we asked how many bursts were seen in 110 samples. Thousands of 110-hour realizations\n   were then averaged for each repeat period, $P$. \n   Even with an average \n   repeat rate of once every two hours, there is still a 5$\\%$ chance (indicated by the dashed line) of seeing one or\n   fewer bursts, despite the expected value of 55.}\n   \\label{FIG-hist}\n\\end{figure}\n\n\n\\section{Event rates and total number of sources}\n\\label{rate}\n\nIf FRBs were found to repeat, their statistics and the\naverage frequency of their repetition \nshould affect the search strategy of upcoming surveys. \nFor instance, if it were found that FRBs repeated,\non average, five times a day, then the number of unique \nsources would be five times smaller than the per-sky \ndaily event rate. This means the daily rate \n$3.3^{+5.0}_{-2.5}\\times10^3$ sky$^{-1}$ estimated by \n\\cite{2015arXiv150500834R} would be produced by\nonly $\\sim$160-1600 sources. In this scenario \nthere is no FRB in most pixels on the sky, which means\none could integrate on most patches forever without \nseeing an event. An example of this strategy is the VLA millisecond search, \nin which $\\sim40\\%$ of the time was spent at a single pointing, and\nalmost three quarters of the time was spent at just three locations \\citep{2015ApJ...807...16L}.\nIt is possible that pointing-to-pointing event rate variance contributed \nto their not seeing anything.\n\nWe therefore warn that deep surveys are at a disadvantage \nto those that sweep large regions of the sky \n(CHIME  \\citep{2014SPIE.9145E..22B}, \nUTMOST\\footnote{http://www.caastro.org/news/2014-utmost}, HIRAX)\nbecause the non-repeating \nscenario is unaffected; whereas shallow observations \nshould not hurt the detection rate, no matter what their repetition. \nIdeally, a survey\nneeds only to spend a few dispersion delay times on each beam \nbefore moving on. \n\n\\section{Latitudinal dependence}\n\\label{latitude}\n\nThere is now evidence that the FRB rate is nonuniform on the sky, \nwith fewer detectable events at low Galactic latitudes \\citep{2014ira..book.....B}.\nHowever the statistical significance of this finding may be \noverestimated. \\cite{2014ApJ...789L..26P}\ncompute the probability of the disparity between the number of \nbursts seen in the high- and intermediate-latitude ($|b| < 15\\degree$)\ncomponents of the High Time Resolution Universe survey \n(HTRU). They calculate the probability of seeing $N=0$ in the intermediate \nlatitude survey and $M=4$ in \nthe high-latitude, despite having searched 88$\\%$ more data in the former, and they \nrule out the uniform sky hypothesis with 99.5$\\%$ certainty. We would point out \nthat in general $P(N|M)$ describes a very specific outcome, and it would be \nmore appropriate to include all outcomes equally or more unlikely.\nThat number might also be multiplied by two, since if the survey found \nfour intermediate-latitude FRBs and zero high-lat ones, we would ask the same \nquestion. \n\nBut a simpler approach to this problem would be analogous to a series of \ncoin flips. If a coin were flipped four times, the probability of seeing all heads is 1/16, \nor 6.25$\\%$. This is a factor of six higher than  the analogous analysis of \n\\citet{2014ApJ...789L..26P}.  We can test the null hypothesis that the coin is fair, and using\nthe binomial statistic would conclude that the outcome is consistent with a \nfair coin at 95\\% confidence, differing from the conclusion of \\citet{2014ApJ...789L..26P}.\nIn the FRB case the Universe is flipping a coin each time a new burst \nappears, with some bias factor due to things like different integration times.\nHTRU \nhas since reported five more bursts in the high Galactic region, but using a dataset \nthat spent $\\sim$2.5 times more time at high latitudes. Below we try and quantify the likelihood of \nthis.\n\n\nIf one wants to \ncompare two statistical hypotheses, then the claims of each should \nbe treated as true and their likelihood discrepancy should be computed.\nIn the case of testing the abundance of FRBs at high latitudes,\nthe sky should be partitioned into high and low regions a priori \n(e.g., the predefined high-latitude HTRU and its complement). The rate in both regions \nis then taken to be the same, and the likelihood of a given spatial distribution of observed\nsources can be calculated. This situation is naturally\ndescribed by a biased binomial distribution with a fixed number of events. Suppose\na total of $K$ FRBs are observed in a given survey. We can ask the question, what is the probability of \nseeing $M$ events in the high region and ($K-M$) events in the lower region?\nThis probability can be calculated \nas \n\n\n", "itemtype": "equation", "pos": 6130, "prevtext": "\n\\date{\\today}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \n\\pubyear{2015}\n\\maketitle\n\\label{firstpage}\n\n\\begin{abstract}\nWe discuss some of the claims that have been made regarding the statistics of \nfast radio bursts (FRBs). In an earlier paper \\citep{2015arXiv150505535C} \nwe conjectured that flicker noise associated \nwith FRB repetition could show up in non-cataclysmic neutron star emission models,\nlike supergiant pulses. We show how the current limits of repetition \nwould be significantly weakened if their repeat rate really were non-Poissonian\nand had a pink or red spectrum.\nRepetition and its statistics have implications for observing strategy, generally favouring \nshallow wide-field surveys, since in the non-repeating scenario survey depth is unimportant. \nWe also discuss the statistics of the apparent latitudinal dependence of FRBs, and offer\na simple method for calculating the significance of this effect.  We provide a generalized Bayesian framework for addressing \nthis problem, which allows for direct model comparison. \nIt is shown how \nthe evidence for a steep latitudinal gradient of the FRB rate is less strong than initially suggested \nand simple explanations like increased scattering and sky temperature \nin the plane are sufficient to decrease the low-latitude burst rate, given current data.\nThe reported dearth of bursts near the plane is further complicated if FRBs have \nnon-Poissonian repetition, since in that case the event rate inferred from observation\ndepends on observing strategy.\n\\end{abstract}\n\\begin{keywords}\n\\end{keywords}\n\n\n\\section{Introduction}\nThere is mounting evidence that the new class of transients \nknown as fast radio bursts (FRBs) are of extraterrestrial origin.\nThe most striking features of FRBs are their large dispersion\nmeasures (DMs) -- too high to be attributed to our own Galaxy's\ninterstellar medium (ISM) --\nand their event rate (10$^3$-$10^4$ sky$^{-1}$ day$^{-1}$). They\nlast for about a millisecond with peak flux of roughly a Jy, and none\nhas been conclusively shown to repeat. This has led to the \ninterpretation that FRBs are cosmological,\nsince the intergalactic medium (IGM) would naturally provide\nDMs between 300-1600 pc cm$^{-3}$ for sources at \n$z\\sim0.3$-$1$ \\citep{2013Sci...341...53T}. \n\nGiven their apparent phenomenological richness\n(polarization, scattering, etc.) and considering\nhow little we know about their location and physical \norigin, it is likely that FRBs will be of interest to the community for \nyears to come, assuming they are not terrestrial.\nThough we are in the regime of only a dozen published FRBs, \nat present the conventional wisdom is that they are likely cosmological\nin origin \\citep{2013Sci...341...53T}, they seem to not repeat regularly\n\\citep{2015MNRAS.454..457P}, and there is a dearth of bursts \nat low Galactic latitudes \\citep{2014ApJ...789L..26P, 2014ApJ...792...19B, 2015MNRAS.451.3278M}.\n\nBased on this premise there have been \na number of models proposed to describe cataclysmic, cosmological \nFRBs \\citep{2012ApJ...760...64M, 2013PASJ...65L..12T, 2014A&A...562A.137F, 2015ApJ...814L..20M}.\nHowever since the field is still in its infancy it is important to\nleave as many conceptual doors open as possible;\nassumptions about the statistics of the event rate, \nspatial distribution, and repetition are important for the design\nand observing strategy of upcoming surveys. In Section \\ref{repeat} we explore the \nconsequences of repeating FRBs in the case where their \nburst rate is non-Possionian and exhibits a 1/$f$ power spectrum, \nor pink noise. We also investigate the claims of \\cite{2015arXiv150701002M}\nthat FRB 140514 could have been the same source as FRB 110220, \nand comment on its implications. In Section \\ref{rate} we\ndiscuss the impact of FRB repetition on survey strategy. In Section \\ref{latitude}\nwe discuss the statistical treatment of the apparent latitudinal dependence \nof the event rate and the lack of detections at low Galactic latitude.\n\n\n\n\\section{Repeat rates}\n\\label{repeat}\n\nThough no source has been shown with certainty to repeat, \nthe limits on repeatability of FRBs are still weak. Several \nmodels generically predict repetition, whether periodic or stochastic. \nGalactic flaring stars \\citep{2015arXiv150701002M}, radio-bursting \nmagnetars \\citep{2007arXiv0710.2006P, 2015ApJ...807..179P}, and pulsar planet systems \n\\citep{2014A&A...569A..86M} all predict repetition with varying \nrates and burst distributions. \n\nIn \\cite{2015arXiv150505535C} it was \nsuggested that supergiant pulses from very young pulsars in supernova \nremnants of nearby galaxies could explain the high DMs, Faraday rotation, \nscintillation, and polarization properties of the observed FRBs. We  \nproposed that if the repetition of supergiant pulses were non-Poissonian \n(with a pink or red distribution) \nthen one might expect several bursts in a short period of time. \nIt is also worth mentioning that the statistics and repeat rates of FRBs \ncould vary from source to source -- even if \nthey come from a single class of progenitors -- so a long follow-up on an individual burst \nmay not provide global constraints.\nIn this \nletter we will refer to stationary Poisson processes (expectation value, $\\mu(t)$, is constant in time)\nas ``Poissonian\". When we discuss non-Poissonian statistics we will be\nfocusing on stochastic processes that are correlated on varying timescales. For\nexample we will not discuss periodic signals, which are not Poissonian but \nhave already been studied \\citep{2015MNRAS.454..457P}.\n\n\n\\subsection{Flicker noise}\n\\label{flicker}\n\nPink noise is ubiquitous in physical systems, showing up in \ngeology and meteorology, a number \nof astrophysical sources including quasars and the sun, \nhuman biology, nearly all electronic devices, finance, \nand even music and speech\n\\citep{1978ComAp...7..103P, 1975Natur.258..317V}.\nThough there is no agreed-upon\nmathematical explanation for this phenomenon\n \\citep{2002physics...4033M}, fluctuations \nare empirically known to be inversely proportional to frequency \nfor a variety of dynamical systems. This can be written as \n\n\n", "index": 1, "text": "\\begin{equation}\nS(f) = \\frac{C}{f^\\gamma} \\,\\,\\,\\,\\,\\ \\textup{if} \\,\\,\\,\\,\\, f_{\\rm{min}} \\le f \\le f_{\\rm{max}}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S(f)=\\frac{C}{f^{\\gamma}}\\,\\,\\,\\,\\,\\ \\textup{if}\\,\\,\\,\\,\\,f_{\\rm{min}}\\leq f%&#10;\\leq f_{\\rm{max}},\" display=\"block\"><mrow><mrow><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>f</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mi>C</mi><msup><mi>f</mi><mi>γ</mi></msup></mfrac></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><mpadded width=\"+8.5pt\"><mtext>if</mtext></mpadded><mo>⁢</mo><msub><mi>f</mi><mi>min</mi></msub></mrow><mo>≤</mo><mi>f</mi><mo>≤</mo><msub><mi>f</mi><mi>max</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04051.tex", "nexttext": "\n\n\\noindent where $p$ is the probability that an event happens to show up in the \nhigh region. In a survey where more time is spent on one part of the \nsky than the other, $p=\\alpha/(\\alpha+1)$, where $\\alpha$ is the ratio of \ntime spent in the high-latitude region vs. the intermediate region. In the case of the HTRU \nsurvey, $K=9$ and since none were found \nin the low-latitude region, $M=9$. Roughly 2500 hours were spent searching the upper region\nand $\\sim1000$ hours were spent at $|b| < 15\\degree$, giving $\\alpha=2.5$. Using Equation \n\\ref{eq-binomial}, this outcome is only $\\sim5\\%$ unlikely. \n\nThe problem is given a quasi-Bayesian treatment by\n\\cite{2014ApJ...789L..26P}, which gives the following.\n\n\n", "itemtype": "equation", "pos": 19309, "prevtext": "\n\n\\noindent where $S(f)$ is the spectral density (i.e. power spectrum), $\\gamma$ is \ntypically between 0.5-2,\nand $f_{\\rm{min}}$ and $f_{\\rm{max}}$ are cutoffs beyond which the power law \ndoes not hold. In this paper will describe these distributions as having flicker noise. \n\nIn the case of a time-domain astronomical \nsource, this results in uniformity on short timescales, i.e. a burst of \nclustered events followed by extended periods of quiescence. \nIf FRBs were to exhibit such flicker noise then their repetition would \nnot only be non-periodic, but would also have a time-varying \npulse rate and, more importantly, variance. Therefore the number of events\nseen in a follow-up observation would depend strongly on \nthe time passed since the initial event.\n\nIn \\cite{2015MNRAS.454..457P}\nthe fields of eight FRBs discovered between 2009 and 2013\nwere followed up from April to October of 2014, for an average \nof 11.4 hours per field. During this follow-up programme \nFRB 140514 was found in the same beam as FRB 110220, however\nthe authors argue that it is likely a new source due to its lower DM. \nAfter its discovery, the field of 140514 was monitored \nfive more times, starting 41 days later on 2014-06-24, without seeing anything.\nUnder the assumption that 140514 was a new FRB \nthat only showed up in the same field \ncoincidentally and that the repeat rate is constant,\n \\cite{2015MNRAS.454..457P} rule out repetition with a period $P \\le$ 8.6 \nhours and reject 8.6 $<$ $P$ $<$ 21 hours with 90$\\%$ confidence.\nHowever it is possible that one or both of those premises \nis invalid, so it is useful to explore the possibility of non-stationary \nrepeat rate statistics and repeating FRBs with variable DM. \n\nIf the statistics of the FRB's repeat rate were\nnon-Poissonian and initial bursts from FRBs were to have aftershocks\nsimilar to earthquakes, then the non-immediate follow-up observations \nimpose far weaker repeat rate limits than has been suggested. We \nconstructed a mock follow-up observation of the eight FRBs whose\nfields were observed in \\cite{2015MNRAS.454..457P}. We then \nasked how many bursts are seen to repeat if we do an immediate\nfollow-up vs. a follow-up several years after the initial event \nat times corresponding \nto the actual observations carried out. \n\nWe run a simple Monte Carlo \nsimulation with one sample per hour and a probability of 0.5 \nthat a given sample has a burst in it. The repeat rate of once per two hours\nis chosen arbitrarily and should not affect the comparison. To get the \n1$/f^{\\gamma}$ distribution we\ntake an uncorrelated Gaussian time stream centred on 0 and move to Fourier space, then \nmultiply by $f^{\\gamma / 2}$, which gives a power spectrum with the desired shape. \nWe then inverse Fourier transform back to get the pink or red time stream.\nWe then take samples with a positive value to contain a pulse and samples with a negative value to contain none.. \nIn the stationary Poisson case, the rate of bursts in \nthe immediate follow-up is the same as the multi-year follow-up \nsince all times are \nstatistically equivalent. However with flicker noise \nthe variance is strongly time-dependent. If we imagine an object that \nrepeated on average once per two hours, then if those pulses were Poisson-distributed \nthe probability of seeing zero bursts in 11.4 hours or longer is $\\sim0.007$. With \npink noise one expects this roughly 20$\\%$ of the time, since the system \nprefers either to be in ``on\" or ``off\" mode. If the average repeat period were more \nlike 5-20 hours, then we would often see nothing in a multi-day follow-up \nobservation that took place weeks or years after the initial event.\n\nThis is consistent with what \\cite{2015MNRAS.454..457P} saw, though the \nconclusions differ depending on the assumed statistics. In Figure \\ref{FIG-RATE}\nwe show a sample from this simulation for three repeat distributions. The right panel \nshows how, if an FRB's burst rate has long-term correlations (1$/f^\\gamma$), \nthe likelihood of a repeat is greatly increased if the follow-up observation is \nimmediately after the initial event, rather than months or years after. \n\n\n\\begin{figure}\n  \\centering\n   \\includegraphics[trim={1in, 0in, 1in, 0in}, width=0.45\\textwidth, height=0.29\\textwidth]{frb_sim_pink24.png}\n   \\caption{Realization of our mock follow-up Monte Carlo. \\textit{Left panel}: Power spectrum for pulse arrival times of a single FRB.\n   Grey shows a flat spectrum, corresponding to the often assumed Poissonian \n   repetition rate. The red and blue spectra show flicker noise, with pink (1/$f$) \n   noise and Brownian (1/$f^2$) noise respectively. \\textit{Right panel}: \n   We found the first ``event\" in our Monte Carlo (represented by a star) for the three different spectra \n   and plotted their behaviour in the subsequent 48 hours of follow-up. Though the average\n   probability over the whole simulation is 0.5 for each distribution, when we zoom in \n   on this short period the strong time-like correlations \n   in the $1/f^\\gamma$ cases means there are many repetitions: they are in an ``on\" state at this time.}\n   \\label{FIG-RATE}\n\\end{figure}\n\n\n\\subsection{FRBs 110220 and 140514}\nUsing the event rate of roughly $10^4$ sky$^{-1}$ day$^{-1}$\nfrom \\cite{2013Sci...341...53T}, it \nwas originally reported that the probability of seeing a \nnew FRB in the field of 110220 during the 85 hours of follow-up \nwas $0.32$  \n\\citep{2015MNRAS.447..246P}. It was then pointed out by \\cite{2015arXiv150701002M} \nthat this underestimated the coincidence by an order of magnitude, \nsince they estimated the rate in any one of the 13 beams, \nwhile the new event occurred in the identical beam.\nThe probability also dropped due to the updated daily event rate,\ngiven the \\cite{2013Sci...341...53T} estimate is now thought likely to be too high. \nIn general we expect the true rate of FRBs to be lower than what is \nreported due to non-publication bias: If archival data are searched and \nnothing is found, it is less likely to be published than if something is found. \nThat said, using the rate calculated by \\cite{2015arXiv150500834R} and following\nthe procedure of \\cite{2015arXiv150701002M}, we find the likelihood of finding a new burst to be \nbetween 0.25-2.5$\\%$.\n\nGiven the relatively low probability of finding \na new FRB in the same field and since there are models that predict\nburst repetition with variable DMs \\citep{2015arXiv150505535C, 2015arXiv150701002M}\none can ask the question: If one FRB out of eight is found to\nrepeat during 110 hours of follow-up (including extra time spent on 140514), \nwhat are the limits on the average\nrepeat period? Another way of asking this question is what is the probability of \n some number of repetitions during the 110 hours, given a repeat rate. The answer to \nthis question depends strongly on the power spectrum's shape. For the sake of example, if the average \nrepeat rate is once per two hours, then the probability of one repeat or fewer in the Poisson\ncase is effectively zero. With a pink distribution it is closer to $5\\%$, even though \nthe expected number would be 55. This is \nshown in Figure \\ref{FIG-hist}, in which we plot the probability of seeing zero or one repeat burst \n(the two options for FRB 140514), given some average repetition period, $P$. \nWe generate the pink distribution in the same way described in Section \\ref{flicker}, \nusing one-hour samples and a long-wavelength cutoff at 1.2 million hours. Though \nit was taken arbitrarily, the probability of seeing no bursts should depend only \nweakly on this cutoff. Since the variance scales logarithmically with this number, \nthere is only roughly a factor of three \ndifference in total power between our choice and $f_{\\rm{min}}\\sim$ an inverse Hubble time. \nWhile we remain agnostic about the relationship between 140514 and 110220, with \nnon-Poissonian repetition it is possible to have a relatively high repeat rate \nand to see either one or zero repeat bursts in several days of observation. \n\n\n\\begin{figure}\n  \\centering\n   \\includegraphics[trim={0in, 0in, 0in, 0in}, width=0.43\\textwidth, height=0.3\\textwidth]{repeat_rate_limit.png}\n   \\caption{The probability of seeing zero (blue curve) or one (red curve) repeat burst\n   in 110 hours of follow-up, assuming a 1/$f$ distribution.  \n   The curves are derived from a simple Monte Carlo in which a\n   pink distribution was generated with one sample per hour, \n   and we asked how many bursts were seen in 110 samples. Thousands of 110-hour realizations\n   were then averaged for each repeat period, $P$. \n   Even with an average \n   repeat rate of once every two hours, there is still a 5$\\%$ chance (indicated by the dashed line) of seeing one or\n   fewer bursts, despite the expected value of 55.}\n   \\label{FIG-hist}\n\\end{figure}\n\n\n\\section{Event rates and total number of sources}\n\\label{rate}\n\nIf FRBs were found to repeat, their statistics and the\naverage frequency of their repetition \nshould affect the search strategy of upcoming surveys. \nFor instance, if it were found that FRBs repeated,\non average, five times a day, then the number of unique \nsources would be five times smaller than the per-sky \ndaily event rate. This means the daily rate \n$3.3^{+5.0}_{-2.5}\\times10^3$ sky$^{-1}$ estimated by \n\\cite{2015arXiv150500834R} would be produced by\nonly $\\sim$160-1600 sources. In this scenario \nthere is no FRB in most pixels on the sky, which means\none could integrate on most patches forever without \nseeing an event. An example of this strategy is the VLA millisecond search, \nin which $\\sim40\\%$ of the time was spent at a single pointing, and\nalmost three quarters of the time was spent at just three locations \\citep{2015ApJ...807...16L}.\nIt is possible that pointing-to-pointing event rate variance contributed \nto their not seeing anything.\n\nWe therefore warn that deep surveys are at a disadvantage \nto those that sweep large regions of the sky \n(CHIME  \\citep{2014SPIE.9145E..22B}, \nUTMOST\\footnote{http://www.caastro.org/news/2014-utmost}, HIRAX)\nbecause the non-repeating \nscenario is unaffected; whereas shallow observations \nshould not hurt the detection rate, no matter what their repetition. \nIdeally, a survey\nneeds only to spend a few dispersion delay times on each beam \nbefore moving on. \n\n\\section{Latitudinal dependence}\n\\label{latitude}\n\nThere is now evidence that the FRB rate is nonuniform on the sky, \nwith fewer detectable events at low Galactic latitudes \\citep{2014ira..book.....B}.\nHowever the statistical significance of this finding may be \noverestimated. \\cite{2014ApJ...789L..26P}\ncompute the probability of the disparity between the number of \nbursts seen in the high- and intermediate-latitude ($|b| < 15\\degree$)\ncomponents of the High Time Resolution Universe survey \n(HTRU). They calculate the probability of seeing $N=0$ in the intermediate \nlatitude survey and $M=4$ in \nthe high-latitude, despite having searched 88$\\%$ more data in the former, and they \nrule out the uniform sky hypothesis with 99.5$\\%$ certainty. We would point out \nthat in general $P(N|M)$ describes a very specific outcome, and it would be \nmore appropriate to include all outcomes equally or more unlikely.\nThat number might also be multiplied by two, since if the survey found \nfour intermediate-latitude FRBs and zero high-lat ones, we would ask the same \nquestion. \n\nBut a simpler approach to this problem would be analogous to a series of \ncoin flips. If a coin were flipped four times, the probability of seeing all heads is 1/16, \nor 6.25$\\%$. This is a factor of six higher than  the analogous analysis of \n\\citet{2014ApJ...789L..26P}.  We can test the null hypothesis that the coin is fair, and using\nthe binomial statistic would conclude that the outcome is consistent with a \nfair coin at 95\\% confidence, differing from the conclusion of \\citet{2014ApJ...789L..26P}.\nIn the FRB case the Universe is flipping a coin each time a new burst \nappears, with some bias factor due to things like different integration times.\nHTRU \nhas since reported five more bursts in the high Galactic region, but using a dataset \nthat spent $\\sim$2.5 times more time at high latitudes. Below we try and quantify the likelihood of \nthis.\n\n\nIf one wants to \ncompare two statistical hypotheses, then the claims of each should \nbe treated as true and their likelihood discrepancy should be computed.\nIn the case of testing the abundance of FRBs at high latitudes,\nthe sky should be partitioned into high and low regions a priori \n(e.g., the predefined high-latitude HTRU and its complement). The rate in both regions \nis then taken to be the same, and the likelihood of a given spatial distribution of observed\nsources can be calculated. This situation is naturally\ndescribed by a biased binomial distribution with a fixed number of events. Suppose\na total of $K$ FRBs are observed in a given survey. We can ask the question, what is the probability of \nseeing $M$ events in the high region and ($K-M$) events in the lower region?\nThis probability can be calculated \nas \n\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq-binomial}\nP(M | \\, {K}, p) =  \\binom{K}{M} \\, p^{M} (1-p)^{K-M} ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P(M|\\,{K},p)=\\binom{K}{M}\\,p^{M}(1-p)^{K-M},\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mi>K</mi><mo>,</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mi>K</mi><mi>M</mi></mfrac><mo>)</mo></mrow></mpadded><msup><mi>p</mi><mi>M</mi></msup><msup><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mi>K</mi><mo>-</mo><mi>M</mi></mrow></msup><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04051.tex", "nexttext": "\n\n\\noindent This gives a probability of $\\sim$3.5$\\%$, using all nine FRBs. This method \nis Bayesian in the sense that they marginalize over the unknown rate \nand calculate a likelihood, but they then calculate a confidence \nand do not look at a posterior.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe most obvious difference between the approach we have offered (biased coin-flip) \nand the quasi-Bayesian method is that we take $M+N$ to be fixed. It follows to ask \nwhether or not we \\textit{should} regard the total number of FRBs as ``given\"? \nWe believe the answer is yes, since this is one of the few quantities that we \nhave actually measured, along with $M$ and $N$. What we are really trying \nto infer is how much larger $\\mu_{\\textup{high}}$ is than $\\mu_{\\textup{low}}$, so these \nrates should not be marginalized over. \n\n\n\nTo consider only the likelihood can give misleading results. \nFor example, as more and more FRBs are detected, the \nlikelihood of the particular observed values for $N$ and $M$ \nwill become smaller and smaller, due to the sheer number of \npossible tuples $(N,M)$.\nTo decide whether or not there is evidence for FRBs to occur with a \nhigher probability at high latitudes, we can instead use the formalism \nof Bayesian model selection. This formalism does not aim to rule out a\nparticular model, it only compares the validity of two models. \nFor this, we formulate two specific models, Model~1 in which we\nassume that $p_1=\\alpha/(1+\\alpha)$ as above (i.e. uniform rate across the sky), and Model~2 in \nwhich we regard $p$ as a free parameter, equipped with a flat prior \nbetween 0 and 1. The model selection will then be based on the comparison\nof the posterior probabilities for the two models,\n   \n   \n\n", "itemtype": "equation", "pos": 20129, "prevtext": "\n\n\\noindent where $p$ is the probability that an event happens to show up in the \nhigh region. In a survey where more time is spent on one part of the \nsky than the other, $p=\\alpha/(\\alpha+1)$, where $\\alpha$ is the ratio of \ntime spent in the high-latitude region vs. the intermediate region. In the case of the HTRU \nsurvey, $K=9$ and since none were found \nin the low-latitude region, $M=9$. Roughly 2500 hours were spent searching the upper region\nand $\\sim1000$ hours were spent at $|b| < 15\\degree$, giving $\\alpha=2.5$. Using Equation \n\\ref{eq-binomial}, this outcome is only $\\sim5\\%$ unlikely. \n\nThe problem is given a quasi-Bayesian treatment by\n\\cite{2014ApJ...789L..26P}, which gives the following.\n\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq-petroff}\nP(N | \\,M) =  \\alpha^{N} (1 + \\alpha)^{-(1+M+N)} \\frac{(M+N)!}{M!N!}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P(N|\\,M)=\\alpha^{N}(1+\\alpha)^{-(1+M+N)}\\frac{(M+N)!}{M!N!}\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mi>M</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msup><mi>α</mi><mi>N</mi></msup><msup><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>+</mo><mi>α</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>M</mi><mo>+</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mfrac><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>M</mi><mo>+</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mrow><mrow><mi>M</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow><mo>⁢</mo><mrow><mi>N</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.04051.tex", "nexttext": "\n\n\\noindent where we have assumed equal prior weights for the two models. \nUsing the binomial likelihood, Eq.~\\eqref{eq-binomial}, and\nmarginalizing over the unknown probability $p$ in the case of Model~2, \nthis ratio is easily calculated to be\n\n\n", "itemtype": "equation", "pos": 21968, "prevtext": "\n\n\\noindent This gives a probability of $\\sim$3.5$\\%$, using all nine FRBs. This method \nis Bayesian in the sense that they marginalize over the unknown rate \nand calculate a likelihood, but they then calculate a confidence \nand do not look at a posterior.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe most obvious difference between the approach we have offered (biased coin-flip) \nand the quasi-Bayesian method is that we take $M+N$ to be fixed. It follows to ask \nwhether or not we \\textit{should} regard the total number of FRBs as ``given\"? \nWe believe the answer is yes, since this is one of the few quantities that we \nhave actually measured, along with $M$ and $N$. What we are really trying \nto infer is how much larger $\\mu_{\\textup{high}}$ is than $\\mu_{\\textup{low}}$, so these \nrates should not be marginalized over. \n\n\n\nTo consider only the likelihood can give misleading results. \nFor example, as more and more FRBs are detected, the \nlikelihood of the particular observed values for $N$ and $M$ \nwill become smaller and smaller, due to the sheer number of \npossible tuples $(N,M)$.\nTo decide whether or not there is evidence for FRBs to occur with a \nhigher probability at high latitudes, we can instead use the formalism \nof Bayesian model selection. This formalism does not aim to rule out a\nparticular model, it only compares the validity of two models. \nFor this, we formulate two specific models, Model~1 in which we\nassume that $p_1=\\alpha/(1+\\alpha)$ as above (i.e. uniform rate across the sky), and Model~2 in \nwhich we regard $p$ as a free parameter, equipped with a flat prior \nbetween 0 and 1. The model selection will then be based on the comparison\nof the posterior probabilities for the two models,\n   \n   \n\n", "index": 7, "text": "\\begin{equation}\n\t\\frac{P(\\mathrm{Model}~1|M,K)}{P(\\mathrm{Model}~2|M,K)} = \\frac{P(M|\\mathrm{Model}~1,K)}{P(M|\\mathrm{Model}~2,K)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{P(\\mathrm{Model}~{}1|M,K)}{P(\\mathrm{Model}~{}2|M,K)}=\\frac{P(M|\\mathrm{%&#10;Model}~{}1,K)}{P(M|\\mathrm{Model}~{}2,K)},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>1</mn><mo stretchy=\"false\">|</mo><mi>M</mi><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>2</mn><mo stretchy=\"false\">|</mo><mi>M</mi><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mfrac><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">|</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>1</mn><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">|</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>2</mn><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04051.tex", "nexttext": "\n\n\\noindent For the observations discussed above with $M = K = 9$ \nand $\\alpha = 2.5$, we find a ratio of $0.48$, so there is\nno strong preference for either of the two models.\n\n\\section{Conclusions}\n\nThe search for FRBs with multiple surveys that have disparate sensitivities, \nfrequency coverage, and survey strategy (not to mention non-publication bias) \nhas made it difficult even to \nestimate a daily sky rate. \nThat combined with the relatively low number of total FRBs observed \nhas meant that dealing with their statistics can be non-trivial. In \nthe case of repetition, we remind the reader that several non-cataclysmic \nmodels for FRBs are expected to repeat. In the case of supergiant \npulses from pulsars, SGR radio flares, or even Galactic flare stars, it is possible \nthat this repetition would be non-stationary and might exhibit strong correlations \nin time. We have shown that if the repetition had some associated flicker noise \nand its power spectrum were 1/$f^\\gamma$, then one should expect the repetition \nrate to be higher immediately after the initial FRB detection. Therefore follow-up \nobservations to archival discoveries that take place years or \nmonths after the first event would not provide strong upper limits. \nThis would also mean that if no burst is found in a given beam after some \nintegration time, then it is unlikely that one will occur in the following integration, and therefore \na new pointing should be searched. In other words, shallow fast surveys would be favourable. \n\nIn Section \\ref{latitude} we offered a simple way of quantifying the \nlatitudinal dependence of FRBs with a binomial distribution. This \nis akin to a biased coin flip, in which we ask ``what is the probability of \n$M$ bursts being found in one region and $N$ bursts in its complement, given \n$\\alpha$ times more time was spent in the former\". Like \\cite{2015arXiv150500834R} we argue\nthat the jury is still out on the severity of the latitudinal \ndependence. With current data the preference for FRBs to \nbe discovered outside of the plane seems consistent with\nsky-temperature effects and increased scattering, or even pure chance. \nWhether or not more sophisticated explanations \n(e.g., \\citealt{2015MNRAS.451.3278M}) are required remains to be seen. \nWe also provided a Bayesian framework for model comparison,\nwhich can be used in the limit where large numbers of FRBs have\nbeen detected. \n\n\\section{Acknowledgements}\n\nWe thank NSERC for support.\n\n\n\n\\bibliography{frb_statistics}\n\\bibliographystyle{mn2e}\n\n\n\\label{lastpage}\n\n\n\n", "itemtype": "equation", "pos": 22361, "prevtext": "\n\n\\noindent where we have assumed equal prior weights for the two models. \nUsing the binomial likelihood, Eq.~\\eqref{eq-binomial}, and\nmarginalizing over the unknown probability $p$ in the case of Model~2, \nthis ratio is easily calculated to be\n\n\n", "index": 9, "text": "\\begin{equation}\n\\frac{P(M|\\mathrm{Model}~1,K)}{P(M|\\mathrm{Model}~2,K)} = (K + 1) \\, \\binom{K}{M} \\, p_1^M \\, \\left(1 - p_1\\right)^{K-M}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\frac{P(M|\\mathrm{Model}~{}1,K)}{P(M|\\mathrm{Model}~{}2,K)}=(K+1)\\,\\binom{K}{M%&#10;}\\,p_{1}^{M}\\,\\left(1-p_{1}\\right)^{K-M}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">|</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>1</mn><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>M</mi><mo stretchy=\"false\">|</mo><mpadded width=\"+3.3pt\"><mi>Model</mi></mpadded><mn>2</mn><mo>,</mo><mi>K</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>K</mi><mo>+</mo><mn>1</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mi>K</mi><mi>M</mi></mfrac><mo>)</mo></mrow></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msubsup><mi>p</mi><mn>1</mn><mi>M</mi></msubsup></mpadded><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>p</mi><mn>1</mn></msub></mrow><mo>)</mo></mrow><mrow><mi>K</mi><mo>-</mo><mi>M</mi></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]