[{"file": "1601.07942.tex", "nexttext": "\nwhere $f_e$ is the electron distribution function, $G_F$ is the Fermi coupling\nconstant, $g_A$ is the weak axial vector coupling constant, $\\epsilon_e$ is the\nelectron energy, $p_e$ is the electron momentum, $Q$ is the energy transfer from\nthe nucleons to the final state electron, and $\\bar f_\\nu$ is the angle-averaged\nneutrino distribution function. The $Q$-value is defined in the direction of\nelectron or positron capture and $\\tilde Q = \\max(Q,m_e c^2)$.  The electron and\npositron capture rates, $\\lambda_{e^+}$ and $\\lambda_{e^-}$, are calculated from\nsimilar expressions with the distribution functions interchanged. This\nexpression assumes there is no momentum transfer to the nucleons and neglects\nweak magnetism corrections. Although these corrections are potentially\nsignificant in the case of neutrino driven winds \\citep{horowitz:02}, they are\nunlikely to significantly affect the evolution of the electron fraction in\n\\BHNS{} merger ejecta. The $\\alpha$-effect locks free protons in heavy nuclei\nand thereby prevents significant competition from electron antineutrino capture\n\\citep{fuller:95}.  We assume that the neutrino distribution has a Fermi-Dirac shape\nin energy space and neutrinos of all energies are emitted from a single\nspherical surface, which results in the distribution function\n\n", "itemtype": "equation", "pos": 26780, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract}\nDuring the merger of a black hole and a neutron star, \nbaryonic mass can become unbound from the system. Because the ejected\nmaterial is extremely neutron-rich, the \\mbox{r-process} rapidly synthesizes\nheavy\nnuclides as the material expands and cools. In this work, we map general\nrelativistic models of \\BHNS{} mergers into a Newtonian \\SPH{} code and follow\nthe evolution of the thermodynamics and morphology of the ejecta until the\noutflows become homologous. We investigate how the subsequent evolution depends\non our mapping procedure and find that the results are robust. Using\nthermodynamic histories from the \\SPH{} particles, we then calculate the\nexpected nucleosynthesis in these outflows while varying the level of neutrino\nirradiation coming from the postmerger accretion disk. We find that the ejected material\nrobustly produces r-process nucleosynthesis even for unrealistically high\nneutrino luminosities, due to the rapid velocities of the outflow. Nonetheless,\nwe find that neutrinos can have an impact on the detailed pattern of the\nr-process nucleosynthesis. Electron neutrinos are captured by neutrons to\nproduce\nprotons while neutron capture is occurring. The produced protons rapidly form\nlow mass seed nuclei for the \\mbox{r-process}. These low mass seeds are\neventually\nincorporated into the first \\mbox{r-process} peak at $A \\sim 78$, producing\nmainly Ge\nand Se. We consider the mechanism of this process in detail and discuss if it\ncan impact galactic chemical evolution of the first peak r-process nuclei.\n\\end{abstract}\n\n\\renewacronym{\\BHNS}{BHNS}{Black hole--neutron star}\n\\renewacronym{\\SPH}{SPH}{smoothed particle hydrodynamics}\n\n\\begin{keywords}\nnuclear reactions, nucleosynthesis, abundances -- neutrinos -- stars: neutron --\nstars: black holes -- hydrodynamics\n\\end{keywords}\n\n\\section{Introduction}\n\n\\BHNS{} binary mergers are a likely candidate for Advanced LIGO and Advanced\nVIRGO detections\nof gravitational waves \\citep{aligo:15, avirgo:15}, they may be responsible for \\sGRB{s}\n\\citep[e.g.][]{lee_rev:07}, and they may provide a significant fraction of the\nr-process material found in our galaxy \\citep{lattimer:76, bauswein:14}. Within\nthe next few years, it is likely that Advanced LIGO will detect gravitational\nwaves from these systems and constrain the \\BHNS{} merger rate. If\nelectromagnetic counterparts are detected, the merger-\\sGRB{} connection may be\nconfirmed and production of the r-process nuclei may be observed {\\it in situ}\n\\citep{metzger:12}.\n\n\nThe origin of the r-process nuclei has been a long standing question in nuclear\nastrophysics \\citep{burbidge:57}. Core-collapse supernovae are appealing as a\npossible site because of galactic chemical evolution considerations\n\\citep[e.g.][]{qian:00,argast:04}, but there is significant difficulty finding\nthe requisite conditions for r-process nucleosynthesis in this environment\n\\citep[e.g.][]{roberts:10,fischer:10,huedepohl:10}. Conversely, it is\nrelatively easy to find conditions neutron-rich enough for r-process\nnucleosynthesis in the material ejected from binary \\NS{} and \\BHNS{} mergers\n\\citep{freiburghaus:99}.  Due to the long delay time from binary formation to merger\nand the large amount of material ejected per merger event, it is challenging to\nget simple models of galactic chemical evolution, which invoke compact object mergers\nfor r-process production to agree with the observed distribution of r-process\nelements in low metallicity halo stars \\citep{qian:00,argast:04}.  Nevertheless,\nrecent works taking into account more complex models of galaxy formation get\nreasonable agreement with the observed distribution of r-process elements\n\\citep{matteucci:14, shen:15, vandevoort:15, ishimaru:15} and it is possible to\nget r-process enrichment at very low metallicity when different channels of\nbinary formation are considered \\citep{ramirez-ruiz:15}.  Therefore, it is\nplausible that compact object mergers could be the source of the galactic\nr-process nuclei.\n\nRecently, it has been recognized that weak interactions can significantly affect\nthe final composition of binary \\NS{} outflows \\citep{wanajo:14, goriely:15,\nsekiguchi:15, foucart:15b, palenzuela:15, radice:16b}.  Likewise, the final state\nand remnant product of binary \\NS{} mergers has been shown to depend on several\nproperties of the system, e.g.\\ important roles are played by the microphysical\nnuclear \\EOS{}, electromagnetic fields and neutrino effects \\citep{neilsen:14,\npalenzuela:15}.  In contrast to binary \\NS{} mergers, the material ejected\nduring \\BHNS{} mergers is unlikely to undergo significant numbers of weak\ninteractions.  Electron and positron captures are supressed relative to the\nrates in the shock heated ejecta of binary \\NS{} mergers due to the low entropy\npresent in the tidal ejecta. The high outflow speeds and low neutrino\nluminosities encountered in these events---compared to binary \\NS{}\nmergers---also make it unlikely that neutrino interactions will drastically change the\nnumber of neutrons present at the onset of r-process nucleosynthesis\n\\citep{foucart:14a,foucart:15}. Therefore, \\BHNS{} mergers have been long\nthought to be likely sites for production of heavy r-process nucleosynthesis\n\\citep{lattimer:77, lattimer:76}, although calculations which do not include the\neffect of neutrinos show that only the second and third r-process peaks are\nproduced \\citep{bauswein:14b}.\n\n\nUnderstanding how \\BHNS{} mergers contribute to galactic chemical evolution\nrequires knowledge of the merger rate, predictions for the amount of mass\nejected per merger, the kinetic energy of the ejecta, and predictions of nuclei\nsynthesized in these outflows.  Although there are no observed \\BHNS{} binaries,\ntheoretical predictions suggest that the rate of \\BHNS{} binary mergers could be\nup to a tenth of the rate of double neutron star binary mergers \\citep{abadie:10,\nbauswein:14b}. The amount of mass ejected during \\BHNS{} mergers can depend\nsensitively on the binary parameters, especially the \\BH{} spin and mass\n\\citep{foucart:13, hotokezaka:13b, bauswein:14b, kyutoku:15}. More mass is\nejected as the \\BH{} spin increases in the direction of the orbital angular\nmomentum \\citep{foucart:14a}.  Increasing the spin decreases the radius of the\ninnermost stable orbit and decreases gravitational binding at the radius at\nwhich the \\NS{} is tidally disrupted. Increasing the \\BH{} mass reduces the\namount of material remaining outside of the \\BH{} after merger (for fixed \\NS{}\nproperties), since the tidal radius scales as \\smash{$(M_{\\rm BH}/M_{\\rm\nNS})^{1/3}R_{\\rm NS}$} while the innermost stable orbit of the \\BH{} scales as\n$M_{\\rm BH}$ for fixed \\BH{} spin. The fraction of the mass outside the horizon\nwhich is unbound, however, also increases with the \\BH{} mass, making the\nrelation between \\BH{} mass and unbound mass nontrivial \\citep{kyutoku:15}.  \n\nBecause the mass and spin distributions of stellar mass \\BH{s} and the\nexpected number of \\BHNS{} system in our galaxy are\nnot well known \\citep[e.g.][]{ligo:10}, it is difficult to estimate the\ncontribution of these events to the r-process material found in the galaxy\n\\citep{bauswein:14b}. Nonetheless, it is timely to investigate the detailed\ncomposition of the ejecta because the merger rate is likely to soon be\nconstrained by Advanced LIGO \\citep{aligo}. Additionally, there are some hints\nthat the infrared excess associated with GRB130603B \\citep{tanvir:13, berger:13}\nis consistent with that event being powered by the radioactive decay of\nr-process products in the ejecta of a \\BHNS{} merger \\citep{hotokezaka:13b}.\nA similar excess has recently been observed in the afterglow of \nGRB060614 \\citep{yang:15, jin:15}.\n\n\nIn this work, we investigate the long term hydrodynamics of the \\BHNS{} ejecta\nand the nucleosynthesis that occurs therein.\nFor the first time, we focus on how neutrinos might affect the\ndetailed nucleosynthesis patterns that are produced. Even for unrealistically\nlarge neutrino luminosities, we find that the distribution of the pre-neutron capture\nelectron fraction is not significantly altered and the second and third\nr-process peaks are robustly\nproduced in almost all of the material. This is in contrast to the dynamical\nejecta of binary \\NS{} mergers, where weak processing may prevent an r-process\nfrom occurring in a significant amount of the material \\citep{wanajo:14,\ngoriely:15}. Of course, the \\BHNS{} result is expected because the outflows\nhappen\nrelatively early before the remnant disk can start to emit neutrinos, there is\nno hypermassive \\NS{} contributing to the neutrino flux, and the tidal ejecta\npossesses a very high velocity. More interestingly, we find that electron\nneutrino captures by neutrons can provide seed\nnuclei for a low mass r-process that produces material in the first r-process peak at\n$A\\sim78$.  Nonetheless, in our models, the ratio of the first peak to the\nsecond peak is sub-solar with and without the inclusion of neutrino captures.\nWhen comparing to the yields of low metallicity halo stars with\nsub-solar Ge abundances \\citep{roederer:14}, we find that this first peak\nproduction can bring our models closer to agreement with the observed abundances\nof Ge, As, and Se, although the abundances are still somewhat low.\n\n\nThis paper is organized as follows: in {Section~\\ref{{sec:methods}}},\nwe present the \\BHNS{} systems we have simulated,\nexplain how the ejected material is mapped into our \\SPH{} code, and describe\nour nuclear reaction network. Then, in {Section~\\ref{{sec:ye}}}, we discuss the\neffect of weak interactions on the electron fraction distribution in the ejecta.\nIn {Section~\\ref{{sec:first_peak}}}, we present the integrated nucleosynthesis from\nour models and discuss neutrino induced production of the first r-process peak.\nIn {Section~\\ref{{sec:GCE}}}, we discuss uncertainties in the results from our\nnucleosynthesis calculations and their possible implications for galactic\nchemical\nevolution and for abundance observations in low metallicity halo stars.\n\n\\section{Methods}\n\\label{sec:methods}\n\n\\subsection{Relativistic Merger Simulations and Binary Systems}\n\\label{sec:binaries}\nThe \\BHNS{} merger simulations used in this work have been described in detail\nin\nour previous papers \\citep{deaton:13,foucart:14a}.\nHere we review the major features and error estimates of the merger simulations,\nreferring readers to \\cite{foucart:14a} for details. The fully relativistic\nEinstein-hydrodynamics system is evolved with the Spectral Einstein Code (SpEC)\n\\citep{SpEC}.  Neutrino cooling and lepton number evolution are incorporated\nthrough a neutrino leakage scheme \\citep{deaton:13}.\n\nTo model the \\NS{}, we employ the Lattimer-Swesty \\EOS{} \\citep{lseos:91} with\nan incompressibility\n$K_0=220\\,{\\rm MeV}$ and a symmetry energy $S_\\nu=29.3\\,{\\rm MeV}$ (hereafter\nLS220), using the table available at \\url{http://www.stellarcollapse.org} and\ndescribed in \\cite{oconnor:10}. This \\EOS{}\nyields a neutron star radius that lies within the allowed range of radii, as\ndetermined by \\cite{hebeler:13} from nuclear theory constraints\nand the existence of neutron stars of mass $\\sim\n2M_\\odot$ \\citep{demorest:10b,antoniadis:13}. For LS220, a 1.2\n(1.4)$M_{\\odot}$ neutron star has a radius $R_{\\rm NS}$ of 12.8 (12.7)\\,km and a\ncompactness \\smash{$C=GM_{\\rm NS}/(R_{\\rm NS}c^2)$} of 0.139 (0.163).\n\nDuring the SpEC simulations, the dynamical ejecta is tracked for only about\n5\\,ms before it exits\nthe computational grid. However, during this time, the specific energy ($u_t$)\nof fluid elements becomes nearly constant, so it is often possible to\nconfidently identify unbound material.\nConvergence of our SpEC simulations was observed to be faster than\nsecond-order.\nAssuming second order convergence gives a conservative relative error of up to\n60\\% in the mass and kinetic energy of ejected material. Even if the true error were\nthis large, which is unlikely, it would not affect the results of the\npresent investigation. As we will see, variations of ejecta properties\nbetween different binary systems, which are of similar magnitude, have\nnegligible effect on the final nuclear abundances.\n\nIn the simulations of \\cite{deaton:13} and \\cite{foucart:14a}, we considered\n\\BHNS{} binary systems with multiple masses and spins.  The\n\\BH{} mass \\smash{$M_{\\rm BH}$} was taken to be \\smash{5.6$M_{\\odot}$},\n\\smash{7$M_{\\odot}$}, or \\smash{10$M_{\\odot}$}, covering most of the estimated\nmass distribution for stellar mass black holes \\citep{ozel:10bh, farr:11}.  The\nneutron star gravitational mass \\smash{$M_{\\rm NS}$} was taken to be\n\\smash{1.2$M_{\\odot}$} or \\smash{1.4$M_{\\odot}$}, which is typical for \\NS{s}\n \\citep{kiziltan:13}.\nFor these masses, ejecta is produced only for at least moderately high \\BH{}\nspins, meaning that for most cases the Kerr spin parameter must be\n\\smash{$\\chi_{\\rm BH} > 0.7$} \\citep{foucart:12dm}.\n\nFor this study, we use the ejecta from three systems.\nThe first, called\n``M12-7-S9'', with parameters $M_{\\rm NS}=1.2M_{\\odot}$, $M_{\\rm\nBH}=7M_{\\odot}$, $\\chi_{\\rm BH}=0.9$, produces a very large ejecta mass of\n0.16$M_{\\odot}$. The second, ``M14-7-S8'', with $M_{\\rm NS}=1.4M_{\\odot}$,\n$M_{\\rm BH}=7M_{\\odot}$, $\\chi_{\\rm BH}=0.8$, has ejecta mass 0.06$M_{\\odot}$,\none of our lower ejecta mass cases. The third case, ``M14-5-S9'', has parameters\n$M_{\\rm NS}=1.4M_{\\odot}$, $M_{\\rm BH}=5.6M_{\\odot}$, $\\chi_{\\rm BH}=0.9$ and\nejects a mass of 0.08$4M_{\\odot}$.\n\n\\subsection{SPH evolution of ejecta}\n\nAfter $\\sim$5\\,ms, the ejecta has detached from the merger remnant and\nis moving for the most part ballistically. However, the outflow\nis not yet homologous. Also, it is possible that pressure forces\nwill subsequently become important again because of recombination\nheating or collision of streams of matter (although this turns out\nnot to be the case). Therefore, we continue the hydrodynamic\nevolution of the outflow using an \\SPH{}\ncode, {\\emph{StarSmasher}}\\ \\citep{Gaburov:2009kg,Ponce:2011kv}. The \\SPH{} code is\nNewtonian, but since the flow\nis only mildly relativistic ($v/c\\approx 0.2$), and from the beginning\nsomewhat far from the black hole ($>10M_{\\rm BH}$), this is probably\nadequate for our purposes. (See check on this below.)\n\nThe {\\emph{StarSmasher}}\\ code  is the successor\nto the earlier {\\emph{StarCrash}}\\ code \\citep{Lombardi:2005nm}.\nIt represents fluids in the standard \\SPH{} way, using a finite number\nof fluid elements or ``particles.''  In its current implementation,\nthe particles may have different masses \\citep{Gaburov:2009kg}, which\nsimplifies the construction of initial data from finite volume\nrepresentations.\n{\\emph{StarSmasher}}\\ uses variable smoothing lengths to maximize resolution,\nusing a formalism derived consistently from a particle-based Lagrangian\nto ensure proper energy and entropy evolution \\citep{Lombardi:2005nm,\nSpringel:2001qb,Monaghan:2002ru}.\n\nStable shock evolution is achieved using artificial viscosity with a\nBalsara switch \\citep{Balsara1995} to suppress artificial viscosity\nin shear layers; fortunately, accurate shock evolution is not\nimportant for our application.  Self-gravity forces are neglected,\nso the gravitational force is simply a function of position given\nby the black hole potential and it is implemented in the\nNewtonian and Paczy\\'{n}ski-Wiita approximations \\citep{Ponce:2011kv,\nPaczynski:1979rz}. In order to\navoid small time steps due to rapid motion,\nparticles are removed if they come too close to the \\BH{}.  These particles\nwould eventually fall into the \\BH{} anyway, so this procedure does not affect\nthe ejecta properties.\n\nAs initial data to the \\SPH{} simulation, hydrodynamic data from a\nsnapshot of the SpEC merger simulation (taken after tidal disruption\nbut before the tidal tail hits the outer boundary) are output on\na uniform Cartesian mesh. {\\emph{StarSmasher}}\\ reads these data, reflects them\nto add the lower hemisphere not evolved by SpEC, interpolates to an\nhexagonal close-packed lattice, and assigns a particle of\nappropriate density to each nonvacuum lattice point.\nThe evolution is then continued in {\\emph{StarSmasher}}\\ using\nthe LS220 \\EOS{} with no neutrino effects. The electron fraction\n$Y_e$ of each particle is constant during the \\SPH{} evolution, and no neutrino\ncooling or absorption is considered. If a particle falls below the LS220\ndensity or temperature\ntable range, the entropy $S$ is henceforth set to be constant, and a\n$S\\propto \\rho T^3$, $P\\propto \\rho^{4/3}$ extrapolation of the \\EOS{} is used.\nThis only happens when pressure is negligible, and the entropy evolution in\n{\\emph{StarSmasher}}\\ is not used in our post-processing nucleosynthesis calculations\n(see below).\n\nAlthough relativistic effects are not expected to be important, the\ntranslation from relativistic to Newtonian physics must account for\ntwo subtleties. First, the late-time behavior of an ejecta fluid element\nis most sensitive to its energy, especially whether it is bound or unbound,\nso it is important that this be appropriately translated. We therefore\nrescale the velocity vector so that the specific kinetic plus potential\nenergy of each particle in the Newtonian framework is equal to its\nrelativistic specific energy $-u_t-1$ in the SpEC simulation. Second,\nthere is no a priori guarantee that the coordinate system in which\nthe numerical relativity simulation evolves will be close to any\nknown coordinates. Fortunately, SpEC's ``damped harmonic'' coordinates\nlead the spacetime to settle nearly in harmonic coordinates, so we\ntransform in {\\emph{StarSmasher}}\\ to Schwarzschild coordinates (ignoring the\n\\BH{'s} spin, whose effects will not be important far from the hole),\nwith a simple radial transformation $r\\rightarrow r+M_{\\rm BH}$. In the\nregion of interest, the numerically evolved spacetime is nearly Minkowski,\nand the deviation from Minkowski is mostly Schwarzschild and so can be\nadequately modeled by a Paczy\\'{n}ski-Wiita potential. Lastly, one\nmust distinguish between the rest frame baryon density used in the \\EOS{} and\nthe mass integrand density used to assign the mass of the \\SPH{} particle, which\nis the rest frame baryon density times a Lorentz factor and a metric\ndeterminant factor. Because \\SPH{} particle mass is a constant, the mass\nintegrand density only needs to be calculated and integrated over at the initial\ntime.\n\nA straightforward evolution of the fluid equations produces a generally\nrealistic evolution but with some clearly unphysical artifacts. Namely,\nmatter on the upper and lower surfaces of the ejected tidal tail blow away from the\nequator, something unexpected given the overall weakness of pressure forces\nand not indicated in the SpEC evolution. This vertical expansion has no\ninfluence on the energy distribution or nucleosynthesis results, but it\ndoes affect the shape of the outflow. Convergence tests show that it is\nnot a transient caused by an insufficient number of particles, so\nit is likely an artifact of the transition to Newtonian physics. It can be removed\nby reducing pressure forces near the black hole. In our simulations labeled\n``P1'', we turn off pressure forces within 10$M_{\\rm BH}$ of the black hole,\nwhile within 100$M_{\\rm BH}$, pressure is reduced by a factor varying linearly\nwith distance between zero (at 10$M_{\\rm BH}$) and one (at 100$M_{\\rm BH}$).\nWithin this range, the specific entropy is held constant, because otherwise\nthe pressure reduction would keep the fluid from adiabatically cooling.\nSimulations labeled ``P2'' have full pressure forces everywhere.\n\nWe check that our evolved results are insensitive to the time at which\nwe transition from SpEC/relativistic to {\\emph{StarSmasher}}/Newtonian physics by\nstarting from two different snapshots 1.6\\,ms apart and finding negligible\nvariation in the evolved energy histograms, which are shown in \n\\cref{fig:energy}. In fact, even the initial\nenergy histograms are not very different, so after the first $\\approx 2$\\,ms\nthe influence of pressure on the kinematics of the ejecta is negligible. The\ncodes' main function is to provide the density evolution as particles follow\ntheir ballistic trajectories.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure1.pdf}\n\\caption{The distribution of specific kinetic plus potential energy in the\nunbound post-merger matter, shown for system M12-7-S9 at a time shortly after\nthe disruption of the \\NS{} ($t=0$) and 500ms later, long after the distribution\nhas settled. For each energy bin, we integrate the density of all particles with\nenergy inside that bin, giving a Newtonian mass for each energy bin.  We show 2\nresolutions, ``Res1'' and ``Res2'', corresponding to around 79,000 and 175,000\nparticles, respectively.  We evolve using two methods: ``P1'' turns off pressure\nforces and imposes adiabatic internal energy evolution within a radius of about\n$100M_{\\rm BH}$. ``P2'' includes pressure forces everywhere but removes bound\nparticles after 10~ms. Another \\SPH{} run begun 1.6\\,ms earlier in the merger\nhas nearly stationary energy distribution if evolved with P1. A simulation using\nP2 with a Paczy\\'{n}ski-Wiita potential gives results almost identical to P2\nwith the standard Newtonian point potential.}\n\\label{fig:energy}\n\\end{figure}\n\nOur interest is only in unbound matter. The bound matter for the most\npart orbits the black hole in an accretion disk or is ``eaten'' when\nit comes within the prescribed distance from the central point mass.\nBoth because of the exclusion of full relativity and the lack of a\ntransport process to drive accretion, the disk evolution cannot be\nregarded as believable. We find that, for P2 evolutions, if we allow\nthe disk to evolve for long periods of time, some fraction of the mass\nbecomes weakly unbound. This is not perhaps incorrect given the physics\nincluded,\nbut it cannot be regarded as physical, so we remove this contamination\nby eliminating bound particles after 10\\,ms of \\SPH{} evolution. For P1\nevolutions,\nthis removal is not necessary.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure2.pdf}\n\\caption{The mass (computed by density integral) interior to a given\n cylindrical radius $r_{\\rm cyl}$ or vertical height $|z|$ for binary\n ejecta M12-7-S9. Profiles\n are computed at a time 500~ms after merger, by which point the\n ejecta profile has settled and will thereafter spread nearly\n homologously. The vertical\n interior mass appears to asymptote to a nonzero value on the left,\n indicating that a significant number of particles remain near the\n equator. We show results for two resolutions with two ways of\n handling pressure forces. Simulations with pressure forces completely\n turned off give profiles nearly the same as P1 profiles.}\n\\label{fig:Mint}\n\\end{figure}\n\nOur standard evolutions use roughly 75,000 particles.\nThe mass profile of the ejecta M12-7-S9\nis shown in \\cref{fig:Mint}.  \\Cref{fig:sph-splash} shows snapshots\nof the \\SPH{} particles and fluid density after $\\approx0.5\\ \\text{s}$ of\nstarting the \\SPH{} evolution.  \n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{Figure3.pdf}\n\\caption{Outflow's profile at a representative snapshot from the SPH evolution\n of M12-7-S9. \nUpper/bottom-left panels: $xy$/$xz$-projection of SPH-particles;\nupper/bottom-right panels: density (in log-scale [g cm$^{-3}$]) views in the\n$xy$/$xz$-planes respectively.\n}\n\\label{fig:sph-splash} \\end{figure}\n\n\n\n\\subsection{Nuclear reaction network and weak interactions}\n\nTo calculate the composition of a Lagrangian fluid element in the ejecta, we\nrequire the evolution of its density as a function of time as well as its\ninitial composition and entropy.  To allow evolution at very late times, we\nextrapolate the density histories of the particles taken from the \\SPH{}\nsimulation assuming homology, $\\rho \\propto t^{-3}$. In\naddition to the density, we extract the entropy and electron fraction along\nthese trajectories. The extracted electron fraction is constant due to the\nneglect of weak reactions during the \\SPH{} evolution. The LS220 \\EOS{} is only\nvalid for baryon densities and temperatures\nabove \\smash{$\\rho = 10^{8}\\, \\textrm{g cm}^{-3}$} and $T \\approx 1\\, \\textrm{GK}$,\nwhich does\nnot include the entire region in the temperature density plane in which neutron\ncapture occurs. Since corrections to the \\EOS{} due to nuclear interaction\nbecome\nnegligible below \\smash{$\\rho \\sim 10^{12}\\, \\textrm{g cm}^{-3}$}, we switch from\nLS220 to a multi-species non-degenerate ideal gas \\EOS{} consistent with the\nnuclei included in our network along with the electron \\EOS{} of\n\\cite{timmes:99} for our network evolutions. When keeping\nthe\nentropy fixed and assuming an initial \\NSE{} composition---with the modified\nHelmholtz \\EOS{} described in \\cite{lippuner:15}---we find\ntemperature differences less than a few percent between the two \\EOS{} in the\nregion where they overlap.\n\nOnce the density evolution of the Lagrangian particles has been extracted and\nextrapolated, we evolve the composition of the particles using the nuclear\nreaction network code {\\emph{SkyNet}}\\ \\citep{lippuner:15}. The nuclear network\nemployed includes 7843 different isotopes extending from neutron to\n$^{337}_{112}$Cn. We employ both the forward reaction rates and the nuclear\ndata tabulated in REACLIB \\citep{cyburt:10}. Inverse reaction rates are\ncalculated assuming detailed balance. In addition to the REACLIB reactions,\nneutron induced fission rates from \\cite{panov:10} and spontaneous\nfission rates calculated from the approximation of \\cite{frankel:47} using the\nspontaneous fission barriers of \\cite{mamdouh:01} are included. Symmetric\nfission fragments are assumed.\n\nThe entropy generated via nuclear transmutations is self-consistently included\nin the evolution, similarly to \\cite{freiburghaus:99}. At 3~ms after\nmerger---the time at which the SpEC simulations are mapped to\n{\\emph{StarSmasher}}---the\nparticles are typically at temperatures over 10~GK. At these temperatures, \\NSE{}\nholds, but weak interactions are generally far from equilibrium. To follow\nchanges in the electron fraction at high temperature, {\\emph{SkyNet}}\\ includes an\n\\NSE{}\nevolution mode where strong interactions are assumed to be in equilibrium and\nonly weak interactions are tracked. This mode is used until the temperature\ndrops below 7~GK, at which point the full nuclear reaction network is evolved.\nBecause inverse strong reactions are calculated via detailed balance, the\ntransition\nbetween the two {\\emph{SkyNet}}\\ evolution modes is smooth.\n\nTo track the potential importance of neutrino irradiation of the ejecta,\nelectron\nneutrino capture, electron antineutrino capture, electron capture, and positron\ncapture by free nucleons are included in both evolution modes.\nThe neutrino capture rates are given by\n\n", "index": 1, "text": "\\begin{align}\n\\lambda_\\nu &= \\frac{G_F^2 (1 + 3g_A^2)}{2 \\pi^2 \\hbar^7 c^6} \\nonumber\\\\\n&\\phantom{=}\\times\\int_{\\tilde Q}^{\\infty} d\\epsilon_e p_e \\epsilon_e\n(\\epsilon_e - Q)^2 \\bar f_\\nu(\\epsilon_e - Q) (1 - f_e(\\epsilon_e)),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\lambda_{\\nu}\" display=\"inline\"><msub><mi>λ</mi><mi>ν</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{G_{F}^{2}(1+3g_{A}^{2})}{2\\pi^{2}\\hbar^{7}c^{6}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msubsup><mi>G</mi><mi>F</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>3</mn><mo>⁢</mo><msubsup><mi>g</mi><mi>A</mi><mn>2</mn></msubsup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>π</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">ℏ</mi><mn>7</mn></msup><mo>⁢</mo><msup><mi>c</mi><mn>6</mn></msup></mrow></mfrac></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\phantom{=}\\times\\int_{\\tilde{Q}}^{\\infty}d\\epsilon_{e}p_{e}%&#10;\\epsilon_{e}(\\epsilon_{e}-Q)^{2}\\bar{f}_{\\nu}(\\epsilon_{e}-Q)(1-f_{e}(\\epsilon%&#10;_{e})),\" display=\"inline\"><mrow><mo>×</mo><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mover accent=\"true\"><mi>Q</mi><mo stretchy=\"false\">~</mo></mover><mi mathvariant=\"normal\">∞</mi></msubsup></mstyle><mi>d</mi><msub><mi>ϵ</mi><mi>e</mi></msub><msub><mi>p</mi><mi>e</mi></msub><msub><mi>ϵ</mi><mi>e</mi></msub><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>ϵ</mi><mi>e</mi></msub><mo>-</mo><mi>Q</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msub><mover accent=\"true\"><mi>f</mi><mo stretchy=\"false\">¯</mo></mover><mi>ν</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>ϵ</mi><mi>e</mi></msub><mo>-</mo><mi>Q</mi><mo stretchy=\"false\">)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>e</mi></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>ϵ</mi><mi>e</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nwhere $\\mu$ is the cosine of the angle of neutrino propagation relative to the\nradial direction, \\smash{$\\mu_0 = \\sqrt{1-(r_\\nu/r)^2}$}, $T_\\nu$ defines the\nneutrino spectral temperature, $\\theta$ is the Heaviside step function,\n$\\epsilon$ is the neutrino energy, and $r_\\nu$ is the radius of neutrino\nemission.  Inside of $r_\\nu$, $\\mu_0$ is assumed to smoothly approach negative\none over a tenth of $r_\\nu$. The value of $r_\\nu$ can be fixed by choosing a\nneutrino luminosity, $L_\\nu$, and spectral temperature. This model is crude,\nconsidering the disk like geometry of the neutrino emitting region, but it is\nsufficient for this study given that we are parameterizing the properties of the\nneutrino field anyway.  In the following sections, we consider models with fixed\nelectron neutrino luminosities of $L_{\\nu_e} = \\{0, 0.2, 1, 5, 25\\} \\times\n10^{52} \\, \\textrm{erg s}^{-1}$. The electron antineutrino luminosity is always\nfixed to be $L_{\\bar \\nu_e}=1.5 L_{\\nu_e}$, but our results are insensitive to\nthis choice due to the $\\alpha$-effect.  These values are in the range found\nin the simulations of \\cite{foucart:15b} and the difference between the values\naccounts for re-leptonization of the disk.  Since only charged current\ninteractions are included in the nuclear network, the properties of the heavy\nflavored neutrino fields do not affect our results.  We employ constant\nluminosities to reduce the number of parameters affecting our nucleosynthesis\ncalculations.\n\nWhere available, beta-decay and electron capture rates from \\cite{fuller:82} and\n\\cite{langanke:00} are used. For nuclei for which these rates are not available,\nthe effects of electron blocking and positron capture are approximately included\nby assuming that the entire beta-decay strength is provided by a ground state to\nground state transition as described in \\cite{arcones:10}. The matrix element\nis chosen such that the beta-decay rate in vacuum is equal to the REACLIB\nbeta-decay rate. This procedure assumes a maximal Q-value and therefore\nprovides a lower limit on the importance of medium dependent effects.\n\nWe perform nucleosynthesis postprocessing for all of the ejected \\SPH{}\ntrajectories.  The network integration begins at three milliseconds after\nmerger. The initial conditions are specified by the density and electron\nfraction at which this temperature is reached and by \\NSE{}. The nuclear\nabundances are then evolved in time along with the entropy of the fluid element,\nwhich is self-consistently evolved due to nuclear transmutation. The nuclear\nevolution is followed until $10^{13}$~s after the merger, which allows for the\ndecay of all but a handful of long lived unstable isotopes.\n\n\\section{Results and Discussion}\n\\label{sec:results}\n\n\\subsection{The Electron Fraction of the Ejecta}\n\\label{sec:ye}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure4.pdf}\n\\caption{Mass weighted histogram of the electron fraction in the ejecta from\nmodel M12-7-S9 assuming fixed electron neutrino luminosities of $\\{0, 0.2, 1, 5,\n25\\} \\times 10^{52}\\text{\\ erg s}^{-1}$.  For comparison, we also show the\nelectron fraction histogram in a $1.2 \\, M_\\odot$ LS neutron star (cyan line).}\n\\label{fig:ye_distribution} \\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure5.pdf}\n\\caption{Evolution of the electron fraction and weak rates as a function of time for a characteristic fluid\nelement. The electron neutrino luminosity is assumed to be $10^{53} \\,\n\\textrm{erg s}^{-1}$. Because of the relatively low entropy of the \\BHNS{}\nejecta and because of the low initial density of our calculations, neutrino\ninteraction rates dominate the electron and positron capture rates but neither\nhave a large impact on the electron fraction of the outflow. The increase in\n$Y_e$ seen after around 100 ms is due to beta-decay during the r-process.}\n\\label{fig:weak_rates}\n\\end{figure}\n\nThe electron fraction of the material ejected during the \\BHNS{} merger is the\nmost important parameter in determining the nucleosynthesis that occurs within the\noutflow \\citep[e.g.,][]{lippuner:15}. Given the short dynamical timescales and\nthe lack of a hypermassive central \\NS{} after the merger, it has often been\nassumed that the electron fraction of the dynamical ejecta from \\BHNS{} mergers\nis set solely by the initial beta-equilibrium electron fraction of the \\NS{}\nfrom which the material was ejected \\citep{just:15}. If there are not a\nsubstantial number of weak interactions during and after the merger, the\nelectron fraction will be low enough that an r-process involving a significant\nnumber of fission cycles will occur: the outer layers of a \\NS{} have $Y_e<0.1$\nand the critical value for producing r-process material at low entropy is $Y_e\n\\approx 0.25$ \\citep[e.g.][]{kasen:15, lippuner:15}. Neutrinos can impact the\nelectron fraction of the ejecta of binary \\NS{} mergers \\citep{wanajo:14,\ngoriely:15, foucart:15b, palenzuela:15, radice:16b}.  In binary \\NS{}\nmergers, a large fraction of the prompt ejecta comes from the shock heated\nmaterial in the interaction region of the two \\NS{s} \\citep{palenzuela:15}. The\nincreased temperatures and the large neutrino fluences near this material\nincreases $Y_e$ significantly and can sometimes drastically alter the character\nof nucleosynthesis in the outflow. In the \\BHNS{} case, there is no interaction\nregion during the tidal disruption of the \\NS{}, and matter ejection when the\ntidal stream self-intersects is very subdominant~\\citep{foucart:15}.  The case\nM14-5-S9 has the most massive ejection from the tidal stream\ncollision~\\citep{deaton:13} of these \\BHNS{}, but even for this case the imprint\nof this secondary ejecta source on the overall outflow composition is small.\nTherefore, the ejected material has a lower average entropy and electron\nfraction than \\NSNS{}  merger ejecta and there is no significant neutrino\nemission until a disk has formed around the \\BH{}.  Here, we consider the extent\nto which neutrino interactions can alter the distribution of $Y_e$ just before\nr-process nucleosynthesis begins in the ejecta.  \n\nWe estimate the effect of neutrino captures on the \\BHNS{} outflows by\nconsidering the maximum disk neutrino luminosities found by \\cite{foucart:14a}.\nThe neutrino luminosity coming from the disk in both electron neutrinos and\nantineutrinos is around $10^{53} \\, \\textrm{erg s}^{-1}$. Although the simulations\nof \\cite{foucart:14a} used a gray leakage approximation, we can get some\nestimate of the average neutrino energies from the temperature of the emission\nregion which was around $5 \\, \\textrm{MeV}$, which suggests average neutrino\nenergies around $\\epsilon_\\nu \\approx 3.15 T \\sim 15 \\, \\textrm{MeV}$\n\\citep[e.g.,][]{foucart:15}.  We can\nthen estimate the neutrino processing timescale as\n\n", "itemtype": "equation", "pos": 28330, "prevtext": "\nwhere $f_e$ is the electron distribution function, $G_F$ is the Fermi coupling\nconstant, $g_A$ is the weak axial vector coupling constant, $\\epsilon_e$ is the\nelectron energy, $p_e$ is the electron momentum, $Q$ is the energy transfer from\nthe nucleons to the final state electron, and $\\bar f_\\nu$ is the angle-averaged\nneutrino distribution function. The $Q$-value is defined in the direction of\nelectron or positron capture and $\\tilde Q = \\max(Q,m_e c^2)$.  The electron and\npositron capture rates, $\\lambda_{e^+}$ and $\\lambda_{e^-}$, are calculated from\nsimilar expressions with the distribution functions interchanged. This\nexpression assumes there is no momentum transfer to the nucleons and neglects\nweak magnetism corrections. Although these corrections are potentially\nsignificant in the case of neutrino driven winds \\citep{horowitz:02}, they are\nunlikely to significantly affect the evolution of the electron fraction in\n\\BHNS{} merger ejecta. The $\\alpha$-effect locks free protons in heavy nuclei\nand thereby prevents significant competition from electron antineutrino capture\n\\citep{fuller:95}.  We assume that the neutrino distribution has a Fermi-Dirac shape\nin energy space and neutrinos of all energies are emitted from a single\nspherical surface, which results in the distribution function\n\n", "index": 3, "text": "\\begin{equation}\nf_\\nu(\\epsilon, \\mu, r) = \n\\frac{\\theta(\\mu - \\mu_0(r))}{\\exp(\\epsilon/T_\\nu) + 1},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"f_{\\nu}(\\epsilon,\\mu,r)=\\frac{\\theta(\\mu-\\mu_{0}(r))}{\\exp(\\epsilon/T_{\\nu})+1},\" display=\"block\"><mrow><mrow><mrow><msub><mi>f</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ϵ</mi><mo>,</mo><mi>μ</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>μ</mi><mo>-</mo><mrow><msub><mi>μ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ϵ</mi><mo>/</mo><msub><mi>T</mi><mi>ν</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mn>1</mn></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nwhere $r$ is the radius of the fluid element, $L_{\\nu_e,53}$ is the electron\nneutrino luminosity in units of $10^{53}\\,\\textrm{erg s}^{-1}$, and\n$T_{\\nu_e,5}$ is the electron neutrino spectral temperature in units of 5~MeV.\nElectron antineutrinos are unlikely to contribute significantly to the neutrino\ninteraction timescale.  This is because in the low entropy outflows of \\BHNS{}\nmergers almost all protons are locked in heavy nuclei and thus have very low\nneutrino capture cross-sections.\n\nThe change in $Y_e$ due to neutrino interactions can be estimated by assuming\nthat the tidal ejecta has a constant velocity $v$, the neutrino luminosity is\nconstant, electron and positron capture are unimportant, protons are locked into\nheavy nuclei, and there is a finite time after merger at which neutrinos start\nbeing emitted from the disk. With these assumptions, the evolution of $Y_e$ as\na function of radius is given by\n\n", "itemtype": "equation", "pos": 35232, "prevtext": "\nwhere $\\mu$ is the cosine of the angle of neutrino propagation relative to the\nradial direction, \\smash{$\\mu_0 = \\sqrt{1-(r_\\nu/r)^2}$}, $T_\\nu$ defines the\nneutrino spectral temperature, $\\theta$ is the Heaviside step function,\n$\\epsilon$ is the neutrino energy, and $r_\\nu$ is the radius of neutrino\nemission.  Inside of $r_\\nu$, $\\mu_0$ is assumed to smoothly approach negative\none over a tenth of $r_\\nu$. The value of $r_\\nu$ can be fixed by choosing a\nneutrino luminosity, $L_\\nu$, and spectral temperature. This model is crude,\nconsidering the disk like geometry of the neutrino emitting region, but it is\nsufficient for this study given that we are parameterizing the properties of the\nneutrino field anyway.  In the following sections, we consider models with fixed\nelectron neutrino luminosities of $L_{\\nu_e} = \\{0, 0.2, 1, 5, 25\\} \\times\n10^{52} \\, \\textrm{erg s}^{-1}$. The electron antineutrino luminosity is always\nfixed to be $L_{\\bar \\nu_e}=1.5 L_{\\nu_e}$, but our results are insensitive to\nthis choice due to the $\\alpha$-effect.  These values are in the range found\nin the simulations of \\cite{foucart:15b} and the difference between the values\naccounts for re-leptonization of the disk.  Since only charged current\ninteractions are included in the nuclear network, the properties of the heavy\nflavored neutrino fields do not affect our results.  We employ constant\nluminosities to reduce the number of parameters affecting our nucleosynthesis\ncalculations.\n\nWhere available, beta-decay and electron capture rates from \\cite{fuller:82} and\n\\cite{langanke:00} are used. For nuclei for which these rates are not available,\nthe effects of electron blocking and positron capture are approximately included\nby assuming that the entire beta-decay strength is provided by a ground state to\nground state transition as described in \\cite{arcones:10}. The matrix element\nis chosen such that the beta-decay rate in vacuum is equal to the REACLIB\nbeta-decay rate. This procedure assumes a maximal Q-value and therefore\nprovides a lower limit on the importance of medium dependent effects.\n\nWe perform nucleosynthesis postprocessing for all of the ejected \\SPH{}\ntrajectories.  The network integration begins at three milliseconds after\nmerger. The initial conditions are specified by the density and electron\nfraction at which this temperature is reached and by \\NSE{}. The nuclear\nabundances are then evolved in time along with the entropy of the fluid element,\nwhich is self-consistently evolved due to nuclear transmutation. The nuclear\nevolution is followed until $10^{13}$~s after the merger, which allows for the\ndecay of all but a handful of long lived unstable isotopes.\n\n\\section{Results and Discussion}\n\\label{sec:results}\n\n\\subsection{The Electron Fraction of the Ejecta}\n\\label{sec:ye}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure4.pdf}\n\\caption{Mass weighted histogram of the electron fraction in the ejecta from\nmodel M12-7-S9 assuming fixed electron neutrino luminosities of $\\{0, 0.2, 1, 5,\n25\\} \\times 10^{52}\\text{\\ erg s}^{-1}$.  For comparison, we also show the\nelectron fraction histogram in a $1.2 \\, M_\\odot$ LS neutron star (cyan line).}\n\\label{fig:ye_distribution} \\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure5.pdf}\n\\caption{Evolution of the electron fraction and weak rates as a function of time for a characteristic fluid\nelement. The electron neutrino luminosity is assumed to be $10^{53} \\,\n\\textrm{erg s}^{-1}$. Because of the relatively low entropy of the \\BHNS{}\nejecta and because of the low initial density of our calculations, neutrino\ninteraction rates dominate the electron and positron capture rates but neither\nhave a large impact on the electron fraction of the outflow. The increase in\n$Y_e$ seen after around 100 ms is due to beta-decay during the r-process.}\n\\label{fig:weak_rates}\n\\end{figure}\n\nThe electron fraction of the material ejected during the \\BHNS{} merger is the\nmost important parameter in determining the nucleosynthesis that occurs within the\noutflow \\citep[e.g.,][]{lippuner:15}. Given the short dynamical timescales and\nthe lack of a hypermassive central \\NS{} after the merger, it has often been\nassumed that the electron fraction of the dynamical ejecta from \\BHNS{} mergers\nis set solely by the initial beta-equilibrium electron fraction of the \\NS{}\nfrom which the material was ejected \\citep{just:15}. If there are not a\nsubstantial number of weak interactions during and after the merger, the\nelectron fraction will be low enough that an r-process involving a significant\nnumber of fission cycles will occur: the outer layers of a \\NS{} have $Y_e<0.1$\nand the critical value for producing r-process material at low entropy is $Y_e\n\\approx 0.25$ \\citep[e.g.][]{kasen:15, lippuner:15}. Neutrinos can impact the\nelectron fraction of the ejecta of binary \\NS{} mergers \\citep{wanajo:14,\ngoriely:15, foucart:15b, palenzuela:15, radice:16b}.  In binary \\NS{}\nmergers, a large fraction of the prompt ejecta comes from the shock heated\nmaterial in the interaction region of the two \\NS{s} \\citep{palenzuela:15}. The\nincreased temperatures and the large neutrino fluences near this material\nincreases $Y_e$ significantly and can sometimes drastically alter the character\nof nucleosynthesis in the outflow. In the \\BHNS{} case, there is no interaction\nregion during the tidal disruption of the \\NS{}, and matter ejection when the\ntidal stream self-intersects is very subdominant~\\citep{foucart:15}.  The case\nM14-5-S9 has the most massive ejection from the tidal stream\ncollision~\\citep{deaton:13} of these \\BHNS{}, but even for this case the imprint\nof this secondary ejecta source on the overall outflow composition is small.\nTherefore, the ejected material has a lower average entropy and electron\nfraction than \\NSNS{}  merger ejecta and there is no significant neutrino\nemission until a disk has formed around the \\BH{}.  Here, we consider the extent\nto which neutrino interactions can alter the distribution of $Y_e$ just before\nr-process nucleosynthesis begins in the ejecta.  \n\nWe estimate the effect of neutrino captures on the \\BHNS{} outflows by\nconsidering the maximum disk neutrino luminosities found by \\cite{foucart:14a}.\nThe neutrino luminosity coming from the disk in both electron neutrinos and\nantineutrinos is around $10^{53} \\, \\textrm{erg s}^{-1}$. Although the simulations\nof \\cite{foucart:14a} used a gray leakage approximation, we can get some\nestimate of the average neutrino energies from the temperature of the emission\nregion which was around $5 \\, \\textrm{MeV}$, which suggests average neutrino\nenergies around $\\epsilon_\\nu \\approx 3.15 T \\sim 15 \\, \\textrm{MeV}$\n\\citep[e.g.,][]{foucart:15}.  We can\nthen estimate the neutrino processing timescale as\n\n", "index": 5, "text": "\\begin{equation}\n\\tau_\\nu(r) \\approx 67.8 \\, \\textrm{ms} \\,\n\\left(\\frac{r}{250 \\, \\textrm{km}} \\right)^{2}\nL_{\\nu_e,53}^{-1} T_{\\nu_e,5}^{-1} \\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\tau_{\\nu}(r)\\approx 67.8\\,\\textrm{ms}\\,\\left(\\frac{r}{250\\,\\textrm{km}}\\right%&#10;)^{2}L_{\\nu_{e},53}^{-1}T_{\\nu_{e},5}^{-1}\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>τ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><mpadded width=\"+1.7pt\"><mn>67.8</mn></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mtext>ms</mtext></mpadded><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>r</mi><mrow><mpadded width=\"+1.7pt\"><mn>250</mn></mpadded><mo>⁢</mo><mtext>km</mtext></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msubsup><mi>L</mi><mrow><msub><mi>ν</mi><mi>e</mi></msub><mo>,</mo><mn>53</mn></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msubsup><mi>T</mi><mrow><msub><mi>ν</mi><mi>e</mi></msub><mo>,</mo><mn>5</mn></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nwhere $Y_{e,\\text{eq}} = \\langle Z \\rangle_{\\textrm{nuclei}}/\\langle A\n\\rangle_{\\textrm{nuclei}}$, and\n$t_{\\nu,\\text{on}}$ is the time after merger at which the neutrino\nluminosities reach their saturation value.\n\nAssuming a constant average proton and neutron numbers of the heavy nuclei,\nthis can easily be integrated to large radius to find the final electron\nfraction\n\n", "itemtype": "equation", "pos": 36316, "prevtext": "\nwhere $r$ is the radius of the fluid element, $L_{\\nu_e,53}$ is the electron\nneutrino luminosity in units of $10^{53}\\,\\textrm{erg s}^{-1}$, and\n$T_{\\nu_e,5}$ is the electron neutrino spectral temperature in units of 5~MeV.\nElectron antineutrinos are unlikely to contribute significantly to the neutrino\ninteraction timescale.  This is because in the low entropy outflows of \\BHNS{}\nmergers almost all protons are locked in heavy nuclei and thus have very low\nneutrino capture cross-sections.\n\nThe change in $Y_e$ due to neutrino interactions can be estimated by assuming\nthat the tidal ejecta has a constant velocity $v$, the neutrino luminosity is\nconstant, electron and positron capture are unimportant, protons are locked into\nheavy nuclei, and there is a finite time after merger at which neutrinos start\nbeing emitted from the disk. With these assumptions, the evolution of $Y_e$ as\na function of radius is given by\n\n", "index": 7, "text": "\\begin{equation}\n\\frac{d Y_e }{dr} = \\frac{\\theta(r-vt_{\\nu,\\text{on}})}\n{v \\tau_\\nu(r) Y_{e,\\text{eq}}} \\left( Y_{e,\\text{eq}} - Y_e \\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{dY_{e}}{dr}=\\frac{\\theta(r-vt_{\\nu,\\text{on}})}{v\\tau_{\\nu}(r)Y_{e,\\text%&#10;{eq}}}\\left(Y_{e,\\text{eq}}-Y_{e}\\right),\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>Y</mi><mi>e</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>r</mi></mrow></mfrac><mo>=</mo><mrow><mfrac><mrow><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>r</mi><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><msub><mi>t</mi><mrow><mi>ν</mi><mo>,</mo><mtext>on</mtext></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>v</mi><mo>⁢</mo><msub><mi>τ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub><mo>-</mo><msub><mi>Y</mi><mi>e</mi></msub></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nwhere $r_0 = t_{\\nu,\\text{on}} v $. Using the outflow velocity and neutrino\nluminosities calculated in the M12-7-S9 model of \\cite{foucart:14a} ($v \\approx\n0.25\\,c$, $L_{\\nu_e} \\approx 10^{53} \\, \\textrm{erg s}^{-1}$, and\n$t_{\\nu,\\text{on}} \\approx 3 \\, \\textrm{ms}$) we find that the post neutrino\ninteraction electron fraction is $Y_{e,f} \\approx 0.07$ if the $Y_{e,\\text{eq}}$\nis close to a half. Given that the r-process is robustly produced below $Y_e\n\\approx 0.25$, this suggests that neutrino interactions are much less likely to\nplay a significant role in determining the composition of the ejecta in \\BHNS{}\nmergers relative to binary \\NS{} mergers, although this estimate is sensitive to\n$t_{\\nu,\\text{on}}$ and the velocity of the outflow.\n\nTo make this more concrete, we run nucleosynthesis calculations for the M12-7-S9\nmodel including neutrino interactions induced by a constant neutrino luminosity,\nmodeled as described above.  Similar results are found for the other two models\ndiscussed in \\cref{sec:binaries}.  In \\cref{fig:weak_rates}, the weak\ninteraction rates and the electron fraction are shown for a single particle.\nBecause our Lagrangian trajectories start at 3 ms after the merger, the initial\ndensity in the ejected material is below about $10^{10}\\,\\text{g cm}^{-3}$ and\nlepton captures are dominated by neutrino captures for neutrino luminosities\nabove about $10^{52} \\, \\textrm{erg s}^{-1}$. The neutrino interaction rates\nfall off as a power law in time, since this particular particle is moving away\nfrom the merger site at constant velocity in a nearly radial direction. Other\nparticles can deviate from power law behavior at early times, but not strongly.\nAs was expected from our estimates above, the neutrino interaction timescale is\nlong compared to the outflow timescale and very little evolution of the electron\nfraction occurs during the first 10 ms. The evolution of $Y_e$ after about 20 ms\nis driven by beta-decays occurring during the r-process.\n\nTo look at the effect of weak interactions globally, the distribution of $Y_e$ in\nthe material ejected in model M12-7-S9 is shown in \n\\cref{fig:ye_distribution} for a range of assumed neutrino luminosities. \nThe GRHD simulations described in \\cref{sec:binaries} include electron and\npositron captures, but do not include neutrino captures. The SPH simulations\nwhich follow the long term evolution of the ejecta include no weak interactions.\nTherefore, we include weak interactions in our post-processing nucleosynthesis\ncalculations to assess their impact on $Y_e$.  \nAs we expect, the ejected material is very\nneutron-rich, but becomes slightly less neutron rich with increasing electron\nneutrino luminosity. The distribution of the electron fraction in the whole \\NS{} is\nalso shown to emphasize that the ejecta in the absence of neutrinos has a\nsignificantly lower $Y_e$ than the average $Y_e$ of a cold $1.2 \\, M_\\odot$ \\NS{}\ncalculated using the LS220 \\EOS{}. The beta-equilibrium value of $Y_e$ increases\nwith density, so that the outer layers of the NS---which comprise most of the\nejecta---have a lower electron fraction. The average electron fraction in the\nejecta is 0.053, 0.053, 0.054, 0.062, and 0.127, for neutrino luminosities of\n$\\{0, 0.2, 1, 5, 25\\} \\times 10^{52}\\text{ erg s}^{-1}$.\n\n\n\\subsection{Nucleosynthesis and Neutrino Induced Production of the First\nr-Process Peak}\n\\label{sec:first_peak}\n\nWe now consider the detailed nucleosynthesis in the ejecta of model M12-7-S9,\nboth with and without neutrinos. We focus on the effect neutrinos can have on\nthe isotopic abundances of the ejecta.\nIn \\cref{fig:luminosity_abundances}, the integrated nucleosynthesis from\nmodel M12-7-S9 is shown.  Since the neutrino emission from the accretion\ntorus formed after the \\BHNS{} merger is uncertain, we calculate the final\nnucleosynthetic yields of M12-7-S9 assuming electron neutrino luminosities of\n$\\{0, 0.2, 1, 5, 25\\} \\times 10^{52} \\, \\textrm{erg s}^{-1}$.  In all cases, the\nelectron antineutrino luminosity is fixed at $1.5 L_{\\nu_e}$ to very\napproximately account for re-leptonization of the neutrino emitting disk\n\\citep{foucart:15b}.  Because of the $\\alpha$-effect, the results are\ninsensitive to the chosen electron antineutrino luminosity.  The electron\nneutrino and antineutrino average energies are fixed at $12 \\, \\textrm{MeV}$\nand $15 \\, \\textrm{MeV}$, respectively.  The results for the other two simulated\nbinary systems are similar and they are discussed briefly below.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure6.pdf}\n\\caption[]{Comparison of the integrated nuclear abundances in model M12-7-S9\nassuming different fixed neutrino irradiation from the nascent accretion disk.\nWe also include the classical scaled solar abundance r-process distribution from\n\\cite{arlandini:99} for comparison.  For all runs, we assume $L_{\\bar \\nu_e} =\n1.5 L_{\\nu_e}$.}\n\\label{fig:luminosity_abundances}\n\\end{figure}\n\nIn general, we confirm previous work that has shown \\BHNS{} mergers dynamically\neject a large amount of r-process rich material \\citep[e.g.][]{roberts:11,\njust:15}. Both the second and third r-process peaks are robustly produced,\nindependent of the neutrino luminosity. Given the low electron fractions found\nin the ejecta at the start of neutron capture, robust production of the\nr-process is not surprising \\citep{lippuner:15}. In all of the models, reactive\nflow proceeds past the third peak before neutron exhaustion occurs in the vast\nmajority of the simulated fluid elements and they undergo fission cycling. We\nfind that fission cycles occur in the ejecta and the number of cycles is weakly\ndependent on the neutrino luminosity (for the luminosities considered here).\nTherefore, the abundance pattern above mass number $\\sim 90$ is likely to be\nrobust to variations in  the total neutrino luminosity and the properties of the\nmerging system.  In all models, the third r-process peak is over produced\nrelative to the second peak.  This is discussed further in \n\\cref{sec:GCE}.\n\nWe find that the abundance of the first r-process peak at mass number 78 depends\non the neutrino luminosity, in contrast to the second and third peaks which are\nindependent of the neutrino luminosity.  Nonetheless, in all cases it is\nunder-produced relative to the solar abundance when normalizing to the second\nand third peaks.  This first peak production is driven by low mass r-process\nseed production after material falls out of \\NSE{}. This material is composed of\nheavy nuclei and free neutrons when strong equilibrium ceases to hold. Since the\nmaterial is still relatively close to the accretion torus a few milliseconds\nafter it is ejected, a significant number of electron neutrinos can be captured\nby the free neutrons.  The produced protons then rapidly capture neutrons and\nform deuterium, which can then capture another deuteron to form an alpha\nparticle. These alpha particles can then undergo a neutron-catalyzed\ntriple-alpha reaction, similar to what occurs in neutron-rich neutrino driven\nwinds \\citep{hoffman:97}, to produce low mass seed nuclei for the r-process.\nThis non-equilibrium neutrino induced seed production creates a distinct set of\nseed nuclei that can undergo neutron capture, since the seeds produced by the\n\\NSE{} distribution tend to be between mass 78 and 100. A large number of the\nlow mass seeds do not get processed past the $N = 50$, $Z = 28$ point in the\nr-process path before neutron exhaustion occurs because of the long beta-decay\nhalf lives in that region of the chart of the nuclides. Therefore, these\nneutrino produced seed nuclei are responsible for producing the first peak\nr-process nucleosynthesis seen in our simulations. This effect of neutrino\nirradiation of the outflow is distinct from the one discussed by\n\\cite{wanajo:14} and \\cite{goriely:15}, where the neutrino luminosities are high\nenough to push the electron fraction over $\\sim\\!0.25$ and stop production of\nthe second and third peaks.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure7.pdf}\n\\caption[]{Illustration of how the first r-process peak is produced by electron\nneutrino captures on neutrons for a single \\SPH{} particle. This \\SPH{}\nparticle had initial $Y_e = 0.11$, initial entropy \\smash{$s = 9.7\\ k_B\\\n\\text{baryon}^{-1}$}, and an asymptotic\nvelocity $v/c = 0.5$. {\\it Top panel:} The solid lines show the abundance of\nmaterial in the first r-process peak, $Y_\\text{1st}$, as a function of time\n(i.e. material with\n$72 \\leq A \\leq 79$), the dashed lines show the integrated number of protons produced\nby weak interactions after time $t$ divided by six, \\smash{$Y_{s,\\nu} =\n\\int_t^{\\infty} dt Y_{\\textrm{n}}/6 (\\lambda_{\\nu_e} + \\lambda_{e^+})$}, and the\ndotted lines show the neutron abundance $Y_n$. $Y_{s,\\nu}$ gives the number of\nlow mass seed nuclei produced by\nneutrino interactions. The neutrino seed nuclei produced at early times are\nburned past the first r-process peak, but the seed nuclei produced after the\ntime when $Y_{s,\\nu} = Y_\\text{1st,final}$ do not get burned passed the first\npeak before neutrons are exhausted, and so they will end up in the first peak.\n{\\it Bottom panel:}\nThe solid lines show the temperature of the particle as a function of time, the\ndashed lines show the timescale to process material to the first peak,\n\\smash{$\\tau_{(6,25)}$}, and the dotted lines show the destruction timescale of\nthe first peak, \\smash{$\\tau_{(26,28)}$}, which are defined in the text. In this\nparticle, there is no significant variation with neutrino luminosity of the\ntemperature or the r-process path. Therefore, the two timescales do not change\nwith the amount of neutrino irradiation.} \\label{fig:first_peak_production}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure8.pdf}\n\\caption[]{The same as \\cref{fig:first_peak_production}, except for\na different thermodynamic trajectory. This \\SPH{} particle had initial $Y_e =\n0.05$, initial entropy \\smash{$s = 4.33\\ k_B\\ \\text{baryon}^{-1}$}, and an\nasymptotic velocity $v/c = 0.29$. Because of the lower velocity, lower initial\nentropy, and lower $Y_e$ present in this particle relative to the particle\nshown in \\cref{fig:first_peak_production}, neutrino interactions significantly\nalter the thermodynamic state of the material and \\smash{$\\tau_{(6,25)}$}. This\ncauses the first peak abundance to vary non-monotonically with the neutrino\nluminosity.}\n\\label{fig:first_peak_production2}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure9.png}\n\\caption[]{The r-process path for the SPH particle shown in\n\\cref{fig:first_peak_production2} for different neutrino luminosities at 100 ms\ninto the calculation.  The inset shows the mass summed abundances at the same\ntime.  Notice how the path differs for different neutrino luminosities.}\n\\label{fig:path}\n\\end{figure}\n\n\\subsection{Details of the First Peak Production Mechanism}\nWe now consider the details of the process by which abundances in the first peak\nare indirectly produced by electron neutrino captures by neutrons.\nThe total number fraction of heavy nuclei produced by neutrino induced seed production\ncan be estimated by using the results from {Section~\\ref{{sec:ye}}} as follows. Low mass\nseed production proceeds via the neutron catalyzed triple alpha process, so it\ntakes six protons to make a seed nucleus. The rate of proton production is just\n\\smash{$\\dot Y_e$}, so the total number of low mass seed nuclei produced by\nneutrino interactions is\n\n", "itemtype": "equation", "pos": 36846, "prevtext": "\nwhere $Y_{e,\\text{eq}} = \\langle Z \\rangle_{\\textrm{nuclei}}/\\langle A\n\\rangle_{\\textrm{nuclei}}$, and\n$t_{\\nu,\\text{on}}$ is the time after merger at which the neutrino\nluminosities reach their saturation value.\n\nAssuming a constant average proton and neutron numbers of the heavy nuclei,\nthis can easily be integrated to large radius to find the final electron\nfraction\n\n", "index": 9, "text": "\\begin{align}\nY_{e,f} &\\approx Y_{e,\\text{eq}}\n\\left[1 - \\exp \\left(-\\frac{r_0 }\n{v \\tau_\\nu(r_0) Y_{e,\\text{eq}}}\\right) \\right]\n\\nonumber\\\\\n&\\phantom{\\approx}{}+ Y_{e,i} \\exp \\left(-\\frac{r_0}\n{v \\tau_\\nu(r_0) Y_{e,\\text{eq}}}\\right),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Y_{e,f}\" display=\"inline\"><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mi>f</mi></mrow></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\approx Y_{e,\\text{eq}}\\left[1-\\exp\\left(-\\frac{r_{0}}{v\\tau_{\\nu%&#10;}(r_{0})Y_{e,\\text{eq}}}\\right)\\right]\" display=\"inline\"><mrow><mi/><mo>≈</mo><mrow><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>r</mi><mn>0</mn></msub><mrow><mi>v</mi><mo>⁢</mo><msub><mi>τ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\phantom{\\approx}{}+Y_{e,i}\\exp\\left(-\\frac{r_{0}}{v\\tau_{\\nu}(r_%&#10;{0})Y_{e,\\text{eq}}}\\right),\" display=\"inline\"><mrow><mrow><mo>+</mo><mrow><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>r</mi><mn>0</mn></msub><mrow><mi>v</mi><mo>⁢</mo><msub><mi>τ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nThis estimate implies that around $2\\times10^{-3}$ seed nuclei per baryon are\nproduced by this process, assuming the neutrino luminosity is \\smash{$10^{53} \\,\n\\textrm{erg s}^{-1}$}. This number is in good agreement with the values\nextracted from our nucleosynthesis calculations. Comparing this to the total\nfinal abundance of the first peak for a single ejecta particle shown in\n\\cref{fig:first_peak_production}, it is clear that only about 10\\% of this\nmaterial gets trapped in the first peak.\n\nSeed nuclei indirectly produced by neutrinos are not processed past the $N = 28$\nclosed shell rapidly. If such rapid processing were the case, the final amount\nof mass in the first peak would be set by the number of seed nuclei produced\nafter a time just before neutron exhaustion. To illustrate when the nuclei\ntrapped in the first peak are produced, we show the total number of seed nuclei\nproduced by neutrino interactions after time $t$\n\n", "itemtype": "equation", "pos": 48570, "prevtext": "\nwhere $r_0 = t_{\\nu,\\text{on}} v $. Using the outflow velocity and neutrino\nluminosities calculated in the M12-7-S9 model of \\cite{foucart:14a} ($v \\approx\n0.25\\,c$, $L_{\\nu_e} \\approx 10^{53} \\, \\textrm{erg s}^{-1}$, and\n$t_{\\nu,\\text{on}} \\approx 3 \\, \\textrm{ms}$) we find that the post neutrino\ninteraction electron fraction is $Y_{e,f} \\approx 0.07$ if the $Y_{e,\\text{eq}}$\nis close to a half. Given that the r-process is robustly produced below $Y_e\n\\approx 0.25$, this suggests that neutrino interactions are much less likely to\nplay a significant role in determining the composition of the ejecta in \\BHNS{}\nmergers relative to binary \\NS{} mergers, although this estimate is sensitive to\n$t_{\\nu,\\text{on}}$ and the velocity of the outflow.\n\nTo make this more concrete, we run nucleosynthesis calculations for the M12-7-S9\nmodel including neutrino interactions induced by a constant neutrino luminosity,\nmodeled as described above.  Similar results are found for the other two models\ndiscussed in \\cref{sec:binaries}.  In \\cref{fig:weak_rates}, the weak\ninteraction rates and the electron fraction are shown for a single particle.\nBecause our Lagrangian trajectories start at 3 ms after the merger, the initial\ndensity in the ejected material is below about $10^{10}\\,\\text{g cm}^{-3}$ and\nlepton captures are dominated by neutrino captures for neutrino luminosities\nabove about $10^{52} \\, \\textrm{erg s}^{-1}$. The neutrino interaction rates\nfall off as a power law in time, since this particular particle is moving away\nfrom the merger site at constant velocity in a nearly radial direction. Other\nparticles can deviate from power law behavior at early times, but not strongly.\nAs was expected from our estimates above, the neutrino interaction timescale is\nlong compared to the outflow timescale and very little evolution of the electron\nfraction occurs during the first 10 ms. The evolution of $Y_e$ after about 20 ms\nis driven by beta-decays occurring during the r-process.\n\nTo look at the effect of weak interactions globally, the distribution of $Y_e$ in\nthe material ejected in model M12-7-S9 is shown in \n\\cref{fig:ye_distribution} for a range of assumed neutrino luminosities. \nThe GRHD simulations described in \\cref{sec:binaries} include electron and\npositron captures, but do not include neutrino captures. The SPH simulations\nwhich follow the long term evolution of the ejecta include no weak interactions.\nTherefore, we include weak interactions in our post-processing nucleosynthesis\ncalculations to assess their impact on $Y_e$.  \nAs we expect, the ejected material is very\nneutron-rich, but becomes slightly less neutron rich with increasing electron\nneutrino luminosity. The distribution of the electron fraction in the whole \\NS{} is\nalso shown to emphasize that the ejecta in the absence of neutrinos has a\nsignificantly lower $Y_e$ than the average $Y_e$ of a cold $1.2 \\, M_\\odot$ \\NS{}\ncalculated using the LS220 \\EOS{}. The beta-equilibrium value of $Y_e$ increases\nwith density, so that the outer layers of the NS---which comprise most of the\nejecta---have a lower electron fraction. The average electron fraction in the\nejecta is 0.053, 0.053, 0.054, 0.062, and 0.127, for neutrino luminosities of\n$\\{0, 0.2, 1, 5, 25\\} \\times 10^{52}\\text{ erg s}^{-1}$.\n\n\n\\subsection{Nucleosynthesis and Neutrino Induced Production of the First\nr-Process Peak}\n\\label{sec:first_peak}\n\nWe now consider the detailed nucleosynthesis in the ejecta of model M12-7-S9,\nboth with and without neutrinos. We focus on the effect neutrinos can have on\nthe isotopic abundances of the ejecta.\nIn \\cref{fig:luminosity_abundances}, the integrated nucleosynthesis from\nmodel M12-7-S9 is shown.  Since the neutrino emission from the accretion\ntorus formed after the \\BHNS{} merger is uncertain, we calculate the final\nnucleosynthetic yields of M12-7-S9 assuming electron neutrino luminosities of\n$\\{0, 0.2, 1, 5, 25\\} \\times 10^{52} \\, \\textrm{erg s}^{-1}$.  In all cases, the\nelectron antineutrino luminosity is fixed at $1.5 L_{\\nu_e}$ to very\napproximately account for re-leptonization of the neutrino emitting disk\n\\citep{foucart:15b}.  Because of the $\\alpha$-effect, the results are\ninsensitive to the chosen electron antineutrino luminosity.  The electron\nneutrino and antineutrino average energies are fixed at $12 \\, \\textrm{MeV}$\nand $15 \\, \\textrm{MeV}$, respectively.  The results for the other two simulated\nbinary systems are similar and they are discussed briefly below.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure6.pdf}\n\\caption[]{Comparison of the integrated nuclear abundances in model M12-7-S9\nassuming different fixed neutrino irradiation from the nascent accretion disk.\nWe also include the classical scaled solar abundance r-process distribution from\n\\cite{arlandini:99} for comparison.  For all runs, we assume $L_{\\bar \\nu_e} =\n1.5 L_{\\nu_e}$.}\n\\label{fig:luminosity_abundances}\n\\end{figure}\n\nIn general, we confirm previous work that has shown \\BHNS{} mergers dynamically\neject a large amount of r-process rich material \\citep[e.g.][]{roberts:11,\njust:15}. Both the second and third r-process peaks are robustly produced,\nindependent of the neutrino luminosity. Given the low electron fractions found\nin the ejecta at the start of neutron capture, robust production of the\nr-process is not surprising \\citep{lippuner:15}. In all of the models, reactive\nflow proceeds past the third peak before neutron exhaustion occurs in the vast\nmajority of the simulated fluid elements and they undergo fission cycling. We\nfind that fission cycles occur in the ejecta and the number of cycles is weakly\ndependent on the neutrino luminosity (for the luminosities considered here).\nTherefore, the abundance pattern above mass number $\\sim 90$ is likely to be\nrobust to variations in  the total neutrino luminosity and the properties of the\nmerging system.  In all models, the third r-process peak is over produced\nrelative to the second peak.  This is discussed further in \n\\cref{sec:GCE}.\n\nWe find that the abundance of the first r-process peak at mass number 78 depends\non the neutrino luminosity, in contrast to the second and third peaks which are\nindependent of the neutrino luminosity.  Nonetheless, in all cases it is\nunder-produced relative to the solar abundance when normalizing to the second\nand third peaks.  This first peak production is driven by low mass r-process\nseed production after material falls out of \\NSE{}. This material is composed of\nheavy nuclei and free neutrons when strong equilibrium ceases to hold. Since the\nmaterial is still relatively close to the accretion torus a few milliseconds\nafter it is ejected, a significant number of electron neutrinos can be captured\nby the free neutrons.  The produced protons then rapidly capture neutrons and\nform deuterium, which can then capture another deuteron to form an alpha\nparticle. These alpha particles can then undergo a neutron-catalyzed\ntriple-alpha reaction, similar to what occurs in neutron-rich neutrino driven\nwinds \\citep{hoffman:97}, to produce low mass seed nuclei for the r-process.\nThis non-equilibrium neutrino induced seed production creates a distinct set of\nseed nuclei that can undergo neutron capture, since the seeds produced by the\n\\NSE{} distribution tend to be between mass 78 and 100. A large number of the\nlow mass seeds do not get processed past the $N = 50$, $Z = 28$ point in the\nr-process path before neutron exhaustion occurs because of the long beta-decay\nhalf lives in that region of the chart of the nuclides. Therefore, these\nneutrino produced seed nuclei are responsible for producing the first peak\nr-process nucleosynthesis seen in our simulations. This effect of neutrino\nirradiation of the outflow is distinct from the one discussed by\n\\cite{wanajo:14} and \\cite{goriely:15}, where the neutrino luminosities are high\nenough to push the electron fraction over $\\sim\\!0.25$ and stop production of\nthe second and third peaks.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure7.pdf}\n\\caption[]{Illustration of how the first r-process peak is produced by electron\nneutrino captures on neutrons for a single \\SPH{} particle. This \\SPH{}\nparticle had initial $Y_e = 0.11$, initial entropy \\smash{$s = 9.7\\ k_B\\\n\\text{baryon}^{-1}$}, and an asymptotic\nvelocity $v/c = 0.5$. {\\it Top panel:} The solid lines show the abundance of\nmaterial in the first r-process peak, $Y_\\text{1st}$, as a function of time\n(i.e. material with\n$72 \\leq A \\leq 79$), the dashed lines show the integrated number of protons produced\nby weak interactions after time $t$ divided by six, \\smash{$Y_{s,\\nu} =\n\\int_t^{\\infty} dt Y_{\\textrm{n}}/6 (\\lambda_{\\nu_e} + \\lambda_{e^+})$}, and the\ndotted lines show the neutron abundance $Y_n$. $Y_{s,\\nu}$ gives the number of\nlow mass seed nuclei produced by\nneutrino interactions. The neutrino seed nuclei produced at early times are\nburned past the first r-process peak, but the seed nuclei produced after the\ntime when $Y_{s,\\nu} = Y_\\text{1st,final}$ do not get burned passed the first\npeak before neutrons are exhausted, and so they will end up in the first peak.\n{\\it Bottom panel:}\nThe solid lines show the temperature of the particle as a function of time, the\ndashed lines show the timescale to process material to the first peak,\n\\smash{$\\tau_{(6,25)}$}, and the dotted lines show the destruction timescale of\nthe first peak, \\smash{$\\tau_{(26,28)}$}, which are defined in the text. In this\nparticle, there is no significant variation with neutrino luminosity of the\ntemperature or the r-process path. Therefore, the two timescales do not change\nwith the amount of neutrino irradiation.} \\label{fig:first_peak_production}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure8.pdf}\n\\caption[]{The same as \\cref{fig:first_peak_production}, except for\na different thermodynamic trajectory. This \\SPH{} particle had initial $Y_e =\n0.05$, initial entropy \\smash{$s = 4.33\\ k_B\\ \\text{baryon}^{-1}$}, and an\nasymptotic velocity $v/c = 0.29$. Because of the lower velocity, lower initial\nentropy, and lower $Y_e$ present in this particle relative to the particle\nshown in \\cref{fig:first_peak_production}, neutrino interactions significantly\nalter the thermodynamic state of the material and \\smash{$\\tau_{(6,25)}$}. This\ncauses the first peak abundance to vary non-monotonically with the neutrino\nluminosity.}\n\\label{fig:first_peak_production2}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure9.png}\n\\caption[]{The r-process path for the SPH particle shown in\n\\cref{fig:first_peak_production2} for different neutrino luminosities at 100 ms\ninto the calculation.  The inset shows the mass summed abundances at the same\ntime.  Notice how the path differs for different neutrino luminosities.}\n\\label{fig:path}\n\\end{figure}\n\n\\subsection{Details of the First Peak Production Mechanism}\nWe now consider the details of the process by which abundances in the first peak\nare indirectly produced by electron neutrino captures by neutrons.\nThe total number fraction of heavy nuclei produced by neutrino induced seed production\ncan be estimated by using the results from {Section~\\ref{{sec:ye}}} as follows. Low mass\nseed production proceeds via the neutron catalyzed triple alpha process, so it\ntakes six protons to make a seed nucleus. The rate of proton production is just\n\\smash{$\\dot Y_e$}, so the total number of low mass seed nuclei produced by\nneutrino interactions is\n\n", "index": 11, "text": "\\begin{align}\nY_{\\textrm{s},\\nu} \\approx& \\frac{Y_{e,f} - Y_{e,i}}{6} \\nonumber \\\\\n=& \\frac{Y_{e,\\text{eq}} - Y_{e,i}}{6}\n\\left[1 - \\exp \\left(-\\frac{r_0}\n{v \\tau_\\nu(r_0) Y_{e,\\text{eq}}}\\right) \\right].\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle Y_{\\textrm{s},\\nu}\\approx\" display=\"inline\"><mrow><msub><mi>Y</mi><mrow><mtext>s</mtext><mo>,</mo><mi>ν</mi></mrow></msub><mo>≈</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{Y_{e,f}-Y_{e,i}}{6}\" display=\"inline\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mi>f</mi></mrow></msub><mo>-</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mi>i</mi></mrow></msub></mrow><mn>6</mn></mfrac></mstyle></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=\" display=\"inline\"><mo>=</mo></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{Y_{e,\\text{eq}}-Y_{e,i}}{6}\\left[1-\\exp\\left(-\\frac{r_{0}}{%&#10;v\\tau_{\\nu}(r_{0})Y_{e,\\text{eq}}}\\right)\\right].\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub><mo>-</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mi>i</mi></mrow></msub></mrow><mn>6</mn></mfrac></mstyle><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>r</mi><mn>0</mn></msub><mrow><mi>v</mi><mo>⁢</mo><msub><mi>τ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>e</mi><mo>,</mo><mtext>eq</mtext></mrow></msub></mrow></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nin \\cref{fig:first_peak_production}, along with the time dependence of the first\npeak abundance, $Y_\\text{1st}$,  and the neutron abundance $Y_\\text{n}$.\n$Y_{s,\\nu}$ is just the number fraction of protons produced by weak interactions\nafter time $t$ divided by six, since it requires six protons to produce a seed\nnucleus that can capture neutrons.  Material will be processed through the first\npeak on some timescale \\smash{$\\tau_\\text{1st}$}.  Let $t_\\text{ex}$ be the time\nat which neutrons are exhausted and $t_\\text{prod}$ be the time after which\nneutrino produced seed nuclei get trapped in the first peak. Seed nuclei\nproduced at times earlier than $t_\\text{prod} = t_\\text{ex} - \\tau_\\text{1st}$\nwill be burned past the first peak, while seed nuclei produced within a time\n$\\tau_\\text{1st}$ of neutron exhaustion will end up in the first peak. We can\nestimate $\\tau_\\text{1st}$ by looking for solutions of $Y_{s,\\nu}(t_\\text{prod})\n= Y_\\text{1st,final}$. Inspecting \\cref{fig:first_peak_production}, we find\n$t_\\text{prod}$ is 70 to 100~ms and $t_\\text{ex}$ is 520 to 600~ms for\n\\smash{$L_{\\nu_e,52}$} ranging from 20 to 1. Thus we estimate that\n$\\tau_\\text{1st}$, the time it takes for seed nuclei to be processed to the $N =\n28$ closed shell of the first peak, is between 450 and 500~ms for this\nparticular fluid element.\n\nWe now attempt to explain what sets this timescale.  Assuming that beta-decay\noccurs on a much longer timescale than neutron capture and photodissociation,\nthe timescale to go from charge $Z_1$ to charge $Z_2$ is given by\n\n", "itemtype": "equation", "pos": 49725, "prevtext": "\nThis estimate implies that around $2\\times10^{-3}$ seed nuclei per baryon are\nproduced by this process, assuming the neutrino luminosity is \\smash{$10^{53} \\,\n\\textrm{erg s}^{-1}$}. This number is in good agreement with the values\nextracted from our nucleosynthesis calculations. Comparing this to the total\nfinal abundance of the first peak for a single ejecta particle shown in\n\\cref{fig:first_peak_production}, it is clear that only about 10\\% of this\nmaterial gets trapped in the first peak.\n\nSeed nuclei indirectly produced by neutrinos are not processed past the $N = 28$\nclosed shell rapidly. If such rapid processing were the case, the final amount\nof mass in the first peak would be set by the number of seed nuclei produced\nafter a time just before neutron exhaustion. To illustrate when the nuclei\ntrapped in the first peak are produced, we show the total number of seed nuclei\nproduced by neutrino interactions after time $t$\n\n", "index": 13, "text": "\\begin{equation}\nY_{s,\\nu}(t) = \\frac{1}{6}\\int_t^\\infty Y_n (\\lambda_{\\nu_e} + \\lambda_{e^+}) dt\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"Y_{s,\\nu}(t)=\\frac{1}{6}\\int_{t}^{\\infty}Y_{n}(\\lambda_{\\nu_{e}}+\\lambda_{e^{+%&#10;}})dt\" display=\"block\"><mrow><mrow><msub><mi>Y</mi><mrow><mi>s</mi><mo>,</mo><mi>ν</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>6</mn></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>t</mi><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><msub><mi>Y</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>λ</mi><msub><mi>ν</mi><mi>e</mi></msub></msub><mo>+</mo><msub><mi>λ</mi><msup><mi>e</mi><mo>+</mo></msup></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07942.tex", "nexttext": "\nHere, \\smash{$\\tau^{-1}_{\\beta^{-}, (Z,N)}$} is the beta-decay timescale of a\nnucleus with $N$ neutrons and $Z$ protons. When \\smash{$(n,\\gamma)$} reactions\nare in equilibrium with \\smash{$(\\gamma, n)$} reactions---such that\n\\smash{$\\mu_n + \\mu_{(Z,N)} = \\mu_{(Z,N+1)}$}---these timescales are only\nfunctions of the density, temperature, and neutron abundance, i.e.\\\n\\smash{$\\tau_{(Z_1,Z_2)} = \\tau_{(Z_1,Z_2)}(\\rho, T, Y_n)$}.  This is often the\ncase at the high temperatures encountered during r-process nucleosynthesis in\nthese outflows, but the equilibrium can start to break down at lower\ntemperatures.  This makes it clear that changing the temperature and electron\nfraction of a particular fluid element can change the path of the r-process and\nalter the time it takes material to be processed from one charge number to\nanother. The quantities \\smash{$\\tau_{(6,25)}$} and \\smash{$\\tau_{(26,28)}$} are\nshown in the bottom panel of \\cref{fig:first_peak_production}. Note that\n\\smash{$\\tau_{(6,25)} + \\tau_{(26,28)}$} is approximately the time it takes a\nseed nucleus to get to the start of the first peak and then get processed\nthrough the first peak, which we called\n$\\tau_\\text{1st}$ above. We see from the bottom panel of\n\\cref{fig:first_peak_production} that \\smash{$\\tau_{(6,25)}$} is constant\nthroughout the period during which the r-process is occurring and its value is\nin good agreement with our 450 to 500~ms estimate for \\smash{$\\tau_\\text{1st}$}.\nBecause this timescale is determined by beta decay, the final first peak\nabundance goes linearly with the neutrino luminosity.  The lifetimes of isotopes\nalong the $N=50$ closed shell are 40~ms, 110~ms, and 110~ms, for the reactions\n\\smash{$^{76}$Fe($\\beta^-,n)^{75}$Co}, \\smash{$^{77}$Co($\\beta^-,n)^{76}$Ni},\nand \\smash{$^{78}$Ni($\\beta^-)^{78}$Cu}.  These are consistent with the\n\\smash{$\\tau_{(26,28)} \\approx 100 \\ \\textrm{ms}$} we find in\n\\cref{fig:first_peak_production}. We also note that at around 600~ms into the\ncalculation---which is after neutron exhaustion---there is a further increase in\nthe first peak abundance.  This is driven by the reaction\n\\smash{$^{80}$Ni($\\beta^-,n)^{79}$Cu}. Significant production of\n\\smash{$^{80}$Ni} occurs just before neutron freeze-out and it has a half-life\nof 175~ms.  \n\nThis suggests that the neutrino flux between times $t_1 = t_\\textrm{ex} -\n\\tau_{(6,25)} - \\tau_{(26,28)}$ and  $t_2 = t_\\textrm{ex} - \\tau_{(6,25)}$ will\ndetermine the amount of neutrino induced first peak production that occurs.\nSeed nuclei produced before time $t_1$ will get beyond the first peak before\nneutrons are exhausted, while seed nuclei produced after time $t_2$ will not\nreach the first peak before neutron exhaustion occurs.  Therefore, the important\nquantity for understanding neutrino induced production of the first peak will be\nthe neutrino luminosity centered at a time around 70~ms after merger, within a\nwindow of around 100~ms.  \n\nWe have shown that the production of first peak nuclei goes linearly with the\nelectron neutrino luminosity for the specific Lagrangian particle shown in\n\\cref{fig:first_peak_production}, but \\cref{fig:luminosity_abundances} shows\nthat production of the first peak appears to saturate at luminosities above\n$\\sim 5\\times 10^{52} \\, \\textrm{erg s}^{-1}$.  Below this luminosity, the\ndependence of first peak production on luminosity is approximately linear as\nexpected.  In \\cref{fig:first_peak_production2}, we show a different Lagrangian\nparticle that exhibits non-monotonic behavior of the first peak abundance with\nthe neutrino luminosity.  The first peak abundance increases at low luminosity,\ndecreases with luminosity around $L_{\\nu_e} = 10^{53} \\, \\textrm{erg s}^{-1}$, and\nthen increases with luminosity again.  This particle has a lower asymptotic\nvelocity than the particle shown in \\cref{fig:first_peak_production} and\ntherefore experiences more neutrino irradiation. Additionally, it has lower\ninitial entropy and $Y_e$, which means neutrino interactions can have a larger\neffect on its thermodynamic state.\n\nThe lower panel of \\cref{fig:first_peak_production2} clearly shows that\nneutrinos significantly alter the thermodynamic state of the considered particle\nand that the low mass r-process path is shifted by the inclusion of neutrino\ninteractions.  The r-process paths at various neutrino luminosities 100 ms into\nthe calculation are shown in \\cref{fig:path}.  In particular,\n\\smash{$\\tau_{(26,28)}$} changes drastically, \\smash{$\\tau_{(6,25)}$} also\nundergoes changes, the neutron abundance is decreased, and the total number of\nseeds increases at increased initial $Y_e$ and temperature, corresponding to\nlarger neutrino luminosities in this fluid element.  Additionally, increasing\nthe entropy of the outflow reduces the rate at which material can bypass the\n$A=8$ stability gap.  The large difference in the first peak processing\ntimescale, \\smash{$\\tau_{(26,28)}$}, seen in \\cref{fig:first_peak_production2}\nis due to the r-process path shifting from being far beyond the $N=50$, $Z=28$\nclosed shells at lower temperatures (and lower neutrino luminosities) to\nproceeding through closed shells at higher temperatures (and higher neutrino\nluminosities).  This significantly alters how first peak nuclei are produced\nthroughout the calculation and breaks the linear dependence on the neutrino\nluminosity.\n\nEven in the absence of neutrinos, there is some production of first peak nuclei.\nAs we have mentioned, this material is produced by fission of heavy nuclei.\nSince we are employing symmetric fission fragment distributions, it is likely\nthat more realistic fission fragment distributions will result in a broader\ndistribution of fission daughters and more material being left behind in this\nregion. Nonetheless, it seems likely that there will be at least some production\nof the first peak even in the very neutron-rich outflows of \\BHNS{} mergers, as\nlong as neutrino luminosities from the post merger remnant are above about\n$10^{52} \\, \\textrm{erg s}^{-1}$ within a hundred milliseconds of the merger. We\nalso emphasize that neutrino induced production of the first peak does not\nproduce enough material in our models to agree with the solar r-process\nabundances when they are normalized to the second peak.  Instead, the abundance\nis around an order of magnitude too low.\n\n\\subsection{Isotopic and Elemental Abundances, Galactic Chemical Evolution, and\nLow Metallicity Halo Stars}\n\\label{sec:GCE}\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure10.pdf}\n\\caption[]{The integrated nuclear abundances of the dynamical ejecta in the\nmodels M12-7-S9, M14-7-S8, and M14-5-S9 assuming an electron neutrino luminosity\nof $10^{53} \\, \\textrm{erg s}^{-1}$. The low electron fraction of all the ejecta\nresults in production of a robust r-process, independent of the dynamics of the\nmerger and parameters of the binary system.}\n\\label{fig:integrated_abundances}\n\\end{figure}\n\nIn \\cref{fig:integrated_abundances}, the integrated abundances from the models\nM12-7-S9, M14-7-S8, and M14-5-S9 are shown for a fixed neutrino luminosity of\n$10^{53} \\, \\textrm{erg s}^{-1}$ (and $L_{\\bar \\nu_e} = 1.5 L_{\\nu_e}$). Clearly,\nthere is little discernible difference between the predicted nucleosynthesis\nfrom these models. The electron fraction in almost all of the ejecta in all\nthree models is below the threshold for fission cycling to occur\n\\citep{lippuner:15} and the entropy of the ejecta is quite low. These are\nconditions that result in a second and third peak nuclear abundance pattern that\nis quite insensitive to the detailed properties of the ejecta\n\\citep[e.g.]{lippuner:15}. Interestingly, the neutrino produced first peak is\nalso very insensitive to the binary parameters if the same neutrino luminosities\nare assumed. A priori, it would seem that different dynamics during the merger\ncould give rise to different dynamics of the ejecta and alter the radius at\nwhich neutron exhaustion occurs.  Of course, the important parameter will be the\nvelocity of the ejecta. Larger velocities will result in lower local neutrino\ndensities around the time that neutrons are exhausted in the ejected material.\n\nAlthough there is reasonable qualitative agreement with the solar r-process\nabundance pattern above $A \\sim 100$ in all of our models, there are significant\nquantitative differences. Most clearly, the third peak is significantly over\nproduced and has an offset with respect to the observed solar pattern.\nUncertainties in the ejecta abundance pattern can come from two sources,\nuncertainties in the properties of the ejecta and uncertainties in the nuclear\ndata that serves as input for our nucleosynthesis calculations. Given how\nrobust the r-process pattern in our models is above $A\\sim100$ to variations in\nthe binary parameters and neutrino irradiation, it seems unlikely---{\\it for\nour chosen nuclear data}---that \\BHNS{} mergers can make a pattern that agrees\nexactly with the r-process pattern found in the Sun and low metallicity halo\nstars. Strictly following this argument to its conclusion, \\BHNS{} mergers\nwould be ruled out as the dominant contributor to the galactic chemical\nevolution of r-process elements. This would put a significant constraint on the\ncombined merger rate, the \\BH{} spin distribution, and the \\BH{} mass\ndistribution in these binaries \\citep{bauswein:14}. Of course, it is easy to\nimagine scenarios where the galactic r-process nucleosynthesis is produced by\nmultiple types of events, so strongly ruling out a single r-process production\nchannel on the basis of inexact agreement with the solar pattern seems premature\nat best.\n\nThe second possible source of uncertainty in our results is the input nuclear\nphysics data. The nuclear masses, beta-decay rates, neutron capture rates, and\nfission fragment distributions in the r-process path, which lies far from\nnuclear stability, have, on the whole, not been experimentally determined but\nare instead determined from models fit to data closer to stability\n\\citep{moeller:97}. For instance, different nuclear mass models can give\nsignificantly different abundance patterns for the same thermodynamic histories\n\\citep{arcones:11, martin:15}. By varying masses within a particular mass model\nwithin the expected uncertainty, \\cite{mumpower:15} have shown that the\nuncertainties in the final r-process abundance pattern solely due to nuclear\nphysics uncertainties can be as a large as a factor of ten. Therefore, given the\nlevel of agreement we find with the solar r-process isotopic abundance pattern,\nour results seem wholly consistent with \\BHNS{} mergers contributing to the\ngalactic budget of heavy r-process nuclei.\n\n\\begin{figure}\n\\includegraphics[width=\\linewidth]{Figure11.pdf}\n\\caption[]{{\\it Top Panel:} The integrated elemental abundances in the ejecta of\nmodel M12-7-S9 for a range of imposed neutrino luminosities compared to\narbitrarily scaled solar r-process abundances. We include the name of every\nother element to guide the eye. {\\it Bottom Panel:} Ratio of the calculated\nabundances to the solar abundances \\citep[from][]{arlandini:99}. In the lower\npanel, factor of three error bars are included on our calculated abundance\npatterns to approximately account for errors in the input nuclear physics. The\nsolar r-process abundances have been transformed by an overall scaling factor to\nminimize the residuals in log space in the region $40<Z<81$. We also include\nabundances from the low metallicity halo stars HD 115444 and 122563\n\\citep{westin:00} and HD 108317 and 128279 \\citep{roederer:12, roederer:14},\nwith [Fe/H] of $-3.0$, $-2.7$, $-2.5$, and $-2.5$, respectively. The observational\nerror bars are smaller than the plotted symbols and the abundances patterns have\nbeen scaled by a factor to minimize the deviation from the solar r-process in\nthe range $40<Z<81$.}\n\\label{fig:integrated_Zabundances}\n\\end{figure}\n\nFor confrontation with observations of abundances in low metallicity halo stars,\nit is more instructive to examine the {\\it elemental} abundance pattern of the\nejecta (i.e. $Y_{\\rm Z} = \\sum_i \\delta_{Z_i, {\\rm Z}} Y_i$). In\n\\cref{fig:integrated_Zabundances}, we show the final elemental abundances in the\nejecta of model M12-7-S9 for a variety of assumed neutrino luminosities. In the\nregion $51<Z<81$, most of the abundances agree with the solar pattern to within\na factor of three. The notable exceptions are gold and platinum in the third\npeak and cesium in the second peak, all of which are overproduced by a factor of\naround ten. Although the agreement is not perfect, our patterns above Mo are\nwithin the errors due to uncertainties in the nuclear physics input\n\\citep{mumpower:15}.\n\nFor elements below Mo, there are a number of primary nucleosynthesis\nprocesses that can contribute to these abundances, even in low metallicity stars\n\\citep{travaglio:04, montes:07, qian:08}. Therefore, it is hard to rule out our\nmodels because they fail to produce certain abundances below Mo. As can be seen\nin the bottom panel of \\cref{fig:integrated_Zabundances}, the abundances\nbelow Mo are significantly underproduced relative to solar in all of our\nmodels. Nevertheless, neutrino induced r-process seed production brings these\nabundances up much closer to the solar value.\n\nSince many processes contribute to the solar abundances, it is more reasonable\nto compare our abundances with those measured in the atmospheres of low\nmetallicity halo stars. In \\cref{fig:integrated_Zabundances}, we show the\nabundances of four low metallicity halo stars with sub-solar Ge abundances. The\nabundance data are taken from \\cite{westin:00}, \\cite{roederer:12}, and\n\\cite{roederer:14} for the stars HD 115444, 122563, 108317, and 128279, which\nhave metallicities of $[\\textrm{Fe/H}]=-3.0$, $-2.7$, $-2.5$, and $-2.5$, respectively.\nThese metallicities are low enough such that s-process contamination from low\nmass stars is highly unlikely \\citep{simmerer:04}. Nonetheless, it is possible\nthat the s-process in massive stars may have contributed to these abundances\n\\citep[e.g.,][]{woosley:02}.\n\nWe can compare our predicted abundances with the observed abundances of Ge, As,\nand Se. For these elements, neutrino induced r-process seed production of the\nfirst peak brings the abundances of Ge, As, and Se closer to agreement with the\nobserved values for larger values of the electron neutrino luminosity, even\nthough the abundances are still small by close to a factor of ten.  Given the\nsignificant uncertaties in the level of neutrino irradiation and the properties\nof nuclei far from stability near and below the first peak, the actual amount of\nfirst peak material created by neutrino induced seed production is highly\nuncertain.  If first peak production could be increased by around an order of\nmagnitude, certain low metallicity halo star abundance patterns above Zn can\npossibly be explained by only invoking nucleosynthesis in the dynamical ejecta\nof \\BHNS{} mergers, although there are clearly a number of other possible ways\nto produce the first peak in the material ejected from the disk\n\\cite[e.g.][]{just:15}.  This contrasts with the results of \\cite{wanajo:14} for\nbinary \\NS{} mergers, where they find that the first peak nuclei are produced\nwith a ratio to the second and third peak that is close to the ratio observed in\nthe sun and therefore are over producing the first peak by about a factor of ten\nrelative to the low metallicity halo star abundances.\n\nIn contrast to Ge, As, and Se, all the \\BHNS{} merger outflows underproduce Sr\nby orders of magnitude and the final abundances of Sr and Zr are insensitive to\nthe level of neutrino irradiation. This discrepancy could be due in part to our\nuse of symmetric fission fragment distributions, another process providing these\nelements (such as neutrino driven winds in core collapse supernovae;\n\\cite{roberts:10}), or it could signal problems for a \\BHNS{} merger production\nscenario for the r-process.\n\n\\section{Conclusions}\n\nIn this work, we have considered nucleosynthesis in the ejecta of \\BHNS{}\nmergers including the effect of neutrino interactions. Starting from general\nrelativistic hydrodynamic simulations of \\BHNS{} mergers with reasonably high\n\\BH{} spins, we have extracted the unbound material and mapped it into a\nNewtonian \\SPH{} code, {\\emph{StarSmasher}}.  We then evolved the ejecta over a long\nenough time to reach homologous expansion. Using the Lagrangian histories of\nthe \\SPH{} particles, we then performed post-processing calculations of\nnucleosynthesis in the neutron-rich ejecta with {\\emph{SkyNet}}. In particular, we\nfocused on the influence of neutrinos on the nucleosynthesis in these outflows\nby parameterizing the neutrino luminosity coming from the disk.\n\nAs is expected from previous work \\citep[e.g.][]{lattimer:77, roberts:11,\nfoucart:14a, bauswein:14}, we find that the second and third r-process peaks are\nrobustly produced in the outflow. In contrast to the case of \\NSNS{}  mergers\n\\citep{wanajo:14, goriely:15, sekiguchi:15}, we find that---for reasonable\nluminosities of $L_{\\nu_e} = \\{0, 0.2, 1, 5, 25\\} \\times 10^{52} \\, \\textrm{erg s}^{-1}$---neutrinos\nare unable to significantly shift the distribution of the pre-r-process electron\nfraction in the ejecta and almost all of the ejected mass elements produce the\nfull r-process. This is due to the rapid outflow timescales of the tidal ejecta\nand the relatively low expected neutrino luminosities of the disk formed around\nthe remnant \\BH{}. Additionally, we find that there are negligible differences\nbetween the nucleosynthesis calculated for different \\BHNS{} binary parameters.\n\nAlthough weak interactions have no gross effect on the electron fraction\ndistribution, we find they do alter nucleosynthesis in more subtle ways. Once\nr-process neutron captures have begun, electron neutrino captures can turn a\nsmall fraction of the neutrons into protons. These protons form alpha particles\nwhich rapidly combine to form $^{12}$C. This provides a source of low mass seed\nnuclei for the r-process and results in nuclear flow below mass 78 that is not\npresent when neutrinos are neglected. In the few hundred milliseconds before\nneutron exhaustion, this flow can build up a significant amount of material in\nthe first r-process peak at mass 78. To the best of our knowledge, this is the\nfirst time this process has been described. It is likely to operate both in the\ndynamical ejecta of \\BHNS{} mergers and binary \\NS{} mergers, as well as in\nmaterial that is ejected from the disks left over in these events, which we did\nnot consider in this work.\n\nAlthough this neutrino induced seed production produces the first peak, we find\nthat it does not produce enough material to bring the final abundance\ndistributions into agreement with the solar r-process distribution below mass\n80. Nonetheless, this first peak production will be interesting when\ncomparing with the abundance patterns of low metallicity halo stars. In\nparticular, it can significantly increase the abundance of the elements Ge, As,\nand Se and could potentially account for the abundances of these elements at low\nmetallicity.\n\nFurther work is required to determine how robust neutrino induced\nr-process seed production is to variations in beta-decay lifetimes and neutron\ncapture rates around the $N=50$ closed shell. Additionally, employing more\nrealistic fission fragment distributions than the ones employed here may also\neffect the abundances found just above the first r-process peak. Of course,\nthis process is sensitive to the electron neutrino flux in the outflow.\nHere, we have chosen to parameterize the neutrino luminosity. Therefore, better\nmodels of the electron neutrino irradiation of the outflow are required to\ndetermine if neutrino induced r-process seed production is robust in\nnature. The results are likely to be somewhat sensitive to the beta-decay rates\naway from stability below $Z=28$, so better measurements of decays along the\nr-process path could shed significant light on whether or not this process\nis important in the ejecta of \\BHNS{} mergers.  It will also be interesting to\ninvestigate if this process operates in other environments with low $Y_e$\noutflows, namely the ejecta of binary \\NS{} mergers and material ejected from\ndisks formed after compact object mergers.\n\n\n\\section*{Acknowledgements}\nLR acknowledges Yongzhong Qian and Projjwal Banerjee for useful discussions\nrelating to this work.\n\nSupport for this work was provided by NASA through Einstein\nPostdoctoral Fellowship grants numbered PF3-140114 (LR) and PF4-150122\n(FF) awarded by the Chandra X-ray Center, which is operated by the\nSmithsonian Astrophysical Observatory for NASA under contract\nNAS8-03060. JL and CDO are partially supported by the NSF under award\nNos.\\ TCAN AST-1333520, CAREER PHY-1151197, and AST-1205732, and by\nthe Sherman Fairchild Foundation.  JCL is supported by NSF grant\nnumber AST-1313091. This work also benefitted from NSF support through\naward No. PHY-1430152 (JINA Center for the Evolution of the Elements).\nM.D.D. acknowledges support through NSF Grant PHY-1402916.\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Aasi} {et~al.}(2015){Aasi}, {Abbott}, {Abbott}, {Abbott},\n  {Abernathy}, {Ackley}, {Adams}, {Adams}, {Addesso}, \\& et~al.}]{aligo:15}\n{Aasi}, J., {Abbott}, B.~P., {Abbott}, R., {et~al.} 2015, {Class.~Quant.~Grav.}, 32, 074001,\n  \\href{http://doi.org/10.1088/0264-9381/32/7/074001}{doi:10.1088/0264-9381/32/7/074001}\n\n\\bibitem[{{Abadie} {et~al.}(2010){Abadie}, {Abbott}, {Abbott}, {Abernathy},\n  {Accadia}, {Acernese}, {Adams}, {Adhikari}, {Ajith}, {Allen}, \\&\n  et~al.}]{abadie:10}\n{Abadie}, J., {Abbott}, B.~P., {Abbott}, R., {et~al.} 2010, {Class.~Quant.~Grav.}, 27, 173001,\n  \\href{http://arxiv.org/abs/1003.2480}{arXiv:astro-ph.HE/1003.2480}\n\n\\bibitem[{{Acernese} {et~al.}(2015){Acernese}, {Agathos}, {Agatsuma}, {Aisa},\n  {Allemandou}, {Allocca}, {Amarni}, {Astone}, {Balestri}, {Ballardin}, \\&\n  et~al.}]{avirgo:15}\n{Acernese}, F., {Agathos}, M., {Agatsuma}, K., {et~al.} 2015, {Class.~Quant.~Grav.}, 32, 024001,\n  \\href{http://arxiv.org/abs/1408.3978}{arXiv:gr-qc/1408.3978}\n\n\\bibitem[{{Antoniadis} {et~al.}(2013){Antoniadis}, {Freire}, {Wex}, {Tauris},\n  {Lynch}, {van Kerkwijk}, {Kramer}, {Bassa}, {Dhillon}, {Driebe}, {Hessels},\n  {Kaspi}, {Kondratiev}, {Langer}, {Marsh}, {McLaughlin}, {Pennucci}, {Ransom},\n  {Stairs}, {van Leeuwen}, {Verbiest}, \\& {Whelan}}]{antoniadis:13}\n{Antoniadis}, J., {Freire}, P.~C.~C., {Wex}, N., {et~al.} 2013, Science, 340,\n  448, \\href{http://arxiv.org/abs/1304.6875}{arXiv:astro-ph.HE/1304.6875}\n\n\\bibitem[{{Arcones} \\& {Mart{\\'{\\i}}nez-Pinedo}(2011)}]{arcones:11}\n{Arcones}, A., \\& {Mart{\\'{\\i}}nez-Pinedo}, G. 2011, \\prc, 83, 045809,\n  \\href{http://arxiv.org/abs/1008.3890}{arXiv:astro-ph.SR/1008.3890}\n\n\\bibitem[{{Arcones} {et~al.}(2010){Arcones}, {Mart{\\'{\\i}}nez-Pinedo},\n  {Roberts}, \\& {Woosley}}]{arcones:10}\n{Arcones}, A., {Mart{\\'{\\i}}nez-Pinedo}, G., {Roberts}, L.~F., \\& {Woosley},\n  S.~E. 2010, \\aap, 522, A25,\n  \\href{http://arxiv.org/abs/1002.3854}{arXiv:astro-ph.SR/1002.3854}\n\n\\bibitem[{{Argast} {et~al.}(2004){Argast}, {Samland}, {Thielemann}, \\&\n  {Qian}}]{argast:04}\n{Argast}, D., {Samland}, M., {Thielemann}, F.-K., \\& {Qian}, Y.-Z. 2004, \\aap,\n  416, 997,\n  \\href{http://arxiv.org/abs/astro-ph/0309237}{arXiv:astro-ph/0309237}\n\n\\bibitem[{{Arlandini} {et~al.}(1999){Arlandini}, {K{\\\"a}ppeler}, {Wisshak},\n  {Gallino}, {Lugaro}, {Busso}, \\& {Straniero}}]{arlandini:99}\n{Arlandini}, C., {K{\\\"a}ppeler}, F., {Wisshak}, K., {et~al.} 1999, \\apj, 525,\n  886, \\href{http://arxiv.org/abs/astro-ph/9906266}{arXiv:astro-ph/9906266}\n\n\\bibitem[{{Balsara}(1995)}]{Balsara1995}\n{Balsara}, D.~S. 1995, Journal of Computational Physics, 121, 357,\n  \\href{http://doi.org/10.1016/S0021-9991(95)90221-X}{doi:10.1016/S0021-9991(95)90221-X}\n\n\\bibitem[{{Bauswein} {et~al.}(2014{\\natexlab{a}}){Bauswein}, {Ardevol\n  Pulpillo}, {Janka}, \\& {Goriely}}]{bauswein:14b}\n{Bauswein}, A., {Ardevol Pulpillo}, R., {Janka}, H.-T., \\& {Goriely}, S.\n  2014{\\natexlab{a}}, \\apjl, 795, L9,\n  \\href{http://arxiv.org/abs/1408.1783}{arXiv:astro-ph.SR/1408.1783}\n\n\\bibitem[{{Bauswein} {et~al.}(2014{\\natexlab{b}}){Bauswein}, {Stergioulas}, \\&\n  {Janka}}]{bauswein:14}\n{Bauswein}, A., {Stergioulas}, N., \\& {Janka}, H.-T. 2014{\\natexlab{b}}, \\prd,\n  90, 023002,\n  \\href{http://arxiv.org/abs/1403.5301}{arXiv:astro-ph.SR/1403.5301}\n\n\\bibitem[{{Berger} {et~al.}(2013){Berger}, {Fong}, \\& {Chornock}}]{berger:13}\n{Berger}, E., {Fong}, W., \\& {Chornock}, R. 2013, \\apjl, 774, L23,\n  \\href{http://arxiv.org/abs/1306.3960}{arXiv:astro-ph.HE/1306.3960}\n\n\\bibitem[{Burbidge {et~al.}(1957)Burbidge, Burbidge, Fowler, \\&\n  Hoyle}]{burbidge:57}\nBurbidge, E.~M., Burbidge, G.~R., Fowler, W.~A., \\& Hoyle, F. 1957, Rev. Mod.\n  Phys., 29, 547,\n  \\href{http://doi.org/10.1103/RevModPhys.29.547}{doi:10.1103/RevModPhys.29.547}\n\n\\bibitem[{Cyburt {et~al.}(2010)Cyburt, Amthor, Ferguson, Meisel, Smith, Warren,\n  Heger, Hoffman, Rauscher, Sakharuk, Schatz, Thielemann, \\&\n  Wiescher}]{cyburt:10}\nCyburt, R.~H., Amthor, A.~M., Ferguson, R., {et~al.} 2010, \\apjs, 189, 240,\n  \\href{http://doi.org/10.1088/0067-0049/189/1/240}{doi:10.1088/0067-0049/189/1/240},\n  {REACLIB is available at \\url{https://groups.nscl.msu.edu/jina/reaclib/db/}}\n\n\\bibitem[{{Deaton} {et~al.}(2013){Deaton}, {Duez}, {Foucart}, {O'Connor},\n  {Ott}, {Kidder}, {Muhlberger}, {Scheel}, \\& {Szilagyi}}]{deaton:13}\n{Deaton}, M.~B., {Duez}, M.~D., {Foucart}, F., {et~al.} 2013, \\apj, 776, 47,\n  \\href{http://arxiv.org/abs/1304.3384}{arXiv:astro-ph.HE/1304.3384}\n\n\\bibitem[{{Demorest} {et~al.}(2010){Demorest}, {Pennucci}, {Ransom}, {Roberts},\n  \\& {Hessels}}]{demorest:10b}\n{Demorest}, P.~B., {Pennucci}, T., {Ransom}, S.~M., {Roberts}, M.~S.~E., \\&\n  {Hessels}, J.~W.~T. 2010, \\nat, 467, 1081,\n  \\href{http://arxiv.org/abs/1010.5788}{arXiv:astro-ph.HE/1010.5788}\n\n\\bibitem[{{Farr} {et~al.}(2011){Farr}, {Sravan}, {Cantrell}, {Kreidberg},\n  {Bailyn}, {Mandel}, \\& {Kalogera}}]{farr:11}\n{Farr}, W.~M., {Sravan}, N., {Cantrell}, A., {et~al.} 2011, \\apj, 741, 103,\n  \\href{http://arxiv.org/abs/1011.1459}{arXiv:astro-ph.GA/1011.1459}\n\n\\bibitem[{{Fischer} {et~al.}(2010){Fischer}, {Whitehouse}, {Mezzacappa},\n  {Thielemann}, \\& {Liebend{\\\"o}rfer}}]{fischer:10}\n{Fischer}, T., {Whitehouse}, S.~C., {Mezzacappa}, A., {Thielemann}, F.-K., \\&\n  {Liebend{\\\"o}rfer}, M. 2010, \\aap, 517, A80,\n  \\href{http://arxiv.org/abs/0908.1871}{arXiv:astro-ph.HE/0908.1871}\n\n\\bibitem[{{Foucart}(2012)}]{foucart:12dm}\n{Foucart}, F. 2012, \\prd, 86, 124007,\n  \\href{http://arxiv.org/abs/1207.6304}{arXiv:astro-ph.HE/1207.6304}\n\n\\bibitem[{{Foucart} {et~al.}(2013){Foucart}, {Deaton}, {Duez}, {Kidder},\n  {MacDonald}, {Ott}, {Pfeiffer}, {Scheel}, {Szilagyi}, \\&\n  {Teukolsky}}]{foucart:13}\n{Foucart}, F., {Deaton}, M.~B., {Duez}, M.~D., {et~al.} 2013, \\prd, 87, 084006,\n  \\href{http://arxiv.org/abs/1212.4810}{arXiv:gr-qc/1212.4810}\n\n\\bibitem[{Foucart {et~al.}(2014)Foucart, Deaton, Duez, {O'Connor}, Ott, Haas,\n  Kidder, Pfeiffer, Scheel, \\& Szilagyi}]{foucart:14a}\nFoucart, F., Deaton, M.~B., Duez, M.~D., {et~al.} 2014, \\prd, 90, 024026,\n  \\href{http://arxiv.org/abs/1405.1121}{arXiv:astro-ph.HE/1405.1121}\n\n\\bibitem[{{Foucart} {et~al.}(2015{\\natexlab{a}}){Foucart}, {Haas}, {Duez},\n  {O'Connor}, {Ott}, {Roberts}, {Kidder}, {Lippuner}, {Pfeiffer}, \\&\n  {Scheel}}]{foucart:15b}\n{Foucart}, F., {Haas}, R., {Duez}, M.~D., {et~al.} 2015{\\natexlab{a}}, ArXiv\n  e-prints,\n  \\href{http://arxiv.org/abs/1510.06398}{arXiv:astro-ph.HE/1510.06398}\n\n\\bibitem[{{Foucart} {et~al.}(2015{\\natexlab{b}}){Foucart}, {O'Connor},\n  {Roberts}, {Duez}, {Haas}, {Kidder}, {Ott}, {Pfeiffer}, {Scheel}, \\&\n  {Szilagyi}}]{foucart:15}\n{Foucart}, F., {O'Connor}, E., {Roberts}, L., {et~al.} 2015{\\natexlab{b}},\n  \\prd, 91, 124021,\n  \\href{http://arxiv.org/abs/1502.04146}{arXiv:astro-ph.HE/1502.04146}\n\n\\bibitem[{{Frankel} \\& {Metropolis}(1947)}]{frankel:47}\n{Frankel}, S., \\& {Metropolis}, N. 1947, Physical Review, 72, 914,\n  \\href{http://doi.org/10.1103/PhysRev.72.914}{doi:10.1103/PhysRev.72.914}\n\n\\bibitem[{{Freiburghaus} {et~al.}(1999){Freiburghaus}, {Rosswog}, \\&\n  {Thielemann}}]{freiburghaus:99}\n{Freiburghaus}, C., {Rosswog}, S., \\& {Thielemann}, F.-K. 1999, \\apjl, 525,\n  L121, \\href{http://doi.org/10.1086/312343}{doi:10.1086/312343}\n\n\\bibitem[{{Fuller} {et~al.}(1982){Fuller}, {Fowler}, \\& {Newman}}]{fuller:82}\n{Fuller}, G.~M., {Fowler}, W.~A., \\& {Newman}, M.~J. 1982, \\apjs, 48, 279,\n  \\href{http://doi.org/10.1086/190779}{doi:10.1086/190779}\n\n\\bibitem[{{Fuller} \\& {Meyer}(1995)}]{fuller:95}\n{Fuller}, G.~M., \\& {Meyer}, B.~S. 1995, \\apj, 453, 792,\n  \\href{http://doi.org/10.1086/176442}{doi:10.1086/176442}\n\n\\bibitem[{Gaburov {et~al.}(2010)Gaburov, Lombardi, \\& Zwart}]{Gaburov:2009kg}\nGaburov, E., Lombardi, J., \\& Zwart, S.~P. 2010, \\mnras, 402, 105,\n  \\href{http://arxiv.org/abs/0904.0997}{arXiv:astro-ph.SR/0904.0997}\n\n\\bibitem[{{Goriely} {et~al.}(2015){Goriely}, {Bauswein}, {Just}, {Pllumbi}, \\&\n  {Janka}}]{goriely:15}\n{Goriely}, S., {Bauswein}, A., {Just}, O., {Pllumbi}, E., \\& {Janka}, H.-T.\n  2015, \\mnras, 452, 3894,\n  \\href{http://arxiv.org/abs/1504.04377}{arXiv:astro-ph.SR/1504.04377}\n\n\\bibitem[{{Hebeler} {et~al.}(2013){Hebeler}, {Lattimer}, {Pethick}, \\&\n  {Schwenk}}]{hebeler:13}\n{Hebeler}, K., {Lattimer}, J.~M., {Pethick}, C.~J., \\& {Schwenk}, A. 2013,\n  \\apj, 773, 11,\n  \\href{http://arxiv.org/abs/1303.4662}{arXiv:astro-ph.SR/1303.4662}\n\n\\bibitem[{{Hoffman} {et~al.}(1997){Hoffman}, {Woosley}, \\& {Qian}}]{hoffman:97}\n{Hoffman}, R.~D., {Woosley}, S.~E., \\& {Qian}, Y.-Z. 1997, \\apj, 482, 951,\n  \\href{http://arxiv.org/abs/astro-ph/9611097}{arXiv:astro-ph/9611097}\n\n\\bibitem[{{Horowitz}(2002)}]{horowitz:02}\n{Horowitz}, C.~J. 2002, \\prd, 65, 043001,\n  \\href{http://arxiv.org/abs/arXiv:astro-ph/0109209}{arXiv:astro-ph/0109209}\n\n\\bibitem[{{Hotokezaka} {et~al.}(2013){Hotokezaka}, {Kyutoku}, {Tanaka},\n  {Kiuchi}, {Sekiguchi}, {Shibata}, \\& {Wanajo}}]{hotokezaka:13b}\n{Hotokezaka}, K., {Kyutoku}, K., {Tanaka}, M., {et~al.} 2013, \\apjl, 778, L16,\n  \\href{http://arxiv.org/abs/1310.1623}{arXiv:astro-ph.HE/1310.1623}\n\n\\bibitem[{{H{\\\"u}depohl} {et~al.}(2010){H{\\\"u}depohl}, {M{\\\"u}ller}, {Janka},\n  {Marek}, \\& {Raffelt}}]{huedepohl:10}\n{H{\\\"u}depohl}, L., {M{\\\"u}ller}, B., {Janka}, H.-T., {Marek}, A., \\&\n  {Raffelt}, G.~G. 2010, Phys. Rev. Lett., 104, 251101\n\n\\bibitem[{{Ishimaru} {et~al.}(2015){Ishimaru}, {Wanajo}, \\&\n  {Prantzos}}]{ishimaru:15}\n{Ishimaru}, Y., {Wanajo}, S., \\& {Prantzos}, N. 2015, \\apjl, 804, L35,\n  \\href{http://arxiv.org/abs/1504.04559}{arXiv:1504.04559}\n\n\\bibitem[{{Jin} {et~al.}(2015){Jin}, {Li}, {Cano}, {Covino}, {Fan}, \\&\n  {Wei}}]{jin:15}\n{Jin}, Z.-P., {Li}, X., {Cano}, Z., {et~al.} 2015, \\apjl, 811, L22,\n  \\href{http://arxiv.org/abs/1507.07206}{arXiv:astro-ph.HE/1507.07206}\n\n\\bibitem[{{Just} {et~al.}(2015){Just}, {Bauswein}, {Pulpillo}, {Goriely}, \\&\n  {Janka}}]{just:15}\n{Just}, O., {Bauswein}, A., {Pulpillo}, R.~A., {Goriely}, S., \\& {Janka}, H.-T.\n  2015, \\mnras, 448, 541,\n  \\href{http://arxiv.org/abs/1406.2687}{arXiv:astro-ph.SR/1406.2687}\n\n\\bibitem[{{Kasen} {et~al.}(2015){Kasen}, {Fern{\\'a}ndez}, \\&\n  {Metzger}}]{kasen:15}\n{Kasen}, D., {Fern{\\'a}ndez}, R., \\& {Metzger}, B.~D. 2015, \\mnras, 450, 1777,\n  \\href{http://arxiv.org/abs/1411.3726}{arXiv:astro-ph.HE/1411.3726}\n\n\\bibitem[{{Kiziltan} {et~al.}(2013){Kiziltan}, {Kottas}, {De Yoreo}, \\&\n  {Thorsett}}]{kiziltan:13}\n{Kiziltan}, B., {Kottas}, A., {De Yoreo}, M., \\& {Thorsett}, S.~E. 2013, \\apj,\n  778, 66, \\href{http://arxiv.org/abs/1011.4291}{arXiv:1011.4291}\n\n\\bibitem[{{Kyutoku} {et~al.}(2015){Kyutoku}, {Ioka}, {Okawa}, {Shibata}, \\&\n  {Taniguchi}}]{kyutoku:15}\n{Kyutoku}, K., {Ioka}, K., {Okawa}, H., {Shibata}, M., \\& {Taniguchi}, K. 2015,\n  \\prd, 92, 044028,\n  \\href{http://arxiv.org/abs/1502.05402}{arXiv:astro-ph.HE/1502.05402}\n\n\\bibitem[{{Langanke} \\& {Mart{\\'{\\i}}nez-Pinedo}(2000)}]{langanke:00}\n{Langanke}, K., \\& {Mart{\\'{\\i}}nez-Pinedo}, G. 2000, Nuc. Phys. A, 673, 481,\n  \\href{http://arxiv.org/abs/nucl-th/0001018}{arXiv:nucl-th/0001018}\n\n\\bibitem[{{Lattimer} {et~al.}(1977){Lattimer}, {Mackie}, {Ravenhall}, \\&\n  {Schramm}}]{lattimer:77}\n{Lattimer}, J.~M., {Mackie}, F., {Ravenhall}, D.~G., \\& {Schramm}, D.~N. 1977,\n  \\apj, 213, 225, \\href{http://doi.org/10.1086/155148}{doi:10.1086/155148}\n\n\\bibitem[{{Lattimer} \\& {Schramm}(1976)}]{lattimer:76}\n{Lattimer}, J.~M., \\& {Schramm}, D.~N. 1976, \\apj, 210, 549,\n  \\href{http://doi.org/10.1086/154860}{doi:10.1086/154860}\n\n\\bibitem[{Lattimer \\& Swesty(1991)}]{lseos:91}\nLattimer, J.~M., \\& Swesty, F.~D. 1991, {Nucl. Phys. A}, 535, 331\n\n\\bibitem[{{Lee} \\& {Ramirez-Ruiz}(2007)}]{lee_rev:07}\n{Lee}, W.~H., \\& {Ramirez-Ruiz}, E. 2007, New Journal of Physics, 9, 17,\n  \\href{http://arxiv.org/abs/astro-ph/0701874}{arXiv:astro-ph/0701874}\n\n\\bibitem[{{Lippuner} \\& {Roberts}(2015)}]{lippuner:15}\n{Lippuner}, J., \\& {Roberts}, L.~F. 2015, \\apj, 815, 82,\n  \\href{http://arxiv.org/abs/1508.03133}{arXiv:astro-ph.HE/1508.03133}\n\n\\bibitem[{Lombardi {et~al.}(2006)Lombardi, Proulx, Dooley, Theriault, Ivanova,\n  \\& Rasio}]{Lombardi:2005nm}\nLombardi, Jr., J.~C., Proulx, Z.~F., Dooley, K.~L., {et~al.} 2006, Astrophys.\n  J., 640, 441,\n  \\href{http://arxiv.org/abs/astro-ph/0509511}{arXiv:astro-ph/astro-ph/0509511}\n\n\\bibitem[{{Mamdouh} {et~al.}(2001){Mamdouh}, {Pearson}, {Rayet}, \\&\n  {Tondeur}}]{mamdouh:01}\n{Mamdouh}, A., {Pearson}, J.~M., {Rayet}, M., \\& {Tondeur}, F. 2001, Nuc. Phys.\n  A, 679, 337,\n  \\href{http://arxiv.org/abs/nucl-th/0010093}{arXiv:nucl-th/0010093}\n\n\\bibitem[{{Martin} {et~al.}(2015){Martin}, {Perego}, {Arcones}, {Thielemann},\n  {Korobkin}, \\& {Rosswog}}]{martin:15}\n{Martin}, D., {Perego}, A., {Arcones}, A., {et~al.} 2015, \\apj, 813, 2,\n  \\href{http://arxiv.org/abs/1506.05048}{arXiv:astro-ph.SR/1506.05048}\n\n\\bibitem[{{Matteucci} {et~al.}(2014){Matteucci}, {Romano}, {Arcones},\n  {Korobkin}, \\& {Rosswog}}]{matteucci:14}\n{Matteucci}, F., {Romano}, D., {Arcones}, A., {Korobkin}, O., \\& {Rosswog}, S.\n  2014, \\mnras, 438, 2177,\n  \\href{http://arxiv.org/abs/1311.6980}{arXiv:1311.6980}\n\n\\bibitem[{{Metzger} \\& {Berger}(2012)}]{metzger:12}\n{Metzger}, B.~D., \\& {Berger}, E. 2012, \\apj, 746, 48,\n  \\href{http://arxiv.org/abs/1108.6056}{arXiv:astro-ph.HE/1108.6056}\n\n\\bibitem[{{M{\\\"o}ller} {et~al.}(1997){M{\\\"o}ller}, {Nix}, \\&\n  {Kratz}}]{moeller:97}\n{M{\\\"o}ller}, P., {Nix}, J.~R., \\& {Kratz}, K.-L. 1997, Atomic Data and Nuclear\n  Data Tables, 66, 131,\n  \\href{http://doi.org/10.1006/adnd.1997.0746}{doi:10.1006/adnd.1997.0746}\n\n\\bibitem[{Monaghan(2002)}]{Monaghan:2002ru}\nMonaghan, J.~J. 2002, \\mnras, 335, 843,\n  \\href{http://arxiv.org/abs/astro-ph/0204118}{arXiv:astro-ph/astro-ph/0204118}\n\n\\bibitem[{{Montes} {et~al.}(2007){Montes}, {Beers}, {Cowan}, {Elliot},\n  {Farouqi}, {Gallino}, {Heil}, {Kratz}, {Pfeiffer}, {Pignatari}, \\&\n  {Schatz}}]{montes:07}\n{Montes}, F., {Beers}, T.~C., {Cowan}, J., {et~al.} 2007, \\apj, 671, 1685,\n  \\href{http://arxiv.org/abs/0709.0417}{arXiv:0709.0417}\n\n\\bibitem[{{Mumpower} {et~al.}(2015){Mumpower}, {Surman}, {Fang}, {Beard},\n  {M{\\\"o}ller}, {Kawano}, \\& {Aprahamian}}]{mumpower:15}\n{Mumpower}, M.~R., {Surman}, R., {Fang}, D.-L., {et~al.} 2015, \\prc, 92,\n  035807, \\href{http://arxiv.org/abs/1505.07789}{arXiv:nucl-th/1505.07789}\n\n\\bibitem[{Neilsen {et~al.}(2014)Neilsen, Liebling, Anderson, Lehner, O'Connor,\n  \\& Palenzuela}]{neilsen:14}\nNeilsen, D., Liebling, S.~L., Anderson, M., {et~al.} 2014, \\prd, 89, 104029,\n  \\href{http://arxiv.org/abs/1403.3680}{arXiv:1403.3680}\n\n\\bibitem[{{O'Connor} \\& {Ott}(2010)}]{oconnor:10}\n{O'Connor}, E., \\& {Ott}, C.~D. 2010, {Class.~Quant.~Grav.}, 27, 114103\n\n\\bibitem[{{{\\\"O}zel} {et~al.}(2010){{\\\"O}zel}, {Psaltis}, {Narayan}, \\&\n  {McClintock}}]{ozel:10bh}\n{{\\\"O}zel}, F., {Psaltis}, D., {Narayan}, R., \\& {McClintock}, J.~E. 2010,\n  \\apj, 725, 1918, \\href{http://arxiv.org/abs/1006.2834}{arXiv:1006.2834}\n\n\\bibitem[{Paczynski \\& Wiita(1980)}]{Paczynski:1979rz}\nPaczynski, B., \\& Wiita, P.~J. 1980, Astron. Astrophys., 88, 23\n\n\\bibitem[{Palenzuela {et~al.}(2015)Palenzuela, Liebling, Neilsen, Lehner,\n  Caballero, Oâ\u0080\u0099Connor, \\& Anderson}]{palenzuela:15}\nPalenzuela, C., Liebling, S.~L., Neilsen, D., {et~al.} 2015, Phys. Rev., D92,\n  044045, \\href{http://arxiv.org/abs/1505.01607}{arXiv:gr-qc/1505.01607}\n\n\\bibitem[{{Panov} {et~al.}(2010){Panov}, {Korneev}, {Rauscher},\n  {Mart{\\'{\\i}}nez-Pinedo}, {Keli{\\'c}-Heil}, {Zinner}, \\&\n  {Thielemann}}]{panov:10}\n{Panov}, I.~V., {Korneev}, I.~Y., {Rauscher}, T., {et~al.} 2010, \\aap, 513,\n  A61+, \\href{http://arxiv.org/abs/0911.2181}{arXiv:astro-ph.SR/0911.2181}\n\n\\bibitem[{Ponce {et~al.}(2012)Ponce, Faber, \\& Lombardi}]{Ponce:2011kv}\nPonce, M., Faber, J.~A., \\& Lombardi, Jr, J.~C. 2012, \\apj, 745, 71,\n  \\href{http://arxiv.org/abs/1107.1711}{arXiv:astro-ph.CO/1107.1711}\n\n\\bibitem[{{Qian}(2000)}]{qian:00}\n{Qian}, Y.-Z. 2000, \\apjl, 534, L67,\n  \\href{http://arxiv.org/abs/astro-ph/0003242}{arXiv:astro-ph/0003242}\n\n\\bibitem[{{Qian} \\& {Wasserburg}(2008)}]{qian:08}\n{Qian}, Y.-Z., \\& {Wasserburg}, G.~J. 2008, \\apj, 687, 272,\n  \\href{http://arxiv.org/abs/0807.0809}{arXiv:0807.0809}\n\n\\bibitem[{{Radice} {et~al.}(2016){Radice}, {Galeazzi}, {Lippuner}, {Roberts},\n  {Ott}, \\& {Rezzolla}}]{radice:16b}\n{Radice}, D., {Galeazzi}, F., {Lippuner}, J., {et~al.} 2016, ArXiv e-prints,\n  \\href{http://arxiv.org/abs/1601.02426}{arXiv:astro-ph.HE/1601.02426}\n\n\\bibitem[{{Ramirez-Ruiz} {et~al.}(2015){Ramirez-Ruiz}, {Trenti}, {MacLeod},\n  {Roberts}, {Lee}, \\& {Saladino-Rosas}}]{ramirez-ruiz:15}\n{Ramirez-Ruiz}, E., {Trenti}, M., {MacLeod}, M., {et~al.} 2015, \\apjl, 802,\n  L22, \\href{http://arxiv.org/abs/1410.3467}{arXiv:1410.3467}\n\n\\bibitem[{{Roberts} {et~al.}(2011){Roberts}, {Kasen}, {Lee}, \\&\n  {Ramirez-Ruiz}}]{roberts:11}\n{Roberts}, L.~F., {Kasen}, D., {Lee}, W.~H., \\& {Ramirez-Ruiz}, E. 2011, \\apjl,\n  736, L21, \\href{http://arxiv.org/abs/1104.5504}{arXiv:astro-ph.HE/1104.5504}\n\n\\bibitem[{{Roberts} {et~al.}(2010){Roberts}, {Woosley}, \\&\n  {Hoffman}}]{roberts:10}\n{Roberts}, L.~F., {Woosley}, S.~E., \\& {Hoffman}, R.~D. 2010, \\apj, 722, 954,\n  \\href{http://arxiv.org/abs/1004.4916}{arXiv:astro-ph.HE/1004.4916}\n\n\\bibitem[{Roederer {et~al.}(2012)Roederer, Lawler, Sobeck, Beers, Cowan,\n  Frebel, Ivans, Schatz, Sneden, \\& Thompson}]{roederer:12}\nRoederer, I.~U., Lawler, J.~E., Sobeck, J.~S., {et~al.} 2012, \\apjs, 203, 27\n\n\\bibitem[{{Roederer} {et~al.}(2014){Roederer}, {Schatz}, {Lawler}, {Beers},\n  {Cowan}, {Frebel}, {Ivans}, {Sneden}, \\& {Sobeck}}]{roederer:14}\n{Roederer}, I.~U., {Schatz}, H., {Lawler}, J.~E., {et~al.} 2014, \\apj, 791, 32,\n  \\href{http://arxiv.org/abs/1406.4554}{arXiv:astro-ph.SR/1406.4554}\n\n\\bibitem[{{Sekiguchi} {et~al.}(2015){Sekiguchi}, {Kiuchi}, {Kyutoku}, \\&\n  {Shibata}}]{sekiguchi:15}\n{Sekiguchi}, Y., {Kiuchi}, K., {Kyutoku}, K., \\& {Shibata}, M. 2015, \\prd, 91,\n  064059, \\href{http://arxiv.org/abs/1502.06660}{arXiv:astro-ph.HE/1502.06660}\n\n\\bibitem[{{Shen} {et~al.}(2015){Shen}, {Cooke}, {Ramirez-Ruiz}, {Madau},\n  {Mayer}, \\& {Guedes}}]{shen:15}\n{Shen}, S., {Cooke}, R.~J., {Ramirez-Ruiz}, E., {et~al.} 2015, \\apj, 807, 115,\n  \\href{http://arxiv.org/abs/1407.3796}{arXiv:1407.3796}\n\n\\bibitem[{{Simmerer} {et~al.}(2004){Simmerer}, {Sneden}, {Cowan}, {Collier},\n  {Woolf}, \\& {Lawler}}]{simmerer:04}\n{Simmerer}, J., {Sneden}, C., {Cowan}, J.~J., {et~al.} 2004, \\apj, 617, 1091,\n  \\href{http://arxiv.org/abs/astro-ph/0410396}{arXiv:astro-ph/0410396}\n\n\\bibitem[{Springel \\& Hernquist(2002)}]{Springel:2001qb}\nSpringel, V., \\& Hernquist, L. 2002, \\mnras, 333, 649,\n  \\href{http://arxiv.org/abs/0111016}{arXiv:astro-ph/0111016}\n\n\\bibitem[{{SXS Collaboration}(2000)}]{SpEC}\n{SXS Collaboration}. 2000, Spectral Einstein Code,\n  \\url{http://www.black-holes.org/SpEC.html}\n\n\\bibitem[{{Tanvir} {et~al.}(2013){Tanvir}, {Levan}, {Fruchter}, {Hjorth},\n  {Hounsell}, {Wiersema}, \\& {Tunnicliffe}}]{tanvir:13}\n{Tanvir}, N.~R., {Levan}, A.~J., {Fruchter}, A.~S., {et~al.} 2013, \\nat, 500,\n  547, \\href{http://arxiv.org/abs/1306.4971}{arXiv:astro-ph.HE/1306.4971}\n\n\\bibitem[{{The LIGO Scientific Collaboration}(2010)}]{ligo:10}\n{The LIGO Scientific Collaboration}. 2010, Classical and Quantum Gravity, 27,\n  173001, \\href{http://arxiv.org/abs/1003.2480}{arXiv:astro-ph.HE/1003.2480}\n\n\\bibitem[{{The LIGO Scientific Collaboration}(2015)}]{aligo}\n---. 2015, {Class.~Quant.~Grav.}, 32, 074001,\n  \\href{http://arxiv.org/abs/1411.4547}{arXiv:gr-qc/1411.4547}\n\n\\bibitem[{{Timmes} \\& {Arnett}(1999)}]{timmes:99}\n{Timmes}, F.~X., \\& {Arnett}, D. 1999, \\apjs, 125, 277\n\n\\bibitem[{{Travaglio} {et~al.}(2004){Travaglio}, {Gallino}, {Arnone}, {Cowan},\n  {Jordan}, \\& {Sneden}}]{travaglio:04}\n{Travaglio}, C., {Gallino}, R., {Arnone}, E., {et~al.} 2004, \\apj, 601, 864,\n  \\href{http://arxiv.org/abs/astro-ph/0310189}{arXiv:astro-ph/0310189}\n\n\\bibitem[{{van de Voort} {et~al.}(2015){van de Voort}, {Quataert}, {Hopkins},\n  {Kere{\\v s}}, \\& {Faucher-Gigu{\\`e}re}}]{vandevoort:15}\n{van de Voort}, F., {Quataert}, E., {Hopkins}, P.~F., {Kere{\\v s}}, D., \\&\n  {Faucher-Gigu{\\`e}re}, C.-A. 2015, \\mnras, 447, 140,\n  \\href{http://arxiv.org/abs/1407.7039}{arXiv:astro-ph.GA/1407.7039}\n\n\\bibitem[{{Wanajo} {et~al.}(2014){Wanajo}, {Sekiguchi}, {Nishimura}, {Kiuchi},\n  {Kyutoku}, \\& {Shibata}}]{wanajo:14}\n{Wanajo}, S., {Sekiguchi}, Y., {Nishimura}, N., {et~al.} 2014, \\apjl, 789, L39,\n  \\href{http://arxiv.org/abs/1402.7317}{arXiv:astro-ph.SR/1402.7317}\n\n\\bibitem[{{Westin} {et~al.}(2000){Westin}, {Sneden}, {Gustafsson}, \\&\n  {Cowan}}]{westin:00}\n{Westin}, J., {Sneden}, C., {Gustafsson}, B., \\& {Cowan}, J.~J. 2000, \\apj,\n  530, 783,\n  \\href{http://arxiv.org/abs/astro-ph/9910376}{arXiv:astro-ph/9910376}\n\n\\bibitem[{{Woosley} {et~al.}(2002){Woosley}, {Heger}, \\& {Weaver}}]{woosley:02}\n{Woosley}, S.~E., {Heger}, A., \\& {Weaver}, T.~A. 2002, Rev. Mod. Phys., 74,\n  1015,\n  \\href{http://doi.org/10.1103/RevModPhys.74.1015}{doi:10.1103/RevModPhys.74.1015}\n\n\\bibitem[{{Yang} {et~al.}(2015){Yang}, {Jin}, {Li}, {Covino}, {Zheng},\n  {Hotokezaka}, {Fan}, {Piran}, \\& {Wei}}]{yang:15}\n{Yang}, B., {Jin}, Z.-P., {Li}, X., {et~al.} 2015, Nature Communications, 6,\n  7323, \\href{http://arxiv.org/abs/1503.07761}{arXiv:astro-ph.HE/1503.07761}\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 51393, "prevtext": "\nin \\cref{fig:first_peak_production}, along with the time dependence of the first\npeak abundance, $Y_\\text{1st}$,  and the neutron abundance $Y_\\text{n}$.\n$Y_{s,\\nu}$ is just the number fraction of protons produced by weak interactions\nafter time $t$ divided by six, since it requires six protons to produce a seed\nnucleus that can capture neutrons.  Material will be processed through the first\npeak on some timescale \\smash{$\\tau_\\text{1st}$}.  Let $t_\\text{ex}$ be the time\nat which neutrons are exhausted and $t_\\text{prod}$ be the time after which\nneutrino produced seed nuclei get trapped in the first peak. Seed nuclei\nproduced at times earlier than $t_\\text{prod} = t_\\text{ex} - \\tau_\\text{1st}$\nwill be burned past the first peak, while seed nuclei produced within a time\n$\\tau_\\text{1st}$ of neutron exhaustion will end up in the first peak. We can\nestimate $\\tau_\\text{1st}$ by looking for solutions of $Y_{s,\\nu}(t_\\text{prod})\n= Y_\\text{1st,final}$. Inspecting \\cref{fig:first_peak_production}, we find\n$t_\\text{prod}$ is 70 to 100~ms and $t_\\text{ex}$ is 520 to 600~ms for\n\\smash{$L_{\\nu_e,52}$} ranging from 20 to 1. Thus we estimate that\n$\\tau_\\text{1st}$, the time it takes for seed nuclei to be processed to the $N =\n28$ closed shell of the first peak, is between 450 and 500~ms for this\nparticular fluid element.\n\nWe now attempt to explain what sets this timescale.  Assuming that beta-decay\noccurs on a much longer timescale than neutron capture and photodissociation,\nthe timescale to go from charge $Z_1$ to charge $Z_2$ is given by\n\n", "index": 15, "text": "\\begin{equation}\n\\tau_{(Z_1,Z_2)}(t) = \\sum_{Z=Z_1}^{Z_2}\n\\frac{\\sum_N Y_{(Z,N)}} {\\sum_N Y_{(Z,N)} \\tau^{-1}_{\\beta^{-},(Z,N)}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\tau_{(Z_{1},Z_{2})}(t)=\\sum_{Z=Z_{1}}^{Z_{2}}\\frac{\\sum_{N}Y_{(Z,N)}}{\\sum_{N%&#10;}Y_{(Z,N)}\\tau^{-1}_{\\beta^{-},(Z,N)}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>τ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>Z</mi><mn>1</mn></msub><mo>,</mo><msub><mi>Z</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>Z</mi><mo>=</mo><msub><mi>Z</mi><mn>1</mn></msub></mrow><msub><mi>Z</mi><mn>2</mn></msub></munderover><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>N</mi></msub><msub><mi>Y</mi><mrow><mo stretchy=\"false\">(</mo><mi>Z</mi><mo>,</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>N</mi></msub><mrow><msub><mi>Y</mi><mrow><mo stretchy=\"false\">(</mo><mi>Z</mi><mo>,</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><msubsup><mi>τ</mi><mrow><msup><mi>β</mi><mo>-</mo></msup><mo>,</mo><mrow><mo stretchy=\"false\">(</mo><mi>Z</mi><mo>,</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mrow></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]