[{"file": "1601.04069.tex", "nexttext": "\nwas applied to pixel counts on re-reduced flat field and object images\n(after overscan and bias subtraction) taken during that time frame\nusing the IRAF task {\\it irlincor}. The nonlinearity had small but\nnoticeable effects on photometric scatter and trends within nights of\ndata but minor effects on measured stellar characteristics.\n\nPhotometric measurements were made using the \n\\begin{figure*}[!ht]\n\\begin{center}\n\\includegraphics [width=0.9\\textwidth]{fig1}\n\\vspace{-20pt}\n\\caption{Photometry for WOCS 24009 from the {\\it Kepler} spacecraft, and ground-based $B$,\n  $V$, $R_{c}$, and $I_{c}$ observations, compared with the best-fit ELC model\n  solution ({\\it solid line}) for phases in and immediately surrounding the\n  eclipses.\n  \\label{lc}}\n\\end{center}\n\\end{figure*}DAOPHOT II/ALLSTAR suite\nof programs \\citep{daoph}. Because crowding was an issue for a subset\nof the stars, we conducted point-spread function (PSF) photometry on\nall of the ground-based images. Typically 100-150 bright stars were\nchosen to determine the PSF and its variation across each frame. To\nimprove the quality of the photometry in a differential sense, we used\nthe observed ensemble of stars to iterate to a solution for median\nmagnitudes of all stars and photometric zeropoints for each image\n\\citep{s1082,honey}.  Figure \\ref{lc} shows WOCS 24009 primary and secondary\neclipse observations phased to the binary period with the slightly\ndeeper eclipse centered on phase $\\phi = 0$.\n\n\\subsection{{\\it Kepler} Photometry} \n\nThe {\\it Kepler} spacecraft made nearly continuous photometric\nobservations of a field between Cygnus and Lyra that included NGC 6819\n--- mission details have been previously presented in\n\\cite{borucki10}, \\cite{koch10}, \\cite{batalha10}, \\cite{caldwell10},\nand \\cite{gilliland10}.  ``Superaperture'' observations of the cluster\nwere made as part of the Kepler Cluster Study \\citep{meibom11}. These\ninvolved a series of 20 image stamps covering the center of NGC 6819,\ntogether forming a 200 $\\times$ 200 pix square field of view with\n$13\\farcm25$ on a side. Exposures for these stamps were taken in the\nlong-cadence mode of 30 minutes.  Eclipses of the binary components\nwere observed using {\\it Kepler} data for quarters 1-16, excluding\nquarters 6, 10, and 14 when the cluster fell on an unresponsive CCD\nmodule.  We retrieved the public data from the Mikulski Archive for\nSpace Telescopes (MAST), operated by the Space Telescope Science\nInstitute.\\footnote{\\tt\n  http://archive.stsci.edu/kepler/kic10/search.php} Data processing\nwas done using a series of Python tasks based on PyKe\\footnote{\\tt\n  http://keplergo.arc.nasa.gov/PyKE.shtml} software tools to reduce\nand analyze the {\\it Kepler} simple aperture photometry (SAP). We\nderived times of mid-eclipse for all observable eclipses, making use\nof one month of short-cadence data in quarter 12 for its higher time\nresolution. We restricted our later analysis to photometry in and\nimmediately around times of eclipse.\n\nFor {\\it Kepler} photometry it is necessary to ensure that\ninstrumental trends are removed and that contamination from other\nstars are accounted for.  WOCS 24009 is located just outside of the\ncenter of the cluster (about $4\\farcm4$ away) but is very close to neighboring stars. With a\nlarge pixel size of 4$\\arcsec$ across, contamination from other stars\nseemed likely. Contamination values as determined by the {\\it Kepler}\nteam ranged from 9.1\\% to 15.3\\% during different observing\nseasons. Even after correcting for different contamination values,\ncotrending the photometry against the light curves of other stars on\nthe CCD, and fitting and removing effects from star spots, we still\nfound significant variations in observed eclipse depths during a\nsingle quarter of observations and from quarter-to-quarter.\nIn the end, we opted to use the short-cadence data from quarter\n12 for our analysis due to the higher time resolution and in order to avoid\nissues of inconsistent eclipse depth from quarter to quarter. We did not apply\nany crowding corrections to this dataset as this will be fit as a free\nparameter in the binary star models (see \\S \\ref{ELC}). \nThe top panel in Figure \\ref{lc} shows the trimmed, phased light curves of the short-cadence\nKepler data.\n\n\n\\begin{deluxetable}{cccl}[!htp]\n\\tablewidth{0pt}\n\\tablecaption{Eclipse Timings \\label{etimes}}\n\\tablehead{\\colhead{BJD - 2450000} & \\colhead{$\\sigma$} & \n\\colhead{Eclipse} & \\colhead{Notes}}\n\\startdata\n\\multicolumn{4}{c}{WOCS 24009}\\\\\n2104.86904 & 0.00027 & P & $R_{c}$ ground\\\\\n4697.66460 & 0.00033 & S & $R_{Kron}$ ground\\\\\n4965.88626 & 0.00025 & P & Beginning of Kepler Q1\\\\\n4967.71076 & 0.00019 & S & \\\\\n4969.53563 & 0.00022 & P & \\\\\n4971.36016 & 0.00017 & S & \\\\\n4973.18516 & 0.00017 & P & \\\\\n4975.00933 & 0.00025 & S & \\\\\n4976.83423 & 0.00008 & P & \\\\\n4978.65877 & 0.00024 & S & \\\\\n4980.48360 & 0.00020 & P & \\\\\n\\multicolumn{4}{c}{WOCS 40007}\\\\\n2102.88901 & 0.00008 & P & $R_{c}$ ground\\\\\n4623.88162 & 0.00015 & S & V  ground\\\\\n4698.73250 & 0.00011 & P & $R_{Kron}$ ground\\\\\n4964.69147 & 0.00025 & S & Beginning of Kepler Q1\\\\\n4966.28385 & 0.00023 & P &\\\\\n4967.87663 & 0.00019 & S &\\\\\n4969.46896 & 0.00013 & P &\\\\\n4971.06181 & 0.00005 & S &\\\\\n4972.65416 & 0.00012 & P &\\\\\n4974.24685 & 0.00022 & S &\\\\\n4975.83930 & 0.00022 & P &\n\\enddata\n\\tablecomments{This table is published in its entirety in the electronic edition, but a portion is shown here for guidance regarding its form and content.}\n\\end{deluxetable}\n\n\nFor the triple system WOCS 40007, we followed similar procedures, deriving\neclipse times (see Table \\ref{etimes}) to measure orbit parameters for the\nfainter non-eclipsing star, and using short-cadence data from quarter 12 in an update of\nour earlier modeling of ground-based light curves \\citep{jeffries13}.\n\n\\subsection{Spectroscopy}\\label{spectra}\n\nRadial velocities (RVs) were obtained using spectra from the high-precision survey of NGC\n6819 \\citep{hole09,milliman}.  These spectroscopic data were taken as part of the WIYN\nOpen Cluster Survey (WOCS; \\citealt{mathieu00}) using the WIYN\\footnote{The \nWIYN Observatory is a joint facility of the University of Wisconsin-Madison, \nIndiana University, the National Optical Astronomy Observatory and the \nUniversity of Missouri}\n3.5 m telescope on Kitt Peak and Hydra multi-object\nspectrograph instrument (MOS), which is a fiber-fed spectrograph capable of\nobtaining about 80 spectra simultaneously ($\\sim$10 fibers set aside for sky\nmeasurements and $\\sim$70 for stellar spectra). Observations used the echelle\ngrating with a spectral resolution $\\sim$ 15 km s$^{-1}$. Most of the spectra\nwere centered at 513 nm with a 25 nm range covering an array of narrow\nabsorption lines around the Mg b triplet. Spectroscopic observations for\nWOCS 24009 were generally completed using 2 hour integrations per visit that\nwere split into three 2400 s integrations to allow for rejection of cosmic\nrays.\n\nImage processing was done using standard spectroscopic {\\it IRAF}\nprocedures. First, science images were bias and sky subtracted, and\nthen the extracted spectra were flat fielded, throughput corrected,\nand dispersion corrected.  The spectra were calibrated using one 100 s\nflat field and two bracketing 300 s ThAr emission lamp spectra for\neach observation.  Once the RVs were derived (see below), we also\ncorrected for individual fiber offsets present in the Hydra MOS. A\nmore detailed explanation of the acquisition and reduction of WOCS\nobservations can be found in \\cite{geller08}.\n\n\\subsubsection{Spectral Disentangling and Broadening Function Analysis}\\label{bf}\n\nThe spectra of WOCS 24009 are fairly complex to analyze given that there are\nthree cluster member stars contributing absorption-line features.  The\nbrightest component does not belong to the eclipsing binary and there is\nsubstantial blending of the lines when the stars are near their eclipse times.\nThe need to derive precise RVs in such situations led us to use\nbroadening functions (BF), which have been demonstrated to produce reliable\nmeasurements even for contact binaries with a great deal of rotational\nbroadening \\citep{bf92,bf02}. BFs also minimize systematic effects on the\nmeasurements like ``peak pulling'' in situations where traditional techniques\nsuch as cross correlation are unable to cleanly separate the contributions from\ndifferent components \\citep{bf02}.\n\nBriefly, the broadening function can transform a sharp-lined synthetic or star\nspectrum into a broadened spectrum through a convolution. The broadening\nfunction contains information on how the intensity of the star's light is\nredistributed due to Doppler effects resulting from galactic motion, orbital\nmotion, or rotation, among others. As a result, significant peaks in the\nbroadening function give a measure of the overall RVs of the\ncomponents, the function shape is an indicator of the rotation, and the total\narea of the peak is a proxy for luminosity in the spectral region observed.\n\nHowever, even with this improvement, line blending prevented optimal\ndetermination of RVs for some epochs. As a result, we\nalso applied the technique of spectral disentangling\n\\citep{gonzo}. Because the spectra of the individual stars can be\nderived when there are a sufficient number of spectra taken with good\n(and differing) radial-velocity separation between the components, it\nis sometimes possible to derive RVs even with fairly\nsevere line blending.  Starting with initial guesses for the radial\nvelocities, average spectra for the individual stars can be derived\nand used to subtract out the lines of all but one of the component\nstars in turn, and the subtracted spectra can then be used to make\ncleaner measurements of the RVs. The average stellar\nspectra and RVs can then be iteratively improved, and\nconvergence tends to be rapid.  In our case, there are three\ndetectable stars in the spectra, and we extended the \\citet{gonzo}\nalgorithm to iteratively disentangle all three, starting with radial\nvelocity estimates from broadening function analysis of the entangled\nspectra.\n\n\n\\begin{deluxetable}{lrrr}[!htp]\n\\tablewidth{0pt}\n\\tablecaption{Measured Radial Velocities from the WIYN 3.5 m Telescope\\label{rvtab}}\n\\tablehead{\\colhead{mJD\\tablenotemark{a}} & \\colhead{$v_A$ (km s$^{-1}$)} & \\colhead{$v_B$ (km s$^{-1}$)} & \\colhead{$v_C$ (km s$^{-1}$)}\n}\n\\startdata\n\\multicolumn{4}{c}{WOCS 24009}\\\\\n\\hline\n2461.8591 & $4.14 \\pm 0.06$ & $83.60 \\pm 0.36$ & $-81.77 \\pm 0.54$\\\\\n2542.6483 & $5.89 \\pm 0.25$ & & $-23.05 \\pm 4.54$\\\\\n2840.9238 & $8.51 \\pm 0.37$ & $77.28 \\pm 3.21$ & $-91.44\\pm 4.25$\\\\\n2857.7341 & $6.98 \\pm 0.26$ & $-89.59 \\pm 1.34$ & $83.54\\pm 1.78$\\\\\n3190.8469 & $12.22 \\pm 0.81$ & $46.72 \\pm 3.22$ & $-51.54 \\pm 2.54$\\\\\n3576.8340 & $12.65 \\pm 0.19$ & $-71.66 \\pm 1.64$ & $62.93 \\pm 1.75$\\\\\n3810.9662 & $12.06 \\pm 0.53$ & & $-10.26\\pm 4.77$\\\\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\hline\n\\multicolumn{4}{c}{WOCS 40007}\\\\\n\\hline\n2180.6428 & $-39.39\\pm0.03$ & $62.76\\pm0.05$ & \\\\\n2415.8614 & $-84.48\\pm0.02$ & $107.52\\pm0.05$ & \\\\\n2461.7212 & $ 80.20\\pm0.02$ & $-84.10\\pm0.05$ & \\\\\n2475.6910 & $-21.15\\pm0.09$ & $24.80\\pm0.07$ & \\\\\n2476.8479 & $-50.81\\pm0.05$ & $61.94\\pm0.04$ & \\\\\n2856.7194 & $ 73.97\\pm0.91$ & $-94.24\\pm1.32$ & \\\\\n\n3190.6986 & $ 15.85\\pm0.03$ & $-29.40\\pm0.10$ & \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\enddata\n\\tablenotetext{a}{mJD = BJD - 2 450 000}\n\\tablecomments{This table is published in its entirety in the electronic edition, but a portion is shown here for guidance regarding its form and content.}\n\\end{deluxetable}\n\nOf the 41 spectra we had available, 34 covered wavelengths between\n5000 and 5240 \\AA, roughly centered on the Mg b triplet, 6 covered\n5460 to 5730 \\AA, and one covered 6233 to 6227 \\AA.  The spectra in\neach group were continuum normalized before being trimmed to a common\nwavelength range and resampled to a common logarithmic wavelength\nspacing at approximately the same pixel resolution as the original\nspectra. Each of these groups was analyzed separately using a\nhigh-resolution solar spectrum \\citep{hinkle} and IDL routines\nprovided publicly by S. Rucinski\\footnote{\\tt\n  http://www.astro.utoronto.ca/$\\sim$rucinski/SVDcookbook.html} to\nderive the broadening function via singular value decomposition. The\nbroadening function containing all of the singular values was then\ngaussian smoothed to reduce noise --- by experimenting, we found, as\nRucinski has stated, that RVs were sometimes\nsystematically offset when we used a broadening function that was\ncomposed from a limited set of the singular values.  For the reddest\nspectrum, disentangling could not be used, but the broadening function\npeaks for all three components were well separated.  For the bluest\ngroup of spectra, convergence was straightforward, thanks to the large\nnumber of spectra. For the mid-range group of 6 spectra, convergence\nwas more difficult because three had very similar\norbital phase ($\\phi \\approx 0.75$), but after restricting ourselves\ninitially to the three spectra most widely spaced in phase for\nderiving the average spectra, convergence was achieved.\n\nThere were a handful of spectra for which two of the stars had radial\nvelocities that were identical to within about 2 km s$^{-1}$, and for these\ndisentangling failed to uniquely identify the RVs.  However, by\nusing the spectral disentangling technique, we were able to analyze a larger\nnumber of spectra than we were when using broadening functions alone, and\ncould therefore derive a more complete phased radial-velocity curve.  We fit\ngaussian profiles to the broadening function peaks that could be resolved in\neach disentangled spectrum's broadening function. The central values were used\nto measure the stellar RVs, after corrections for fiber velocity\noffsets and heliocentric velocity.\n\nIn the case of the two eclipsing binary components (WOCS 24009 B\nand C), the stars are shown to be extremely similar in their characteristics,\nand so the ratio of the integrated areas of the gaussians gives us a measure\nof their luminosity ratio.  We restricted ourselves to spectra in which three\ncomponent peaks could be separately measured in the broadening function of the\nspectra before disentangling. This limited us to 15 of the spectra centered on\nthe Mg b triplet, and 5 of the spectra centered on about 5595 \\AA. For these\ntwo groups, we found $(L_C / L_B)_{\\lambda} = 0.863 \\pm 0.033$ and $0.880 \\pm 0.014$\n(after rejection of one outlier), respectively, where the error in the mean is\nquoted. Because these two measurements are consistent within the\nuncertainties, we combined them in a weighted mean to get a final value of\n$0.877 \\pm 0.013$ and we treated this as an external constraint on the\n$V$-band luminosities of the two stars in the binary star models.\n\nThe temperature difference between the bright component A and the\neclipsing stars is much larger ($400-500$ K, versus less than 100 K for\nthe two eclipsing stars), and so the broadening functions from limited\nwavelength ranges do not give a direct measure of luminosity\nratios. However, we originally thought that this might be our only\nconstraint on the photometric properties of component A, though this\nended up not being the case \n(see section \\ref{w24009}). Using the same\nspectra with resolved peaks, we estimated $l_3=L_A / (L_A + L_B +\nL_C)$ using the areas of the broadening function peaks for all three\ncomponents. In the bluer region around the Mg b triplet we found\n$0.593\\pm0.014$, and from the region around 5595 {\\AA} we found\n$0.534\\pm0.027$. The two values differ more than they should if they\nwere truly reflecting the light ratios in the two wavelength bands (as\nindicated by integrations of \\citealt{coelho} synthetic spectra).\nWe adopted a middle value for the ratio of the $V$\nluminosities ($0.55\\pm0.02$) as a loose constraint on the effects\nthat component A's light has on reducing the measured depths of the\neclipses, but the ratio was allowed to vary.\n\n\\begin{figure}[htbp]\n\\centerline{\\includegraphics [width=0.55\\textwidth]{fig2}}\n\\caption{{\\it Top panel:} Raw RVs for WOCS 24009 phased to the orbital\n  period. Model curves for the two stars are shown with solid and\n  dotted lines.  {\\it Middle panel:} RVs with corrections for binary\n  center of mass motion and for light travel time effects on the true\n  orbital phase.  {\\it Bottom panel:} Corrected $O-C$ diagram for the\n  eclipsing binary components. For all panels, open circles are\n  observations of the brighter eclipsing star and filled circles are for the fainter star.\n  \\label{rv}}\n\\end{figure}\n\nFor spectra of the WOCS 40007 system, we were able to improve the precision of\nthe measurements presented by \\citet{jeffries13}, and also make use of some\nspectra in which the lines of the eclipsing stars were fairly strongly\nblended. This allowed us to measure RVs near eclipse phases, but\nmore importantly, it gave us new measurements of the center-of-mass velocity\nfor the eclipsing binary that could be used to better determine the orbit of\nthe faint non-eclipsing star (component C) in the system. Lines of component C could not be\nidentified, so we decomposed the spectra into two\ncomponents. Of the 40 available spectra, 34 were centered on the Mg b triplet,\n4 covered 5460 to 5730 \\AA, and two covered 6233 to 6227 \\AA. There was not\nenough phase coverage to apply the disentangling method to the two smaller\ngroups of spectra, but there was only one spectrum (in the red group) for\nwhich the broadening functions overlapped too strongly to separate.\n\n\\noindent\n\\begin{figure}[!h]\n\\centerline{\\includegraphics [width=0.55\\textwidth]{fig3}}\n\\caption{RVs for WOCS 40007 phased to the orbital period. In the\n  middle panel, center-of-mass motion and light travel time\n  corrections are applied to the RVs and phases as in Fig. \\ref{rv}. For all\n  panels, open circles are observations of the brighter eclipsing star and filled circles are\n  for the fainter star.\n  \\label{mj_rv}}\n\\end{figure}\nTable \\ref{rvtab} presents the measured RVs for both systems and\nFigures \\ref{rv} and \\ref{mj_rv} show the phased RVs for WOCS\n24009 and WOCS 40007, respectively, plotted over the binary orbits.\n\n\\subsubsection{Photometric Temperatures}\\label{temps}\n\nWe derived temperature estimates for the stars from the $BV$ photometry of\n\\citet{kalirai01} and the $VI_C$ photometry of \\citet{yang}. These datasets\nwere selected based on their high signal-to-noise observations. Comparisons with our own\nphotometry indicated that the $B-V$ and $V-I_C$ colors in these datasets match\nour own calibration within about 0.005 mag even though the differences in\nindividual wavelength bands were considerably larger. Therefore, we are\nreasonably certain that the color zeropoints are reliable. After correcting\nthe colors for differential reddening using the reddening map of\n\\citet{platais13} and a mean cluster reddening [$E(B-V)=0.16\\pm0.007$;\n\\citealt{att}]\\footnote{We re-examined our earlier estimation of the cluster\n  reddening from clump stars \\citep{jeffries13} in light of the critique of\n  recent measurements by \\citet{att}. We applied differential reddening\n  corrections to our clump stars, and found that this did not change the\n  derived reddening. However, the corrections we made to account for\n  metallicity-dependent effects on the luminosities of the clump giants in NGC 6819 relative to those in M67 are\n  wavelength dependent, and modifying those result in a significant\n  change. If we assume that the difference in [Fe/H] between NGC 6819 and M67 goes from $+0.09$ (with NGC\n  6819 more metal rich) to 0, our derived reddening goes from $E(B-V)=0.12$ to\n  0.15. While this is not proof that the larger value is correct, it does\n  show that the different estimations of reddening may be consistent. If the metallicity\n  difference between M67 and NGC 6819 is established to be closer to 0, the\n  higher reddening value should be preferred.},\nwe applied the color-temperature relations of \\citet{casa} and\naveraged the temperatures derived from the $B-V$ and $V-I_C$\ncolors. The estimates from the two colors for each star generally\nagreed well with each other, although the temperatures derived from $B-V$ were about 100\nK hotter on average. If we assume that [Fe/H] is subsolar, the two estimates\ncome into better agreement.\n\n\\begin{deluxetable*}{lcccccc}[!htb]\n\\tablewidth{0pt}\n\\tablecaption{Measured Parameters for Stars in NGC 6819\\label{summary}}\n\\tablehead{\n\\colhead{Star ID} & \\colhead{$V$\\tablenotemark{a}} & \\colhead{$B-V$\\tablenotemark{a}} & \\colhead{$T_{\\rm eff}$ (K)} & \\colhead{$M / M_\\sun$} & \\colhead{$R / R_\\sun$} & \\colhead{$(m-M)_V$} }\n\\startdata\n\nWOCS 23009 A & 15.130 & 0.632 & 6315 & $1.464 \\pm 0.011$\\tablenotemark{b} & $2.149 \\pm 0.009$ & $12.39\\pm0.07$\\\\\n\nWOCS 40007 A & 16.111 & 0.642 & 6350 & $1.218 \\pm 0.008$ & $1.367 \\pm 0.003$ & $12.40\\pm0.08$ \\\\% updated with 3rd light run - tertiary corrected\nWOCS 40007 B & 16.949 & 0.692 & 5900 & $1.068 \\pm 0.007$ & $1.090 \\pm  0.002$ & $12.40\\pm0.08$ \\\\\nWOCS 24009   & 15.214 & 0.661 & & & \\\\\nWOCS 24009 A & 15.743 & 0.589 & & $1.251\\pm0.057$ & & \\\\\nWOCS 24009 B & 16.835 & 0.721 & 5925 & $1.090\\pm0.010$ & $1.095\\pm0.007$ & $12.37\\pm0.07$\\\\\nWOCS 24009 C & 16.965 & 0.744 & 5855 & $1.075\\pm0.013$ & $1.057\\pm0.008$ & $12.37\\pm0.07$\n\\enddata\n\\tablenotetext{a}{The quoted photometry is from \\citet{kalirai01}, but has not been corrected for zeropoint differences in calibration or for differential reddening.}\n\\tablenotetext{b}{Based on a photometry-based extrapolation from other eclipsing stars in the cluster.}\n\\end{deluxetable*}\n\nThe temperatures are given in Table \\ref{summary}. \nThe stars fall into two groups with similar temperatures. The brightest star in \nWOCS 23009 \\citep[hereafter WOCS 23009 A;][]{sandquist13}\nand the brightest star in the eclipsing binary WOCS 40007 (hereafter WOCS 40007 A)\nare on opposite sides of the turnoff with similar colors but\nquite different luminosities. The stars WOCS 24009 B and C and probably WOCS 40007 B \nare also quite similar to each other due to their nearly identical masses.\\\\\n\n\\section{Analysis}\n\n\\subsection{Cluster Membership}\\label{memb}\n\nThe information extracted from models of WOCS 24009 will only be of\nuse for assessing the properties of NGC 6819 if WOCS 24009 is a member\nof the cluster. There are three ways in which cluster membership can\nbe examined.  First, the most restrictive evidence for cluster\nmembership comes from proper-motion measurements \\citep{platais13}.\nThe proper motions are derived from a combination of old\nphotographic plates with CCD observations obtained from the 3.6 m\nCanada-France-Hawaii Telescope (CFHT).\nFor WOCS 24009 \\citep[star 592928 in][]{platais13},\nthe formal uncertainty of proper motion in either axis is\nslightly less than 0.2 mas~yr$^{-1}$ and the star's offset proper motion from\nthe cluster mean motion is also $\\sim $0.2 mas~yr$^{-1}$. These parameters\nyield an astrometric membership probability of 99\\%. \nWe can also compare the systemic radial velocity to those measured for\nother stars in the field to determine membership. \\citet{milliman} have done an extensive radial\nvelocity survey of stars in the NGC 6819 field, and they use\none-dimensional Gaussian fits to the field $F_{f}(v)$ and cluster\n$F_{c}(v)$ velocity distributions to compute a membership probability:\n", "itemtype": "equation", "pos": 12535, "prevtext": "\n \n\\title{Determining the Age of the {\\it{Kepler}} Open Cluster NGC 6819\nWith a New Triple System and Other Eclipsing Binary Stars\n\\footnotemark[$\\dagger$]}\\footnotetext[$\\dagger$]{This is paper 57 of the WIYN Open Cluster Study (WOCS).}\n\n\n\\author{Lauren N. Brewer\\altaffilmark{1}; Eric L. Sandquist\\altaffilmark{1};\n  Robert D. Mathieu\\altaffilmark{2,9}; Katelyn Milliman\\altaffilmark{2,9}; Aaron\n  M. Geller\\altaffilmark{3,4,9}; Mark W. Jeffries, Jr.\\altaffilmark{1}; Jerome\n  A. Orosz\\altaffilmark{1}; Karsten Brogaard\\altaffilmark{5,6}, Imants\n  Platais\\altaffilmark{7}; Hans Bruntt\\altaffilmark{5}; Frank\n  Grundahl\\altaffilmark{5}; Dennis Stello\\altaffilmark{8}; S$\\o$ren\n  Frandsen\\altaffilmark{5}}\n\n\\altaffiltext{1}{\\footnotesize{San Diego State University, Department of Astronomy, San Diego, CA 92182; ezereve@gmail.com; esandquist@mail.sdsu.edu; jorosz@mail.sdsu.edu; mjeffries11@gmail.com}}\n\\altaffiltext{2}{\\footnotesize{University of Wisconsin-Madison, Department of Astronomy, Madison, WI 53706; mathieu@astro.wisc.edu; milliman@astro.wisc.edu}}\n\\altaffiltext{3}{\\footnotesize{Center for Interdisciplinary Exploration and Research in Astrophysics (CIERA) and Northwestern University, Department of Physics and Astronomy, 2145 Sheridan Road, Evanston, IL 60208; a-geller@northwestern.edu}}\n\\altaffiltext{4}{\\footnotesize{Department of Astronomy and Astrophysics, University of Chicago, 5640 S. Ellis Avenue, Chicago, IL 60637, USA}}\n\\altaffiltext{5}{\\footnotesize{Stellar Astrophysics Centre, Department of Physics and Astronomy, Aarhus University, Ny Munkegade 120, DK-8000 Aarhus C, Denmark; kfb@phys.au.dk, bruntt@gmail.com, fgj@phys.au.dk, srf@phys.au.dk}}\n\\altaffiltext{6}{\\footnotesize{Department of Physics \\& Astronomy, University of Victoria, P.O. Box 3055, Victoria, BC V8W 3P6, Canada; }}\n\\altaffiltext{7}{\\footnotesize{Department of Physics and Astronomy, The Johns Hopkins University, Baltimore, MD 21218; imants@pha.jhu.edu}}\n\\altaffiltext{8}{\\footnotesize{Sydney Institute for Astronomy (SIfA), School of Physics, University of Sydney, NSW, 2006, Australia; stello@physics.usyd.edu.au}}\n\\altaffiltext{9}{\\footnotesize{Visiting Astronomer, Kitt Peak National Observatory, National Optical\nAstronomy Observatories, which is operated by the Association of Universities\nfor Research in Astronomy, Inc. (AURA) under cooperative agreement with\nthe National Science Foundation.}}\n\n\\begin{abstract}\nAs part of our study of the old ($\\sim$2.5 Gyr) open cluster NGC 6819\nin the {\\it Kepler} field, we present photometric ({\\it Kepler} and\nground-based $BVR_CI_C$) and spectroscopic observations of the\ndetached eclipsing binary WOCS 24009 (Auner 665; KIC 5023948) with a\nshort orbital period of 3.6 days. WOCS 24009 is a triple-lined system,\nand we verify that the brightest star is physically orbiting the\neclipsing binary using radial velocities and eclipse timing variations.\nThe eclipsing binary components have masses $M_{B} =1.090 \\pm 0.010\nM_{\\sun}$ and $M_{C} =1.075 \\pm 0.013 M_{\\sun}$, and radii $R_{B}\n=1.095 \\pm 0.007 R_{\\sun}$ and $R_{C} =1.057 \\pm 0.008 R_{\\sun}$.  The\nbright non-eclipsing star resides at the cluster turnoff, and ultimately its mass\nwill directly constrain the turnoff mass: our preliminary\ndetermination is $M_{A} =1.251 \\pm 0.057 M_{\\sun}$.  A careful\nexamination of the light curves indicates that the fainter star in the\neclipsing binary undergoes a very brief period of total eclipse, which\nenables us to precisely decompose the light of the three stars and\nplace them in the color-magnitude diagram.\n\nWe also present improved analysis of two previously discussed detached\neclipsing stars in NGC 6819 (WOCS 40007 and WOCS 23009) en route to a\ncombined determination of the cluster's distance modulus $(m-M)_V=12.38\\pm0.04$. \nBecause this paper significantly increases the number of measured stars in the cluster, we can better constrain\nthe age of the color-magnitude diagram to be $2.21\\pm0.10\\pm0.20$ Gyr.\nAdditionally, using all measured eclipsing binary star masses and radii, we constrain the age to\n$2.38\\pm0.05\\pm0.22$ Gyr.\nThe quoted uncertainties are estimates of\nmeasurement and systematic uncertainties (due to model physics\ndifferences and metal content), respectively.\n\\end{abstract}\n\n\\keywords{open clusters and associations: individual (NGC 6819) - stars:\n  evolution - binaries: eclipsing - binaries: spectroscopic - techniques:\n  spectroscopy - techniques: photometry}\n\n\\section{Introduction}\\label{intro}\n\nMeasurements of the masses and radii of the component stars in\ndetached eclipsing binaries (DEB) can be used to precisely determine\nthe age of the stars if at least one of the eclipsing stars has begun\nto evolve away from the main sequence. The use of mass and\nradius ($M-R$) measurements of eclipsing stars avoids or minimizes\nsystematic uncertainties introduced by factors such as distance,\ninterstellar reddening, and color-temperature conversions that can\naffect age measurements \\citep{andersen91,torres10}. When eclipsing\nbinaries occur in star clusters, their utility increases dramatically\nbecause they place constraints on the age of {\\it all} the stars\nin the cluster. \nMultiple DEBs in a cluster can provide $M-R$ measurements for stars having a\nrange in mass, and can constrain the age even more tightly. With a\nwell-determined age for a cluster, the color-magnitude diagram (CMD)\ncan be used to test the effects of evolution on an even larger number\nof stars.  Comparisons of the masses and radii of eclipsing stars and the\nCMD with theoretical stellar models can also lead to deeper inferences\nabout chemical composition variables such as helium abundance\n\\citep{brogaard11,brogaard12}.\n\nThis study focuses on the rich open cluster NGC 6819, which has been\nobserved thoroughly from the ground and with the {\\it Kepler} spacecraft.\nNGC 6819 is a well-studied cluster: its CMD\n\\citep{burkhead71,lindoff72,auner74,rosvick98,kalirai01,yang} as well as stellar\nvariability \\citep{kaluzny88,street02,street03,street05,talam10} have been\nexamined in multiple studies. In addition, the cluster has been part of the\nWIYN Open Cluster Survey (WOCS; \\citealt{mathieu00}) with\ncomprehensive long-term radial-velocity studies presented by \\cite{hole09} and \\cite{milliman}.  \n\nThanks to the nearly continuous monitoring and high precision\nphotometry by {\\it Kepler}, studies of stellar ages using multiple\ntechniques have been kickstarted.  Because several techniques can be\napplied within the same cluster, a comparison of results should\nultimately improve our understanding of each.  \\cite{basu11} used\nasteroseismic data from {\\it Kepler} to constrain basic properties of\nred giant stars and to place constraints on the cluster distance\n[$(m-M)_{0} = 11.85 \\pm 0.05$] and age (between 2.1 and 2.5 Gyr).\nStellar rotation measurements have been used to examine the\ngyrochronological ages of two of the four open clusters in the {\\it\n  Kepler} field: NGC 6811 \\citep{meibom11} and NGC 6819\n\\citep{meibom15}.  \\cite{kalirai01} describes how the age of NGC 6819\ncan be found using the faint end of the white dwarf cooling sequence,\nand \\citet{bedin} present an age of $2.25\\pm0.20$ Gyr using that\ntechnique. For our part, we have so far analyzed two eclipsing systems\nin NGC 6819 (WOCS 23009 / KIC 5024447, \\citealt{sandquist13}; WOCS\n40007 / KIC 5113053, \\citealt{jeffries13}).  \n\nIn this paper we present the triple-lined system WOCS 24009 (also\nknown as KIC 5023948 / Auner 665;\n$\\alpha_{2000}=19^{\\mathbf{h}}40^{\\mathbf{m}} 57\\farcs82$,\n$\\delta_{2000}=+40^{\\circ}09\\arcmin27\\farcs4$) to add to the grid of cluster stars with\nprecisely-determined masses and to further constrain the age of NGC\n6819. We identify the three stars as follows: component A is the\nbrightest contributor to spectra and is on a wide orbit around the\nshort-period detached eclipsing binary made up of components B and C,\nwhere B is slightly brighter and more massive than C and is the star\nbeing eclipsed during primary eclipse, as we will discuss in the\nanalysis sections.  This system is promising because all three stars\nare bright enough to be studied spectroscopically, the three can be\nshown to be physically associated, and it contains one of the most\nevolved stars in the cluster whose mass can be directly determined\nfrom radial-velocity measurements.\n\nIn \\S 2, we describe the observations we employed, and describe the\nimproved spectroscopic analysis techniques that allowed us to minimize\nthe mass and radius measurement uncertainties in the the face of three\nsets of blended lines.  We also used these techniques to improve our\npreviously presented measurements of WOCS 23009 and WOCS 40007. In \\S\n3, we discuss the membership of the system, and describe the modeling\nof the eclipsing binary and the orbit of the bright non-eclipsing\nstar. In \\S 4, we discuss the photometry of the stars, and use all\nthree eclipsing systems in a combined analysis to derive the cluster distance modulus and age.\n\n\\setcounter{footnote}{9}\n\n\\section{Observations and Data Reduction}\n\nOur datasets include ground-based and space-based {\\it Kepler} photometric\nobservations along with long-term radial-velocity observations. In addition to\nthe work on the WOCS 24009 system, we also discuss improvements to the dataset\nfor WOCS 40007 \\citep{jeffries13} below.\n\n\\begin{center}\n\\begin{deluxetable}{lcccc}[!h]\n\\tablewidth{0pt}\n\\tablecaption{Observed Nights at the Mount Laguna Observatory 1-meter telescope \\label{dates}}\n\\tablehead{\n\\colhead{Date} & \\colhead{Filter} & \\colhead{mJD Start\\tablenotemark{a}} & \n\\colhead{$t_{exp}$ (s)} & \\colhead{$N$}}\n\\startdata\n\n2008 June 15 & $B$ & 4633.699 & 180 & 22 \\\\\n 2009 June 12 & $V$ & 4994.701 & 120 & 147\\\\\n 2009 Oct. 22 & $V$ & 5126.589 & 120 & 59\\\\\n2010 June 22 & $B$ & 5370.708 & 600 & 34\\\\\n2010 Sep. 14 & $B, R_c$ & 5454.781 & 600 & 7, 7\\\\\n2011 May 22 & $B, V$ & 5704.802 & 600, 600 & 6, 9\\\\\n2011 June 02 & $B, V$ & 5715.738 & 600, 600 & 9, 12\\\\\n2011 June 11 & $V$ & 5724.725 & 600 & 35\\\\\n2011 July 03\\tablenotemark{d} & $I_c$ & 5746.677 & 300 & 41\\\\\n2011 July 14 & $R_c$ & 5757.660 & 420 & 62\\\\\n2011 July 23\\tablenotemark{m} & $I_c$ & 5766.657 & 300 & 83\\\\\n2011 July 25\\tablenotemark{d,m} & $B, I_c$ & 5768.662 & 300, 300 & 33, 41\\\\\n2011 Aug. 14 & $R_c$ & 5788.639 & 420 & 65\\\\\n2011 Aug. 25 & $B, V$ & 5799.627 & 600, 600 & 13, 21\\\\\n2011 Sep. 16 & $B, V$ & 5821.631 & 600, 600 & 17, 15\\\\\n2011 Oct. 17 & $B, V$ & 5852.582 & 300, 300 & 28, 20\\\\\n2011 Oct. 28 & $I_c$ & 5863.587 & 300 & 44\\\\\n2011 Nov. 28 & $V$ & 5894.557 & 300 & 34\\\\\n2012 Apr. 18 & $V, I_c$ & 6036.838 & 300 & 18, 20\\\\\n2014 June 8 & $B, V$ & 6817.709 & 300, 300 & 45, 16 \\\\\n2014 July 20 & $B$ & 6859.669 & 600 & 42 \n\\enddata\n\\tablenotetext{a}{mJD = BJD - 2 450 000}\n\\tablenotetext{d}{Data reduction used dome flat field images.}\n\\tablenotetext{m}{Data reduction used morning twilight flat field images.}\n\\end{deluxetable} \n\\end{center}\n\n\\subsection{Ground-based Photometry}\\label{phot}\n\nWe obtained images in $B, V, R_{c}$, and $I_{c}$ filters using the\nMount Laguna Observatory (MLO) 1 m telescope.  WOCS 24009 eclipse light curves\nwere computed from two nights in 2010 in addition to dedicated nights\nin 2011, 2012, and 2014.  The observations on nights of eclipses are\ngiven in Table \\ref{dates}. The dataset also includes earlier images\npresented by \\cite{talam10}. Exposure times were typically 300 or 600\nseconds for $B$ and $V$, 420 seconds for $R_{c}$, and 300 seconds for\n$I_{c}$. The CCD 2005 camera covers $13\\farcm7\\times13\\farcm7$ on sky\nwith a scale of $0\\farcs41$ per pixel.\n\nAll ground-based observations were overscan corrected, bias subtracted\nusing a master bias computed from twenty individual images, and\ncalibrated using nightly master flat-field frames to correct\npixel-to-pixel sensitivity variations.  Evening twilight flats were\ngenerally used, but nights for which we utilized dome flats or morning\nflats are noted in Table \\ref{dates}. The image processing tasks were\ncompleted using basic procedures in IRAF\\footnote{IRAF is\n  distributed by the National Optical Astronomy Observatory, which is\n  operated by the association of Universities for Research in\n  Astronomy, Inc., under cooperative agreement with the National\n  Science Foundation.}.  We note that since the \\citet{jeffries13}\npaper it was discovered (D. Leonard, private communication) that a\nnonlinearity in the CCD response was present as a result of improperly\nset voltages on readout transistors that were used between December\n2008 and November 2013. The following correction\n\n", "index": 1, "text": "\\begin{align}\n& ADU_{cor} = ADU * (1.01353 - 0.115576 \\cdot (ADU / 32767) \\nonumber \\\\\n& + 0.0296378 \\cdot (ADU / 32767)^2) \\nonumber\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle ADU_{cor}=ADU*(1.01353-0.115576\\cdot(ADU/32767)\" display=\"inline\"><mrow><mi>A</mi><mi>D</mi><msub><mi>U</mi><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>r</mi></mrow></msub><mo>=</mo><mi>A</mi><mi>D</mi><mi>U</mi><mo>*</mo><mrow><mo stretchy=\"false\">(</mo><mn>1.01353</mn><mo>-</mo><mn>0.115576</mn><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mi>A</mi><mi>D</mi><mi>U</mi><mo>/</mo><mn>32767</mn><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle+0.0296378\\cdot(ADU/32767)^{2})\" display=\"inline\"><mrow><mo>+</mo><mn>0.0296378</mn><mo>⋅</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>A</mi><mi>D</mi><mi>U</mi><mo>/</mo><mn>32767</mn><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></math>", "type": "latex"}, {"file": "1601.04069.tex", "nexttext": "\nIdeally, we would calculate this from the system velocity ($\\gamma$)\nderived from a three-body solution to the stellar orbits (see \\S\n\\ref{tertorbit}). However, the system has not been observed over a\nlarge enough fraction of the outer orbit period to properly determine\n$\\gamma$.  The velocity at which component A and the binary\ncenter-of-mass velocities cross is approximately 2 km s$^{-1}$ though,\nconsistent with the cluster mean RV of 2.45 km s$^{-1}$\n\\citep{milliman}. This also supports membership.  The last method we\nconsidered uses the position of the system in relation to the core\nradius of the cluster, where $r_{c}$ is a King model value \\citep[1.8\n  $r_{c}$;][]{kalirai01}. A membership probability is estimated as\n45\\% using a ratio of the spatial density of probable cluster members\nto the total spatial density, but this method only weakly constrains\nthe membership because it does not take into account differences in\nthe cluster and field distributions in the CMD.  Other evidence that\nsupports cluster membership are the physical similarities between WOCS\n24009 eclipsing binary stars and the well-measured stars in WOCS 40007\n\\citep{jeffries13}, for which the membership information is more\ncomplete.  Based on the evidence available to date, we find no reason\nto doubt that WOCS 24009 is a cluster member.\n\n\\subsection{Radial-Velocity and Light-Curve Modeling}\n\nThree stellar components were identifiable in spectra taken of WOCS 24009 even\nbefore the {\\it Kepler} mission began. However, due to the similar\ncharacteristics of the fainter two stars and significant blending with the\nbrightest component in many spectra, an orbital solution had not been\ndetermined. The {\\it Kepler} photometry not only made it possible to\ndifferentiate between the two eclipses of very similar depth, but the eclipse\ntimings also showed clear evidence of a light travel time (LTT) effect resulting\nfrom the gravitational influence of a third star on a wide orbit. It also\nbecame clear that scatter in the RVs of the eclipsing stars was\nbeing introduced by reflex motion of the binary in response to the motion of\ncomponent A. The eclipse timings are given in Table \\ref{etimes} with\nthe earliest eclipse observed from the ground in July 2001 \\citep{talam10}.\n\nWe therefore sought a consistent solution assuming that the system is\nhierarchical: the eclipsing stars in the binary follow Keplerian\norbits, and component A and the barycenter of the binary also\nfollow much larger Keplerian orbits. The modeling of the stars was\ntherefore separated into two parts: characterization of the radial\nvelocity curve of the eclipsing binary and the wide orbit of the\ncomponent A using the RVs and eclipse timings, and\ncharacterization of the light curves to derive final masses and radii\nfor the eclipsing stars.\n\n\\begin{figure*}[!ht]\n\\centering\n\\vspace{-40pt}\n\\includegraphics [width=0.8\\textwidth]{fig4}\n\\vspace{-100pt}\n\\caption{Orbit modeling solutions for the third star in WOCS 24009, plotted to fit the RVs and eclipse timings\nas described in \\S \\ref{tertorbit}.\n{\\it Top panel:} $O-C$ for variations in binary eclipse timings. {\\it\n    Bottom panel:} Observed RVs of the bright third star WOCS 24009 A\n  ({\\it solid}) and binary star components ({\\it open}) after subtracting\n  binary star model predictions. Binary star model curves are shown for the third star ({\\it blue}) and binary\n  barycenter ({\\it red}).\n  \\label{tertfig}}\n\\end{figure*}\n\nModels for the photometric and radial-velocity measurements were\ncomputed using the ELC code \\citep{orosz00}. ELC uses a $\\chi^{2}$\nstatistic to determine the goodness-of-fit where the overall\n$\\chi^{2}$ is the sum of the $\\chi^{2}$ for each photometry filter,\nRVs for each binary component, and any observational\nconstraints. Genetic and Markov chain optimizers were used to\ndetermine best-fit models in the multi-dimensional parameter space. We\ngenerally began with the genetic algorithm in order to search large\nvolumes of parameter space to arrive at the best fit minimum for each\nbinary parameter. After the initial identification of a best fit, the\nuncertainties on individual photometric and radial-velocity\nobservations were scaled in order to produce a reduced $\\chi^{2}$ of\n1. This is essentially equivalent to replacing the a priori\nuncertainty estimates with a posteriori estimates that can account for\nrandom systematic effects. Subsequently, we used Markov chain Monte\nCarlo modeling \\citep{tegmark04} to determine the solution and search\nalternative models near the parameter minima to estimate parameter\nuncertainties. $1\\sigma$ uncertainties were found by identifying the\nparameter ranges covered by solutions that had a $\\chi^{2}$ (not\nreduced $\\chi^2$) value within 1 of the minimum \\citep{avni76}.\n\n\\begin{deluxetable*}{lcccc}[!ht]\n\\tablewidth{0pt}\n\\tablecaption{Orbit Solution for the Binary Stars in WOCS 24009 and WOCS 40007\\label{tert}}\n\\tablehead{\\colhead{Parameter} & \\multicolumn{2}{c}{WOCS 24009} & \\multicolumn{2}{c}{WOCS 40007}\\\\\n& This Study & Milliman et al. & This Study & Milliman et al.}\n\\startdata\n$P_{bin}$ (d) & $3.6493010\\pm0.00000018$ & 3.64921$\\pm$0.00004 & 3.18509586$\\pm$0.00000008 & $3.185087\\pm0.000012$\\\\\n$P_3$ (d) & $8333\\pm30$ & & $3248\\pm3$ & \\\\\n$t_{bin}$ (HJD - 2450000) & $2104.85489\\pm0.00017$ & 4836.1$\\pm$1.4 & $2102.88690\\pm0.00004$ & $4329.3\\pm2.4$ \\\\\n$t_3$ (HJD - 2450000) & $3182\\pm13$ & & $5601.3\\pm2.5$ & \\\\\n$e_3$ & $0.368\\pm0.003$ & & $0.307\\pm0.002$ & \\\\\n$i_3$ ($^{\\circ}$) & 68.7 & & & \\\\\n$\\omega_3$ ($^{\\circ}$) & $145.0\\pm0.6$ & & $72.4\\pm0.3$ & \\\\\n$K_{bin}$ (km s$^{-1}$) & $4.74\\pm0.02$ & & $4.764\\pm0.009$ & \\\\\n$K_A$ (km s$^{-1}$) & $8.21\\pm0.35$ & & $88.9\\pm0.4$ & $87.9\\pm1.0$ \\\\\n$K_B$ (km s$^{-1}$) & $88.86\\pm0.51$ & $88.0\\pm1.3$ & $101.6\\pm0.3$ & $103.3\\pm1.1$ \\\\\n$K_C$ (km s$^{-1}$) & $90.05\\pm0.35$ & $90.0\\pm1.3$ & & \\\\\n$q_{bin}=M_2/M_1$ & $0.987\\pm0.007$ & $1.023\\pm0.023$ & $0.875\\pm0.005$ & $0.851\\pm0.014$\\\\\n$q_A=M_A/(M_B+M_C)$ & $0.578\\pm0.026$ & & & \\\\\n$\\gamma$ (km s$^{-1}$) & $3.17\\pm0.12$ & $0.4\\pm0.7$ & $2.83\\pm0.18$ & $3.7\\pm0.5$\n\\enddata\n\\end{deluxetable*}\n\n\\subsubsection{Orbit Modeling of Third Star}\\label{tertorbit}\n\nWhen modeling the RVs and eclipse timings for WOCS 24009, we\nconducted simultaneous fits for the following parameters: period $P_{bin}$ \nand time of primary  eclipse $t_{bin}$ for the eclipsing binary \n(in its comoving reference frame);  period $P_A$, time of periastron \n$t_A$, eccentricity $e_A$, and argument of periastron $\\omega_A$ for \nthe third star's orbit; the radial-velocity amplitudes for the third star $K_A$ \nand the stars in the eclipsing binary ($K_B$ and $K_C$), and the radial \nvelocity of the barycenter of the system $\\gamma$. However, it became \nclear that some aspects of the third star's orbit are not well constrained with \nthe current data. The basic problem is that, even though we have data \ncovering approximately 4000 d, by chance we have observed component A\norbit essentially between times of zero radial velocity with one velocity \nmaximum (closest to periastron) in between. Because of the distribution of the\nobservations, there are correlations between the system velocity, the\nvelocity semi-amplitudes of the third star $K_A$ and binary $K_{bin}$, and\nthe eccentricity.\n\nBecause the indications are that the system is a\nmember of NGC 6819, we fixed the system velocity to the cluster\naverage \\citep{milliman}. This choice may introduce systematic errors\ninto the values of $K_A$ and $K_B$, but there are good reasons for trying\nto model the third star's orbit as best we can right now.\nFirst, we can correct the binary star velocities to first order for the motion \ninduced by component A, producing more precise measurements of the velocity\namplitudes $K_B$ and $K_C$, and thus the masses of the stars. The radial\nvelocities of the eclipsing stars are directly affected by the\ncenter-of-mass motion, but light travel time also affects the inferred phase\nof each observation. This effect is relatively important in this system (at\nthe 0.01 level in phase) because of the large size of the third star's orbit and\nthe relatively short period of the eclipsing binary. The top two panels\nof Figure \\ref{rv} illustrate the radial-velocity variations with and without\nthe corrections to the RVs and phases of each observation.  Second, the ratio \nof the velocity amplitudes allow us to\ndetermine the mass ratio $M_A / (M_B + M_C)$, and in principle, the mass of\nthe third star. The size of the third star cannot be determined because\nthere is no evidence that component A eclipses either binary component in {\\it\n  Kepler} photometry. However, our photometric decomposition indicates\nthat the third star is the one closest to the cluster turnoff with a \n{\\it measurable} mass, in spite of the lack of eclipses.\n\nFigure \\ref{tertfig} shows the results of our best preliminary fit to the eclipse\ntimings and RVs. The top panel shows the variations in the\nbinary star eclipse timings compared to a linear ephemeris (observed minus\ncomputed: $O-C$) over time. The error bars are scaled to give a\nreduced $\\chi^{2}$ of about 1 for the RVs and LTT separately. This was\nneeded to ensure that neither dataset was weighted too heavily in finding a\njoint solution. The bottom panel shows observed radial\nvelocities of the binary center of mass and the third star. \n\nTo obtain this fit, we had to apply some constraints based on an analysis of\nthe observations. Extrema in the top plot of the eclipse timings correspond to\ntimes when the binary center-of-mass velocity crosses the barycenter velocity\n$\\gamma$, and these are well constrained by the radial-velocity\nobservations. The first several radial-velocity observations (BJD before\n2453000) indicate that the crossing occurred around BJD 2452100-2452300, very\nclose to the first ground-based eclipse observation (BJD 2452105). Similarly,\nthe observations by {\\it Kepler} have covered the LTT minimum (near BJD\n2455900), as corroborated by the RVs. As a result, the full LTT\namplitude is constrained to be close to 56 minutes.  The eccentricity of the\nouter orbit is clearly visible in the asymmetry of the RVs\nbetween the zero crossings. Note that the radial-velocity curve for the\neclipsing binary is related to the derivative of the eclipse timing curve,\nwith the radial-velocity extrema occurring at inflection points in the LTT\ncurve.  Unfortunately, the period of the third star's orbit will not be\nconstrained more tightly until more eclipse times are measured as the\neclipsing binary moves more rapidly away from us. We are also unable to\ndirectly measure the radial-velocity amplitudes because both velocity extrema\nhave not been observed and because the precise system velocity for the triple\nis not well constrained yet.\n\nThe best current fit for the eclipsing binary orbit is given in Table \\ref{tert}.  For\ncomparison, we include the radial-velocity fits from \\citet{milliman}.  We\nexpect our results to be more precise and accurate on account of the improvements in\ntechnique for deriving the RVs from the complex spectra and,\nmore importantly, due to our control for the effects of the third star. In the\nimportant case of the velocity semi-amplitudes for the eclipsing stars $K_{B,C}$, a\ncomparison shows that there are systematic differences in values by\napproximately $1\\sigma$ compared to the Milliman et al. fits, and a significant\ndecrease in uncertainty by a factor of $2-3$. The lower $K$ uncertainties\ntranslate to a corresponding reduction in the uncertainties in the derived masses.\nWith the fit for the third star's orbit in hand, we can compensate for its effects on the\nbinary radial-velocity measurements. These values are used as constraints in\nour models of the eclipsing binary light curve (see \\S \\ref{ELC}). Using the\nmass ratio from this analysis ($q_{bin}=0.987\\pm0.007$), we can determine\ncenter-of-mass velocities for the eclipsing binary at each epoch, and use them\nto measure the mass ratio $q_A = M_A / (M_B+M_C)$. Using the\nweighted average of the eight best measurements near the velocity extremum\n(BJDs 2452461 to 2454747), we derive a value $q_A = 0.578 \\pm 0.026$.\n \n \\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=.9\\textwidth]{fig5}\n\\vspace{-20pt}\n\\caption{Orbit solution for the third star of WOCS 40007, similar to Fig. \\ref{tertfig}.\n{\\it Top panel:} $O-C$ for variations in binary eclipse timings. {\\it\n    Bottom panel:} Observed RVs of the eclipsing binary \n    center of mass compared with model predictions.\n  \\label{mjtertfig}}\n\\end{figure*}\n \nWe calculate the mass of the third star (WOCS 24009 A) to be $M_{A} =1.251 \\pm\n0.057 M_{\\sun}$.  The inclination of its orbit can be estimated using\nKepler's third law and the masses and period, either by comparing the expected\nradial-velocity amplitudes to the measured ones or by comparing the expected\nsize of the orbit to the amplitude of the light travel time effect on the\neclipses (which is related to the projection of the orbit along the line of\nsight). At present, the light travel time amplitude is much better constrained\nthan the radial velocity semi-amplitudes for the binary $K_{bin}$ and third star\n$K_{A}$. So using the LTT results, we estimate the inclination to be\n$i_A=68$\\degr. Because the inclination is quite far from edge-on, the third star\nwill not eclipse and its radius cannot be measured directly. The most\nimportant information it will provide will come from its mass and good\nphotometry. Three-body (non-Keplerian) dynamics could affect how precisely we\nare able to determine the characteristics of the third star's orbit,\nespecially when all of our observations span approximately one orbital\nperiod. However, some exploratory calculations (D. Short, private\ncommunication) indicate that the effects are likely to be quite small as a\nresult of the large difference in orbital periods.  The difficulties involved\nin measuring the motions of the binary center of mass and the third star means that\nthe third star's mass will not be a strong constraint on cluster properties at\npresent. Future monitoring should bring down the mass uncertainty\nsignificantly.\n\nFinally, because additional {\\it Kepler} observations were available and\nbecause we improved our analysis of the radial-velocity measurements for the\nWOCS 40007 binary \\citep{jeffries13}, we have updated our models of that\ntriple system. Its third star is considerably fainter than the eclipsing\nbinary, so that we are unable to measure its RVs from spectra and\nwill not be able to derive its mass. However, improved models of the third star's\norbit will allow us to reduce the mass uncertainties for the eclipsing\nstars. The combination of RVs and eclipse timings has given us\nobservations covering more than one complete orbit of the third star, although\nwith differing degrees of precision. The improved RVs more\nclearly draw out the shape of the velocity curve, and have significantly\nincreased the measured eccentricity. The additional {\\it Kepler} eclipse\ntimings have allowed us to precisely identify both inflection points in the\nLTT O-C diagram, which in turn determines the duration of the radial-velocity\nswing from maximum to minimum. The velocity semi-amplitudes for the eclipsing\nbinary have not changed greatly since our original determination, but the\nuncertainties have improved by about a factor of two. An updated plot of\nthe third star's orbital effects is shown in Figure \\ref{mjtertfig}.\n\n\\subsubsection{Binary Star Modeling}\\label{ELC}\n\n\\begin{deluxetable*}{lccc}[!h]\n\\tabletypesize{\\footnotesize}\n\\tablewidth{0pt}\n\\tablecaption{Orbital Solutions: Limb-Darkening Law\\label{orb}}\n\\tablehead{\\colhead{Parameter} & \\colhead{Kepler + Ground} & \n\\colhead{Kepler Only} & \\colhead{Model Atmospheres}}\n\\startdata\n\\vspace{0.05in}\nConstrained: & & &\\\\\n$t_o$ (HJD - 2450000)&\\multicolumn{3}{c}{2104.8424 $\\pm$ 0.0002}\\\\\n$P$ (d)&\\multicolumn{3}{c}{3.64930279 $\\pm$ 0.00000016}\\\\\n$q = M_C/M_B$&\\multicolumn{3}{c}{0.987 $\\pm$ 0.007}\\\\\n$K_B$ (km s$^{-1}$) & \\multicolumn{3}{c}{$88.86 \\pm 0.54$}\\\\\n$L_{C}/L_{B}$ & \\multicolumn{3}{c}{$0.877 \\pm 0.013$}\\\\\n\n$T_A$ (K) & \\multicolumn{3}{c}{$6330 \\pm 53$} \\\\\n$T_B$ (K) & \\multicolumn{3}{c}{} \\\\ \n\\hline\nFitted: & & & \\\\\n$i$ ($^{\\circ}$) & 89.27 $\\pm$ 0.02 & 89.28 $\\pm$ 0.02 & 89.42 $\\pm$ 0.02\\\\\n$R_B/a$ & 0.0853 $\\pm$ 0.0002 & 0.0853 $\\pm$ 0.0001 & 0.0856 $\\pm$ 0.0002\\\\\n$R_B/R_C$ & 1.029 $\\pm$ 0.003 & 1.025 $\\pm$ 0.003 & 1.020 $\\pm$ 0.003\\\\\n$T_C/T_B$ & 0.988 $\\pm$ 0.0002 & 0.988 $\\pm$ 0.0002 & 0.989 $\\pm$ 0.0002\\\\\n$R_A^{2}/R_B^{B}$ & 2.126 $\\pm$ 0.024 & & 2.071 $\\pm$ 0.023\\\\\nContam & 0.047 $\\pm$ 0.003 & 0.070 $\\pm$ 0.003 & 0.053 $\\pm$ 0.003\\\\\n\\hline\nDerived: & & & \\\\\n$M_B$ ($M_{\\sun}$) & 1.089 $\\pm$ 0.018 & 1.090 $\\pm$ 0.023 & 1.090 $\\pm$ 0.019\\\\\n$M_C$ ($M_{\\sun}$) & 1.076 $\\pm$ 0.016 & 1.076 $\\pm$ 0.021 & 1.076 $\\pm$ 0.018\\\\\n$R_B$ ($R_{\\sun}$) & 1.099 $\\pm$ 0.006 & 1.100 $\\pm$ 0.007 & 1.104 $\\pm$ 0.007\\\\\n$R_C$ ($R_{\\sun}$) & 1.069 $\\pm$ 0.006 $\\pm$ 0.013\\tablenotemark{a} & 1.073 $\\pm$ 0.007 & 1.083 $\\pm$ 0.007\\\\\n$R_C/a$ & 0.0829 $\\pm$ 0.0002 & 0.0832 $\\pm$ 0.0002 & 0.0839 $\\pm$ 0.0001\\\\\n$(R_B+R_C)/a$ & 0.1682 $\\pm$ 0.0002 & 0.1684 $\\pm$ 0.0002 & 0.1695 $\\pm$ 0.0001\\\\\n$a$ ($R_{\\sun}$) & 12.90 $\\pm$ 0.07 & 12.90 $\\pm$ 0.08 & 12.90 $\\pm$ 0.08\\\\\nlog $g_B$ (cgs) & 4.392 $\\pm$ 0.003 & 4.392 $\\pm$ 0.003 & 4.389 $\\pm$ 0.003\\\\\nlog $g_C$ (cgs) & 4.411 $\\pm$ 0.003 & 4.408 $\\pm$ 0.003 & 4.400 $\\pm$ 0.003\n\\enddata\n\\tablenotetext{a}{The two uncertainties are estimates of the random and systematic effects.}\n\\end{deluxetable*}\n\nBefore we started to fit the light curves with binary star models, we\ntrimmed the photometric data to observations taken in and near\neclipses. {\\it Kepler} photometry shows that there is negligible\nvariation outside of eclipse, indicating that ellipsoidal variations\n(due to non-spherical stars) and reflection effects can be\nignored. Variations in the out-of-eclipse photometry (due to\nsystematics in the {\\it Kepler} photometry or atmospheric effects in\nthe ground-based photometry) added unconstructively to the $\\chi^2$ of\nour fits, and substantially lengthened the time needed to compute model fits, so we\nexpunged these points. We also applied zeropoint offset corrections to nights of\nground-based data, where the offset was determined from the median\nmagnitude of any out-of-eclipse data from that night.  These\ncorrections were made to bring the ground-based light curves into\ngreater consistency, and are likely to be the result of stellar\nactivity. Most of the nights only had out-of-eclipse photometry\navailable either from the evening or morning, so the median magnitude\nwas taken for that and applied to the whole night. For nights with\nout-of-eclipse data on both sides of the eclipse, the median magnitude\nwas determined using the side with the largest number of datapoints\nand least uncertainty in the magnitudes.\n\nThe effects of limb-darkening were examined by fitting the data with\ntwo different types of models: one using a quadratic limb-darkening\nlaw, and the other using PHOENIX model atmospheres\n\\citep{hauschildt97}. When using a quadratic limb-darkening law, we\ncomputed models using {\\it Kepler} data both with and without our\nground-based observations. In both types of models we fixed one\ncoefficient in the {\\it Kepler} filter band for each star using ATLAS\natmosphere values from \\cite{claret00} and fitted for the other, which\nallowed ELC greater freedom to search for the coefficient values for\neach filter that produce the best fits to the light curves.  By fixing\none coefficient and fitting for the other, systematic error in the\nassumed coefficient (due to incorrect $T_{\\rm eff}$, log $g$, or\nmetallicity) can be partly compensated for because coefficients tend\nto be correlated.  With the more precise {\\it Kepler} data, the\ncoefficient is better constrained than in the ground-based\ndata. Finally, because PHOENIX model atmospheres describe the limb\ndarkening of the stars and variation of emitted intensity with\nemergent angle, there is no need to assume limb-darkening\ncoefficients. On the flip side, systematic errors in the atmosphere\nmodels can introduce systematic errors in best-fit parameters. We have\ncomputed models using both limb darkening descriptions as a way of\nassessing the systematic uncertainties and their effects on the\nmeasured stellar characteristics.\n\nResults for the two types of models can be found in Table\n\\ref{orb}. We fit for 10 free parameters in the light curve models:\ninclination $i$, ratio of the brightest eclipsing star radius to the semi-major\naxis $R_B/a$, ratio of radii of the eclipsing stars $R_B/R_C$,\ntemperature of the brighter eclipsing star $T_B$, ratio of the\ntemperatures of the eclipsing stars $T_C/T_B$, temperature of the\nthird star $T_A$, ratio of the surface area of the bright component A to\nthe surface area of the brightest eclipsing star $R_A^{2}/R_B^{2}$, binary mass\nratio $q = M_C/M_B = K_B/K_C$, velocity semi-amplitude of the brightest eclipsing star $K_B$, and external\ncontamination of the {\\it Kepler} light curve. {\\it Kepler} photometry\nprovides a very tight constraint on the shape of the light curves, but\nnot their absolute depths due to the contamination by unassociated\nstars projected near WOCS 24009 on the sky. Our ground-based data,\nwhich is much less affected by contamination from unassociated stars,\nprovides better constraints on the absolute depths of the eclipses.\n\nWe have applied the following spectroscopic constraints to the light\ncurve models during the fits: temperature of the third star $T_A$, the\nluminosity ratio for the eclipsing stars $L_C/L_B$, velocity\nsemi-amplitude $K_B$, and binary mass ratio $q = K_B/K_C$. $q$, $K_B$,\nand $T_A$ are included as free parameters to allow their values to\nvary within the uncertainties of the triple star fit and spectroscopic\ntemperature measurement in order to incorporate this uncertainty in\nthe overall uncertainty for the computed binary parameters.\n\n\\section{Results and Discussion}\\label{results}\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [angle=270,width=0.9\\textwidth]{fig6}\n\\vspace{-20pt}\n\\caption{CMDs for NGC 6819 in $B-V$ \\citep{kalirai01}, $V-R_c$ \\citep{hole09},\n  and $V-I_c$ \\citep{yang}. The sample has been restricted to likely members,\n  but has not been adjusted otherwise. The components of the eclipsing\n  binaries WOCS 23009 (three-point star), WOCS 24009 ($\\times$), and WOCS\n  40007 ($+$) are shown.\n  \\label{cmda259}}\n\\end{figure*}\n\nBefore we begin a discussion of the cluster age, it is necessary to\ndiscuss recent constraints on the cluster's metallicity. Until\nrecently, the only direct measurement of the composition was\n\\citet{bragaglia01}: [Fe/H]$=+0.09$ from three red clump\nstars. However, additional measurements have become\navailable. \\citet{att} used Str\\\"{o}mgren photometry to derive\n[Fe/H]$=-0.06\\pm0.04$. While this result does depend somewhat on the\nreddening, this can be derived from the photometry for individual\nstars and combined to get a robust cluster average, and the authors\ndid a thorough job of examining quality issues that could have\naffected their zeropoints. The APOGEE experiment has also been taking\ninfrared spectra of a large sample of mainly red giants and red clump\nstars, including observations in the {\\it Kepler} field. NGC 6819 is one of\nthe clusters being used to calibrate stars of near solar metallicity,\nand the metallicities derived from comparisons with synthetic spectra\nare being corrected to match literature values. That said, APOGEE has\nprovided their uncalibrated abundance values, which have been lower\nthan their calibrated values by 0.03-0.05 dex. For example,\n\\citet{aspcap} derived an uncalibrated [M/H]$=+0.02$ for NGC 6819\nusing data from Data Release 10. We extracted measurements for 34\nstars identified as asteroseismic members in \\citet{stello11} from\nData Release 12, and find $+0.09$ for both the uncalibrated [M/H] and\nfor [Fe/H] specifically. (The calibrated value of [M/H] is 0.05 dex\nhigher.) APOGEE abundances are not determined truly differentially\nwith respect to the Sun: they use \\citet{asp05} solar abundances (with\n$Z_\\odot=0.0122$) as a reference for producing synthetic stellar\nmodels. More recent compilations have a higher solar abundance. For\nexample, if $Z_\\odot = 0.0134$ \\citep{asp09} was used instead, it\nwould result in a lower zeropoint for the APOGEE metallicity scale by\nabout 0.04 dex.  Finally, \\citet{leebrown} presented high-dispersion\nabundance analysis of a large sample (more than 240) of likely single\ncluster members determined differentially with respect to solar\nspectra. Their quoted values are [Fe/H]$=-0.03\\pm0.06$ for the whole\nsample, and their preferred value $-0.02\\pm0.02$ for a subsample of\nmain sequence stars.\n\nTo determine a most likely range of metal contents to use in\ncomparisons with models, we must consider both the differences in\nmeasured [Fe/H] and the lingering uncertainty in the solar metal\nabundance $Z_\\odot$. The value of $Z_\\odot$ affects the APOGEE\nabundance for NGC 6819 as described above, but different sets of\nisochrones also assume different values. It is safest to compare\nisochrones with the same $Z$, rather than [Fe/H] if we are to avoid\nunnecessarily obscuring real physics effects. The values of $Z_\\odot$\nin recent analyses go from 0.0134 \\citep{asp09} to 0.0153\n\\citep{caffau} --- still a significant source of uncertainty. We\nbelieve that the best range for NGC 6819 comparisons goes from $Z =\n0.012$ (using the \\citealt{leebrown} measurement of [Fe/H]$\\approx\n-0.03$ and $Z_\\odot = 0.0134$) up to $Z=0.015$ (using APOGEE\nabundances for their assumed $Z_\\odot$). The ratio of these\ntwo values corresponds to approximately a 0.1 dex difference in [Fe/H].\n\n\\subsection{Interactions within the WOCS 24009 and 40007 Eclipsing Binaries}\\label{inflate}\n\nIf we are going to use the binaries of NGC 6819 to constrain the\ncluster age, we need to be certain that interactions have not modified\nthe stellar characteristics significantly. While the eclipsing binaries WOCS\n24009 and WOCS 40007 are detached and have not exchanged mass, they \nare close enough that there are legitimate\nconcerns about the effects of tidal interactions. For well-measured\nshort period ($0.6 - 2.8$ d) binaries with masses in the range\n$0.8-1.1M_\\sun$, it has been seen that stars sometimes appear larger\nby 10\\%-20\\% than predicted by single-star evolutionary models \\citep{clausen09}.\nTo explain what is physically occurring inside stars with radii that\nare larger than expected from theory, \\citet{torres06} suggested that\nsynchronized rotation in short-period binaries leads to magnetic field\nproduction and increased chromospheric activity \\citep{chabrier07}.\nFor stars with masses of about a solar mass or less, the magnetic\nactivity can affect the flow of energy through the convective envelope\nby reducing the efficiency of convective heat transport forcing the\nstar to grow larger to compensate. \\citeauthor{torres06} also showed\nthat stars with anomalously large radii can be modeled with the same\nage as their companion if a lower mixing length parameter is\nused. Most longer period binaries show little or no evidence of\nanomalies, but the transition range of periods is ill-defined.\n\nThe two close detached binaries we discuss in this paper have periods in the\nsparse $3-4$ day range: WOCS 40007 \\citep[$P$ = 3.185 d;][]{jeffries13}\nand the current subject WOCS 24009 ($P$ = 3.65 d).  These binaries carry the\nadded benefit that they are members of a cluster with an externally\nconstrained age and a fairly well determined chemical composition, giving\nus a better theoretical idea of what the stellar characteristics should\nbe. Therefore these systems can extend our understanding of the causes of\nstellar inflation.\n\n\\citeauthor{jeffries13} found some indication that the radius of WOCS 40007 B\nis larger than expected from models with the spectroscopic composition\n\\citep{bragaglia01} and preferred age of 2.5 Gyr, but at the time the\nprecision of the mass measurement prevented this from being a strong\nstatement. They considered the possibility that perhaps the adopted\nmetallicity or some other composition variable (most importantly, helium) was\noffset from the cluster value. They examined models with decreased metallicity\nthat produced a slightly better consistency between the ages implied by both\neclipsing stars in WOCS 40007. Ages implied by the lower metallicity were lower by about\n$\\sim$ 0.2 Gyr and were more consistent with ages derived from the CMD fits.\nHowever, with the improvement of the mass measurements for WOCS 40007, the\ndifferences between observations and models are considerably more significant,\nand radius inflation may be necessary to explain the characteristics of component B, \nand possibly both stars.\n\nThe eclipsing stars of WOCS 24009 provide an empirical basis for judging the\nradius of WOCS 40007 B --- the masses of the stars are similar (so\nthey should have comparable internal stellar structure), and they were\nformed in the same cluster (so that their initial chemical\ncompositions should be identical). However, WOCS 24009 has a longer\nperiod, and should show somewhat weaker evidence of\nrotationally-induced activity. Indeed, we find that the radii of WOCS\n40007 B and WOCS 24009 B and C are very similar even though WOCS 40007\nB is $0.02-0.03 M_\\sun$ smaller in mass. So there is some indication\nthat the radius of WOCS 40007 B is inflated by a few\npercent.\n\nResults for other close binaries provide \nadditional perspective. Detached systems with solar-type stars and periods\nshorter than 3 d (e.g. EF Aqr; \\citealt{vos12}) are generally circularized,\nleading to rapid rotation ($v \\sin i =20-73$ km s$^{-1}$) synchronized with the\norbit. These binaries generally have at least one component with a radius\nmeasurement about 10\\% larger than expected from models, show signs of\ninduced magnetic activity in the form of X-rays, have Ca II H and K lines in\nemission, and light variations attributed to starspots. On the other hand,\nbinaries with periods as short as 6.94 d (EW Ori, \\citealt{clausen10}) show\ngood agreement with standard models of solar-type stars. One other system with\na period between 3 and 7 d contains a lower-mass star with\nsignificant radius inflation (V636 Cen: $P = 4.3$ d, $M_2 = 0.854\\pm0.003\nM_\\sun$; \\citealt{clausen09}), but the orbits in that system are significantly\neccentric ($e=0.135$) and the stars rotate pseudosynchronously with the orbit.\n\nThe larger period of WOCS 24009 compared to WOCS 40007 probably has a\nrelatively small effect itself --- it probably means that the rotational\nvelocities of the stars in WOCS 24009 are lower by about 15\\%. If the WOCS\n24009 stars are rotating synchronously with their orbit, the equatorial rotation\nspeed should be about 15 km s$^{-1}$. Probably more important is the larger\nmass of the WOCS 24009 stars. Even though the mass difference is small, this\nmeans that the convective envelopes are less massive by as much as a factor of\n2 \\citep[for example, see Fig. 16 of][]{torres06} between WOCS 40007 B and\nWOCS 23009 A, and the radial extent of the convective zones are reduced by an\neven greater factor.  These differences might be expected to reduce the\neffects of magnetic activity more drastically.\n\nThe photometry of WOCS 40007 B can be decomposed\naccurately from the other two stars thanks to the total eclipses. Using the\neclipse depths we derived in $BVR_cI_c$, we can put component B in\ndifferent CMDs, as seen in Figure \\ref{cmda259}. When $B-V$ color is used, \ncomponent B falls slightly to the blue of the main sequence, but in $V-R_c$\nand $V-I_c$ colors, component B falls significantly to the red of the main\nsequence. This also holds true for a comparison with the WOCS 24009 eclipsing\nstars as well. Checking the dates of the calibrating observations for the\nsources (\\citealt{kalirai01} for $B-V$, \\citealt{hole09} for $V-R_c$, and\n\\citealt{yang} for $V-I_c$), we see no reason to believe that the CMD\nphotometry for WOCS 40007 was affected by eclipses. According to the reddening\nmap from \\citet{platais13}, WOCS 40007 is in a slightly more heavily reddened\nportion of the cluster field. This can partly explain the red positions of\nWOCS 40007 B in $V-R_c$ and $V-I_c$, but we do not have an explanation for the\nbluer position in $B-V$.\n\nA remaining question is whether the even more massive star WOCS 40007 A has\nhad its radius affected. When the more massive star in a short period detached\nbinary is expected to have a very low mass convective envelope, the radius\ngenerally agrees better with standard stellar models (e.g.  FL Lyr,\n\\citealt{popper86}; V1061 Cyg, \\citealt{torres06}).  However, in field\nbinaries, modest increases in radius can be disguised as larger ages if the\nage is not otherwise constrained, as it is in clusters (see V375 Cep in the\ncluster NGC 7142; \\citealt{sandquist13b}). The convective envelope of WOCS\n40007 A is theoretically expected to be less massive than those in the WOCS\n24009 stars by another factor of more than 2. A combination of somewhat larger\nthan average reddening for WOCS 40007 and a correction for the contribution of the\nfaint third star is able to shift the brighter eclipsing star into the middle of the main\nsequence band. Because the three stars appear to share the same mass-radius\nisochrone, we will treat WOCS 40007 A as probably unaffected by the\ninteraction with its companion.\n\nTo further study the connection between chromospheric activity and\nstellar size, more examples of well-studied binaries in the suggested\nmass range with accurately measured mass, radius, and temperature will\nbe needed to map out the dependence of radius inflation on orbital\nperiod/rotational velocity and stellar mass/convection zone depth. In\nthe sample of eclipsing stars in NGC 6819, component B in WOCS\n40007 shows the strongest evidence of tidal inflation as a result of\nthe interaction with its companion component A, but additional work on the\neclipsing binaries will be needed to improve the significance of the\ncomparison.\n\n\\subsection{Photometry of the Component Stars}\\label{debphot}\n\nPart of the effort in this paper has been to incorporate all of our\nresults for the eclipsing binaries of NGC 6819 into a better overall\nconstraint on the characteristics of the star cluster.  Because the\nphotometry of individual stars (in conjunction with their masses)\ncontains precision information that can contribute to age\ndetermination, we discuss our procedure for decomposing the light of\nthe different multiple star systems into each component.\n\n\\subsubsection{WOCS 40007}\n\nThe total eclipse of WOCS 40007 B gives us a\nprecise means of separating the light of component B. We remeasured the\neclipse depths after the re-reduction of the ground-based photometry described\nin \\S \\ref{phot}. We only included nights for which we could measure both the\neclipse minimum and out-of-eclipse levels. The results are shown in Table\n\\ref{a259depths}, and the resulting magnitudes for component B are shown in Table\n\\ref{summary}. The light of component A and the faint third star cannot be as precisely\ndisentangled. We drew magnitudes for the third star from an isochrone\nfitting the cluster's CMD and found a value that put the brightest eclipsing star\nnear the isochrone. This assumption might not be correct if tidal\ninteractions with component B result in significant changes to the\nstar's temperature. However, based on the results from other close binaries,\nwe expect stars with less massive surface convection zones (like WOCS 40007 A)\nto be less affected, as discussed in \\S \\ref{inflate}.\n\n\\subsubsection{WOCS 24009}\\label{w24009}\n\nOn the face of it, we might seem to have limited constraints on the\ndistribution of light among the three stars in WOCS 24009. The eclipses\nof almost equal depth corroborate the idea that the eclipsing stars are nearly\nidentical. However, the precision of the\nphotometry of component A is limited by our ability to disentangle its light\nfrom that of the eclipsing binary. Component A's photometry was initially\nestimated using photometry taken from a theoretical isochrone that fits the\ncluster CMD, where we assumed that the system was composed of a bright, bluer\nthird star and two fainter, redder stars with identical characteristics.  \nHowever, realistic\nsolutions for component A and the eclipsing stars cover large ranges \n(0.9 mag in $V$ for WOCS 24009 A, and 1.5 mag for the eclipsing stars),\nshowing this to be a weak constraint.\n\n\n\\begin{deluxetable}{ccccc}[!h]\n\\tablewidth{0pt}\n\\tablecaption{Secondary Eclipse Depths for WOCS 40007\\label{a259depths}}\n\\tablehead{\n\\colhead{Filter} & \\colhead{$\\Delta m$} & \\colhead{$N_{ecl}$} & \\colhead{$N_{in}$} & \\colhead{$N_{out}$} \n}\n\\startdata\n$B$ & $0.3850\\pm0.0031$ & 2 & 4,3 & 5,12 \\\\\n$V$ & $0.4013\\pm0.0042$ & 2 & 12,2 & 38,5\\\\\n$R_C$ & $0.4215\\pm0.0030$ & 3 & 7,1,4 & 19,9,5\\\\\n$I_C$ & $0.4426\\pm0.0071$ & 1 & 8 & 26\n\\enddata\n\\tablecomments{$N_{ecl}$ is number of observed eclipses, $N_{in}$ is the\n  number of observations made during totality, and $N_{out}$ is the number of\n  out-of-eclipse observations.}\n\\end{deluxetable} \n\n\nWe were able to improve the decomposition with information from the broadening\nfunctions (\\S \\ref{bf}) to get a fairly direct measurement of the relative\nbrightness of the three stars in a limited wavelength range within the $V$\npassband. This would be an important constraint if the stars only underwent\npartial eclipses. Closer examination of the light curves indicates that the\nstars must at least come close to totally eclipsing because the eclipse depths\n($\\sim0.2$ mag) are consistent with the amount of light contributed by the\neclipsing stars in the broadening functions. Indeed, for the best resolved\neclipses, there is a brief period of totality, as could occur for stars\nthat differ in radius by less than 4\\%. The light curve fits also indicate\nthat the inclination of the eclipsing binary is within a degree of being\nedge-on. This news means that the system photometry can be precisely\ndecomposed: the light from component C in the eclipsing binary is directly\nmeasurable from the secondary eclipse depth, the similarity of component B\nalong with light curve fits can then constrain its contribution, and the\nbright component A is the remainder.\n\nBecause the period of totality is so brief and the contribution of\ncomponent A is so large, it is not as feasible to use a direct\nmeasurement of the secondary eclipse depth in the same way as we did\nfor WOCS 40007 above. We therefore derived light ratios from our light\ncurve analysis and used them to decompose the system's\nphotometry. Although we did use the broadening function light\nconstraints in our models, the final light ratios are driven by the\nexistence of the total eclipse and the near identical characteristics\nof the eclipsing stars.\\footnote{For completeness, we note that the\n  derived value of $l_3 = L_A / (L_A + L_B + L_C) = 0.614$. This\n  underscores that the broadening function values from section\n  \\ref{bf} were systematically in error as a result of the significant\n  temperature difference between component A and the eclipsing\n  stars. However, the light curve fit overrode the constraint\n  value we used.}  The decomposed photometry of WOCS 24009 is given in\nTable \\ref{summary}. The color of the bright A component is consistent\nwith the spectroscopic temperature for our preferred reddening, and\nall three stars fall within the band of the main sequence in the\nCMD. The decomposed photometry of WOCS 24009 can be found in Figure\n\\ref{decomp_cmd} along with the other measured cluster members.\n\nAlthough we can find isochrones that fit the masses and photometry of\nthe eclipsing stars of each binary (WOCS 40007 and WOCS 24009)\nseparately to within $1\\sigma$, there are no solutions that\nsimultaneously fit all four stars that precisely. A distance modulus\nof $(m-M)_V \\approx 12.45$ threads through the error ellipses for all\nof the stars at a little more than $1\\sigma$ away, but we must\nconsider the possibility of systematic errors. The relative\nbrightnesses of the stars in each binary are consistent with their\nmasses for models with a wide range of ages and compositions.\nHowever, the components of WOCS 40007 imply a smaller distance modulus\nthan WOCS 24009 by about 0.1 mag. Differential reddening is a natural\nplace to seek an explanation for this discrepancy because the\n\\citet{platais13} map appears to be over-correcting WOCS 40007: both\ncomponents appear to be bluer than the corrected main sequence, and\nWOCS 40007 B is significantly brighter than WOCS 24009 C in spite of a\nsmaller measured mass. However, to bring the WOCS 40007 stars back to\nthe cluster main sequence, the reddening correction would need to be\nwell outside of the distribution of corrections for nearby stars\n(within about an arcmin).  Proper-motion and radial-velocity\ninformation argues against the idea that WOCS 40007 is a foreground\nnonmember system. Our current best explanation is that the WOCS 40007\nstar characteristics have been affected by star-star interactions in\nthe case of component B, and by imperfectly determined\ncorrections for the faint third star star in the case of component A.\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=0.7\\textwidth]{fig7}\n\\vspace{-15pt}\n\\caption{$BV$ CMD \\citep{kalirai01} for NGC 6819 with removal of\n  non-members having $V \\leq 16.5$. Differential reddening corrections\n  from \\citet{platais13} are applied to each star. Isochrones are\n  plotted with $Z \\approx 0.015$ and ages 2.3, 2.5, and 2.7 Gyr for\n  PARSEC and VR, while DSEP show 2.5, 2.7, 2.9 Gyr and Y$^2$\nuse 2.2, 2.4, and 2.6 Gyr; all use $E(B-V)=0.16$ and $(m-M)_V=12.40$.\n  The decomposed photometry for WOCS 24009 is shown as the set of red\n  points with the bright third star (filled circle) and the dimmer\n  eclipsing stars (empty circles).  WOCS 23009 A (purple $+$) along with WOCS\n  40007 A (orange $\\square$) and B (blue $\\square$) stars are indicated.\n  \\label{decomp_cmd}}\n\\end{figure*}\n\n\\subsubsection{WOCS 23009}\n\nThe simplest case is the long period binary WOCS 23009. The small\namplitude of the total secondary eclipse in the {\\it Kepler}\nphotometry \\citep[0.002 mag;][]{sandquist13} indicates that we can treat\nthe system photometry as essentially identical to that of the brightest eclipsing\nstar --- any corrections would be less than the uncertainty in the\nsystem magnitude.  In all of the measured DEBs in NGC 6819, WOCS 23009 A\nis potentially the best indicator of age for the cluster, as it is the\nmost evolved star with a measured radius. \n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=0.7\\textwidth]{fig8}\n\\vspace{-15pt}\n\\caption{$VI_C$ CMD for NGC 6819 \\citep{yang} with isochrones employing\n  $E(V-I)=0.20$ and $(m-M)_V=12.40$. Otherwise the isochrone ages and\n  symbols are the same as Fig. \\ref{decomp_cmd}.\n\\label{yangcmd}}\n\\end{figure*}\n\nWe have updated our estimate of the mass of WOCS 23009 A using the\nphotometry and masses of our eclipsing binary star measurements.\n\\citet{sandquist13} determined the mass of WOCS 23009 A to be\n$1.468\\pm0.030 M_\\sun$ using an isochrone-based extrapolation from the\nmasses and photometry of the components of the binary WOCS 40007. It\nis almost certainly more massive than WOCS 24009 A, but it is part of\na single-lined binary and so its mass could only be estimated from its\nCMD position relative to other cluster stars of known mass.  Our\npreferred fit uses the two WOCS 24009 stars because of larger concerns\nabout the photometry of the WOCS 40007 stars.  Fits for a choice of\nisochrone (from a particular research group with specific composition\nand age) give uncertainties of about $\\pm0.010 M_\\sun$ for the mass of\nWOCS 23009 A, with an additional $0.004 M_\\sun$ coming from\nuncertainty in the $V$ magnitude of WOCS 23009. However, there are\nlarger systematic differences. Using $Z=0.015$, Dartmouth (DSEP;\n\\citealt{dotter08}) and Victoria-Regina (VR; \\citealt{vandenberg06})\nisochrones produce similar masses ($1.472-1.476 M_\\sun$), while the\nPARSEC \\citep{bressan12} models give a lower mass ($1.458\nM_\\sun$). The lower mass for the PARSEC isochrones may be due to a\nlarger assumed convective core overshooting (approximately 0.25\npressure scale heights $H_P$ versus $0.2 H_P$ for other models) or a\nhigher assumed helium abundance ($\\Delta Y \\approx 0.007$) for a given\nmetal content.  When varying the metal content along with the helium\ncontent (assuming, like most stellar modelers, that there is a\nconstant $\\Delta Y / \\Delta Z$), there are smaller systematic changes\nbecause of the compensating effects of $Y$ and $Z$: reducing the metal\ncontent from $Z=0.015$ to $Z=0.012$ reduces the mass of WOCS 23009 A\nby about $0.004 M_\\sun$.  Based on these considerations, we estimate the systematic\nuncertainty due to model differences to be $\\pm0.008 M_\\sun$.\n\n\n\nOur new estimate of the mass of WOCS 23009 A is $1.464\\pm0.011\\pm0.012\nM_\\sun$, where the two uncertainties are estimates of the random and\nsystematic effects, and we have taken the central value to be between\nthe PARSEC and DSEP/VR values using $Z=0.012$ and\n0.015. This is consistent with our original estimate ($1.468\\pm0.03\nM_\\sun$, \\citealt{sandquist13}). The main changes in the analysis are\nthe revision in the metal content of the models we use and the\ndifferent sample of stars used for the mass estimation. If we were to\nuse the stars of WOCS 40007 instead, we would get a mass for WOCS\n23009 A that is about $0.02 M_\\sun$ lower. We hope that in the future we\ncan reconcile the characteristics of WOCS 40007 with those of the\nother eclipsing systems, but right now we believe there are still\nunidentified systematic issues present.\n\nBecause the radius of the star is mildly correlated with the mass\nestimate used \\citep{sandquist13}, we have re-run fits to the radial\nvelocities and eclipse light curves of WOCS 23009. The updated values\nare shown in Table \\ref{summary}.\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=0.70\\textwidth]{fig9}\n\\vspace{-15pt}\n\\caption{$BV$ CMD for NGC 6819 with $Z \\approx 0.015$ isochrones\n  shifted to match the photometry of WOCS 24009 C at its measured\n  mass, as discussed in \\S \\ref{age}.  The symbols for the plotted cluster \n  stars are the same as Fig. \\ref{decomp_cmd}. Horizontal lines delimit the\n  range for the 1$\\sigma$ uncertainty in the mass for components. Those for WOCS\n  24009 are red dotted lines for component B and solid for component C. \n  Plotted ages are 2.1, 2.3, and 2.5 Gyr for DSEP and\n  PARSEC; 2.0, 2.2, 2.4 for VR and Y$^2$.\n\\label{force}}\n\\end{figure*}\n\n\\subsection{Distance Modulus}\n\nWhen radius and temperature can be determined for eclipsing binary\nstars, the distance can be derived by comparing the predicted absolute\nmagnitude to photometric observations. We used the photometric\ntemperature estimates from \\S \\ref{temps} along with the binary star\nradii to derive luminosities, applied bolometric corrections from\n\\citet{vandc} to compute absolute $V$ magnitudes, and used $V$\nmagnitudes from \\citet{yang} photometry to derive the distance\nmodulus. For four out of the five eclipsing binary stars we discuss here (WOCS 23009 A,\nWOCS 24009 B and C, and WOCS 40007 A) we get very consistent distance\nmoduli. For the remaining star (WOCS 40007 B), the difference is\nlikely due to problems determining the photometric temperature:\n$(B-V)$ and $(V-I)$ colors for the star puts it on the blue and red\nsides of the main sequence, respectively.  If we adopt a temperature\nconsistent with those of WOCS 24009 B and C (very close to WOCS 40007\nB in the CMD), the distance modulus comes into agreement with those of\nthe other stars.\n\nAfter propagating uncertainties due to the mean cluster reddening,\ndifferential reddening, and the decomposition of the photometry of the\nbinary components, we find typical uncertainties of around 80-100 K in\nthe photometric temperatures. The uncertainty in the temperature\ndominates the error budget for the distance modulus, which we find to\nbe about 0.08 mag for each star. The individual distance values are\ngiven in Table \\ref{summary}. The weighted average is\n$(m-M)_V=12.38\\pm0.04$, where the quoted uncertainty is the error in\nthe mean. This is consistent with the recent value ($12.40\\pm0.12$)\nderived by \\citet{att} in a comparison of the CMD with Yonsei-Yale (Y$^2$; \\citealt{yy})\nisochrones.  Our distance modulus determination is less\nexplicitly dependent on the choice of metallicity, although it does\nenter through the photometric temperature determination. However, a\n0.1 dex shift in [Fe/H] only results in a 15 K change in temperature\nand about a 0.01 mag shift in the distance modulus.\n\n\\begin{figure*}[!ht]\n\\centerline{\\includegraphics [width=0.7\\textwidth]{fig10}}\n\\vspace{-80pt}\n\\caption{$BV$ CMD for NGC 6819 zoomed on the fainter components of\n  WOCS 24009 (red) and WOCS 40007 (blue), shown with a $1\\sigma$ error\n  ellipses for their photometry. A 2.3 Gyr $Z \\approx 0.015$ PARSEC\n  isochrone is plotted with the predicted positions of stars of masses\n  equal to WOCS 24009 B and C ($\\times$) and the $1\\sigma$ mass\n  uncertainties (horizontal lines).  The isochrone is shifted to\n  optimize the matches to the photometry of WOCS 24009 B and C at\n  their measured masses. The effects of a $\\pm0.01$ mag uncertainty in\n  the differential reddening color correction is shown with the black\n  dashed line.\n\\label{faintzoom}}\n\\end{figure*}\n\n\\subsection{Age Constraints}\\label{age}\n\nWhen fitting isochrones to cluster CMDs, age\ninformation comes from the photometry of stars around the main\nsequence turnoff. As a baseline comparison (Fig. \\ref{decomp_cmd}), we first employed the conventional method\nof comparing isochrones to cluster photometry using a reddening and distance modulus,\nin this case determined by \\cite{att}. We used the\nphotometry of \\citet{kalirai01} due to its high signal-to-noise ratio\n(and small scatter) for main sequence stars near the turnoff.  To\nminimize the scatter, we also applied the differential\nreddening correction map used by \\citet{platais13}. We further cleaned\nthe CMD by restricting the sample to single-star cluster members\nbrighter than the $V \\sim$ 16.5 magnitude limit from the WOCS RVs\nsurvey \\citep{milliman} and to stars with proper-motion membership\nprobabilities greater than 50\\% from either \\citet{platais13} or\n\\citet{sanders}. The decomposed photometry of WOCS\n24009 is plotted along with the photometry of other observed DEB\nstars: WOCS 23009 A \\citep{sandquist13} and both eclipsing components\nof WOCS 40007 \\citep{jeffries13}. The tabulated photometry of the\ncluster DEB stars can be found in Table \\ref{summary}.  To facilitate\nclean comparisons between isochrone sets as discussed at the beginning\nof \\S \\ref{results}, we use a common value of $Z \\approx 0.015$ for\nall of the isochrone sets: DSEP, PARSEC, VR, and\nY$^2$.  Figure \\ref{yangcmd} uses $V$ and\n$I_{c}$ photometry from \\cite{yang} and also applies differential\nreddening corrections to the CMD.  The\nisochrones do a decent job of fitting the $VI_{c}$\nphotometry along the main sequence, turnoff, and subgiant branches\nexcept for Y$^2$ models, which appear to be too blue for the cluster stars\nas well as PARSEC models to a lesser extent.\nDue to distance and reddening uncertainty for the cluster, forcing\nisochrones to fit well-measured stars at their observed $V$ magnitude,\ncolor, {\\it and} mass is a more robust way of comparing isochrones to\nthe CMD.  We chose to align the models with WOCS 24009 C in\nFig. \\ref{force} because of its precise decomposed photometry, and by\ndoing so there is no need to assume a reddening and distance modulus.\nThis type of differential comparison, where we shift all isochrones to match \nmostly unevolved main sequence stars, uses the isochrone shape at the \nturnoff and brightness as the age indicator. \nIn the comparison here, the isochrones do a satisfactory, if\nimperfect, job of matching the characteristics of the fainter\neclipsing stars.  For example, isochrones predict that a star with the\nmeasured mass of WOCS 40007 A should be fainter relative to the three\nstars with mass in the range $1.005 < M / M_\\sun < 1.010$ --- compare\nthe inferred position of the star with the range predicted based on\nits measured mass (delimited by horizontal lines). However, there are\nlingering uncertainties in the photometric decomposition of WOCS 40007\nA due to the faint third star (described in \\S \\ref{bf}) that may\nalleviate this issue. Future refinements of the mass of WOCS 24009 A\nshould help identify whether this is a serious issue with the models.\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=0.70\\textwidth]{fig11}\n\\vspace{-15pt}\n\\caption{$BV$ CMD \\citep{kalirai01} for NGC 6819 with $Z \\approx\n  0.012$.  All isochrones are shifted in the same way as in\n  Fig. \\ref{force}, and symbols are the same. Plotted isochrone\n  ages are 2.0, 2.2, and 2.4 Gyr for DSEP, PARSEC, VR, and Y$^2$.\n  \\label{force01}}\n\\end{figure*}\n\nThe most age sensitive features of the CMD at present are the\nphotometric positions of WOCS 23009 A and the stars on the turnoff and\nsubgiant branch. WOCS 23009 A is valuable because its companion\nis rather faint, so that we can be assured that its measurements\naccurately represent the photometry of a single star. Unfortunately, we\ncannot directly measure its mass. In addition, there are uncertainties\nin the fit due to uncertainty in the mass and photometric decomposition of WOCS 24009 C, \nand in the relative\ndifferential reddening corrections for WOCS 23009 A and 24009 C. All\nof these affect where the isochrones should be\npinned at the faint end. The mass uncertainty is the dominant\nuncertainty (see Figure \\ref{faintzoom}), leading to an uncertainty of\nabout $\\pm0.08$ mag in the isochrone placement. The fit to the\ncombination of WOCS 24009 B and C can be improved by a brightward\nshift of 0.02 to the isochrones --- both components can be matched to\nwithin the uncertainties on the masses and decomposed photometry, as\nshown in Figure \\ref{faintzoom}. Regardless of that choice, these\nuncertainties together lead to an uncertainty of about 0.1 Gyr in the\nage implied by WOCS 23009 A.  Based on the comparison with $Z \\approx\n0.015$ models, the\nimplied ages are 2.12 Gyr for VR, 2.15 Gyr for Y$^2$, 2.21 Gyr for\nDSEP, and 2.31 Gyr for PARSEC. Based on the scatter in these values,\nwe estimate a systematic uncertainty of about 0.09 Gyr due to\ndifferences in the physics encoded in the models.\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=1\\textwidth]{fig12}\n\\vspace{-25pt}\n\\caption{Mass-radius ($M-R$) plot for WOCS 24009 B and C (red filled and empty circles),\n  WOCS 40007 A (orange) and B (blue), and WOCS 23009 A (purple) as the most massive component. \n  The plotted isochrones employ $Z = 0.015$ and [$\\alpha$/Fe] = 0.0. The\n  masses used for WOCS 23009 A are derived from extrapolations using\n  the plotted isochrone set.\n   \\label{mr09}}\n\\end{figure*}\n\nThe turnoff and subgiant stars are more numerous and contain age\ninformation, but we have imperfect knowledge of whether they might be\nin undetected multiple star systems. At the turnoff (the bluest point\non the isochone) and fainter, the blue side of the observed \ndistribution of main sequence stars can usually be expected to be a good\nrepresentation of the single star main sequence because unresolved\nbinaries would be displaced brighter and redder. Brighter than the\nturnoff, however, unresolved binaries can fall either redder or bluer\nthan the single star sequence. On the subgiant branch, binarity can\naffect the color in either direction, but the lower envelope of the\nsubgiant stars can trace out the single star sequence. Using\nproper-motion and radial-velocity information from \\citet{milliman},\nwe plotted the most likely single star subgiant cluster members on all\nof our CMDs: WOCS 7008, 8004, 9009, 11005, 11006, 18002, 20016, 22004,\n22013, and 23006.  Satisfactory fits are possible with each of the\nisochrone sets, but the color of the turnoff and the brightness of the\nfaint envelope of the subgiant branch appear to be poorly matched.\nPart of this may be uncertainties in the measured positions of the\nfaint eclipsing stars we use to pin the isochrones, but the shapes of\nthe isochrones on the subgiant branch and at the top of the main\nsequence can be importantly affected by the modeling of convective\ncore overshooting. For example, the DSEP models appear to do the best\njob of simultaneously matching the properties of WOCS 23009 A and the\nfainter subgiant branch stars. Without additional work on the\nsubgiants and their modeling, it is too early to weight them in the\ndetermination of the age presented here.\n\nUncertainties in metallicity also produce a potential source of\nsystematic error though. We examined isochrone fits using a decreased\nmetal abundance $Z=0.012$ in Figure \\ref{force01}. When using a lower\nmetal abundance, the isochrones used to best fit the cluster are\nyounger by about 0.1 Gyr compared to isochrones using $Z=0.015$. The\nmain sequence shape seems to be somewhat more poorly fit for all four\nisochrone sets. From all of the considerations of the CMD, we quote an\nage of $2.21\\pm0.10\\pm0.20$ Gyr, where the quoted uncertainties are\nfrom the combined fitting uncertainties and the combined systematic\nuncertainties.  The shifts needed to match the photometry of WOCS\n24009 C at its measured mass imply particular values of reddening and\ndistance modulus, and for completeness, we give them here. For the\nfour sets of isochrones we have discussed, we find reddenings $0.23 <\nE(B-V) < 0.26$ and distance moduli $12.56 < (m-M)_V < 12.67$ for\n$Z=0.012$, and $0.19 < E(B-V) < 0.22$ and $12.46 < (m-M)_V < 12.57$\nfor $Z=0.015$. These values are affected by differences in input\nphysics and color-temperature relations used for the different\nisochrone sets, and we do not consider them to be measurements of\nthese values.\n\nThe most direct method of comparing eclipsing binary observations to\ntheory is through the mass-radius ($M-R$) plane. The radii of evolved\nstars are good age indicators because the physical measurements in an\neclipsing binary system can reach a high degree of precision while\navoiding sources of systematic error from sources such as distance and\nreddening.  Statistically speaking, it is best to use all\nwell-measured stars for determining the cluster age, and with the\nanalysis of WOCS 24009, we add two more stars. (Unfortunately, WOCS\n24009 A does not undergo eclipses, and so its radius cannot be\nmeasured directly and it cannot be used in this analysis.)  The masses\nand radii for WOCS 24009 and the other cluster stars used in determining age are\nlisted in Table \\ref{summary}. Note that the values\nfor WOCS 40007 A and B have been updated for this paper after improved\ncorrections for the effects of the faint third star on RVs and\neclipse timings, and the incorporation of {\\it Kepler}\nphotometry. Figure \\ref{mr09} shows the $M-R$ diagram comparison with\nisochrones assuming the higher metal abundance $Z = 0.015$.  For all\nmodel sets using the higher metal content, the eclipsing stars of WOCS\n40007 lie slightly above the isochrone that best matches the bright\nstar WOCS 23009 A and the eclipsing stars 24009 B and C.  Based on the\n\\cite{att} suggestion of a lower metallicity, we examined a metal\nabundance $Z = 0.012$ (decreased by about 0.1 dex and consistent with\nplausible errors in the metallicity scale) as seen in Figure \\ref{mr01}.\nWith a lower metallicity the eclipsing stars fall on younger models,\nsimilar to what is seen in the CMDs with the same $Z$ content. The\nmodel radii decrease and produce a small improvement to the\nconsistency of the ages implied by the different stars and a small\n($\\sim$0.2 Gyr) reduction to the age.\n\nThe most age-sensitive eclipsing star currently known in the cluster\nis WOCS 23009 A, and the age uncertainty derived from this star alone\nis mostly responsible for the error in the weighted mean. It should be\nremembered that its mass comes from an isochrone-based extrapolation\nfrom the properties of WOCS 24009 stars as mentioned in \\S\n\\ref{debphot}, but that the radius is not terribly sensitive to this\nestimate (see \\citealt{sandquist13} for a discussion) and this is why\nthis star can provide age discrimination.  With the improved radial\nvelocity measurements presented here, the mass uncertainties for the\nstars in WOCS 40007 and WOCS 24009 have been reduced compared to what\nwas presented in \\citet{jeffries13}. The eclipsing stars for those two\nsystems appear to imply slightly different ages, although this is not\nat a high level of significance. For example, the three faintest stars\n(WOCS 40007 B and WOCS 24009 B and C) have masses that are consistent\nwith each other at a little under a $2\\sigma$ level. As discussed in\n\\S \\ref{inflate}, WOCS 40007 B may have been inflated in radius due to\ntidal interaction, and its V-band photometry may also have been\naffected, making its use in the CMD age determination\nquestionable.  Depending on the isochrones used, the remaining three\nstars are roughly consistent with the age derived from WOCS 23009 A at\nabout the $1\\sigma$ level.\n\n\\begin{figure*}[!ht]\n\\centering\n\\includegraphics [width=1\\textwidth]{fig13}\n\\vspace{-25pt}\n\\caption{$M-R$ plot for isochrones with a lower metal abundance $Z = 0.012$.\nStar symbols are the same as in Fig. \\ref{mr09}.\n\\label{mr01}}\n\\end{figure*}\n\nThe error in the weighted average is about 0.05 Gyr, but the\nsystematic sources of error are more substantial. A major systematic\ncontribution is uncertainty in the metal content of the stars. We find\ndifferences of $0.13 - 0.20$ Gyr between models having $Z = 0.012$ and\n$Z = 0.015$ from the same research group, with the lower metallicity\nproducing lower ages. As a result, we estimate the systematic\nmetallicity uncertainty to contribute an uncertainty of $\\pm0.10$ Gyr\nto the age. Comparing results from different research groups for the\nsame $Z$, there is a $0.2 - 0.25$ Gyr range, with VR\nmodels giving the lowest ages (2.22 Gyr for $Z = 0.0125$), Y$^2$\nmodels giving the highest (2.40 Gyr for $Z = 0.012$), and DSEP and\nPARSEC models returning values nearly midway between these\nvalues. Based on this, we estimate a systematic uncertainty of about\n$\\pm0.12$ Gyr on the age due to differences in physics and chemical\nmixes used in the different models.\n \nBecause we do not have strong reason to prefer one metal content $Z$\nor one set of models, we take our best $M-R$ estimate of the age to be\nin the middle of the ranges and quote an age of $2.38\\pm0.05\\pm0.22$\nGyr, where the two uncertainties are statistical and systematic,\nrespectively. Although we can expect an improvement of the statistical\nuncertainty in the age with additional measurement of the eclipsing\nstars, the best way of improving the age estimate in the cluster will\nbe to reduce the metallicity uncertainty (through a combination of\nimproved spectroscopic measurements of cluster star abundances\nrelative to the Sun and a resolution of the question of the solar\nvalue $Z_\\sun$) and the model isochrone uncertainties.\n\n\\section{Conclusions}\n\nWe have presented extensive photometric and spectroscopic observations\nof the detached eclipsing binary WOCS 24009 in open cluster NGC 6819\nas part of a larger effort to obtain the age of the cluster using all\nof the useful binaries (including WOCS 40007 and WOCS 23009). Our modeling indicates that we have obtained\nmass and radius measurements with uncertainties $\\sim$ 1.0\\% and\n0.7\\% for the eclipsing components of WOCS 24009. We have started to characterize the\nturnoff-mass WOCS 24009 A, although the uncertainty in its mass is\nabout 4.6\\%.  This uncertainty can be reduced with a combination of\nradial-velocity measurements of component A and eclipse timings\n--- together these measurements will provide the highest precision\nmeasurement of the third star's orbit and the mass ratio $q_A = M_A / (M_B\n+ M_C)$.  Because the star's photometry can be disentangled from the\neclipsing stars, a more precise mass will provide a significantly\nbetter constraint on the cluster age.\n\nSystematic uncertainties in the theoretical stellar models and in the\nmetal content of the cluster stars are the main obstacles to a higher\nprecision age at present. We derive ages for NGC 6819 of\n$2.21\\pm0.10\\pm0.20$ Gyr using the CMD and $2.38\\pm0.05\\pm0.22$ using\nthe $M-R$ plane, where the quotes are estimates of statistical and\nknown systematic uncertainties.\nThere is still significant disagreement between different indicators\nof the cluster metallicity, and a better determination of this would\nsignificantly reduce the systematic errors quote above. The possibility\nof a lower cluster metallicity can be spectroscopically tested in the future \nusing the binary stars with the assistance of constraints on the\nsurface gravities from the binary star analysis.  Our derived age is\nin agreement with asteroseismic \\citep{basu11} and white dwarf cooling\n\\citep{bedin} ages for the cluster.\n\nStellar model differences remain one of the biggest contributors to\nthe uncertainty in the age. To reduce this source of error, it is\nhelpful to review the systematic differences between model sets even\nif we cannot be completely certain of the causes. In the $M-R$\ncomparisons made at the same metal content $Z$, VR\nisochrones gave the youngest ages of the model sets we tested, and\nY$^2$ returned the largest ages. In CMD comparisons, VR,\nY$^2$, and DSEP models gave similar ages, with PARSEC models returning\nthe oldest age. The dependencies of these comparisons on different\nmodel inputs (chemical composition mix, the treatment of core\nconvection and diffusion, and color-temperature transformations, among\nothers) should continue to help drive us toward more accurate models.\n\n\\acknowledgements We would like to thank the former Director of Mount Laguna\nObservatory (P. Etzel) for generous allocations of observing time;\nA. Talamantes, E. Bavarsad, and D. Baer for assistance with data taking at\nMLO; and D. Short for his calculations testing the three-body orbital dynamics\nof this system.\n\nThis paper includes data collected by the {\\it Kepler} mission. Funding for\nthe {\\it Kepler} mission is provided by the NASA Science Mission\ndirectorate. We are grateful to the {\\it Kepler} team for the opportunity to\nwork with such an extensive and precise dataset. We gratefully acknowledge\nfunding from the National Science Foundation under grant AST-0908536 to San\nDiego State University and AST-0908082 to the University of Wisconsin-Madison,\nand from the National Aeronautics and Space Administration (NASA) under grant\nG00008957. \nK.B. acknowledges funding from the Carlsberg Foundation and the\nWillum Foundation. Funding for the Stellar Astrophysics Centre is provided \nby The Danish National Research Foundation (Grant agreement no.: DNRF106). \nThe research is supported by the ASTERISK project (ASTERoseismic \nInvestigations with SONG and Kepler) funded by the European Research Council \n(Grant agreement no.: 267864).\nA.M.G. is funded by a National Science Foundation Astronomy \nand Astrophysics Postdoctoral Fellowship under Award No.\\ AST-1302765.\n\n\\bibliographystyle{plain}\n\n\\begin{thebibliography}{}\n\\bibitem[Andersen(1991)]{andersen91} Andersen, J. 1991, A\\&A Rev., 3, 91\n\\bibitem[Alard(2000)]{alard00} Alard, C. 2000, A\\&AS, 144, 363\n\\bibitem[Anthony-Twarog et al.(2014)]{att} Anthony-Twarog, \nB.~J., Deliyannis, C.~P., \\& Twarog, B.~A.\\ 2014, \\aj, 148, 51\n\\bibitem[Asplund et al.(2005)]{asp05} Asplund, M., Grevesse, N., \\& Sauval,\n  A.~J.\\ 2005, Cosmic Abundances as Records of Stellar Evolution and\n  Nucleosynthesis, 336, 25\n\\bibitem[Asplund et al.(2009)]{asp09} Asplund, M., Grevesse, N., Sauval,\n  A.~J., \\& Scott, P.\\ 2009, \\araa, 47, 481\n\\bibitem[Auner(1974)]{auner74} Auner, G. 1974, A\\&AS, 13, 143\n\\bibitem[Avni(1976)]{avni76} Avni, Y. 1976, \\apj, 210, 642\n\\bibitem[Basu et al.(2011)]{basu11} Basu, S. et al. 2011, \\apj, 729, L10\n\\bibitem[Batalha et al.(2010)]{batalha10} Batalha, N. M., et al. 2010, \\apj,\n  713, L109\n\\bibitem[Bedin et al.(2015)]{bedin} Bedin, L.~R., Salaris, \n  M., Anderson, J., et al.\\ 2015, \\mnras, 448, 1779\n\\bibitem[Bressan et al.(2012)]{bressan12} Bressan, A., Marigo, P., Girardi, L., et al. 2012, MNRAS, 427, 127\n\\bibitem[Borucki et al.(2010)]{borucki10} Borucki, W. J., et al. 2010, Science, 327, 977\n\\bibitem[Bragaglia et al.(2001)]{bragaglia01} Bragaglia, A. et al. 2001, \\apj, 121, 327\n\n\\bibitem[Brogaard et al.(2011)]{brogaard11} Brogaard, K., Bruntt, H., Grundahl, F., et al. 2011, A\\&A, 525, A2\n\\bibitem[Brogaard et al.(2012)]{brogaard12} Brogaard, K., VandenBerg, D. A., Bruntt, H., et al. 2012, A\\&A, 543, A106\n\\bibitem[Burkhead(1971)]{burkhead71} Burkhead, M.~S.\\ 1971, \\aj, 76, 251\n\\bibitem[Caffau et al.(2011)]{caffau} Caffau, E., Ludwig, \nH.-G., Steffen, M., Freytag, B., \\& Bonifacio, P.\\ 2011, \\solphys, 268, 255\n\\bibitem[Caldwell et al.(2010)]{caldwell10} Caldwell, D. A., et al. 2010, \\apj, 713, L92\n\\bibitem[Casagrande et al.(2010)]{casa} Casagrande, L., Ram{\\'{\\i}}rez, I.,\n  Mel{\\'e}ndez, J., Bessell, M., \\& Asplund, M.\\ 2010, \\aap, 512, AA54\n\\bibitem[Castelli \\& Kurucz(2003)]{ck03} Castelli, F., \\& Kurucz, R.~L.\\ 2003,\n  Modelling of Stellar Atmospheres, 210, 20P\n\\bibitem[Castelli \\& Kurucz(2004)]{ck04} Castelli, F., \\& Kurucz, R.~L.\\ 2004, arXiv:astro-ph/0405087\n\\bibitem[Chabrier et al.(2007)]{chabrier07} Chabrier, G., Gallardo, J., \\& Baraffe, I.\\ 2007, \\aap, 472, L17\n\\bibitem[Claret(2000)]{claret00} Claret, A. 2000, A\\&A, 363, 1081\n\\bibitem[Clausen et al.(2009)]{clausen09} Clausen, J. V., Bruntt, H. Claret, A., et al. 2009, A\\&A, 502, 253\n\\bibitem[Clausen et al.(2010)]{clausen10} Clausen, J.~V., Bruntt, H., Olsen,\n  E.~H., Helt, B.~E., \\& Claret, A.\\ 2010, \\aap, 511, A22\n\\bibitem[Coelho et al.(2005)]{coelho} Coelho, P., Barbuy, B.,\n  Mel{\\'e}ndez, J., Schiavon, R.~P., \\& Castilho, B.~V.\\ 2005, \\aap,\n  443, 735\n\\bibitem[Demarque et al.(2004)]{yy} Demarque, P., Woo, \nJ.-H., Kim, Y.-C., \\& Yi, S.~K.\\ 2004, \\apjs, 155, 667\n\\bibitem[Dotter et al.(2008)]{dotter08} Dotter, A. et al. 2008, \\apjs, 178, 89\n\\bibitem[Geller et al.(2008)]{geller08} Geller, A. G., Mathieu, R. D., Harris, H. C., \\& McClure, R. D. 2008, \\aj, 135, 2264\n\\bibitem[Gilliland et al.(2010)]{gilliland10} Gilliland, R. L., et al. 2010, \\apj, 713, L160\n\\bibitem[Gonz{\\'a}lez \\& Levato(2006)]{gonzo} Gonz{\\'a}lez, J.~F., \\& Levato,\n  H.\\ 2006, \\aap, 448, 283\n\\bibitem[Hauschildt et al.(1997)]{hauschildt97} Hauschildt, P. H., Baron, E., \\& Allard, F. 1997, \\apj, 483, 390\n\\bibitem[Hinkle et al.(2000)]{hinkle}Hinkle, K., Wallace, L., Harmer,\n  D., Ayres, T., \\& Valenti, J. 2000, {\\it IAU Meeting 24, Joint\n    Discussion 1, Atomic and Molecular Data for Astrophysics: New\n    Developments, Case Studies, and Future Needs}\n\\bibitem[Hole et al.(2009)]{hole09} Hole, K. T., Geller, A. M., Mathieu, R. D., Platais, I., Meibom, S., \\& Latham, D. W. 2009, \\aj, 138, 159\n\\bibitem[Honeycutt(1992)]{honey} Honeycutt, R.~K.\\ 1992, \\pasp, 104, 435\n\\bibitem[Jeffries et al.(2013)]{jeffries13} Jeffries, M.~W., Jr., Sandquist, E.~L., Mathieu, R.~D., et al.\\ 2013, \\aj, 146, 58 \n\\bibitem[Kalirai et al.(2001)]{kalirai01} Kalirai, J. S. et al. 2001, \\aj, 122, 266\n\\bibitem[Kaluzny \\& Shara(1988)]{kaluzny88} Kaluzny, J., \\& Shara, M.~M.\\ 1988, \\aj, 95, 785 \n\\bibitem[Koch et al.(2010)]{koch10} Koch, D. G., et al. 2010, \\apj, 713, L79\n\\bibitem[Lee-Brown et al.(2015)]{leebrown} Lee-Brown, D.~B., Anthony-Twarog, B.~J., Deliyannis, C.~P., Rich, E., \n\\& Twarog, B.~A.\\ 2015, \\aj, 149, 121 \n\\bibitem[Lindoff(1972)]{lindoff72} Lindoff, U.\\ 1972, \\aaps, 7, 497\n\\bibitem[Mathieu(2000)]{mathieu00} Mathieu, R. D. 2000, ASP, 198, 517\n\\bibitem[Meibom et al.(2015)]{meibom15} Meibom, S., Barnes, \n  S.~A., Platais, I., et al.\\ 2015, \\nat, 517, 589\n\\bibitem[Meibom \\& Mathieu(2005)]{meibom05} Meibom, S., \\& Mathieu, R.~D.\\ 2005, \\apj, 620, 970 \n\\bibitem[Meibom et al.(2011)]{meibom11} Meibom, S., Barnes, S. A., Latham, D. W., et al. 2011, \\apj, 733, L9\n\\bibitem[M{\\'e}sz{\\'a}ros et al.(2013)]{aspcap} \nM{\\'e}sz{\\'a}ros, S., Holtzman, J., Garc{\\'{\\i}}a P{\\'e}rez, A.~E., et al.\\ \n2013, \\aj, 146, 133\n\\bibitem[Milliman et al.(2014)]{milliman} Milliman, K. E., Mathieu, R. D., Geller, A. M., Gosnell, N. M., Meibom, S., \\& Platais, I. 2014, \\aj, 148, 38\n\\bibitem[Orosz \\& Hauschildt(2000)]{orosz00} Orosz, J. A., \\& Hauschildt, P. H. 2000, AA, 364, 265\n\\bibitem[Pietrinferni et al.(2004)]{pietrinferni04} Pietrinferni, A., Cassisi,\n  S., Salaris, M., \\& Castelli, F. 2004, \\aj, 612, 168\n\\bibitem[Platais et al.(2013)]{platais13} Platais, I., Gosnell, N.~M., Meibom, S., et al.\\ 2013, \\aj, 146, 43 \n\\bibitem[Popper et al.(1986)]{popper86} Popper, D. M., Lacy, C. H., Frueh, M. L., \\& Turner, A. E. 1986, \\aj, 91, 383\n\\bibitem[Rosvick \\& Vandenberg(1998)]{rosvick98} Rosvick, J.~M., \\& Vandenberg, D.~A.\\ 1998, \\aj, 115, 1516 \n\\bibitem[Rucinski(1992)]{bf92} Rucinski, S.~M.\\ 1992, \\aj, 104, 1968 \n\\bibitem[Rucinski(2002)]{bf02} Rucinski, S.~M.\\ 2002, \\aj, 124, 1746\n\\bibitem[Sanders(1972)]{sanders} Sanders, W.~L.\\ 1972, \\aap, 19, 155\n\\bibitem[Sandquist et al.(2003)]{s1082} Sandquist, E.~L., \nLatham, D.~W., Shetrone, M.~D., \\& Milone, A.~A.~E.\\ 2003, \\aj, 125, 810\n\\bibitem[Sandquist et al.(2013)]{sandquist13} Sandquist, E.~L., Mathieu, R.~D., Brogaard, K., et al.\\ 2013, \\apj, 762, 58\n\\bibitem[Sandquist et al.(2013)]{sandquist13b} Sandquist, E.~L., Shetrone, M., Serio, A.~W., \\& Orosz, J.\\ 2013, \\aj, 146, 40 \n\\bibitem[Stello et al.(2011)]{stello11} Stello, D., Meibom, S., Gilliland, R. L., et al. 2011, \\apj, 739, 13\n\\bibitem[Stetson(1987)]{daoph} Stetson, P.~B.\\ 1987, \\pasp, 99, 191\n\\bibitem[Street et al.(2002)]{street02} Street, R. A., et al. 2002, \\mnras, 330, 737\n\\bibitem[Street et al.(2003)]{street03} Street, R. A., et al. 2003, \\mnras, 340, 1287\n\\bibitem[Street et al.(2005)]{street05} Street, R. A., et al. 2005, \\mnras, 358, 795\n\\bibitem[Talamantes et al.(2010)]{talam10} Talamantes, A., Sandquist, E. L., Clem, J. L., Robb, R. M., Balam, D. D., \\& Shetrone, M. 2010, \\aj, 140, 1268\n\\bibitem[Tegmark et al.(2004)]{tegmark04} Tegmark, M., Strauss, M. A., Blanton, M. R., et al. 2004, Phys. Rev. D, 69, 103501\n\\bibitem[Torres et al.(2006)]{torres06} Torres, G., Lacy, C. H., Marschall, L. A., Sheets, H. A., \\& Mader, J. A. 2006, \\apj, 640, 1018\n\\bibitem[Torres et al.(2010)]{torres10} Torres, G., Andersen, J., \\& Gim\\'enez, A. 2010, A\\&A Rev, 18, 67\n\\bibitem[VandenBerg et al.(2006)]{vandenberg06} VandenBerg, D. A., Bergbusch, P. A., \\& Dowler, P. D. 2006, \\apjs, 162, 375\n\\bibitem[VandenBerg \\& Clem(2003)]{vandc} VandenBerg, D.~A., \\& Clem, J.~L.\\ 2003, \\aj, 126, 778\n\\bibitem[Vos et al.(2012)]{vos12} Vos, J., Clausen, J.~V., J{\\o}rgensen,\n  U.~G., et al.\\ 2012, \\aap, 540, A64\n\\bibitem[Yang et al.(2013)]{yang} Yang, S.-C., Sarajedini, \nA., Deliyannis, C.~P., et al.\\ 2013, \\apj, 762, 3 \n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 35951, "prevtext": "\nwas applied to pixel counts on re-reduced flat field and object images\n(after overscan and bias subtraction) taken during that time frame\nusing the IRAF task {\\it irlincor}. The nonlinearity had small but\nnoticeable effects on photometric scatter and trends within nights of\ndata but minor effects on measured stellar characteristics.\n\nPhotometric measurements were made using the \n\\begin{figure*}[!ht]\n\\begin{center}\n\\includegraphics [width=0.9\\textwidth]{fig1}\n\\vspace{-20pt}\n\\caption{Photometry for WOCS 24009 from the {\\it Kepler} spacecraft, and ground-based $B$,\n  $V$, $R_{c}$, and $I_{c}$ observations, compared with the best-fit ELC model\n  solution ({\\it solid line}) for phases in and immediately surrounding the\n  eclipses.\n  \\label{lc}}\n\\end{center}\n\\end{figure*}DAOPHOT II/ALLSTAR suite\nof programs \\citep{daoph}. Because crowding was an issue for a subset\nof the stars, we conducted point-spread function (PSF) photometry on\nall of the ground-based images. Typically 100-150 bright stars were\nchosen to determine the PSF and its variation across each frame. To\nimprove the quality of the photometry in a differential sense, we used\nthe observed ensemble of stars to iterate to a solution for median\nmagnitudes of all stars and photometric zeropoints for each image\n\\citep{s1082,honey}.  Figure \\ref{lc} shows WOCS 24009 primary and secondary\neclipse observations phased to the binary period with the slightly\ndeeper eclipse centered on phase $\\phi = 0$.\n\n\\subsection{{\\it Kepler} Photometry} \n\nThe {\\it Kepler} spacecraft made nearly continuous photometric\nobservations of a field between Cygnus and Lyra that included NGC 6819\n--- mission details have been previously presented in\n\\cite{borucki10}, \\cite{koch10}, \\cite{batalha10}, \\cite{caldwell10},\nand \\cite{gilliland10}.  ``Superaperture'' observations of the cluster\nwere made as part of the Kepler Cluster Study \\citep{meibom11}. These\ninvolved a series of 20 image stamps covering the center of NGC 6819,\ntogether forming a 200 $\\times$ 200 pix square field of view with\n$13\\farcm25$ on a side. Exposures for these stamps were taken in the\nlong-cadence mode of 30 minutes.  Eclipses of the binary components\nwere observed using {\\it Kepler} data for quarters 1-16, excluding\nquarters 6, 10, and 14 when the cluster fell on an unresponsive CCD\nmodule.  We retrieved the public data from the Mikulski Archive for\nSpace Telescopes (MAST), operated by the Space Telescope Science\nInstitute.\\footnote{\\tt\n  http://archive.stsci.edu/kepler/kic10/search.php} Data processing\nwas done using a series of Python tasks based on PyKe\\footnote{\\tt\n  http://keplergo.arc.nasa.gov/PyKE.shtml} software tools to reduce\nand analyze the {\\it Kepler} simple aperture photometry (SAP). We\nderived times of mid-eclipse for all observable eclipses, making use\nof one month of short-cadence data in quarter 12 for its higher time\nresolution. We restricted our later analysis to photometry in and\nimmediately around times of eclipse.\n\nFor {\\it Kepler} photometry it is necessary to ensure that\ninstrumental trends are removed and that contamination from other\nstars are accounted for.  WOCS 24009 is located just outside of the\ncenter of the cluster (about $4\\farcm4$ away) but is very close to neighboring stars. With a\nlarge pixel size of 4$\\arcsec$ across, contamination from other stars\nseemed likely. Contamination values as determined by the {\\it Kepler}\nteam ranged from 9.1\\% to 15.3\\% during different observing\nseasons. Even after correcting for different contamination values,\ncotrending the photometry against the light curves of other stars on\nthe CCD, and fitting and removing effects from star spots, we still\nfound significant variations in observed eclipse depths during a\nsingle quarter of observations and from quarter-to-quarter.\nIn the end, we opted to use the short-cadence data from quarter\n12 for our analysis due to the higher time resolution and in order to avoid\nissues of inconsistent eclipse depth from quarter to quarter. We did not apply\nany crowding corrections to this dataset as this will be fit as a free\nparameter in the binary star models (see \\S \\ref{ELC}). \nThe top panel in Figure \\ref{lc} shows the trimmed, phased light curves of the short-cadence\nKepler data.\n\n\n\\begin{deluxetable}{cccl}[!htp]\n\\tablewidth{0pt}\n\\tablecaption{Eclipse Timings \\label{etimes}}\n\\tablehead{\\colhead{BJD - 2450000} & \\colhead{$\\sigma$} & \n\\colhead{Eclipse} & \\colhead{Notes}}\n\\startdata\n\\multicolumn{4}{c}{WOCS 24009}\\\\\n2104.86904 & 0.00027 & P & $R_{c}$ ground\\\\\n4697.66460 & 0.00033 & S & $R_{Kron}$ ground\\\\\n4965.88626 & 0.00025 & P & Beginning of Kepler Q1\\\\\n4967.71076 & 0.00019 & S & \\\\\n4969.53563 & 0.00022 & P & \\\\\n4971.36016 & 0.00017 & S & \\\\\n4973.18516 & 0.00017 & P & \\\\\n4975.00933 & 0.00025 & S & \\\\\n4976.83423 & 0.00008 & P & \\\\\n4978.65877 & 0.00024 & S & \\\\\n4980.48360 & 0.00020 & P & \\\\\n\\multicolumn{4}{c}{WOCS 40007}\\\\\n2102.88901 & 0.00008 & P & $R_{c}$ ground\\\\\n4623.88162 & 0.00015 & S & V  ground\\\\\n4698.73250 & 0.00011 & P & $R_{Kron}$ ground\\\\\n4964.69147 & 0.00025 & S & Beginning of Kepler Q1\\\\\n4966.28385 & 0.00023 & P &\\\\\n4967.87663 & 0.00019 & S &\\\\\n4969.46896 & 0.00013 & P &\\\\\n4971.06181 & 0.00005 & S &\\\\\n4972.65416 & 0.00012 & P &\\\\\n4974.24685 & 0.00022 & S &\\\\\n4975.83930 & 0.00022 & P &\n\\enddata\n\\tablecomments{This table is published in its entirety in the electronic edition, but a portion is shown here for guidance regarding its form and content.}\n\\end{deluxetable}\n\n\nFor the triple system WOCS 40007, we followed similar procedures, deriving\neclipse times (see Table \\ref{etimes}) to measure orbit parameters for the\nfainter non-eclipsing star, and using short-cadence data from quarter 12 in an update of\nour earlier modeling of ground-based light curves \\citep{jeffries13}.\n\n\\subsection{Spectroscopy}\\label{spectra}\n\nRadial velocities (RVs) were obtained using spectra from the high-precision survey of NGC\n6819 \\citep{hole09,milliman}.  These spectroscopic data were taken as part of the WIYN\nOpen Cluster Survey (WOCS; \\citealt{mathieu00}) using the WIYN\\footnote{The \nWIYN Observatory is a joint facility of the University of Wisconsin-Madison, \nIndiana University, the National Optical Astronomy Observatory and the \nUniversity of Missouri}\n3.5 m telescope on Kitt Peak and Hydra multi-object\nspectrograph instrument (MOS), which is a fiber-fed spectrograph capable of\nobtaining about 80 spectra simultaneously ($\\sim$10 fibers set aside for sky\nmeasurements and $\\sim$70 for stellar spectra). Observations used the echelle\ngrating with a spectral resolution $\\sim$ 15 km s$^{-1}$. Most of the spectra\nwere centered at 513 nm with a 25 nm range covering an array of narrow\nabsorption lines around the Mg b triplet. Spectroscopic observations for\nWOCS 24009 were generally completed using 2 hour integrations per visit that\nwere split into three 2400 s integrations to allow for rejection of cosmic\nrays.\n\nImage processing was done using standard spectroscopic {\\it IRAF}\nprocedures. First, science images were bias and sky subtracted, and\nthen the extracted spectra were flat fielded, throughput corrected,\nand dispersion corrected.  The spectra were calibrated using one 100 s\nflat field and two bracketing 300 s ThAr emission lamp spectra for\neach observation.  Once the RVs were derived (see below), we also\ncorrected for individual fiber offsets present in the Hydra MOS. A\nmore detailed explanation of the acquisition and reduction of WOCS\nobservations can be found in \\cite{geller08}.\n\n\\subsubsection{Spectral Disentangling and Broadening Function Analysis}\\label{bf}\n\nThe spectra of WOCS 24009 are fairly complex to analyze given that there are\nthree cluster member stars contributing absorption-line features.  The\nbrightest component does not belong to the eclipsing binary and there is\nsubstantial blending of the lines when the stars are near their eclipse times.\nThe need to derive precise RVs in such situations led us to use\nbroadening functions (BF), which have been demonstrated to produce reliable\nmeasurements even for contact binaries with a great deal of rotational\nbroadening \\citep{bf92,bf02}. BFs also minimize systematic effects on the\nmeasurements like ``peak pulling'' in situations where traditional techniques\nsuch as cross correlation are unable to cleanly separate the contributions from\ndifferent components \\citep{bf02}.\n\nBriefly, the broadening function can transform a sharp-lined synthetic or star\nspectrum into a broadened spectrum through a convolution. The broadening\nfunction contains information on how the intensity of the star's light is\nredistributed due to Doppler effects resulting from galactic motion, orbital\nmotion, or rotation, among others. As a result, significant peaks in the\nbroadening function give a measure of the overall RVs of the\ncomponents, the function shape is an indicator of the rotation, and the total\narea of the peak is a proxy for luminosity in the spectral region observed.\n\nHowever, even with this improvement, line blending prevented optimal\ndetermination of RVs for some epochs. As a result, we\nalso applied the technique of spectral disentangling\n\\citep{gonzo}. Because the spectra of the individual stars can be\nderived when there are a sufficient number of spectra taken with good\n(and differing) radial-velocity separation between the components, it\nis sometimes possible to derive RVs even with fairly\nsevere line blending.  Starting with initial guesses for the radial\nvelocities, average spectra for the individual stars can be derived\nand used to subtract out the lines of all but one of the component\nstars in turn, and the subtracted spectra can then be used to make\ncleaner measurements of the RVs. The average stellar\nspectra and RVs can then be iteratively improved, and\nconvergence tends to be rapid.  In our case, there are three\ndetectable stars in the spectra, and we extended the \\citet{gonzo}\nalgorithm to iteratively disentangle all three, starting with radial\nvelocity estimates from broadening function analysis of the entangled\nspectra.\n\n\n\\begin{deluxetable}{lrrr}[!htp]\n\\tablewidth{0pt}\n\\tablecaption{Measured Radial Velocities from the WIYN 3.5 m Telescope\\label{rvtab}}\n\\tablehead{\\colhead{mJD\\tablenotemark{a}} & \\colhead{$v_A$ (km s$^{-1}$)} & \\colhead{$v_B$ (km s$^{-1}$)} & \\colhead{$v_C$ (km s$^{-1}$)}\n}\n\\startdata\n\\multicolumn{4}{c}{WOCS 24009}\\\\\n\\hline\n2461.8591 & $4.14 \\pm 0.06$ & $83.60 \\pm 0.36$ & $-81.77 \\pm 0.54$\\\\\n2542.6483 & $5.89 \\pm 0.25$ & & $-23.05 \\pm 4.54$\\\\\n2840.9238 & $8.51 \\pm 0.37$ & $77.28 \\pm 3.21$ & $-91.44\\pm 4.25$\\\\\n2857.7341 & $6.98 \\pm 0.26$ & $-89.59 \\pm 1.34$ & $83.54\\pm 1.78$\\\\\n3190.8469 & $12.22 \\pm 0.81$ & $46.72 \\pm 3.22$ & $-51.54 \\pm 2.54$\\\\\n3576.8340 & $12.65 \\pm 0.19$ & $-71.66 \\pm 1.64$ & $62.93 \\pm 1.75$\\\\\n3810.9662 & $12.06 \\pm 0.53$ & & $-10.26\\pm 4.77$\\\\\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\hline\n\\multicolumn{4}{c}{WOCS 40007}\\\\\n\\hline\n2180.6428 & $-39.39\\pm0.03$ & $62.76\\pm0.05$ & \\\\\n2415.8614 & $-84.48\\pm0.02$ & $107.52\\pm0.05$ & \\\\\n2461.7212 & $ 80.20\\pm0.02$ & $-84.10\\pm0.05$ & \\\\\n2475.6910 & $-21.15\\pm0.09$ & $24.80\\pm0.07$ & \\\\\n2476.8479 & $-50.81\\pm0.05$ & $61.94\\pm0.04$ & \\\\\n2856.7194 & $ 73.97\\pm0.91$ & $-94.24\\pm1.32$ & \\\\\n\n3190.6986 & $ 15.85\\pm0.03$ & $-29.40\\pm0.10$ & \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\enddata\n\\tablenotetext{a}{mJD = BJD - 2 450 000}\n\\tablecomments{This table is published in its entirety in the electronic edition, but a portion is shown here for guidance regarding its form and content.}\n\\end{deluxetable}\n\nOf the 41 spectra we had available, 34 covered wavelengths between\n5000 and 5240 \\AA, roughly centered on the Mg b triplet, 6 covered\n5460 to 5730 \\AA, and one covered 6233 to 6227 \\AA.  The spectra in\neach group were continuum normalized before being trimmed to a common\nwavelength range and resampled to a common logarithmic wavelength\nspacing at approximately the same pixel resolution as the original\nspectra. Each of these groups was analyzed separately using a\nhigh-resolution solar spectrum \\citep{hinkle} and IDL routines\nprovided publicly by S. Rucinski\\footnote{\\tt\n  http://www.astro.utoronto.ca/$\\sim$rucinski/SVDcookbook.html} to\nderive the broadening function via singular value decomposition. The\nbroadening function containing all of the singular values was then\ngaussian smoothed to reduce noise --- by experimenting, we found, as\nRucinski has stated, that RVs were sometimes\nsystematically offset when we used a broadening function that was\ncomposed from a limited set of the singular values.  For the reddest\nspectrum, disentangling could not be used, but the broadening function\npeaks for all three components were well separated.  For the bluest\ngroup of spectra, convergence was straightforward, thanks to the large\nnumber of spectra. For the mid-range group of 6 spectra, convergence\nwas more difficult because three had very similar\norbital phase ($\\phi \\approx 0.75$), but after restricting ourselves\ninitially to the three spectra most widely spaced in phase for\nderiving the average spectra, convergence was achieved.\n\nThere were a handful of spectra for which two of the stars had radial\nvelocities that were identical to within about 2 km s$^{-1}$, and for these\ndisentangling failed to uniquely identify the RVs.  However, by\nusing the spectral disentangling technique, we were able to analyze a larger\nnumber of spectra than we were when using broadening functions alone, and\ncould therefore derive a more complete phased radial-velocity curve.  We fit\ngaussian profiles to the broadening function peaks that could be resolved in\neach disentangled spectrum's broadening function. The central values were used\nto measure the stellar RVs, after corrections for fiber velocity\noffsets and heliocentric velocity.\n\nIn the case of the two eclipsing binary components (WOCS 24009 B\nand C), the stars are shown to be extremely similar in their characteristics,\nand so the ratio of the integrated areas of the gaussians gives us a measure\nof their luminosity ratio.  We restricted ourselves to spectra in which three\ncomponent peaks could be separately measured in the broadening function of the\nspectra before disentangling. This limited us to 15 of the spectra centered on\nthe Mg b triplet, and 5 of the spectra centered on about 5595 \\AA. For these\ntwo groups, we found $(L_C / L_B)_{\\lambda} = 0.863 \\pm 0.033$ and $0.880 \\pm 0.014$\n(after rejection of one outlier), respectively, where the error in the mean is\nquoted. Because these two measurements are consistent within the\nuncertainties, we combined them in a weighted mean to get a final value of\n$0.877 \\pm 0.013$ and we treated this as an external constraint on the\n$V$-band luminosities of the two stars in the binary star models.\n\nThe temperature difference between the bright component A and the\neclipsing stars is much larger ($400-500$ K, versus less than 100 K for\nthe two eclipsing stars), and so the broadening functions from limited\nwavelength ranges do not give a direct measure of luminosity\nratios. However, we originally thought that this might be our only\nconstraint on the photometric properties of component A, though this\nended up not being the case \n(see section \\ref{w24009}). Using the same\nspectra with resolved peaks, we estimated $l_3=L_A / (L_A + L_B +\nL_C)$ using the areas of the broadening function peaks for all three\ncomponents. In the bluer region around the Mg b triplet we found\n$0.593\\pm0.014$, and from the region around 5595 {\\AA} we found\n$0.534\\pm0.027$. The two values differ more than they should if they\nwere truly reflecting the light ratios in the two wavelength bands (as\nindicated by integrations of \\citealt{coelho} synthetic spectra).\nWe adopted a middle value for the ratio of the $V$\nluminosities ($0.55\\pm0.02$) as a loose constraint on the effects\nthat component A's light has on reducing the measured depths of the\neclipses, but the ratio was allowed to vary.\n\n\\begin{figure}[htbp]\n\\centerline{\\includegraphics [width=0.55\\textwidth]{fig2}}\n\\caption{{\\it Top panel:} Raw RVs for WOCS 24009 phased to the orbital\n  period. Model curves for the two stars are shown with solid and\n  dotted lines.  {\\it Middle panel:} RVs with corrections for binary\n  center of mass motion and for light travel time effects on the true\n  orbital phase.  {\\it Bottom panel:} Corrected $O-C$ diagram for the\n  eclipsing binary components. For all panels, open circles are\n  observations of the brighter eclipsing star and filled circles are for the fainter star.\n  \\label{rv}}\n\\end{figure}\n\nFor spectra of the WOCS 40007 system, we were able to improve the precision of\nthe measurements presented by \\citet{jeffries13}, and also make use of some\nspectra in which the lines of the eclipsing stars were fairly strongly\nblended. This allowed us to measure RVs near eclipse phases, but\nmore importantly, it gave us new measurements of the center-of-mass velocity\nfor the eclipsing binary that could be used to better determine the orbit of\nthe faint non-eclipsing star (component C) in the system. Lines of component C could not be\nidentified, so we decomposed the spectra into two\ncomponents. Of the 40 available spectra, 34 were centered on the Mg b triplet,\n4 covered 5460 to 5730 \\AA, and two covered 6233 to 6227 \\AA. There was not\nenough phase coverage to apply the disentangling method to the two smaller\ngroups of spectra, but there was only one spectrum (in the red group) for\nwhich the broadening functions overlapped too strongly to separate.\n\n\\noindent\n\\begin{figure}[!h]\n\\centerline{\\includegraphics [width=0.55\\textwidth]{fig3}}\n\\caption{RVs for WOCS 40007 phased to the orbital period. In the\n  middle panel, center-of-mass motion and light travel time\n  corrections are applied to the RVs and phases as in Fig. \\ref{rv}. For all\n  panels, open circles are observations of the brighter eclipsing star and filled circles are\n  for the fainter star.\n  \\label{mj_rv}}\n\\end{figure}\nTable \\ref{rvtab} presents the measured RVs for both systems and\nFigures \\ref{rv} and \\ref{mj_rv} show the phased RVs for WOCS\n24009 and WOCS 40007, respectively, plotted over the binary orbits.\n\n\\subsubsection{Photometric Temperatures}\\label{temps}\n\nWe derived temperature estimates for the stars from the $BV$ photometry of\n\\citet{kalirai01} and the $VI_C$ photometry of \\citet{yang}. These datasets\nwere selected based on their high signal-to-noise observations. Comparisons with our own\nphotometry indicated that the $B-V$ and $V-I_C$ colors in these datasets match\nour own calibration within about 0.005 mag even though the differences in\nindividual wavelength bands were considerably larger. Therefore, we are\nreasonably certain that the color zeropoints are reliable. After correcting\nthe colors for differential reddening using the reddening map of\n\\citet{platais13} and a mean cluster reddening [$E(B-V)=0.16\\pm0.007$;\n\\citealt{att}]\\footnote{We re-examined our earlier estimation of the cluster\n  reddening from clump stars \\citep{jeffries13} in light of the critique of\n  recent measurements by \\citet{att}. We applied differential reddening\n  corrections to our clump stars, and found that this did not change the\n  derived reddening. However, the corrections we made to account for\n  metallicity-dependent effects on the luminosities of the clump giants in NGC 6819 relative to those in M67 are\n  wavelength dependent, and modifying those result in a significant\n  change. If we assume that the difference in [Fe/H] between NGC 6819 and M67 goes from $+0.09$ (with NGC\n  6819 more metal rich) to 0, our derived reddening goes from $E(B-V)=0.12$ to\n  0.15. While this is not proof that the larger value is correct, it does\n  show that the different estimations of reddening may be consistent. If the metallicity\n  difference between M67 and NGC 6819 is established to be closer to 0, the\n  higher reddening value should be preferred.},\nwe applied the color-temperature relations of \\citet{casa} and\naveraged the temperatures derived from the $B-V$ and $V-I_C$\ncolors. The estimates from the two colors for each star generally\nagreed well with each other, although the temperatures derived from $B-V$ were about 100\nK hotter on average. If we assume that [Fe/H] is subsolar, the two estimates\ncome into better agreement.\n\n\\begin{deluxetable*}{lcccccc}[!htb]\n\\tablewidth{0pt}\n\\tablecaption{Measured Parameters for Stars in NGC 6819\\label{summary}}\n\\tablehead{\n\\colhead{Star ID} & \\colhead{$V$\\tablenotemark{a}} & \\colhead{$B-V$\\tablenotemark{a}} & \\colhead{$T_{\\rm eff}$ (K)} & \\colhead{$M / M_\\sun$} & \\colhead{$R / R_\\sun$} & \\colhead{$(m-M)_V$} }\n\\startdata\n\nWOCS 23009 A & 15.130 & 0.632 & 6315 & $1.464 \\pm 0.011$\\tablenotemark{b} & $2.149 \\pm 0.009$ & $12.39\\pm0.07$\\\\\n\nWOCS 40007 A & 16.111 & 0.642 & 6350 & $1.218 \\pm 0.008$ & $1.367 \\pm 0.003$ & $12.40\\pm0.08$ \\\\% updated with 3rd light run - tertiary corrected\nWOCS 40007 B & 16.949 & 0.692 & 5900 & $1.068 \\pm 0.007$ & $1.090 \\pm  0.002$ & $12.40\\pm0.08$ \\\\\nWOCS 24009   & 15.214 & 0.661 & & & \\\\\nWOCS 24009 A & 15.743 & 0.589 & & $1.251\\pm0.057$ & & \\\\\nWOCS 24009 B & 16.835 & 0.721 & 5925 & $1.090\\pm0.010$ & $1.095\\pm0.007$ & $12.37\\pm0.07$\\\\\nWOCS 24009 C & 16.965 & 0.744 & 5855 & $1.075\\pm0.013$ & $1.057\\pm0.008$ & $12.37\\pm0.07$\n\\enddata\n\\tablenotetext{a}{The quoted photometry is from \\citet{kalirai01}, but has not been corrected for zeropoint differences in calibration or for differential reddening.}\n\\tablenotetext{b}{Based on a photometry-based extrapolation from other eclipsing stars in the cluster.}\n\\end{deluxetable*}\n\nThe temperatures are given in Table \\ref{summary}. \nThe stars fall into two groups with similar temperatures. The brightest star in \nWOCS 23009 \\citep[hereafter WOCS 23009 A;][]{sandquist13}\nand the brightest star in the eclipsing binary WOCS 40007 (hereafter WOCS 40007 A)\nare on opposite sides of the turnoff with similar colors but\nquite different luminosities. The stars WOCS 24009 B and C and probably WOCS 40007 B \nare also quite similar to each other due to their nearly identical masses.\\\\\n\n\\section{Analysis}\n\n\\subsection{Cluster Membership}\\label{memb}\n\nThe information extracted from models of WOCS 24009 will only be of\nuse for assessing the properties of NGC 6819 if WOCS 24009 is a member\nof the cluster. There are three ways in which cluster membership can\nbe examined.  First, the most restrictive evidence for cluster\nmembership comes from proper-motion measurements \\citep{platais13}.\nThe proper motions are derived from a combination of old\nphotographic plates with CCD observations obtained from the 3.6 m\nCanada-France-Hawaii Telescope (CFHT).\nFor WOCS 24009 \\citep[star 592928 in][]{platais13},\nthe formal uncertainty of proper motion in either axis is\nslightly less than 0.2 mas~yr$^{-1}$ and the star's offset proper motion from\nthe cluster mean motion is also $\\sim $0.2 mas~yr$^{-1}$. These parameters\nyield an astrometric membership probability of 99\\%. \nWe can also compare the systemic radial velocity to those measured for\nother stars in the field to determine membership. \\citet{milliman} have done an extensive radial\nvelocity survey of stars in the NGC 6819 field, and they use\none-dimensional Gaussian fits to the field $F_{f}(v)$ and cluster\n$F_{c}(v)$ velocity distributions to compute a membership probability:\n", "index": 3, "text": "\n\\[ p(v) = \\frac{F_{c}(v)}{F_{f}(v)+F_{c}(v)} \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"p(v)=\\frac{F_{c}(v)}{F_{f}(v)+F_{c}(v)}\" display=\"block\"><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mi>F</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><msub><mi>F</mi><mi>f</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>F</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow></math>", "type": "latex"}]