[{"file": "1601.01046.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 54025, "prevtext": "\n\\vspace*{-0.5in}\n\\thispagestyle{empty}\n\n\\vspace{0.5in}\n\\begin{center}\n\\begin{LARGE}\n{\\bf Status Report:\\\\\nSearching for a Sterile Neutrino at J-PARC MLF (E56, JSNS$^2$)\\\\}\n\\vspace{5mm}\n\\end{LARGE}\n\\begin{large}\n\\today\\\\\n\\end{large}\n\\vspace{5mm}\n{\\large\nM.~Harada, S.~Hasegawa, Y.~Kasugai, S.~Meigo,  K.~Sakai, \\\\\nS.~Sakamoto, K.~Suzuya \\\\\n{\\it JAEA, Tokai, JAPAN}\\\\\n\\vspace{2.8mm}\nE.~Iwai, T.~Maruyama\\footnote{{Spokesperson: \n(takasumi.maruyama@kek.jp) }}, \nS.~Monjushiro, K.~Nishikawa, M.~Taira\\\\\n{\\it KEK, Tsukuba, JAPAN}\\\\\n\\vspace{2.8mm}\nM.~Niiyama\\\\\n{\\it Department of Physics, Kyoto University, JAPAN}\\\\\n\\vspace{2.8mm}\nS.~Ajimura, T.~Hiraiwa, T.~Nakano, M.~Nomachi, T.~Shima\\\\\n{\\it RCNP, Osaka University, JAPAN}\\\\\n\\vspace{2.8mm}\nT.~J.~C.~Bezerra, E.~Chauveau, H.~Furuta, F.~Suekane\\\\\n{\\it Research Center for Neutrino Science, Tohoku University, JAPAN}\\\\\n\\vspace{2.8mm}\nI.~Stancu\\\\\n{\\it University of Alabama, Tuscaloosa, AL 35487, USA}\\\\\n\\vspace{2.8mm}\nM.~Yeh\\\\\n{\\it Brookhaven National Laboratory, Upton, NY 11973-5000, USA}\\\\\n\\vspace{2.8mm}\nW.~Toki\\\\\n{\\it Colorado State University, Fort Collins, Colorado, USA}\\\\\n\\vspace{2.8mm}\nH.~Ray\\\\\n{\\it University of Florida, Gainesville, FL 32611, USA}\\\\\n\\vspace{2.8mm}\nG.~T.~Garvey, C.~Mauger, W.~C.~Louis, G.~B.~Mills, R.~Van~de~Water\\\\\n{\\it Los Alamos National Laboratory, Los Alamos, NM 87545, USA}\\\\\n\\vspace{2.8mm}\nJ.~Spitz\\\\\n{\\it University of Michigan, Ann Arbor, MI 48109, USA}\n}\n\\end{center}\n\n\\large\n\\normalsize\n\n\\setlength{\\baselineskip}{5mm}\n\\setlength{\\intextsep}{5mm}\n\n\n\\newpage\n\n\\tableofcontents\n\\vspace*{0.5in}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\indent\n\n\\section{Introduction}\n\\indent\n\nThe JSNS$^2$ (J-PARC E56) experiment aims to search for sterile neutrinos at the\nJ-PARC Materials and Life Sciences Experimental Facility (MLF).\nAfter the submission of a proposal~\\cite{CITE:PROPOSAL} to the J-PARC PAC, stage-1 approval was granted to the JSNS$^2$ experiment.\nThe approval followed a series of background measurements which were performed in 2014~\\cite{CITE:SR_14NOV}.\n\nSubsequent for stage-1 approval, the JSNS$^2$ collaboration has made continuous efforts to\nwrite a Technical Design Report (TDR).\nThis TDR will include two major items as discussed in the previous\nstatus report for the 20th J-PARC PAC~\\cite{CITE:20PAC}:\n\\begin{itemize}\n\\item A realistic detector location\n\\item Well understood and realistic detector performance using simulation studies, primarily in consideration of fast neutron rejection.\n\\end{itemize}\nSince August we have been in discussions with MLF staff regarding an appropriate detector location.  We are also in the process of\nsetting up a Monte Carlo (MC) simulation framework\nin order to study detector's\nperformance in realistic conditions. In addition, we have pursued hardware R$\\&$D work for the liquid scintillator (LS)\nand to improve the dynamic range of the 10'' photomultiplier tubes (PMTs).\nThe LS R$\\&$D works includes Cherenkov studies inside the LS, and a Pulse Shape\nDiscrimination (PSD) study with a test-beam, performed at Tohoku\nUniversity. \nWe also estimate the PSD performance of a full-sized detector using a detailed\nMC simulation.\n\nIn this status report, we describe progress on this work.\n\n\\section{Discussion for the detector location with MLF}\n\\indent\n\nTo maximize sterile neutrino sensitivity in the region of interest, it is optimal to put the\nJSNS$^2$ detectors (Fig.~\\ref{Fig:JSNS2det}) 24~meters from the MLF mercury target, as reported in\nRef.~\\cite{CITE:SR_14NOV}.\nThis position is located in the ``large component handling room'',\nthe room to handle large equipment of the MLF, \non the third floor in the MLF building (Fig.~\\ref{JSNS2candidate}).\nThe room is not a common experimental area, but  \nis considered a maintenance work area for MLF operations.\nTherefore, in order to carry out the JSNS$^2$ experiment, we need to discuss and understand the issues associated with this detector location.\nIn addition, it is important to clarify the application of safety regulations for the\nJSNS$^2$ detectors, which contains more than 100~tons of liquid\nscintillator.\n\n\\begin{figure}\n\\begin{center}\n  \n\\includegraphics[width=10cm]{detector_1.jpg}\n\\caption{A schematic of a JSNS$^2$ detector}\n\\label{Fig:JSNS2det}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n  \n\\includegraphics[width=9cm]{MLF_E56_24m.png}\n\\caption{Candidate site for JSNS$^2$ detectors}\n\\label{JSNS2candidate}\n\\end{center}\n\\end{figure}\n\nIn August, 2015, the JSNS$^2$ collaboration requested the KEK IPNS director / the director of J-PARC center\nfacilitate discussions between MLF and JSNS$^2$, to address these issues in detail.  Since that time we have held several\nmeetings with directors, MLF, and the local fire department.\n\nIn the discussion, there are no show-stoppers that inhibit the JSNS$^2$\nexperiment. \nThe JSNS$^2$ collaboration will try to realize the experiment with further\ndiscussions in detail in the TDR.\n\n\\section{R$\\&$D for the JSNS$^2$ Detector}\n\n\\subsection{Cherenkov study with LAB+0.03g b-PBD}\n\\indent\n\nAs described in the previous status report~\\cite{CITE:20PAC}, we verified \nthe performance of the liquid scintillator used in the\nLSND experiment, mineral oil plus 0.03~g/L b-PBD.\n\nIn this status report we investigate the performance of LAB + 0.03g/L b-PBD\nliquid scintillator since we plan to use the LAB in the JSNS$^{2}$ experiment.\nWe use the LSND 0.03~g/L b-PBD as a reference point for the LAB performance\nchecks. The amount\nof secondary light emission materials such as b-PBD or PPO determine\nthe light yield, and the type of material determines the light\nemission time, in addition to the LAB properties.\n\n\\subsubsection{Setup of the Measurement}\n\\indent\n\nThe setup and the data analysis of the measurement is exactly the same as that\nin the previous status report~\\cite{CITE:20PAC} (Fig.~\\ref{FIG:SETUPCS}).\nThe cylindrical prototype is filled with the liquid scintillator, and a black\nsheet is used to avoid reflections of light inside the cylinder.\nThe motivation of this experiment is to mainly measure the timing difference \nbetween Cherenkov light and scintillation light. In general, the Cherenkov light \nhas a faster emission time than that of the scintillation light. \n\n\\begin{figure}[htbp]\n\\centering\n\\subfigure[Setup for Cherenkov + scintillation]{\n\\includegraphics[width=0.45\\textwidth,angle=0]{setup4.jpg}\n}\n\\subfigure[Setup for scintillation light only]{\n\\includegraphics[width=0.44\\textwidth,angle=0]{setup5.jpg}\n}\n\\caption{\\setlength{\\baselineskip}{4mm}\nA schematic diagrams of the test setups. (a) shows the setup for the Cherenkov\nplus scintillation detection and (b) shows the setup for the scintillation \nlight only detection. The cylindrical prototype with \na size of 130~mm (diameter) $\\times$ 1000~mm (height) is filled with the liquid\nscintillator with LAB plus 0.03~g/L b-PBD (blue regions in the schematics).\nScintillation counters, which are shown as red boxes, \nare used to tag cosmic ray muons. Coincidence signals by the scintillation \ncounters are used as the reference timing for the Cherenkov and scintillation \nlight inside the cylinder.\nThe effective area for each scintillator\nis 5 $\\times$ 10~cm$^2$. The average muon path distance from the 2~inch PMT\nwas kept as 65~cm to make the amount of scintillation light the same in both settings.\n} \\\n\\label{FIG:SETUPCS}\n\\end{figure}\n\n\n\\subsubsection{Data Analysis and Results}\n\\subsubsection*{Hit definition}\n\\indent\n\nFigure~\\ref{Fig:raw_timing} shows a set of typical waveform timing distributions\nmeasured by a digital oscilloscope. We used the oscilloscope data for this\nanalysis.\nThe top plot shows typical timing distributions of the coincidence from \nthe scintillation counters, and the middle and bottom plots show typical\nscintillation light signals, which corresponds to the signals with the setup of\nFig.~\\ref{FIG:SETUPCS}(b). For the explanation of the analysis, only the\ntypical signals in Fig.~\\ref{FIG:SETUPCS}(b) are described here.\nNote that the coincidence signal from the scintillation counters was \ndelayed due to electronics. Also, this relative timing was smeared by the \nPMT's jitter ($\\sim$1 ns), electronics (within 1 ns), and hit position of the\ncosmic rays ($<<$ ns). The fastest scintillation light or Cherenkov light should\nbe located around 24980~time counts. This was demonstrated by\nusing a Water Cherenkov setup~\\cite{CITE:20PAC}.\n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.6 \\textwidth]{typical_signal.jpg}\n\\caption{\\setlength{\\baselineskip}{4mm}\nTypical timing distributions of the coincidence from the scintillation counters (top) and scintillation light (middle and bottom) measured by the oscilloscope. The horizontal axes corresponds to the time. One count is 2~ns. The vertical axes of the plots is the pulse height counts. 1000~counts corresponds to 1~mV in the bottom plot for this case.\n}\n \\label{Fig:raw_timing}\n\\end{figure}\n\nAs shown in Fig.~\\ref{Fig:raw_timing}, there is a threshold to determine the\ntiming of the ``hit'', which is 2000~counts ($\\sim$ 1/3~p.e.) in the data.\nIn the figure, thresholds correspond to the green lines, and the red arrows\nshow the recognized hits above the thresholds. These typical signals have multiple hits.\n\n\\subsubsection*{\\setlength{\\baselineskip}{4mm}\nResults: Comparison between scintillation only and Cherenkov+scintillation light}\n\\indent\n\nFigure~\\ref{Fig:timing} shows the relative timing of hits\nwith respect to the coincidence defined by the thresholds, and also shows \nthe timing comparison between scintillation light only (cross) and Cherenkov +\nscintillation light (histogram).\nAs clearly seen, Cherenkov light is concentrated in\nthe fast timing peak. If we select the fastest timing in the first 2~ns bin, the\n$\\sim$ 95$\\%$ of scintillation light is rejected from Cherenkov light\nwhile only $\\sim$25$\\%$ of scintillation light is contaminated into the\nCherenkov light.\n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.6 \\textwidth]{results.jpg}\n\\caption{\\setlength{\\baselineskip}{4mm}\nTiming comparison between scintillation light only (cross) and Cherenkov + scintillation light (histogram). Cherenkov light is concentrated in the fast timing region.}\n \\label{Fig:timing}\n\\end{figure}\n\nAn estimated light yield is $\\sim$1600~photons/MeV. Compared to the\n$\\sim$9000~photons/MeV measured by Daya Bay experiment~\\cite{CITE:DayaBayLS},\na dilution factor, which is defined as the ratio between the light yield of\nthe nominal scintillator and that of the scintillator with small amount of\nthe secondary light emission materials, is 5.3.\n\n\\subsubsection{Simulation of the Measurement}\n\\indent\n\nWe also evaluated the results using a simulation to understand the optical properties of the medium.\nThe software will be described later in Section~\\ref{SEC:SW}.\nFigure~\\ref{fig_timing} shows the timing distribution of single photoelectrons\nobtained with the Monte Carlo simulation before parameter tuning.\nWe will continue to study the measurement results to tune the optical parameters precisely.\n\n\\begin{figure}[hbtp]\n\t\\begin{center}\n\t\t\\includegraphics[scale=0.6]{timing.pdf}\n\t\t\\caption{\\setlength{\\baselineskip}{4mm} Timing distribution of single photoelectrons for scintillation+Cherenkov light (black) and scintillation light only (red), obtained with a MC simulation.}\n\t\t\\label{fig_timing}\n\t\\end{center}\n\\end{figure}\n\n\\subsubsection{\\setlength{\\baselineskip}{4mm}\nResults; Comparison between Mineral Oil and LAB}\n\\indent\n\nFinally, we compare the results of this study between mineral oil and LAB (Fig.~\\ref{Fig:MOvsLAB}).\nThe following observations have been made: (A) Emission time of scintillation light\nwith LAB+0.03~g/L b-PBD is\nwider than that in the mineral oil+0.03~g/L b-PBD. (B) Light yield in the \nLAB+0.03~g/L b-PBD is higher than that in the mineral oil+0.03~g/L b-PBD case\nby a factor of six. (C) The yield of the Cherenkov light is the same in the two\nliquid scintillators within 10$\\%$. \n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.8 \\textwidth]{MOvsLAB.jpg}\n\\caption{\\setlength{\\baselineskip}{4mm}\nTiming comparison between LAB and mineral oil. Cherenkov + scintillator (Left) and Scintillator only (Right).}\n \\label{Fig:MOvsLAB}\n\\end{figure}\n\n\\subsection{Study of PSD capability with JSNS$^{2}$ detector}\n\\label{SEC:PSD}\n\\indent\n\nAs presented in the previous status report for the PAC~\\cite{CITE:20PAC}, there are indications that the\nDaya Bay type of Gd-loaded liquid scintillator (DBLS) produces a strong PSD capability in the several MeV\nrange. The PSD capability is crucial in rejecting cosmic induced fast neutrons by a factor of 100, and\nalso important for keeping the neutrino detection efficiency as high as possible.\nHowever, the measurements were done with a small vial detector and a less than 10~MeV source ($^{252}$Cf\nneutron source). Therefore, it is important to show the feasibility in the actual energy range and full\nJSNS$^2$ detector size. In order to demonstrate the PSD capability of the DBLS, a measurement using a 70~MeV\nneutron beam created by a cyclotron in the Cyclotron and Radioisotope Center (CYRIC) at Tohoku University\nwas performed in October 2015. The current status of the MC study and first look plots of the neutron\nbeam measurement are shown in this section.\nAnother effort to evaluate the PSD capability with the real size detector was made using a realistic MC\nsimulation. The PSD parameters were extracted from the vial test, and they were extrapolated to a real\nsize detector. The results of this study are shown in the following sections.\n\n\\subsubsection{\\setlength{\\baselineskip}{4mm}\n  MC study of PSD capability of the DBLS with a full size JSNS$^2$ detector}\n\\indent\n\nThe PSD capability of the DBLS with a full size detector was calculated with a MC simulation based\non Geant4~\\cite{geant4}. Each PSD related parameter (scintillation light yield, the light emission\ntime, Birks constant, etc.) of the DBLS was tuned by using measured data\nwith a 100~mL cylindrical vial with an attached 2~inch PMT.\n\nFigure~\\ref{FIG:CsSetup} shows the setup for the measurement of light yield of the DBLS.\nTo detect backscattering events which gamma rays are emitted from a $^{137}$Cs source\nand detected by the NaI detector via the Compton scatter in the DBLS detector,\nthe $^{137}$Cs source is set between the DBLS\nand the NaI detectors as shown in Fig.~\\ref{FIG:CsSetup}.  This setup allows us to detect\nonly Compton edge events with scattered angle of 180 degrees. The coincidence signal\nfrom the DBLS and the NaI detectors is used as the trigger. The data are taken with a flash ADC\nmodule (CAEN V1730, 500~MS/s, 14~bits).\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=14cm]{CsSetup.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\nSetup for measurement of light yield of the DBLS.}\n\\label{FIG:CsSetup}\n\\end{center}\n\\end{figure}\nThe black line in Fig.~\\ref{FIG:Cs} shows the number of photoelectrons of the backscattering events.\nComparing the peak of liquid scintillator of KamLAND experiment, with known light yield\n(8300~photons/MeV~\\cite{CITE:KamLAND}), the relative light yield of the DBLS can be measured.\nThus, the light yield is estimated as $\\sim$10000~photons/MeV, compared to the $\\sim$9000~photons/MeV\nmeasured by Daya Bay experiment~\\cite{CITE:DayaBayLS}.  \nThe red line in Fig.~\\ref{FIG:Cs} shows the MC distribution after implementing the measured light yield.\n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=10cm]{Cs.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Peaks of the detected number of photoelectrons of the backscattering gamma events from the\n  $^{137}$Cs source in the DBLS. The black and red lines show data and MC, respectively.}\n\\label{FIG:Cs}\n\\end{center}\n\\end{figure}\n\nThe black lines in Fig.~\\ref{FIG:WFAmBe} show the measured mean waveforms of gammas (left plot)\nand neutrons (right plot) from the $^{241}$Am$^{9}$Be source with the vial. The time constants\nof the scintillation light emission in the MC simulation were calculated by fitting the mean\nwaveform data by the expectation, summing 3 exponentials in consideration of the mean waveform\nof one photoelectron and TTS of the 2~inch PMT. Table~\\ref{TAB:TAmBe} shows each parameter\nof the fit result, and filled areas in Fig.~\\ref{FIG:WFAmBe} show the expected waveform\nof each time constant of the fit result.     \n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=16cm]{WFAmBe.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Timing distributions of the events from $^{241}$Am$^{9}$Be source in the DBLS.\n  The black and red lines show data and MC, respectively. Left: gamma, Right: neutrons.}\n\\label{FIG:WFAmBe}\n\\end{center}\n\\end{figure}\n \n\\begin{table}[htb]\n\\caption{Time constants of the scintillation light emission of the DBLS.}\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|} \\hline\nComponent&time constant&ratio (gamma)&ratio (neutron)\\\\\\hline\nExp1&3.87ns&0.673&0.580\\\\\\hline\nExp2&17.6ns&0.187&0.219\\\\\\hline\nExp3&148.3ns&0.140&0.200\\\\\\hline\n\n\\end{tabular}\n\\end{center}\n\\label{TAB:TAmBe}\n\\end{table}\n\nFigure~\\ref{FIG:2DPSDAmBe} shows the TailQ/TotalQ variable, whose definition is the same as the\nprevious PAC report~\\cite{CITE:20PAC}, as a function of the detected number of photoelectrons for the DBLS. The left plot shows data with the $^{241}$Am$^{9}$Be source, including background\nsuch as environmental gammas in particular, and the right plot shows the MC with only\nthe $^{241}$Am$^{9}$Be source. Although there is a discrepancy due to the environmental\ngammas in the range below $\\sim$ 600 photoelectrons, the MC reproduces the data well in the\nhigh photoelectron range. Figure~\\ref{FIG:1DPSDAmBe} shows the TailQ/TotalQ distributions\nof events between 1000 and 2000~photoelectrons. Both the gamma and neutron data are well reproduced by the MC.\n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=16cm]{2DPSDAmBe.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Correlations between the TailQ/TotalQ variable, the definition of which is the same as previous PAC\n  report, and the detected number of photoelectrons for the DBLS. The left plot shows data with\n  the $^{241}$Am$^{9}$Be source, including backgrounds such as environmental gammas, and the right plot\n  shows the MC with only the $^{241}$Am$^{9}$Be source.}\n\\label{FIG:2DPSDAmBe}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=10cm]{1DPSDAmBe.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\nThe TailQ/TotalQ distributions of the DBLS. The red and blue show gammas and neutrons, respectively. Lines and filled areas show data and the MC, respectively.}\n\\label{FIG:1DPSDAmBe}\n\\end{center}\n\\end{figure}\n\nUsing the MC simulation with the tuned parameters mentioned above, the PSD capability of the DBLS with\nthe realistic JSNS$^{2}$ detector was evaluated. To check the PSD capability in the several tens of MeV\nrange of the prompt signals, electrons and neutrons with various energies between 10 and 50~MeV were\ngenerated at the JSNS$^{2}$ detector center. The upper figures in Fig.~\\ref{FIG:PSDJSNS} show the\nmeans of the TailQ/TotalQ distributions as a function of the detected number of photoelectrons for the\nelectrons (left) and neutron-induced proton recoils (right). The lower plots show the RMS. The blue and\nblack markers show the data and MC of the vial measurement with $^{241}$Am$^{9}$Be source, respectively,\nand the red lines show MC results with the JSNS$^{2}$ detector.\nThe vial measurement data are well reproduced by the MC in all plots, and extrapolation curves of the MC\nwith the JSNS$^{2}$ detector (red lines) from the lower photoelectron range of the vial measurement looks\nreasonable, except for the case of RMS of protons recoiled from neutrons (bottom right plot).\nThe MC with the JSNS$^{2}$ detector is working well. The reason of the discrepancy of the RMS curve\nof the recoiled protons is likely due to a geometrical effect; an investigation into this\ndiscrepancy is on-going.\n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=16cm]{PSDJSNS.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Correlations between peak means of the TailQ/TotalQ distributions and the detected number of photoelectrons\n  due to electrons (left) and neutron-induced proton recoils (right). The lower plots show the peak RMS.\n  The blue and black markers show the vial measurement data and MC with the $^{241}$Am$^{9}$Be source,\n  respectively, and the red lines show MC results with the JSNS$^{2}$ detector.}\n\\label{FIG:PSDJSNS}\n\\end{center}\n\\end{figure}\n\nThe left plot in Fig.~\\ref{FIG:PSDJSNSNu} shows MC results of the correlations between means of the\nTailQ/TotalQ distributions and the detected number of photoelectrons due to 100\\% oscillated neutrino\nsignals (red) and protons from cosmic induced fast neutron interactions (blue) generated using the\nsame method as the proposal for JSNS$^{2}$~\\cite{CITE:PROPOSAL}. The right plot shows\nthe TailQ/TotalQ distributions of the neutrinos and protons after applying a simplified\nneutrino selection criteria (20 $\\le$ E$_{prompt}$ $\\le$ 60 MeV, 5 $\\le$ E$_{delayed}$ $\\le$ 12 MeV,\n0 $\\le$ $\\Delta$t $\\le$ 100 $\\mu$sec, multiplicity of thermal neutron capture = 1). The red and blue\ncolors in Fig.~\\ref{FIG:PSDJSNSNu} show the neutrinos and recoiled protons, respectively.\nThe plot shows good separation between the neutrinos and recoiled protons, due to neutron-proton\nelastic scattering. However, there is a possibility to include inelastic scattering or spallation\nwith gammas between the neutrons and $^{12}$C in the scintillator. If there are such events with gammas,\nthe neutron rejection power becomes worse compared to the MC result which includes only recoiled protons.\nThus, it is important to check the PSD capability in the events with gammas caused by neutrons\nof several tens of MeV.   \n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=16cm]{PSDJSNSNu.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Correlations between peak means of the TailQ/TotalQ distributions and the detected number of photoelectrons\n  due to the 100\\% oscillated neutrinos and protons recoiled by the cosmic induced fast neurons (left plot).\n  The right plot shows the TailQ/TotalQ distributions after applying the neutrino selection criteria. The\n  red and blue show the neutrinos and the recoiled protons, respectively.}\n\\label{FIG:PSDJSNSNu}\n\\end{center}\n\\end{figure}\n\n\\subsubsection{PSD capability with test-beam}\n\\indent\n\nTo check the PSD capability in the prompt energy range and the inelastic or spallation events between\nthe cosmic induced fast neutron and $^{12}$C in the scintillator, a measurement with a neutron beam of\n70 MeV was carried out in CYRIC in Tohoku University. \nCYRIC has a high-intensity fast neutron facility~\\cite{CITE:CYRIC32}. A proton beam provided by the\nAVF cyclotron hits a Li target, producing the quasi-monoenergetic neutron beam from 14 to 80 MeV\nvia the $^{7}$Li(p,n)$^{7}$Be reaction. Figure~\\ref{FIG:CYRIC32} shows a schematic layout of the\nfast neutron beam facility. The DBLS with the 100~mL vial with an attached 2~inch PMT is set on the\nbeam axis at the facility. Two cylindrical NaI counters (2\" (diameter)$\\times$ 2\" (height) and 3\" (diameter) $\\times$ 3\" (height)) were also set\non both sides of the DBLS for checking the events following gammas due to the inelastic or spallation\nreaction of $^{12}$C. \n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=14cm]{CYRIC32.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\nSchematic layout of the fast neutron beam facility.}\n\\label{FIG:CYRIC32}\n\\end{center}\n\\end{figure}\n\nFigure~\\ref{FIG:BeamPSD} shows a first look plot of the correlation between the TailQ/TotalQ variable and\nthe detected number of photoelectrons of the DBLS. The band due to the neutron events can be confirmed\nin the higher TailQ/TotalQ range.  The detailed analysis is ongoing;\nresults will be presented in the next PAC report.    \n\n\\begin{figure}[htbp]\n\\begin{center}\n\\includegraphics[width=10cm]{BeamPSD.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\nThe correlation between the TailQ/TotalQ variable and visible energy of the DBLS.}\n\\label{FIG:BeamPSD}\n\\end{center}\n\\end{figure}\n\n\\subsection{Dynamic range of the PMT}\n\\indent\n\nJSNS$^2$ is planning to use 150 10-inch photomultiplier tubes (PMTs).\nA candidate PMT is R7081 of Hamamatsu Photonics, which is used in the Double Chooz and RENO\nreactor $\\theta_{13}$ experiments. \n The main difference of JSNS$^2$ from Double Chooz or RENO is the light yield. \n For the case of JSNS$^2$, the maximum neutrino energy is $53$~MeV, 10 times higher than that of\n typical reactor neutrinos. \n The liquid scintillator is contained in an acrylic vessel and \n the PMTs will be submerged in non-Gd loaded scintillator outside the acrylic\n vessel.\n If a neutrino signal happens in the liquid scintillator just in front of a PMT, the PMT shall\n receive scintillation light as high as $\\sim$ 1,000~p.e.\n equivalent.\n On the other hand, the lowest signal energy to detect is a few MeV and if such event happens far\n from a PMT, the PMT shall receive 1 p.e. or less. \n Since JSNS$^2$ will perform the spectrum analysis of the neutrino signal to separate the\n intrinsic $\\bar{\\nu}_e$ background from $\\mu^-$ decay at rest, the PMT must have a\n linear dynamic range from 1~p.e. to $\\sim$1,000~p.e. \n \nTo obtain such large dynamic range, we will use a tapered base circuit as shown in Fig.~\\ref{fig:BaseCircuit}. \n \\begin{figure}[htbp]\n  \\begin{center}\n    \\includegraphics[keepaspectratio=true,width=140mm]\n    {BaseCircuit.pdf}\n    \\caption{The diagram of the tapered circuit.  }\n    \\label{fig:BaseCircuit}\n    \\end{center}\n\\end{figure}\nThe voltage bias between dynodes is set higher for latter dynodes to reduce the space charge effect. \nThe linearity of the gain was measured by using 7~liter liquid scintillator and 8~inch PMT as shown in\nFig.~\\ref{fig:TestEquip}. \n\n \\begin{figure}[htbp]\n  \\begin{center}\n    \\includegraphics[keepaspectratio=true,width=90mm]\n    {TestEquip.pdf}\n    \\caption{\\setlength{\\baselineskip}{4mm}\n      The set up for the gain measurement.\n    The dashed box shows the base socket which was swapped for regular and the tapered divider circuits.}\n    \\label{fig:TestEquip}\n    \\end{center}\n\\end{figure}\n For the test, the liquid scintillator was contained in an UV-transparent acrylic vessel that was readout by an 8~inch PMT.  \n Two base circuits, one as the regular divider and the other as the tapered divider, were prepared and the\n base sockets were swapped to compare the measurement results. \nA 500~MHz, 14bit flash ADC (CAEN V1730) was used to readout the pulse shape.  \n\nAt first, one p.e. peak was measured by using a triggered LED to obtain the absolute gain. \nThe gain of the PMT was set to $1.4\\times 10^{6}$ for a 1~p.e. signal.\nThe cosmic-ray signal was measured to obtain the large amplitude signals. \nA saturation effect was measured using the ratio of the output charge (Q) and pulse height (H),\nwhich is a good indicator of the non-linearity of the gain. \n\nFigures.~\\ref{fig:Measurement}(a) and (b) show the Q/H ratio which indicates \nthat, for the tapered circuit, the ratio is almost stable up to 1,000~p.e. while for the regular\ncircuit, the ratio changes from 300~p.e.\n \\begin{figure}[htbp]\n  \\begin{center}\n    \\includegraphics[keepaspectratio=true,width=140mm]\n    {Measurement.pdf}\n    \\caption{\\setlength{\\baselineskip}{4mm}\n      (a)\\&(c): Regular base circuit. (b)\\&(d): Tapered base circuit. (a)\\&(b): Q/H vs $N_{pe}$,\n      (c)\\&(d) Mean pulse shape.}\n    \\label{fig:Measurement}\n    \\end{center}\n\\end{figure}\n\n\nFigure~\\ref{fig:Measurement}, (c) and (d), shows how the pulse shape changes depending on the input charge. \nFor the PMT with the tapered base circuit, the shape does not change up to $\\sim$1,000~p.e., \nwhich is important for the $n/\\gamma$ pulse shape discrimination analysis. \n \n\n\\section{Software efforts to show the fast neutron rejection}\n\\label{SEC:SW}\n\\indent\n\nAt present, the most pressing issue in the JSNS$^2$ design is identifying and rejecting background fast\nneutron events when selecting signal neutrinos. Cosmic-induced neutrons, rather than beam-induced neutrons,\nare the primary concern. PSD and Cherenkov light can be used to differentiate the two classes of events.\nHowever, this rejection is strongly dependent on a number of variables, including: liquid scintillator\nproperties, photo-coverage, light detection technology, tank geometry, veto layer(s), electronics\nresponse, dynamic range, and timing resolution, among others. These JSNS$^2$ detector design considerations\nare studied, in part, with a dedicated simulation package based on Geant4~\\cite{geant4}.\nAn example event display is shown in Fig.~\\ref{fig:evdisp} along with the timing characteristics of the\nevent. The figure shows a simulated 50~MeV positron in the JSNS$^2$ cylindrical volume with the dilution\nfactor of 10 for scintillation light. The Cherenkov ring and scintillation light components can be\neasily seen. \n\n\\begin{figure}[h]\n\\begin{centering}\n\\includegraphics[height=4.8in]{eventdisplay.pdf} \n\\vspace{-.7cm}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Top: An event display featuring a simulated 50~MeV positron in the JSNS$^2$ cylindrical volume with the\n  dilution factor of 10 for scintillation light. Bottom: The timing characteristics of the event.\n  The Cherenkov and both the slow and fast scintillation contributions can be seen. }\n  \t\\label{fig:evdisp}\n\\end{centering}\n\\end{figure} \n\nThe simulation is tuned and validated using data taken in a number of test stands at KEK and Tohoku University.\nFor example, Fig.~\\ref{fig_timing} shows the results of the simulation as compared to the KEK test stand\n(Fig.~\\ref{Fig:timing}) in consideration of Cherenkov and scintillation light. Another aspect of the\nsimulation involves studying PSD for separating neutron-induced proton and nuclear recoil events\nfrom positron-like events. This discrimination is based on the shape of the waveform. Neutron-induced\nevent waveforms tend to have a larger tail and smaller peak amplitude than positron events. Data from the\ntest stand at Tohoku University (See Section~\\ref{SEC:PSD} for more details), featuring small volumes of\nliquid scintillator and a $^{241}$Am$^{9}$Be $\\gamma$ and neutron source,  are used to develop and tune a\nsimulation of the interactions inside liquid scintillator as well as the PMT and electronics response\nin simulating waveforms properly. Figure~\\ref{FIG:PSDJSNS} shows a Monte Carlo and data comparison for\nthe few-MeV gamma (electron) and neutrons. Also shown is the Monte Carlo expectation for the pulse shapes\nall the way up to 50~MeV, which is most relevant for JSNS$^2$. As can be seen, pulse shape discrimination\nbecomes more powerful for higher energy species.\n\nThe ability to differentiate neutron-induced events from positrons appears to be quite promising using both\nCherenkov-scintillation and pulse shape discrimination techniques. The software simulations continue to\nbe expanded in scope and tuned to existing data. The 70~MeV neutron beam test data with the Tokoku\nUniversity liquid scintillator volumes will allow the simulation to be further tuned and enhanced at\nenergies most representative for JSNS$^2$. \n\nReconstruction software work is also ongoing concurrently with the simulation efforts. The event vertex\ndetermination is based on a maximum likelihood algorithm using charge and time information. Both a point\nsource event and an extended distribution can be considered when forming the event likelihood. The\nreconstructed energy is determined based on the number of photoelectrons, timing, and the vertex\ndetermination from the likelihood algorithm above. Optimizing the reconstruction, which is highly\ndependent on (e.g) non-linearities, light sensor properties, and liquid scintillator properties,\ninvolves working closely with the simulation software as well.\n \n\n\n\\section{Summary and Plan}  \n\\indent\n\nThe JSNS$^2$ collaboration is making continuous progress to\nproduce a TDR.\n\nFor the detector location,\nthere were many intensive discussions between the MLF and the JSNS$^2$,\non the safety requirements for the treatment of more than 100~tons of liquid\nscintillator,\nthe interference between areas for the irradiated materials storage and\noperation of\nliquid scintillator, the weight load on the MLF building due to the detectors,\nleakage protection and the safety \nof the liquid scintillators, slow monitor and controls, ground sinkage of the\nMLF building due to the weight of the detectors, and procedures for bringing the\ndetectors outside of the building. This interim report will be presented to the PAC,\nand further investigation will be done to produce the TDR.\n\nJSNS$^2$ detector R$\\&$D has also made excellent progress.\nFor the rejection of fast neutron events \ntwo methods are under study. One is using Cherenkov light and the other is using PSD.\nFor the Cherenkov light technique, we checked the performance\nof the liquid scintillator made by LAB+0.03~g/L b-PBD. This liquid scintillator\nhas excellent properties compared to the liquid scintillator comprising mineral oil\nplus 0.03 g/L b-PBD, in consideration of the light emission time for distinguishing between\nCherenkov and scintillation light.\nFor the method using PSD, we employed a test-beam using beam fast neutrons at Tohoku University.\nThe analysis is on-going. \nThe dynamic range of the 10'' PMT was improved by more than three times due to\nthe change of a register chain of the PMT base circuit.\nThis improvement allows JSNS$^2$ to have \na good energy resolution up to $\\sim$ 50 MeV.\n\nIn order to transform this R$\\&$D information into the detector performance\nof the JSNS$^2$, a software framework has been set up using Geant4.\nThe data of the Cherenkov test using the prototype is reasonably\nreproduced by Geant4. The PSD performance for the neutron-proton elastic\nevents in the real size detector was estimated using the simulation. These are\nalso on-going efforts.\n\nIn summary, the continued JSNS$^2$ progress indicates the TDR will be produced on schedule,\nwithin about one year from now. \n\n\\section{Acknowledgements}\n\\indent\n\nWe warmly thank the MLF people, especially, Dr. Futakawa, J-PARC sub-director\nand Prof. Kanaya, MLF Division leader, \nthe neutron source group, muon group and the user facility group for their \nsupport.\nFor the discussion between the MLF and the JSNS$^2$ experiment, we appreciate\nthe help from Katsuo Tokushuku (KEK IPNS director), Naohito Saito\n(J-PARC director),\nTetsuro Ishii (J-PARC sub-director), Takashi Kobayashi (KEK IPNS sub-director)\nand the J-PARC safety Division in addition to the MLF people mentioned above\nto set up constructive discussions.\n\nFinally, we also acknowledge the support from grant-in-aid, J-PARC and KEK. \n\n\\newpage\n\\appendix\n\\section{Additional Physics Study under Consideration}\n\n\\subsection{Physics with neutrinos from charged kaon decay-at-rest}\n\\indent\n\nJSNS$^2$ has the unique ability to precisely measure monoenergetic 236~MeV neutrinos from charged kaon decay-at-rest ($K^+ \\rightarrow \\mu^+ \\nu_\\mu$; BR=63.5\\%~\\cite{pdg}) for the first time. These neutrinos represent (1) an unprecedented weak-interaction-only, known energy probe of the nucleus, (2) a standard candle for developing a thorough understanding of the neutrino interaction and cross sections critical for future long baseline neutrino experiments, and (3) a source for a sterile neutrino search using electron neutrino appearance~\\cite{kdar1,kdar2}. These neutrinos have also been cited as important for probing muon neutrino disappearance at short baseline~\\cite{kdar3} and as a possible dark matter annihilation signature~\\cite{kumar}. \n\nDespite the importance of the kaon decay-at-rest (KDAR) neutrino across multiple aspects of particle and nuclear physics, these neutrinos have never been studied or even identified before. The decay-in-flight neutrino ``background\" in conventional beamlines drowns out the KDAR signal in such experiments. Decay-at-rest sources of neutrinos, most notably spallation neutron sources, are excellent locations for studying KDAR due to their minimal decay-in-flight background and intense beams. However, the historically most intense spallation sources have been too low energy to produce kaons readily. The J-PARC MLF 3~GeV primary proton energy is sufficient to produce kaons efficiently and, also in consideration of the facility's beam intensity (eventually 1~MW, currently 500~kW~\\cite{mlf_news}), represents the best facility in the world to accomplish this physics. The KDAR neutrino can easily be seen in Fig.~\\ref{fig:sense}, which shows the neutrino flux at the J-PARC MLF source.  \n\nJSNS$^2$ expects to collect a sample of between 150,000 and 300,000 $\\nu_\\mu$ charged current events in 50~tons of fiducial volume in its 5 year run\\footnote{\n  \\setlength{\\baselineskip}{4mm} The large variation in the expected number of events is due to the highly uncertain kaon production at this energy. The lower and upper bounds come from Geant4~\\cite{geant4} and MARS~\\cite{mars} predictions, respectively.}. These events ($\\nu_\\mu n \\rightarrow \\mu^-  p$ or $\\nu_\\mu  \\mathrm{^{12}C} \\rightarrow \\mu^- X$) are easily identifiable due to the characteristic double coincident signal of the prompt muon plus proton(s)/nucleus followed by the muon decay electron ($\\mu^- \\rightarrow e^- \\overline{\\nu}_e \\nu_\\mu$) a few $\\mu s$ later. \n\n\\begin{figure}[htpb]\n\\centering\n\\begin{minipage}{.6\\linewidth}\n  \\includegraphics[width=\\linewidth]{flux.pdf}\n\\end{minipage}\n\\vspace{-.3cm}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  The neutrino flux at the J-PARC MLF source. The 236~MeV muon neutrino from charged kaon decay-at-rest can easily be seen.}\n\\label{fig:sense}\n\\end{figure}\n\n\nThe known energy KDAR neutrinos provide the exclusive tool, for the first time, to study nuclear structure and the axial vector component of the interaction using electron scattering variables such as $\\omega$ ($\\omega=E_\\nu-E_\\mu$). The importance of this unique access to the nucleus is potentially far-reaching. For example, a double differential cross section measurement in terms of $\\omega$ vs. $Q^2$ allows one to distinguish effects of the form factors, which depend only on $Q^2$, and of the nuclear model, which depends on both. Figure~\\ref{fig:kinematics1} (left) shows a number of model predictions for the differential cross section in terms of energy transfer for 300~MeV $\\nu_\\mu$ CC scattering on carbon. The disagreement between the models, in terms of both shape and normalization, is striking. Notably, the JSNS$^2$ muon energy resolution may allow the nuclear resonances, easily seen in Fig.~\\ref{fig:kinematics1} (right), to be measured via neutrino scattering. The KDAR neutrino is likely the only way to study these excitations with neutrino scattering and, in general, to validate/refute these models in the $<400$~MeV neutrino energy range (see, e.g., Ref.~\\cite{teppei}).\n\nAlong with studying nuclear physics relevant for future neutrino experiments, the large sample of KDAR muon neutrinos collected with JSNS$^2$ will provide a standard candle for understanding the neutrino energy reconstruction and outgoing lepton kinematics in the 100s-of-MeV neutrino energy region. While the KDAR neutrino is simply not relevant for experiments featuring significantly higher neutrino energies, most notably for MINOS, NOvA and DUNE~\\cite{minos,nova,dune}, it is highly relevant for experiments with a large or majority fraction of few-hundred-MeV neutrinos, for example, T2K~\\cite{t2knim}, MOMENT~\\cite{moment}, the European Spallation Source Neutrino Super Beam (ESS$\\nu$SB)~\\cite{essnu}, and a CERN-SPL-based neutrino beam CP search~\\cite{beta_spl}. In particular, MOMENT and ESS$\\nu$SB both feature $\\nu_\\mu$ spectra which peak at about 200-250~MeV.\n\nThe KDAR neutrino can also be used to search for electron neutrino appearance ($\\nu_\\mu \\rightarrow \\nu_e$) for providing a probe of the sterile neutrino that will be highly complementary to the JSNS$^2$ IBD search ($\\overline{\\nu}_\\mu \\rightarrow \\overline{\\nu}_e$). The advantage of the KDAR technique over other sterile neutrino searches is that the signal energy (236~MeV) is known exactly. A background measurement on either side of the signal energy window around 236~MeV can allow an interpolated determination of the expected background in the signal region with high precision. However, as compared to $\\nu_\\mu$ CC interactions, $\\nu_e$ events ($\\nu_e n \\rightarrow e^-  p$ or or $\\nu_e  \\mathrm{^{12}C} \\rightarrow e^- X$) are more challenging to identify over background, since they do not feature a double coincidence signal. While the KDAR $\\nu_e$ events are expected to be distinct, in the sense that their reconstructed energy will lie close to 236~MeV, beam-induced neutrons can interact inside of the detector to produce an energetic single flash of light (e.g. a proton), mimicking a 236~MeV $\\nu_e$ event. Pulse shape discrimination and particle identification via Cherenkov light can be used to mitigate this background, but the background event rate expectation remains significant. This is worrisome because the oscillated signal expectation is $<100$~events in consideration of the global best fit region at high-$\\Delta m^2$. The possibility of probing $\\nu_e$ appearance using KDAR neutrinos at the MLF remains an intriguing possibility, however, especially given strong Cherenkov-scintillation separation, pulse shape discrimination, and/or additional shielding. \n\n\n\n\\begin{figure}[htpb]\n\\begin{centering}\n\\includegraphics[height=4.8in]{omega.pdf} \n\\vspace{-6.7cm}\n\\caption{\\setlength{\\baselineskip}{4mm}\n  Left: The differential cross section in terms of energy transfer ($\\omega=E_\\nu-E_\\mu$) for 300~MeV $\\nu_\\mu$ CC scattering on carbon. Predictions from various models are shown. This plot is adapted from Ref.~\\cite{natalie}. Right: The differential cross section in terms of muon kinetic energy for various neutrino energies within the Continuum Random Phase Approximation model; this plot is adapted from Ref.~\\cite{crpa}.}\n  \t\\label{fig:kinematics1}\n\\end{centering}\n\\end{figure} \n\nThe KDAR neutrino opens up new avenues for research in neutrino oscillation, interaction, and nuclear physics, and the importance of these measurements is clear. Perhaps most intriguing, the nucleus has simply never been studied using a known energy, weak-interaction-only probe and KDAR provides the exclusive technique to explore this frontier. JSNS$^2$ represents the world's best hope to take advantage of the KDAR neutrino in the near future. Other existing facilities worldwide simply cannot match the large expected KDAR signal and small expected decay-in-flight background rate at the J-PARC MLF.\n\n\n\\subsection{\\setlength{\\baselineskip}{6mm} Measurement of neutrino-induced \nnuclear reaction cross sections}\n\n\\subsubsection{Physics Motivations}\n\\indent\n\nStars with initial masses greater than 8$\\sim$10 times the\nsolar mass are expected to end their lives with core collapsing\nsupernova explosions (Type-II SNe). When such a massive star \nexhausts its nuclear fuel at the center, it produces no more heat \nto sustain its own weight, and materials in the outer layers begin to \nfall into the central core. The density and the temperature of \nthe core rapidly increases, and the core is photo-dissociated to \na mixture of nucleons and light nuclei, which absorb free electrons \nby emitting neutrinos. Finally, a proto-neutron star is formed.\nThe core becomes so hard that the falling materials are repelled \nat the surface of the core. The repelled matter collides with the \nsubsequently falling matter, generating an outgoing shockwave. \nIt was found through a number of simulations on Type-II SNe within \nthe spherically symmetric one-dimensional or two-dimensional models \nthat the outgoing shockwave cannot get the kinetic energy of about \n10$^{51}$ erg which is necessary to propagate to infinity~\\cite{SN1}. \nIn order to solve the problem, many effects such as stellar rotation, the magnetic field and the neutrino-nucleus \ninteractions have been studied~\\cite{SN2}, and now the delayed \nexplosion model is considered as one of the promising and realistic \nmodels for Type-II SNe~\\cite{SN3}. \nIn this model, the kinetic energy needed for the explosion is \nconsidered to be supplied by the nuclear reactions between the \nmatter in the shockwave and the neutrinos which carry almost \n99$\\%$ of the initial gravitational energy of the star, which is \nof the order of 10$^{53}$ erg. From precise simulations of the \ndynamics of Type-II SNe, it was found that the neutrinos are \ntrapped in the core, and are released after about a hundred \nmilliseconds. Then they overtake the outgoing shockwave, \nsupplying an additional kinetic energy via the neutrino-nucleus \ninteractions. Since the region where the shockwave stalls is \ncomposed of light nuclei~\\cite{SN4}, the neutrino-induced \nnuclear reactions on light nuclei should play critical roles \nin the dynamics of explosions. From the one-dimensional and\ntwo-dimensional simulations for the explosion energy in Type-II \nSNe for different neutrino luminosities and fixed neutrino-nucleus \nreaction rates, it was found that the enhancement of the neutrino \nluminosity by 10$\\sim$15$\\%$ leads to an increase of the order \nof 10$^{50}\\sim$10$^{51}$ erg/s in the explosion energy~\\cite{SN5}. \nIt suggests the enhancement of the neutrino-nucleus reaction \nrates with fixed neutrino luminosity also should give the same \nmagnitude of increase in the explosion energy. Therefore the \nneutrino-nucleus reaction rates should be known with accuracy \nbetter than about 10$\\%$ to evaluate the effect of neutrinos \nto the explosion. \n\nAnother important role of the neutrino-induced nuclear reactions \nconcerns the r-process nucleosynthesis. A recent scenario of the \nr-process nucleosynthesis assumes the formation of the \nhigh-entropy neutron-rich gas, called the neutrino-driven wind, \nin the atmosphere of a nascent neutron star by the neutrino-induced \nspallation reactions, and the synthesis of heavy elements from protons \nand neutrons up to the nuclides with the mass number of 200$\\sim$250 \nwithin about one second~\\cite{SN6,SN7,SN8}. \nThis scenario is preferred, because it does not \nrequire the existence of the seed nuclei like iron, and naturally \nexplains the universality of the r-elements, i.e. the similarity \nfound in the r-element abundances in stars with different \nmetallicities. More recently, it was pointed out that the \nneutrino-induced spallation reactions on light nuclei may \nefficiently produce lithium and boron in the oxygen/carbon layer of \na Type-II supernova~\\cite{SN9}. Such a process is interesting as \na possible source of Li-Be-B in addition to the spallation \nby cosmic rays, and also as a new method to constrain the parameter \nof the flavor oscillation of the neutrinos. \nFor more precise calculations, it is necessary to use accurate \nrates of the neutrino-induced nuclear reactions. \n\n\\subsubsection{\\setlength{\\baselineskip}{6mm} Current status of \ndata for neutrino-induced nuclear reaction cross sections}\n\nSo far, experimental data of the neutrino-induced nuclear reaction \ncross sections have been obtained by using neutrinos produced by \naccelerators or radioactive isotopes. Decay-at-rest (DAR) \nneutrinos from stopped pions and muons generated with high-energy \naccelerators are very useful for studies of the nuclear reactions \ninduced by supernova (SN) neutrinos, because their energy spectra \noverlap with those of SN neutrinos as shown by \nFig.~\\ref{Fig:SN_DAR}. \n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.6 \\textwidth]{SN_DAR.jpg}\n\\caption{\\setlength{\\baselineskip}{4mm}\nEnergy spectra of neutrinos from Type-II SNe (solid curves) \nand DAR pions and muons (dashed curves, arbitrary units in \nluminosity). \n}\n \\label{Fig:SN_DAR}\n\\end{figure}\n\nTable~\\ref{TAB:SN1} shows the list of the presently available \nexperimental data for neutrino-induced nuclear reaction \ncross sections. \n\n\\begin{table}[htbb]\n  \\caption{\\setlength{\\baselineskip}{4mm}\n    Summary of the existing data of the neutrino-induced \n    nuclear reaction cross sections.}\n\\begin{center}\n\\begin{tabular}{|l|c|c|c|} \\hline\nReaction & Neutrino Source & Accuracy & Reference \\\\\\hline\n$^{12}$C($\\nu_e$,e$^-)^{12}$N$_{g.s.}$ & Accelerator $\\nu$ & $\\sim$10$\\%$ & \\cite{SN10}\\cite{SN11} \\\\\\hline\n$^{12}$C($\\nu_e$,e$^-)^{12}$N$^{*}$   & Accelerator $\\nu$ & $\\sim$15$\\%$ & \\cite{SN10}\\cite{SN11} \\\\\\hline\n$^{12}$C($\\nu$,$\\nu^{'})^{12}$C$(1^+1)$ & Accelerator $\\nu$ & $\\sim$20$\\%$ & \\cite{SN10}\\cite{SN11} \\\\\\hline\n$^{13}$C($\\nu_e$,e$^-)^{13}$N & Accelerator $\\nu$ & 76$\\%$ & \\cite{SN10} \\\\\\hline\n$^{56}$Fe($\\nu_e$,e$^-)^{56}$Ni & Accelerator $\\nu$ & 37$\\%$ & \\cite{SN10} \\\\\\hline\n$^{71}$Ga($\\nu_e$,e$^-)^{71}$Ge & RI ($^{51}$Cr)     & 11$\\%$ & \\cite{SN12}\\cite{SN13} \\\\\\hline\n$^{127}$I($\\nu_e$,e$^-)^{127}$Xe & Accelerator $\\nu$ & 33$\\%$ & \\cite{SN14} \\\\\\hline\n\\end{tabular}\n\\end{center}\n\\label{TAB:SN1}\n\\end{table}\n\nAs shown in Table~\\ref{TAB:SN1}, even in the case of the best studied \n$^{12}$C, the accuracy of the experimental data is not better than \nthe one required in the SN simulations, and therefore new experimental \ndata with better accuracy are still needed. JSNS$^2$ is expected to \nprovide an experimental opportunity to measure the neutrino-induced \nnuclear reaction cross sections with better accuracy due to a \nhigh-intensity neutrino beam from the J-PARC/MLF and a \nhigh-sensitivity/high-resolution detector system. \n\n\\subsubsection{\\setlength{\\baselineskip}{6mm} Plan for measurement of \nthe neutrino-induced nuclear reaction cross sections in JSNS$^2$ project}\n\n\\subsubsection*{\\setlength{\\baselineskip}{6mm} Background rejection \nand statistical accuracy}\n\\indent\n\nAssuming the neutrino flux of J-PARC/MLF to be \n$\\sim$1.6$\\times$10$^{14}$ /cm$^2$/y/MW, one needs the number \nof the target nucleus of at least $\\sim$10$^{29}$ atoms or the target \nquantity of more than a few tons to measure the cross section in the \nrange of about 10$^{-41}$ cm$^2$ with a statistical error smaller \nthan 10$\\%$. Therefore $^{12}$C contained in the LAB is a \ncandidate for the target in the present design of the JSNS$^2$ detector. \n  Since the energies of DAR neutrinos are below 52.8~MeV as shown in \nFig.~\\ref{Fig:SN_DAR}, possible reaction channels are \nthe $^{12}$C($\\nu_e$,e$^-)^{12}$N reaction caused by the charged \ncurrent (CC) and the neutrino inelastic scattering via the neutral \ncurrent (NC). The JSNS$^2$ detector is not sensitive to low energy \nprotons from the $^{12}$C($\\nu$,$\\nu^{â\u0080\u0099}$p)$^{11}$B reaction, and \nonly the $^{12}$C($\\nu_e$,e$^-$)$^{12}$N and \n$^{12}$C($\\nu$,$\\nu^{â\u0080\u0099})^{12}$C$^*$ reactions will be measured \nthrough detection of emitted electrons or $\\gamma$-rays. According \nto the previous work in these areas, the background is supposed to be dominated \nby the following types; \\\\\nType-A:  high energy muons and their decay particles \n(Michel electrons), \\\\\nType-B:  $\\beta$-decay of $^{12}$B following the \n$^{12}$C($\\mu^{-}$,$\\nu_{\\mu})^{12}$B reaction, and \\\\\nType-C:  high energy $\\gamma$-rays and neutrons induced by \ncosmic rays. \\\\\n\nTo reduce Type-A, it is effective to make an anti-coincidence by \ndetecting parent muons in a time window of 20$\\mu$s prior to the \nevent trigger time (â\u0080\u009ccharged-veto cutâ\u0080\u009d) or decay electrons until \nafter 9$\\mu$s (â\u0080\u009cMichel electron cutâ\u0080\u009d). For Type-B, the background will be \nefficiently suppressed by rejecting events with an energy \nsmaller than $\\sim$15 MeV, because the end point energy of the \n$^{12}$B $\\beta$-decay is 13.4~MeV. The counting rate of the \nresidual background after those cuts can be estimated by the \nMonte Carlo simulation based on the result of the study for \nthe background with use of the 500~kg plastic \nscintillator~\\cite{CITE:SR_14NOV}. Figure~\\ref{Fig:SN2} shows \nthe expected background spectrum after the charged-veto cut and \nthe Michel-electron cut. Since the end-point energy of \n$\\nu_e$ and the threshold energy of the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N reactions are 52.8~MeV and 17.3~MeV, \nrespectively, the energy window for \n$^{12}$C($\\nu_e$,e$^-)^{12}$N is to be set between 20 MeV and \n40 MeV, taking into account the energy resolution of the \nJSNS$^2$ detector. The detection efficiencies with the energy \nwindow and the time window are determined with the Monte Carlo \ncalculation as 67.4$\\%$ and 74$\\%$, respectively, and \nthe expected counting rate of the $^{12}$C($\\nu_e$,e$^-)^{12}$N \nreaction is 1513 events/5000h/MW/50t. On the other hand, the \nbackground rate in this energy window is estimated to be \n2.43$\\times$10$^5$ events/5000h/MW, being two orders of \nmagnitude larger than the expected counting rate of the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N reaction.\n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.6 \\textwidth]{BKG_spec_proposal.pdf}\n\\caption{\\setlength{\\baselineskip}{4mm}\nThe energy spectrum of the expected background of the JSNS$^2$ detector \nwith the charged-veto cut and the Michel-electron cut (Fig.12 in\nRef~\\cite{CITE:SR_14NOV}).\n}\n \\label{Fig:SN2}\n\\end{figure}\n\nFurther reduction of the background will be achieved with the \ndelayed coincidence of the $^{12}$N $\\beta^{+}$-decay. \nConsidering the Q-value (17.4~MeV) of the $^{12}$N $\\beta^{+}$-decay \nand the $\\gamma-$ray background rate below $\\sim$8 MeV, we will \nset the energy window from 10~MeV to 18~MeV for the delayed signal. \nTo avoid the beam-related background, the beginning of the time \nwindow will be set at 0.1~ms from the rising edge of the proton \nbeam pulse. On the other hand, the end of the time window will \nbe set at 47.5~ms, which corresponds to three as long as the \nhalf-life (15.83~ms) of $^{12}$N, in order to acquire most of the \npositrons from $^{12}$N. \nThe expected counting rates of $R_{12C}$ and $R_{BG}$ for the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N signal and the background due to \nthe accidental coincidence, respectively, are given by the \nfollowing equations; \n\n\n", "index": 1, "text": "\\begin{equation}\nR_{12C} = N_{12C} \\times \\Phi_{\\nu(e)} \\times \\sigma_{12C} \\times \n\\varepsilon_{p} \\times \\varepsilon_{d}, \\nonumber\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"R_{12C}=N_{12C}\\times\\Phi_{\\nu(e)}\\times\\sigma_{12C}\\times\\varepsilon_{p}%&#10;\\times\\varepsilon_{d},\" display=\"block\"><mrow><mrow><msub><mi>R</mi><mrow><mn>12</mn><mo>⁢</mo><mi>C</mi></mrow></msub><mo>=</mo><mrow><msub><mi>N</mi><mrow><mn>12</mn><mo>⁢</mo><mi>C</mi></mrow></msub><mo>×</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mi>ν</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>e</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>×</mo><msub><mi>σ</mi><mrow><mn>12</mn><mo>⁢</mo><mi>C</mi></mrow></msub><mo>×</mo><msub><mi>ε</mi><mi>p</mi></msub><mo>×</mo><msub><mi>ε</mi><mi>d</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01046.tex", "nexttext": "  \n\nwhere $N_{12C}$, $\\Phi_{\\nu(e)}$ and $\\sigma_{12C}$ are \nthe number of target $^{12}$C nuclei, the flux of $\\nu_{e}$, and \nthe cross section for the $^{12}$C($\\nu_e$,e$^-)^{12}$N reaction, \nrespectively. $R_{BG(p)}$ and $R_{BG(d)}$ are the background \nrates for the prompt and the delayed signals, respectively. \n$T_{coin}$ denotes the width of the time window for the coincidence \nbetween the prompt and the delayed signals. As mentioned above, \nthe background rate in the prompt signal window is estimated as \n$R_{BG(p)} =$ 2.43$\\times$10$^5$ events/5000h/MW/50t. \n\nFrom our previous study, the backgrounds in those windows are \nconsidered to be dominated by the cosmic-ray induced $\\gamma-$rays \nand neutrons. Therefore $R_{BG(d)}$ can be estimated by integrating \nthe energy spectrum shown by Fig.~\\ref{Fig:SN2} in the energy \nregion for the delayed signal. The probability of the accidental \ncoincidence is calculated as 2.3 /47.5ms/MW/50t from the \nestimated $R_{BG(d)}$, suggesting still further reduction of \nthe background is necessary. Since the background events are not \ncorrelated with the prompt signals from the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N reaction, they can be reduced by \ncareful analysises on spatial and time correlations between \nthe prompt and the delayed signals. \n\n\\begin{figure}[htpb]\n \\centering\n \\includegraphics[width=0.6 \\textwidth]{DVTX_CNgs.jpg}\n\\caption{\\setlength{\\baselineskip}{4mm}\nDistribution of the distance ($\\Delta VTX$) between prompt electron \nfrom $^{12}$C($\\nu_e$,e$^-)^{12}$N and delayed positron \nfrom $^{12}$N $\\beta^{+}$-decay.\n}\n \\label{Fig:DVTX_CNGS}\n\\end{figure}\n\nFigure~\\ref{Fig:DVTX_CNGS} shows the distribution of $\\Delta VTX$, \nwhich is defined as the distance between the mean positions of \nthe prompt electron from $^{12}$C($\\nu_e$,e$^-)^{12}$N and the \ndelayed positron from $^{12}$N $\\beta^{+}$-decay estimated from \nthe distributions of the photons detected with PMTs.\nSetting the criterion $\\Delta VTX <$ 20~cm, 82$\\%$ of the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N events are picked up, while the \nbackground rate can be suppressed with a factor of $\\sim$ 0.0011, \nwhich is basically determined by the ratio of the whole volume \nof the detector to the volume of a sphere with a radius of 20~cm. \nConcerning the time correlation, the event rates of the prompt \nelectron and the delayed positrons are governed by the decays \nwith half-lives of 3.17~$\\mu$s and 15.83~ms, respectively, with \nrespective to the primary beam pulse. The 65$\\%$ fraction of the random \nbackground can be eliminated by the likelihood analysis on \nthe time distributions of the prompt and delayed signals \n(``lifetime cut\": the similar cut as mentioned in Ref~\\cite{CITE:SR_14NOV}).\nOn the other hand, according to our previous \nsimulation, 91$\\%$ of the $^{12}$C($\\nu_e$,e$^-)^{12}$N events \nwill be kept. \\\\\n\n\nThe efficiencies and the rejection factors of the above cuts \nare summarized in Table~\\ref{TAB:SN2}.\n\n\\begin{table}[htb]\n  \\caption{\\setlength{\\baselineskip}{4mm}\n    Detection efficiencies and rejection factors of the cuts \n    after the charged-veto cut and the Michel-electron cut \n    evaluated with a Monte Carlo calculation. Note the rejection \n    factors with the energy windows for the prompt and delayed \n    signals have already been applied to estimate the background \n    rates $R_{BG(p)}$ and $R_{BG(d)}$ (see the text for detail).}\n\\begin{center}\n\\begin{tabular}{|c|c|c|} \\hline\nCut & Efficiency & Rejection factor\\\\\\hline \\hline\nEnergy window (prompt 20-40MeV) & 0.674 & --- \\\\\\hline\nTime window (prompt 1-10$\\mu$s) & 0.74 & --- \\\\\\hline\nEnergy window (delayed 10-18MeV) & 0.42 & --- \\\\\\hline\nTime window (delayed 0.1-47.5ms) & 0.944 & --- \\\\\\hline\n$\\Delta$VTX cut & 0.82 & 0.0011 \\\\\\hline\nLifetime cut & 0.91 & 0.45 \\\\\\hline \\hline\ntotal & 0.148 & 4.95$\\times$10$^{-4}$ \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\label{TAB:SN2}\n\\end{table}\n\nHere it should be noted that the contribution of \n$^{12}$C($\\nu_e$,e$^-)^{12}$N$^*$ can be eliminated by requiring the \ndelayed coincidence of the $^{12}$N $\\beta^{+}$-decay, because all \nthe known excited states of $^{12}$N are located above the threshold of \nthe proton emission.\n\nAssuming the flux of $\\nu_{e}$ to be 1.6$\\times$10$^{14}$ /cm$^2$/y/MW \nand the $^{12}$C($\\nu_e$,e$^-)^{12}$N$_{g.s.}$ cross section to be \n8.9$\\times$10$^{-42}$ cm$^{2}$, the expected numbers of the events are \nestimated with the total efficiency and the total rejection factor in \nTable~\\ref{TAB:SN2} as 448 /y and 138 /y for the \n$^{12}$C($\\nu_e$,e$^-)^{12}$N$_{g.s.}$ reaction and the background, \nrespectively, with the total detector mass of 50~t and the operation \nof J-PARC/MLF at 1~MW for 5000~h/y, leading to a very good statistical \naccuracy of 6.0$\\%$ (2.7$\\%$) with a one- (five-) year measurement. \n\n\\subsubsection*{Systematic errors}\n\\indent\n\nIn this measurement, major sources of the systematic error are supposed \nto be the uncertainties associating the absolute flux of incident neutrinos \nand the detector response. \nIn the previous experiments by the KARMEN~\\cite{SN15} and the \nLSND~\\cite{SN11} collaborations, the neutrino fluxes were estimated by means \nof Monte Carlo simulations using the experimentally determined ratios \nof $\\mu^+$ or $\\pi^+$ to the incident protons, and the uncertainties in \nthe neutrino fluxes were not smaller than 7$\\%$, being greater than \nstatistical errors of those experiments. A more accurate determination of \nthe neutrino flux may be achieved by directly measuring the rates of the \nd($\\nu_e$,e$^-$p)p and d($\\nu_e$,$\\nu_e^{â\u0080\u0099}$n)p reactions, whose cross \nsections are known with accuracy of ~2$\\%$~\\cite{SN16}. This kind of \nmeasurement will need an additional deuterated liquid scintillation counter \nlocated near the spallation target of J-PARC/MLF. \nFor precise understanding of the detector response, we will develop movable \n$\\beta/\\gamma$ sources in the active volume for calibrations of the position \nand energy measurements.\n\n\\subsubsection*{\\setlength{\\baselineskip}{6mm} Determination of \n$^{12}$C($\\nu_e$,e$^-)^{12}$N$^*$ cross sections}\n\nTo determine the cross section for $^{12}$C($\\nu_e$,e$^-)^{12}$N$^*$, \nthe spectrum obtained for null delayed $\\beta^+$ signal should be \ndeconvoluted with the response functions for possible reaction channels \nsuch as $^{12}$C($\\nu_e$,e$^-)^{12}$N$^*$, $^{13}$C($\\nu_e$,e$^-$)X \nand $^{12}$C($\\nu_e$,e$^-)^{12}$N$_{g.s}$ with missing delayed signal. \nDue to more statistics than previous experiments and precise \ncalibration of the detector response, better accuracy in the analysis \nof the angular distribution is expected.\n\n\\subsubsection*{\\setlength{\\baselineskip}{6mm} Possibility for cross \nsection measurements on neutrino-induced reactions other than \n$^{12}$C($\\nu_e$,e$^-$)$^{12}$N}\n\\indent\n\nAs mentioned above, an accurate measurement of a neutrino-induced reaction \ncross section requires a target mass of around one ton or more and a very \nlow background rate. From the viewpoint of the target mass, \n$^{12}$C($\\nu,\\nu^{â\u0080\u0099})^{12}$C$^*$ and $^{13}$C($\\nu_e$,e$^-$)$^{13}$N are \nthe candidates, but unfortunately, there is no useful decay in both \nreactions for the delayed coincidence, and therefore thick passive shields \nshould be added to suppress the background due to cosmic-ray induced \n$\\gamma$-rays and neutrons. Another candidate will be the \n$^{28}$Si($\\nu_e$,e$^-$)$^{28}$P reaction followed by the $\\beta^+$-decay \nof $^{28}$P with a Q-value of 14.35~MeV and a half-life of 270.3~ms. \nIn this case the material for the liquid scintillator has to be replaced \nwith a silicon compound such as silicon oil, and it should be regarded as \none of the future extensions of JSNS$^2$ after completion of the sterile \nneutrino search.\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{99.}\n\n\\bibitem{CITE:PROPOSAL}\nM.Harada, {\\it et al},  arXiv:1310.1437 [physics.ins-det]\n\n\\bibitem{CITE:SR_14NOV}\nM.Harada, {\\it et al}, arXiv:1502.02255 [physics.ins-det]\\\\\nPTEP 2015 6, 063C01 (2015)  \n\n\\bibitem{CITE:20PAC}\nM.Harada, {\\it et al}, arXiv:1507.07076 [physics.ins-det]\n\n\\bibitem{settlement}\n  M. Harada, et al., Settlement of Materials and Life Science Experimental Facility at J-PARC, Nucl. Inst. Meth, A600 (2009) 87â\u0080\u009390.\n\n\\bibitem{CITE:DayaBayLS}\nY. Ding, {\\it et al}, Nucl. Instrum. Meth. A584, 238 (2008).\n\n\\bibitem{geant4}\nS. Agostinelli \\textit{et al.}, \nNucl. Instr. Meth. A \\textbf{506}, 250 (2003). \n  \n\\bibitem{CITE:KamLAND}\nI .Shimizu, PhD thesis, Tohoku University (2004).\n\n\\bibitem{CITE:CYRIC32}\nY. Sakemi {\\it et al}, IAEA-TECDOC-1743, 229 (2014).\n\n\\bibitem{pdg}\nJ. Beringer \\textit{et al.}  [Particle Data Group], \nPhys. Rev. D \\textbf{86}, 010001 (2012).\n\n\\bibitem{kdar1}\nJ. Spitz, \nPhys.\\ Rev.\\  D {\\bf 85}, 093020 (2012).\n \n\\bibitem{kdar2}\nJ. Spitz, \nPhys.\\ Rev.\\  D {\\bf 89}, 073007 (2014).\n\n\\bibitem{kdar3}\nS. Axani, G. Collin, J.M. Conrad, M.H. Shaevitz, J. Spitz, and T. Wongjirad,  Phys. Rev. D \\textbf{92}, 092010 (2015).\n\n\\bibitem{kumar}\nC. Rott, S. In, J. Kumar, and D. Yaylali, \nJournal of Cosmology and Astroparticle Physics \\textbf{11}, 039 (2015).\n\n\\bibitem{mlf_news}\nJ-PARC Project Newsletter special issue, May 2015.\n\n\\bibitem{mars}\nN.V.~Mokhov, FERMILAB-FN-628 (1995);\nO.E.~Krivosheev and N.V. Mokhov, ``MARS Code Status\", Fermilab-Conf-00/181 (2000);\nO.E.~Krivosheev and N.V. Mokhov, ``Status of MARS Code\", Fermilab-Conf-03/053 (2003);\nN.V.~Mokhov, K.K.~Gudima, C.C.~James \\textit{et al.}, ``Recent Enhancements to the MARS15 Code\", Fermilab-Conf-04/053 (2004).\n\n\\bibitem{teppei}\nT. Katori, Neutrino Cross Section Newsletter (12/23/2014); https://pprc.qmul.ac.uk/~katori/nu-xsec.html.\n\n\\bibitem{minos}\nD. G. Michael \\textit{et al.} [MINOS Collaboration], \nNucl. Instrum. Meth. A \\textbf{596}, 190 (2008).\n\n\\bibitem{nova}\nD.S. Ayres \\textit{et al.} [NOvA Collaboration],\nFERMILAB-PROPOSAL-0929 (2004).\n\n\\bibitem{dune}\nR. Acciarri {\\it et al.}, [DUNE Collaboration] (2015), Long Baseline Neutrino Facility (LBNF) and Deep Underground Neutrino Experiment (DUNE) Conceptual Design Report, available in 4 volumes at http://www.dunescience.org/.\n\n\\bibitem{t2knim}\nK. Abe \\textit{et al.} [T2K Collaboration],\nNucl. Instr. Meth. A \\textbf{659}, 106 (2011).\n\n\\bibitem{moment}\nJ. Cao {\\it et al.}, \nPhys. Rev. ST Accel. Beams \\textbf{17}, 090101 (2014).\n\n\\bibitem{essnu}\nE. Baussan \\textit{et al.},\narXiv:1309.7022 [hep-ex] (2013).\n\n\\bibitem{beta_spl}\nJ.E. Campagne, M. Maltoni, M. Mezzetto, and T.~Schwetz,\nJ. High Energy Phys. \\textbf{0704}, 003 (2007).\n\n\n\\bibitem{natalie}\nPrivate communication with N. Jachowicz.\n\n\\bibitem{crpa}\nV. Pandey, N. Jachowicz, T. Van Cuyck, J. Ryckebusch, and M. Martini,\nPhys. Rev. C \\textbf{92}, 024606 (2015).\n\n\\bibitem{SN1}\nS. Woosley and H.-T. Janka, Nat. Phys. 1, 147 (2005), and references therein.\n\n\\bibitem{SN2}\nA. Marek and H.-T. Janka, Astropys. J. 694, 664 (2009), and references therein.\n\n\\bibitem{SN3}\nK. Sumiyoshi and G. Roepke, Phys. Rev. C77, 055804 (2008).\n\n\\bibitem{SN4}\nH.-T. Janka and E. Mueller, Astron. Astropys. 306, 167 (1996).\n\n\\bibitem{SN5}\nK. Otsuki, H. Tagoshi, T. Kajino and S.Wanajo, Astrophys. J. 533, 424 (2000).\n\n\\bibitem{SN6}\nS. Wanajo, T. Kajino, G.J. Mathews and K. Otsuki, Astrophys. J. 554, 578 (2001).\n\n\\bibitem{SN7}\nT. Kajino, S. Wanajo and G.J. Mathews, Nucl. Phys. A704, 165c (2002).\n\n\\bibitem{SN8}\nT. Yoshida et al., Phys. Rev. Lett. 96, 091101 (2006).\n\n\\bibitem{SN9}\nS.X. Nakamura, K. Sumiyoshi and T. Sato, Phys. Rev. C80, 035802 (2009).\n\n\\bibitem{SN10}\nR. Maschuw (KARMEN Collab.), Prog. Part. Nucl. Phys. 40, 183 (1998).\n\n\\bibitem{SN11}\nL.B. Auerbach et al. (LSND Collab.), Phys. Rev. C64, 065501 (2001).\n\n\\bibitem{SN12}\nJ.N. Abdurashitov et al. (SAGE Collab.), Phys. Rev. C59, 2246 (1999).\n\n\\bibitem{SN13}\nW. Hampel et al. (GALLEX Collab.), Phys. Lett. B420, 114 (1998); F. Kaether et al. (GALLEX Collab.), Phys. Lett. B685, 47 (2010).\n\n\\bibitem{SN14}\nJ.R. Distel et al., Phys. Rev. C68, 054613 (2003).\n\n\\bibitem{SN15}\n  R.L. Burman, M.E. Potter and E.S. Smith, Nucl. Instr. Meth. in Phys. Res. A291, 621 (1990).\n\n\\bibitem{SN16}\nS.X. Nakamura, K. Sumiyoshi, T. Sato, Phys. Rev. Lett. 98, 192501 (2007).\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n", "index": 3, "text": "\\begin{equation}\nR_{BG} =  R_{BG(p)} \\times T_{coin} \\times R_{BG(d)}, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"R_{BG}=R_{BG(p)}\\times T_{coin}\\times R_{BG(d)},\" display=\"block\"><mrow><mrow><msub><mi>R</mi><mrow><mi>B</mi><mo>⁢</mo><mi>G</mi></mrow></msub><mo>=</mo><mrow><msub><mi>R</mi><mrow><mi>B</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>×</mo><msub><mi>T</mi><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>×</mo><msub><mi>R</mi><mrow><mi>B</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>d</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]