[{"file": "1601.04236.tex", "nexttext": "\nwhere $\\eta_\\textrm{X}$ is an efficiency factor for conversion of magnetic energy to radiation.\\cite{2004A&A...420.1025O}\n\n\n\\section{Quark-nova connection to AXPs and SGRs}\nDuring the quark-nova a small fraction ($\\sim10^{-7} \\textrm{M}_\\odot$) of the ejecta will remain gravitationally bound. \nDepending of the spin of the neutron star progenitor, this debris will form into either a co-rotating shell ($\\textrm{P} > 10 $ ms) \nor a Keplerian disk ($\\textrm{P} \\sim  5$ ms). As with the escaped ejecta, this material will be rich in \nr-process ($\\textrm{Z} > 26 $) elements. This debris surrounding the quark star provides an additional source of material \nwhich may radiate or interact with the quark star. In both cases, it may be possible to identify the presence of two distinct \nblackbodies (where one is the quark star and the second is the surrounding debris) at two different temperatures. \n\n\n\\subsection{Co-rotating debris: SGRs }\n\\label{sec:sgrs}\nFor slow rotating neutron star progenitors, the fall-back material will settle into a co-rotating degenerate shell surrounding \nthe quark-star,\\cite{2007A&A...473..357O}  where the surrounding shell is supported by the quark star's magnetic field pressure. Because \nof this, there is a critical latitude at which material near the poles does not have sufficient magnetic support to \novercome the quark star's gravitational field. As the star ages, magnetic field decay, contraction of the co-rotating \nshell, hydrodynamic instabilities and changes in the stability point cause accretion of material from the shell onto \nthe quark star's surface. These accretion phases cause sudden shearing off of material from the co-rotating shell \nand results in the release gamma rays as the accreted matter from the shell impact onto the surface of the quark star. \nDuring quiescent phases, these SGRs will be emitting in X-ray from the magnetic field decay as described by Eq.~\\ref{eq:xrayLuminosity}. \n\n\n\\subsection{Keplerian debris: AXPs}\nRapidly rotating neutron stars will instead form a degenerate Keplerian disk surrounding the \nquark-star.\\cite{2007A&A...475...63O} The magnetic field of the quark star slowly penetrates through the \ndegenerate ring and threads the inner ring. This penetration front (Bohm Front) proceeds through the degenerate layers of the ring \nand forces co-rotation of the inner threaded portion of the now non-degenerate inner section of the debris. \nAt the front, before complete penetration and forced co-rotation with the magnetic field, the non-degenerate material  \nis expelled from the disk through a Kelvin-Helholtz instability and accreted onto the quark star's surface. This leads to a stream of material from the Keplerian \ndisk which is accreted onto the \nquark star creating hot-spots near the poles. Dissipation of magnetic bubbles generated at the ring during these outburst provides a source of \ntransient radio emission which has been associated with some AXPs following bursting periods. \\cite{2010A&A...516A..88O} \nWhen these accretion events happen the inner ring of the disk will be heated by \nradiation from the surface of the quark star. During quiescent phases, the \nquark star--ring system should have two emission spectra (X-ray and black body). During bursting, however, \nthe inner portion of the ring will heat up (increasing its black body temperature) \nand hot spots on the quark star surface will become visible as an additional black body.\n Of course, as the material from the Keplerian ring is transferred onto the quark star, \nthe star may be spun up or down depending on radial drift velocity of the accreted material which changes \nwith the radial distance. \n\nAs the quark star and Keplerian disk age, the ring begins to spread out and eventually \nsuccumbs to gradual mass leakage. The gradual accretion from the surrounding ring \nprovides a steady stream of matter onto the surface of the quark star leading to \nan accretion dominated phase.\\cite{2011MNRAS.415.1590O} Now the quiescent phase \nof the quark star's X-ray luminosity is dominated by the accretion luminosity \nof hot spots on the star. As the debris is accreted the luminosity slowly decreases and, \nonce the ring has been completely consumed, the quark star will return \nto the vortex band and emit primarily X-rays from the magnetic reconnection of the \never decaying magnetic field (see Fig.~2 of Ref.~\\refcite{2011MNRAS.415.1590O}). \nThis means that despite their differences early on, AXPs and SGRs will both eventually \nconverge to the vortex band and eventually cease bursting activity after they \nhave consumed the entirety of the fall-back material from the original quark-nova. \n\n\\section{Quark-nova bursting signatures}\nWhen a quark-star enters into its bursting phases, it will energize the surrounding material. \nThis transfer of energy heats up the surrounding debris and may cause atomic spectral line emission \nor cause changes to the rotational mode of the Keplerian disk.\n\n\\subsection{Atomic 13 keV lines}\nSpectral line features around 13 keV have been detected in several different AXPs. The \ncommon explanation for these spectral lines has been a cyclotron emission in \nthe atmosphere of a magnetar. This explanation has been strained by the repeated observations of \nseveral different line features at the same frequency in different AXPs. Additionally, the magnetic field strength \ninferred (assuming proton cyclotron emission) is inconsistent with \nthe characteristic magnetic field strength (inferred from period and spin-down measurements). \nInstead, we suggest that this observed spectral feature may be an atomic transition line.\nSince the fall-back material from the quark-nova ejecta is so neutron rich, the degenerate ring or \nco-rotating shell is composed of r-process elements. Normally, these isotopes are too dim to detect spectroscopically; however, \nduring bursting phases these elements are heated up and become spectroscopically visible. The frequencies at \nwhich these elements emit is then completely independent of magnetic field strength and would be at identical \nbetween frequencies for all AXPs. Analysis of the atomic line strengths of elements suggests that this \nis a 13 keV emission feature from a strontium or rubidium line.\\cite{2013RMxAA..49..351K,2014RMxAA..50..189K} \nThe number of observed 13 keV lines makes it unlikely that this is a proton cyclotron line since that would require \nthe magnetic fields to be the same in each magnetar. As more of these spectral lines are observed, it may begin \nto statistically rule out magnetars altoghether and atomic line spectra provides a natural explanation for a common\n13 keV line to be present in all AXPs. \n\n\n\\subsection{Anti-glitches}\nThe observation of an anti-glitches associated with AXP 1E2259+586 proved to be \na puzzling phenomena. In our model, AXP bursts are generated by accretion of material from \na surrounding disk.\\cite{2014Ap&SS.352..715O} These bursting phases re-energize the surrounding material and \nmay cause retrograde motion in a surrounding Keplerian disk. For this \nparticular AXP, the hypothesis is that the observed burst in 2002 caused a reversal in the inner ring \nof the Keplerian disk. Then, in 2012, material from the ring was accreted causing spin-down due to the transfer of \nangular momentum from the now retrograde inner ring. As a result, further bursts from the same AXP may cause \nfurther anti-glitches if the 2002 burst was energetic enough to reverse several layers of the surrounding inner ring. \nCoincident observation of atomic r-process spectral features would further strengthen this hypothesis. \n\n\\section{Conclusion}\nThe quark-nova model proposes that quark stars are the compact remnant left behind \nfollowing the explosion of a neutron star. The explosion process leaves behind debris \nwhich form a gravitationally bound disk or ring around the quark star. This quark star--debris \nsystem emits in X-ray and is subject to several bursting phases over the course of its \nlifetime leading to either SGRs, or AXPs. The X-ray luminosity generated by vortex expulsion is consistent \nwith observations of SGRs and AXPs and suggests a common ancestry for both. This picture is similar to magnetar models for AXPs and \nSGRs, but can be distinguished by detailed analysis of the observed spectra. \nBased on our model we expect that future bursting events \nshould be associated with both low and high B magnetars and may be coincident with anti-glitches and r-proceess atomic spectral lines. \n\n\n\n\\section*{Acknowledgments}\n\nThis work is funded by the Natural Sciences and\nEngineering Research Council of Canada.\n\n\\bibliographystyle{ws-procs975x65}\n\\bibliography{main}\n\n\n", "itemtype": "equation", "pos": 5074, "prevtext": "\n\n\\title{Quark-nova compact remnants: \\\\ Observational signatures in astronomical data and implications to compact stars }\n\\author{Rachid Ouyed$^*$, Denis Leany, Nico Koning, Zachary Shand}\n\n\\address{Physics and Astronomy, University of Calgary,\\\\\nCalgary, Alberta, Canada\\\\\n$^*$E-mail: rouyed@ucalgary.ca}\n\n\n\\begin{abstract}\nQuark-novae leave behind quark stars with a surrounding metal-rich fall-back (ring-like) material. These compact remnants have high magnetic \nfields and are misconstrued as magnetars; however, several observational features allow us to distinguish \na quark star (left behind by a quark-nova) from a neutron star with high magnetic field. In our model, bursting activity \nis expected from intermittent accretion events from the surrounding fall-back debris leading to \nX-ray bursts (in the case of a Keplerian ring) or gamma ray bursts (in the case of a co-rotating shell). \nThe details of the spectra are described by a constant  background X-ray luminosity from the expulsion of magnetic flux \ntubes which will be temporarily buried by bursting events caused by accretion of material onto \nthe quark star surface. These accretion events emit high energy photons and heat up the \nquark star and surrounding debris leading to hot spots which may be observable as \ndistinct blackbodies. Additionally, we explain observed spectral line features as atomic lines from r-process \nmaterial and explain an observed anti-glitch in an AXP as the transfer of angular momentum from a surrounding \nKeplerian disk to the quark star. \n\\end{abstract}\n\n\\keywords{dense mater; magnetic fields; stars: magnetars; stars: neutron; X-rays: bursts; X-rays: stars}\n\n\\bodymatter\n\n\n\n\\section{Introduction}\nAnalogous to a core-collapse supernova, a quark-nova is the explosion of a neutron star which leaves behind a quark star. \nIn the quark-nova model, the compact remnant left behind is a quark star composed of deconfined up, down and strange \nquarks in a color-superconducting phase. The quark star has many observable similarities to a neutron star and \nis especially likely to be mislabelled as a magnetar due to its intrinsically high magnetic field at birth. \nAs a compact remnant, the quark star distinguishes itself from other compact objects by the properties of its constituent quark matter and\nits formation mechanism which ejects an r-process rich crust which leaves behind metal rich debris. These properties \ncause the quark-star to emit in X-ray and gamma ray and causes intermittent bursting phases which \nmake it an excellent candidate for not just magnetars, but also soft gamma repeaters (SGRs), anomalous X-ray pulsars (AXPs) \nrotating radio transients (RRATs) and X-ray dim isolated neutron stars (XDINs).\n\n\n\\section{Quark-novae}\nQuark-novae convert the parent neutron star into a quark star.\\cite{2004A&A...420.1025O} The explosive event ejects an outer layer of the neutron \nstar crust ($\\sim10^{-3} \\textrm{M}_\\odot$) and leaves behind a quark star. The relativistic ejecta ($\\gamma \\geq 10 $) \nis initially an extremely dense ($10^{14}$ g/cc) and neutron rich environment ideal for formation \nof heavy elements through the r-process (see Refs.~\\refcite{2007A&A...471..227J}, \\refcite{rJava1} and \\refcite{rJava2} for more details). \nThis ejecta may be visible following the quark-nova either by interaction with surrounding material as \na super-luminous or double-humped supernova,\\cite{SLSNKostka2014,1674-4527-13-12-007}\nor by the decay of unstable r-process isotopes as a fast radio burst.\\cite{2015arXiv150508147S} Additional observational \nevidence for this r-process rich material may exist in the form of gravitationally bound fall-back material surrounding \nthe quark-star. This fall-back material can either form a co-rotating shell, or a Keplerian disk depending on the period of \nthe parent neutron star. The large amount of material ($10^{-7} \\textrm{M}_\\odot$) in these rotating structures provides \nadditional emission spectra through both black-body radiation and accretion onto the bare quark star.\n\n\\subsection{Quark-nova compact remnant: aligned rotator}\nThe quark star remnant of the quark-nova is left in a colour-superconducting phase and the \nmagnetic field of the quark star becomes quantized and constrained to vortices in an Abrikosov lattice. \nThis results a compact object whose surface magnetic field becomes \nmuch stronger and is forced into alignment with its rotation through the Meissner effect.\\citep{2006ApJ...653..558O} \nAs the star ages, spin-down causes magnetic field vortex expulsion which leads to heating of the quark star surface and \nX-ray emission from magnetic reconnection events.\\cite{2010PhRvD..81d3005N} This ultimately leads to the \nslow decay of the quark star magnetic field and produces a compact body which cannot exhibit the lighthouse \npulsations of a neutron star, but will instead appear in X-ray. The X-ray emission will decay over time \nand is consistent with observations of XDINS and SGRs (see Fig.~2 in \\refcite{2011MNRAS.415.1590O}). The luminosity \nof the vortex band is given by: \n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:xrayLuminosity}\n\tL_\\textrm{X} \\approx 2.01 \\times 10^{35} \\eta_\\textrm{X} \\dot{P}^2_{-11} \\textrm{ ergs}^{-1} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{\\textrm{X}}\\approx 2.01\\times 10^{35}\\eta_{\\textrm{X}}\\dot{P}^{2}_{-11}%&#10;\\textrm{ ergs}^{-1}\" display=\"block\"><mrow><msub><mi>L</mi><mtext>X</mtext></msub><mo>≈</mo><mrow><mrow><mn>2.01</mn><mo>×</mo><msup><mn>10</mn><mn>35</mn></msup></mrow><mo>⁢</mo><msub><mi>η</mi><mtext>X</mtext></msub><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>P</mi><mo>˙</mo></mover><mrow><mo>-</mo><mn>11</mn></mrow><mn>2</mn></msubsup><mo>⁢</mo><msup><mtext> ergs</mtext><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}]