[{"file": "1601.07574.tex", "nexttext": "\n\nThe algorithm we have adopted proceeds by computing, at each step, the minimum dissimilarity between pairs of areas and clustering them together. In other words, clusters are grouped according to the minimum intercluster dissimilarity, a linkage rule also known as ``single-linkage'' clustering \\cite{single}. The same algorithm can be used to generate the corresponding dendrogram.\n\nWhile negative correlations are pronounced in subject-wise matrices they tend to be averaged-out in the population-wise matrix, whose terms are all positive. Although this confirms the larger inter-subject variability of negative correlations with respect to the positive ones, it affects the nested structure of the average matrix, which is far less pronounced than for the single individuals: nonetheless, nested red square-shaped patterns along the diagonal are still clearly visible.\n\nThe distribution of edge values of the average matrix is shown in fig. \\ref{fig2}, alongside with the normal distribution whose mean and variance have been estimated through the maximum-of-the-likelihood procedure. The deviation of the distribution of experimentally-determined correlations form the normal distribution is larger for this matrix than for the individual ones.\n\n\\paragraph{Percolation analysis.}\n\nThe results of the classical and modified percolation analyses are shown in fig. \\ref{fig3}. \n\nOur method identifies multiple steps for increasing threshold, corresponding to the stable partitions of the network \\cite{martijn,lazaros} highlighted in fig. \\ref{fig5}. The plateaus indicate the presence of connections whose removal does not affect the number of connected components, indicating that these links are not critical in determining the structure of functional correlations.\n\nFig. \\ref{fig5}, shows that each connected group of areas detected in correspondence of a given correlation value is composed by many nested modules, whose hierarchical organization emerges form the application of  higher thresholds. Two main groups of areas can be clearly identified (colored in blue and green in fig. \\ref{fig5} and detected for $r_{th}\\simeq0.45$). The first group (colored in green) regions include the cingulate cortex, the motor cortex, the medial prefrontal cortex and the primary somatosensory cortex \\cite{martijn,liska,rosazza}. The second group (colored in blue) is constituted by areas 3, 4, 19, 20, 35 and 36 (i.e. anterio-dorsal hippocampus, the right dentate gyrus and the right posterior gyrus), all parts of the hippocampal formation.\n\nUpon rising the threshold to $r_{th}=0.52$, sub-areas appear: for example, the hippocampus splits into right and left part - i.e. 3, 19, 35 and 4, 20, 36 (evidenced in blue and purple); further rising the threshold to $r_{th}=0.6$, the two latter subgroups reveal a core structure defined by the pairs 19, 35 and 20, 36. An analogous result is found for the sensory system, confirming the hierarchical character of the mouse brain modular structure.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.55\\textwidth]{Figure6.pdf}\n\\caption{Result of the MSF algorithm mapped into the average mouse brain areas. The algorithm works by first sorting the observed correlations in decreasing order and then linking pairs of areas sequentially, with the only limitation that each new link must connect at least one previously disconnected area. Colors correspond to the average correlation value of the links defining each tree composing the forest. See also the map of the neuroanatomical ROI in Appendix.}\n\\label{fig6}\n\\end{figure}\n\nInterestingly, the percolation curve for the null model shows a remarkably different trend. Indeed, drawing a matrix (whose distribution of correlations coincides with the observed one for the average mouse) from our ensemble and repeating our percolation analysis leads to a single, sharper transition, with basically no plateaus. This indicates that rising the threshold value leads to the sequential disconnection of individual nodes, which are removed one after the other. This supports the idea that the hierarchical structure observed for the brain connectivity network is genuine, as the stepwise behavior does not emerge in a null model with similar distribution of correlations (the same conclusion holds true for the individual-wise matrices as well).\n\nWhile this is reassuring, a statistical test is needed to quantify the significance of the experimental trend with respect to the null hypothesis. Our choice of such test moves from the observation that the experimental trend is less steep than the one obtained by running the null model. For this reason, the test statistics we have computed is the steepness of the experimental trend, measured between two points: the pairs $(r'_{th}, 2)$ and $(r''_{th}, 53)$, with $r'_{th}$ and $r''_{th}$ indicating the values of correlations in correspondence of which we detect 2 and 53 communities respectively (we have deliberately excluded the trivial communities represented by the whole brain and the single areas/nodes). The ensemble distribution of our test statistics is shown in fig. \\ref{fig4}, together with the experimental point: the latter lies well outside the $95\\%$ confidence intervals.\n\\newline\n\\newline\n\\indent On the other hand, as evident upon inspecting fig. \\ref{fig3}, classical percolation, in which only the size of the largest component is monitored, detects multiple thresholds in both the experimental network and in the network generated according to our null model. Although this finding provides a significant evidence of the structural differences between the observed average brain and an Erd\\\"os-Renyi-like graph, for example, it also implies that the claim according to which,  in this ``classical'' version of percolation, revealing multiple thresholds is, by itself, a proof of the hierarchical modular structure of a network is arguable. Indeed, recovering the presence of steps also in the null model seems to suggest that the dynamics of the giant component is (at least) partially encoded into the correlations distributions, while this is no longer true when considering also the remaining components, implying that one of the genuine signatures of the brain self-organization lies in their dynamics.\n\n\\paragraph{Minimal Spanning Forest.} \n\nThe MSF algorithm is defined by two simple steps: {\\it a} the observed correlations are sorted in reverse order; {\\it b)} starting from the largest observed correlation, a link is drawn between the corresponding brain areas. This is done sequentially, with the limitation that any new connection must link at least one previously completely disconnected area.\n\nAt each step of the MSF algorithm, either a previously isolated area is assigned to an existing group or two previously isolated areas are linked together. In this way, ``communities'' remain naturally defined by the strength of their internal correlations, while redundant connections are discarded. In particular two different communities are eventually connected by edges whose correlation value is smaller than all the links of both communities. Althought the MSF is not, by itself, a community detetction technique, it provides a means to hierarchically order modules based on the strength of their internal edges. Such modules are tree-shaped and provide information on the structural importance of each area (e.g. its betweeness centrality).\n\nThe MSF of average brain is shown in fig. \\ref{fig6}. Our analysis reveals that presence of both inter- and intra-hemispheric modules. The module with the strongest internal connectivity is the medial-prefrontal cortex, consistent with the finding that this bilateral structure persists in the percolation analysis at high values of the threshold. The second and third modules in the MSF rank are the right and left hippocampal formation. Interestingly, larger, inter-hemisferic modules, like the one comprising frontal and orbitofrontal cortices, caudate putamen and the amygdala, are characterized by more numerous, but weaker links. Altogether, the MSF structure reflects the hierarchical organization of connectivity modules revealed by our percolation analysis. \n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Figure7.pdf}\n\\caption{MST of our average mouse brain. The MST has been built by connecting the trees of the MSF, with the only limitation that any newly-added link must connect a pair of previously-disconnected trees: a consequence of the MST algorithm is that the correlations within the trees are, on average, higher than the correlations between the trees. The MST also allows us to distinguish between connector and provincial areas. See also the map of the neuroanatomical ROI in Appendix.}\n\\label{fig7}\n\\end{figure}\n\nRemarkably, the insular cortex and the secondary somatosensory cortices are found within the same tree, thus showing that the reciprocal structural connectivity among these areas results in a consistent pattern of functional connectivity which has been recently described also using voxelwise community detection approaches \\cite{liska}. Similarly, the thalamus is found to be strongly linked to the bed nucleus of stria terminals, consistent with the reciprocal neuroanatomical links connecting these regions \\cite{choi}. Interestingly, our MSF reveals a strong functional connection between the visual cortex and the retrosplenial cortex (i.e. between areas 43, 44, 53 and 54), an area that has been recognized as fundamental in tasks like orientation, head movement and processing of visual cues \\cite{maguire}. As a last example, the MSF suggests  a role for the temporal association cortex (i.e. 49, 50) in the coordination of the sensori stimuli \\cite{squire}, receiving inputs from  the auditory and the rhinal corteces (i.e. 7, 8 and 41, 42).\n\\newline\n\\newline\n\\indent Once the MSF has been built, we can use the remaining correlations in the list to build the Minimal Spanning Tree (MST). As for the forest, only one limitation exists: any new added link must connect a pair of previously-disconnected trees (which become part of the same tree afterwards). Naturally, the links \\emph{between} trees are weaker than the links \\emph{within} trees and the MSF can be recovered upon removing the weakest links.\n\nThe information provided by the MSF can be thus complemented by the information provided by the MST, which gives a clear picture of the mouse brain connectivity skeleton. In particular, the structural role of each area becomes evident and a classification of \\emph{connector} areas VS \\emph{provincial} areas becomes now possible. Among the most prominent examples of the former are the posterio-ventral hippocampus (i.e. 38) whose physical centrality is recovered as a functional centrality, the parietal association cortex (i.e. 33) which connects all the sensory areas (i.e. the rhinal, auditory and visual ones) and the orbitofrontal cortex (i.e.31) whose physical connections are mirrored by a high degree of functional (inter)-connectivity (e.g. it connects the thalamus and the frontal association cortex).\n\n\\section{Conclusions}\n\nIn this paper we have presented the results of a network theory-based analysis of a large mouse fMRI dataset, aimed at assessing the hierarchical modular structure of resting state functional connectivity networks in this species. In order to overcome the limitations of currently available techniques, we propose a modified percolation analysis that retains the information on all the connected components of a given network. Our variation of the percolation analysis takes into account negative correlations, and does not require the application of a threshold to binarize the connectivity networks.\n\nOur technique, straightforwardly applicable to experimental correlation matrices, reveals a hierarchically organized modular structure that does not appear in a null model defined by constraining the distribution of the observed correlations. Notably, conventional percolation analysis shows the presence of multiple percolation thresholds also in the null model, thus suggesting that results based on the giant connected component alone maybe misleading.\n\nOur percolation analysis represents a generalization of the classical one. Indeed, while each step of the classical percolation analysis is always mappable into a step of our method, the reverse is not true, since the detection of a newly disconnected module from a secondary component would be completely missed.\n\nWe have also computed the Minimal Spanning Forest (MSF) and the Minimal Spanning Tree (MST) for our population-wise mouse brain. The latter represents a faster alternative to the usual community detection techniques, since it identifies modules on the basis of the strengths of their internal correlations. The MSF reveals both intra- and inter-hemispherical modules, and the presence of small, tightly coupled modules alongside with larger subnetworks characterized by weaker internal links. The MST, on the other hand, enables the classification of connector and provincial areas.\n\nOur results indicate that the tools provided by network theory indeed provide additional, non-trivial information on the topology of functional connectivity networks from the mouse brain. This work can be straightforwardly extended to the study of the human brain.\n\n\\section*{Appendix}\n\n\\subsection*{\\it ROI - Regions of interest}\n\nThe list of the neuroanatomical ROI considered for our analysis, together with their abbreviation, is the following (alphabetical order). Fig. \\ref{figA1} shows the ROI mapped into a mouse brain.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{FigureSI3.pdf}\n\\caption{The neuroanatomical ROI considered for our analysis, mapped into a mouse brain.}\n\\label{figA1}\n\\end{figure}\n\n\\begin{enumerate}\n\\item Acb: accumbens nucleus\\_dx;\n\\item Acb: accumbens nucleus\\_sx;\n\\item AdHC: anterio-dorsal hippocampus\\_dx;\n\\item AdHC: anterio-dorsal hippocampus\\_sx;\n\\item Amy: amygdala\\_dx;\n\\item Amy: amygdala\\_sx;\n\\item Au: auditory cortex\\_dx;\n\\item Au: auditory cortex\\_sx;\n\\item BF: basal forebrain\\_dx;\n\\item BF: basal forebrain\\_sx;\n\\item BNST: bed nucleus of stria terminals\\_dx;\n\\item BNST: bed nucleus of stria terminals\\_sx;\n\\item Cg: cingulate cortex\\_dx;\n\\item Cg: cingulate cortex\\_sx;\n\\item Collicoli: collicoli\\_dx;\n\\item Collicoli: collicoli\\_sx;\n\\item Cpu: caudate putamen\\_dx;\n\\item Cpu: caudate putamen\\_sx;\n\\item DG: dentate gyrus\\_dx;\n\\item DG: dentate gyrus\\_sx;\n\\item FrA: frontal association cortex\\_dx;\n\\item FrA: frontal association cortex\\_sx;\n\\item Hypo: hypothalamus\\_dx;\n\\item Hypo: hypothalamus\\_sx;\n\\item Ins: insular cortex\\_dx;\n\\item Ins: insular cortex\\_sx;\n\\item M: motor cortex\\_dx;\n\\item M: motor cortex\\_sx;\n\\item mPFC: medial prefrontal cortex\\_dx;\n\\item mPFC: medial prefrontal cortex\\_sx;\n\\item OFC: orbitofrontal cortex\\_dx;\n\\item OFC: orbitofrontal cortex\\_sx;\n\\item Parietal\\_Ass: parietal association cortex\\_dx;\n\\item Parietal\\_Ass: parietal association cortex\\_sx;\n\\item pDG: posterior dentate gyrus\\_dx;\n\\item pDG: posterior dentate gyrus\\_sx;\n\\item pHC: posterio-ventral hippocampus\\_dx;\n\\item pHC: posterio-ventral hippocampus\\_sx;\n\\item Pir: piriform cortex\\_dx;\n\\item Pir: piriform cortex\\_sx;\n\\item Rhinal: rhinal cortex\\_dx;\n\\item Rhinal: rhinal cortex\\_sx;\n\\item RS: retrosplenial cortex\\_dx;\n\\item RS: retrosplenial cortex\\_sx;\n\\item S1: primary somatosensory cortex\\_dx;\n\\item S1: primary somatosensory cortex\\_sx;\n\\item S2: secondary somatosensory cortex\\_dx;\n\\item S2: secondary somatosensory cortex\\_sx;\n\\item TeA: temporal association cortex\\_dx;\n\\item TeA: temporal association cortex\\_sx;\n\\item Th: thalamus\\_dx;\n\\item Th: thalamus\\_sx;\n\\item Vctx: visual cortex\\_dx;\n\\item Vctx: visual cortex\\_sx.\n\\end{enumerate}\n\n\\subsection*{\\it From time series to correlation matrices}\n\nOur data consist of 41 sets of 54 fMRI BOLD-signals each, collected as the time series shown in fig. \\ref{figA2}.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{FigureSI1.pdf}\n\\includegraphics[width=0.5\\textwidth]{FigureSI2.pdf}\n\\caption{fMRI BOLD-signals corresponding to the right cingulate cortex (top) and left cingulate cortex (bottom) of the brain BE\\_ag130207a.}\n\\label{figA2}\n\\end{figure}\n\nThe information carried by each mouse-specific set of time series has been condensed into a correlation matrix, whose generic entry $C_{ij}$ is the Pearson coefficient between time series $X^i$ and $X^j$, defined as\n\n\\begin{eqnarray}\nC_{ij}&=&\\frac{\\mbox{Cov}[X^i, X^j]}{\\sqrt{\\mbox{Var}[X^i]\\cdot\\mbox{Var}[X^j]}}=\\nonumber\\\\\n&=&\\frac{\\sum_{t=1}^T(X_t^i-m^i)(X^j_t-m^j)}{\\sqrt{\\sum_{t=1}^T(X^i_t-m^i)^2\\cdot\\sum_{t=1}^T(X^j_t-m^j)^2}}\n\\end{eqnarray}\n\n\\noindent where $m^i=\\frac{\\sum_{t=1}^TX^i_t}{T}$ and $T$ is the total temporal length of the series.\n\\newline\n\\newline\n\\indent In order to create an average adjacency matrix describing brain functional connectivity at the population level, subject-wise matrices were first Fisher-transformed, i.e.\n\n\n", "itemtype": "equation", "pos": 18269, "prevtext": "\n\n\\title{Hierarchical organization of functional connectivity in the mouse brain: a complex network approach}\n\\author{Giampiero Bardella, Angelo Bifone, Andrea Gabrielli, Alessandro Gozzi, Tiziano Squartini}\n\\institute{Giampiero Bardella, Andrea Gabrielli, Tiziano Squartini$^*$\\at\n                Istituto dei Sistemi Complessi ISC-CNR, Universit\\'a ``Sapienza'' di Roma, P.le A. Moro 5, 00185 Rome, Italy.\n\\\\\n                IMT Institute for Advanced Studies Lucca, P.zza S. Ponziano 6, 55100 Lucca, Italy.\n\\\\\n\t    Alessandro Gozzi, Angelo Bifone\\at\n\t    Italian Institute of Technology, Universit\\'a di Trento, C.so Bettini 31, I-38068 Trento, Italy.\n\\\\\n              $^*$\\email{tiziano.squartini@imtlucca.it}\n}\n\\date{Received: date / Accepted: date}\n\n\\maketitle\n\n\\begin{abstract}\nThis paper represents a contribution to the study of the brain functional connectivity from the perspective of complex networks theory. More specifically, we apply graph theoretical analyses to provide evidence of the modular structure of the mouse brain and to shed light on its hierarchical organization. We propose a novel percolation analysis and we apply our approach to the analysis of a resting-state functional MRI data set from 41 mice. This approach reveals a robust hierarchical structure of modules persistent across different subjects. Importantly, we test this approach against a statistical benchmark (or null model) which constrains only the distributions of empirical correlations. Our results unambiguously show that the hierarchical character of the mouse brain modular structure is not trivially encoded into this lower-order constraint. Finally, we investigate the modular structure of the mouse brain by computing the Minimal Spanning Forest, a technique that identifies subnetworks characterized by the strongest internal correlations. This approach represents a faster alternative to other community detection methods and provides a means to rank modules on the basis of the strength of their internal edges.\n\\keywords{brain networks \\and percolation analysis \\and null models \\and minimal spanning forest}\n\n\\end{abstract}\n\n\\section{Introduction}\n\nThe brain can be represented as a network of connected elements at different spatial scales, from individual neurons to macroscopic, functionally specialized structures \\cite{martijn,yao,bullmore,sporns,bifons}. Interestingly, neuroimaging data, like those obtained with functional Magnetic Resonance Imaging (fMRI) techniques, naturally lend themselves to a network representation, thus attracting the interest of both graph-theorists and network scientists towards a study of the topological properties of brain connectivity structures \\cite{wang}. Indeed, correlations between fMRI signals arising from responses to stimuli or from spontaneous fluctuations in the brain resting-state can be interpreted as a measure of functional connectivity between remote brain regions and represented as edges in a graph. Moreover, alterations in the strength and structure of functional connectivity networks have been observed in groups of patients suffering from several brain diseases, including Alzheimer, Autism and Schizophrenia, thus providing potential markers of neuropsychiatric illness \\cite{martijn,liska,biswal,rosazza,zhang,fox}.\n\nOf particular interest is the study of the modular structure of these networks, i.e. the presence of clusters of nodes that are more tightly connected among themselves than with nodes in other network substructures \\cite{martijn,yao,lambio,achab,lazaros}. A modular structure has been observed for different types of brain networks (functional and structural) and in different species, including humans, primates and rodents \\cite{liska,achab,lazaros,bifone}. Functional connectivity networks derived from fMRI experiments in human subjects exhibit a hierarchical structure of modules-within-modules \\cite{bullmore,sporns}. It has been suggested that hierarchical modularity may confer important evolutionary and adaptive advantages to the human brain by providing intermediate modules that can respond to the evolutionary or environmental pressure without jeopardizing the function of the entire system \\cite{simon}. A similar hierarchical organization has been observed in other species, e.g. non-human primates, but not in lower species, like the worm \\emph{C. Elegans}, which seems to have a modular network of neurons that is not hierarchically organized \\cite{worm,worm2}. Here, we investigate the modular structure of the mouse brain and its hierarchical organization using a graph theoretical approach.\n\nPercolation analysis, a tool derived from statistical physics, provides a powerful means to investigate the hierarchical organization of networks \\cite{barabasi,null}. This approach is based on the assessment of the fragmentation of a network as weaker edges are gradually removed from the graph. A striking demonstration of this hierarchical organization is the presence of multiple percolation thresholds \\cite{lazaros}, whereby disaggregation of modules occurs abruptly for critical values of the control parameter, $p_c$. On the contrary, application of this analysis to Erd\\\"{o}s-Renyi random graphs \\cite{barabasi,bollobas,null} shows a single threshold value, separating two phases characterized by different topological features. Below the threshold (i.e. for $p<p_c$) several tree-like components are observed whose size is of the order of $\\ln N$ - with $N$ the total number of nodes. Above the threshold (i.e. for $p>p_c$), instead, a single giant component appears, whose structure admits cycles and from which tree-like structures (whose size is again of the order of $\\ln N$) are excluded \\cite{barabasi,bollobas}.\n\n\\begin{figure}[t!]\n\\centering\n\\hspace{1.5mm}\\includegraphics[scale=0.381,angle=-90]{Figure1a.pdf}\\\\\n\\includegraphics[width=0.45\\textwidth,angle=-90]{Figure1b.pdf}\n\\caption{Dendrogram and correlation matrix for the average brain, induced by the dissimilarity measure $D_{ij}=1-C_{ij},\\:\\forall\\:i, j$.}\n\\label{fig1}\n\\end{figure}\n\nHere we have analyzed functional connectivity networks constructed from a large resting state fMRI dataset from mice to assess the presence of multiple percolation thresholds. Specifically, we have applied standard percolation analysis and variations thereof to assess the hierarchical modular structure in this species. Importantly, we have applied novel approaches to avoid some of the pitfalls that may affect more conventional analysis of functional connectivity networks. Indeed, it will be shown that traditional percolation detects a modular structure even in random networks, thus making it necessary to introduce a null model in order to correctly asses the statistical significance of the percolation analysis. Here we introduce a novel null model, independent of the choice of a particular threshold and resting exclusively on the information encoded into the correlation matrix. Moreover, we propose the use of an algorithm to calculate the closest correlation matrix to a given symmetric matrix, thus ensuring that the proposed null model has the peculiar features of a proper correlation matrix.\n\nWe have complemented our percolation analysis by computing the Minimal Spanning Forest (MSF). Althought the MSF is not, by itself, a community detetction technique, it represents a faster alternative for the identification of modules, defined by the strength of the functional relations between nodes. Such modules can be, in turn, linked to obtain the Minimal Spanning Tree (MST), which provides the ``backbone'' of the mouse brain functional connectivity.\n\nThese methodological developments make it possible to assess the presence of a hierarchically-organized modular structure in the mouse brain, both at the level of population and of individual subjects.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.45\\textwidth]{Figure2.pdf}\n\\caption{Empirical CDF of the correlations for the average brain (blue trend) and CDF of a gaussian distribution whose means and standard deviations have been estimated through the maximum-of-the-likelihood procedure (red trend).}\n\\label{fig2}\n\\end{figure}\n\n\\section{Methods}\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.467\\textwidth]{Figure3a.pdf}\\\\\n\\hspace{3mm}\\includegraphics[width=0.45\\textwidth]{Figure3b.pdf}\n\\caption{Comparison between the usual percolation analysis (top panel) and our modified percolation analysis (bottom panel) run on the average brain (red trend), on a randomized version of it, retaining the same empirical distribution of correlations (brown trend) and on the ensemble-averaged matrix (green trend). While the usual percolation analysis detects a hierarchical modular structure even on the null model, thus making it difficult to asses the statistical significance of the observed patterns, our modified percolation analysis enables discrimination between the real and the random cases.}\n\\label{fig3}\n\\end{figure}\n\n\\subsection{Data acquisition and data pre-processing}\n\nThe data-set used for this analysis has been reported in a recent paper \\cite{liska,sfora}, where experimental details are extensively described. In short, MRI experiments were performed on male 20-24 week old C57BL/6J (B6) mice ($n=41$, Charles River, Como, Italy). Mice were anaesthetised with isoflurane (5\\% induction), intubated and artificially ventilated under 2\\% isoflurane maintenance anesthesia. All experiments were performed with a 7.0 T MRI scanner (Bruker Biospin, Milan) using an echo planar imaging (EPI) sequence with the following parameters: TR/TE 1200/15 ms, flip angle 30 degrees, matrix $100\\times100$, field of view $2\\times2$ cm$^2$, 24 coronal slices, slice thickness 0.50 mm, 300 volumes and a total rsfMRI acquisition time of 6 minutes. All experiments were conducted in accordance with the Italian law (DL 116, 1992 Ministero della Sanit\\'a, Roma) and the recommendations in the ``Guide for the Care and Use of Laboratory Animals'' of the National Institutes of Health. Animal research protocols were also reviewed and consented to by the animal care committee of the Istituto Italiano di Tecnologia (permit 07-2012). All surgical procedures were performed under anesthesia.\n\nThe mouse brain was parcellated into 54 macro-regions (27 per hemisphere) described in the Appendix. Resting state fMRI signals from individual image voxels were averaged across each region of interest (ROI) to generate 54 time-series of approximately 300 s duration. The 54 collected time-series were pairwise correlated calculating the Pearson coefficient and organized in a $54\\times54$ symmetric matrix describing the resting-state connectivity network for each mouse.\n\nImage preprocessing was carried out using tools from FMRIB Software Library (FSL, v5.0.6 \\cite{wtw1,jenk}) and AFNI (v2011\\_12\\_21\\_1014 \\cite{wtw2}). RsfMRI time series were despiked (AFNI/3dDespike), corrected for motion (AFNI/3dvolreg) and spatially normalised to an in-house C57Bl/6J mouse brain template \\cite{sfora2} (FSL/FLIRT,12 degrees of freedom). The normalised data had a spatial resolution of $0.2\\times0.2\\times0.5$ mm$^3$ ($99\\times99\\times24$ matrix). Head motion traces and mean ventricular signal (averaged fMRI time course within a manually-drawn ventricle mask) were regressed out of each of the timeseries (AFNI/3dDeconvolve). To assess theeffectof global signal removal, separate rsfMRI time series with the whole-brain average time course regressed out were also generated. All rsfMRI time series were spatially smoothed (AFNI/3dmerge, Gaussian kernel of full width at half maximum of 0.5 mm) and band-pass filtered to a frequency window of 0.01-0.08 Hz (AFNI/3dBandpass) \\cite{sfora2}.\n\nIn order to create an average adjacency matrix describing brain functional connectivity at the population level, subject-wise matrices were first Fisher-transformed, averaged across subjects and then back-transformed.\n\n\\subsection{Percolation analysis}\n\nThe percolation analysis proposed by Makse et al. \\cite{lazaros} includes the following steps: {\\it a)} a threshold parameter $p$, ranging between 0 and 1 (and thus interpretable as a probability), is chosen; {\\it b)} the links corresponding to the correlations below the threshold are removed and the size of the giant component $C$ (i.e. the largest connected component) is computed; {\\it c)} the parameter $p$ is varied and $C$ is evaluated for different thresholds.\n\nThis procedure ignores the complex evolution of the structure of the whole network, which is not captured by the giant component only. This becomes a relevant issue when the classical percolation is applied to small networks, i.e. to networks for which no giant component is clearly distinguishable: in this case the signal provided by this kind of analysis may be rather noisy, thus misrepresenting the modular structure of the brain at the global level.\n\n\\begin{figure}[t!]\n\\centering\n\\hspace{3mm}\\includegraphics[width=0.435\\textwidth]{Figure4a.pdf}\\\\\n\\vspace{5mm}\n\\includegraphics[width=0.45\\textwidth]{Figure4b.pdf}\n\\caption{In order to assess the statistical significance of the results of our modified percolation analysis, a test is needed. Top panel represents the test statistics we have chosen: the slope of the percolation plot of both the average brain (red trend) and of a randomized version of it, retaining the same empirical distribution of correlations (brown trend). Bottom panel: ensemble distribution of our test statistics; the red point represents the (statistically significant) observed value of the latter.}\n\\label{fig4}\n\\end{figure}\n\nIn order to overcome this drawback, we propose a variation of the percolation analysis along the following lines: {\\it a)} all experimentally determined correlation coefficients are listed in increasing order; {\\it b)} starting from the lowest value, each entry in the list is chosen as a threshold; {\\it c)} all the links corresponding to the correlations below the threshold are removed; {\\it d)} the number of connected components characterizing the remaining part of the network is computed. \n\nBeside providing a much more precise picture of the dynamics of the brain at the global level, our variation of the percolation analysis is also more robust, since our signal results from the fragmentation of many different components at the same time and is thus less prone to the statistical noise which, instead, accompanies the fragmentation of the giant component only.\n\nMoreover, while each step of the classical percolation analysis is always mappable into a step of our method, the reverse is not true: the detection of a newly disconnected module from a secondary component would be missed by the classical percolation analysis (which focuses on the giant component only).\n\n\\subsection{A statistical benchmark for mice brains}\n\nIn order to define to what extent the stepwise structure highlighted by the percolation analysis is significant, we need to compare the results with a proper statistical benchmark. In other words, in order to understand whether the ``stepwise behavior'' is a mere consequence of lower- order constraints or a genuine sign of self-organization we need to define a proper null model.\n\nAs a first step, we have calculated the empirical probability distributions of the entries of the correlation matrix characterizing each subject in our sample and fitted them to normal distributions, whose means and standard deviations were estimated through the maximum-of-the-likelihood procedure. We have also repeated this analysis for the average mouse, i.e. the brain functional connectivity at the population level. In all cases, the distributions of the elements of the correlation matrices appeared to be well behaved, with nearly Gaussian distributions.\n\n\\begin{figure*}[t!]\n\\centering\n\\includegraphics[width=0.26\\textwidth]{Figure5a.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5b.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5c.pdf}\\\\\n\\includegraphics[width=0.26\\textwidth]{Figure5d.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5e.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5f.pdf}\\\\\n\\includegraphics[width=0.26\\textwidth]{Figure5g.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5h.pdf}\n\\includegraphics[width=0.26\\textwidth]{Figure5i.pdf}\n\\caption{Each group of areas detected by our percolation analysis in correspondence of a given correlation value is composed by many sub-modules, whose presence is evidenced by rising the threshold value. A clear example is provided by the blue area detected for $r_{th}=0.51$, comprising the anterio-dorsal hippocampus, the dentate gyrus and the posterior dentate gyrus - i.e. areas 3, 4, 19, 20, 35, 36. Upon rising the threshold to $r_{th}=0.52$, two subgroups appear, composed respectively by the right and left parts - i.e. 3, 19, 35 and 4, 20, 36 - of the aforementioned areas (evidenced in blue and purple). Further rising the threshold to $r_{th}=0.6$, the two subgroups reveal a core structure defined by the pairs 19, 35 and 20, 36. This finding confirms the hierarchical character of the mouse brain modular structure. See also the map of the neuroanatomical ROI in Appendix.}\n\\label{fig5}\n\\end{figure*}\n\nSecondly, we have generated a ``null brain'', by drawing correlations from the corresponding normal distributions. However, this procedure does not guarantee that true correlation matrices, which should be positive-definite, are obtained: in fact, although the synthetic matrices can be chosen to be sym-metric and with unitary elements on the main diagonal, they may still have negative eigenvalues. This problem can be solved by implementing the procedure illustrated in \\cite{higham} where a fast algorithm for comput- ing the nearest correlation matrix to a given, symmetric, one is described. The last step of our method consists in the implementation of this procedure.\n\n\\section{Results}\n\n\\subsection{Average correlation matrix}\n\nWe first focus on the average correlation matrix, defined by the sample mean (i.e. over all individuals) of each back-transformed pair-specific correlation coefficient. Fig. \\ref{fig1} shows the average correlation matrix whose rows and columns have been reordered according to the \\emph{dissimilarity measure}\n\n\n", "index": 1, "text": "\\begin{equation}\nD_{ij}=1-C_{ij},\\:\\forall\\:i, j.\n\\label{dissp}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"D_{ij}=1-C_{ij},\\&gt;\\forall\\&gt;i,j.\" display=\"block\"><mrow><mrow><msub><mi>D</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mrow><mn>1</mn><mo>-</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow><mo rspace=\"4.7pt\">,</mo><mrow><mo rspace=\"4.7pt\">∀</mo><mi>i</mi></mrow><mo>,</mo><mi>j</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07574.tex", "nexttext": "\n\n\\noindent then averaged across subjects \n\n\n", "itemtype": "equation", "pos": 35396, "prevtext": "\n\nThe algorithm we have adopted proceeds by computing, at each step, the minimum dissimilarity between pairs of areas and clustering them together. In other words, clusters are grouped according to the minimum intercluster dissimilarity, a linkage rule also known as ``single-linkage'' clustering \\cite{single}. The same algorithm can be used to generate the corresponding dendrogram.\n\nWhile negative correlations are pronounced in subject-wise matrices they tend to be averaged-out in the population-wise matrix, whose terms are all positive. Although this confirms the larger inter-subject variability of negative correlations with respect to the positive ones, it affects the nested structure of the average matrix, which is far less pronounced than for the single individuals: nonetheless, nested red square-shaped patterns along the diagonal are still clearly visible.\n\nThe distribution of edge values of the average matrix is shown in fig. \\ref{fig2}, alongside with the normal distribution whose mean and variance have been estimated through the maximum-of-the-likelihood procedure. The deviation of the distribution of experimentally-determined correlations form the normal distribution is larger for this matrix than for the individual ones.\n\n\\paragraph{Percolation analysis.}\n\nThe results of the classical and modified percolation analyses are shown in fig. \\ref{fig3}. \n\nOur method identifies multiple steps for increasing threshold, corresponding to the stable partitions of the network \\cite{martijn,lazaros} highlighted in fig. \\ref{fig5}. The plateaus indicate the presence of connections whose removal does not affect the number of connected components, indicating that these links are not critical in determining the structure of functional correlations.\n\nFig. \\ref{fig5}, shows that each connected group of areas detected in correspondence of a given correlation value is composed by many nested modules, whose hierarchical organization emerges form the application of  higher thresholds. Two main groups of areas can be clearly identified (colored in blue and green in fig. \\ref{fig5} and detected for $r_{th}\\simeq0.45$). The first group (colored in green) regions include the cingulate cortex, the motor cortex, the medial prefrontal cortex and the primary somatosensory cortex \\cite{martijn,liska,rosazza}. The second group (colored in blue) is constituted by areas 3, 4, 19, 20, 35 and 36 (i.e. anterio-dorsal hippocampus, the right dentate gyrus and the right posterior gyrus), all parts of the hippocampal formation.\n\nUpon rising the threshold to $r_{th}=0.52$, sub-areas appear: for example, the hippocampus splits into right and left part - i.e. 3, 19, 35 and 4, 20, 36 (evidenced in blue and purple); further rising the threshold to $r_{th}=0.6$, the two latter subgroups reveal a core structure defined by the pairs 19, 35 and 20, 36. An analogous result is found for the sensory system, confirming the hierarchical character of the mouse brain modular structure.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.55\\textwidth]{Figure6.pdf}\n\\caption{Result of the MSF algorithm mapped into the average mouse brain areas. The algorithm works by first sorting the observed correlations in decreasing order and then linking pairs of areas sequentially, with the only limitation that each new link must connect at least one previously disconnected area. Colors correspond to the average correlation value of the links defining each tree composing the forest. See also the map of the neuroanatomical ROI in Appendix.}\n\\label{fig6}\n\\end{figure}\n\nInterestingly, the percolation curve for the null model shows a remarkably different trend. Indeed, drawing a matrix (whose distribution of correlations coincides with the observed one for the average mouse) from our ensemble and repeating our percolation analysis leads to a single, sharper transition, with basically no plateaus. This indicates that rising the threshold value leads to the sequential disconnection of individual nodes, which are removed one after the other. This supports the idea that the hierarchical structure observed for the brain connectivity network is genuine, as the stepwise behavior does not emerge in a null model with similar distribution of correlations (the same conclusion holds true for the individual-wise matrices as well).\n\nWhile this is reassuring, a statistical test is needed to quantify the significance of the experimental trend with respect to the null hypothesis. Our choice of such test moves from the observation that the experimental trend is less steep than the one obtained by running the null model. For this reason, the test statistics we have computed is the steepness of the experimental trend, measured between two points: the pairs $(r'_{th}, 2)$ and $(r''_{th}, 53)$, with $r'_{th}$ and $r''_{th}$ indicating the values of correlations in correspondence of which we detect 2 and 53 communities respectively (we have deliberately excluded the trivial communities represented by the whole brain and the single areas/nodes). The ensemble distribution of our test statistics is shown in fig. \\ref{fig4}, together with the experimental point: the latter lies well outside the $95\\%$ confidence intervals.\n\\newline\n\\newline\n\\indent On the other hand, as evident upon inspecting fig. \\ref{fig3}, classical percolation, in which only the size of the largest component is monitored, detects multiple thresholds in both the experimental network and in the network generated according to our null model. Although this finding provides a significant evidence of the structural differences between the observed average brain and an Erd\\\"os-Renyi-like graph, for example, it also implies that the claim according to which,  in this ``classical'' version of percolation, revealing multiple thresholds is, by itself, a proof of the hierarchical modular structure of a network is arguable. Indeed, recovering the presence of steps also in the null model seems to suggest that the dynamics of the giant component is (at least) partially encoded into the correlations distributions, while this is no longer true when considering also the remaining components, implying that one of the genuine signatures of the brain self-organization lies in their dynamics.\n\n\\paragraph{Minimal Spanning Forest.} \n\nThe MSF algorithm is defined by two simple steps: {\\it a} the observed correlations are sorted in reverse order; {\\it b)} starting from the largest observed correlation, a link is drawn between the corresponding brain areas. This is done sequentially, with the limitation that any new connection must link at least one previously completely disconnected area.\n\nAt each step of the MSF algorithm, either a previously isolated area is assigned to an existing group or two previously isolated areas are linked together. In this way, ``communities'' remain naturally defined by the strength of their internal correlations, while redundant connections are discarded. In particular two different communities are eventually connected by edges whose correlation value is smaller than all the links of both communities. Althought the MSF is not, by itself, a community detetction technique, it provides a means to hierarchically order modules based on the strength of their internal edges. Such modules are tree-shaped and provide information on the structural importance of each area (e.g. its betweeness centrality).\n\nThe MSF of average brain is shown in fig. \\ref{fig6}. Our analysis reveals that presence of both inter- and intra-hemispheric modules. The module with the strongest internal connectivity is the medial-prefrontal cortex, consistent with the finding that this bilateral structure persists in the percolation analysis at high values of the threshold. The second and third modules in the MSF rank are the right and left hippocampal formation. Interestingly, larger, inter-hemisferic modules, like the one comprising frontal and orbitofrontal cortices, caudate putamen and the amygdala, are characterized by more numerous, but weaker links. Altogether, the MSF structure reflects the hierarchical organization of connectivity modules revealed by our percolation analysis. \n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Figure7.pdf}\n\\caption{MST of our average mouse brain. The MST has been built by connecting the trees of the MSF, with the only limitation that any newly-added link must connect a pair of previously-disconnected trees: a consequence of the MST algorithm is that the correlations within the trees are, on average, higher than the correlations between the trees. The MST also allows us to distinguish between connector and provincial areas. See also the map of the neuroanatomical ROI in Appendix.}\n\\label{fig7}\n\\end{figure}\n\nRemarkably, the insular cortex and the secondary somatosensory cortices are found within the same tree, thus showing that the reciprocal structural connectivity among these areas results in a consistent pattern of functional connectivity which has been recently described also using voxelwise community detection approaches \\cite{liska}. Similarly, the thalamus is found to be strongly linked to the bed nucleus of stria terminals, consistent with the reciprocal neuroanatomical links connecting these regions \\cite{choi}. Interestingly, our MSF reveals a strong functional connection between the visual cortex and the retrosplenial cortex (i.e. between areas 43, 44, 53 and 54), an area that has been recognized as fundamental in tasks like orientation, head movement and processing of visual cues \\cite{maguire}. As a last example, the MSF suggests  a role for the temporal association cortex (i.e. 49, 50) in the coordination of the sensori stimuli \\cite{squire}, receiving inputs from  the auditory and the rhinal corteces (i.e. 7, 8 and 41, 42).\n\\newline\n\\newline\n\\indent Once the MSF has been built, we can use the remaining correlations in the list to build the Minimal Spanning Tree (MST). As for the forest, only one limitation exists: any new added link must connect a pair of previously-disconnected trees (which become part of the same tree afterwards). Naturally, the links \\emph{between} trees are weaker than the links \\emph{within} trees and the MSF can be recovered upon removing the weakest links.\n\nThe information provided by the MSF can be thus complemented by the information provided by the MST, which gives a clear picture of the mouse brain connectivity skeleton. In particular, the structural role of each area becomes evident and a classification of \\emph{connector} areas VS \\emph{provincial} areas becomes now possible. Among the most prominent examples of the former are the posterio-ventral hippocampus (i.e. 38) whose physical centrality is recovered as a functional centrality, the parietal association cortex (i.e. 33) which connects all the sensory areas (i.e. the rhinal, auditory and visual ones) and the orbitofrontal cortex (i.e.31) whose physical connections are mirrored by a high degree of functional (inter)-connectivity (e.g. it connects the thalamus and the frontal association cortex).\n\n\\section{Conclusions}\n\nIn this paper we have presented the results of a network theory-based analysis of a large mouse fMRI dataset, aimed at assessing the hierarchical modular structure of resting state functional connectivity networks in this species. In order to overcome the limitations of currently available techniques, we propose a modified percolation analysis that retains the information on all the connected components of a given network. Our variation of the percolation analysis takes into account negative correlations, and does not require the application of a threshold to binarize the connectivity networks.\n\nOur technique, straightforwardly applicable to experimental correlation matrices, reveals a hierarchically organized modular structure that does not appear in a null model defined by constraining the distribution of the observed correlations. Notably, conventional percolation analysis shows the presence of multiple percolation thresholds also in the null model, thus suggesting that results based on the giant connected component alone maybe misleading.\n\nOur percolation analysis represents a generalization of the classical one. Indeed, while each step of the classical percolation analysis is always mappable into a step of our method, the reverse is not true, since the detection of a newly disconnected module from a secondary component would be completely missed.\n\nWe have also computed the Minimal Spanning Forest (MSF) and the Minimal Spanning Tree (MST) for our population-wise mouse brain. The latter represents a faster alternative to the usual community detection techniques, since it identifies modules on the basis of the strengths of their internal correlations. The MSF reveals both intra- and inter-hemispherical modules, and the presence of small, tightly coupled modules alongside with larger subnetworks characterized by weaker internal links. The MST, on the other hand, enables the classification of connector and provincial areas.\n\nOur results indicate that the tools provided by network theory indeed provide additional, non-trivial information on the topology of functional connectivity networks from the mouse brain. This work can be straightforwardly extended to the study of the human brain.\n\n\\section*{Appendix}\n\n\\subsection*{\\it ROI - Regions of interest}\n\nThe list of the neuroanatomical ROI considered for our analysis, together with their abbreviation, is the following (alphabetical order). Fig. \\ref{figA1} shows the ROI mapped into a mouse brain.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{FigureSI3.pdf}\n\\caption{The neuroanatomical ROI considered for our analysis, mapped into a mouse brain.}\n\\label{figA1}\n\\end{figure}\n\n\\begin{enumerate}\n\\item Acb: accumbens nucleus\\_dx;\n\\item Acb: accumbens nucleus\\_sx;\n\\item AdHC: anterio-dorsal hippocampus\\_dx;\n\\item AdHC: anterio-dorsal hippocampus\\_sx;\n\\item Amy: amygdala\\_dx;\n\\item Amy: amygdala\\_sx;\n\\item Au: auditory cortex\\_dx;\n\\item Au: auditory cortex\\_sx;\n\\item BF: basal forebrain\\_dx;\n\\item BF: basal forebrain\\_sx;\n\\item BNST: bed nucleus of stria terminals\\_dx;\n\\item BNST: bed nucleus of stria terminals\\_sx;\n\\item Cg: cingulate cortex\\_dx;\n\\item Cg: cingulate cortex\\_sx;\n\\item Collicoli: collicoli\\_dx;\n\\item Collicoli: collicoli\\_sx;\n\\item Cpu: caudate putamen\\_dx;\n\\item Cpu: caudate putamen\\_sx;\n\\item DG: dentate gyrus\\_dx;\n\\item DG: dentate gyrus\\_sx;\n\\item FrA: frontal association cortex\\_dx;\n\\item FrA: frontal association cortex\\_sx;\n\\item Hypo: hypothalamus\\_dx;\n\\item Hypo: hypothalamus\\_sx;\n\\item Ins: insular cortex\\_dx;\n\\item Ins: insular cortex\\_sx;\n\\item M: motor cortex\\_dx;\n\\item M: motor cortex\\_sx;\n\\item mPFC: medial prefrontal cortex\\_dx;\n\\item mPFC: medial prefrontal cortex\\_sx;\n\\item OFC: orbitofrontal cortex\\_dx;\n\\item OFC: orbitofrontal cortex\\_sx;\n\\item Parietal\\_Ass: parietal association cortex\\_dx;\n\\item Parietal\\_Ass: parietal association cortex\\_sx;\n\\item pDG: posterior dentate gyrus\\_dx;\n\\item pDG: posterior dentate gyrus\\_sx;\n\\item pHC: posterio-ventral hippocampus\\_dx;\n\\item pHC: posterio-ventral hippocampus\\_sx;\n\\item Pir: piriform cortex\\_dx;\n\\item Pir: piriform cortex\\_sx;\n\\item Rhinal: rhinal cortex\\_dx;\n\\item Rhinal: rhinal cortex\\_sx;\n\\item RS: retrosplenial cortex\\_dx;\n\\item RS: retrosplenial cortex\\_sx;\n\\item S1: primary somatosensory cortex\\_dx;\n\\item S1: primary somatosensory cortex\\_sx;\n\\item S2: secondary somatosensory cortex\\_dx;\n\\item S2: secondary somatosensory cortex\\_sx;\n\\item TeA: temporal association cortex\\_dx;\n\\item TeA: temporal association cortex\\_sx;\n\\item Th: thalamus\\_dx;\n\\item Th: thalamus\\_sx;\n\\item Vctx: visual cortex\\_dx;\n\\item Vctx: visual cortex\\_sx.\n\\end{enumerate}\n\n\\subsection*{\\it From time series to correlation matrices}\n\nOur data consist of 41 sets of 54 fMRI BOLD-signals each, collected as the time series shown in fig. \\ref{figA2}.\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{FigureSI1.pdf}\n\\includegraphics[width=0.5\\textwidth]{FigureSI2.pdf}\n\\caption{fMRI BOLD-signals corresponding to the right cingulate cortex (top) and left cingulate cortex (bottom) of the brain BE\\_ag130207a.}\n\\label{figA2}\n\\end{figure}\n\nThe information carried by each mouse-specific set of time series has been condensed into a correlation matrix, whose generic entry $C_{ij}$ is the Pearson coefficient between time series $X^i$ and $X^j$, defined as\n\n\\begin{eqnarray}\nC_{ij}&=&\\frac{\\mbox{Cov}[X^i, X^j]}{\\sqrt{\\mbox{Var}[X^i]\\cdot\\mbox{Var}[X^j]}}=\\nonumber\\\\\n&=&\\frac{\\sum_{t=1}^T(X_t^i-m^i)(X^j_t-m^j)}{\\sqrt{\\sum_{t=1}^T(X^i_t-m^i)^2\\cdot\\sum_{t=1}^T(X^j_t-m^j)^2}}\n\\end{eqnarray}\n\n\\noindent where $m^i=\\frac{\\sum_{t=1}^TX^i_t}{T}$ and $T$ is the total temporal length of the series.\n\\newline\n\\newline\n\\indent In order to create an average adjacency matrix describing brain functional connectivity at the population level, subject-wise matrices were first Fisher-transformed, i.e.\n\n\n", "index": 3, "text": "\\begin{equation}\nz_{ij}=\\frac{1}{2}\\ln\\left(\\frac{1+C_{ij}}{1-C_{ij}}\\right)=\\mbox{arctanh}(C_{ij}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"z_{ij}=\\frac{1}{2}\\ln\\left(\\frac{1+C_{ij}}{1-C_{ij}}\\right)=\\mbox{arctanh}(C_{%&#10;ij}),\" display=\"block\"><mrow><mrow><msub><mi>z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mn>1</mn><mo>+</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow><mrow><mn>1</mn><mo>-</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mfrac><mo>)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mtext>arctanh</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07574.tex", "nexttext": "\n\n\\noindent (i.e. the generic entry of the average Fisher-transformed matrix is the arithmetic mean of the corresponding individual entries, $z^1_{ij}$, $z^2_{ij}\\dots z^{54}_{ij}$) and then back-transformed:\n\n\n", "itemtype": "equation", "pos": 35555, "prevtext": "\n\n\\noindent then averaged across subjects \n\n\n", "index": 5, "text": "\\begin{equation}\n\\overline{z}_{ij}=\\frac{\\sum_{n=1}^{54}z_{ij}^n}{54},\\:\\forall\\:i,j\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\overline{z}_{ij}=\\frac{\\sum_{n=1}^{54}z_{ij}^{n}}{54},\\&gt;\\forall\\&gt;i,j\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi>z</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>=</mo><mn>1</mn></mrow><mn>54</mn></msubsup><msubsup><mi>z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mi>n</mi></msubsup></mrow><mn>54</mn></mfrac><mo rspace=\"4.7pt\">,</mo><mrow><mo rspace=\"4.7pt\">∀</mo><mi>i</mi></mrow><mo>,</mo><mi>j</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07574.tex", "nexttext": "\n\n\\begin{acknowledgements}\nWe acknowledge support from the EU project FET-Open FOC (grant num. 255987), the FET project SIMPOL (grant num. 610704) and the FET project DOLFINS (grant num. 640772).\n\\end{acknowledgements}\n\n\\begin{thebibliography}{99}\n\\bibitem{martijn} M. P. van den Heuvel, H. E. Hulshoff Pol, \\emph{Exploring the brain network: a review on resting-state fMRI functional connectivity}, European Neuropsychopharmacology {\\bf 20}, 519-534 (2010).\n\\bibitem{yao} Z. Yao, Y. Xie, P. Moore, J. Zheng, \\emph{A review of structural and functional brain networks: small world and atlas}, Brain Informatics {\\bf 2}(9), doi:10.1007/s40708-015-0009-z (2015).\n\\bibitem{bullmore} E. Bullmore, O. Sporns, \\emph{Complex brain networks: graph theoretical analysis of structural and functional systems}, Nature Reviews Neuroscience {\\bf 10}, 186-198 (2010).\n\\bibitem{sporns} O. Sporns, R. Betzel, \\emph{Modular brain networks}, Annual Review of Psychology {\\bf 67}(19), 1-28 (2016).\n\\bibitem{bifons} C. Nicolini, A. Bifone, \\emph{Modular structure of brain networks: breaking the resolution limit by surprise}, Scientific Reports {\\bf 6}(19250), doi:10.1038/srep19250 (2016).\n\\bibitem{wang} C. Li, H. Wang, W. de Haan, C. J. Stam, P. Van Mieghem, \\emph{The correlation of metrics in complex networks with applications in functional brain networks}, Journal of Statistical Mechanics: Theory and Experiment {\\bf P11018}, doi:10.1088/1742-5468/2011/11/P11018 (2011).\n\\bibitem{liska} A. Liska, A. Galbusera, A. J. Schwarz, A. Gozzi, \\emph{Functional connectivity hubs of mouse brain}, NeuroImage, doi:10.1016/j.neuroimage.2015.04.033 (2015).\n\\bibitem{sfora} F. Sforazzini, A.J. Schwarz, A. Galbusera, A. Bifone, A. Gozzi, \\emph{Distributed BOLD and CBV-weighted resting-state networks in the mouse brain}, NeuroImage {\\bf 87}, 403-415 (2014).\n\\bibitem{biswal} B. Biswal, F. Z. Yetkin, V. M. Haughton, J. S. Hyde, \\emph{Functional connectivity in the motor cortex of resting human brain using echo-planar MRI}, Magnetic Resonance in Medicine {\\bf 34}, 537-541 (1995).\n\\bibitem{rosazza} C. Rosazza, L. Minati, \\emph{Resting-state brain networks: literature review and clinical applications}, Neurological Science {\\bf 32}, 773-785, doi:10.1007/s10072-011-0636-y (2011).\n\\bibitem{zhang} D. Zhang, M. E. Raichle, \\emph{Disease and the brain's dark energy}, Nature Reviews Neurology {\\bf 6}, 15-28 (2010).\n\\bibitem{fox} M. D. Fox, M. Grecius, \\emph{Clinical applications of resting state functional connectivity}, Frontiers in Systems Neuroscience {\\bf 4}(19) (2010).\n\\bibitem{lambio} D. Meunier, R. Lambiotte, E. Bullmore, \\emph{Modular and hierarchically modular organization of brain networks}, Frontiers in Neuroscience {\\bf4}(200), doi:10.3389/fnins.2010.00200 (2010).\n\\bibitem{achab} S. Achard, R. Salvador, B. Whitcher, J. Suckling, E. Bullmore, \\emph{A resilient, low-frequency, small-world human brain functional network with highly connected association cortical hubs}, The Journal of Neuroscience {\\bf26}(1), 63-72 (2006).\n\\bibitem{lazaros} L. K. Gallos, H. A. Makse, M. Sigman, \\emph{A small world of weak ties provides optimal global integration of self-similar modules in functional brain networks}, Proceedings of the National Academy of Science {\\bf 109}(8), 2825-2830 (2012).\n\\bibitem{bifone} A. Bifone, A. Gozzi, A. J. Schwarz, \\emph{Functional connectivity in the rat brain: a complex network approach}, Magnetic Resonance Imaging, 1200-9, doi:10.1016/j.mri.2010.07.001 (2010).\n\\bibitem{simon} H. Simon, \\emph{The architecture of complexity}, Proceedings of the American Philosophical Society {\\bf 106}(6), 467-482 (1962).\n\\bibitem{worm} N. Chatterjee, S. Sinha, \\emph{Understanding the mind of a worm: hierarchical network structure underlying nervous system function in C. elegans}, in Progress in Brain Research {\\bf 168}(12), 145-153 (2008).\n\\bibitem{worm2} J. G. White, E. Southgate, J. N. Thomson, S. Brenner, \\emph{The  structure  of  the  nervous  system  of  the\nnematode C. elegans}, Philosophical Transactions of the Royal Society of London B {\\bf 314}, 1-340 (1986).\n\\bibitem{barabasi} R. Albert, A.-L. Barabasi, \\emph{Statistical mechanics of complex networks}, Reviews of Modern Physics {\\bf 74}, 47-97 (2002).\n\\bibitem{bollobas} B. Bollobas, \\emph{Random Graphs}, Cambridge University Press (2001).\n\\bibitem{null} S. M. Hadi Hosseini, S. R. Kesler, \\emph{Influence of choice of null network on small-world parameters of structural correlation networks}, PLoS ONE {\\bf8}(6): e67354 (2013).\n\\bibitem{wtw1} http://fsl.fmrib.ox.ac.uk/fsl/.\n\\bibitem{jenk} M. Jenkinson, C. F. Beckmann, T. E. Behrens, M. W. Woolrich, S. M. Smith, \\emph{Fsl}, NeuroImage {\\bf 62}, 782-790 (2012).\n\\bibitem{wtw2} http://afni.nimh.nih.gov/afni/.\n\\bibitem{sfora2} F. Sforazzini, A. Bertero, L. Dodero, G. David, A. Galbusera, M. L. Scattoni, M. Pasqualetti, A. Gozzi, \\emph{Altered functional connectivity networks in acallosal and socially impaired BTBR mice}. Brain Structure and Function, 1-14 (2014).\n\\bibitem{higham} N. J. Higham, \\emph{Computing the nearest correlation matrix - a problem from finance}, IMA Journal of Numerical Analysis {\\bf 22}, 329-343 (2002).\n\\bibitem{single} F. Murtagh, P. Contreras, \\emph{Algorithms for hierarchical clustering: an overview}, Wiley Interdisciplinary Reviews: Data Mining and Knowledge Discovery {\\bf 2}(1), 86-97 (2012).\n\\bibitem{maguire} S. D. Vann, J. P. Aggleton, E. A. Maguire, \\emph{What does the retrosplenial cortex do?}, Nature Reviews {\\bf 10}, 792-803 (2009).\n\\bibitem{choi} D. Choi, A. Furay, N. Evanson, M. Ostrander, Y. Ulrich-Lai, J. Herman, \\emph{Bed nucleus of the stria terminalis subregions differentially regulate hypothalamic-pituitary-adrenal axis activity: implications for the integration of limbic inputs}. Journal of Neuroscience {\\bf 27}(8) (2007).\n\\bibitem{squire} L. R. Squire, C. E. Stark, R. E. Clark, \\emph{The medial temporal lobe}. Annual Review of Neuroscience {\\bf 27}, 279-306 (2004).\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 35864, "prevtext": "\n\n\\noindent (i.e. the generic entry of the average Fisher-transformed matrix is the arithmetic mean of the corresponding individual entries, $z^1_{ij}$, $z^2_{ij}\\dots z^{54}_{ij}$) and then back-transformed:\n\n\n", "index": 7, "text": "\\begin{equation}\n\\overline{C}_{ij}=\\mbox{tanh}(\\overline{z}_{ij}),\\:\\forall\\:i,j.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\overline{C}_{ij}=\\mbox{tanh}(\\overline{z}_{ij}),\\&gt;\\forall\\&gt;i,j.\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>C</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mrow><mtext>tanh</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>z</mi><mo>¯</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.7pt\">,</mo><mrow><mo rspace=\"4.7pt\">∀</mo><mi>i</mi></mrow><mo>,</mo><mi>j</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]