[{"file": "1601.04176.tex", "nexttext": "\nIn Fig.~\\ref{fig:kbi} we summarize NIPAm-methanol $G_{pm}$ and NIPAm-water $G_{pw}$ excess coordination over\nfull molar concentration range of methanol $x_m$.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth,angle=0]{G_PNP_xm.eps}\n\\end{center}\n\\caption{Kirkwood-Buff integral $G_{ij}$ showing NIPAm-methanol $G_{pm}$ and NIPAm-water $G_{pw}$ excess coordination as a function of\nmethanol molar fraction $x_m$. Lines are the polynomial fits to the data that are drawn to guide the eye.\nFor pure solvent at $x_c = 0.0$ and pure cosolvent at $x_c = 1.0$, individual\ncoordinations $G_{pm}$ and $G_{pw}$ are undefined, respectively. Horizontal dashed line is\ndrawn to show $G_{ij} = 0$. The data corresponding to the ambient pressure is taken from Ref.~\\cite{mukherji13mac}.\n\\label{fig:kbi}}\n\\end{figure}\nIdeally ${\\rm G}_{ij}$ should be taken from the plateau at $r \\to \\infty$. Moreover, we estimate ${\\rm G}_{ij}$ values by taking\naverages between $0.9~{\\rm nm} < r < 1.5~{\\rm nm}$. Note that the typical correlation lengths in these systems are of the\norder of $1.5~{\\rm nm}$. It can be seen that - in comparison to NIPAm-water excess coordination, NIPAm-methanol still shows preferentiability even at\n500 MPa. However, it is reduced by a factor of two. It is interesting to observe that the polymer opens up even when there remains\npreferentiability. In this context, it is still important to mention that the fully collapsed structure needs a certain fraction of methanol\nmolecules within the solvation volume. Reduction in this fraction may not lead to a well collapsed conformation.\nInstead, occasionally, one expects to observe a fluctuation in the extended polymer conformations, where instantaneous bridging may occur\n(forming loops) due to a small fraction of methanol molecules within the solvation shell of PNIPAm.\n\nTo better quantify this reduced preferentiability one can translate the information presented in Fig.~\\ref{fig:kbi} into chemical potential\nof PNIPAm $\\mu_p$, which can be calculated using \\cite{rosgen05bio},\n\n", "itemtype": "equation", "pos": 16606, "prevtext": "\n\n\\begin{center}\n{\\bf Why does high pressure destroy co-non-solvency of PNIPAm in aqueous methanol?}\n\\end{center}\n\n\\begin{center}\n\n{Tiago E. de Oliveira and Paulo A. Netz}\n\n{\\it Max-Planck Institut f\\\"ur Polymerforschung, Ackermannweg 10, 55128 Mainz Germany}\n{\\it Universidade Federal do Rio Grande do Sul, Porto Alegre, Brazil}\n\n\\vspace*{0.2in}\n\n{Debashish Mukherji{\\footnote {mukherji@mpip-mainz.mpg.de}} and Kurt Kremer{\\footnote {kremer@mpip-mainz.mpg.de}}}\n\n{\\it Max-Planck Institut f\\\"ur Polymerforschung, Ackermannweg 10, 55128 Mainz Germany} \n\n\\end{center}\n\n\\vspace*{0.2in}\n\n{\\bf Abstract:}\nIt is well known that poly(N-isopropylacrylamide) (PNIPAm) exhibits an interesting, yet puzzling, phenomenon of co-non-solvency.\nCo-non-solvency occurs when two competing good solvents for PNIPAm, such as water and alcohol,\nare mixed together. As a result, the same PNIPAm collapses within intermediate mixing ratios.\nThis complex conformational transition is driven by preferential binding of methanol with PNIPAm.\nInterestingly, co-non-solvency can be destroyed when applying high hydrostatic pressures.\nIn this work, using a large scale molecular dynamics simulation employing high pressures,\nwe propose a microscopic picture behind the suppression of co-non-solvency phenomenon.\nBased on thermodynamic and structural analysis, our results suggest that the preferential binding of methanol with\nPNIPAm gets partially lost at high pressures, making the background fluid reasonably homogeneous for the polymer. This\nis consistent with the hypothesis that the co-non-solvency phenomenon is driven by preferential binding and is not based on depletion effects.\n\n\\pagebreak\n\n\\section{Introduction}\n\nPoly(N-isopropylacrylamide) (PNIPAm) is a so called smart polymer that responds to a wide range of external stimuli, such as\ntemperature, cosolvents, ionic strengths, and pressures. One of the most fascinating and puzzling phenomenon of\nPNIPAm is its ability to exhibit co-non-solvency \\cite{schild91mac,zhang01prl,walter12jpcb,koj12jpsb,tanaka08prl,mukherji13mac,mukherji14natcom}.\nWhen a sample of PNIPAm is dissolved in mixtures of water and alcohol under ambient conditions, it collapses when the\ncomposition of solvent mixtures are between $5-40\\%$ of alcohol concentration \\cite{schild91mac,zhang01prl,walter12jpcb,koj12jpsb}. Understanding this complex\nstructural transition is not only scientifically challenging \\cite{mukherji13mac,mukherji14natcom}, but also has\na wide variety of applicabilities that range from physics to biology \\cite{cohen10natmat,ward11poly,sissi14natcom}.\nIn this context, it has been recently shown that the co-non-solvency can only be explained by the preferential binding\nof one of the cosolvent components with the polymer. In other words, the competitive displacement of\ncosolvent components play a significant role in describing co-non-solvency \\cite{mukherji14natcom,mukherji15jcp}.\nIt was suggested that when a very small amount of the better cosolvent is added into the dilute aqueous polymer solution,\nthese better cosolvents bind two monomers potentially far along the backbone forming segmental loops.\nThis loop formation initiates the process leading to a final well collapsed structure of the polymer. Interestingly, this preferential\ncosolvent binding can also explain the reopening of the polymers at high cosolvent concentrations by the complete decoration of polymer with\ncosolvents \\cite{mukherji14natcom,mukherji15jcp}.\n\nAnother surprising phenomenon of PNIPAm is when they are exposed to high hydrostatic pressures.\nIt was experimentally observed that when a collapsed PNIPAm between $5-40\\%$ of\nalcohol concentration is put under high hydrostatic pressures at 298 K, co-non-solvency gets completely destroyed. As a consequence,\na PNIPAm chain only remains in the expanded coil state, irrespective of the water-methanol mixing concentrations \\cite{hofmann14pol}.\nThe present work is the first attempt to give a detailed microscopic picture of this interesting pressure induced reopening of PNIPAm\nunder co-non-solvency condition. We use large scale molecular dynamics simulations to study the\nconformational transition of PNIPAm in aqueous methanol employing high hydrostatic pressures. We perform thermodynamic and\nstructural analysis to propose a microscopic origin of this high pressure effect.\n\nThe remainder of the paper is organized as follows: in section \\ref{sec:metho} we briefly state the methodology for simulations and\nsection \\ref{sec:result} presents results and discussion. Finally we draw our conclusions in section \\ref{sec:conclu}.\n\n\\section{Simulation Method and Model}\n\\label{sec:metho}\n\nIn this study we employ all atom molecular dynamics simulations using GROMACS package \\cite{gro}.\nWe use the Gromos96 force field \\cite{groms} for methanol, the SPC/E water model \\cite{spce}\nand the force field parameters for PNIPAm are taken from Ref.~\\cite{walter12jpcb}.\nThe temperature is set to 298 K using a Berendsen thermostat with a coupling constant 0.1 ps.\nThe time step for the simulations is chosen as 1fs. Unless stated otherwise results are shown for the ambient\nand 500 MPa pressures. However, in some cases, we have also performed simulations at 100 MPa and 200 MPa\nto systematically test the pressure effects. It should be noted that the all atom\nforce field used here has reasonably good transferability over a wide range of pressures and temperatures \\cite{per01jpca}.\nThe pressure coupling is done using a Berendsen barostat\\cite{berend} with a coupling time of 0.5 ps.\nThe electrostatics are treated using Particle Mesh Ewald \\cite{pme}. The interaction cutoff is chosen as 1.4nm.\n\nWe use a PNIPAm chain of length $N = 32$ solvated in a simulation box consisting of $2 \\times 10^4$ solvent molecules\nat 25\\% methanol molar concentration $x_m$, i.e. $0.5\\times 10^4$ methanol and $1.5\\times 10^4$ water molecules, respectively.\nIn some cases, we have also performed simulations over full concentration range of methanol, ranging from pure water $x_m = 0.0$\nto pure methanol $x_m = 1.0$.\nThis system size is large enough to maintain solvent equilibrium between the local region within the\nvicinity of polymer and the bulk aqueous methanol solution. Note that maintaining solvent equilibrium in molecular simulations is a\nparamount task, which is most severe when the polymer collapse and expansion is driven by\nstrong local concentration fluctuations of different solvent components.\nThis can either be achieved by using a grand-canonical-like approach \\cite{mukherji13mac} or\nby using a large simulation box \\cite{mukherji12jctclet}. Mid-sized simulation domains are prone to system size effects and, therefore,\nmay lead to unphysical structural fluctuations.\nEvery initial configuration is equilibrated for 50ns under ambient\npressure. The production runs are performed for 450 ns at 298 K and varying pressures.\nDuring the production run observables such as end-to-end distance $R_{ee}$, pair distribution\nfunction ${\\rm g}_{ij}(r)$, Kirkwood-Buff integral $G_{ij}$ and potential of mean force $V_{\\rm PMF} (r)$ are calculated.\nThe time scale of simulation used here is approximately one order of magnitude larger than the conformational relaxation time of a PNIPAm chain,\nwhich is estimated by calculating the end-to-end autocorrelation function $\\left<R_{ee}(t)\\cdot R_{ee}(0)\\right>$.\n\n\\section{Results and Discussions}\n\\label{sec:result}\n\n\\subsection{Polymer conformation under high pressures}\n\nWe start our discussion by presenting the central result of this paper, which is the structure of polymer at\nhigh pressures. The initial configurations are generated by performing a simulation starting from a completely extended PNIPAm\nstructure at 298 K temperature and ambient pressure. In Fig.~\\ref{fig:ree_t}(a) the green curve (for $t < 50~{\\rm ns}$) presents the time evolution of polymer end-to-end\ndistance $R_{ee}$ during equilibration.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.49\\textwidth,angle=0]{end_to_end_combine.eps}\n\\end{center}\n\\caption{Part (a) shows the time evolution of polymer end-to-end distance $R_{ee}$. The results are shown for a\nchain length $N_l = 32$ and at a methanol concentration of 25\\%. Initial equilibration starts with a\ncompletely extended configuration of PNIPAm at a temperature of 298 K and ambient pressure (represented by green curve). A pressure of 500 MPa\npressure is employed beginning at 50ns (represented by the red arrow). Two vertical dashed lines are drawn to present different\ntime regimes during polymer reopening. Between $50~{\\rm ns} < t <150~{\\rm ns}$ the polymer remains fully collapsed, for $150~{\\rm ns} < t < 300~{\\rm ns}$\nthe end loops get open and finally polymer completely opens up for $t > 300~{\\rm ns}$. Part (b) presents the static structure factor $S(q)$\nof a PNIPAm backbone for $t > 300~{\\rm ns}$. Note that for the calculation of $S(q)$ only alkane backbone was considered.\n\\label{fig:ree_t}}\n\\end{figure}\nThe structure collapses within 25 ns of MD run. Then we further monitor the collapsed structure for\nanother 25 ns to identify any unphysical fluctuations, which showed a rather stable collapsed conformation.\nThe last frame of this initially equilibrated sample was used for the production runs\nunder high pressures. The blue curve in Fig.~\\ref{fig:ree_t}(a) presents time evolution of $R_{ee}$ at 500 MPa calculated over a 450 ns simulation trajectory.\nIt can be appreciated that the polymer remains within a completely globular state for almost $100~{\\rm ns}$, with a\ndistinctly prominent stable polymer loop (see simulation snapshots in Fig.~\\ref{fig:mov}).\nThe first expansion occurs at around $150~{\\rm ns}$ when the end loop opens up. The complete opening of polymer chain\noccurs for $t > 300~{\\rm ns}$. A sequence of simulation snapshots is presented in Fig.~\\ref{fig:mov}.\nThus our simulations could correctly capture the features observed in the high pressure experiments \\cite{hofmann14pol}.\n\n\\begin{figure}[h!]\n\\begin{center}\n\\includegraphics[width=0.28\\textwidth,angle=0]{movie.eps}\n\\end{center}\n\\caption{Sequence of snapshots for a PNIPAm chain of length $N_l = 32$ at different times as measured during the\nsimulations. To better represent the polymer conformation, we render alkane backbone with spheres.\n\\label{fig:mov}}\n\\end{figure}\n\nFurthermore, to confirm that we are indeed getting a well extended structure at 500 MPa, we look into the scaling law of static structure factor for\na PNIPAm chain at 500 MPa, which should support a scaling law $S(q) \\sim q^{-1/\\nu}$ with $\\nu = 3/5$ being the Flory exponent \\cite{degennesbook,desclobook}.\nIn Fig.~\\ref{fig:ree_t}(b) we show $S(q)$ for a PNIPAm chain at 500 MPa and calculated from the MD trajectory for $t > 300~ns$.\nIndeed, the data in the range $4~{\\rm nm}^{-1} < q < 20~{\\rm nm}^{-1}$ can be reasonably well described by a scaling exponent $\\nu = 5/3$\nknown from the self avoiding random walk \\cite{degennesbook,desclobook}. This range falls within the length scale of $1.6$ nm and $0.4$ nm.\nConsidering that the gyration radius $R_g \\sim 1.7$ nm, the observed length scale is satisfactory.\nMoreover, it should also be mentioned that ideally a good estimate of $S(q)$ requires long chains and here we are simulating a rather short chain\nof $N_l = 32$ (or approximately 10 persistence lengths). Therefore, while the data in Fig.~\\ref{fig:ree_t}(b) is certainly not good enough to derive an\naparent exponent, it is reasonable to clearly mark an extended chain.\n\nHere, we also want to comment on the range of pressures used here and in the experiments \\cite{hofmann14pol}. It should be\nnoted that a pressure of upto 200 MPa was used in Ref. \\cite{hofmann14pol}. However, thus far, we have only presented results for 500 MPa.\nTherefore, in Fig.~\\ref{fig:ree_press} we show a systematic dependence of $R_{ee}$ on pressure. It can be appreciated that the\npolymer reaches a fully extended state (represented by $R_{ee} \\sim 4.5$) at $P \\ge 200~{\\rm MPa}$. This gives a very good\ncomparison with the experimental results. For $P = 100~{\\rm MPa}$, however, we find a semi-collapsed structure\n(with  $R_{ee} \\sim 3.0$) for up to 450ns, the typical simulation time scale investigated here.\n\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.43\\textwidth,angle=0]{ree_press_err.eps}\n\\end{center}\n\\caption{Polymer end-to-end distance $R_{ee}$ as a function of applied pressure $P$ for a PNIPAm chain of length $N_l = 32$ and\nat a temperature of 298 K.\n\\label{fig:ree_press}}\n\\end{figure}\n\nThe observed prominent loops (see Fig.~\\ref{fig:mov}) in our all atom simulations is reminiscent of the proposed mechanism\nof polymer collapse transition in mixed good solvents \\cite{mukherji14natcom}. It is known that the loops are\nformed because of the bridging methanol molecules that can bind two distinctly far monomers along the\nbackbone \\cite{mukherji14natcom}. Therefore, if the bridging is getting destroyed at high pressures, then there\nmust also be a disruption of methanol-polymer interaction to facilitate the opening of a PNIPAm chain. Therefore,\nto establish a microscopic picture of the high pressure effects, we first look into the structure of the water and methanol within the solvation\nvolume of the polymer.\n\n\\subsection{Coordination and excess coordination numbers}\n\nIn this section we perform structural analysis of the polymer solution.\nFor this purpose we calculate the radial distribution function ${\\rm g}_{ij}(r)$ between\nsolution components. To obtain better convergence in ${\\rm g}_{ij}(r)$, we have simulated a single monomer of\nPNIPAm (represented as NIPAm) at a 25\\% methanol-water mixture.\nIn Fig.~\\ref{fig:g_of_r} we present NIPAm-methanol and NIPAm-water ${\\rm g}_{ij}(r)$ for two\ndifferent pressures.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.37\\textwidth,angle=0]{g_of_r_compare.eps}\n\\end{center}\n\\caption{Radial distribution function ${\\rm g}_{ij}(r)$ showing NIPAm-methanol and NIPAm-water coordination\nfor two different pressures. Simulations are performed at a temperature of 298 K.\n\\label{fig:g_of_r}}\n\\end{figure}\nIt is aparent from the plot that - while methanol coordination reduces partially within the first solvation shell (at around 0.5nm),\nthe coordination of water increases. This suggests that the methanol is getting partially replaced by water within the solvation shell\nof the PNIPAm.\n\nFurthermore, in table~\\ref{tab:num} we present an estimate of the change in coordination number between\nNIPAm and bulk solution components.\n\\begin{table}[h!]\n\\caption{A table listing various solute-solvent pairs with their respective coordination calculated using\n$n = 4\\pi\\int_0^{0.5} g_{ij}(r)r^2 dr$, bulk solution number density of solution components $\\rho$ and the\ncoordination numbers $n\\rho$.}\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|}\n\\hline\nPairs at different pressures & $n$ (${\\rm nm}^3$) & $\\rho$ (${\\rm nm}^{-3}$)& $n\\rho$ \\\\\\hline\n\\hline\nNIPAm-Methanol ambient &0.4718  &  6.7749 &  3.1964 \\\\\nNIPAm-Methanol 500 MPa &0.4758  &  7.8068 &  3.7145 \\\\\nNIPAm-Water ambient &0.2352  & 20.3248 &  4.7804 \\\\\nNIPAm-Water 500 MPa &0.3123  & 23.4204 &  7.3142 \\\\\n\\hline\n\\end{tabular}  \\label{tab:num}\n\\end{center}\n\\end{table}\nIt can be appreciated that with increasing pressure the coordination number of NIPAm-methanol only increases by about 16\\%,\nwhereas NIPAm-water increase by 54\\%. This suggests that the water is replacing methanol in the solvation shell, making the\nbackground fluid more homogeneous for the polymers. This is consistent with the expanded structure of the polymer.\n\nThe density of the system increases about 15\\%\nwhen the system goes from ambient pressure to 500 MPa. It is known that this increase in density\nleads to a substantial increase of the average coordination number of water \\cite{net02},\nand also to an increase in the diffusion coefficient at low temperatures \\cite{net04}, but at high temperatures the\neffect of the pressure on the diffusion coefficient is the opposite. Indeed, when the high pressure is applied,\nthe diffusion coefficient of water and methanol (data not shown) decrease by about 40\\% and\n50\\%, respectively. Thus suggesting that the pressure-induced replacement of methanol with water has a thermodynamic\nrather than a kinetic origin.\n\nA theory that perhaps best connects the relative intermolecular affinity and the solution thermodynamics is the\nfluctuation theory of Kirkwood and Buff (KB) \\cite{kb51jcp}. KB theory connects ${\\rm g}_{ij}(r)$\nto thermodynamic properties of solutions using the ``so called\" KB integrals or\nexcess coordinations,\n\n", "index": 1, "text": "\\begin{equation}\n{\\rm G}_{ij} = 4\\pi \\int_0^\\infty \\left[ {\\rm g}_{ij}(r) - 1\\right] r^2 dr.\n\\label{eq:kbi}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\rm G}_{ij}=4\\pi\\int_{0}^{\\infty}\\left[{\\rm g}_{ij}(r)-1\\right]r^{2}dr.\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">G</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mrow><mo>[</mo><mrow><mrow><msub><mi mathvariant=\"normal\">g</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo>]</mo></mrow><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>𝑑</mo><mi>r</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04176.tex", "nexttext": "\nwhere $\\rho_m$ is the methanol number density and $k_{\\rm B}$ is the Boltzmann constant.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth,angle=0]{chem_pot.eps}\n\\end{center}\n\\caption{Chemical potential shift per monomer $\\mu_p/N_{l}$ as a function of methanol mole fraction ${x_m}$ for\ntwo different pressures. The $\\mu_p$ is calculated by integrating the data obtained from Eq.~\\ref{eq:chempot}.\nThe data corresponding to the ambient pressure is taken from Ref.\\cite{mukherji13mac}.\n\\label{fig:chem_pot}}\n\\end{figure}\nIn Fig.~\\ref{fig:chem_pot} we show $\\mu_p$ as a function of ${x_m}$ for different $N_l$'s, calculated by integrating\nEq.~\\ref{eq:chempot}. For 500 MPa, it can be appreciated that the difference in $\\mu_p$ between NIPAm in pure methanol (or $x_m = 1.0$)\nand NIPAm in pure water (or $x_m = 0.0$) is reduced to $4k_{\\rm B}T$, which is otherwise $8k_{\\rm B}T$ under the ambient conditions.\nThus clearly indicating that by adding methanol molecules into the solution, the solvent quality is not getting as better as in the case\nof ambient pressure. Note that the methanol driven collapse of PNIPAm under ambient condition occurs when the solvent quality remains good or\neven gets increasingly better \\cite{mukherji13mac,mukherji14natcom} and that this assymetry should be of the order of $8 - 10k_{\\rm B}T$.\nTo further investigate the thermodynamic origin of this reduced preferentiability we also calculate potential of mean force in the next section.\n\nIt is yet important to mention that the polymer collapse can either be initiated by: (a) the bridging and looping\nscenario presented earlier \\cite{mukherji13mac} or (b) the depletion effects \\cite{lekerbook}. Our arguments of polymer collapse-swelling transition is based on\nthe scenario (a). However, it could also be argued that the depletion effects \\cite{lekerbook}, that are responsible for\npolymer collapse under the poor solvent conditions, may be a factor behind PNIPAm collapse in aqueous methanol mixtures under ambient pressure.\nHowever, it should be noted that when two competing good solvents are mixed together, such that the dissolved polymer\ncollapses within the intermediate mixing ratios, the collapse happens when the solvent quality remains good or even gets\nincreasingly better by the addition of better cosolvent (in this case methanol) \\cite{mukherji13mac}.\nThis makes the polymer conformation decoupled from the solvent quality. Therefore, precluding any explanation\nbased on the depletion effects that can ``only\" explain poor solvent collapse.\nFurthermore, the depletion induced attractions can only be enhanced when increasing density. Note that for 500 MPa pressure bulk solution\ndensity increases by $15\\%$.\nTherefore, if the pure depletion effects were the microscopic origin of co-non-solvency, PNIPAm would never open under the influence of\nhigher pressures. The same argument also holds to explain the reopening of PNIPAm at high methanol concentrations.\nFurther suggesting that the bridging scenario seems to be the only possible\nexplanation to co-non-solvency \\cite{mukherji13mac,mukherji14natcom,mukherji15jcp} and pressure induced reopening presented in this work.\n\n\\subsection{Potential of mean force}\n\nFinally we want to study the thermodynamic origin of this interesting conformational transition. For this purpose we have calculated\nthe potential of mean force (PMF) between solute and solvent components. The PMF is calculated using the umbrella sampling \\cite{umbrella} over a\nseries of independent simulations at 298 K temperature and 500 MPa pressure, each for a $10~{\\rm ns}$ long trajectory. The center-of-mass positions between the\nNIPAm monomer and the solvent components are generated by pulling the solvent component towards the NIPAm monomer\nusing a steered molecular dynamics algorithm. Here the spring constant is chosen as $1000~{\\rm kJ~mol^{-1} nm^{-2}}$\nand a velocity of pull was selected as $0.001~{\\rm nm~ps^{-1}}$. Between 0 and 1.65 nm we choose 120 positions that are constrained\nusing a LINCS algorithm \\cite{lincs}. The PMF is calculated by integrating the constraining forces $f_c$ using the\nexpression \\cite{sprikjcp98,kahlen14jpcb},\n\n", "itemtype": "equation", "pos": 18787, "prevtext": "\nIn Fig.~\\ref{fig:kbi} we summarize NIPAm-methanol $G_{pm}$ and NIPAm-water $G_{pw}$ excess coordination over\nfull molar concentration range of methanol $x_m$.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth,angle=0]{G_PNP_xm.eps}\n\\end{center}\n\\caption{Kirkwood-Buff integral $G_{ij}$ showing NIPAm-methanol $G_{pm}$ and NIPAm-water $G_{pw}$ excess coordination as a function of\nmethanol molar fraction $x_m$. Lines are the polynomial fits to the data that are drawn to guide the eye.\nFor pure solvent at $x_c = 0.0$ and pure cosolvent at $x_c = 1.0$, individual\ncoordinations $G_{pm}$ and $G_{pw}$ are undefined, respectively. Horizontal dashed line is\ndrawn to show $G_{ij} = 0$. The data corresponding to the ambient pressure is taken from Ref.~\\cite{mukherji13mac}.\n\\label{fig:kbi}}\n\\end{figure}\nIdeally ${\\rm G}_{ij}$ should be taken from the plateau at $r \\to \\infty$. Moreover, we estimate ${\\rm G}_{ij}$ values by taking\naverages between $0.9~{\\rm nm} < r < 1.5~{\\rm nm}$. Note that the typical correlation lengths in these systems are of the\norder of $1.5~{\\rm nm}$. It can be seen that - in comparison to NIPAm-water excess coordination, NIPAm-methanol still shows preferentiability even at\n500 MPa. However, it is reduced by a factor of two. It is interesting to observe that the polymer opens up even when there remains\npreferentiability. In this context, it is still important to mention that the fully collapsed structure needs a certain fraction of methanol\nmolecules within the solvation volume. Reduction in this fraction may not lead to a well collapsed conformation.\nInstead, occasionally, one expects to observe a fluctuation in the extended polymer conformations, where instantaneous bridging may occur\n(forming loops) due to a small fraction of methanol molecules within the solvation shell of PNIPAm.\n\nTo better quantify this reduced preferentiability one can translate the information presented in Fig.~\\ref{fig:kbi} into chemical potential\nof PNIPAm $\\mu_p$, which can be calculated using \\cite{rosgen05bio},\n\n", "index": 3, "text": "\\begin{equation}\n\\frac{1}{k_{\\rm B}T} \\left(\\frac {\\partial {\\mu}_{p}}{\\partial {\\rho}_m}\\right)_{p,T} = \\frac {{\\rm G}_{pw} -{\\rm G}_{pm}}\n{1- {\\rho}_m {\\left({\\rm G}_{mw} -{\\rm G}_{mm}\\right)}},\n\\label{eq:chempot}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{k_{\\rm B}T}\\left(\\frac{\\partial{\\mu}_{p}}{\\partial{\\rho}_{m}}\\right)_%&#10;{p,T}=\\frac{{\\rm G}_{pw}-{\\rm G}_{pm}}{1-{\\rho}_{m}{\\left({\\rm G}_{mw}-{\\rm G}%&#10;_{mm}\\right)}},\" display=\"block\"><mrow><mrow><mrow><mfrac><mn>1</mn><mrow><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>⁢</mo><msub><mrow><mo>(</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>μ</mi><mi>p</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>ρ</mi><mi>m</mi></msub></mrow></mfrac><mo>)</mo></mrow><mrow><mi>p</mi><mo>,</mo><mi>T</mi></mrow></msub></mrow><mo>=</mo><mfrac><mrow><msub><mi mathvariant=\"normal\">G</mi><mrow><mi>p</mi><mo>⁢</mo><mi>w</mi></mrow></msub><mo>-</mo><msub><mi mathvariant=\"normal\">G</mi><mrow><mi>p</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mrow><mn>1</mn><mo>-</mo><mrow><msub><mi>ρ</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><msub><mi mathvariant=\"normal\">G</mi><mrow><mi>m</mi><mo>⁢</mo><mi>w</mi></mrow></msub><mo>-</mo><msub><mi mathvariant=\"normal\">G</mi><mrow><mi>m</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04176.tex", "nexttext": "\nHere $\\left<f_{c}\\right>_{s}$ is the average force at a distance $s$ between the NIPAm and respective solvent component.\n$r_0$ represents the closest proximity that the solvent can approach a NIPAm monomer.\nThe factor $2k_{\\rm B}T/s$ is the entropic correction. The constant term is taken such that the potential goes asymptotically to\nzero at 1.4 nm.\n\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth,angle=0]{pmf_r_compare.eps}\n\\end{center}\n\\caption{Potential of mean force $V_{\\rm PMF} (r)$ showing NIPAm-methanol and NIPAm-water interaction strengths\nfor two different pressures. Simulations are performed at a temperature of 298 K.\n\\label{fig:pmf}}\n\\end{figure}\n\nIn Fig.~\\ref{fig:pmf} we show $V_{\\rm PMF} (r)$.\nLooking into the plot under ambient pressure, it becomes aparent that there exists an attractive well for NIPAm-methanol\ninteraction (represented by a black curve), whereas NIPAm-water interaction is repulsive (represented by a blue curve).\nFurthermore, when the high pressure is applied\nthe attractive well of NIPAm-methanol interaction becomes shallower, indicating a reduced attractive interacting strength between\nNIPAm and methanol at high pressure. On the other hand NIPAm-water develops a attractive well.\nThe applied pressure, therefore, could decrease the preferentiability of NIPAm-methanol interaction and, at the same time, enhancing\nthe NIPAm-water coordination, leading to polymer swelling.\n\n\\section{Conclusions}\n\\label{sec:conclu}\n\nUsing molecular dynamics simulations of an all atom model, we unveil the microscopic\norigin why the application of\nhigh hydrostatic pressures can destroy the co-non-solvency phenomenon of poly(N-isopropylacrylamide) (PNIPAm)\nin aqueous methanol mixtures \\cite{hofmann14pol}. Performing structural and thermodynamic analysis, we propose that the reopening of a\ncollapsed PNIPAm at 25\\% methanol concentration is due to the partial loss of preferential binding of methanol with PNIPAm at\nhigh pressures, which is the only key factor behind the polymer collapse in a mixture of two competing good solvents \\cite{mukherji14natcom}.\nThis reduced preferentiability makes the background fluid reasonably homogeneous for  PNIPAm.\nThus is consistent with the swollen structure of the polymer under high pressures.\nAdditionally, the results presented here, eliminates any possible explanation of co-non-solvency effect based on pure entropic effects.\nHad the collapse-swelling transition been dictated by depletion forces, polymer would have never open up under high pressures, especially\nbecause depletion forces are most severe under high pressures.\n\n\\vspace*{.2in}\n\n\\noindent\n\n{\\bf Acknowledgment}\n\nThe development of this work would not have been possible without fruitful collaboration with Carlos Marques, which we take\nthis oppurtuinity to gratefully acknowledge. We thank Walter Richtering for bringing Ref. \\cite{hofmann14pol} to our attention\nand Davide Donadio and Torsten Stuehn for many stimulating discussions.\nT.E.O. and P.A.N. acknowledges financial support from CNPq and CAPES from Brazilian Government and hospitality at the\nMax-Planck Institut f\\\"ur Polymerforschung, where this work was performed.\nWe thank Robinson Cortes-Huerto and Carlos Marques for critical reading of the manuscript.\nSimulation snapshots in this manuscript are rendered using VMD \\cite{schulten}.\n\n\\vspace*{.2in}\n\n\\begin{thebibliography}{26}\n\n\\bibitem{schild91mac}\nSchild, H. G; Muthukumar, M.; Tirrell, D. A.;\n{\\it Macromolecules} {\\bf 1991} {\\it 24}, 948.\n\n\\bibitem{zhang01prl}\nZhang, G.; Wu, C.;\n{\\it Phys. Rev. Lett.} {\\bf 2001} {\\it 86}, 822.\n\n\\bibitem{walter12jpcb}\nWalter, J.; Sehrt, J.; Vrabec, J.; Hasse, H. J.;\n{\\it J. Phys. Chem. B} {\\bf 2012} {\\it 116}, 5251.\n\n\\bibitem{koj12jpsb}\nKojima, H.; Tanaka, F.; Scherzinger, C.; Richtering, W.;\n{\\it J Pol. Sci. B} {\\bf 2012} {\\it 51}, 1100.\n\n\\bibitem{tanaka08prl}\nTanaka, F.; Koga, T.; Winnik, F. M.;\n{\\it Phys. Rev. Lett.} {\\bf 2008} {\\it101}, 028302.\n\n\\bibitem{mukherji13mac}\nMukherji, D.; Kremer, K.;\n{\\it Macromolecules} {\\bf 2013} {\\it 46}, 9158.\n\n\\bibitem{mukherji14natcom}\nMukherji, D.; Marques, C. M.; Kremer, K.;\n{\\it Nat. Commun.} {\\bf 2014} {\\it 5}, 4882.\n\n\\bibitem{cohen10natmat}\nCohen-Stuart, M. A.; Huck, W. T. S.; Genzer, J.; M\\\"uller, M.; Ober, C.; Stamm, M.; Sukhorukov, G. B.;\nSzleifer, I.; Tsukruk, V. V.; Urban, M.; Winnik, F.; Zauscher, S.; Luzinov, I.; Minko, M.;\n{\\it Nature Materials} {\\bf 2010} {\\it 9}, 101.\n\n\\bibitem{ward11poly}\nWard, M. A.; Georgiou, T. K.;\n{\\it Polymers} {\\bf 2011} {\\it 3}, 1215.\n\n\\bibitem{sissi14natcom}\nde Beer, S.; Kutnyanszky, E.; Sch\\\"on, P. M.; Vancso, G. J.; M\\\"user, M. H.;\n{\\it Nat. Commun.} {\\bf 2014} {\\it 5}, 3781.\n\n\\bibitem{mukherji15jcp}\nMukherji, D.; Marques, C. M.; Stuehn, T. Kremer, K.;\n{\\it J. Chem. Phys.} {\\bf 2015} {\\it 142}, 114903.\n\n\\bibitem{hofmann14pol}\nHofmann, C. H.; Grobelny, S.; Erlkamp, M.; Winter, R.; Richtering, W.;\n{\\it Polymer} {\\bf 2014} {\\it 55}, 2000.\n\n\\bibitem{gro}\nPronk, S.; Pall, S.; Schulz, R.; Larsson, P.; Bjelkmar, P.; Apostolov, R.; Shirts, M. R.; Smith, J. C.; Kasson, P. M.; van der Spoel, D.; Hess, B.; Lindahl, E.;\n{\\it Bioinformatics} {\\bf 2013} {\\it 29}, 845.\n\n\\bibitem{groms}\nvan Gunsteren, W. F.; Billeter, S. R.; Eising, A. A.; H\\\"unenberger, P. H.; Kr\\\"uger, P.; Mark, A. E.; Scott, W. R. P.; Tironi, I. G.;\n{\\it Hochschulverlag AG an der ETH ZÂ¨urich} (1996).\n\n\\bibitem{spce}\nBerendsen, H. J. C.; Grigera, J. R.; Straatsma, T. P.;\n{\\it J. Phys. Chem.} {\\bf 1987} {\\it 91}, 6269.\n\n\\bibitem{per01jpca}\nPereira, J. C. G.; Catlow, C. R. A.; and Price, G. D.;\n{\\it J. Phys. Chem. A} {\\bf 2001} {\\it 105}, 1909.\n\n\\bibitem{berend}\nBerendsen, H. J. C.; Postma, J. P. M.; van Gunsteren, W. F.; DiNola, A.; Haak, J. R.;\n{\\it J. Chem. Phys.} {\\bf 1984} {\\it 81}, 3684.\n\n\\bibitem{pme}\nEssmann, U.; Perera, L.; Berkowitz, M. L.; Darden, T.; Lee, H.; Pedersen, L. G. A.;\n{\\it J. Chem. Phys.} {\\bf 1995} {\\it 103} 8577.\n\n\\bibitem{mukherji12jctclet}\nMukherji, D.; van der Vegt, N. F. A.; Kremer, K.; Delle Site, L.;\n{\\it J. Chem. Theory Comput.} {\\bf 2012} {\\it 8}, 375.\n\n\\bibitem{degennesbook}\nP.-G. de Gennes,\n{\\it Scaling Concepts in Polymer Physics}\n(Cornell University Press, London, 1979).\n\n\\bibitem{desclobook}\nJ. Des Cloizeaux and G. Jannink,\n{\\it Polymers in Solution: Their Modelling and Structure}\n(Clarendon Press, Oxford, 1990).\n\n\\bibitem{net02}\nNetz, P. A.; Starr, F. W.; Barbosa, M. C.; Stanley, H. E.;\n{\\it Physica A} {\\bf 2002} {\\it 314}, 470.\n\n\\bibitem{net04}\nNetz, P. A.; Starr, F. W.; Barbosa, M. C.; Stanley, H. E.;\n{\\it Braz. J. Phys.} {\\bf 2004} {\\it 34}, 24.\n\n\\bibitem{kb51jcp}\nKirkwood, J. R.;  Buff, F. P.;\n{\\it J. Chem. Phys.} {\\bf 1951} {\\it 19}, 774.\n\n\\bibitem{rosgen05bio}\nR\\\"osgen, J.; Pettitt, B. M.; Bolen, D. W.;\n{\\it Biophys. J} {\\bf 2005} {\\it 89}, 2988.\n\n\\bibitem{lekerbook}\nH. N. W. Lekkerkerker and R. Tuinier,\n{\\it Colloids and the Depletion Interaction}\n(Clarendon Press, Oxford, 1990).\n\n\\bibitem{umbrella}\nTorrie, G. M.; Valleau, J. P.;\n{\\it J. Comp. Phys.} {\\bf 1977} {\\it 23}, 187.\n\n\\bibitem{lincs}\nHess, B.; Bekker, H.; Berendsen, H. J. C.; Fraaije, J. G. E. M.;\n{\\it J. Comp. Chem.} {\\bf 1997} {\\it 18}, 1463.\n\n\\bibitem{sprikjcp98}\nSprik, M.; Ciccoti, G.;\n{\\it J. Chem. Phys.} {\\bf 1998} {\\it 109}, 7737.\n\n\\bibitem{kahlen14jpcb}\nKahlen, J.; Salimi, L.; Sulpizi, M.; Peter, C.; and Donadio, D.\n{\\it J. Phys. Chem. B} {\\bf 2014} {\\it 118}, 3960.\n\n\\bibitem{schulten}\nHumphrey, W.; Dalke, A.; Schulten, K.;\n{\\it J. Mol. Graph.} {\\bf 1996} {\\it 14}, 33.\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 23211, "prevtext": "\nwhere $\\rho_m$ is the methanol number density and $k_{\\rm B}$ is the Boltzmann constant.\n\\begin{figure}[ptb]\n\\begin{center}\n\\includegraphics[width=0.46\\textwidth,angle=0]{chem_pot.eps}\n\\end{center}\n\\caption{Chemical potential shift per monomer $\\mu_p/N_{l}$ as a function of methanol mole fraction ${x_m}$ for\ntwo different pressures. The $\\mu_p$ is calculated by integrating the data obtained from Eq.~\\ref{eq:chempot}.\nThe data corresponding to the ambient pressure is taken from Ref.\\cite{mukherji13mac}.\n\\label{fig:chem_pot}}\n\\end{figure}\nIn Fig.~\\ref{fig:chem_pot} we show $\\mu_p$ as a function of ${x_m}$ for different $N_l$'s, calculated by integrating\nEq.~\\ref{eq:chempot}. For 500 MPa, it can be appreciated that the difference in $\\mu_p$ between NIPAm in pure methanol (or $x_m = 1.0$)\nand NIPAm in pure water (or $x_m = 0.0$) is reduced to $4k_{\\rm B}T$, which is otherwise $8k_{\\rm B}T$ under the ambient conditions.\nThus clearly indicating that by adding methanol molecules into the solution, the solvent quality is not getting as better as in the case\nof ambient pressure. Note that the methanol driven collapse of PNIPAm under ambient condition occurs when the solvent quality remains good or\neven gets increasingly better \\cite{mukherji13mac,mukherji14natcom} and that this assymetry should be of the order of $8 - 10k_{\\rm B}T$.\nTo further investigate the thermodynamic origin of this reduced preferentiability we also calculate potential of mean force in the next section.\n\nIt is yet important to mention that the polymer collapse can either be initiated by: (a) the bridging and looping\nscenario presented earlier \\cite{mukherji13mac} or (b) the depletion effects \\cite{lekerbook}. Our arguments of polymer collapse-swelling transition is based on\nthe scenario (a). However, it could also be argued that the depletion effects \\cite{lekerbook}, that are responsible for\npolymer collapse under the poor solvent conditions, may be a factor behind PNIPAm collapse in aqueous methanol mixtures under ambient pressure.\nHowever, it should be noted that when two competing good solvents are mixed together, such that the dissolved polymer\ncollapses within the intermediate mixing ratios, the collapse happens when the solvent quality remains good or even gets\nincreasingly better by the addition of better cosolvent (in this case methanol) \\cite{mukherji13mac}.\nThis makes the polymer conformation decoupled from the solvent quality. Therefore, precluding any explanation\nbased on the depletion effects that can ``only\" explain poor solvent collapse.\nFurthermore, the depletion induced attractions can only be enhanced when increasing density. Note that for 500 MPa pressure bulk solution\ndensity increases by $15\\%$.\nTherefore, if the pure depletion effects were the microscopic origin of co-non-solvency, PNIPAm would never open under the influence of\nhigher pressures. The same argument also holds to explain the reopening of PNIPAm at high methanol concentrations.\nFurther suggesting that the bridging scenario seems to be the only possible\nexplanation to co-non-solvency \\cite{mukherji13mac,mukherji14natcom,mukherji15jcp} and pressure induced reopening presented in this work.\n\n\\subsection{Potential of mean force}\n\nFinally we want to study the thermodynamic origin of this interesting conformational transition. For this purpose we have calculated\nthe potential of mean force (PMF) between solute and solvent components. The PMF is calculated using the umbrella sampling \\cite{umbrella} over a\nseries of independent simulations at 298 K temperature and 500 MPa pressure, each for a $10~{\\rm ns}$ long trajectory. The center-of-mass positions between the\nNIPAm monomer and the solvent components are generated by pulling the solvent component towards the NIPAm monomer\nusing a steered molecular dynamics algorithm. Here the spring constant is chosen as $1000~{\\rm kJ~mol^{-1} nm^{-2}}$\nand a velocity of pull was selected as $0.001~{\\rm nm~ps^{-1}}$. Between 0 and 1.65 nm we choose 120 positions that are constrained\nusing a LINCS algorithm \\cite{lincs}. The PMF is calculated by integrating the constraining forces $f_c$ using the\nexpression \\cite{sprikjcp98,kahlen14jpcb},\n\n", "index": 5, "text": "\\begin{equation}\nV_{\\rm PMF} (r) = \\int_{r_0}^r \\left[ \\left<f_{c}\\right>_{s} + \\frac {2k_{\\rm B}T}{s} \\right] ds + const..\n\\label{eq:pmf}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"V_{\\rm PMF}(r)=\\int_{r_{0}}^{r}\\left[\\left&lt;f_{c}\\right&gt;_{s}+\\frac{2k_{\\rm B}T}%&#10;{s}\\right]ds+const..\" display=\"block\"><mrow><mrow><mrow><msub><mi>V</mi><mi>PMF</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>r</mi><mn>0</mn></msub><mi>r</mi></msubsup><mrow><mrow><mo>[</mo><mrow><msub><mrow><mo>⟨</mo><msub><mi>f</mi><mi>c</mi></msub><mo>⟩</mo></mrow><mi>s</mi></msub><mo>+</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi>k</mi><mi mathvariant=\"normal\">B</mi></msub><mo>⁢</mo><mi>T</mi></mrow><mi>s</mi></mfrac></mrow><mo>]</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>s</mi></mrow></mrow></mrow><mo>+</mo><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></mrow><mo>.</mo><mo>.</mo></mrow></math>", "type": "latex"}]