[{"file": "1601.02401.tex", "nexttext": "\n\n\n\\noindent where $\\Bra{i}H\\Ket{i}$ is the potential energy of the\nsystem according to the bonding pattern defined by $\\Ket{i}$ and\nan associated classical potential. $\\Bra{i}H\\Ket{j}$, where $i\\neq j$,\nrepresents the coupling between basis states $\\Ket{i}$ and $\\Ket{j}$\nresponsible for mixing. In practice, $\\Bra{i}H\\Ket{j}$ is specified\nby an empirical function chosen to reproduce the behaviour of a higher\nlevel theoretical model.\n\nOnce the $\\mathcal{H}$ matrix has been constructed, the eigenvectors\nand eigenvalues are found. The eigenvector $\\Ket{\\Psi}=\\sum_{i}c_{i}\\Ket{i}$\nwith the lowest eigenvalue represents the ground state of the system,\nwith coefficients $c_{i}$ specifying the appropriate superposition\nof the basis states. The energy is given by $E=\\boldsymbol{c}^{T}\\mathcal{H}\\boldsymbol{c}$\nand the forces can be computed via the Hellmann-Feynman theorem\n\n\n", "itemtype": "equation", "pos": 11742, "prevtext": "\n\n\\title{A classical reactive potential for molecular clusters of sulphuric\nacid and water}\n\n\n\\author{Jake L. Stinson$^{a}$, Shawn M. Kathmann$^{b}$ and Ian J. Ford$^{a}$$^{\\ast}$\n\n}\n\n\n\n\n\\address{$^{a}$Department of Physics and Astronomy and London Centre for\nNanotechnology, University College London, Gower Street, London, WC1E\n6BT, United Kingdom}\n\n\n\\address{$^{b}$Physical Sciences Division, Pacific Northwest National Laboratory,\nRichland, Washington 99352, United States}\n\n\\begin{abstract}\nWe present a two-state empirical valence bond (EVB) potential describing\ninteractions between sulphuric acid and water molecules and designed\nto model proton transfer between them within a classical dynamical\nframework. The potential has been developed in order to study the\nproperties of molecular clusters of these species, which are thought\nto be relevant to atmospheric aerosol nucleation. The particle swarm\noptimisation method has been used to fit the parameters of the EVB\nmodel to density functional theory (DFT) calculations. Features of\nthe parametrised model and DFT data are compared and found to be in\nsatisfactory agreement. In particular, it is found that a single sulphuric\nacid molecule will donate a proton when clustered with four water\nmolecules at $\\mathrm{300}$ K and that this threshold is temperature\ndependent.\n\n\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction\\label{sec:1Introduction}}\n\nIt has long been suspected that sulphuric acid plays an important\nrole in atmospheric particle nucleation as a consequence of its affinity\nto water and its low volatility \\citep{Zhang2012}, though ammonia\nand organic species, as well as ions, are also likely to participate\n\\citep{Kulmala14}. Considerable experimental advances in characterising\nnucleation phenomena in atmospherically relevant conditions, with\nparticular emphasis on sulphuric acid, have been reported in recent\nyears \\citep{Kirkby2011,Riccobono14}. The interpretation of such\nexperimental data in order to understand behaviour over wider conditions\nis critically dependent on calculations of the free energies of clusters\nof the nucleating species. Such thermodynamic information is employed\nwithin a well-established theoretical framework of cluster growth\nand decay to predict rates of formation of stable clusters \\citep{Ford2004,Kalikmanov-book2013}.\nAlthough further processes such as cluster coalescence or removal\nalso play a role in particle formation \\citep{McGrath12}, this kinetic\nand thermodynamic framework lies at the heart of our understanding\nof the phenomenon.\n\nCluster free energies, however, are not straightforward to calculate.\nSimple models of cluster thermodynamic properties have repeatedly\nbeen sought, but often such approaches rely on an extrapolation of\nthe properties of larger droplets down to clusters consisting of only\na few molecules \\citep{girshick90,laaksonen94,kalikmanov95}. The\nprime example of such a model is classical nucleation theory (CNT)\n\\citep{Vehkamaki,Ford2004}, based on the capillarity approximation.\nCaution is necessary when using such models if they suggest that the\nnucleation rate is sensitive to the properties of very small clusters,\nsince accuracy is not to be expected \\citep{Brus2011}, though surprisingly\nit is often observed.\n\nMore advanced models of molecular clusters can be used, of course,\nthough at greater cost in computational effort. At the most fundamental\nlevel, molecular interaction models based on \\emph{ab initio} quantum\nmechanics are available. Indeed, very detailed studies have been conducted,\neven taking account of the quantum nature of the lighter nuclei present\n\\citep{Kakizaki2009,Sugawara2011} in addition to that of the electrons.\nIn a structural study of the system that we consider in this paper,\nfor example, Kakizaki \\emph{et al.} \\citep{Kakizaki2009} concluded\nthat nuclear zero point motion in clusters of sulphuric acid and water\nat 250 K gives rise to noticeably increased fluctuations and liquid-like\nbehaviour. Sugawara \\emph{et al.} \\citep{Sugawara2011} studied the\ndegree of hydration required for the dissociation of the sulphuric\nacid molecule, at the same level of theory \\citep{Arrouvel2005}.\nFurther evidence of small but significant effects of zero point motion\nin similar clusters was provided by Stinson \\emph{et al.} \\citep{stinson14}.\n\nHowever, when computing free energies using \\emph{ab initio} methods,\nthe harmonic oscillator approximation is commonly employed, based\non identifying the lowest energy cluster configuration at zero temperature\nand estimating the vibrational entropic contributions to the free\nenergy from a characterisation of the low temperature normal mode\nspectrum. Such an approach is likely to be accurate at temperatures\nwhere the cluster behaves as a vibrating solid-like structural network,\nbut would seem to be less appropriate for liquid-like systems. A more\ngeneral approach is then typically required, such as thermodynamic\nintegration \\citep{Frenkel2001} where the free energy of a system\nis compared with that of a better understood reference system at the\nsame temperature, through performing a series of canonical averages\nwith interpolating Hamiltonians, often using Monte Carlo (MC) methods.\nApproaches based on nonequilibrium molecular dynamics (MD) simulation\nhave also received attention \\citep{Ford2004c,Tang15}. Methods of\nfree energy computation are indeed rather numerous \\citep{Pohorille07}.\nIn many systems of interest, however, \\emph{ab initio} energy calculations\nare too expensive, and modelling necessarily proceeds on a more coarse\ngrained, classical level.\n\nA number of classical schemes have been employed to study clusters\nof sulphuric acid and water molecules. In an early study Kusaka \\emph{et\nal.} \\citep{Kusaka1998} developed a grand canonical MC model based\non rigid molecules and concluded that the clusters are highly non-spherical\nand that bulk-like behaviour only emerges when there are at least\n$240$ water molecules and $\\mathrm{1-3}$ molecules of sulphuric\nacid, or its dissociation product bisulphate, in the cluster. Later,\nKathmann and Hale \\citep{Kathmann2001} presented a model based\non rigid water and sulphate molecules and a free $\\mathrm{H}{}^{\\delta+}$\nion, treated within an MC approach. Ding \\emph{et al.} \\citep{DingC.-G.}\ndeveloped a flexible bonding model for sulphuric acid, bisulphate,\nhydronium and water species, which was employed by Toivola \\emph{et\nal.} \\citep{Toivola2009b} to study a quasiplanar liquid-vapour interface\nusing clusters of $\\mathrm{2000}$ molecules. Amongst other matters,\nthey found that when the sulphuric acid mole fraction is less than\n0.1, the acid molecules lie at the cluster surface and that the cluster\nstructure is strongly dependent on the number of bisulphate ions present.\n\nHowever, although mixtures of dissociated species were studied by\nToivola \\emph{et al.} \\citep{Toivola2009b}, the dynamics of the transfer\nof protons between species was not considered in the model. It is\nimportant to note that a classical potential suitable for free energy\ncomputations for clusters of sulphuric acid and water ought to be\ndesigned to describe the transfer of a proton from the acid to a water\nmolecule. Without such a capability, it is not possible to allow proton\ntransfer to take place naturally; instead, the degree of dissociation\nwould have to be fixed by hand in a given simulation.\n\nThis brings us to the aim of this study, which is to develop and parametrise\na classical potential that does offer this capability. Such a potential\nwould allow us to test the harmonic approximation in calculations\nof the free energy in sulphuric acid/water clusters at relevant atmospheric\ntemperatures. Using a classical potential that can describe the dynamics\nbeyond structural vibrations is a crucial requirement.\n\nThere are a few classical schemes available which allow reactions\nto occur. These include the Gaussian Approximation Potential (GAP)\n\\citep{Bartok2010} where a potential energy surface is constructed\nby fitting a Gaussian basis set to reference data following a Bayesian\nstatistics procedure; the ReaxFF approach \\citep{VanDuin2001} which\nuses the bond order methodology; and the empirical valence bond (EVB)\nmodel \\citep{Kamerlin2011a} based on a superposition of underlying\nclassical states of the system.\n\nThe EVB methodology is attractive for use in the sulphuric acid/water\nsystem since, as we shall see, it is based on classical potentials\nfor each species plus mixing terms, and is relatively straightforward\nto implement into existing MC or MD schemes. The methodology was introduced\nby Aqvist and Warshel \\citep{Aqvist1993} and is reviewed by Kamerlin\nand Warshel \\citep{Kamerlin2011a}. It was first developed in order\nto model proton transfer between hydronium and water species. Schmitt\nand Voth \\citep{Schmitt1998} designed a so-called multi-state\nEVB (MS-EVB) model for the simulation of systems of water molecules\ncontaining excess protons. This work was further developed into the\nMS-EVB2 \\citep{Day2002} and the MS-EVB3 \\citep{Wu2008} models. Our\nstrategy is to use the MS-EVB3 model as a framework for constructing\nan EVB model for the sulphuric acid and water system. As a simplification,\nwe limit the multiplicity of states to two (i.e. the proton may be\nattached either to a bisulphate or to the nearest appropriate water\nmolecule) making it a two level EVB approach. Multiple potential proton\ntransfers within the system are accommodated by employing the self-consistent\niterative MS-EVB (SCI-MS-EVB) model, developed by Wang and Voth\n\\citep{Wang2005} for water with excess protons. A recent summary of the EVB model in the context of modelling proton transfer in a water network is given by Knight and Voth  \\citep{Knight12}.\n\nWe describe the basis of an EVB model in Section \\ref{sec:2EVB-Method}.\nSection \\ref{sec:3EVB-model-for-SA-WA} is an account of the specific\nelements of the model developed here for sulphuric acid and water\nmixtures. A demonstration of the model is given in Section \\ref{sec:5Results}\nand in Section \\ref{sec:6Conclusion} we summarise and discuss future\napplications. The Appendix describes some technical aspects of the\nparticle swarm optimisation (PSO) fitting procedure used to parametrise\nthe model against \\emph{ab initio} calculations at the DFT level of\ntheory.\n\n\n\\section{The EVB method\\label{sec:2EVB-Method}}\n\n\n\\subsection{EVB overview}\n\n\\begin{figure*}\n\\begin{centering}\n\\includegraphics[width=1\\textwidth]{Fig1}\n\\par\\end{centering}\n\n\\protect\\caption{Illustration of two possible basis states of bonding for the same\natomic configuration. State $\\Ket{1}$ is composed of a sulphuric\nacid and a water molecule whereas state $\\Ket{2}$ contains bisulphate\nand hydronium ions. The EVB approach provides an interpolation between\nthe energy surfaces appropriate to each case. \\label{fig:1BasisSetExample}}\n\\end{figure*}\n\n\n\nIn an EVB model the potential energy of the reactive\nsystem is constructed as an interpolation between energy surfaces\ndefined for specific choices of bonding pattern. This is done in a\nfashion reminiscent of the quantum mechanics of a multilevel system,\nthough it should be emphasised that the dynamics considered are entirely\nclassical. The system is represented mathematically as a superposition\nof basis states, each representing a possible bonding pattern. For\nexample, Figure \\ref{fig:1BasisSetExample} illustrates two basis\nstates of a system corresponding to the possibility in this case that\nthe central hydrogen atom can form part of either a sulphuric acid\nmolecule on the left or a hydronium ion on the right.\n\nOnce the basis states of the system are specified, a matrix $\\mathcal{H}$\nthat resembles a Hamiltonian is constructed as follows:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\mathcal{H}_{ij}=\\Bra{i}H\\Ket{j},\\label{eq:HConstruction}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{H}_{ij}=\\Bra{i}H\\Ket{j},\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mrow><mo>⟨</mo><mi>i</mi><mo fence=\"true\">|</mo></mrow><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>j</mi><mo>⟩</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\n\n\n\\noindent where $\\boldsymbol{x}_{n}$ and $\\mathbf{F}_{n}$ indicate\nthe position and the force, respectively, for atom $n$.\n\n\n\\subsection{The MS-EVB3 model of water systems with an excess proton}\n\nThe MS-EVB3 model \\citep{Wu2008} was originally designed for simulating\nsystems of water molecules with one excess proton. The key process\nof interest is the mobility of the excess proton across hydrogen bonds\nformed between water and hydronium. Diagonal elements of the matrix\n$\\mathcal{H}$ are specified by a suitable potential for water and\nhydronium bonding patterns. Off-diagonal components of $\\mathcal{H}$\nare calculated in the following way:\n\n", "itemtype": "equation", "pos": 12709, "prevtext": "\n\n\n\\noindent where $\\Bra{i}H\\Ket{i}$ is the potential energy of the\nsystem according to the bonding pattern defined by $\\Ket{i}$ and\nan associated classical potential. $\\Bra{i}H\\Ket{j}$, where $i\\neq j$,\nrepresents the coupling between basis states $\\Ket{i}$ and $\\Ket{j}$\nresponsible for mixing. In practice, $\\Bra{i}H\\Ket{j}$ is specified\nby an empirical function chosen to reproduce the behaviour of a higher\nlevel theoretical model.\n\nOnce the $\\mathcal{H}$ matrix has been constructed, the eigenvectors\nand eigenvalues are found. The eigenvector $\\Ket{\\Psi}=\\sum_{i}c_{i}\\Ket{i}$\nwith the lowest eigenvalue represents the ground state of the system,\nwith coefficients $c_{i}$ specifying the appropriate superposition\nof the basis states. The energy is given by $E=\\boldsymbol{c}^{T}\\mathcal{H}\\boldsymbol{c}$\nand the forces can be computed via the Hellmann-Feynman theorem\n\n\n", "index": 3, "text": "\\begin{equation}\n\\mathbf{F}_{n}=-\\left\\langle {\\Psi}\\right|\\frac{\\partial H}{\\partial\\boldsymbol{x}_{n}}\\left|{\\Psi}\\right\\rangle =-\\sum_{i,j}c_{i}c_{j}\\frac{\\partial\\Bra{i}H\\Ket{j}}{\\partial\\boldsymbol{x}_{n}},\\label{eq:HellmannFeynmanTheorem}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{F}_{n}=-\\left\\langle{\\Psi}\\right|\\frac{\\partial H}{\\partial\\boldsymbol%&#10;{x}_{n}}\\left|{\\Psi}\\right\\rangle=-\\sum_{i,j}c_{i}c_{j}\\frac{\\partial\\Bra{i}H%&#10;\\Ket{j}}{\\partial\\boldsymbol{x}_{n}},\" display=\"block\"><mrow><mrow><msub><mi>𝐅</mi><mi>n</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><mo>⟨</mo><mi mathvariant=\"normal\">Ψ</mi><mo fence=\"true\">|</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>H</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>𝒙</mi><mi>n</mi></msub></mrow></mfrac><mo fence=\"true\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mo>⟩</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></munder><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>j</mi></msub><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mrow><mrow><mo>⟨</mo><mi>i</mi><mo fence=\"true\">|</mo></mrow><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>j</mi><mo>⟩</mo></mrow></mrow></mrow><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>𝒙</mi><mi>n</mi></msub></mrow></mfrac></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\nwhere $R_{{\\rm OO}}$ is the oxygen-oxygen distance in the hydrogen\nbond that includes the transferring proton, $V_{{\\rm const}}^{ij}$\nis a constant and $V_{{\\rm ex}}^{ij}$ is a representation of Coulombic\ninteractions between the ${\\rm H}_{5}{\\rm O}_{2}^{+}$ Zundel cation\nconsisting of the hydronium and water between which the proton is\nconsidered to be shared, and the remaining waters. It is given by\n\n\n", "itemtype": "equation", "pos": 13617, "prevtext": "\n\n\n\\noindent where $\\boldsymbol{x}_{n}$ and $\\mathbf{F}_{n}$ indicate\nthe position and the force, respectively, for atom $n$.\n\n\n\\subsection{The MS-EVB3 model of water systems with an excess proton}\n\nThe MS-EVB3 model \\citep{Wu2008} was originally designed for simulating\nsystems of water molecules with one excess proton. The key process\nof interest is the mobility of the excess proton across hydrogen bonds\nformed between water and hydronium. Diagonal elements of the matrix\n$\\mathcal{H}$ are specified by a suitable potential for water and\nhydronium bonding patterns. Off-diagonal components of $\\mathcal{H}$\nare calculated in the following way:\n\n", "index": 5, "text": "\\begin{equation}\n\\Bra{i}H\\Ket{j}_{i\\neq j}=(V_{{\\rm const}}^{ij}+V_{{\\rm ex}}^{ij})\\cdot A(R_{{\\rm OO}},\\mathbf{q}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\Bra{i}H\\Ket{j}_{i\\neq j}=(V_{{\\rm const}}^{ij}+V_{{\\rm ex}}^{ij})\\cdot A(R_{{%&#10;\\rm OO}},\\mathbf{q}),\" display=\"block\"><mrow><mrow><mrow><mrow><mo>⟨</mo><mi>i</mi><mo fence=\"true\">|</mo></mrow><mo>⁢</mo><mi>H</mi><mo>⁢</mo><msub><mrow><mo fence=\"true\">|</mo><mi>j</mi><mo>⟩</mo></mrow><mrow><mi>i</mi><mo>≠</mo><mi>j</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>V</mi><mi>const</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msubsup><mo>+</mo><msubsup><mi>V</mi><mi>ex</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⋅</mo><mi>A</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mi>OO</mi></msub><mo>,</mo><mi>𝐪</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\nwhere $m$ is a label for the seven atoms in the Zundel cation, $k$\nis a label for the remaining water molecules ($N_{{\\rm H_{2}O}}$\nis the total number of water molecules in the system) and $n_{k}$\nlabels the three constituent atoms of each water molecule. $q_{n_{k}}^{{\\rm H_{2}O}}$\nare the partial charges for the constituent atoms in the water molecule\nand $q_{m}^{ex}$ are partial charges describing the Zundel cation.\n$R_{mn_{k}}$ is the distance between atoms labelled by $m$ and $n_{k}$.\n\n\\begin{table}\n\n\\caption{Parameters specifying the off-diagonal matrix elements of the Hamiltonian used in the MS-EVB3 model of water-hydronium transfer \\citep{Wu2008}; $\\alpha$, $\\beta$ and $\\gamma$ from \\cite{Wu2008}, all others from \\cite{Schmitt1998}. \\label{tab:MSEVB3Values}}\n{\\begin{tabular}{ccccc}\n\\toprule\n$V_{{\\rm const}}^{ij}$ & -23.1871874  $\\mathrm{kcal/mol}$ &  & $\\beta$ & 4.5  $\\mathrm{\\textrm{\\AA}^{-1}}$\\tabularnewline\n\n$\\gamma$ & 1.85  $\\mathrm{\\textrm{\\AA}^{-2}}$ &  & $R_{{\\rm OO}}^{0}$ & 3.1  $\\mathrm{\\textrm{\\AA}}$\\tabularnewline  $P$ & 0.2327246   &  & $P'$ & 10.8831327  \\tabularnewline  ${\\rm k}$ & 9.562153  $\\mathrm{\\textrm{\\AA}^{-2}}$ &  & $\\alpha$ & 15  $\\mathrm{\\textrm{\\AA}}^{-1}$\\tabularnewline  $D_{{\\rm OO}}$ & 2.94  $\\mathrm{\\textrm{\\AA}}$ &  & $r_{{\\rm OO}}^{0}$ & 1.8136426  $\\mathrm{\\textrm{\\AA}}$\\tabularnewline\n\\botrule\n\\end{tabular}}\n\n\n\n\\end{table}\n\n\n\nThe function $A(R_{{\\rm OO}},\\mathbf{q})$ has the form\n\n\\begin{eqnarray}\n\\begin{array}{c}\nA(R_{{\\rm OO}},\\mathbf{q})=\\exp(-\\gamma\\mathbf{q}^{2})\\cdot\\left\\{ 1+P\\exp\\left[-{\\rm k}(R_{{\\rm OO}}-D_{{\\rm OO}})^{2}\\right]\\right\\} \\\\\n\\\\\n\\times\\left\\{ \\frac{1}{2}\\left\\{ 1-\\tanh\\left[\\beta(R_{{\\rm OO}}-R_{{\\rm OO}}^{0})\\right]\\right\\} +\\right.\\\\\n\\\\\n\\left.P'\\exp\\left[-\\alpha(R_{{\\rm OO}}-r_{{\\rm OO}}^{0})\\right]\\right\\} ,\\\\\n\\\\\n\\end{array}\\label{eq:MSEVBOFFD}\n\\end{eqnarray}\n\n\n\\noindent where $\\gamma$, $P$, ${\\rm k}$, $D_{{\\rm OO}}$, $\\beta$,\n$R_{{\\rm OO}}^{0}$, $P'$, $\\alpha$ and $r_{{\\rm OO}}^{0}$ are\nempirical parameters (see Table \\ref{tab:MSEVB3Values}) and $\\mathbf{q}=\\frac{1}{2}(\\mathbf{r}_{{\\rm O}1}+\\mathbf{r}_{{\\rm O}2})-\\mathbf{r}_{{\\rm H}}$\nwhere $\\mathbf{r}_{{\\rm O}1}$, $\\mathbf{r}_{{\\rm O}2}$ and $\\mathbf{r}_{{\\rm H}}$\nare the positions of the two oxygens and hydrogen, respectively, that\nparticipate in the hydrogen bond. The model is somewhat empirical\nin construction but was designed to have a number of desirable features\n\\citep{Wu2008}.\n\n\n\\subsection{The SCI-MS-EVB procedure\\label{sub:Multi-proton-extension-paper}}\n\nThe EVB method has the capacity to model systems of $n>1$ hydroniums\n(excess protons) with water, but this extension increases the size\nof $\\mathcal{H}$ to order $m^{n}$ where $m$ is the size of the\nbasis set for a single proton system. The SCI-MS-EVB model was developed\nby Wang and Voth \\citep{Wang2005} to improve the scaling of\nthe procedure with respect to $n$. This is achieved by treating the\nsystem as $n$ single excess protons in the presence of an environment\nwith a given state of bond mixing. Employing a single proton EVB methodology,\nthe state of mixing of the entire system is then given by a set of\n$n$ eigenvectors each of length $m$. The eigenvectors are corrected\niteratively as the effects of the other excess protons on the Hamiltonian\nmatrix for each of the Zundel cations are taken into account. Essentially,\nthe environment affects how the competing energy surfaces are specified.\nThe problem of analysing one matrix of order $m^{n}$ is hence reduced\nto the consideration of $n$ matrices of size $m$. The number of\niterations required to reach convergence in energy and forces is typically\nsmall. We similarly use this procedure for our system.\n\n\n\\section{EVB model for sulphuric acid and water\\label{sec:3EVB-model-for-SA-WA}}\n\nIn the following subsections we describe in some detail the construction\nof an EVB model for a system containing sulphuric acid, bisulphate,\nhydronium and water species. It is a complex narrative, but a summary\nof the procedure is provided at the end in Subsection \\ref{sub:Model-Overview}.\nIn the discussion a naming convention is used where the \\textbf{\\tt{ground state}}\nrefers to the bonding pattern that has been identified as geometrically\nthe most `natural', based upon the configuration of the atoms. \\textbf{\\tt{Excited states}}\nare bonding configurations that are identical to the \\textbf{\\tt{ground state}}\nexcept for the repositioning of one bond as a consequence of a proton\ntransfer. Therefore, it is possible to identify an \\textbf{\\tt{excited state}\n}based upon the\\textbf{ \\tt{ground state} }and the two species involved\nin a proton transfer. The species are then referred to as a \\textbf{\\tt{donor}}\n(the molecule to which the hydrogen atom is bonded in the \\textbf{\\tt{ground state}}\nand which can either be a sulphuric acid molecule or a hydronium ion),\nand an \\textbf{\\tt{acceptor}} (the molecule to which the hydrogen\natom is bonded in the \\textbf{\\tt{excited state}} and which can either\nbe a bisulphate or a water). For clarity, the terms neutral and ionised\nare used to identify the state of the sulphur-bearing species (either\nas a neutral sulphuric acid or an ionised bisulphate).\n\n\n\\subsection{Basis set size\\label{sub:Basis-set-size}}\n\nThe basis set size $m$ for each transferable proton was chosen to\nbe two, in order to keep the model as simple as possible, in line\nwith the SCI-MS-EVB approach implemented for water and described in\nSection \\ref{sub:Multi-proton-extension-paper}. This approach allows\neach donor and acceptor species in the system to be involved in a\nmaximum of one proton transfer in a given configuration, but it is\nassumed that the possibility that such a species might be involved\nin two proton transfers simultaneously can be safely neglected. The\nsmall basis set leads to occasional ambiguities concerning which proton\nis considered to be shared but a modification of the off-diagonal term\nspecified in Eq. (\\ref{eq:MSEVBOFFD}) has been made to limit the\nimpact of these issues and is described in Section \\ref{subsub:qdependence}.\n\n\n Our focus here has been to develop the simplest possible scheme of the process of proton transfer between sulphuric acid and water, and for ease of implementation we have used a similar two-state model for the water network. Larger basis sets have previously been employed in studies of the water/hydronium system in order to capture effects such as the formation of highly correlated structures such as the H$_9$O$_4$$^+$ complex discussed in \\citep{Knight12}. Our approach is less refined at present, but clearly a more elaborate model of state mixing within the water network could be implemented at a later stage alongside the two-state model of acid/water mixing in order to capture the finer details of proton transfer in the water sector. Our principal focus has been to describe the reactive behaviour of sulphuric acid in clusters containing relatively few water molecules.\n\n\n\\begin{figure*}\n\\begin{centering}\n\\includegraphics[width=1\\textwidth]{Fig2}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:State-selector-Image}The ground state selector algorithm.\nImage zero shows the positions of atoms, and in subsequent steps bonds\nare inserted according to the procedure described in Section \\ref{sub:State-selector-algorithm}.\nStep three is shown in two parts; first, the attachment of two hydrogen\natoms to each oxygen and second, the attachment of one hydrogen\natom to each sulphate.}\n\\end{figure*}\n\n\n\n\\subsection{Algorithms}\n\nA central part of the EVB methodology is the construction of appropriate\nbasis states of the system, which is nontrivial as reactions can cause\natoms to associate with different molecules in the course of a simulation.\nThis section describes two algorithms which are applied at every time\nstep in order to identify the ground state and excited states of the\nsystem by geometric arguments.\n\n\n\\subsubsection{Ground state selector algorithm\\label{sub:State-selector-algorithm}}\n\nAn algorithm has been designed which constructs the \\textbf{\\tt{ground state}}\nfrom a list of atomic positions. For convenience, four molecular lists\nare defined and are denoted by \\textbf{\\tt{SA}} (sulphuric acid),\n\\textbf{\\tt{BS}} (bisulphate), \\textbf{\\tt{HY}} (hydronium) and\n\\textbf{\\tt{WA}} (water) and an assignment refers to the identification\nof an atom as a constituent of a particular molecule. The algorithm\nis performed in the following way:\n\\begin{enumerate}\n\\item The four oxygens closest to each sulphur atom are identified. They\nare assigned to a sulphuric acid molecule (along with the sulphur\natom) and placed in the \\textbf{\\tt{SA}} list.\n\\item The remaining oxygen atoms are assigned to hydronium ions and added\nto the \\textbf{\\tt{HY}} list.\n\\item Minimum numbers of hydrogen atoms are assigned to each molecular species.\nFor each member of the \\textbf{\\tt{HY}} list the \\emph{two} hydrogen\natoms closest to the associated oxygen are identified and assigned\nto the list. The same process is used to assign \\emph{one} hydrogen\nto each member of the \\textbf{\\tt{SA}} list.\n\\item The remaining hydrogen atoms are placed (in no particular order) in\na temporary list named \\textbf{\\tt{H}}. The closest oxygen to each\nof these hydrogens is identified and the hydrogen is assigned to the\nmolecular species of which the oxygen is a constituent. The oxygen\ncannot be part of a molecule which has already accepted one of these\nremaining hydrogens and cannot be a member of the \\textbf{\\tt{SA}}\nlist that was assigned a bond to a hydrogen atom in step 3. If there\nis an attempt to assign a hydrogen where the bond length is greater\nthan $1.2\\textrm{\\AA}$ then this assignment is rejected and the atom\nis moved to the top of the \\textbf{\\tt{H}} list. If the \\textbf{\\tt{H}}\nlist is rearranged at any time, then step 4 is immediately restarted\nusing the modified \\textbf{\\tt{H}} list. The hydrogens which went\nthrough a rejected assignment are no longer subject to the $1.2\\textrm{\\AA}$\nconstraint, but if the bond length is over $2\\textrm{\\AA}$ the hydrogen\nis again returned to the top of the \\textbf{\\tt{H}} list. If problems\nwith assignment persist, then the algorithm is run with the bond length\ncheck turned off. In practice, there is only need for these checks\nin the circumstances of proton transfer events, in which case the\ntwo state EVB mixing between the states will ensure that the appropriate\nforces are applied regardless of the assignment of the molecular species.\nThis step is completed when all hydrogens in the \\textbf{\\tt{H}}\nlist have been assigned. The procedure followed in this step was found\nto work smoothly in trials of the model.\n\\item Any sulphuric acid molecule in the \\textbf{\\tt{SA}} list for which\nonly one hydrogen atom has been assigned is moved to the \\textbf{\\tt{BS}}\nlist. Similarly, any hydronium molecule in the \\textbf{\\tt{HY}} list\nthat does not have three assigned hydrogen atoms is moved to the \\textbf{\\tt{WA}}\nlist.\n\\end{enumerate}\nFigure \\ref{fig:State-selector-Image} illustrates the steps of the\nalgorithm as they are performed on a system. At the end of the procedure,\nthe \\textbf{\\tt{SA}}, \\textbf{\\tt{BS}}, \\textbf{\\tt{HY}} and \\textbf{\\tt{WA}}\nlists represent the \\textbf{\\tt{ground state}} of the system.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig3}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:ExcitedStateImage}A simultaneous consideration of three\npotential proton transfer events. The groups labelled 1, 2 and 3 refer\nto {[}hydronium/bisulphate{]}, {[}sulphuric acid/water{]} and {[}hydronium/water{]}\nproton transfer, respectively. One \\textbf{\\tt{ground state}} (the\nbonding pattern shown) and three \\textbf{\\tt{excited states}} (where\nthe central hydrogen in each group is bonded differently) have therefore\nbeen identified.}\n\\end{figure}\n\n\n\n\\subsubsection{Excited state identification algorithm\\label{sub:Excited-basis-states}}\n\nAs stated earlier, an \\textbf{\\tt{excited state}} is defined as a\nchange in the bonding assignment of one hydrogen in the \\textbf{\\tt{ground state}}\nof a given configuration. An algorithm identifies the\\textbf{ \\tt{excited states}}\nin a system using the following steps:\n\\begin{enumerate}\n\\item The shortest distance between a hydrogen belonging to a \\textbf{\\tt{donor}}\nspecies, and an oxygen belonging to an \\textbf{\\tt{acceptor}} species\nis identified. The oxygen in a bisulphate ion which has an attached\nhydrogen is not considered here. If this distance is less than $2\\textrm{\\AA}$\nthen an\\textbf{ \\tt{excited state}} may be constructed where the\nhydrogen is reassigned to the \\textbf{\\tt{acceptor}} species.\n\\item Step 1 is repeated until either the shortest distance identified is\ngreater than $2\\textrm{\\AA}$ in length or there are no further \\textbf{\\tt{acceptor}\n}or\\textbf{ \\tt{donor}} molecules for which it is possible to construct\nan $\\mathrm{O-H}$ separation distance.\n\\end{enumerate}\nThe ground state selector and the excited state identification algorithms\nproduce one \\textbf{\\tt{ground state}} and $n$ \\textbf{\\tt{excited states}}\nwhere $n$ is the number of potential proton transfer events in the\nconfiguration under consideration. When $n=0$ the system is in a\nnon-reactive configuration. In the configuration shown in Figure \\ref{fig:ExcitedStateImage},\nthere are three groups where the bonding of a proton is unclear (ringed),\nsuch that a \\textbf{\\tt{ground state}} and three \\textbf{\\tt{excited states}}\nhave been identified in this system.\n\n\n\\subsection{Diagonal terms\\label{sub:Underlying-classical-potential}}\n\nThe potentials needed to specify the diagonal elements of $\\mathcal{H}$\nare those developed by Loukonen \\emph{et al.} \\citep{Loukonen2010},\nand the SPC/EF potential is used for the water molecules \\citep{Lopez-Lemus08}.\nThe hydronium energy is represented by a set of harmonic angle potentials\nand Morse bond potentials as follows:\n\n", "itemtype": "equation", "pos": 14155, "prevtext": "\nwhere $R_{{\\rm OO}}$ is the oxygen-oxygen distance in the hydrogen\nbond that includes the transferring proton, $V_{{\\rm const}}^{ij}$\nis a constant and $V_{{\\rm ex}}^{ij}$ is a representation of Coulombic\ninteractions between the ${\\rm H}_{5}{\\rm O}_{2}^{+}$ Zundel cation\nconsisting of the hydronium and water between which the proton is\nconsidered to be shared, and the remaining waters. It is given by\n\n\n", "index": 7, "text": "\\begin{equation}\nV_{{\\rm ex}}^{ij}=\\sum_{m}^{7}\\sum_{k}^{N_{{\\rm H_{2}O}}-1}\\sum_{n_{k}}^{3}\\frac{q_{n_{k}}^{{\\rm H_{2}O}}q_{m}^{ex}}{R_{mn_{k}}},\\label{eq:VijExMSEVB3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"V_{{\\rm ex}}^{ij}=\\sum_{m}^{7}\\sum_{k}^{N_{{\\rm H_{2}O}}-1}\\sum_{n_{k}}^{3}%&#10;\\frac{q_{n_{k}}^{{\\rm H_{2}O}}q_{m}^{ex}}{R_{mn_{k}}},\" display=\"block\"><mrow><mrow><msubsup><mi>V</mi><mi>ex</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msubsup><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>m</mi><mn>7</mn></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi><mrow><msub><mi>N</mi><mrow><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">O</mi></mrow></msub><mo>-</mo><mn>1</mn></mrow></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msub><mi>n</mi><mi>k</mi></msub><mn>3</mn></munderover><mfrac><mrow><msubsup><mi>q</mi><msub><mi>n</mi><mi>k</mi></msub><mrow><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">O</mi></mrow></msubsup><mo>⁢</mo><msubsup><mi>q</mi><mi>m</mi><mrow><mi>e</mi><mo>⁢</mo><mi>x</mi></mrow></msubsup></mrow><msub><mi>R</mi><mrow><mi>m</mi><mo>⁢</mo><msub><mi>n</mi><mi>k</mi></msub></mrow></msub></mfrac></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\nwhere $i$ is summed over the three hydrogen-oxygen-hydrogen angles\nand $j$ over the three oxygen-hydrogen bonds. The $k_{\\theta}$ and\n$\\theta_{0}$ parameters are taken from Loukonen \\emph{et al.} \\citep{Loukonen2010}.\nThe Morse potential is similar in form to the model used in Wu \\emph{et\nal.} \\citep{Wu2008}, and employs the same value of $D$, but the\n$\\alpha$ parameter has been changed so that the second order Taylor\nexpansion around $r_{0}$ matches the strength of the harmonic spring\nused to represent the OH bond in Loukonen \\emph{et al.} \\citep{Loukonen2010},\nnamely $\\alpha=2.327\\textrm{\\AA}^{-1}$. The use of a Morse potential\nrather than a harmonic spring was found to improve the match between\nour model of hydronium and that used in the original MS-EVB3 model\\@.\n\nOne of the diagonal terms is augmented by an energy shift, $\\Delta$,\nto account for the difference in zero temperature ground state energy\nbetween the sulphuric acid and water bonding pattern and the bisulphate\nand hydronium version. Ding \\emph{et al.} \\citep{DingC.-G.} calculated\nthe value of this parameter to be $144.0\\:\\mathrm{kcal/mol}$ ($602.5\\:\\mathrm{kJ/mol}$),\nbut for our purposes it was considered to be a free parameter and\nis fitted to higher level theory data.\n\n\n\\subsection{Off-diagonal terms\\label{sub:Off-Diagonal}}\n\nThe form chosen for the off-diagonal terms in the Hamiltonian describing\nsulphuric acid-water proton transfer is based upon the MS-EVB3 model\n(Eq. (\\ref{eq:MSEVBOFFD})), with two modifications. These relate\nto the expression involving the $\\mathbf{q}$ parameter (Section \\ref{subsub:qdependence})\nand the method for calculating $V_{{\\rm ex}}^{ij}$ (Section \\ref{subsub:Intermediate-charges-1}).\n\n\n\\subsubsection{The $\\mathbf{q}$ dependence\\label{subsub:qdependence}}\n\n\n\n There is a problem with using a limited basis set, especially when there are long-range off-diagonal terms in the Hamiltonian matrix. If configurational evolution brings about a change in identity of the species that might accept the proton from a given \\textbf{\\tt{donor}} species, then the replacement of one energy surface by another will bring about an abrupt jump in energy that will need to be damped out by the thermostat. However, we have designed the two-state EVB scheme to avoid such jumps as much as possible. Mixing between bonding patterns will only come about when the proton in question occupies a specific region between the \\textbf{\\tt{donor}} and \\textbf{\\tt{acceptor}} species. Outside this region, the interactions revert to those of a single pattern of bonding, and crucially, the energy surface is continuous at the boundary of the region. This is encoded in the specification of off-diagonal terms which vanish for proton positions outside an ellipsoidal volume centred on the mid-point between the donating and accepting oxygen atoms.\n\n\n\n\n\n\n\n\nSpecifically, the factor in\nEq. (\\ref{eq:MSEVBOFFD}) involving $\\mathbf{q}$ becomes\n\n", "itemtype": "equation", "pos": 28231, "prevtext": "\nwhere $m$ is a label for the seven atoms in the Zundel cation, $k$\nis a label for the remaining water molecules ($N_{{\\rm H_{2}O}}$\nis the total number of water molecules in the system) and $n_{k}$\nlabels the three constituent atoms of each water molecule. $q_{n_{k}}^{{\\rm H_{2}O}}$\nare the partial charges for the constituent atoms in the water molecule\nand $q_{m}^{ex}$ are partial charges describing the Zundel cation.\n$R_{mn_{k}}$ is the distance between atoms labelled by $m$ and $n_{k}$.\n\n\\begin{table}\n\n\\caption{Parameters specifying the off-diagonal matrix elements of the Hamiltonian used in the MS-EVB3 model of water-hydronium transfer \\citep{Wu2008}; $\\alpha$, $\\beta$ and $\\gamma$ from \\cite{Wu2008}, all others from \\cite{Schmitt1998}. \\label{tab:MSEVB3Values}}\n{\\begin{tabular}{ccccc}\n\\toprule\n$V_{{\\rm const}}^{ij}$ & -23.1871874  $\\mathrm{kcal/mol}$ &  & $\\beta$ & 4.5  $\\mathrm{\\textrm{\\AA}^{-1}}$\\tabularnewline\n\n$\\gamma$ & 1.85  $\\mathrm{\\textrm{\\AA}^{-2}}$ &  & $R_{{\\rm OO}}^{0}$ & 3.1  $\\mathrm{\\textrm{\\AA}}$\\tabularnewline  $P$ & 0.2327246   &  & $P'$ & 10.8831327  \\tabularnewline  ${\\rm k}$ & 9.562153  $\\mathrm{\\textrm{\\AA}^{-2}}$ &  & $\\alpha$ & 15  $\\mathrm{\\textrm{\\AA}}^{-1}$\\tabularnewline  $D_{{\\rm OO}}$ & 2.94  $\\mathrm{\\textrm{\\AA}}$ &  & $r_{{\\rm OO}}^{0}$ & 1.8136426  $\\mathrm{\\textrm{\\AA}}$\\tabularnewline\n\\botrule\n\\end{tabular}}\n\n\n\n\\end{table}\n\n\n\nThe function $A(R_{{\\rm OO}},\\mathbf{q})$ has the form\n\n\\begin{eqnarray}\n\\begin{array}{c}\nA(R_{{\\rm OO}},\\mathbf{q})=\\exp(-\\gamma\\mathbf{q}^{2})\\cdot\\left\\{ 1+P\\exp\\left[-{\\rm k}(R_{{\\rm OO}}-D_{{\\rm OO}})^{2}\\right]\\right\\} \\\\\n\\\\\n\\times\\left\\{ \\frac{1}{2}\\left\\{ 1-\\tanh\\left[\\beta(R_{{\\rm OO}}-R_{{\\rm OO}}^{0})\\right]\\right\\} +\\right.\\\\\n\\\\\n\\left.P'\\exp\\left[-\\alpha(R_{{\\rm OO}}-r_{{\\rm OO}}^{0})\\right]\\right\\} ,\\\\\n\\\\\n\\end{array}\\label{eq:MSEVBOFFD}\n\\end{eqnarray}\n\n\n\\noindent where $\\gamma$, $P$, ${\\rm k}$, $D_{{\\rm OO}}$, $\\beta$,\n$R_{{\\rm OO}}^{0}$, $P'$, $\\alpha$ and $r_{{\\rm OO}}^{0}$ are\nempirical parameters (see Table \\ref{tab:MSEVB3Values}) and $\\mathbf{q}=\\frac{1}{2}(\\mathbf{r}_{{\\rm O}1}+\\mathbf{r}_{{\\rm O}2})-\\mathbf{r}_{{\\rm H}}$\nwhere $\\mathbf{r}_{{\\rm O}1}$, $\\mathbf{r}_{{\\rm O}2}$ and $\\mathbf{r}_{{\\rm H}}$\nare the positions of the two oxygens and hydrogen, respectively, that\nparticipate in the hydrogen bond. The model is somewhat empirical\nin construction but was designed to have a number of desirable features\n\\citep{Wu2008}.\n\n\n\\subsection{The SCI-MS-EVB procedure\\label{sub:Multi-proton-extension-paper}}\n\nThe EVB method has the capacity to model systems of $n>1$ hydroniums\n(excess protons) with water, but this extension increases the size\nof $\\mathcal{H}$ to order $m^{n}$ where $m$ is the size of the\nbasis set for a single proton system. The SCI-MS-EVB model was developed\nby Wang and Voth \\citep{Wang2005} to improve the scaling of\nthe procedure with respect to $n$. This is achieved by treating the\nsystem as $n$ single excess protons in the presence of an environment\nwith a given state of bond mixing. Employing a single proton EVB methodology,\nthe state of mixing of the entire system is then given by a set of\n$n$ eigenvectors each of length $m$. The eigenvectors are corrected\niteratively as the effects of the other excess protons on the Hamiltonian\nmatrix for each of the Zundel cations are taken into account. Essentially,\nthe environment affects how the competing energy surfaces are specified.\nThe problem of analysing one matrix of order $m^{n}$ is hence reduced\nto the consideration of $n$ matrices of size $m$. The number of\niterations required to reach convergence in energy and forces is typically\nsmall. We similarly use this procedure for our system.\n\n\n\\section{EVB model for sulphuric acid and water\\label{sec:3EVB-model-for-SA-WA}}\n\nIn the following subsections we describe in some detail the construction\nof an EVB model for a system containing sulphuric acid, bisulphate,\nhydronium and water species. It is a complex narrative, but a summary\nof the procedure is provided at the end in Subsection \\ref{sub:Model-Overview}.\nIn the discussion a naming convention is used where the \\textbf{\\tt{ground state}}\nrefers to the bonding pattern that has been identified as geometrically\nthe most `natural', based upon the configuration of the atoms. \\textbf{\\tt{Excited states}}\nare bonding configurations that are identical to the \\textbf{\\tt{ground state}}\nexcept for the repositioning of one bond as a consequence of a proton\ntransfer. Therefore, it is possible to identify an \\textbf{\\tt{excited state}\n}based upon the\\textbf{ \\tt{ground state} }and the two species involved\nin a proton transfer. The species are then referred to as a \\textbf{\\tt{donor}}\n(the molecule to which the hydrogen atom is bonded in the \\textbf{\\tt{ground state}}\nand which can either be a sulphuric acid molecule or a hydronium ion),\nand an \\textbf{\\tt{acceptor}} (the molecule to which the hydrogen\natom is bonded in the \\textbf{\\tt{excited state}} and which can either\nbe a bisulphate or a water). For clarity, the terms neutral and ionised\nare used to identify the state of the sulphur-bearing species (either\nas a neutral sulphuric acid or an ionised bisulphate).\n\n\n\\subsection{Basis set size\\label{sub:Basis-set-size}}\n\nThe basis set size $m$ for each transferable proton was chosen to\nbe two, in order to keep the model as simple as possible, in line\nwith the SCI-MS-EVB approach implemented for water and described in\nSection \\ref{sub:Multi-proton-extension-paper}. This approach allows\neach donor and acceptor species in the system to be involved in a\nmaximum of one proton transfer in a given configuration, but it is\nassumed that the possibility that such a species might be involved\nin two proton transfers simultaneously can be safely neglected. The\nsmall basis set leads to occasional ambiguities concerning which proton\nis considered to be shared but a modification of the off-diagonal term\nspecified in Eq. (\\ref{eq:MSEVBOFFD}) has been made to limit the\nimpact of these issues and is described in Section \\ref{subsub:qdependence}.\n\n\n Our focus here has been to develop the simplest possible scheme of the process of proton transfer between sulphuric acid and water, and for ease of implementation we have used a similar two-state model for the water network. Larger basis sets have previously been employed in studies of the water/hydronium system in order to capture effects such as the formation of highly correlated structures such as the H$_9$O$_4$$^+$ complex discussed in \\citep{Knight12}. Our approach is less refined at present, but clearly a more elaborate model of state mixing within the water network could be implemented at a later stage alongside the two-state model of acid/water mixing in order to capture the finer details of proton transfer in the water sector. Our principal focus has been to describe the reactive behaviour of sulphuric acid in clusters containing relatively few water molecules.\n\n\n\\begin{figure*}\n\\begin{centering}\n\\includegraphics[width=1\\textwidth]{Fig2}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:State-selector-Image}The ground state selector algorithm.\nImage zero shows the positions of atoms, and in subsequent steps bonds\nare inserted according to the procedure described in Section \\ref{sub:State-selector-algorithm}.\nStep three is shown in two parts; first, the attachment of two hydrogen\natoms to each oxygen and second, the attachment of one hydrogen\natom to each sulphate.}\n\\end{figure*}\n\n\n\n\\subsection{Algorithms}\n\nA central part of the EVB methodology is the construction of appropriate\nbasis states of the system, which is nontrivial as reactions can cause\natoms to associate with different molecules in the course of a simulation.\nThis section describes two algorithms which are applied at every time\nstep in order to identify the ground state and excited states of the\nsystem by geometric arguments.\n\n\n\\subsubsection{Ground state selector algorithm\\label{sub:State-selector-algorithm}}\n\nAn algorithm has been designed which constructs the \\textbf{\\tt{ground state}}\nfrom a list of atomic positions. For convenience, four molecular lists\nare defined and are denoted by \\textbf{\\tt{SA}} (sulphuric acid),\n\\textbf{\\tt{BS}} (bisulphate), \\textbf{\\tt{HY}} (hydronium) and\n\\textbf{\\tt{WA}} (water) and an assignment refers to the identification\nof an atom as a constituent of a particular molecule. The algorithm\nis performed in the following way:\n\\begin{enumerate}\n\\item The four oxygens closest to each sulphur atom are identified. They\nare assigned to a sulphuric acid molecule (along with the sulphur\natom) and placed in the \\textbf{\\tt{SA}} list.\n\\item The remaining oxygen atoms are assigned to hydronium ions and added\nto the \\textbf{\\tt{HY}} list.\n\\item Minimum numbers of hydrogen atoms are assigned to each molecular species.\nFor each member of the \\textbf{\\tt{HY}} list the \\emph{two} hydrogen\natoms closest to the associated oxygen are identified and assigned\nto the list. The same process is used to assign \\emph{one} hydrogen\nto each member of the \\textbf{\\tt{SA}} list.\n\\item The remaining hydrogen atoms are placed (in no particular order) in\na temporary list named \\textbf{\\tt{H}}. The closest oxygen to each\nof these hydrogens is identified and the hydrogen is assigned to the\nmolecular species of which the oxygen is a constituent. The oxygen\ncannot be part of a molecule which has already accepted one of these\nremaining hydrogens and cannot be a member of the \\textbf{\\tt{SA}}\nlist that was assigned a bond to a hydrogen atom in step 3. If there\nis an attempt to assign a hydrogen where the bond length is greater\nthan $1.2\\textrm{\\AA}$ then this assignment is rejected and the atom\nis moved to the top of the \\textbf{\\tt{H}} list. If the \\textbf{\\tt{H}}\nlist is rearranged at any time, then step 4 is immediately restarted\nusing the modified \\textbf{\\tt{H}} list. The hydrogens which went\nthrough a rejected assignment are no longer subject to the $1.2\\textrm{\\AA}$\nconstraint, but if the bond length is over $2\\textrm{\\AA}$ the hydrogen\nis again returned to the top of the \\textbf{\\tt{H}} list. If problems\nwith assignment persist, then the algorithm is run with the bond length\ncheck turned off. In practice, there is only need for these checks\nin the circumstances of proton transfer events, in which case the\ntwo state EVB mixing between the states will ensure that the appropriate\nforces are applied regardless of the assignment of the molecular species.\nThis step is completed when all hydrogens in the \\textbf{\\tt{H}}\nlist have been assigned. The procedure followed in this step was found\nto work smoothly in trials of the model.\n\\item Any sulphuric acid molecule in the \\textbf{\\tt{SA}} list for which\nonly one hydrogen atom has been assigned is moved to the \\textbf{\\tt{BS}}\nlist. Similarly, any hydronium molecule in the \\textbf{\\tt{HY}} list\nthat does not have three assigned hydrogen atoms is moved to the \\textbf{\\tt{WA}}\nlist.\n\\end{enumerate}\nFigure \\ref{fig:State-selector-Image} illustrates the steps of the\nalgorithm as they are performed on a system. At the end of the procedure,\nthe \\textbf{\\tt{SA}}, \\textbf{\\tt{BS}}, \\textbf{\\tt{HY}} and \\textbf{\\tt{WA}}\nlists represent the \\textbf{\\tt{ground state}} of the system.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig3}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:ExcitedStateImage}A simultaneous consideration of three\npotential proton transfer events. The groups labelled 1, 2 and 3 refer\nto {[}hydronium/bisulphate{]}, {[}sulphuric acid/water{]} and {[}hydronium/water{]}\nproton transfer, respectively. One \\textbf{\\tt{ground state}} (the\nbonding pattern shown) and three \\textbf{\\tt{excited states}} (where\nthe central hydrogen in each group is bonded differently) have therefore\nbeen identified.}\n\\end{figure}\n\n\n\n\\subsubsection{Excited state identification algorithm\\label{sub:Excited-basis-states}}\n\nAs stated earlier, an \\textbf{\\tt{excited state}} is defined as a\nchange in the bonding assignment of one hydrogen in the \\textbf{\\tt{ground state}}\nof a given configuration. An algorithm identifies the\\textbf{ \\tt{excited states}}\nin a system using the following steps:\n\\begin{enumerate}\n\\item The shortest distance between a hydrogen belonging to a \\textbf{\\tt{donor}}\nspecies, and an oxygen belonging to an \\textbf{\\tt{acceptor}} species\nis identified. The oxygen in a bisulphate ion which has an attached\nhydrogen is not considered here. If this distance is less than $2\\textrm{\\AA}$\nthen an\\textbf{ \\tt{excited state}} may be constructed where the\nhydrogen is reassigned to the \\textbf{\\tt{acceptor}} species.\n\\item Step 1 is repeated until either the shortest distance identified is\ngreater than $2\\textrm{\\AA}$ in length or there are no further \\textbf{\\tt{acceptor}\n}or\\textbf{ \\tt{donor}} molecules for which it is possible to construct\nan $\\mathrm{O-H}$ separation distance.\n\\end{enumerate}\nThe ground state selector and the excited state identification algorithms\nproduce one \\textbf{\\tt{ground state}} and $n$ \\textbf{\\tt{excited states}}\nwhere $n$ is the number of potential proton transfer events in the\nconfiguration under consideration. When $n=0$ the system is in a\nnon-reactive configuration. In the configuration shown in Figure \\ref{fig:ExcitedStateImage},\nthere are three groups where the bonding of a proton is unclear (ringed),\nsuch that a \\textbf{\\tt{ground state}} and three \\textbf{\\tt{excited states}}\nhave been identified in this system.\n\n\n\\subsection{Diagonal terms\\label{sub:Underlying-classical-potential}}\n\nThe potentials needed to specify the diagonal elements of $\\mathcal{H}$\nare those developed by Loukonen \\emph{et al.} \\citep{Loukonen2010},\nand the SPC/EF potential is used for the water molecules \\citep{Lopez-Lemus08}.\nThe hydronium energy is represented by a set of harmonic angle potentials\nand Morse bond potentials as follows:\n\n", "index": 9, "text": "\\begin{equation}\nV_{{\\rm hyd}}=\\frac{1}{2}\\sum_{i=1}^{3}k_{\\theta}\\left(\\theta_{i}-\\theta_{0}\\right)^{2}+\\sum_{j=1}^{3}D\\left[1-{\\rm e}^{-\\alpha(r_{j}-r_{0})}\\right]^{2},\\label{eq:Chap6_hydronium_potenial}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"V_{{\\rm hyd}}=\\frac{1}{2}\\sum_{i=1}^{3}k_{\\theta}\\left(\\theta_{i}-\\theta_{0}%&#10;\\right)^{2}+\\sum_{j=1}^{3}D\\left[1-{\\rm e}^{-\\alpha(r_{j}-r_{0})}\\right]^{2},\" display=\"block\"><mrow><mrow><msub><mi>V</mi><mi>hyd</mi></msub><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>k</mi><mi>θ</mi></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>-</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><mi>D</mi><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>r</mi><mi>j</mi></msub><mo>-</mo><msub><mi>r</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow><mo>]</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\nwhere $\\mathbf{q}_{0}^{2}$ is related to $\\mathbf{q}$ in the following\nway. The $\\mathbf{q}$ vector is expressed in a new orthogonal coordinate\nsystem $\\mathbf{q}^{\\prime}$ in which the $x$-axis is parallel to\n$\\mathbf{r}_{{\\rm OO}}$, where $\\mathbf{r}_{{\\rm OO}}=\\mathbf{r}_{{\\rm O}1}-\\mathbf{r}_{{\\rm O}2}$\nis the vector separation between oxygens. The other two axes take\narbitrary orientations. $\\mathbf{q}_{0}^{2}$ is then defined as $\\mathbf{q}_{0}^{2}=\\left(q'_{x}/\\tau_{x}\\right)^{2}+\\left(q'_{y}/\\tau_{yz}\\right)^{2}+\\left(q'_{z}/\\tau_{yz}\\right)^{2}$\nwhere the $\\tau_{x}$ and $\\tau_{yz}$ are unitless scaling factors\nrepresenting semi-major axes of an ellipsoid with respect to the $x$\naxis, and the $y$ and $z$ axes, respectively. In effect, a hydrogen\natom experiences mixed bonding within an ellipsoidal volume between\nthe two appropriate oxygen atoms. We find that this eliminates occasional ambiguities with regard to\nwhich oxygen pair is appropriate for the mixed bonding experienced\nby a particular hydrogen, introducing discontinuities in\nthe potential energy landscape. The two variables $\\tau_{x}$ and\n$\\tau_{yz}$ are treated as additional fitting parameters. The form\nof Eq. (\\ref{eq:gammaMod}) ensures two features: the expression is\nequal to unity at $\\mathbf{q}_{0}^{2}=0$ and goes to zero on the\nsurface of the ellipsoid at $\\mathbf{q}_{0}^{2}=\\gamma^{-1}$, beyond\nwhich the off-diagonal term vanishes to enforce ordinary unmixed\nbehaviour outside the ellipsoid.\n\n In principle, a  jump in energy can still occur if ellipsoidal mixing regions between two donor-acceptor pairs come into overlap as a consequence of configurational change. Such situations can occasionally arise during the molecular dynamics, but we have restricted the regions of mixing, through the parameters $\\tau_x$ and $\\tau_{yz}$, specifically to avoid this. For most of the time there is no ambiguity in the choice of basis set to use for a configuration and few occasions when a jump in energy occurs according to our scheme. These jumps are unphysical, and a breakage of NVE conditions, but are the price to pay for the simplicity of the implementation.\n\n\n\\subsubsection{Interpolated charges\\label{subsub:Intermediate-charges-1}}\n\nThe $V_{{\\rm ex}}^{ij}$ parameter in Eq. (\\ref{eq:VijExMSEVB3})\nis also modified since the charges provided by the MS-EVB3 model for\nthe calculation of this term are specific to the Zundel cation and\ndo not transfer to a sulphuric acid and water model. We recall that\nit represents external electrostatic interactions for the group of\natoms involved in the mixing of bonding patterns. Our approach is\nto interpolate the charges of these atoms according to the $c_{i}$\ncoefficients of the mixture. The procedure is as follows:\n\\begin{enumerate}\n\\item Initially the charges are assumed to be $q=\\frac{1}{2}(q^{gs}+q^{es})$,\nwhere $q^{gs}$ and\\textbf{ }$q^{es}$ are the partial charges for\nthat atom according to the classical potential provided, in accordance\nwith whether the bonding is identified as the \\textbf{\\tt{ground state}\n}or the \\textbf{\\tt{excited state}}, respectively.\n\\item A self-consistent iteration is performed where \\foreignlanguage{english}{$q$}\nis updated according to $q=c_{gs}^{2}q^{gs}+c_{es}^{2}q^{es}$ where\n$c_{gs}$ and $c_{es}$ are the eigenvector coefficients for the \\textbf{\\tt{ground state}\n}and \\textbf{\\tt{excited state}}, respectively, obtained from the\ntwo-level Hamiltonian describing the mixing.\n\\end{enumerate}\nThis procedure is performed alongside a separate self-consistent iterative\nprocess described in the next section, the purpose of which is to\nallow consideration of multiple proton transfers.\n\n\n\\subsection{Multiple proton procedure \\label{sub:Multiple-proton-procedure}}\n\nThe modelling of systems undergoing multiple proton transfers follows\nthe SCI-MS-EVB procedure developed by Wang and Voth \\citep{Wang2005}.\nFigure \\ref{fig:ExcitedStateImage} shows a system where this extension\nis required as it has three \\textbf{\\tt{excited states}} available.\nThe starting point in this procedure is to neglect overlap between\ntwo different excited states (i.e. $\\bra{i}H\\ket{j}=0$ where $i$\nand $j$ represent two different excited states). This allows for\nthe reduction of the EVB Hamiltonian matrix of the system, which is\nof order $n_{d}^{n_{c}}$, to $n_{d}$ matrices of order $n_{c}$\nwhere $n_{d}$ is the number of donor molecules being considered and\n$n_{c}$ is the number basis states considered per donor molecule.\nAn iterative procedure is then used to correct these matrices for\nthe $\\bra{i}H\\ket{j}$ contributions. The method can be described\nas follows:\n\\begin{enumerate}\n\\item We determine the eigenvector for each $2\\times2$ matrix $\\mathcal{H}$\ncorresponding to the \\textbf{\\tt{ground state} }and an\\textbf{ \\tt{excited state}}.\nFor clarity, $n$ is  used as a label such that $\\mathbf{c}_{n}$\nand $\\mathcal{H}_{n}$ are defined for the $n^{{\\rm th}}$\\textbf{\n\\tt{excited state}}. In addition, $n$ is used to label the \\textbf{\\tt{donor}}\nand \\textbf{\\tt{acceptor} }species that define the \\textbf{\\tt{excited state}}.\n\\item Each $\\mathcal{H}_{n}$ is then corrected for the effect of \\textbf{\\tt{excited state}\n$m$} where $m\\neq n$. This is performed by updating the intermolecular\nenergy contributions to the diagonal terms in $\\mathcal{H}_{n}$,\ni.e. $E_{{\\rm inter}}^{gs}\\rightarrow\\left(c_{gs}^{2}E_{{\\rm inter}}^{gs}+c_{es}^{2}E_{{\\rm inter}}^{es}\\right)$\nwhere $c_{gs}^{2}$ and $c_{es}^{2}$ are the squared coefficients\nof the $\\mathbf{c}_{m}$ eigenvector representing the associated \\textbf{\\tt{ground state}}\nand \\textbf{\\tt{excited state}}. $E_{{\\rm inter}}^{gs}$ and $E_{{\\rm inter}}^{es}$\nare the intermolecular energy contributions resulting from interactions\nbetween the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $n$\nand the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $m$ in\nthe \\textbf{\\tt{ground state}} and \\textbf{\\tt{excited state}} of\n$m$ respectively. The expression $V_{{\\rm ex}}^{ij}$ in the off-diagonal\nterm is updated in the same fashion; this includes recalculating the\ncharges \\foreignlanguage{english}{$q$} according to the procedure\nin Section \\ref{subsub:Intermediate-charges-1}. The $\\mathbf{c}_{n}$\nvalues are then recalculated. This allows the coefficients\\textbf{\n$\\mathbf{c}_{n}$ }for the\\textbf{ \\tt{acceptor}}/\\textbf{\\tt{donor}}\npair $n$\\textbf{ }to be corrected for the intermolecular interactions\narising from \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $m$.\nThis step is repeated until each $\\mathbf{c}_{n}$ vector has been\ncorrected for each \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair\n$m$ (where $m\\ne n$).\n\\item Step $2$ is repeated until all $\\mathbf{c}_{n}$ eigenvectors have\nconverged. This is tested by defining $C_{{\\rm sum}}=\\sum_{n}(\\mathbf{c}_{n}^{{\\rm old}}-\\mathbf{c}_{n}^{{\\rm new}})^{2}$\nwhere $\\mathbf{c}_{n}^{{\\rm old}}$ and $\\mathbf{c}_{n}^{{\\rm new}}$\nare the (normalised) $\\mathrm{\\mathbf{c}}_{n}$ eigenvectors calculated\nbefore and after step $2$ is performed. The system is considered\nto be converged when $C_{{\\rm sum}}<10^{-5}$, or when step 2 has\nbeen cycled 10 times. In practice only a few iterations are required.\n\\end{enumerate}\n\n\\subsection{Energy and force calculation\\label{sub:Force-calculation}}\n\nOnce the self-consistency iterations have been performed, the energy\nof the system can be computed in the same fashion as in the SCI-MS-EVB\nmethod. Eq. (13) in reference \\citep{Wang2005}  gives a deconstruction\nof the total energy of a system containing two excess protons in the\nform\n\n\n", "itemtype": "equation", "pos": 31388, "prevtext": "\nwhere $i$ is summed over the three hydrogen-oxygen-hydrogen angles\nand $j$ over the three oxygen-hydrogen bonds. The $k_{\\theta}$ and\n$\\theta_{0}$ parameters are taken from Loukonen \\emph{et al.} \\citep{Loukonen2010}.\nThe Morse potential is similar in form to the model used in Wu \\emph{et\nal.} \\citep{Wu2008}, and employs the same value of $D$, but the\n$\\alpha$ parameter has been changed so that the second order Taylor\nexpansion around $r_{0}$ matches the strength of the harmonic spring\nused to represent the OH bond in Loukonen \\emph{et al.} \\citep{Loukonen2010},\nnamely $\\alpha=2.327\\textrm{\\AA}^{-1}$. The use of a Morse potential\nrather than a harmonic spring was found to improve the match between\nour model of hydronium and that used in the original MS-EVB3 model\\@.\n\nOne of the diagonal terms is augmented by an energy shift, $\\Delta$,\nto account for the difference in zero temperature ground state energy\nbetween the sulphuric acid and water bonding pattern and the bisulphate\nand hydronium version. Ding \\emph{et al.} \\citep{DingC.-G.} calculated\nthe value of this parameter to be $144.0\\:\\mathrm{kcal/mol}$ ($602.5\\:\\mathrm{kJ/mol}$),\nbut for our purposes it was considered to be a free parameter and\nis fitted to higher level theory data.\n\n\n\\subsection{Off-diagonal terms\\label{sub:Off-Diagonal}}\n\nThe form chosen for the off-diagonal terms in the Hamiltonian describing\nsulphuric acid-water proton transfer is based upon the MS-EVB3 model\n(Eq. (\\ref{eq:MSEVBOFFD})), with two modifications. These relate\nto the expression involving the $\\mathbf{q}$ parameter (Section \\ref{subsub:qdependence})\nand the method for calculating $V_{{\\rm ex}}^{ij}$ (Section \\ref{subsub:Intermediate-charges-1}).\n\n\n\\subsubsection{The $\\mathbf{q}$ dependence\\label{subsub:qdependence}}\n\n\n\n There is a problem with using a limited basis set, especially when there are long-range off-diagonal terms in the Hamiltonian matrix. If configurational evolution brings about a change in identity of the species that might accept the proton from a given \\textbf{\\tt{donor}} species, then the replacement of one energy surface by another will bring about an abrupt jump in energy that will need to be damped out by the thermostat. However, we have designed the two-state EVB scheme to avoid such jumps as much as possible. Mixing between bonding patterns will only come about when the proton in question occupies a specific region between the \\textbf{\\tt{donor}} and \\textbf{\\tt{acceptor}} species. Outside this region, the interactions revert to those of a single pattern of bonding, and crucially, the energy surface is continuous at the boundary of the region. This is encoded in the specification of off-diagonal terms which vanish for proton positions outside an ellipsoidal volume centred on the mid-point between the donating and accepting oxygen atoms.\n\n\n\n\n\n\n\n\nSpecifically, the factor in\nEq. (\\ref{eq:MSEVBOFFD}) involving $\\mathbf{q}$ becomes\n\n", "index": 11, "text": "\\begin{equation}\n\\exp(-\\gamma\\mathbf{q}^{2})\\rightarrow\\begin{cases}\n\\left[\\frac{\\exp(-(\\gamma\\mathbf{q}_{0}^{2}-1))-1}{{\\rm e}-1}\\right] & \\mathbf{q}_{0}^{2}\\leq\\gamma^{-1}\\\\\n0 & \\mathbf{q}_{0}^{2}>\\gamma^{-1}\n\\end{cases}\\label{eq:gammaMod}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\exp(-\\gamma\\mathbf{q}^{2})\\rightarrow\\begin{cases}\\left[\\frac{\\exp(-(\\gamma%&#10;\\mathbf{q}_{0}^{2}-1))-1}{{\\rm e}-1}\\right]&amp;\\mathbf{q}_{0}^{2}\\leq\\gamma^{-1}%&#10;\\\\&#10;0&amp;\\mathbf{q}_{0}^{2}&gt;\\gamma^{-1}\\end{cases}\" display=\"block\"><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><mi>γ</mi><mo>⁢</mo><msup><mi>𝐪</mi><mn>2</mn></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>→</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mo>[</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>γ</mi><mo>⁢</mo><msubsup><mi>𝐪</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mrow><mi mathvariant=\"normal\">e</mi><mo>-</mo><mn>1</mn></mrow></mfrac></mstyle><mo>]</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><msubsup><mi>𝐪</mi><mn>0</mn><mn>2</mn></msubsup><mo>≤</mo><msup><mi>γ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mn>0</mn></mtd><mtd columnalign=\"left\"><mrow><msubsup><mi>𝐪</mi><mn>0</mn><mn>2</mn></msubsup><mo>&gt;</mo><msup><mi>γ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\n\n\n\\noindent where $E_{{\\rm total}}$ refers to the total energy of a\nsystem according to the EVB method. $A$ and $B$ refer to separate\n\\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor} }pairs (see Figure 1 in\nreference \\citep{Wang2005}). $E_{AA}$ and $E_{BB}$ refer to the\nindependent energy contributions of the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}\n}pairs and includes their off-diagonal contributions. $E_{AB}$ describes\nthe energy contribution due to interactions between $A$ and $B$.\n$R$ refers to the rest of the system, and there are three further\ncontributions due to interactions between $A$ and $R$, $B$ and\n$R$ and the independent energy contribution of $R$, referred to\nas $E_{AR}$, $E_{BR}$ and $E_{RR}$ respectively. Eq. (\\ref{eq:RefTotalEnergy})\ncan be generalised to $E_{{\\rm total}}=E_{RR}+\\sum_{n}\\left(E_{nn}+E_{nR}+\\sum_{m\\ne n}E_{nm}\\right)$\nwhere $n$ and $m$ refer to the identified \\textbf{\\tt{donor}}/\\textbf{\\tt{acceptor}\n}pairs. Once $E_{{\\rm total}}$ has been constructed it simply remains\nto apply the Hellmann-Feynman theorem to determine the force acting\nupon each atom within the system.\n\n\n\\subsection{Model overview\\label{sub:Model-Overview}}\n\nIn summary, the model is an algorithm consisting of the following\nseries of steps:\n\\begin{enumerate}\n\\item Construct a\\textbf{ \\tt{ground state}} from a set of atomic positions\n(Section \\ref{sub:State-selector-algorithm}).\n\\item Identify the \\textbf{\\tt{excited states}} (Section \\ref{sub:Excited-basis-states}).\n\\item Calculate the on-diagonal and off-diagonal terms of the $2\\times2$\nmatrix $\\mathcal{H}$ for each \\textbf{\\tt{excited state} }(Sections\n\\ref{sub:Underlying-classical-potential} and \\ref{subsub:qdependence}).\n\\item Optimise the $\\mathbf{c}_{i}$ vectors for each \\textbf{\\tt{excited state}}\nby performing a self-consistent iterative procedure which revises\nthe off-diagonal terms and allows multiple proton transfers to be\naccommodated (Sections \\ref{subsub:Intermediate-charges-1} and \\ref{sub:Multiple-proton-procedure}).\n\\item Calculate the energy of the system and the forces acting upon each\natom (Section \\ref{sub:Force-calculation}).\n\\end{enumerate}\nOnce the parameters of the model have been selected, the procedure\ncan be implemented in a classical molecular dynamics code, and we\nhave done this using the DL\\_POLY $\\mathrm{4.03}$ package \\citep{Todorov2006}.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig4}\n\\par\\end{centering}\n\n\\begin{centering}\n\\protect\\caption{Sets of positions of a hydrogen atom in spatial regions of mixed bonding\n(a), together with corresponding contour plots of the potential energy\nin units of eV (b), for the I-n configuration (labelled according\nto reference \\citep{Re1999}) of a sulphuric acid and a water molecule.\nThe centre of the contour plots lies at the mid-point between the\ntwo participating oxygens and the labels 1, 2 and 3 in (b) refer to\nthe arrays of points shown in (a). The cyan, red and green spheres\nin (a) match the equivalent top left, top right and the bottom right\nof each plot in (b), respectively. The energy when the hydrogen is\nat position $(-0.4\\textrm{\\AA},-0.4\\textrm{\\AA},-0.4\\textrm{\\AA})$\nrelative to the mid-point is set to a reference point of zero for\nboth the DFT and EVB calculations. \\label{fig:EnergyPlanes1-1}}\n\n\\par\\end{centering}\n\n\\end{figure}\n\n\n\n\n\n\n\n\\section{Results\\label{sec:5Results}}\n\nWe have parametrised the EVB model against reference configurational\nenergies calculated from a DFT approach using a particle swarm optimisation\n(PSO) fitting scheme, the details of which are described in the Appendix.\nWe focus in this section on investigating various features of the\nparametrised model.\n\nFigure \\ref{fig:EnergyPlanes1-1} shows the potential energy of a\nsulphuric acid/water system as a function of the position of a transferring\nhydrogen atom, comparing the performance of the EVB model with a set\nof reference data. It is important to recognise that the EVB scheme\ndoes not operate for hydrogen positions beyond a distance $\\pm0.3\\textrm{\\AA}$\nin the $\\mathbf{r}_{{\\rm OO}}$ direction starting from $\\frac{1}{2}(\\mathbf{r}_{{\\rm O}1}+\\mathbf{r}_{{\\rm O}2})$,\nthe mid-point between the oxygens atoms involved in the hydrogen bond,\nand so energies at hydrogen positions labelled $\\pm0.4\\textrm{\\AA}$\nin the $\\mathbf{r}_{{\\rm OO}}$ direction are for unmixed bonding\nand are not affected by the EVB parametrisation scheme. The comparison\ndemonstrates an overall correspondence between the EVB model and the\nDFT results. The scheme is limited in that it is only active for hydrogen\npositions lying in an ellipsoidal spatial region around the mid-point\nbetween the oxygens, that it only represents two possible bonding\nstates per proton and that ultimately it is underpinned by a classical\npotential fit to the reference data and an empirical form for the\noff-diagonal term. Nevertheless, the EVB model seems to capture the\nshape of the energy surface experienced by the hydrogen atom.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\noindent\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig6}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:Water_populations}Evolution in the population of water\nmolecules in simulations starting with the values indicated above\neach frame. A decrease of one in the water population indicates an\nionisation event $\\mathrm{[H_{2}SO_{4}]+[H_{2}O]_{n}\\rightarrow[HSO_{4}]^{-}+[H_{3}O]^{+}+[H_{2}O]_{n-1}}$,\nand an increase by one refers to the reverse of this reaction. The\nsimulations were performed at $\\mathrm{200}$ K (top) and $\\mathrm{300}$\nK (bottom).}\n\\end{figure}\n\n\nNext, we demonstrate how the propensity for proton transfer from an\nacid molecule is affected by the extent of the surrounding water network.\nFigure \\ref{fig:Water_populations} tracks the population of water\nmolecules in various simulations of $\\mathrm{[H_{2}SO_{4}]+[H_{2}O]_{n}}$\nwith $\\mathrm{n=2-4}$, over a time period of $\\mathrm{1}$ ns after\na $\\mathrm{20}$ ps equilibration period. The simulations employed\na Langevin thermostat with target temperatures of $\\mathrm{300\\: K}$\nor $\\mathrm{200}$ K using a modified version of the DL\\_POLY $\\mathrm{4.03}$\nprogram \\citep{Todorov2006}. There was no constraint on the centre\nof mass motion or the rotation of the clusters. The results show that\nat $\\mathrm{300}$ K there is very little propensity for the proton\nto transfer to the closest water and remain there more than momentarily\nin the $\\mathrm{{\\rm n}=2}$ and $\\mathrm{{\\rm n}=3}$ cases. The\nhydrogen bond rarely fluctuates to such an extent that the ground\nstate configuration consists of a bisulphate/hydronium rather than\nthe sulphuric acid/water bonding pattern. However, for the $\\mathrm{{\\rm n}=4}$\ncase, the system spends the majority of its time in the dissociated\nstate. Proton transfers are more frequent and quasistable. When the\n$\\mathrm{{\\rm n}=4}$ simulation is run at 200 K, however, we see\nthat it remains undissociated for a longer period of time suggesting\nthat the dissociated state is less stable at lower temperature, which\nis to be expected. These conclusions are in agreement with work performed\nat zero temperature using a higher level of theory \\citep{Arrouvel2005,Re1999,Bandy1998},\naccording to which the first dissociation event of a sulphuric acid\nmolecule occurs when hydrated by between $\\mathrm{3}$ and $6$ water\nmolecules.\n\nWhen running the EVB model at 300 K we observe changes in configuration\nthat involve intermolecular bond making and breaking, characteristic\nof the expected liquid-like nature of the system at relatively high\ntemperatures. We also observe the Grotthuss mechanism where protons\nshuffle around the water network \\citep{Paxton14}.\n\n\n\\section{Conclusions\\label{sec:6Conclusion}}\n\nA two-state EVB model for the sulphuric acid, bisulphate, hydronium\nand water system has been presented, which is based upon the MS-EVB3\nand SCI-MS-EVB models developed for hydronium/water alone \\citep{Schmitt1998,Day2002}.\nThe approach essentially provides an interpolation between two energy\nsurfaces corresponding to the choices of bonding pattern available\nto a proton in a particular spatial region between a bisulphate and\na water. It involves a Hamiltonian represented in a basis of bonding\npatterns, with diagonal terms based on classical force fields, and\noff-diagonal terms constructed empirically and fitted to higher level\ncalculations.\n\n\nThe limitation of the basis to two states implies that the model does not\nmatch the state of the art in the description of protonated water systems \\citep{Knight12} but\nit provides the simplest scheme for representing proton transfer between sulphuric acid and water species,\nthe focus of our attention here and a new application of the EVB framework. An extension to include more\nelaborate basis sets would be possible.\n\nThe parametrisation of the off-diagonal terms has been performed using\nthe particle swarm optimisation (PSO) technique, with reference to\nDFT data for specific cases of sulphuric acid/water proton transfer\nevents. The resulting scheme has been integrated into a modified version\nof the DL\\_POLY 4.03 MD code \\citep{Todorov2006}. A quantitative\ncomparison of the potential energy surface for the transferring proton\nwithin a geometry-optimised static configuration of one sulphuric\nacid and one water molecule gives good agreement. The level of hydration\nrequired for the first ionisation or dissociation of a single sulphuric\nacid molecule at $\\mathrm{300\\: K}$ has been investigated, revealing\nthat a system with four water molecules is best described by a complex\nmixture between neutral and ionised bonding. At $\\mathrm{200\\: K}$\nthe four water case remains predominantly neutral, indicating that\nan increase in temperature promotes proton transfer, as would be expected.\nIn highly hydrated structures, the proton becomes very mobile within\nthe water network.\n\nThe main motivation for developing this model is to provide a tool\nfor the fast simulation of cluster structures. The key performance\ndetails are as follows. The run time for a 1 ns simulation with six\nwater molecules and one acid is $\\mathrm{430\\: seconds}$ on one Intel\nCore i5-460M processor and it is, therefore, easily possible to generate\ntrajectories several tens of nanoseconds in length for quite substantial\nsystems using this model. The parametrisation procedure and tests\nwe have reported give us confidence that the physics of proton transfer\nhas been well captured by the scheme. Our computationally inexpensive\nmethod is suitable for performing calculations of the thermodynamic\nproperties of clusters of water and sulphuric acid molecules at a\nrange of temperatures relevant to the atmosphere. We shall report\nthese results in future publications.\n\n\n\\section*{Acknowledgements}\n\nSMK was supported in part by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, Division of Chemical Sciences, Geosciences, and Biosciences; JLS and IJF were supported by the IMPACT scheme at University College London (UCL). We acknowledge the UCL Legion High Performance Computing Facility, and associated support services together with the resources of the National Energy Research Scientific Computing Center (NERSC), which is supported by the U.S. Department of Energy under Contract No. DE-AC02- 05CH11231.  JLS thanks Dr. Gregory Schenter, Dr. Theo Kurt\\'{e}n and Prof. Hanna Vehkam\\\"{a}ki for important guidance and discussions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{44}\n\\providecommand{\\url}[1]{\\texttt{#1}}\n\\providecommand{\\urlprefix}{URL }\n\\markboth{Taylor \\& Francis and I.T. Consultant}{Molecular Physics}\n\n\\bibitem{Zhang2012}\nR. Zhang, A. Khalizov, L. Wang, M. Hu and W. Xu,  Chem. Rev.  \\textbf{112},\n  1957 (2012).\n\n\\bibitem{Kulmala14}\nM. Kulmala, T. Pet{\\\"a}j{\\\"a}, M. Ehn, J. Thornton, M. Sipal{\\\"a}, D. Worsnop\n  and V.M. Kerminen,  Annu. Rev. Phys. Chem.  \\textbf{65}, 21 (2014).\n\n\\bibitem{Kirkby2011}\n{J. Kirkby et al.},  Nature  \\textbf{476}, 429 (2011).\n\n\\bibitem{Riccobono14}\n{F. Riccobono et al.},  Science  \\textbf{344}, 717 (2014).\n\n\\bibitem{Ford2004}\nI.J. Ford,  Proc. Inst. Mech. Eng., Part C: J. Mech. Eng. Sci.  \\textbf{218},\n  883 (2004).\n\n\\bibitem{Kalikmanov-book2013}\nV.I. Kalikmanov, \\emph{Nucleation Theory}   (Springer, Heidelberg, 2013).\n\n\\bibitem{McGrath12}\nM.J. McGrath, T. Olenius, I.K. Ortega, V. Loukonen, P. Paasonen, T. Kurt{\\'e}n,\n  M. Kulmala and H. Vehkamäki,  Atmos. Chem. Phys.  \\textbf{12}, 2345 (2012).\n\n\\bibitem{girshick90}\nS.L. Girshick and C.P. Chiu,  J. Chem. Phys.  \\textbf{93}, 1273 (1990).\n\n\\bibitem{laaksonen94}\nA. Laaksonen, I.J. Ford and M. Kulmala,  Phys. Rev. E  \\textbf{49}, 5517\n  (1994).\n\n\\bibitem{kalikmanov95}\nV.I. Kalikmanov and M.E.H. van Dongen,  J. Chem. Phys.  \\textbf{103}, 4250\n  (1995).\n\n\\bibitem{Vehkamaki}\nH. Vehkam\\\"{a}ki, \\emph{{Classical Nucleation Theory in Multicomponent\n  Systems}}   (Springer, Berlin, 2006).\n\n\\bibitem{Brus2011}\nD. Brus, K. Neitola, A.P. Hyv\\\"{a}rinen, T. Pet\\\"{a}j\\\"{a}, J. Vanhanen, M.\n  Sipil\\\"{a}, P. Paasonen, M. Kulmala and H. Lihavainen,  Atmos. Chem. Phys.\n  \\textbf{11}, 5277 (2011).\n\n\\bibitem{Kakizaki2009}\nA. Kakizaki, H. Motegi, T. Yoshikawa, T. Takayanagi, M. Shiga and M. Tachikawa,\n   J. Mol. Struc-THEOCHEM  \\textbf{901}, 1 (2009).\n\n\\bibitem{Sugawara2011}\nS. Sugawara, T. Yoshikawa, T. Takayanagi, M. Shiga and M. Tachikawa,  J. Phys.\n  Chem. A  \\textbf{115}, 11486 (2011).\n\n\\bibitem{Arrouvel2005}\nC. Arrouvel, V. Viossat and C. Minot,  J. Mol. Struc-THEOCHEM  \\textbf{718}, 71\n  (2005).\n\n\\bibitem{stinson14}\nJ.L. Stinson, S.M. Kathmann and I.J. Ford,  J. Chem. Phys.  \\textbf{140},\n  024306 (2014).\n\n\\bibitem{Frenkel2001}\nD. Frenkel and B. Smit, \\emph{{Understanding Molecular Simulations: from\n  Algorithms to Application}}, 2nd ed.   (Elsevier, Amsterdam, 2001).\n\n\\bibitem{Ford2004c}\nI.J. Ford and S.A. Harris,  J. Chem. Phys.  \\textbf{120}, 4428 (2004).\n\n\\bibitem{Tang15}\nH.Y. Tang and I.J. Ford,  Phys. Rev. E  \\textbf{91}, 023308 (2015).\n\n\\bibitem{Pohorille07}\n{C. Chipot and A. Pohorille, (Eds.)}, \\emph{Free Energy Calculations}\n  (Springer, Heidelberg, 2007).\n\n\\bibitem{Kusaka1998}\nI. Kusaka, Z.G. Wang and J.H. Seinfeld,  J. Chem. Phys.  \\textbf{108}, 6829\n  (1998).\n\n\\bibitem{Kathmann2001}\nS.M. Kathmann and B.N. Hale,  J. Phys. Chem. B  \\textbf{105}, 11719 (2001).\n\n\\bibitem{DingC.-G.}\nC.G. Ding, T. Taskila, K. Laasonen and A. Laaksonen,  Chem. Phys.\n  \\textbf{287}, 7 (2003).\n\n\\bibitem{Toivola2009b}\nM. Toivola, I. Napari and H. Vehkam\\\"{a}ki,  Boreal Environment Research\n  \\textbf{14}, 654 (2009).\n\n\\bibitem{Bartok2010}\nA.P. Bart\\'{o}k, M.C. Payne and G. Cs\\'{a}nyi,  Phys. Rev. Lett.  \\textbf{104},\n  1 (2010).\n\n\\bibitem{VanDuin2001}\nA.C.T. van Duin, S. Dasgupta, F. Lorant and W.A. Goddard,  J. Phys. Chem. A\n  \\textbf{105}, 9396 (2001).\n\n\\bibitem{Kamerlin2011a}\nS.C.L. Kamerlin and A. Warshel,  Wiley Interdisciplinary Reviews: Computational\n  Molecular Science  \\textbf{1}, 30 (2011).\n\n\\bibitem{Aqvist1993}\nJ. Aqvist and A. Warshel,  Chem. Rev.  \\textbf{93}, 2523 (1993).\n\n\\bibitem{Schmitt1998}\nU.W. Schmitt and G.A. Voth,  J. Phys. Chem. B  \\textbf{102}, 5547 (1998).\n\n\\bibitem{Day2002}\nT.J.F. Day, A.V. Soudackov, M. \\v{C}uma, U.W. Schmitt and G.A. Voth,  J. Chem.\n  Phys.  \\textbf{117}, 5839 (2002).\n\n\\bibitem{Wu2008}\nY. Wu, H. Chen, F. Wang, F. Paesani and G.A. Voth,  J. Phys. Chem. B\n  \\textbf{112}, 467 (2008).\n\n\\bibitem{Wang2005}\nF. Wang and G.A. Voth,  J. Chem. Phys.  \\textbf{122}, 144105 (2005).\n\n\\bibitem{Knight12}\nC. Knight and G.A. Voth, Acc. Chem. Res. \\textbf{45}, 101 (2012).\n\n\\bibitem{Loukonen2010}\nV. Loukonen, T. Kurt\\'{e}n, I.K. Ortega, H. Vehkam\\\"{a}ki, A.A.H. P\\'{a}dua, K.\n  Sellegri and M. Kulmala,  Atmos. Chem. Phys.  \\textbf{10}, 4961 (2010).\n\n\\bibitem{Lopez-Lemus08}\n{J. Lopez-Lemus, G.A. Chapela and J. Alejandre},  J. Chem. Phys.  \\textbf{128},\n  174703 (2008).\n\n\\bibitem{Todorov2006}\nI.T. Todorov, W. Smith, K. Trachenko and M.T. Dove,  J. Materials Chem.\n  \\textbf{16}, 1911 (2006).\n\n\\bibitem{Re1999}\nS. Re, Y. Osamura and K. Morokuma,  J. Phys. Chem. A  \\textbf{103}, 3535\n  (1999).\n\n\\bibitem{Bandy1998}\nA.R. Bandy and J.C. Ianni,  J. Phys. Chem. A  \\textbf{102}, 6533 (1998).\n\n\\bibitem{Paxton14}\nA.Y. Lozovoi, T.J. Sheppard, D.L. Pashov, J.J. Kohanoff and A.T. Paxton,  J.\n  Chem. Phys.  \\textbf{141}, 044504 (2014).\n\n\\bibitem{Banks2007b}\nA. Banks, J. Vincent and C. Anyakoha,  Nat. Comput.  \\textbf{6}, 467 (2007).\n\n\\bibitem{Banks2007a}\nA. Banks, J. Vincent and C. Anyakoha,  Nat. Comput.  \\textbf{7}, 109 (2007).\n\n\\bibitem{Poli2008}\nR. Poli,  J. Artif. Evol. App.  \\textbf{2008}, 685175 (2008).\n\n\\bibitem{Shi1998}\nY. Shi and R. Eberhart, {A modified particle swarm optimizer}. in\n  \\emph{Proceedings of the IEEE International Conference on Evolutionary\n  Computation}  (IEEE, New Jersey, 1998), pp. 69--73.\n\n\\bibitem{Perdew1996}\nJ. Perdew, K. Burke and M. Ernzerhof,  Phys. Rev. Lett.  \\textbf{77}, 3865\n  (1996).\n\n\\bibitem{Clark2005}\nS.J. Clark, M.D. Segall and C.J. Pickard,  Z. Kristallogr.  \\textbf{220}, 567\n  (2005).\n\n\\end{thebibliography}\n\n\\appendix\n\n\\section{Parameter fitting procedure\\label{sec:Fitting-procedure}}\n\nThe original MS-EVB3 model was parametrised to describe hydronium/water\nproton transfers \\citep{Wu2008}. We chose to employ slightly different\nclassical force fields for the water molecule and hydronium ion, requiring\nus to revisit this parametrisation. The SPC/EF potential was employed\nfor water (see Loukonen \\emph{et al.} \\citep{Loukonen2010}) as well\nas a modified version of the Morse potential in the MS-EVB3 model\n(see \\ref{sub:Underlying-classical-potential}). Three parameters\nin the MS-EVB3 off-diagonal term for hydronium/water were refitted:\nthese were $R_{{\\rm OO}}^{0}=2.7$\\foreignlanguage{english}{\\AA },\n$P=0.4$ and $D_{{\\rm OO}}=2.65$\\foreignlanguage{english}{\\AA{}}\nand for this system we use $\\tau_{x}=\\tau_{yz}=0.3$.\n\nTwo further proton transfer reactions are possible in the system under\nconsideration, namely sulphuric acid/water and sulphuric acid/bisulphate\nbut we disregard the latter as it is likely to be rare. We parametrised\nthe new off-diagonal terms for sulphuric acid/water EVB mixing using\nthe particle swarm optimisation (PSO) scheme \\citep{Banks2007b,Banks2007a}.\nThis technique has been employed in a variety of areas (reviewed in\nreference \\citep{Poli2008}) and we consider it to be sufficiently\npowerful for use in potential fitting as well.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{FigA1}\n\\par\\end{centering}\n\n\\protect\\caption{Snapshot from a four `particle' PSO procedure to optimise two parameters\nof a model. The darker shaded regions of parameter space represent\na poor fit between model and data, while lighter shades represent\na good fit (as determined by Eq. (\\ref{eq:PSOFit})). The particles\nfollow trajectories through parameter space influenced by `forces'\ndirected towards individual ($p_{i})$ and collective ($p_{g})$ best\nfit positions. The strength of the forces is influenced by noise introduced\ninto the swarm through variables $\\beta_{1}$ and $\\beta_{2}$.\\label{fig:PSODia}}\n\\end{figure}\n\n\nThe PSO method is used to perform a force matching parametrisation\nagainst DFT data. It employs a swarm of `particles', each representing\na choice of a set of parameters $\\{\\mathbf{\\alpha}\\}$. The goodness\nof fit is assessed using a function, $f$, defined as\n\n", "itemtype": "equation", "pos": 39203, "prevtext": "\nwhere $\\mathbf{q}_{0}^{2}$ is related to $\\mathbf{q}$ in the following\nway. The $\\mathbf{q}$ vector is expressed in a new orthogonal coordinate\nsystem $\\mathbf{q}^{\\prime}$ in which the $x$-axis is parallel to\n$\\mathbf{r}_{{\\rm OO}}$, where $\\mathbf{r}_{{\\rm OO}}=\\mathbf{r}_{{\\rm O}1}-\\mathbf{r}_{{\\rm O}2}$\nis the vector separation between oxygens. The other two axes take\narbitrary orientations. $\\mathbf{q}_{0}^{2}$ is then defined as $\\mathbf{q}_{0}^{2}=\\left(q'_{x}/\\tau_{x}\\right)^{2}+\\left(q'_{y}/\\tau_{yz}\\right)^{2}+\\left(q'_{z}/\\tau_{yz}\\right)^{2}$\nwhere the $\\tau_{x}$ and $\\tau_{yz}$ are unitless scaling factors\nrepresenting semi-major axes of an ellipsoid with respect to the $x$\naxis, and the $y$ and $z$ axes, respectively. In effect, a hydrogen\natom experiences mixed bonding within an ellipsoidal volume between\nthe two appropriate oxygen atoms. We find that this eliminates occasional ambiguities with regard to\nwhich oxygen pair is appropriate for the mixed bonding experienced\nby a particular hydrogen, introducing discontinuities in\nthe potential energy landscape. The two variables $\\tau_{x}$ and\n$\\tau_{yz}$ are treated as additional fitting parameters. The form\nof Eq. (\\ref{eq:gammaMod}) ensures two features: the expression is\nequal to unity at $\\mathbf{q}_{0}^{2}=0$ and goes to zero on the\nsurface of the ellipsoid at $\\mathbf{q}_{0}^{2}=\\gamma^{-1}$, beyond\nwhich the off-diagonal term vanishes to enforce ordinary unmixed\nbehaviour outside the ellipsoid.\n\n In principle, a  jump in energy can still occur if ellipsoidal mixing regions between two donor-acceptor pairs come into overlap as a consequence of configurational change. Such situations can occasionally arise during the molecular dynamics, but we have restricted the regions of mixing, through the parameters $\\tau_x$ and $\\tau_{yz}$, specifically to avoid this. For most of the time there is no ambiguity in the choice of basis set to use for a configuration and few occasions when a jump in energy occurs according to our scheme. These jumps are unphysical, and a breakage of NVE conditions, but are the price to pay for the simplicity of the implementation.\n\n\n\\subsubsection{Interpolated charges\\label{subsub:Intermediate-charges-1}}\n\nThe $V_{{\\rm ex}}^{ij}$ parameter in Eq. (\\ref{eq:VijExMSEVB3})\nis also modified since the charges provided by the MS-EVB3 model for\nthe calculation of this term are specific to the Zundel cation and\ndo not transfer to a sulphuric acid and water model. We recall that\nit represents external electrostatic interactions for the group of\natoms involved in the mixing of bonding patterns. Our approach is\nto interpolate the charges of these atoms according to the $c_{i}$\ncoefficients of the mixture. The procedure is as follows:\n\\begin{enumerate}\n\\item Initially the charges are assumed to be $q=\\frac{1}{2}(q^{gs}+q^{es})$,\nwhere $q^{gs}$ and\\textbf{ }$q^{es}$ are the partial charges for\nthat atom according to the classical potential provided, in accordance\nwith whether the bonding is identified as the \\textbf{\\tt{ground state}\n}or the \\textbf{\\tt{excited state}}, respectively.\n\\item A self-consistent iteration is performed where \\foreignlanguage{english}{$q$}\nis updated according to $q=c_{gs}^{2}q^{gs}+c_{es}^{2}q^{es}$ where\n$c_{gs}$ and $c_{es}$ are the eigenvector coefficients for the \\textbf{\\tt{ground state}\n}and \\textbf{\\tt{excited state}}, respectively, obtained from the\ntwo-level Hamiltonian describing the mixing.\n\\end{enumerate}\nThis procedure is performed alongside a separate self-consistent iterative\nprocess described in the next section, the purpose of which is to\nallow consideration of multiple proton transfers.\n\n\n\\subsection{Multiple proton procedure \\label{sub:Multiple-proton-procedure}}\n\nThe modelling of systems undergoing multiple proton transfers follows\nthe SCI-MS-EVB procedure developed by Wang and Voth \\citep{Wang2005}.\nFigure \\ref{fig:ExcitedStateImage} shows a system where this extension\nis required as it has three \\textbf{\\tt{excited states}} available.\nThe starting point in this procedure is to neglect overlap between\ntwo different excited states (i.e. $\\bra{i}H\\ket{j}=0$ where $i$\nand $j$ represent two different excited states). This allows for\nthe reduction of the EVB Hamiltonian matrix of the system, which is\nof order $n_{d}^{n_{c}}$, to $n_{d}$ matrices of order $n_{c}$\nwhere $n_{d}$ is the number of donor molecules being considered and\n$n_{c}$ is the number basis states considered per donor molecule.\nAn iterative procedure is then used to correct these matrices for\nthe $\\bra{i}H\\ket{j}$ contributions. The method can be described\nas follows:\n\\begin{enumerate}\n\\item We determine the eigenvector for each $2\\times2$ matrix $\\mathcal{H}$\ncorresponding to the \\textbf{\\tt{ground state} }and an\\textbf{ \\tt{excited state}}.\nFor clarity, $n$ is  used as a label such that $\\mathbf{c}_{n}$\nand $\\mathcal{H}_{n}$ are defined for the $n^{{\\rm th}}$\\textbf{\n\\tt{excited state}}. In addition, $n$ is used to label the \\textbf{\\tt{donor}}\nand \\textbf{\\tt{acceptor} }species that define the \\textbf{\\tt{excited state}}.\n\\item Each $\\mathcal{H}_{n}$ is then corrected for the effect of \\textbf{\\tt{excited state}\n$m$} where $m\\neq n$. This is performed by updating the intermolecular\nenergy contributions to the diagonal terms in $\\mathcal{H}_{n}$,\ni.e. $E_{{\\rm inter}}^{gs}\\rightarrow\\left(c_{gs}^{2}E_{{\\rm inter}}^{gs}+c_{es}^{2}E_{{\\rm inter}}^{es}\\right)$\nwhere $c_{gs}^{2}$ and $c_{es}^{2}$ are the squared coefficients\nof the $\\mathbf{c}_{m}$ eigenvector representing the associated \\textbf{\\tt{ground state}}\nand \\textbf{\\tt{excited state}}. $E_{{\\rm inter}}^{gs}$ and $E_{{\\rm inter}}^{es}$\nare the intermolecular energy contributions resulting from interactions\nbetween the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $n$\nand the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $m$ in\nthe \\textbf{\\tt{ground state}} and \\textbf{\\tt{excited state}} of\n$m$ respectively. The expression $V_{{\\rm ex}}^{ij}$ in the off-diagonal\nterm is updated in the same fashion; this includes recalculating the\ncharges \\foreignlanguage{english}{$q$} according to the procedure\nin Section \\ref{subsub:Intermediate-charges-1}. The $\\mathbf{c}_{n}$\nvalues are then recalculated. This allows the coefficients\\textbf{\n$\\mathbf{c}_{n}$ }for the\\textbf{ \\tt{acceptor}}/\\textbf{\\tt{donor}}\npair $n$\\textbf{ }to be corrected for the intermolecular interactions\narising from \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair $m$.\nThis step is repeated until each $\\mathbf{c}_{n}$ vector has been\ncorrected for each \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}} pair\n$m$ (where $m\\ne n$).\n\\item Step $2$ is repeated until all $\\mathbf{c}_{n}$ eigenvectors have\nconverged. This is tested by defining $C_{{\\rm sum}}=\\sum_{n}(\\mathbf{c}_{n}^{{\\rm old}}-\\mathbf{c}_{n}^{{\\rm new}})^{2}$\nwhere $\\mathbf{c}_{n}^{{\\rm old}}$ and $\\mathbf{c}_{n}^{{\\rm new}}$\nare the (normalised) $\\mathrm{\\mathbf{c}}_{n}$ eigenvectors calculated\nbefore and after step $2$ is performed. The system is considered\nto be converged when $C_{{\\rm sum}}<10^{-5}$, or when step 2 has\nbeen cycled 10 times. In practice only a few iterations are required.\n\\end{enumerate}\n\n\\subsection{Energy and force calculation\\label{sub:Force-calculation}}\n\nOnce the self-consistency iterations have been performed, the energy\nof the system can be computed in the same fashion as in the SCI-MS-EVB\nmethod. Eq. (13) in reference \\citep{Wang2005}  gives a deconstruction\nof the total energy of a system containing two excess protons in the\nform\n\n\n", "index": 13, "text": "\\begin{equation}\nE_{{\\rm total}}=E_{AA}+E_{BB}+E_{AB}+E_{AR}+E_{BR}+E_{RR},\\label{eq:RefTotalEnergy}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"E_{{\\rm total}}=E_{AA}+E_{BB}+E_{AB}+E_{AR}+E_{BR}+E_{RR},\" display=\"block\"><mrow><mrow><msub><mi>E</mi><mi>total</mi></msub><mo>=</mo><mrow><msub><mi>E</mi><mrow><mi>A</mi><mo>⁢</mo><mi>A</mi></mrow></msub><mo>+</mo><msub><mi>E</mi><mrow><mi>B</mi><mo>⁢</mo><mi>B</mi></mrow></msub><mo>+</mo><msub><mi>E</mi><mrow><mi>A</mi><mo>⁢</mo><mi>B</mi></mrow></msub><mo>+</mo><msub><mi>E</mi><mrow><mi>A</mi><mo>⁢</mo><mi>R</mi></mrow></msub><mo>+</mo><msub><mi>E</mi><mrow><mi>B</mi><mo>⁢</mo><mi>R</mi></mrow></msub><mo>+</mo><msub><mi>E</mi><mrow><mi>R</mi><mo>⁢</mo><mi>R</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\nwhere $F_{{\\rm ref}}$ denotes the reference forces for an atomic\nconfiguration, and $F_{{\\rm model}}(\\{\\alpha\\})$ represents the model\nforces for the same configuration, given parameters $\\{\\mathbf{\\alpha}\\}$.\nThe square deviations are summed over a series of configurations to\nprovide a global assessment of the fit between model and reference\ndata.\n\nThe particles are allowed to explore parameter space according to\na simple set of evolution equations for each parameter as described\nby Shi and Eberhart \\citep{Shi1998}:\n\n\n", "itemtype": "equation", "pos": 58683, "prevtext": "\n\n\n\\noindent where $E_{{\\rm total}}$ refers to the total energy of a\nsystem according to the EVB method. $A$ and $B$ refer to separate\n\\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor} }pairs (see Figure 1 in\nreference \\citep{Wang2005}). $E_{AA}$ and $E_{BB}$ refer to the\nindependent energy contributions of the \\textbf{\\tt{acceptor}}/\\textbf{\\tt{donor}\n}pairs and includes their off-diagonal contributions. $E_{AB}$ describes\nthe energy contribution due to interactions between $A$ and $B$.\n$R$ refers to the rest of the system, and there are three further\ncontributions due to interactions between $A$ and $R$, $B$ and\n$R$ and the independent energy contribution of $R$, referred to\nas $E_{AR}$, $E_{BR}$ and $E_{RR}$ respectively. Eq. (\\ref{eq:RefTotalEnergy})\ncan be generalised to $E_{{\\rm total}}=E_{RR}+\\sum_{n}\\left(E_{nn}+E_{nR}+\\sum_{m\\ne n}E_{nm}\\right)$\nwhere $n$ and $m$ refer to the identified \\textbf{\\tt{donor}}/\\textbf{\\tt{acceptor}\n}pairs. Once $E_{{\\rm total}}$ has been constructed it simply remains\nto apply the Hellmann-Feynman theorem to determine the force acting\nupon each atom within the system.\n\n\n\\subsection{Model overview\\label{sub:Model-Overview}}\n\nIn summary, the model is an algorithm consisting of the following\nseries of steps:\n\\begin{enumerate}\n\\item Construct a\\textbf{ \\tt{ground state}} from a set of atomic positions\n(Section \\ref{sub:State-selector-algorithm}).\n\\item Identify the \\textbf{\\tt{excited states}} (Section \\ref{sub:Excited-basis-states}).\n\\item Calculate the on-diagonal and off-diagonal terms of the $2\\times2$\nmatrix $\\mathcal{H}$ for each \\textbf{\\tt{excited state} }(Sections\n\\ref{sub:Underlying-classical-potential} and \\ref{subsub:qdependence}).\n\\item Optimise the $\\mathbf{c}_{i}$ vectors for each \\textbf{\\tt{excited state}}\nby performing a self-consistent iterative procedure which revises\nthe off-diagonal terms and allows multiple proton transfers to be\naccommodated (Sections \\ref{subsub:Intermediate-charges-1} and \\ref{sub:Multiple-proton-procedure}).\n\\item Calculate the energy of the system and the forces acting upon each\natom (Section \\ref{sub:Force-calculation}).\n\\end{enumerate}\nOnce the parameters of the model have been selected, the procedure\ncan be implemented in a classical molecular dynamics code, and we\nhave done this using the DL\\_POLY $\\mathrm{4.03}$ package \\citep{Todorov2006}.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig4}\n\\par\\end{centering}\n\n\\begin{centering}\n\\protect\\caption{Sets of positions of a hydrogen atom in spatial regions of mixed bonding\n(a), together with corresponding contour plots of the potential energy\nin units of eV (b), for the I-n configuration (labelled according\nto reference \\citep{Re1999}) of a sulphuric acid and a water molecule.\nThe centre of the contour plots lies at the mid-point between the\ntwo participating oxygens and the labels 1, 2 and 3 in (b) refer to\nthe arrays of points shown in (a). The cyan, red and green spheres\nin (a) match the equivalent top left, top right and the bottom right\nof each plot in (b), respectively. The energy when the hydrogen is\nat position $(-0.4\\textrm{\\AA},-0.4\\textrm{\\AA},-0.4\\textrm{\\AA})$\nrelative to the mid-point is set to a reference point of zero for\nboth the DFT and EVB calculations. \\label{fig:EnergyPlanes1-1}}\n\n\\par\\end{centering}\n\n\\end{figure}\n\n\n\n\n\n\n\n\\section{Results\\label{sec:5Results}}\n\nWe have parametrised the EVB model against reference configurational\nenergies calculated from a DFT approach using a particle swarm optimisation\n(PSO) fitting scheme, the details of which are described in the Appendix.\nWe focus in this section on investigating various features of the\nparametrised model.\n\nFigure \\ref{fig:EnergyPlanes1-1} shows the potential energy of a\nsulphuric acid/water system as a function of the position of a transferring\nhydrogen atom, comparing the performance of the EVB model with a set\nof reference data. It is important to recognise that the EVB scheme\ndoes not operate for hydrogen positions beyond a distance $\\pm0.3\\textrm{\\AA}$\nin the $\\mathbf{r}_{{\\rm OO}}$ direction starting from $\\frac{1}{2}(\\mathbf{r}_{{\\rm O}1}+\\mathbf{r}_{{\\rm O}2})$,\nthe mid-point between the oxygens atoms involved in the hydrogen bond,\nand so energies at hydrogen positions labelled $\\pm0.4\\textrm{\\AA}$\nin the $\\mathbf{r}_{{\\rm OO}}$ direction are for unmixed bonding\nand are not affected by the EVB parametrisation scheme. The comparison\ndemonstrates an overall correspondence between the EVB model and the\nDFT results. The scheme is limited in that it is only active for hydrogen\npositions lying in an ellipsoidal spatial region around the mid-point\nbetween the oxygens, that it only represents two possible bonding\nstates per proton and that ultimately it is underpinned by a classical\npotential fit to the reference data and an empirical form for the\noff-diagonal term. Nevertheless, the EVB model seems to capture the\nshape of the energy surface experienced by the hydrogen atom.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\noindent\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{Fig6}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:Water_populations}Evolution in the population of water\nmolecules in simulations starting with the values indicated above\neach frame. A decrease of one in the water population indicates an\nionisation event $\\mathrm{[H_{2}SO_{4}]+[H_{2}O]_{n}\\rightarrow[HSO_{4}]^{-}+[H_{3}O]^{+}+[H_{2}O]_{n-1}}$,\nand an increase by one refers to the reverse of this reaction. The\nsimulations were performed at $\\mathrm{200}$ K (top) and $\\mathrm{300}$\nK (bottom).}\n\\end{figure}\n\n\nNext, we demonstrate how the propensity for proton transfer from an\nacid molecule is affected by the extent of the surrounding water network.\nFigure \\ref{fig:Water_populations} tracks the population of water\nmolecules in various simulations of $\\mathrm{[H_{2}SO_{4}]+[H_{2}O]_{n}}$\nwith $\\mathrm{n=2-4}$, over a time period of $\\mathrm{1}$ ns after\na $\\mathrm{20}$ ps equilibration period. The simulations employed\na Langevin thermostat with target temperatures of $\\mathrm{300\\: K}$\nor $\\mathrm{200}$ K using a modified version of the DL\\_POLY $\\mathrm{4.03}$\nprogram \\citep{Todorov2006}. There was no constraint on the centre\nof mass motion or the rotation of the clusters. The results show that\nat $\\mathrm{300}$ K there is very little propensity for the proton\nto transfer to the closest water and remain there more than momentarily\nin the $\\mathrm{{\\rm n}=2}$ and $\\mathrm{{\\rm n}=3}$ cases. The\nhydrogen bond rarely fluctuates to such an extent that the ground\nstate configuration consists of a bisulphate/hydronium rather than\nthe sulphuric acid/water bonding pattern. However, for the $\\mathrm{{\\rm n}=4}$\ncase, the system spends the majority of its time in the dissociated\nstate. Proton transfers are more frequent and quasistable. When the\n$\\mathrm{{\\rm n}=4}$ simulation is run at 200 K, however, we see\nthat it remains undissociated for a longer period of time suggesting\nthat the dissociated state is less stable at lower temperature, which\nis to be expected. These conclusions are in agreement with work performed\nat zero temperature using a higher level of theory \\citep{Arrouvel2005,Re1999,Bandy1998},\naccording to which the first dissociation event of a sulphuric acid\nmolecule occurs when hydrated by between $\\mathrm{3}$ and $6$ water\nmolecules.\n\nWhen running the EVB model at 300 K we observe changes in configuration\nthat involve intermolecular bond making and breaking, characteristic\nof the expected liquid-like nature of the system at relatively high\ntemperatures. We also observe the Grotthuss mechanism where protons\nshuffle around the water network \\citep{Paxton14}.\n\n\n\\section{Conclusions\\label{sec:6Conclusion}}\n\nA two-state EVB model for the sulphuric acid, bisulphate, hydronium\nand water system has been presented, which is based upon the MS-EVB3\nand SCI-MS-EVB models developed for hydronium/water alone \\citep{Schmitt1998,Day2002}.\nThe approach essentially provides an interpolation between two energy\nsurfaces corresponding to the choices of bonding pattern available\nto a proton in a particular spatial region between a bisulphate and\na water. It involves a Hamiltonian represented in a basis of bonding\npatterns, with diagonal terms based on classical force fields, and\noff-diagonal terms constructed empirically and fitted to higher level\ncalculations.\n\n\nThe limitation of the basis to two states implies that the model does not\nmatch the state of the art in the description of protonated water systems \\citep{Knight12} but\nit provides the simplest scheme for representing proton transfer between sulphuric acid and water species,\nthe focus of our attention here and a new application of the EVB framework. An extension to include more\nelaborate basis sets would be possible.\n\nThe parametrisation of the off-diagonal terms has been performed using\nthe particle swarm optimisation (PSO) technique, with reference to\nDFT data for specific cases of sulphuric acid/water proton transfer\nevents. The resulting scheme has been integrated into a modified version\nof the DL\\_POLY 4.03 MD code \\citep{Todorov2006}. A quantitative\ncomparison of the potential energy surface for the transferring proton\nwithin a geometry-optimised static configuration of one sulphuric\nacid and one water molecule gives good agreement. The level of hydration\nrequired for the first ionisation or dissociation of a single sulphuric\nacid molecule at $\\mathrm{300\\: K}$ has been investigated, revealing\nthat a system with four water molecules is best described by a complex\nmixture between neutral and ionised bonding. At $\\mathrm{200\\: K}$\nthe four water case remains predominantly neutral, indicating that\nan increase in temperature promotes proton transfer, as would be expected.\nIn highly hydrated structures, the proton becomes very mobile within\nthe water network.\n\nThe main motivation for developing this model is to provide a tool\nfor the fast simulation of cluster structures. The key performance\ndetails are as follows. The run time for a 1 ns simulation with six\nwater molecules and one acid is $\\mathrm{430\\: seconds}$ on one Intel\nCore i5-460M processor and it is, therefore, easily possible to generate\ntrajectories several tens of nanoseconds in length for quite substantial\nsystems using this model. The parametrisation procedure and tests\nwe have reported give us confidence that the physics of proton transfer\nhas been well captured by the scheme. Our computationally inexpensive\nmethod is suitable for performing calculations of the thermodynamic\nproperties of clusters of water and sulphuric acid molecules at a\nrange of temperatures relevant to the atmosphere. We shall report\nthese results in future publications.\n\n\n\\section*{Acknowledgements}\n\nSMK was supported in part by the U.S. Department of Energy, Office of Science, Office of Basic Energy Sciences, Division of Chemical Sciences, Geosciences, and Biosciences; JLS and IJF were supported by the IMPACT scheme at University College London (UCL). We acknowledge the UCL Legion High Performance Computing Facility, and associated support services together with the resources of the National Energy Research Scientific Computing Center (NERSC), which is supported by the U.S. Department of Energy under Contract No. DE-AC02- 05CH11231.  JLS thanks Dr. Gregory Schenter, Dr. Theo Kurt\\'{e}n and Prof. Hanna Vehkam\\\"{a}ki for important guidance and discussions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{44}\n\\providecommand{\\url}[1]{\\texttt{#1}}\n\\providecommand{\\urlprefix}{URL }\n\\markboth{Taylor \\& Francis and I.T. Consultant}{Molecular Physics}\n\n\\bibitem{Zhang2012}\nR. Zhang, A. Khalizov, L. Wang, M. Hu and W. Xu,  Chem. Rev.  \\textbf{112},\n  1957 (2012).\n\n\\bibitem{Kulmala14}\nM. Kulmala, T. Pet{\\\"a}j{\\\"a}, M. Ehn, J. Thornton, M. Sipal{\\\"a}, D. Worsnop\n  and V.M. Kerminen,  Annu. Rev. Phys. Chem.  \\textbf{65}, 21 (2014).\n\n\\bibitem{Kirkby2011}\n{J. Kirkby et al.},  Nature  \\textbf{476}, 429 (2011).\n\n\\bibitem{Riccobono14}\n{F. Riccobono et al.},  Science  \\textbf{344}, 717 (2014).\n\n\\bibitem{Ford2004}\nI.J. Ford,  Proc. Inst. Mech. Eng., Part C: J. Mech. Eng. Sci.  \\textbf{218},\n  883 (2004).\n\n\\bibitem{Kalikmanov-book2013}\nV.I. Kalikmanov, \\emph{Nucleation Theory}   (Springer, Heidelberg, 2013).\n\n\\bibitem{McGrath12}\nM.J. McGrath, T. Olenius, I.K. Ortega, V. Loukonen, P. Paasonen, T. Kurt{\\'e}n,\n  M. Kulmala and H. Vehkamäki,  Atmos. Chem. Phys.  \\textbf{12}, 2345 (2012).\n\n\\bibitem{girshick90}\nS.L. Girshick and C.P. Chiu,  J. Chem. Phys.  \\textbf{93}, 1273 (1990).\n\n\\bibitem{laaksonen94}\nA. Laaksonen, I.J. Ford and M. Kulmala,  Phys. Rev. E  \\textbf{49}, 5517\n  (1994).\n\n\\bibitem{kalikmanov95}\nV.I. Kalikmanov and M.E.H. van Dongen,  J. Chem. Phys.  \\textbf{103}, 4250\n  (1995).\n\n\\bibitem{Vehkamaki}\nH. Vehkam\\\"{a}ki, \\emph{{Classical Nucleation Theory in Multicomponent\n  Systems}}   (Springer, Berlin, 2006).\n\n\\bibitem{Brus2011}\nD. Brus, K. Neitola, A.P. Hyv\\\"{a}rinen, T. Pet\\\"{a}j\\\"{a}, J. Vanhanen, M.\n  Sipil\\\"{a}, P. Paasonen, M. Kulmala and H. Lihavainen,  Atmos. Chem. Phys.\n  \\textbf{11}, 5277 (2011).\n\n\\bibitem{Kakizaki2009}\nA. Kakizaki, H. Motegi, T. Yoshikawa, T. Takayanagi, M. Shiga and M. Tachikawa,\n   J. Mol. Struc-THEOCHEM  \\textbf{901}, 1 (2009).\n\n\\bibitem{Sugawara2011}\nS. Sugawara, T. Yoshikawa, T. Takayanagi, M. Shiga and M. Tachikawa,  J. Phys.\n  Chem. A  \\textbf{115}, 11486 (2011).\n\n\\bibitem{Arrouvel2005}\nC. Arrouvel, V. Viossat and C. Minot,  J. Mol. Struc-THEOCHEM  \\textbf{718}, 71\n  (2005).\n\n\\bibitem{stinson14}\nJ.L. Stinson, S.M. Kathmann and I.J. Ford,  J. Chem. Phys.  \\textbf{140},\n  024306 (2014).\n\n\\bibitem{Frenkel2001}\nD. Frenkel and B. Smit, \\emph{{Understanding Molecular Simulations: from\n  Algorithms to Application}}, 2nd ed.   (Elsevier, Amsterdam, 2001).\n\n\\bibitem{Ford2004c}\nI.J. Ford and S.A. Harris,  J. Chem. Phys.  \\textbf{120}, 4428 (2004).\n\n\\bibitem{Tang15}\nH.Y. Tang and I.J. Ford,  Phys. Rev. E  \\textbf{91}, 023308 (2015).\n\n\\bibitem{Pohorille07}\n{C. Chipot and A. Pohorille, (Eds.)}, \\emph{Free Energy Calculations}\n  (Springer, Heidelberg, 2007).\n\n\\bibitem{Kusaka1998}\nI. Kusaka, Z.G. Wang and J.H. Seinfeld,  J. Chem. Phys.  \\textbf{108}, 6829\n  (1998).\n\n\\bibitem{Kathmann2001}\nS.M. Kathmann and B.N. Hale,  J. Phys. Chem. B  \\textbf{105}, 11719 (2001).\n\n\\bibitem{DingC.-G.}\nC.G. Ding, T. Taskila, K. Laasonen and A. Laaksonen,  Chem. Phys.\n  \\textbf{287}, 7 (2003).\n\n\\bibitem{Toivola2009b}\nM. Toivola, I. Napari and H. Vehkam\\\"{a}ki,  Boreal Environment Research\n  \\textbf{14}, 654 (2009).\n\n\\bibitem{Bartok2010}\nA.P. Bart\\'{o}k, M.C. Payne and G. Cs\\'{a}nyi,  Phys. Rev. Lett.  \\textbf{104},\n  1 (2010).\n\n\\bibitem{VanDuin2001}\nA.C.T. van Duin, S. Dasgupta, F. Lorant and W.A. Goddard,  J. Phys. Chem. A\n  \\textbf{105}, 9396 (2001).\n\n\\bibitem{Kamerlin2011a}\nS.C.L. Kamerlin and A. Warshel,  Wiley Interdisciplinary Reviews: Computational\n  Molecular Science  \\textbf{1}, 30 (2011).\n\n\\bibitem{Aqvist1993}\nJ. Aqvist and A. Warshel,  Chem. Rev.  \\textbf{93}, 2523 (1993).\n\n\\bibitem{Schmitt1998}\nU.W. Schmitt and G.A. Voth,  J. Phys. Chem. B  \\textbf{102}, 5547 (1998).\n\n\\bibitem{Day2002}\nT.J.F. Day, A.V. Soudackov, M. \\v{C}uma, U.W. Schmitt and G.A. Voth,  J. Chem.\n  Phys.  \\textbf{117}, 5839 (2002).\n\n\\bibitem{Wu2008}\nY. Wu, H. Chen, F. Wang, F. Paesani and G.A. Voth,  J. Phys. Chem. B\n  \\textbf{112}, 467 (2008).\n\n\\bibitem{Wang2005}\nF. Wang and G.A. Voth,  J. Chem. Phys.  \\textbf{122}, 144105 (2005).\n\n\\bibitem{Knight12}\nC. Knight and G.A. Voth, Acc. Chem. Res. \\textbf{45}, 101 (2012).\n\n\\bibitem{Loukonen2010}\nV. Loukonen, T. Kurt\\'{e}n, I.K. Ortega, H. Vehkam\\\"{a}ki, A.A.H. P\\'{a}dua, K.\n  Sellegri and M. Kulmala,  Atmos. Chem. Phys.  \\textbf{10}, 4961 (2010).\n\n\\bibitem{Lopez-Lemus08}\n{J. Lopez-Lemus, G.A. Chapela and J. Alejandre},  J. Chem. Phys.  \\textbf{128},\n  174703 (2008).\n\n\\bibitem{Todorov2006}\nI.T. Todorov, W. Smith, K. Trachenko and M.T. Dove,  J. Materials Chem.\n  \\textbf{16}, 1911 (2006).\n\n\\bibitem{Re1999}\nS. Re, Y. Osamura and K. Morokuma,  J. Phys. Chem. A  \\textbf{103}, 3535\n  (1999).\n\n\\bibitem{Bandy1998}\nA.R. Bandy and J.C. Ianni,  J. Phys. Chem. A  \\textbf{102}, 6533 (1998).\n\n\\bibitem{Paxton14}\nA.Y. Lozovoi, T.J. Sheppard, D.L. Pashov, J.J. Kohanoff and A.T. Paxton,  J.\n  Chem. Phys.  \\textbf{141}, 044504 (2014).\n\n\\bibitem{Banks2007b}\nA. Banks, J. Vincent and C. Anyakoha,  Nat. Comput.  \\textbf{6}, 467 (2007).\n\n\\bibitem{Banks2007a}\nA. Banks, J. Vincent and C. Anyakoha,  Nat. Comput.  \\textbf{7}, 109 (2007).\n\n\\bibitem{Poli2008}\nR. Poli,  J. Artif. Evol. App.  \\textbf{2008}, 685175 (2008).\n\n\\bibitem{Shi1998}\nY. Shi and R. Eberhart, {A modified particle swarm optimizer}. in\n  \\emph{Proceedings of the IEEE International Conference on Evolutionary\n  Computation}  (IEEE, New Jersey, 1998), pp. 69--73.\n\n\\bibitem{Perdew1996}\nJ. Perdew, K. Burke and M. Ernzerhof,  Phys. Rev. Lett.  \\textbf{77}, 3865\n  (1996).\n\n\\bibitem{Clark2005}\nS.J. Clark, M.D. Segall and C.J. Pickard,  Z. Kristallogr.  \\textbf{220}, 567\n  (2005).\n\n\\end{thebibliography}\n\n\\appendix\n\n\\section{Parameter fitting procedure\\label{sec:Fitting-procedure}}\n\nThe original MS-EVB3 model was parametrised to describe hydronium/water\nproton transfers \\citep{Wu2008}. We chose to employ slightly different\nclassical force fields for the water molecule and hydronium ion, requiring\nus to revisit this parametrisation. The SPC/EF potential was employed\nfor water (see Loukonen \\emph{et al.} \\citep{Loukonen2010}) as well\nas a modified version of the Morse potential in the MS-EVB3 model\n(see \\ref{sub:Underlying-classical-potential}). Three parameters\nin the MS-EVB3 off-diagonal term for hydronium/water were refitted:\nthese were $R_{{\\rm OO}}^{0}=2.7$\\foreignlanguage{english}{\\AA },\n$P=0.4$ and $D_{{\\rm OO}}=2.65$\\foreignlanguage{english}{\\AA{}}\nand for this system we use $\\tau_{x}=\\tau_{yz}=0.3$.\n\nTwo further proton transfer reactions are possible in the system under\nconsideration, namely sulphuric acid/water and sulphuric acid/bisulphate\nbut we disregard the latter as it is likely to be rare. We parametrised\nthe new off-diagonal terms for sulphuric acid/water EVB mixing using\nthe particle swarm optimisation (PSO) scheme \\citep{Banks2007b,Banks2007a}.\nThis technique has been employed in a variety of areas (reviewed in\nreference \\citep{Poli2008}) and we consider it to be sufficiently\npowerful for use in potential fitting as well.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{FigA1}\n\\par\\end{centering}\n\n\\protect\\caption{Snapshot from a four `particle' PSO procedure to optimise two parameters\nof a model. The darker shaded regions of parameter space represent\na poor fit between model and data, while lighter shades represent\na good fit (as determined by Eq. (\\ref{eq:PSOFit})). The particles\nfollow trajectories through parameter space influenced by `forces'\ndirected towards individual ($p_{i})$ and collective ($p_{g})$ best\nfit positions. The strength of the forces is influenced by noise introduced\ninto the swarm through variables $\\beta_{1}$ and $\\beta_{2}$.\\label{fig:PSODia}}\n\\end{figure}\n\n\nThe PSO method is used to perform a force matching parametrisation\nagainst DFT data. It employs a swarm of `particles', each representing\na choice of a set of parameters $\\{\\mathbf{\\alpha}\\}$. The goodness\nof fit is assessed using a function, $f$, defined as\n\n", "index": 15, "text": "\\begin{equation}\nf(\\{\\mathbf{\\alpha}\\})=\\sum\\left(F_{{\\rm ref}}-F_{{\\rm model}}(\\{\\alpha\\})\\right)^{2},\\label{eq:PSOFit}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"f(\\{\\mathbf{\\alpha}\\})=\\sum\\left(F_{{\\rm ref}}-F_{{\\rm model}}(\\{\\alpha\\})%&#10;\\right)^{2},\" display=\"block\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">{</mo><mi>α</mi><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msup><mrow><mo>(</mo><mrow><msub><mi>F</mi><mi>ref</mi></msub><mo>-</mo><mrow><msub><mi>F</mi><mi>model</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">{</mo><mi>α</mi><mo stretchy=\"false\">}</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02401.tex", "nexttext": "\n\n\n\\noindent where $x_{t}^{i}$ and $v_{t}^{i}$ represent the `position'\nand `velocity', respectively, of particle $i$ at iteration $t$.\nThe terms proportional to $\\varphi_{1}$ and $\\varphi_{2}$ are `forces'\ndesigned to guide the particle towards the positions in parameter\nspace representing the previously found best fit parameter sets obtained\nlocally by the particle in question ($p_{i}$) and globally by the\nentire swarm ($p_{g}$). $\\beta_{1}$ and $\\beta_{2}$ are uniformly\ndistributed random numbers in the range $0\\leq\\beta_{1,2}\\le1$ designed\nto introduce stochasticity into the search. The values of $\\varphi_{1}$\nand $\\varphi_{2}$ represent the relative importance that is given\nto the local and global best fits. The $\\omega$ parameter is introduced\nto allow a further flexibility in the algorithm, to be described later.\nFigure \\ref{fig:PSODia} illustrates the evolution of a four particle\nswarm as it explores a two dimensional parameter space in search of\na minimum in the fitting function.\n\nThe PSO approach requires data to which the model is to be fitted\nand also a numerical implementation specifying the number of particles\nin the swarm and the number of independent searches performed, amongst\nother matters.\n\n\\noindent\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1\\columnwidth]{FigA2}\n\\par\\end{centering}\n\n\\protect\\caption{\\label{fig:555GridImage}The grid of hydrogen positions in configuration\nI-n (in the terminology of reference \\citep{Re1999}) used to generate\nreference force data for the PSO fitting procedure.}\n\\end{figure}\n\n\n\n\\subsection{Reference data\\label{sub:subsub:Fitting-data}}\n\nThe data against which the EVB model has been fitted was obtained\nusing density functional theory (DFT) based on the PBE \\citep{Perdew1996}\nfunctional with a plane wave basis set, a $\\mathrm{550}$ eV cut off\nand a ${\\rm 15\\:\\hbox{\\AA}}$ box. The CASTEP $\\mathrm{5.5}$ code\n\\citep{Clark2005} was used to determine forces on atoms in a given\nset of configurations. The configurations used in the dataset comprised:\n\\begin{enumerate}\n\\item Two molecular dynamics runs for trihydrated and tetrahydrated single\nsulphuric acid molecules in configurations described as Config H and\nSAQH in Stinson \\emph{et al.} \\citep{stinson14}.\n\\item A number of relaxed configurations designated I-n, II-n-a, III-n-a,\nIII-n-b and III-i-a according to Re \\emph{et al.} \\citep{Re1999}.\nFor each of these structures a proton was selected for transfer between\na sulphuric acid and a water molecule. This proton was positioned\non a grid of points in a cube centred at the mid-point between the\noxygens, $\\frac{1}{2}(\\mathbf{r}_{{\\rm O}1}+\\mathbf{r}_{{\\rm O}2})$,\nwith one axis of the cube parallel to the $\\mathbf{r}_{{\\rm OO}}$\nvector, and the other two axes orthogonal but arbitrary in direction.\nGrid points were separated by $\\mathrm{0.2\\textrm{\\AA}}$ giving a\ntotal of 125 points per cube. Figure \\ref{fig:555GridImage} illustrates\nthe grid of points for the I-n configuration. For each grid point\nan energy and force calculation was performed.\n\\end{enumerate}\n\\noindent From this reference dataset, $\\mathrm{400}$ configurations\nwere randomly selected for use in the PSO procedure.\n\n\n\\subsection{Implementation of the PSO method\\label{subsubsub:Application-of-the-PSO-Method}}\n\nThe PSO method was run $\\mathrm{200}$ times using a swarm of $\\mathrm{50}$\nparticles which was chosen as a compromise between computational expense\nand statistical noise. Each simulation was performed for $\\mathrm{50}$\nsteps which was found to be sufficient for the parameters to have\nconverged. During the simulation, the value of $\\omega$ in Eq. (\\ref{eq:PSO-EqOfMotion})\nwas linearly scaled from $\\mathrm{0.9}$ down to $\\mathrm{0.4}$ as\nsuggested by Banks \\emph{et al.} \\foreignlanguage{english}{\\citep{Banks2007a,Banks2007b}}.\n$\\varphi_{1}$ and $\\varphi_{2}$ were both set equal to two.\n\nThere are ten parameters of the model to be optimised, and details\nof the range searched for each parameter are given in Table \\ref{tab:PSO-parameters}.\nThree parameters were not treated in this way. $r_{{\\rm OO}}^{0}$\nwas set to zero as it was noted to be redundant. The parameter $\\gamma$\nwas set to the value used in the MS-EVB3 model (see Table \\ref{tab:MSEVB3Values}).\nThe parameter $\\tau_{x}$ was chosen to be $0.3$. The EVB model parameters\nwere taken to be the averages of the parameter sets $\\{p_{g}\\}$ obtained\nfrom the $\\mathrm{200}$ runs; this was seen as a fair compromise\nbetween computational expense and accuracy. The resulting optimised\nvalues are given in Table \\ref{tab:PSO-parameters}.\n\n\\begin{table}\n\n\\caption{\\label{tab:PSO-parameters}Table of EVB parameters which were fitted using the PSO method. The `Range' \\textit{\\emph{considered}} for each parameter is shown. During each PSO simulation the maximum permitted velocity of parameter change was linearly scaled from max to min values  in each case. Units are as given in Table \\ref{tab:MSEVB3Values}, with $\\tau_{yz}$ dimensionless and $\\Delta$ in kcal/mol.}\n\n{\\begin{tabular}{cccccc}\n\\toprule\nParam. & Range (max) & Range (min) & Vel. (max) & Vel. (min) & Fit\\\\\n\\colrule\n$V_{\\rm const}^{ij}$ & 0.0 & -100.0 & 10.0 & 0.2 &  -72.20998\t\t    \\\\\n$P$ & 1.0 & 0.01 & 0.1 & 0.002 &  0.50743\t\t\t\t\t\t\t \\\\\n${\\rm k}$ & 30.0 & 1.0 & 3.0 & 0.06 & 15.64862\t\t\t\t\t\t\t  \\\\\n$D_{\\rm OO}$ & 8.0 & 0.1 & 0.8 & 0.016 &  4.18888\t\t\t\t\t     \\\\\n$\\beta$ & 8.0 & 0.1 & 0.8 & 0.016 &  2.37963\t\t\t\t\t\t  \\\\\n$R_{\\rm OO}^{0}$ & 8.0 & 0.1 & 0.8 & 0.008 &  2.46345\t\t\t\t\t \\\\\n$P'$ & 30.0 & 1.0 & 3.0 & 0.06 &  15.41834\t\t\t\t\t\t\t\\\\\n$\\alpha$ & 30.0 & 5.0 & 3.0 & 0.06 &  17.42592\t\t\t\t\t\t\\\\\n$\\tau_{yz}$ & 15.0 & 0.5 & 1.5 & 0.03 & 11.55606\t\t\t\t\t\t \\\\\n$\\Delta$ & 800.0 & 400.0 & 20.0 & 0.05 &  558.40454\t\t\t\t   \\\\\n\\botrule\n\\end{tabular}}\n\n\n\n\n\n\n\\end{table}\n\n\\noindent\n\n", "itemtype": "equation", "pos": 59343, "prevtext": "\nwhere $F_{{\\rm ref}}$ denotes the reference forces for an atomic\nconfiguration, and $F_{{\\rm model}}(\\{\\alpha\\})$ represents the model\nforces for the same configuration, given parameters $\\{\\mathbf{\\alpha}\\}$.\nThe square deviations are summed over a series of configurations to\nprovide a global assessment of the fit between model and reference\ndata.\n\nThe particles are allowed to explore parameter space according to\na simple set of evolution equations for each parameter as described\nby Shi and Eberhart \\citep{Shi1998}:\n\n\n", "index": 17, "text": "\\begin{equation}\n\\begin{array}{c}\nv_{t+1}^{i}=\\omega v_{t}^{i}+\\varphi_{1}\\beta_{1}(p_{i}-x_{t}^{i})+\\varphi_{2}\\beta_{2}(p_{g}-x_{t}^{i})\\\\\n\\\\\nx_{t+1}^{i}=x_{t}^{i}+v_{t+1}^{i}\n\\end{array}\\label{eq:PSO-EqOfMotion}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{c}v_{t+1}^{i}=\\omega v_{t}^{i}+\\varphi_{1}\\beta_{1}(p_{i}-x_{t%&#10;}^{i})+\\varphi_{2}\\beta_{2}(p_{g}-x_{t}^{i})\\\\&#10;\\\\&#10;x_{t+1}^{i}=x_{t}^{i}+v_{t+1}^{i}\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msubsup><mi>v</mi><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow><mi>i</mi></msubsup><mo>=</mo><mrow><mrow><mi>ω</mi><mo>⁢</mo><msubsup><mi>v</mi><mi>t</mi><mi>i</mi></msubsup></mrow><mo>+</mo><mrow><msub><mi>φ</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>β</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>p</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>x</mi><mi>t</mi><mi>i</mi></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>φ</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>β</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>p</mi><mi>g</mi></msub><mo>-</mo><msubsup><mi>x</mi><mi>t</mi><mi>i</mi></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd/></mtr><mtr><mtd columnalign=\"center\"><mrow><msubsup><mi>x</mi><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow><mi>i</mi></msubsup><mo>=</mo><mrow><msubsup><mi>x</mi><mi>t</mi><mi>i</mi></msubsup><mo>+</mo><msubsup><mi>v</mi><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow><mi>i</mi></msubsup></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}]