[{"file": "1601.05462.tex", "nexttext": "\nwhere ${\\dot{W}}$ is the array power, ${A_\\text{array}}$ is a reference array area, $\\rho$ is the fluid density, and $U$ the reference flow speed.\nIn the case of large wind farms where the array covers a region on the ground,  ${A_\\text{array}}$ is the ground area occupied by the array.\nFor the case of the riverine array shown in Figure~\\ref{fig:Schematic}~(c), ${A_\\text{array}}$ is the vertical area formed by the product of the array length and the water depth.\nIn both these cases, the turbines are arranged in a plane parallel to the free stream.\nFor a large enough array the kinetic energy flux normal to the array plane provides the source of energy for most turbines.\nMore generally, ${A_\\text{array}}$ defines the effective area through which kinetic energy is directed normal to the free stream flow and into the array.\nFor arrays of significant three-dimensional thickness the sides may need to be included. \n\n\nThis coefficient provides a useful measure to compare kinetic energy redirection and extraction across similar types of array configurations, but for different fluid densities, flow speeds, and array sizes.\n\nAs a reference point, results from the numerical simulation of an infinite array of turbines in a plane parallel to the flow forced by an imposed pressure gradient \\cite{Calaf2010} yield ${C_A} = 1.5 \\times 10^{-3}$ (details of method of estimation provided in SI \\S 1).\nWe expect the performance of a large array to be dominated by the turbines in the interior, while the influence of the finite nature of the array being more prominent for smaller arrays.\nAn aggregation of values of ${C_A}$ for wind turbine arrays ranging from small to infinite in size  estimated from different sources \\cite{Mackay2008,Cal2010,Calaf2010,Kinzel2012a,Miller2015} are presented in Figure \\ref{fig:Schematic}~(d) and discussed in the SI \\S 1.\nThe value of ${C_A}$ ranges from $1.5 \\times 10^{-3}$-$2.7 \\times 10^{-3}$ for computational simulations of large arrays \\cite{Calaf2010,Miller2015} and from $1.1\\times 10^{-2}$-$1.2 \\times 10^{-2}$ for 3$\\times$3 arrays realized in lab or field experiments \\cite{Cal2010,Kinzel2012a}.\nWe ask if ${C_A}$ can be improved above these value and determine fundamental limits on these improvements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Mean flow manipulation for increasing energy density}\nHere we present systematic manipulation of the \\emph{mean} flow as a mechanism for increasing, or otherwise altering, the energy density of turbine arrays.\nThe simplest way to manipulate the mean flow is using an arrangement of deflector surfaces, as shown for the case we consider in the inset of Figure \\ref{fig:Schematic}~(a,c), to locally direct the flow. \nThese deflector elements are combined with energy extracting elements, the turbines, to form the deflector-turbine array.\nWhile the deflectors only interact with the local flow, the aggregate influence they exert may extend over a length scale comparable to the size of the array itself.\nIn this manner, the extent and the strength of the flow modification can be designed.\nOur results imply a conceptual decomposition of the influence of the flow deflection and the energy extraction on the performance of the array.\n\n\\subsection{Vertical array of turbines along the river centerline} \nTo demonstrate our ideas, we consider a turbine-deflector array constrained to a single row of length $L$ aligned with the free stream flow speed $U$, as shown in Figure~\\ref{fig:Schematic}~(a).\nWhile the general framework may be extended to three dimensions, we limit our analysis to a two-dimensional setting for elucidating the essential principles.\n\nA particular flow modification we seek is to deflect the wake of upstream turbines away from the array and redirect undepleted flow onto downstream turbines \\cite{Wagenaar2012,Churchfield2015}; \nan example of such a flow without and with energy extraction is shown in Figure \\ref{fig:Schematic}~(a) and (b), respectively.\nIn this article, we analyze this type of flow manipulation to determine the optimal power density obtained by using deflector plates aligned at a constant angle ${\\alpha}$ to the flow.\nThis simplified 1-D deflector-turbine array can provide guidance for concrete applications. \nMost directly it informs the implementation of a vertical fence of deflector-turbines located along the center of a river, as shown in Figure \\ref{fig:Schematic}~(c).\nAs we discuss later, this configuration may be better suited for riverine and tidal power extraction compared to rows of turbines installed on the bed.\n\n\n\\subsection{Flow deflection increases ${C_A}$} \nA key variable in our formulation is the flow rate $Q_0$, and an associated kinetic energy flux $\\rho Q_0 U^2/2$, deflected to flow through the array without boundary layer separation on the deflector surfaces.\n\nThe turbine array can extract at most a fraction ${\\eta_\\text{max}}$ of this incident kinetic energy.\nUsing {Eq.~\\textbf{\\ref{{eqn:nondim}}}}, this fraction is related to an upper limit on the dimensionless power density\n\n", "itemtype": "equation", "pos": 4660, "prevtext": "\n\n\n\n\\title{Framework and limits on power density in wind and hydrokinetic device arrays using systematic flow manipulation}\n\n\\author{Shreyas Mandre and Niall M. Mangan \\\\  {School of Engineering, Brown University, Providence RI 02912}}\n\n\n\n\n\n\n\\maketitle\n\n\\frenchspacing\n\\begin{abstract} \nWind and hydrokinetic turbine array performance suffers because the wakes of upstream turbines diminish flow to downstream turbines. \nHere we analyze systematic deflection of the wakes to direct unimpeded flow onto the downstream turbines and increase the area power density.\nWe examine the case of an abstract 1D turbine-deflector array aligned parallel to a 2D free stream flow, in which case the array presents negligible frontal area to the flow without deflection.\nUsing the framework of inviscid fluid dynamics, the flow manipulation is decomposed into flow deflection due to bound vorticity in the array, and energy extraction resulting from free vorticity shed by the array.\nWhile this general framework is agnostic to the technological details, it captures the geometry of a vertical fence of turbines and deflectors along the centerline of a river, minimizing the array footprint.\nWe find a localized array can direct significant kinetic energy through itself, while having a minimal impact on array efficiency; the fraction of the energy incident on the array that is ultimately extracted.\nThe maximum array efficiency decreases from ${ 57}\\%-{ 39}\\%$ at high deflection due to recirculation at the edges of the array.\nHowever, the increase in deflected flow through the array overwhelms the small efficiency decrease.\nUsing state-of-the-art deflector technology with minimal flow separation, we predict an order of magnitude improvement in array power density, as compared to arrays without systematic flow manipulation.\nA pragmatic discussion of deflection mechanisms, applications, and future extension to 3D flows are included.\n\n\\end{abstract}\n\n\n\n\n\n\\section{Introduction}\n\nPractical considerations prevent the placement of tidal, riverine, and wind turbines at locations in the flow where they can extract maximum power.\nFor riverine and tidal power, the hotspots of fast flow occur at narrow constrictions in the channel, and anything less than a complete fence of turbines \\cite{Garrett2005} across the flow constriction greatly reduces the potential of the site \\cite{Vennell2010, Vennell2011, Cummins2013}. \nHowever, navigation and environmental considerations prohibit construction of such arrays \\cite{Garrett2007,Vennell2015}. \nSimilarly, wind turbines cannot be constructed at locations of faster wind speed high up in the atmosphere due to structural constraints \\cite{Thresher2007}.\n\n\nInstead, the most practical arrangement of wind turbines is an array of turbines mounted on the ground in rows, where only turbines at the front of the array have access to direct flow and energy transport to turbines in the center of the array is limited.\nAny large riverine or tidal array in this configuration would suffer from the same limitations \\cite{Vennell2015,Jeffcoate2016}.\nKinetic energy flowing higher in the atmosphere or the water column is redirected by turbulence on the turbines in the array \\cite{Calaf2010,Divett2013}. \nTherefore, subsequent rows of turbines must be placed far enough back for turbulent mixing to redirect kinetic energy from higher elevations to replenish the deficit in the turbine wakes \\cite{Newman1977,Frandsen1992}. \nThe rate of kinetic energy redirection ultimately limits the performance of the turbine array, and approaches to relax this limit are actively sought \\cite{Dabiri2011a,Wagenaar2012,Fleming2014,VerHulst2015,Churchfield2015}.\n\nIf turbines must be placed in practical locations, the objective can be reframed as directing more kinetic energy to the turbines and extracting it.  \nHere we present a framework for systematic flow manipulation to redirect flow kinetic energy to the location of the turbines. \n\nWe illustrate our framework using a simple two-dimensional example of a linear array embedded in an infinite domain with uniform freestream flow. \nThis analysis is motivated by an unconventional riverine turbine array configuration, one in which the turbines are arranged in a vertical fence along the river centerline as shown in Figure~\\ref{fig:Schematic}~(c).\nOur results directly apply to the cases for which the presence of the river banks and uneven bottom topography can be ignored.\n\n\\subsection{Dimensionless power density}\nIn order to quantify the effectiveness of different mechanisms for redirecting kinetic energy through the array, we define a dimensionless power density, ${C_A}$, as\n\n", "index": 1, "text": "\\begin{align}\n {C_A} = \\dfrac{{\\dot{W}}}{ \\frac{1}{2}\\rho U^3 {A_\\text{array}}},\n\\label{eqn:nondim}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{C_{A}}=\\dfrac{{\\dot{W}}}{\\frac{1}{2}\\rho U^{3}{A_{\\text{array}}}},\" display=\"inline\"><mrow><mrow><msub><mi>C</mi><mi>A</mi></msub><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mover accent=\"true\"><mi>W</mi><mo>˙</mo></mover><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><msup><mi>U</mi><mn>3</mn></msup><mo>⁢</mo><msub><mi>A</mi><mtext>array</mtext></msub></mrow></mfrac></mstyle></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere $L$ represents ${A_\\text{array}}$ for the two-dimensional situation.\n\nIn the forthcoming analysis, we determine the dependence of ${\\eta_\\text{max}}$ and $Q_0/UL$, the deflected-flow strength, on the deflector-turbine array. \nWe find the energy extraction efficiency ${\\eta_\\text{max}}$  only has a weak dependence on the deflected-flow strength and lies within the range ${ 0.39}-{ 0.57}$.\nConsequently, ${C_A}$ is approximately proportional to ${Q_0}/{UL}$, which has a strong dependence on ${\\alpha}$. \n\nThe dependence of ${C_A}$ on ${\\alpha}$ is shown graphically in Figure \\ref{fig:Schematic}~(d). \nFigure \\ref{fig:Schematic}~(d) also shows the array energy density based on turbulent mixing estimated from previous investigations for comparison.\n\nExisting technology based on high-lift deflector surfaces could achieve $0 < {\\alpha} < 40^\\circ$ \\cite{Smith1973,Liebeck1978,Lin1997}, enabling $0 <{C_A} < { 0.30}$; \nhigher values are possible if the deflectors can impose a higher ${\\alpha}$ on the flow without boundary layer separation.\nFor the case of the riverine turbine array shown in Figure \\ref{fig:Schematic}~(c), our result corresponds to a dimensional array power density of ${506}$ W/m$^2$ for a 1.5 m/s flow.\nThrough this work, we not only demonstrate a limit on the energy density of the deflector-turbine array, but also present a framework that can be extended for other cases by incorporating additional constraints, such as boundaries defined by river banks or the ground.\n\nThe rest of this paper will be devoted to explaining the mathematical genesis and physical intuition of the limits on ${C_A}$. \nWe begin by explaining the fluid dynamics framework for our model based on steady inviscid vorticity dynamics, which provides a natural means of decomposing deflection and energy extraction within the array. \nNext, we use the framework to derive bounds on the array power density as a function of flow deflection. \nWe characterize the behavior and relative importance of the deflected-flow strength and array efficiency in terms of two dimensionless parameters: a flow reduction factor and the ratio of the wake velocity to free stream velocity. \n\nFinally, we discuss possible physical realizations of deflectors, the applications to hydrokinetic energy, and possible future extensions.\n\n\\section{Framework: Abstract array in an inviscid flow}\n\nWhile turbines are generally deployed in discrete arrangements, here we consider an array so dense that their collective influence on the flow may be modeled by employing the continuum limit.\nTypically, the frontal area of the turbines is much smaller than the area of the array, and we idealize the array to have negligible (zero) thickness.\n\nInviscid fluid dynamics governs the essential features of the flow that develops around the turbine array.\nWe represent the deflection of the fluid by the array as bound vorticity within the array and the turbine energy extraction as a source of free vorticity in the flow surrounding the array.\nIn the framework of inviscid dynamics the array can only influence the flow through the bound and free vorticity.\nTherefore, our framework incorporates the most general manipulation the deflector-turbine array can have on the flow.\nAlthough the geometry is different, the spirit of our work is inspired by Lanchester-Betz-Joukowsky ({LBJ}) analysis; we seek a minimal picture which is useful to guide our intuition and assist with the practical design of turbine arrays. \n\nWe currently neglect other sources of free vorticity, such as the viscous boundary layer around the deflectors, and the influence of unsteadiness, viscosity and turbulence on the dynamics of free vorticity.\nSuch effects could be incorporated by embedding our framework within a larger computational fluid dynamics model \\cite{Calaf2010,Divett2013}. \n\nThe incompressible flow velocity ${\\boldsymbol{u}}({\\boldsymbol{x}})$ at any point ${\\boldsymbol{x}}$ in the two-dimensional $x-y$ plane (with $z$ perpendicular to the plane) around the array may be described in terms of the vorticity ${\\omega}({\\boldsymbol{x}}) {\\hat{\\boldsymbol{z}}} = {\\boldsymbol{\\nabla}} \\times {\\boldsymbol{u}}({\\boldsymbol{x}})$ as\n\n", "itemtype": "equation", "pos": 9817, "prevtext": "\nwhere ${\\dot{W}}$ is the array power, ${A_\\text{array}}$ is a reference array area, $\\rho$ is the fluid density, and $U$ the reference flow speed.\nIn the case of large wind farms where the array covers a region on the ground,  ${A_\\text{array}}$ is the ground area occupied by the array.\nFor the case of the riverine array shown in Figure~\\ref{fig:Schematic}~(c), ${A_\\text{array}}$ is the vertical area formed by the product of the array length and the water depth.\nIn both these cases, the turbines are arranged in a plane parallel to the free stream.\nFor a large enough array the kinetic energy flux normal to the array plane provides the source of energy for most turbines.\nMore generally, ${A_\\text{array}}$ defines the effective area through which kinetic energy is directed normal to the free stream flow and into the array.\nFor arrays of significant three-dimensional thickness the sides may need to be included. \n\n\nThis coefficient provides a useful measure to compare kinetic energy redirection and extraction across similar types of array configurations, but for different fluid densities, flow speeds, and array sizes.\n\nAs a reference point, results from the numerical simulation of an infinite array of turbines in a plane parallel to the flow forced by an imposed pressure gradient \\cite{Calaf2010} yield ${C_A} = 1.5 \\times 10^{-3}$ (details of method of estimation provided in SI \\S 1).\nWe expect the performance of a large array to be dominated by the turbines in the interior, while the influence of the finite nature of the array being more prominent for smaller arrays.\nAn aggregation of values of ${C_A}$ for wind turbine arrays ranging from small to infinite in size  estimated from different sources \\cite{Mackay2008,Cal2010,Calaf2010,Kinzel2012a,Miller2015} are presented in Figure \\ref{fig:Schematic}~(d) and discussed in the SI \\S 1.\nThe value of ${C_A}$ ranges from $1.5 \\times 10^{-3}$-$2.7 \\times 10^{-3}$ for computational simulations of large arrays \\cite{Calaf2010,Miller2015} and from $1.1\\times 10^{-2}$-$1.2 \\times 10^{-2}$ for 3$\\times$3 arrays realized in lab or field experiments \\cite{Cal2010,Kinzel2012a}.\nWe ask if ${C_A}$ can be improved above these value and determine fundamental limits on these improvements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Mean flow manipulation for increasing energy density}\nHere we present systematic manipulation of the \\emph{mean} flow as a mechanism for increasing, or otherwise altering, the energy density of turbine arrays.\nThe simplest way to manipulate the mean flow is using an arrangement of deflector surfaces, as shown for the case we consider in the inset of Figure \\ref{fig:Schematic}~(a,c), to locally direct the flow. \nThese deflector elements are combined with energy extracting elements, the turbines, to form the deflector-turbine array.\nWhile the deflectors only interact with the local flow, the aggregate influence they exert may extend over a length scale comparable to the size of the array itself.\nIn this manner, the extent and the strength of the flow modification can be designed.\nOur results imply a conceptual decomposition of the influence of the flow deflection and the energy extraction on the performance of the array.\n\n\\subsection{Vertical array of turbines along the river centerline} \nTo demonstrate our ideas, we consider a turbine-deflector array constrained to a single row of length $L$ aligned with the free stream flow speed $U$, as shown in Figure~\\ref{fig:Schematic}~(a).\nWhile the general framework may be extended to three dimensions, we limit our analysis to a two-dimensional setting for elucidating the essential principles.\n\nA particular flow modification we seek is to deflect the wake of upstream turbines away from the array and redirect undepleted flow onto downstream turbines \\cite{Wagenaar2012,Churchfield2015}; \nan example of such a flow without and with energy extraction is shown in Figure \\ref{fig:Schematic}~(a) and (b), respectively.\nIn this article, we analyze this type of flow manipulation to determine the optimal power density obtained by using deflector plates aligned at a constant angle ${\\alpha}$ to the flow.\nThis simplified 1-D deflector-turbine array can provide guidance for concrete applications. \nMost directly it informs the implementation of a vertical fence of deflector-turbines located along the center of a river, as shown in Figure \\ref{fig:Schematic}~(c).\nAs we discuss later, this configuration may be better suited for riverine and tidal power extraction compared to rows of turbines installed on the bed.\n\n\n\\subsection{Flow deflection increases ${C_A}$} \nA key variable in our formulation is the flow rate $Q_0$, and an associated kinetic energy flux $\\rho Q_0 U^2/2$, deflected to flow through the array without boundary layer separation on the deflector surfaces.\n\nThe turbine array can extract at most a fraction ${\\eta_\\text{max}}$ of this incident kinetic energy.\nUsing {Eq.~\\textbf{\\ref{{eqn:nondim}}}}, this fraction is related to an upper limit on the dimensionless power density\n\n", "index": 3, "text": "\\begin{align}\n{C_A} \\le {\\eta_\\text{max}} \\dfrac{Q_0}{UL},\n\\label{eqn:ourlimit}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{C_{A}}\\leq{\\eta_{\\text{max}}}\\dfrac{Q_{0}}{UL},\" display=\"inline\"><mrow><mrow><msub><mi>C</mi><mi>A</mi></msub><mo>≤</mo><mrow><msub><mi>η</mi><mtext>max</mtext></msub><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere ${\\hat{\\boldsymbol{x}}}$ and ${\\hat{\\boldsymbol{z}}}$ are unit vectors in the $x$ and $z$ direction respectively. \nThe vorticity may be decomposed in terms of bound vorticity ${\\omega_b}$ and the free vorticity ${\\omega_f}$ as ${\\omega} = {\\omega_b} + {\\omega_f}$.\n\n\\subsection{Flow deflection and bound vorticity} \nIn our framework, the bound vorticity is a fictitious instrument that represents the effect of the deflector array, and in the most general case is agnostic to the method of fluid deflection. \nIt is located inside the array and we use it to impose the fluid flowing through the array at a constant angle ${\\alpha}$ relative to freestream, which simulates flow through a dense array of foils at a constant angle of attack ${\\alpha}$.\nWe further consider the deflection to occur in a regime where the boundary layer around the deflector plates remains attached, and therefore the deflectors introduce negligible amount of free vorticity in the flow.\n\nManipulating the flow with bound vorticity alone, the array cannot extract any energy from the flow.\nThis result follows from the observation that the velocity field due to bound vorticity alone recovers to its freestream value far downstream (see SI \\S 2), as shown in Figure \\ref{fig:Schematic}~(a).\nThe wake of the array therefore has no kinetic energy deficit, and the array cannot extract any energy.\nThe bound vorticity, however, deflects fluid at the rate $Q_0$ to flow through the array, and thus implies that kinetic energy is incident on the array at the rate $\\rho Q_0 U^2/2$\n\nThis energy can be extracted from the flow by introducing free vorticity.\n\n\\subsection{Energy extraction and free vorticity}\nIn our framework, the free vorticity in the flow is introduced (or shed) by the turbine array, capturing the effects of energy extraction by the turbines on the fluid flow. \nIn analogy with the {LBJ}~analysis, we shed vorticity of specified strength from the array along the two streamlines C and D, bounded by the recirculation regions near the array ends, as shown in Figure \\ref{fig:Schematic}~(b).\nThese streamlines are selected to be the extreme streamlines which pass through the array and continue down-stream (they do not recirculate).\nBoth the difference in geometry (the streamlines must bend to flow through the array) and the possibility that the extreme streamlines will not be located at the edge of the array differentiate this analysis from {LBJ}.\nOnce introduced, the free vorticity is advected by the flow along the streamlines in the form of a vortex sheet without any change in its strength, in accordance with inviscid fluid dynamics \\cite{Saffman1992,Lighthill1986}, and forms the wake of the array.\nWe numerically determine the streamlines, the bound vorticity, and the shape of the free vortex sheet in a self-consistent manner such that the free vorticity is constant along the streamlines and the flow velocity maintains an angle of attack ${\\alpha}$ with the freestream flow direction (see SI \\S 4 for details).\n\nThe free vorticity introduced by the turbine array is linked to the energy conversion.\nThe wake velocity far downstream, as shown in Figure \\ref{fig:Schematic}~(b), points in the freestream direction, but its magnitude $V$ does not recover to the freestream value $U$.\nThe deficit of velocity in the wake $U-V$ is, by definition, the strength of the vortex sheet.\nApplying energy balance to a control volume, shown as ABCD in Figure \\ref{fig:Schematic}~(b), between the two streamlines on which vorticity is shed yields the deficit of kinetic energy flux in the wake as\n\n", "itemtype": "equation", "pos": 14105, "prevtext": "\nwhere $L$ represents ${A_\\text{array}}$ for the two-dimensional situation.\n\nIn the forthcoming analysis, we determine the dependence of ${\\eta_\\text{max}}$ and $Q_0/UL$, the deflected-flow strength, on the deflector-turbine array. \nWe find the energy extraction efficiency ${\\eta_\\text{max}}$  only has a weak dependence on the deflected-flow strength and lies within the range ${ 0.39}-{ 0.57}$.\nConsequently, ${C_A}$ is approximately proportional to ${Q_0}/{UL}$, which has a strong dependence on ${\\alpha}$. \n\nThe dependence of ${C_A}$ on ${\\alpha}$ is shown graphically in Figure \\ref{fig:Schematic}~(d). \nFigure \\ref{fig:Schematic}~(d) also shows the array energy density based on turbulent mixing estimated from previous investigations for comparison.\n\nExisting technology based on high-lift deflector surfaces could achieve $0 < {\\alpha} < 40^\\circ$ \\cite{Smith1973,Liebeck1978,Lin1997}, enabling $0 <{C_A} < { 0.30}$; \nhigher values are possible if the deflectors can impose a higher ${\\alpha}$ on the flow without boundary layer separation.\nFor the case of the riverine turbine array shown in Figure \\ref{fig:Schematic}~(c), our result corresponds to a dimensional array power density of ${506}$ W/m$^2$ for a 1.5 m/s flow.\nThrough this work, we not only demonstrate a limit on the energy density of the deflector-turbine array, but also present a framework that can be extended for other cases by incorporating additional constraints, such as boundaries defined by river banks or the ground.\n\nThe rest of this paper will be devoted to explaining the mathematical genesis and physical intuition of the limits on ${C_A}$. \nWe begin by explaining the fluid dynamics framework for our model based on steady inviscid vorticity dynamics, which provides a natural means of decomposing deflection and energy extraction within the array. \nNext, we use the framework to derive bounds on the array power density as a function of flow deflection. \nWe characterize the behavior and relative importance of the deflected-flow strength and array efficiency in terms of two dimensionless parameters: a flow reduction factor and the ratio of the wake velocity to free stream velocity. \n\nFinally, we discuss possible physical realizations of deflectors, the applications to hydrokinetic energy, and possible future extensions.\n\n\\section{Framework: Abstract array in an inviscid flow}\n\nWhile turbines are generally deployed in discrete arrangements, here we consider an array so dense that their collective influence on the flow may be modeled by employing the continuum limit.\nTypically, the frontal area of the turbines is much smaller than the area of the array, and we idealize the array to have negligible (zero) thickness.\n\nInviscid fluid dynamics governs the essential features of the flow that develops around the turbine array.\nWe represent the deflection of the fluid by the array as bound vorticity within the array and the turbine energy extraction as a source of free vorticity in the flow surrounding the array.\nIn the framework of inviscid dynamics the array can only influence the flow through the bound and free vorticity.\nTherefore, our framework incorporates the most general manipulation the deflector-turbine array can have on the flow.\nAlthough the geometry is different, the spirit of our work is inspired by Lanchester-Betz-Joukowsky ({LBJ}) analysis; we seek a minimal picture which is useful to guide our intuition and assist with the practical design of turbine arrays. \n\nWe currently neglect other sources of free vorticity, such as the viscous boundary layer around the deflectors, and the influence of unsteadiness, viscosity and turbulence on the dynamics of free vorticity.\nSuch effects could be incorporated by embedding our framework within a larger computational fluid dynamics model \\cite{Calaf2010,Divett2013}. \n\nThe incompressible flow velocity ${\\boldsymbol{u}}({\\boldsymbol{x}})$ at any point ${\\boldsymbol{x}}$ in the two-dimensional $x-y$ plane (with $z$ perpendicular to the plane) around the array may be described in terms of the vorticity ${\\omega}({\\boldsymbol{x}}) {\\hat{\\boldsymbol{z}}} = {\\boldsymbol{\\nabla}} \\times {\\boldsymbol{u}}({\\boldsymbol{x}})$ as\n\n", "index": 5, "text": "\\begin{align}\n {\\boldsymbol{u}}({\\boldsymbol{x}}) = U{\\hat{\\boldsymbol{x}}} + \\int_A \\dfrac{\\omega({\\boldsymbol{x}}') {\\hat{\\boldsymbol{z}}} \\times ({\\boldsymbol{x}}-{\\boldsymbol{x}}')}{2\\pi |{\\boldsymbol{x}}-{\\boldsymbol{x}}'|^2}~{\\text{d}} A',\n\\label{eqn:biotsavart}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\boldsymbol{u}}({\\boldsymbol{x}})=U{\\hat{\\boldsymbol{x}}}+\\int_{%&#10;A}\\dfrac{\\omega({\\boldsymbol{x}}^{\\prime}){\\hat{\\boldsymbol{z}}}\\times({%&#10;\\boldsymbol{x}}-{\\boldsymbol{x}}^{\\prime})}{2\\pi|{\\boldsymbol{x}}-{\\boldsymbol%&#10;{x}}^{\\prime}|^{2}}~{}{\\text{d}}A^{\\prime},\" display=\"inline\"><mrow><mrow><mrow><mi>𝒖</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>U</mi><mo>⁢</mo><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>A</mi></msub></mstyle><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mi>ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝒙</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mover accent=\"true\"><mi>𝒛</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>×</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒙</mi><mo>-</mo><msup><mi>𝒙</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒙</mi><mo>-</mo><msup><mi>𝒙</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow></mfrac></mstyle></mpadded><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><msup><mi>A</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere $Q$ is the modified flow through the array.\nThe flow rate with energy conversion, $Q$, is less than the value without energy conversion, $Q_0$, because the turbines impart additional resistance to the flow and change the bound vorticity. \nConservation of energy implies that for inviscid flow the power extracted by the array is limited by this deficit; \nin analogy with the {LBJ}~limit, we expect this idealized case to represent a useful limit on the maximum extractable power despite any departures in practice from the ideal. \n\n\\section{Results: Limits on power density}\nWe present next the dependence of the dimensionless power density of the array on flow parameters.\nDue to our formulation, this dependence can be separated into the influence of flow deflection and energy extraction as\n\n", "itemtype": "equation", "pos": 17980, "prevtext": "\nwhere ${\\hat{\\boldsymbol{x}}}$ and ${\\hat{\\boldsymbol{z}}}$ are unit vectors in the $x$ and $z$ direction respectively. \nThe vorticity may be decomposed in terms of bound vorticity ${\\omega_b}$ and the free vorticity ${\\omega_f}$ as ${\\omega} = {\\omega_b} + {\\omega_f}$.\n\n\\subsection{Flow deflection and bound vorticity} \nIn our framework, the bound vorticity is a fictitious instrument that represents the effect of the deflector array, and in the most general case is agnostic to the method of fluid deflection. \nIt is located inside the array and we use it to impose the fluid flowing through the array at a constant angle ${\\alpha}$ relative to freestream, which simulates flow through a dense array of foils at a constant angle of attack ${\\alpha}$.\nWe further consider the deflection to occur in a regime where the boundary layer around the deflector plates remains attached, and therefore the deflectors introduce negligible amount of free vorticity in the flow.\n\nManipulating the flow with bound vorticity alone, the array cannot extract any energy from the flow.\nThis result follows from the observation that the velocity field due to bound vorticity alone recovers to its freestream value far downstream (see SI \\S 2), as shown in Figure \\ref{fig:Schematic}~(a).\nThe wake of the array therefore has no kinetic energy deficit, and the array cannot extract any energy.\nThe bound vorticity, however, deflects fluid at the rate $Q_0$ to flow through the array, and thus implies that kinetic energy is incident on the array at the rate $\\rho Q_0 U^2/2$\n\nThis energy can be extracted from the flow by introducing free vorticity.\n\n\\subsection{Energy extraction and free vorticity}\nIn our framework, the free vorticity in the flow is introduced (or shed) by the turbine array, capturing the effects of energy extraction by the turbines on the fluid flow. \nIn analogy with the {LBJ}~analysis, we shed vorticity of specified strength from the array along the two streamlines C and D, bounded by the recirculation regions near the array ends, as shown in Figure \\ref{fig:Schematic}~(b).\nThese streamlines are selected to be the extreme streamlines which pass through the array and continue down-stream (they do not recirculate).\nBoth the difference in geometry (the streamlines must bend to flow through the array) and the possibility that the extreme streamlines will not be located at the edge of the array differentiate this analysis from {LBJ}.\nOnce introduced, the free vorticity is advected by the flow along the streamlines in the form of a vortex sheet without any change in its strength, in accordance with inviscid fluid dynamics \\cite{Saffman1992,Lighthill1986}, and forms the wake of the array.\nWe numerically determine the streamlines, the bound vorticity, and the shape of the free vortex sheet in a self-consistent manner such that the free vorticity is constant along the streamlines and the flow velocity maintains an angle of attack ${\\alpha}$ with the freestream flow direction (see SI \\S 4 for details).\n\nThe free vorticity introduced by the turbine array is linked to the energy conversion.\nThe wake velocity far downstream, as shown in Figure \\ref{fig:Schematic}~(b), points in the freestream direction, but its magnitude $V$ does not recover to the freestream value $U$.\nThe deficit of velocity in the wake $U-V$ is, by definition, the strength of the vortex sheet.\nApplying energy balance to a control volume, shown as ABCD in Figure \\ref{fig:Schematic}~(b), between the two streamlines on which vorticity is shed yields the deficit of kinetic energy flux in the wake as\n\n", "index": 7, "text": "\\begin{align}\n{\\dot{W}} = \\dfrac{1}{2} \\rho Q (U^2 - V^2),\n\\label{eqn:kedeficit}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\dot{W}}=\\dfrac{1}{2}\\rho Q(U^{2}-V^{2}),\" display=\"inline\"><mrow><mrow><mover accent=\"true\"><mi>W</mi><mo>˙</mo></mover><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>U</mi><mn>2</mn></msup><mo>-</mo><msup><mi>V</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nis the array efficiency, defined as the fraction of the impinging kinetic energy the array extracts.\n\n\\subsection{Deflected-flow strength}\n\nThe bound vorticity acts to deflect the fluid so that it flows through the array at a constant angle ${\\alpha}$.\nWe assume that a constant ${\\alpha}$ over the length of the array may be achieved in practice using a sufficiently large density of deflector surfaces or orienting them at spatially varying angles of attack.\nIn the absence of free vorticity, the resulting flow field can be derived analytically for a given ${\\alpha}$ using standard techniques in complex analysis (which we include in the SI \\S 3 for completeness).\nThe accompanying bound vorticity is \n\n", "itemtype": "equation", "pos": 18873, "prevtext": "\nwhere $Q$ is the modified flow through the array.\nThe flow rate with energy conversion, $Q$, is less than the value without energy conversion, $Q_0$, because the turbines impart additional resistance to the flow and change the bound vorticity. \nConservation of energy implies that for inviscid flow the power extracted by the array is limited by this deficit; \nin analogy with the {LBJ}~limit, we expect this idealized case to represent a useful limit on the maximum extractable power despite any departures in practice from the ideal. \n\n\\section{Results: Limits on power density}\nWe present next the dependence of the dimensionless power density of the array on flow parameters.\nDue to our formulation, this dependence can be separated into the influence of flow deflection and energy extraction as\n\n", "index": 9, "text": "\\begin{align}\n{C_A} &= \\dfrac{Q_0}{UL} \\eta,  \\label{eqn:ca} \\\\\n\\text{where} \\qquad   \\eta &\\equiv \\dfrac{{\\dot{W}}}{\\rho Q_0 U^2/2} = \\dfrac{Q}{Q_0} \\left( 1- \\dfrac{V^2}{U^2}\\right),\n\\label{eqn:arrayeff}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{C_{A}}\" display=\"inline\"><msub><mi>C</mi><mi>A</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\dfrac{Q_{0}}{UL}\\eta,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle><mo>⁢</mo><mi>η</mi></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{where}\\qquad\\eta\" display=\"inline\"><mrow><mtext>where</mtext><mo mathvariant=\"italic\" separator=\"true\">  </mo><mi>η</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\equiv\\dfrac{{\\dot{W}}}{\\rho Q_{0}U^{2}/2}=\\dfrac{Q}{Q_{0}}\\left(%&#10;1-\\dfrac{V^{2}}{U^{2}}\\right),\" display=\"inline\"><mrow><mrow><mi/><mo>≡</mo><mstyle displaystyle=\"true\"><mfrac><mover accent=\"true\"><mi>W</mi><mo>˙</mo></mover><mrow><mrow><mi>ρ</mi><mo>⁢</mo><msub><mi>Q</mi><mn>0</mn></msub><mo>⁢</mo><msup><mi>U</mi><mn>2</mn></msup></mrow><mo>/</mo><mn>2</mn></mrow></mfrac></mstyle><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>Q</mi><msub><mi>Q</mi><mn>0</mn></msub></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msup><mi>V</mi><mn>2</mn></msup><msup><mi>U</mi><mn>2</mn></msup></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere the array is located at $-L/2<x<L/2$ and $\\delta(y)$ is the Dirac-delta function.\nThe resulting flow field is shown in Figure \\ref{fig:Schematic}~(a) for ${\\alpha} = 40^\\circ$.\nThe flow develops recirculation regions near both edges of the array, which we show to reduce the effectiveness of the array. \nWe next develop analytic descriptions to examine the effect of recirculation.\n\nThe parameter $Q_0/UL$ represents the dimensionless deflected-flow strength, where $Q_0$ is the flow in between the recirculation zones.\nIts dependence on ${\\alpha}$ can is calculated analytically (see SI \\S 3) \n\n", "itemtype": "equation", "pos": 19797, "prevtext": "\nis the array efficiency, defined as the fraction of the impinging kinetic energy the array extracts.\n\n\\subsection{Deflected-flow strength}\n\nThe bound vorticity acts to deflect the fluid so that it flows through the array at a constant angle ${\\alpha}$.\nWe assume that a constant ${\\alpha}$ over the length of the array may be achieved in practice using a sufficiently large density of deflector surfaces or orienting them at spatially varying angles of attack.\nIn the absence of free vorticity, the resulting flow field can be derived analytically for a given ${\\alpha}$ using standard techniques in complex analysis (which we include in the SI \\S 3 for completeness).\nThe accompanying bound vorticity is \n\n", "index": 11, "text": "\\begin{align}\n{\\omega_b}({\\boldsymbol{x}}) = -\\dfrac{2U x \\tan {\\alpha}}{\\sqrt{L^2/4 - x^2}} \\delta(y), \n\\label{eqn:boundvorticity}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\omega_{b}}({\\boldsymbol{x}})=-\\dfrac{2Ux\\tan{\\alpha}}{\\sqrt{L^{%&#10;2}/4-x^{2}}}\\delta(y),\" display=\"inline\"><mrow><mrow><mrow><msub><mi>ω</mi><mi>b</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>U</mi><mo>⁢</mo><mi>x</mi><mo>⁢</mo><mrow><mi>tan</mi><mo>⁡</mo><mi>α</mi></mrow></mrow><msqrt><mrow><mrow><msup><mi>L</mi><mn>2</mn></msup><mo>/</mo><mn>4</mn></mrow><mo>-</mo><msup><mi>x</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mstyle><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nand plotted in Figure \\ref{fig:FlowPower}~(a).\nThis dependence has two asymptotic limits; for $\\tan {\\alpha}\\ll 1$, or the weak deflection limit, $Q_0/UL \\approx \\tan{\\alpha}$ and for $\\tan {\\alpha} \\gg 1,$ or the strong deflection limit, $Q_0/UL \\approx \\sqrt{\\tan{\\alpha}}$.\nThese limits may be understood by considering the following: The flow rate $Q_0$, is set by the product of the velocity component normal to the array, $U\\tan{\\alpha}$, and the length $\\ell_0$ of the region between the recirculation zones, $Q_0= U\\ell_0 \\tan{\\alpha} $.\nThe size of the recirculation region overlapping with the array is characterized in detail in the SI \\S 5.\nFor weak deflection, the recirculation regions are small, and consequently $\\ell_0 \\approx L$. \nWhile for strong  deflection, the recirculation region occupies almost all of the array length leading to $\\ell_0 \\approx L/\\sqrt{\\tan{\\alpha}}$.\nThese two asymptotes are also shown in Figure \\ref{fig:FlowPower}~(a).\nThe dependence of the deflected-flow strength on ${\\alpha}$, and the direct proportionality between ${C_A}$ and the deflected-flow strength in {Eq.~\\textbf{\\ref{{eqn:ca}}}}, ultimately determines the predominant behavior of ${C_A}$ as a function of ${\\alpha}$ shown Figure~\\ref{fig:Schematic}~(d).\n\n\\subsection{Array efficiency $\\eta$}\nWe next determine how $\\eta$ depends on the flow parameters.\nAccording to {Eq.~\\textbf{\\ref{{eqn:arrayeff}}}}, $\\eta$ depends on $Q/Q_0$, which we call the flow reduction factor, and $V/U$, the dimensionless wake speed.\nThe flow reduction factor is related to the axial induction factor $a$ from the {LBJ}~analysis, $a=1-Q/Q_0$, and depends on the only two dimensionless parameters in our formulation, $V/U$ and $Q_0/UL$. \n\n\nWe determine $Q/Q_0$ numerically (details in SI \\S 4) as a function of the two dimensionless parameters.\nThe resulting flow reduction factor, $Q/Q_0$, and the array efficiency, $\\eta$, are plotted as a function of $V/U$ for fixed $Q_0/UL$ in Figure \\ref{fig:FlowPower}~(b).\nAs $V/U$ decreases below unity, and more energy is extracted by the array, $Q/Q_0$ decreases monotonically below unity. \nFuthermore, $Q/Q_0$ decreases monotonically with increasing deflected flow from the limiting value for weak deflection $f_0$ to that of strong deflection $f_\\infty$, where the two limits are\n\n\n", "itemtype": "equation", "pos": 20542, "prevtext": "\nwhere the array is located at $-L/2<x<L/2$ and $\\delta(y)$ is the Dirac-delta function.\nThe resulting flow field is shown in Figure \\ref{fig:Schematic}~(a) for ${\\alpha} = 40^\\circ$.\nThe flow develops recirculation regions near both edges of the array, which we show to reduce the effectiveness of the array. \nWe next develop analytic descriptions to examine the effect of recirculation.\n\nThe parameter $Q_0/UL$ represents the dimensionless deflected-flow strength, where $Q_0$ is the flow in between the recirculation zones.\nIts dependence on ${\\alpha}$ can is calculated analytically (see SI \\S 3) \n\n", "index": 13, "text": "\\begin{align}\n\\dfrac{Q_0}{UL} = \\left(\\dfrac{\\sqrt{1+4\\tan^2{\\alpha}} - 1}{2} \\right)^{1/2},\n \\label{eqn:zeroflow}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dfrac{Q_{0}}{UL}=\\left(\\dfrac{\\sqrt{1+4\\tan^{2}{\\alpha}}-1}{2}%&#10;\\right)^{1/2},\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle><mo>=</mo><msup><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msqrt><mrow><mn>1</mn><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><mrow><msup><mi>tan</mi><mn>2</mn></msup><mo>⁡</mo><mi>α</mi></mrow></mrow></mrow></msqrt><mo>-</mo><mn>1</mn></mrow><mn>2</mn></mfrac></mstyle><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nWe use a consistent color scheme in Figure \\ref{fig:FlowPower} to represent weak and strong deflection limits in red and blue respectively.\n\nIn our configuration, the flow reduction occurs for two reasons.\nThe first is due to resistance offered to the flow by the turbine array, which causes more fluid to flow around the turbine array.\nAs resistance from the actuator disk is the cause of flow reduction in the {LBJ}~analysis, we expect the quantitative contribution of this mechanism of flow reduction to be the similar.\nIn the {LBJ}~analysis the flow reduction is $Q/Q_0 = \\frac{1}{2}\\left(1+V/U\\right)$, plotted as a dashed black line in Figure \\ref{fig:FlowPower}~(b).\n\nWe implicitly neglect any losses due to the space between individual turbines.\nIndeed the expected flow reduction for our array at the weak deflection limit, the uppermost red line plotted in Figure \\ref{fig:FlowPower}, is close (but not identical) to the {LBJ}~line.\nThis similarity between our flow reduction factor and that of {LBJ}, arises from the similarity of our procedure for determining efficiency using an energy balance on a volume defined by two streamlines shedding vorticity.\n\nThe second reason for flow reduction is the development of recirculation regions at the edges of the array.\nA detailed characterization of the size of the recirculation regions is presented in SI \\S 5.\nAs the recirculation regions are small but finite in the limit of weak deflection, the flow reduction factor, $Q/Q_0$ differs only slightly from the {LBJ}~case (the difference between the red and black lines).\nIn the case of strong deflection, the influence of the turbine array resistance on size of the recirculation regions is stronger. \nTherefore, the flow through the array is lower than the {LBJ}~case (lines of increasing blue intensity in Figure \\ref{fig:FlowPower}~(b)).\n\nThe dependence of the array efficiency $\\eta$ on $V/U$ is also plotted in Figure \\ref{fig:FlowPower}~(b). \nA maximum $\\eta$ for fixed $Q_0/UL$ arises as we vary $V/U$ due to a competition between the increasing wake deficit and decreasing flow, which is defined as\n\n", "itemtype": "equation", "pos": 22983, "prevtext": "\nand plotted in Figure \\ref{fig:FlowPower}~(a).\nThis dependence has two asymptotic limits; for $\\tan {\\alpha}\\ll 1$, or the weak deflection limit, $Q_0/UL \\approx \\tan{\\alpha}$ and for $\\tan {\\alpha} \\gg 1,$ or the strong deflection limit, $Q_0/UL \\approx \\sqrt{\\tan{\\alpha}}$.\nThese limits may be understood by considering the following: The flow rate $Q_0$, is set by the product of the velocity component normal to the array, $U\\tan{\\alpha}$, and the length $\\ell_0$ of the region between the recirculation zones, $Q_0= U\\ell_0 \\tan{\\alpha} $.\nThe size of the recirculation region overlapping with the array is characterized in detail in the SI \\S 5.\nFor weak deflection, the recirculation regions are small, and consequently $\\ell_0 \\approx L$. \nWhile for strong  deflection, the recirculation region occupies almost all of the array length leading to $\\ell_0 \\approx L/\\sqrt{\\tan{\\alpha}}$.\nThese two asymptotes are also shown in Figure \\ref{fig:FlowPower}~(a).\nThe dependence of the deflected-flow strength on ${\\alpha}$, and the direct proportionality between ${C_A}$ and the deflected-flow strength in {Eq.~\\textbf{\\ref{{eqn:ca}}}}, ultimately determines the predominant behavior of ${C_A}$ as a function of ${\\alpha}$ shown Figure~\\ref{fig:Schematic}~(d).\n\n\\subsection{Array efficiency $\\eta$}\nWe next determine how $\\eta$ depends on the flow parameters.\nAccording to {Eq.~\\textbf{\\ref{{eqn:arrayeff}}}}, $\\eta$ depends on $Q/Q_0$, which we call the flow reduction factor, and $V/U$, the dimensionless wake speed.\nThe flow reduction factor is related to the axial induction factor $a$ from the {LBJ}~analysis, $a=1-Q/Q_0$, and depends on the only two dimensionless parameters in our formulation, $V/U$ and $Q_0/UL$. \n\n\nWe determine $Q/Q_0$ numerically (details in SI \\S 4) as a function of the two dimensionless parameters.\nThe resulting flow reduction factor, $Q/Q_0$, and the array efficiency, $\\eta$, are plotted as a function of $V/U$ for fixed $Q_0/UL$ in Figure \\ref{fig:FlowPower}~(b).\nAs $V/U$ decreases below unity, and more energy is extracted by the array, $Q/Q_0$ decreases monotonically below unity. \nFuthermore, $Q/Q_0$ decreases monotonically with increasing deflected flow from the limiting value for weak deflection $f_0$ to that of strong deflection $f_\\infty$, where the two limits are\n\n\n", "index": 15, "text": "\\begin{align}\n\\begin{split}\n\\text{Weak deflection:}  & \\quad \\dfrac{Q}{Q_0} \\to f_0     \\left(\\dfrac{V}{U} \\right) \\text{ for } \\dfrac{Q_0}{UL} \\ll 1, \\\\\n\\text{Strong deflection:}& \\quad \\dfrac{Q}{Q_0} \\to f_\\infty\\left(\\dfrac{V}{U} \\right) \\text{ for } \\dfrac{Q_0}{UL} \\gg 1.\n\\end{split}\n\\label{eqn:asympdefs}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\begin{split}\\displaystyle\\text{Weak deflection:}&amp;\\displaystyle%&#10;\\quad\\dfrac{Q}{Q_{0}}\\to f_{0}\\left(\\dfrac{V}{U}\\right)\\text{ for }\\dfrac{Q_{0%&#10;}}{UL}\\ll 1,\\\\&#10;\\displaystyle\\text{Strong deflection:}&amp;\\displaystyle\\quad\\dfrac{Q}{Q_{0}}\\to f%&#10;_{\\infty}\\left(\\dfrac{V}{U}\\right)\\text{ for }\\dfrac{Q_{0}}{UL}\\gg 1.\\end{split}\" display=\"inline\"><mtable columnspacing=\"0pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mtext>Weak deflection:</mtext></mtd><mtd columnalign=\"left\"><mrow><mrow><mpadded lspace=\"10pt\" width=\"+10pt\"><mstyle displaystyle=\"true\"><mfrac><mi>Q</mi><msub><mi>Q</mi><mn>0</mn></msub></mfrac></mstyle></mpadded><mo>→</mo><mrow><msub><mi>f</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>V</mi><mi>U</mi></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mtext> for </mtext><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle></mrow><mo>≪</mo><mn>1</mn></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mtext>Strong deflection:</mtext></mtd><mtd columnalign=\"left\"><mrow><mrow><mpadded lspace=\"10pt\" width=\"+10pt\"><mstyle displaystyle=\"true\"><mfrac><mi>Q</mi><msub><mi>Q</mi><mn>0</mn></msub></mfrac></mstyle></mpadded><mo>→</mo><mrow><msub><mi>f</mi><mi mathvariant=\"normal\">∞</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mi>V</mi><mi>U</mi></mfrac></mstyle><mo>)</mo></mrow><mo>⁢</mo><mtext> for </mtext><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle></mrow><mo>≫</mo><mn>1</mn></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nand plotted in the inset of figure \\ref{fig:FlowPower}~(a).\nBecause of its direct relationship with the flow reduction factor (i.e., {Eq.~\\textbf{\\ref{{eqn:arrayeff}}}}), both $\\eta$ and ${\\eta_\\text{max}}$ also lie between weak and strong deflection limits.\nThe upper bound corresponds to the weak deflection limit, in which case ${\\eta_\\text{max}}\\approx { 0.57}$ occurs for $V/U=0.38$, close to the values derived from {LBJ}~analysis. \nThe lower bound corresponds to the strong deflection limit, in which case ${\\eta_\\text{max}} \\approx { 0.39}$ occurs for $V/U=0.59$.\nThe reduction is efficiency in the strong deflection limit may be traced back to a smaller flow reduction factor $Q/Q_0$ for this case, which in turn arises from the increase in size of the recirculation zones due to resistance to the flow offered by the turbines.\nIn summary, deflecting more flow through the array slightly decreases the efficiency of the array at extracting the impinging energy.\n\nA bound on the array power density can be obtained by recognizing that, by definition, $\\eta \\le {\\eta_\\text{max}}$, and which upon substitution into {Eq.~\\textbf{\\ref{{eqn:ca}}}} leads to {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}}.\n\n\n\\section{Discussion}\n\\subsection{Increase in deflected-flow strength outweighs drop in turbine efficiency}\n\nThe array power density in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} has opposing dependences on the flow deflection and turbine efficiency. \nOn one hand, the maximum possible efficiency of energy conversion, shown in the inset of Figure \\ref{fig:FlowPower}~(a), decreases with the deflected-flow strength.\nBut on the other hand, the stronger the deflected flow, the more kinetic energy impinges on the turbines in the array.\nArray power density is effected more strongly by the order of magnitude increase of impinging kinetic energy due to deflection than the decrease in array efficiency from  ${ 0.57}$  to ${ 0.39}$.\nTherefore, larger array power densities are possible if the bound vorticity in the deflector-turbine array can be reinforced and greater flow deflected, without influencing the free vorticity.\nIn other words, an optimal value for the deflected-flow strength does not emerge as part of our analysis; \nthe greater the deflected-flow strength without flow separation, the higher can the array power density be.\n\n\n\\subsection{Methods for flow deflection} \n\nOur results, because of their basis in vorticity dynamics, are agnostic to the specific deflecting and energy converting mechanisms employed in the array.\nFor manipulating the flow, the most obvious candidates we present is an array of airfoil-shaped deflector plates interspersed with the turbines. \nA host of other techniques, such as turbines oriented at an angle to the flow \\cite{Wagenaar2012,Fleming2014,Churchfield2015}, or foils oscillating asymmetrically about their mean positions, to vector its wake at an angle to the free stream are conceivable.\nThe underlying essential principle is that the turbine array introduce the appropriate bound and free vorticity.\n\n{Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} shows that the bound on array power density depends on the ability of the array to deflect the flow with minimal introduction of free vorticity.\nHigh-lift aerodynamic surfaces are ideal candidates for this purpose because they are designed to introduce the highest bound vorticity in the flow without significant flow separation.\nThese surfaces can lead to a lift coefficient of up to 4.5 \\cite{Smith1973,Liebeck1978,Lin1997}, which implies bound vorticity equivalent to a flat plate at an approximately 40$^\\circ$ angle of attack.\nUsing these as reference deflectors to estimate the maximum array energy density that can be realized with current technology, we substitute $\\alpha=40^\\circ$ in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} and obtain ${C_A} = { 0.30}$.\nThis result is plotted in Figure \\ref{fig:Schematic}~(d).\n\n\n\n\n\n\n\n\n\n\\subsection{Applications to hydrokinetic power}\nOne of the direct applications of our approach is an unconventional configuration for tidal and riverine turbine arrays -- \none in a vertical plane oriented parallel to the flow as shown in Figure \\ref{fig:Schematic}~(c).\nIn a water stream with 1.5 m/s flow speed, our estimate for the dimensional array energy density is ${506}$ W/m$^2$ (${C_A}=0.3$) compared to 4.6 W/m$^2$ (${C_A}=2.7 \\times 10^{-3}$) arising from turbulent mixing in a large conventional array, or 20 W/m$^2$ arising in smaller arrays (${C_A} = 1.2 \\times 10^{-2}$).\n\n\n\nIn addition to the higher energy density, the unconventional configuration offers several practical advantages.\nThe array makes efficient use of the space, by allowing other uses of the water body and keeping navigational channels open.\nEqually importantly, this configuration allows turbines to span the whole depth of the water column.\nThis possibility implies that only turbine blades or hydrofoils need to be submerged under water, and other mechanical and electrical components may be housed above the surface of water. Operating the drive-train, generators, and interconnecting cables above water reduces the initial installation costs by eliminating the need for marinization, and the operations and maintenance cost by providing easy access.\nWhile a detailed techno-economic analysis is beyond the scope of this article, the results presented here provide an integral component needed to perform cost-benefit analysis of incorporating flow deflection in hydrokinetic turbine arrays. \n\nIn our analysis, we have ignored the presence of any boundaries on the fluid domain, due to the simplicity it provides for analysis and our focus on the essential principles.\nFor an array length comparable with the channel width, the presence of boundaries will influence the flow and the performance of the array.\nHowever, for arrays shorter than channel width, the influence of the boundaries can be neglected, and our analysis is applicable.\nThe neglect of boundaries is not a fundamental limitation of our approach or our analysis.\nBoundaries can be incorporated using the method of images or boundary integral methods for potential flow to obtain improved bounds and to better design the array.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Possible extensions and future directions}\nThe extension of our framework to three-dimensional flows requires incorporating the more general vorticity dynamics.\nJust as lifting line theory for three-dimensional wings is based on the two-dimensional Kutta-Joukowsky relation between bound vorticity and airfoil lift, our results in two dimensions provide the foundation for such an extension to three dimensions.\nFurthermore, unsteadiness and turbulence in the flow, the role of fluid viscosity, presence of shear in the freestream, the presence of ground and other boundaries, and the discrete nature of the array will reduce the performance below the limits we present here.\nWe have also not accounted for gravity, the free interface, and bed friction for the hydrokinetic application.\nAs can be seen from Figure \\ref{fig:Schematic}~(d), a $5^\\circ$ deflection of the flow leads to equal or greater ${C_A}$ than due to turbulent mixing.\nTherefore, we expect the influence of deflection greater than $5^\\circ$ to overwhelm the influence of turbulence.\nThese effects could be examined more carefully by embedding the deflector-turbine array in a larger computational fluid dynamics model and through controlled experiments.\n\n\\section{Conclusion}\nWe presented systematic flow manipulation as a strategy to deflect untapped kinetic energy towards a device array consisting of flow deflectors and turbines.\nWe use the framework of inviscid fluid dynamics to decompose the effects of array on fluid flow into deflection, captured in bound vorticity, and energy extraction, captured by shed vorticity. \nThe results calculated here represent upper bounds on performance that are agnostic to the specific technology at the array.\n\nUsing the array to impose deflection on the fluid flow can provide an order of magnitude increase in array power density from that achieved by existing arrays.\nThe large gain in kinetic energy deflected onto the array (deflected-flow strength) outweighs the small decrease in array's efficiency at extracting that energy (from { 57}\\% - { 39}\\%) due to increased recirculation.\nWe expect the essential ingredients of this analysis to inform more complicated methods of flow deflection and three-dimensional situations.\n\nFuture investigations building on this analysis will help evaluate the technical and economic feasibility of this approach.\n\n\n\n\n\n\n\n\n\n\n\n\\vspace{2mm}\n\\noindent\n{\\bf Acknowledgments} \\\\\nWe acknowledge support from the DOE ARPA-E grant DE-AR0000318 for this work. \n\n\n\n\\bibliographystyle{unsrt}\n\n\n\\begin{figure*}\n\\centerline{\n\\includegraphics[width=155mm]{Figures/Summary}\n} \n\\caption{\nThe motivation behind, the flow field arising from, and the performance of an abstract deflector-turbine array.\n(a) The ideal flow field arising from an abstract array of deflectors of length $L$ oriented at an angle of attack of 40$^\\circ$. \nThe flow corresponds to an array deflecting the flow with no energy extraction.\n$Q_0$ is the deflected-flow strength, between the two extreme streamlines that pass through the array.\nInset shows a schematic of discrete deflectors and turbines; a possible realization of our abstracted analysis.\n(b) Same as (a) but with energy conversion due to optimal performance of a deflector-turbine array.\nThe flow through the array is now reduced from $Q_0$ to $Q$, and the flow speed in the wake is reduced from the freestream $U$ to $V$. \n(c) Schematic motivation for our analysis: a deflector-turbine array aligned along the centerline of a river.\n(d) The performance of an ideal deflector turbine array quantified by the array power density defined in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} plotted as a function of the angle of attack of the deflector plates.\nThe blue circle shows the value of ${C_A}$ for ${\\alpha}=40^\\circ$, which corresponds to maximum angle of attack that can be achieved using high-lift surfaces without boundary layer separation.\nAlso plotted in the cyan rectangle for comparison are values of ${C_A}$ for conventional turbine arrays reported in the literature cited in the gray box. \n}\n\\label{fig:Schematic}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centerline{\n\\includegraphics[width=155mm]{Figures/FlowPower}\n}\n\\caption{\nResults on deflector-turbine array performance from the solution of inviscid flow. \n(a) The dependence of the deflected-flow strength, $Q_0/UL$, on the angle of attack ${\\alpha}$ calculated in {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}}. \nInset shows the maximum array efficiency possible for a given deflected-flow strength.\nThe color shown in the palette encodes the deflected-flow strength in this figure.\n(b) The flow reduction factor, $Q/Q_0$, and (c) array efficiency, $\\eta$, as a function of the dimensionless wake speed, $V/U$, for different values of the deflected-flow strength encoded by the color.\nThe dashed black curve shows the performance, according to the {LBJ}~analysis, if the entire array was a single actuator disk oriented perpendicular to the incident flow.\nThe solid red and blue curves represent the asymptotic limits corresponding to weak and strong deflection introduced in {Eq.~\\textbf{\\ref{{eqn:asympdefs}}}}. \n}\n\\label{fig:FlowPower}\n\\end{figure*}\n\n\n\n\\newpage\n\\setcounter{page}{1}\n\\setcounter{equation}{0}\n\\setcounter{section}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\n\\centerline{\\LARGE \\textbf{Supplementary Information}}\n\\section{1. ${C_A}$ induced by turbulent mixing}\nIn this section, we present the details for calculating the equivalent ${C_A}$ from analyses presented in the literature.\nThese results are summarized in Table~\\textbf{SI.1} and plotted in Figure~\\ref{fig:Schematic} of the article.\nAll estimates pertained to arrays of wind turbines, therefore the density of the fluid ranged from $\\rho=1.1-1.2$ kg/m$^3$ depending on the source.\n\n\\noindent\n{\\bf a. Calaf, et al, (2010)} \\cite{Calaf2010}:\nThe article simulates the fully developed wind turbine atmospheric boundary layer for pressure-gradient-driven flow around a rectangular array of turbines.\nPeriodic boundary conditions in both streamwise and spanwise direction imply simulation of an infinite array. \nThe turbines are modeled as actuator disks.\nThe spacing between turbines is 7.85 diameters in the streamwise and 5.23 in the spanwise direction.\nThe power extracted by the turbines per unit ground area is presented in terms of the friction velocity $u_*$ to be ${\\dot{W}}/{A_\\text{array}}=4.93/\\rho u_*^3$.\nThe wind speed at hub height in the absence of the turbines is $U=$17.3$u_*$, and it varied from 15.9$u_*$ to 18.8$u_*$ over the actuator disk diameter.\nBased on this data, the mean ${C_A}$ is calculated to be $1.9 \\times 10^{-3}$. \nThe error in this estimate arises due to the variation of the wind speed over the actuator disk.\nUsing the extremes of the wind speed the range of ${C_A}$ is estimated to be between $1.5 \\times 10^{-3}$ and $2.4 \\times 10^{-3}$.\n\n{\\bf b. Miller, et al, (2015)} \\cite{Miller2015}: \nThe article simulates atmospheric flow on the national scale in the presence of wind turbines over 112,320 km$^2$ in Kansas. \nThey report a maximum vertical kinetic energy flux of 1.1 W/m$^2$ over a region of the wind farm away from the edges with a first to third quantile variation from 0.375 W/m$^2$ to 1.55 W/m$^2$.\nThey postulate that their results are independent of the size of the farm, and therefore this kinetic energy flux represents the limit on the power conversion by the wind turbines.\nThe distribution of mean wind speed at hub height is reported, and can be closely approximated by a normal distribution with mean $\\mu=8$ m/s and standard deviation $\\sigma=2.9$ m/s.\nWe use this distribution to determine the distribution of $U^3$, which enters the definition of ${C_A}$.\nThe mean $U^3$, where $U$ is a normally distributed random variable is $\\mu^3 + 3 \\mu \\sigma^2$ = 714 m$^3$/s$^3$.\nBased on this information, we estimate ${C_A} = 2.7 \\times 10^{-3}$ using the mean values.\nWe also remark that, in addition to turbulent transport, detailed atmospheric dynamics on the national scale were part of this simulation. \nParameters such as the wind speed at hub height varied with time, and so did the power production. \n\n\\noindent\n{\\bf c. Cal, et al, (2010)} \\cite{Cal2010}:\nThe article presents results from a wind-tunnel experiment simulating a $3\\times 3 $ array of wind turbines. \nThey report the vertical flux of kinetic energy, however, the array may not be large enough to simulate a fully developed boundary layer.\nThe wind speed, in the absence of energy conversion, at hub height was maintained at 7 m/s, and varied between 6.2 m/s and 7.3 m/s across the rotor diameter.\nUsing the vertical kinetic energy flux in to the array, and ignoring the power production by the turbines in the front of the array facilitates a quantification of the redirected kinetic energy flux that replenishes the wake deficit.\nBecause of the small size of the array, this case provides insight into any departure of the kinetic energy redirection from the fully developed cases described in the previous two cases.\nA vertical kinetic energy flux of 1.8 W/m$^2$ was estimated using particle image velocimetry. \nBased on this information, we estimate the mean ${C_A}=8.89 \\times 10^{-3}$, and using the variation of the wind speed across the rotor derive a range for ${C_A}$ from $8.0\\times 10^{-3}$ to $1.3 \\times 10^{-2}$.\n\n\\noindent\n{\\bf d. Kinzel, et al, (2012)} \\cite{Kinzel2012a}:\nThe article reports results from a vertical axis wind turbine array with 9 pairs of counter-rotating turbines arranged in a $3\\times 3$ array installed in the field.\nFlow within and around the array was characterized using ultrasonic anemometers placed at various locations in the array.\nThe mean wind speed above the turbines is reported to be 8.05 m/s (no information about the variation of this quantity was reported).\nThe authors report a vertical kinetic energy flux that varies from 2.2 W/m$^2$ at the front of the array to 3.4 W/m$^2$ near the back of the array.\nBased on this information, we estimate ${C_A}$ to be in the range from $7.1 \\times 10^{-3}$ $1.1 \\times 10^{-2}$ with a mean value of $9.09 \\times 10^{-3}$.\n\n\\noindent\n{\\bf e. MacKay (2008)} \\cite{Mackay2008}:\nThe book reports and uses a simplified analysis where each horizontal axis turbine of diameter $D$ occupies an area of $5D \\times 5D$ is a square array.\nThe turbine operates at 50\\% efficiency extracting $\\frac{1}{2} (\\frac{1}{2} \\rho U^3 \\pi D^2/4)$, which based on the ground area of ${A_\\text{array}} = 25 D^2$ yields  ${C_A} = \\pi/200 = 1.57 \\times 10^{-2}$.\nDespite the simplified nature of this analysis, given that no wind turbine array has considered installing turbine closer than $5D$, the estimate provides useful bound and insight into the origin of the small magnitude of ${C_A}$.\n\n\n\\bgroup\n\\begin{tabular}{llccccc}\n\\textbf{Reference} \t&\\textbf{Citation}& \\textbf{Mean speed} & \\textbf{Power}\t& Mean ${C_A}$    \t& Min. ${C_A}$    \t& Max. ${C_A}$    \t\\\\\nCalaf, et al, (2010)\t& \\cite{Calaf2010}  &   17.3 $u_*$\t& 4.93/$\\rho u_*^3$\t& $1.9  \\times 10^{-3}$ & $1.5 \\times 10^{-3}$ & $2.4 \\times 10^{-3}$   \\\\ \nMiller, et al, (2015) \t& \\cite{Miller2015} &\t8  m/s\t\t&\t1.1 W/m$^2$ \t& $3.7  \\times 10^{-3}$ & $2.8 \\times 10^{-3}$ & $3.2 \\times 10^{-3}$ \t\\\\\nCal, et al, (2010)    \t& \\cite{Cal2010} \t&\t7 m/s\t& \t1.8 W/m$^2$ \t& $8.9  \\times 10^{-3}$ & $8.0 \\times 10^{-3}$ & $1.3 \\times 10^{-2}$ \t\\\\\nKinzel, et al, (2012) \t& \\cite{Kinzel2012a}& 8.05 m/s\t\t& \t3.4 W/m$^2$\t& $9.1  \\times 10^{-3}$ & $7.1 \\times 10^{-3}$ & $1.1 \\times 10^{-2}$ \t\\\\\nMacKay (2008)         \t& \\cite{Mackay2008}\t& 6 m/s\t\t&\t2.2 W/m$^2$\t& $1.57 \\times 10^{-2}$ & -\t\t       & - \t\\\\\nChurchfield, et al, (2015) & \\cite{Churchfield2015} & 9 m/s\t& \t5.58 MW\t\t& $2.9  \\times 10^{-2}$ & - & - \t\\\\\n \\multicolumn{3}{c}{(same as above, with yaw manipulation)} \t&\t6.03 MW\t\t& $3.1  \\times 10^{-2}$ & - & -\n\\end{tabular}\n\\egroup\n\\vspace{2mm}\n\\centerline{\\textbf{Table SI.1:} {\\sf \\small Summary of our calculation of ${C_A}$ from the literature.}}\n\n\n\\vspace{2mm} \nThe next set of examples treat an array geometry sufficiently different from the one we consider, and a direct comparison of the ${C_A}$ with the previous examples or with our results can not be justified.\nNevertheless, we find estimating the ${C_A}$ for the following cases useful in their own right, especially because an redirection of kinetic energy flux was demonstrated by systematically deflecting the wake away from downstream turbines.\n\n\\noindent \n{\\bf a. Churchfield, et al, (2015)} \\cite{Churchfield2015}:\nThe article reports results from a computational investigation of five wind turbines installed in a straight line along the prevailing wind direction. \nEach turbine is 115 m is diameter, and the inter-turbine separation is 1008 m, which implies a ground plane \\emph{or} vertical area of $4\\times 1008 \\text{ m} \\times 115 \\text{ m}= 463,680 \\text{ m}^2$ .\nWe use this area as our reference area.\nThey simulate turbines pointing directly into, as well as yawed 5$^\\circ$, 15$^\\circ$, and 25$^\\circ$ to the wind. \n\nThe wind speed at hub height is 9 m/s, and the first (unwaked) turbine generates 1.87 MW. \nThey report that in the un-yawed configuration, the turbine farm generates 59.7\\% of the power five independent unwaked turbines would generate, which implies a total production of 5.58 MW.\nIn this configuration, ${C_A} = 2.87 \\times 10^{-2}$.\n\n\\noindent \n{\\bf a$^*$. Churchfield, et al, (2015)} \\cite{Churchfield2015}:\nThe group also investigated and reported an increase in the power production when the turbines in the array were yawed to the incoming flow.\nThe total increase was 8\\% upon a yaw misalignment of 25$^\\circ$.\nThis increases ${C_A}$ to ${C_A} = 3.10 \\times 10^{-2}$.\n\n\\section{2. No Energy conversion with bound vorticity alone}\nThe asymptotic far-field velocity due to the bound vorticity distribution is \n\n", "itemtype": "equation", "pos": 25421, "prevtext": "\nWe use a consistent color scheme in Figure \\ref{fig:FlowPower} to represent weak and strong deflection limits in red and blue respectively.\n\nIn our configuration, the flow reduction occurs for two reasons.\nThe first is due to resistance offered to the flow by the turbine array, which causes more fluid to flow around the turbine array.\nAs resistance from the actuator disk is the cause of flow reduction in the {LBJ}~analysis, we expect the quantitative contribution of this mechanism of flow reduction to be the similar.\nIn the {LBJ}~analysis the flow reduction is $Q/Q_0 = \\frac{1}{2}\\left(1+V/U\\right)$, plotted as a dashed black line in Figure \\ref{fig:FlowPower}~(b).\n\nWe implicitly neglect any losses due to the space between individual turbines.\nIndeed the expected flow reduction for our array at the weak deflection limit, the uppermost red line plotted in Figure \\ref{fig:FlowPower}, is close (but not identical) to the {LBJ}~line.\nThis similarity between our flow reduction factor and that of {LBJ}, arises from the similarity of our procedure for determining efficiency using an energy balance on a volume defined by two streamlines shedding vorticity.\n\nThe second reason for flow reduction is the development of recirculation regions at the edges of the array.\nA detailed characterization of the size of the recirculation regions is presented in SI \\S 5.\nAs the recirculation regions are small but finite in the limit of weak deflection, the flow reduction factor, $Q/Q_0$ differs only slightly from the {LBJ}~case (the difference between the red and black lines).\nIn the case of strong deflection, the influence of the turbine array resistance on size of the recirculation regions is stronger. \nTherefore, the flow through the array is lower than the {LBJ}~case (lines of increasing blue intensity in Figure \\ref{fig:FlowPower}~(b)).\n\nThe dependence of the array efficiency $\\eta$ on $V/U$ is also plotted in Figure \\ref{fig:FlowPower}~(b). \nA maximum $\\eta$ for fixed $Q_0/UL$ arises as we vary $V/U$ due to a competition between the increasing wake deficit and decreasing flow, which is defined as\n\n", "index": 17, "text": "\\begin{align}\n {\\eta_\\text{max}} \\left(\\dfrac{Q_0}{UL}\\right)= \\max_{V/U} \\quad \\eta\\left(\\dfrac{Q_0}{UL}, \\dfrac{V}{U} \\right),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\eta_{\\text{max}}}\\left(\\dfrac{Q_{0}}{UL}\\right)=\\max_{V/U}\\quad%&#10;\\eta\\left(\\dfrac{Q_{0}}{UL},\\dfrac{V}{U}\\right),\" display=\"inline\"><mrow><mrow><mrow><msub><mi>η</mi><mtext>max</mtext></msub><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow><mo>=</mo><mrow><munder><mi>max</mi><mrow><mi>V</mi><mo>/</mo><mi>U</mi></mrow></munder><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mi>η</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>Q</mi><mn>0</mn></msub><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle><mo>,</mo><mstyle displaystyle=\"true\"><mfrac><mi>V</mi><mi>U</mi></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere $\\Gamma_1$ is the net bound vorticity, and ${\\hat{\\boldsymbol{\\theta}}}$ is the unit vector along the azimuthal direction in a polar coordinate system centered at the array.\nThe flux of kinetic energy is\n\n", "itemtype": "equation", "pos": 45646, "prevtext": "\nand plotted in the inset of figure \\ref{fig:FlowPower}~(a).\nBecause of its direct relationship with the flow reduction factor (i.e., {Eq.~\\textbf{\\ref{{eqn:arrayeff}}}}), both $\\eta$ and ${\\eta_\\text{max}}$ also lie between weak and strong deflection limits.\nThe upper bound corresponds to the weak deflection limit, in which case ${\\eta_\\text{max}}\\approx { 0.57}$ occurs for $V/U=0.38$, close to the values derived from {LBJ}~analysis. \nThe lower bound corresponds to the strong deflection limit, in which case ${\\eta_\\text{max}} \\approx { 0.39}$ occurs for $V/U=0.59$.\nThe reduction is efficiency in the strong deflection limit may be traced back to a smaller flow reduction factor $Q/Q_0$ for this case, which in turn arises from the increase in size of the recirculation zones due to resistance to the flow offered by the turbines.\nIn summary, deflecting more flow through the array slightly decreases the efficiency of the array at extracting the impinging energy.\n\nA bound on the array power density can be obtained by recognizing that, by definition, $\\eta \\le {\\eta_\\text{max}}$, and which upon substitution into {Eq.~\\textbf{\\ref{{eqn:ca}}}} leads to {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}}.\n\n\n\\section{Discussion}\n\\subsection{Increase in deflected-flow strength outweighs drop in turbine efficiency}\n\nThe array power density in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} has opposing dependences on the flow deflection and turbine efficiency. \nOn one hand, the maximum possible efficiency of energy conversion, shown in the inset of Figure \\ref{fig:FlowPower}~(a), decreases with the deflected-flow strength.\nBut on the other hand, the stronger the deflected flow, the more kinetic energy impinges on the turbines in the array.\nArray power density is effected more strongly by the order of magnitude increase of impinging kinetic energy due to deflection than the decrease in array efficiency from  ${ 0.57}$  to ${ 0.39}$.\nTherefore, larger array power densities are possible if the bound vorticity in the deflector-turbine array can be reinforced and greater flow deflected, without influencing the free vorticity.\nIn other words, an optimal value for the deflected-flow strength does not emerge as part of our analysis; \nthe greater the deflected-flow strength without flow separation, the higher can the array power density be.\n\n\n\\subsection{Methods for flow deflection} \n\nOur results, because of their basis in vorticity dynamics, are agnostic to the specific deflecting and energy converting mechanisms employed in the array.\nFor manipulating the flow, the most obvious candidates we present is an array of airfoil-shaped deflector plates interspersed with the turbines. \nA host of other techniques, such as turbines oriented at an angle to the flow \\cite{Wagenaar2012,Fleming2014,Churchfield2015}, or foils oscillating asymmetrically about their mean positions, to vector its wake at an angle to the free stream are conceivable.\nThe underlying essential principle is that the turbine array introduce the appropriate bound and free vorticity.\n\n{Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} shows that the bound on array power density depends on the ability of the array to deflect the flow with minimal introduction of free vorticity.\nHigh-lift aerodynamic surfaces are ideal candidates for this purpose because they are designed to introduce the highest bound vorticity in the flow without significant flow separation.\nThese surfaces can lead to a lift coefficient of up to 4.5 \\cite{Smith1973,Liebeck1978,Lin1997}, which implies bound vorticity equivalent to a flat plate at an approximately 40$^\\circ$ angle of attack.\nUsing these as reference deflectors to estimate the maximum array energy density that can be realized with current technology, we substitute $\\alpha=40^\\circ$ in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} and obtain ${C_A} = { 0.30}$.\nThis result is plotted in Figure \\ref{fig:Schematic}~(d).\n\n\n\n\n\n\n\n\n\n\\subsection{Applications to hydrokinetic power}\nOne of the direct applications of our approach is an unconventional configuration for tidal and riverine turbine arrays -- \none in a vertical plane oriented parallel to the flow as shown in Figure \\ref{fig:Schematic}~(c).\nIn a water stream with 1.5 m/s flow speed, our estimate for the dimensional array energy density is ${506}$ W/m$^2$ (${C_A}=0.3$) compared to 4.6 W/m$^2$ (${C_A}=2.7 \\times 10^{-3}$) arising from turbulent mixing in a large conventional array, or 20 W/m$^2$ arising in smaller arrays (${C_A} = 1.2 \\times 10^{-2}$).\n\n\n\nIn addition to the higher energy density, the unconventional configuration offers several practical advantages.\nThe array makes efficient use of the space, by allowing other uses of the water body and keeping navigational channels open.\nEqually importantly, this configuration allows turbines to span the whole depth of the water column.\nThis possibility implies that only turbine blades or hydrofoils need to be submerged under water, and other mechanical and electrical components may be housed above the surface of water. Operating the drive-train, generators, and interconnecting cables above water reduces the initial installation costs by eliminating the need for marinization, and the operations and maintenance cost by providing easy access.\nWhile a detailed techno-economic analysis is beyond the scope of this article, the results presented here provide an integral component needed to perform cost-benefit analysis of incorporating flow deflection in hydrokinetic turbine arrays. \n\nIn our analysis, we have ignored the presence of any boundaries on the fluid domain, due to the simplicity it provides for analysis and our focus on the essential principles.\nFor an array length comparable with the channel width, the presence of boundaries will influence the flow and the performance of the array.\nHowever, for arrays shorter than channel width, the influence of the boundaries can be neglected, and our analysis is applicable.\nThe neglect of boundaries is not a fundamental limitation of our approach or our analysis.\nBoundaries can be incorporated using the method of images or boundary integral methods for potential flow to obtain improved bounds and to better design the array.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Possible extensions and future directions}\nThe extension of our framework to three-dimensional flows requires incorporating the more general vorticity dynamics.\nJust as lifting line theory for three-dimensional wings is based on the two-dimensional Kutta-Joukowsky relation between bound vorticity and airfoil lift, our results in two dimensions provide the foundation for such an extension to three dimensions.\nFurthermore, unsteadiness and turbulence in the flow, the role of fluid viscosity, presence of shear in the freestream, the presence of ground and other boundaries, and the discrete nature of the array will reduce the performance below the limits we present here.\nWe have also not accounted for gravity, the free interface, and bed friction for the hydrokinetic application.\nAs can be seen from Figure \\ref{fig:Schematic}~(d), a $5^\\circ$ deflection of the flow leads to equal or greater ${C_A}$ than due to turbulent mixing.\nTherefore, we expect the influence of deflection greater than $5^\\circ$ to overwhelm the influence of turbulence.\nThese effects could be examined more carefully by embedding the deflector-turbine array in a larger computational fluid dynamics model and through controlled experiments.\n\n\\section{Conclusion}\nWe presented systematic flow manipulation as a strategy to deflect untapped kinetic energy towards a device array consisting of flow deflectors and turbines.\nWe use the framework of inviscid fluid dynamics to decompose the effects of array on fluid flow into deflection, captured in bound vorticity, and energy extraction, captured by shed vorticity. \nThe results calculated here represent upper bounds on performance that are agnostic to the specific technology at the array.\n\nUsing the array to impose deflection on the fluid flow can provide an order of magnitude increase in array power density from that achieved by existing arrays.\nThe large gain in kinetic energy deflected onto the array (deflected-flow strength) outweighs the small decrease in array's efficiency at extracting that energy (from { 57}\\% - { 39}\\%) due to increased recirculation.\nWe expect the essential ingredients of this analysis to inform more complicated methods of flow deflection and three-dimensional situations.\n\nFuture investigations building on this analysis will help evaluate the technical and economic feasibility of this approach.\n\n\n\n\n\n\n\n\n\n\n\n\\vspace{2mm}\n\\noindent\n{\\bf Acknowledgments} \\\\\nWe acknowledge support from the DOE ARPA-E grant DE-AR0000318 for this work. \n\n\n\n\\bibliographystyle{unsrt}\n\n\n\\begin{figure*}\n\\centerline{\n\\includegraphics[width=155mm]{Figures/Summary}\n} \n\\caption{\nThe motivation behind, the flow field arising from, and the performance of an abstract deflector-turbine array.\n(a) The ideal flow field arising from an abstract array of deflectors of length $L$ oriented at an angle of attack of 40$^\\circ$. \nThe flow corresponds to an array deflecting the flow with no energy extraction.\n$Q_0$ is the deflected-flow strength, between the two extreme streamlines that pass through the array.\nInset shows a schematic of discrete deflectors and turbines; a possible realization of our abstracted analysis.\n(b) Same as (a) but with energy conversion due to optimal performance of a deflector-turbine array.\nThe flow through the array is now reduced from $Q_0$ to $Q$, and the flow speed in the wake is reduced from the freestream $U$ to $V$. \n(c) Schematic motivation for our analysis: a deflector-turbine array aligned along the centerline of a river.\n(d) The performance of an ideal deflector turbine array quantified by the array power density defined in {Eq.~\\textbf{\\ref{{eqn:ourlimit}}}} plotted as a function of the angle of attack of the deflector plates.\nThe blue circle shows the value of ${C_A}$ for ${\\alpha}=40^\\circ$, which corresponds to maximum angle of attack that can be achieved using high-lift surfaces without boundary layer separation.\nAlso plotted in the cyan rectangle for comparison are values of ${C_A}$ for conventional turbine arrays reported in the literature cited in the gray box. \n}\n\\label{fig:Schematic}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\centerline{\n\\includegraphics[width=155mm]{Figures/FlowPower}\n}\n\\caption{\nResults on deflector-turbine array performance from the solution of inviscid flow. \n(a) The dependence of the deflected-flow strength, $Q_0/UL$, on the angle of attack ${\\alpha}$ calculated in {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}}. \nInset shows the maximum array efficiency possible for a given deflected-flow strength.\nThe color shown in the palette encodes the deflected-flow strength in this figure.\n(b) The flow reduction factor, $Q/Q_0$, and (c) array efficiency, $\\eta$, as a function of the dimensionless wake speed, $V/U$, for different values of the deflected-flow strength encoded by the color.\nThe dashed black curve shows the performance, according to the {LBJ}~analysis, if the entire array was a single actuator disk oriented perpendicular to the incident flow.\nThe solid red and blue curves represent the asymptotic limits corresponding to weak and strong deflection introduced in {Eq.~\\textbf{\\ref{{eqn:asympdefs}}}}. \n}\n\\label{fig:FlowPower}\n\\end{figure*}\n\n\n\n\\newpage\n\\setcounter{page}{1}\n\\setcounter{equation}{0}\n\\setcounter{section}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\n\\centerline{\\LARGE \\textbf{Supplementary Information}}\n\\section{1. ${C_A}$ induced by turbulent mixing}\nIn this section, we present the details for calculating the equivalent ${C_A}$ from analyses presented in the literature.\nThese results are summarized in Table~\\textbf{SI.1} and plotted in Figure~\\ref{fig:Schematic} of the article.\nAll estimates pertained to arrays of wind turbines, therefore the density of the fluid ranged from $\\rho=1.1-1.2$ kg/m$^3$ depending on the source.\n\n\\noindent\n{\\bf a. Calaf, et al, (2010)} \\cite{Calaf2010}:\nThe article simulates the fully developed wind turbine atmospheric boundary layer for pressure-gradient-driven flow around a rectangular array of turbines.\nPeriodic boundary conditions in both streamwise and spanwise direction imply simulation of an infinite array. \nThe turbines are modeled as actuator disks.\nThe spacing between turbines is 7.85 diameters in the streamwise and 5.23 in the spanwise direction.\nThe power extracted by the turbines per unit ground area is presented in terms of the friction velocity $u_*$ to be ${\\dot{W}}/{A_\\text{array}}=4.93/\\rho u_*^3$.\nThe wind speed at hub height in the absence of the turbines is $U=$17.3$u_*$, and it varied from 15.9$u_*$ to 18.8$u_*$ over the actuator disk diameter.\nBased on this data, the mean ${C_A}$ is calculated to be $1.9 \\times 10^{-3}$. \nThe error in this estimate arises due to the variation of the wind speed over the actuator disk.\nUsing the extremes of the wind speed the range of ${C_A}$ is estimated to be between $1.5 \\times 10^{-3}$ and $2.4 \\times 10^{-3}$.\n\n{\\bf b. Miller, et al, (2015)} \\cite{Miller2015}: \nThe article simulates atmospheric flow on the national scale in the presence of wind turbines over 112,320 km$^2$ in Kansas. \nThey report a maximum vertical kinetic energy flux of 1.1 W/m$^2$ over a region of the wind farm away from the edges with a first to third quantile variation from 0.375 W/m$^2$ to 1.55 W/m$^2$.\nThey postulate that their results are independent of the size of the farm, and therefore this kinetic energy flux represents the limit on the power conversion by the wind turbines.\nThe distribution of mean wind speed at hub height is reported, and can be closely approximated by a normal distribution with mean $\\mu=8$ m/s and standard deviation $\\sigma=2.9$ m/s.\nWe use this distribution to determine the distribution of $U^3$, which enters the definition of ${C_A}$.\nThe mean $U^3$, where $U$ is a normally distributed random variable is $\\mu^3 + 3 \\mu \\sigma^2$ = 714 m$^3$/s$^3$.\nBased on this information, we estimate ${C_A} = 2.7 \\times 10^{-3}$ using the mean values.\nWe also remark that, in addition to turbulent transport, detailed atmospheric dynamics on the national scale were part of this simulation. \nParameters such as the wind speed at hub height varied with time, and so did the power production. \n\n\\noindent\n{\\bf c. Cal, et al, (2010)} \\cite{Cal2010}:\nThe article presents results from a wind-tunnel experiment simulating a $3\\times 3 $ array of wind turbines. \nThey report the vertical flux of kinetic energy, however, the array may not be large enough to simulate a fully developed boundary layer.\nThe wind speed, in the absence of energy conversion, at hub height was maintained at 7 m/s, and varied between 6.2 m/s and 7.3 m/s across the rotor diameter.\nUsing the vertical kinetic energy flux in to the array, and ignoring the power production by the turbines in the front of the array facilitates a quantification of the redirected kinetic energy flux that replenishes the wake deficit.\nBecause of the small size of the array, this case provides insight into any departure of the kinetic energy redirection from the fully developed cases described in the previous two cases.\nA vertical kinetic energy flux of 1.8 W/m$^2$ was estimated using particle image velocimetry. \nBased on this information, we estimate the mean ${C_A}=8.89 \\times 10^{-3}$, and using the variation of the wind speed across the rotor derive a range for ${C_A}$ from $8.0\\times 10^{-3}$ to $1.3 \\times 10^{-2}$.\n\n\\noindent\n{\\bf d. Kinzel, et al, (2012)} \\cite{Kinzel2012a}:\nThe article reports results from a vertical axis wind turbine array with 9 pairs of counter-rotating turbines arranged in a $3\\times 3$ array installed in the field.\nFlow within and around the array was characterized using ultrasonic anemometers placed at various locations in the array.\nThe mean wind speed above the turbines is reported to be 8.05 m/s (no information about the variation of this quantity was reported).\nThe authors report a vertical kinetic energy flux that varies from 2.2 W/m$^2$ at the front of the array to 3.4 W/m$^2$ near the back of the array.\nBased on this information, we estimate ${C_A}$ to be in the range from $7.1 \\times 10^{-3}$ $1.1 \\times 10^{-2}$ with a mean value of $9.09 \\times 10^{-3}$.\n\n\\noindent\n{\\bf e. MacKay (2008)} \\cite{Mackay2008}:\nThe book reports and uses a simplified analysis where each horizontal axis turbine of diameter $D$ occupies an area of $5D \\times 5D$ is a square array.\nThe turbine operates at 50\\% efficiency extracting $\\frac{1}{2} (\\frac{1}{2} \\rho U^3 \\pi D^2/4)$, which based on the ground area of ${A_\\text{array}} = 25 D^2$ yields  ${C_A} = \\pi/200 = 1.57 \\times 10^{-2}$.\nDespite the simplified nature of this analysis, given that no wind turbine array has considered installing turbine closer than $5D$, the estimate provides useful bound and insight into the origin of the small magnitude of ${C_A}$.\n\n\n\\bgroup\n\\begin{tabular}{llccccc}\n\\textbf{Reference} \t&\\textbf{Citation}& \\textbf{Mean speed} & \\textbf{Power}\t& Mean ${C_A}$    \t& Min. ${C_A}$    \t& Max. ${C_A}$    \t\\\\\nCalaf, et al, (2010)\t& \\cite{Calaf2010}  &   17.3 $u_*$\t& 4.93/$\\rho u_*^3$\t& $1.9  \\times 10^{-3}$ & $1.5 \\times 10^{-3}$ & $2.4 \\times 10^{-3}$   \\\\ \nMiller, et al, (2015) \t& \\cite{Miller2015} &\t8  m/s\t\t&\t1.1 W/m$^2$ \t& $3.7  \\times 10^{-3}$ & $2.8 \\times 10^{-3}$ & $3.2 \\times 10^{-3}$ \t\\\\\nCal, et al, (2010)    \t& \\cite{Cal2010} \t&\t7 m/s\t& \t1.8 W/m$^2$ \t& $8.9  \\times 10^{-3}$ & $8.0 \\times 10^{-3}$ & $1.3 \\times 10^{-2}$ \t\\\\\nKinzel, et al, (2012) \t& \\cite{Kinzel2012a}& 8.05 m/s\t\t& \t3.4 W/m$^2$\t& $9.1  \\times 10^{-3}$ & $7.1 \\times 10^{-3}$ & $1.1 \\times 10^{-2}$ \t\\\\\nMacKay (2008)         \t& \\cite{Mackay2008}\t& 6 m/s\t\t&\t2.2 W/m$^2$\t& $1.57 \\times 10^{-2}$ & -\t\t       & - \t\\\\\nChurchfield, et al, (2015) & \\cite{Churchfield2015} & 9 m/s\t& \t5.58 MW\t\t& $2.9  \\times 10^{-2}$ & - & - \t\\\\\n \\multicolumn{3}{c}{(same as above, with yaw manipulation)} \t&\t6.03 MW\t\t& $3.1  \\times 10^{-2}$ & - & -\n\\end{tabular}\n\\egroup\n\\vspace{2mm}\n\\centerline{\\textbf{Table SI.1:} {\\sf \\small Summary of our calculation of ${C_A}$ from the literature.}}\n\n\n\\vspace{2mm} \nThe next set of examples treat an array geometry sufficiently different from the one we consider, and a direct comparison of the ${C_A}$ with the previous examples or with our results can not be justified.\nNevertheless, we find estimating the ${C_A}$ for the following cases useful in their own right, especially because an redirection of kinetic energy flux was demonstrated by systematically deflecting the wake away from downstream turbines.\n\n\\noindent \n{\\bf a. Churchfield, et al, (2015)} \\cite{Churchfield2015}:\nThe article reports results from a computational investigation of five wind turbines installed in a straight line along the prevailing wind direction. \nEach turbine is 115 m is diameter, and the inter-turbine separation is 1008 m, which implies a ground plane \\emph{or} vertical area of $4\\times 1008 \\text{ m} \\times 115 \\text{ m}= 463,680 \\text{ m}^2$ .\nWe use this area as our reference area.\nThey simulate turbines pointing directly into, as well as yawed 5$^\\circ$, 15$^\\circ$, and 25$^\\circ$ to the wind. \n\nThe wind speed at hub height is 9 m/s, and the first (unwaked) turbine generates 1.87 MW. \nThey report that in the un-yawed configuration, the turbine farm generates 59.7\\% of the power five independent unwaked turbines would generate, which implies a total production of 5.58 MW.\nIn this configuration, ${C_A} = 2.87 \\times 10^{-2}$.\n\n\\noindent \n{\\bf a$^*$. Churchfield, et al, (2015)} \\cite{Churchfield2015}:\nThe group also investigated and reported an increase in the power production when the turbines in the array were yawed to the incoming flow.\nThe total increase was 8\\% upon a yaw misalignment of 25$^\\circ$.\nThis increases ${C_A}$ to ${C_A} = 3.10 \\times 10^{-2}$.\n\n\\section{2. No Energy conversion with bound vorticity alone}\nThe asymptotic far-field velocity due to the bound vorticity distribution is \n\n", "index": 19, "text": "\\begin{align}\n\\begin{split}\n {\\boldsymbol{u}}({\\boldsymbol{x}}) \\sim U{\\hat{\\boldsymbol{x}}} &+ \\dfrac{\\Gamma_1}{2 \\pi |{\\boldsymbol{x}}|} {\\hat{\\boldsymbol{\\theta}}} + O\\left( \\dfrac{1}{|{\\boldsymbol{x}}|^2} \\right)\n                      \n\\end{split}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\begin{split}\\displaystyle{\\boldsymbol{u}}({\\boldsymbol{x}})\\sim U%&#10;{\\hat{\\boldsymbol{x}}}&amp;\\displaystyle+\\dfrac{\\Gamma_{1}}{2\\pi|{\\boldsymbol{x}}|%&#10;}{\\hat{\\boldsymbol{\\theta}}}+O\\left(\\dfrac{1}{|{\\boldsymbol{x}}|^{2}}\\right)%&#10;\\par&#10;\\end{split}\" display=\"inline\"><mtable columnspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mi>𝒖</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∼</mo><mrow><mi>U</mi><mo>⁢</mo><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi mathvariant=\"normal\">Γ</mi><mn>1</mn></msub><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝒙</mi><mo stretchy=\"false\">|</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mover accent=\"true\"><mi>𝜽</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow><mo>+</mo><mrow><mi>O</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝒙</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThe energy extracted by the array can be found by integrating the normal component of the kinetic energy flux along any closed curve bounding the array.\nIf the contour is chosen to be a circle centered at the origin, the normal to the curve is along the unit radial vector ${\\hat{\\boldsymbol{r}}}$, and the terms ${\\hat{\\boldsymbol{x}}} \\cdot {\\hat{\\boldsymbol{r}}}$, ${\\hat{\\boldsymbol{\\theta}}}\\cdot{\\hat{\\boldsymbol{r}}}$ and $({\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{\\theta}}}) ({\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{r}}})$ integrate exactly to zero.\nTherefore, the leading order contribution to the kinetic energy integral appears to be $O(1/R)$.\nSince the value of this integral is independent of the specific contour chosen to evaluate the integral, as long as it encloses the array, taking larger and larger circles in the limit $R\\to\\infty$ shows that the remaining terms also integrate to zero.\n\n\n\\begin{figure*}[!h]\n\\centerline{\\includegraphics{Figures/LineIntegral}}\n\\caption{Local coordinate system for evaluating the line integral {Eq.~\\textbf{\\ref{{eqn:biotsavartpsi}}}} over a linear segment.}\n\\label{fig:LineIntegral}\n\\end{figure*}\n\n\\section{3. Solution using complex variables}\nThe function\n\n", "itemtype": "equation", "pos": 46120, "prevtext": "\nwhere $\\Gamma_1$ is the net bound vorticity, and ${\\hat{\\boldsymbol{\\theta}}}$ is the unit vector along the azimuthal direction in a polar coordinate system centered at the array.\nThe flux of kinetic energy is\n\n", "index": 21, "text": "\\begin{align}\n \\dfrac{1}{2} \\rho |{\\boldsymbol{u}}|^2 {\\boldsymbol{u}} \\sim \\dfrac{1}{2} \\rho \\left[U^3 {\\hat{\\boldsymbol{x}}} + \\dfrac{U^2\\Gamma_1 }{2 \\pi |{\\boldsymbol{x}}|} \\left( {\\hat{\\boldsymbol{\\theta}}} + 2 {\\hat{\\boldsymbol{x}}} ({\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{\\theta}}}) \\right) + O\\left( \\dfrac{1}{|{\\boldsymbol{x}}|^2} \\right)\\right].\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dfrac{1}{2}\\rho|{\\boldsymbol{u}}|^{2}{\\boldsymbol{u}}\\sim\\dfrac{%&#10;1}{2}\\rho\\left[U^{3}{\\hat{\\boldsymbol{x}}}+\\dfrac{U^{2}\\Gamma_{1}}{2\\pi|{%&#10;\\boldsymbol{x}}|}\\left({\\hat{\\boldsymbol{\\theta}}}+2{\\hat{\\boldsymbol{x}}}({%&#10;\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{\\theta}}})\\right)+O\\left(\\dfrac{1}%&#10;{|{\\boldsymbol{x}}|^{2}}\\right)\\right].\" display=\"inline\"><mrow><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝒖</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mi>𝒖</mi></mrow><mo>∼</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msup><mi>U</mi><mn>3</mn></msup><mo>⁢</mo><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msup><mi>U</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi mathvariant=\"normal\">Γ</mi><mn>1</mn></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>𝒙</mi><mo stretchy=\"false\">|</mo></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mover accent=\"true\"><mi>𝜽</mi><mo stretchy=\"false\">^</mo></mover><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover><mo>⋅</mo><mover accent=\"true\"><mi>𝜽</mi><mo stretchy=\"false\">^</mo></mover></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mrow><mi>O</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><msup><mrow><mo stretchy=\"false\">|</mo><mi>𝒙</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nof the complex variable $z=x+iy$ serves as the complex potential for the flow we seek. \nThe stream function $\\psi$ is the imaginary part of $w$. \nThe velocity field arising from this flow is\n\n", "itemtype": "equation", "pos": 47714, "prevtext": "\nThe energy extracted by the array can be found by integrating the normal component of the kinetic energy flux along any closed curve bounding the array.\nIf the contour is chosen to be a circle centered at the origin, the normal to the curve is along the unit radial vector ${\\hat{\\boldsymbol{r}}}$, and the terms ${\\hat{\\boldsymbol{x}}} \\cdot {\\hat{\\boldsymbol{r}}}$, ${\\hat{\\boldsymbol{\\theta}}}\\cdot{\\hat{\\boldsymbol{r}}}$ and $({\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{\\theta}}}) ({\\hat{\\boldsymbol{x}}}\\cdot{\\hat{\\boldsymbol{r}}})$ integrate exactly to zero.\nTherefore, the leading order contribution to the kinetic energy integral appears to be $O(1/R)$.\nSince the value of this integral is independent of the specific contour chosen to evaluate the integral, as long as it encloses the array, taking larger and larger circles in the limit $R\\to\\infty$ shows that the remaining terms also integrate to zero.\n\n\n\\begin{figure*}[!h]\n\\centerline{\\includegraphics{Figures/LineIntegral}}\n\\caption{Local coordinate system for evaluating the line integral {Eq.~\\textbf{\\ref{{eqn:biotsavartpsi}}}} over a linear segment.}\n\\label{fig:LineIntegral}\n\\end{figure*}\n\n\\section{3. Solution using complex variables}\nThe function\n\n", "index": 23, "text": "\\begin{align}\n w(z) = U z + i U \\tan{\\alpha} \\left( z - \\sqrt{z^2-L^2/4} \\right),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle w(z)=Uz+iU\\tan{\\alpha}\\left(z-\\sqrt{z^{2}-L^{2}/4}\\right),\" display=\"inline\"><mrow><mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>U</mi><mo>⁢</mo><mi>z</mi></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi>U</mi><mo>⁢</mo><mrow><mi>tan</mi><mo>⁡</mo><mi>α</mi></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>z</mi><mo>-</mo><msqrt><mrow><msup><mi>z</mi><mn>2</mn></msup><mo>-</mo><mrow><msup><mi>L</mi><mn>2</mn></msup><mo>/</mo><mn>4</mn></mrow></mrow></msqrt></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere the overbar denotes complex conjugation.\nThe flow velocity just above and below the array is\n\n", "itemtype": "equation", "pos": 47999, "prevtext": "\nof the complex variable $z=x+iy$ serves as the complex potential for the flow we seek. \nThe stream function $\\psi$ is the imaginary part of $w$. \nThe velocity field arising from this flow is\n\n", "index": 25, "text": "\\begin{align}\n\\overline{\\dfrac{{\\text{d}} w}{{\\text{d}} z}} = U + i U\\tan {\\alpha} \\left( 1 - \\dfrac{{\\bar{z}}}{\\sqrt{{\\bar{z}}^2-L^2/4}} \\right),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\overline{\\dfrac{{\\text{d}}w}{{\\text{d}}z}}=U+iU\\tan{\\alpha}\\left%&#10;(1-\\dfrac{{\\bar{z}}}{\\sqrt{{\\bar{z}}^{2}-L^{2}/4}}\\right),\" display=\"inline\"><mrow><mrow><mover accent=\"true\"><mstyle displaystyle=\"true\"><mfrac><mrow><mtext>d</mtext><mo>⁢</mo><mi>w</mi></mrow><mrow><mtext>d</mtext><mo>⁢</mo><mi>z</mi></mrow></mfrac></mstyle><mo>¯</mo></mover><mo>=</mo><mrow><mi>U</mi><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi>U</mi><mo>⁢</mo><mrow><mi>tan</mi><mo>⁡</mo><mi>α</mi></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">¯</mo></mover><msqrt><mrow><msup><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">¯</mo></mover><mn>2</mn></msup><mo>-</mo><mrow><msup><mi>L</mi><mn>2</mn></msup><mo>/</mo><mn>4</mn></mrow></mrow></msqrt></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThis expression implies the mean velocity makes an angle ${\\alpha}$ with the freestream, and the tangential speed jumps discontinuously by $2 U \\tan{\\alpha} x/\\sqrt{L^2/4-x^2}$.\nThis jump corresponds to the negative of the bound vortex sheet strength shown in {Eq.~\\textbf{\\ref{{eqn:boundvorticity}}}}.\nThe uniqueness of the solution of Laplace equation implies that the solution we present here is the only possible solution.\n\nAn example of the flow field derived using this technique is shown in Figure \\ref{fig:Schematic}~(a) of the article. \nThe flow develops two recirculation regions centered around the end points of the array $x=\\pm L/2$, and the fluid from far upstream is entrained into the array between these regions.\nThe streamline that bounds the recirculation region forms the separatrix between the flow from the far upstream that does or does not pass through the array.\nThis separatrix necessarily contains a stagnation point of the flow, the point where the flow velocity is zero.\n\n\n\nThe condition that the extreme streamlines passing through the array also pass through a stagnation point may be used to determine flow through the turbine array.\nThe location of the stagnation point, $z_0$ may be determined by using\n\n", "itemtype": "equation", "pos": 48257, "prevtext": "\nwhere the overbar denotes complex conjugation.\nThe flow velocity just above and below the array is\n\n", "index": 27, "text": "\\begin{align}\n \\overline{\\dfrac{{\\text{d}} w}{{\\text{d}} z}}\\left( z = x + i 0^{\\pm} \\right)  = U + i U \\tan{\\alpha} \\pm U \\tan{\\alpha} \\dfrac{x}{ \\sqrt{L^2/4 - x^2} }.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\overline{\\dfrac{{\\text{d}}w}{{\\text{d}}z}}\\left(z=x+i0^{\\pm}%&#10;\\right)=U+iU\\tan{\\alpha}\\pm U\\tan{\\alpha}\\dfrac{x}{\\sqrt{L^{2}/4-x^{2}}}.\" display=\"inline\"><mrow><mover accent=\"true\"><mstyle displaystyle=\"true\"><mfrac><mrow><mtext>d</mtext><mo>⁢</mo><mi>w</mi></mrow><mrow><mtext>d</mtext><mo>⁢</mo><mi>z</mi></mrow></mfrac></mstyle><mo>¯</mo></mover><mrow><mo>(</mo><mi>z</mi><mo>=</mo><mi>x</mi><mo>+</mo><mi>i</mi><msup><mn>0</mn><mo>±</mo></msup><mo>)</mo></mrow><mo>=</mo><mi>U</mi><mo>+</mo><mi>i</mi><mi>U</mi><mi>tan</mi><mi>α</mi><mo>±</mo><mi>U</mi><mi>tan</mi><mi>α</mi><mstyle displaystyle=\"true\"><mfrac><mi>x</mi><msqrt><mrow><mrow><msup><mi>L</mi><mn>2</mn></msup><mo>/</mo><mn>4</mn></mrow><mo>-</mo><msup><mi>x</mi><mn>2</mn></msup></mrow></msqrt></mfrac></mstyle><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThis condition leads to two stagnation points\n\n", "itemtype": "equation", "pos": 49675, "prevtext": "\nThis expression implies the mean velocity makes an angle ${\\alpha}$ with the freestream, and the tangential speed jumps discontinuously by $2 U \\tan{\\alpha} x/\\sqrt{L^2/4-x^2}$.\nThis jump corresponds to the negative of the bound vortex sheet strength shown in {Eq.~\\textbf{\\ref{{eqn:boundvorticity}}}}.\nThe uniqueness of the solution of Laplace equation implies that the solution we present here is the only possible solution.\n\nAn example of the flow field derived using this technique is shown in Figure \\ref{fig:Schematic}~(a) of the article. \nThe flow develops two recirculation regions centered around the end points of the array $x=\\pm L/2$, and the fluid from far upstream is entrained into the array between these regions.\nThe streamline that bounds the recirculation region forms the separatrix between the flow from the far upstream that does or does not pass through the array.\nThis separatrix necessarily contains a stagnation point of the flow, the point where the flow velocity is zero.\n\n\n\nThe condition that the extreme streamlines passing through the array also pass through a stagnation point may be used to determine flow through the turbine array.\nThe location of the stagnation point, $z_0$ may be determined by using\n\n", "index": 29, "text": "\\begin{align}\n \\overline{\\dfrac{{\\text{d}} w}{{\\text{d}} z}} (z=z_0) = U + i U\\tan {\\alpha} \\left( 1 - \\dfrac{{\\bar{z}_0}}{\\sqrt{{\\bar{z}_0}^2-L^2/4}} \\right) \\equiv 0.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\overline{\\dfrac{{\\text{d}}w}{{\\text{d}}z}}(z=z_{0})=U+iU\\tan{%&#10;\\alpha}\\left(1-\\dfrac{{\\bar{z}_{0}}}{\\sqrt{{\\bar{z}_{0}}^{2}-L^{2}/4}}\\right)%&#10;\\equiv 0.\" display=\"inline\"><mrow><mover accent=\"true\"><mstyle displaystyle=\"true\"><mfrac><mrow><mtext>d</mtext><mo>⁢</mo><mi>w</mi></mrow><mrow><mtext>d</mtext><mo>⁢</mo><mi>z</mi></mrow></mfrac></mstyle><mo>¯</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo>=</mo><msub><mi>z</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>U</mi><mo>+</mo><mi>i</mi><mi>U</mi><mi>tan</mi><mi>α</mi><mrow><mo>(</mo><mn>1</mn><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><msub><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">¯</mo></mover><mn>0</mn></msub><msqrt><mrow><mmultiscripts><mover accent=\"true\"><mi>z</mi><mo stretchy=\"false\">¯</mo></mover><mn>0</mn><none/><none/><mn>2</mn></mmultiscripts><mo>-</mo><mrow><msup><mi>L</mi><mn>2</mn></msup><mo>/</mo><mn>4</mn></mrow></mrow></msqrt></mfrac></mstyle><mo>)</mo></mrow><mo>≡</mo><mn>0</mn><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nand the stream function value at those points\n\n", "itemtype": "equation", "pos": 49902, "prevtext": "\nThis condition leads to two stagnation points\n\n", "index": 31, "text": "\\begin{align}\n \\dfrac{z_0}{L} = \\pm \\dfrac{1}{2} \\dfrac{1-i\\cot{\\alpha} }{\\sqrt{-i\\cot{\\alpha} (2-i\\cot{\\alpha})}}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dfrac{z_{0}}{L}=\\pm\\dfrac{1}{2}\\dfrac{1-i\\cot{\\alpha}}{\\sqrt{-i%&#10;\\cot{\\alpha}(2-i\\cot{\\alpha})}}.\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi>z</mi><mn>0</mn></msub><mi>L</mi></mfrac></mstyle><mo>=</mo><mrow><mo>±</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mn>1</mn><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>α</mi></mrow></mrow></mrow><msqrt><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>α</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>α</mi></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt></mfrac></mstyle></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThe difference between the two values of stream function, after representing it in real variables, is the flow rate through the array given by {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}}.\n\n\\section{4. Numerical method}\n\nFor a given ${\\alpha}$ and $V$, the unknowns describing the flow are the bound and free vorticity distributions.\nThe bound vorticity is localized to the turbine array $-L/2<x<L/2$, and described as ${\\omega_b} = {\\omega_{b0}}(x) \\delta(y)$.\nThe free vorticity is represented in the form of sheets of strength $\\Omega = (U-V)$ along two streamlines along unknown curves ${\\boldsymbol{x}}_n(s)$, $n=1,2$, so ${\\omega_f}({\\boldsymbol{x}}) = \\Omega (\\delta({\\boldsymbol{x}}-{\\boldsymbol{x}}_1) - \\delta({\\boldsymbol{x}}-{\\boldsymbol{x}}_2))$, where $0<s<\\infty$ parametrizes the curves.\nThe Biot-Savart integral for stream function in terms of these unknowns may be written as\n\n", "itemtype": "equation", "pos": 50076, "prevtext": "\nand the stream function value at those points\n\n", "index": 33, "text": "\\begin{align}\n \\dfrac{\\psi(z=z_0)}{UL} = \\pm \\dfrac{1}{2} \\Re \\left(\\sqrt{-1-2i\\tan{\\alpha}} \\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\dfrac{\\psi(z=z_{0})}{UL}=\\pm\\dfrac{1}{2}\\Re\\left(\\sqrt{-1-2i\\tan%&#10;{\\alpha}}\\right).\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>ψ</mi><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo>=</mo><msub><mi>z</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac></mstyle><mo>=</mo><mrow><mo>±</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mi mathvariant=\"normal\">ℜ</mi><mo>⁡</mo><mrow><mo>(</mo><msqrt><mrow><mrow><mo>-</mo><mn>1</mn></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mrow><mi>tan</mi><mo>⁡</mo><mi>α</mi></mrow></mrow></mrow></msqrt><mo>)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere substituting the localized forms of ${\\omega}$ converts the area integral to line integrals.\nThe turbine array  and the bound vorticity integral is discretized along Chebyshev points $x'_k = L\\cos\\theta_k/2$, where $\\theta_k = \\pi k/N$, $k=0,1,\\dots, N$.\nFurther, the stream function at the Chebyshev points $x'_j$ due to the bound vorticity is represented as a matrix-vector product using a spectral approximation as\n\n", "itemtype": "equation", "pos": 51075, "prevtext": "\nThe difference between the two values of stream function, after representing it in real variables, is the flow rate through the array given by {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}}.\n\n\\section{4. Numerical method}\n\nFor a given ${\\alpha}$ and $V$, the unknowns describing the flow are the bound and free vorticity distributions.\nThe bound vorticity is localized to the turbine array $-L/2<x<L/2$, and described as ${\\omega_b} = {\\omega_{b0}}(x) \\delta(y)$.\nThe free vorticity is represented in the form of sheets of strength $\\Omega = (U-V)$ along two streamlines along unknown curves ${\\boldsymbol{x}}_n(s)$, $n=1,2$, so ${\\omega_f}({\\boldsymbol{x}}) = \\Omega (\\delta({\\boldsymbol{x}}-{\\boldsymbol{x}}_1) - \\delta({\\boldsymbol{x}}-{\\boldsymbol{x}}_2))$, where $0<s<\\infty$ parametrizes the curves.\nThe Biot-Savart integral for stream function in terms of these unknowns may be written as\n\n", "index": 35, "text": "\\begin{align}\n\\begin{split}\n\\psi({\\boldsymbol{x}}; {\\boldsymbol{x}}_n, {\\omega_{b0}}) = -Uy + \\int_{-L/2}^{L/2} \\dfrac{{\\omega_{b0}}(x') \\log |{\\boldsymbol{x}}-x'{\\hat{\\boldsymbol{x}}}|}{2\\pi}~{\\text{d}} x' \\\\\n         + \\Omega \\int_0^\\infty ~\\dfrac{ \\log |{\\boldsymbol{x}}-{\\boldsymbol{x}}_1|~x'_1(s) - \\log |{\\boldsymbol{x}} - {\\boldsymbol{x}}_2 |~x'_2(s)}{2\\pi}~{\\text{d}} s  \n\\end{split}\n\\label{eqn:biotsavartpsi}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\begin{split}\\displaystyle\\psi({\\boldsymbol{x}};{\\boldsymbol{x}}_%&#10;{n},{\\omega_{b0}})=-Uy+\\int_{-L/2}^{L/2}\\dfrac{{\\omega_{b0}}(x^{\\prime})\\log|{%&#10;\\boldsymbol{x}}-x^{\\prime}{\\hat{\\boldsymbol{x}}}|}{2\\pi}~{}{\\text{d}}x^{\\prime%&#10;}\\\\&#10;\\displaystyle+\\Omega\\int_{0}^{\\infty}~{}\\dfrac{\\log|{\\boldsymbol{x}}-{%&#10;\\boldsymbol{x}}_{1}|~{}x^{\\prime}_{1}(s)-\\log|{\\boldsymbol{x}}-{\\boldsymbol{x}%&#10;}_{2}|~{}x^{\\prime}_{2}(s)}{2\\pi}~{}{\\text{d}}s\\end{split}\" display=\"inline\"><mtable rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒙</mi><mo>;</mo><msub><mi>𝒙</mi><mi>n</mi></msub><mo>,</mo><msub><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mi>U</mi><mo>⁢</mo><mi>y</mi></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mrow><mi>L</mi><mo>/</mo><mn>2</mn></mrow></mrow><mrow><mi>L</mi><mo>/</mo><mn>2</mn></mrow></msubsup></mstyle><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒙</mi><mo>-</mo><mrow><msup><mi>x</mi><mo>′</mo></msup><mo>⁢</mo><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle></mpadded><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><msup><mi>x</mi><mo>′</mo></msup></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup></mstyle></mpadded><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒙</mi><mo>-</mo><msub><mi>𝒙</mi><mn>1</mn></msub></mrow><mo rspace=\"5.8pt\" stretchy=\"false\">|</mo></mrow><mo>⁢</mo><msubsup><mi>x</mi><mn>1</mn><mo>′</mo></msubsup></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒙</mi><mo>-</mo><msub><mi>𝒙</mi><mn>2</mn></msub></mrow><mo rspace=\"5.8pt\" stretchy=\"false\">|</mo></mrow><mo>⁢</mo><msubsup><mi>x</mi><mn>2</mn><mo>′</mo></msubsup></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle></mpadded><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><mi>s</mi></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\n\n\nThe Biot-Savart line integral {Eq.~\\textbf{\\ref{{eqn:biotsavartpsi}}}} for free vorticity is evaluated by discretizing the curve ${\\boldsymbol{x}}_n$ in to $N_n$ linear segments.\nThe total integral is a sum of the contributions from individual segments.\nThe integral over individual segments can be evaluated analytically.\n\nFor evaluating the integral over one segment with unit vortex sheet strength, we define a local coordinate system with origin at the center of the segment and the $x$ axis aligned along its length, as shown in Figure \\ref{fig:LineIntegral}. \nThe contribution to the integral from this segment for any target point $(x,y)$ in the local coordinate system may be written as\n\n", "itemtype": "equation", "pos": 51929, "prevtext": "\nwhere substituting the localized forms of ${\\omega}$ converts the area integral to line integrals.\nThe turbine array  and the bound vorticity integral is discretized along Chebyshev points $x'_k = L\\cos\\theta_k/2$, where $\\theta_k = \\pi k/N$, $k=0,1,\\dots, N$.\nFurther, the stream function at the Chebyshev points $x'_j$ due to the bound vorticity is represented as a matrix-vector product using a spectral approximation as\n\n", "index": 37, "text": "\\begin{align}\n\\int_{-L/2}^{L/2} \\dfrac{{\\omega_{b0}}(x') \\log |x'_j-x'|}{2\\pi}~{\\text{d}} x' \\approx \\sum_{k} M_{jk} {\\omega_{b0}}(x'_k)\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\int_{-L/2}^{L/2}\\dfrac{{\\omega_{b0}}(x^{\\prime})\\log|x^{\\prime}_%&#10;{j}-x^{\\prime}|}{2\\pi}~{}{\\text{d}}x^{\\prime}\\approx\\sum_{k}M_{jk}{\\omega_{b0}%&#10;}(x^{\\prime}_{k})\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mrow><mi>L</mi><mo>/</mo><mn>2</mn></mrow></mrow><mrow><mi>L</mi><mo>/</mo><mn>2</mn></mrow></msubsup></mstyle><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msubsup><mi>x</mi><mi>j</mi><mo>′</mo></msubsup><mo>-</mo><msup><mi>x</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">|</mo></mrow></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle></mpadded><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><msup><mi>x</mi><mo>′</mo></msup></mrow></mrow><mo>≈</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder></mstyle><mrow><msub><mi>M</mi><mrow><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub><mo>⁢</mo><msub><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>x</mi><mi>k</mi><mo>′</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere $s$ is the arc-length coordinate along the segment. \nThis integral may be evaluated to be\n\n", "itemtype": "equation", "pos": 52775, "prevtext": "\n\n\nThe Biot-Savart line integral {Eq.~\\textbf{\\ref{{eqn:biotsavartpsi}}}} for free vorticity is evaluated by discretizing the curve ${\\boldsymbol{x}}_n$ in to $N_n$ linear segments.\nThe total integral is a sum of the contributions from individual segments.\nThe integral over individual segments can be evaluated analytically.\n\nFor evaluating the integral over one segment with unit vortex sheet strength, we define a local coordinate system with origin at the center of the segment and the $x$ axis aligned along its length, as shown in Figure \\ref{fig:LineIntegral}. \nThe contribution to the integral from this segment for any target point $(x,y)$ in the local coordinate system may be written as\n\n", "index": 39, "text": "\\begin{align}\n I(x, y; w) = \\int_{-w}^w ~ \\dfrac{ \\log ((x-s)^2+y^2)}{4\\pi} {\\text{d}} s,\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle I(x,y;w)=\\int_{-w}^{w}~{}\\dfrac{\\log((x-s)^{2}+y^{2})}{4\\pi}{%&#10;\\text{d}}s,\" display=\"inline\"><mrow><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo>;</mo><mi>w</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi>w</mi></mrow><mi>w</mi></msubsup></mstyle></mpadded><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><mi>s</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>y</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle><mo>⁢</mo><mtext>d</mtext><mo>⁢</mo><mi>s</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThe stream function integral from the bound vorticity is also evaluated outside the turbine array by approximating ${\\omega_{b0}}$ to be a constant on each segment between the Chebyshev points.\n\nThe mean velocity components tangential and normal to the array are\n\n", "itemtype": "equation", "pos": 52973, "prevtext": "\nwhere $s$ is the arc-length coordinate along the segment. \nThis integral may be evaluated to be\n\n", "index": 41, "text": "\\begin{align}\n I = \\dfrac{1}{4\\pi} \\left[ (x+w) \\log ((x+w)^2 + y^2) - (x-w) \\log((x-w)^2+y^2) - 4w \n + 2 y \\left( \\text{arctan} \\dfrac{x+w}{y} - \\text{arctan} \\dfrac{x-w}{y}  \\right) \\right].\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle I=\\dfrac{1}{4\\pi}\\left[(x+w)\\log((x+w)^{2}+y^{2})-(x-w)\\log((x-w%&#10;)^{2}+y^{2})-4w+2y\\left(\\text{arctan}\\dfrac{x+w}{y}-\\text{arctan}\\dfrac{x-w}{y%&#10;}\\right)\\right].\" display=\"inline\"><mrow><mrow><mi>I</mi><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>+</mo><mi>w</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>+</mo><mi>w</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>y</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><mi>w</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><mi>w</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>y</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mi>w</mi></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mtext>arctan</mtext><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>x</mi><mo>+</mo><mi>w</mi></mrow><mi>y</mi></mfrac></mstyle></mrow><mo>-</mo><mrow><mtext>arctan</mtext><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>x</mi><mo>-</mo><mi>w</mi></mrow><mi>y</mi></mfrac></mstyle></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nwhere the limit is approximated numerically using a small value $10^{-3}$ for $\\epsilon$.\n\nThe bound vorticity ${\\omega_{b0}}(x'_k)$ is chosen such that $v = u \\tan {\\alpha}$ at ${\\boldsymbol{x}}=x'_k {\\hat{\\boldsymbol{x}}}$.\nThis criteria does not uniquely determine the bound vorticity distribution but instead leads to a one-parameter family. \nThis characteristic is analogous to the arbitrariness of the net circulation in thin airfoil theory; an amount $K/\\sqrt{L^2/4-x^2}$ added to the bound vorticity for arbitrary $K$ does not change the flow direction at the deflector array.\nWe choose the $K$ which leads to zero circulation in the far-field; our results are insensitive to other choices of $K$.\n\nThe free vorticity strength is constant along streamlines, implying that\n\n", "itemtype": "equation", "pos": 53441, "prevtext": "\nThe stream function integral from the bound vorticity is also evaluated outside the turbine array by approximating ${\\omega_{b0}}$ to be a constant on each segment between the Chebyshev points.\n\nThe mean velocity components tangential and normal to the array are\n\n", "index": 43, "text": "\\begin{align}\nu = \\lim_{\\epsilon \\to 0} \\dfrac{\\psi(x, \\epsilon) - \\psi(x, - \\epsilon)}{2\\epsilon}, \\quad\nv = \\dfrac{\\partial \\psi}{\\partial x},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle u=\\lim_{\\epsilon\\to 0}\\dfrac{\\psi(x,\\epsilon)-\\psi(x,-\\epsilon)}%&#10;{2\\epsilon},\\quad v=\\dfrac{\\partial\\psi}{\\partial x},\" display=\"inline\"><mrow><mrow><mrow><mi>u</mi><mo>=</mo><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>ϵ</mi><mo>→</mo><mn>0</mn></mrow></munder><mo>⁡</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>ϵ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mrow><mo>-</mo><mi>ϵ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>ϵ</mi></mrow></mfrac></mstyle></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>v</mi><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>ψ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mfrac></mstyle></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\n\n\nThe self-consistent free vortex sheet is determined iteratively starting from an initial guess ${\\boldsymbol{x}}_n^0$ and subsequent iterates determined as follows.\nThe stream function is evaluted on a fixed Cartesian grid and GNU Octave's \\cite{Eaton2014} \\texttt{contour} function is used to find an intermediate guess for the streamlines $\\tilde{{\\boldsymbol{x}}}_n^{q+1}$,\n\n", "itemtype": "equation", "pos": 54378, "prevtext": "\nwhere the limit is approximated numerically using a small value $10^{-3}$ for $\\epsilon$.\n\nThe bound vorticity ${\\omega_{b0}}(x'_k)$ is chosen such that $v = u \\tan {\\alpha}$ at ${\\boldsymbol{x}}=x'_k {\\hat{\\boldsymbol{x}}}$.\nThis criteria does not uniquely determine the bound vorticity distribution but instead leads to a one-parameter family. \nThis characteristic is analogous to the arbitrariness of the net circulation in thin airfoil theory; an amount $K/\\sqrt{L^2/4-x^2}$ added to the bound vorticity for arbitrary $K$ does not change the flow direction at the deflector array.\nWe choose the $K$ which leads to zero circulation in the far-field; our results are insensitive to other choices of $K$.\n\nThe free vorticity strength is constant along streamlines, implying that\n\n", "index": 45, "text": "\\begin{align}\n \\psi({\\boldsymbol{x}}_n; {\\boldsymbol{x}}_n, {\\omega_{b0}}) = \\text{constant}, \\qquad n=1,2.\n \\label{eqn:consistency}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\psi({\\boldsymbol{x}}_{n};{\\boldsymbol{x}}_{n},{\\omega_{b0}})=%&#10;\\text{constant},\\qquad n=1,2.\" display=\"inline\"><mrow><mrow><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒙</mi><mi>n</mi></msub><mo>;</mo><msub><mi>𝒙</mi><mi>n</mi></msub><mo>,</mo><msub><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mtext>constant</mtext></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mi>n</mi><mo>=</mo><mrow><mn>1</mn><mo>,</mo><mn>2</mn></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nThe constant is chosen using a bisection algorithm by detecting whether the streamlines form closed contours or extend to far downstream to determine streamlines bounded by the recirculation region at the turbine array ends.\nA fractional update ${\\boldsymbol{x}}_n^{q+1} = \\theta \\tilde{{\\boldsymbol{x}}}_n^{q+1} +(1-\\theta) {\\boldsymbol{x}}_n^q$, with $0<\\theta \\le 1$, is used to ensure convergence.\n\n\n\\section{5. Length of the recirculation region}\nIn this section, we provide more details about dependence of the length of the recirculation region on the flow parameters. \nResults from our numerical solutions characterizing this length is presented in figure \\ref{fig:Recirc}.\nThe quantity of interest is the length, $\\ell_0$ without energy extraction and $\\ell$ with energy extraction, of the segment on the array between the two recirculation regions. \nFigure \\ref{fig:Recirc}~(a) shows the dependence of the length of the array occupied by the recirculation region scaled by the array length.\n\nThe length $\\ell_0$ may be determined analytically by using {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}} in the article and the relation\n\n", "itemtype": "equation", "pos": 54902, "prevtext": "\n\n\nThe self-consistent free vortex sheet is determined iteratively starting from an initial guess ${\\boldsymbol{x}}_n^0$ and subsequent iterates determined as follows.\nThe stream function is evaluted on a fixed Cartesian grid and GNU Octave's \\cite{Eaton2014} \\texttt{contour} function is used to find an intermediate guess for the streamlines $\\tilde{{\\boldsymbol{x}}}_n^{q+1}$,\n\n", "index": 47, "text": "\\begin{align}\n \\psi(\\tilde{{\\boldsymbol{x}}}_n^{q+1}; {\\boldsymbol{x}}_n^{q}, {\\omega_{b0}}^{q}) = \\text{constant}, \\qquad n=1,2, \\quad q=1,2,\\dots.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\psi(\\tilde{{\\boldsymbol{x}}}_{n}^{q+1};{\\boldsymbol{x}}_{n}^{q},%&#10;{\\omega_{b0}}^{q})=\\text{constant},\\qquad n=1,2,\\quad q=1,2,\\dots.\" display=\"inline\"><mrow><mrow><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mover accent=\"true\"><mi>𝒙</mi><mo stretchy=\"false\">~</mo></mover><mi>n</mi><mrow><mi>q</mi><mo>+</mo><mn>1</mn></mrow></msubsup><mo>;</mo><msubsup><mi>𝒙</mi><mi>n</mi><mi>q</mi></msubsup><mo>,</mo><mmultiscripts><mi>ω</mi><mrow><mi>b</mi><mo>⁢</mo><mn>0</mn></mrow><none/><none/><mi>q</mi></mmultiscripts><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mtext>constant</mtext></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mrow><mi>n</mi><mo>=</mo><mrow><mn>1</mn><mo>,</mo><mn>2</mn></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mi>q</mi><mo>=</mo><mrow><mn>1</mn><mo>,</mo><mn>2</mn><mo>,</mo><mi mathvariant=\"normal\">…</mi></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05462.tex", "nexttext": "\nBased on this relation, the two asymptotic limits may be deduced.\nIn the limit of weak deflection, $\\ell_0/L \\approx 1-\\tan^2\\alpha/2$, and in the limit of strong deflection $\\ell_0/L \\approx 1/\\sqrt{\\tan{\\alpha}}$. \nThese asymptotes are also shown in Figure \\ref{fig:Recirc}~(a).\n\nFor wake speed less than the free stream, the recirculation region grows, and consequently $\\ell$ is smaller than $\\ell_0$.\nThis dependence of $\\ell$ on $V/U$ is shown in Figure \\ref{fig:Recirc}~(b).\nIn the weak deflection limit, the recirculation region grows to a small but finite size compared to the array length.\nIn the strong defection limit, the recirculation region grows and $\\ell$ decreases prominently below $\\ell_0$. \nThis growth in the size of the recirculation region is underlies the quantitative difference between LBJ and our results.\n\n\n\\begin{figure*}\n\\centerline{\\includegraphics[height=55mm]{Figures/Recirc}}\n\\caption{\nCharacterization of the length $\\ell_0$ without energy conversion and $\\ell$ with energy conversion of the region on the turbine between the two recirculation regions. \n(a) The length of array occupied by the recirculation region $L-\\ell_0$ scaled by the array length $L$ is plotted as a function of the deflector slope, when the flow is merely deflected but no energy is extracted. \nIn the weak deflection limit, the asymptote $\\ell_0 \\approx L(1- \\tan^2{\\alpha}/2)$ is also shown. \nIn the strong deflection limit, $\\ell_0/L \\approx 1/\\sqrt{\\tan {\\alpha}}$, and the recirculation region occupies almost the whole length of the array.\n(b) The reduction in the length $\\ell$ compared to its value, $\\ell_0$,  without energy extraction.\nAs the wake velocity reduces below the free stream value, the size of the recirculation region grows, and the length of the region in between shrinks. \nThis reduction is a small but finite in the limit of weak deflection, and the reduction is prominent in the limit of strong deflection.\n}\n\\label{fig:Recirc}\n\\end{figure*}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 56193, "prevtext": "\nThe constant is chosen using a bisection algorithm by detecting whether the streamlines form closed contours or extend to far downstream to determine streamlines bounded by the recirculation region at the turbine array ends.\nA fractional update ${\\boldsymbol{x}}_n^{q+1} = \\theta \\tilde{{\\boldsymbol{x}}}_n^{q+1} +(1-\\theta) {\\boldsymbol{x}}_n^q$, with $0<\\theta \\le 1$, is used to ensure convergence.\n\n\n\\section{5. Length of the recirculation region}\nIn this section, we provide more details about dependence of the length of the recirculation region on the flow parameters. \nResults from our numerical solutions characterizing this length is presented in figure \\ref{fig:Recirc}.\nThe quantity of interest is the length, $\\ell_0$ without energy extraction and $\\ell$ with energy extraction, of the segment on the array between the two recirculation regions. \nFigure \\ref{fig:Recirc}~(a) shows the dependence of the length of the array occupied by the recirculation region scaled by the array length.\n\nThe length $\\ell_0$ may be determined analytically by using {Eq.~\\textbf{\\ref{{eqn:zeroflow}}}} in the article and the relation\n\n", "index": 49, "text": "\\begin{align}\n U \\tan {\\alpha} \\ell_0 = Q_0.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle U\\tan{\\alpha}\\ell_{0}=Q_{0}.\" display=\"inline\"><mrow><mrow><mrow><mi>U</mi><mo>⁢</mo><mrow><mi>tan</mi><mo>⁡</mo><mrow><mi>α</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">ℓ</mi><mn>0</mn></msub></mrow></mrow></mrow><mo>=</mo><msub><mi>Q</mi><mn>0</mn></msub></mrow><mo>.</mo></mrow></math>", "type": "latex"}]