[{"file": "1601.06063.tex", "nexttext": "\nwith a 5 percent uncertainty. This fitting function is a good fit to the\nsplashback radii of dark matter halos in simulations used in\n\\citet{More:2015}\\footnote{The fitting function was calibrated in the redshift\nrange [0, 4].}, but corresponds to the mean profiles instead of the median. The grey star\ncorresponds to the typical expected value of $\\Gamma$ for halos in the sample,\nestimated from the simulations, while the orange and purple stars similarly\ncorrespond to the average $\\Gamma$ for the best-case simulation subsamples with\nthe fastest and slowest accretion rates (see above). The data seem to prefer a\nmuch smaller splashback radius for each of our cluster subsamples\n(${R_{\\rm sp}^{\\rm 3d}}/{R_{\\rm 200m}}=0.675^{+0.024}_{-0.021}$ and $0.955\\pm0.035$ for the high- and\nthe low-${c_{\\rm gal}}$ subsamples, respectively), even when compared to the splashback\nradius corresponding to halos with typical $\\Gamma$ for our mass scales. \n\n\\subsection{Does dynamical friction result in a smaller splashback radius?}\n\\label{sec:dyn}\n\nSo far in our analysis, we have identified the splashback radius using the galaxy distribution around\nour cluster subsamples. The splashback radius of galaxies could be different\nfrom that of dark matter due to dynamical friction acting on the subhalos that\nhost our galaxies, provided these subhalos are sufficiently massive \\citep{Adhikari:2016}. In\nwhat follows, we show that the steepening of the three dimensional density\nprofiles for both matter and subhalos that host our fiducial photometric sample\nof galaxies are expected to occur at similar locations. \n\nFor this purpose, we again make use of the halo and subhalo catalogs from the\nMDPL2 simulation. We match the cumulative abundances of dark matter\nsubhalos\nas a function of ${{V_{\\rm peak}}}$ (the maximum circular velocity of a halo throughout\nits entire history) and that of our photometric galaxies as a function of their\nmagnitude, to obtain an estimate of the ${{V_{\\rm peak}}}$ of subhalos hosting our\ngalaxies (see Appendix~\\ref{app:amatch}). The subhalos that host our fiducial subsample of\nphotometric galaxies approximately correspond to subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, while the brighter subsamples correspond to subhalos with ${V_{\\rm peak}} >175\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$ and ${{V_{\\rm peak}}}>280 {\\>{\\rm km}\\,{\\rm s}^{-1}}$, respectively. \n\nFor this analysis, we use the $z=0$ particle snapshot of the\nsimulation\\footnote{Ideally we would have liked to also carry out this exercise\nnear $z=0.24$, but we had only the $z=0$ particle snapshot available.}. We use all halos\nidentified by the 6d phase space halo finder ROCKSTAR \\citep{Behroozi:2013} in\nthe $z=0$ snapshot with halo mass, ${{M_{\\rm 200m}}}$, above $8.5\\times10^{13}{\\>h^{-1} M_\\odot}$ as\nour sample of galaxy clusters. We subdivide these in bins of $\\Gamma=\\Delta\\log\n{M_{\\rm vir}}/\\Delta\\log a$, and compute the three-dimensional density profile of matter\naround them. The derivative for $\\Gamma$ for this particular snapshot was\ncomputed between $z=0$ and $z=0.5$ \\citep{Diemer:2014, More:2015}.\nThe logarithmic slope of the matter density profile around the cluster samples\nare shown in the different panels of Figure~\\ref{fig:sh_matter_rsp_3d} using a\nblack solid line. For reference we also show the expected locations of the\nsplashback radius for each of the subsamples, using Equation~\\ref{eq:meanMDK15}.\nThe fitting function seems to capture the trend observed for the splashback\nradius of dark matter as a function of the accretion rate in the simulation\nreasonably well (within 5 percent).\n\nIn the same figures we also show the logarithmic slopes of subhalo distributions\naround galaxy cluster halos for different ${{V_{\\rm peak}}}$ thresholds obtained from\nour simple subhalo abundance matching method. We observe that the locations of\nthe steepest slope for subhalos with the lowest ${{V_{\\rm peak}}}$ threshold is similar\nto that in dark matter within 5 percent for all the $\\Gamma$ bins shown in the\nfigure. Thus the location\nof the splashback radius is not expected to be significantly different for\nsubhalos hosting our fiducial sample of photometric galaxies. As we consider\n${{V_{\\rm peak}}}$ thresholds corresponding to our brighter subsamples, we see effects of\ndynamical friction acting on the subhalos \\citep[see also][]{Jiang:2014}. The\nsplashback radius of these larger subhalos systematically shifts to smaller\nvalues with increasing $V_{\\rm peak}$ threshold. \n\nWe have tried to maximise the effect of dynamical friction in the above exercise\nby not considering scatter between the luminosity of galaxies and the ${V_{\\rm peak}} $\nof their subhalos while performing abundance matching. We do not see a large\nshift in the splashback radius of the photometric galaxies around any of our\ncluster subsamples as a function of their magnitude threshold. However, this\ndoes not imply that our data rule out dynamical friction acting on the brighter\nsample of photometric galaxies. It is quite likely that there is a reasonably\nlarge scatter between the magnitude and ${{V_{\\rm peak}}}$, which can wash out the\ndynamical friction effect. \n\n\\subsection{Background subtraction and mis-centering uncertainties}\n\\label{sec:background}\n\nWe have used the number density profiles around random points to subtract the\nuncorrelated galaxies in the background and the foreground of our subsamples.\nWe have also tested how residual uncertainties in background subtraction can\naffect our results. As an initial test of uncertainties in the background which\nare constant with radius, we have added in a constant parameter to our model for\nthe projected number density profiles. Even after marginalizing over such a\nparameter, we obtain values for the splashback radii and its uncertainty which\nare very consistent in two dimensions, and virtually identical in three\ndimensions. However, there could be additional background uncertainties which\nvary with the projected distance.\n\nFor example, we expect that the clusters in our subsamples will cause the galaxies in the\nbackground to be magnified \\citep[see e.g.,][]{Umetsu:2011}. We explore the\nchanges to the background due to cluster magnification in\nAppendix~\\ref{app:mag}, and find that the splashback radius is not affected\neven after applying a conservative correction to the background due to the\nmagnification of the clusters. The sky subtraction around bright or highly\nclustered objects can also potentially affect the photometry of galaxies and\nhence the background objects in clusters \\citep{Aihara:2011}. This can also\npartly cancel the magnification effect, as it reduces the number density of\nbackground galaxies in clusters.\n\nMis-centering of central galaxies in  {redMaPPer } clusters could affect the profiles\nand our estimates of the splashback radius. There are two kinds of\nmis-centering: first, a galaxy may be mis-classified as a central by the cluster\nfinder and second, the central galaxy may be physically displaced from the\npotential minimum of the cluster around which all galaxies orbit. To test for\nthe first kind of mis-centering, we have restricted our model fits to scales\n$>400{\\>{h^{-1}{\\rm kpc}}}$ or to using clusters where the most probable central galaxy has\n${p_{\\rm cen}}>0.9$. These restrictions produce fit parameters consistent with those\nlisted in Table~\\ref{tab:post}, especially the position of the splashback\nradius, within the reported uncertainties. \n\nTo test for the second kind of mis-centering, we have also considered all halos\nfrom the MDLP2 simulation used in the previous section, and displaced 40 percent\nof these halos in their positions with an offset drawn from a multivariate\nGaussian distribution with standard deviation equal to\n$400{\\>{h^{-1}{\\rm kpc}}}$\\footnote{This assumes that the {redMaPPer } centering probabilities are\nunreliable and the centering algorithm performs as badly as selecting the\nbrightest galaxy in the cluster, which could result in 40\npercent mis-centering fraction \\citep{Skibba:2011}.}. In each panel\nof Figure~\\ref{fig:sh_matter_rsp_3d}, we have additionally included a dashed\nline which shows the slope of the logarithmic density profiles around such a\nsample of halos. We find that, as expected, in all cases the splashback radius\nwould be overestimated by $\\gtrsim 20\\%$, an effect which goes in the opposite\ndirection required to explain a smaller splashback radius. Moreover, the change\nof slope around the splashback radius is much less pronounced and overall shape\nof the profile is significantly modified.  This is in contrast with the good\nagreement we find between the {\\it shapes} of the predicted and observed slope\nprofiles.  \n\n\\subsection{Could averaging effects result in a smaller splashback radius?}\n\\label{sec:averaging}\n\nWe have used the average halo mass of our subsamples as inferred from weak\nlensing to obtain the average ${R_{\\rm 200m}}$ of our cluster halos to compare with the observed values of the\nsplashback radius, ${R_{\\rm sp}^{\\rm 3d}}$. Could the difference between the ${R_{\\rm sp}^{\\rm 3d}}/{R_{\\rm 200m}}$\nseen in observations and that predicted from simulations arise due to the finite\nwidth of the halo mass distribution? We considered the distribution of halo\nmasses resulting from a threshold sample with the same average halo mass as our\ncluster subsamples. For such samples, we find that the difference between\n$\\left\\langle {R_{\\rm 200m}} \\right\\rangle$ and that inferred from the average halo mass is different by only\n$\\approx 3$ percent, whereas the discrepancy we observe is much\nlarger\\footnote{Using a halo mass sample with a threshold in ${N_{\\rm sat}}$ as in our\ndata, also does not affect this conclusion.}.\n\nWe have also verified that the location of the splashback radius for a threshold\nmass sample does not result in a smaller inferred splashback radius compared to\nthe expectation based on using the average halo mass, and the average mass\naccretion rate onto the halo samples. These tests confirm that the smaller\nvalue for the splashback radius we observe is not likely to be a result of some\naveraging effects.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=0.8]{Assembly_bias_expectation_avr3d_M_1e14_Vpeak135.pdf}}\n\\caption{\nExpectation for halo assembly bias from simulations. {\\it Top left panel}:\nThe average cluster centric distance of member subhalos in cluster sized halos\nin MDPL2 simulation as a function of halo mass. We use the radius to divide the\ncluster sample into two at fixed mass. The two subsamples are shown in orange and purple\ncolors. {\\it Top right panel}: The same subsamples as in the top left panel but in the\ndark matter concentration-halo mass plane. The subhalo distribution seems to\n have very little correlation with the dark matter distribution.\n {\\it Bottom left\npanel}: The ratio of the halo biases of subsamples of halos with masses\n$10^{14}{\\>h^{-1} M_\\odot}$ split using the average distance of their subhalos from\n their centers, $\\left\\langle {{R_{\\rm mem}}^{\\rm 3d}} \\right\\rangle(M_{\\rm 200m})$. The bias ratio obtained from\n cluster-cluster auto-correlations is shown with a solid line, while the dashed\n line corresponds to the ratio obtained from the cross-correlations of\n cluster-scale halos with all subhalos with ${V_{\\rm peak}}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ that are selected\n to mimic the fidual photometric galaxies used in our analysis as in\n Figure~\\ref{fig:obs_all}. {\\it Bottom right panel}: The distribution of the\n mass accretion rates $\\Gamma$ for the two subsamples.\n} \n\\label{fig:assembly_bias_expect}\n\\end{figure*}\n\n\\subsection{What is the systematic error in the weak lensing halo masses?}\n\nOur conclusion that the observed splashback radius is smaller than the\nexpectation from simulations is based on the comparison with the virial radius\nfor weak lensing halo mass inferred by \\citet{Miyatake:2016}. However,\n\\citet{Miyatake:2016} assumed a $\\delta$-function distribution in halo masses to\nmodel the weak lensing measurements for each cluster subsample and infer the\naverage halo mass. Such a simplified fitting to the weak lensing surface mass\ndensity profile is expected to underestimate the virial halo mass by $\\sim10\\%$\ncompared to the mean halo mass of clusters in the sample\n\\citep{Mandelbaum:2005,Becker:2011,Niikura:2015}, or $\\sim3\\%$ in radius. The\ndifference between the measured and expected splashback radii is much larger\nthan such systematic error, and if at all will increase the inconsistency rather\nthan decrease it. The statistical error in the weak lensing masses is less $10$\npercent, so even 2-$\\sigma$ deviations will result in only $\\sim7$ percent\nchange in the expectation in the splashback radius. The errors in the weak\nlensing masses have also been folded in when computing the error on the observed\n${R_{\\rm sp}}/{R_{\\rm 200m}}$ shown in Figure~\\ref{fig:derivmdk}.\n\n\\subsection{Is the halo assembly bias signal consistent with expectations?}\n\nOur observational results indicate that the galaxy cluster subsample with lower\nconcentration of member galaxies has a larger splashback radius (lower accretion\nrate $\\Gamma$), and a larger halo bias. Is the sense and the amplitude of the halo\nassembly bias signal we see consistent with expectations from cosmological\nsimulations of cold dark matter?\n\nVarious proxies such as formation time scales of halos or their dark matter\nconcentrations have been used in the literature to quantify halo assembly bias.\nThe sense of the halo assembly bias effect varies depending upon the assembly\nproxy used. For example, \\citet{Gao:2005} find that halo assembly bias is\nstrongest for low mass galaxy scale halos, and that the earliest forming halos\ncluster more strongly than the average for their halo masses. However, they find that\nthe effect almost disappears on the mass scales we consider in our paper. On the\ncontrary, when the concentration of halos is used as a proxy, halo assembly bias\nmanifests itself at both galaxy scales and galaxy cluster scales\n\\citep{Wechsler:2006}. At galaxy scales (masses below $10^{12}{\\>h^{-1} M_\\odot}$) high\nconcentration halos (which form earlier) have a larger halo bias, but the trend\nreverses on galaxy cluster scales, as expected from the relation between mass\naccretion history and the curvature of initial density peaks \\citep{Dalal:2008}.\n\n\\citet{Li:2008} explored eight different definitions of halo assembly and found\nthat the connection between formation time and assembly bias of halos can be\ntotally washed out or even reversed depending upon the proxy used. Member galaxy\nconcentration has never been explored previously in the literature as a proxy\nfor assembly history. Therefore, we use the MDPL2 simulation to explore the\nextent of the assembly bias expected when using it as a proxy. We ignore all\nobservational complications, and investigate how the clustering of halos at\nfixed halo mass varies as a function of the concentration of the subhalo\ndistribution belonging to the halos. \n\nWe use all isolated halos with ${{M_{\\rm 200m}}}>10^{14}{\\>h^{-1} M_\\odot}$ at $z=0.248$ from MDPL2.\nThis threshold in halo mass at $z=0.248$ allows us to match the average weak lensing mass of\nour cluster subsamples\\footnote{Note that this threshold is slightly larger\nthan the threshold used used in Section~\\ref{sec:dyn} at $z=0.0$. Both\nthresholds ensure that we match the average weak lensing mass from observations.}. To compute the average projected separation between\ncluster members and halo centers, we use all subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, similar to the threshold used for the faintest of our\nphotometric galaxies. We divide the sample into halves based on the\n3-d cluster centric distance of the subhalos of each cluster as shown in the top\nleft panel of Figure~\\ref{fig:assembly_bias_expect}. The top right panel of the\nfigure shows the scatter plot of dark matter concentrations of our halos given\ntheir halo masses and implies that the concentration of dark matter and\nconcentration of subhalos are not well correlated. \n\nThe ratio of the halo bias obtained from the auto-correlation function of\ncluster halos in the two subsamples is shown in the bottom left panel of\nFigure~\\ref{fig:assembly_bias_expect} with the orange solid line, while that\nobtained from the cross-correlation with halos with ${V_{\\rm peak}}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ is shown\nwith a dashed line. For comparison, the observed ratio between the biases of our\ncluster subsamples is shown with the grey shaded region.  Subsample divisions\nbased on $\\left\\langle {{{R_{\\rm mem}}^{\\rm 3d}}} \\right\\rangle({N_{\\rm sat}^{\\rm 3d}})$, give very similar amplitude for\nthis ratio at larger radius when using auto-correlations, but with weaker scale\ndependence.  Finally, the bottom right panel shows the distributions of the mass\naccretion rates onto these clusters.\n\nThe halo assembly bias signal we observe in data is in the same sense, albeit\nstronger, than that seen in simulations\\footnote{The preliminary\ninvestigations mentioned in \\citet{Miyatake:2016} which seemed to suggest larger\nassembly bias signal, were mistakenly performed using a larger mass threshold by\nSM. The results presented in this paper override those preliminary\ninvestigations.}. The division in the mass accretion rates is also in the same\nsense as required to explain the splashback radius measurements seen in the\ndata. These results from simulations show that it is possible to obtain samples\nof halos with a lower average accretion rate that have a larger clustering\nsignal as seen in our observations.\n\nOnce projection effects are accounted for (as in Section~\\ref{sec:projection}),\nand the sample is divided based upon $\\left\\langle {{{R_{\\rm mem}}^{\\rm 2d}}} \\right\\rangle({N_{\\rm sat}^{\\rm 2d}})$, an even smaller\nvalue for the halo assembly bias signal is obtained in simulations. Given that\nthe strength of the halo assembly bias signal increases with halo mass, one\ncould potentially reproduce the result by using larger mass scales in\nsimulations. However this will further worsen the problem of the smaller\nsplashback radius. Characterization of the halo assembly bias signal with\ndifferent richness threshold samples and theoretical investigations using larger\nsimulations are currently ongoing and will be reported in a future publication.\n\n\\subsection{Projection effects}\n\\label{sec:projection}\n\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Projection_effects.pdf}}\n\\caption{\n        Estimates of projection effects. Left panel: The scatter plot of\n        ${M_{\\rm 200m}}$ of halos as a function of their richness determined in\n        projection. The richness of cluster halos in projection is computed by\n        assigning smaller (sub)halos as satellites if they lie within a projected\n        radius of ${R_{\\rm 200m}}$ and within $\\pm50 {\\>h^{-1}{\\rm {Mpc}}}$ of a larger halo along\n        the line-of-sight. To maximize projection effects, we assume the two\n        subsamples separated by the median ${{M_{\\rm 200m}}}-{N_{\\rm sat}^{\\rm 2d}}$ relation\n        shown by the dashed line. Right panel: The halo mass distributions of\n        the two cluster subsamples shown in the left panel. The average halo\n        masses are expected to be different by at most a factor of $1.66$ when we\n        maximize the projection effects.\n}\n\\label{fig:projection}\n\\end{figure*}\n\nOne possible way to explain the different splashback radii and halo biases for our\ntwo cluster subsamples, could be that the two SDSS cluster subsamples in reality have\ndifferent masses. The weak lensing mass estimates, taken at face value, restrict this\npossibility. However, the weak lensing signal is only sensitive to the\nprojected mass distribution. The cluster subsample identification also has a\nvery poor resolution in the line-of-sight direction. Therefore, we explore the\npossibility that our subsamples indeed have different $3$-d masses regardless of\nthe similarity of the weak lensing signal, and the richness of the clusters.\n\nTo address the magnitude of projection effects, we again resort to the MDPL2\nsimulation. We consider all halos with  ${{M_{\\rm 200m}}}>10^{13} {\\>h^{-1} M_\\odot}$ as potential\nclusters identified from the photometric data\\footnote{We have chosen a slightly lower halo mass threshold for\nthis test since projection effects can upscatter smaller halos to have a larger\nrichness than expected for their halo masses.}. We associate all halos/subhalos with ${{V_{\\rm peak}}}>135 {\\>{\\rm km}\\,{\\rm s}^{-1}}$ to be\nsatellite galaxies of these potential galaxy clusters if they lie within a\nprojected radius of ${R_{\\rm 200m}}$ from their centers, and have a line of sight\nseparation less than $50 {\\>h^{-1}{\\rm {Mpc}}}$. The projected separation lengths of $\\pm 50\n{\\>h^{-1}{\\rm {Mpc}}}$ was obtained by considering the scatter in the colors of red sequence\ngalaxies used to identify {redMaPPer } galaxy clusters, and the amount of variation of\nthese colors as a function of redshift \\citep[see Figures 1 and 7\nin][]{Rykoff:2014}.  If subhalos can belong to two clusters after the\nprojection, we assign it to the most massive halo. We do not redefine or\nrecompute the cluster centers after these projections as we expect that the\n{redMaPPer } centering algorithm is less likely to identify the galaxies in projection\nas centrals for the {redMaPPer } clusters. \n\nIn the left hand panel of Figure~\\ref{fig:projection}, we show the scatter plot\nof ${M_{\\rm 200m}^{\\rm 3d}}$ as a function of ${N_{\\rm sat}^{\\rm 2d}}$, i.e., the\nnumber of satellites associated with these cluster sized halos after the\nreassignment described above. To maximize the strength of projection effect, we\nmake the extreme assumption that our two cluster subsamples select the upper and\nthe lower half of ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed ${N_{\\rm sat}^{\\rm 2d}}$. The\ndistributions of the ${M_{\\rm 200m}^{\\rm 3d}}$ selected in this manner are\ndisplayed in the right hand panel of Figure~\\ref{fig:projection}. The average\nhalo masses corresponding to the two distributions are different by $\\sim62\\%$,\nwhich implies a difference of at most $\\sim 20\\%$ in the radii.  In\ncontrast, the observed difference in the radii is twice as large, $\\sim40\\%$. We\nexpect the extent of projection effects to be lower, given that the average\ncluster centric distances for the satellites are not expected to be perfectly\ncorrelated with ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed ${N_{\\rm sat}^{\\rm 2d}}$. Furthermore, due to halo\nassembly bias effects in simulations, the sample with larger ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed\n${N_{\\rm sat}^{\\rm 2d}}$ turns out to have a smaller clustering signal, opposite of what is\nrequired to simultaneously explain both the different splashback radius and the\nsense of the assembly bias signal.\n\nThus, we have established that the two subsamples have splashback radii and halo\nbiases that differ from one another by an amount that cannot be explained with\nthe help of projection effects alone. In Appendix~\\ref{app:proj}, we show that\nboth of our cluster subsamples have very similar distributions of the axis\nratios of the light profiles for the most probable central galaxies, similar\nellipticity distributions for satellite galaxies, and similar line-of-sight\nvelocity dispersions. The similarity of these distributions is inconsistent with\nthe trends expected, if the projection effects were behind  the large magnitude\nof assembly bias signal or the difference in the splashback radii between the\ntwo subsamples divided by $\\left\\langle {R_{\\rm mem}} \\right\\rangle$.\n\n\n\\section{Discussion}\n\\label{sec:discuss}\n\nIn Section~\\ref{sec:results}, we showed that the surface number density profiles\nof galaxies around {redMaPPer } clusters exhibit steepening characteristic of the\nsplashback radius expected to arise in dark matter halos due to the caustic\nformed by matter at the first apocenter after accretion.  Moreover, we showed\nthat subsamples of the clusters of the same mass split on concentration of the\ngalaxy distribution exhibit different splashback radii and different spatial\nbias.\n\nAlthough comparisons with theoretical expectations\npresented in Section~\\ref{sec:sim_compare} show that the observed profiles and\ntrends agree with predictions qualitatively, there are significant quantitative\ndiscrepancies. First, the observed splashback radii are significantly smaller than\nexpected for halos corresponding to cluster masses of our sample, and second, the difference\nin biases of cluster subsamples is also larger than expected. Both discrepancies\nare very interesting because the location of the splashback radius is a result of \nsimple gravitational dynamics and can be both robustly predicted from simulations \n\\citep{Diemer:2014,More:2015} and reproduced even in simple spherical \ncollapse models  \\citep{Adhikari:2014}. Likewise, halo assembly bias is expected\nto reflect the statistics of peaks in the initial density field from which\nmassive cluster-sized halos form \\citep{Dalal:2008}. We will postpone the\ndiscussion of the larger magnitude of halo assembly bias to a future paper where\nwe will quantify with larger simulations the extent of this discrepancy. We\nfocus on the splashback radius discrepancy below.\n\nWe consider four possible explanations for the discrepancies in the splashback\nradius -- (a) the halo mass ${{M_{\\rm 200m}}}$ and hence the radius ${R_{\\rm 200m}}$ inferred from\nthe data is larger than it really is, and this causes our measurements of\n${R_{\\rm sp}}/{R_{\\rm 200m}}$ to be biased low, (b) the splashback radius of the clusters for a\ngiven accretion rate measured using galaxies is smaller than that expected from\ndark matter simulations, (c) the mass accretion rate onto clusters is much\nhigher than expected for clusters of this mass, and, finally, (d) that new physics in the\nform of self interactions of dark matter particles results in decrease of the \nsplashback radius. We discuss each of these possibilities in turn.\n\nThe ratio between the splashback radius of the two cluster subsamples is roughly\nconsistent with the best case expectations from the $\\Lambda$CDM simulation\nof the Planck cosmology (the ratio between the\nsplashback radii corresponding to the orange and purple stars in\nFigure~\\ref{fig:derivmdk}). Let us\nassume that our observational proxy results in the best case split, a\nvery optimistic assumption, and that the weak lensing masses are overestimated.\nIn that case, the discrepancy seen in the splashback radius for the two cluster\nsubsamples is $\\sim1.4$ in radii, thus a factor of $\\sim 2.75$ in halo masses,\nstrongly disfavored by the small errors on the masses from weak lensing. Under\nthis scenario, we would have uncovered a critical problem for weak lensing\ncalibration of observable halo mass relations which are important for precision\ncosmological measurements using galaxy clusters. Moreover, even if we assume\nthat the masses are overestimated for both samples, this would mean that the\npredicted assembly bias strength would be even lower. Such arguments thus run in\nthe opposite sense of what is required to explain the large assembly bias\nsignal. \n\nIf weak lensing systematics can be ruled out, one could try to explain the discrepancy\nif the mass accretion rate onto the clusters is normal, but the splashback\nradius is indeed smaller than expected. Dynamical friction on subhalos was an\nobvious physical effect which could cause this. However, in\nSection~\\ref{sec:dyn}, we have shown that the subhalos corresponding to the\nfaintest magnitude bin we consider are not expected to experience a large amount\nof dynamical friction. Also, puzzlingly, in the data we do not detect a significant difference in the\nsplashback radius with the brightness of the photometric sample used. Furthermore, future deeper surveys should be able to rule\nout this possibility by using even fainter galaxies. Other astrophysical\npossibilities include subtle biases in the photometric galaxy samples, which\nlead to a preferential selection of slow moving galaxies in our sample. For\nexample, ram pressure stripping is expected to be more effective in stripping out gas\nand shutting down the star formation in fast moving galaxies, thus removing them\npreferentially from our photometric sample. Detection of the splashback radius\nof matter in clusters using the weak lensing signal would be able to test this\npossibility.\n\nDark matter self-interactions have long been proposed to alleviate problems on\nsmall scales in the standard cosmological model \\citep[see\ne.g.,][]{Spergel:2000}. Under certain conditions discussed below the drag force\ndue to interactions between dark matter particles of subhalos and cluster halo\ncould lead to loss of orbital energy by subhalos even on the first crossing,\nthereby reducing the splashback radius. \n\nFor isotropic elastic scattering, we do not expect dark matter self-interactions\nto significantly affect the splashback feature, because the upper limits on such\nan interaction cross-section are sufficiently stringent to ensure that most dark\nmatter particles do not experience any scattering events during a single orbit\n\\citep{Gnedin:2001, Randall:2008}.  Of the few subhalo particles that do\nscatter, most are ejected from their subhalos, since the orbital velocities of\nsubhalos within massive hosts are typically larger than the internal escape\nvelocities of those subhalos. Therefore we would expect evaporation of subhalo\nmasses, without a significant drag for isotropic scattering.\n\nOn the other hand, if dark matter self-interactions are anisotropic, with large\ncross-sections for small angle scattering and low cross-sections otherwise, then\nthe momentum transfer during dark matter interactions\nmay not necessarily be large enough to ensure ejection. The small angle\nscattering cross-sections could then be large enough for dark matter particles\nto experience frequent interactions and yet obey the bounds on subhalo\nevaporation. The subhalos would experience a net deceleration given by\n\n", "itemtype": "equation", "pos": 42698, "prevtext": "\n\n\n\n\n\n\n\n\n\n\n\\title{Detection of the Splashback Radius and Halo Assembly bias of Massive Galaxy Clusters}\n\\author{\nSurhud More \\altaffilmark{1}, \nHironao Miyatake \\altaffilmark{2,3,1}, \nMasahiro Takada \\altaffilmark{1}, \nBenedikt Diemer \\altaffilmark{4}, \nAndrey V. Kravtsov\\altaffilmark{5,6,7},\nNeal K. Dalal \\altaffilmark{8, 1},\nAnupreeta More \\altaffilmark{1},\nRyoma Murata \\altaffilmark{1,9},\nRachel Mandelbaum\\altaffilmark{10},\nEduardo Rozo\\altaffilmark{11},\nEli S. Rykoff\\altaffilmark{12},\nMasamune Oguri\\altaffilmark{9,13,1},\nDavid N. Spergel\\altaffilmark{3,1}\n}\n\n\\affil{\n$^1$ Kavli Institute for the Physics and Mathematics of the Universe (WPI),\nTokyo Institutes for Advanced Study, The University of Tokyo,\\\\ 5-1-5 Kashiwanoha, Kashiwa-shi, Chiba, 277-8583, Japan;{\\tt surhud.more@ipmu.jp}\\\\\n$^2$ Jet Propulsion Laboratory, California Institute of Technology, Pasadena, CA 91109, USA\\\\\n$^3$ Department of Astrophysical Sciences, Princeton University,\n Peyton Hall, Princeton NJ 08544 USA\\\\\n$^4$ Harvard-Smithsonian Center for Astrophysics, 60 Garden St., Cambridge, MA 02138 USA \\\\\n$^5$ Department of Astronomy and Astrophysics, The University of Chicago, Chicago, IL 60637 USA \\\\\n$^6$ Kavli Institute for Cosmological Physics, The University of Chicago, Chicago, IL 60637 USA \\\\\n$^7$ Enrico Fermi Institute, The University of Chicago, Chicago, IL 60637 USA \\\\\n$^8$ Department of Physics, University of Illinois Urbana-Champagne,\n1110 West Green Street Urbana, IL 61801-3080 USA\\\\\n$^{9}$ Department of Physics, University of Tokyo, 7-3-1 Hongo, Bunkyo-ku, Tokyo 113-0033 Japan\\\\\n$^{10}$ McWilliams Center for Cosmology, Department of Physics, Carnegie\nMellon University,\n Pittsburgh, PA 15213 USA\\\\\n$^{11}$ Department of Physics, University of Arizona, 1118 E 4th St,\nTucson, AZ 85721 USA \\\\\n$^{12}$ SLAC National Accelerator Laboratory, Menlo Park, CA 94025  USA \\\\\n$^{13}$ Research Center for the Early Universe, University of Tokyo, 7-3-1 Hongo,\nBunkyo-ku, Tokyo 113-0033, Japan \\\\\n}\n\n\n\n\n\n\\begin{abstract}\nWe show that the projected number density profiles of SDSS photometric galaxies\naround galaxy clusters displays strong evidence for the splashback radius, a\nsharp halo edge corresponding to the location of the first orbital apocenter of\nsatellite galaxies after their infall. We split the clusters into two subsamples\nwith different mean projected radial distances of their members, $\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$,\nat fixed richness and redshift, and show that the sample with smaller\n$\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$ has a smaller ratio of the splashback radius to the traditional\nhalo boundary ${R_{\\rm 200m}}$, than the subsample with larger $\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$, indicative\nof different mass accretion rates for the two subsamples. The same cluster\nsamples were recently used by Miyatake et al.~to show that their large-scale\nclustering differs despite their similar weak lensing masses, demonstrating\nstrong evidence for halo assembly bias. We expand on this result by presenting a\n6.6-$\\sigma$ detection of halo assembly bias using the cluster-photometric\ngalaxy cross-correlations. Our measured splashback radii are smaller, while the\nstrength of the assembly bias signal is stronger, than expectations from N-body\nsimulations based on the $\\Lambda$-dominated, cold dark matter structure\nformation model. Dynamical friction or cluster-finding systematics such as\nmiscentering or projection effects are not likely to be the sole source of these\ndiscrepancies. \n\\end{abstract}\n\n\\keywords{}\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\n\nDark matter halos with masses larger than $10^{14}{\\>h^{-1} M_\\odot}$ collapse out of dense\npeaks in the primordial Gaussian density fluctuations that are believed to\noriginate from quantum fluctuations in cosmic inflation \\citep[see\ne.g.,][see \\citealt{Kravtsov:2012} for a recent review]{Kaiser:1984,bardeen_etal86}. Clusters of galaxies form\nwithin such massive dark matter halos. The large scale\nclustering amplitude of the halos hosting galaxy clusters is thus heavily biased\ncompared to the underlying matter distribution\n\\citep{Kaiser:1984,Mo:1996,Sheth:2001,Tinker:2010}. \n\nAlthough the large scale clustering amplitude of dark matter halos is primarily\nexpected to depend upon the height of the initial density peak out of which a\nhalo collapses (therefore its halo mass),\nit can have secondary dependencies on other parameters related\nto the assembly history of the halo, such as the radial profile of the initial\npeak, especially on cluster scales \\citep{Dalal:2008}. The dependence of the large scale clustering amplitude on parameters\nother than the halo mass has been broadly referred to as halo assembly bias, and\nhas been studied in great detail using cosmological simulations\n\\citep{Sheth:2004, Gao:2005,*Gao:2007, Wechsler:2006, Li:2008}.\n\nHalo assembly bias has however been difficult to establish in astrophysical\nobservations. A clean detection of halo assembly bias requires identifying\nsamples of isolated halos which are matched in their halo masses but differ\nin their assembly histories. There have been several claims of detection of halo\nassembly bias on galaxy scales in the literature \\citep[e.g.,][]{Yang:2006,\nTinker:2012, Hearin:2014}. However, \\citet{Linetal:2015} investigated the first of\nthese claims and found no strong evidence for halo assembly bias on galaxy scales. The\ndifference in the conclusions was a result of contamination of the halo\nsamples by satellite galaxies, or the differences in halo masses of the samples\nused to look for halo assembly bias \\citep{Linetal:2015}. \n\nRecently, \\citet{Miyatake:2016}\npresented the first evidence of halo assembly bias on cluster scales. Galaxy\nclusters offer two advantages: first, the probability of a cluster-sized halo\nbeing a satellite of an even bigger halo is much smaller than in the case of\ngalaxies, and secondly, the weak gravitational lensing signal can be used to\nmatch galaxy cluster subsamples for their halo masses with a greater accuracy. \n\nThe galaxy cluster subsamples used by \\citet{Miyatake:2016}\nwere drawn from the SDSS {redMaPPer } galaxy cluster catalog, and were matched in redshift\nand richness distribution, but differed in the compactness of the member galaxy\ndistribution. These samples were shown to have very similar masses based on weak\nlensing, but had different large scale biases. The main goal of this paper is\nto observationally establish the connection between the member galaxy\ndistribution and the mass assembly of these cluster subsamples without relying\non proxies related to complicated baryonic physics, such as the star formation\nrates.\n\nFor this purpose, we use a unique probe of the mass assembly of galaxy\nclusters, which relies on the observational detection of the edges of galaxy\nclusters. Models of self-similar secondary infall of matter onto a spherical\noverdensity predict the presence of a density jump at the location where\nrecently accreted material is reaching its first apocenter, associated with the\nlast density caustic \\citep{fillmore_goldreich84, Bertschinger:1985}.  Although\nthe collapse of matter onto realistic density peaks in cold dark matter models\nis considerably more complex than that envisioned in these models, the last\ndensity caustic manifests itself as a sharp steepening of the density profile in\ndark matter halos \\citep{Diemer:2014}. \n\nThe location of this density caustic, also called the splashback radius or the\nturnaround radius, can be used to define a physical boundary for dark matter\nhalos \\citep{More:2015}.  The splashback radius crucially depends upon the mass\naccretion rate of the collapsing halo \\citep{vogelsberger_etal11, Diemer:2014,\nAdhikari:2014}.  For halos of the same mass, large accretion \nrate results in  a smaller splashback radius. The physical reason is simple: the deeper\nthe halo potential well gets during the orbit of a dark matter particle, the\nsmaller is the value of its apocenter.\n\nAs discussed in \\citet{More:2015}, hints for\nthe splashback radius may have been seen before for individual clusters\n\\citep{Rines:2013, Tully:2015, Patej:2015}. In this paper, we will harness the\npower of statistics to present the first high signal-to-noise detection of the\nsplashback radius for our galaxy cluster subsamples. We will use the splashback\nradius to establish that these galaxy cluster subsamples have different mass\naccretion rates, and have different large scale clustering amplitude, a signature of halo\nassembly bias.\n\nThe paper is organized as follows: \n\\begin{itemize}\n\\item\n        Section~\\ref{sec:data} describes the cluster subsamples and the Sloan\n        Digital Sky Survey (SDSS) photometric galaxy data which form the basis\n        of our study, and the methods we adopt in order to obtain\n        the measurements of the galaxy number densities around our cluster\n        subsamples. \n\\item\n       Section~\\ref{sec:results} presents our measurements of the galaxy number\n       densities around our cluster subsamples, our inferences for the location\n       of the splashback radius from these measurements, and our detection of\n       halo assembly bias.  \n\\item\n       Section~\\ref{sec:sim_compare} presents the predictions for the location\n       of the  splashback radius and the amount of halo assembly bias from\n       numerical simulations in the context of the standard cosmological model.\n       In particular, we discuss a number of systematic effects, which could\n       affect our interpretation.\n\\item\n       The broad implications of our results are discussed in\n       Section~\\ref{sec:discuss}, and conclusions and a summary is presented in\n       Section~\\ref{sec:summary}.\n\\end{itemize}\n\nThroughout this paper, we adopt a flat $\\Lambda$CDM cosmological model\nwith matter density parameter ${\\Omega_{\\rm m}}=0.27$ and the Hubble parameter\n$h=0.7$, unless otherwise stated. We use $\\log$ to denote logarithms with\nrespect to base 10. We will use $r$ to denote three dimensional distances, and\n$R$ for projected distances between galaxies or between galaxies and cluster\ncenters. For cases where we want to preserve notations from previous papers,\nsuch as using ${R_{\\rm sp}}$ for the splashback radius, we will specifically mention\n$2$d or $3$d to avoid confusion. The subscript ${\\rm 200m}$ on halo mass $M$ or\nradius $R$ will refer to the mass or radius corresponding to spherical\noverdensity halos such that their boundaries enclose 200 times the mean matter\ndensity of the Universe.\n\n\\section{Data and Methods}\n\\label{sec:data}\n\nWe start from the publicly available catalog of galaxy clusters\nidentified from the SDSS DR8 photometric galaxy catalog by the {\\it\nred}-sequence {\\it Ma}tched-filter {\\it P}robabilistic {\\it Per}colation\n({redMaPPer}) cluster finding algorithm \\citep[v5.10, see the\nwebsite\\footnote{\\url{http://risa.stanford.edu/redmapper/}} for details\nand ][]{Rykoff:2014,Rozoetal:2014}. The cluster finder uses the\n$ugriz$ magnitudes and their errors, to identify overdensities of\nred-sequence galaxies with similar colors as galaxy clusters. For each\ncluster, the catalog contains an optical richness estimate $\\lambda$, a\nphotometric redshift estimate $z_\\lambda$, as well as the position and\ncentering probabilities of 5 candidate central galaxies ${{p_{\\rm cen}}}$. A separate\nmember galaxy catalog provides a list of members for each cluster, each\nof which is assigned a membership probability, ${{p_{\\rm mem}}}$.\n\nThe parent cluster catalog used in \\citet{Miyatake:2016} consists of an\napproximately volume limited sample of $8,648$ {redMaPPer } clusters with\n$20<\\lambda<100$ and $0.1\\le z_{\\lambda}\\le 0.33$. The average and the median redshift of our\nsubsamples are $0.24$ and $0.25$, respectively. Throughout this paper we use\nthe position of the most probable central galaxy in each cluster region as a\nproxy of the cluster center. However, we will discuss the effect of miscentering\non our conclusions in Section~\\ref{sec:background}.\n\nIn this paper, we subdivide this galaxy cluster sample into two subsamples\nfollowing the same procedure as in \\citet{Miyatake:2016}.  Briefly, we obtain\nthe average projected cluster-centric separation of member galaxies,\n$\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$, for each cluster, and compute the median $\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$ as a\nfunction of richness and redshift \\footnote{While computing the average, we weight each\ngalaxy's cluster centric distance with its membership probability (${p_{\\rm mem}}$).}. We\nuse this median to divide the parent sample into two subsamples. The large- and\nsmall-$\\left\\langle {{R_{\\rm mem}}} \\right\\rangle$ subsamples, labelled as low- and high-${{c_{\\rm gal}}}$,\nrespectively, in this paper, consist of 4,235 and 4,413 clusters, respectively.  \n\nIn order to compute galaxy surface number density around these cluster\nsubsamples, we make use of the photometric galaxy catalog from SDSS DR8\n\\citep{Aihara:2011}. We exclude galaxies with any of the following flags: {\\sc\nsaturated, satur$\\_$center, bright, deblended$\\_$as$\\_$moving}. We correct the\nmagnitudes for galactic dust extinction using the maps of \\citet{Schlegel:1998},\nand use all photometric galaxies with extinction corrected $i$-band model\nmagnitudes brighter than $21.0$ and with magnitude errors less than $0.1$. \n\nWe compute the stacked surface number density of the SDSS photometric galaxy\nsamples around each of our cluster subsamples as a function of comoving\nprojected separation, $R$, from the galaxy cluster center. Since our cluster\nsubsamples span a wide range in redshift ($0.1\\le z\\le 0.33$), the surface\ndensity profiles around lower redshift clusters will systematically contribute\ngalaxies from a fainter photometric galaxy population. To avoid such biases, for\nour fiducial analysis, we only count cluster-galaxy pairs if the photometric\ngalaxy has an absolute magnitude of $M_i-5\\log h<-19.43$\\footnote{Note that we\ndo not use any k-corrections or corrections for luminosity evolution here,\nsince the redshifts of the photometric galaxies are quite uncertain.}, assuming\nthat it is located at the redshift of the cluster (this limit corresponds to an\napparent magnitude of $m_i=21$ at $z=0.33$ for our assumed cosmological model).\nAdditionally, we will also present results for photometric galaxies that are one\nand two magnitudes brighter than our fiducial measurement, to explore the\ndependence of the splashback radius on the magnitude of photometric galaxies\nused.\n\nWe expect that the surface density measurement will consist of galaxies\ncorrelated with the galaxy clusters under consideration as well as uncorrelated\ngalaxies in the foreground and the background. To determine this uncorrelated\ncomponent, we compute the galaxy surface density around a sample of random points. We use \n100 times larger number of random points than the number of clusters in our subsamples \\footnote{We have tested that the\nuse of the improved random catalog from \\citet{Rykoff:2016} does not change any\nconclusions in this paper.}. These random points incorporate\nthe survey geometry, depth variations, and distributions of clusters in redshift\nand richness. We subtract the background around random points from the total to\nobtain the surface density of correlated galaxies, ${\\Sigma_{\\rm g}}(R)$. We use 102\njackknife regions in order to compute the covariance in the measurements of\n${\\Sigma_{\\rm g}}(R)$ with typical size of $10\\times10$ sq.~deg. which corresponds to\nabout $100\\times100 ~(h^{-1}{\\rm Mpc})^2$ at the median redshift of our cluster\nsubsamples. The jackknife regions are thus significantly larger compared to the\nscales of interest in this paper, justifying the assumptions behind the\njackknife errors.\n\nUsing the measurement of the galaxy surface densities, we would like to infer\nthe location of the splashback radius of our cluster subsamples, i.e., the\nsteepest logarithmic slope of the galaxy number density distributions in three\ndimensions. Given that the splashback radius is expected to be of the order of ${R_{\\rm 200m}}$ of\nour halos, we fit the surface densities in the range $[0.1,~5.0]{\\>h^{-1}{\\rm {Mpc}}}$.  The\nlocation of the steepening in three dimensions is expected to be different from\nthat in projection \\citep{Diemer:2014}.  Therefore, we will use a 3-dimensional\nparameterization first proposed by \\citet{Diemer:2014} to forward model the\nprojected measurements \\citep[see also][]{More:2015}.  The model consists of\ninner and outer surface density profiles with a smooth transition between the\ntwo,\n\n\\begin{eqnarray}\n        {\\rho_{\\rm g}}(r) &=& {\\rho_{\\rm g}^{\\rm inner}} {{f_{\\rm trans}}} +\n        {\\rho_{\\rm g}^{\\rm outer}}\\,, \\nonumber\\\\ \n        {\\rho_{\\rm g}^{\\rm inner}} &=& \\rho_{\\rm s} \\exp\\left( -\\frac{2}{\\alpha}\\left[\n        \\left(\\frac{r}{{r_{\\rm s}}}\\right)^\\alpha - 1\\right]\\right)\\,, \\nonumber\\\\\n        {\\rho_{\\rm g}^{\\rm outer}} &=& \\rho_{\\rm o} \\left( \\frac{r}{{r_{\\rm out}}}\n\\right)^{-{s_{\\rm e}}}\\,, \\nonumber \\\\\n        {{f_{\\rm trans}}} &=& \\left[1 +\n\t\t       \\left(r/{r_{\\rm t}}\\right)^{\\beta}\\right]^{-\\gamma/\\beta},\n        \\nonumber \\\\\n        {{\\Sigma_{\\rm g}}}(R) &=& 2 \\int_{0}^{z_{\\rm max}}\n\t {\\rho_{\\rm g}}\\!\\left(\\sqrt{R^2+z^2}\\right) dz~.\n\t \\label{eq:model_profile}\n\\end{eqnarray}\n\nNote that the above fitting formula, which is an Einasto profile in the inner\nregions which transitions to a power law in the outer regions, is able to reproduce the dark matter\nprofile around halos, and is flexible enough to reproduce the simulation results\ncompared to other fitting formulae such as the Navarro-Frenk-White model and the\nhalo model \\citep{Navarro:1996ApJ,OguriHamana:2011,Hikage:2013}. Here we simply\nassume that the same fitting formula is also flexible enough to reproduce the\ngalaxy surface density measured from the SDSS data.\\footnote{Tests using subhalo\ndensity profiles around cluster scale halos from simulations presented in\nAppendix~\\ref{app:fittest}, as well as the reasonable values of $\\chi^2$ values\nwe obtain for describing the observed measurements justify this choice.} We\nchose the maximum projection length $z_{\\rm max}=40{\\>h^{-1}{\\rm {Mpc}}}$ as our default value,\nand we have checked that the location of the splashback radius is insensitive to\nthis choice, in particular reducing $z_{\\rm max}$ to be even as small as\n$10{\\>h^{-1}{\\rm {Mpc}}}$.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Sim_data_compare.pdf}}\n\\caption{\n        {\\it Top panels}: The surface number density profiles, ${\\Sigma_{\\rm g}}(R)$, of\n        SDSS photometric galaxies with different magnitude thresholds around the\n        entire {redMaPPer } cluster sample with $z\\in[0.1, 0.33]$ and richness\n        $\\lambda\\in[20, 100]$, are shown using symbols with errorbars. The\n        dashed lines correspond to (sub)-halo surface density profiles in the\n        Multidark Planck II simulation around clusters with the mass threshold\n        similar to our sample at $z=0.248$. The threshold on subhalo $V_{\\rm\n        peak}$ values roughly correspond to the magnitude thresholds in each\n        panel and were obtained by subhalo abundance matching (see Appendix\n        ~\\ref{app:amatch}). {\\it Bottom panels}: The logarithmic slope of the\n        surface density profiles are shown using solid and dashed lines for the\n        observed galaxy and the subhalo surface density profiles, respectively.\n        The observed slope of the surface density profile has a shape which is\n        similar to that expected from simulations. Note that although the\n        surface density profiles both in observations and simulations exhibit\n        similar steepening, the corresponding radii of the steepest slope are at\n        slightly different locations.\n}\n\\label{fig:obs_all}\n\\end{figure*}\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Magnitude_dependence_crosscorr.pdf}}\n\\caption{\n        {\\it Left panels}: The surface number density profiles, ${\\Sigma_{\\rm g}}(R)$, of\n        SDSS photometric galaxies around the low-$c_{\\rm gal}$ (top) and high-$c_{\\rm gal}$ (bottom) cluster subsamples. The three different point types\n        with errorbars in each panel correspond to the three different magnitude\n        limited samples of photometric galaxies we use. {\\it Right panels:} The\n        logarithmic density slope of the surface number density profiles\n        obtained after smoothing the data points with an improved Savitzky-Golay filter\n        (order 3, window size 5). The two-dimensional splashback radius\n        corresponds to the location of the steepest slope or the minimum of\n        $d\\log{\\Sigma_{\\rm g}}/d\\log R$. For comparison, the shaded regions correspond to\n        the traditional halo boundary, $R_{\\rm 200m}$, estimated using the\n        posterior distribution of halo masses from the weak lensing profile for\n        each cluster subsample from \\citet{Miyatake:2016} (both are consistent\n        with each other within the errorbars).  Note that the steepest slope (i.e., the minimum in\n        $d\\log{\\Sigma_{\\rm g}}/d\\log R$) occurs at different locations for the two cluster\n        subsamples.\n}\n\\label{fig:obs}\n\\end{figure*}\n\n\nGiven that the parameter ${{r_{\\rm out}}}$ and $\\rho_{\\rm o}$ are entirely degenerate with\neach other, we fix ${{r_{\\rm out}}}=1.5 {\\>h^{-1}{\\rm {Mpc}}}$. We find that allowing $\\alpha$ to vary\nfreely results in an almost perfect degeneracy between $\\rho_{\\rm s}$ and $r_{\\rm s}$,\nwith very little impact on the location of the steepening of the galaxy density\nprofiles. Therefore we use a prior on $\\log \\alpha = \\log 0.2 \\pm 0.6$,\ncentered at the value expected for the dark matter halos corresponding to our\nmass estimates from weak lensing \\citep{Gao:2008}. For our fiducial modeling\nscheme, we also use priors on $\\log \\beta=\\log 4.0\\pm0.2$ and $\\log\n\\gamma=\\log 6.0\\pm0.2$ centered around the values recommended by\n\\citet{Diemer:2014} and constrain the parameters ${r_{\\rm s}}$ and ${r_{\\rm t}}$ to lie within\n$[0.1, 5.0]{\\>h^{-1}{\\rm {Mpc}}}$. \n\nFor our default modeling scheme, we assume that the most probable central\ngalaxy for every cluster (one with the highest ${p_{\\rm cen}}$), assigned\nin the {redMaPPer } catalog, resides at the true center of gravitational potential in\neach cluster region. However, as studied in \\citet{Miyatake:2016} \\citep[see\nalso][]{Hikage:2013}, some fraction of the central galaxies in our cluster\nsubsamples may be mis-centered, characterized by offset radii ranging from\n$400 {\\>{h^{-1}{\\rm kpc}}}$ possibly up to $800 {\\>{h^{-1}{\\rm kpc}}}$. If such mis-centered clusters are indeed present\nin large numbers, our measurements of the splashback radius would be biased\nhigh. We will present tests for the effects of mis-centering  in Section~\\ref{sec:background} below.\n\n\n\\begin{deluxetable*}{ccccccccccccc}\n\\tablecaption{Posterior distribution of parameters from \nthe MCMC analysis\n \\label{tab:post}\n}\n\\startdata\n \\hline\\hline\n Magnitude & $c_{\\rm gal}$ & $\\log \\rho_0$ & $\\log \\alpha$ & $\\log r_{\\rm s}$ &  $\\log \\rho_{\\rm o}$ & $s_{\\rm e}$ & $\\log r_{\\rm t}$ & $\\log \\beta$ & $\\log \\gamma$ & $R_{\\rm sp}^{\\rm 2d}$ & $R_{\\rm sp}^{\\rm 3d}$  & $\\chi^2$/dof \\\\\n\\hline\n-19.43 & high & $1.10_{-0.77}^{+0.25}$ & $-0.95_{-0.32}^{+0.22}$ & $-0.32_{-0.13}^{+0.40}$ & $0.349_{-0.035}^{+0.031}$ & $1.601_{-0.080}^{+0.076}$ & $-0.082_{-0.040}^{+0.049}$ & $0.762_{-0.095}^{+0.119}$ & $0.66_{-0.12}^{+0.14}$ & $0.778_{-0.014}^{+0.015}$ & $0.971_{-0.021}^{+0.025}$ & 6.0/8 \\\\\n-19.43 & low & $-0.68_{-0.20}^{+0.30}$ & $-1.090_{-0.063}^{+0.088}$ & $0.55_{-0.17}^{+0.11}$ & $0.545_{-0.067}^{+0.055}$ & $1.600_{-0.080}^{+0.068}$ & $0.058_{-0.021}^{+0.023}$ & $1.10_{-0.11}^{+0.12}$ & $0.64_{-0.11}^{+0.13}$ & $1.153_{-0.021}^{+0.029}$ & $1.378_{-0.026}^{+0.026}$ & 13.2/8 \\\\\n-20.43 & high & $0.70_{-0.86}^{+0.31}$ & $-0.97_{-0.35}^{+0.28}$ & $-0.27_{-0.16}^{+0.45}$ & $0.167_{-0.016}^{+0.014}$ & $1.613_{-0.077}^{+0.074}$ & $-0.098_{-0.038}^{+0.048}$ & $0.82_{-0.11}^{+0.13}$ & $0.69_{-0.12}^{+0.14}$ & $0.756_{-0.012}^{+0.014}$ & $0.938_{-0.026}^{+0.024}$ & 2.9/8 \\\\\n-20.43 & low & $-0.89_{-0.28}^{+0.38}$ & $-1.019_{-0.086}^{+0.118}$ & $0.48_{-0.21}^{+0.15}$ & $0.276_{-0.021}^{+0.018}$ & $1.655_{-0.056}^{+0.052}$ & $0.072_{-0.023}^{+0.026}$ & $1.10_{-0.11}^{+0.12}$ & $0.80_{-0.13}^{+0.14}$ & $1.128_{-0.024}^{+0.029}$ & $1.352_{-0.025}^{+0.026}$ & 12.4/8 \\\\\n-21.43 & high & $0.10_{-0.93}^{+0.39}$ & $-1.00_{-0.35}^{+0.33}$ & $-0.25_{-0.20}^{+0.49}$ & $0.0385_{-0.0048}^{+0.0045}$ & $1.496_{-0.099}^{+0.096}$ & $-0.087_{-0.044}^{+0.051}$ & $0.85_{-0.12}^{+0.14}$ & $0.78_{-0.13}^{+0.15}$ & $0.754_{-0.019}^{+0.022}$ & $0.938_{-0.040}^{+0.036}$ & 10.5/8 \\\\\n-21.43 & low & $-1.31_{-0.37}^{+0.45}$ & $-0.97_{-0.12}^{+0.16}$ & $0.40_{-0.25}^{+0.20}$ & $0.0712_{-0.0066}^{+0.0063}$ & $1.624_{-0.073}^{+0.073}$ & $0.087_{-0.025}^{+0.026}$ & $1.12_{-0.13}^{+0.14}$ & $0.90_{-0.14}^{+0.15}$ & $1.132_{-0.035}^{+0.043}$ & $1.361_{-0.038}^{+0.034}$ & 23.6/8 \n\n \\enddata\n \\tablecomments{\nThe different rows list the $68\\%$ confidence intervals on the model parameters\n(see Eq.~\\ref{eq:model_profile}) given the surface number density data shown in\nFigure~\\ref{fig:obs}.  The $\\chi^2$ per degree of freedom as well as the\ninferred $2$-d and $3$-d splashback radius are also shown in the last three\ncolumns. \n}\n\\end{deluxetable*}\n\nWe will use the affine invariant Markov Chain Monte Carlo sampler of\n\\citet{Goodman:2010}, as implemented in the software package {\\it emcee}\n\\citep{Foreman-Mackey:2013}, in order to sample from the posterior distribution\nof the parameters, $\\log{\\rho_{\\rm s}}$, $\\log{r_{\\rm s}}$, $\\log \\alpha$, $\\log{r_{\\rm t}}$,\n$\\log\\gamma$, $\\log\\beta$, $\\log\\rho_{\\rm o}$ and ${s_{\\rm e}}$, given the galaxy surface\ndensity measurements and the stated priors.\n\nAs a test of our fitting method, in Appendix~\\ref{app:fittest} we apply it to\nprojected number density distributions of (sub)-halos around galaxy clusters in\nnumerical simulations (see below for the details of the simulations)\nand show that we are able to recover the location of the\nsteepening of the three dimensional density distribution of subhalos quite\naccurately with our modelling scheme.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{signal_fit_onepanel.pdf}}\n\\caption{\n        The surface number density profiles, ${\\Sigma_{\\rm g}}(R)$, of our fiducial\n        sample of SDSS photometric galaxies around the two cluster subsamples\n        are shown in the left hand panel. The shaded regions show the 68 and 95\n        percent confidence regions of our model fit to the data. The right\n        hand panel shows the inferred constraints on the logarithmic slope\n        of ${\\Sigma_{\\rm g}}(R)$ for the two subsamples. The splashback radius in $2$d,\n        ${R_{\\rm sp}^{\\rm 2d}}$, corresponds to the location of the steepest slope or the minimum of\n        $d\\log{\\Sigma_{\\rm g}}/d\\log R$. The 68 percent constraints on ${R_{\\rm sp}^{\\rm 2d}}$ are marked\n        with vertical shaded regions. These minima occur at significantly\n        different locations for the two cluster subsamples. The traditional halo\n        boundary, ${R_{\\rm 200m}}$, is marked by the grey dotted vertical line.\n}\n\\label{fig:fit}\n\\end{figure*}\n\\begin{figure} \n\\centering{\n\\includegraphics[scale=1.0]{Derivmin.pdf}}\n\\caption{\n        The posterior distributions for the location of the steepest slope of\n        the galaxy density profiles around the high- and low-${c_{\\rm gal}}$ cluster\n        subsamples are shown in orange and purple colored histograms,\n        respectively.  The light shaded histograms correspond to the location of\n        the steepest slopes of the surface density profiles ($2$-d), while the\n        dark shaded histograms correspond to the location of steepest\n        slope of the $3$-d number density profiles inferred by our fits. The locations of the\n        steepest slopes for the two cluster subsamples are significantly\n        different, implying a different mass accretion rate onto these cluster\n        subsamples.\n}\n\\label{fig:deriv}\n\\end{figure}\n\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Assembly_bias.pdf}}\n\\caption{\n        Detection of the halo assembly bias. {\\it Left panel:}\\/ The ratio of the surface\n        number density profiles of our fiducial samples of photometric\n        galaxies around the two galaxy cluster subsamples. The shaded regions\n        correspond to the $1$- and $2$-sigma confidence regions for a single\n        constant parameter fit to these data.  {\\it Right panel:\\/} The posterior\n        distribution of the ratio given the measurements shown in the left\n        panel. We detect the assembly bias -- difference in the halo biases of the two samples -- at\n        $6.6\\sigma$. There is a significant covariance in the errors, hence the\n        small point-to-point variation given the errors. The quoted significance\n        accounts for the covariance.\n}\n\\label{fig:assembly}\n\\end{figure*}\n\n\\begin{figure} \n\\centering{\n\\includegraphics[scale=1.0]{Derivmin_MDK.pdf}}\n\\caption{\nThe dependence of ${R_{\\rm sp}}/{R_{\\rm 200m}}$ on the accretion rate $\\Gamma$ at $z=0.24$ predicted by $\\Lambda$CDM, shown by a gray line with $5\\%$ uncertainty \\citep{More:2015} . The dark and\nfaint shaded purple (orange) regions display the 68 and 95 percent confidence\nlimits on the splashback radius in 3d for our low- (high-) ${{c_{\\rm gal}}}$ sample. The gray, orange and purple stars \ncorrespond to the typical splashback radii for a typical accretion rate, as well as slow and fast accreting clusters from numerical simulations (see\n text for details). The observed\nvalues of the splashback radii are significantly smaller from the predicted values their halo masses, even if we consider halos with typical\naccretion rates.\n} \n\\label{fig:derivmdk}\n\\end{figure}\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Subhalo_matter_Rsp_Vpeak_comparison_3d.pdf}}\n\\caption{\nComparison between the logarithmic slope of the density profile for matter and\nthat of subhalos selected using different ${{V_{\\rm peak}}}$ thresholds as indicated in\nthe legend. Different panels correspond to halos with different mass accretion\nrates, $\\Gamma$. The arrows indicate the location of the steepest slope, or the\nsplashback radii for the corresponding population, with the longest arrow used\nto represent dark matter. The grey vertical bands corresponds to the fitting\nfunction for ${R_{\\rm sp}}/{R_{\\rm 200m}}$ similar to the one by \\citet{More:2015}, but for the\nmean profiles, and includes an uncertainty of $\\pm5\\%$.\n}\n\\label{fig:sh_matter_rsp_3d}\n\\end{figure*}\n\n\\section{Results}\n\\label{sec:results}\n\\subsection{Splashback in galaxy number density profiles}\n\\label{sec:splashback}\n\nWe begin by presenting how the stacked surface density profile of galaxies,\n${\\Sigma_{\\rm g}}(R)$, around the entire parent sample of {redMaPPer } clusters, described in\nthe previous section, varies with galaxy samples of different absolute magnitude\nthresholds. These measurements are shown in the\ntop panels of Figure~\\ref{fig:obs_all} using points with errorbars. The\nbrightness of the photometric galaxy sample increases from left to right. The\nsolid lines in the bottom panels correspond to the profiles of the logarithmic\nslope of the galaxy surface densities. These slope profiles were obtained by\nusing the Savitzky-Golay algorithm to smooth the observed measurements, by\nfitting a third-order polynomial over a window of five neighbouring points, and\nthen using a cubic spline to interpolate between these smoothed measurements. In\ncontrast with the traditional Savitzky-Golay algorithm, we explicitly account\nfor the covariant errors on these data points, as proposed by\n\\citet{More:2016a}\\footnote{\\url{https://github.com/surhudm/savitzky\\_golay\\_with\\_errors}}.\n\nIn Appendix~\\ref{app:amatch}, we have used subhalo abundance matching to obtain\nan estimate of the approximate ${{V_{\\rm peak}}}$ (the maximum circular velocity of a\nhalo throughout its entire history) value of dark matter subhalos\\footnote{Our\nuse of the term subhalos henceforth includes isolated host halos as well, not\njust satellite halos. We will use the term halos explicitly when referring to\nonly isolated halos.} hosting our photometric galaxies as a function of their\nmagnitude. To compare the observed surface density profiles with those expected\nfrom the standard structure formation model, we utilize Multidark Planck II\n(MDPL2), a $3840^3$ particle cosmological N-body simulation with box size of\n$1h^{-1} {\\rm Gpc}$ and mass resolution of $1.51\\times 10^9h^{-1} M_\\odot$\n\\citep{Klypin:2014}. We also use the associated halo catalogs found using\nRockstar, a halo finder which groups particles into halos using their phase\nspace information \\citep{Behroozi:2013}\\footnote{These catalogs are publicly\navailable at the website \\url{http://www.cosmosim.org}}.\n\nThe dashed lines in the top and bottom panels of Figure~\\ref{fig:obs_all}\ncorrespond to the expected subhalo surface density profiles around clusters in\nthe cosmological simulation Multidark Planck II  at $z=0.248$. We have selected\ncluster sized halos above a mass threshold of $10^{14}{\\>h^{-1} M_\\odot}$, which results in the same\naverage halo mass as that of our sample. We have normalized the surface density\nprofiles in the top panels to match the observations at $\\sim11{\\>h^{-1}{\\rm {Mpc}}}$. There are\nmarked similarities between the density profiles of subhalos in simulations and\nthe galaxies in observations. The surface number densities strongly deviate from\na simple power law and show a clear break on scales of $\\sim1{\\>h^{-1}{\\rm {Mpc}}}$ in both\nobservations and simulations. This is most clearly seen in the bottom panels,\nwhere we see that the profiles reach their steepest slope on scales of\n$\\sim1{\\>h^{-1}{\\rm {Mpc}}}$. This steepening, associated with the splashback radius, is also\nseen in observations, as expected from subhalo surface density profiles in\nsimulations. However, it is also clear that the locations where the surface\ndensity profiles reach their steepest slopes are different between observations\nand simulations, especially for the left and the middle panels. This discrepancy\nbetween the observed and expected splashback radii is also seen for the cluster\nsubsamples, which we investigate at length next. We will extensively\nquantify, comment and explore this discrepancy in the location of splashback\nradius around these cluster subsamples.\n\nThe surface density of photometric galaxies around the low- and high-${c_{\\rm gal}}$\ncluster subsamples are shown in the upper and lower panels of\nFigure~\\ref{fig:obs} using orange and purple symbols with errorbars,\nrespectively. The lighter shades correspond to photometric galaxies with\nbrighter magnitude limits. The solid lines in the upper and lower right hand\npanels of Figure~\\ref{fig:obs} show the logarithmic slope of the surface density\nprofiles around the two subsamples. The slopes for both cluster subsamples\nreach values steeper than $\\sim-1.6$ on either side of $\\sim 1 {\\>h^{-1}{\\rm {Mpc}}}$.  The\nsurface density of galaxies around the high-${{c_{\\rm gal}}}$ cluster subsample reaches\nits steepest slope at a smaller radius compared to the low-${{c_{\\rm gal}}}$ subsample.\nThe value of the steepest slope is considerably larger for the high-${{c_{\\rm gal}}}$\ncluster subsample than the low-${{c_{\\rm gal}}}$ subsample. A comparison between the\nprofiles of galaxies as a function of different magnitude thresholds around any\ngiven cluster subsamples shows very little difference in the location of the\nsteepest slope in projection.\n\nWe fit the galaxy surface density profiles with the model described in the\nprevious section. The median and the 68 percent confidence intervals of the\nposteriors of each of these parameters, as well as the best fit $\\chi^2$ values\nare listed in Table~\\ref{tab:post}. The number of degrees of freedom for our\nmodel is $8$.\n\nWe show the 68 and 95 percent confidence regions from the fits to the surface\ndensity of the fiducial sample of photometric galaxies around both our cluster\nsubsamples in the left hand panel of Figure~\\ref{fig:fit}. The corresponding\nconfidence regions for the logarithmic slope, including marginalization over\nother model parameters, are shown in the right hand panel. We use the samples\nfrom the posterior of the model parameter space to infer the location of the\nsteepest slope of the projected galaxy density profile, ${R_{\\rm sp}^{\\rm 2d}}$, and its\nuncertainty. These numbers are reported for all of our subsamples and for the\ndifferent models in Table~\\ref{tab:post} as well. \n\nThe location of the splashback\nradius can be compared with the traditional halo boundary definition, ${R_{\\rm 200m}}$\nfor each subsample. This is shown by the vertical shaded bands in the right\npanels of Figure~\\ref{fig:obs}, as estimated from the posterior distribution of\nthe halo masses for our two subsamples inferred from the weak lensing\nmeasurement in \\citet{Miyatake:2016}. \n\nWe now use the samples from the posterior distribution of model parameters to\ninfer the constraints on the location of the minimum of the logarithmic\nderivative of the three dimensional galaxy density profile, $d\\log\\rho_{\\rm g}/d\\log r$.\nThe resultant constraints on ${R_{\\rm sp}^{\\rm 3d}}$ are reported in the penultimate column\nof Table~\\ref{tab:post}.  The inferred value of ${R_{\\rm sp}^{\\rm 3d}}$ is always larger than\nthe corresponding ${R_{\\rm sp}^{\\rm 2d}}$ for all photometric galaxy samples around both cluster\nsubsamples, as shown explicitly in Figure~\\ref{fig:deriv}. The vertical dashed\nline corresponds to the traditional halo boundary definition, ${R_{\\rm 200m}}$, for the\ntwo subsamples.\n\nNote that, for our model, a transition function ${f_{\\rm trans}}=1$, would correspond to\na simple density profile: a sum of Einasto profile which describes well the \ninner regions and a power law  profile for the outer\nregions. However, the data strongly disfavor such a model, with $\\chi^2$ values\nranging from $60$ to $140$ for $9$ degrees of freedom depending upon the cluster\nsubsample and the photometric galaxies under consideration \\footnote{There is\nonly 1 additional degree of freedom for these models, as we lose only only one\nfree parameter $r_{\\rm t}$, the other parameters $\\gamma$ and $\\beta$ have\npriors in the fiducial modeling scheme and thus do not change the degrees of\nfreedom.}. Therefore, {\\it our measurements imply a steepening of the number\ndensity profile of galaxies around both of our cluster subsamples beyond that\npredicted by the Einasto profile}.\n\n\\subsection{Detection of Halo Assembly bias}\n\\label{sec:assembly_bias}\n\nThe mean number density profile of galaxies correlated with clusters at large separations\nis proportional to the product of the biases of clusters and galaxies in the\nphotometric sample. We have shown above that these profiles are different for\nthe low- and high-${c_{\\rm gal}}$ cluster subsamples. Given that our cluster samples\nhave the same redshift distribution, the bias of photometric galaxies should\ncancel out in the ratio of the number density profiles, and we can use the ratio\nto test whether the two cluster subsamples have different intrinsic clustering\nbiases, as recently reported by \\citet{Miyatake:2016}.\n\nIn the left hand panel of Figure~\\ref{fig:assembly}, we show the ratio of the\nnumber density profiles for our fiducial sample of photometric galaxies around the\ntwo subsamples of galaxy clusters on scales of $3-40 {\\>h^{-1}{\\rm {Mpc}}}$. We fit a constant\nratio to these measurements accounting for the covariance determined from the\njackknife technique. This assumes that the two samples have similar scale\ndependence for their bias, and the data support this assumption.\nThe posterior distribution of the constant ratio obtained\nusing this procedure is shown in the right hand panel of\nFigure~\\ref{fig:assembly}. We find a $6.6\\sigma$ deviation of the ratio of the\ntwo surface density profiles from unity: $1.48\\pm 0.07$. We have thus detected halo assembly\nbias -- the two cluster subsamples have the same halo mass based on weak\nlensing, but a different large scale halo bias. For comparison, the difference\nin the bias ratio that was obtained in \\citet{Miyatake:2016} using the weak\nlensing signal was $1.64^{+0.31}_{-0.26}$, and that from the auto-correlation\nfunction of galaxy clusters was $1.40\\pm0.09$.  The three different measurements\ngive results which are statistically consistent with each other.\n\n\\section{Comparisons with expectations from $\\Lambda$CDM model}\n\\label{sec:sim_compare}\n\nUsing the projected galaxy number density profiles around two cluster subsamples\nfrom the {redMaPPer } catalog, we have shown that these two subsamples have different\nprofiles, splashback radii, as well as a different clustering bias. We now\ncompare these measurements to the predictions of the concordance cosmological\n$\\Lambda$CDM model.\n\n\\subsection{Is the splashback radius for the two subsamples at the expected location?}\n\nUsing the weak lensing inferred masses for our cluster subsamples, we can\ncompute the baseline expectation for the location of the splashback radius in\nthe standard cosmological model. \nThe ratio ${R_{\\rm sp}^{\\rm 3d}}/{R_{\\rm 200m}}$ is expected to depend upon\nthe accretion rate of the halos as well as redshift \\citep{Diemer:2014,\nAdhikari:2014, More:2015}. To compute the mean accretion rate on to halos, we\nuse halos from MDPL2 at $z=0.248$, closest to the median redshift of our {redMaPPer } subsamples\nand select all halos above a certain halo mass threshold\\footnote{Using a\ncosmological simulation with ${\\Omega_{\\rm m}}=0.27$, we get similar numbers for the\nexpected mass accretion rates.}. We choose the halo mass threshold such that the\naverage halo mass of the sample is consistent with the ${{M_{\\rm 200m}}}$ of the {redMaPPer }\nsubsamples obtained by \\citet{Miyatake:2016}. As a best case expectation, we\ndivide the halo sample into two based on the dependence of the halo mass\naccretion rate on halo mass, $\\Gamma({{M_{\\rm 200m}}})=\\Delta\\log {M_{\\rm vir}}/\\Delta\\log a$.\nThe derivative for $\\Gamma$ is computed using a finite difference scheme using\nthe virial masses at redshift $0.248$ and $0.748$ \\citep{Diemer:2014,\nMore:2015}\\footnote{There is very little difference in the average value of\n$\\Gamma$ if we use a halo mass sample with a threshold on ${N_{\\rm sat}}$}.\n\nIn Figure~\\ref{fig:derivmdk}, we compare the location of the splashback radius\nwith respect to ${R_{\\rm 200m}}$ observed for our cluster subsamples, to the best case\nexpectations implied by these accretion rates. The grey band corresponds to the\nfitting function\n\n", "index": 1, "text": "\\begin{equation}\n        \\frac{{R_{\\rm sp}^{\\rm 3d}}}{{R_{\\rm 200m}}} = 0.58\n        \\left[1+0.63~{\\Omega_{\\rm m}}(z)\\right]\\left(1+1.08\\exp\\left[-\\frac{\\Gamma}{2.26}\\right]\\right)\n        \\label{eq:meanMDK15}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{{R_{\\rm sp}^{\\rm 3d}}}{{R_{\\rm 200m}}}=0.58\\left[1+0.63~{}{\\Omega_{\\rm m%&#10;}}(z)\\right]\\left(1+1.08\\exp\\left[-\\frac{\\Gamma}{2.26}\\right]\\right)\" display=\"block\"><mrow><mfrac><msubsup><mi>R</mi><mi>sp</mi><mrow><mn>3</mn><mo>⁢</mo><mi mathvariant=\"normal\">d</mi></mrow></msubsup><msub><mi>R</mi><mrow><mn>200</mn><mo>⁢</mo><mi mathvariant=\"normal\">m</mi></mrow></msub></mfrac><mo>=</mo><mrow><mn>0.58</mn><mo>⁢</mo><mrow><mo>[</mo><mrow><mn>1</mn><mo>+</mo><mrow><mpadded width=\"+3.3pt\"><mn>0.63</mn></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>1.08</mn><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mfrac><mi mathvariant=\"normal\">Γ</mi><mn>2.26</mn></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06063.tex", "nexttext": "\nwhere $v(t)$ is the relative velocity of the subhalo, $\\rho(r, t)$ is the time\ndependent density profile\nof the cluster halo, ${m_{\\rm dm}}$ is the mass of the dark matter\nparticle and $\\sigma_{\\rm tr}$ is the momentum transfer cross-section\n\\citep{Kahlhoefer:2014}.\n\nWe have carried out simple analytical calculations based on a spherical collapse\nmodel similar to \\citet[][see also \\citealt{Adhikari:2016}]{Adhikari:2014}, but\nincluding a velocity-dependent drag term of the above form. We find that the\nmomentum transfer cross-section required to reduce the splashback radius  by\n$\\approx 20\\%$ can range from $1-20{~\\rm cm^2g^{-1}}$ depending upon the pericenter of\naccreting halos on their first passage through the halo \\citep{More:2016b}. The\nambient dark matter density, the relative velocity, hence the resultant drag,\nreach a maximum at the pericenter. Therefore, a proper treatment of the orbital\nparameters of subhalos expected in the standard structure formation model is\nrequired to determine the effects of dark matter self-interactions on the\nsplashback radius \\citep{Jiang:2014b}. We defer such investigations to a future\npaper.\n\nAlthough the existing constraints on such scenarios are pretty weak, recent\ndiscovery of galaxy displacement with respect to its subhalo in one of the\nclusters \\citep[][]{Harvey:2015} could be a signature of self interaction\n\\citep[with cross section consistent with that required to explain $R_{\\rm sp}$\ndiscrepancy, see][]{Kahlhoefer:2015}.  Numerical simulations of this type of\ndark matter\nself-interaction, similar to the simulations performed for hard-sphere\ninteractions \\citep{Elbert:2015}, would be required to refine the estimate of\nthe cross-sections stated above further.\n\nNote that even if the self interactions will ultimately not turn out to be the\nexplanation for the splashback radius discrepancy, our analysis shows that\nprecise measurements of galaxy distribution in clusters could provide valuable\nand competitive constraints on the cross section of dark matter self\ninteraction. \n\nIf we assume that the differences in the splashback radius we find are not due to\nthe above possibilities and we trust simple dynamics within the gravitational\npotential\n of halos, then our measurements of the smaller splashback radius would\neither require a different phase space structure in the outskirts of cluster\nhalos or extreme mass accretion rates onto our cluster subsamples. The former\npossibility requires the velocities of material in the infall streams to be\nabout 25-30 percent smaller. For the latter possibility, our parent sample of\nclusters requires values of $\\Gamma\\sim4$, while the high-${c_{\\rm gal}}$ sample prefers\nvalues of $\\Gamma\\sim4$. This would represent a serious challenge to the\nstandard cosmological model. Whether modifications to gravity could achieve such\nvalues, while still obeying the bounds from galaxy cluster abundances, needs\nfurther careful evaluation.\n\n\\section{Summary}\n\\label{sec:summary}\n\nWe have used SDSS {redMaPPer } galaxy clusters and photometric galaxies around them\nto observationally investigate the boundaries of galaxy clusters, their relation\nto assembly history, and to halo assembly bias on galaxy cluster scales. For\nthis purpose, we have considered two cluster subsamples defined in\n\\citet{Miyatake:2016} which share identical richness and redshift distribution,\nbut have different internal distributions of cluster members. These subsamples\nwere shown to have similar halo masses as inferred from weak gravitational\nlensing, but have different large scale bias as measured from their large scale\nweak lensing and auto-correlation signals \\citep{Miyatake:2016}. Our\nresults can be summarized as follows:\n\n\\begin{enumerate}\n\n\\item We detect the surface number density profiles of SDSS photometric galaxies\n        with $^{0.1}M_i-5\\log h<-19.43$ around both our cluster subsamples. The\n        surface densities show a sharp steepening around scales of $1 {\\>h^{-1}{\\rm {Mpc}}}$.\n\n\\item We modeled the two surface density profiles using the profile advocated by\n        \\citet{Diemer:2014}, to infer the location of the steepening in\n        projected and real space for both the cluster subsamples. The steepening\n        of the surface density profiles occurs at significantly different\n        locations for the two cluster subsamples. We interpret the steepening as\n        the location of the splashback radius for these galaxy clusters. We\n        attribute the difference in the splashback radii for the cluster\n        subsamples to arise as a result of different accretion rates onto the\n        cluster subsamples. This implies a different assembly history for the two\n        cluster subsamples.\n        \n\\item Using simple subhalo abundance matching, we investigated whether dynamical\n        friction affects the location of the splashback radius of subhalos\n        expected to host our galaxies compared to that of dark matter. For the\n        fiducial subsample, we found that the two radii should coincide within\n        5 percent. Observationally, the location of the steepening of the\n        galaxy density profiles for the two cluster subsamples does not change\n        significantly even for photometric galaxies one or two magnitudes\n        brighter than our fiducial sample.\n\n\\item We showed that the amplitude of clustering of photometric galaxies around\n        our two subsamples of galaxy clusters are different by $6.6\\sigma$. We\n        have thus detected halo assembly bias, a difference in the clustering\n        amplitude of cluster scale halos with the same mass and different\n        assembly histories.\n\n\\item We showed that projection effects could at most cause the two subsamples\n        to have masses different by a factor of $1.6$, which is smaller than\n        the difference required to explain the difference in the splashback\n        radii of the two subsamples, or the different halo biases.\n\n\\item Using a large cosmological $\\Lambda$CDM simulation, we have shown\n        qualitative agreement between the trends in the splashback radius and\n        halo assembly bias, as seen in observations. However, the splashback\n        radii of the two cluster subsamples seem to be smaller, while the\n        assembly bias effect larger, than naive expectations. The tests\n        presented in the paper show that none of the systematics are large\n        enough alone to resolve the discrepancies. If astrophysical systematics\n        related to weak lensing, optical cluster finding, and projection effects\n        can be conclusively ruled out, it will imply either a discrepancy\n        between the observed accretion rates onto clusters from the expected\n        ones, or may hint to a possible interactions in the dark matter sector,\n        both remarkably interesting possibilities. \n\n\\end{enumerate}\n\n\\section{Acknowledgments}\n\nFunding for the SDSS and SDSS-II has been provided by the Alfred P. Sloan\nFoundation, the Participating Institutions, the National Science Foundation, the\nU.S. Department of Energy, the National Aeronautics and Space Administration,\nthe Japanese Monbukagakusho, the Max Planck Society, and the Higher Education\nFunding Council for England. The SDSS Web Site is http://www.sdss.org/.\n\nThe SDSS is managed by the Astrophysical Research Consortium for the\nParticipating Institutions. The Participating Institutions are the American\nMuseum of Natural History, Astrophysical Institute Potsdam, University of Basel,\nUniversity of Cambridge, Case Western Reserve University, University of Chicago,\nDrexel University, Fermilab, the Institute for Advanced Study, the Japan\nParticipation Group, Johns Hopkins University, the Joint Institute for Nuclear\nAstrophysics, the Kavli Institute for Particle Astrophysics and Cosmology, the\nKorean Scientist Group, the Chinese Academy of Sciences (LAMOST), Los Alamos\nNational Laboratory, the Max-Planck-Institute for Astronomy (MPIA), the\nMax-Planck-Institute for Astrophysics (MPA), New Mexico State University, Ohio\nState University, University of Pittsburgh, University of Portsmouth, Princeton\nUniversity, the United States Naval Observatory, and the University of\nWashington.\n\nThe CosmoSim database used in this paper is a service by the Leibniz-Institute\nfor Astrophysics Potsdam (AIP). The MultiDark database was developed in\ncooperation with the Spanish MultiDark Consolider Project CSD2009-00064. The\nMultiDark-Planck II (MDPL2) simulation has been performed in the Supermuc\nsupercomputer at LRZ using time granted by PRACE.\n\nWe acknowledge useful discussions with Simon White, Frank van den Bosch, Andrew\nHearin, Andrew Zentner, Erik Tollerud, Shigeki Matsumoto, Justin Khoury, Mark\nTrodden, Bhuvnesh Jain, Daisuke Nagai and Uros Seljak.\nMT and SM are supported by World Premier International Research Center\nInitiative (WPI Initiative), MEXT, Japan, and by the FIRST program\n`Subaru Measurements of Images and Redshifts (SuMIRe)', CSTP, Japan. SM,\nMT and MO are also supported by Grant-in-Aid for Scientific Research from\nthe JSPS Promotion of Science (No. 15K17600, 23340061, 26610058 and 26800093),\nMEXT Grant-in-Aid for Scientific Research on Innovative Areas (No.\n15H05893, 15K21733, 15H05892) and by JSPS Program for Advancing Strategic\nInternational Networks to Accelerate the Circulation of Talented\nResearchers. HM is supported in part by Japan Society for the\nPromotion of Science (JSPS) Research Fellowships for Young Scientists\nand by the Jet Propulsion Laboratory, California Institute of\nTechnology, under a contract with the National Aeronautics and Space\nAdministration. AK was supported by  by the Kavli Institute for Cosmological\nPhysics at the University of Chicago through grant PHY-1125897 and an endowment\nfrom the Kavli Foundation and its founder Fred Kavli. RyM acknowledges financial\nsupport from the University of Tokyo-Princeton strategic partnership grant. RM\nacknowledges the support of the Department of Energy Early Career Award program.\n\n\n\n\n\n\n\n\\appendix\n\n\\section{Testing methods using simulations}\n\\label{app:fittest}\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.2]{Simulation_compare.pdf}}\n\\caption{\n        Tests of our methodology to determine the splashback radius of clusters.\n        Top left panel: The subhalo surface density profiles around high and low\n        accretion rate clusters in the MDPL2 simulation at z=0 are shown using\n        purple and orange color symbols with errorbars, respectively. The data\n        points for the low accretion rate clusters are shifted by a\n        factor of 2.5\n        for clarity. The 68 and 95 percent confidence intervals based on fitting\n        this data using the DK14 model are shown using shaded regions. Top right\n        panel: The logarithmic derivative of the surface density profiles around\n        the mock cluster subsamples as inferred from a model fit to the data.\n        The vertical shaded bands correspond to the location of the steepening\n        in two dimensions.\n        Bottom left panel: The comparison between the three dimensional subhalo\n        density profiles around our mock clusters, as directly measured and as\n        inferred from the fits to the surface density profiles from the top left\n        panel. Bottom right panel: Comparison between the logarithmic derivative\n        of the three dimensional subhalo density profiles around our mock\n        clusters, as directly measured and as inferred from the fits to the\n        surface density profiles from the top left panel. The 68 percent\n        constraints on the location of the splashback radius are shown using the\n        shaded vertical bands. Our analytical methods can recover the location\n        of the splashback radius in three dimensions.\n}\n\\label{fig:fittest}\n\\end{figure*}\n\nIn this appendix, we use the MultiDark Planck II simulation to test our analysis\nmethods. In particular, we show that we can recover the splashback radius for\nsubhalos in three dimensions using the surface density profiles of subhalos\naround cluster scale halos. \n\nWe use all halos or subhalos in the halo catalogs with $V_{\\rm peak}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ at\n$z=0$\\footnote{See Appendix B for our justification to choose a threshold of\n$135{\\>{\\rm km}\\,{\\rm s}^{-1}}$.}. We compute the projected surface density of these subhalos around\nhalos with masses $M>8.5\\times10^{13}{\\>h^{-1} M_\\odot}$, where the threshold was chosen to\nobtain a sample of halos which share the average weak lensing mass of the {redMaPPer }\nclusters we use in this paper \\footnote{This threshold halo mass is similar to\nthe one used in Section~\\ref{sec:dyn} where we tested effects of dynamical\nfriction using the $z=0$ snapshot.}. We subdivide the sample into two subsamples\nwith different mass accretion rates, $\\Gamma$, using the median mass accretion\nrate-halo mass relation $\\Gamma(M)$.\n\nWe compute the galaxy surface densities around the resultant subsamples by\nprojecting along the entire $z$-axis in the simulation. We subtract the\nbackground surface density mimicking the procedure used to compute the surface\ndensities in the data. The errorbars on these surface densities are obtained\nusing 125 jackknife regions in the simulation box. The resulting surface density\nprofiles and their errorbars are shown in the top left panel of\nFigure~\\ref{fig:fittest}. The measurements in the simulations are carried out\nusing the same binning scheme as employed for the actual data analysis. \n\nWe fit these measured surface density profiles using the projection of the 3d\nDK14 density profile with the exact same priors as detailed in\nSection~\\ref{sec:data}. The 68 and 95 percent confidence intervals on the fit\nare shown using the shaded regions in the top left panel of\nFigure~\\ref{fig:fittest}. The inferred slope of the surface density profiles and\nthe location of the steepest slope in two dimensions are shown in the top right\npanel.\n\nThe points in the bottom left panel correspond to the three dimensional density\nprofiles of these subhalos as measured from the simulation directly. The solid\nlines are used to indicate the three dimensional subhalo density profiles as\npredicted by the best fit to the subhalo surface density profiles in the upper\npanels. Finally, in the bottom right panel we compare the inferred and measured\nlogarithmic slopes of the three dimensional density profiles. This test shows\nthat our analysis methods can reproduce the location of the splashback radius by\nfitting the two dimensional density profiles of subhalos in the simulations.\n\n\\section{Abundance matching constraints on the subhalos hosting photometric\ngalaxies}\n\\label{app:amatch}\n\nWe use the surface number density distribution of photometric galaxies around\nour cluster subsamples to detect the splashback radius. In this appendix, we use\na simple subhalo abundance matching technique to determine the properties of\nsubhalos hosting the photometric galaxies we use in this paper. The left hand\npanel of Figure~\\ref{fig:amatch}, shows  the cumulative abundance of galaxies,\nbased on the Schechter function fit to the $^{0.1}i$-band luminosity function\nfor SDSS galaxies obtained by \\citet{Blanton:2003} \\footnote{The notation\n$^{0.1}i$ stands for magnitude in the $i$-band k-corrected to $z=0.1$.}.\n\nWe k-correct the absolute magnitude limits of the\nphotometric galaxies we use, as well as correct them for the luminosity evolution\nof galaxies (e-correction) from $z=0.24$, the median redshift of our cluster\nsubsamples, to $z=0.1$. We approximate the k-correction as\n\n", "itemtype": "equation", "pos": 72965, "prevtext": "\nwith a 5 percent uncertainty. This fitting function is a good fit to the\nsplashback radii of dark matter halos in simulations used in\n\\citet{More:2015}\\footnote{The fitting function was calibrated in the redshift\nrange [0, 4].}, but corresponds to the mean profiles instead of the median. The grey star\ncorresponds to the typical expected value of $\\Gamma$ for halos in the sample,\nestimated from the simulations, while the orange and purple stars similarly\ncorrespond to the average $\\Gamma$ for the best-case simulation subsamples with\nthe fastest and slowest accretion rates (see above). The data seem to prefer a\nmuch smaller splashback radius for each of our cluster subsamples\n(${R_{\\rm sp}^{\\rm 3d}}/{R_{\\rm 200m}}=0.675^{+0.024}_{-0.021}$ and $0.955\\pm0.035$ for the high- and\nthe low-${c_{\\rm gal}}$ subsamples, respectively), even when compared to the splashback\nradius corresponding to halos with typical $\\Gamma$ for our mass scales. \n\n\\subsection{Does dynamical friction result in a smaller splashback radius?}\n\\label{sec:dyn}\n\nSo far in our analysis, we have identified the splashback radius using the galaxy distribution around\nour cluster subsamples. The splashback radius of galaxies could be different\nfrom that of dark matter due to dynamical friction acting on the subhalos that\nhost our galaxies, provided these subhalos are sufficiently massive \\citep{Adhikari:2016}. In\nwhat follows, we show that the steepening of the three dimensional density\nprofiles for both matter and subhalos that host our fiducial photometric sample\nof galaxies are expected to occur at similar locations. \n\nFor this purpose, we again make use of the halo and subhalo catalogs from the\nMDPL2 simulation. We match the cumulative abundances of dark matter\nsubhalos\nas a function of ${{V_{\\rm peak}}}$ (the maximum circular velocity of a halo throughout\nits entire history) and that of our photometric galaxies as a function of their\nmagnitude, to obtain an estimate of the ${{V_{\\rm peak}}}$ of subhalos hosting our\ngalaxies (see Appendix~\\ref{app:amatch}). The subhalos that host our fiducial subsample of\nphotometric galaxies approximately correspond to subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, while the brighter subsamples correspond to subhalos with ${V_{\\rm peak}} >175\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$ and ${{V_{\\rm peak}}}>280 {\\>{\\rm km}\\,{\\rm s}^{-1}}$, respectively. \n\nFor this analysis, we use the $z=0$ particle snapshot of the\nsimulation\\footnote{Ideally we would have liked to also carry out this exercise\nnear $z=0.24$, but we had only the $z=0$ particle snapshot available.}. We use all halos\nidentified by the 6d phase space halo finder ROCKSTAR \\citep{Behroozi:2013} in\nthe $z=0$ snapshot with halo mass, ${{M_{\\rm 200m}}}$, above $8.5\\times10^{13}{\\>h^{-1} M_\\odot}$ as\nour sample of galaxy clusters. We subdivide these in bins of $\\Gamma=\\Delta\\log\n{M_{\\rm vir}}/\\Delta\\log a$, and compute the three-dimensional density profile of matter\naround them. The derivative for $\\Gamma$ for this particular snapshot was\ncomputed between $z=0$ and $z=0.5$ \\citep{Diemer:2014, More:2015}.\nThe logarithmic slope of the matter density profile around the cluster samples\nare shown in the different panels of Figure~\\ref{fig:sh_matter_rsp_3d} using a\nblack solid line. For reference we also show the expected locations of the\nsplashback radius for each of the subsamples, using Equation~\\ref{eq:meanMDK15}.\nThe fitting function seems to capture the trend observed for the splashback\nradius of dark matter as a function of the accretion rate in the simulation\nreasonably well (within 5 percent).\n\nIn the same figures we also show the logarithmic slopes of subhalo distributions\naround galaxy cluster halos for different ${{V_{\\rm peak}}}$ thresholds obtained from\nour simple subhalo abundance matching method. We observe that the locations of\nthe steepest slope for subhalos with the lowest ${{V_{\\rm peak}}}$ threshold is similar\nto that in dark matter within 5 percent for all the $\\Gamma$ bins shown in the\nfigure. Thus the location\nof the splashback radius is not expected to be significantly different for\nsubhalos hosting our fiducial sample of photometric galaxies. As we consider\n${{V_{\\rm peak}}}$ thresholds corresponding to our brighter subsamples, we see effects of\ndynamical friction acting on the subhalos \\citep[see also][]{Jiang:2014}. The\nsplashback radius of these larger subhalos systematically shifts to smaller\nvalues with increasing $V_{\\rm peak}$ threshold. \n\nWe have tried to maximise the effect of dynamical friction in the above exercise\nby not considering scatter between the luminosity of galaxies and the ${V_{\\rm peak}} $\nof their subhalos while performing abundance matching. We do not see a large\nshift in the splashback radius of the photometric galaxies around any of our\ncluster subsamples as a function of their magnitude threshold. However, this\ndoes not imply that our data rule out dynamical friction acting on the brighter\nsample of photometric galaxies. It is quite likely that there is a reasonably\nlarge scatter between the magnitude and ${{V_{\\rm peak}}}$, which can wash out the\ndynamical friction effect. \n\n\\subsection{Background subtraction and mis-centering uncertainties}\n\\label{sec:background}\n\nWe have used the number density profiles around random points to subtract the\nuncorrelated galaxies in the background and the foreground of our subsamples.\nWe have also tested how residual uncertainties in background subtraction can\naffect our results. As an initial test of uncertainties in the background which\nare constant with radius, we have added in a constant parameter to our model for\nthe projected number density profiles. Even after marginalizing over such a\nparameter, we obtain values for the splashback radii and its uncertainty which\nare very consistent in two dimensions, and virtually identical in three\ndimensions. However, there could be additional background uncertainties which\nvary with the projected distance.\n\nFor example, we expect that the clusters in our subsamples will cause the galaxies in the\nbackground to be magnified \\citep[see e.g.,][]{Umetsu:2011}. We explore the\nchanges to the background due to cluster magnification in\nAppendix~\\ref{app:mag}, and find that the splashback radius is not affected\neven after applying a conservative correction to the background due to the\nmagnification of the clusters. The sky subtraction around bright or highly\nclustered objects can also potentially affect the photometry of galaxies and\nhence the background objects in clusters \\citep{Aihara:2011}. This can also\npartly cancel the magnification effect, as it reduces the number density of\nbackground galaxies in clusters.\n\nMis-centering of central galaxies in  {redMaPPer } clusters could affect the profiles\nand our estimates of the splashback radius. There are two kinds of\nmis-centering: first, a galaxy may be mis-classified as a central by the cluster\nfinder and second, the central galaxy may be physically displaced from the\npotential minimum of the cluster around which all galaxies orbit. To test for\nthe first kind of mis-centering, we have restricted our model fits to scales\n$>400{\\>{h^{-1}{\\rm kpc}}}$ or to using clusters where the most probable central galaxy has\n${p_{\\rm cen}}>0.9$. These restrictions produce fit parameters consistent with those\nlisted in Table~\\ref{tab:post}, especially the position of the splashback\nradius, within the reported uncertainties. \n\nTo test for the second kind of mis-centering, we have also considered all halos\nfrom the MDLP2 simulation used in the previous section, and displaced 40 percent\nof these halos in their positions with an offset drawn from a multivariate\nGaussian distribution with standard deviation equal to\n$400{\\>{h^{-1}{\\rm kpc}}}$\\footnote{This assumes that the {redMaPPer } centering probabilities are\nunreliable and the centering algorithm performs as badly as selecting the\nbrightest galaxy in the cluster, which could result in 40\npercent mis-centering fraction \\citep{Skibba:2011}.}. In each panel\nof Figure~\\ref{fig:sh_matter_rsp_3d}, we have additionally included a dashed\nline which shows the slope of the logarithmic density profiles around such a\nsample of halos. We find that, as expected, in all cases the splashback radius\nwould be overestimated by $\\gtrsim 20\\%$, an effect which goes in the opposite\ndirection required to explain a smaller splashback radius. Moreover, the change\nof slope around the splashback radius is much less pronounced and overall shape\nof the profile is significantly modified.  This is in contrast with the good\nagreement we find between the {\\it shapes} of the predicted and observed slope\nprofiles.  \n\n\\subsection{Could averaging effects result in a smaller splashback radius?}\n\\label{sec:averaging}\n\nWe have used the average halo mass of our subsamples as inferred from weak\nlensing to obtain the average ${R_{\\rm 200m}}$ of our cluster halos to compare with the observed values of the\nsplashback radius, ${R_{\\rm sp}^{\\rm 3d}}$. Could the difference between the ${R_{\\rm sp}^{\\rm 3d}}/{R_{\\rm 200m}}$\nseen in observations and that predicted from simulations arise due to the finite\nwidth of the halo mass distribution? We considered the distribution of halo\nmasses resulting from a threshold sample with the same average halo mass as our\ncluster subsamples. For such samples, we find that the difference between\n$\\left\\langle {R_{\\rm 200m}} \\right\\rangle$ and that inferred from the average halo mass is different by only\n$\\approx 3$ percent, whereas the discrepancy we observe is much\nlarger\\footnote{Using a halo mass sample with a threshold in ${N_{\\rm sat}}$ as in our\ndata, also does not affect this conclusion.}.\n\nWe have also verified that the location of the splashback radius for a threshold\nmass sample does not result in a smaller inferred splashback radius compared to\nthe expectation based on using the average halo mass, and the average mass\naccretion rate onto the halo samples. These tests confirm that the smaller\nvalue for the splashback radius we observe is not likely to be a result of some\naveraging effects.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=0.8]{Assembly_bias_expectation_avr3d_M_1e14_Vpeak135.pdf}}\n\\caption{\nExpectation for halo assembly bias from simulations. {\\it Top left panel}:\nThe average cluster centric distance of member subhalos in cluster sized halos\nin MDPL2 simulation as a function of halo mass. We use the radius to divide the\ncluster sample into two at fixed mass. The two subsamples are shown in orange and purple\ncolors. {\\it Top right panel}: The same subsamples as in the top left panel but in the\ndark matter concentration-halo mass plane. The subhalo distribution seems to\n have very little correlation with the dark matter distribution.\n {\\it Bottom left\npanel}: The ratio of the halo biases of subsamples of halos with masses\n$10^{14}{\\>h^{-1} M_\\odot}$ split using the average distance of their subhalos from\n their centers, $\\left\\langle {{R_{\\rm mem}}^{\\rm 3d}} \\right\\rangle(M_{\\rm 200m})$. The bias ratio obtained from\n cluster-cluster auto-correlations is shown with a solid line, while the dashed\n line corresponds to the ratio obtained from the cross-correlations of\n cluster-scale halos with all subhalos with ${V_{\\rm peak}}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ that are selected\n to mimic the fidual photometric galaxies used in our analysis as in\n Figure~\\ref{fig:obs_all}. {\\it Bottom right panel}: The distribution of the\n mass accretion rates $\\Gamma$ for the two subsamples.\n} \n\\label{fig:assembly_bias_expect}\n\\end{figure*}\n\n\\subsection{What is the systematic error in the weak lensing halo masses?}\n\nOur conclusion that the observed splashback radius is smaller than the\nexpectation from simulations is based on the comparison with the virial radius\nfor weak lensing halo mass inferred by \\citet{Miyatake:2016}. However,\n\\citet{Miyatake:2016} assumed a $\\delta$-function distribution in halo masses to\nmodel the weak lensing measurements for each cluster subsample and infer the\naverage halo mass. Such a simplified fitting to the weak lensing surface mass\ndensity profile is expected to underestimate the virial halo mass by $\\sim10\\%$\ncompared to the mean halo mass of clusters in the sample\n\\citep{Mandelbaum:2005,Becker:2011,Niikura:2015}, or $\\sim3\\%$ in radius. The\ndifference between the measured and expected splashback radii is much larger\nthan such systematic error, and if at all will increase the inconsistency rather\nthan decrease it. The statistical error in the weak lensing masses is less $10$\npercent, so even 2-$\\sigma$ deviations will result in only $\\sim7$ percent\nchange in the expectation in the splashback radius. The errors in the weak\nlensing masses have also been folded in when computing the error on the observed\n${R_{\\rm sp}}/{R_{\\rm 200m}}$ shown in Figure~\\ref{fig:derivmdk}.\n\n\\subsection{Is the halo assembly bias signal consistent with expectations?}\n\nOur observational results indicate that the galaxy cluster subsample with lower\nconcentration of member galaxies has a larger splashback radius (lower accretion\nrate $\\Gamma$), and a larger halo bias. Is the sense and the amplitude of the halo\nassembly bias signal we see consistent with expectations from cosmological\nsimulations of cold dark matter?\n\nVarious proxies such as formation time scales of halos or their dark matter\nconcentrations have been used in the literature to quantify halo assembly bias.\nThe sense of the halo assembly bias effect varies depending upon the assembly\nproxy used. For example, \\citet{Gao:2005} find that halo assembly bias is\nstrongest for low mass galaxy scale halos, and that the earliest forming halos\ncluster more strongly than the average for their halo masses. However, they find that\nthe effect almost disappears on the mass scales we consider in our paper. On the\ncontrary, when the concentration of halos is used as a proxy, halo assembly bias\nmanifests itself at both galaxy scales and galaxy cluster scales\n\\citep{Wechsler:2006}. At galaxy scales (masses below $10^{12}{\\>h^{-1} M_\\odot}$) high\nconcentration halos (which form earlier) have a larger halo bias, but the trend\nreverses on galaxy cluster scales, as expected from the relation between mass\naccretion history and the curvature of initial density peaks \\citep{Dalal:2008}.\n\n\\citet{Li:2008} explored eight different definitions of halo assembly and found\nthat the connection between formation time and assembly bias of halos can be\ntotally washed out or even reversed depending upon the proxy used. Member galaxy\nconcentration has never been explored previously in the literature as a proxy\nfor assembly history. Therefore, we use the MDPL2 simulation to explore the\nextent of the assembly bias expected when using it as a proxy. We ignore all\nobservational complications, and investigate how the clustering of halos at\nfixed halo mass varies as a function of the concentration of the subhalo\ndistribution belonging to the halos. \n\nWe use all isolated halos with ${{M_{\\rm 200m}}}>10^{14}{\\>h^{-1} M_\\odot}$ at $z=0.248$ from MDPL2.\nThis threshold in halo mass at $z=0.248$ allows us to match the average weak lensing mass of\nour cluster subsamples\\footnote{Note that this threshold is slightly larger\nthan the threshold used used in Section~\\ref{sec:dyn} at $z=0.0$. Both\nthresholds ensure that we match the average weak lensing mass from observations.}. To compute the average projected separation between\ncluster members and halo centers, we use all subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, similar to the threshold used for the faintest of our\nphotometric galaxies. We divide the sample into halves based on the\n3-d cluster centric distance of the subhalos of each cluster as shown in the top\nleft panel of Figure~\\ref{fig:assembly_bias_expect}. The top right panel of the\nfigure shows the scatter plot of dark matter concentrations of our halos given\ntheir halo masses and implies that the concentration of dark matter and\nconcentration of subhalos are not well correlated. \n\nThe ratio of the halo bias obtained from the auto-correlation function of\ncluster halos in the two subsamples is shown in the bottom left panel of\nFigure~\\ref{fig:assembly_bias_expect} with the orange solid line, while that\nobtained from the cross-correlation with halos with ${V_{\\rm peak}}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ is shown\nwith a dashed line. For comparison, the observed ratio between the biases of our\ncluster subsamples is shown with the grey shaded region.  Subsample divisions\nbased on $\\left\\langle {{{R_{\\rm mem}}^{\\rm 3d}}} \\right\\rangle({N_{\\rm sat}^{\\rm 3d}})$, give very similar amplitude for\nthis ratio at larger radius when using auto-correlations, but with weaker scale\ndependence.  Finally, the bottom right panel shows the distributions of the mass\naccretion rates onto these clusters.\n\nThe halo assembly bias signal we observe in data is in the same sense, albeit\nstronger, than that seen in simulations\\footnote{The preliminary\ninvestigations mentioned in \\citet{Miyatake:2016} which seemed to suggest larger\nassembly bias signal, were mistakenly performed using a larger mass threshold by\nSM. The results presented in this paper override those preliminary\ninvestigations.}. The division in the mass accretion rates is also in the same\nsense as required to explain the splashback radius measurements seen in the\ndata. These results from simulations show that it is possible to obtain samples\nof halos with a lower average accretion rate that have a larger clustering\nsignal as seen in our observations.\n\nOnce projection effects are accounted for (as in Section~\\ref{sec:projection}),\nand the sample is divided based upon $\\left\\langle {{{R_{\\rm mem}}^{\\rm 2d}}} \\right\\rangle({N_{\\rm sat}^{\\rm 2d}})$, an even smaller\nvalue for the halo assembly bias signal is obtained in simulations. Given that\nthe strength of the halo assembly bias signal increases with halo mass, one\ncould potentially reproduce the result by using larger mass scales in\nsimulations. However this will further worsen the problem of the smaller\nsplashback radius. Characterization of the halo assembly bias signal with\ndifferent richness threshold samples and theoretical investigations using larger\nsimulations are currently ongoing and will be reported in a future publication.\n\n\\subsection{Projection effects}\n\\label{sec:projection}\n\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.0]{Projection_effects.pdf}}\n\\caption{\n        Estimates of projection effects. Left panel: The scatter plot of\n        ${M_{\\rm 200m}}$ of halos as a function of their richness determined in\n        projection. The richness of cluster halos in projection is computed by\n        assigning smaller (sub)halos as satellites if they lie within a projected\n        radius of ${R_{\\rm 200m}}$ and within $\\pm50 {\\>h^{-1}{\\rm {Mpc}}}$ of a larger halo along\n        the line-of-sight. To maximize projection effects, we assume the two\n        subsamples separated by the median ${{M_{\\rm 200m}}}-{N_{\\rm sat}^{\\rm 2d}}$ relation\n        shown by the dashed line. Right panel: The halo mass distributions of\n        the two cluster subsamples shown in the left panel. The average halo\n        masses are expected to be different by at most a factor of $1.66$ when we\n        maximize the projection effects.\n}\n\\label{fig:projection}\n\\end{figure*}\n\nOne possible way to explain the different splashback radii and halo biases for our\ntwo cluster subsamples, could be that the two SDSS cluster subsamples in reality have\ndifferent masses. The weak lensing mass estimates, taken at face value, restrict this\npossibility. However, the weak lensing signal is only sensitive to the\nprojected mass distribution. The cluster subsample identification also has a\nvery poor resolution in the line-of-sight direction. Therefore, we explore the\npossibility that our subsamples indeed have different $3$-d masses regardless of\nthe similarity of the weak lensing signal, and the richness of the clusters.\n\nTo address the magnitude of projection effects, we again resort to the MDPL2\nsimulation. We consider all halos with  ${{M_{\\rm 200m}}}>10^{13} {\\>h^{-1} M_\\odot}$ as potential\nclusters identified from the photometric data\\footnote{We have chosen a slightly lower halo mass threshold for\nthis test since projection effects can upscatter smaller halos to have a larger\nrichness than expected for their halo masses.}. We associate all halos/subhalos with ${{V_{\\rm peak}}}>135 {\\>{\\rm km}\\,{\\rm s}^{-1}}$ to be\nsatellite galaxies of these potential galaxy clusters if they lie within a\nprojected radius of ${R_{\\rm 200m}}$ from their centers, and have a line of sight\nseparation less than $50 {\\>h^{-1}{\\rm {Mpc}}}$. The projected separation lengths of $\\pm 50\n{\\>h^{-1}{\\rm {Mpc}}}$ was obtained by considering the scatter in the colors of red sequence\ngalaxies used to identify {redMaPPer } galaxy clusters, and the amount of variation of\nthese colors as a function of redshift \\citep[see Figures 1 and 7\nin][]{Rykoff:2014}.  If subhalos can belong to two clusters after the\nprojection, we assign it to the most massive halo. We do not redefine or\nrecompute the cluster centers after these projections as we expect that the\n{redMaPPer } centering algorithm is less likely to identify the galaxies in projection\nas centrals for the {redMaPPer } clusters. \n\nIn the left hand panel of Figure~\\ref{fig:projection}, we show the scatter plot\nof ${M_{\\rm 200m}^{\\rm 3d}}$ as a function of ${N_{\\rm sat}^{\\rm 2d}}$, i.e., the\nnumber of satellites associated with these cluster sized halos after the\nreassignment described above. To maximize the strength of projection effect, we\nmake the extreme assumption that our two cluster subsamples select the upper and\nthe lower half of ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed ${N_{\\rm sat}^{\\rm 2d}}$. The\ndistributions of the ${M_{\\rm 200m}^{\\rm 3d}}$ selected in this manner are\ndisplayed in the right hand panel of Figure~\\ref{fig:projection}. The average\nhalo masses corresponding to the two distributions are different by $\\sim62\\%$,\nwhich implies a difference of at most $\\sim 20\\%$ in the radii.  In\ncontrast, the observed difference in the radii is twice as large, $\\sim40\\%$. We\nexpect the extent of projection effects to be lower, given that the average\ncluster centric distances for the satellites are not expected to be perfectly\ncorrelated with ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed ${N_{\\rm sat}^{\\rm 2d}}$. Furthermore, due to halo\nassembly bias effects in simulations, the sample with larger ${M_{\\rm 200m}^{\\rm 3d}}$ at fixed\n${N_{\\rm sat}^{\\rm 2d}}$ turns out to have a smaller clustering signal, opposite of what is\nrequired to simultaneously explain both the different splashback radius and the\nsense of the assembly bias signal.\n\nThus, we have established that the two subsamples have splashback radii and halo\nbiases that differ from one another by an amount that cannot be explained with\nthe help of projection effects alone. In Appendix~\\ref{app:proj}, we show that\nboth of our cluster subsamples have very similar distributions of the axis\nratios of the light profiles for the most probable central galaxies, similar\nellipticity distributions for satellite galaxies, and similar line-of-sight\nvelocity dispersions. The similarity of these distributions is inconsistent with\nthe trends expected, if the projection effects were behind  the large magnitude\nof assembly bias signal or the difference in the splashback radii between the\ntwo subsamples divided by $\\left\\langle {R_{\\rm mem}} \\right\\rangle$.\n\n\n\\section{Discussion}\n\\label{sec:discuss}\n\nIn Section~\\ref{sec:results}, we showed that the surface number density profiles\nof galaxies around {redMaPPer } clusters exhibit steepening characteristic of the\nsplashback radius expected to arise in dark matter halos due to the caustic\nformed by matter at the first apocenter after accretion.  Moreover, we showed\nthat subsamples of the clusters of the same mass split on concentration of the\ngalaxy distribution exhibit different splashback radii and different spatial\nbias.\n\nAlthough comparisons with theoretical expectations\npresented in Section~\\ref{sec:sim_compare} show that the observed profiles and\ntrends agree with predictions qualitatively, there are significant quantitative\ndiscrepancies. First, the observed splashback radii are significantly smaller than\nexpected for halos corresponding to cluster masses of our sample, and second, the difference\nin biases of cluster subsamples is also larger than expected. Both discrepancies\nare very interesting because the location of the splashback radius is a result of \nsimple gravitational dynamics and can be both robustly predicted from simulations \n\\citep{Diemer:2014,More:2015} and reproduced even in simple spherical \ncollapse models  \\citep{Adhikari:2014}. Likewise, halo assembly bias is expected\nto reflect the statistics of peaks in the initial density field from which\nmassive cluster-sized halos form \\citep{Dalal:2008}. We will postpone the\ndiscussion of the larger magnitude of halo assembly bias to a future paper where\nwe will quantify with larger simulations the extent of this discrepancy. We\nfocus on the splashback radius discrepancy below.\n\nWe consider four possible explanations for the discrepancies in the splashback\nradius -- (a) the halo mass ${{M_{\\rm 200m}}}$ and hence the radius ${R_{\\rm 200m}}$ inferred from\nthe data is larger than it really is, and this causes our measurements of\n${R_{\\rm sp}}/{R_{\\rm 200m}}$ to be biased low, (b) the splashback radius of the clusters for a\ngiven accretion rate measured using galaxies is smaller than that expected from\ndark matter simulations, (c) the mass accretion rate onto clusters is much\nhigher than expected for clusters of this mass, and, finally, (d) that new physics in the\nform of self interactions of dark matter particles results in decrease of the \nsplashback radius. We discuss each of these possibilities in turn.\n\nThe ratio between the splashback radius of the two cluster subsamples is roughly\nconsistent with the best case expectations from the $\\Lambda$CDM simulation\nof the Planck cosmology (the ratio between the\nsplashback radii corresponding to the orange and purple stars in\nFigure~\\ref{fig:derivmdk}). Let us\nassume that our observational proxy results in the best case split, a\nvery optimistic assumption, and that the weak lensing masses are overestimated.\nIn that case, the discrepancy seen in the splashback radius for the two cluster\nsubsamples is $\\sim1.4$ in radii, thus a factor of $\\sim 2.75$ in halo masses,\nstrongly disfavored by the small errors on the masses from weak lensing. Under\nthis scenario, we would have uncovered a critical problem for weak lensing\ncalibration of observable halo mass relations which are important for precision\ncosmological measurements using galaxy clusters. Moreover, even if we assume\nthat the masses are overestimated for both samples, this would mean that the\npredicted assembly bias strength would be even lower. Such arguments thus run in\nthe opposite sense of what is required to explain the large assembly bias\nsignal. \n\nIf weak lensing systematics can be ruled out, one could try to explain the discrepancy\nif the mass accretion rate onto the clusters is normal, but the splashback\nradius is indeed smaller than expected. Dynamical friction on subhalos was an\nobvious physical effect which could cause this. However, in\nSection~\\ref{sec:dyn}, we have shown that the subhalos corresponding to the\nfaintest magnitude bin we consider are not expected to experience a large amount\nof dynamical friction. Also, puzzlingly, in the data we do not detect a significant difference in the\nsplashback radius with the brightness of the photometric sample used. Furthermore, future deeper surveys should be able to rule\nout this possibility by using even fainter galaxies. Other astrophysical\npossibilities include subtle biases in the photometric galaxy samples, which\nlead to a preferential selection of slow moving galaxies in our sample. For\nexample, ram pressure stripping is expected to be more effective in stripping out gas\nand shutting down the star formation in fast moving galaxies, thus removing them\npreferentially from our photometric sample. Detection of the splashback radius\nof matter in clusters using the weak lensing signal would be able to test this\npossibility.\n\nDark matter self-interactions have long been proposed to alleviate problems on\nsmall scales in the standard cosmological model \\citep[see\ne.g.,][]{Spergel:2000}. Under certain conditions discussed below the drag force\ndue to interactions between dark matter particles of subhalos and cluster halo\ncould lead to loss of orbital energy by subhalos even on the first crossing,\nthereby reducing the splashback radius. \n\nFor isotropic elastic scattering, we do not expect dark matter self-interactions\nto significantly affect the splashback feature, because the upper limits on such\nan interaction cross-section are sufficiently stringent to ensure that most dark\nmatter particles do not experience any scattering events during a single orbit\n\\citep{Gnedin:2001, Randall:2008}.  Of the few subhalo particles that do\nscatter, most are ejected from their subhalos, since the orbital velocities of\nsubhalos within massive hosts are typically larger than the internal escape\nvelocities of those subhalos. Therefore we would expect evaporation of subhalo\nmasses, without a significant drag for isotropic scattering.\n\nOn the other hand, if dark matter self-interactions are anisotropic, with large\ncross-sections for small angle scattering and low cross-sections otherwise, then\nthe momentum transfer during dark matter interactions\nmay not necessarily be large enough to ensure ejection. The small angle\nscattering cross-sections could then be large enough for dark matter particles\nto experience frequent interactions and yet obey the bounds on subhalo\nevaporation. The subhalos would experience a net deceleration given by\n\n", "index": 3, "text": "\\begin{equation}\n        d = \\frac{\\rho(r, t) v(t)^2 \\sigma_{\\rm tr}}{2{m_{\\rm dm}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"d=\\frac{\\rho(r,t)v(t)^{2}\\sigma_{\\rm tr}}{2{m_{\\rm dm}}}\" display=\"block\"><mrow><mi>d</mi><mo>=</mo><mfrac><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>v</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi>σ</mi><mi>tr</mi></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>m</mi><mi>dm</mi></msub></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.06063.tex", "nexttext": "\nfound by fitting the k-correction as a function of redshift using the SDSS main\nsample of spectroscopic galaxies. We have ignored the residual color dependent\nscatter in this relation. These $k+e$ corrected magnitude limits for our\nphotometric subsamples are shown with vertical dashed lines, while the\nhorizontal dashed lines show their cumulative abundances. We do not assume any\nscatter between ${{V_{\\rm peak}}}$ and magnitude, to obtain a limit on the maximum\neffect that dynamical friction can have, and match these abundances directly to\nthose of subhalos as a function of ${{V_{\\rm peak}}}$. The result of this simple subhalo\nabundance matching exercise is shown in the right hand panel of\nFigure~\\ref{fig:amatch}. \n\nThe abundance matching implied that the subhalos hosting our fiducial subsample\nof photometric galaxies approximately correspond to subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, while the brighter subsamples correspond to subhalos with ${V_{\\rm peak}} >175\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$ and ${{V_{\\rm peak}}}>280 {\\>{\\rm km}\\,{\\rm s}^{-1}}$, respectively. In Section~\\ref{sec:dyn}, these\nabundance matching constraints are used to explore how dynamical friction is\nexpected to affect the location of the splashback radius for our subsamples.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.2]{mi.pdf}}\n\\caption{\n        Left panel: The cumulative abundance of SDSS galaxies as a function of\n        their $i$-band magnitude from \\citet{Blanton:2003}. The dotted vertical\n        lines correspond to the magnitude limits of our photometric samples of\n        galaxies k-corrected and evolution corrected to $z=0.24$, the median\n        redshift of the sample. The horizontal lines give the cumulative\n        abundances. Right panel: The cumulative abundances of subhalos in MDPL2\n        simulation as a function of ${{V_{\\rm peak}}}$. The horizontal dotted lines are\n        the cumulative abundances of our photometric samples taken from the left\n        panel, while the vertical dashed lines give the ${{V_{\\rm peak}}}$ thresholds\n        corresponding to our photometric subsamples. These ${V_{\\rm peak}}$ thresholds\n        are used to test dynamical friction effects on the location of the\n        splashback radius (see Figure~\\ref{fig:sh_matter_rsp_3d}).\n}\n\\label{fig:amatch}\n\\end{figure*}\n\n\\begin{figure*} \n\\includegraphics[scale=0.85]{Figure_1p44_compare.pdf}\n\\includegraphics[scale=0.85]{Ellipticity.pdf}\n\\includegraphics[scale=0.85]{Ellipticity_satellite.pdf}\n\\caption{\n        Left panel: The distributions of line-of-sight velocities of\n        spectroscopic galaxies from SDSS around most probable {redMaPPer } central\n        galaxies in the two subsamples.  Middle panel: The distributions of the\n        axis ratios of the light profiles in the $i$ band for the most probable\n        centrals in the two cluster subsamples are shown. Right panel: The\n        distributions of the axis ratios of the satellite distributions around\n        the most probable centrals in the two cluster subsamples are shown.  We\n        do not see a large differences between our two cluster subsamples for\n        any of these statistics.\n}\n\\label{fig:further_tests}\n\\end{figure*}\n\n\n\n\\section{Additional investigations regarding projection and halo orientation effects}\n\\label{app:proj}\n\nGalaxy cluster halos are expected to be triaxial, and if the major axis of\nclusters in one of our subsamples were preferentially aligned along the\nline-of-sight, we could overestimate the halo mass of that particular subsample\n\\citep[see e.g.,][]{Oguri:2005}. We have performed the following tests to\nevaluate such possibility. Any attempts to explain the halo assembly bias signal\nbased on projection or orientation effects, should also satisfy these\nobservational constraints.\n\nWe have utilized the spectroscopic coverage of the SDSS-DR12 LOWZ galaxy sample to\ninvestigate the velocity distributions of such galaxies around our cluster\nsubsamples. If one of our subsamples is heavily affected by projection effects,\nthen the velocity distributions around the two subsamples should reveal\ndifferences. The {redMaPPer } cluster catalog contains spectroscopic redshifts for 3037\n(2830) most probable central galaxies in the high- (low-) ${c_{\\rm gal}}$ subsamples. We\nshow the $P(\\Delta V)$ distribution of all spectroscopic galaxies within a\nprojected radius of ${R_{\\rm 200m}}$ of the cluster center in the left hand panel of\nFigure~\\ref{fig:further_tests}. We find very little evidence, if any, of a\ndifference between the two distributions.\n\nThe photometric major axis of central galaxies has been reported to have a preferential\nalignment with the major axis of the dark matter halo, albeit with a reasonable\nscatter \\citep[see e.g.,][]{EvansBridle:2009,Ogurietal:2010,Oguri:2012}. If one of our subsamples (the high-${c_{\\rm gal}}$ subsample) had\nmajor axis which were preferentially aligned with the line-of-sight, we expect\nthe BCG ellipticities of that sample to be rounder than the other. In the middle\nhand panel of\nFigure~\\ref{fig:further_tests}, we show the axis ratio distributions of the light distribution\nin various SDSS bands as reported by the SDSS photometric pipeline, of the most\nprobable central galaxies in our two subsamples. These axis ratios were computed\nby fitting a deVaucouleurs profile to the two-dimensional image of each object\nin each band \\citep{Stoughton:2002}. We do not see any strong evidence for a\ndifference in the axis ratios of the most probable central galaxies between the\ntwo cluster subsamples.\n\nThe satellite galaxy distribution is also expected to have a preferential\nalignment with the major axis of the dark matter halo \\citep[see\ne.g.,][]{Zentner:2005, Kang:2007}. We compute the second moment of the projected\nsatellite galaxy distribution around our cluster subsamples using the membership\nprobabilities of all member galaxies as reported in the {redMaPPer } catalog. We use\nthese second moments to compute the major and minor axis, and their axis ratios,\naround the most probable central galaxies.  In the right hand panel of\nFigure~\\ref{fig:further_tests},\nwe show the axis ratio distributions of the member galaxy distributions. Again\nwe see very little difference between the two cluster subsamples.\n\n\\section{Magnification due to clusters}\n\\label{app:mag}\n\nThe background density of photometric galaxies behind clusters is expected to be\ndifferent from the background density around random points due to magnification\neffects by galaxy clusters. We consider a simple estimate of this effect based\non the weak lensing mass estimate of our clusters. The magnification changes the\nnumber counts in two ways: firstly, fainter galaxies can now enter our sample\nafter being magnified by the cluster, secondly, the background galaxies occupy a\nsmaller solid angle behind the cluster than in the absence of magnification.\n\nFor simplicity, we assume that all our clusters are located at the median\nredshift of our subsample. We assume that background galaxies follow the\nluminosity function presented by \\citet{Blanton:2003}. The number of galaxies\nthat will be observed at a projected distance $R$ from the cluster is then given by\n\n", "itemtype": "equation", "pos": 88624, "prevtext": "\nwhere $v(t)$ is the relative velocity of the subhalo, $\\rho(r, t)$ is the time\ndependent density profile\nof the cluster halo, ${m_{\\rm dm}}$ is the mass of the dark matter\nparticle and $\\sigma_{\\rm tr}$ is the momentum transfer cross-section\n\\citep{Kahlhoefer:2014}.\n\nWe have carried out simple analytical calculations based on a spherical collapse\nmodel similar to \\citet[][see also \\citealt{Adhikari:2016}]{Adhikari:2014}, but\nincluding a velocity-dependent drag term of the above form. We find that the\nmomentum transfer cross-section required to reduce the splashback radius  by\n$\\approx 20\\%$ can range from $1-20{~\\rm cm^2g^{-1}}$ depending upon the pericenter of\naccreting halos on their first passage through the halo \\citep{More:2016b}. The\nambient dark matter density, the relative velocity, hence the resultant drag,\nreach a maximum at the pericenter. Therefore, a proper treatment of the orbital\nparameters of subhalos expected in the standard structure formation model is\nrequired to determine the effects of dark matter self-interactions on the\nsplashback radius \\citep{Jiang:2014b}. We defer such investigations to a future\npaper.\n\nAlthough the existing constraints on such scenarios are pretty weak, recent\ndiscovery of galaxy displacement with respect to its subhalo in one of the\nclusters \\citep[][]{Harvey:2015} could be a signature of self interaction\n\\citep[with cross section consistent with that required to explain $R_{\\rm sp}$\ndiscrepancy, see][]{Kahlhoefer:2015}.  Numerical simulations of this type of\ndark matter\nself-interaction, similar to the simulations performed for hard-sphere\ninteractions \\citep{Elbert:2015}, would be required to refine the estimate of\nthe cross-sections stated above further.\n\nNote that even if the self interactions will ultimately not turn out to be the\nexplanation for the splashback radius discrepancy, our analysis shows that\nprecise measurements of galaxy distribution in clusters could provide valuable\nand competitive constraints on the cross section of dark matter self\ninteraction. \n\nIf we assume that the differences in the splashback radius we find are not due to\nthe above possibilities and we trust simple dynamics within the gravitational\npotential\n of halos, then our measurements of the smaller splashback radius would\neither require a different phase space structure in the outskirts of cluster\nhalos or extreme mass accretion rates onto our cluster subsamples. The former\npossibility requires the velocities of material in the infall streams to be\nabout 25-30 percent smaller. For the latter possibility, our parent sample of\nclusters requires values of $\\Gamma\\sim4$, while the high-${c_{\\rm gal}}$ sample prefers\nvalues of $\\Gamma\\sim4$. This would represent a serious challenge to the\nstandard cosmological model. Whether modifications to gravity could achieve such\nvalues, while still obeying the bounds from galaxy cluster abundances, needs\nfurther careful evaluation.\n\n\\section{Summary}\n\\label{sec:summary}\n\nWe have used SDSS {redMaPPer } galaxy clusters and photometric galaxies around them\nto observationally investigate the boundaries of galaxy clusters, their relation\nto assembly history, and to halo assembly bias on galaxy cluster scales. For\nthis purpose, we have considered two cluster subsamples defined in\n\\citet{Miyatake:2016} which share identical richness and redshift distribution,\nbut have different internal distributions of cluster members. These subsamples\nwere shown to have similar halo masses as inferred from weak gravitational\nlensing, but have different large scale bias as measured from their large scale\nweak lensing and auto-correlation signals \\citep{Miyatake:2016}. Our\nresults can be summarized as follows:\n\n\\begin{enumerate}\n\n\\item We detect the surface number density profiles of SDSS photometric galaxies\n        with $^{0.1}M_i-5\\log h<-19.43$ around both our cluster subsamples. The\n        surface densities show a sharp steepening around scales of $1 {\\>h^{-1}{\\rm {Mpc}}}$.\n\n\\item We modeled the two surface density profiles using the profile advocated by\n        \\citet{Diemer:2014}, to infer the location of the steepening in\n        projected and real space for both the cluster subsamples. The steepening\n        of the surface density profiles occurs at significantly different\n        locations for the two cluster subsamples. We interpret the steepening as\n        the location of the splashback radius for these galaxy clusters. We\n        attribute the difference in the splashback radii for the cluster\n        subsamples to arise as a result of different accretion rates onto the\n        cluster subsamples. This implies a different assembly history for the two\n        cluster subsamples.\n        \n\\item Using simple subhalo abundance matching, we investigated whether dynamical\n        friction affects the location of the splashback radius of subhalos\n        expected to host our galaxies compared to that of dark matter. For the\n        fiducial subsample, we found that the two radii should coincide within\n        5 percent. Observationally, the location of the steepening of the\n        galaxy density profiles for the two cluster subsamples does not change\n        significantly even for photometric galaxies one or two magnitudes\n        brighter than our fiducial sample.\n\n\\item We showed that the amplitude of clustering of photometric galaxies around\n        our two subsamples of galaxy clusters are different by $6.6\\sigma$. We\n        have thus detected halo assembly bias, a difference in the clustering\n        amplitude of cluster scale halos with the same mass and different\n        assembly histories.\n\n\\item We showed that projection effects could at most cause the two subsamples\n        to have masses different by a factor of $1.6$, which is smaller than\n        the difference required to explain the difference in the splashback\n        radii of the two subsamples, or the different halo biases.\n\n\\item Using a large cosmological $\\Lambda$CDM simulation, we have shown\n        qualitative agreement between the trends in the splashback radius and\n        halo assembly bias, as seen in observations. However, the splashback\n        radii of the two cluster subsamples seem to be smaller, while the\n        assembly bias effect larger, than naive expectations. The tests\n        presented in the paper show that none of the systematics are large\n        enough alone to resolve the discrepancies. If astrophysical systematics\n        related to weak lensing, optical cluster finding, and projection effects\n        can be conclusively ruled out, it will imply either a discrepancy\n        between the observed accretion rates onto clusters from the expected\n        ones, or may hint to a possible interactions in the dark matter sector,\n        both remarkably interesting possibilities. \n\n\\end{enumerate}\n\n\\section{Acknowledgments}\n\nFunding for the SDSS and SDSS-II has been provided by the Alfred P. Sloan\nFoundation, the Participating Institutions, the National Science Foundation, the\nU.S. Department of Energy, the National Aeronautics and Space Administration,\nthe Japanese Monbukagakusho, the Max Planck Society, and the Higher Education\nFunding Council for England. The SDSS Web Site is http://www.sdss.org/.\n\nThe SDSS is managed by the Astrophysical Research Consortium for the\nParticipating Institutions. The Participating Institutions are the American\nMuseum of Natural History, Astrophysical Institute Potsdam, University of Basel,\nUniversity of Cambridge, Case Western Reserve University, University of Chicago,\nDrexel University, Fermilab, the Institute for Advanced Study, the Japan\nParticipation Group, Johns Hopkins University, the Joint Institute for Nuclear\nAstrophysics, the Kavli Institute for Particle Astrophysics and Cosmology, the\nKorean Scientist Group, the Chinese Academy of Sciences (LAMOST), Los Alamos\nNational Laboratory, the Max-Planck-Institute for Astronomy (MPIA), the\nMax-Planck-Institute for Astrophysics (MPA), New Mexico State University, Ohio\nState University, University of Pittsburgh, University of Portsmouth, Princeton\nUniversity, the United States Naval Observatory, and the University of\nWashington.\n\nThe CosmoSim database used in this paper is a service by the Leibniz-Institute\nfor Astrophysics Potsdam (AIP). The MultiDark database was developed in\ncooperation with the Spanish MultiDark Consolider Project CSD2009-00064. The\nMultiDark-Planck II (MDPL2) simulation has been performed in the Supermuc\nsupercomputer at LRZ using time granted by PRACE.\n\nWe acknowledge useful discussions with Simon White, Frank van den Bosch, Andrew\nHearin, Andrew Zentner, Erik Tollerud, Shigeki Matsumoto, Justin Khoury, Mark\nTrodden, Bhuvnesh Jain, Daisuke Nagai and Uros Seljak.\nMT and SM are supported by World Premier International Research Center\nInitiative (WPI Initiative), MEXT, Japan, and by the FIRST program\n`Subaru Measurements of Images and Redshifts (SuMIRe)', CSTP, Japan. SM,\nMT and MO are also supported by Grant-in-Aid for Scientific Research from\nthe JSPS Promotion of Science (No. 15K17600, 23340061, 26610058 and 26800093),\nMEXT Grant-in-Aid for Scientific Research on Innovative Areas (No.\n15H05893, 15K21733, 15H05892) and by JSPS Program for Advancing Strategic\nInternational Networks to Accelerate the Circulation of Talented\nResearchers. HM is supported in part by Japan Society for the\nPromotion of Science (JSPS) Research Fellowships for Young Scientists\nand by the Jet Propulsion Laboratory, California Institute of\nTechnology, under a contract with the National Aeronautics and Space\nAdministration. AK was supported by  by the Kavli Institute for Cosmological\nPhysics at the University of Chicago through grant PHY-1125897 and an endowment\nfrom the Kavli Foundation and its founder Fred Kavli. RyM acknowledges financial\nsupport from the University of Tokyo-Princeton strategic partnership grant. RM\nacknowledges the support of the Department of Energy Early Career Award program.\n\n\n\n\n\n\n\n\\appendix\n\n\\section{Testing methods using simulations}\n\\label{app:fittest}\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.2]{Simulation_compare.pdf}}\n\\caption{\n        Tests of our methodology to determine the splashback radius of clusters.\n        Top left panel: The subhalo surface density profiles around high and low\n        accretion rate clusters in the MDPL2 simulation at z=0 are shown using\n        purple and orange color symbols with errorbars, respectively. The data\n        points for the low accretion rate clusters are shifted by a\n        factor of 2.5\n        for clarity. The 68 and 95 percent confidence intervals based on fitting\n        this data using the DK14 model are shown using shaded regions. Top right\n        panel: The logarithmic derivative of the surface density profiles around\n        the mock cluster subsamples as inferred from a model fit to the data.\n        The vertical shaded bands correspond to the location of the steepening\n        in two dimensions.\n        Bottom left panel: The comparison between the three dimensional subhalo\n        density profiles around our mock clusters, as directly measured and as\n        inferred from the fits to the surface density profiles from the top left\n        panel. Bottom right panel: Comparison between the logarithmic derivative\n        of the three dimensional subhalo density profiles around our mock\n        clusters, as directly measured and as inferred from the fits to the\n        surface density profiles from the top left panel. The 68 percent\n        constraints on the location of the splashback radius are shown using the\n        shaded vertical bands. Our analytical methods can recover the location\n        of the splashback radius in three dimensions.\n}\n\\label{fig:fittest}\n\\end{figure*}\n\nIn this appendix, we use the MultiDark Planck II simulation to test our analysis\nmethods. In particular, we show that we can recover the splashback radius for\nsubhalos in three dimensions using the surface density profiles of subhalos\naround cluster scale halos. \n\nWe use all halos or subhalos in the halo catalogs with $V_{\\rm peak}>135{\\>{\\rm km}\\,{\\rm s}^{-1}}$ at\n$z=0$\\footnote{See Appendix B for our justification to choose a threshold of\n$135{\\>{\\rm km}\\,{\\rm s}^{-1}}$.}. We compute the projected surface density of these subhalos around\nhalos with masses $M>8.5\\times10^{13}{\\>h^{-1} M_\\odot}$, where the threshold was chosen to\nobtain a sample of halos which share the average weak lensing mass of the {redMaPPer }\nclusters we use in this paper \\footnote{This threshold halo mass is similar to\nthe one used in Section~\\ref{sec:dyn} where we tested effects of dynamical\nfriction using the $z=0$ snapshot.}. We subdivide the sample into two subsamples\nwith different mass accretion rates, $\\Gamma$, using the median mass accretion\nrate-halo mass relation $\\Gamma(M)$.\n\nWe compute the galaxy surface densities around the resultant subsamples by\nprojecting along the entire $z$-axis in the simulation. We subtract the\nbackground surface density mimicking the procedure used to compute the surface\ndensities in the data. The errorbars on these surface densities are obtained\nusing 125 jackknife regions in the simulation box. The resulting surface density\nprofiles and their errorbars are shown in the top left panel of\nFigure~\\ref{fig:fittest}. The measurements in the simulations are carried out\nusing the same binning scheme as employed for the actual data analysis. \n\nWe fit these measured surface density profiles using the projection of the 3d\nDK14 density profile with the exact same priors as detailed in\nSection~\\ref{sec:data}. The 68 and 95 percent confidence intervals on the fit\nare shown using the shaded regions in the top left panel of\nFigure~\\ref{fig:fittest}. The inferred slope of the surface density profiles and\nthe location of the steepest slope in two dimensions are shown in the top right\npanel.\n\nThe points in the bottom left panel correspond to the three dimensional density\nprofiles of these subhalos as measured from the simulation directly. The solid\nlines are used to indicate the three dimensional subhalo density profiles as\npredicted by the best fit to the subhalo surface density profiles in the upper\npanels. Finally, in the bottom right panel we compare the inferred and measured\nlogarithmic slopes of the three dimensional density profiles. This test shows\nthat our analysis methods can reproduce the location of the splashback radius by\nfitting the two dimensional density profiles of subhalos in the simulations.\n\n\\section{Abundance matching constraints on the subhalos hosting photometric\ngalaxies}\n\\label{app:amatch}\n\nWe use the surface number density distribution of photometric galaxies around\nour cluster subsamples to detect the splashback radius. In this appendix, we use\na simple subhalo abundance matching technique to determine the properties of\nsubhalos hosting the photometric galaxies we use in this paper. The left hand\npanel of Figure~\\ref{fig:amatch}, shows  the cumulative abundance of galaxies,\nbased on the Schechter function fit to the $^{0.1}i$-band luminosity function\nfor SDSS galaxies obtained by \\citet{Blanton:2003} \\footnote{The notation\n$^{0.1}i$ stands for magnitude in the $i$-band k-corrected to $z=0.1$.}.\n\nWe k-correct the absolute magnitude limits of the\nphotometric galaxies we use, as well as correct them for the luminosity evolution\nof galaxies (e-correction) from $z=0.24$, the median redshift of our cluster\nsubsamples, to $z=0.1$. We approximate the k-correction as\n\n", "index": 5, "text": "\\begin{equation}\n        ^{0.1}k(z) = -2.5 \\log_{10}\\left[\\frac{z+1.3}{1.1(0.1+1.3)}\\right]\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{}^{0.1}k(z)=-2.5\\log_{10}\\left[\\frac{z+1.3}{1.1(0.1+1.3)}\\right]\\,,\" display=\"block\"><mrow><mrow><mrow><mmultiscripts><mi>k</mi><mprescripts/><none/><mn>0.1</mn></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mn>2.5</mn><mo>⁢</mo><mrow><msub><mi>log</mi><mn>10</mn></msub><mo>⁡</mo><mrow><mo>[</mo><mfrac><mrow><mi>z</mi><mo>+</mo><mn>1.3</mn></mrow><mrow><mn>1.1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>0.1</mn><mo>+</mo><mn>1.3</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06063.tex", "nexttext": "\nwhere $\\mu$ denotes the magnification due to the cluster at a projected distance\n$R$, and \n\n", "itemtype": "equation", "pos": 95955, "prevtext": "\nfound by fitting the k-correction as a function of redshift using the SDSS main\nsample of spectroscopic galaxies. We have ignored the residual color dependent\nscatter in this relation. These $k+e$ corrected magnitude limits for our\nphotometric subsamples are shown with vertical dashed lines, while the\nhorizontal dashed lines show their cumulative abundances. We do not assume any\nscatter between ${{V_{\\rm peak}}}$ and magnitude, to obtain a limit on the maximum\neffect that dynamical friction can have, and match these abundances directly to\nthose of subhalos as a function of ${{V_{\\rm peak}}}$. The result of this simple subhalo\nabundance matching exercise is shown in the right hand panel of\nFigure~\\ref{fig:amatch}. \n\nThe abundance matching implied that the subhalos hosting our fiducial subsample\nof photometric galaxies approximately correspond to subhalos with ${{V_{\\rm peak}}}>135\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$, while the brighter subsamples correspond to subhalos with ${V_{\\rm peak}} >175\n{\\>{\\rm km}\\,{\\rm s}^{-1}}$ and ${{V_{\\rm peak}}}>280 {\\>{\\rm km}\\,{\\rm s}^{-1}}$, respectively. In Section~\\ref{sec:dyn}, these\nabundance matching constraints are used to explore how dynamical friction is\nexpected to affect the location of the splashback radius for our subsamples.\n\n\\begin{figure*} \n\\centering{\n\\includegraphics[scale=1.2]{mi.pdf}}\n\\caption{\n        Left panel: The cumulative abundance of SDSS galaxies as a function of\n        their $i$-band magnitude from \\citet{Blanton:2003}. The dotted vertical\n        lines correspond to the magnitude limits of our photometric samples of\n        galaxies k-corrected and evolution corrected to $z=0.24$, the median\n        redshift of the sample. The horizontal lines give the cumulative\n        abundances. Right panel: The cumulative abundances of subhalos in MDPL2\n        simulation as a function of ${{V_{\\rm peak}}}$. The horizontal dotted lines are\n        the cumulative abundances of our photometric samples taken from the left\n        panel, while the vertical dashed lines give the ${{V_{\\rm peak}}}$ thresholds\n        corresponding to our photometric subsamples. These ${V_{\\rm peak}}$ thresholds\n        are used to test dynamical friction effects on the location of the\n        splashback radius (see Figure~\\ref{fig:sh_matter_rsp_3d}).\n}\n\\label{fig:amatch}\n\\end{figure*}\n\n\\begin{figure*} \n\\includegraphics[scale=0.85]{Figure_1p44_compare.pdf}\n\\includegraphics[scale=0.85]{Ellipticity.pdf}\n\\includegraphics[scale=0.85]{Ellipticity_satellite.pdf}\n\\caption{\n        Left panel: The distributions of line-of-sight velocities of\n        spectroscopic galaxies from SDSS around most probable {redMaPPer } central\n        galaxies in the two subsamples.  Middle panel: The distributions of the\n        axis ratios of the light profiles in the $i$ band for the most probable\n        centrals in the two cluster subsamples are shown. Right panel: The\n        distributions of the axis ratios of the satellite distributions around\n        the most probable centrals in the two cluster subsamples are shown.  We\n        do not see a large differences between our two cluster subsamples for\n        any of these statistics.\n}\n\\label{fig:further_tests}\n\\end{figure*}\n\n\n\n\\section{Additional investigations regarding projection and halo orientation effects}\n\\label{app:proj}\n\nGalaxy cluster halos are expected to be triaxial, and if the major axis of\nclusters in one of our subsamples were preferentially aligned along the\nline-of-sight, we could overestimate the halo mass of that particular subsample\n\\citep[see e.g.,][]{Oguri:2005}. We have performed the following tests to\nevaluate such possibility. Any attempts to explain the halo assembly bias signal\nbased on projection or orientation effects, should also satisfy these\nobservational constraints.\n\nWe have utilized the spectroscopic coverage of the SDSS-DR12 LOWZ galaxy sample to\ninvestigate the velocity distributions of such galaxies around our cluster\nsubsamples. If one of our subsamples is heavily affected by projection effects,\nthen the velocity distributions around the two subsamples should reveal\ndifferences. The {redMaPPer } cluster catalog contains spectroscopic redshifts for 3037\n(2830) most probable central galaxies in the high- (low-) ${c_{\\rm gal}}$ subsamples. We\nshow the $P(\\Delta V)$ distribution of all spectroscopic galaxies within a\nprojected radius of ${R_{\\rm 200m}}$ of the cluster center in the left hand panel of\nFigure~\\ref{fig:further_tests}. We find very little evidence, if any, of a\ndifference between the two distributions.\n\nThe photometric major axis of central galaxies has been reported to have a preferential\nalignment with the major axis of the dark matter halo, albeit with a reasonable\nscatter \\citep[see e.g.,][]{EvansBridle:2009,Ogurietal:2010,Oguri:2012}. If one of our subsamples (the high-${c_{\\rm gal}}$ subsample) had\nmajor axis which were preferentially aligned with the line-of-sight, we expect\nthe BCG ellipticities of that sample to be rounder than the other. In the middle\nhand panel of\nFigure~\\ref{fig:further_tests}, we show the axis ratio distributions of the light distribution\nin various SDSS bands as reported by the SDSS photometric pipeline, of the most\nprobable central galaxies in our two subsamples. These axis ratios were computed\nby fitting a deVaucouleurs profile to the two-dimensional image of each object\nin each band \\citep{Stoughton:2002}. We do not see any strong evidence for a\ndifference in the axis ratios of the most probable central galaxies between the\ntwo cluster subsamples.\n\nThe satellite galaxy distribution is also expected to have a preferential\nalignment with the major axis of the dark matter halo \\citep[see\ne.g.,][]{Zentner:2005, Kang:2007}. We compute the second moment of the projected\nsatellite galaxy distribution around our cluster subsamples using the membership\nprobabilities of all member galaxies as reported in the {redMaPPer } catalog. We use\nthese second moments to compute the major and minor axis, and their axis ratios,\naround the most probable central galaxies.  In the right hand panel of\nFigure~\\ref{fig:further_tests},\nwe show the axis ratio distributions of the member galaxy distributions. Again\nwe see very little difference between the two cluster subsamples.\n\n\\section{Magnification due to clusters}\n\\label{app:mag}\n\nThe background density of photometric galaxies behind clusters is expected to be\ndifferent from the background density around random points due to magnification\neffects by galaxy clusters. We consider a simple estimate of this effect based\non the weak lensing mass estimate of our clusters. The magnification changes the\nnumber counts in two ways: firstly, fainter galaxies can now enter our sample\nafter being magnified by the cluster, secondly, the background galaxies occupy a\nsmaller solid angle behind the cluster than in the absence of magnification.\n\nFor simplicity, we assume that all our clusters are located at the median\nredshift of our subsample. We assume that background galaxies follow the\nluminosity function presented by \\citet{Blanton:2003}. The number of galaxies\nthat will be observed at a projected distance $R$ from the cluster is then given by\n\n", "index": 7, "text": "\\begin{equation}\n        N(R| z_{\\rm l}, z_{\\rm s}) = \\int dz_{\\rm s} \\frac{dV}{dz_{\\rm s}}\n        \\frac{1}{\\mu(R|z_{\\rm l}, z_{\\rm s})} \n        \\Phi\\left(M<M_{\\rm max}'|z_{\\rm s}\\right)\n        \\label{eq:mag}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"N(R|z_{\\rm l},z_{\\rm s})=\\int dz_{\\rm s}\\frac{dV}{dz_{\\rm s}}\\frac{1}{\\mu(R|z_%&#10;{\\rm l},z_{\\rm s})}\\Phi\\left(M&lt;M_{\\rm max}^{\\prime}|z_{\\rm s}\\right)\" display=\"block\"><mrow><mi>N</mi><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">|</mo><msub><mi>z</mi><mi mathvariant=\"normal\">l</mi></msub><mo>,</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>d</mi><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>V</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub></mrow></mfrac><mfrac><mn>1</mn><mrow><mi>μ</mi><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">|</mo><msub><mi>z</mi><mi mathvariant=\"normal\">l</mi></msub><mo>,</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mi mathvariant=\"normal\">Φ</mi><mrow><mo>(</mo><mi>M</mi><mo>&lt;</mo><msubsup><mi>M</mi><mi>max</mi><mo>′</mo></msubsup><mo stretchy=\"false\">|</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mo>)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06063.tex", "nexttext": "\nHere $M_{\\rm max}$ corresponds to a maximum absolute magnitude for galaxies that\nend up in our subsample. In the paper, we have considered three different thresholds,\n$M_{\\rm max}-5\\log h=-19.43$, $-20.43$ and $-21.43$. The above equation accounts\nfor the fact that we have assumed the redshift of the photometric galaxies to be\nequal to that of the lens redshift while converting their apparent magnitudes to\nabsolute magnitudes. We additionally k+e correct $M_{\\rm max}$ to $z=0.1$ as the\nluminosity function we use is based on such k+e corrected magnitudes. \n\nIn Figure~\\ref{fig:magbias}, we plot the ratio between the number counts\nobtained by using Eq~\\ref{eq:mag} with $\\mu$ obtained for a halo of mass ${M_{\\rm 200m}}$\nthat matches the weak lensing estimate for our cluster subsamples. We see that\ndue to the magnification of our clusters, we should be underestimating our\nbackground at smaller radii by 5 to 10 percent, depending upon the photometric\nsample under consideration, although the corrections to the background near the\nsplashback radii is about 1 percent. To check for the systematic effect arising from\nmagnification effects, we multiply the number counts around random points by this\nratio before subtracting them from the number of galaxies around our cluster\nsubsamples. Note that this is a conservative estimate of the effect, because\nthis factor should only be applied to the background galaxies, where as the\nnumber of galaxies around random points also consist of foreground galaxies. We\nhave confirmed that the location of the splashback radius is insensitive to such\na change. If at all it is expected to be lowered by such a change, given that we\nare underestimating the background.\n\n\n\\begin{figure} \n\\centering{\n\\includegraphics[scale=1.2]{Figure_magnification_bias.pdf}}\n\\caption{\n        Magnification effects on the background estimation: The ratio of the\n        number counts of background galaxies behind a cluster compared to that\n        around random points, for the three different photometric samples we use\n        in the paper. On scales of interest for the splashback radius the\n        corrections to the background estimate are at the percent level. We have\n        checked that the splashback radius estimates are not affected by such\n        small changes to the background.\n}\n\\label{fig:magbias}\n\\end{figure}\n\n\n\n\n\\bibliographystyle{apj}\n\\bibliography{sf}\n\n\n", "itemtype": "equation", "pos": 96273, "prevtext": "\nwhere $\\mu$ denotes the magnification due to the cluster at a projected distance\n$R$, and \n\n", "index": 9, "text": "\\begin{equation}\n        M_{\\rm max}' = M_{\\rm max} - 5.0 \\log_{10} (D_l[z_{\\rm s}]/\n        D_l[z_{\\rm l}]) + 2.5 \\log_{10} \\mu(R|z_{\\rm l}, z_{\\rm s})\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm max}^{\\prime}=M_{\\rm max}-5.0\\log_{10}(D_{l}[z_{\\rm s}]/D_{l}[z_{\\rm l}%&#10;])+2.5\\log_{10}\\mu(R|z_{\\rm l},z_{\\rm s})\\,.\" display=\"block\"><mrow><msubsup><mi>M</mi><mi>max</mi><mo>′</mo></msubsup><mo>=</mo><msub><mi>M</mi><mi>max</mi></msub><mo>-</mo><mn>5.0</mn><msub><mi>log</mi><mn>10</mn></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>D</mi><mi>l</mi></msub><mrow><mo stretchy=\"false\">[</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">]</mo></mrow><mo>/</mo><msub><mi>D</mi><mi>l</mi></msub><mrow><mo stretchy=\"false\">[</mo><msub><mi>z</mi><mi mathvariant=\"normal\">l</mi></msub><mo stretchy=\"false\">]</mo></mrow><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mn>2.5</mn><msub><mi>log</mi><mn>10</mn></msub><mi>μ</mi><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">|</mo><msub><mi>z</mi><mi mathvariant=\"normal\">l</mi></msub><mo>,</mo><msub><mi>z</mi><mi mathvariant=\"normal\">s</mi></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}]