[{"file": "1601.05260.tex", "nexttext": "\nwhere $\\mathcal{L}_{ex}$ defines the coupling to an incoherent radiation field which excites the system from the ground state to the exciton manifold, $\\mathcal{L}_{relax}$ describes relaxation rates between the exciton states using modified Redfield theory \\cite{Zhang1998,Yang2002}, $\\mathcal{L}_{CT}$ defines initial and secondary CT processes using Marcus/F\\\"{o}rster theory \\cite{Forster1965,Yang2002} and $\\mathcal{L}_{leads}$ describes coupling of the system to the leads. As explained in the methods section, from this Liouvillian the full counting statistics can be calculated using Eq. \\ref{Nth-cumulant} and enforcing both the Coulomb blockade regime such that probability of two electron occupancy is negligible\\cite{Bagrets2003}, and the infinite bias limit enforcing unidirectional electron flow\\cite{Marcos2010}.\n\nThe current counting statistics depends on the induced voltage across a load connecting the states $|\\alpha\\rangle$ and $|\\beta\\rangle$ with associated energy gap $E_{\\alpha\\beta} = E_{\\alpha} - E_{\\beta}$. As usually done in photocells\\cite{Shockley1961}, such a voltage is estimated via a detailed balance condition where the ratio between the steady state populations of the secondary CT state ($\\rho_{\\alpha\\alpha}$) and the `empty' state ($\\rho_{\\beta\\beta}$) is equilibrated at a temperature $T$:\n\n\n", "itemtype": "equation", "pos": 14918, "prevtext": "\n\n\\title{How a structured vibrational environment controls the performance of a photosystem II reaction centre-based photocell}\n\n\\author{Richard Stones}\n\\affiliation{Department of Physics and Astronomy, University College London, Gower Street, London, WC1E 6BT United Kingdom.}\n\\author{Hoda Hossein-Nejad}\n\\affiliation{Department of Physics and Astronomy, University College London, Gower Street, London, WC1E 6BT United Kingdom.}\n\\author{Rienk van Grondelle}\n\\affiliation{Department of Physics and Astronomy, VU University, 1081 HV Amsterdam, The Netherlands}\n\\author{Alexandra Olaya-Castro}\n\\email{a.olaya@ucl.ac.uk}\n\\affiliation{Department of Physics and Astronomy, University College London, Gower Street, London, WC1E 6BT United Kingdom.}\n\n\\begin{abstract}\nPhotosynthetic reaction centres are pigment-protein complexes that can transform photo-induced electronic excitations into stable charge separated states with near-unit quantum efficiency. Here we consider a theoretical photovoltaic device that places a single photosystem II reaction centre between electrodes to investigate how the mean photo-current and its fluctuations depend on the vibrational environment that assists energy and electron transfer. Our results indicate that selective coupling to well resolved vibrational modes does not necessarily offer an advantage in terms of power output but does lead to photo-currents with suppressed noise levels. The exciton manifold and the structured vibrations assisting electron transfer can also support the emergence of a phenomenon akin to dynamical channel blockade, whereby excitonic traps can impose competing routes for population transfer under steady state operation. Our results help characterizing the device-like functionality of these complexes for their potential integration into molecular-scale photovoltaics.\n\\end{abstract}\n\n\\maketitle\n\n\\section*{Introduction}\n\nLife on Earth is fueled by photosynthesis, the process by which plants, algae and certain bacteria convert solar energy into stable chemical energy \\cite{Blankenship2001}. The initial electron transfer steps during solar energy conversion by these organisms take place in photosynthetic reaction centres (PRCs), sophisticated trans-membrane supramolecular pigment-protein complexes that exhibit a dual device-like functionality. Under illumination, a PRC complex effectively operates as Nature's solar cell\\cite{Blankenship2001} where electronic excitations of chromophores are transformed into stable charge-separated states, with electron donor and electron acceptor separated by a few nanometres. This sub-picosecond charge separation process occurs with near unit quantum efficiency implying that almost every quanta of energy absorbed results in charge separated across the PRC \\cite{Blankenship2011,Wientjes2013}. The same chromophore-protein structure and energetic landscape promoting  this quantum yield also favours a diode-like behaviour of all PRCs such that under an appropriate applied bias, electric  current flows mostly in one direction \\cite{Kamran2015}.  Their functional versatility, nanometre size, and near-unit quantum efficiency  makes PRCs promising components of the next-generation of photovoltaic and photoelectrochemical cells \\cite{Yehezkeli2014,Gratzal2001} as well as of biomolecular electronics\\cite{Kamran2015,Reiss2007,Mikayama2006}.\n\nA step further in this field is the recent development of single-molecule techniques that allow measurement of the photocurrent through a single PRC complex\\cite{Gerster2012}. Using cysteine group mutations, it has been possible to bind a Photosystem I unit to a scanning probe gold-tip that acts as both an electrode and a localized light source to excite and measure the photocurrent of a fully functional PRC\\cite{Gerster2012}.  These experiments open up a new platform to carry out further investigations on the microscopic principles underlying charge separation in PRCs. In particular, it is foreseeable that besides measuring the current-voltage features these techniques may allow characterisation of current fluctuations and the associated full counting statistics of electron transport in PRCs. In quantum transport setups it has been shown that such fluctuations can reveal unknown intrinsic dynamical features of the quantum system through which electron transport occurs, including the influence of electron-phonon interactions and coherence  \\cite{Belzig2005}. A theoretical study along the lines of full counting statistics for light-harvesting complexes has been carried out\\cite{HosseinNejad2013} but so far there has been no investigation of full counting statistics of charge transport in PRCs.\n\nCharge separation in reaction centres has been subject to extensive spectroscopic studies such that there is a wealth of knowledge about electron transfer kinetics and charge separation pathways in PRCs isolated from different organisms. Despite these efforts, however, the detailed quantum mechanical features underpinning this process are still unclear and under scrutiny. Both steady-state and multi-dimensional optical spectroscopy have revealed that the formation of stable charge separated states in bacterial and plant reaction centres is strongly affected by the coupling of electronic degrees of freedom to a wide range of vibrational motions \\cite{Renger2011,Novoderezhkin2005,Novoderezhkin2004}. Recent works, reporting picosecond lasting quantum beats among exciton-charge transfer states in the  photosystem II reaction centre (PSIIRC) argue that such phenomena is supported by the coupling of the excited state to underdamped intramolecular vibrations\\cite{Romero2014}. The possible implications of such vibrations for the electric current output of a single PRC are unknown.\n\nIn this work we envision a photocell device where a single PSIIRC is placed between two electrodes and investigate the effects of structured vibrational motions in the photo-induced current and current noise under continuous illumination. Our results show that the noise strength, as quantified by the Fano Factor, effectively probes both the structure of exciton manifold and the structured phonon-environment assisting charge separation. The exciton manifold guarantees a multi-step population transfer process leading to sub-Poissonian statistics. By comparing the situations of a smooth vibrational environment as opposite to one  structured with well resolved vibrational motions, we show that selective coupling to underdamped vibrational modes does not necessarily offer an advantage in terms of power output but they lead to output currents with suppressed noise levels. This indicates that underdamped vibrations coupled to charge separation promote 'ordered' electron transport. Furthermore we show that under these steady state operation, excitons localized in the non-active branch together with the structured environment can support competing dynamical processes during charge separation, resulting in a transition from sub- to super-Poissonian electron current statistics. This phenomenon is akin to dynamical channel blockade observed in solid-state systems \\cite{Belzig2005}. Overall our work enables the formulation of several design principles for the optimisation of PRCs to be integrated in nano-electronic or photovoltaic applications.\n\n\\section*{Results}\n\n\\begin{figure*}[ht]\n\\centering\n\\includegraphics[scale=0.3]{PSIIRC_schematic_charge_transfer_cycle.eps}\n\\caption{\\textbf{Photosystem II reaction centre schematic model.} (a) Schematic diagram of the photocell device setup with isolated PSIIRC unit. (b) Charge transfer cycle for our model. (i) Neutral ground state of the system after an electron has been replenished at the special pair. (ii) Excited state manifold after excitation by a photon. (iii) Primary charge transfer state of the Chl$_{D1}$ charge separation pathway. (iv) Secondary charge transfer state. (v) Positively charged state after an electron has been removed from the system.}\n\\label{fig:photocell}\n\\end{figure*}\n\n\\begin{figure*}[ht]\n\\centering\n\\includegraphics[scale=0.3]{PSIIRC_energy_levels_spectral_densities.eps}\n\\caption{\\textbf{Photosystem II reaction centre microscopic model.} (a) Energy level diagram showing state space of the model. Modified Redfield rates are used to describe relaxation between exciton states (labelled $|e_n\\rangle$). Generalised F\\\"{o}rster theory (GFT) / Marcus theory is used to model charge transfer rates. Phenomenological rates are indicated with red arrows. The transition $|\\alpha\\rangle \\rightarrow |\\beta\\rangle$ represents hopping of an electron from the system to the drain lead. $|\\beta\\rangle \\rightarrow |g\\rangle$ represents an electron hopping from the source lead into the system. The ground state is coupled to a radiation field exciting the system to the lowest energy exciton state $|e_1\\rangle$. (b) The components of the spectral density used in the model. The Drude part is scaled relative to the high energy part for clarity. Mode parameters are shown in Supplementary Table S1.}\n\\label{fig:model}\n\\end{figure*}\n\n\\subsection*{A photocell based on the photosystem II reaction centre}\n\nThe prototype complex we consider is the PSIIRC found in higher plants and algae \\cite{Blankenship2001}.  Crystallography has provided the arrangement of the chromophores involved in primary charge transfer \\cite{Umena2011}. As illustrated in Fig. \\ref{fig:photocell} (a), four chlorophylls (Chls) and two pheophytins (Phe) are arranged in two branches (D$_1$ and D$_2$), where D$_1$ and D$_2$ label the chlorophyll binding proteins in the core of the reaction centre. The two central chlorophylls are known as the special pair (P$_{D1}$ and P$_{D2}$) and they are flanked by the accessory chlorophylls Chl$_{D1}$ and Chl$_{D2}$, and the pheophytins Phe$_{D1}$ and Phe$_{D2}$. Charge separation only occurs down the D$_1$ branch \\cite{Diner2002,Steffen1994}.  Nonlinear spectroscopy has revealed that at least two different excited states, \n(P$_{D1}$P$_{D2}$Chl$_{D1})^{*}$ and (Chl$_{D1}$Phe$_{D1}$)$^{*}$,  give rise to two\n different pathways for charge separation along the D$_1$ branch \\cite{Romero2010,Novoderezhkin2005,Novoderezhkin2011} where the likelihood  of each depends on  the specific protein configuration and the corresponding disorder of pigment excitation energies \\cite{Romero2010}. \n\nAlthough the relative contribution of these pathways in ensemble measurements is not conclusively known, \nspectroscopy at low temperature and its corresponding theoretical fit indicate that electron transfer is predominantly initiated from the state (Chl$_{D1}$Phe$_{D1}$)$^{*}$ \\cite{Novoderezhkin2011}. Our analysis therefore focuses on the Chl$_{D1}$ pathway. Chl$_{D1}$ is the lowest energy pigment and \n sufficiently strong inter-pigment electronic couplings lead to formation of delocalized exciton states\nupon photo-excitation. This pathway can therefore be identified as the population of an exciton state with the largest amplitude in the pair (Chl$_{D1}$Phe$_{D1}$)$^{*}$ which channels energy to an initial charge transfer (CT)  state $|\\textrm{Chl}_{D1}^{+}\\textrm{Phe}_{D1}^{-}\\rangle$ and finally towards a stable or secondary CT state $|\\textrm{P}_{D1}^{+} \\textrm{Phe}_{D1}^{-}\\rangle$, with electron and hole residing on different pigments as illustrated in Fig. \\ref{fig:photocell}(b).  We consider the exciton and CT state space as well as the quantum dynamical evolution that has provided a good description for both steady-state and transient spectroscopy while reproducing the experimentally measured time scales during primary charge separation \\cite{Novoderezhkin2005,Novoderezhkin2011,Romero2014}. This model describes charge separation dynamics  via rate equations of population transfer combining modified Redfield theory and generalized F\\\"{o}rster theory \\cite{Novoderezhkin2011} as we illustrate it in Fig. \\ref{fig:model} (a). Within this picture formation of the final charge separated state is strongly influenced by the competing rates of relaxation among exciton states and rates of transfer from such excitons to the intermediate CT state. Population transfer rates reflect the interplay between the electronic interactions, among excited pigments and between these and CT states, and the interaction between electronic states and a wide range of vibrational motions assisting charge separation. Indeed, fluorescence line narrowing experiments have given evidence of a highly structured spectral density of fluctuations associated to electronically excited chromophores \\cite{Peterman1998} as shown in  Fig. \\ref{fig:model} (b).  Thus in this work we examine two key questions: (i)  \\textit{how does the statistics of  electrons flowing through this PRC witness the exciton manifold leading to charge separation?} and (ii) \\textit{how is such statistics affected by the structured vibrational environment assisting transitions among electronic states.}\n\nTo address the above questions, we consider a theoretical photocell device in which a single PSIIRC unit is placed between two leads that can supply or take away electrons from the system, as illustrated in  Fig. \\ref{fig:photocell} (a). The charge transfer cycle represented in Fig. \\ref{fig:photocell}(b) assumes that electrons are pumped from the left lead at rate $\\Gamma_L$ and leave the system from the right  lead at rate $\\Gamma_R$ while the sample is incoherently photo-excited at rate $\\gamma_{ex}$. We use values of $\\Gamma_L =$ 201cm$^{-1}$ and $\\gamma_{ex} = \\gamma n = 75$cm$^{-1}$ for the upwards rate, where $\\gamma = 0.00125$cm$^{-1}$ and n = 60000, to simulate excitation by concentrated solar radiation \\cite{Dorfman2013}. $\\Gamma_R$ will be varied to change the voltage between the system and the drain lead. The state space of the PSIIRC-based photocell is shown in  Figure \\ref{fig:model} (a). In this model we include all six core reaction centre chromophores distributed in the D$_1$ and D$_2$ branches. Although the D$_2$ branch is not directly involved in charge separation excitons localised on this branch can act as electronic traps \\cite{Novoderezhkin2011} thereby affecting the statistics of electrons flowing through the system, as we will discuss later. Therefore, the Hilbert space spans the following states: the ground state $|g\\rangle$, six exciton states $|e_1\\rangle$ to $|e_6\\rangle$, the initial CT state $|\\mbox{Chl}^+_{D1}\\mbox{Phe}^-_{D1}\\rangle \\equiv |I\\rangle$, the secondary CT state $|\\mbox{P}^+_{D1}\\mbox{Phe}^-_{D1}\\rangle \\equiv |\\alpha\\rangle$ and the positively charged state $|\\mbox{P}^+_{D1}\\mbox{Phe}_{D1}\\rangle \\equiv |\\beta\\rangle$ which represents the 'empty' state of the system for counting statistics. In the above we have assumed low enough excitation rates to guarantee that only single excitation states are populated. \n\nThe system dynamics is described by a Lindblad master equation of the form\n\n", "index": 1, "text": "\\begin{equation}\n\\dot{\\rho_s}(t) = (\\mathcal{L}_{ex} + \\mathcal{L}_{relax} + \\mathcal{L}_{CT} + \\mathcal{L}_{leads})\\rho_s(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho_{s}}(t)=(\\mathcal{L}_{ex}+\\mathcal{L}_{relax}+\\mathcal{L}_{CT}+%&#10;\\mathcal{L}_{leads})\\rho_{s}(t),\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><msub><mi>ρ</mi><mi>s</mi></msub><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>+</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>+</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>C</mi><mo>⁢</mo><mi>T</mi></mrow></msub><mo>+</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\n\nwith $k_B$ is the Boltzmann constant. The population ratio, and associated voltage across the load, can therefore be varied by changing the rate at which electrons leave the system $\\Gamma_R$. When $\\Gamma_R \\rightarrow 0$ there is a large load across the PSIIRC-based photocell, defining the open circuit regime. In the opposite limit, when  $\\Gamma_R \\rightarrow \\infty$, the voltage tends to zero and defines the short circuit regime. These limits describe the operation extremes in which the photocell delivers no power.\n\nTo investigate the effect of the structured vibrational environment on the statistics  of the transition from $|\\alpha\\rangle$ to $|\\beta\\rangle$, we compare the situations in which (i) the full structured spectral density $J(\\omega)= J_{D}(\\omega)+ J_M(\\omega)$  is considered as opposite to the situation where (ii) only the smooth low energy component  $J_{D}(\\omega)$ is accounted for. We denote these cases as structured and smooth environments. The low and high energy components of the spectral density are depicted in Fig. \\ref{fig:model} (b) and are given by\\cite{Novoderezhkin2005}: \n\\begin{eqnarray}\nJ_{D}(\\omega) &=& \\frac{2\\lambda\\omega\\Omega_c}{\\omega^2 + \\Omega_c^2}, \\\\\nJ_M(\\omega) &=& \\sum_j \\frac{2\\lambda_j\\omega_j^2\\gamma_j \\omega}{(\\omega^2 - \\omega_j^2)^2 + \\gamma_j^2\\omega^2}.\n\\end{eqnarray}\n$J_{D}(\\omega)$ is the Drude form of a spectral density describing an overdamped Brownian oscillator where $\\lambda$ and $\\Omega_c$ are the reorganisation energy and cut off frequency, respectively. $J_M(\\omega)$ has been measured experimentally \\cite{Peterman1998} and describes a number of discrete high energy modes coupled to excited pigments, with $\\lambda_j$, $\\omega_j$ and $\\gamma_j$ being the reorganisation energy, frequency and damping associated with mode $j$ respectively.  All parameters used in the model are detailed in the supplementary information.\n\n\n\\subsection*{Photocell current-voltage and power performance }\nThe characteristic current-voltage (I-V) and power (P)  curves depicted in Fig. \\ref{fig:current-power-voltage} for our PSIIRC-based photocell are obtained with simple expressions\n$\\langle I \\rangle = e\\Gamma_R\\rho_{\\alpha\\alpha}$ and \n$P = \\langle I \\rangle V$. Figure \\ref{fig:current-power-voltage} presents the characteristic curves for the two situations under consideration: (i) when the spectral density is fully accounted for and (ii) when only the low-energy thermal component of the spectral density is considered. As expected in both situations, the current is zero in the open circuit regime and it exhibits a sharp increase to a constant value as the voltage decreases. The power delivered by the photocell in both situations is maximum for a voltage close to $E_{\\alpha\\beta}$, that is, when the steady state populations $\\rho_{\\alpha\\alpha}$ and $\\rho_{\\beta\\beta}$ are similar.\n\nThe most important feature of Fig. \\ref{fig:current-power-voltage} is the fact that the constant current and maximum power are significantly lower for a photocell with a structured environment. This contrasts with the power enhancement predicted for a simple light-harvesting device that includes a single resonant mode coherently coupled to electronic transitions \\cite{Killoran2015}. \n\nIn our system a wide range of vibrational motions influence the transfer rates among excitons and between excitons and CT states. Although the energy of some of the high-energy modes may be close to the excitonic energy gaps, this feature is not satisfied for the majority of the transitions in the PRC, unlike the case of some light-harvesting complexes \\cite{Kolli2012a}. Specifically, there is no quasi-resonance between vibrational motions and the energy mismatch between excitons and the primary CT state. More importantly, CT states are strongly coupled to the vibrational background with much larger reorganisation energies than exciton states. This results in a larger shift between the absorption lineshape of a CT state and the emission lineshape of an exciton state yielding a reduced overlap. Consequently transfer rates from excitons to CT states are decreased. One can see this as a Zeno-like effect whereby the strongly coupled environment \"measures\" the population of a CT state at a very high rate thereby slowing transfer.\n\nThe stronger coupling to the environment of CT states compared to exciton states, favours forward electron transfer. This is illustrated for a donor-acceptor dimer system with a PSIIRC structured spectral density in Fig. \\ref{fig:current-temperature} (a). The ratio of forward and backward transfer rates between the donor and acceptor is shown as a function of the scaling constant for the coupling between the acceptor CT state and the environment. Starting from a coupling scaling of 3, which we see for the secondary CT state in the Chl$_{D1}$ pathway, the transfer rate ratio increases at all temperatures. At lower temperatures this improvement in the forward transfer is enhanced.  Fig. \\ref{fig:current-temperature} (b) shows the temperature dependence of the current for our PSIIRC-based photocell. The increase in the current without coupling to a structured environment is seen at all temperatures, though interestingly there is an optimal operational temperature for the photocell.\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.3,trim={1cm 0 0 0},clip]{current_power_voltage.eps}\n\\caption{\\textbf{Mean current (black) and power (red) versus voltage.} For both plots the dashed lines indicate the results for a Drude spectral density while solid lines indicate the inclusion of high energy modes. Calculations carried out at 300K with excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:current-power-voltage}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.4]{PSIIRC_dimer_transfer_rate_ratio_acceptor_coupling_scaling.eps}\n\n\\includegraphics[scale=0.4]{current_temperature.eps}\n\\caption{\\textbf{Favouring forward electron transfer.} (a) Ratio of forward and backward transfer rates versus acceptor environmental coupling scaling for a donor/acceptor dimer system with a PSIIRC spectral density. The donor-acceptor energy gap is 200cm$^{-1}$ and the electronic coupling is 40cm$^{-1}$. (b) Current versus temperature for a PSIIRC photocell model at a fixed voltage of 1.28V, excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:current-temperature}\n\\end{figure}\n\n\n\\subsection*{Zero-frequency noise}\n\\label{sec:noise}\n\nFull performance characterization of a photocell cannot be limited to the mean current (and associated power curve). The current fluctuations quantified by second and  higher order cumulants ($\\langle I^n\\rangle_c$ with $n>1$) can give information on the correlations between elementary charge transfer events. In the context of our question of interest, these fluctuations can then reveal how the structured vibrational environment may promote or hinder such correlations and their associated noise features.\n\nHere we focus on the long-time limit or zero-frequency regime of the relative noise strength which is quantified by the second order Fano factor \\cite{Fano1947}: \n\n", "itemtype": "equation", "pos": 16393, "prevtext": "\nwhere $\\mathcal{L}_{ex}$ defines the coupling to an incoherent radiation field which excites the system from the ground state to the exciton manifold, $\\mathcal{L}_{relax}$ describes relaxation rates between the exciton states using modified Redfield theory \\cite{Zhang1998,Yang2002}, $\\mathcal{L}_{CT}$ defines initial and secondary CT processes using Marcus/F\\\"{o}rster theory \\cite{Forster1965,Yang2002} and $\\mathcal{L}_{leads}$ describes coupling of the system to the leads. As explained in the methods section, from this Liouvillian the full counting statistics can be calculated using Eq. \\ref{Nth-cumulant} and enforcing both the Coulomb blockade regime such that probability of two electron occupancy is negligible\\cite{Bagrets2003}, and the infinite bias limit enforcing unidirectional electron flow\\cite{Marcos2010}.\n\nThe current counting statistics depends on the induced voltage across a load connecting the states $|\\alpha\\rangle$ and $|\\beta\\rangle$ with associated energy gap $E_{\\alpha\\beta} = E_{\\alpha} - E_{\\beta}$. As usually done in photocells\\cite{Shockley1961}, such a voltage is estimated via a detailed balance condition where the ratio between the steady state populations of the secondary CT state ($\\rho_{\\alpha\\alpha}$) and the `empty' state ($\\rho_{\\beta\\beta}$) is equilibrated at a temperature $T$:\n\n\n", "index": 3, "text": "\\begin{equation}\neV = E_{\\alpha\\beta} + k_B T \\mbox{ln}\\left[\\frac{\\rho_{\\alpha\\alpha}}{\\rho_{\\beta\\beta}}\\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"eV=E_{\\alpha\\beta}+k_{B}T\\mbox{ln}\\left[\\frac{\\rho_{\\alpha\\alpha}}{\\rho_{\\beta%&#10;\\beta}}\\right],\" display=\"block\"><mrow><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow><mo>=</mo><mrow><msub><mi>E</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msub><mo>+</mo><mrow><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mtext>ln</mtext><mo>⁢</mo><mrow><mo>[</mo><mfrac><msub><mi>ρ</mi><mrow><mi>α</mi><mo>⁢</mo><mi>α</mi></mrow></msub><msub><mi>ρ</mi><mrow><mi>β</mi><mo>⁢</mo><mi>β</mi></mrow></msub></mfrac><mo>]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nThis ratio between the zero-frequency second order current cumulant and the mean current asserts the deviation of the underlying statistical process from a Poissonian distribution. A Fano factor of 1 indicates a Poissonian process without correlations among charge transfer events. While deviations from 1 are interpreted as either super-Poissonian ($F^{(2)} > 1$) or sub-Poissonian ($F^{(2)} < 1$), regimes that can be associated with highly fluctuating or more stable currents, respectively.\n\nIn mesoscopic  and quantum systems the Fano factor has proven to be very sensitive to the structure of the state space [ref] as well as on the electron-phonon interactions [ref].  This is precisely what is indicated by the results for the  Fano factor of the current through our photocell device shown in Fig. \\ref{fig:noise-voltage}. The analytic form of the Fano factor for our photocell model is too cumbersome. To gain insight into the behaviour presented in Fig. \\ref{fig:noise-voltage} it is therefore useful to consider the case of a single resonant level (SRL) \\cite{Marcos2010}. The dynamics of this system in the basis $\\{ |\\mbox{occupied}\\rangle, |\\mbox{empty} \\rangle \\}$ is governed by a Liouvillian with matrix elements $\\mathcal{L}_{11} = -\\mathcal{L}_{21} = \\Gamma_R$ and $\\mathcal{L}_{22} = -\\mathcal{L}_{12} = \\Gamma_L$ such that the Fano factor as a function of voltage takes the form\n\n", "itemtype": "equation", "pos": 23850, "prevtext": "\n\nwith $k_B$ is the Boltzmann constant. The population ratio, and associated voltage across the load, can therefore be varied by changing the rate at which electrons leave the system $\\Gamma_R$. When $\\Gamma_R \\rightarrow 0$ there is a large load across the PSIIRC-based photocell, defining the open circuit regime. In the opposite limit, when  $\\Gamma_R \\rightarrow \\infty$, the voltage tends to zero and defines the short circuit regime. These limits describe the operation extremes in which the photocell delivers no power.\n\nTo investigate the effect of the structured vibrational environment on the statistics  of the transition from $|\\alpha\\rangle$ to $|\\beta\\rangle$, we compare the situations in which (i) the full structured spectral density $J(\\omega)= J_{D}(\\omega)+ J_M(\\omega)$  is considered as opposite to the situation where (ii) only the smooth low energy component  $J_{D}(\\omega)$ is accounted for. We denote these cases as structured and smooth environments. The low and high energy components of the spectral density are depicted in Fig. \\ref{fig:model} (b) and are given by\\cite{Novoderezhkin2005}: \n\\begin{eqnarray}\nJ_{D}(\\omega) &=& \\frac{2\\lambda\\omega\\Omega_c}{\\omega^2 + \\Omega_c^2}, \\\\\nJ_M(\\omega) &=& \\sum_j \\frac{2\\lambda_j\\omega_j^2\\gamma_j \\omega}{(\\omega^2 - \\omega_j^2)^2 + \\gamma_j^2\\omega^2}.\n\\end{eqnarray}\n$J_{D}(\\omega)$ is the Drude form of a spectral density describing an overdamped Brownian oscillator where $\\lambda$ and $\\Omega_c$ are the reorganisation energy and cut off frequency, respectively. $J_M(\\omega)$ has been measured experimentally \\cite{Peterman1998} and describes a number of discrete high energy modes coupled to excited pigments, with $\\lambda_j$, $\\omega_j$ and $\\gamma_j$ being the reorganisation energy, frequency and damping associated with mode $j$ respectively.  All parameters used in the model are detailed in the supplementary information.\n\n\n\\subsection*{Photocell current-voltage and power performance }\nThe characteristic current-voltage (I-V) and power (P)  curves depicted in Fig. \\ref{fig:current-power-voltage} for our PSIIRC-based photocell are obtained with simple expressions\n$\\langle I \\rangle = e\\Gamma_R\\rho_{\\alpha\\alpha}$ and \n$P = \\langle I \\rangle V$. Figure \\ref{fig:current-power-voltage} presents the characteristic curves for the two situations under consideration: (i) when the spectral density is fully accounted for and (ii) when only the low-energy thermal component of the spectral density is considered. As expected in both situations, the current is zero in the open circuit regime and it exhibits a sharp increase to a constant value as the voltage decreases. The power delivered by the photocell in both situations is maximum for a voltage close to $E_{\\alpha\\beta}$, that is, when the steady state populations $\\rho_{\\alpha\\alpha}$ and $\\rho_{\\beta\\beta}$ are similar.\n\nThe most important feature of Fig. \\ref{fig:current-power-voltage} is the fact that the constant current and maximum power are significantly lower for a photocell with a structured environment. This contrasts with the power enhancement predicted for a simple light-harvesting device that includes a single resonant mode coherently coupled to electronic transitions \\cite{Killoran2015}. \n\nIn our system a wide range of vibrational motions influence the transfer rates among excitons and between excitons and CT states. Although the energy of some of the high-energy modes may be close to the excitonic energy gaps, this feature is not satisfied for the majority of the transitions in the PRC, unlike the case of some light-harvesting complexes \\cite{Kolli2012a}. Specifically, there is no quasi-resonance between vibrational motions and the energy mismatch between excitons and the primary CT state. More importantly, CT states are strongly coupled to the vibrational background with much larger reorganisation energies than exciton states. This results in a larger shift between the absorption lineshape of a CT state and the emission lineshape of an exciton state yielding a reduced overlap. Consequently transfer rates from excitons to CT states are decreased. One can see this as a Zeno-like effect whereby the strongly coupled environment \"measures\" the population of a CT state at a very high rate thereby slowing transfer.\n\nThe stronger coupling to the environment of CT states compared to exciton states, favours forward electron transfer. This is illustrated for a donor-acceptor dimer system with a PSIIRC structured spectral density in Fig. \\ref{fig:current-temperature} (a). The ratio of forward and backward transfer rates between the donor and acceptor is shown as a function of the scaling constant for the coupling between the acceptor CT state and the environment. Starting from a coupling scaling of 3, which we see for the secondary CT state in the Chl$_{D1}$ pathway, the transfer rate ratio increases at all temperatures. At lower temperatures this improvement in the forward transfer is enhanced.  Fig. \\ref{fig:current-temperature} (b) shows the temperature dependence of the current for our PSIIRC-based photocell. The increase in the current without coupling to a structured environment is seen at all temperatures, though interestingly there is an optimal operational temperature for the photocell.\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.3,trim={1cm 0 0 0},clip]{current_power_voltage.eps}\n\\caption{\\textbf{Mean current (black) and power (red) versus voltage.} For both plots the dashed lines indicate the results for a Drude spectral density while solid lines indicate the inclusion of high energy modes. Calculations carried out at 300K with excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:current-power-voltage}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.4]{PSIIRC_dimer_transfer_rate_ratio_acceptor_coupling_scaling.eps}\n\n\\includegraphics[scale=0.4]{current_temperature.eps}\n\\caption{\\textbf{Favouring forward electron transfer.} (a) Ratio of forward and backward transfer rates versus acceptor environmental coupling scaling for a donor/acceptor dimer system with a PSIIRC spectral density. The donor-acceptor energy gap is 200cm$^{-1}$ and the electronic coupling is 40cm$^{-1}$. (b) Current versus temperature for a PSIIRC photocell model at a fixed voltage of 1.28V, excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:current-temperature}\n\\end{figure}\n\n\n\\subsection*{Zero-frequency noise}\n\\label{sec:noise}\n\nFull performance characterization of a photocell cannot be limited to the mean current (and associated power curve). The current fluctuations quantified by second and  higher order cumulants ($\\langle I^n\\rangle_c$ with $n>1$) can give information on the correlations between elementary charge transfer events. In the context of our question of interest, these fluctuations can then reveal how the structured vibrational environment may promote or hinder such correlations and their associated noise features.\n\nHere we focus on the long-time limit or zero-frequency regime of the relative noise strength which is quantified by the second order Fano factor \\cite{Fano1947}: \n\n", "index": 5, "text": "\\begin{equation}\nF^{(2)} = \\frac{\\langle I^2\\rangle_c}{\\langle I\\rangle}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"F^{(2)}=\\frac{\\langle I^{2}\\rangle_{c}}{\\langle I\\rangle}.\" display=\"block\"><mrow><mrow><msup><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mfrac><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>I</mi><mn>2</mn></msup><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub><mrow><mo stretchy=\"false\">⟨</mo><mi>I</mi><mo stretchy=\"false\">⟩</mo></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhere $E_0$ is the energy gap between the occupied and empty states. This function (see Supplementary Fig. S2) is symmetric about its minimum and approaches 1 at large and small voltages, where electron transfer events are rare and essentially uncorrelated. The minimum occurs for the voltage associated to electrons entering and leaving the system at the same rate ($\\Gamma_R / \\Gamma_L = \\rho_{\\mbox{occupied}} / \\rho_{\\mbox{empty}} = 1$). This sub-Poissonian behaviour is a manifestation of the Coulomb blockade regime where the presence of an electron in the system prevents another one entering until the system is empty, thereby reducing the noise.\n\nFigure \\ref{fig:noise-voltage} shows that the noise profiles in both cases, structured and smooth environment,are not symmetric around their minima with values lower than 1 for small voltages. This is due to the fact that transfer rates are such that the non-equilibrium steady state operation of the photocell samples the manifold of exciton states assisting charge separation. Specifically,  electron transfer events into the drain lead witness multi-step transfer nature of the process which is ensured by the manifold of excitons coupled to the primary CT state. \n\nNevertheless, noise levels are overall lower with the structured environment as a consequence of a rich interplay between phonon-assisted transfer among excitons as well as from excitons to primary CT state and the transfer between CT states. To illustrate this interplay we consider the situation where the rate of secondary CT transfer is very slow compared to relaxation rates within the exciton manifold and the rates between the excitons and primary CT state.  In this case, population of this stable CT state is so slow that all the internal transfers from the exciton manifold to the primary CT can be described a single step process i.e. there is no sampling of the multi-level exciton structure, and the Fano factor tends to 1 for small and larger voltages as shown by the dotted line in Fig. \\ref{fig:noise-voltage} (top). This means that the system behaves effectively as a SRL (Cf. Fig. \\ref{fig:noise-voltage} (top) with Supplementary Figure S2). The time scale of secondary charge transfer is therefore a limiting time-scale  which can lead to a variety of phenomena as it will be further explored in the next section. \n\nAll the above results are computed at $T=300 K$. We can therefore conclude that at room temperature the PSIIRC-based photocell with the structured vibrational environment delivers less power than a photocell with the unstructured environment, yet still this is accompanied by a suppression of current fluctuations and associated noise close to a minimum of 1/2. This is a consequence of the nontrivial interplay between vibration-assisted exciton and charge transfer processes underlying the function of the PSIIRC. \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.28,trim={1.3cm 0 0 0},clip]{noise_voltage.eps}\n\\caption{\\textbf{Fano factor versus voltage.} (a) Top panel: shows Fano factor for the PSIIRC-based photocell with the structured environment for a modified (slow) (dotted line) and the measured (solid line) secondary charge transfer rate. (b) Bottom panel shows the Fano factor for the PSIIRC photocell with the smooth low-energy vibrational environment. Calculations carried out at 300K with excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:noise-voltage}\n\\end{figure}\n\n\\subsection*{Competing dynamical processes}\nAs discussed above, the transfer rate from primary to secondary CT state has a dramatic effect on the noise properties of the  PSIIRC-based photocell: it is such that the non-equilibrium steady state operation of the photocell samples the manifold of exciton states assisting charge separation. We now investigate the Fano factor considering an increased secondary charge transfer rate of 2ps$^{-1}$, which is faster than the primary charge transfer rates.\n\nFigure \\ref{fig:competing-dynamical-processes} (a) shows the Fano factor for a fixed voltage and as a function of the excitation rate. Strikingly, the structured phonon-environment supports a transition from sub- to super-Poissonian statistics for high enough excitation rates. This is not observed for the unstructured environment and therefore the Fano factor clearly discriminates the two cases. Most striking is the fact that such transition does not happen at all, even with a structured environment, if excitons on D$_2$ branch are discarded, as shown in Fig. \\ref{fig:competing-dynamical-processes} (a) (inset). To understand the origin of these observations it is convenient to investigate the second-order correlation function $g^{(2)}(t)$, which is related to the Fano factor as follows\\cite{Emary2012}:\n\n", "itemtype": "equation", "pos": 25338, "prevtext": "\nThis ratio between the zero-frequency second order current cumulant and the mean current asserts the deviation of the underlying statistical process from a Poissonian distribution. A Fano factor of 1 indicates a Poissonian process without correlations among charge transfer events. While deviations from 1 are interpreted as either super-Poissonian ($F^{(2)} > 1$) or sub-Poissonian ($F^{(2)} < 1$), regimes that can be associated with highly fluctuating or more stable currents, respectively.\n\nIn mesoscopic  and quantum systems the Fano factor has proven to be very sensitive to the structure of the state space [ref] as well as on the electron-phonon interactions [ref].  This is precisely what is indicated by the results for the  Fano factor of the current through our photocell device shown in Fig. \\ref{fig:noise-voltage}. The analytic form of the Fano factor for our photocell model is too cumbersome. To gain insight into the behaviour presented in Fig. \\ref{fig:noise-voltage} it is therefore useful to consider the case of a single resonant level (SRL) \\cite{Marcos2010}. The dynamics of this system in the basis $\\{ |\\mbox{occupied}\\rangle, |\\mbox{empty} \\rangle \\}$ is governed by a Liouvillian with matrix elements $\\mathcal{L}_{11} = -\\mathcal{L}_{21} = \\Gamma_R$ and $\\mathcal{L}_{22} = -\\mathcal{L}_{12} = \\Gamma_L$ such that the Fano factor as a function of voltage takes the form\n\n", "index": 7, "text": "\\begin{equation}\nF^{(2)}(V) = \\frac{1 + \\exp[-2(eV - E_0)/k_B T]}{(1 + \\exp[-(eV - E_0)/k_B T])^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"F^{(2)}(V)=\\frac{1+\\exp[-2(eV-E_{0})/k_{B}T]}{(1+\\exp[-(eV-E_{0})/k_{B}T])^{2}},\" display=\"block\"><mrow><mrow><mrow><msup><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>V</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mn>1</mn><mo>+</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow><mo>-</mo><msub><mi>E</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><msub><mi>k</mi><mi>B</mi></msub></mrow><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>V</mi></mrow><mo>-</mo><msub><mi>E</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><msub><mi>k</mi><mi>B</mi></msub></mrow><mo>⁢</mo><mi>T</mi></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nThe function $g^{(2)}(t)$ gives the probability that an electron tunnelling through the drain lead is detected at time $t$, having detected one at an earlier time $t=0$ and its formal expression for calculations is given in Eq. (\\ref{g2}). The interpretation of $g^{(2)}(t)$ is the same as in quantum optics where $g^{(2)}(0) < g^{(2)}(t)$ indicates anti-bunching, and $g^{(2)}(0) > g^{(2)}(t)$ indicates bunching.  \nFigure  \\ref{fig:competing-dynamical-processes} (b) shows $g^{(2)}(t)$ for structured and unstructured vibrational environments at an excitation rate for which $F^{(2)}>1$. Electron transport in both cases in Fig. \\ref{fig:competing-dynamical-processes} (b) is anti-bunched in the picosecond time scale, that is, $g^{(2)}(t<1 \\textrm{ps})<1$. However,for the structured environment there is a prominent raise of $g^{(2)}(t> 1 \\textrm{ps})$ to values larger than one with a clear maximum. For this curve the positive portion of $g^{(2)}(t) - 1$ dominates the integral of Eq. \\ref{eq:intg2} leading to a Fano factor larger than one. The non-monotonic increase of $g(2)(t)$ indicates that competing dynamical processes occur at different time scales and is reminiscent of the phenomenon of dynamical channel blockade observed in transport through quantum dots \\cite{Emary2012,Belzig2005,Kiesslich2004}. At short times,\nCoulomb blockade and fast pathways through the directly populated lowest exciton state dominate, as such the probability of an electron tunnelling into the drain lead at time $t$ (given one was detected at $t=0$) increases with time. At longer times, however, all excitons are populated including excitons in the D$_2$ branch. For a sufficiently high  transfer to secondary CT state, excitons in the D$_2$ branch, although not directly coupled to CT states, constitute an indirect slow pathway of population transfer. This path thus dominates at intermediate time scales.  Differences in the relative time scales of these two competing transfer pathways can cause the time electrons spend in the system to be irregular, which manifests as a large Fano factor and associated super-Poissonian statistics. Hence, while excitons localized in the D$_2$ branch do not participate in transient ultrafast charge separation, they can have a profound effect under steady sate operation of a PSIIRC-based photocell. \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.27]{noise_excitation_rate.eps}\n\\includegraphics[scale=0.3]{g2.eps}\n\\caption{\\textbf{Counting statistics for a photocell device with a secondary CT rate of 2 ps$^{-1}$.} (a) Fano factor versus excitation rate calculated at 77K with a fixed voltage of 1.42V. Inset: Same parameters but using a four site PSIIRC system, neglecting the D2 branch. (b) $g^{(2)}(t)$ with a fixed excitation rate of 12 cm$^{-1}$. See Supplementary Information for all other parameters.}\n\\label{fig:competing-dynamical-processes}\n\\end{figure}\n\n\\section*{Discussion}\n\nLearning how Nature's molecular machinery manages to harvest and storage  energy efficiently promises to provide lessons for man-made devices with similar capabilities \\cite{Scholes2011} thereby encouraging the development of nature-inspired molecular scale photovoltaic devices.  Research has shown that charge separation and electron transfer in PRCs are coupled to  both broad band and well resolved vibrational motions. It is however unknown what the effect of this structured vibrational environment is in the operation of such complexes as components in a photovoltaic cell.  Present single-molecule technologies, which have demonstrated the ability to manipulate and measure the photocurrent of single PRCs, have opened up the door to investigate this question at the single-complex level. Here we have addressed this question by considering a PSIIRC-based photocell where the Chl$_{D1}$ charge separation pathway is dominant. \n\nOur results show that the structured environment assisting electron  transfer in the PSIIRC-based photocell device acts to reduce the current and power output. This is a manifestation of a Zeno-like effect whereby strong coupling of CT states to well-resolved high energy modes, and the associated multi-phonon processes, prevent transfer. These observations suggest PSIIRC complexes where the Chl$_{D1}$ is dominant are not necessarily well adapted for photovoltaics. The predicted reduction in the average photocurrent exhibited upon the inclusion of coupling to high-energy vibrational modes is not detrimental for photosynthetic electron transfer processes  \\textit{in vivo}. \nFor the operation of PRCs in the biological scenario it is more important that charge recombination is inhibited so that the energy captured is not wasted. Strong coupling of CT states to high energy modes may indeed help to  prevent charge recombination by guaranteeing a slight asymmetry between forward and backward transfers from CT states. This behaviour contrasts with what has been predicted for electronic excitation energy transfer in light-harvesting complexes as for those complexes, where only exciton states are involved, a structured vibrational environment can indeed enhance excitation energy transfer \\cite{Kolli2012a,Reilly2014}.  This should  not come as a surprise as light-harvesting complexes and reaction centres have very different biological functions.\n\nWhile no advantage is obtained in terms of mean current and power output, strong coupling to well resolved vibrational modes does  result in a reduction of current fluctuations. This means that the PSIIRC-based photocell delivers currents with lower relative noise strengths obeying a sub-Poissonian statistics. This lower noise and associated ordered electron transport is further promoted by the exciton manifold ensuring the multi-step nature of the transport process.  \n\nOur analysis also show that the presence of exciton trap states i.e. exciton states weakly coupled to CT states can support a transition to super-Poissonian statistics. This is a manifestation of the fact that  under steady state operation, trap exciton states can become an indirect pathway for population transport with an markedly different time scale. \n\nThe above discussion allows us to put forward three principles for the development of functional PRC-photocells devices with different functionalities: (i) If the purpose of the device is to deliver currents with lower relative noise strengths as possible then \\textit{assure the electron transfer process is assisted by a manifold of exciton states and a strongly coupled structured vibrational environment}. The donor exciton states together with a structured environment guarantee a multi-step, ordered, population transfer process in the picosecond time scale. This feature relies on enforcing the Coulomb blockade limit, where only one electron is present in the system at a time.  To further minimise current fluctuations, the time scales for population transfer involving different exciton states must be comparable. This amounts to eliminating trap exciton states, for instance,  by carefully sculpting the energy landscape of the pigment-protein complexes through genetic engineering. (ii) Take advantage of the selective, strong coupling to specific vibrational modes \\textit{to enhance forward transfer thereby helping to prevent charge re-combination}. (iii) If the desired function is to achieve a larger mean current irrespective of how large its fluctuations are, then \\textit{decouple specific vibrational motions from electronic states}. Modifications of the electron-phonon interaction can be achieved by strong coupling of pigment-protein complex to a confined optical cavity mode \\cite{Coles2014,Herrera2015}. Indeed, the energy exchange of electronic transitions with a strongly coupled optical mode could help suppressing reorganisation energy of the nuclei thereby increasing the rate of electron transfer reactions\\cite{Herrera2015}. Moreover, the parameters varied in our calculations, such as voltage and temperature, allow a finer degree of control and optimization of different current characteristics depending on the operational requirements.\n\nThe above principles have been proposed based on the analysis of PSIIRC where the Chl$_{D1}$ charge separation pathway is dominant. Other PSIIRCs can have a dominant P$_{D1}$ charge separation pathway where exciton and CT states are coherently coupled\\cite{Romero2010}. In this case it has been argued that specific modes may indeed support coherent transfer between these states\\cite{Romero2014}. The analysis presented here can be extended to consider photocell devices where such coherent coupling is at work\\cite{Creatore2013a}. The implications of coherent interactions for photocell performance are under way and will be reported in a separate study. \n\nExperimental implementation of our proposal involves attachment of electrodes to individual PSIIRC units forming metal-protein junctions. Similar experiments have been carried out in a scanning tunnelling microscopy setup with photosystem I (PSI) units \\cite{Gerster2012} and fragments of reaction centre-enriched purple bacterial membranes \\cite{Kamran2015}. The PSI units were genetically engineered with cysteine residues on both the oxidizing and reducing sides which allowed covalent attachment of the protein to two electrodes across which the photo-current could be measured \\cite{Gerster2012}. The photo-current generated by PSII units (that is the protein structure consisting of the PSIIRC and surrounding light-harvesting chromophores) has also been measured by depositing the protein on a metal oxide electrode \\cite{Kato2012}. However this was an ensemble measurement with a soluble mediator on the oxidizing side rather than looking at individual units. Despite the fact that whole photosystem complex have been used in these experiments, only the reaction centre is functional in charge transport between the electrodes, especially if the light used is tuned to excite the reaction centre chromophores. Advances in semiconductor-protein interfaces offer a potentially more flexible approach, for example depositing a film of PSI on a p-doped silicon surface \\cite{Leblanc2012}. This technique has the advantage that uni-directional electron flow can be achieved by adjusting the doping type and the doping density of the semiconductor. In addition, band gap matching of doped silicon to that of the photosynthetic protein can the enhance the magnitude of the photo-current.\n\nCurrent statistics measurements also potentially offer a non-invasive, single system level probe of charge transfer phenomena in a wide range of biological \\cite{Xiang2015,Franco2011} and chemical systems \\cite{Delor2015,Delor2015b,Bakulin2015}. Specifically, this technique may be applicable to charge transfer along molecular wires made from DNA strands \\cite{Xiang2015}, to general donor-bridge-acceptor systems \\cite{Delor2015,Delor2015b,Bakulin2015} or to unveil vibrational mechanisms for odour receptors \\cite{Franco2011}.\n\n\\section*{Methods}\n\n\\subsection*{Theory of full counting statistics}\nConsider a mesoscopic system placed between a source and drain leads which supply or take away electrons from the system respectively. We consider the Coulomb blockade regime where only a single excess electron may occupy the system at any given time, an infinite bias voltage between the leads, guarantees uni-directional electron flow. Assuming weak coupling between the system and the leads we can write a Markovian master equation for the reduced system where we have traced over the lead degrees of freedom\n\n", "itemtype": "equation", "pos": 30321, "prevtext": "\nwhere $E_0$ is the energy gap between the occupied and empty states. This function (see Supplementary Fig. S2) is symmetric about its minimum and approaches 1 at large and small voltages, where electron transfer events are rare and essentially uncorrelated. The minimum occurs for the voltage associated to electrons entering and leaving the system at the same rate ($\\Gamma_R / \\Gamma_L = \\rho_{\\mbox{occupied}} / \\rho_{\\mbox{empty}} = 1$). This sub-Poissonian behaviour is a manifestation of the Coulomb blockade regime where the presence of an electron in the system prevents another one entering until the system is empty, thereby reducing the noise.\n\nFigure \\ref{fig:noise-voltage} shows that the noise profiles in both cases, structured and smooth environment,are not symmetric around their minima with values lower than 1 for small voltages. This is due to the fact that transfer rates are such that the non-equilibrium steady state operation of the photocell samples the manifold of exciton states assisting charge separation. Specifically,  electron transfer events into the drain lead witness multi-step transfer nature of the process which is ensured by the manifold of excitons coupled to the primary CT state. \n\nNevertheless, noise levels are overall lower with the structured environment as a consequence of a rich interplay between phonon-assisted transfer among excitons as well as from excitons to primary CT state and the transfer between CT states. To illustrate this interplay we consider the situation where the rate of secondary CT transfer is very slow compared to relaxation rates within the exciton manifold and the rates between the excitons and primary CT state.  In this case, population of this stable CT state is so slow that all the internal transfers from the exciton manifold to the primary CT can be described a single step process i.e. there is no sampling of the multi-level exciton structure, and the Fano factor tends to 1 for small and larger voltages as shown by the dotted line in Fig. \\ref{fig:noise-voltage} (top). This means that the system behaves effectively as a SRL (Cf. Fig. \\ref{fig:noise-voltage} (top) with Supplementary Figure S2). The time scale of secondary charge transfer is therefore a limiting time-scale  which can lead to a variety of phenomena as it will be further explored in the next section. \n\nAll the above results are computed at $T=300 K$. We can therefore conclude that at room temperature the PSIIRC-based photocell with the structured vibrational environment delivers less power than a photocell with the unstructured environment, yet still this is accompanied by a suppression of current fluctuations and associated noise close to a minimum of 1/2. This is a consequence of the nontrivial interplay between vibration-assisted exciton and charge transfer processes underlying the function of the PSIIRC. \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.28,trim={1.3cm 0 0 0},clip]{noise_voltage.eps}\n\\caption{\\textbf{Fano factor versus voltage.} (a) Top panel: shows Fano factor for the PSIIRC-based photocell with the structured environment for a modified (slow) (dotted line) and the measured (solid line) secondary charge transfer rate. (b) Bottom panel shows the Fano factor for the PSIIRC photocell with the smooth low-energy vibrational environment. Calculations carried out at 300K with excitation rate $\\gamma = 0.00125$cm$^{-1}$ and solar photon number $n = 60000$. See Supplementary Information for all other parameters.}\n\\label{fig:noise-voltage}\n\\end{figure}\n\n\\subsection*{Competing dynamical processes}\nAs discussed above, the transfer rate from primary to secondary CT state has a dramatic effect on the noise properties of the  PSIIRC-based photocell: it is such that the non-equilibrium steady state operation of the photocell samples the manifold of exciton states assisting charge separation. We now investigate the Fano factor considering an increased secondary charge transfer rate of 2ps$^{-1}$, which is faster than the primary charge transfer rates.\n\nFigure \\ref{fig:competing-dynamical-processes} (a) shows the Fano factor for a fixed voltage and as a function of the excitation rate. Strikingly, the structured phonon-environment supports a transition from sub- to super-Poissonian statistics for high enough excitation rates. This is not observed for the unstructured environment and therefore the Fano factor clearly discriminates the two cases. Most striking is the fact that such transition does not happen at all, even with a structured environment, if excitons on D$_2$ branch are discarded, as shown in Fig. \\ref{fig:competing-dynamical-processes} (a) (inset). To understand the origin of these observations it is convenient to investigate the second-order correlation function $g^{(2)}(t)$, which is related to the Fano factor as follows\\cite{Emary2012}:\n\n", "index": 9, "text": "\\begin{equation}\nF^{(2)} = 1 + 2\\langle I\\rangle \\int_0^{\\infty} dt [g^{(2)}(t) - 1].\n\\label{eq:intg2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"F^{(2)}=1+2\\langle I\\rangle\\int_{0}^{\\infty}dt[g^{(2)}(t)-1].\" display=\"block\"><mrow><mrow><msup><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>=</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>I</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mrow><mo>𝑑</mo><mi>t</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nUnravelling $\\rho_s(t)$ into components describing $n$ electrons counted in the drain lead at time $t$ we get the master equation \\cite{Marcos2010}\n\n", "itemtype": "equation", "pos": 42040, "prevtext": "\nThe function $g^{(2)}(t)$ gives the probability that an electron tunnelling through the drain lead is detected at time $t$, having detected one at an earlier time $t=0$ and its formal expression for calculations is given in Eq. (\\ref{g2}). The interpretation of $g^{(2)}(t)$ is the same as in quantum optics where $g^{(2)}(0) < g^{(2)}(t)$ indicates anti-bunching, and $g^{(2)}(0) > g^{(2)}(t)$ indicates bunching.  \nFigure  \\ref{fig:competing-dynamical-processes} (b) shows $g^{(2)}(t)$ for structured and unstructured vibrational environments at an excitation rate for which $F^{(2)}>1$. Electron transport in both cases in Fig. \\ref{fig:competing-dynamical-processes} (b) is anti-bunched in the picosecond time scale, that is, $g^{(2)}(t<1 \\textrm{ps})<1$. However,for the structured environment there is a prominent raise of $g^{(2)}(t> 1 \\textrm{ps})$ to values larger than one with a clear maximum. For this curve the positive portion of $g^{(2)}(t) - 1$ dominates the integral of Eq. \\ref{eq:intg2} leading to a Fano factor larger than one. The non-monotonic increase of $g(2)(t)$ indicates that competing dynamical processes occur at different time scales and is reminiscent of the phenomenon of dynamical channel blockade observed in transport through quantum dots \\cite{Emary2012,Belzig2005,Kiesslich2004}. At short times,\nCoulomb blockade and fast pathways through the directly populated lowest exciton state dominate, as such the probability of an electron tunnelling into the drain lead at time $t$ (given one was detected at $t=0$) increases with time. At longer times, however, all excitons are populated including excitons in the D$_2$ branch. For a sufficiently high  transfer to secondary CT state, excitons in the D$_2$ branch, although not directly coupled to CT states, constitute an indirect slow pathway of population transfer. This path thus dominates at intermediate time scales.  Differences in the relative time scales of these two competing transfer pathways can cause the time electrons spend in the system to be irregular, which manifests as a large Fano factor and associated super-Poissonian statistics. Hence, while excitons localized in the D$_2$ branch do not participate in transient ultrafast charge separation, they can have a profound effect under steady sate operation of a PSIIRC-based photocell. \n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[scale=0.27]{noise_excitation_rate.eps}\n\\includegraphics[scale=0.3]{g2.eps}\n\\caption{\\textbf{Counting statistics for a photocell device with a secondary CT rate of 2 ps$^{-1}$.} (a) Fano factor versus excitation rate calculated at 77K with a fixed voltage of 1.42V. Inset: Same parameters but using a four site PSIIRC system, neglecting the D2 branch. (b) $g^{(2)}(t)$ with a fixed excitation rate of 12 cm$^{-1}$. See Supplementary Information for all other parameters.}\n\\label{fig:competing-dynamical-processes}\n\\end{figure}\n\n\\section*{Discussion}\n\nLearning how Nature's molecular machinery manages to harvest and storage  energy efficiently promises to provide lessons for man-made devices with similar capabilities \\cite{Scholes2011} thereby encouraging the development of nature-inspired molecular scale photovoltaic devices.  Research has shown that charge separation and electron transfer in PRCs are coupled to  both broad band and well resolved vibrational motions. It is however unknown what the effect of this structured vibrational environment is in the operation of such complexes as components in a photovoltaic cell.  Present single-molecule technologies, which have demonstrated the ability to manipulate and measure the photocurrent of single PRCs, have opened up the door to investigate this question at the single-complex level. Here we have addressed this question by considering a PSIIRC-based photocell where the Chl$_{D1}$ charge separation pathway is dominant. \n\nOur results show that the structured environment assisting electron  transfer in the PSIIRC-based photocell device acts to reduce the current and power output. This is a manifestation of a Zeno-like effect whereby strong coupling of CT states to well-resolved high energy modes, and the associated multi-phonon processes, prevent transfer. These observations suggest PSIIRC complexes where the Chl$_{D1}$ is dominant are not necessarily well adapted for photovoltaics. The predicted reduction in the average photocurrent exhibited upon the inclusion of coupling to high-energy vibrational modes is not detrimental for photosynthetic electron transfer processes  \\textit{in vivo}. \nFor the operation of PRCs in the biological scenario it is more important that charge recombination is inhibited so that the energy captured is not wasted. Strong coupling of CT states to high energy modes may indeed help to  prevent charge recombination by guaranteeing a slight asymmetry between forward and backward transfers from CT states. This behaviour contrasts with what has been predicted for electronic excitation energy transfer in light-harvesting complexes as for those complexes, where only exciton states are involved, a structured vibrational environment can indeed enhance excitation energy transfer \\cite{Kolli2012a,Reilly2014}.  This should  not come as a surprise as light-harvesting complexes and reaction centres have very different biological functions.\n\nWhile no advantage is obtained in terms of mean current and power output, strong coupling to well resolved vibrational modes does  result in a reduction of current fluctuations. This means that the PSIIRC-based photocell delivers currents with lower relative noise strengths obeying a sub-Poissonian statistics. This lower noise and associated ordered electron transport is further promoted by the exciton manifold ensuring the multi-step nature of the transport process.  \n\nOur analysis also show that the presence of exciton trap states i.e. exciton states weakly coupled to CT states can support a transition to super-Poissonian statistics. This is a manifestation of the fact that  under steady state operation, trap exciton states can become an indirect pathway for population transport with an markedly different time scale. \n\nThe above discussion allows us to put forward three principles for the development of functional PRC-photocells devices with different functionalities: (i) If the purpose of the device is to deliver currents with lower relative noise strengths as possible then \\textit{assure the electron transfer process is assisted by a manifold of exciton states and a strongly coupled structured vibrational environment}. The donor exciton states together with a structured environment guarantee a multi-step, ordered, population transfer process in the picosecond time scale. This feature relies on enforcing the Coulomb blockade limit, where only one electron is present in the system at a time.  To further minimise current fluctuations, the time scales for population transfer involving different exciton states must be comparable. This amounts to eliminating trap exciton states, for instance,  by carefully sculpting the energy landscape of the pigment-protein complexes through genetic engineering. (ii) Take advantage of the selective, strong coupling to specific vibrational modes \\textit{to enhance forward transfer thereby helping to prevent charge re-combination}. (iii) If the desired function is to achieve a larger mean current irrespective of how large its fluctuations are, then \\textit{decouple specific vibrational motions from electronic states}. Modifications of the electron-phonon interaction can be achieved by strong coupling of pigment-protein complex to a confined optical cavity mode \\cite{Coles2014,Herrera2015}. Indeed, the energy exchange of electronic transitions with a strongly coupled optical mode could help suppressing reorganisation energy of the nuclei thereby increasing the rate of electron transfer reactions\\cite{Herrera2015}. Moreover, the parameters varied in our calculations, such as voltage and temperature, allow a finer degree of control and optimization of different current characteristics depending on the operational requirements.\n\nThe above principles have been proposed based on the analysis of PSIIRC where the Chl$_{D1}$ charge separation pathway is dominant. Other PSIIRCs can have a dominant P$_{D1}$ charge separation pathway where exciton and CT states are coherently coupled\\cite{Romero2010}. In this case it has been argued that specific modes may indeed support coherent transfer between these states\\cite{Romero2014}. The analysis presented here can be extended to consider photocell devices where such coherent coupling is at work\\cite{Creatore2013a}. The implications of coherent interactions for photocell performance are under way and will be reported in a separate study. \n\nExperimental implementation of our proposal involves attachment of electrodes to individual PSIIRC units forming metal-protein junctions. Similar experiments have been carried out in a scanning tunnelling microscopy setup with photosystem I (PSI) units \\cite{Gerster2012} and fragments of reaction centre-enriched purple bacterial membranes \\cite{Kamran2015}. The PSI units were genetically engineered with cysteine residues on both the oxidizing and reducing sides which allowed covalent attachment of the protein to two electrodes across which the photo-current could be measured \\cite{Gerster2012}. The photo-current generated by PSII units (that is the protein structure consisting of the PSIIRC and surrounding light-harvesting chromophores) has also been measured by depositing the protein on a metal oxide electrode \\cite{Kato2012}. However this was an ensemble measurement with a soluble mediator on the oxidizing side rather than looking at individual units. Despite the fact that whole photosystem complex have been used in these experiments, only the reaction centre is functional in charge transport between the electrodes, especially if the light used is tuned to excite the reaction centre chromophores. Advances in semiconductor-protein interfaces offer a potentially more flexible approach, for example depositing a film of PSI on a p-doped silicon surface \\cite{Leblanc2012}. This technique has the advantage that uni-directional electron flow can be achieved by adjusting the doping type and the doping density of the semiconductor. In addition, band gap matching of doped silicon to that of the photosynthetic protein can the enhance the magnitude of the photo-current.\n\nCurrent statistics measurements also potentially offer a non-invasive, single system level probe of charge transfer phenomena in a wide range of biological \\cite{Xiang2015,Franco2011} and chemical systems \\cite{Delor2015,Delor2015b,Bakulin2015}. Specifically, this technique may be applicable to charge transfer along molecular wires made from DNA strands \\cite{Xiang2015}, to general donor-bridge-acceptor systems \\cite{Delor2015,Delor2015b,Bakulin2015} or to unveil vibrational mechanisms for odour receptors \\cite{Franco2011}.\n\n\\section*{Methods}\n\n\\subsection*{Theory of full counting statistics}\nConsider a mesoscopic system placed between a source and drain leads which supply or take away electrons from the system respectively. We consider the Coulomb blockade regime where only a single excess electron may occupy the system at any given time, an infinite bias voltage between the leads, guarantees uni-directional electron flow. Assuming weak coupling between the system and the leads we can write a Markovian master equation for the reduced system where we have traced over the lead degrees of freedom\n\n", "index": 11, "text": "\\begin{equation}\n\\dot{\\rho_s}(t) = \\mathcal{L}\\rho_s(t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho_{s}}(t)=\\mathcal{L}\\rho_{s}(t).\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><msub><mi>ρ</mi><mi>s</mi></msub><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhere $\\mathcal{L}_0$ describes the evolution of the system between electron counting events and $\\mathcal{L}_J$ describes jumps where an electron tunnels into the drain lead. This equation is more conveniently solved by Fourier transforming with respect to $n$ to give\n\n", "itemtype": "equation", "pos": 42260, "prevtext": "\nUnravelling $\\rho_s(t)$ into components describing $n$ electrons counted in the drain lead at time $t$ we get the master equation \\cite{Marcos2010}\n\n", "index": 13, "text": "\\begin{equation}\n\\dot{\\rho_s}(n,t) = \\mathcal{L}_0\\rho_s(n,t) + \\mathcal{L}_J\\rho_s(n-1,t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho_{s}}(n,t)=\\mathcal{L}_{0}\\rho_{s}(n,t)+\\mathcal{L}_{J}\\rho_{s}(n-1,t),\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><msub><mi>ρ</mi><mi>s</mi></msub><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>J</mi></msub><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>-</mo><mn>1</mn></mrow><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhere $\\rho_s(\\chi,t) = \\sum_n e^{in\\chi}\\rho_s(n,t)$ and $\\mathcal{L}(\\chi) = \\mathcal{L}_0 + e^{i\\chi}\\mathcal{L}_J$. $\\chi$ is a counting field coupling to the lead where counting takes place. The solution to Eq. \\ref{chi-space-master-eqn} is then\n\n", "itemtype": "equation", "pos": 42637, "prevtext": "\nwhere $\\mathcal{L}_0$ describes the evolution of the system between electron counting events and $\\mathcal{L}_J$ describes jumps where an electron tunnels into the drain lead. This equation is more conveniently solved by Fourier transforming with respect to $n$ to give\n\n", "index": 15, "text": "\\begin{equation} \\label{chi-space-master-eqn}\n\\dot{\\rho_s}(\\chi,t) = \\mathcal{L}(\\chi)\\rho_s(\\chi,t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\rho_{s}}(\\chi,t)=\\mathcal{L}(\\chi)\\rho_{s}(\\chi,t),\" display=\"block\"><mrow><mrow><mrow><mover accent=\"true\"><msub><mi>ρ</mi><mi>s</mi></msub><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhere $\\Omega(\\chi, t-t_0) = e^{\\mathcal{L}(\\chi)(t-t_0)}$ is a time-propagator. The full counting statistics is encoded in the probability distribution of the number of electrons, $n$, transmitted to the drain lead \\cite{Marcos2010}, which can be expressed\n\n", "itemtype": "equation", "pos": 43005, "prevtext": "\nwhere $\\rho_s(\\chi,t) = \\sum_n e^{in\\chi}\\rho_s(n,t)$ and $\\mathcal{L}(\\chi) = \\mathcal{L}_0 + e^{i\\chi}\\mathcal{L}_J$. $\\chi$ is a counting field coupling to the lead where counting takes place. The solution to Eq. \\ref{chi-space-master-eqn} is then\n\n", "index": 17, "text": "\\begin{equation}\n\\rho(\\chi,t) = \\Omega(\\chi, t-t_0) \\rho(\\chi, t_0),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\rho(\\chi,t)=\\Omega(\\chi,t-t_{0})\\rho(\\chi,t_{0}),\" display=\"block\"><mrow><mrow><mrow><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><msub><mi>t</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nTransforming to $\\chi$-space gives the characteristic function of the distribution\n\n", "itemtype": "equation", "pos": 43347, "prevtext": "\nwhere $\\Omega(\\chi, t-t_0) = e^{\\mathcal{L}(\\chi)(t-t_0)}$ is a time-propagator. The full counting statistics is encoded in the probability distribution of the number of electrons, $n$, transmitted to the drain lead \\cite{Marcos2010}, which can be expressed\n\n", "index": 19, "text": "\\begin{equation}\nP(n,t) = \\mbox{tr}\\{ \\rho_s (n,t) \\}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"P(n,t)=\\mbox{tr}\\{\\rho_{s}(n,t)\\}.\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mtext>tr</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">{</mo><mrow><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhich can also be expressed \\cite{Bagrets2003} as\n\n", "itemtype": "equation", "pos": 43500, "prevtext": "\nTransforming to $\\chi$-space gives the characteristic function of the distribution\n\n", "index": 21, "text": "\\begin{equation}\n\\mathcal{G}(\\chi,t) = \\sum_n P(n,t)e^{in\\chi},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{G}(\\chi,t)=\\sum_{n}P(n,t)e^{in\\chi},\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>χ</mi></mrow></msup></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nWe are interested in the cumulants of the current distribution rather than the characteristic function of the distribution of the number of particles transferred to the drain lead. We therefore use the following expression for the current cumulants\n\n", "itemtype": "equation", "pos": 43629, "prevtext": "\nwhich can also be expressed \\cite{Bagrets2003} as\n\n", "index": 23, "text": "\\begin{equation} \\label{characteristic-fn-dm-form}\n\\mathcal{G}(\\chi,t) = \\mbox{tr}\\{ \\Omega(\\chi,t-t_0)\\rho_s(\\chi,t_0) \\}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{G}(\\chi,t)=\\mbox{tr}\\{\\Omega(\\chi,t-t_{0})\\rho_{s}(\\chi,t_{0})\\}.\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mtext>tr</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">{</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mrow><mi>t</mi><mo>-</mo><msub><mi>t</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><msub><mi>t</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\nwhere $\\mathcal{F}(\\chi,t) = \\mbox{ln}\\mathcal{G}(\\chi,t)$ is the cumulant generating function and the limit $t\\rightarrow \\infty$ ensures the average is carried out in the steady state. Additionally we assume the system has reached its steady state $\\rho_{stat}$ by time $t=t_0$ so we include this instead of the initial state in Eq. \\ref{characteristic-fn-dm-form}.\n\nWe also calculate the second order correlation function $g^{(2)}(t)$ for electron transport using the equation\\cite{Emary2012}\n\n", "itemtype": "equation", "pos": 44017, "prevtext": "\nWe are interested in the cumulants of the current distribution rather than the characteristic function of the distribution of the number of particles transferred to the drain lead. We therefore use the following expression for the current cumulants\n\n", "index": 25, "text": "\\begin{equation} \\label{Nth-cumulant}\n\\langle I^N \\rangle_c = \\frac{d}{dt} \\frac{\\partial^N \\mathcal{F}(\\chi,t)}{\\partial(i\\chi)^N}|_{\\chi\\rightarrow 0, t\\rightarrow \\infty},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\langle I^{N}\\rangle_{c}=\\frac{d}{dt}\\frac{\\partial^{N}\\mathcal{F}(\\chi,t)}{%&#10;\\partial(i\\chi)^{N}}|_{\\chi\\rightarrow 0,t\\rightarrow\\infty},\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>I</mi><mi>N</mi></msup><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub><mo>=</mo><msub><mrow><mrow><mfrac><mi>d</mi><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mrow><msup><mo>∂</mo><mi>N</mi></msup><mo>⁡</mo><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>χ</mi><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mi>χ</mi><mo stretchy=\"false\">)</mo></mrow><mi>N</mi></msup></mrow></mfrac></mrow><mo fence=\"true\" stretchy=\"false\">|</mo></mrow><mrow><mrow><mi>χ</mi><mo>→</mo><mn>0</mn></mrow><mo>,</mo><mrow><mi>t</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></mrow></msub></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05260.tex", "nexttext": "\n\n\\section*{Acknowledgements}\nThe authors would like to thank Clive Emary for helpful discussions. Financial support from the Engineering and Physical Sciences Research Council (EPSRC UK) Grant EP/G005222/1 and from the EU FP7 Project PAPETS (GA 323901)is gratefully acknowledged.\n\n\\section*{Author contributions statement}\nA.O-C designed the research, R.S and H.H-N carried out the calculations. RS, H.H-N, RvG and A.O-C analysed the results and wrote the manuscript.\n\n\\section*{Additional information}\nThe authors declare no competing financial interests.\n\n\\bibliographystyle{unsrt}\n\\bibliography{references}\n\n\n", "itemtype": "equation", "pos": 44703, "prevtext": "\nwhere $\\mathcal{F}(\\chi,t) = \\mbox{ln}\\mathcal{G}(\\chi,t)$ is the cumulant generating function and the limit $t\\rightarrow \\infty$ ensures the average is carried out in the steady state. Additionally we assume the system has reached its steady state $\\rho_{stat}$ by time $t=t_0$ so we include this instead of the initial state in Eq. \\ref{characteristic-fn-dm-form}.\n\nWe also calculate the second order correlation function $g^{(2)}(t)$ for electron transport using the equation\\cite{Emary2012}\n\n", "index": 27, "text": "\\begin{equation} \\label{g2}\ng^{(2)}(t) = \\frac{\\mbox{tr}\\{ \\mathcal{L}_j \\Omega(0,t) \\mathcal{L}_j \\rho_{stat}\\}}{\\mbox{tr}\\{ \\mathcal{L}_j\\rho_{stat}\\}^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"g^{(2)}(t)=\\frac{\\mbox{tr}\\{\\mathcal{L}_{j}\\Omega(0,t)\\mathcal{L}_{j}\\rho_{%&#10;stat}\\}}{\\mbox{tr}\\{\\mathcal{L}_{j}\\rho_{stat}\\}^{2}}.\" display=\"block\"><mrow><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mtext>tr</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">{</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>j</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo>,</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow><mo stretchy=\"false\">}</mo></mrow></mrow><mrow><mtext>tr</mtext><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">{</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi></mrow></msub></mrow><mo stretchy=\"false\">}</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]