[{"file": "1601.05207.tex", "nexttext": "\n\nRelated to accelerators, the consequences and the probability of an uncontrolled beam loss need to be estimated to get an idea about the risk. Machine protection systems prevent damage to equipment after a failure. The higher the risk, the more machine protection becomes important. Machine protection needs to be considered during design, construction and operation of the accelerator.\n\nIf a specific failure is considered, the consequences of the failure can be estimated, in terms of damage to equipment (repair requiring investment, e.g.\\ in money), in downtime of the accelerator (e.g.\\ in days) and in radiation dose to personnel accessing equipment (e.g.\\ in mSv).\n\nIn the estimation of downtime of the accelerator for repairs the availability of spare parts needs to be considered. If the accelerator was operating with beam, radioactive activation of material must be taken into account. It may be necessary to wait for cool-down of irradiated components to reduce the dose before accessing the equipment.\n\nThe second factor entering into the risk is the probability of such a failure happening (e.g.\\ measured in number of failures per year).\n\nFor beam operation, a list of all possible failures that could lead to beam loss in equipment should be considered. This is not obvious, since there is a nearly infinite number of mechanisms for losing the beam. However, the most likely failure modes and in particular the worst-case failures and their probabilities must be considered.\n\n\\section{Challenges in the protection of LHC and ESS}\nMany accelerators operate with high beam intensity and/or energy. For synchrotrons and storage rings, the energy stored in the beam increased with time (from ISR to LHC). For linear accelerators and fast-cycling machines, the beam power increases. Two examples illustrate machine protection challenges for a circular collider (LHC) and a high-intensity proton linac (ESS).\n\nFor the future another challenge is the  emittance that becomes smaller, down to a beam size of a nanometer. This is important today, and even more relevant for future projects such as ILC, with increased beam power or energy density (measured in W/mm$^2$ or J/mm$^2$) and increasingly complex machines.\n\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.75\\linewidth]{LHCEnergy_new.png}\n  \\caption{Energy stored in the beams for different accelerators (based on a figure by R.~Assmann)}\n  \\label{fig-stored-beam-energy}\n\\end{figure}\n\n\\subsection{LHC collider}\nThe LHC is designed to operate at a momentum of 7~TeV/$c$ with 2808 bunches, each bunch with a nominal intensity of $1.15 \\times 10^{11}$ protons. Machine protection is required during all phases of operation since the LHC is the first accelerator with the intensity of the injected beam already far above the threshold for damage. The energy stored in the nominal LHC beam of 362~MJ corresponds to the energy of a 200~m long fast train at 155 km per hour and to the energy stored in 90~kg of TNT. Surprisingly, this is the same as the energy stored in 15~kg of chocolate; it matters most how easily and fast the energy is released. The energy in an accelerator beam can be released in some 10~$\\mu$s.\n\nA Livingston-type plot (\\Fref{fig-stored-beam-energy}) shows the energy stored in the beam as a function of particle momentum. At 7~TeV/$c$, fast beam loss with an intensity of about 5\\% of a single `nominal bunch' could damage equipment (e.g.\\ superconducting coils). The only component that can stand a loss of the full beam is the beam dump block. All other components would be severely damaged. The LHC beams must \\textit{always} be extracted into the beam dump blocks at the end of a fill as well as in case of a failure.\n\nDuring the first phase of operation between 2009 and 2013 the momentum was limited to 4~TeV/$c$ and the maximum stored beam energy was up to about 140~MJ. This was the consequence of the 2008 LHC accident that happened during test runs without beam. A magnet interconnect was defective and the circuit opened. An electrical arc provoked a helium pressure wave damaging about 600~m of the LHC and polluting the beam vacuum over more than 2~km (Fig. \\ref{LHC-accident-2008-arcing}). An overpressure from the expansion of liquid helium damaged the structure (see Figs. \\ref{LHC-accident-2008-overpressure} and \\ref{LHC-accident-2008-displacement}). A total of 53 magnets had to be repaired.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.6\\linewidth]{LHC-accident-2008-arcing.png}\n\\caption{Damage from an electrical arc after the LHC accident in 2008}\n\\label{LHC-accident-2008-arcing}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.42\\linewidth]{LHC-accident-2008-overpressure.png}\n\\caption{Damage from the overpressure in the cryostat after the LHC accident in 2008}\n\\label{LHC-accident-2008-overpressure}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.6\\linewidth]{LHC-accident-2008-displacment.png}\n\\caption{Displacement of a magnet after the LHC accident in 2008}\n\\label{LHC-accident-2008-displacement}\n\\end{figure}\n\nProtection during the injection process is mandatory. The energy stored in the LHC beam at injection is about one order of magnitude higher than the stored energy in the beam for other accelerators.\n\nAn example of a critical failure for the LHC at injection is a failure of the injection kicker. If the kicker does not fire or fires at the wrong time, the incoming beam will not be deflected or the circulating beam will be deflected (see Fig. \\ref{LHC-injection-failure}). In both cases, the beam would hit the vacuum chamber and damage equipment.\n\nDuring the injection process injection collimators are positioned in the vacuum chamber to capture the mis-kicked beam. This type of failure, e.g.\\ a wrong kick of the injection kicker, happened already several times. Since the injection absorber was always at the correct position no damage was observed; however, due to grazing beam incidence superconducting magnets downstream of the injection region quenched.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.48\\linewidth]{LHC-injection-failure.png}\n\\includegraphics[width=.48\\linewidth]{LHC-injection-protection.png}\n\\caption{LHC injection failure. Left: the injection kicker does not deflect the incoming beam. The beam would hit vacuum chamber and equipment. Right: the injection kicker does not deflect the incoming beam. The injection absorber is correctly positioned and the beam hits the absorber.}\n\\label{LHC-injection-failure}\n\\end{figure}\n\n\\subsection{ESS spallation source}\nThe ESS spallation source being built at Lund, Sweden is designed to accelerate a proton beam with an average power of 5~MW and to direct it onto a target. Operation of the ESS will be  at a frequency of 14~Hz, with a pulse length of 2.86~ms with a peak power of 125~MW. The layout of the ESS accelerator is shown in Fig.~\\ref{ESS-layout}. We now give an example of a critical failure at ESS (see Fig. \\ref{ESS-bend}):\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=1.0\\linewidth]{ESS-Layout.png}\n\\caption{Layout of the ESS accelerator: the source, low-energy beam transport and RFQ are followed by the medium-energy beam transport. The protons are accelerated by a normal-conducting linac, followed by three sections of superconducting cavities. In the high-energy beam transport line the protons are transported to the target.}\n\\label{ESS-layout}\n\\end{figure}\n\n\n\\begin{enumerate}\n  \\item the bending magnet in the junction between HEBT-S2 and HEBT-S3 deflects the beam to bring the protons into the target plane;\n  \\item assume that the power supply for the bending magnets in HEBT-S2 fails and the magnets stop deflecting the beam;\n  \\item the probability for such failure in one year is about 0.1 (assuming a mean time between failures (MTBF) for power supplies of 700,000 h = 10 years);\n  \\item the beam is not deflected and hits the vacuum chamber. The consequences would be damage to magnets and vacuum pipes and possibly a pollution of superconducting cavities upstream.\n\\end{enumerate}\n\nIf a failure is detected the beam must be stopped at the source or in the low energy part of the accelerator. \n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=1.0\\linewidth]{ESS-bend.png}\n\\caption{High-energy part of the ESS accelerator. The beam is bent from the accelerator plane upwards to the plane with the high-power target. It is also possible to let the beam go straight to a commissioning beam dump.}\n\\label{ESS-bend}\n\\end{figure}\n\n\\section{Beam losses and consequences}\n\n\\subsection{Energy deposition from high-energy particles}\nParticle losses in a material lead to ionization and particle cascades. Energy deposition starts when a charged particle enters material. The maximum energy deposition can be deep in the material at the maximum of the hadron or electromagnetic shower depending on the particle momentum. The energy deposition leads to a temperature increase in the material that can be vaporized, melted, deformed or lose its mechanical properties, depending on the material and the beam impact.\n\nThere is already some risk of damage to sensitive equipment for an energy deposition of some 10~kJ (beam impact for a short time, say a maximum of a few milliseconds).\nThe risk of damage to equipment  for some megajoules is very large.\n\nEquipment becomes activated due to beam losses. It is considered to be acceptable if beam losses do not exceed, say, 1~W/m (assuming proton beams with high energy, say above some 100~MeV/$c$). Another principle is `ALARA': exposure of personnel to radiation should be `as low as reasonably achievable'. If a further reduction of the beam losses below 1~W/m is reasonably possible, this is recommended in order to minimize exposure of service personnel. Radioactive activation of material is mainly an issue for hadron accelerators; it is less problematic for electron--positron machines.\n\nFor accelerators with superconducting magnets there is a specific problem: even with beam loss much below the damage threshold, superconducting magnets could quench. In case of a quench, beam operation is interrupted for some time (10 min up to many hours) leading to downtime. In order to avoid beam-induced quenches, beam losses are monitored and the beam is dumped if a predefined threshold is exceeded before a magnet quenches, reducing the downtime since the time to recover from a quench is avoided. The damage threshold is far above the quench threshold; therefore, this strategy also protects magnets from beam-induced damage.\n\nTo get an idea of the damage potential, the energy loss by ionization at the surface of the target can be estimated using the Bethe--Bloch equation, ignoring hadron showers (see Fig.~\\ref{Energy-Loss-Iron-BB}). It is interesting to observe that the energy loss for low-energy particles is very high. For a proton at 7~TeV/$c$ the energy loss is dominated by hadron showers and the maximum energy deposition is deep in the material.\n\nThere is no straightforward expression for the energy deposition of high-energy particles, since this depends on the particle type, the momentum, the beam parameters and the material parameters (atomic number, density, specific heat). Programs such as FLUKA \\cite{Fasso2003}, MARS \\cite{MARS} or GEANT4 \\cite{GEANT} are being used for the calculation of energy deposition (and subsequent temperature increase) as well for as the activation of the material that is exposed.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.65\\linewidth]{Energy-Loss-Iron-BB.png}\n\\caption{Energy loss for protons when entering into an iron block, calculated by the Bethe--Bloch equation. Effects of the hadron shower are not included.}\n\\label{Energy-Loss-Iron-BB}\n\\end{figure}\n\nRelevant parameters to be considered for heating and possible damage to material are the momentum of the particle, the particle type, the energy stored in the beam, the beam power, the beam size, the beam power/energy density (MJ/mm$^{2}$, MW/mm$^{2}$), the time structure of the beam and cooling conditions.\n\nIn order to estimate the order of magnitude for possible damage:\n\\begin{enumerate}\n  \\item one MJ can heat and melt about 1.5~kg of copper;\n  \\item one MJ corresponds to the energy stored in about 0.25~kg of\n  TNT \\cite{wiki_1};\n  \\item one MW during one second corresponds to one MJ.\n\\end{enumerate}\n\nThe following example illustrates the calculation of the consequences for beam losses.\n\\begin{enumerate}\n  \\item A proton beam travels through a thin window of thickness $d$.\n  \\item Assume a beam area of 4 $\\sigma_x \\times \\sigma_y$, with $\\sigma_x$ and $\\sigma_y$ the root mean square (r.m.s.) beam sizes assuming Gaussian beams.\n  \\item Assume a homogeneous beam distribution.\n\\end{enumerate}\n\nThe energy deposition can be calculated; mass and specific heat are known.\nThe temperature can be calculated (rather good approximation), assuming a fast loss and no cooling.\n\nWith low-energy protons (3 MeV/$c$) and a beam size of $\\sigma_x = \\sigma_y = 1$~mm, the following parameters are calculated:\n\\begin{enumerate}\n  \\item iron specific heat = 440 J/(kg $\\times$ K);\n  \\item iron specific weight = 7860 kg/m$^3$;\n  \\item d$E$/d$x$ = 56.7 MeV/mm;\n  \\item $N_{\\rm p} = 1.16 \\times 10^{12}$.\n\\end{enumerate}\nThe temperature increase for these parameters is 763~K.\n\nFor high-energy protons the energy deposition by hadronic showers (see Fig. \\ref{Hadron-Shower}) dominates:\n\\begin{enumerate}\n    \\item pions are created when the proton travels through matter;\n    \\item the decay of pions creates electromagnetic showers;\n    \\item there is an exponential increase in number of created particles;\n    \\item the final energy deposition is to a large extent due to the large number of electromagnetic particles;\n    \\item the energy deposition scales roughly with total energy of incident particles;\n    \\item the maximum of the energy deposition can be deep in the material;\n    \\item energy deposition is a function of the particle type, its momentum and parameters of the material (atomic number, density, specific heat).\n\\end{enumerate}\n\nThere is no straightforward expression to calculate the energy deposition by high-energy particles. Calculation needs to be done by codes, such as FLUKA, GEANT or MARS.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.4\\linewidth]{Hadron-Shower.png}\n\\vspace{0.5cm}\n\\caption{Illustration of a hadronic shower}\n\\label{Hadron-Shower}\n\\end{figure}\n\nA simple approximation for the temperature increase in material for a 7~TeV/$c$ proton beam impact is given in the following example: for copper, the maximum longitudinal energy deposition for a single 7~TeV/$c$ proton at about 25~cm inside the material is $E_{\\rm dep}=1.5 \\times 10^{-5}$~J/kg (calculation with FLUKA).\n\nThe energy required to heat and melt copper is $E=6.3 \\times 10^5$~J/kg. Assuming a pencil beam, the number of particles required to damage (melt) copper is of the order of $10^{10}$. For graphite, the number of particles needed to cause damage is about one order of magnitude larger.\n\nMore refined and complete calculations can be made to determine real-world scenarios on a case-by-case basis, where the distribution of the impacting particles and the details of the material and geometry are important.  After the calculation of the temperature increase, the response of the material to beam impact needs to be addressed (deformation, melting etc). Mechanical codes such as ANSYS and  hydrodynamic codes such as BIG2 and others can be used.\n\nBeams at very low energy have limited power; however, the energy deposition is very high and can lead to (limited) damage in the case of a beam impact at the initial stage of an accelerator, after the source, in the low-energy beam transport and in the radiofrequency quadrupole (RFQ). This might lead to a long downtime, depending on availability of spares.\n\nBeams at very high energy can have a tremendous damage potential for the LHC; damage to metals is expected for about $10^{10}$ protons. One LHC bunch has about $1.5\\times10^{11}$ protons, in total up to 2808 bunches. In case of catastrophic beam loss, the LHC could be possibly damaged beyond repair. The penetration of 2808 bunches (e.g.\\ after a kicker failure) into a metal block such as a magnet has been estimated to be about 20 to 30~m (hydrodynamic beam tunnelling) \\cite{Tahir2005}.\n\n\\subsection{Examples for damage from beam losses}\nThe design of LHC protection elements is based on detailed energy deposition simulations and an assumption for the damage levels. A dedicated experiment was carried out to cross-check the validity of this approach by trying to damage material in a controlled way with beam~\\cite{Kain2005a}. The impact of a 450~GeV/$c$ beam extracted from the SPS on a specially designed high-$Z$ target was simulated for a simple geometry comprising several typical materials used for LHC equipment. The beam intensities for the test were chosen to exceed the damage limits of parts of the target, between $2 \\times 10^{12}$ and $8 \\times 10^{12}$ protons. The transverse r.m.s.\\ beam dimensions were about 1~mm.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{DamageExperiment.png}\n  \\caption{Damage to a copper plate by 450 GeV/$c$ proton beams with different intensities ($2\\times 10^{12}, 4\\times 10^{12}, 6\\times 10^{12} $ and $ 8\\times 10^{12}$).}\n  \\label{DamageExperiment}\n\\end{figure}\n\nThe geometry of the target was modelled in FLUKA and the target heating was estimated. The temperature rise was obtained from the energy deposition using the temperature-dependent heat capacity for each material. The results of the controlled damage test show reasonable agreement with the simulations. Zinc, copper and INCONEL plates were damaged at the predicted locations within the error of the simulation, see Fig.~\\ref{DamageExperiment}. The transverse extent of the damaged area on the zinc and copper plates was predicted to within 30\\%. The outcome of the experiment gives confidence that beam-induced damage limits for simple geometries can be adequately predicted with simulations.\n\nAn example for involuntarily beam-induced accidents is the damage to a vacuum chamber in the SPS extraction line. In 2004, during extraction tests with LHC beam parameters with 450~GeV/$c$ protons, a beam with an energy of 2~MJ was deflected with grazing incidence into a vacuum chamber after the failure of a septum magnet. The chamber was cut along a length of 25~cm, with a groove of a length of 70~cm. Condensed drops of steel are visible on the opposite side of the vacuum chamber. Vacuum chamber and quadrupole magnet needed to be replaced.\n\nAnother example for beam-induced damage is an accident at the Tevatron, Fermilab. A so-called Roman pot (a device equipped with particle detectors that can be moved in the vacuum chamber) moved into the beam. Particle showers generated by the Roman pot quenched superconducting magnets. The beam moved by 0.005 mm/turn, and touched a collimator jaw surface after about 300 turns. The entire beam was lost, mostly on the collimator that was damaged (see Fig. \\ref{Damage-Roman-Pot}).\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{Damage-Roman-Pot.png}\n  \\caption{Damage to a collimator at Fermilab for 900 GeV/$c$ proton beams, when a Roman pot moved into the beam and massively quenched magnets.}\n  \\label{Damage-Roman-Pot}\n\\end{figure}\n\nObservation of HERA/DESY showed grooves on the surface of the tungsten collimator when opening the vacuum chamber. No impact was observed during operation.\n\nEquipment that operates at high voltage can be very sensitive to beam losses. If the beam hit the surface of a high-voltage system (e.g.\\ RFQ, kicker magnets, cavities) the surface quality might degrade. It is then not possible to operate at the same voltage and the probability for arcing is increased.\n\nThis was observed at SNS where errant beam losses led to a degradation of the performance of a superconducting cavity (see Fig. \\ref{Damage-SNS} \\cite{Blokland2013}). Beam current monitors (BCMs) measure current pulses at different locations along the linac, before the cavity section and after the cavity section (see the red and blue curves). The figure shows a beam loss during 16 $\\mu$s; this corresponds to an energy of 30~J at the end of the Drift Tube Linac (DTL), 66~J at the end of the Coupled-Cavity Linac (CCL) and 350~J at the end of the superconducting linac.\n\nBeam losses are likely to be caused by problems in the ion source, in the low-energy beam transfer or in the normal-conducting linac. After such errant beams, sometimes the cavity gradient needs to be lowered. Conditioning after warm-up helps in most cases, but in one case a cryo-module had to be exchanged. The energy of beam losses is about 100~J.\nThe damage mechanisms are not fully understood; it is assumed that some beam hitting the cavity desorbs gas or particulates (= small particles) creating an environment for arcing.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{Damage-SNS.png}\n  \\caption{Beam losses in the SNS linac, with a 1 GeV/$c$ proton beam. These losses led to a degradation of superconducting cavities (figure kindly provided by M. Plum~\\cite{Plum2013}).}\n  \\label{Damage-SNS}\n\\end{figure}\n\n\\section{Mechanisms for generating beam losses}\nContinuous beam losses are inherent during the operation of accelerators and are taken into account during the design of the accelerator. Accidental beam losses are transient losses with time scales from ns to many seconds due to a multitude of failure mechanisms. The number of possible failures leading to accidental beam losses is (nearly) infinite.\n\n`Machine protection' protects equipment from damage, activation and downtime in case of accidental beam losses. Machine protection includes a large variety of systems.\n\n\\subsection{Continuous beam losses}\nParticles are lost due to a variety of reasons: beam--gas interaction, losses from collisions and losses of the beam halo. Limitation of beam losses is in order of 1~W/m to avoid activation and still allow hands-on maintenance for high hadron energy accelerators.\n\nSeveral high-intensity hadron accelerators are operating with beams of a power of 1~MW and more (SNS, PSI). The are plans for accelerators of 5~MW (ESS), 10~MW and more. For 1~MW, a loss of 1\\% corresponds to 10~kW, not to be lost along the beamline to avoid activation of material, heating, quenching of magnets etc. If a length of  200~m is assumed, the losses would correspond to 50~W/m, far above what is acceptable.\n\nAnother example is the LHC that operates with a stored beam with an energy of 360~MJ. A beam lifetime of 10~min corresponds to a beam loss of 500~kW that should not be lost in superconducting magnets. The strategy to keep beam losses at an acceptable level is as follows:\n\\begin{enumerate}\n\\item avoid beam losses as far as possible;\n\\item define the aperture by collimators;\n\\item capture continuous particle losses with collimators at specific locations.\n\\end{enumerate}\n\nA collimation system is a very efficient system to avoid too high beam losses in the accelerator (so-called beam cleaning). It can be very complex with (massive) material blocks close to the beam installed in an accelerator to capture halo particles. The collimation system at LHC reduces the losses by four orders of magnitude and also captures fast accidental beam losses. About 100 collimators are installed in LHC. Figure~\\ref{LHC-Collimator} shows the view of one of the two-sided collimators, it is closed down to 2~mm when operating at 7~TeV/$c$. Collimators (or beam absorbers) are equally important to capture mis-steered beam.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.6\\linewidth]{Collimator.png}\n\\caption{Collimator at LHC}\n\\label{LHC-Collimator}\n\\end{figure}\n\n\\subsection{Accidental (transient) beam losses}\n\\subsubsection{Ultra-fast beam losses}\nThere are several mechanisms of failures that lead to a beam loss within a very short time, typically in the range of nanoseconds to microseconds.\n\\begin{enumerate}\n\\item Failures of kicker magnets (during injection, at extraction, for special kicker magnets for beam diagnostics).\n\n\\item Beam transfer via transfer lines between different accelerators and from the accelerator to a target station. The target could be for secondary particle production or the beam dump block. A common example for such a failure is a wrong setting of a magnet in the line that leads to a deflection of the beam into the vacuum chamber.\n\n\\item Too small beam size at a target station. Targets for high-intensity beams are designed for a certain beam size. If the beam size is much smaller, for example due to a wrong optics, the target or the window in front of the target could be damaged.\n\\end{enumerate}\n\n\\subsubsection{Very fast beam losses}\nMechanisms that lead to a very fast beam loss (typically in the range of some microseconds to milliseconds) are multiturn beam losses in a circular accelerator due to a large number of possible failures, mostly in the powering system of the main magnets, with a typical time constant of some 10 turns to many seconds. For linacs a trip of the RF can create beam losses within a very short time.\n\n\\subsubsection{Fast beam losses}\nFast beam loss (some 10 ms to seconds) can have many different origins: failures in the magnet powering system, vacuum valves that close unintentionally, trips of the RF acceleration system, beam instabilities, failures in the control system etc.\n\n\\subsubsection{Slow beam losses}\nSlow beam losses (many seconds) can have many different origins: high vacuum pressure, failures in the powering system for corrector magnets, wrong parameter, RF etc. The main difference between slow and fast losses is that the operation crew could still be involved in the decision on how to continue operation (for example, to stop beam operation or to change a parameter that is not set correctly).\n\n\\subsection{Failure mechanisms and their probability}\n\\subsubsection{Failure of accelerator equipment}\nExamples are power converter trips, magnet quenches, AC distribution failures (e.g.\\ as a consequence of a thunderstorm), objects in the vacuum chamber, vacuum leaks, trip of the RF system, spontaneous firing of a kicker magnet etc.\n\n\\subsubsection{Failure of the control system}\nWrong parameter sent to equipment such as a wrong magnet current or a wrong magnet current function, trigger problem, failure in the timing system, failure in the feedback system, firing of a kicker magnet at the wrong time or with the wrong strength.\n\n\\subsubsection{Failure during operation}\nWrong manipulation of chromaticity, tune or orbit etc.\n\n\\subsubsection{Beam instability}\nFor example, due to too high beam or bunch current, with typical time constant of many milliseconds to seconds.\n\nIn order to calculate the risk related to a hazard, the probability of the occurrence and the damage potential need to be estimated. For the design of the protection system, the time constant of the failure as well as the time constant for beam loss due to the failure need to be known.\n\nExperience from LHC (the most complex accelerator currently in operation): when the beams are colliding, the optimum length of a store is in the order of 10--15~h, then it is ended by operation with a beam dump. However, most fills (about 70\\%) are ended by failures; the machine protection systems dump the beams. The MTBF is about 6~h. For other large accelerators (SNS, synchrotron light sources) the MTBF is between 20~h and up to several hundred hours.\n\n\\section{Strategy for machine protection}\n\\subsection{Principles for machine protection}\nThere are some principles for machine protection that need to be considered:\n\\begin{enumerate}\n\\item protect the machine;\n\\item protect the beam;\n\\item provide the evidence.\n\\end{enumerate}\n\n\\subsubsection{Protect the machine}\nThe highest priority is clearly to avoid any damage to accelerator equipment.\n\n\\subsubsection{Protect the beam}\nThe objective is to maximize beam time, but complex protection systems reduce the availability of the machine. The number of `false` interlocks stopping operation must be minimized. This is a trade-off between protection and operation. A `false` interlock is defined as an interlock that stops operation even though there is no risk (example: a temperature sensor reading a wrong value, therefore switching off the power converter of a magnet and stopping beam operation).\n\n\\subsubsection{Provide the evidence}\nIf the protection systems stop operation (e.g.\\ dump the beam or inhibit injection), clear diagnostics should be provided \\cite{Zerlauth2009}. If something goes wrong (leading to damage, but also a near miss), it should be possible to understand the event. This needs synchronized transient recording of all the important parameters in all relevant systems, as well as long-term logging of parameters with reduced frequency (such as 1~Hz). Examples are the current in all magnets, beam position, beam losses and beam intensity. The frequency of transient recording depends on the system and can go from Hz to MHz.\n\n\\subsection{Active and passive protection}\n\\subsubsection{Active protection}\nActive protection starts with the detection of the failure by a sensor that is monitoring the parameters of equipment (for example, detecting a failure of a power converter) or by beam instrumentation detecting when the beam starts to be affected by the failure (for example, increased beam losses or a different orbit). The beam must be turned off as soon as possible with an actuator. This can be done in different ways, for example by switching off the source or the RF system. In the case of an accelerator complex with a chain of several accelerators, injection of the beam into the next stage of the accelerator complex should be prevented in case of failure. When the beam is stored in a synchrotron or storage ring, the beam must be extracted onto a target that can accept the beam pulse without being damaged (beam dump).\n\n\\subsubsection{Passive protection}\nThere are failures (e.g.\\ ultra-fast losses) when active protection is not possible. One example is the protection against mis-firing of an injection or extraction kicker magnet. A beam absorber or collimator is required to stop the mis-kicked beam in order to avoid damage. All possible beam trajectories in such case must be considered, and the absorbers must be designed to absorb the beam energy without being damaged. Another example is a fast extraction of a high-intensity beam from a circular accelerator into a transfer line. When the extraction takes place, the parameters of the transfer line must be correctly set since in case of a wrong magnet current the beam could be deflected into the vacuum chamber.\n\nThe best strategy is to prevent a specific failure from happening. As an example, fast diagnostic kicker magnets that could deflect the beams into the vacuum chamber wall should only be installed in high-intensity machines if they are indispensable.\n\nFailure should be detected as early as possible, with priority at the hardware level. For most failures, this allows stopping beam operation before the beam is affected. This requires monitoring of the hardware (such as state signals, parameters etc). As an example, a trip of a magnet power converter should be detected as early as possible.\n\nIt is not always possible to detect failures at the hardware level. The second method is to detect the initial consequences of a failure with beam instrumentation and to stop the beam before equipment is damaged. This requires reliable beam instrumentation.\n\nWhen a failure is detected, beam operation must be stopped. For synchrotrons and storage rings the beam is extracted by a fast kicker magnet into a beam dump block. Injection must be stopped. For linacs the beam is stopped in the low-energy part of the accelerator by switching off the source, deflecting the low-energy beam by electrostatic plates (`choppers') or by switching off the RFQ for proton linacs.\n\nAn electronic system (beam interlock system)  links the different protection system. It ensures that the beam is extracted from a synchrotron, injection is stopped, RF acceleration might be stopped (for linacs). The interlock system might include complex logic.\n\n\\subsection{Design considerations for protection systems}\n\nThere are several principles that should be considered in the design of protection systems, although it might not be possible to follow all these principles in all cases.\n\\begin{enumerate}\n\n  \\item If the protection system does not work, it is better stopping operation rather than continuing and risking damaging equipment.\n\n  \\item Fail-safe design: in case of a failure in the protection system, protection functionalities should not be compromised. As an example, if the cable that triggers the extraction kicker of the beam dumping system is disconnected, operation must stop.\n\n  \\item Detection of internal faults: the protection system must monitor the internal status. In case of an internal fault, the fault should be reported. If the fault is critical, operation must be stopped.\n\n  \\item Remote testing should be an integral part of the design, for example between two runs. This allows verification of the correct status of the system.\n\n  \\item Critical equipment should be redundant (possibly diverse redundancy, with the same or similar functions executed by different systems).\n\n  \\item Critical processes for protection should not rely on complex software running under an operating system and requiring the general computer network.\n\n  \\item It should not be possible to remotely change the most critical parameters. If parameters need to be changed, the changes must be controlled and logged and password protection should ensure that only authorized personnel can do the change.\n\n  \\item Safety, availability and reliability of the systems should be demonstrated. This is possible by using established methods to analyze critical systems and to predict failure rates.\n\n  \\item Operate the protection systems early on before they become critical, to gain experience and to build up confidence. This could be done before beam operation, or during early beam operation when the beam intensity is low.\n\n  \\item It is inevitable to disable interlocks (e.g.\\ during the early phase of commissioning and for specific tests). Managing interlocks (e.g.\\ disabling) is common practice. Keep track and consider it in the system design. Example for LHC: masking of some interlocks is possible, but only for low-intensity/low-energy beams (`safe beams').\n\\end{enumerate}\n\n\\section{Beam instrumentation for machine protection}\n\\subsection{Beam loss monitors}\nBeam loss monitors (BLMs) are used for monitoring beam losses to understand the performance of the accelerator as well as for machine protection. If used for protection, it is important that the monitors cover the entire accelerator and there is no region without BLMs where beam losses can occur.\n\n\\subsection{Beam position monitors}\nBPMs ensure  that the beam has the correct orbit. In most cases the beam should be centred in the aperture. There are some exceptions, for example for extracting beams from an accelerator. The beam must have an offset, e.g.\\ a closed orbit bump is applied to position the beam close to a septum magnet. This must work reliably, otherwise the extracted beam might hit equipment. BPMs monitor the amplitude of such bumps and are effectively redundant monitors to the sensors measuring the magnet current in the closed orbit dipoles.\n\n\\subsection{Beam current monitors}\nIf the beam transmission between two locations of the accelerator complex is too low (if the beam is lost somewhere between): stop beam operation. Differential BCMs are of particular importance for linear accelerators.  At low energy (below about 50~MeV/$c$) beam loss monitors are not applicable and machine protection relies on differential beam current measurements. If the beam lifetime in a synchrotron or storage ring is too short: dump the beam.\n\n\\subsection{Beam size monitors}\nIf the beam size is too small, this could be dangerous for windows, targets etc. The monitor ensures correct beam size. A too small beam size could also lead to an underestimation of the damage potential of the circulating beam.\n\n\\section{Machine protection for different types of accelerators}\nHigh-energy hadron synchrotrons and colliders can have large stored energies in the beams. In case of a failure the energy stored in the beams must be safely discharged. In general, the beams are extracted onto a target that can withstand the full energy stored in the beam. Safely dumping the beams can be rather challenging. This is an issue for accelerators such as the LHC \\cite{TheLHCStudyGroup1995}, HERA \\cite{Werner2006}, Tevatron \\cite{Mokhov2006}, RHIC \\cite{Fedotov2007} and SPS \\cite{Goddard2006}.\n\nLinear colliders and other accelerators with very high beam power densities due to small beam size have other challenges. Examples are the SLAC linac \\cite{Koontz2006}, International Linear Collider (ILC), CLIC (Compact Linear Collider), Next Linear Collider (a project that was discussed before ILC) \\cite{Ross2000, Ross2000a} and FLASH \\cite{Froehlich2006, Froehlich2006a} (average power of 50~kW).\nFor an accelerator like the ILC one beam pulse can lead  to damage. A citation from \\cite{Ross2000a} discussing the use of a low-intensity pilot beam during operation says: ``for any time interval large enough to allow a substantial change in the beam trajectory of component alignment (fraction of a second), a pilot beam must be used to prove the integrity of the accelerator''.\n\nIn synchrotron light sources with high-intensity beams and secondary photon beam, the primary beam, but also the intense photon beam, can damage equipment.\n\nFor energy recovery linacs, we take as an example the prototype of such accelerators in Daresbury: a single bunch train cannot damage equipment, but in case of beam loss the next train must not leave the (injector) station \\cite{Buckley2006}.\n\nOwing to the low intensity of medical accelerators there is no risk of damage to equipment. However, it is vital to prevent a too high dose to patients. The strategies and techniques to minimize risks for humans are similar to those for machine protection.\n\nFor very short bunches with high current the beam induces image currents in surrounding equipment that can damage bellows, beam instruments, cavities etc.\n\n\n\n\\subsection{Examples from LHC}\nMachine protection starts with a careful commissioning of the magnet powering system, considering that an energy of about 10~GJ is stored in the superconducting magnets. Magnet protection and powering interlocks must be operational long before starting beam operation. The strategy for LHC machine protection when operating with beam reflects many of the principles that have been discussed is as follows.\n\n\\begin{enumerate}\n\n  \\item Definition of aperture by collimators.\n\n  \\item Early detection of failures of equipment acting on beams generates a beam dump request, possibly before the beam is affected.\n\n  \\item Active monitoring of the beam parameters with beam instruments detecting abnormal\n  beam conditions and generating beam dump requests within a single machine turn.\n\n  \\item Reliable transmission of beam dump requests from a large variety of systems to the beam dumping system. An active signal is required for operation; the absence of the signal is considered as a beam dump request and injection inhibit.\n\n  \\item Reliable operation of the beam dumping system for dump\n  requests or internal faults, safely extracting the beams onto external dump blocks.\n\n  \\item Passive protection by beam absorbers and collimators for specific cases of failure.\n\n\\end{enumerate}\n\nThe general architecture for the essential elements in the machine protection system at LHC is shown in Fig. \\ref{LHC-protection-overview}. The LHC has eight sectors and eight insertions; three sectors are related to machine protection: two cleaning insertions with a large number of collimators and one insertion for the beam dumping system. More than 3600 beam loss monitors are installed around the machine. In case of a failure detected by hardware or beam monitors, the beam interlock system transmit a beam dump request to the beam dumping system and the beams are extracted.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.78\\linewidth]{LHC-protection-overview.png}\n\\caption{Layout of LHC with some of the systems for machine protection}\n\\label{LHC-protection-overview}\n\\end{figure}\n\n\\subsubsection{Beam dumping system at LHC}\nThe role of the LHC beam dumping system \\cite{Uyhoven2008} is to safely dispose of the beam when beam operation must be interrupted for any reason. Fifteen fast kicker magnets with a pulse rise time of less than 3~$\\mu$s deflect the beam by an angle of 280~$\\mu$rad in the horizontal plane, see Fig.~\\ref{Beamdump-Layout}. To ensure that all particles are extracted from the LHC without losses, the beam has a particle-free abort gap with a length of 3~$\\mu$s corresponding to the kicker rise time. The extraction kickers are triggered such that the field increases from zero to the nominal value during this gap when there should be no particles.\n\nDownstream of the kickers the beam is deflected vertically by 2.4~mrad towards the beam dump block by 15 septum magnets. A short distance further downstream, 10 diluter kicker magnets are used to paint the bunches in both horizontal and vertical directions to reduce the beam density on the dump block. The beam is transferred through a 700~m long extraction line to increase the transverse r.m.s.\\ beam size from approximately 0.2 to 1.5~mm and to spread the bunches further on the dump block.\n\nThe overall shape is produced by the deflection of the extraction and dilution kickers. For nominal beam parameters, the maximum temperature in the beam dump block is expected to be in the order of about 800$^{\\circ}$C.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beamdump-Layout.png}\n\\caption{Layout of the beam dumping systems, for both LHC beams (courtesy of M.~Gyr)}\n\\label{Beamdump-Layout}\n\\end{figure}\n\n\\subsubsection{Beam loss monitoring at LHC}\nThe monitors should be fast, for LHC down to 40 $\\mu$s, in order to detect beam losses in time to stop operation. They should be designed such that they can trigger a beam dump and stop operation before very fast beam losses damage equipment. There are about 3600 chambers distributed over the ring to detect abnormal beam losses and if necessary trigger a beam abort \\cite{Dehning2011}.\n\nFor LHC (Fig.~\\ref{LHC-BLM}) and several other accelerators, ionization chambers are used to detect beam losses. The reaction time is down to microseconds;\nthey can have a very large dynamic range exceeding 10$^8$.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{LHC-BLM.png}\n\\caption{Beam loss monitor at LHC}\n\\label{LHC-BLM}\n\\end{figure}\n\nFigure~\\ref{Beam-Losses-normal} shows the beam losses around LHC during regular luminosity operation. Losses are low in the arcs with the superconducting magnets, higher in the insertions with the experiments due to the debris of the collisions and very high in the betatron cleaning insertions. Figure~\\ref{Beam-Losses-UFO} shows the losses recorded after a beam dump during regular operation. A UFO in the arc between the betatron cleaning insertion and the LHCb experiment caused locally an increase of beam losses. The UFO (dust particles getting into the beam, see \\cite{baer2013}) causes very fast losses and when the threshold of one BLM is exceeded, the beams are dumped (see Fig. \\ref{UFO}).\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beam-Losses-normal.png}\n\\caption{Regular beam losses during luminosity operation}\n\\label{Beam-Losses-normal}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beam-Losses-UFO.png}\n\\caption{Beam losses with UFO during luminosity operation}\n\\label{Beam-Losses-UFO}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{UFO.png}\n\\caption{Time structure of the beam losses caused by a UFO}\n\\label{UFO}\n\\end{figure}\n\n\\subsection{Protection for high power proton linacs}\nHigh-power proton accelerators (e.g.\\ spallation sources) operate with beam power of some 10~kW to above 1~MW. There is risk of both damage and activation. Examples are SNS \\cite{Sibley2005}, PSI cyclotron \\cite{Schmelzbach2006}, ISIS \\cite{Findlay2006}, J-PARC \\cite{Yoshikawa2007}), FRIB \\cite{Wei2012} and ESS designed for 5~MW \\cite{Peggs2005}.\n\nIn case of failure the beam must be switched off. The time needed to switch off the beam before equipment could be damaged depends on particle momentum, beam power, the type of failure and the equipment exposed to beam losses.\n\nIn case of an uncontrolled beam loss during 1~ms at ESS the deposited energy is up to 130~kJ, for 1~s up to 5~MJ. It is required to inhibit the beam after detecting uncontrolled beam loss as fast as possible. There is some delay between detection of a failure (e.g.\\ detection of beam losses by a BLM) and `beam off'. Figure \\ref{Laliplot} shows the time to melting of steel and copper in the case where the proton beam hits a metal surface between 3 and 80~MeV/$c$ \\cite{Tchelidze2012}.\n\nFor example, after the DTL normal-conducting linac, the proton energy is 78~MeV/$c$. In case of a beam size of 2~mm radius, melting would start after a beam impact of about 200~$\\mu$s. Inhibiting of the beam after a failure is detected should be in about 10\\% of this time.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Laliplot.png}\n\\caption{Time to melt copper and steel, as a function of proton momentum for different beam sizes \\cite{Tchelidze2012}}\n\\label{Laliplot}\n\\end{figure}\n\nThe time between detecting a failure and stopping the beam has to be considered. Assume that the beam is lost and the losses are detected by BLMs at the end of the linac. It takes some time to detect the losses and to generate an interlock signal ${\\rm d}T_{\\rm failure~detection}$, to propagate the interlock signal to the actuator that stops the beam ${\\rm d}T_{\\rm signal~transmission}$ and to stop the beam ${\\rm d}T_{\\rm inhibit~beam}$. There will be a number of bunches between source and end of the linac that cannot be stopped (${\\rm d}T_{\\rm beam~off}$). The total time that the beam will still be lost is given by (see also Fig. \\ref{Time-stop-beam})\n\n", "itemtype": "equation", "pos": 4681, "prevtext": "\n\n\\title{Machine Protection}\n\\author{R.~Schmidt}\n\\institute{CERN, Geneva, Switzerland}\n\\maketitle\n\n\\begin{abstract}\nThe protection of accelerator equipment is as old as accelerator technology and was for many years related to high-power equipment. Examples are the protection of powering equipment from overheating (magnets, power converters, high-current cables), of superconducting magnets from damage after a quench and of klystrons. The protection of equipment from beam accidents is more recent. It is related to the increasing beam power of high-power proton accelerators such as ISIS, SNS, ESS and the PSI cyclotron, to the emission of synchrotron light by electron--positron accelerators and FELs, and to the increase of energy stored in the beam (in particular for hadron colliders such as LHC). Designing a machine protection system requires an excellent understanding of accelerator physics and operation to anticipate possible failures that could lead to damage. Machine protection includes beam and equipment monitoring, a system to safely stop beam operation (e.g.\\ dumping the beam or stopping the beam at low energy) and an interlock system providing the glue between these systems. The most recent accelerator, the LHC, will operate with about\n$3 \\times 10^{14}$ protons per beam, corresponding to an energy stored in each beam of 360~MJ. This energy can cause massive damage to accelerator equipment in case of uncontrolled beam loss, and a single accident damaging vital parts of the accelerator could interrupt operation for years. This article provides an overview of the requirements for protection of accelerator equipment and introduces the various protection systems. Examples are mainly from LHC, SNS and ESS.\n\\end{abstract}\n\n\n\\section{Introduction}\n\nAccelerators, like all other technical systems, must respect some general principles with respect to safety and protection:\n\\begin{enumerate}\n  \\item protect the people (e.g.\\ following legal requirements);\n  \\item protect the environment (e.g.\\ following legal requirements);\n  \\item protect the equipment (the investment).\n\\end{enumerate}\n\nThe term 'equipment' includes all systems of the accelerator that must be protected during all phases of operation, with the accelerator operating with or without beam.\n\nIn this presentation the protection of equipment from damage or unacceptable activation caused by beam losses is discussed. First, some principles for the protection of accelerators are presented and then examples for machine protection from SNS \\cite{Sibley2003}, ESS \\cite{Peggs2005} and LHC \\cite{Schmidt2006} are given.\n\nProtection is not only relevant during operation with a beam. Without a beam, protection of high-power equipment must be considered. This is not the main subject of the article; however, a few examples are given as follows.\n\\begin{enumerate}\n\\item Superconducting magnets store a large amount of energy and there is the risk of a quench, either induced by the beam or due to other reasons, e.g.\\ training quenches. The magnets need to be designed and protected so that they are not damaged after a quench. The incident at the LHC on 19 September 2008 demonstrated that the risk of operation of a superconducting magnet system is high \\cite{Bajko2009}.\n\\item Some equipment (normal-conducting magnets, high-current cables, high-current power converters) requires air or water cooling. In case of a failure in the cooling system the equipment needs to be switched off.\n\\item In radiofrequency (RF) systems there is the risk of arcing due to high voltages. Arc detectors detect arcs and switch off the high-voltage source to avoid any damage.\n\\end{enumerate}\n\nAlthough there are quite a number of publications on issues related to machine protection, there are only a few summary papers, e.g.\\ \\cite{Sibley2003}.\n\n\\section{Definition of risk}\nRisks come from energy stored in a system (measured in joules) and power when operating a system (measured in watts). The energy and power flow needs to be controlled. An uncontrolled release of the energy, or an uncontrolled power flow, can lead to unwanted consequences:\n\\begin{enumerate}\n  \\item damage to equipment and loss of time for operation;\n  \\item for particle beams, activation of equipment.\n\\end{enumerate}\n\nThis is true for all systems, in particular for complex systems such as accelerators.\n\nA `hazard' is a situation that poses a level of threat to the accelerator.\nHazards are dormant or potential, with only a theoretical risk of damage. Once a hazard becomes `active' it becomes an incident or accident. Consequences and probability of an incident interact together to create a risk that can be quantified:\n\n", "index": 1, "text": "\\begin{equation}\n    \\mathrm{Risk} = \\mathrm{Consequences} \\times \\mathrm{Probability}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{Risk}=\\mathrm{Consequences}\\times\\mathrm{Probability}.\" display=\"block\"><mrow><mrow><mi>Risk</mi><mo>=</mo><mrow><mi>Consequences</mi><mo>×</mo><mi>Probability</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05207.tex", "nexttext": "\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Time-stop-beam.png}\n\\caption{Time to stop the beam in a linac}\n\\label{Time-stop-beam}\n\\end{figure}\n\nDepending on the length of the linac, this can be very long and might require intermediate beam dump systems in case of accelerators such as ILC.\n\n\\section{Conclusions}\nThere has been a significant increase in the number of papers on machine protection during particle accelerator conferences,\nfrom a few papers per conference in the 1990s to more than 100 papers in recent conferences.\n\nMachine protection goes far beyond the equipment protection and across many systems. It requires the understanding of many different types of failures that could lead to beam loss. It requires fairly comprehensive understanding of all aspects of the accelerator (accelerator physics, operation, equipment, instrumentation) and touches many aspects of accelerator construction and operation.\n\nMachine protection is becoming increasingly important for future projects, with increased beam power and energy density (W/mm$^2$ or J/mm$^2$) and increasingly complex machines.\n\nProtection of equipment, even when operating without beam, must not be forgotten. The largest accident happening at an accelerator was the rupture of a superconducting cable at LHC in 2008 due to the very large energy stored in the superconducting magnet system.\n\n\\section{Acknowledgements}\nI wish to thank many colleagues from CERN and ESS and the authors of the listed papers for their help and for providing material for this article.\n This paper is an updated version of the lecture given at a CAS in 2008 \\cite{Schmidt2008}.\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{Sibley2003}\nC.~Sibley, Machine protection strategies for high power accelerators, Particle Accelerator Conf., Portland, OR, USA, 2003, pp. 607--611.\n\n\\bibitem{Peggs2005}\nS. Peggs \\textit{et al.}, ESS Technical Design Report\n\\newblock ESS-doc-274-v15 (2012).\n\n\\bibitem{Schmidt2006}\nR. Schmidt \\textit{et al.}, New J. Phys. \\textbf{8} (2006) 290.\n\n\\bibitem{Bajko2009}\nM. Bajko \\textit{et al.}, Report of the Task Force on the Incident of 19th September\n  2008 at the LHC, CERN-LHC-PROJECT Report 1168, CERN, Geneva (2009).\n\n\\bibitem{Fasso2003}\nA. Fasso \\textit{et al.}, The physics models of FLUKA: status and recent\n  development, Computing in High Energy and Nuclear Physics, USA,\n  2003, MOMT005 [hep-ph/0306267].\n\n\\bibitem{MARS}\nhttp://www-ap.fnal.gov/mars/.\n\n\\bibitem{GEANT}\nhttp://geant4.web.cern.ch/geant4/.\n\n\\bibitem{wiki_1}\nWikipedia, keyword: fuel efficiency.\n\n\\bibitem{Tahir2005}\nN.A. Tahir, V.E. Fortov, B.~Goddard, D.H.H. Hoffmann, V.~Kain, I.V.\n  Lomonosov, A.R. Piriz, R.~Schmidt, A.~Shutov and M.~Temporal, {\\em J. Appl. Phys.} \\textbf{97}(8) (2005) 83532-1.\n\n\\bibitem{Kain2005a}\nV. Kain \\textit{et al.}, Material damage test with 450 GeV LHC-type beam, Proc. Particle Accelerator Conf. 2005, Knoxville, TN, (2005), p.~4 [oai:cds.cern.ch:858162].\n\n\\bibitem{Blokland2013}\nW.~Blokland and C.~Peters, A new differential and errant beam current monitor\n  for the SNS accelerator, 2nd International Beam Instrumentation\n  Conf., Oxford, UK, 16--19 September 2013.\n\n\\bibitem{Plum2013}\nM.~Plum, private communication.\n\n\\bibitem{Zerlauth2009}\nM. Zerlauth \\textit{et al.}, The LHC post mortem analysis framework,\nICALEPCS2009, Kobe, Japan, 2009.\n\n\\bibitem{TheLHCStudyGroup1995}\nThe LHC Study Group, The Large Hadron Collider: conceptual design, Technical Report CERN/AC/95-05 (LHC), CERN, Geneva (1995).\n\n\\bibitem{Werner2006}\nM.~Werner and K.~Wittenburg, Very fast beam losses at HERA, and what has been\n  done about it, ICFA Advanced Beam Dynamics Workshop HB2006,\n  Tsukuba, Japan, May 2006.\n\n\\bibitem{Mokhov2006}\nN.~Mokhov, Very fast beam losses at the Tevatron, and what has been done\n  about it, ICFA Advanced Beam Dynamics Workshop HB2006, Tsukuba, Japan, May 2006.\n\n\\bibitem{Fedotov2007}\nA.~Fedotov, RHIC plans towards higher luminosity, 2007 Particle\n  Accelerator Conf., Albuquerque, NM, USA, 2007, pp. 709--713.\n\n\\bibitem{Goddard2006}\nB.~Goddard, Very fast beam losses at the SPS, and what has been done about\nit, ICFA Advanced Beam Dynamics Workshop HB2006, Tsukuba, Japan,  May 2006.\n\n\\bibitem{Koontz2006}\nR.~Koontz, Multiple beam pulse capability of the SLAC injector, 1967 Particle Accelerator Conf., Washington, DC, 1967 [IEEE Trans. Nucl. Sci. {\\bf{NS-24}} (1967) 104.\n\n\\bibitem{Ross2000}\nM.~Ross, Single pulse damage in copper, LINAC 2000, Monterey, CA, USA, August 2000, pp. 47--49.\n\n\\bibitem{Ross2000a}\nM.~Ross, The next linear collider machine protection system, 1999 Particle Accelerator Conf., New York, USA, (1999), pp. 47--49.\n\n\\bibitem{Froehlich2006}\nL. Froehlich \\textit{et al.}, First operation of the FLASH machine protection system\n  with long bunch trains, LINAC 2006, Knoxville, TN, USA, 2006,\n  pp. 262--264.\n\n\\bibitem{Froehlich2006a}\nL. Froehlich \\textit{et al.}, First experience with the machine protection system of\n  FLASH, FEL 2006, Berlin, Germany, 2006, pp. 587--589.\n\n\\bibitem{Buckley2006}\nS.~Buckley and R.~Smith, Monitoring and machine protection designs for the\n  Daresbury Laboratory energy recovery linac prototype, 10th European Particle Accelerator Conf., Edinburgh, UK, 2006, pp. 1088--1090.\n\n\\bibitem{Uyhoven2008}\nJ. Uyhoven \\textit{et al.}, Results from the LHC beam dump reliability run, LHC Project Report 1120, CERN, Geneva (2008).\n\n\\bibitem{Dehning2011}\nB.~Dehning, M.~Dabrowski, E.~Effinger, J.~Emery, E.~Fadakis, E.B. Holzer,\n  S.~Jackson, G.~Kruk, C.~Kurfuerst, A.~Marsili, M.~Misiowiec, E.~Nebot\n  Del~Busto, A.~Nordt, A.~Priebe, C.~Roderick, M.~Sapinski, C.~Zamantzas,\n  V.~Grishin and E.~Griesmayer, Overview of LHC beam loss measurements, 2nd International Particle Accelerator Conf., San Sebastian, Spain, 4--9 September 2011, p.~3.\n\n\\bibitem{baer2013}\nT. Baer \\textit{\\textit{et al.}}, UFOs in the LHC: observations, studies and\n  extrapolations, Proc. IPAC2012, New Orleans, LA,\n  USA, 2012.\n\n\\bibitem{Sibley2005}\nC.~Sibley, The SNS machine protection system: early commissioning results\n  and future plans, 2005 Particle Accelerator Conf.,\n  Knoxville, TN, USA, 2005, pp. 1727--1729.\n\n\\bibitem{Schmelzbach2006}\nP.~Schmelzbach, Experience with high-power operation of the PSI proton accelerator facility, ICFA Advanced Beam Dynamics Workshop HB2006, Tsukuba, Japan, May 2006.\n\n\\bibitem{Findlay2006}\nD.~Findlay, ISIS upgrade, ICFA Advanced Beam Dynamics Workshop\nHB2006, Tsukuba, Japan, May 2006.\n\n\\bibitem{Yoshikawa2007}\nH. Yoshikawa \\textit{et al.}, Current status of the control system for J-PARC accelerator complex, ICALEPCS07, Knoxville, TN, USA, 2007, pp. 62--64.\n\n\\bibitem{Wei2012}\nJ. Wei \\textit{et al.}, FRIB accelerator status and challenges, LINAC\n2012, Tel Aviv, Israel, 9--14 September 2012.\n\n\\bibitem{Tchelidze2012}\nL.~Tchelidze, In how long the ESS beam pulse would start melting steel/copper accelerating components, Technical Note ESS/AD/0031, ESS, Lund, Sweden (2012).\n\n\\bibitem{Schmidt2008}\nR.~Schmidt, Machine protection,\n\\newblock CAS -- CERN Accelerator School: Course on Beam Diagnostics, Dourdan, France, 28 May--6 June 2008, p. 581.\n\n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 51384, "prevtext": "\n\nRelated to accelerators, the consequences and the probability of an uncontrolled beam loss need to be estimated to get an idea about the risk. Machine protection systems prevent damage to equipment after a failure. The higher the risk, the more machine protection becomes important. Machine protection needs to be considered during design, construction and operation of the accelerator.\n\nIf a specific failure is considered, the consequences of the failure can be estimated, in terms of damage to equipment (repair requiring investment, e.g.\\ in money), in downtime of the accelerator (e.g.\\ in days) and in radiation dose to personnel accessing equipment (e.g.\\ in mSv).\n\nIn the estimation of downtime of the accelerator for repairs the availability of spare parts needs to be considered. If the accelerator was operating with beam, radioactive activation of material must be taken into account. It may be necessary to wait for cool-down of irradiated components to reduce the dose before accessing the equipment.\n\nThe second factor entering into the risk is the probability of such a failure happening (e.g.\\ measured in number of failures per year).\n\nFor beam operation, a list of all possible failures that could lead to beam loss in equipment should be considered. This is not obvious, since there is a nearly infinite number of mechanisms for losing the beam. However, the most likely failure modes and in particular the worst-case failures and their probabilities must be considered.\n\n\\section{Challenges in the protection of LHC and ESS}\nMany accelerators operate with high beam intensity and/or energy. For synchrotrons and storage rings, the energy stored in the beam increased with time (from ISR to LHC). For linear accelerators and fast-cycling machines, the beam power increases. Two examples illustrate machine protection challenges for a circular collider (LHC) and a high-intensity proton linac (ESS).\n\nFor the future another challenge is the  emittance that becomes smaller, down to a beam size of a nanometer. This is important today, and even more relevant for future projects such as ILC, with increased beam power or energy density (measured in W/mm$^2$ or J/mm$^2$) and increasingly complex machines.\n\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.75\\linewidth]{LHCEnergy_new.png}\n  \\caption{Energy stored in the beams for different accelerators (based on a figure by R.~Assmann)}\n  \\label{fig-stored-beam-energy}\n\\end{figure}\n\n\\subsection{LHC collider}\nThe LHC is designed to operate at a momentum of 7~TeV/$c$ with 2808 bunches, each bunch with a nominal intensity of $1.15 \\times 10^{11}$ protons. Machine protection is required during all phases of operation since the LHC is the first accelerator with the intensity of the injected beam already far above the threshold for damage. The energy stored in the nominal LHC beam of 362~MJ corresponds to the energy of a 200~m long fast train at 155 km per hour and to the energy stored in 90~kg of TNT. Surprisingly, this is the same as the energy stored in 15~kg of chocolate; it matters most how easily and fast the energy is released. The energy in an accelerator beam can be released in some 10~$\\mu$s.\n\nA Livingston-type plot (\\Fref{fig-stored-beam-energy}) shows the energy stored in the beam as a function of particle momentum. At 7~TeV/$c$, fast beam loss with an intensity of about 5\\% of a single `nominal bunch' could damage equipment (e.g.\\ superconducting coils). The only component that can stand a loss of the full beam is the beam dump block. All other components would be severely damaged. The LHC beams must \\textit{always} be extracted into the beam dump blocks at the end of a fill as well as in case of a failure.\n\nDuring the first phase of operation between 2009 and 2013 the momentum was limited to 4~TeV/$c$ and the maximum stored beam energy was up to about 140~MJ. This was the consequence of the 2008 LHC accident that happened during test runs without beam. A magnet interconnect was defective and the circuit opened. An electrical arc provoked a helium pressure wave damaging about 600~m of the LHC and polluting the beam vacuum over more than 2~km (Fig. \\ref{LHC-accident-2008-arcing}). An overpressure from the expansion of liquid helium damaged the structure (see Figs. \\ref{LHC-accident-2008-overpressure} and \\ref{LHC-accident-2008-displacement}). A total of 53 magnets had to be repaired.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.6\\linewidth]{LHC-accident-2008-arcing.png}\n\\caption{Damage from an electrical arc after the LHC accident in 2008}\n\\label{LHC-accident-2008-arcing}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.42\\linewidth]{LHC-accident-2008-overpressure.png}\n\\caption{Damage from the overpressure in the cryostat after the LHC accident in 2008}\n\\label{LHC-accident-2008-overpressure}\n\\end{figure}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.6\\linewidth]{LHC-accident-2008-displacment.png}\n\\caption{Displacement of a magnet after the LHC accident in 2008}\n\\label{LHC-accident-2008-displacement}\n\\end{figure}\n\nProtection during the injection process is mandatory. The energy stored in the LHC beam at injection is about one order of magnitude higher than the stored energy in the beam for other accelerators.\n\nAn example of a critical failure for the LHC at injection is a failure of the injection kicker. If the kicker does not fire or fires at the wrong time, the incoming beam will not be deflected or the circulating beam will be deflected (see Fig. \\ref{LHC-injection-failure}). In both cases, the beam would hit the vacuum chamber and damage equipment.\n\nDuring the injection process injection collimators are positioned in the vacuum chamber to capture the mis-kicked beam. This type of failure, e.g.\\ a wrong kick of the injection kicker, happened already several times. Since the injection absorber was always at the correct position no damage was observed; however, due to grazing beam incidence superconducting magnets downstream of the injection region quenched.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.48\\linewidth]{LHC-injection-failure.png}\n\\includegraphics[width=.48\\linewidth]{LHC-injection-protection.png}\n\\caption{LHC injection failure. Left: the injection kicker does not deflect the incoming beam. The beam would hit vacuum chamber and equipment. Right: the injection kicker does not deflect the incoming beam. The injection absorber is correctly positioned and the beam hits the absorber.}\n\\label{LHC-injection-failure}\n\\end{figure}\n\n\\subsection{ESS spallation source}\nThe ESS spallation source being built at Lund, Sweden is designed to accelerate a proton beam with an average power of 5~MW and to direct it onto a target. Operation of the ESS will be  at a frequency of 14~Hz, with a pulse length of 2.86~ms with a peak power of 125~MW. The layout of the ESS accelerator is shown in Fig.~\\ref{ESS-layout}. We now give an example of a critical failure at ESS (see Fig. \\ref{ESS-bend}):\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=1.0\\linewidth]{ESS-Layout.png}\n\\caption{Layout of the ESS accelerator: the source, low-energy beam transport and RFQ are followed by the medium-energy beam transport. The protons are accelerated by a normal-conducting linac, followed by three sections of superconducting cavities. In the high-energy beam transport line the protons are transported to the target.}\n\\label{ESS-layout}\n\\end{figure}\n\n\n\\begin{enumerate}\n  \\item the bending magnet in the junction between HEBT-S2 and HEBT-S3 deflects the beam to bring the protons into the target plane;\n  \\item assume that the power supply for the bending magnets in HEBT-S2 fails and the magnets stop deflecting the beam;\n  \\item the probability for such failure in one year is about 0.1 (assuming a mean time between failures (MTBF) for power supplies of 700,000 h = 10 years);\n  \\item the beam is not deflected and hits the vacuum chamber. The consequences would be damage to magnets and vacuum pipes and possibly a pollution of superconducting cavities upstream.\n\\end{enumerate}\n\nIf a failure is detected the beam must be stopped at the source or in the low energy part of the accelerator. \n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=1.0\\linewidth]{ESS-bend.png}\n\\caption{High-energy part of the ESS accelerator. The beam is bent from the accelerator plane upwards to the plane with the high-power target. It is also possible to let the beam go straight to a commissioning beam dump.}\n\\label{ESS-bend}\n\\end{figure}\n\n\\section{Beam losses and consequences}\n\n\\subsection{Energy deposition from high-energy particles}\nParticle losses in a material lead to ionization and particle cascades. Energy deposition starts when a charged particle enters material. The maximum energy deposition can be deep in the material at the maximum of the hadron or electromagnetic shower depending on the particle momentum. The energy deposition leads to a temperature increase in the material that can be vaporized, melted, deformed or lose its mechanical properties, depending on the material and the beam impact.\n\nThere is already some risk of damage to sensitive equipment for an energy deposition of some 10~kJ (beam impact for a short time, say a maximum of a few milliseconds).\nThe risk of damage to equipment  for some megajoules is very large.\n\nEquipment becomes activated due to beam losses. It is considered to be acceptable if beam losses do not exceed, say, 1~W/m (assuming proton beams with high energy, say above some 100~MeV/$c$). Another principle is `ALARA': exposure of personnel to radiation should be `as low as reasonably achievable'. If a further reduction of the beam losses below 1~W/m is reasonably possible, this is recommended in order to minimize exposure of service personnel. Radioactive activation of material is mainly an issue for hadron accelerators; it is less problematic for electron--positron machines.\n\nFor accelerators with superconducting magnets there is a specific problem: even with beam loss much below the damage threshold, superconducting magnets could quench. In case of a quench, beam operation is interrupted for some time (10 min up to many hours) leading to downtime. In order to avoid beam-induced quenches, beam losses are monitored and the beam is dumped if a predefined threshold is exceeded before a magnet quenches, reducing the downtime since the time to recover from a quench is avoided. The damage threshold is far above the quench threshold; therefore, this strategy also protects magnets from beam-induced damage.\n\nTo get an idea of the damage potential, the energy loss by ionization at the surface of the target can be estimated using the Bethe--Bloch equation, ignoring hadron showers (see Fig.~\\ref{Energy-Loss-Iron-BB}). It is interesting to observe that the energy loss for low-energy particles is very high. For a proton at 7~TeV/$c$ the energy loss is dominated by hadron showers and the maximum energy deposition is deep in the material.\n\nThere is no straightforward expression for the energy deposition of high-energy particles, since this depends on the particle type, the momentum, the beam parameters and the material parameters (atomic number, density, specific heat). Programs such as FLUKA \\cite{Fasso2003}, MARS \\cite{MARS} or GEANT4 \\cite{GEANT} are being used for the calculation of energy deposition (and subsequent temperature increase) as well for as the activation of the material that is exposed.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.65\\linewidth]{Energy-Loss-Iron-BB.png}\n\\caption{Energy loss for protons when entering into an iron block, calculated by the Bethe--Bloch equation. Effects of the hadron shower are not included.}\n\\label{Energy-Loss-Iron-BB}\n\\end{figure}\n\nRelevant parameters to be considered for heating and possible damage to material are the momentum of the particle, the particle type, the energy stored in the beam, the beam power, the beam size, the beam power/energy density (MJ/mm$^{2}$, MW/mm$^{2}$), the time structure of the beam and cooling conditions.\n\nIn order to estimate the order of magnitude for possible damage:\n\\begin{enumerate}\n  \\item one MJ can heat and melt about 1.5~kg of copper;\n  \\item one MJ corresponds to the energy stored in about 0.25~kg of\n  TNT \\cite{wiki_1};\n  \\item one MW during one second corresponds to one MJ.\n\\end{enumerate}\n\nThe following example illustrates the calculation of the consequences for beam losses.\n\\begin{enumerate}\n  \\item A proton beam travels through a thin window of thickness $d$.\n  \\item Assume a beam area of 4 $\\sigma_x \\times \\sigma_y$, with $\\sigma_x$ and $\\sigma_y$ the root mean square (r.m.s.) beam sizes assuming Gaussian beams.\n  \\item Assume a homogeneous beam distribution.\n\\end{enumerate}\n\nThe energy deposition can be calculated; mass and specific heat are known.\nThe temperature can be calculated (rather good approximation), assuming a fast loss and no cooling.\n\nWith low-energy protons (3 MeV/$c$) and a beam size of $\\sigma_x = \\sigma_y = 1$~mm, the following parameters are calculated:\n\\begin{enumerate}\n  \\item iron specific heat = 440 J/(kg $\\times$ K);\n  \\item iron specific weight = 7860 kg/m$^3$;\n  \\item d$E$/d$x$ = 56.7 MeV/mm;\n  \\item $N_{\\rm p} = 1.16 \\times 10^{12}$.\n\\end{enumerate}\nThe temperature increase for these parameters is 763~K.\n\nFor high-energy protons the energy deposition by hadronic showers (see Fig. \\ref{Hadron-Shower}) dominates:\n\\begin{enumerate}\n    \\item pions are created when the proton travels through matter;\n    \\item the decay of pions creates electromagnetic showers;\n    \\item there is an exponential increase in number of created particles;\n    \\item the final energy deposition is to a large extent due to the large number of electromagnetic particles;\n    \\item the energy deposition scales roughly with total energy of incident particles;\n    \\item the maximum of the energy deposition can be deep in the material;\n    \\item energy deposition is a function of the particle type, its momentum and parameters of the material (atomic number, density, specific heat).\n\\end{enumerate}\n\nThere is no straightforward expression to calculate the energy deposition by high-energy particles. Calculation needs to be done by codes, such as FLUKA, GEANT or MARS.\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=.4\\linewidth]{Hadron-Shower.png}\n\\vspace{0.5cm}\n\\caption{Illustration of a hadronic shower}\n\\label{Hadron-Shower}\n\\end{figure}\n\nA simple approximation for the temperature increase in material for a 7~TeV/$c$ proton beam impact is given in the following example: for copper, the maximum longitudinal energy deposition for a single 7~TeV/$c$ proton at about 25~cm inside the material is $E_{\\rm dep}=1.5 \\times 10^{-5}$~J/kg (calculation with FLUKA).\n\nThe energy required to heat and melt copper is $E=6.3 \\times 10^5$~J/kg. Assuming a pencil beam, the number of particles required to damage (melt) copper is of the order of $10^{10}$. For graphite, the number of particles needed to cause damage is about one order of magnitude larger.\n\nMore refined and complete calculations can be made to determine real-world scenarios on a case-by-case basis, where the distribution of the impacting particles and the details of the material and geometry are important.  After the calculation of the temperature increase, the response of the material to beam impact needs to be addressed (deformation, melting etc). Mechanical codes such as ANSYS and  hydrodynamic codes such as BIG2 and others can be used.\n\nBeams at very low energy have limited power; however, the energy deposition is very high and can lead to (limited) damage in the case of a beam impact at the initial stage of an accelerator, after the source, in the low-energy beam transport and in the radiofrequency quadrupole (RFQ). This might lead to a long downtime, depending on availability of spares.\n\nBeams at very high energy can have a tremendous damage potential for the LHC; damage to metals is expected for about $10^{10}$ protons. One LHC bunch has about $1.5\\times10^{11}$ protons, in total up to 2808 bunches. In case of catastrophic beam loss, the LHC could be possibly damaged beyond repair. The penetration of 2808 bunches (e.g.\\ after a kicker failure) into a metal block such as a magnet has been estimated to be about 20 to 30~m (hydrodynamic beam tunnelling) \\cite{Tahir2005}.\n\n\\subsection{Examples for damage from beam losses}\nThe design of LHC protection elements is based on detailed energy deposition simulations and an assumption for the damage levels. A dedicated experiment was carried out to cross-check the validity of this approach by trying to damage material in a controlled way with beam~\\cite{Kain2005a}. The impact of a 450~GeV/$c$ beam extracted from the SPS on a specially designed high-$Z$ target was simulated for a simple geometry comprising several typical materials used for LHC equipment. The beam intensities for the test were chosen to exceed the damage limits of parts of the target, between $2 \\times 10^{12}$ and $8 \\times 10^{12}$ protons. The transverse r.m.s.\\ beam dimensions were about 1~mm.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{DamageExperiment.png}\n  \\caption{Damage to a copper plate by 450 GeV/$c$ proton beams with different intensities ($2\\times 10^{12}, 4\\times 10^{12}, 6\\times 10^{12} $ and $ 8\\times 10^{12}$).}\n  \\label{DamageExperiment}\n\\end{figure}\n\nThe geometry of the target was modelled in FLUKA and the target heating was estimated. The temperature rise was obtained from the energy deposition using the temperature-dependent heat capacity for each material. The results of the controlled damage test show reasonable agreement with the simulations. Zinc, copper and INCONEL plates were damaged at the predicted locations within the error of the simulation, see Fig.~\\ref{DamageExperiment}. The transverse extent of the damaged area on the zinc and copper plates was predicted to within 30\\%. The outcome of the experiment gives confidence that beam-induced damage limits for simple geometries can be adequately predicted with simulations.\n\nAn example for involuntarily beam-induced accidents is the damage to a vacuum chamber in the SPS extraction line. In 2004, during extraction tests with LHC beam parameters with 450~GeV/$c$ protons, a beam with an energy of 2~MJ was deflected with grazing incidence into a vacuum chamber after the failure of a septum magnet. The chamber was cut along a length of 25~cm, with a groove of a length of 70~cm. Condensed drops of steel are visible on the opposite side of the vacuum chamber. Vacuum chamber and quadrupole magnet needed to be replaced.\n\nAnother example for beam-induced damage is an accident at the Tevatron, Fermilab. A so-called Roman pot (a device equipped with particle detectors that can be moved in the vacuum chamber) moved into the beam. Particle showers generated by the Roman pot quenched superconducting magnets. The beam moved by 0.005 mm/turn, and touched a collimator jaw surface after about 300 turns. The entire beam was lost, mostly on the collimator that was damaged (see Fig. \\ref{Damage-Roman-Pot}).\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{Damage-Roman-Pot.png}\n  \\caption{Damage to a collimator at Fermilab for 900 GeV/$c$ proton beams, when a Roman pot moved into the beam and massively quenched magnets.}\n  \\label{Damage-Roman-Pot}\n\\end{figure}\n\nObservation of HERA/DESY showed grooves on the surface of the tungsten collimator when opening the vacuum chamber. No impact was observed during operation.\n\nEquipment that operates at high voltage can be very sensitive to beam losses. If the beam hit the surface of a high-voltage system (e.g.\\ RFQ, kicker magnets, cavities) the surface quality might degrade. It is then not possible to operate at the same voltage and the probability for arcing is increased.\n\nThis was observed at SNS where errant beam losses led to a degradation of the performance of a superconducting cavity (see Fig. \\ref{Damage-SNS} \\cite{Blokland2013}). Beam current monitors (BCMs) measure current pulses at different locations along the linac, before the cavity section and after the cavity section (see the red and blue curves). The figure shows a beam loss during 16 $\\mu$s; this corresponds to an energy of 30~J at the end of the Drift Tube Linac (DTL), 66~J at the end of the Coupled-Cavity Linac (CCL) and 350~J at the end of the superconducting linac.\n\nBeam losses are likely to be caused by problems in the ion source, in the low-energy beam transfer or in the normal-conducting linac. After such errant beams, sometimes the cavity gradient needs to be lowered. Conditioning after warm-up helps in most cases, but in one case a cryo-module had to be exchanged. The energy of beam losses is about 100~J.\nThe damage mechanisms are not fully understood; it is assumed that some beam hitting the cavity desorbs gas or particulates (= small particles) creating an environment for arcing.\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[width=.6\\linewidth]{Damage-SNS.png}\n  \\caption{Beam losses in the SNS linac, with a 1 GeV/$c$ proton beam. These losses led to a degradation of superconducting cavities (figure kindly provided by M. Plum~\\cite{Plum2013}).}\n  \\label{Damage-SNS}\n\\end{figure}\n\n\\section{Mechanisms for generating beam losses}\nContinuous beam losses are inherent during the operation of accelerators and are taken into account during the design of the accelerator. Accidental beam losses are transient losses with time scales from ns to many seconds due to a multitude of failure mechanisms. The number of possible failures leading to accidental beam losses is (nearly) infinite.\n\n`Machine protection' protects equipment from damage, activation and downtime in case of accidental beam losses. Machine protection includes a large variety of systems.\n\n\\subsection{Continuous beam losses}\nParticles are lost due to a variety of reasons: beam--gas interaction, losses from collisions and losses of the beam halo. Limitation of beam losses is in order of 1~W/m to avoid activation and still allow hands-on maintenance for high hadron energy accelerators.\n\nSeveral high-intensity hadron accelerators are operating with beams of a power of 1~MW and more (SNS, PSI). The are plans for accelerators of 5~MW (ESS), 10~MW and more. For 1~MW, a loss of 1\\% corresponds to 10~kW, not to be lost along the beamline to avoid activation of material, heating, quenching of magnets etc. If a length of  200~m is assumed, the losses would correspond to 50~W/m, far above what is acceptable.\n\nAnother example is the LHC that operates with a stored beam with an energy of 360~MJ. A beam lifetime of 10~min corresponds to a beam loss of 500~kW that should not be lost in superconducting magnets. The strategy to keep beam losses at an acceptable level is as follows:\n\\begin{enumerate}\n\\item avoid beam losses as far as possible;\n\\item define the aperture by collimators;\n\\item capture continuous particle losses with collimators at specific locations.\n\\end{enumerate}\n\nA collimation system is a very efficient system to avoid too high beam losses in the accelerator (so-called beam cleaning). It can be very complex with (massive) material blocks close to the beam installed in an accelerator to capture halo particles. The collimation system at LHC reduces the losses by four orders of magnitude and also captures fast accidental beam losses. About 100 collimators are installed in LHC. Figure~\\ref{LHC-Collimator} shows the view of one of the two-sided collimators, it is closed down to 2~mm when operating at 7~TeV/$c$. Collimators (or beam absorbers) are equally important to capture mis-steered beam.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.6\\linewidth]{Collimator.png}\n\\caption{Collimator at LHC}\n\\label{LHC-Collimator}\n\\end{figure}\n\n\\subsection{Accidental (transient) beam losses}\n\\subsubsection{Ultra-fast beam losses}\nThere are several mechanisms of failures that lead to a beam loss within a very short time, typically in the range of nanoseconds to microseconds.\n\\begin{enumerate}\n\\item Failures of kicker magnets (during injection, at extraction, for special kicker magnets for beam diagnostics).\n\n\\item Beam transfer via transfer lines between different accelerators and from the accelerator to a target station. The target could be for secondary particle production or the beam dump block. A common example for such a failure is a wrong setting of a magnet in the line that leads to a deflection of the beam into the vacuum chamber.\n\n\\item Too small beam size at a target station. Targets for high-intensity beams are designed for a certain beam size. If the beam size is much smaller, for example due to a wrong optics, the target or the window in front of the target could be damaged.\n\\end{enumerate}\n\n\\subsubsection{Very fast beam losses}\nMechanisms that lead to a very fast beam loss (typically in the range of some microseconds to milliseconds) are multiturn beam losses in a circular accelerator due to a large number of possible failures, mostly in the powering system of the main magnets, with a typical time constant of some 10 turns to many seconds. For linacs a trip of the RF can create beam losses within a very short time.\n\n\\subsubsection{Fast beam losses}\nFast beam loss (some 10 ms to seconds) can have many different origins: failures in the magnet powering system, vacuum valves that close unintentionally, trips of the RF acceleration system, beam instabilities, failures in the control system etc.\n\n\\subsubsection{Slow beam losses}\nSlow beam losses (many seconds) can have many different origins: high vacuum pressure, failures in the powering system for corrector magnets, wrong parameter, RF etc. The main difference between slow and fast losses is that the operation crew could still be involved in the decision on how to continue operation (for example, to stop beam operation or to change a parameter that is not set correctly).\n\n\\subsection{Failure mechanisms and their probability}\n\\subsubsection{Failure of accelerator equipment}\nExamples are power converter trips, magnet quenches, AC distribution failures (e.g.\\ as a consequence of a thunderstorm), objects in the vacuum chamber, vacuum leaks, trip of the RF system, spontaneous firing of a kicker magnet etc.\n\n\\subsubsection{Failure of the control system}\nWrong parameter sent to equipment such as a wrong magnet current or a wrong magnet current function, trigger problem, failure in the timing system, failure in the feedback system, firing of a kicker magnet at the wrong time or with the wrong strength.\n\n\\subsubsection{Failure during operation}\nWrong manipulation of chromaticity, tune or orbit etc.\n\n\\subsubsection{Beam instability}\nFor example, due to too high beam or bunch current, with typical time constant of many milliseconds to seconds.\n\nIn order to calculate the risk related to a hazard, the probability of the occurrence and the damage potential need to be estimated. For the design of the protection system, the time constant of the failure as well as the time constant for beam loss due to the failure need to be known.\n\nExperience from LHC (the most complex accelerator currently in operation): when the beams are colliding, the optimum length of a store is in the order of 10--15~h, then it is ended by operation with a beam dump. However, most fills (about 70\\%) are ended by failures; the machine protection systems dump the beams. The MTBF is about 6~h. For other large accelerators (SNS, synchrotron light sources) the MTBF is between 20~h and up to several hundred hours.\n\n\\section{Strategy for machine protection}\n\\subsection{Principles for machine protection}\nThere are some principles for machine protection that need to be considered:\n\\begin{enumerate}\n\\item protect the machine;\n\\item protect the beam;\n\\item provide the evidence.\n\\end{enumerate}\n\n\\subsubsection{Protect the machine}\nThe highest priority is clearly to avoid any damage to accelerator equipment.\n\n\\subsubsection{Protect the beam}\nThe objective is to maximize beam time, but complex protection systems reduce the availability of the machine. The number of `false` interlocks stopping operation must be minimized. This is a trade-off between protection and operation. A `false` interlock is defined as an interlock that stops operation even though there is no risk (example: a temperature sensor reading a wrong value, therefore switching off the power converter of a magnet and stopping beam operation).\n\n\\subsubsection{Provide the evidence}\nIf the protection systems stop operation (e.g.\\ dump the beam or inhibit injection), clear diagnostics should be provided \\cite{Zerlauth2009}. If something goes wrong (leading to damage, but also a near miss), it should be possible to understand the event. This needs synchronized transient recording of all the important parameters in all relevant systems, as well as long-term logging of parameters with reduced frequency (such as 1~Hz). Examples are the current in all magnets, beam position, beam losses and beam intensity. The frequency of transient recording depends on the system and can go from Hz to MHz.\n\n\\subsection{Active and passive protection}\n\\subsubsection{Active protection}\nActive protection starts with the detection of the failure by a sensor that is monitoring the parameters of equipment (for example, detecting a failure of a power converter) or by beam instrumentation detecting when the beam starts to be affected by the failure (for example, increased beam losses or a different orbit). The beam must be turned off as soon as possible with an actuator. This can be done in different ways, for example by switching off the source or the RF system. In the case of an accelerator complex with a chain of several accelerators, injection of the beam into the next stage of the accelerator complex should be prevented in case of failure. When the beam is stored in a synchrotron or storage ring, the beam must be extracted onto a target that can accept the beam pulse without being damaged (beam dump).\n\n\\subsubsection{Passive protection}\nThere are failures (e.g.\\ ultra-fast losses) when active protection is not possible. One example is the protection against mis-firing of an injection or extraction kicker magnet. A beam absorber or collimator is required to stop the mis-kicked beam in order to avoid damage. All possible beam trajectories in such case must be considered, and the absorbers must be designed to absorb the beam energy without being damaged. Another example is a fast extraction of a high-intensity beam from a circular accelerator into a transfer line. When the extraction takes place, the parameters of the transfer line must be correctly set since in case of a wrong magnet current the beam could be deflected into the vacuum chamber.\n\nThe best strategy is to prevent a specific failure from happening. As an example, fast diagnostic kicker magnets that could deflect the beams into the vacuum chamber wall should only be installed in high-intensity machines if they are indispensable.\n\nFailure should be detected as early as possible, with priority at the hardware level. For most failures, this allows stopping beam operation before the beam is affected. This requires monitoring of the hardware (such as state signals, parameters etc). As an example, a trip of a magnet power converter should be detected as early as possible.\n\nIt is not always possible to detect failures at the hardware level. The second method is to detect the initial consequences of a failure with beam instrumentation and to stop the beam before equipment is damaged. This requires reliable beam instrumentation.\n\nWhen a failure is detected, beam operation must be stopped. For synchrotrons and storage rings the beam is extracted by a fast kicker magnet into a beam dump block. Injection must be stopped. For linacs the beam is stopped in the low-energy part of the accelerator by switching off the source, deflecting the low-energy beam by electrostatic plates (`choppers') or by switching off the RFQ for proton linacs.\n\nAn electronic system (beam interlock system)  links the different protection system. It ensures that the beam is extracted from a synchrotron, injection is stopped, RF acceleration might be stopped (for linacs). The interlock system might include complex logic.\n\n\\subsection{Design considerations for protection systems}\n\nThere are several principles that should be considered in the design of protection systems, although it might not be possible to follow all these principles in all cases.\n\\begin{enumerate}\n\n  \\item If the protection system does not work, it is better stopping operation rather than continuing and risking damaging equipment.\n\n  \\item Fail-safe design: in case of a failure in the protection system, protection functionalities should not be compromised. As an example, if the cable that triggers the extraction kicker of the beam dumping system is disconnected, operation must stop.\n\n  \\item Detection of internal faults: the protection system must monitor the internal status. In case of an internal fault, the fault should be reported. If the fault is critical, operation must be stopped.\n\n  \\item Remote testing should be an integral part of the design, for example between two runs. This allows verification of the correct status of the system.\n\n  \\item Critical equipment should be redundant (possibly diverse redundancy, with the same or similar functions executed by different systems).\n\n  \\item Critical processes for protection should not rely on complex software running under an operating system and requiring the general computer network.\n\n  \\item It should not be possible to remotely change the most critical parameters. If parameters need to be changed, the changes must be controlled and logged and password protection should ensure that only authorized personnel can do the change.\n\n  \\item Safety, availability and reliability of the systems should be demonstrated. This is possible by using established methods to analyze critical systems and to predict failure rates.\n\n  \\item Operate the protection systems early on before they become critical, to gain experience and to build up confidence. This could be done before beam operation, or during early beam operation when the beam intensity is low.\n\n  \\item It is inevitable to disable interlocks (e.g.\\ during the early phase of commissioning and for specific tests). Managing interlocks (e.g.\\ disabling) is common practice. Keep track and consider it in the system design. Example for LHC: masking of some interlocks is possible, but only for low-intensity/low-energy beams (`safe beams').\n\\end{enumerate}\n\n\\section{Beam instrumentation for machine protection}\n\\subsection{Beam loss monitors}\nBeam loss monitors (BLMs) are used for monitoring beam losses to understand the performance of the accelerator as well as for machine protection. If used for protection, it is important that the monitors cover the entire accelerator and there is no region without BLMs where beam losses can occur.\n\n\\subsection{Beam position monitors}\nBPMs ensure  that the beam has the correct orbit. In most cases the beam should be centred in the aperture. There are some exceptions, for example for extracting beams from an accelerator. The beam must have an offset, e.g.\\ a closed orbit bump is applied to position the beam close to a septum magnet. This must work reliably, otherwise the extracted beam might hit equipment. BPMs monitor the amplitude of such bumps and are effectively redundant monitors to the sensors measuring the magnet current in the closed orbit dipoles.\n\n\\subsection{Beam current monitors}\nIf the beam transmission between two locations of the accelerator complex is too low (if the beam is lost somewhere between): stop beam operation. Differential BCMs are of particular importance for linear accelerators.  At low energy (below about 50~MeV/$c$) beam loss monitors are not applicable and machine protection relies on differential beam current measurements. If the beam lifetime in a synchrotron or storage ring is too short: dump the beam.\n\n\\subsection{Beam size monitors}\nIf the beam size is too small, this could be dangerous for windows, targets etc. The monitor ensures correct beam size. A too small beam size could also lead to an underestimation of the damage potential of the circulating beam.\n\n\\section{Machine protection for different types of accelerators}\nHigh-energy hadron synchrotrons and colliders can have large stored energies in the beams. In case of a failure the energy stored in the beams must be safely discharged. In general, the beams are extracted onto a target that can withstand the full energy stored in the beam. Safely dumping the beams can be rather challenging. This is an issue for accelerators such as the LHC \\cite{TheLHCStudyGroup1995}, HERA \\cite{Werner2006}, Tevatron \\cite{Mokhov2006}, RHIC \\cite{Fedotov2007} and SPS \\cite{Goddard2006}.\n\nLinear colliders and other accelerators with very high beam power densities due to small beam size have other challenges. Examples are the SLAC linac \\cite{Koontz2006}, International Linear Collider (ILC), CLIC (Compact Linear Collider), Next Linear Collider (a project that was discussed before ILC) \\cite{Ross2000, Ross2000a} and FLASH \\cite{Froehlich2006, Froehlich2006a} (average power of 50~kW).\nFor an accelerator like the ILC one beam pulse can lead  to damage. A citation from \\cite{Ross2000a} discussing the use of a low-intensity pilot beam during operation says: ``for any time interval large enough to allow a substantial change in the beam trajectory of component alignment (fraction of a second), a pilot beam must be used to prove the integrity of the accelerator''.\n\nIn synchrotron light sources with high-intensity beams and secondary photon beam, the primary beam, but also the intense photon beam, can damage equipment.\n\nFor energy recovery linacs, we take as an example the prototype of such accelerators in Daresbury: a single bunch train cannot damage equipment, but in case of beam loss the next train must not leave the (injector) station \\cite{Buckley2006}.\n\nOwing to the low intensity of medical accelerators there is no risk of damage to equipment. However, it is vital to prevent a too high dose to patients. The strategies and techniques to minimize risks for humans are similar to those for machine protection.\n\nFor very short bunches with high current the beam induces image currents in surrounding equipment that can damage bellows, beam instruments, cavities etc.\n\n\n\n\\subsection{Examples from LHC}\nMachine protection starts with a careful commissioning of the magnet powering system, considering that an energy of about 10~GJ is stored in the superconducting magnets. Magnet protection and powering interlocks must be operational long before starting beam operation. The strategy for LHC machine protection when operating with beam reflects many of the principles that have been discussed is as follows.\n\n\\begin{enumerate}\n\n  \\item Definition of aperture by collimators.\n\n  \\item Early detection of failures of equipment acting on beams generates a beam dump request, possibly before the beam is affected.\n\n  \\item Active monitoring of the beam parameters with beam instruments detecting abnormal\n  beam conditions and generating beam dump requests within a single machine turn.\n\n  \\item Reliable transmission of beam dump requests from a large variety of systems to the beam dumping system. An active signal is required for operation; the absence of the signal is considered as a beam dump request and injection inhibit.\n\n  \\item Reliable operation of the beam dumping system for dump\n  requests or internal faults, safely extracting the beams onto external dump blocks.\n\n  \\item Passive protection by beam absorbers and collimators for specific cases of failure.\n\n\\end{enumerate}\n\nThe general architecture for the essential elements in the machine protection system at LHC is shown in Fig. \\ref{LHC-protection-overview}. The LHC has eight sectors and eight insertions; three sectors are related to machine protection: two cleaning insertions with a large number of collimators and one insertion for the beam dumping system. More than 3600 beam loss monitors are installed around the machine. In case of a failure detected by hardware or beam monitors, the beam interlock system transmit a beam dump request to the beam dumping system and the beams are extracted.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.78\\linewidth]{LHC-protection-overview.png}\n\\caption{Layout of LHC with some of the systems for machine protection}\n\\label{LHC-protection-overview}\n\\end{figure}\n\n\\subsubsection{Beam dumping system at LHC}\nThe role of the LHC beam dumping system \\cite{Uyhoven2008} is to safely dispose of the beam when beam operation must be interrupted for any reason. Fifteen fast kicker magnets with a pulse rise time of less than 3~$\\mu$s deflect the beam by an angle of 280~$\\mu$rad in the horizontal plane, see Fig.~\\ref{Beamdump-Layout}. To ensure that all particles are extracted from the LHC without losses, the beam has a particle-free abort gap with a length of 3~$\\mu$s corresponding to the kicker rise time. The extraction kickers are triggered such that the field increases from zero to the nominal value during this gap when there should be no particles.\n\nDownstream of the kickers the beam is deflected vertically by 2.4~mrad towards the beam dump block by 15 septum magnets. A short distance further downstream, 10 diluter kicker magnets are used to paint the bunches in both horizontal and vertical directions to reduce the beam density on the dump block. The beam is transferred through a 700~m long extraction line to increase the transverse r.m.s.\\ beam size from approximately 0.2 to 1.5~mm and to spread the bunches further on the dump block.\n\nThe overall shape is produced by the deflection of the extraction and dilution kickers. For nominal beam parameters, the maximum temperature in the beam dump block is expected to be in the order of about 800$^{\\circ}$C.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beamdump-Layout.png}\n\\caption{Layout of the beam dumping systems, for both LHC beams (courtesy of M.~Gyr)}\n\\label{Beamdump-Layout}\n\\end{figure}\n\n\\subsubsection{Beam loss monitoring at LHC}\nThe monitors should be fast, for LHC down to 40 $\\mu$s, in order to detect beam losses in time to stop operation. They should be designed such that they can trigger a beam dump and stop operation before very fast beam losses damage equipment. There are about 3600 chambers distributed over the ring to detect abnormal beam losses and if necessary trigger a beam abort \\cite{Dehning2011}.\n\nFor LHC (Fig.~\\ref{LHC-BLM}) and several other accelerators, ionization chambers are used to detect beam losses. The reaction time is down to microseconds;\nthey can have a very large dynamic range exceeding 10$^8$.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{LHC-BLM.png}\n\\caption{Beam loss monitor at LHC}\n\\label{LHC-BLM}\n\\end{figure}\n\nFigure~\\ref{Beam-Losses-normal} shows the beam losses around LHC during regular luminosity operation. Losses are low in the arcs with the superconducting magnets, higher in the insertions with the experiments due to the debris of the collisions and very high in the betatron cleaning insertions. Figure~\\ref{Beam-Losses-UFO} shows the losses recorded after a beam dump during regular operation. A UFO in the arc between the betatron cleaning insertion and the LHCb experiment caused locally an increase of beam losses. The UFO (dust particles getting into the beam, see \\cite{baer2013}) causes very fast losses and when the threshold of one BLM is exceeded, the beams are dumped (see Fig. \\ref{UFO}).\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beam-Losses-normal.png}\n\\caption{Regular beam losses during luminosity operation}\n\\label{Beam-Losses-normal}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Beam-Losses-UFO.png}\n\\caption{Beam losses with UFO during luminosity operation}\n\\label{Beam-Losses-UFO}\n\\end{figure}\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{UFO.png}\n\\caption{Time structure of the beam losses caused by a UFO}\n\\label{UFO}\n\\end{figure}\n\n\\subsection{Protection for high power proton linacs}\nHigh-power proton accelerators (e.g.\\ spallation sources) operate with beam power of some 10~kW to above 1~MW. There is risk of both damage and activation. Examples are SNS \\cite{Sibley2005}, PSI cyclotron \\cite{Schmelzbach2006}, ISIS \\cite{Findlay2006}, J-PARC \\cite{Yoshikawa2007}), FRIB \\cite{Wei2012} and ESS designed for 5~MW \\cite{Peggs2005}.\n\nIn case of failure the beam must be switched off. The time needed to switch off the beam before equipment could be damaged depends on particle momentum, beam power, the type of failure and the equipment exposed to beam losses.\n\nIn case of an uncontrolled beam loss during 1~ms at ESS the deposited energy is up to 130~kJ, for 1~s up to 5~MJ. It is required to inhibit the beam after detecting uncontrolled beam loss as fast as possible. There is some delay between detection of a failure (e.g.\\ detection of beam losses by a BLM) and `beam off'. Figure \\ref{Laliplot} shows the time to melting of steel and copper in the case where the proton beam hits a metal surface between 3 and 80~MeV/$c$ \\cite{Tchelidze2012}.\n\nFor example, after the DTL normal-conducting linac, the proton energy is 78~MeV/$c$. In case of a beam size of 2~mm radius, melting would start after a beam impact of about 200~$\\mu$s. Inhibiting of the beam after a failure is detected should be in about 10\\% of this time.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.8\\linewidth]{Laliplot.png}\n\\caption{Time to melt copper and steel, as a function of proton momentum for different beam sizes \\cite{Tchelidze2012}}\n\\label{Laliplot}\n\\end{figure}\n\nThe time between detecting a failure and stopping the beam has to be considered. Assume that the beam is lost and the losses are detected by BLMs at the end of the linac. It takes some time to detect the losses and to generate an interlock signal ${\\rm d}T_{\\rm failure~detection}$, to propagate the interlock signal to the actuator that stops the beam ${\\rm d}T_{\\rm signal~transmission}$ and to stop the beam ${\\rm d}T_{\\rm inhibit~beam}$. There will be a number of bunches between source and end of the linac that cannot be stopped (${\\rm d}T_{\\rm beam~off}$). The total time that the beam will still be lost is given by (see also Fig. \\ref{Time-stop-beam})\n\n", "index": 3, "text": "\\begin{equation}\n  {\\rm d}T = {\\rm d}T_{\\rm failure~detection} + {\\rm d}T_{\\rm signal~transmission}  + {\\rm d}T_{\\rm inhibit~beam} + {\\rm d}\n  T_{\\rm beam~off}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\rm d}T={\\rm d}T_{\\rm failure~{}detection}+{\\rm d}T_{\\rm signal~{}%&#10;transmission}+{\\rm d}T_{\\rm inhibit~{}beam}+{\\rm d}T_{\\rm beam~{}off}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>T</mi></mrow><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msub><mi>T</mi><mrow><mpadded width=\"+3.3pt\"><mi>failure</mi></mpadded><mo>⁢</mo><mi>detection</mi></mrow></msub></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msub><mi>T</mi><mrow><mpadded width=\"+3.3pt\"><mi>signal</mi></mpadded><mo>⁢</mo><mi>transmission</mi></mrow></msub></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msub><mi>T</mi><mrow><mpadded width=\"+3.3pt\"><mi>inhibit</mi></mpadded><mo>⁢</mo><mi>beam</mi></mrow></msub></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><msub><mi>T</mi><mrow><mpadded width=\"+3.3pt\"><mi>beam</mi></mpadded><mo>⁢</mo><mi>off</mi></mrow></msub></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]