[{"file": "1601.04339.tex", "nexttext": " \n\nFor each pair of cells $m,n$, we measure the phase difference $\\Delta \\phi_{mn}$ at the end (beginning) of probe period $A$ ($B$) using phase-sensitive detection. The magnitude of $\\bf B_0$ is tuned to give an average precession frequency $\\omega_0 = 2\\pi \\times 8.33 $ s$^{-1}$, and the sampling frequency is 200 Hz, so the digitized signals have 24 points per Larmor cycle: $t_{i+1}-t_i = 5$ ms $=\\pi/(12\\omega)$. Then $S(t_{i\\pm 6}) = \\pm 2\\theta_0 \\cos(\\omega t + \\phi) e^{-t_{i \\pm 6}/\\tau}$ and $N^2(t_i) = S^2(t_i) -S(t_{i+6}) S(t_{i-6}) = 4\\theta_0^2 e^{-2t_i/\\tau}$. With $S'(t_i) = S(t_{i+6}) -S(t_{i-6})$, our beat signal is:\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\title{Reduced Limit on the Permanent Electric Dipole Moment of $^{199}$Hg}\n\\author{B. Graner}\n\\email[]{bgraner@uw.edu}\n\\author{Y. Chen}\n\\author{E. G. Lindahl}\n\\author{B. R. Heckel}\n\\affiliation{Department of Physics, University of Washington, Seattle, Washington 98195, USA}\n\n\\date{\\today}\n\\begin{abstract}\nThis paper describes the results of the most recent measurement of the permanent electric dipole moment (EDM) of neutral $^{199}$Hg atoms. Fused silica vapor cells containing enriched $^{199}$Hg are arranged in a stack in a common magnetic field. Optical pumping is used to spin-polarize the atoms orthogonal to the applied magnetic field, and the Faraday rotation of near-resonant light is observed to determine an electric-field-induced perturbation to the Larmor precession frequency. Our results for this frequency shift are consistent with zero; we find the corresponding $^{199}$Hg EDM $d_{Hg} = (-2.20 \\pm 2.75_{stat} \\pm 1.48_{syst}) \\times 10^{-30} e\\cdot \\text{cm}$. We use this result to place a new upper limit on the $^{199}$Hg EDM $|d_{Hg}| < 7.4\\times 10^{-30} e\\cdot \\text{cm}$ (95\\% C.L.), improving our previous limit by a factor of 4. We also discuss the implications of this result for various $CP$-violating observables as they relate to theories of physics beyond the standard model.\n\\end{abstract}\n\n\\pacs{11.30.Er, 24.80.+y, 32.10.Dk, 32.80.Xx}\n\\maketitle\n\nThe existence of a nonzero permanent electric dipole moment (EDM) oriented along the spin axis of an atom or subatomic particle requires time-reversal symmetry ($T$) violation \\cite{1950_Purcell_Ramsey}. By the $CPT$ theorem, $T$-violation implies that $CP$ symmetry must be violated as well. The Standard Model (SM) of particle physics provides two sources of $CP$ violation: a single phase in the CKM matrix \\cite{1973_Kobayashi_Maskawa} and $\\theta_{QCD}$, the coefficient of an allowed $CP$-violating term in the QCD Lagrangian. However, the CKM phase contribution to any atomic or particle EDM is far below existing experimental sensitivities \\cite{Khriplovich_Lamoreaux}, and the measured value of $\\theta_{QCD}$ is consistent with zero, an apparent anomaly that forms the basis of the Strong $CP$ problem. An atomic EDM may thus provide the first evidence of $CP$-violation in the strong sector, or evidence of $CP$-violating physics beyond the SM \\cite{2013_Engel_et_al_EDM_review}. Discovery of any new source of $CP$-violation may also fulfill one of the Sakharov conditions \\cite{1967_Sakharov} necessary for a theory of baryogenesis that can reproduce the observed matter excess in the universe \\cite{2010_EDM_Baryogenesis}.\n\nThere are many ongoing experiments currently searching for a nonzero atomic, electron, or neutron EDM \\cite{2015_Ra_EDM, 2014_ACME_eEDM, 2011_YbF_EDM, 2015_ILL_nEDM_gravity_correction}. This paper presents the results of an improved EDM search in the $^{199}$Hg atom \\cite{2009_Hg_EDM}. The experiment consists of four (25 mm inner diameter, 10.1 mm tall) vapor cells fabricated from Heraeus Suprasil fused silica and filled with 0.56 atm of CO buffer gas and $\\sim$0.5 mg of isotopically-enriched (92\\%) $^{199}$Hg, arranged in a stack inside a common magnetic field $\\mathbf{B_0}$. The atoms are optically pumped with circularly polarized resonant 254 nm laser light chopped at the Larmor frequency to create a net polarization orthogonal to $\\mathbf{B_0}$. Once polarized, they precess with an unperturbed angular frequency $\\omega_0 = \\gamma\\mathbf{B_0}$, where $\\gamma=4844 \\text{ s}^{-1}/\\text{G}$ is the gyromagnetic ratio of $^{199}$Hg. A nonzero EDM, $\\mathbf{d} = d_{Hg}\\mathbf{I},$ adds a second term to the Hamiltonian $H = -\\boldsymbol{\\mu}\\cdot\\mathbf{B} - \\mathbf{d}\\cdot\\mathbf{E}.$ Because the only vector characterizing the system is the nuclear spin ($I=1/2$), any EDM must lie along the spin axis. Degeneracy arguments imply that the EDM can have only one projection onto the spin vector for a given particle or atomic species \\cite{Khriplovich_Lamoreaux}. If a two-level atom with a nonzero EDM is placed in parallel fields $\\mathbf{B}$, $\\mathbf{E}$ and another in antiparallel fields $\\mathbf{B}$, $\\mathbf{-E}$, the difference in the precession frequency is given by $\\hbar\\Delta\\omega = 4(d_{Hg}E)$.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.8]{Apparatus_diagram_on+off_axis_V2.pdf}\n\\end{center}\n\\caption{Cross-sectional diagrams of the apparatus used to measure the EDM of $^{199}$Hg (not to scale). a) Section of the vessel through the y-z plane showing the HV cables, groundplane, plus a cut-away view of the HV electrodes and feedthroughs. b) Section through the x-y plane showing the cylindrical 3-layer magnetic shielding, the cos$(\\theta)$ magnet coil windings, and a diagram with 2 of the polarimeters used to observe signals from each of the 4 cells. The laser beams through the outer cells traverse the apparatus along the shield axis (z-axis), while the middle cell beams travel along the x-axis.}\n\\label{Apparatus_diagram}\n\\end{figure}\n\nA schematic diagram of the experimental apparatus is given in Fig. \\ref{Apparatus_diagram}. The Hg vapor cells are stacked along the axis of the static magnetic field $\\mathbf{B_0}$. All four cells are inside a grounded box (called the \\textit{vessel}) constructed from anti-static UHMW polyethylene, with a tin(IV) oxide-coated groundplane constructed from 3 layers of 1/16\" fused silica dividing the two halves. The two outer cells are seated inside conducting plastic electrodes (maintained at the same potential), so only the inner cells have nonzero electric fields inside (pointing in opposite directions). The two outer cells (with $\\mathbf{E}=0$) have zero EDM sensitivity and are used as magnetometers and to control sources of systematic error.\n\nA typical pump-probe cycle lasts 4.5 minutes and consists of 5 parts: A 30 s pump period, a 20 s equilibration period, an initial 20 s probe (period $A$), a 170 s free-precession (the \\textit{Dark} period), and a final 30 s probe (period $B$). The length of the dark period is constrained by the $^{199}$Hg spin relaxation time, which varies between 250-600 s from cell-to-cell. To avoid noise and systematic errors arising from the probe light, we extract the EDM precession frequency shift from the accumulated phase difference of the 2 middle cells between the end of probe period $A$ and the beginning of probe period $B$.\n\nDuring the pump phase, the laser light is tuned to the center of the $F=1/2 \\rightarrow F=1/2$ component of the $^1S_0\\rightarrow^{3}P_1$ transition and circularly polarized by means of a $\\lambda/4$ waveplate. To coherently polarize atoms transverse to $\\mathbf{B_0}$, the pump light is chopped in sync with the Larmor frequency $\\omega_0$ by a rotating chopper wheel with 40\\% duty cycle. Following the pump, a shutter in the beam is closed for 20 s to allow the distribution of spins to reach equilibrium, while the $\\lambda/4$ waveplate and chopper wheel are removed from the beam path using pneumatic arms. The atoms are probed with linearly polarized laser light which is detuned $\\sim$10 GHz to the blue (halfway between the $F=1/2$ and $F=3/2$ components of the excited state) and attenuated to 0.1 times the pump intensity. \n\nPrecession signals for each cell are derived from the Faraday rotation angle of the input probe light polarization, $\\theta(t)$, which is proportional to the dot product of the atomic magnetization vector and the light propagation vector: $\\theta(t) = \\theta_0 \\sin(\\omega t + \\phi) e^{-t/\\tau}$ where $\\tau$ is the magnetization relaxation time. The output beam from each cell is sent to a balanced polarimeter, where a $\\lambda/2$ waveplate rotates the average polarization vector of the light and a Wollaston prism separates it into $s$ and $p$ components. Each component is detected by a UV-enhanced Si photodiode, digitized at a sampling frequency of 2 kHz, and written to disk at 200 Hz after averaging 10 samples. With the $\\lambda/2$ waveplate properly set, the time-averaged $s$ and $p$ intensities for each cell are equal, and the cell precession signal becomes\n\n", "index": 1, "text": "\\begin{equation}\nS(t) = \\frac{I_s(t)-I_p(t)}{I_s(t)+I_p(t)} = \\sin{2\\theta} \\approx 2\\theta_0 \\sin(\\omega t + \\phi) e^{-t/\\tau}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S(t)=\\frac{I_{s}(t)-I_{p}(t)}{I_{s}(t)+I_{p}(t)}=\\sin{2\\theta}\\approx 2\\theta_%&#10;{0}\\sin(\\omega t+\\phi)e^{-t/\\tau}.\" display=\"block\"><mrow><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mrow><msub><mi>I</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>I</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mrow><msub><mi>I</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>I</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>=</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mn>2</mn><mo>⁢</mo><mi>θ</mi></mrow></mrow><mo>≈</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>θ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ω</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mi>ϕ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>t</mi><mo>/</mo><mi>τ</mi></mrow></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04339.tex", "nexttext": "\nDefining $t_i = 0$ at the end of period $A$ or the beginning of period $B$, a least squares fit to $\\Delta \\omega_{mn} t_i +\\Delta \\phi_{mn}$ gives us $\\Delta \\phi_{mn}^{A,B}$. The average dark frequency difference between two cells is $\\Delta \\omega_{mn}^D = (\\Delta \\phi_{mn}^B -\\Delta \\phi_{mn}^A)/\\Delta t^D,$ where the dark time $\\Delta t^D$ is typically 170 s. \n\nFor any pair of cells, the signature of an EDM is the correlation between $\\Delta \\omega_{mn}^D$ and the difference in the electric field. During EDM data runs, the HV polarity is reversed between each pump-probe cycle, so in the absence of any noise sources the middle cell frequency difference $\\Delta \\omega^D_{MT-MB}$ would have an opposite sign for each successive measurement. In reality, $\\Delta \\omega^D_{MT-MB}$ is also sensitive to fluctuations in the gradients of $\\mathbf{B_0}$. To reduce the impact of magnetic field gradient noise, we use the outer cells as magnetometers and define our EDM signal as $\\Delta \\omega_{EDM} = \\Delta \\omega^D_{MT-MB}- k\\Delta \\omega^D_{OT-OB},$ where $k$ is the coefficient that minimizes the variance of the HV-correlated part of $\\Delta \\omega_{EDM}$ within each daily set of measurements. Throughout the data set, the value of $k$ varied from 0.18 to 0.33 with an average of 0.25, reflecting the day-to-day variations in ambient magnetic field gradient noise.\n\nDuring normal data taking, the pattern of HV reversals is alternated between $\\pm 10$ kV or $\\pm 6$ kV each day to check the scaling of an EDM signal with the strength of $\\mathbf{E}$. The magnet coil current is reversed every other day to reduce the effect of systematics which depend on the HV but do not change sign with $\\mathbf{B_0}$ (as a real EDM signal would). To average data across multiple daily runs, we define $\\eta_{\\mathbf{B}} = \\mathbf{B}_0/|\\mathbf{B}_0|$ and take $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ as our EDM-sensitive frequency channel. The results for $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ from each run are plotted in Figure \\ref{Combo_Data}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.36]{Data_Graph.pdf}\n\\end{center}\n\\caption{The measured EDM frequency shift $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ for each of the 252 runs in the final (reduced) data set. Each run is plotted on either the top or bottom chart. Top: the frequency shifts measured between $\\pm 6$ kV/cm. Bottom: shifts measured between $\\pm 10$ kV/cm.}\n\\label{Combo_Data}\n\\end{figure}\n\nA set of 16-24 data runs with several cycles through the 4 $\\mathbf{B_0}|\\mathbf{E}|$ values defines a \\textit{sequence}. Between sequences, the vessel is opened and the vapor cells are permuted through the various positions. The 3 vapor cells with the longest spin relaxation times are used in the EDM-sensitive middle cell positions. Each of these cells occupied the middle top (MT) and middle bottom (MB) positions for 4 sequences each. \n\nTo make data cuts without biasing the result, the frequency difference of each cell pair is added to a computer-generated blind offset, proportional to the $\\mathbf{E}$-field difference between the cells. The sign of the blind offset changes with the direction of $\\mathbf{B_0}$, and the value is randomized with each new sequence. After data cuts of individual pump-probe cycles are made within a sequence (based on anomalous behavior on non-EDM data channels), the sequence is reanalyzed with a blind offset common to all runs to enable comparisons across sequences.\n\nThe full EDM data set is comprised of 284 daily runs divided into 12 sequences. Roughly halfway through data collection, it became apparent that a new systematic error was present: HV-correlated frequency shifts would sometimes appear on the EDM-insensitive outer cell frequency difference. When this occurred, additional data runs were taken (63 in total) to investigate the source of the anomalous signal. Small, HV-correlated motions of the vapor cells in magnetic field gradients were found be the cause. To reduce the potential feedthrough of the cell motion onto the EDM signal, 32 runs were cut from the EDM data set based on two criteria: \n\\begin{enumerate}\n\\item $|\\Delta\\omega_{OT-OB}| > 2.0 \\sigma$ or $2.0 \\times 10^{-8}$ s$^{-1}$\n\\item $|\\Delta\\omega_{(OT-MT)+(OB-MB)}| > 3.0 \\sigma$ or $1.5 \\times 10^{-8}$ s$^{-1}$ \n\\end{enumerate}\nThe cuts are based only on EDM-insensitive channels (with zero average $\\mathbf{E}$ and no blind offset). The first channel is sensitive to cell motion in a linear field gradient $\\partial B_y/\\partial y.$ The second channel is equivalent to the difference between the average frequencies of the inner and outer cells and can indicate cell motion coupled to the second derivative $\\partial^2B_y/\\partial y^2.$ After the final cuts, our data set consists of 252 runs encompassing $\\sim$65,000 frequency difference measurements to be analyzed for an EDM. The 32 cut runs and 63 auxiliary runs are used to set limits on the systematic error associated with cell motion.\n\n\\begin{table}\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\begin{tabular}{cccc}\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\hline \\hline  \t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVoltage & $\\mathbf{B_0}\\cdot \\hat{z}$ & $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{EDM}$ & $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{OT-OB}$ \\\\ \n\\hline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n$\\pm$10 kV & +10 mG & $(1.16\\pm2.6)$ & $(-8.8\\pm9.9)$ \\\\ \n$\\pm$10 kV & -10 mG & $(-3.15\\pm2.8)$ & $(-11.5\\pm10.4)$ \\\\ \n$\\pm$ 6 kV & +10 mG & $(3.69\\pm5.0)$ & $(5.9\\pm16.7)$ \\\\ \n$\\pm$ 6 kV & -10 mG & $(-8.56\\pm4.7)$ & $(-29.1\\pm17.1)$ \\\\ \n\\hline \\hline\n\\end{tabular} \n\\caption{Measured HV-correlated frequency shifts for various field configurations. Entries for $\\Delta\\omega$ are specified in units of $10^{-11}$ (kV$\\cdot$s/cm)$^{-1}$.}\n\\label{Results} \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{table} \n\nTable \\ref{Results} summarizes the results for each HV value and magnetic field direction. We take the average over the two magnetic field directions for both 10 and 6 kV and then take the inverse error squared weighted average of the 10 and 6 kV results to find our EDM frequency shift $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{EDM} = (-1.34 \\pm 1.67) \\times 10^{-11}$ (kV$\\cdot$s/cm)$^{-1},$ which gives us an EDM of $\\mathbf{d}_{Hg} = (-2.20 \\pm 2.75_{stat}) \\times 10^{-30}$ $e\\cdot$cm.\n\nTable \\ref{Systematics} gives the systematic error budget of our measurements. The dominant contribution comes from the effect of HV-correlated \\textit{Axial Cell Motion.} Detailed maps of the magnetic field gradients at the vapor cells revealed a lab-fixed gradient in $\\mathbf{B_0}$ along the axial magnetic shield direction $\\hat{z}$. Motion of the vessel or the cells along $\\hat{z}$ caused by applying HV would create a non-zero HV-correlated $\\Delta \\omega$ for any pair of cells. Because the field gradient in $\\hat{z}$ does not reverse sign with $\\mathbf{B_0}$, the change in a cell's Larmor frequency under cell motion will change sign as $\\mathbf{B}_0$ is reversed, leading to a HV-correlated frequency difference between cells with the $\\mathbf{E}\\cdot\\mathbf{B}_0$ symmetry properties of an EDM. By comparing the EDM extracted from the 95 excluded (ex.) runs for which $\\Delta \\omega_{OT-OB}$ was large to the reduced EDM data set runs, we find:\n\n", "itemtype": "equation", "pos": 8890, "prevtext": " \n\nFor each pair of cells $m,n$, we measure the phase difference $\\Delta \\phi_{mn}$ at the end (beginning) of probe period $A$ ($B$) using phase-sensitive detection. The magnitude of $\\bf B_0$ is tuned to give an average precession frequency $\\omega_0 = 2\\pi \\times 8.33 $ s$^{-1}$, and the sampling frequency is 200 Hz, so the digitized signals have 24 points per Larmor cycle: $t_{i+1}-t_i = 5$ ms $=\\pi/(12\\omega)$. Then $S(t_{i\\pm 6}) = \\pm 2\\theta_0 \\cos(\\omega t + \\phi) e^{-t_{i \\pm 6}/\\tau}$ and $N^2(t_i) = S^2(t_i) -S(t_{i+6}) S(t_{i-6}) = 4\\theta_0^2 e^{-2t_i/\\tau}$. With $S'(t_i) = S(t_{i+6}) -S(t_{i-6})$, our beat signal is:\n\n", "index": 3, "text": "\\begin{equation}\n2\\sin(\\Delta \\omega_{mn} t_i +\\Delta \\phi_{mn}) = \\frac{S_m(t_i)S'_n(t_i)-S_n(t_i)S'_m(t_i)}{N_m(t_i)N_n(t_i)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"2\\sin(\\Delta\\omega_{mn}t_{i}+\\Delta\\phi_{mn})=\\frac{S_{m}(t_{i})S^{\\prime}_{n}%&#10;(t_{i})-S_{n}(t_{i})S^{\\prime}_{m}(t_{i})}{N_{m}(t_{i})N_{n}(t_{i})}.\" display=\"block\"><mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mrow><mi>m</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><msub><mi>t</mi><mi>i</mi></msub></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mfrac><mrow><mrow><msub><mi>S</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>S</mi><mi>n</mi><mo>′</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>S</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>S</mi><mi>m</mi><mo>′</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mi>N</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>N</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04339.tex", "nexttext": "\nwhich we take as the projection of a $\\Delta \\omega_{OT-OB}$ cell motion signal onto the EDM channel. This projection times the combined $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{OT-OB} = (1.04 \\pm 0.62)\\times10^{-10}$ (kV$\\cdot$s/cm)$^{-1}$ gives the top systematic error in Table \\ref{Systematics}.\n\nThe \\textit{Radial Cell Motion} systematic refers to motion in both directions ($\\hat{x}$ and $\\hat{y}$) orthogonal to the shield axis. The measured field gradients in $\\hat{x}$ and $\\hat{y}$ were found to reverse to within 4.4\\% when the $\\mathbf{B_0}$ coil current was reversed. HV-correlated motion along these axes would  thus generate a non-zero value for $\\Delta \\omega_{EDM}$ that, unlike a true EDM signal, would not change sign under $\\mathbf{B_0}$ reversal. Table \\ref{Results} shows that the non-reversing component of $\\Delta \\omega_{EDM}$ (half the difference between the two magnetic field directions) is $(3.1 \\pm 1.7) \\times 10^{-11}$ (kV$\\cdot$s/cm)$^{-1}$. A signal of this size could be generated by a HV-correlated motion as small as 2 nm and the projection onto the true EDM channel would be 4.4\\% as large.\n\nThe \\textit{Leakage Current} systematic refers to electrical currents flowing from the HV electrodes to ground along the walls of the vapor cells. A helical current path around a vapor cell would create a magnetic field that adds linearly to $\\mathbf{B_0}$, producing a Larmor frequency shift with the same field-dependence as an EDM. Currents from the vessel walls, the HV cables, and various segments of the groundplane were continuously monitored by a set of $0.01$ V/pA transimpedance amplifiers. The measured currents to the top and bottom groundplanes were each $\\le 40$ fA, averaged over the probe periods and free-precession period; roughly $30 \\%$ of these currents were displacement currents from charge accumulation in the HDPE HV feedthroughs. We use 40 fA for an upper limit on the leakage currents and follow the ``worst-case current path'' of 1/2 turn around each of the middle cells to determine the impact on $\\Delta\\omega_{EDM}$. Dividing by $\\sqrt{3}$ to account for the average of 3 independent vapor cells, our total leakage current systematic is 10 times smaller than our previous EDM experiment \\cite{2013_Hg_EDM_PRA}. The groundplane in \\cite{2013_Hg_EDM_PRA} was coated with Au, which has a work function (5.1-5.5 eV) close to the 254 nm photon energy, so the currents included photoelectrons from scattered light. Our present experiment avoids this effect by using a SnO$_2$-coated groundplane.\n\n\\begin{table}\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\begin{tabular}{cc|cc}\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\hline \\hline   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEffect & Syst. & Effect & Syst. \\\\ \t\t\t\t\t\t\t\t\t\t\n\\hline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAxial Cell Motion \t\t&\t12.6\t&\tParameter Correlations\t\t\t\t\t\t\t& 2.33\t\\\\ \t\nRadial Cell Motion \t\t&\t3.36\t&\t$\\mathbf{v}\\times\\mathbf{E}/c$ Fields\t\t\t& 2.29\t\\\\ \t\nLeakage Currents\t\t&\t5.02\t&\tCharging Currents\t\t\t\t\t\t\t\t& 1.83\t\\\\ \t\n$\\mathbf{E}^2$ Effects\t&\t3.04\t&\tGeometric Phase\t\t\t\t\t\t\t\t\t& 0.06\t\\\\ \t\n\\hline \\hline\n\\end{tabular} \n\\caption{Systematic effects on the measured EDM value. All entries are specified in units of ($10^{-31} e\\cdot \\text{cm}$). The final value for the systematic error bar is the quadrature sum of the listed effects, $1.48\\times10^{-30} e\\cdot \\text{cm}$.}\n\\label{Systematics} \t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{table} \n\nThe \\textit{$\\mathbf{E}^2$ Effects} systematic refers to any mechanism that may couple a small difference in the magnitude of $\\mathbf{E}$ between the two polarities to the measured frequency difference. After each EDM data run (with a $+-+-$ HV sequence), shorter data runs (typically 30 pump-probe cycles) were taken with a $+0-0$ HV sequence to test for frequency shifts that scale as $|\\mathbf{E}|$. For each sequence, the scalar Stark shift was measured to obtain the difference in magnitude of $\\mathbf{E}$ for the two polarities of the HV: $r=(\\mathbf{E}^2_+-\\mathbf{E}^2_-)/(\\mathbf{E}^2_++\\mathbf{E}^2_-)\\leq 0.02$. The product of $r$ and the frequency difference between scans with the HV on and off, $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{EDM}(|10 \\text{kV}|-|0 \\text{kV}|),$ is averaged over all sequences to get the systematic error in Table \\ref{Systematics}. The remaining entries in Table \\ref{Systematics} are derived following the same methods used in \\cite{2013_Hg_EDM_PRA}.\n\n\n\\begin{table}[h]\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\begin{tabular}{c c c}\t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\hline \\hline                \t\t\t\t\t\t\t\t\t\t\t\t\t\nReference & Year & $\\mathbf{d}_{Hg} \\left(S/e \\cdot  fm^3\\right) e\\cdot cm$ \\\\\t\n\\hline                   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\[-2.0ex]\t\t\t\n\\cite{2015_Singh_and_Sahoo_Hg_Schiff_Moment}\t\t\t\t\t\t& 2015 \t\t& $-2.1\\times 10^{-17}$ \\\\ \n\\cite{2014_Radziute_et_al_DHF_EDM}         \t\t\t\t\t\t\t& 2014 \t\t& $-2.5\\times 10^{-17}$ \\\\ \n\\cite{2009_Latha_et_al_Hg_EDM, *2015_Latha_et_al_Hg_EDM_Correction}\t& 2009\t\t& $-2.5\\times 10^{-17}$ \\\\\n\\cite{2009_Dzuba_Flambaum_Porsev_EDMvSM}   \t\t\t\t\t\t\t& 2009 \t\t& $-1.2\\times 10^{-17}$ \\\\\n\\cite{2009_Dzuba_Flambaum_Porsev_EDMvSM}   \t\t\t\t\t\t\t& 2009 \t\t& $-3.0\\times 10^{-17}$ \\\\\n\\cite{2002_Dzuba_et._al._EDMvsSM} \t\t  \t\t\t\t\t\t\t& 2002 \t\t& $-2.8\\times 10^{-17}$ \\\\\n\\hline                   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\[-2.0ex]\t\t\t\n\\textbf{Average:}\t\t\t\t\t\t\t\t\t\t\t\t\t& \t   \t\t& $\\mathbf{-2.4\\times 10^{-17}}$\\\\\n\\hline \\hline   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{tabular} \n\\caption{Calculations of the $^{199}$Hg EDM contribution from the nuclear Schiff moment $\\mathbf{S}_{Hg}$. Using our limit for $\\mathbf{d}_{Hg},$ we can set a limit $|\\mathbf{S}_{Hg}| < 3.1\\times 10^{-13} e\\cdot \\text{fm}^3$ (95\\% C.L.).}\n\\label{SchiffMoment}\t \t\t\t\t\t\t\t\t\t\t\t\t\n\\end{table}\n\nTheoretical interpretations of the $^{199}$Hg EDM limit begin with consideration of the Schiff moment $\\mathbf{S},$ the leading-order $P,T$-violating nuclear moment not completely screened by the electron cloud \\cite{1963_Schiff, 2004_Ginges_Flambaum_Fund._Symmetries_in_Atoms, 2013_Engel_et_al_EDM_review}. The results of recent calculations of $\\mathbf{S}_{Hg}$ are given in table \\ref{SchiffMoment}; we use the average value to set limits on other $CP$-violating quantities of interest in table \\ref{Limits}. Limits on the nucleon EDMs $\\mathbf{d}_{n,p}$ are derived from the associated contributions to $\\mathbf{S}_{Hg}$ in an RPA calculation with core-polarization \\cite{2003_Dmitriev_and_Sen'kov_Hg_Schiff_Moment}, which yielded $\\mathbf{S}_{Hg} = (1.9 \\mathbf{d}_n + 0.2 \\mathbf{d}_p) \\text{fm}^2$, with a 30\\% uncertainty in the $\\mathbf{d}_p$ contribution which is reflected in our limit. The $\\pi NN$ coupling constants $\\bar{g}_{0,1,2}$ parameterize the pseudoscalar, pseudovector, and pseudotensor components of the $CP$-violating nucleon-nucleon interaction, respectively. However, there is considerable disagreement between various calculations of $\\mathbf{S}_{Hg}(\\bar{g}_0,\\bar{g}_1,\\bar{g}_2)$. To set limits on $\\bar{g}_{0,1,2}$, we use the quoted best values for $^{199}$Hg from the recent review \\cite{2013_Engel_et_al_EDM_review}. Note that the calculation has a sign ambiguity for the value of $\\bar{g}_1$. We also set a limit on $\\theta_{QCD}$ from the relation $|\\bar{g}_0| = 0.027|\\theta_{QCD}|$ \\cite{1979_Crewther_et._al._nEDM_from_QCD, *1980_Crewther_et._al._nEDM_from_QCD_Errata}. A limit on the combined chromo-EDM of the up and down quarks is determined by $\\bar{g}_1=2\\times10^{-14}\\text{cm}^{-1}(\\widetilde{d}_u-\\widetilde{d}_d) $ \\cite{2002_Pospelov_quark_chromo_EDM}.\n\n\\begin{table}[h]\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\begin{tabular}{cccc}\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\hline \\hline   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\nQuantity & Expression & Limit & Ref. \\\\ \t\t\t\t\t\t\t\t\n\\hline \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\[-2.0ex]\t\t\t\n$\\mathbf{d}_n$\t& $\\mathbf{S}_{Hg}/(1.9 \\text{ fm}^2)$ \t\t& $1.6\\times 10^{-26}$ $e\\cdot\\text{cm}$ & \\cite{2003_Dmitriev_and_Sen'kov_Hg_Schiff_Moment}\\\\\n$\\mathbf{d}_p$\t& $1.3\\times\\mathbf{S}_{Hg}/(0.2 \\text{ fm}^2)$\t& $2.0\\times 10^{-25}$ $e\\cdot\\text{cm}$ & \\cite{2003_Dmitriev_and_Sen'kov_Hg_Schiff_Moment}\\\\\n$\\bar{g}_0$ \t& $\\mathbf{S}_{Hg}/(0.135$ $e\\cdot\\text{fm}^3)$ & $2.3\\times 10^{-12}$ & \\cite{2013_Engel_et_al_EDM_review}\\\\\n$\\bar{g}_1$ \t& $\\mathbf{S}_{Hg}/(0.27$ $e\\cdot\\text{fm}^3)$ \t& $1.1\\times 10^{-12}$ & \\cite{2013_Engel_et_al_EDM_review}\\\\\n$\\bar{g}_2$ \t& $\\mathbf{S}_{Hg}/(0.27$ $e\\cdot\\text{fm}^3)$ \t& $1.1\\times 10^{-12}$ & \\cite{2013_Engel_et_al_EDM_review}\\\\\n$\\theta_{QCD}$ \t& $\\bar{g}_0/0.027$ \t\t\t\t\t& $8.5\\times 10^{-11}$ & \\cite{1979_Crewther_et._al._nEDM_from_QCD, 1980_Crewther_et._al._nEDM_from_QCD_Errata}\\\\\n$(\\widetilde{d}_u-\\widetilde{d}_d)$ & $\\bar{g}_1/(2\\times10^{14} \\text{cm}^{-1})$ & $5.7\\times 10^{-27} \\text{ cm}$& \\cite{2002_Pospelov_quark_chromo_EDM}\\\\\n$C_S$ \t\t\t& $\\mathbf{d}_{Hg}/(5.9 \\times10^{-22}$ $e\\cdot\\text{cm})$ & $1.3\\times 10^{-8}$ & \\cite{2004_Ginges_Flambaum_Fund._Symmetries_in_Atoms}\\\\\n$C_P$\t\t\t& $\\mathbf{d}_{Hg}/(6.0\\times10^{-23}$ $e\\cdot\\text{cm)}$ & $1.2\\times 10^{-7}$ & \\cite{2004_Ginges_Flambaum_Fund._Symmetries_in_Atoms}\\\\\n$C_T$\t\t\t& $\\mathbf{d}_{Hg}/(4.89 \\times10^{-20}$ $e\\cdot\\text{cm})$ & $1.5\\times 10^{-10}$ & see text\\\\\t\t\t\t\t\t\n\\hline \\hline   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{tabular} \n\\caption{Limits on $CP$-violating observables from the $^{199}$Hg EDM limit. Each limit is based on the assumption that it is the sole contribution to the atomic EDM.}\n\\label{Limits} \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{table} \n\nOur result can also be used to place limits on $P,T$-odd scalar, pseudoscalar, and tensor electron-nucleon interactions (described by $C_S$, $C_P$, and $C_T$) which may induce an atomic EDM independent of the Schiff moment. In $^{199}$Hg the tensor interaction is expected to dominate. Many recent calculations of the tensor coefficient $C_T$ have been performed; the average result of \\cite{2015_Singh_and_Sahoo_Hg_Schiff_Moment, 2014_Radziute_et_al_DHF_EDM, 2009_Dzuba_Flambaum_Porsev_EDMvSM, 2009_Latha_et_al_Hg_EDM, 2008_Latha_et_al_Core_Polrization_EDM} is $\\mathbf{d}_{Hg} = -4.89\\times 10^{-20} C_T \\langle\\sigma_N\\rangle e\\cdot \\text{cm}$. Finally, it should be noted that because there are many potential contributions to an atomic EDM, multiple non-null results in different systems will be necessary to extract unambiguous values for fundamental physics parameters \\cite{2015_Chupp_Xe_EDM_Motivation}.\n\n\\begin{acknowledgments}\nWe gratefully acknowledge the contributions of Kyle Matsuda for performing our magnetic field maps and Professor E. N. Fortson for valuable advice. This work was supported by NSF Grant 1306743 and  the  U.S. Department of Energy Office of Science, Office of Nuclear Physics under Award No. DE-FG02-97ER41020.\n\\end{acknowledgments}\n\n\\bibliography{Hg_EDM_2015_V_3}\n\n\n", "itemtype": "equation", "pos": 16230, "prevtext": "\nDefining $t_i = 0$ at the end of period $A$ or the beginning of period $B$, a least squares fit to $\\Delta \\omega_{mn} t_i +\\Delta \\phi_{mn}$ gives us $\\Delta \\phi_{mn}^{A,B}$. The average dark frequency difference between two cells is $\\Delta \\omega_{mn}^D = (\\Delta \\phi_{mn}^B -\\Delta \\phi_{mn}^A)/\\Delta t^D,$ where the dark time $\\Delta t^D$ is typically 170 s. \n\nFor any pair of cells, the signature of an EDM is the correlation between $\\Delta \\omega_{mn}^D$ and the difference in the electric field. During EDM data runs, the HV polarity is reversed between each pump-probe cycle, so in the absence of any noise sources the middle cell frequency difference $\\Delta \\omega^D_{MT-MB}$ would have an opposite sign for each successive measurement. In reality, $\\Delta \\omega^D_{MT-MB}$ is also sensitive to fluctuations in the gradients of $\\mathbf{B_0}$. To reduce the impact of magnetic field gradient noise, we use the outer cells as magnetometers and define our EDM signal as $\\Delta \\omega_{EDM} = \\Delta \\omega^D_{MT-MB}- k\\Delta \\omega^D_{OT-OB},$ where $k$ is the coefficient that minimizes the variance of the HV-correlated part of $\\Delta \\omega_{EDM}$ within each daily set of measurements. Throughout the data set, the value of $k$ varied from 0.18 to 0.33 with an average of 0.25, reflecting the day-to-day variations in ambient magnetic field gradient noise.\n\nDuring normal data taking, the pattern of HV reversals is alternated between $\\pm 10$ kV or $\\pm 6$ kV each day to check the scaling of an EDM signal with the strength of $\\mathbf{E}$. The magnet coil current is reversed every other day to reduce the effect of systematics which depend on the HV but do not change sign with $\\mathbf{B_0}$ (as a real EDM signal would). To average data across multiple daily runs, we define $\\eta_{\\mathbf{B}} = \\mathbf{B}_0/|\\mathbf{B}_0|$ and take $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ as our EDM-sensitive frequency channel. The results for $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ from each run are plotted in Figure \\ref{Combo_Data}.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.36]{Data_Graph.pdf}\n\\end{center}\n\\caption{The measured EDM frequency shift $\\eta_{\\mathbf{B}}\\cdot\\Delta \\omega_{EDM}$ for each of the 252 runs in the final (reduced) data set. Each run is plotted on either the top or bottom chart. Top: the frequency shifts measured between $\\pm 6$ kV/cm. Bottom: shifts measured between $\\pm 10$ kV/cm.}\n\\label{Combo_Data}\n\\end{figure}\n\nA set of 16-24 data runs with several cycles through the 4 $\\mathbf{B_0}|\\mathbf{E}|$ values defines a \\textit{sequence}. Between sequences, the vessel is opened and the vapor cells are permuted through the various positions. The 3 vapor cells with the longest spin relaxation times are used in the EDM-sensitive middle cell positions. Each of these cells occupied the middle top (MT) and middle bottom (MB) positions for 4 sequences each. \n\nTo make data cuts without biasing the result, the frequency difference of each cell pair is added to a computer-generated blind offset, proportional to the $\\mathbf{E}$-field difference between the cells. The sign of the blind offset changes with the direction of $\\mathbf{B_0}$, and the value is randomized with each new sequence. After data cuts of individual pump-probe cycles are made within a sequence (based on anomalous behavior on non-EDM data channels), the sequence is reanalyzed with a blind offset common to all runs to enable comparisons across sequences.\n\nThe full EDM data set is comprised of 284 daily runs divided into 12 sequences. Roughly halfway through data collection, it became apparent that a new systematic error was present: HV-correlated frequency shifts would sometimes appear on the EDM-insensitive outer cell frequency difference. When this occurred, additional data runs were taken (63 in total) to investigate the source of the anomalous signal. Small, HV-correlated motions of the vapor cells in magnetic field gradients were found be the cause. To reduce the potential feedthrough of the cell motion onto the EDM signal, 32 runs were cut from the EDM data set based on two criteria: \n\\begin{enumerate}\n\\item $|\\Delta\\omega_{OT-OB}| > 2.0 \\sigma$ or $2.0 \\times 10^{-8}$ s$^{-1}$\n\\item $|\\Delta\\omega_{(OT-MT)+(OB-MB)}| > 3.0 \\sigma$ or $1.5 \\times 10^{-8}$ s$^{-1}$ \n\\end{enumerate}\nThe cuts are based only on EDM-insensitive channels (with zero average $\\mathbf{E}$ and no blind offset). The first channel is sensitive to cell motion in a linear field gradient $\\partial B_y/\\partial y.$ The second channel is equivalent to the difference between the average frequencies of the inner and outer cells and can indicate cell motion coupled to the second derivative $\\partial^2B_y/\\partial y^2.$ After the final cuts, our data set consists of 252 runs encompassing $\\sim$65,000 frequency difference measurements to be analyzed for an EDM. The 32 cut runs and 63 auxiliary runs are used to set limits on the systematic error associated with cell motion.\n\n\\begin{table}\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\begin{tabular}{cccc}\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\hline \\hline  \t \t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVoltage & $\\mathbf{B_0}\\cdot \\hat{z}$ & $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{EDM}$ & $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{OT-OB}$ \\\\ \n\\hline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n$\\pm$10 kV & +10 mG & $(1.16\\pm2.6)$ & $(-8.8\\pm9.9)$ \\\\ \n$\\pm$10 kV & -10 mG & $(-3.15\\pm2.8)$ & $(-11.5\\pm10.4)$ \\\\ \n$\\pm$ 6 kV & +10 mG & $(3.69\\pm5.0)$ & $(5.9\\pm16.7)$ \\\\ \n$\\pm$ 6 kV & -10 mG & $(-8.56\\pm4.7)$ & $(-29.1\\pm17.1)$ \\\\ \n\\hline \\hline\n\\end{tabular} \n\\caption{Measured HV-correlated frequency shifts for various field configurations. Entries for $\\Delta\\omega$ are specified in units of $10^{-11}$ (kV$\\cdot$s/cm)$^{-1}$.}\n\\label{Results} \t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\\end{table} \n\nTable \\ref{Results} summarizes the results for each HV value and magnetic field direction. We take the average over the two magnetic field directions for both 10 and 6 kV and then take the inverse error squared weighted average of the 10 and 6 kV results to find our EDM frequency shift $\\eta_{\\mathbf{B}}\\cdot\\Delta\\omega_{EDM} = (-1.34 \\pm 1.67) \\times 10^{-11}$ (kV$\\cdot$s/cm)$^{-1},$ which gives us an EDM of $\\mathbf{d}_{Hg} = (-2.20 \\pm 2.75_{stat}) \\times 10^{-30}$ $e\\cdot$cm.\n\nTable \\ref{Systematics} gives the systematic error budget of our measurements. The dominant contribution comes from the effect of HV-correlated \\textit{Axial Cell Motion.} Detailed maps of the magnetic field gradients at the vapor cells revealed a lab-fixed gradient in $\\mathbf{B_0}$ along the axial magnetic shield direction $\\hat{z}$. Motion of the vessel or the cells along $\\hat{z}$ caused by applying HV would create a non-zero HV-correlated $\\Delta \\omega$ for any pair of cells. Because the field gradient in $\\hat{z}$ does not reverse sign with $\\mathbf{B_0}$, the change in a cell's Larmor frequency under cell motion will change sign as $\\mathbf{B}_0$ is reversed, leading to a HV-correlated frequency difference between cells with the $\\mathbf{E}\\cdot\\mathbf{B}_0$ symmetry properties of an EDM. By comparing the EDM extracted from the 95 excluded (ex.) runs for which $\\Delta \\omega_{OT-OB}$ was large to the reduced EDM data set runs, we find:\n\n", "index": 5, "text": "\\begin{equation} \n\\dfrac{\\eta_{\\mathbf{B}}\\cdot(\\Delta \\omega^{ex.}_{EDM}-\\Delta \\omega_{EDM})}{\\eta_{\\mathbf{B}}\\cdot(\\Delta \\omega^{ex.}_{OT-OB} - \\Delta \\omega_{OT-OB})} = (1.6 \\pm 5.7)\\times 10^{-2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{\\eta_{\\mathbf{B}}\\cdot(\\Delta\\omega^{ex.}_{EDM}-\\Delta\\omega_{EDM})}{%&#10;\\eta_{\\mathbf{B}}\\cdot(\\Delta\\omega^{ex.}_{OT-OB}-\\Delta\\omega_{OT-OB})}=(1.6%&#10;\\pm 5.7)\\times 10^{-2}\" display=\"block\"><mrow><mfrac><mrow><msub><mi>η</mi><mi>𝐁</mi></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>ω</mi><mrow><mi>E</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow><mrow><mi>e</mi><mi>x</mi><mo>.</mo></mrow></msubsup></mrow><mo>-</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mrow><mi>E</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>η</mi><mi>𝐁</mi></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>ω</mi><mrow><mrow><mi>O</mi><mo>⁢</mo><mi>T</mi></mrow><mo>-</mo><mrow><mi>O</mi><mo>⁢</mo><mi>B</mi></mrow></mrow><mrow><mi>e</mi><mi>x</mi><mo>.</mo></mrow></msubsup></mrow><mo>-</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mrow><mrow><mi>O</mi><mo>⁢</mo><mi>T</mi></mrow><mo>-</mo><mrow><mi>O</mi><mo>⁢</mo><mi>B</mi></mrow></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1.6</mn><mo>±</mo><mn>5.7</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>×</mo><msup><mn>10</mn><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mrow></math>", "type": "latex"}]