[{"file": "1601.05739.tex", "nexttext": "\n\nIt is well known that the self-field energy of a charge moving with a uniform velocity is different\nfor different values of the velocity (see e.g., ref.~\\onlinecite{15}). Let us now consider the case of a \nuniform acceleration where $\\dot{\\bf v}_{\\rm o}=\\dot{\\bf v}_{t'}$. Due to the \nacceleration, the velocity changes and from detailed analytical calculations it has indeed been shown \n\\cite{17,18} that for a uniformly accelerated charge, total \nenergy in the fields (i.e., including both the velocity and acceleration field terms from Eq.~(\\ref{eq:1a}) at any \ntime is just equal to the self-energy of a charge moving uniformly with a velocity equal to the \ninstantaneous ``present'' velocity of the accelerated charge (even though the\ndetailed field configurations may differ in the two cases).\nThus when a charge is uniformly accelerated and it gains speed, the energy in it\u0092s self-fields increases. \nFor a uniform acceleration, this contribution to the total\nfield energy of the charge is just sufficient to \nmatch exactly the amount needed for its velocity-dependent self-field energy \nbased on its extrapolated motion at a future time.\nThis is possible because the information about both the velocity and acceleration\nof the charge is present in the field expressions (Eq.~(\\ref{eq:1a})),\nand as long as the charge continues to move with \nacceleration {\\em equal to that at\nthe retarded time} (i.e., a uniform acceleration) \nno mismatch in field energy takes place. However, \na mismatch in the field energy with respect to the\nself-Coulomb field energy of the charge occurs when charge moves\nwith a non-uniform acceleration since there is no information in the\nfield expressions about the rate of change of acceleration of the charge.\nIn that case the ``real'' velocity\nof the charge differs from the extrapolated value obtained from \nthe value of acceleration at the retarded time and the energy in \nthe actual velocity fields no longer agrees with that based on fields determined by the acceleration at the retarded time.\nThen the total field energy does not correspond to that in self-field due to the ``real'' velocity of the charge, and it is this difference in\nthe field energy that could be said to be irretrievably lost into radiation. \n\nFor simplicity we consider here a non-relativistic motion of the charge at some time $t'$, and use the electromagnetic energy-momentum \nin its fields \\cite{29} at time $t_{\\rm o}$ from ${{\\bf v}}$ and $\\dot{{\\bf v}}$. The energy in fields mimics the kinetic energy of \nthe charge (with electric mass of the charge taken as its inertial mass), as long as the acceleration remains uniform. Moreover, \nwhenever there is a change in the acceleration of the charge, fields do not keep pace with the kinetic energy of the charge. \nAnd it is this difference in energy that can be thought as detached from the actual charge motion (as it is not accounted in its self-fields) \nand thus can be thought to have been radiated away. \nTherefore a ``mismatch'' in the electromagnetic field energy and the kinetic energy of the charge would occur if \nthere is a finite rate of change of acceleration $\\ddot{{\\bf v}}$. From this one expects that a direct comparison of the charge motion with \nand without a rate of change of acceleration \nshould be able to yield the excess power going into the fields than what demanded by the actual ``present'' motion of the charge. \nThus by comparing the change in the mechanical power between the two cases (i.e., uniform acceleration and non-uniform \nacceleration cases), one should be able to calculate the excess power going into the fields. Of course in order to relate the mechanical \nto the electromagnetic power, one has to employ the electrical mass $m_{el}=2e^{2}/3r_{\\rm o} c^{2}$ of a charge. \\cite{29,15}\n\nLaws of mechanics determine the actual charge motion at $t_{\\rm o}$ taking $\\ddot{{\\bf v}}$ also into consideration, \n\\begin{eqnarray}\n\\label{eq:41e}\n{\\bf v}_{\\rm o}={\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t')+ \\frac{\\ddot{{\\bf v}}(t_{\\rm o}-t')^2}{2},\n\\end{eqnarray}\n\\begin{eqnarray}\n\\label{eq:41f}\n\\dot{{\\bf v}}_{\\rm o}=\\dot{{\\bf v}}+\\ddot{{\\bf v}} (t_{\\rm o}-t').\n\\end{eqnarray}\nThere is no equivalent provision in the equations of\nelectrodynamics and the fields do not take into consideration any rate of change of acceleration (viz. Eq.~(\\ref{eq:1a})). \nFor a finite $\\ddot{{\\bf v}}$, the velocity (and thereby kinetic energy) of charge at $t_{\\rm o}$\nwill be different, meaning charge would have different kinetic energy than\nwhat went into its electromagnetic fields, the latter not taking $\\ddot{{\\bf v}}$ into account. \n\nThe expression for the kinetic power is, \n\n", "itemtype": "equation", "pos": 9058, "prevtext": "\n\n\n\n\\title{Radiation reaction and radiative losses derived from the kinetic power of the electric inertial mass of a charge} \n\\author{Ashok K. Singal}\n\\email{asingal@prl.res.in}\n\\affiliation{Astronomy and Astrophysics Division, Physical Research Laboratory,\nNavrangpura, Ahmedabad - 380 009, India }\n\\date{\\today}\n\\begin{abstract}\nIt is shown that formulas for radiation reaction and radiative losses from a charge can be derived from the kinetic power of its electric \ninertial mass. \nThe derivation assumes a non-relativistic but otherwise an arbitrary motion of the charge. We exploit the fact that as the charge \nvelocity changes because of a constant acceleration, there are accompanying modifications in its electromagnetic fields \nwhich can remain concurrent with the charge motion because the velocity as well as acceleration information enters into the field expression.  \nHowever, if the acceleration of the charge is varying, information about that being not present in the field expressions, \nthe electromagnetic fields get ``out of step'' with the actual charge motion. Accordingly we arrive at a radiation reaction formula for an \narbitrarily moving charge, obtained hitherto in literature from the self-force, derived in a rather cumbersome way from the \ndetailed mutual interaction between various constituents of a small charged sphere. This way we demonstrate that an irretrievable power \nloss from a charge occurs only when there is a change in its acceleration and the derived instantaneous power loss is directly proportional \nto the scalar product of the velocity and the rate of change of the acceleration of the charge. \n\\end{abstract}\n\\maketitle\n\n\n\\section{Introduction}\nThe radiation reaction, first derived by Lorentz~\\cite{16} from the \nself-force of a small charged sphere, is available in various forms in many text-books. \\cite{1,2,3,25,7,24,20} \nThe radiation reaction has hitherto \nbeen obtained in literature from the self-force of a small charged sphere, evaluated in a rather cumbersome way from the \ndetailed mutual interaction between its constituents. \n\nIn these derivations one usually considers for the charge particle, a classical uniform spherical-shell model \nof radius $r$, which may be made vanishingly small in the limit. One calculates the force \non each infinitesimal element of the charged sphere due to the fields from all its remainder parts, with the \npositions, velocities and accelerations of the latter calculated at the retarded times.\nThen the net force on the charge is calculated by integration over the whole sphere. \nTo make it simple, the force calculations are usually done in the instantaneous rest-frame\nof the charge where it is generally assumed that the motion of the charged \nvaries slowly so that during the light-travel time across the particle, any changes in its\nvelocity, acceleration and other higher time derivatives\nare relatively small. Then one can keep only \nlinear terms ${\\bf v}/c$, $\\dot{\\bf v}r/c^2$, $\\ddot{\\bf v}r^2/c^3$, etc., in the formulation of \nself-force, which turns out to be proportional to the rate of change of acceleration. \nFurther the self-force turns out to be independent of the radius of the small sphere. \nOne obtains the instantaneous radiative power loss formula by a scalar product of the self-force with the velocity of the charge.\n\nMore recently formulas for radiative reaction and radiative power losses have been derived, first time for a ``point charge'', \\cite{31a, 31b}  \nfrom an examination of electromagnetic fields in the neighbourhood of the arbitrarily moving charge, where it was shown that the expression \nfor radiation reaction derived for a point charge is exactly the same as has been obtained for a sphere of vanishingly small radius. \nThe radiative power losses  \nin both cases are proportional to the scalar product of the velocity and the first time derivative of the acceleration of the charge. \n\n\n\\section{Electric inertial mass of a charge}\nFrom the volume integral of momentum density in electromagnetic fields of a charge moving with a non-relativistic {\\em uniform} velocity \n$\\bf v$, one arrives at a momentum $m_{el} {\\bf v}$ with electric mass $m_{el}=4U_{0}/3c^{2}$, \\cite{29} \nwhere $U_{0}=e^2/2rc^2$ is the energy in self-fields of the charge in its rest frame (assuming a uniformly charged spherical shell of radius $r$). \nThis factor of $4/3$ in the inertia of electric mass has long since been highly annoysome, until it was explicitly \nshown that this extra factor in the expression for the total electromagnetic momentum of the charge arises \nbecause of the energy flow associated with the electromagnetic self-repulsion force within the charge constituents. \\cite{15} \nThe net force on one hemisphere of the charge is along the direction of motion, and on the remaining hemisphere it is  \nin a direction opposite to the motion. Therefore as the charge moves, a positive work is being done {\\em on} the forward hemisphere, \nwhile an equal amount of work is being done {\\em by} the backward hemisphere. \nThough there is no net increase in the energy of the total system, but there is a continuous flow of energy across the charged \nsphere between its two halves, implying a corresponding momentum due to this energy-flow. This momentum is \nimportant even for non-relativistic velocities and in fact turns out to be 1/3rd of the otherwise momentum of the charge, \\cite{15} \nthereby explaining this intriguing factor of 4/3 in the total electromagnetic momentum. \nIn fact such contributions to energy-momentum of a charged system occur even in a macroscopic system like a charged capacitor and this fact \nwas shown to provide a correct explanation of the null results of the famous Trouton-Noble experiment. \\cite{58,59}\n\n\n\\section{Energy in the velocity-dependent self-fields of a moving charge}\nThe total energy in electromagnetic fields, including both in velocity and acceleration fields, \nof a uniformly accelerated charge, has been shown to be at any given instant just equal to the \nself-energy of a non-accelerated charge moving \nwith a uniform velocity equal to the instantaneous ``present'' velocity of the accelerated charge at that instant. \\cite{17,18} \nIt is shown that there is no excess energy in fields that could be treated as radiation, over and above\nthat implied from the instantaneous ``present'' velocity of a uniformly accelerated charge. \nThis argument was used to show the absence of radiation for a charge supported in \na gravitational field, \\cite{17,18} in conformity with the strong principle of equivalence.\nIncidentally, Pauli \\cite{33} first drew attention to the fact that in the instantaneous rest-frame of a uniformly accelerated charge, \nmagnetic filed ${\\bf B}=0$ throughout and from this he construed that there is no radiation for such a motion.\n\nThe electromagnetic fields are determined by the position and motion of the charge at the retarded time $t'$. But \nPoynting theorem tells us that the rate of energy loss by charge at present \ntime $t_{\\rm o}=t'+r_{\\rm o}/c$ (and not at retarded time $t'$) is related to the instantaneous outgoing electromagnetic power\n(Poynting flux) at $t_{\\rm o}$ from the spherical surface of radius $r_{\\rm o}$, even though the fields at the surface are determined by the \nmotion of the charge at the retarded time $t'$.\nThis might appear to be a break down of causality, after all,\nhow come the energy-loss rate of the charge at time $t_{\\rm o}$ could be equated to\nthe Poynting flux  determined from the motion of the charge in past, i.e.,\nat an earlier time $t'$? How can one be sure that the charge will not behave\nerratic between $t'$ and $t_{\\rm o}$, thus while keeping the Poynting flux unaffected (which depends upon charge motion at $t'$)\nbut modifying the kinetic power loss rate of the charge?\n\n\n\\section{Derivation of radiative losses of a charge from mechanical considerations of its electric mass}\nActually both the charge motion as well as the electromagnetic fields at the present time $t_{\\rm o}$ are\ndetermined by the charge motion at $t'$. Both make use of the velocity and acceleration of the charge at $t'$, \nand things in mechanics and electrodynamics are such that\nthe power losses at a later time $t_{\\rm o}(>t')$ remain synchronized from both for a uniformly accelerated charge. \\cite{17,18} \nThe charge motion at $t_{\\rm o}$ is determined by laws of mechanics,  \n\\begin{eqnarray}\n\\label{eq:41b}\n{\\bf v}_{\\rm o}={\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t'),\n\\end{eqnarray}\n\\begin{eqnarray}\n\\label{eq:41c}\n\\dot{{\\bf v}}_{\\rm o}=\\dot{{\\bf v}},\n\\end{eqnarray}\nwere ${\\bf v}, \\dot{\\bf v}$ on the right hand side represent respectively the velocity and acceleration \nof the charge at the retarded time $t'$, while ${\\bf v}_{\\rm o}, \\dot{{\\bf v}}_{\\rm o}$ on the left hand side \nrepresent charge motion at the present time $t_{\\rm o}$. \n\nThe electromagnetic field at $t_{\\rm o}$, given by the laws of\nelectrodynamics is also determined by the charge motion (${\\bf v}$ and $\\dot{\\bf v}$) at the retarded time $t'$. \\cite{1,28} \n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:1a}\n{\\bf E}_{\\rm o}=\\left[\\frac{e({\\bf n}-{\\bf v}/c)} {\\gamma ^{2}r^{2}(1-{\\bf n}\\cdot{\\bf v}/c)^{3}} + \n\\frac{e{\\bf n}\\times\\{({\\bf n}-{\\bf v}/c)\\times \\dot{\\bf v}\\}}{rc^2\\:(1-{\\bf n}\\cdot {\\bf v}/c)^{3}}\\right]_{t'},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\bf E}_{\\rm o}=\\left[\\frac{e({\\bf n}-{\\bf v}/c)}{\\gamma^{2}r^{2}(1-{\\bf n}%&#10;\\cdot{\\bf v}/c)^{3}}+\\frac{e{\\bf n}\\times\\{({\\bf n}-{\\bf v}/c)\\times\\dot{\\bf v%&#10;}\\}}{rc^{2}\\&gt;(1-{\\bf n}\\cdot{\\bf v}/c)^{3}}\\right]_{t^{\\prime}},\" display=\"block\"><mrow><mrow><msub><mi>𝐄</mi><mi mathvariant=\"normal\">o</mi></msub><mo>=</mo><msub><mrow><mo>[</mo><mrow><mfrac><mrow><mi>e</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐧</mi><mo>-</mo><mrow><mi>𝐯</mi><mo>/</mo><mi>c</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msup><mi>γ</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mrow><mi>𝐧</mi><mo>⋅</mo><mi>𝐯</mi></mrow><mo>/</mo><mi>c</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mrow></mfrac><mo>+</mo><mfrac><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>𝐧</mi></mrow><mo>×</mo><mrow><mo stretchy=\"false\">{</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝐧</mi><mo>-</mo><mrow><mi>𝐯</mi><mo>/</mo><mi>c</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>×</mo><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover></mrow><mo stretchy=\"false\">}</mo></mrow></mrow><mrow><mi>r</mi><mo>⁢</mo><mpadded width=\"+2.2pt\"><msup><mi>c</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><mrow><mi>𝐧</mi><mo>⋅</mo><mi>𝐯</mi></mrow><mo>/</mo><mi>c</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mrow></mfrac></mrow><mo>]</mo></mrow><msup><mi>t</mi><mo>′</mo></msup></msub></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05739.tex", "nexttext": "\nwhich for a uniform acceleration case ($\\ddot{{\\bf v}}_{\\rm o}=0$) \nfrom Eqs. (\\ref{eq:41b}) and (\\ref{eq:41c}) is,\n\n", "itemtype": "equation", "pos": 13980, "prevtext": "\n\nIt is well known that the self-field energy of a charge moving with a uniform velocity is different\nfor different values of the velocity (see e.g., ref.~\\onlinecite{15}). Let us now consider the case of a \nuniform acceleration where $\\dot{\\bf v}_{\\rm o}=\\dot{\\bf v}_{t'}$. Due to the \nacceleration, the velocity changes and from detailed analytical calculations it has indeed been shown \n\\cite{17,18} that for a uniformly accelerated charge, total \nenergy in the fields (i.e., including both the velocity and acceleration field terms from Eq.~(\\ref{eq:1a}) at any \ntime is just equal to the self-energy of a charge moving uniformly with a velocity equal to the \ninstantaneous ``present'' velocity of the accelerated charge (even though the\ndetailed field configurations may differ in the two cases).\nThus when a charge is uniformly accelerated and it gains speed, the energy in it\u0092s self-fields increases. \nFor a uniform acceleration, this contribution to the total\nfield energy of the charge is just sufficient to \nmatch exactly the amount needed for its velocity-dependent self-field energy \nbased on its extrapolated motion at a future time.\nThis is possible because the information about both the velocity and acceleration\nof the charge is present in the field expressions (Eq.~(\\ref{eq:1a})),\nand as long as the charge continues to move with \nacceleration {\\em equal to that at\nthe retarded time} (i.e., a uniform acceleration) \nno mismatch in field energy takes place. However, \na mismatch in the field energy with respect to the\nself-Coulomb field energy of the charge occurs when charge moves\nwith a non-uniform acceleration since there is no information in the\nfield expressions about the rate of change of acceleration of the charge.\nIn that case the ``real'' velocity\nof the charge differs from the extrapolated value obtained from \nthe value of acceleration at the retarded time and the energy in \nthe actual velocity fields no longer agrees with that based on fields determined by the acceleration at the retarded time.\nThen the total field energy does not correspond to that in self-field due to the ``real'' velocity of the charge, and it is this difference in\nthe field energy that could be said to be irretrievably lost into radiation. \n\nFor simplicity we consider here a non-relativistic motion of the charge at some time $t'$, and use the electromagnetic energy-momentum \nin its fields \\cite{29} at time $t_{\\rm o}$ from ${{\\bf v}}$ and $\\dot{{\\bf v}}$. The energy in fields mimics the kinetic energy of \nthe charge (with electric mass of the charge taken as its inertial mass), as long as the acceleration remains uniform. Moreover, \nwhenever there is a change in the acceleration of the charge, fields do not keep pace with the kinetic energy of the charge. \nAnd it is this difference in energy that can be thought as detached from the actual charge motion (as it is not accounted in its self-fields) \nand thus can be thought to have been radiated away. \nTherefore a ``mismatch'' in the electromagnetic field energy and the kinetic energy of the charge would occur if \nthere is a finite rate of change of acceleration $\\ddot{{\\bf v}}$. From this one expects that a direct comparison of the charge motion with \nand without a rate of change of acceleration \nshould be able to yield the excess power going into the fields than what demanded by the actual ``present'' motion of the charge. \nThus by comparing the change in the mechanical power between the two cases (i.e., uniform acceleration and non-uniform \nacceleration cases), one should be able to calculate the excess power going into the fields. Of course in order to relate the mechanical \nto the electromagnetic power, one has to employ the electrical mass $m_{el}=2e^{2}/3r_{\\rm o} c^{2}$ of a charge. \\cite{29,15}\n\nLaws of mechanics determine the actual charge motion at $t_{\\rm o}$ taking $\\ddot{{\\bf v}}$ also into consideration, \n\\begin{eqnarray}\n\\label{eq:41e}\n{\\bf v}_{\\rm o}={\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t')+ \\frac{\\ddot{{\\bf v}}(t_{\\rm o}-t')^2}{2},\n\\end{eqnarray}\n\\begin{eqnarray}\n\\label{eq:41f}\n\\dot{{\\bf v}}_{\\rm o}=\\dot{{\\bf v}}+\\ddot{{\\bf v}} (t_{\\rm o}-t').\n\\end{eqnarray}\nThere is no equivalent provision in the equations of\nelectrodynamics and the fields do not take into consideration any rate of change of acceleration (viz. Eq.~(\\ref{eq:1a})). \nFor a finite $\\ddot{{\\bf v}}$, the velocity (and thereby kinetic energy) of charge at $t_{\\rm o}$\nwill be different, meaning charge would have different kinetic energy than\nwhat went into its electromagnetic fields, the latter not taking $\\ddot{{\\bf v}}$ into account. \n\nThe expression for the kinetic power is, \n\n", "index": 3, "text": "\\begin{equation}\n\\label{eq:41g0}\nP={\\rm d}(m_{el} {\\bf v}_{\\rm o}^2 /2 )/{\\rm d}t = m_{el} \\dot{{\\bf v}}_{\\rm o} \\cdot {\\bf v}_{\\rm o}. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"P={\\rm d}(m_{el}{\\bf v}_{\\rm o}^{2}/2)/{\\rm d}t=m_{el}\\dot{{\\bf v}}_{\\rm o}%&#10;\\cdot{\\bf v}_{\\rm o}.\" display=\"block\"><mrow><mrow><mi>P</mi><mo>=</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>m</mi><mrow><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msubsup><mi>𝐯</mi><mi mathvariant=\"normal\">o</mi><mn>2</mn></msubsup></mrow><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mi mathvariant=\"normal\">d</mi></mrow><mo>⁢</mo><mi>t</mi></mrow><mo>=</mo><mrow><mrow><msub><mi>m</mi><mrow><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover><mi mathvariant=\"normal\">o</mi></msub></mrow><mo>⋅</mo><msub><mi>𝐯</mi><mi mathvariant=\"normal\">o</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05739.tex", "nexttext": "\nAs we discussed above, for a uniform acceleration case this is also the power going into the changing electromagnetic fields of the charge. \nHowever, the expression for the power going into the kinetic energy of the charge in a non-uniform acceleration case \n($\\ddot{{\\bf v}}_{\\rm o} \\ne 0$), from Eqs.~(\\ref{eq:41e}) and (\\ref{eq:41f}) is,\n\n", "itemtype": "equation", "pos": 14248, "prevtext": "\nwhich for a uniform acceleration case ($\\ddot{{\\bf v}}_{\\rm o}=0$) \nfrom Eqs. (\\ref{eq:41b}) and (\\ref{eq:41c}) is,\n\n", "index": 5, "text": "\\begin{equation}\n\\label{eq:41g1}\nP_1=m_{el}\\dot{{\\bf v}}\\cdot\\bigg[{\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t')\\bigg]. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P_{1}=m_{el}\\dot{{\\bf v}}\\cdot\\bigg{[}{\\bf v}+\\dot{{\\bf v}}(t_{\\rm o}-t^{%&#10;\\prime})\\bigg{]}.\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mn>1</mn></msub><mo>=</mo><mrow><mrow><msub><mi>m</mi><mrow><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover></mrow><mo>⋅</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mi>𝐯</mi><mo>+</mo><mrow><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><msup><mi>t</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05739.tex", "nexttext": "\nBut this is not the power going into the changing electromagnetic fields of the charge, which involves exactly the value of \n$\\dot{{\\bf v}}_{\\rm o}$ at $t'$ and is still $P_1$ as given by Eq.~(\\ref{eq:41g1}), \nThe excess rate of power going into the fields $\\Delta P=P_1-P_2$ then is,\n\\begin{eqnarray}\n\\nonumber\n\\Delta P&=&m_{el}\\dot{{\\bf v}}\\cdot\\bigg[{\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t')\\bigg]-m_{el}\\bigg[\\dot{{\\bf v}}+\\ddot{{\\bf v}}(t_{\\rm o}-t')\\bigg]\\\\\n\\label{eq:41g}\n&&\\cdot\\bigg[{\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t') +  \\frac{\\ddot{{\\bf v}}(t_{\\rm o}-t')^2}{2}\\bigg], \n\\end{eqnarray}\nwhich to lowest order in $t_{\\rm o}-t'$ ($=r_{\\rm o}/c)$ is \n\\begin{eqnarray}\n\\label{eq:41h}\n\\Delta P=-m_{el} \\ddot{{\\bf v}} \\cdot{\\bf v}_{\\rm o} (r_{\\rm o}/c).\n\\end{eqnarray}\nSubstituting for the electric mass of a charge, $m_{el}=2e^2/3r_{\\rm o} c^2$, the excess power in the electromagnetic fields is, \n\\begin{eqnarray}\n\\label{eq:41i}\n\\Delta P= -\\frac{2e^2}{3r_{\\rm o} c^2} \\ddot{{\\bf v}}\\cdot{\\bf v}_{\\rm o}\\frac{r_{\\rm o}}{c}= \\frac{- 2e^2 \\ddot{{\\bf v}}\\cdot{\\bf v}_{\\rm o}}{3c^3}.\n\\end{eqnarray}\nThis is the formula for power losses from a radiating charge. \n\nWe can write this power loss being due to a radiative drag force ${\\bf F}$ as \nthe charge moves with a velocity ${\\bf v}_{\\rm o}$.\n\\begin{eqnarray}\n\\label{eq:41j}\n\\Delta P= -{\\bf F}\\cdot{\\bf v}_{\\rm o}= \\frac{- 2e^2 \\ddot{{\\bf v}}\\cdot{\\bf v}_{\\rm o}}{3c^3}.\n\\end{eqnarray}\nor  \n\\begin{eqnarray}\n\\label{eq:41k}\n\\left[{\\bf F}- \\frac{2e^2 \\ddot{\\bf v}}{3c^3}\\right]\\cdot{\\bf v}_{\\rm o}=0.\n\\end{eqnarray}\nSince in Eq. (\\ref{eq:41k}) ${\\bf v}_{\\rm o}$ is an arbitrary vector, implying that the equation is true for all values \nof ${\\bf v}_{\\rm o}$, we have \n\\begin{eqnarray}\n\\label{eq:41l}\n{\\bf F}= \\frac{2e^2 \\ddot{\\bf v}}{3c^3}.\n\\end{eqnarray}\nThis is the equation of radiative drag force or radiation reaction, derived in literature from the self-force of a charged sphere. \n\nWe have thus derived radiation reaction and the radiative losses from the kinetic power of the electric inertial mass of a charged particle. \nThis novel approach allowed us, in a few simple and easy mathematical steps, to arrive at radiative power-loss formula, \nobtained hitherto in literature from very lengthy and tedious calculations of the self-force of a charged sphere. \nIt demonstrated in a succinct manner the basic soundness of the assertion that the radiation losses result from a non-uniform acceleration \nof the charged system. But even more important, it provides us a totally different physical outlook on the energy-momentum conservation \nrelation between electromagnetic and mechanical phenomena in classical electrodynamics.\n\\section{Conclusions}\nFrom  mechanical considerations of electric inertial mass of a charge  formulas, for radiation reaction and the radiative losses were derived. \nThe derivation made use of the fact that,\n \n1. A moving charge has a electromagnetic field momentum which we can infer from classical mechanics if one uses its electric inertial mass.\n\n2. In the case of a uniformly accelerated charge, its rate of change in kinetic energy is concurrent with the rate of \nchange in its electromagnetic field energy, and is given by the scalar product of its instantaneous velocity with the \nrate of change of its electromagnetic momentum.\n\n3. In the case of a varying acceleration, the energy in the electromagnetic fields changes at a different rate than the rate of \nchange of kinetic energy of the charge and it is this energy difference that is not represented in the actual motion of the charge \nand is thus effectively detached from it can be called as radiated away.\n\nThe accordingly derived instantaneous power loss turns out to be directly proportional \nto the scalar product of the velocity and the rate of change of acceleration of the charge as derived earlier in literature from radiation \nreaction due to the self-force of the charge. \n\n\n\\begin{thebibliography}{}\n\\bibitem{16} H. A. Lorentz, {\\em The theory of electron}, (Teubner, Leipzig, 1909). Reprinted (Dover, New York, 1952).\n\\bibitem{1} J. D. Jackson, {\\em Classical electrodynamics}, 2nd ed. (Wiley, New York, 1975).\n\\bibitem{2} W. K.H . Panofsky and M. Phillips, {\\em Classical electricity and magnetism}, 2nd ed. \n(Addison-Wesley, Massachusetts, 1962).\n\\bibitem{3} W. Heitler, {\\em The quantum theory of radiation} (Oxford, Clarendon, 1954).\n\\bibitem{25} D. J. Griffith, {\\em Introduction to electrodynamics}, 3rd ed. (Prentice, New Jersey, 1999).\n\\bibitem{7} G. A. Schott, {\\em Electromagnetic radiation} (Univ. Press, Cambridge, 1912).\n\\bibitem{24} L. Page and N. I. Adams, Jr., {\\em Electrodynamics} (D. Van Nostrand, New York, 1940).\n\\bibitem{20} A. D. Yaghjian, {\\em Relativistic Dynamics of a charged sphere}, 2nd ed. (Springer, New York, 2006).\n\\bibitem{31a} A. K. Singal, Poynting flux in the neighborhood of a point charge in arbitrary motion and the radiative power loss, \narXiv:1505.01737v2 (2015).\n\\bibitem{31b}  A. K. Singal, Radiation reaction from electromagnetic fields in the neighborhood of a point charge, arXiv:1507.08580v2 (2015).\n\\bibitem{29}  R. P. Feynman,  R. B. Leighton R B and M. Sands {\\em The Feynman lectures on physics}, \nVol. II (Addison-Wesley, Mass, 1964).\n\\bibitem{15} A. K. Singal, Energy-momentum of the self-fields of a moving charge in classical electromagnetism, J. Phys. A \n{25} 1605-1620 (1992).\n\\bibitem{58} A. K. Singal, On the ``explanation'' of the null results of Trouton-Noble experiment, Am. J. Phys. {61}, 428-433 (1993).\n\\bibitem{59} F. T. Trouton and H. R. Noble, The mechanical forces acting on a charged electric condenser moving through space, \nPhil. Trans. Roy. Soc. London A {202}, 165-181 (1903).\n\\bibitem{17} A. K. Singal, The equivalence principle and an electric charge in a gravitational field,\n Gen. Rel. Grav. {27}, 953-967 (1995).\n\\bibitem{18} A. K. Singal, The equivalence principle and an electric charge in \na gravitational field II. A uniformly accelerated charge does not radiate,  Gen. Rel. Grav. {29}, 1371-1390 (1997).\n\\bibitem{33} W. Pauli, Relativitatstheorie in {\\em Encyklopadie der Matematischen Wissenschaften}, V 19 (Teubner, Leipzig, 1921).\nTranslated as {\\em Theory of relativity} (Pergamon, London, 1958).\n\\bibitem{28} A. K. Singal, A first principles derivation of the electromagnetic fields of a point \ncharge in arbitrary motion, Am. J. Phys. {70}, 1036-1041 (2011).\n\\end{thebibliography}{}\n\n", "itemtype": "equation", "pos": 14717, "prevtext": "\nAs we discussed above, for a uniform acceleration case this is also the power going into the changing electromagnetic fields of the charge. \nHowever, the expression for the power going into the kinetic energy of the charge in a non-uniform acceleration case \n($\\ddot{{\\bf v}}_{\\rm o} \\ne 0$), from Eqs.~(\\ref{eq:41e}) and (\\ref{eq:41f}) is,\n\n", "index": 7, "text": "\\begin{equation}\n\\label{eq:41g2}\nP_2=m_{el}\\bigg[\\dot{{\\bf v}}+\\ddot{{\\bf v}}(t_{\\rm o}-t')\\bigg]\n\\cdot\\bigg[{\\bf v}+ \\dot{{\\bf v}} (t_{\\rm o}-t') +  \\frac{\\ddot{{\\bf v}}(t_{\\rm o}-t')^2}{2}\\bigg].\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P_{2}=m_{el}\\bigg{[}\\dot{{\\bf v}}+\\ddot{{\\bf v}}(t_{\\rm o}-t^{\\prime})\\bigg{]}%&#10;\\cdot\\bigg{[}{\\bf v}+\\dot{{\\bf v}}(t_{\\rm o}-t^{\\prime})+\\frac{\\ddot{{\\bf v}}(%&#10;t_{\\rm o}-t^{\\prime})^{2}}{2}\\bigg{]}.\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mn>2</mn></msub><mo>=</mo><mrow><mrow><msub><mi>m</mi><mrow><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover><mo>+</mo><mrow><mover accent=\"true\"><mi>𝐯</mi><mo>¨</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><msup><mi>t</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow></mrow><mo>⋅</mo><mrow><mo maxsize=\"210%\" minsize=\"210%\">[</mo><mrow><mi>𝐯</mi><mo>+</mo><mrow><mover accent=\"true\"><mi>𝐯</mi><mo>˙</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><msup><mi>t</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mfrac><mrow><mover accent=\"true\"><mi>𝐯</mi><mo>¨</mo></mover><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mi mathvariant=\"normal\">o</mi></msub><mo>-</mo><msup><mi>t</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mn>2</mn></mfrac></mrow><mo maxsize=\"210%\" minsize=\"210%\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]