[{"file": "1601.07062.tex", "nexttext": "\n\nAdditionally, the resulting p-values were compared\nwith those obtained from a standard single-SNP GWAS for the same traits\non the same population. Drawing inspiration from the concept of\nnon-inferiority trials \\cite{agostino2002}, the false discovery\nrate (FDR) was computed for both sets of p-values and tested for\nequivalence. The null hypothesis was that the FDR was actually larger\nfor ROH than in GWAS:\n\n", "itemtype": "equation", "pos": 11014, "prevtext": "\n\n\\title{{   Using runs of homozygosity to detect genomic regions associated with   susceptibility to infectious and metabolic diseases in dairy cows   under intensive farming conditions }}\n\\titlerunning{{   Using runs of homozygosity to detect genomic regions associated with   susceptibility to infectious and metabolic diseases in dairy cows   under intensive farming conditions }}\n\\author{\n  Filippo Biscarini\\inst{1},\n  Stefano Biffani\\inst{2},\n  Nicola Morandi\\inst{1},\n  Ezequiel L. Nicolazzi\\inst{1} \\and\n  Alessandra Stella\\inst{2}\n}\n\n\\authorrunning{Biscarini \\textit{et al.}}\n\n\\institute{\nDepartment of Bioinformatics, Parco Tecnologico Padano, Lodi, Italy,\n\\email{\\{filippo.biscarini,nicola.morandi,ezequiel.nicolazzi\\}@tecnoparco.org}\n\\and\nIBBA-CNR, Lodi, Italy,\n\\email{\\{biffani,stella\\}.ibba.cnr.it}\n}\n\n\\maketitle\n\n\\begin{abstract}\nRuns of homozygosity (ROH) are contiguous stretches of homozygous genome\nwhich likely reflect transmission from common ancestors and can be used\nto track the inheritance of haplotypes of interest. In the present\npaper, ROH were extracted from 50K SNPs and used to detect regions of\nthe genome associated with susceptibility to diseases in a population of\n468 Holstein-Frisian cows. Diagnosed diseases were categorised as\ninfectious diseases, metabolic syndromes, mastitis, reproductive\ndiseases and locomotive disorders. ROH associated with infectious\ndiseases, mastitis and locomotive disorders were found on BTA 12. A long\nregion of homozygosity linked with metabolic syndromes, infectious and\nreproductive diseases was detected on BTA 15, disclosing complex\nrelationships between immunity, metabolism and functional disorders. ROH\nassociated with infectious and reproductive diseases, mastitis and\nmetabolic syndromes were observed on chromosomes 3, 5, 7, 13 and 18.\nPrevious studies reported QTLs for milk production traits on all of\nthese regions, thus substantiating the known negative relationship\nbetween selection for milk production and health in dairy cattle.\n\\end{abstract}\n\n\\keywords{runs of homozygosity (ROH), disease susceptibility, dairy cattle, genetic associations}\n\n\n\n\\section*{Introduction}\n\n\n\nIn dairy cattle intensive farming, diseases are certainly a major\nconcern. They reduce animal welfare, entail considerable direct\ntreatment costs, decrease milk production, may cause mortality and\npresent biosafety risks related to veterinary drugs (e.g. antibiotics)\nresidues in milk and the possible transmission to humans (zoonoses, e.g.\ntuberculosis). \nInfectious (e.g. infectious mastitis) and metabolic (e.g. ketosis)\ndiseases comprise most of the diseases observed in dairy cattle. \n\nA strategy to reduce the incidence of diseases and improve the health\nstatus of the herd could be to genetically enhance the resistance to\ndiseases. This could address both resistance to specific diseases and a\ngeneral improvement of the immune system of the animals ($\\sim$ ``robustness\nof dairy cows'' \\cite{tenNapel2009}).\n\nThe identification of genomic regions associated with the susceptibility\nto diseases is an important preliminary step towards implementing\nbreeding strategies aimed at improving dairy cattle health. This is now\nmade possible by the use of data obtained through next generation\ngenotyping and sequencing technologies (e.g. SNP chips, whole-genome\nsequences). \nGenome-wide association studies (GWAS) are commonly used to scan the\ngenome in search of polymorphisms associated with the analyzed\nphenotype. However, GWAS methods typically analyse one locus at a time,\nare prone to spurious associations and, but for clear signals, are not\nalways of straightforward interpretation (e.g. \\cite{McCarthy2008}).\n\nRuns of homozygosity (ROH, \\cite{McQuillan2008}) may be an alternative\napproach to genome-wide scans for signals of genotype-phenotype\nassociation. Runs of homozygosity are contiguous stretches of homozygous\ngenome which likely reflect transmission from a common ancestor, and can\ntherefore be considered as being IBD (identical by descent). ROH have\nbeen used to estimate inbreeding both in humans \\cite{McQuillan2008}\nand cattle \\cite{ferencakovic2011, purfield2012, kim2013}. Hildebrandt\net al. \\cite{hildebrandt2009} applied \na similar concept to map recessive disease genes in human populations,\nand Biscarini et al. \\cite{biscarini2013} used ROH to look for the\ncausal mutations for arthrogryposis and macroglossia in Piedmontese\ncattle.\n\nHypothesizing that genetic variants associated with increased risk of\ndisease are more likely to be recessive than dominant (see Hildebrandt\net al. for human diseases \\cite{hildebrandt2009}), looking for associations with\nhomozygous segments of the genome appears to be a reasonable strategy.\nIn this study, ROH were used to detect genomic regions associated with\nsusceptibility to 5 categories of diseases (infectious, metabolic and\nreproductive diseases, mastitis and locomotive disorders) in dairy\ncattle.\n\n\\section*{Material \\& Methods}\n\n{\\smallskip\\noindent\\textbf{{Available data}}~}\n\nA population of 468 Holstein-Frisian cows between the first and fifth\nlactation distributed over 4 herds (Table~\\ref{tab:population} from the Po Valley region\nin Northern Italy was analysed. All cows were farmed under intensive\nconditions (use of concentrate feeds, no pasture, indoor housing) in\nhigh-yielding dairy farms and were genotyped with the Illumina BovineSNP\n50 beadchip version 2 (50k), based on the UMD 3.1 assembly of the \\emph{Bos\ntaurus} genome.\n\n\\begin{table}[h!]\n\\centering\n\\caption{Population size after data editing. On the first row, per herd and total number of cows. Rows 2-6\n  show n. of cases for each disease category$^1$. Disease category\n  may overlap (e.g. infectious mastitis is both infectious disease and\n  mastitis).}\n      \\begin{tabular}{cccccc}\n        \\hline\n         & herd1& herd2 & herd3 & herd4 & total\\\\\n        \\hline\n         COWS & 155 & 88 & 148 & 67 & 458\\\\\n         INFD & 77 & 29 & 60 & 20 & 189\\\\\n         METD & 62 & 10 & 68 & 10 & 152\\\\\n         MAST & 46 & 13 & 44 & 13 & 117\\\\\n         REPRD & 65 & 16 & 62 & 17 & 163\\\\\n         LOCD & 21 & 6 & 33 & 13 & 74\\\\\n         \\hline\n      \\end{tabular}\n      \n      \\begin{tablenotes}\n      \\small\n      \\item $^1$INFD: infectious\n    diseases; METD: metabolic diseases; MAST: mastitis; REPRD:\n    reproductive diseases; LOCD: locomotive disorders.\n    \\end{tablenotes}\n     \n      \\label{tab:population}\n\\end{table}\n\nGenotypic data were edited for individual and SNP\ncall rate ($>90\\%$). Unmapped SNPs were removed, while those on the sex\nchromosome were used. This left 458 cows and 53457 SNPs available for\nthe analysis.\nPhenotype recording was carried out by veterinary practitioners within\nthe framework of the regional project Prozoo \\cite{williams2011,\nbiscarini2012}: diagnosis, onset and treatment for each disease\nwere recorded. Given the limited number of cases for each specific\ndisease, diseases were grouped together in five homogeneous categories\nin order to increase the statistical power of the analysis: infectious\ndiseases, metabolic syndromes, reproductive diseases, mastitis and\nlocomotive disorders. Categories were partially overlapping (for\ninstance, infectious mastitis was classified both as mastitis and\ninfectious disease). Table~\\ref{tab:diseases} reports the classification of diagnosed\ndiseases into the above mentioned categories. There were 189, 152, 117,\n163 and 74 cases respectively for infectious diseases, metabolic\nsyndromes, mastitis, reproductive diseases and locomotive disorders. For\neach analysis, all animals not in the disease group were used as\ncontrols (e.g. for infectious diseases there were 189 cases and 458 -\n189 = 269 controls).\n\n\\begin{table}[h!]\n\\centering\n\\caption{List of diagnosed diseases falling in each of five\n(partially overlapping) categories: infectious, metabolic\nreproductive, locomotive diseases and mastitis.}\n      \\begin{tabular}{p{4cm} | p{6cm}}\n        \\hline\n        \\emph{Disease category} & \\emph{Included diseases}\\\\\n        \\hline\n          Infectious diseases & mastitis, peritonitis, enteritis,\n          traumatic reticuloperitonitis, digital dermatitis,\n          interdigital dermatitis, foot rot, laminitis, pyometra,\n          metritis, endometritis, clostridiosis\\\\\n        \\hline\n        Metabolic syndromes & milk fever, ovarian cysts, persistent\n        corpus luteum, ruminal atony, displaced abomasum, indigestion,\n        mesenteric torsion, volvulus, ketosis, steatosis\\\\\n        \\hline\n        Reproductive diseases & retained placenta, dystocia, ovarian\n        cysts, hypoplastic ovaries, hypotrophic ovaries, persistent\n        corpus luteum, abortion, embryo resorption, metritis, mummified\n        fetus, stillbirth, endometritis, parauterine abscess, pyometra\\\\\n        \\hline\n        Mastitis & mastitis, teat obstruction, teat lesions\\\\\n        \\hline\n        Locomotive disorders & digital dermatitis, interdigital\n        dermatitis, sole ulcer, foot rot, white line disease, laminitis,\n        tyloma, carpal arthritis, femoral fracture\\\\\n        \\hline\n      \\end{tabular}\n      \n      \\label{tab:diseases}\n\\end{table}\n\n\n{\\smallskip\\noindent\\textbf{{Runs of homozygosity.}}~}\n\nUnder the hypothesis that complex diseases have a genetic component made\nup of several recessive variants distributed throughout the genome, each\nwith a small effect \\cite{McQuillan2008}, runs of homozygosity (ROH)\nwere applied to detect genetic regions associated with susceptibility to\ndiseases. Single-SNP GWAS, which compares allele frequency at each\nlocus, would in fact detect also an excess of dominant alleles. ROH are\ndefined in diploid organisms as contiguous stretches of homozygous\ngenotypes, which reflect transmission of identical haplotypes from\ncommon ancestors. Instead of focusing on a single locus, ROH consider\nalso the surrounding regions, thus accounting for the hitch-hiking\neffect (neighbouring SNPs changing frequency together with a selected\nlocus with which they are in strong linkage disequilibrium;\n\\cite{barton2000}). The observed homozygosity was therefore estimated at each SNP\nlocus and averaged along a sliding window spanning 1000 kbps and\nprogressing SNP by SNP. A maximum of 5 missing genotypes and 1\nheterozygous genotypes were permitted for a contiguous stretch of DNA to\nbe considered a ROH. \n\nROH are basically a model-free statistical\ntechnique. Unlike classic GWAS, there is no direct modeling of the\nphenotype of interest nor a straightforward way to test for the strength\nof detected associations. However, approaches can be conceived to assess\nthe significance of the detected signals. In this experimental\napplication of ROH to association studies, the significance of\nphenotype/genotype associations was tested by looking at the difference\nin homozygosity between cases and controls. The average homozygosity at\neach SNP locus within the ROH was computed for cases and controls\nseparately, and the significance of the difference tested through a\none-tailed t-test: \n\n", "index": 1, "text": "\n\\[ \n\\left\\{\n\\begin{array}{l}\n  H_0:\\mu_{cases}=\\mu_{controls}\\\\ \n  H_1:\\mu_{cases}>\\mu_{controls}\n\\end{array}\n\\right.\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\left\\{\\begin{array}[]{l}H_{0}:\\mu_{cases}=\\mu_{controls}\\\\&#10;H_{1}:\\mu_{cases}&gt;\\mu_{controls}\\end{array}\\right.\" display=\"block\"><mrow><mo>{</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>:</mo><mrow><msub><mi>μ</mi><mrow><mi>c</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>=</mo><msub><mi>μ</mi><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><msub><mi>H</mi><mn>1</mn></msub><mo>:</mo><mrow><msub><mi>μ</mi><mrow><mi>c</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>&gt;</mo><msub><mi>μ</mi><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow></mrow></mtd></mtr></mtable><mi/></mrow></math>", "type": "latex"}, {"file": "1601.07062.tex", "nexttext": "\n\nwhere \\emph{M} is a tolerance margin for the difference. This states that ROH are inferior to\nGWAS. The alternative hypothesis was that the FDR was not different under both\nmethods:\n\n", "itemtype": "equation", "pos": 11545, "prevtext": "\n\nAdditionally, the resulting p-values were compared\nwith those obtained from a standard single-SNP GWAS for the same traits\non the same population. Drawing inspiration from the concept of\nnon-inferiority trials \\cite{agostino2002}, the false discovery\nrate (FDR) was computed for both sets of p-values and tested for\nequivalence. The null hypothesis was that the FDR was actually larger\nfor ROH than in GWAS:\n\n", "index": 3, "text": "\n\\[\nH_0:FDR_{ROH} - FDR_{GWAS} > M\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"H_{0}:FDR_{ROH}-FDR_{GWAS}&gt;M\" display=\"block\"><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>:</mo><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><msub><mi>R</mi><mrow><mi>R</mi><mo>⁢</mo><mi>O</mi><mo>⁢</mo><mi>H</mi></mrow></msub></mrow><mo>-</mo><mrow><mi>F</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><msub><mi>R</mi><mrow><mi>G</mi><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mi>S</mi></mrow></msub></mrow></mrow><mo>&gt;</mo><mi>M</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07062.tex", "nexttext": "\n\nwhich implies that ROH are not inferior to GWAS. Non-inferiority was tested for the\n5 traits analysed (infectious, metabolic, reproductive, locomotion\ndiseases and mastitis) with a tolerance margin $M = 0.01$. In all cases\n$H_0$ was rejected, indicating that the ROH approach was not inferior to\nstandard GWAS (average p-value: $2.27 \\cdot 10^{-6}$). \n\n\n{\\smallskip\\noindent\\textbf{{Software}}~}\n\nThe software PLINK v1.07 \\cite{purcell2007} was used for the analysis. No restriction on the minimum\nnumber of SNPs in a ROH was applied, and the default (1000 kbps) maximum\ngap between consecutive SNPs was used, in order to account for the lower\nSNP density in the 50k SNP chip compared to the HD ($\\sim777k$) SNP chip.\nData preparation, heritability estimates, graphical plots and\npost-processing analyses were produced within the open source\nprogramming environment R \\cite{R2013}.\n\n\\section*{Results \\& Discussion}\n\nA total of 1273 distinct ROH were detected: this number comprised all\nROH found with the chosen parameters, irrespective of whether they were\nfound in all cows or a subset of them. The average ROH length was 285.7\nkbps. In principle, stretches of homozygous DNA can appear in all\nanimals, regardless of their health status; those associated with\nsusceptibility to disease are however supposed to be more frequent in\ncases than in controls. Therefore, the longest ROH (less likely to be\ndue to chance) which were most frequent in cases were retained as\nresults of interest and are reported in Table~\\ref{tab:associations}. These include 17 ROH\nfor infectious diseases, 10 for reproductive diseases, 7 for metabolic\nsyndromes and 4 for mastitis and locomotive disorders. For the 42\nreported ROH, the frequency in cases relative to controls varied from\n$51.4\\%$ to $100\\%$; their average p-value and FDR were $0.398$ and $0.612$,\nrespectively. ROH in Table 3 were not always observed in all cases and\ncontrols: the number of cows (cases + controls) involved ranged from 124\nfor infectious and metabolic disease to 56 for reproductive diseases. An\nimportant issue in association studies is the expected statistical power\nof the analysis. This is known to depend on sample size, the\nheritability of the trait and linkage disequilibrium (LD) between\nmarkers and QTLs \\cite{luo1998}. Heritabilities for the diseases traits\nincluded in this study were estimated with a sire threshold model for\nbinary traits fitting a random sire effect and different sets of\nsystematic effects ($herd, herd + calving\\_month, herd + calving\\_month +\nage$). Heritability was not always estimable for all traits and models;\nwhen estimable, it ranged between 0.05 and 0.10 (in line with literature\nvalues: e.g. \\cite{cole2013}). The average LD between adjacent markers\nin the available Holstein-Frisian population was estimated as $r^2=0.23$.\nWith 458 individuals, the power to detect a QTL explaining $1\\%$ of the\nphenotypic variance would be therefore about $18\\%$.\n \nIn the next section a few results of interest are described. The reader is warned\nthat, given the low power of the study and the high FDR for\nall reported associations, this mostly has only speculative value. It is\nhowever indicative of the output obtained from a ROH analysis.\n\n\\begin{table}[h!]\n\\centering\n\\caption{Most relevant runs of homozygosity (ROH) associated with the five disease categories considered in the\nanalysis. For each ROH, the chromosome (BTA), start and end position and number of SNPs included are reported. In\nthe reported ROH the percentage of cases on total number of haplotypes ranged between $51.4\\%$ and $100\\%$.}\n      \\begin{tabular}{lrrrrl}\n        \\hline\n          \\emph{Disease category} & \\emph{BTA} & \\emph{start bps} & \\emph{end bps} & \\emph{\\# SNPs} &\n          \\emph{Production QTLs $^1$}\\\\\n        \\hline\n         Infectious & 7 & 2991449 & 4655753 &47 & \\\\\n         Infectious &7 &19163934 &19461567 &6 &FY, NM\\\\\n         Infectious &7 &21704630 &22305419 &13 &FY, NM\\\\\n         Infectious &7 &23756162 &24014128 &6 &FY, NM\\\\\n         Infectious &7 &24233634 &24330857 &3 &FY, NM, PY\\\\\n         Infectious &7 &106927241 &107452906 &12 &NM\\\\\n         Infectious &7 &108575314 &108685133 &3 &NM\\\\\n         Infectious &11 &45688827 &51041758 &117&\\\\ \n         Infectious &12 &11414743 &13005009 &43&\\\\\n         Infectious &12 &25878820 &30099199 &84&\\\\ \n         Infectious &12 &51834816 &52573538 &21&\\\\\n         Infectious &12 &53241975 &53428996 &6&\\\\\n         Infectious &15 &40889434 &41169953 &4&\\\\\n         Infectious &15 &41780731 &41971248 &7&\\\\\n         Infectious &15 &42715966 &42758371 &2&\\\\\n         Infectious &24 &16012254 &16274083 &8&\\\\\n         Infectious &28 &30070377 &30158724 &2&\\\\\n         Metabolic &3 &1737421 &6813316 &103&MY, FP\\\\ \n         Metabolic &4 &12868626 &13148484 &4&\\\\\n         Metabolic &8 &8082781 &9666303 &37&\\\\\n         Metabolic &15 &37893014 &39016114 &22&\\\\\n         Metabolic &15 &40889434 &41169953 &4&\\\\\n         Metabolic &15 &41780731 &41971248 &7&\\\\\n         Metabolic &15 &42715966 &42758371 &2&\\\\ \n         Mastitis &12 &25878820 &30099199 &84&\\\\\n         Mastitis &13 &19816277 &20687500& 22& MY, FY\\\\\n         Mastitis &24 &16012254 &16274083 &8&\\\\\n         Mastitis &28 &30070377 &30158724 &2&\\\\\n         Reproduction &4 &8779979 &10737673 &40&\\\\\n         Reproduction &4 &12868626 &13148484 &4&\\\\\n         Reproduction &5 &6656617 &6976839 &11 &FY, PY\\\\\n         Reproduction &5 &7832521 &8063248 &9 &FY, PY\\\\\n         Reproduction &15 &40889434 &41169953 &4&\\\\\n         Reproduction &15 &41780731 &41971248 &7&\\\\\n         Reproduction &15 &42715966 &42758371 &2&\\\\\n         Reproduction &18 &23224334 &23253048 &2&MY, FP\\\\ \n         Reproduction &20 &19587484 &19757303 &3&\\\\\n         Reproduction &25 &30824927 &31525961 &27&\\\\\n         Locomotion &6 &107186270 &107835731 &11&\\\\\n         Locomotion &9 &78576880 &79887463 &14&\\\\\n         Locomotion &12 &11414743 &13005009 &43&\\\\\n         Locomotion &28 &30070377 &30158724& 2&\\\\\n         \\hline\n      \\end{tabular}\n      \n      \\begin{tablenotes}\n      \\small\n      \\item $^1$QTLs for milk production traits from previous GWAS studies: FY=fat yield, NM=net merit, PY=protein yield,\nMY=milk yield, FP=fat percentage (Cole et al., 2011; Minozzi et al.,\n2013).\n    \\end{tablenotes}\n      \\label{tab:associations}\n\\end{table}\n\n\n{\\smallskip\\noindent\\textbf{{Regions associated with disease susceptibility}}~}\n\nThe longest ROH (117 SNPs, $\\sim5.3$ Mbps) was found on BTA 11 and was\nassociated with infectious diseases. On BTA 12, three distinct regions\n(\\SI{11414743} - \\SI{13050009} bps; \\SI{25878820} - \\SI{30099199} bps; \\SI{51834816} -\n\\SI{53428996} bps) were associated with infectious diseases. The first two\nof these regions were also found in cows with, respectively, locomotive\ndisorders and mastitis. Both conditions often have a microbial etiology\n(e.g. infectious mastitis, foot rot). Interestingly, the ROH region at\n$\\sim12$ Mbps on BTA 12 contains the VWA8 gene (von Willebrand factor A\ndomain), whose mutations might be implied in coagulation abnormalities\n\\cite{sullivan1994} and may be related with musculoskeletal disorders.\nTwo other regions linked with both infectious diseases and mastitis were\nfound on BTA 24 and BTA 28. On BTA 28 Kolbehdari et al.\n\\cite{kolbehdari2008} found polymorphisms (\\SI{28149059} bps and \\SI{24423785}\nbps) associated with the conformation of the mammary system and\nangularity, which might be related to the occurrence of mastitis. A poor\nconformation of the udder may be a predisposing factor for mastitis, as\nwell as intensive selection for dairy type. The ROH on BTA 28 was found\nto be associated also with locomotive disorders, pointing at possible\ndetrimental effects of selection for dairy type on locomotion. \nHomozygous haplotypes linked with locomotive disorders were detected\nalso on BTA 6 between \\SI{107186270} and \\SI{107835761} bps; Kolbehdari et al.\n\\cite{kolbehdari2008} reported a nearby association with overall rump conformation,\nwhich can be related to locomotion anomalies. Upstream along BTA 6 the\ncasein ($\\alpha$-s1, $\\alpha$-s2, $\\beta$ and $\\kappa$) loci are located which could\nhint at a link between selection for casein variants and general\nfunctionality of the animals.\\\\\nIn some cases, consecutive ROH are quite\nclose together (e.g. BTA 7 and BTA 15) which might reflect the existence\nof a founder allele broken down by recombination over generations. The\nparameters for ROH detection (consecutive SNP gap $>$ 1Mbps, more missing\nor heterozygous SNPs) may also play a role, though. \nFigure~\\ref{fig:roh} shows the\naverage observed heterozygosity in cases and controls for reproductive\ndiseases along BTA 15: ROH are visible as regions of low heterozygosity\n(and conversely high homozygosity) in cases (black line) as compared to\ncontrols (grey line). ROH associated with impaired reproductive function\nwere found on chromosomes 4, 8, and 18, where other studies detected\nassociations with calving ease \\cite{kolbehdari2008}, calving\ninterval \\cite{minozzi2013} and type traits like body depth, rump width,\nstature and strength \\cite{cole2009}.\\\\\nIn this study we identified\ngenetic associations with infectious diseases, mastitis, metabolic\nsyndromes and reproductive diseases on chromosomes 3, 5, 7, 13 and 18\nwhere earlier works reported QTLs for milk production traits\n\\cite{cole2011, minozzi2013}: this confirms the known negative\nrelationship between strong selection for milk production and the health\nof the animals. Negative genetic correlations between milk production\nand disease resistance in Holstein (e.g. \\cite{hansen2002}) and dairy\ncattle in general (Norwegian Red, \\cite{simianer1991} were estimated.\nThough negative, such correlations are larger than -1; this implies that\nalleles at polymorphic loci with positive effects on both\ncharacteristics (or positive effects on production and neutral effect on\nhealth) can be found (see for instance Pimentel et al.\n\\cite{pimentel2010} for fertility and production). \n\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[width=0.9\\textwidth]{RIP_ROH15bw.png}\n\\caption{Observed heterozygosity in cases (black line) and controls (grey line) for reproductive diseases along chromosome 15.}\n\\label{fig:roh}\n\\end{figure}\n\n\\section*{Conclusions}\n\nScanning the genome for runs of homozygosity provides a valid alternative to GWAS studies\nfor the genetic dissection of complex disease traits and for detecting\nsuch variants with beneficial effects on both production and the health\nof the animals. Results could be used in breeding programs aimed at\nimproving milk production while enhancing the resistance to diseases at\nthe same time. Emphasis in selection objectives could be more strongly\nplaced on functional rather than productive traits, thus improving\nfunctionality while not completely neglecting production, thanks to\nresidual positive correlations. Alternatively, haplotypes favorably\nlinked to either production, functionality or both could be used to\nidentify carrier animals to breed next generation, in a sort of\n``haplotype selection''. Several aspects of the use of ROH in association studies still need to\nbe investigated, though. Examples are: the construction of significance\ntests (e.g. here the difference in homozygosity between cases and\ncontrols was tested; however, the differential frequency of ROH could be\ntested instead); the issue of multiple testing (e.g. permute cases and\ncontrols so to create a distribution of ROH under the hypothesis of no\nassociation); accounting for systematic effects (e.g. using residuals\ninstead of the original observations, or performing the ROH analysis\nwithin class of effects); accounting for selection bias due to culling\nof animals for health or productive reasons (e.g. ROH analysis within\nparity/age class, or application of survival analysis). This promises to\nbe an exciting area of research: hopefully, this communication might\nserve of inspiration.\n\n\\section*{Acknowledgments}\n\nThe results presented in this paper were produced within the framework\nof the project \"ProZoo\" (www.tecnoparco.org/prozoo), financed by\n\"Regione Lombardia\", \"Fondazione Cariplo\" and \"Fondazione Banca Popolare\ndi Lodi\". This research was also supported by the Marie Curie European\nReintegration Grant \"NEUTRADAPT\" and the \"Gene2Farm\" project within the\n7th European Community Framework Programme, and by the Italian national\nproject \"InterOmics\" (www.interomics.eu).\n\n\n\n\n\\begin{thebibliography}{10}\n\\bibitem{tenNapel2009}\nJ. ten Napel, M.P.L. Calus, H.A. Mulder and R.F. Veerkamp.\n\\newblock Genomic concepts to improve robustness of dairy cows.\n\\newblock {\\em EAAP publication}, 126:35--43, 2009.\n\n\\bibitem{McCarthy2008}\nM.I. McCarthy, G.R. Abecasis, L.R. Cardon, D.B. Goldstein, J. Little,\nJ.P.A. Ioannidis and J.N. Hirschorn.\n\\newblock Genomic concepts to improve robustness of dairy cows.\n\\newblock {\\em Nat. Rev. Genet.}, 9(5):356--369, 2008.\n\n\\bibitem{McQuillan2008}\nR. McQuillan, A.L. Leutenegger, R. Abdel-Rahman, C.S. Franklin, M.\nPericic, L. Barac-Lauc, N. Smolej-Narancic, B. Janicijevic, O. Polasek,\nA. Tenesa, A. MacLeod, S.M. Farrington, P. Rudan, C. Hayward, V. Vitart,\nI. Rudan, S. Wild, M. Dunlop, A. Wright, H. Campbell and J. Wilson.\n\\newblock Runs of homozygosity in European populations.\n\\newblock {\\em Am. J. Hum. Genet.}, 83:359--372, 2008.\n\n\\bibitem{ferencakovic2011}\nM. Feren\\v{c}akovi\\'{c}, E. Hamzic, B. Gredler, I. Curik and J. S\\\"{o}lkner.\n\\newblock Runs of homozygosity reveal genome-wide autozygosity in the\nAustrian Fleckvieh cattle.\n\\newblock {\\em Agric. Consp. Sci.}, 76(4), 2011.\n\n\\bibitem{kim2013}\nE.S. Kim, J.B. Cole, H. Huso, G.R. Wiggans, C.P. Van Tassell, B.A. Crooker, G. Liu, Y. Da and T.S. Sonstegard.\n\\newblock Effect of artifical selection on runs of homozygosity in U.S.\nHolstein cattle.\n\\newblock {\\em PLoS One}, 8(11):e80813, 2013.\n\n\\bibitem{purfield2012}\nD.C. Purfield, D.P. Berry, S. McParland and D.G. Bradely.\n\\newblock Runs of homozygosity and population history in cattle.\n\\newblock {\\em BMC Genetics}, 13:70, 2012.\n\n\\bibitem{hildebrandt2009}\nF. Hildebrandt, S.F. Heeringa, F. RÃ¼schendorf, M. Attanasio, G.\nNÃ¼rnberg, C. Becker  ... E.A. Otto.\n\\newblock A systematic approach to mapping recessive genes in\nindividuals from outbred populations.\n\\newblock {\\em PLoS Genetics}, 5(1):e1000353, 2009.\n\n\\bibitem{biscarini2013}\nF. Biscarini, M. Del Corvo, A. Stella, A. Albera, M. Feren\\v{c}akovi\\'{c} and G. Pollott.\n\\newblock Busqueda de las mutaciones causales para artrogriposis y\nmacroglosia en vacuno de raza Piemontesa: resultados preliminares.\n\\newblock {\\em Actas de las XV Jornadas sobre Producci\\'{o}n Animal - AIDA}, 538-540, 2013.\n\n\\bibitem{williams2011}\nJ.L. Williams, S. Biffani, G. Minozzi, N. Morandi and A. Stella.\n\\newblock Application of genomics to problems in livestock production:\nproject ``ProZoo''.\n\\newblock {\\em Plant \\& Animal Genomes XIX}, San Diego (CA), USA, 2011.\n\n\\bibitem{barton2000}\nN.H. Barton.\n\\newblock Gene hitch-hiking.\n\\newblock {\\em Phil. Trans. R. Soc. London B}, 335:1553-1562, 2000.\n\n\\bibitem{biscarini2012}\nF. Biscarini, E.L. Nicolazzi, A. Stella and the ProZoo Team.\n\\newblock Automated milk.recording systems: an experience in Italian\ndairy cattle farms.\n\\newblock {\\em $63^{rd}$ EAAP Book of Abstract}, 95, 2012.\n\n\\bibitem{cole2009}\nJ.B. Cole, P.M. VanRaden, J.R. O'Connell, C.P. Van Tassell, T.S. Sonstegard, R.D. Schnabel, J.F. Taylor and G.R. Wiggans.\n\\newblock Distribution and location of genetic effects for dairy traits.\n\\newblock {\\em J. Dairy Sci.}, 92:2931--2946, 2009.\n\n\\bibitem{cole2011}\nJ. Cole, G. Wiggans, L. Ma, T. Sonstegard, T. Lawlor, B. Crooker, C. Van Tassell, J. Yang, S. Wang, L. Matukumalli and Y. Da.\n\\newblock Genome-wide association analysis of thirty one production,\nhealth, reproduction and body conformation traits in contemporary US\nHolstein cows.\n\\newblock {\\em BMC Genomics}, 12(1):408, 2011.\n\n\\bibitem{cole2013}\nJ. Cole, K.P. Gaddis, J. Clay and C. Maltecca.\n\\newblock Genomic evaluation of health traits in dairy cattle.\n\\newblock {\\em ICAR Technical Workshop 2013 and Health Conference},\n29-31 May, Aarhus (Denmark), 2013.\n\n\\bibitem{agostino2002}\nR.B. D'Agostino, J.M. Massaro and L.M. Sullivan.\n\\newblock Non-inferiority trials: design concepts and issues - the\nencounters of academic consultants in statistics.\n\\newblock {\\em Statis. Med.}, 22:169--186, 2002.\n\n\\bibitem{hansen2002}\nM. Hansen, M.S Lund, M.K. S{\\o}rensen and L.G. Christensen.\n\\newblock Genetic parameters of dairy character, protein yield, clinical\nmastitis and other diseases in the Danish Holstein cattle.\n\\newblock {\\em J. Dairy Sci.}, 85:445--452, 2002.\n\n\\bibitem{kolbehdari2008}\nD. Kolbehdari, Z. Wang, J.R. Grant, B. Murdoch, A. Prasad, Z. Xiu, E.\nMarques, P. Stothard and S.S. Moore.\n\\newblock A whole-genome scan to map quantitative trait loci for\nconformation and functional traits in Canadian Holstein bulls.\n\\newblock {\\em J. Dairy Sci.}, 91:2844--2856, 2008.\n\n\\bibitem{purcell2007}\nS. Purcell, B. Neale, K. Todd-Brown, L. Thomas, M.A.R. Ferreira, D.\nBender, J. Maller, P. Sklar, P.I.W. de Bakker, M.J. Daly and P.C. Sham.\n\\newblock PLINK: a toolset for whole-genome association and\npopulation-based linkage analysis.\n\\newblock {\\em Am. J. Hum. Genet.}, 81:559--575, 2007.\n\n\\bibitem{R2013}\nR Core Team.\n\\newblock A language and environment for statistical computing.\n\\newblock {\\em R Foundation for Statistical Computing}, Vienna\n(Austria), URL: ttp://www.R-project.org/, 2013.\n\n\\bibitem{luo1998}\nZ.W. Luo.\n\\newblock Linkage disequilibrium in a two-locus model.\n\\newblock {\\em Heredity}, 80:198--208, 1998.\n\n\\bibitem{minozzi2013}\nG. Minozzi, E.L. Nicolazzi, A. Stella, S. Biffani, R. Negrini, B. Lazzari, P. Ajmone-Marsan and J.L. Williams\n\\newblock Genome-wide analysis of fertility and production traits in\nItalian Holstein cattle.\n\\newblock {\\em PLoS One}, 8(11):e80219, 2013.\n\n\\bibitem{pimentel2010}\nE.C.G. Pimentel, S. Bauersachs, M. Tietze, H. Simianer, J. Tetens, G. Thaller, F. Reinhardt, E. Wolf and S. KÃ¶nig.\n\\newblock Exploration of relationships between production and fertility\ntraits in dairy cattle via association studies of SNPs within candidate\ngenes derived by expression profiling.\n\\newblock {\\em Anim. Genet.}, 42:251--262, 2010.\n\n\\bibitem{simianer1991}\nH. Simianer, H. Solbu amd L.R. Schaeffer.\n\\newblock Estimated genetic correlations between diseases and yield\ntraits in dairy cattle.\n\\newblock {\\em J. Dairy Sci.}, 74:4358--4365, 1991.\n\n\\bibitem{sullivan1994}\nP.S. Sullivan, S.T. Grubbs, T.W. Olchowy, F.M. Andrews, J.G. White,\nJ.L. Catalfamo, P.A. Dodd and T.P. McDonald.\n\\newblock Bleeding diathesis associated with variant von Willebrand\nfactor in a Simmental calf.\n\\newblock {\\em J. Am. Vet. Med. Assoc.}, 205(12):1763--1766, 1994.\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 11766, "prevtext": "\n\nwhere \\emph{M} is a tolerance margin for the difference. This states that ROH are inferior to\nGWAS. The alternative hypothesis was that the FDR was not different under both\nmethods:\n\n", "index": 5, "text": "\n\\[\nH_1:FDR_{ROH} - FDR_{GWAS} < M\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"H_{1}:FDR_{ROH}-FDR_{GWAS}&lt;M\" display=\"block\"><mrow><msub><mi>H</mi><mn>1</mn></msub><mo>:</mo><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><msub><mi>R</mi><mrow><mi>R</mi><mo>⁢</mo><mi>O</mi><mo>⁢</mo><mi>H</mi></mrow></msub></mrow><mo>-</mo><mrow><mi>F</mi><mo>⁢</mo><mi>D</mi><mo>⁢</mo><msub><mi>R</mi><mrow><mi>G</mi><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mi>S</mi></mrow></msub></mrow></mrow><mo>&lt;</mo><mi>M</mi></mrow></mrow></math>", "type": "latex"}]