[{"file": "1601.06670.tex", "nexttext": "\nwhere $r_1=320$~m and the reference radius is $r_0=600$~m.  The normalization\nparameter, $\\rho_\\mu(r_0)$ and the slope parameter $\\gamma\\approx 2.5$ are\nfitted for each primary energy, where the relation between $S_{\\!125}$ and primary\nenergy is determined as in Ref.~\\cite{Aartsen:2013wda}.\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{slc_646}\n}\n\\caption{Data in tanks in the radial bin around $646$~m corresponding to Fig.~\\ref{fig:thumb}.\n(Figure from~\\cite{Aartsen:2015awa3}.)\n\\label{fig:lat2}\n}\n\\end{figure}\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{rho_mu}\n}\n\\caption{Muon density at $600$~m as a function\nof energy.  (Figure from~\\cite{Aartsen:2015awa3}.)\n\\label{fig:rho-muon}\n}\n\\end{figure}\n\nThe result is a set of muon lateral distributions determined directly\nfrom IceTop data for a range of zenith angles and primary energies.\nFrom these lateral distributions, the muon density at $600$~m is\ndetermined as a function of energy and compared in Fig.~\\ref{fig:rho-muon} \nto data at higher energy from Hi-Res-MIA~\\cite{AbuZayyad:1999xa} in\nFig.~\\ref{fig:rho-muon}.  The densities expected from primary iron (blue, upper line)\nand from protons (red, lower line) are also shown (derived from SIBYLL 2.1).\n \n\n\nThe method was first presented and preliminary results shown in \nRef.~\\cite{Gonzalez:2015dda}.\nThe later analysis~\\cite{Aartsen:2015awa3} presented at ICRC 2015 includes a\ncomparison with simulations (with Sibyll 2.1), shown here in Fig.~\\ref{fig:rho-muon}.\nThe result is consistent with expectations\nto the extent that the measurements are between protons and iron.\nIn particular, there is no evidence for a significant excess of\nmuons in data up to 30 PeV compared to simulations, \nin contrast with the situation at 10 EeV where there appear to be\nmore muons in data than expected~\\cite{Aab:2014pza}.  Also, the post-LHC\nmodels seem to have 30\\% more muons than Sibyll 2.1 \nat least up to 30~PeV (J. Gonzalez, private communication).\n\nThe muon content of showers at the surface is sensitive to primary composition.\nAs for the coincident events, more muons are expected for events generated by\nheavy primaries than by light primary nuclei of the same energy.  However,\nthe muons come from different stages of shower development and reflect\ndifferent properties of the parent hadronic interactions in the two cases. \nMuons at the surface typically have energies of a few GeV and are produced\nby decay of mesons produced in interactions of order $100$~GeV.  In contrast,\nthe $\\sim$~TeV muons in the coincident analysis should be produced earlier\nin the shower and descended from hadronic interactions an order of magnitude higher.\nFor this reason, a full composition analysis with surface muons will be\nimportant for comparison with the coincident analysis.  Differences in hadronic\ninteraction models are likely to affect the two analyses differently.\nFinding consistency between the two may therefore be helpful in placing\nconstraints on interaction models as well as on composition.\n\nBuilding on the tools developed for the measurement of muons at the surface\nin IceTop, it is possible to develop an analysis that will return\nthe muon content on an event-by-event basis.  This is done by\nfitting each shower with two lateral distribution functions,\none for the electromagnetic component and the other for muons.\nIn this analysis, individual signals are assigned a probability\nof containing a muon based on the known properties of the\nmuon and electromagnetic signals in IceTop discussed above.  \nThe concept and preliminary examples were presented at the 2015\nICRC~\\cite{Aartsen:2015awa6}.  Because of the sensitivity of the\nmuon number to primary composition, this would make it possible to\nassign a probability of light vs. heavy primary to each event.\nIn addition to the value for composition analysis, such a method\nwould also make possible a composition-dependent version\nof the IceCube cosmic-ray anisotropy analysis~\\cite{Aartsen:2012ma}.\nIt would also allow a better snow correction by identifying the\nelectromagnetic contribution.\n\n\\section{Other approaches}\n\nThere are several other approaches to using muons in IceCube to\nhelp determine the primary cosmic-ray composition.  A comparison\nof muon bundles in the deep part of IceCube to simulations shows\npromise because of its large reach in energy, from tens of TeV to\nwell into the EeV energy range~\\cite{Aartsen:2015nss}.  The analysis\nuses the connection between primary mass and number of muons and finds\na steadily increasing mass, consistent with the coincident event\nanalysis of Section~\\ref{sec:coincident-events} and somewhat in tension \nwith the summary of Ref.~\\cite{Kampert:2012mx}\nabove $10^{17}$~eV (compare Fig.~\\ref{fig:logAcompare}).\n\nStill other approaches involve what might be called the geometry\nof muons in air showers.  The typical size of a muon bundle in\nthe deep detector below $1.5$ km.w.e. is less than the string spacing of 125~m.\nIt is therefore possible to identify individual outlying muons separated\nfrom the main bundle by more than the string spacing.  The lateral \ndistribution of $\\sim$TeV muons in IceCube is discussed in Ref.~\\cite{Abbasi:2012kza}.\nTo achieve a seperation of, for example $135$~m, a vertical muon with sufficient\nenergy to reach IceCube ($500$~GeV) needs a transverse momentum of $6$~GeV/c\nif it is produced at an altitude of $25$~km, the typical interaction\nheight for a heavy nucleus~\\cite{Aartsen:2015awa2}.  The relation between \nheavy nuclei and protons for production of high transverse momentum\nparticles is complex.  On the one hand, heavy nuclei have first interactions\nhigher in the atmosphere, but on the other the energy per nucleon is lower,\nso the fraction of high-transverse momentum is lower.  The analysis\ntherefore depends both on simulations of the detector response and on\nthe hadronic interaction models used.  Finding a consistent interpretation\nthus has the potential of clarifying both aspects.\n\nAnother approach under investigation is to use the timing of\nmuons at large distances to reconstruct the distribution of\nmuon production heights as in Auger~\\cite{Aab:2014dua}.  The goal is\nto measure the muon production profile and hence to obtain the muon\ndepth of shower maximum as a composition-dependent parameter.  This\nanalysis should naturally be associated with the measurement of surface muons\ndiscussed in the previous section.\n\n\n\\section{Future}\n\nMotivated by the observation of high-energy astrophysical \nneutrinos in IceCube~\\cite{Aartsen:2013jdh,Aartsen:2014gkd},\nplanning for an expanded detector is underway~\\cite{Aartsen:2014njl}.\nThe basic concept~\\cite{::2015dwa} is to increase the neutrino detection volume by\nan order of magnitude using 120 new strings with $\\approx 240$~m spacing around\nthe present detector, which has a string spacing of $125$~m.  Studies of\nice properties with the present detector show that the vertical instrumentation\ncan be increased by 27\\% (1360-2621~m compared to 1450-2450~m) at present.\n\nThe primary goal of IceCube Gen2 is to obtain sufficient statistics to\ncharacterize the astrophysical spectrum and determine, for example, whether\nthere is a high-energy cutoff above several PeV and whether there are both galactic and\nextra-galactic components in the astrophysical signal.  It will also significantly\nincrease the sensitivity for the search for cosmogenic neutrinos with much higher\nenergies.  The PINGU~\\cite{Aartsen:2014oha} component of Gen2 will provide increased density of\ninstrumentation in the current DeepCore portion of IceCube for neutrino oscillation\nphysics including the mass hierarchy.\n\nPlans also call for a surface array with sufficient detector density to\nact as a veto for downward cosmic-ray background.  This would make it possible\nto include events generated by charged-current interactions of muon neutrinos\nin the ice above the deep detector.  \n\nFrom the point of view\nof cosmic-ray physics, it is important to note that expanding the surface array\nin proportion to the area of the deep detector leads to a quadratic increase in\nacceptance for coincident events compared to the present detector.  The acceptance for coincident\nevents of a surface array of area $A_s$ centered above a deep detector of area $A_d$\nat depth $d$ is \n\n", "itemtype": "equation", "pos": 20133, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\title{Primary spectrum and composition with IceCube/IceTop}\n\n\n\n\n\n\n\\author{Thomas K. Gaisser for the IceCube Collaboration}\n\n\\address{Bartol Research Institute and Department of Physics and Astronomy\\\\\nUniversity of Delaware\\\\\nNewark, DE 19716 USA}\n\n\\begin{abstract}\nIceCube, with its surface array IceTop, detects three different components \nof extensive air showers: the total signal at the surface, \nGeV muons in the periphery of the showers and TeV muons in the deep array of IceCube.  \nThe spectrum is measured with high resolution from the knee to the ankle with IceTop.  \nComposition and spectrum are extracted from events seen in coincidence \nby the surface array and the deep array of IceCube.  \nThe muon lateral distribution at the surface is obtained from the data \nand used to provide a measurement of the muon density at 600 meters from the shower core \nup to 30 PeV.  Results are compared to measurements from other experiments to obtain \nan overview of the spectrum and composition over an extended range of energy.  \nConsistency of the surface muon measurements with hadronic interaction models \nand with measurements at higher energy is discussed. \n\\end{abstract}\n\n\\begin{keyword}\n\ncosmic-ray spectrum \\sep composition\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\n\n\n\\section{Introduction}\n\\label{sec:introduction}\n\nThe IceCube Neutrino Observatory includes a surface detector above the\ndeep array as illustrated in Fig.~\\ref{fig:IceCube}.  With an area of $\\approx1$~km$^2$,\nIceTop is sensitive to the primary spectrum from PeV to EeV.  The surface array\nconsists of 81 stations each with two tanks separated from each other by $10$~m\nand filled with clear ice~\\cite{IceCube:2012nn}.  Each tank (see Fig.~\\ref{fig:tank}) \nis viewed by two digital optical modules (DOMs),\none running at high gain and the other at low gain to achieve a dynamic range of $\\approx\\!10^4$\nfor the energy deposited in each tank.  The IceTop DOMs are fully integrated into\nthe data acquisition system of IceCube so that timing across the full array is\naccurate to $\\approx3$~ns.  The spectrum measurement with IceTop\nbenefits from the high altitude of the array (equivalent to a depth of $\\approx690$~g/cm$^2$),\nwhich allows a measurement of the spectrum with very good energy resolution.\n\n\\begin{figure}[thb]\n\n\\includegraphics[width=1.1\\columnwidth]{ArraySeasonsCut}\n\n\\caption{Layout of the IceCube Observatory at the South Pole. \n\\label{fig:IceCube}\n}\n\\end{figure}\n\nEvents with trajectories that pass through IceTop and the deep array of IceCube\ncan be reconstructed in both parts of the detector.  The signal in the deep array\nis due to energy deposition by muons sufficient energy at production\nto reach the deep array (500 GeV minimum and typically $\\sim$TeV).\nThe ratio of \nmuons in the deep detector to the shower size measured at the surface is sensitive to primary\ncomposition.  This measurement is related to the classic $\\mu/e$ ratio measured at the\nsurface.  Heavy nuclei of a given primary energy produce more muons than protons\nof the same energy in both cases.  However, the systematics of the two analyses are\ndifferent because the TeV muons are from higher energy interactions in the shower than\nthe GeV muons at the surface.  Making both measurements on the same set of showers\ntherefore has the potential to improve the understanding of systematic differences in hadronic interaction\nmodels.  We return to this point in Section~\\ref{sec:surface-muons} below.\n\nThe first deep underground muon detector near Cornell University\nin upstate New York~\\cite{Barrett:1952xyz} also set up a small air shower array on the surface.  \nWith underground detectors of order $1$~m$^2$ at a depth of $600$~m\nand surface detectors spaced by $\\approx 60$~m,\nthe aperture was tiny ($\\sim 0.01$~m$^2$sr).  The first serious measurement of coincidences\nbetween a surface array above a deep detector was EASTOP-MACRO~\\cite{Bellotti:1989pa}. \nThe aperture for observing coincident events was $\\sim 100$~m$^2$sr, and the\nmuon energy threshold at the surface was $\\approx1.3$~TeV.  \nThe South Pole Air Shower Experiment (SPASE-2)~\\cite{Dickinson:2000hr} was used in coincidence\n with the Antarctic Muon and Neutrino Array (AMANDA), the forerunner of IceCube, \nfor a composition analysis with coincident events~\\cite{Ahrens:2004nn}.  Its aperture\n was also $\\sim 100$~m$^2$sr.\n For comparison, the aperture of IceCube for coincident\n events is $\\approx 0.25$~km$^2$sr.\n The earlier air-shower experiment, SPASE-1, was decommissioned in 1995, \n but it also ran in coincidence\n with AMANDA during construction.  The configuration of a two-dimensional muon\n survey of AMANDA-B10 from the surface arrays~\\cite{Ahrens:2004dg} is shown in \n Fig.~\\ref{fig:SPASE-AMANDA}.  \n\n\\section{Energy spectrum using IceTop only}\n\\label{sec:IceTop only spectrum}\n\nShowers in IceTop are reconstructed by fitting a lateral distribution function\nto the observed signal, taking account of arrival time fluctuations as described\nin Ref.~\\cite{IceCube:2012nn}.  Because snow accumulates at a different rate\nover each IceTop tank, measured signals are corrected before fitting to the\nlateral distribution function.  The correction is made with a simple exponential\nabsorption factor, $\\exp{X_i/\\lambda\\cos\\theta}$, with the snow depth \ninterpolated between biennial measurements at each tank.  \nThe average spacing between stations in IceTop is $125$~m.  Correspondingly, the\nshower size is characterized by the fitted signal ($S_{\\!125}$) at $125$~m\nperpendicular from the shower trajectory.  The energy spectrum is obtained\nfrom comparison of the measured size spectrum to a Monte Carlo simulation\nof shower size vs primary energy for different groups of nuclei.  \n\n \\begin{figure}[thb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{tank_cross_section}\n}\n\\caption{Cross section of an IceTop tank~\\cite{IceCube:2012nn}.\n\\label{fig:tank}\n}\n\\end{figure}\n\n\\begin{figure}[htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{SPASE-AMANDA-geometry}\n}\n\\caption{Configuration for the muon survey of AMANDA-B10 by SPASE~\\cite{Ahrens:2004dg}. \nThe SPASE-1 array was grid NW of the South Pole dome on the station side of\nthe airplane skiway.  SPASE-2 and AMANDA were in the ``dark sector\" grid west of\nthe skiway.  SPASE-2 included a sub-array of atmospheric Cherenkov light detectors called\nVULCAN (inverted red triangles).\n\\label{fig:SPASE-AMANDA}\n}\n\\end{figure}\n\n\\begin{figure}[!thb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{allpart-knee-ankle-ev-prelim}\n}\n\\caption{Energy spectrum from the knee to the EeV from three years of IceTop~\\cite{Aartsen:2015awa5}\ncompared to a pure power law (solid line) and to data from KASCADE-Grande~\\cite{Apel:2012rm}\nand TUNKA~\\cite{Prosin:2014x1}.\n\\label{fig:all-part-compare}\n}\n\\end{figure}\n\nOne of the main systematic uncertainties is the composition model (relative\ncontribution of different mass groups vs energy) assumed to obtain the\nmean primary energy for a given $S_{\\!125}$.  The H4a model of Ref.~\\cite{Gaisser:2012zz} \nis used to make the size to energy conversion.  The sensitivity to composition\nis checked~\\cite{Aartsen:2013wda} by making the conversion at each of four\nzenith angle bins assuming pure protons and assuming pure iron.  Under the\nassumption of pure protons, the spectrum at the larger zenith angle is lower\nthan that for the vertical.  Under the assumption of pure iron for the primary\ncomposition, the angular dependence of the spectra in the angular bins is\nreversed.  This behavior reflects the fact that proton shower penetrate\nmore deeply than iron showers for a given primary energy.  \nWhen the H4a model of composition is used,\nthe spectra obtained at the four different zenith angles are closer to each\nother.  In principle, the composition could be inferred by adjusting\nthe relative fractions at each energy to get the same primary spectrum\nfor each zenith bin, as required by the fact that the true spectrum\nis independent of the zenith angle at which it is measured.  In practice,\nsuch an approach is difficult because of fluctuations.  The angular dependence\nof the spectra reconstructed assuming H4a is used as a measure of the\nsystematic uncertainty from composition.\n\n\nThe energy spectrum measured in 2010-11 with the nearly complete IceTop detector (IT-73 with\n73 of 81 stations in operation)~\\cite{Aartsen:2013wda} showed clearly that the spectrum between the\nknee and the ankle cannot be described by a single power law.  The high resolution\nmeasurement with IceTop clarifies the structure seen in previous experiments.  The\nsame analysis has now been applied to three years of IceTop data (2010-2013), with\nthe data from the complete 81 station array analyzed using only the IT-73 tanks for consistency\nwith the first year analysis~\\cite{Aartsen:2015awa5}.  The three-year analysis includes an improved treatment\nof the time-dependent correction for\nsnow above the detector.  By comparing reconstructed\nevents in areas with deeper snow to those in areas with little or no\nsnow, the effective attenuation parameter was optimized to 2.1~m for the first\nyear of the analysis and 2.25~m for the subsequent two years.  (For snow\ndensity of $\\approx 0.4$~g/cm$^2$, 2.1~m corresponds to an effective\nattenuation length of 84~g/cm$^2$.)  Work is underway to account for\nthe fact that it is mainly the electromagnetic component of the signal\nthat is affected by snow~\\cite{Aartsen:2015awa9}.\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{spectrum-IT-IC}\n}\n\\caption{Comparison of the IceTop only spectrum (red points) with the spectrum from \nthe IceCube coincident analysis (black points).\n\\label{fig:spectrum2}\n}\n\\end{figure}\n\nThe IceTop 3-year data are shown\nalong with data from KASCADE-Grande~\\cite{Apel:2012rm} and TUNKA~\\cite{Prosin:2014x1} \nin Fig.~\\ref{fig:all-part-compare} compared to an $E^{-3}$ differential power law\nshown by the solid line.  There is a hardening of the spectrum around $2\\times 10^{16}$~eV\nand a steepening above $2\\times 10^{17}$~eV, sometimes referred to as the second knee.\n\n\n\\section{Coincident events}\n\\label{sec:coincident-events}\n\nWith a sample of coincident events, each of which is measured both \nby IceTop and by the deep array of IceCube,\nthe degeneracy between energy and composition with the IceTop only analysis \ncan be removed.  The coincident event analysis~\\cite{Aartsen:2013lla} uses\na neural network (NN) to determine both energy and composition from the three-year\nsample of coincident events that are well contained and reconstructed in\nboth IceTop and IceCube.  An updated description of the coincident analysis is\ngiven in Ref.~\\cite{Aartsen:2015awa5}.  Figure~\\ref{fig:spectrum2} compares\nthe energy spectrum obtained from the coincident analysis with the IceTop only\nspectrum.  The good agreement below $10^8$~GeV confirms that the composition systematic has\nbeen dealt with in a reasonable way in the IceTop only analysis, which has\nthe higher statistics.\n\n\n\nThe principal observables on which the network is trained (using simulated data) are $S_{\\!125}$,\n$\\cos\\theta_{\\rm zenith}$ and $E_\\mu^{1500}$, the reconstructed energy loss per meter of muons \nin the shower as it enters the deep array at 1500 m. \nThe reconstruction is based on the observed energy losses within the detector.\nIn addition, two measures of the number of\nstochastic energy losses in the reconstructed in-ice track\n(moderate and high) are used.  The NN is trained and tested on half the showers simulated\nwith Sibyll-2.1~\\cite{Ahn:2009wx} and FLUKA~\\cite{Battistoni:2007zzb} \nfor protons, helium, oxygen and iron primaries.  The output variables\nare the shower energy and a measure of $\\langle\\ln(A)\\rangle$ for each event.\nApplying the trained NN to the other half of the simulated data leads\nfor each energy bin to a set of histograms for each mass group.\nEvents in these ``template\" histrograms are classified by a proxy for $\\ln(A)$.\nApplying the NN to the data leads to an energy estimate for each event\nand a single histogram for each energy bin.\nThe $\\langle\\ln(A)\\rangle$ for each bin is obtained by finding the best fit of the\nfour template histograms to the data histogram for the corresponding energy bin.\n\n\\begin{figure}[thb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{Eloss}\n}\n\\caption{Reconstructed energy loss as a function of \nprimary energy for\nshowers initiated by protons (red) and by iron nuclei (blue).\n\\label{fig:Eloss}\n}\n\\end{figure}\n\n\nThe main composition-dependent variable in the NN analysis is $E_\\mu^{1500}$.\nIts sensitivity is illustrated in Fig.~\\ref{fig:Eloss} from simulations\nof protons and iron.  An important systematic uncertainty in the coincident analysis\nis absolute calibration of the light yield in the detector.  To the extent that\nthe main source of differences among interaction models is the number of\n$\\sim$TeV muons, those systematic uncertainties will scale similarly to\nthe light yield.  Figure~\\ref{fig:logA} shows $\\langle\\ln(A)\\rangle$ from the\ncoincident analysis at its nominal value (black stars) and scaled according to the \nvarious systematic effects listed.\n\n\\begin{figure}[thb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{logA}\n}\n\\caption{Energy dependence of $\\langle\\ln(A)\\rangle$ from the coincident analysis\nfor various assumptions on each of the sources of systematic uncertainty.\n\\label{fig:logA}\n}\n\\end{figure}\n\n\nThe central values from the IceCube coincident analysis \nare shown as the red points in Fig.~\\ref{fig:logAcompare} superimposed on\nthe compilation from the review paper of Kampert and Unger~\\cite{Kampert:2012mx}.\nThe values of $\\langle\\ln(A)\\rangle$ are obtained in Ref.~\\cite{Kampert:2012mx} by interpolating \nmeasured values of shower maximum between values of $X_{\\rm max}$ for protons and\niron from simulations.  Here we show the diagram interpreted with Sibyll-2.1 to be\nconsistent with the coincident analysis.  The solid lines are included in the figure\nfrom Ref.~\\cite{Kampert:2012mx} to indicate the range of the data summarized.\n\n\\begin{figure}[thb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{logAcompare}\n}\n\\caption{Comparison of $\\langle \\ln(A)\\rangle$ from the IceCube coincident analysis\nwith a compilation of data~\\cite{Kampert:2012mx}.  (See text for discussion.)\n\\label{fig:logAcompare}\n}\n\\end{figure}\n\n\n\\section{Surface muons}\n\\label{sec:surface-muons}\n\nThe DOMs in IceTop tanks record waveforms from the Cherenkov light produced \nby charged particles  with speeds above the Cherenkov threshold in the clear ice.\nThe amount of light depends on the track length in the tank but not on the identity of\nthe particle(s) that produced it.  There are, however, several possibilities\nfor obtaining some information about the muon content of air showers with IceTop.\nFor example, there is potential information in the structure of the waveforms which\nmight serve to distinguish muons from electromagnetic signals, which are \nprimarily due to conversion of photons in the tanks.\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{61A_muonSpec_61_61_without_curves_opt}\n}\n\\caption{Distribution of signals for a calibration run for the high-gain DOM\nin tank 61A.  The definition of one vertical equivalent muon (VEM) is indicated.\n(From~\\cite{IceCube:2012nn}.)\n\\label{fig:muon-calib}\n}\n\\end{figure}\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{muon_counting_1_noprelim}\n}\n\\caption{Distribution of tank signals in many showers classified by successively\nlarger cuts in the core distance defined in terms of the expected signal.\n(From~\\cite{IceCube:2012nn}.)\n\\label{fig:lateral}\n}\n\\end{figure}\n\n\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{thumb_plot}\n}\n\\caption{Two-dimensional distribution of signals in showers with\nenergies $\\approx3$~PeV in the zenith angle\nbin around $13^\\circ$ as a function\nof the VEM signal and core-distance.\n\\label{fig:thumb}\n}\n\\end{figure}\n\n\n\n\n\nA simpler method is to make use of the fact that the characteristic charge\ndistribution of muons passing through a tank is understood well\nfrom the calibration procedure.  Figure~\\ref{fig:muon-calib} shows the\ncharge distribution from one calibration run for a high-gain DOM in one tank. \nThe calibration data are obtained from uncorrelated hits collected without\nan air shower trigger, so they are from the continuous flux of photons, electrons\nand muons produced by interactions of relatively low energy cosmic rays in\nthe atmosphere.  \n\n\nSignals in IceTop tanks are defined in units of VEM obtained \nby monthly calibration runs for each tank (see Fig.~\\ref{fig:muon-calib}).  In particular, the lateral distribution\nof an air shower is expressed in terms of VEM as a function of core-distance.  In\nthe inner region of a shower, a signal of $\\sim1$~VEM can be produced either by\na combination of electromagnetic quanta with appropriate total track length or\nby a muon or by a combination of the two (if the muon stops in the tank).  In the\nouter region of the shower, however, a signal near one VEM is likely to be\nfrom a muon.  The \"outer region\" is defined as the distance beyond which\nthe fitted lateral distribution for a shower falls below one VEM.  Figure~\\ref{fig:lateral}\nillustrates how the muon peak becomes more pronounced at larger core distance. \nFigure~\\ref{fig:thumb} is a two dimensional representation of the same \ninformation.  The \"thumb\" at 1 VEM reflects the muons.\n\n\n\nMuon signals in air showers cannot, however, be fit directly from the shape of\nthe muon peak in calibration runs because the air shower context is different.\nIn addition, the showers need to be analyzed as a function of zenith angle and energy.  \nThe analysis starts by making\ndistributions like that in Fig.~\\ref{fig:thumb} for each bin of zenith angle and energy.\nThen the data are further divided into bins of core distance, defined as distance\nin the shower plane perpendicular to the reconstructed trajectory of the shower.\nTwo examples are shown in Figs.~\\ref{fig:lat1} and~\\ref{fig:lat2} at distances\ncorresponding to the vertical dashed lines in Fig.~\\ref{fig:thumb}.  These figures\nshow the data sample for an energy bin around $3$~PeV centered around core distances of $257$ and $646$~m.\nThe muon peak becomes increasingly prominent relative the the electromagnetic component \nas distance increases.\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{slc_257}\n}\n\\caption{Data in tanks in the radial bin around $257$~m corresponding to Fig.~\\ref{fig:thumb}.\n(Figure from~\\cite{Aartsen:2015awa3}.).\n\\label{fig:lat1}\n}\n\\end{figure}\n\nThe data are fit by three components as indicated in the two examples: \n(1) one or more muons, (2) 0 muons (electromagnetic), and (3) background.\n(The small background of accidental hits not related to the shower is\ndetermined from the distribution of hits outside the time windows of events in the sample.)\nThe shape for the muon contribution is obtained starting with GEANT4 simulations of the tank response\nto one muon as a function of zenith angle.  Because a tank can be hit by more than one\nmuon, the actual muon signal distribution may be broader than for a single muon.  \nThe shape of the $\\ge 1\\,\\mu$ peak\n is characterized\nby $\\langle N_\\mu\\rangle$ in which the shapes for 1, 2, and 3 muons are combined with weights\naccording to a Poisson distribution determined by fitting with $\\langle N_\\mu\\rangle$\nas a parameter.  The relative normalization of the\nsum of the electromagnetic only (major) and background (small) contribution to the fit\nmust correspond to the total Poisson probability of having 0 muons,\nwhile the normalization of the muon contribution (1) is\nthe Poisson probability of having at least one muon. \nThe detailed procedure is described in Ref.~\\cite{Gonzalez:2015dda}.  \nOnce the mean muon number in a given radial bin is fixed, the\nmuon density is obtained by dividing by the total projected area\nof tanks in that radial bin.\nThe lateral distribution of muons found in this way can be described by the Greisen\nfunction,\n\n", "index": 1, "text": "\\begin{equation}\n\\rho_\\mu(r)=\\rho_\\mu(r_0)\\left(\\frac{r}{r_0}\\right)^{-3/4}\\left(\\frac{r_1+r}{r_1+r_0}\\right)^{-\\gamma}\n\\label{eq:greisen}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\rho_{\\mu}(r)=\\rho_{\\mu}(r_{0})\\left(\\frac{r}{r_{0}}\\right)^{-3/4}\\left(\\frac{%&#10;r_{1}+r}{r_{1}+r_{0}}\\right)^{-\\gamma}\" display=\"block\"><mrow><mrow><msub><mi>ρ</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>ρ</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mn>0</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>r</mi><msub><mi>r</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>3</mn><mo>/</mo><mn>4</mn></mrow></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><msub><mi>r</mi><mn>1</mn></msub><mo>+</mo><mi>r</mi></mrow><mrow><msub><mi>r</mi><mn>1</mn></msub><mo>+</mo><msub><mi>r</mi><mn>0</mn></msub></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mi>γ</mi></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06670.tex", "nexttext": "\nTaking $d=2$~km, the acceptance of the present IceCube for coincident events\nis $\\approx 0.25$~km$^2$sr.  With an area of $A_s=A_d\\approx 7$~km$^2$\nthe corresponding number would be a factor of $\\approx 50$ larger.\nIn addition, for purposes of the veto, it is desirable to have a surface array\nthat extends beyond the footprint of the deep detector.  Studies are\nongoing to optimize the surface component of Gen2 for both veto and cosmic-ray physics.\n\n\\section*{Acknowledgments}\nI am grateful for helpful discussions with Hermann Kolanoski, Javier Gonzalez\nand Hans Dembinski.\nThe research on which this paper reports is supported in part by the \nU.S. National Science Foundation.  A full list of supporting agencies for the\nIceCube Neutrino Observatory may be found at http://icecube.wisc.edu/collaboration/funding.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{elsarticle-num}\n\\bibliography{Gaisser}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 28614, "prevtext": "\nwhere $r_1=320$~m and the reference radius is $r_0=600$~m.  The normalization\nparameter, $\\rho_\\mu(r_0)$ and the slope parameter $\\gamma\\approx 2.5$ are\nfitted for each primary energy, where the relation between $S_{\\!125}$ and primary\nenergy is determined as in Ref.~\\cite{Aartsen:2013wda}.\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{slc_646}\n}\n\\caption{Data in tanks in the radial bin around $646$~m corresponding to Fig.~\\ref{fig:thumb}.\n(Figure from~\\cite{Aartsen:2015awa3}.)\n\\label{fig:lat2}\n}\n\\end{figure}\n\n\\begin{figure}[!htb]\n\\centerline{\n\\includegraphics[width=1.0\\columnwidth]{rho_mu}\n}\n\\caption{Muon density at $600$~m as a function\nof energy.  (Figure from~\\cite{Aartsen:2015awa3}.)\n\\label{fig:rho-muon}\n}\n\\end{figure}\n\nThe result is a set of muon lateral distributions determined directly\nfrom IceTop data for a range of zenith angles and primary energies.\nFrom these lateral distributions, the muon density at $600$~m is\ndetermined as a function of energy and compared in Fig.~\\ref{fig:rho-muon} \nto data at higher energy from Hi-Res-MIA~\\cite{AbuZayyad:1999xa} in\nFig.~\\ref{fig:rho-muon}.  The densities expected from primary iron (blue, upper line)\nand from protons (red, lower line) are also shown (derived from SIBYLL 2.1).\n \n\n\nThe method was first presented and preliminary results shown in \nRef.~\\cite{Gonzalez:2015dda}.\nThe later analysis~\\cite{Aartsen:2015awa3} presented at ICRC 2015 includes a\ncomparison with simulations (with Sibyll 2.1), shown here in Fig.~\\ref{fig:rho-muon}.\nThe result is consistent with expectations\nto the extent that the measurements are between protons and iron.\nIn particular, there is no evidence for a significant excess of\nmuons in data up to 30 PeV compared to simulations, \nin contrast with the situation at 10 EeV where there appear to be\nmore muons in data than expected~\\cite{Aab:2014pza}.  Also, the post-LHC\nmodels seem to have 30\\% more muons than Sibyll 2.1 \nat least up to 30~PeV (J. Gonzalez, private communication).\n\nThe muon content of showers at the surface is sensitive to primary composition.\nAs for the coincident events, more muons are expected for events generated by\nheavy primaries than by light primary nuclei of the same energy.  However,\nthe muons come from different stages of shower development and reflect\ndifferent properties of the parent hadronic interactions in the two cases. \nMuons at the surface typically have energies of a few GeV and are produced\nby decay of mesons produced in interactions of order $100$~GeV.  In contrast,\nthe $\\sim$~TeV muons in the coincident analysis should be produced earlier\nin the shower and descended from hadronic interactions an order of magnitude higher.\nFor this reason, a full composition analysis with surface muons will be\nimportant for comparison with the coincident analysis.  Differences in hadronic\ninteraction models are likely to affect the two analyses differently.\nFinding consistency between the two may therefore be helpful in placing\nconstraints on interaction models as well as on composition.\n\nBuilding on the tools developed for the measurement of muons at the surface\nin IceTop, it is possible to develop an analysis that will return\nthe muon content on an event-by-event basis.  This is done by\nfitting each shower with two lateral distribution functions,\none for the electromagnetic component and the other for muons.\nIn this analysis, individual signals are assigned a probability\nof containing a muon based on the known properties of the\nmuon and electromagnetic signals in IceTop discussed above.  \nThe concept and preliminary examples were presented at the 2015\nICRC~\\cite{Aartsen:2015awa6}.  Because of the sensitivity of the\nmuon number to primary composition, this would make it possible to\nassign a probability of light vs. heavy primary to each event.\nIn addition to the value for composition analysis, such a method\nwould also make possible a composition-dependent version\nof the IceCube cosmic-ray anisotropy analysis~\\cite{Aartsen:2012ma}.\nIt would also allow a better snow correction by identifying the\nelectromagnetic contribution.\n\n\\section{Other approaches}\n\nThere are several other approaches to using muons in IceCube to\nhelp determine the primary cosmic-ray composition.  A comparison\nof muon bundles in the deep part of IceCube to simulations shows\npromise because of its large reach in energy, from tens of TeV to\nwell into the EeV energy range~\\cite{Aartsen:2015nss}.  The analysis\nuses the connection between primary mass and number of muons and finds\na steadily increasing mass, consistent with the coincident event\nanalysis of Section~\\ref{sec:coincident-events} and somewhat in tension \nwith the summary of Ref.~\\cite{Kampert:2012mx}\nabove $10^{17}$~eV (compare Fig.~\\ref{fig:logAcompare}).\n\nStill other approaches involve what might be called the geometry\nof muons in air showers.  The typical size of a muon bundle in\nthe deep detector below $1.5$ km.w.e. is less than the string spacing of 125~m.\nIt is therefore possible to identify individual outlying muons separated\nfrom the main bundle by more than the string spacing.  The lateral \ndistribution of $\\sim$TeV muons in IceCube is discussed in Ref.~\\cite{Abbasi:2012kza}.\nTo achieve a seperation of, for example $135$~m, a vertical muon with sufficient\nenergy to reach IceCube ($500$~GeV) needs a transverse momentum of $6$~GeV/c\nif it is produced at an altitude of $25$~km, the typical interaction\nheight for a heavy nucleus~\\cite{Aartsen:2015awa2}.  The relation between \nheavy nuclei and protons for production of high transverse momentum\nparticles is complex.  On the one hand, heavy nuclei have first interactions\nhigher in the atmosphere, but on the other the energy per nucleon is lower,\nso the fraction of high-transverse momentum is lower.  The analysis\ntherefore depends both on simulations of the detector response and on\nthe hadronic interaction models used.  Finding a consistent interpretation\nthus has the potential of clarifying both aspects.\n\nAnother approach under investigation is to use the timing of\nmuons at large distances to reconstruct the distribution of\nmuon production heights as in Auger~\\cite{Aab:2014dua}.  The goal is\nto measure the muon production profile and hence to obtain the muon\ndepth of shower maximum as a composition-dependent parameter.  This\nanalysis should naturally be associated with the measurement of surface muons\ndiscussed in the previous section.\n\n\n\\section{Future}\n\nMotivated by the observation of high-energy astrophysical \nneutrinos in IceCube~\\cite{Aartsen:2013jdh,Aartsen:2014gkd},\nplanning for an expanded detector is underway~\\cite{Aartsen:2014njl}.\nThe basic concept~\\cite{::2015dwa} is to increase the neutrino detection volume by\nan order of magnitude using 120 new strings with $\\approx 240$~m spacing around\nthe present detector, which has a string spacing of $125$~m.  Studies of\nice properties with the present detector show that the vertical instrumentation\ncan be increased by 27\\% (1360-2621~m compared to 1450-2450~m) at present.\n\nThe primary goal of IceCube Gen2 is to obtain sufficient statistics to\ncharacterize the astrophysical spectrum and determine, for example, whether\nthere is a high-energy cutoff above several PeV and whether there are both galactic and\nextra-galactic components in the astrophysical signal.  It will also significantly\nincrease the sensitivity for the search for cosmogenic neutrinos with much higher\nenergies.  The PINGU~\\cite{Aartsen:2014oha} component of Gen2 will provide increased density of\ninstrumentation in the current DeepCore portion of IceCube for neutrino oscillation\nphysics including the mass hierarchy.\n\nPlans also call for a surface array with sufficient detector density to\nact as a veto for downward cosmic-ray background.  This would make it possible\nto include events generated by charged-current interactions of muon neutrinos\nin the ice above the deep detector.  \n\nFrom the point of view\nof cosmic-ray physics, it is important to note that expanding the surface array\nin proportion to the area of the deep detector leads to a quadratic increase in\nacceptance for coincident events compared to the present detector.  The acceptance for coincident\nevents of a surface array of area $A_s$ centered above a deep detector of area $A_d$\nat depth $d$ is \n\n", "index": 3, "text": "\\begin{equation}\nA\\,\\Omega\\,\\approx\\,\\frac{A_sA_d}{d^2}.\n\\label{eq:acceptance}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"A\\,\\Omega\\,\\approx\\,\\frac{A_{s}A_{d}}{d^{2}}.\" display=\"block\"><mrow><mrow><mrow><mpadded width=\"+1.7pt\"><mi>A</mi></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">Ω</mi></mpadded></mrow><mo rspace=\"4.2pt\">≈</mo><mfrac><mrow><msub><mi>A</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>A</mi><mi>d</mi></msub></mrow><msup><mi>d</mi><mn>2</mn></msup></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]