[{"file": "1601.05488.tex", "nexttext": "\nwhere ${\\mbox{\\mathversion{bold}${a}$}}_1$ and ${\\mbox{\\mathversion{bold}${a}$}}_2$ are the primitive translations of the graphene lattice. Introducing the greatest common divisor ($d$) of $n$ and $m$, one can rewrite Eq.(\\ref{arbitrary_lattice_vector}) in the form\n\n", "itemtype": "equation", "pos": 10555, "prevtext": "\n\\title{Band Gaps in Jagged and Straight Graphene Nanoribbons Tunable by an External Electric Field}\n\\author{V.A. Saroka}\n\\email{v.saroka@exeter.ac.uk}\n\\affiliation{School of Physics, University of Exeter, Stocker Road, Exeter EX4 4QL, United Kingdom}\n\\affiliation{Institute for Nuclear Problems, Belarusian State University, Bobruiskaya 11, 220030 Minsk, Belarus}\n\n\\author{K.G. Batrakov}\n\\affiliation{Institute for Nuclear Problems, Belarusian State University, Bobruiskaya 11, 220030 Minsk, Belarus}\n\n\\author{V.A. Demin}\n\\affiliation{Emanuel Institute of Biochemical Physics of Russian Academy of Sciences,  Kosygina 4, 119334 Moscow, Russia}\n\n\\author{L.A. Chernozatonskii}\n\\affiliation{Emanuel Institute of Biochemical Physics of Russian Academy of Sciences,  Kosygina 4, 119334 Moscow, Russia}\n\n\n\\begin{abstract}Band gap control by an external field is useful in various optical, infrared and THz applications. However, widely tunable band gaps are still not practical due to variety of reasons. Using the orthogonal tight-binding method for $\\pi$-electrons, we have investigated the effect of the external electric field on a subclass of monolayer chevron-type graphene nanoribbons that can be referred to as jagged graphene nanoribbons. A classification of such ribbons was proposed and band gaps for applied fields up to the SiO$_2$ breakdown strength ($1$ V/nm) were calculated. According to the tight-binding model, band gap opening (or closing) takes place for some type of jagged graphene nanoribbons in the external electric field that lays in the plane of the structure and perpendicular to its longitudinal axis. Tunability of the band gap up to $0.6$ eV is attainable for narrow ribbons. In the case of jagged ribbons with armchair edges larger jags forming a chevron pattern of the ribbon enhance the controllability of the band gap. For jagged ribbons with zigzag and armchair edges regions of linear and quadratic dependence of the band gap on the external electric field can be found that are useful in devices with controllable modulation of the band gap.\n\\end{abstract}\n\n\\maketitle\n\\section{Introduction}\nSince it was obtained in a freestanding form graphene\\cite{Novoselov2004} has been attracting the attention of the scientific community both as an interesting object for fundamental study (due to its massless Dirac fermions\\cite{Novoselov2005}) and as a base for future technological advances, due to its chemical stability, mechanical strength\\cite{Lee2012}, high electrical and thermal\\cite{Balandin2008,Chen2010} conductivities. Numerous graphene applications\\cite{Chernozatonskii2014} include field effect transistors\\cite{Schwierz2010} and their interconnects\\cite{Murali2009a,Interconnects2013}, sensors\\cite{Schedin2007,Bi2013}, hydrogen storage\\cite{Tozzini2013}, terahertz emitters\\cite{Mikhailov2012,Batrakov2012}, transparent electrodes etc. \nMany of these applications would benefit from a full control over the band gap. For instance, great efforts have been undertaken to develop novel tunable sources and detectors of THz radiation\\cite{Hartmann2014}. Speaking of electronic applications, one must confess that there is a problem of contact resistance\\cite{Smith2013} that can be easily overcome in all carbon electronic devices\\cite{Liang2010}, but this again requires a complete control over the band gaps of the nanostructures. Additionally, all carbon electronics can be easily recycled and used in a closed-loop production cycle. Therefore it is desirable to control the band gap both by structural modification and external fields.\n\nA number of techniques have been proposed for band gap engineering in graphene: patterning of graphene \\cite{Dvorak2013,Chernozatonskii2007}, straining of graphene \\cite{Choi2010,Li2010,Ribeiro2009,Pereira2009,Chernozatonskii2010}, lateral confinement of charge carries in one dimension in graphene nanoribbon (GNR), vertical inversion symmetry breaking in bilayer graphene\\cite{McCann2006a,Castro2007} or trilayer graphene\\cite{Lui}. All of them have some advantages and disadvantage, for instance, patterning allows higher current compared to GNR, while symmetry breaking by an external electric field provides tunability of the band gap, giving rise to tunable devices which is not the case for patterning or carrier confinement.\n\nThe universal approach to band gap control was also attempted in a combination of strategies. Recently, after extensive theoretical study\\cite{Sahu2010a,Sahu2008}, simultaneous lateral carrier confinement and vertical inversion symmetry breaking in bilayer GNRs to tune their band gaps and improve the on/off ratio in logic devices has been experimentally verified and reported\\cite{Yu2013}.\n\nHowever, as was noticed earlier in the literature\\cite{Chang2006,Son2006,Huang2008}, owing to the presence of edges for GNR electric field can have not only an out-of-plane direction that is normal to the ribbon plane, but also an in-plane one that is transverse to the ribbon longitudinal axis. A crucial difference between these two geometries of applied field is that the latter may affect properties of one-layer systems. Even though width dependence was reported and band gap increase for zigzag GNR width decrease was shown\\cite{Chang2006,Huang2008}, quite wide ribbons were chosen for the sample study and the limit of this increase for narrow (sub-$5$nm) GNR was not demonstrated. Probably, it could be explained by the natural desire to be closer to experimentalists who were mostly limited at that time by electron beam lithography and etching techniques of GNR production. Taking into account the latest advances in GNR synthesis, when GNRs with atomically precise edges were synthesised and a bottom-up approach to synthesis of chevron-type GNRs was demonstated\\cite{Cai2010}, one must feel free to consider narrow GNRs. It is worth noticing that considerable steps forward have been made in the technique scalability and processability. At the moment it is possible to synthesize over $1$ gram of ribbons in a single synthesis \\cite{Vo2014}. Quite long ($>200$ nm) ribbons can be synthesized and modified in solution\\cite{Narita2014} that allows their deposition on any conductive or isolative substrate. Recently heterojunctions in chevron-type nanoribbons were also produced and investigated\\cite{Cai2014}. All of these experimental efforts have resulted in the introduction of a new class of carbon nanostructures of a chevron type and their derivatives which are referred to by some authors as graphene nanowiggles. These structures have been attracting much attention in last years\\cite{CostaGirao2011,Girao2012,Huang2011,Liang2013a,Liang2012,Liang2013,Chen2010}, although their history can be traced back to the pioneering theoretical works \\cite{Wu2008,Sevincli2008b}.\n\nHere we investigate an effect of the in-plane homogeneous electric field for a subclass of chevron-type GNRs and compare it with the effect for ordinary GNRs having straight edges, e.g. GNRs of zigzag and armchair types.\nIn Section \\ref{Str} we introduce the structures under consideration and discuss their similarities and differences from those in other recent works\\cite{CostaGirao2011,Girao2012,Huang2011,Liang2013a,Liang2012,Liang2013}. We also discuss the connection of their description with that of straight GNRs. Section \\ref{Meth} is devoted to the method used. In Section \\ref{Res}  we report on our obtained results. Finally, in Section \\ref{Conc} we summarize our findings and present our conclusions.\n\n\n\n\n\n\\section{\\label{Str} Structures}\nIn what follows we will refer to structures being studied as jagged graphene nanoribbons (JGNRs). The main novelty of JGNR is so-called jags introduced in Ref.\\cite{Ihnatsenka2009}. However, in our case jags are placed asymmetrically on both side of the ribbon so that the mirror reflection symmetry with respect to the ribbon longitudinal axis is broken. Breaking of the reflection symmetry admits the existence of very narrow ribbons of such class without a host ribbon. They can be referred to as assembled graphene nanoribbons, if one wants to highlight the fact that they can be represented as a sequence of ordinary GNRs with straight edges connected at a specific angle that can be referred to as an apex one. In this regard JGNRs are like GNWs in papers\\cite{CostaGirao2011,Girao2012,Huang2011,Liang2013a,Liang2012,Liang2013}. However, GNWs can have a truncated jag form, while jag arms are always of equal lengths so that they are reflection symmetric with respect to the axis that is orthogonal to the longitudinal one. Conversely, JGNR edge form is always zigzag, whereas jag arms can be of different lengths. Zigzag just mentioned must not be confused with zigzag type of edge.\n\nTo describe a jag one needs two vectors ${\\mbox{\\mathversion{bold}${L}$}}_1$ and ${\\mbox{\\mathversion{bold}${L}$}}_2$. Their magnitudes correspond to the jag arm lengths, while the angle between them is the apex angle. In one respect, JGNR is even more simple than GNR with symmetric positioning of jags\\cite{Ihnatsenka2009} because one edge of JGNR can be obtained from another by mere translation on a certain vector, which is reasonable to determine as width vector ${\\mbox{\\mathversion{bold}${W}$}}$ (See Fig.\\ref{Characteristic_vectors}).\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig1.pdf}\n\\end{center}\n\\caption{\\label{Characteristic_vectors} JGNRs characteristic vectors for zigzag a)  and armchair b) ribbon orientations on a graphene sheet represented by ribbons Z60$\\langle 3,3;2 \\rangle$ and A60$\\langle 2,2;3 \\rangle$, respectively. Lines 2-2 and 1-1 (insets) show all possible zigzag (Z) and armchair (A) directions, respectively. ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ and ${\\mbox{\\mathversion{bold}${W}$}}$ are chief vectors, ${\\mbox{\\mathversion{bold}${\\ell}$}}_1$, ${\\mbox{\\mathversion{bold}${\\ell}$}}_2$ and ${\\mbox{\\mathversion{bold}${w}$}}$ are elementary vectors,  ${\\mbox{\\mathversion{bold}${a}$}}_1$ and ${\\mbox{\\mathversion{bold}${a}$}}_2$ are primitive translations of the graphene lattice, ${\\mbox{\\mathversion{bold}${T}$}}$ is the JGNR translation vector and $I_1$,$I_2$ are the centres of JGNR inversion symmetry.}\n\\end{figure*}\nThese three vectors describing the macrostructure of the superlattice are the chief vectors of JGNR, but they are still not connected with  the microstructure of JGNR, e.g. there is no reference to the graphene hexagon lattice. In the most general case they could be any lattice vectors having the form\n\n", "index": 1, "text": "\\begin{equation}\n{\\mbox{\\mathversion{bold}${C}$}} = n {\\mbox{\\mathversion{bold}${a}$}}_1 + m {\\mbox{\\mathversion{bold}${a}$}}_2;\n\\label{arbitrary_lattice_vector}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{${C}$}}=n{\\mbox{${a}$}}_{1}+m{\\mbox{${a}$}}_{2};\" display=\"block\"><mrow><mrow><mi>𝑪</mi><mo>=</mo><mrow><mrow><mi>n</mi><mo>⁢</mo><msub><mi>𝒂</mi><mn>1</mn></msub></mrow><mo>+</mo><mrow><mi>m</mi><mo>⁢</mo><msub><mi>𝒂</mi><mn>2</mn></msub></mrow></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere ${\\mbox{\\mathversion{bold}${v}$}}$ can be referred to as an elementary vector for the specified direction as $v_1$ and $v_2$ do not have common divisor except for unity. For two particular types of directions in the graphene lattice that are referred to as zigzag (Z) and armchair (A), the elementary vectors are the smallest possible having magnitudes of $\\sqrt{3} a_0$ and $3 a_0$, respectively, where $a_0$ is the distance between the nearest carbon atoms. Therefore, in this work we restrict the chief vectors ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ and ${\\mbox{\\mathversion{bold}${W}$}}$ only to these directions depicted by 2-2 and 1-1 lines in the Fig.\\ref{Characteristic_vectors}.\n\nAs a result, one can label any JGNR by a set of three integers corresponding to the chief vectors ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ and ${\\mbox{\\mathversion{bold}${W}$}}$. These integer indexes uniquely define JGNR if the set of elementary vectors is known (see Table \\ref{Elementary_vectors}).\n\\begin{table}\n\\caption{The coordinates of JGNR elementary vectors ${\\mbox{\\mathversion{bold}${\\ell}$}}_1$, ${\\mbox{\\mathversion{bold}${\\ell}$}}_2$ and ${\\mbox{\\mathversion{bold}${w}$}}$ in the basis of primitive translations of graphene lattice ${\\mbox{\\mathversion{bold}${a}$}}_1$ and ${\\mbox{\\mathversion{bold}${a}$}}_2$. }\\label{Elementary_vectors}\n\\begin{ruledtabular}\n\\begin{tabular}{lcccc}\n & Z60 & Z120 & A60 & A120 \\\\ \\hline\n${\\mbox{\\mathversion{bold}${\\ell}$}}_1$ & $(1,0)$ & $(1,-1)$ & $(2,-1)$ & $(2,-1)$ \\\\\n${\\mbox{\\mathversion{bold}${\\ell}$}}_2$ & $(0,1)$ & $(0,1)$ & $(1,1)$ & $(-1,2)$ \\\\\n${\\mbox{\\mathversion{bold}${w}$}}$ & $(1,1)$ & $(1,0)$ & $(1,0)$ & $(1,1)$ \\\\ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{table}\nFor one set of elementary vectors there is a manifold of index sets, therefore the set of elementary vectors can be considered as characteristic of a JGNR type. But the set of vectors are not so convenient for structure type labelling as an index set for ribbon one. Therefore, taking into account that structures corresponding to various vector sets differ from one another only by their edge types and apex angles, we propose the following notation \"t\"$ \\varphi$, where \"t\" stands for \"type\" and $\\varphi$ -- for the apex angle. If one demands the width vector to be a bisector of the apex angle, then both jag arms have the same type of edges, e.g. zigzag or armchair, and can be denoted as Z or A. Thus, all variety of JGNR is reduced to four types Z60, Z120, A60, A120 and within each type any ribbon is specified by index set $\\langle \\ell_1,\\ell_2;w \\rangle$ (see Fig.\\ref{JGNR types}).\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig2.pdf}\n\\end{center}\n\\caption{\\label{JGNR types} JGNRs types represented by ribbons Z60$\\langle 3,3;5 \\rangle$, Z120$\\langle  3,3;5 \\rangle$, A60$\\langle  3,3;5 \\rangle$ and A120$\\langle  3,3;5 \\rangle$, respectively.}\n\\end{figure*}\n\nBy means of the introduced vectors and indexes such quantities as JGNR superlattice translation vector ${\\mbox{\\mathversion{bold}${T}$}}$ and the number of atoms in the unit cell $N$ can be expressed:\n\\begin{eqnarray}\n{\\mbox{\\mathversion{bold}${T}$}} & = & {\\mbox{\\mathversion{bold}${L}$}}_1 - {\\mbox{\\mathversion{bold}${L}$}}_2; \\label{Translation} \\\\\nN & = & \\lambda w (\\ell_1 + \\ell_2);\n\\end{eqnarray}\nwhere $\\lambda = 2$ in case of JGNR Z60, Z120, A60, and $\\lambda = 6$ in case of JGNR A120. The difference in values of $\\lambda$ arises due to our intention to preserve inversion symmetry (There are two centres of such symmetry for each JGNR, see Fig.\\ref{Characteristic_vectors}) of the structures. A smaller step in the A-direction to increment width or smaller elementary vector for width can be determined, but then inversion symmetry on microstructure level for JGNR will be lost, as shown in Fig.\\ref{A120}. As one can see, there are three possible subtypes of JGNR A120 symmetric with respect to inversion operation, but only one of them, see Fig.\\ref{A120} a), can be rolled into a nanotube like JGNRs of other types and only such ribbons will be considered further.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig3.pdf}\n\\end{center}\n\\caption{\\label{A120} JGNRs A120 subtypes. Ribbons shown on a), b), c) are symmetric, because their opposite edges highlighted by red (top) and blue (bottom) can be superimposed by simple translation, e.g. they have inversion centres like $I_1$,$I_2$ in Fig.\\ref{Characteristic_vectors}. Ribbons depicted on d), e), f) are asymmetric due to different sorts of their opposite edges. Only a) and f) ribbons can be smoothly rolled into a nanotube. The framed ribbon is of the same A120 type as the one shown in Fig.\\ref{JGNR types} d).}\n\\end{figure*}\n\nSo far, only two points of view on the structure of JGNR were mentioned. On one hand, it can be represented as a sequence of ordinary straight GNR pieces concatenated at specific angles, but on the other hand it can be considered as an ordinary straight GNR with some triangle areas cut to produce jags, but there are some more of them, see Fig.\\ref{Widths}.\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig4.pdf}\n\\end{center}\n\\caption{\\label{Widths} JGNR Z60 $\\langle 5,5;6 \\rangle$ mapping onto straight GNRs, where $W$ -- JGNR and the straight ribbon width, $W_{eff}$ -- the effective ribbon width, $W_h$ -- the host ribbon width, $W_1$ -- the arm ribbon width.}\n\\end{figure*}\nTherefore the width  introduced above is not so a complete characteristic. However, on its basis one can determine others. For instance, an effective width, e.g. the width of the GNR that one cut some parts from to produce jagged edges, can be expressed as follows:\n\n", "itemtype": "equation", "pos": 10998, "prevtext": "\nwhere ${\\mbox{\\mathversion{bold}${a}$}}_1$ and ${\\mbox{\\mathversion{bold}${a}$}}_2$ are the primitive translations of the graphene lattice. Introducing the greatest common divisor ($d$) of $n$ and $m$, one can rewrite Eq.(\\ref{arbitrary_lattice_vector}) in the form\n\n", "index": 3, "text": "\\begin{equation}\n{\\mbox{\\mathversion{bold}${C}$}} = d \\left(v_1 {\\mbox{\\mathversion{bold}${a}$}}_1 + v_2 {\\mbox{\\mathversion{bold}${a}$}}_2\\right) = d {\\mbox{\\mathversion{bold}${v}$}};\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{${C}$}}=d\\left(v_{1}{\\mbox{${a}$}}_{1}+v_{2}{\\mbox{${a}$}}_{2}\\right)=d%&#10;{\\mbox{${v}$}};\" display=\"block\"><mrow><mrow><mi>𝑪</mi><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>v</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>𝒂</mi><mn>1</mn></msub></mrow><mo>+</mo><mrow><msub><mi>v</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>𝒂</mi><mn>2</mn></msub></mrow></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mi>𝒗</mi></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere ${\\mbox{\\mathversion{bold}${P}$}}_{1(2)}  =  {\\mbox{\\mathversion{bold}${L}$}}_{1(2)} + {\\mbox{\\mathversion{bold}${W}$}}$. This definition is independent on choice of vector ${\\mbox{\\mathversion{bold}${L}$}}_1$ or ${\\mbox{\\mathversion{bold}${L}$}}_2$ and is useful for result comparison to clarify the role of jags in electronic properties of JGNR. Other characteristics closely related to the width are widths of the JGNR arm ribbons which have the form of\n\n", "itemtype": "equation", "pos": 16954, "prevtext": "\nwhere ${\\mbox{\\mathversion{bold}${v}$}}$ can be referred to as an elementary vector for the specified direction as $v_1$ and $v_2$ do not have common divisor except for unity. For two particular types of directions in the graphene lattice that are referred to as zigzag (Z) and armchair (A), the elementary vectors are the smallest possible having magnitudes of $\\sqrt{3} a_0$ and $3 a_0$, respectively, where $a_0$ is the distance between the nearest carbon atoms. Therefore, in this work we restrict the chief vectors ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ and ${\\mbox{\\mathversion{bold}${W}$}}$ only to these directions depicted by 2-2 and 1-1 lines in the Fig.\\ref{Characteristic_vectors}.\n\nAs a result, one can label any JGNR by a set of three integers corresponding to the chief vectors ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ and ${\\mbox{\\mathversion{bold}${W}$}}$. These integer indexes uniquely define JGNR if the set of elementary vectors is known (see Table \\ref{Elementary_vectors}).\n\\begin{table}\n\\caption{The coordinates of JGNR elementary vectors ${\\mbox{\\mathversion{bold}${\\ell}$}}_1$, ${\\mbox{\\mathversion{bold}${\\ell}$}}_2$ and ${\\mbox{\\mathversion{bold}${w}$}}$ in the basis of primitive translations of graphene lattice ${\\mbox{\\mathversion{bold}${a}$}}_1$ and ${\\mbox{\\mathversion{bold}${a}$}}_2$. }\\label{Elementary_vectors}\n\\begin{ruledtabular}\n\\begin{tabular}{lcccc}\n & Z60 & Z120 & A60 & A120 \\\\ \\hline\n${\\mbox{\\mathversion{bold}${\\ell}$}}_1$ & $(1,0)$ & $(1,-1)$ & $(2,-1)$ & $(2,-1)$ \\\\\n${\\mbox{\\mathversion{bold}${\\ell}$}}_2$ & $(0,1)$ & $(0,1)$ & $(1,1)$ & $(-1,2)$ \\\\\n${\\mbox{\\mathversion{bold}${w}$}}$ & $(1,1)$ & $(1,0)$ & $(1,0)$ & $(1,1)$ \\\\ \n\\end{tabular}\n\\end{ruledtabular}\n\\end{table}\nFor one set of elementary vectors there is a manifold of index sets, therefore the set of elementary vectors can be considered as characteristic of a JGNR type. But the set of vectors are not so convenient for structure type labelling as an index set for ribbon one. Therefore, taking into account that structures corresponding to various vector sets differ from one another only by their edge types and apex angles, we propose the following notation \"t\"$ \\varphi$, where \"t\" stands for \"type\" and $\\varphi$ -- for the apex angle. If one demands the width vector to be a bisector of the apex angle, then both jag arms have the same type of edges, e.g. zigzag or armchair, and can be denoted as Z or A. Thus, all variety of JGNR is reduced to four types Z60, Z120, A60, A120 and within each type any ribbon is specified by index set $\\langle \\ell_1,\\ell_2;w \\rangle$ (see Fig.\\ref{JGNR types}).\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig2.pdf}\n\\end{center}\n\\caption{\\label{JGNR types} JGNRs types represented by ribbons Z60$\\langle 3,3;5 \\rangle$, Z120$\\langle  3,3;5 \\rangle$, A60$\\langle  3,3;5 \\rangle$ and A120$\\langle  3,3;5 \\rangle$, respectively.}\n\\end{figure*}\n\nBy means of the introduced vectors and indexes such quantities as JGNR superlattice translation vector ${\\mbox{\\mathversion{bold}${T}$}}$ and the number of atoms in the unit cell $N$ can be expressed:\n\\begin{eqnarray}\n{\\mbox{\\mathversion{bold}${T}$}} & = & {\\mbox{\\mathversion{bold}${L}$}}_1 - {\\mbox{\\mathversion{bold}${L}$}}_2; \\label{Translation} \\\\\nN & = & \\lambda w (\\ell_1 + \\ell_2);\n\\end{eqnarray}\nwhere $\\lambda = 2$ in case of JGNR Z60, Z120, A60, and $\\lambda = 6$ in case of JGNR A120. The difference in values of $\\lambda$ arises due to our intention to preserve inversion symmetry (There are two centres of such symmetry for each JGNR, see Fig.\\ref{Characteristic_vectors}) of the structures. A smaller step in the A-direction to increment width or smaller elementary vector for width can be determined, but then inversion symmetry on microstructure level for JGNR will be lost, as shown in Fig.\\ref{A120}. As one can see, there are three possible subtypes of JGNR A120 symmetric with respect to inversion operation, but only one of them, see Fig.\\ref{A120} a), can be rolled into a nanotube like JGNRs of other types and only such ribbons will be considered further.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig3.pdf}\n\\end{center}\n\\caption{\\label{A120} JGNRs A120 subtypes. Ribbons shown on a), b), c) are symmetric, because their opposite edges highlighted by red (top) and blue (bottom) can be superimposed by simple translation, e.g. they have inversion centres like $I_1$,$I_2$ in Fig.\\ref{Characteristic_vectors}. Ribbons depicted on d), e), f) are asymmetric due to different sorts of their opposite edges. Only a) and f) ribbons can be smoothly rolled into a nanotube. The framed ribbon is of the same A120 type as the one shown in Fig.\\ref{JGNR types} d).}\n\\end{figure*}\n\nSo far, only two points of view on the structure of JGNR were mentioned. On one hand, it can be represented as a sequence of ordinary straight GNR pieces concatenated at specific angles, but on the other hand it can be considered as an ordinary straight GNR with some triangle areas cut to produce jags, but there are some more of them, see Fig.\\ref{Widths}.\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.8]{fig4.pdf}\n\\end{center}\n\\caption{\\label{Widths} JGNR Z60 $\\langle 5,5;6 \\rangle$ mapping onto straight GNRs, where $W$ -- JGNR and the straight ribbon width, $W_{eff}$ -- the effective ribbon width, $W_h$ -- the host ribbon width, $W_1$ -- the arm ribbon width.}\n\\end{figure*}\nTherefore the width  introduced above is not so a complete characteristic. However, on its basis one can determine others. For instance, an effective width, e.g. the width of the GNR that one cut some parts from to produce jagged edges, can be expressed as follows:\n\n", "index": 5, "text": "\\begin{equation}\n{\\mbox{\\mathversion{bold}${W}$}}_{eff}  = \\frac{ {\\mbox{\\mathversion{bold}${T}$}} \\times {\\mbox{\\mathversion{bold}${P}$}}_{1(2)} \\times {\\mbox{\\mathversion{bold}${T}$}}}{{\\mbox{\\mathversion{bold}${T}$}}^2}\\, ,\n\\label{Effective_width}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{${W}$}}_{eff}=\\frac{{\\mbox{${T}$}}\\times{\\mbox{${P}$}}_{1(2)}\\times{%&#10;\\mbox{${T}$}}}{{\\mbox{${T}$}}^{2}}\\,,\" display=\"block\"><mrow><mrow><msub><mi>𝑾</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><mi>𝑻</mi><mo>×</mo><msub><mi>𝑷</mi><mrow><mn>1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>×</mo><mi>𝑻</mi></mrow><msup><mi>𝑻</mi><mn>2</mn></msup></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nFor the present paper, as the width vector was chosen to be the bisector of the apex angle, these two quantities defined by Eq.(\\ref{Arm_width}) are equivalent. Finally, one can think about some JGNRs as a host ribbon with attached triangle fragments on both sides (see Fig.\\ref{Widths}), therefore for quite wide JGNR one can introduce a host ribbon width:\n\n", "itemtype": "equation", "pos": 17683, "prevtext": "\nwhere ${\\mbox{\\mathversion{bold}${P}$}}_{1(2)}  =  {\\mbox{\\mathversion{bold}${L}$}}_{1(2)} + {\\mbox{\\mathversion{bold}${W}$}}$. This definition is independent on choice of vector ${\\mbox{\\mathversion{bold}${L}$}}_1$ or ${\\mbox{\\mathversion{bold}${L}$}}_2$ and is useful for result comparison to clarify the role of jags in electronic properties of JGNR. Other characteristics closely related to the width are widths of the JGNR arm ribbons which have the form of\n\n", "index": 7, "text": "\\begin{equation}\n{\\mbox{\\mathversion{bold}${W}$}}_{1(2)}  =  \\frac{ {\\mbox{\\mathversion{bold}${L}$}}_{1(2)} \\times {\\mbox{\\mathversion{bold}${W}$}} \\times {\\mbox{\\mathversion{bold}${L}$}}_{1(2)}}{{\\mbox{\\mathversion{bold}${L}$}}_{1(2)}^2}\\, .\n\\label{Arm_width}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{${W}$}}_{1(2)}=\\frac{{\\mbox{${L}$}}_{1(2)}\\times{\\mbox{${W}$}}\\times{%&#10;\\mbox{${L}$}}_{1(2)}}{{\\mbox{${L}$}}_{1(2)}^{2}}\\,.\" display=\"block\"><mrow><mrow><msub><mi>𝑾</mi><mrow><mn>1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msub><mi>𝑳</mi><mrow><mn>1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>×</mo><mi>𝑾</mi><mo>×</mo><msub><mi>𝑳</mi><mrow><mn>1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><msubsup><mi>𝑳</mi><mrow><mn>1</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></msubsup></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nEquating the right hand side of Eq.(\\ref{Host_width}) to zero, one can easily obtain the criterion for the host ribbon presence in the structure for each type of JGNRs: Z60 $\\ell \\geq 2w$, Z120 $\\ell \\geq 2 w$, A60 $\\ell > 2 w/3$, A120 $\\ell \\geq 2w$. Such simple mapping of JGNR onto ordinary straight GNRs is only possible in symmetric case when $\\ell_1 = \\ell_2$. As for the asymmetric case, it is more complicated, because the effective, the host and the straight ribbons become specific JGNRs with low values of indexes. Additionally, this mapping would be of no practical use for ribbons from the same class that can be compared straightforwardly.\n\n\n\\section{\\label{Meth} Method}\nThe electronic structure of the presented JGNRs was investigated within the orthogonal tight-binding model for $\\pi$-electrons. Electronic bands were obtained as eigenvalues for the matrix Hamiltonian $H$ with elements of the following form:\n\n", "itemtype": "equation", "pos": 18317, "prevtext": "\nFor the present paper, as the width vector was chosen to be the bisector of the apex angle, these two quantities defined by Eq.(\\ref{Arm_width}) are equivalent. Finally, one can think about some JGNRs as a host ribbon with attached triangle fragments on both sides (see Fig.\\ref{Widths}), therefore for quite wide JGNR one can introduce a host ribbon width:\n\n", "index": 9, "text": "\\begin{equation}\n{\\mbox{\\mathversion{bold}${W}$}}_{h}  = 2 {\\mbox{\\mathversion{bold}${W}$}} - {\\mbox{\\mathversion{bold}${W}$}}_{eff}\\,.\n\\label{Host_width}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{${W}$}}_{h}=2{\\mbox{${W}$}}-{\\mbox{${W}$}}_{eff}\\,.\" display=\"block\"><mrow><mrow><msub><mi>𝑾</mi><mi>h</mi></msub><mo>=</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>𝑾</mi></mrow><mo>-</mo><mpadded width=\"+1.7pt\"><msub><mi>𝑾</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere ${\\mbox{\\mathversion{bold}${r}$}}_{nij}$ is a vector pointing the $j$-th position of the $i$-th order  nearest neighbour from the $n$-th atom position in the unit cell of the structure, ${\\mbox{\\mathversion{bold}${r}$}}_{nq}$ is a radius-vector pointing the position of the $n$-th atom in the $q$-th unit cell.\nWithin the tight-binding model, the so-called hopping integral $t_{ni}$ for $n$-th atom in the unit cell of the structure is expressed as\n\n", "itemtype": "equation", "pos": 19415, "prevtext": "\nEquating the right hand side of Eq.(\\ref{Host_width}) to zero, one can easily obtain the criterion for the host ribbon presence in the structure for each type of JGNRs: Z60 $\\ell \\geq 2w$, Z120 $\\ell \\geq 2 w$, A60 $\\ell > 2 w/3$, A120 $\\ell \\geq 2w$. Such simple mapping of JGNR onto ordinary straight GNRs is only possible in symmetric case when $\\ell_1 = \\ell_2$. As for the asymmetric case, it is more complicated, because the effective, the host and the straight ribbons become specific JGNRs with low values of indexes. Additionally, this mapping would be of no practical use for ribbons from the same class that can be compared straightforwardly.\n\n\n\\section{\\label{Meth} Method}\nThe electronic structure of the presented JGNRs was investigated within the orthogonal tight-binding model for $\\pi$-electrons. Electronic bands were obtained as eigenvalues for the matrix Hamiltonian $H$ with elements of the following form:\n\n", "index": 11, "text": "\\begin{equation}\nH_{nn^\\prime} = \\sum_{i,j,q}  t_{ni} \\exp \\left(i {\\mbox{\\mathversion{bold}${k}$}} {\\mbox{\\mathversion{bold}${r}$}}_{nij} \\right) \\delta_{ \\scriptsize {\\mbox{\\mathversion{bold}${r}$}}_{n^{\\vphantom{\\prime}}ij}, {\\mbox{\\mathversion{bold}${r}$}}_{n^{\\vphantom{\\prime}}1} - {\\mbox{\\mathversion{bold}${r}$}}_{n^\\prime q}} \\, \\label{matrixHamiltonian}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"H_{nn^{\\prime}}=\\sum_{i,j,q}t_{ni}\\exp\\left(i{\\mbox{${k}$}}{\\mbox{${r}$}}_{nij%&#10;}\\right)\\delta_{\\scriptsize{\\mbox{${r}$}}_{nij},{\\mbox{${r}$}}_{n1}-{\\mbox{${r%&#10;}$}}_{n^{\\prime}q}}\\,\" display=\"block\"><mrow><msub><mi>H</mi><mrow><mi>n</mi><mo>⁢</mo><msup><mi>n</mi><mo>′</mo></msup></mrow></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>,</mo><mi>j</mi><mo>,</mo><mi>q</mi></mrow></munder><mrow><msub><mi>t</mi><mrow><mi>n</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mrow><mi>𝒌</mi><mi>𝒓</mi></mrow><mrow><mi>n</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>δ</mi><mrow><msub><mi>𝒓</mi><mrow><mi>n</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>,</mo><mrow><msub><mi>𝒓</mi><mrow><mi>n</mi><mo>⁢</mo><mn>1</mn></mrow></msub><mo>-</mo><msub><mi>𝒓</mi><mrow><msup><mi>n</mi><mo>′</mo></msup><mo>⁢</mo><mi>q</mi></mrow></msub></mrow></mrow></msub></mpadded></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere $\\hat{H}$ is a system Hamiltonian, $\\phi_n$ is an atomic orbital of the $n$-th atom and $i$ can be referred to as the neighbour order. \nIn the presence of an external field the Hamiltonian takes form\n\n", "itemtype": "equation", "pos": 20249, "prevtext": "\nwhere ${\\mbox{\\mathversion{bold}${r}$}}_{nij}$ is a vector pointing the $j$-th position of the $i$-th order  nearest neighbour from the $n$-th atom position in the unit cell of the structure, ${\\mbox{\\mathversion{bold}${r}$}}_{nq}$ is a radius-vector pointing the position of the $n$-th atom in the $q$-th unit cell.\nWithin the tight-binding model, the so-called hopping integral $t_{ni}$ for $n$-th atom in the unit cell of the structure is expressed as\n\n", "index": 13, "text": "\\begin{equation}\nt_{ni} = \\langle \\phi_n | \\hat{H} | \\phi_{n+i} \\rangle\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"t_{ni}=\\langle\\phi_{n}|\\hat{H}|\\phi_{n+i}\\rangle\\,,\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mrow><mi>n</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>ϕ</mi><mi>n</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi>ϕ</mi><mrow><mi>n</mi><mo>+</mo><mi>i</mi></mrow></msub><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere $\\hat{H}_0$ is the Hamiltonian of the system without external field, $\\hat{U}=-e{\\mbox{\\mathversion{bold}${E}$}}{\\mbox{\\mathversion{bold}${r}$}}$ is the potential energy operator for a homogeneous electric field. Taking this into account one has $t_{ni}=t_{ni,0} + \\delta t_{ni}$, with $\\delta t_{ni} = \\langle \\phi_n | \\hat{U} | \\phi_{n+i} \\rangle $. Note that the external electric field is much less than the atomic one, i.e.,\n\n", "itemtype": "equation", "pos": 20546, "prevtext": "\nwhere $\\hat{H}$ is a system Hamiltonian, $\\phi_n$ is an atomic orbital of the $n$-th atom and $i$ can be referred to as the neighbour order. \nIn the presence of an external field the Hamiltonian takes form\n\n", "index": 15, "text": "\\begin{equation}\n\\hat{H} = \\hat{H}_0 + \\hat{U}\\, ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\hat{H}=\\hat{H}_{0}+\\hat{U}\\,,\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mo>=</mo><mrow><msub><mover accent=\"true\"><mi>H</mi><mo stretchy=\"false\">^</mo></mover><mn>0</mn></msub><mo>+</mo><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>U</mi><mo stretchy=\"false\">^</mo></mover></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\nwhere $t_{n1,0} \\approx 3$ eV, $a_0=1.42\\mathring{\\mbox{A}}$.\nThis allows one to neglect any change in the atomic orbitals $\\phi_{n},\\phi_{n+i}$ due to the field. It is also worth mentioning that we do not expect large field enhancement at the sharp ends of jags as their sizes in the structures considered are about $5$nm, which is quite small, and they are arranged periodically in an infinite line so that their influence on each other averages and reduces the resulting field.\n\nAs we are interested in the pure effect of the jagged edges and its influence on electronic properties of JGNRs, we eliminate possible differences of hopping integrals at various sites within unit cell so that $t_{ni} = t_i;\\, t_{ni,0} = t_{i,0} ; \\, \\delta t_{ni} = \\delta t_i$. In fact, the model of ideal geometry was implemented, which is close to the real geometry of the structure when dangling sp$^2$ bonds at JGNR edges are passivated with H atoms to form a strong C-H $\\sigma$-bonds. Nearest-neighbor C-H matrix elements associated with these H-atoms do not appear explicitly in $H_0$ because these $\\sigma$ orbitals are symmetric with respect to the nodal plane of the $\\pi$-orbitals and hence decouple from the $\\pi$-conduction bands described by $H_0$. Also, because C forms a strong covalent bond with H, the $\\sigma$ and $\\sigma^{\\ast}$ bands associated with these bonds lie far from $E_F$ and hence need not be considered further.\n\nIt is worth noting that on one hand hopping integral values at the edge can differ from those in the GNR interior so that it could cause band gap opening in armchair GNR\\cite{PhysRevLett.97.216803}. But on the other hand, the same band gap opening can be explained by accounting for higher order hopping integrals\\cite{White2007}. A more accurate model taking into account both effects was reported latter\\cite{Gunlycke2008}. Interestingly, a more precise model accounting for edge distortions showed that this effect leads to a small correction only for armchair ribbons of $3n$ series. However, it is very unlikely that this small correction to the band gap does affect its tunability. Therefore, admitting an error for the band gap of no more than $10$\\%,  the nearest neighbours up to the third order were taken into account and model parameters were chosen as proposed in the paper\\cite{White2007}: $t_{0,0} = 0$ eV, $t_{1,0} = -3.2$ eV, $t_{2,0} = 0$ eV $t_{3,0} = -0.3$ eV. \n\n\nIn the present paper we neglect screening effect and assume that applied field influences directly each lattice site. It seems reasonable for strong electric fields. However, for weak fields one should keep in mind that the values presented should be interpreted as a value of an effective field.\n\nThe applied electric field contributes mainly to the site energy $ t_{0}$. In fact, there are additional terms for higher order hopping integrals $\\delta t_{1 \\ldots \\infty}$. To assess them one can  approximate carbon $\\pi$-orbitals by $p_z$ wave functions of the hydrogen like atom\\cite{Partoens2006}:\n\\begin{widetext}\n\n", "itemtype": "equation", "pos": 21048, "prevtext": "\nwhere $\\hat{H}_0$ is the Hamiltonian of the system without external field, $\\hat{U}=-e{\\mbox{\\mathversion{bold}${E}$}}{\\mbox{\\mathversion{bold}${r}$}}$ is the potential energy operator for a homogeneous electric field. Taking this into account one has $t_{ni}=t_{ni,0} + \\delta t_{ni}$, with $\\delta t_{ni} = \\langle \\phi_n | \\hat{U} | \\phi_{n+i} \\rangle $. Note that the external electric field is much less than the atomic one, i.e.,\n\n", "index": 17, "text": "\\begin{equation}\neE \\ll  \\frac{t_{n1,0}}{a_0} \\, ,\n\\label{field_crit}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"eE\\ll\\frac{t_{n1,0}}{a_{0}}\\,,\" display=\"block\"><mrow><mrow><mrow><mi>e</mi><mo>⁢</mo><mi>E</mi></mrow><mo>≪</mo><mpadded width=\"+1.7pt\"><mfrac><msub><mi>t</mi><mrow><mrow><mi>n</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mn>0</mn></mrow></msub><msub><mi>a</mi><mn>0</mn></msub></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05488.tex", "nexttext": "\n\\end{widetext}\nwhere $Z=6$ (for carbon), $a_B$ is the Borh radius and $\\theta$ is the polar angle measured from the $z$-direction (in spherical coordinate system), and calculate the ratios $\\delta t_{i}/ t_{i,0}$. Obviously, the value obtained for $i = 0$ is of greater significance than any other. That is why we adopted $\\delta t_{1 \\ldots \\infty} \\approx 0$, $\\delta t_{0} = - {\\mbox{\\mathversion{bold}${E}$}} {\\mbox{\\mathversion{bold}${r}$}}$ eV.\n\n\nThe band gap dependence on applied electric field was investigated for electric strength magnitudes up to the $0.1$ V/$\\mathring{\\mbox{A}}$ $ = 1$ V/nm. This value is $10$ times less than typical strength used in field emission calculations\\cite{Tada2002,Araidai2004}, but corresponds to the breakdown strength of electric field in SiO$_2$\\cite{DiMaria1993}. Even though it seems to be a quite high magnitude of field, it must be noticed that it still meets the requirement of Eq.(\\ref{field_crit}). It is often chosen as a natural upper limit by others\\cite{Castro2007,Sahu2008,Huang2008} for the electric field applied normally to the plane of the structure. Thus, our choice makes for an easier comparison of the two field arrangements. It is worth noting that break down values are very sensitive to the material used. For instance, in experimental work\\cite{Yu2013} it was possible to increase the value more than twice by using a combination of SiO$_2$ with HfO$_2$, so that the resulting value was $\\sim 0.033$ V/$\\mathring{\\mbox{A}}$, that is only $3$ times lower than mentioned above.  \n\n\n\\section{\\label{Res} Results}\nLet us now consider typical JGNR band structures and their changes in an external electric field. Throughout this paper all ribbons are assumed to be laying in the $xy$-plane and the $y$-axis is collinear with the ribbon translation vector so that transverse electric field strength has only one non-zero component $\\varepsilon_x$. In Fig.\\ref{Field_Effect}, one can see that the most profound changes take place for JGNR Z60 and A120. In the first case, one deals with a band gap opening while in the second case -- with a band gap closing. Surprisingly, there are no observable changes for band gaps of JGNR Z120 and A60. However, some alterations in Z120 and A60 band structures can be noticed. For the sake of the clarity of the discussion, let us take the following convention: all band are numbered by indexes $J$ so that the first conduction band corresponds to $J=1$ and first valence to $J=-1$ and so on. Then it can be pointed out that a profound splitting takes place at the edge of the Z120 Brillouin zone for bands $J=\\pm 1$ and $J=\\pm 2$, respectively. Similar splitting but of less magnitude and shifted towards the center of Brillouin zone is observed for A60 bands $J=\\pm 2$ and $J=\\pm 3$, correspondingly. With respect to the ribbon A60 one must confess that the least variations occur for bands $J=\\pm 1$ compared to equivalent bands of other ribbons presented. It means that the effective mass of charge carriers changes only slightly due to the presence of a transverse electric field. In the case of Z120 ribbons the change of the effective mass for low doping concentrations should also be negligible. However, more significant changes take place for ribbons Z60 and A120. In both cases profound band bending can be observed for the magnitude of electric field $\\varepsilon_x = 0.05 $~V/$\\mathring{\\mbox{A}}$. In general it can be seen that the influence of the field is stronger at the edge of Brillouin zone, as has already been shown in nanotube and nanohelix superlattice properties analysis, which is very relevant to a JGNR in the external electric field as it creates for JGNR's electron a periodic electrostatic potential similar to that discussed in papers\\cite{Kibis2005a,Kibis2005,Batrakov2010}.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig5.pdf}\n\\end{center}\n\\caption{\\label{Field_Effect} The effect of a transverse electric field $\\varepsilon_x$  on the band structure of four types of JGNRs, where $E_F$ -- the Fermi energy. $k$ is expressed in the units of $1/T$ everywhere.}\n\\end{figure*}\n\nNext we consider the band gap dependence on the magnitude of the transverse electric field in more detail. Let us proceed with the JGNR Z60. For Fig.\\ref{Field_Effect_Z60} we took a bit wider ribbon Z60 $\\langle 3,3;9 \\rangle $ to show that for a high value of the electric field strength of about $0.06$~V/$\\mathring{\\mbox{A}}$  the band gap closing can be observed. The next feature that can be noticed in Fig.\\ref{Field_Effect_Z60} is dispersionless bands, whose positions clearly correlate with the magnitude of the external field. These bands arise from zigzag edge states reported in the paper\\cite{Fujita1996}. However, as JGNR is a superlattice with a longer translation period, its band structure if one does not take into account interactions leading to band anticrossing is a folded structure of straight GNR with zigzag edges (ZGNR). As one can see, due to such folding these bands are absolutely dispersionless through out the whole Brillouin zone compared to ZGNR where edge bands are dispersionless only though the $1/3$ of Brillouin zone. Changing the superlattice period of translation ${\\mbox{\\mathversion{bold}${T}$}}$ by means of jag arms ${\\mbox{\\mathversion{bold}${L}$}}_1$, ${\\mbox{\\mathversion{bold}${L}$}}_2$ (see Eq.\\ref{Translation}) one can control a number of foldings or put in other words a number of dispersionless bands. Without the external electric field almost all of them are degenerate, but with a switched on field their splitting is observed. These bands must result in sharp peaks in the density of states, whose positions in turn must be field dependent as well. However, as one can see from Fig.\\ref{Field_Effect_Z60} for the high magnitude of electric strength of about $0.06$~V/$\\mathring{\\mbox{A}}$ they drown among multitude of other bands. But for narrower ribbons Z60 the density of states arising from all other bands except edge ones around the Fermi level is low in a quite wide region from $-1$ to $1$ eV, see Fig.\\ref{Splitting_Z60}. It means that the peaks should act in this region as energy levels and we showed it for JGNR Z60 with $w=6$ in Fig.\\ref{Splitting_Z60}. Taking into account all the just mentioned results, we predict that for JGNR Z60 with $w=4,..,8$  in an external transverse electric field, a series of electromagnetic emission and absorption lines will be observed and the number of lines will be consistent with ${\\mbox{\\mathversion{bold}${T}$}}$. We tested that this result remains true for asymmetric JGNRs Z60 characterized by indexes $\\ell_1 \\neq \\ell_2$ and for JGNRs Z60 of a slightly different structure, see the Appendix \\ref{App}.\n\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig6.pdf}\n\\end{center}\n\\caption{\\label{Field_Effect_Z60} The band structure evolution for increasing magnitude of transverse electric field for JGNRs Z60 $\\langle 3,3;9\\rangle$ (left) and atomic structure of the ribbon (right).}\n\\end{figure*} \n\n\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig7.pdf}\n\\end{center}\n\\caption{\\label{Splitting_Z60} The splitting of dispersionless bands in the transverse electric field for JGNRs Z60 $\\langle 3,3;6\\rangle, \\langle 5,5;6 \\rangle, \\langle 7,7;6 \\rangle $. DOS -- normalized density of states.}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig8.pdf}\n\\end{center}\n\\caption{\\label{Field_Effect_A120} The band structure evolution for increasing magnitude of transverse electric field for JGNRs A120 $\\langle 3,3;6\\rangle$ (left) and atomic structure of the ribbon (right).}\n\\end{figure*}\n\nConsidering in Fig.\\ref{Field_Effect_A120} the band gap closing for JGNR A120, one must notice that this closing takes place owing to the splitting of bands $J=\\pm 1,\\pm 2$ at the edge of the Brillouin zone. This splitting leads to the band gap shift in $k$-space from $k=0$ for $\\varepsilon_x=0$~V/$\\mathring{\\mbox{A}}$ to the region $k > \\pi/2$ for $\\varepsilon_x=0.06$~V/$\\mathring{\\mbox{A}}$. Although there are some bands with low dispersion near energies $\\pm 1$ eV their positions are not affected by the applied electric field. On the contrary, the almost flatness of the bands $J=\\pm 1$ can be achieved for $\\varepsilon_x=0.06$~V/$\\mathring{\\mbox{A}}$ in $k$-space from $k=\\pi/2$ to $k=\\pi$. It is very useful because it must increase the probability of interband transitions with frequency exactly corresponding to the band gap due to higher density of states on its both sides.\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig9.pdf}\n\\end{center}\n\\caption{\\label{BandgapVsElectricfield} The band gap $E_g$ dependence on the magnitude of transverse electric field $\\varepsilon_x$ for symmetric JGNR Z60 a), b) and A120 c), d) with various width and jag arm indexes $w$, $\\ell_1 = \\ell_2$, correspondingly.}\n\\end{figure*}\n\nIt is very interesting to see how the dependence of the band gap on transverse electric field is affected by symmetric JGNR parameters $w$ and $\\ell_1 = \\ell_2$. These results are presented for JGNRs Z60 and A120 in Fig.\\ref{BandgapVsElectricfield}.\nAs it can be seen from Fig.\\ref{BandgapVsElectricfield} a) the maximum value of the band gap opening $(\\sim 0.6\\mbox{ eV})$ is higher for the narrower ribbon with $w=7$ but it is attainable for stronger transverse electric field ($~0.04$~V/$\\mathring{\\mbox{A}}$) compared to Z60 $\\langle 3,3;8\\rangle$ and $\\langle 3,3;9\\rangle$, besides for the specified ribbon the band gap cannot be closed within the restricted range $<0.1$~V/$\\mathring{\\mbox{A}}$ as for ribbon Z60 $\\langle 3,3;9\\rangle$. For a low strength field $<0.02$~V/$\\mathring{\\mbox{A}}$ the band gap opening for narrower Z60 is a bit less than for wider ones, but it results in more significant divergence for greater difference of width indexes. The influence of jag arm index on the band gap opening of the ribbon Z60 shown in Fig.\\ref{BandgapVsElectricfield} b) is opposite to what was just mentioned. For higher indexes the maximum value increases and drifts to greater values of $\\varepsilon_x$ while band gap closing at $\\varepsilon_x = 0.1$~V/$\\mathring{\\mbox{A}}$ is not affected by them. In low strength fields the difference in band gap opening is almost negligible.\n\nAccording to Fig.\\ref{BandgapVsElectricfield} c) the band gap closing does not take place immediately, and JGNRs A120 $\\langle 3,3;6 \\rangle$ are quite resistant to low electric fields with $\\varepsilon_x < 0.02$~V/$\\mathring{\\mbox{A}}$. However this resistance decreases if the width index increases that leads to lower values of electric strength required to close the band gap completely: $\\varepsilon_x = 0.055$~V/$\\mathring{\\mbox{A}}$ for A120 $\\langle 3,3;8 \\rangle$ and $\\varepsilon_x = 0.08$~V/$\\mathring{\\mbox{A}}$ for A120 $\\langle 3,3;6 \\rangle$. Another fascinating feature of the ribbons  is the peak in the band gap dependence on electric field strength observed for A120 $\\langle 3,3;7 \\rangle$ at $\\varepsilon_x = 0.85$~V/$\\mathring{\\mbox{A}}$. This peak position shifts to lower magnitudes of $\\varepsilon_x$ as the width index $w$ increases while its height seems to remain unaffected. This is quite strange taking into account that there is an obvious decrease of initial values of the band gap, e.g. for $\\varepsilon_x = 0$~V/$\\mathring{\\mbox{A}}$, for greater indexes $w$. Compared to this case the data presented in Fig.\\ref{BandgapVsElectricfield} d) are very different. While the decrease of initial values of the band gap for incremented jag arm indexes $\\ell_1$ and $\\ell_2$ is less than in Fig.\\ref{BandgapVsElectricfield} c) for increasing $w$ the resistance to the band gap closing is of the same measure, e.g. achieved at $\\varepsilon_x = 0.053$~V/$\\mathring{\\mbox{A}}$ for A120 $\\langle 7,7;6 \\rangle$. This value is compared to the value for A120 $\\langle 3,3;8 \\rangle$, however in the case of A120 $\\langle 7,7;6 \\rangle$ one closes a wider band gap. In Fig.\\ref{BandgapVsElectricfield} d) a peak similar to that one in Fig.\\ref{BandgapVsElectricfield} c) in dependence of $E_g$ on $\\varepsilon_x$ is manifested. Its position shifts to lower $\\varepsilon_x$ for greater $\\ell_{1}$, $\\ell_{2}$ and it resembles behaviour of the peak in Fig.\\ref{BandgapVsElectricfield} c) but its height decreases if jag arms indexes $\\ell_{1}$,$\\ell_{2}$ both increase. \n\nIt is obvious that the dependences $E_g(\\varepsilon_x)$ for Z60 and A120 JGNRs presented in Fig. \\ref{BandgapVsElectricfield} cannot be described by simple functions, however they can be approximated by polynomials that are truncated Taylor series. Quite easily one can specify the regions where two or three terms of Taylor expansion are necessary for a reasonable approximation. These regions correspond to liner and quadratic dependences $E_g(\\varepsilon_x)$ and a good knowledge about them is of great importance for possible application in linear and non-linear devices, therefore we calculated the parameters characterizing the rate of the band gap opening/closing and presented them in Table \\ref{tab2fig9}. Moreover, Table \\ref{tab2fig9} enables comparison between two types of ribbons, which is difficult to do by means of plotting. Although it might seem strange to compare different patterns we want to notice that ribbon A120 placed in sufficiently strong electric field so that the point of complete band gap closing, for instance $\\varepsilon_x=0.08$~V/$\\mathring{\\mbox{A}}$ for A120 $\\langle 3,3;6 \\rangle$, is achieved can work in the same regime as Z60 ribbon --- metal--dielectric transition for decreasing field. As can be clearly seen from the Table \\ref{tab2fig9} the absolute value of $\\beta$ is larger for all Z60 than for A120 ribbons presented in the Table \\ref{tab2fig9}, that means their band gaps can be controlled more efficiently.\n\\begin{table*}\n\\caption{Fitting of linear and quadratic regions of $E_g(\\varepsilon_x)$ curves for JGNRs presented in Fig.\\ref{BandgapVsElectricfield}. }\\label{tab2fig9}\n\\begin{ruledtabular}\n\\begin{tabular}{cccccccccc}\n & \\multicolumn{4}{c}{$\\beta x + \\alpha $} & \\multicolumn{5}{c}{ $\\gamma x^2+\\beta x+ \\alpha$} \\\\\n JGNR & $\\alpha$, eV  & $\\beta$, eV$\\cdot$\\AA/V  & $\\varepsilon _{\\min }$,  V/\\AA & $\\varepsilon\n   _{\\max }$,  V/\\AA & $\\alpha $, eV & $\\beta $,  eV$\\cdot$\\AA/V & $\\gamma $, eV$\\cdot$\\AA$^2$/V$^{2}$ & $ \\varepsilon _{\\min }$, V/\\AA & $\\varepsilon _{\\max }$, V/\\AA \\\\ \\hline\n Z60 $\\langle 3,3;7 \\rangle$ & 0 & 23.3 & 0 & 0.010 & 0 & 29.8 & -361.4 & 0.010 & 0.040 \\\\\n  Z60 $\\langle 3,3;8 \\rangle$  & 0 & 25.9 & 0 & 0.010 & 0 & 33.7 & -526.3 & 0.010 & 0.035 \\\\\n  Z60 $\\langle 3,3;9 \\rangle$  & 0 & 29.6 & 0 & 0.007 & 0 & 35.7 & -680.7 & 0.007 & 0.030 \\\\\n  Z60 $\\langle 5,5;9 \\rangle$  & 0 & 28.4 & 0 & 0.007 & 0 & 29.2 & -425.5 & 0.007 & 0.045 \\\\\n  Z60 $\\langle 7,7;9 \\rangle$  & 0 & 27.0 & 0 & 0.007 & 0 & 27.7 & -365.0 & 0.007 & 0.055 \\\\\n  A120 $\\langle 3,3;6 \\rangle$ & -- & -- & -- & -- & 0.7 & 0.6 & -108.4 & 0.010 & 0.080 \\\\\n  A120 $\\langle 3,3;7 \\rangle$ & 0.8 & -12.5 & 0.035 & 0.060 & 0.6 & 1.4 & -177.8 & 0.010 & 0.035 \\\\\n  A120 $\\langle 3,3;8 \\rangle$ & 0.7 & -12.5 & 0.025 & 0.050 & 0.5 & 2.1 & -264.4 & 0 & 0.025 \\\\\n  A120 $\\langle 5,5;6 \\rangle$ & 1.0 & -15.7 & 0.035 & 0.060 & 0.6 & 8.0 & -349.5 & 0.010 & 0.035 \\\\\n  A120 $\\langle 7,7;6 \\rangle$ & 0.8 & -14.8 & 0.020 & 0.050 & 0.5 & 9.5 & -616.2 & 0.007 & 0.020 \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{table*}\n\n\\begin{turnpage}\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.65]{fig10.pdf}\n\\end{center}\n\\caption{\\label{JGNRvsGNR} The comparison of JGNRs Z60 a), b) and A120 c), d) with various straight GNRs, where (n) denotes the number of atom pairs in the unit cell of the structure.}\n\\end{figure*}\n\\end{turnpage}\n\nHaving studied the dependence of $E_g$ on $\\varepsilon_x$ for JGNRs Z60 and A120, we proceed with a comparison of found patterns with similar ones for simple GNR with zigzag and armchair edges, which will be referred to as ZGNR($n$) and AGNR($n$), respectively, where $n$ is a number of carbon atom pairs in the unit cell of the structure. The mapping mentioned at the end of Sec.\\ref{Str} is very useful for doing this. Using the mapping based on Eqs.(\\ref{Effective_width}-\\ref{Host_width}) results presented in Fig.\\ref{JGNRvsGNR} a)-d) were obtained. For the sake of completeness ribbons Z60 and A120 with and without host ribbons were considered. The presence of the host ribbon in JGNR is our criterion for large values of jag arm indexes $\\ell_1$, $\\ell_2$ with respect to width index $w$. As can be seen from Fig.\\ref{JGNRvsGNR} a) the dependence of $E_g$ on $\\varepsilon_x$ for Z60 $\\langle 3,3;9 \\rangle$ lays between curves for the straight and the effective ribbons. There is no likeliness with the arm ribbon that allows one to obtain high value for $E_g$ of about $0.8$ eV but requires close to SiO$_2$ breakdown electric strength magnitude. Comparing curves for the host and Z60 ribbons, one can see that the former lays below the latter for low values of $\\varepsilon_x \\sim 0.025$~V/$\\mathring{\\mbox{A}}$ and above for greater values of $\\varepsilon_x$. In general, the curve for Z60 is to a great extend similar to curves for effective, straight and host ribbons especially in region of low values of $\\varepsilon_x < 0.02$~V/$\\mathring{\\mbox{A}}$. However, Fig.\\ref{JGNRvsGNR} b) provides quite different results. The curve describing $E_g$ vs. $\\varepsilon_x$ dependence for Z60 $\\langle 12,12;6 \\rangle$ almost coincides with the curve for the arm ribbon ZGNR($6$) for $\\varepsilon_x< 0.02$~V/$\\mathring{\\mbox{A}}$ and considerably deviate from it at higher $\\varepsilon_x$. It does not approach curves for the effective ZGNR($24$) or straight ZGNR($12$).\nThe case of JGNR A120 $\\langle 3,3;6 \\rangle$ shown in Fig.\\ref{JGNRvsGNR} c) significantly differs from that one of JGNRs Z60, because A120 ribbons have armchair edges while they are mapped onto ZGNRs. However, in spite of the fact that the arm ribbon for A120 ribbons has the same type of edges, one notice a crucial difference between them. Firstly, it is impossible to control band gap of AGNR(18), which is the arm one for the A120 $\\langle 3,3;6 \\rangle$, by means of a transverse electric field. And secondly, the value of the band gap is greater for a jagged ribbon. In the Fig.\\ref{JGNRvsGNR} d) one can see the effect of deeper jags which leads to the absence of the host ribbon in A120 $\\langle 8,8;4 \\rangle$. This JGNR is a bit narrower than that presented in the Fig.\\ref{JGNRvsGNR} c), but its band gap is closed nearly at the same magnitude of $\\varepsilon_x \\sim 0.08$~V/$\\mathring{\\mbox{A}}$ as for A120 $\\langle 3,3;6 \\rangle$. It is a straightforward result of jag arm elongation that shifts this point of closing back to lower values of $\\varepsilon_x$ after its shift to higher ones due to decrementing of width index $w$. It is also useful to compare curves for A120 ribbons in Fig.\\ref{JGNRvsGNR} c) and d) in the region close to zero magnitude of electric field. One sees that while the initial value of the band gap is greater for A120 $\\langle 8,8;4 \\rangle$, $E_g \\sim 0.8$ eV compared to $E_g \\sim 0.65$ eV, the closing point is almost the same. Moreover, the drop in the band gap of A120 $\\langle 8,8;4 \\rangle$ in the region of $\\varepsilon_x< 0.02$~V/$\\mathring{\\mbox{A}}$ is greater than for A120 $\\langle 3,3;6 \\rangle$ that means the band gap of the former can be more readily controlled. In all other respects Fig.\\ref{JGNRvsGNR} c), d) demonstrate very similar curves behaviour, where observable distinctions can be attributed only to quantitative differences of jagged ribbon parameters and, consequently, the straight, effective and arm ribbons ones. For instance, curve for the arm ribbon in Fig.\\ref{JGNRvsGNR} d) is also field independent while corresponds to a higher value of the band gap of about $0.6$ eV compared to $0.4$ eV in Fig.\\ref{JGNRvsGNR} c).\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig11.pdf}\n\\end{center}\n\\caption{\\label{Asym}The influence of asymmetry $\\ell_1 \\neq \\ell_2$ on the electric field effect in JGNRs Z60 a) and A120~b).}\n\\end{figure*}\n\nFinally, we report on the effect of asymmetry $\\ell_1 \\neq \\ell_2$ on both JGNRs Z60 and A120. Having analysed results for JGNRs and ordinary straight GNRs, it is easy to comprehend data shown in Fig.\\ref{Asym} a) and b). The increment of just one index $\\ell_2$ results in $E_g$ vs. $\\varepsilon_x$ curve evolution to the form inherent for the arm ZGNR and AGNR, respectively. To be more persuasive, we suggest the reader to look again at the curves for ZGNR(14) and AGNR(18) in Fig.\\ref{JGNRvsGNR} a) and c), correspondingly. After that results in Fig.\\ref{Asym} are easy to understand. As in the case of Fig. \\ref{BandgapVsElectricfield} for ribbons in Fig.\\ref{Asym} we specified linear and quadratic regions of $E_g(\\varepsilon_x)$ and calculated parameters (see Table \\ref{tab2fig11}). In contrast to the data in Table \\ref{tab2fig9}, absolute values of $\\beta$ for different ribbons in Table \\ref{tab2fig11} are very close and imply approximately equal efficiency in the band gap control.\n\\begin{table*}\n\\caption{Fitting of linear and quadratic regions of $E_g(\\varepsilon_x)$ curves for JGNRs presented in Fig.\\ref{Asym}. Fitting for ribbons Z60$\\langle 3,3;7 \\rangle$, A120$\\langle 3,3;6 \\rangle$ is presented in Table \\ref{tab2fig9}.}\\label{tab2fig11}\n\\begin{ruledtabular}\n\\begin{tabular}{cccccccccc}\n & \\multicolumn{4}{c}{$\\beta x + \\alpha $} & \\multicolumn{5}{c}{ $\\gamma x^2+\\beta x+ \\alpha$} \\\\ \n JGNR & $\\alpha$, eV  & $\\beta$, eV$\\cdot$\\AA/V  & $\\varepsilon _{\\min }$,  V/\\AA & $\\varepsilon\n   _{\\max }$,  V/\\AA & $\\alpha $, eV & $\\beta $,  eV$\\cdot$\\AA/V & $\\gamma $, eV$\\cdot$\\AA$^2$/V$^{2}$ & $ \\varepsilon _{\\min }$, V/\\AA & $\\varepsilon _{\\max }$, V/\\AA \\\\ \\hline\n Z60 $\\langle 3,5;7 \\rangle$ & 0 & 18.6 & 0 & 0.015 & 0 & 24.1 & -208.9 & 0.015 & 0.06 \\\\\n Z60 $\\langle 3,7;7 \\rangle$ & 0 & 18.0 & 0 & 0.010 & 0 & 17.9 & -114.5 & 0.010 & 0.08 \\\\\n A120 $\\langle 3,5;6 \\rangle$ & 1.1 & -16.1 & 0.05 & 0.060 & 0.5 & 8.7 & -239.4 & 0.020 & 0.05 \\\\\n A120 $\\langle 3,7;6 \\rangle$ & 1.0 & -14.1 & 0.04 & 0.055 & 0.2 & 24.4 & -481.0 & 0.025 & 0.04 \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\end{table*}\n\n\\section{\\label{Conc} Conclusions}\nTo summarize, in this paper we have studied a subclass of chevron-type GNRs -- jagged graphene nanoribbons (JGNRs). It was shown that it is possible to control the band gap of two types of JGNRs, namely Z60 and A120, by an external transverse electric field, e.g. applied in the plane of the ribbon normally to its longitudinal axis. The band gap opening is possible for Z60 ribbons, while the band gap closing is characteristic for A120 ribbons. In both cases the value of the band gap opening/closing is greater for narrower ribbons and requires stronger electric fields. As there is a natural limit for electric strength values due to the breakdown phenomenon, there must be an optimal value of ribbon width providing the highest possible value of the band gap. We argue that for $\\varepsilon_{x,max}=0.1$~V/$\\mathring{\\mbox{A}}$, e.g. SiO$_2$ as a substrate, the optimal width is about $w \\sim 6$. For these values of width Z60 ribbons in a transverse electric field behave like a quantum dot system and series of emission and absorption lines must be observed if they are not forbidden by optical selection rules. Some enhancement in the controllability of the band gap in the transverse electric field is achievable for A120 ribbons as the longer jag arms the lower field is required to close the band gap, while it is not the case for Z60 ones. Also we must mentioned the second peak for A120 JGNR that is seemed to be unique for this type of structures as it was not mentioned for ordinary straight GNRs in the paper\\cite{Chang2006}.\n\nFinally, we notice that the value of band gap opening for Z60 is about $0.6$ eV and so high that even taking into account possible error in band gap evaluation ($\\approx 10$\\%) and assuming the same field screening ($\\sim 25$\\% for $\\varepsilon_x = 0.05 $ V/$\\mathring{\\mbox{A}}$) as for bilayer graphene one can assess band gap opening as no less than $\\sim 0.4$ eV that is about twice larger than for bilayer graphene in a normal electric field\\cite{Castro2007}. The value is also large compared to that one for carbon nanotubes and can be implemented for fabrication of all metallic transistors proposed firstly for nanotubes in the paper\\cite{Rotkin2004}. Following the just mentioned work, it seems reasonable even to combine normal and transverse geometry to control conductivity of the channel and carrier concentration separately. Actually, separate control of the band gap and the Fermi energy paves the way to a new type of devices that could build a bridge between optics and electronics. Speaking again of A120, one must stress also the quite wide range of band gap variation of about $0.6$ eV. This property of A120 ribbons could make them suitable candidates for infrared or THz laser media with widely tunable irradiation frequency. Although only a homogeneous transverse electric field was considered we deem that the results obtained give a hint on the effect of charge impurities on some types of GNRs, however to prove the last statement another detailed study is necessary. It is quite important to notice that in spite of the fact that only graphene nanoribbons were considered in this study, its result can be relevant to other structures with similar geometry produced by patterned evaporation\\cite{Wei2010} of H, O, F, atoms from the surface of graphane, graphene oxide or graphene fluoride, respectively, or substitution of BN atoms on C atoms in h-BN layer\\cite{Liu2013a}. As was shown in papers \\cite{Chernozatonskii2007,Chernozatonskii2010,Ribas2010}, such structures exhibit similar electronic properties to GNRs of the same shape. After having written this paper we became aware of recent results confirming spin ordering on the zigzag edges at room temperature\\cite{Magda2014}. This effect can reduce the range of tunability for Z60 ribbons and needs a separate detailed investigation. \n\n\n\\begin{acknowledgments}\n\nThis work was supported by EU FP7 ITN NOTEDEV (through Grant No. FP7-607521); IRSES projects CACOMEL (Grant No. FP7-247007), FAEMCAR (Grant No. FP7-318617) and CANTOR (Grant No. FP7-612285); Graphene Flagship (Grant No. 604391) and the Ministry of Education of the Republic of Belarus (Grant No.  20140773). The authors are very grateful to Prof. Philippe Lambin and Prof. Mikhail Portnoi for useful advice and Charles Downing for careful reading of the manuscript .\n\\end{acknowledgments}\n\n\n\n\n\\appendix*\n\n\\section{\\label{App} Realistic Z60 structure}\nRibbons of Z60 type are good as a theoretical model but unfortunately it is very likely that such configurations are difficult to realize experimentally. Therefore we decided to provide additional results to prove that the found effect is not due to the peculiar structural configuration associated with one carbon atom missing in hexagons on the border between two jags but rather due the ribbon chevron-type pattern and zigzag edge. A structure with one carbon atom removed from the jag apex and placed at the opposite edge to complete hexagons seems to be more stable. Such structure can be referred to as Z60r, where \"r\" -- stand for \"realistic\". As one can see in Fig. \\ref{SplittingZ60r}, band gap opening and dispersionless band splitting in the external transverse electric field can be found as well in structures of more energetically favourable configuration.\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.7]{fig12.pdf}\n\\end{center}\n\\caption{\\label{SplittingZ60r}The splitting of dispersionless bands in the transverse electric field for JGNRs Z60r.}\n\\end{figure*}\n\n\n\n\\bibliography{library}\n\n", "itemtype": "equation", "pos": 24165, "prevtext": "\nwhere $t_{n1,0} \\approx 3$ eV, $a_0=1.42\\mathring{\\mbox{A}}$.\nThis allows one to neglect any change in the atomic orbitals $\\phi_{n},\\phi_{n+i}$ due to the field. It is also worth mentioning that we do not expect large field enhancement at the sharp ends of jags as their sizes in the structures considered are about $5$nm, which is quite small, and they are arranged periodically in an infinite line so that their influence on each other averages and reduces the resulting field.\n\nAs we are interested in the pure effect of the jagged edges and its influence on electronic properties of JGNRs, we eliminate possible differences of hopping integrals at various sites within unit cell so that $t_{ni} = t_i;\\, t_{ni,0} = t_{i,0} ; \\, \\delta t_{ni} = \\delta t_i$. In fact, the model of ideal geometry was implemented, which is close to the real geometry of the structure when dangling sp$^2$ bonds at JGNR edges are passivated with H atoms to form a strong C-H $\\sigma$-bonds. Nearest-neighbor C-H matrix elements associated with these H-atoms do not appear explicitly in $H_0$ because these $\\sigma$ orbitals are symmetric with respect to the nodal plane of the $\\pi$-orbitals and hence decouple from the $\\pi$-conduction bands described by $H_0$. Also, because C forms a strong covalent bond with H, the $\\sigma$ and $\\sigma^{\\ast}$ bands associated with these bonds lie far from $E_F$ and hence need not be considered further.\n\nIt is worth noting that on one hand hopping integral values at the edge can differ from those in the GNR interior so that it could cause band gap opening in armchair GNR\\cite{PhysRevLett.97.216803}. But on the other hand, the same band gap opening can be explained by accounting for higher order hopping integrals\\cite{White2007}. A more accurate model taking into account both effects was reported latter\\cite{Gunlycke2008}. Interestingly, a more precise model accounting for edge distortions showed that this effect leads to a small correction only for armchair ribbons of $3n$ series. However, it is very unlikely that this small correction to the band gap does affect its tunability. Therefore, admitting an error for the band gap of no more than $10$\\%,  the nearest neighbours up to the third order were taken into account and model parameters were chosen as proposed in the paper\\cite{White2007}: $t_{0,0} = 0$ eV, $t_{1,0} = -3.2$ eV, $t_{2,0} = 0$ eV $t_{3,0} = -0.3$ eV. \n\n\nIn the present paper we neglect screening effect and assume that applied field influences directly each lattice site. It seems reasonable for strong electric fields. However, for weak fields one should keep in mind that the values presented should be interpreted as a value of an effective field.\n\nThe applied electric field contributes mainly to the site energy $ t_{0}$. In fact, there are additional terms for higher order hopping integrals $\\delta t_{1 \\ldots \\infty}$. To assess them one can  approximate carbon $\\pi$-orbitals by $p_z$ wave functions of the hydrogen like atom\\cite{Partoens2006}:\n\\begin{widetext}\n\n", "index": 19, "text": "\\begin{equation}\n\\phi_n( |{\\mbox{\\mathversion{bold}${r}$}} - {\\mbox{\\mathversion{bold}${r}$}}_n|, \\theta ) =\\frac{1}{4 \\sqrt{2 \\pi }} \\left(\\frac{Z}{a_B} \\right)^{5/2} \\exp \\left(-\\frac{ Z |{\\mbox{\\mathversion{bold}${r}$}} - {\\mbox{\\mathversion{bold}${r}$}}_n| }{2 a_B } \\right) |{\\mbox{\\mathversion{bold}${r}$}} - {\\mbox{\\mathversion{bold}${r}$}}_n| \\cos \\theta,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\phi_{n}(|{\\mbox{${r}$}}-{\\mbox{${r}$}}_{n}|,\\theta)=\\frac{1}{4\\sqrt{2\\pi}}%&#10;\\left(\\frac{Z}{a_{B}}\\right)^{5/2}\\exp\\left(-\\frac{Z|{\\mbox{${r}$}}-{\\mbox{${r%&#10;}$}}_{n}|}{2a_{B}}\\right)|{\\mbox{${r}$}}-{\\mbox{${r}$}}_{n}|\\cos\\theta,\" display=\"block\"><mrow><mrow><mrow><msub><mi>ϕ</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒓</mi><mo>-</mo><msub><mi>𝒓</mi><mi>n</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow><mo>,</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>4</mn><mo>⁢</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>Z</mi><msub><mi>a</mi><mi>B</mi></msub></mfrac><mo>)</mo></mrow><mrow><mn>5</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><mrow><mi>Z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒓</mi><mo>-</mo><msub><mi>𝒓</mi><mi>n</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>a</mi><mi>B</mi></msub></mrow></mfrac></mrow><mo>)</mo></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>𝒓</mi><mo>-</mo><msub><mi>𝒓</mi><mi>n</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]