[{"file": "1601.07861.tex", "nexttext": "\nwhere $\\phi$ refers to the azimuth in polar coordinate, and $\\Phi$ is the position angle of the location of interest ($x$, $y$) with respect to the stellar location ($x_0$, $y_0$) as:\n\n\n", "itemtype": "equation", "pos": 18918, "prevtext": "\n\\title{Massive collision of planetesimals in the asymmetric disk around HD\\,61005\\thanks{Based on observations made with ESO Telescopes at the Paranal Observatory under programs ID 095.C-0298 and 095.C-0273. Based on \\textit{Herschel} observations, OBSIDs: 1342270977, 1342270978, 1342270979, 1342270989, and 1342255147. \\textit{Herschel} is an ESA space observatory with science instruments provided by European-led Principal Investigator consortia and with important participation from NASA.}}\n\n\\author{J. Olofsson\\inst{1, 2, 3}\n    \\and\n    M. Samland\\inst{3}\n    \\and\n    H. Avenhaus\\inst{4, 2}\n    \\and\n    C. Caceres\\inst{1,2}\n    \\and\n    Th. Henning\\inst{3}\n    \\and\n    A. Mo\\'or\\inst{5}\n    \\and\n    J. Milli\\inst{6}\n    \\and\n    H. Canovas\\inst{1,2}\n    \\and\n    S. Quanz\\inst{7}\n    \\and\n    M. R. Schreiber\\inst{1,2}\n    \\and\n    J.-C. Augereau\\inst{8, 9}\n    \\and\n    A. Bayo\\inst{1, 2}\n    \\and\n    A. Bazzon\\inst{7}\n    \\and\n    J.-L. Beuzit\\inst{8, 9}\n    \\and\n    A. Boccaletti\\inst{10}\n    \\and\n    E. Buenzli\\inst{7}\n    \\and\n    S. Casassus\\inst{4, 2}\n    \\and\n    G. Chauvin\\inst{8, 9}\n    \\and\n    C. Dominik\\inst{11}\n    \\and\n    S. Desidera\\inst{12}\n    \\and\n    M. Feldt\\inst{3}\n    \\and\n    R. Gratton\\inst{12}\n    \\and\n    M. Janson\\inst{3, 13}\n    \\and\n    A.-M. Lagrange\\inst{8, 9}\n    \\and\n    M. Langlois\\inst{14, 15}\n    \\and\n    J. Lannier\\inst{8, 9}\n    \\and\n    A.-L. Maire\\inst{12, 3}\n    \\and\n    D. Mesa\\inst{12}\n    \\and\n    C. Pinte\\inst{16, 8}\n    \\and\n    D. Rouan\\inst{10}\n    \\and\n    G. Salter\\inst{15}\n    \\and\n    C. Thalmann\\inst{7}\n    \\and\n    A. Vigan\\inst{15, 6}\n}\n\n\\institute{\n\nInstituto de F\\'isica y Astronom\\'ia, Facultad de Ciencias, Universidad de Valpara\\'iso, Av. Gran Breta\\~na 1111, Playa Ancha, Valpara\\'iso, Chile\\\\\\email{johan.olofsson@uv.cl}\n\\and\n\nICM nucleus on protoplanetary disks, ``Protoplanetary discs in ALMA Early Science'', Chile\n\\and\n\nMax Planck Institut f\\\"ur Astronomie, K\\\"onigstuhl 17, 69117 Heidelberg, Germany\n\\and\n\nDepartamento de Astronom\\'ia, Universidad de Chile, Casilla 36-D, Santiago, Chile\n\\and\n\nKonkoly Observatory, Research Centre for Astronomy and Earth Sciences, Hungarian Academy of Sciences, PO Box 67, H-1525 Budapest, Hungary\n\\and\n\nEuropean Southern Observatory (ESO), Alonso de C\\'ordova 3107, Vitacura, Casilla 19001, Santiago, Chile\n\\and\n\nInstitute for Astronomy, ETH Zurich, Wolfgang-Pauli-Strasse 27, CH-8093 Zurich, Switzerland\n\\and\n\nUniv. Grenoble Alpes, Institut de Plan\\'etologie et d'Astrophysique de Grenoble (IPAG, UMR 5274), F-38000 Grenoble, France\n\\and\n\nCNRS, Institut de Plan\\'etologie et d'Astrophysique de Grenoble (IPAG, UMR 5274), F-38000 Grenoble, France\n\\and\n\nLESIA, Observatoire de Paris, CNRS, Universit\\'e Pierre et Marie Curie 6 and Universit\\'e Denis Diderot Paris 7, 5 place Jules Janssen, 92195 Meudon, France\n\\and\n\nAstronomical Institute Anton Pannekoek, University of Amsterdam, PO Box 94249, 1090 GE Amsterdam, The Netherlands\n\\and\n\nINAF Osservatorio Astronomico di Padova, Vicolo dell'Osservatorio 5, 35122 Padova, Italy\n\\and\n\nDepartment of Astronomy, Stockholm University, AlbaNova University Center, 10691 Stockholm, Sweden\n\\and\n\nCNRS, Centre de Recherche Astrophysique de Lyon, Observatoire de Lyon, Ecole Normale Sup\\'erieure de Lyon, Universit\\'e Lyon 1, 9 avenue Charles Andr\\'e, Saint-Genis Laval, 69230, France\n\\and\n\nAix Marseille Universit\\'e, CNRS, LAM (Laboratoire d'Astrophysique de Marseille) UMR 7326, 13388, Marseille, France\n\\and\n\nUMI-FCA, CNRS/INSU France, and Departamento de Astronom\\'ia, Universidad de Chile, Casilla 36-D Santiago, Chile\n}\n\n\n\\abstract{Debris disks offer valuable insights into the latest stages of circumstellar disk evolution, and can possibly trace the outcomes of planetary formation processes. In the age range 10 to 100\\,Myr, most of the gas is expected to have been removed from the system, giant planets (if any) must have already been formed, and the formation of terrestrial planets may be on-going. Pluto-sized planetesimals, and their debris released in a collisional cascade, are under their mutual gravitational influence, which may result into non-axisymmetric structures in the debris disk.}\n{High angular resolution observations are required to investigate these effects and constrain the dynamical evolution of debris disks. Furthermore, multi-wavelength observations can provide information about the dust dynamics by probing different grain sizes.}\n{Here we present new VLT/SPHERE and ALMA observations of the debris disk around the 40\\,Myr old solar-type star HD\\,61005. We resolve the disk at unprecedented resolution both in the near-infrared (in scattered and polarized light) and at millimeter wavelengths. We perform a detailed modeling of these observations, including the spectral energy distribution.}\n{Thanks to the new observations, we propose a solution for both the radial and azimuthal distribution of the dust grains in the debris disk. We find that the disk has a moderate eccentricity ($e \\sim 0.1$), and the dust density to be twice larger at the pericenter compared to the apocenter.}{We propose that the morphology of the disk could be the consequence of a massive collision between $\\sim$\\,1000\\,km-sized bodies at $\\sim$\\,61\\,AU, which could be the onset of \\textit{in situ} super-Earth formation. Numerical simulations have shown that such asymmetry can last for $\\sim 1000$ orbits ($\\sim$\\,0.5\\,Myr at 61\\,AU).}\n\n\n\\keywords{Stars: individual (HD\\,61005) -- circumstellar matter -- Techniques: high angular resolution -- Scattering\n}\n\n\\titlerunning{The asymmetric disk around HD\\,61005}\n\n\\maketitle\n\n\n\n\n\n\n\\section{Introduction}\\label{sec:introduction}\n\nDebris disks are the leftovers of star and planetary formation processes (see \\citealp{Wyatt2008,Krivov2010,Matthews2014} for recent reviews). Departure from photospheric emission at infrared (IR) wavelengths was first discovered around Vega (\\citealp{Aumann1984}) using the {\\it Infrared Astronomical Satellite} (IRAS). This excess emission was originally thought to be the remnant of the cloud out of which Vega formed. Several decades later, we now know that the dusty ``debris'' responsible for the IR emission are arranged in a disk comparable to the Edgeworth-Kuiper belt in the solar system. The dust grains, with sizes between a few $\\umu$m to a few millimeters, located at tens of AU from the central star are heated by the stellar radiation and re-emit at mid-IR and mm wavelengths. Since the original discovery, and mostly thanks to space-based missions such as the {\\it Infrared Space Observatory}, {\\it Spitzer}, and {\\it Herschel}, several hundred of main sequence stars are known to harbor debris disks (e.g., \\citealp{Eiroa2013,Chen2014}).\n\nThe past decades have seen incredible progress in the field of disk observations (e.g., \\citealp{Augereau1999,Kalas2005,Buenzli2010,Lebreton2012,MillarBlanchaer2015}). Observations with ever improving spatial resolution have revealed asymmetric disks (e.g., \\citealp{Lagrange2015}; \\citealp{Kalas2015}) as well as complex, moving, small-scale structures (\\citealp{Boccaletti2015}). Nonetheless, spatially resolved observations of debris disks remain relatively rare and even though there are theoretical works focusing on the dynamical evolution of debris disks (e.g., \\citealp{Dominik2003}, \\citealp{Kenyon2006}), they still need to be confronted to the observations. The current paradigm is that the primordial gas-rich proto-planetary disks are thought to have a half-life time of about $2-3$\\,Myr (\\citealp{Hernandez2007}). As a disk evolves Pluto-sized planetesimals can form (\\citealp{Johansen2015}) along with giant planets which may accrete their mass from the gas reservoir (core accretion or gravitational instability scenarios). After a few Myr, the gaseous content will be quickly removed from the disk by efficient processes such as photo-evaporation (e.g., \\citealp{Alexander2006}; \\citealp{Owen2011}). Only already formed planets, planetesimals and dust grains will thus remain while the disk enters its debris disk phase. After a short phase of runaway growth, terrestrial planets may form via chaotic growth of the oligarchs, on a timescale of $10-100$\\,Myr (\\citealp{Kenyon2006}). The time evolution of the entire system will then become more regular and less chaotic. The km-sized bodies, arranged in one or more planetesimal belt(s), will evolve under their mutual gravitational influence. Through collisions, they will continuously release small particles in a collisional cascade. Small dust grains will in turn be removed from the system either by radiation pressure or Poynting-Robertson drag. Therefore, one can consider that after $\\sim$\\,100\\,Myr, planetary formation has stopped. The system is left with one (or more) planetesimal belt(s) and quite possibly with planets of various masses. By observing systems in the range $10-100$\\,Myr, one can therefore study the time evolution of debris disks. Spatially resolved images can provide constraints on the radial and azimuthal distribution of the dust, giving us insight about the dynamics at stake in these systems.\n\nHere, we present {\\it Very Large Telescope} (VLT) \\textit{Spectro-Polarimetric High-contrast Exoplanet REsearch} (SPHERE) and \\textit{Atacama Large Millimeter/submillimeter Array} (ALMA) observations of the debris disk around the solar type star \\object{HD\\,61005} (G8V), located at a distance of $35.4\\pm1.1$\\,pc (\\citealp{2007}). The age of the system is believed to be within $40_{-30}^{+10}$\\,Myr old, based on membership of the Argus association (\\citealp{Desidera2011,DeSilva2013,Elliott2014}). The uncertainties for the age are mostly related to the dispersion in ages reported in the literature for both the Argus association and the IC\\,321 super cluster. In the past decade, it has been spatially resolved on multiple occasions with several instruments; \\citet[][{\\it Hubble Space Telescope} HST/NICMOS]{Hines2007}; \\citet[][HST/ACS]{Maness2009}; \\citet[][VLT/NaCo]{Buenzli2010}; \\citet[][ {\\it Submillimeter Array} SMA]{Ricarte2013}; and \\citet[][HST/STIS]{Schneider2014}. The disk earned its nickname of ``The Moth'' because of the swept-back wings first revealed in the HST observations of \\citet{Hines2007}. The wings may originate from the interaction between the interstellar medium (ISM) and the disk itself; as the star moves through the local ISM, (small) dust grains are set on eccentric orbits, drifting away from the central star.\n\nWhile \\citet{Hines2007} and \\citet{Maness2009} mostly studied the wings, the study presented in \\citet{Buenzli2010} resolved the debris disk as a ring, thanks to the better angular resolution provided by the NaCo instrument. They found the disk to be almost edge-on ($i = 84.3\\pm1^{\\circ}$), to have a semi-major axis of $61.25\\pm0.85$\\,AU with an eccentricity of $e = 0.045\\pm0.015$, which translates into an offset of $2.75\\pm0.85$\\,AU of the star with respect to the disk. A brightness asymmetry between the two ansae is observed, which cannot be fully explained by the off-centering. No planets were detected by \\citet{Buenzli2010}, for observations that should in principle have detected planets with masses starting from a few Jupiter masses. The integrated luminosity of the disk is large at IR wavelengths ($L_{\\mathrm{disk}}/L_{\\star} \\sim 3 \\times 10^{-3}$) and is best modeled by two spatially separated dust belts. The main dust belt is the one located at $\\sim$60\\,AU presented in \\citet{Buenzli2010}, but a warm component is usually required to reproduce the spectral energy distribution (SED). \\citet{Ricarte2013} argue that this additional belt is mandatory to match the SED at about 20\\,$\\umu$m, however its location remains unconstrained.\n\n\n\n\n\n\n\\section{Observations, data processing, and stellar parameters}\\label{sec:observations}\n\nTable\\,\\ref{tab:log} summarizes the VLT/SPHERE and ALMA observations presented in this study.\n\n\\begin{table*}\n\\centering\n\\caption{Log for the VLT/SPHERE and ALMA observations\\label{tab:log}}\n\\begin{tabular}{@{}lclcccc@{}}\n\\hline\\hline\n\\multicolumn{7}{c}{VLT/SPHERE} \\\\\n\\hline\nObserving date   & Prog. ID & Instrument Mode & Filter & Seeing & Airmass & Coherence time \\\\\n$[$YYYY-MM-DD$]$ &          &                 &        & $[^{\\prime\\prime}]$ &   & $[$ms$]$ \\\\\n\\hline\n2015-02-03 & 95.C-0298 & IRDIFS      & $H_2H_3$/$YJ$ & 0.67 & 1.01 & 22.0 \\\\\n2015-03-30 & 95.C-0298 & IRDIFS\\_EXT & $K_1K_2$/$YH$ & 1.24 & 1.04 &  1.7 \\\\\n2015-05-01 & 95.C-0273 & IRDIS DPI   & B\\_H    & 1.16 & 1.29 &  1.7 \\\\\n\\hline\n\\multicolumn{7}{c}{ALMA} \\\\\n\\hline\nObserving date     & Prog. ID & Mode & Resolution &Frequency range & PWV      & Integration \\\\\n$[$YYYY-MM-DD$]$   &          &      & $[$kHz$]$  &  $[$GHz$]$     & $[$mm$]$ &   $[$s$]$ \\\\\n\\hline\n\\multirow{2}{*}{2014-03-20}   & \\multirow{2}{*}{2012.1.00437.S} & Continuum & 31250.00  &   $211.91-228.97$ & \\multirow{2}{*}{0.79} & \\multirow{2}{*}{120.96} \\\\\n             &                & Gas       & 488.28 &   $230.05-230.99$ & & \\\\\n\\hline\n\\end{tabular}\n\\end{table*}\n\n\n\\begin{figure*}\n\\includegraphics[width=2.0\\columnwidth]{all_data.pdf}\n\\caption{Reduced SPHERE observations of HD\\,61005 used in the analysis. North is up, East is left. From left to right; IRDIS ADI in $H$ and $K$ bands (PCA with 6 components), and IRDIS DPI $Q_{\\phi}$ in $H$ band. Top row shows the data in linear stretch, with a central mask of $0.15^{\\prime\\prime}$, and the bottom row shows estimated signal-to-noise maps (see text for detail), with a stretch between [$-3\\sigma$, $3\\sigma$].}\n\\label{fig:all_data}\n\\end{figure*}\n\n\n\n\n\\subsection{VLT/SPHERE IRDIS observations and data reduction}\n\nThe star HD\\,61005 was observed with the VLT/SPHERE (\\citealp{Beuzit2008}), within the guaranteed time consortium. The observations were obtained in different instrumental set-ups in February, March, and May 2015, using the dual-band imager (IRDIS, \\citealp{Dohlen2008,Vigan2010}), the integral field spectrograph (IFS, \\citealp{Claudi2008}), and the dual-polarization imager (IRDIS DPI, \\citealp{Langlois2014}). \n\n\\subsubsection{IRDIS dual band observations}\n\nThe February observations were conducted in the $H_2H_3$ dual-band (centered on $1.59$ and $1.67$\\,$\\umu$m) for IRDIS and the $YJ$-band ($0.95 - 1.35$\\,$\\umu$m, at spectral resolution R$\\sim54$) for IFS. The March observations used the $K_1K_2$ filters (centered on $2.11$ and $2.25$\\,$\\umu$m) for IRDIS and the $YH$-band ($0.95-1.65$\\,$\\umu$m, R$\\sim33$) for IFS. All of these observations were performed using an apodized Lyot coronagraph, consisting of a focal mask with a diameter of $185$\\,milli-arcsec (N\\_ALC\\_YJH\\_S) and a corresponding pupil mask. Coronagraphic observations were performed in pupil stabilized mode in order to use Angular Differential Imaging (ADI) post-processing (\\citealp{Marois2006}) to attenuate residual speckle noise. The observation strategy can be summarized as follows: 1) Photometric calibration: imaging of star offset from coronagraph mask to obtain PSF for relative photometric calibration, 2) Centering: imaging with star behind mask with four artificially induced satellite spots for centering, 3) Science: coronagraphic sequence, 4) Centering: same as point two, 5) Photometric calibration: same as point one, 6) Sky background observation using same DIT as coronagraphic sequence. Finally, True North (TN) and plate scale are determined using astrometric calibrators as part of the SPHERE GTO survey for each run (\\citealp{Maire2015}).\n\nBasic reduction of the IRDIS data (background subtraction, flat fielding, centering) was performed using the SPHERE Data Reduction Handling (DRH) pipeline (\\citealp{Pavlov2008}, version 15.0). The output consists of cubes for each filter, re-centered onto a common origin using the satellite spot reference. The cubes are then corrected for the True North position determined from the astrometric calibrations and for distortion. We collapsed the two filters together to increase the signal-to-noise ratio (S/N), and from now on we will refer to the $H_2H_3$ and $K_1K_2$ datasets as $H$ and $K$ observations, respectively. The angular differential images (ADI) in both bands were then processed using a Principal Component Analysis (PCA, using the implementation of the \\texttt{scikit-learn} Python package, \\citealp{Pedregosa2011}) approach from all frames within the data-cube.\n\n\\subsubsection{IRDIS dual polarization observations}\n\nOn May 1$^{\\mathrm{st}}$, 2015, the target was observed using IRDIS in DPI mode in $H$ band. The same coronagraph was used for these observations. IRDIS DPI splits the light into two perpendicular polarization directions imaged at the same time on the same detector. Full cycles of half-wave plate (HWP) positions ($0$, $22.5$, $45$, and $67.5^{\\circ}$) were taken in order to construct the Stokes $Q$ and $U$ vectors. The strategy of the observations was to take as long exposures as possible without saturating the detector just outside the coronagraph, in order to achieve the best possible inner working angle as well as the best S/N for the outer part of the disk. Two integration times (DIT=$64$\\,s with a total integration time of 768\\,s and DIT=16\\,s with a total integration time of 3008\\,s) were used. IRDIS suffers from a de-polarization effect at certain detector position angles, which depend on the parallactic angle at the time of observation. Because the parallactic angle was changing rapidly during the observations, we updated the detector angle in regular intervals.\n\nThe DPI data were reduced using a custom pipeline different from the DRH pipeline, which closely follows the processes described in \\citet{Avenhaus2014}, using the double-difference method (see also \\citealp{Canovas2011}) to construct Stokes $Q$ and $U$ vectors from the data. The pipeline has been adapted to suit the IRDIS instrument. The data were centered using the centering frames taken just before and after the science observations. A de-rotation was applied in order to bring all files to the same orientation (see section above). Furthermore, the frames were corrected for the fact that the IRDIS pixel scale differs slightly ($\\sim 0.6$\\%) in the two principal detector directions. The files were then corrected for True North as determined for IRDIS.\n\nBecause scattered light in an optically thin (debris) disk is expected to be polarized perpendicular to the line between the star and the image point in question, we then construct local Stokes $Q$ and $U$ vectors, denoted $Q_{\\phi}$ and $U_{\\phi}$ (see also \\citealp{Benisty2015}). In case of single scattering of the stellar light, $Q_{\\phi}$ is expected to contain the disk signal, while $U_{\\phi}$ is expected to contain no signal (with possible exceptions when the optical depth is large, \\citealp{Canovas2015}) but noise on the same level as the $Q_{\\phi}$ image and can serve as a noise estimator. $Q_{\\phi}$ and $U_{\\phi}$ can be calculated as:\n\n", "index": 1, "text": "\\begin{equation}\n\\begin{split}\nQ_{\\phi} = +Q\\,\\mathrm{cos}(2 \\Phi) + U\\,\\mathrm{sin}(2 \\Phi)\\\\\nU_{\\phi} = -Q\\,\\mathrm{sin}(2 \\Phi) + U\\,\\mathrm{cos}(2 \\Phi),\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\split Q_{\\phi}=+Q\\,\\mathrm{cos}(2\\Phi)+U\\,\\mathrm{sin}(2\\Phi)\\\\&#10;U_{\\phi}=-Q\\,\\mathrm{sin}(2\\Phi)+U\\,\\mathrm{cos}(2\\Phi),\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>{split}</mtext></merror><mo>⁢</mo><msub><mi>Q</mi><mi>ϕ</mi></msub></mrow><mo>=</mo><mrow><mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><mi>Q</mi></mpadded><mo>⁢</mo><mi>cos</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><mi>U</mi></mpadded><mo>⁢</mo><mi>sin</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>U</mi><mi>ϕ</mi></msub></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><mi>Q</mi></mpadded><mo>⁢</mo><mi>sin</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><mi>U</mi></mpadded><mo>⁢</mo><mi>cos</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $\\theta$ corrects for instrumental effects such as a small misalignment of the half-wave plate.\n\nDuring the data reduction process, one HWP cycle equivalent to 256\\,s of data (DIT = 16\\,s) was taken out because the telescope had lost tracking for a short amount of time, rendering this data unusable. The result are two pairs of $Q_{\\phi}$ and $U_{\\phi}$ images, one for the DIT=16\\,s and DIT=64\\,s observations each. These were then combined with a weighted average to produce the final $Q_{\\phi}$ and $U_{\\phi}$ images.\n\n\\subsubsection{IFS observations}\n\nThe IFS data proved difficult to be properly reduced at the time of this analysis, mainly due to centering problems. Presenting and analyzing these observations is postponed to a future study.\n\n\\subsubsection{Processed images}\n\nFigure\\,\\ref{fig:all_data} shows the final reduction for our dataset (with a central mask of radius $0.15^{\\prime\\prime}$ ). The top row displays the IRDIS ADI data in $H$ and $K$ bands (left and middle panels, respectively), and the IRDIS DPI $Q_{\\phi}$ image (right), all with a linear stretch. For each image, the bottom row shows a S/N map, with a linear stretch between [$-3\\sigma$, $3\\sigma$]. The noise map is calculated from the reduced images and represents the standard deviation in concentric annuli, centered on the star, with a constant width (2 pixels). We did not mask out the disk when computing the noise maps, hence the uncertainties might be slightly over-estimated. For the DPI observations, the noise map is computed from the $U_{\\phi}$ image which does not seem to contain any signal from the disk (Fig.\\,\\ref{fig:uphi} shows the $U_{\\phi}$ image with the same linear stretch as the $Q_{\\phi}$ image in Fig.\\ref{fig:all_data}).\n\nIt should be noted that the disk is not homogeneously detected at high S/N. The East side is detected at larger S/N in all datasets and it appears brighter than the West side. Such asymmetry, already reported in \\citet{Buenzli2010}, will be further investigated in this paper. For the sake of simplicity, in the rest of the paper, we will refer to the ADI and DPI datasets as ``scattered'' and ``polarized'' observations, respectively. Strictly speaking, this is not correct as polarized photons must have been scattered by dust grains.\n\n\\subsection{ALMA observations}\n\nHD\\,61005 was observed with ALMA in Band\\,6 (PI: David Rodriguez, program 2012.1.00437.S), in the frequency range $211.97-230.99$\\,GHz. The target was observed several times, with precipitable water vapor ranging from 5.19 to 0.79\\,mm. We only kept the observations performed on the 20$^{\\mathrm{th}}$ of March 2014 for which the water vapor was minimum. Out of the four spectral windows, three were used to derive the continuum emission ($211.97-228.97$\\,GHz, with a $31250$\\,kHz resolution), while the last one was used to search for CO gas emission ($230.05-230.99$\\,GHz, with a $488.28$\\,kHz resolution), which was not detected. Data processing was performed within CASA using the standard scripts provided by the observatory. We only kept the spectral windows used for the continuum observations and averaged the complex visibilities along the 128 different spectral channels (while flagging points with negative weights). Figure\\,\\ref{fig:uvplane} shows the ($u$, $v$) plane coverage for the continuum observations, with minimum and maximum baselines of 11.8 and 334.9\\,m, respectively. The reconstructed image (with ``briggs'' weighting and pixel size of $0.13^{\\prime\\prime}$) is shown in the left panel of Figure\\,\\ref{fig:ALMA} (sensitivity of $0.09$\\,mJy/beam). The beam size is $1.36^{\\prime\\prime} \\times 0.73^{\\prime\\prime}$ (48\\,AU$\\times$26\\,AU) with a position angle of $-86.5^{\\circ}$. We do not attempt to measure the total flux of the disk directly from these observations, but will estimate it when modeling the complex visibilities (Section\\,\\ref{sec:alma}).\n\n\n\n\n\\subsection{Spectral energy distribution}\n\n\\begin{table}\n\\caption{Broadband photometric measurements of HD\\,61005, and the equivalent widths of the far-IR filters (see text for details).\\label{tab:flux}}\n\\centering\n\\begin{tabular}{@{}lcccr@{}}\n\\hline\\hline\n $\\lambda$ & $F_{\\nu}$ & $\\sigma$ & EW & Instrument \\\\\n $[\\umu$m] & [mJy] & [mJy] & [$\\umu$m] & \\\\\n\\hline\n0.428  &   895.17 &  14.02 &        & TYCHO B    \\\\\n0.534  &  1810.23 &  18.34 &        & TYCHO V    \\\\\n1.235  &  2753.74 &  65.94 &        & 2MASS J    \\\\\n1.662  &  2440.48 & 103.40 &        & 2MASS H    \\\\\n2.159  &  1738.75 &  38.43 &        & 2MASS Ks   \\\\\n3.353  &   819.28 &  31.69 &        & WISE W1    \\\\\n4.603  &   453.05 &   8.76 &        & WISE W2    \\\\\n11.56  &    78.40 &   1.08 &        & WISE W3    \\\\\n22.09  &    44.28 &   1.55 &        & WISE W4    \\\\\n68.92  &   717.00 &   5.33 &  21.41 & PACS Blue  \\\\\n97.90  &   703.58 &   6.84 &  31.29 & PACS Green \\\\\n153.94 &   472.65 &  14.58 &  69.76 & PACS Red   \\\\\n251.50 &   235.6  &  13.5  &  67.61 & SPIRE PSW  \\\\\n352.83 &   118.9  &   7.6  &  95.75 & SPIRE PMW  \\\\\n511.60 &    49.8  &   5.2  & 185.67 & SPIRE PLW  \\\\\n1300.0\\tablefootmark{a} &     4.6  &   0.7  & 105.40 & ALMA Band\\,6  \\\\\n\\hline\n\\end{tabular}\n\\tablefoottext{a}{Results from the modeling of the ALMA data (Section\\,\\ref{sec:alma}).}\n\\end{table}\n\nThe star HD\\,61005 was observed by {\\it Herschel} (\\citealp{Pilbratt2010}) with the \\textit{Photodetector Array Camera and Spectrometer} instrument (\\citealp[PACS,][]{Poglitsch2010}), within the program ``OT2\\_tcurrie\\_1''. The observation numbers (OBSID) are the two pairs 1342270977, 1342270978 and 1342270979, 1342270980 for the 70\\,$\\umu$m and 100\\,$\\umu$m observations, respectively. The 160\\,$\\umu$m map used the four OBSID combined. The data were processed using the HIPE software (build 12.0.2083, \\citealp{Ott2010}), the very same way as described in \\citet{Olofsson2013}. HD\\,61005 was also observed with the \\textit{Spectral and Photometric Imaging Receiver} instrument (\\citealp[SPIRE,][]{Griffin2010}) in small scan map mode (OBSID: 1342255147 within the program ``OT2\\_kstape01\\_1''). We used the ``Timeline Fitter'' task in HIPE to derive SPIRE photometry for our target. Calibration errors ($\\sim$\\,5.5\\%, \\citealp{Bendo2013}) are included in the uncertainties. We also gathered photometric observations using VOSA\\footnote{http://svo2.cab.inta-csic.es/theory/vosa/} (\\citealp{Bayo2008}) and the dataset used to build the SED can be found in Table\\,\\ref{tab:flux}. The meaning of the third column is explained in Section\\,\\ref{sec:sed}.\n\nFinally, we downloaded the {\\it Spitzer}/IRS spectrum from the ``Cornell Atlas of Spitzer/IRS Sources'' database\\footnote{The Cornell Atlas of Spitzer/IRS Sources is a product of the Infrared Science Center at Cornell University, supported by NASA and JPL. http://cassis.sirtf.com/atlas/query.shtml} (\\citealp{Lebouteiller2011}).\n\n\n\n\n\n\\subsection{Stellar parameters}\n\nThe stellar photospheric model is taken from the ATLAS9 Kurucz library \\citep{Castelli1997}, with an effective temperature of $T_{\\star} = 5500$\\,K (\\citealp{Casagrande2011}). With the dilution factor used to scale the photospheric model to the optical and near-IR photometric measurements, at a distance of 35.4\\,pc, we find a radius $R_{\\star} = 0.84$\\,$R_{\\odot}$. We derived a luminosity of $L_{\\star} = 0.58$\\,$L_{\\odot}$. To derive the stellar mass, which will become important when discussing the dust properties and the effect of radiation pressure on dust grains, we use isochrones from \\citet{Siess2000}, for an age of 40\\,Myr and effective temperature of $5500$\\,K. We find that the stellar mass must be of about $1.1$\\,$M_{\\odot}$ (the corresponding luminosity matching our estimated $L_{\\star}$). We find a slightly smaller mass ($1$\\,$M_{\\odot}$) when using the isochrones from \\citet{Baraffe2015}, but the differences may arise from different model prescriptions (e.g. overshoothing). In the following, we will adopt a mass of $1.1$\\,$M_{\\odot}$. The SED with the broadband photometric measurements, the {\\it Spitzer}/IRS spectrum as well as the photospheric model are shown in Figure\\,\\ref{fig:SED} of Section\\,\\ref{sec:sed}.\n\n\n\n\n\n\n\n\\section{The parent planetesimal belt: constraints from the ALMA observations}\\label{sec:alma}\n\nRoughly speaking, different wavelengths trace different grain sizes. Therefore, we chose to model the ALMA observations independently of the SPHERE ones, the latter probing the small dust grains in the debris disk while the millimeter observations most likely trace a population of larger grains that follow more closely the parent planetesimals belt.\n\n\\subsection{Modeling strategy}\n\nThe modeling of the ALMA observations is performed in the Fourier space, trying to reproduce both the real and imaginary parts of the complex visibilities (averaged along the spectral dimension). In Appendix\\,\\ref{app:DDIT} we explain how we generate synthetic images, and the different notations are summarized in Table\\,\\ref{tab:notations}. From a synthetic image at the wavelength of $1.3$\\,mm, we first scale the total flux of the image to the free parameter $f_{1300}$ (in mJy) before computing the Fourier transform of the image. We then interpolate the Fourier transform at the spatial frequencies of the observations. The goodness of fit is the sum of the weights (estimated in CASA\\footnote{The absolute values of the weights derived within CASA may be inaccurate but their relative values are.}) times the squared difference between the observed and modeled complex visibilities (the weights are proportional to $1 / \\sigma^2$). We consider the following free parameters: the semi latus rectum\\footnote{Here we assume the disk is circular. But when the eccentricity $e$ is not null, the semi-major axis of the disk is equal to $r_0 / (1-e^2)$.} $r_0$, the outer power-law slope for the dust distribution $\\alpha_{\\mathrm{out}}$ (see Eqn\\,\\ref{eqn:dens}), the inclination $i$ and the position angle $\\phi$ (plus the total flux of the disk at $1.3$\\,mm $f_{1300}$). The inner power-law slope is set to $\\alpha_{\\mathrm{in}} = 5$, preliminary tests indicating this parameter is poorly constrained by the observations. To find the most probable solution, we use an affine invariant ensemble sampler Monte-Carlo Markov Chain, implemented in the \\texttt{emcee} package, using $200$ walkers, a burn-in phase of $500$ iterations and a total length of the chains of $2000$ iterations after the burn-in phase. At the end of the run, we find that the mean acceptance fraction (the mean fraction of steps accepted for each walker within the chain) is of $0.48$ (a good sign of convergence and stability, \\citealp{Gelman1992}). The maximum auto-correlation time for all the parameters is of 60 steps, indicating that the chains should have stabilized by the end of the simulations.\n\n\\subsection{Results}\\label{sec:res_alma}\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the modeling of the ALMA observations.\\label{tab:alma}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$r_0$ [AU]              & $[40, 80]$     & $0.2$  & $66.4_{-8.7}^{+6.1}$ \\\\\n$\\alpha_{\\mathrm{out}}$ & $[-15, -1.5]$  & $0.1$  & $-6.6_{-6.1}^{+1.4}$ \\\\\n$\\phi$ [$^{\\circ}$]     & $[55, 85]$     & $0.1$  & $70.7_{-2.3}^{+1.9}$ \\\\\n$i$ [$^{\\circ}$]        & $[79, 89]$     & $0.1$  & $84.5_{-2.5}^{+2.9}$ \\\\\n$f_{1300}$ [mJy]        & $[1, 20]$      & $0.1$  & $4.6_{-0.6}^{+0.7}$  \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\n\\begin{figure*}\n\\includegraphics[width=2\\columnwidth]{ALMA_data.pdf}\n\\caption{From left to right: observations, best fit model and residuals of the ALMA data. For all panels the color map is a linear stretch between $-0.27$ and $1.23$\\,mJy/beam. The standard deviation estimated in an empty region of the observations is of $0.09$\\,mJy/beam. For both the observations and the model the contours are set at [$3$, $5$, $7.5$, $10$]$\\sigma$, and [$-3$, $3$]$\\sigma$ for the residuals. The beam size is shown in the lower left corner of each panels.}\n\\label{fig:ALMA}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{emcee_ALMA.pdf}\n\\caption{One and two dimensional (diagonal and lower triangle, respectively) projections of the posterior probability distributions for the results of the modeling of the ALMA observations.}\n\\label{fig:emcee_ALMA}\n\\end{figure}\n\nThe projected posterior probability distributions are displayed in Figure\\,\\ref{fig:emcee_ALMA}, for the different free parameters (using the \\texttt{triangle} Python package, \\citealp{ForemanMackey2014}). To derive the best-fit values as well as the uncertainties, we smooth the distributions with a kernel density estimator (the width of the Gaussian kernel $\\sigma_{\\mathrm{kde}}$ are reported in Table\\,\\ref{tab:alma}), and the best fit value is the peak position of the distribution. The confidence intervals ($a_1$, $a_2$) for the parameter $a$ are found such as\n\n", "itemtype": "equation", "pos": 19288, "prevtext": "\nwhere $\\phi$ refers to the azimuth in polar coordinate, and $\\Phi$ is the position angle of the location of interest ($x$, $y$) with respect to the stellar location ($x_0$, $y_0$) as:\n\n\n", "index": 3, "text": "\\begin{equation}\n\\Phi = \\mathrm{arctan}\\frac{x - x_0}{y - y_0} + \\theta,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\Phi=\\mathrm{arctan}\\frac{x-x_{0}}{y-y_{0}}+\\theta,\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>=</mo><mrow><mrow><mi>arctan</mi><mo>⁢</mo><mfrac><mrow><mi>x</mi><mo>-</mo><msub><mi>x</mi><mn>0</mn></msub></mrow><mrow><mi>y</mi><mo>-</mo><msub><mi>y</mi><mn>0</mn></msub></mrow></mfrac></mrow><mo>+</mo><mi>θ</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $\\gamma = 0.68$ and $p(a)$ is the smoothed posterior probability distribution (integral normalized to $1$) for parameter $a$ (e.g., \\citealp{Pinte2008}). One should note that not all the distributions reach zero on each sides of their maximum (especially for $\\alpha_{\\mathrm{out}}$ and $i$), and therefore these uncertainties should be treated carefully. Table\\,\\ref{tab:alma} summarizes our results for the  modeling of the Band 6 observations, and Figure\\,\\ref{fig:ALMA} shows the observations, the best-fit model, and the residuals (from left to right). The synthetic image of the best fit model is processed through CASA (using the \\texttt{ft} method with the same antenna configuration as the observations) and the image is reconstructed with the \\texttt{clean} algorithm with the same parameters as for the observations. One can note that there are some residuals on the East side that may suggest that the disk is brighter on one side, even at mm wavelength. However, these residuals are below $3\\,\\sigma$, therefore we cannot conclude they are significant. The apparent brightness asymmetry could be due to the asymmetric ($u$, $v$) coverage of the observations.\n\nWe find that most of the parameters are overall well constrained, except for the outer power-law slope of the dust density distribution, for which we can safely exclude slopes shallower than $\\alpha_{\\mathrm{out}} = -4$. This is explained by the beam size of the observations which is larger than the debris disk for steep values of $\\alpha_{\\mathrm{out}}$. Otherwise, we find the semi latus rectum of the disk to be $r_0 \\sim 66$\\,AU, the position angle $\\phi \\sim 70.7^{\\circ}$, the inclination $i \\sim 84.5^{\\circ}$, and the flux at 1.3\\,mm $f_{1300} \\sim 4.6$\\,mJy. These results agree well with the parameters reported in \\citet[][$i = 84.3\\pm1^{\\circ}$, $\\phi = 70.3\\pm1^{\\circ}$, $r_0 = 61.25\\pm0.85$\\,AU]{Buenzli2010} and \\citet[][$r_0 = 67\\pm2$\\,AU, $\\phi = 71.5\\pm5^{\\circ}$]{Ricarte2013}. The relatively large beam size of the ALMA observations can explain the slight discrepancy for $r_0$ between the modeling of the ALMA data and the value inferred by \\citet{Buenzli2010}. This value will be revisited when modeling the SPHERE observations (Section\\,\\ref{sec:sphere}). \\citet{Ricarte2013} obtained a total flux of $7.2\\pm0.3$\\,mJy at $1.3$\\,mm with their SMA observations, while we find the total flux to be well constrained at $4.6\\pm0.7$\\,mJy (within the SMA and ALMA respective $3\\sigma$ uncertainties). The shortest baseline being of $B_{\\mathrm{min}} \\sim 11$\\,m, the largest scale our observations are sensitive to is of the order of $14.2^{\\prime\\prime}$ ($0.6 \\lambda / B_{\\mathrm{min}}$), much bigger than the disk. It is therefore unlikely that flux from the disk is filtered out by the interferometer. The differences between the SMA and ALMA data may arise from missing frequencies, differences in beam sizes, or calibration uncertainties.\n\nOne should finally note that the famous wings responsible for the disk's nickname are not detected in the ALMA data. Despite a good angular resolution, a disk model (without wings) can succesfully reproduce the observations, and we see no trace of the wings in the residuals (with an rms of $\\sim 0.09$\\,mJy/beam). Our results therefore agree with the ones of \\citet{Ricarte2013}; only small dust grains are likely present in the wings.\n\n\n\n\n\\section{Constraining the dust radial distribution from the SPHERE observations}\\label{sec:sphere}\n\nWe model the SPHERE images by producing synthetic images at the central wavelength of the $H$ band observations, $\\lambda_{\\mathrm{c}} = 1.63$\\,$\\umu$m. Given the low S/N of the $K$ band ADI observations, preliminary attempts to model these data showed that the dust distribution cannot be better constrained than with the $H$ band observations. We therefore focus the modeling effort on the $H$ band ADI and DPI data.\n\nFigure\\,\\ref{fig:all_data} highlights the complementarity of both the scattered and polarized light images; the ADI and DPI data have very different S/N at the ansae and along the semi-minor axis of the disk. Combining both datasets therefore offers the opportunity to study the dust distribution in great detail.\n\nThe modeling process has a high dimensionality with many possible free parameters, and regions of intermediate to low S/N. Therefore, to obtain novel yet reliable constraints on the dust distribution we choose to perform a prior analysis on the observations to reduce the number of free parameters. Having a proper description of the polarized phase function prior to the modeling of the DPI observations greatly helps reducing the dimensionality of the modeling (e.g., the minimum and maximum grain as well as the porosity of the dust grains). In this Section, we first describe how the polarized phase function is derived and modeled, then we present the modeling strategy and summarize the results we obtain.\n\n\\subsection{Phase function of the polarized light}\\label{sec:pfunc}\n\nTo compute the polarized phase function from the DPI dataset, we define an elliptical mask with the following parameters: inner and outer radii ($r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$), the inclination $i$, and the position angle $\\phi$. For each pixel within the elliptical mask, we compute the scattering angle as the dot product of the line of sight and the location of the pixel with respect to the star. We divide the elliptical mask in two, for the East and West sides, and for each side, we compute the minimum and maximum scattering angles. We then divide each side of the mask into $30$ smaller regions corresponding to different bins of the phase function (see Fig.\\,\\ref{fig:ell_pfunc} for an illustration). Each pixel is multiplied by its squared distance to the star, to account for illumination effect. The measured phase function is found by avering the flux in the observations, in each individual regions. Since the observed uncertainties $\\sigma_i$ are not the same for each pixel within a given intersection, the ``average'' uncertainty in the intersection is computed as follows,\n\n", "itemtype": "equation", "pos": 32274, "prevtext": "\nwhere $\\theta$ corrects for instrumental effects such as a small misalignment of the half-wave plate.\n\nDuring the data reduction process, one HWP cycle equivalent to 256\\,s of data (DIT = 16\\,s) was taken out because the telescope had lost tracking for a short amount of time, rendering this data unusable. The result are two pairs of $Q_{\\phi}$ and $U_{\\phi}$ images, one for the DIT=16\\,s and DIT=64\\,s observations each. These were then combined with a weighted average to produce the final $Q_{\\phi}$ and $U_{\\phi}$ images.\n\n\\subsubsection{IFS observations}\n\nThe IFS data proved difficult to be properly reduced at the time of this analysis, mainly due to centering problems. Presenting and analyzing these observations is postponed to a future study.\n\n\\subsubsection{Processed images}\n\nFigure\\,\\ref{fig:all_data} shows the final reduction for our dataset (with a central mask of radius $0.15^{\\prime\\prime}$ ). The top row displays the IRDIS ADI data in $H$ and $K$ bands (left and middle panels, respectively), and the IRDIS DPI $Q_{\\phi}$ image (right), all with a linear stretch. For each image, the bottom row shows a S/N map, with a linear stretch between [$-3\\sigma$, $3\\sigma$]. The noise map is calculated from the reduced images and represents the standard deviation in concentric annuli, centered on the star, with a constant width (2 pixels). We did not mask out the disk when computing the noise maps, hence the uncertainties might be slightly over-estimated. For the DPI observations, the noise map is computed from the $U_{\\phi}$ image which does not seem to contain any signal from the disk (Fig.\\,\\ref{fig:uphi} shows the $U_{\\phi}$ image with the same linear stretch as the $Q_{\\phi}$ image in Fig.\\ref{fig:all_data}).\n\nIt should be noted that the disk is not homogeneously detected at high S/N. The East side is detected at larger S/N in all datasets and it appears brighter than the West side. Such asymmetry, already reported in \\citet{Buenzli2010}, will be further investigated in this paper. For the sake of simplicity, in the rest of the paper, we will refer to the ADI and DPI datasets as ``scattered'' and ``polarized'' observations, respectively. Strictly speaking, this is not correct as polarized photons must have been scattered by dust grains.\n\n\\subsection{ALMA observations}\n\nHD\\,61005 was observed with ALMA in Band\\,6 (PI: David Rodriguez, program 2012.1.00437.S), in the frequency range $211.97-230.99$\\,GHz. The target was observed several times, with precipitable water vapor ranging from 5.19 to 0.79\\,mm. We only kept the observations performed on the 20$^{\\mathrm{th}}$ of March 2014 for which the water vapor was minimum. Out of the four spectral windows, three were used to derive the continuum emission ($211.97-228.97$\\,GHz, with a $31250$\\,kHz resolution), while the last one was used to search for CO gas emission ($230.05-230.99$\\,GHz, with a $488.28$\\,kHz resolution), which was not detected. Data processing was performed within CASA using the standard scripts provided by the observatory. We only kept the spectral windows used for the continuum observations and averaged the complex visibilities along the 128 different spectral channels (while flagging points with negative weights). Figure\\,\\ref{fig:uvplane} shows the ($u$, $v$) plane coverage for the continuum observations, with minimum and maximum baselines of 11.8 and 334.9\\,m, respectively. The reconstructed image (with ``briggs'' weighting and pixel size of $0.13^{\\prime\\prime}$) is shown in the left panel of Figure\\,\\ref{fig:ALMA} (sensitivity of $0.09$\\,mJy/beam). The beam size is $1.36^{\\prime\\prime} \\times 0.73^{\\prime\\prime}$ (48\\,AU$\\times$26\\,AU) with a position angle of $-86.5^{\\circ}$. We do not attempt to measure the total flux of the disk directly from these observations, but will estimate it when modeling the complex visibilities (Section\\,\\ref{sec:alma}).\n\n\n\n\n\\subsection{Spectral energy distribution}\n\n\\begin{table}\n\\caption{Broadband photometric measurements of HD\\,61005, and the equivalent widths of the far-IR filters (see text for details).\\label{tab:flux}}\n\\centering\n\\begin{tabular}{@{}lcccr@{}}\n\\hline\\hline\n $\\lambda$ & $F_{\\nu}$ & $\\sigma$ & EW & Instrument \\\\\n $[\\umu$m] & [mJy] & [mJy] & [$\\umu$m] & \\\\\n\\hline\n0.428  &   895.17 &  14.02 &        & TYCHO B    \\\\\n0.534  &  1810.23 &  18.34 &        & TYCHO V    \\\\\n1.235  &  2753.74 &  65.94 &        & 2MASS J    \\\\\n1.662  &  2440.48 & 103.40 &        & 2MASS H    \\\\\n2.159  &  1738.75 &  38.43 &        & 2MASS Ks   \\\\\n3.353  &   819.28 &  31.69 &        & WISE W1    \\\\\n4.603  &   453.05 &   8.76 &        & WISE W2    \\\\\n11.56  &    78.40 &   1.08 &        & WISE W3    \\\\\n22.09  &    44.28 &   1.55 &        & WISE W4    \\\\\n68.92  &   717.00 &   5.33 &  21.41 & PACS Blue  \\\\\n97.90  &   703.58 &   6.84 &  31.29 & PACS Green \\\\\n153.94 &   472.65 &  14.58 &  69.76 & PACS Red   \\\\\n251.50 &   235.6  &  13.5  &  67.61 & SPIRE PSW  \\\\\n352.83 &   118.9  &   7.6  &  95.75 & SPIRE PMW  \\\\\n511.60 &    49.8  &   5.2  & 185.67 & SPIRE PLW  \\\\\n1300.0\\tablefootmark{a} &     4.6  &   0.7  & 105.40 & ALMA Band\\,6  \\\\\n\\hline\n\\end{tabular}\n\\tablefoottext{a}{Results from the modeling of the ALMA data (Section\\,\\ref{sec:alma}).}\n\\end{table}\n\nThe star HD\\,61005 was observed by {\\it Herschel} (\\citealp{Pilbratt2010}) with the \\textit{Photodetector Array Camera and Spectrometer} instrument (\\citealp[PACS,][]{Poglitsch2010}), within the program ``OT2\\_tcurrie\\_1''. The observation numbers (OBSID) are the two pairs 1342270977, 1342270978 and 1342270979, 1342270980 for the 70\\,$\\umu$m and 100\\,$\\umu$m observations, respectively. The 160\\,$\\umu$m map used the four OBSID combined. The data were processed using the HIPE software (build 12.0.2083, \\citealp{Ott2010}), the very same way as described in \\citet{Olofsson2013}. HD\\,61005 was also observed with the \\textit{Spectral and Photometric Imaging Receiver} instrument (\\citealp[SPIRE,][]{Griffin2010}) in small scan map mode (OBSID: 1342255147 within the program ``OT2\\_kstape01\\_1''). We used the ``Timeline Fitter'' task in HIPE to derive SPIRE photometry for our target. Calibration errors ($\\sim$\\,5.5\\%, \\citealp{Bendo2013}) are included in the uncertainties. We also gathered photometric observations using VOSA\\footnote{http://svo2.cab.inta-csic.es/theory/vosa/} (\\citealp{Bayo2008}) and the dataset used to build the SED can be found in Table\\,\\ref{tab:flux}. The meaning of the third column is explained in Section\\,\\ref{sec:sed}.\n\nFinally, we downloaded the {\\it Spitzer}/IRS spectrum from the ``Cornell Atlas of Spitzer/IRS Sources'' database\\footnote{The Cornell Atlas of Spitzer/IRS Sources is a product of the Infrared Science Center at Cornell University, supported by NASA and JPL. http://cassis.sirtf.com/atlas/query.shtml} (\\citealp{Lebouteiller2011}).\n\n\n\n\n\n\\subsection{Stellar parameters}\n\nThe stellar photospheric model is taken from the ATLAS9 Kurucz library \\citep{Castelli1997}, with an effective temperature of $T_{\\star} = 5500$\\,K (\\citealp{Casagrande2011}). With the dilution factor used to scale the photospheric model to the optical and near-IR photometric measurements, at a distance of 35.4\\,pc, we find a radius $R_{\\star} = 0.84$\\,$R_{\\odot}$. We derived a luminosity of $L_{\\star} = 0.58$\\,$L_{\\odot}$. To derive the stellar mass, which will become important when discussing the dust properties and the effect of radiation pressure on dust grains, we use isochrones from \\citet{Siess2000}, for an age of 40\\,Myr and effective temperature of $5500$\\,K. We find that the stellar mass must be of about $1.1$\\,$M_{\\odot}$ (the corresponding luminosity matching our estimated $L_{\\star}$). We find a slightly smaller mass ($1$\\,$M_{\\odot}$) when using the isochrones from \\citet{Baraffe2015}, but the differences may arise from different model prescriptions (e.g. overshoothing). In the following, we will adopt a mass of $1.1$\\,$M_{\\odot}$. The SED with the broadband photometric measurements, the {\\it Spitzer}/IRS spectrum as well as the photospheric model are shown in Figure\\,\\ref{fig:SED} of Section\\,\\ref{sec:sed}.\n\n\n\n\n\n\n\n\\section{The parent planetesimal belt: constraints from the ALMA observations}\\label{sec:alma}\n\nRoughly speaking, different wavelengths trace different grain sizes. Therefore, we chose to model the ALMA observations independently of the SPHERE ones, the latter probing the small dust grains in the debris disk while the millimeter observations most likely trace a population of larger grains that follow more closely the parent planetesimals belt.\n\n\\subsection{Modeling strategy}\n\nThe modeling of the ALMA observations is performed in the Fourier space, trying to reproduce both the real and imaginary parts of the complex visibilities (averaged along the spectral dimension). In Appendix\\,\\ref{app:DDIT} we explain how we generate synthetic images, and the different notations are summarized in Table\\,\\ref{tab:notations}. From a synthetic image at the wavelength of $1.3$\\,mm, we first scale the total flux of the image to the free parameter $f_{1300}$ (in mJy) before computing the Fourier transform of the image. We then interpolate the Fourier transform at the spatial frequencies of the observations. The goodness of fit is the sum of the weights (estimated in CASA\\footnote{The absolute values of the weights derived within CASA may be inaccurate but their relative values are.}) times the squared difference between the observed and modeled complex visibilities (the weights are proportional to $1 / \\sigma^2$). We consider the following free parameters: the semi latus rectum\\footnote{Here we assume the disk is circular. But when the eccentricity $e$ is not null, the semi-major axis of the disk is equal to $r_0 / (1-e^2)$.} $r_0$, the outer power-law slope for the dust distribution $\\alpha_{\\mathrm{out}}$ (see Eqn\\,\\ref{eqn:dens}), the inclination $i$ and the position angle $\\phi$ (plus the total flux of the disk at $1.3$\\,mm $f_{1300}$). The inner power-law slope is set to $\\alpha_{\\mathrm{in}} = 5$, preliminary tests indicating this parameter is poorly constrained by the observations. To find the most probable solution, we use an affine invariant ensemble sampler Monte-Carlo Markov Chain, implemented in the \\texttt{emcee} package, using $200$ walkers, a burn-in phase of $500$ iterations and a total length of the chains of $2000$ iterations after the burn-in phase. At the end of the run, we find that the mean acceptance fraction (the mean fraction of steps accepted for each walker within the chain) is of $0.48$ (a good sign of convergence and stability, \\citealp{Gelman1992}). The maximum auto-correlation time for all the parameters is of 60 steps, indicating that the chains should have stabilized by the end of the simulations.\n\n\\subsection{Results}\\label{sec:res_alma}\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the modeling of the ALMA observations.\\label{tab:alma}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$r_0$ [AU]              & $[40, 80]$     & $0.2$  & $66.4_{-8.7}^{+6.1}$ \\\\\n$\\alpha_{\\mathrm{out}}$ & $[-15, -1.5]$  & $0.1$  & $-6.6_{-6.1}^{+1.4}$ \\\\\n$\\phi$ [$^{\\circ}$]     & $[55, 85]$     & $0.1$  & $70.7_{-2.3}^{+1.9}$ \\\\\n$i$ [$^{\\circ}$]        & $[79, 89]$     & $0.1$  & $84.5_{-2.5}^{+2.9}$ \\\\\n$f_{1300}$ [mJy]        & $[1, 20]$      & $0.1$  & $4.6_{-0.6}^{+0.7}$  \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\n\\begin{figure*}\n\\includegraphics[width=2\\columnwidth]{ALMA_data.pdf}\n\\caption{From left to right: observations, best fit model and residuals of the ALMA data. For all panels the color map is a linear stretch between $-0.27$ and $1.23$\\,mJy/beam. The standard deviation estimated in an empty region of the observations is of $0.09$\\,mJy/beam. For both the observations and the model the contours are set at [$3$, $5$, $7.5$, $10$]$\\sigma$, and [$-3$, $3$]$\\sigma$ for the residuals. The beam size is shown in the lower left corner of each panels.}\n\\label{fig:ALMA}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{emcee_ALMA.pdf}\n\\caption{One and two dimensional (diagonal and lower triangle, respectively) projections of the posterior probability distributions for the results of the modeling of the ALMA observations.}\n\\label{fig:emcee_ALMA}\n\\end{figure}\n\nThe projected posterior probability distributions are displayed in Figure\\,\\ref{fig:emcee_ALMA}, for the different free parameters (using the \\texttt{triangle} Python package, \\citealp{ForemanMackey2014}). To derive the best-fit values as well as the uncertainties, we smooth the distributions with a kernel density estimator (the width of the Gaussian kernel $\\sigma_{\\mathrm{kde}}$ are reported in Table\\,\\ref{tab:alma}), and the best fit value is the peak position of the distribution. The confidence intervals ($a_1$, $a_2$) for the parameter $a$ are found such as\n\n", "index": 5, "text": "\\begin{equation}\n\\int_{a_{\\mathrm{min}}}^{a_1} p(a) da = \\int_{a_2}^{a_{\\mathrm{max}}} p(a) da = \\frac{1 - \\gamma}{2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\int_{a_{\\mathrm{min}}}^{a_{1}}p(a)da=\\int_{a_{2}}^{a_{\\mathrm{max}}}p(a)da=%&#10;\\frac{1-\\gamma}{2},\" display=\"block\"><mrow><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>a</mi><mi>min</mi></msub><msub><mi>a</mi><mn>1</mn></msub></msubsup><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>a</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>a</mi></mrow></mrow></mrow><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>a</mi><mn>2</mn></msub><msub><mi>a</mi><mi>max</mi></msub></msubsup><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>a</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>a</mi></mrow></mrow></mrow><mo>=</mo><mfrac><mrow><mn>1</mn><mo>-</mo><mi>γ</mi></mrow><mn>2</mn></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $N$ is the number of pixels in the considered region. The phase function is then normalized to its maximum value (East and West sides are divided by the same value).\n\nFor the elliptical mask, we use the best-fit results of the modeling of the ALMA observations (see Table\\,\\ref{tab:alma}) for $i$ and $\\phi$ and choose $r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$ small and large enough ($50$ and $72$\\,AU, respectively) so that they encompass the trace of the debris disk. Figure\\,\\ref{fig:pfunc_dpi} shows the phase function for the DPI $H$ band observations, the East side being in black, and the West side in red. The uncertainties are shown in shaded color.\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{pfunc_DPI_H.pdf}\n\\caption{Azimuthal dependency of the polarized intensity in the DPI $H$ band observations, in black and red for the East and West sides, respectively. The shaded areas are representative of the uncertainties estimated from the noise maps.}\n\\label{fig:pfunc_dpi}\n\\end{figure}\n\nThe difference in brightness between the two sides of the disk is striking from Figure\\,\\ref{fig:pfunc_dpi} and the East side appears almost twice as bright as the West side for most of the scattering angles. Even though the S/N for the West side is relatively low it seems that the polarized phase function peaks at an angle compatible with the East side.\n\nTo reduce the number of free parameters, we aim at constraining the grain size distribution for the modeling of the DPI observations directly from the phase function displayed in Fig.\\,\\ref{fig:pfunc_dpi}. One should keep in mind that we do not have access to the polarization degree ($\\sqrt(Q^2 + U^2) / I$) as we do not have an \\textit{unbiased} measure of the total intensity $I$ prior to the modeling. Indeed, the ADI process introduces self-subtraction effects (e.g., \\citealp{Milli2012}), which can eventually be quantified with a model that describes well the observations (which we do not have yet). Since the West side suffers from low S/N, we perform the modeling on the East side's phase function. To reproduce the phase function, we assume that the signal in the $Q_{\\phi}$ image is proportional to the size dependent $S_{12}(s)$ element of the M\\\"uller matrix. The matrix enables us to compute the Stokes vectors $I$ and $Q$ for the scattered and polarized light, respectively. Assuming single scattering event (reasonable assumption in low density environment such as debris disks), the scattered light will be the product of the first diagonal element of the matrix $S_{11}$ times the stellar intensity $I_0$. The polarized intensity will be proportional to the second element of the first column of the matrix $S_{12}$ times $I_0$. We compute $S_{12}$ for different grain sizes between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, using the Mie theory, and we average $S_{12}$ over a grain size distribution with a slope $p < 0$ (d$n(s) \\propto s^p$d$s$) as follows,\n\n", "itemtype": "equation", "pos": 38513, "prevtext": "\nwhere $\\gamma = 0.68$ and $p(a)$ is the smoothed posterior probability distribution (integral normalized to $1$) for parameter $a$ (e.g., \\citealp{Pinte2008}). One should note that not all the distributions reach zero on each sides of their maximum (especially for $\\alpha_{\\mathrm{out}}$ and $i$), and therefore these uncertainties should be treated carefully. Table\\,\\ref{tab:alma} summarizes our results for the  modeling of the Band 6 observations, and Figure\\,\\ref{fig:ALMA} shows the observations, the best-fit model, and the residuals (from left to right). The synthetic image of the best fit model is processed through CASA (using the \\texttt{ft} method with the same antenna configuration as the observations) and the image is reconstructed with the \\texttt{clean} algorithm with the same parameters as for the observations. One can note that there are some residuals on the East side that may suggest that the disk is brighter on one side, even at mm wavelength. However, these residuals are below $3\\,\\sigma$, therefore we cannot conclude they are significant. The apparent brightness asymmetry could be due to the asymmetric ($u$, $v$) coverage of the observations.\n\nWe find that most of the parameters are overall well constrained, except for the outer power-law slope of the dust density distribution, for which we can safely exclude slopes shallower than $\\alpha_{\\mathrm{out}} = -4$. This is explained by the beam size of the observations which is larger than the debris disk for steep values of $\\alpha_{\\mathrm{out}}$. Otherwise, we find the semi latus rectum of the disk to be $r_0 \\sim 66$\\,AU, the position angle $\\phi \\sim 70.7^{\\circ}$, the inclination $i \\sim 84.5^{\\circ}$, and the flux at 1.3\\,mm $f_{1300} \\sim 4.6$\\,mJy. These results agree well with the parameters reported in \\citet[][$i = 84.3\\pm1^{\\circ}$, $\\phi = 70.3\\pm1^{\\circ}$, $r_0 = 61.25\\pm0.85$\\,AU]{Buenzli2010} and \\citet[][$r_0 = 67\\pm2$\\,AU, $\\phi = 71.5\\pm5^{\\circ}$]{Ricarte2013}. The relatively large beam size of the ALMA observations can explain the slight discrepancy for $r_0$ between the modeling of the ALMA data and the value inferred by \\citet{Buenzli2010}. This value will be revisited when modeling the SPHERE observations (Section\\,\\ref{sec:sphere}). \\citet{Ricarte2013} obtained a total flux of $7.2\\pm0.3$\\,mJy at $1.3$\\,mm with their SMA observations, while we find the total flux to be well constrained at $4.6\\pm0.7$\\,mJy (within the SMA and ALMA respective $3\\sigma$ uncertainties). The shortest baseline being of $B_{\\mathrm{min}} \\sim 11$\\,m, the largest scale our observations are sensitive to is of the order of $14.2^{\\prime\\prime}$ ($0.6 \\lambda / B_{\\mathrm{min}}$), much bigger than the disk. It is therefore unlikely that flux from the disk is filtered out by the interferometer. The differences between the SMA and ALMA data may arise from missing frequencies, differences in beam sizes, or calibration uncertainties.\n\nOne should finally note that the famous wings responsible for the disk's nickname are not detected in the ALMA data. Despite a good angular resolution, a disk model (without wings) can succesfully reproduce the observations, and we see no trace of the wings in the residuals (with an rms of $\\sim 0.09$\\,mJy/beam). Our results therefore agree with the ones of \\citet{Ricarte2013}; only small dust grains are likely present in the wings.\n\n\n\n\n\\section{Constraining the dust radial distribution from the SPHERE observations}\\label{sec:sphere}\n\nWe model the SPHERE images by producing synthetic images at the central wavelength of the $H$ band observations, $\\lambda_{\\mathrm{c}} = 1.63$\\,$\\umu$m. Given the low S/N of the $K$ band ADI observations, preliminary attempts to model these data showed that the dust distribution cannot be better constrained than with the $H$ band observations. We therefore focus the modeling effort on the $H$ band ADI and DPI data.\n\nFigure\\,\\ref{fig:all_data} highlights the complementarity of both the scattered and polarized light images; the ADI and DPI data have very different S/N at the ansae and along the semi-minor axis of the disk. Combining both datasets therefore offers the opportunity to study the dust distribution in great detail.\n\nThe modeling process has a high dimensionality with many possible free parameters, and regions of intermediate to low S/N. Therefore, to obtain novel yet reliable constraints on the dust distribution we choose to perform a prior analysis on the observations to reduce the number of free parameters. Having a proper description of the polarized phase function prior to the modeling of the DPI observations greatly helps reducing the dimensionality of the modeling (e.g., the minimum and maximum grain as well as the porosity of the dust grains). In this Section, we first describe how the polarized phase function is derived and modeled, then we present the modeling strategy and summarize the results we obtain.\n\n\\subsection{Phase function of the polarized light}\\label{sec:pfunc}\n\nTo compute the polarized phase function from the DPI dataset, we define an elliptical mask with the following parameters: inner and outer radii ($r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$), the inclination $i$, and the position angle $\\phi$. For each pixel within the elliptical mask, we compute the scattering angle as the dot product of the line of sight and the location of the pixel with respect to the star. We divide the elliptical mask in two, for the East and West sides, and for each side, we compute the minimum and maximum scattering angles. We then divide each side of the mask into $30$ smaller regions corresponding to different bins of the phase function (see Fig.\\,\\ref{fig:ell_pfunc} for an illustration). Each pixel is multiplied by its squared distance to the star, to account for illumination effect. The measured phase function is found by avering the flux in the observations, in each individual regions. Since the observed uncertainties $\\sigma_i$ are not the same for each pixel within a given intersection, the ``average'' uncertainty in the intersection is computed as follows,\n\n", "index": 7, "text": "\\begin{equation}\n\\sigma = \\left( \\sum_{i=1}^{N} \\frac{1}{\\sigma_i^2} \\right)^{-1/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\sigma=\\left(\\sum_{i=1}^{N}\\frac{1}{\\sigma_{i}^{2}}\\right)^{-1/2},\" display=\"block\"><mrow><mrow><mi>σ</mi><mo>=</mo><msup><mrow><mo>(</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mfrac><mn>1</mn><msubsup><mi>σ</mi><mi>i</mi><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nWe then find the best scaling factor $f_{S_{12}}$ (to be multiplied to $S_{12}^{\\mathrm{avg}}$) that will minimize the difference between the profiles $S_{12}^{\\mathrm{avg}}$ and $S_{12}^{\\mathrm{obs}}$ (with uncertainties $\\sigma$)\n\n", "itemtype": "equation", "pos": 41563, "prevtext": "\nwhere $N$ is the number of pixels in the considered region. The phase function is then normalized to its maximum value (East and West sides are divided by the same value).\n\nFor the elliptical mask, we use the best-fit results of the modeling of the ALMA observations (see Table\\,\\ref{tab:alma}) for $i$ and $\\phi$ and choose $r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$ small and large enough ($50$ and $72$\\,AU, respectively) so that they encompass the trace of the debris disk. Figure\\,\\ref{fig:pfunc_dpi} shows the phase function for the DPI $H$ band observations, the East side being in black, and the West side in red. The uncertainties are shown in shaded color.\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{pfunc_DPI_H.pdf}\n\\caption{Azimuthal dependency of the polarized intensity in the DPI $H$ band observations, in black and red for the East and West sides, respectively. The shaded areas are representative of the uncertainties estimated from the noise maps.}\n\\label{fig:pfunc_dpi}\n\\end{figure}\n\nThe difference in brightness between the two sides of the disk is striking from Figure\\,\\ref{fig:pfunc_dpi} and the East side appears almost twice as bright as the West side for most of the scattering angles. Even though the S/N for the West side is relatively low it seems that the polarized phase function peaks at an angle compatible with the East side.\n\nTo reduce the number of free parameters, we aim at constraining the grain size distribution for the modeling of the DPI observations directly from the phase function displayed in Fig.\\,\\ref{fig:pfunc_dpi}. One should keep in mind that we do not have access to the polarization degree ($\\sqrt(Q^2 + U^2) / I$) as we do not have an \\textit{unbiased} measure of the total intensity $I$ prior to the modeling. Indeed, the ADI process introduces self-subtraction effects (e.g., \\citealp{Milli2012}), which can eventually be quantified with a model that describes well the observations (which we do not have yet). Since the West side suffers from low S/N, we perform the modeling on the East side's phase function. To reproduce the phase function, we assume that the signal in the $Q_{\\phi}$ image is proportional to the size dependent $S_{12}(s)$ element of the M\\\"uller matrix. The matrix enables us to compute the Stokes vectors $I$ and $Q$ for the scattered and polarized light, respectively. Assuming single scattering event (reasonable assumption in low density environment such as debris disks), the scattered light will be the product of the first diagonal element of the matrix $S_{11}$ times the stellar intensity $I_0$. The polarized intensity will be proportional to the second element of the first column of the matrix $S_{12}$ times $I_0$. We compute $S_{12}$ for different grain sizes between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, using the Mie theory, and we average $S_{12}$ over a grain size distribution with a slope $p < 0$ (d$n(s) \\propto s^p$d$s$) as follows,\n\n", "index": 9, "text": "\\begin{equation}\n    S_{12}^{\\mathrm{avg}} = \\cfrac{\\int_{s_{\\mathrm{min}}}^{s_{\\mathrm{max}}} S_{12}(s) \\times s^p \\mathrm{d}s}{\\int_{s_{\\mathrm{min}}}^{s_{\\mathrm{max}}} s^p \\mathrm{d}s}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"S_{12}^{\\mathrm{avg}}=\\cfrac{\\int_{s_{\\mathrm{min}}}^{s_{\\mathrm{max}}}S_{12}(%&#10;s)\\times s^{p}\\mathrm{d}s}{\\int_{s_{\\mathrm{min}}}^{s_{\\mathrm{max}}}s^{p}%&#10;\\mathrm{d}s}.\" display=\"block\"><mrow><mrow><msubsup><mi>S</mi><mn>12</mn><mi>avg</mi></msubsup><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\cfrac</mtext></merror><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>s</mi><mi>min</mi></msub><msub><mi>s</mi><mi>max</mi></msub></msubsup><mrow><mrow><mrow><msub><mi>S</mi><mn>12</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><msup><mi>s</mi><mi>p</mi></msup></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>s</mi></mrow><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>s</mi><mi>min</mi></msub><msub><mi>s</mi><mi>max</mi></msub></msubsup><mrow><msup><mi>s</mi><mi>p</mi></msup><mo>⁢</mo><mrow><mo>d</mo><mi>s</mi></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nWe perform a simple grid search over the following parameters: $s_{\\mathrm{min}}$, $s_{\\mathrm{max}}$, and the optical properties of the dust grains. We fix $p = -3.5$, as expected for a collisional cascade in a debris disk (\\citealp{Dohnanyi1969}). For the dust composition, we consider a base medium of amorphous silicate with olivine stoichiometry (MgFeSiO$_4$, \\citealp{Dorschner1995}) to which we can add some porosity using the Bruggeman mixing rule. The minimum grain size can vary between $0.01$ and $10$\\,$\\umu$m. To constrain the maximum grain size, we vary the quantity  $\\Delta s$ ($= s_{\\mathrm{max}} - s_{\\mathrm{min}}$) between $0.01$ and $100$\\,$\\umu$m (in log space), and finally the porosity can change by steps of $10$\\%. We find that the polarized phase function at $1.63$\\,$\\umu$m is best reproduced by small spherical dust grains,\nwith typical sizes in the range $s = 0.3 \\pm 0.03$\\,$\\umu$m and a porosity fraction of $\\sim 80$\\%. The best fit solution is shown in cyan line in Figure\\,\\ref{fig:pfunc_dpi}, and reproduces well both the overall shape and the peak position of the observed phase function. In this Section, we assumed that the polarized flux is directly proportional to $S_{12}$, while it is also related to the dust density in the disk. In the rest of the paper, we will try to determine the azimuthal distribution of the dust in the disk. Therefore, this prior analysis must be regarded as a first order approximation. Overall, the motivation of this prior analysis was to reduce the dimensionality of the modeling, but it also comes at a slight cost in the interpretation of the grain size distribution. The main conclusion of this Section is that it does not seem we observe large dust grains (which would have a stronger $S_{12}$ signal at small scattering angles). In Section\\,\\ref{discuss:dust} we will further discuss this result, but it could also be the consequence of low S/N along the semi-minor axis of the disk.\n\n\\subsection{Modeling strategy}\n\nSince both the ADI and DPI datasets were taken at the same wavelength, for a given set of parameters we compute two images: an unpolarized light image using the Henyey-Greenstein (HG) analytical prescription of phase function $S_{11}$ (\\citealp{Henyey1941}) and a polarized light image using the Mie theory. Using the HG approximation, parametrized by the anisotropic scattering factor $g$ ($-1 \\leq g \\leq 1$), gives us more control to try to reproduce the observed phase function (hence less free parameters to be considered during the modeling). To reproduce the DPI observations, we use the grain properties derived previously. The absorption and scattering efficiencies as well as the M\\\"uller matrix element $S_{12}$ are computed with the Mie theory, valid for compact spherical grains. This approach may not appear self-consistent but is a way to disentangle the modeling of unpolarized and polarized light that may not be well accounted for by spherical grains (e.g., \\citealp{Milli2015}).\n\nThe pool of free parameters includes the semi latus rectum $r_0$, the inclination $i$, the position angle $\\phi$, the opening angle $\\psi$, and the outer power-law slope $\\alpha_{\\mathrm{out}}$ for the dust density distribution. Preliminary tests indicated that we can hardly constrain the inner power-law slope, so we fixed $\\alpha_{\\mathrm{in}} = 5$. This enables us to focus on other parameters that describe the geometry of the debris disk. For instance, \\citet{Buenzli2010} concluded that the eccentricity of the disk was not enough to explain the brightness asymmetry between the East and the West sides, and we aim at addressing these observational facts here. Therefore, we include the eccentricity $e$, the rotation angle $\\Phi_{\\mathrm{e}}$, the density damping $\\eta$ and its azimuthal shape (via the width $w$ of the Gaussian profile) and its reference angle $\\Phi_{\\mathrm{\\eta}}$ (see App.\\,\\ref{app:DDIT}). The azimuthal profile has the shape of a Gaussian profile with a $\\sigma = w$, a peak of $1$ for the azimuthal angle $\\Phi_{\\eta}$ and a minimum value of $\\eta \\geq 0$ (hence an amplitude of $1-\\eta$). The dust mass $M_{\\mathrm{dust}}$ is not varied, but the synthetic images are scaled during the fitting process. For the polarized images, the modeled image is the absolute value of the Stokes $Q_{\\phi}$ parameter (we are assuming that there are no multiple scattering events in the debris disk). We scale the modeled image by a factor $f_{\\mathrm{DPI}}$ that is found analytically to minimize the residuals (similarly to Eqn.\\ref{eqn:minimize}). For the ADI dataset such approach is not possible, because the post-processing of the data-cube can introduce self-subtraction effects. We therefore opted for a forward modeling strategy, similar to the one described in \\citet{Thalmann2014}. For a given set of parameters, we compute one synthetic image at the wavelength $1.63$\\,$\\umu$m. We then produce a cube of 64 images, each one rotated to match the parallactic angles of each frames of the observations (total rotation of $93.3^{\\circ}$). Each frame of the cube of synthetic images is multiplied by $f_{\\mathrm{ADI}}$ and is then subtracted to the corresponding observed frame. The PCA process is performed, keeping only the 6 main components. The end goal being to minimize the flux in the final image.\n\nThe goodness of the fit is the sum of the squared ratio between the final images (residuals for the scattered and polarized data) and the noise map (bottom row of Fig.\\,\\ref{fig:all_data}). For the modeling of both the ADI and DPI observations, we therefore have a total of 12 free parameters: $r_0$, $i$, $\\alpha_{\\mathrm{out}}$, $e$, $\\Phi_{\\mathrm{e}}$, $\\phi$, $\\eta$, $\\Phi_{\\mathrm{\\eta}}$, $w$, $\\psi$, $g$, and $f_{\\mathrm{ADI}}$. Here, we also use the \\texttt{emcee} Python package, with 100 ``walkers'' in the chain, and first burn in 500 runs for each of these walkers. We then run the chain for 2000 iterations in total (see \\citealp{MillarBlanchaer2015} for a similar modeling approach). To speed up the process, we cropped and re-sampled the SPHERE images. The size of one pixel in the new image (or cube) is re-sampled to be $2.25$ times bigger than in the original images, and the size of the new image is $200 \\times 200$ pixels, and we use a central mask of radius $0.15^{\\prime\\prime}$. We chose not to convolve the synthetic images by a PSF because the cropped and down-sampled images having a pixel size of $0.028^{\\prime\\prime}$, while the approximation of the instrumental PSF with a Gaussian profile would have a width of $0.024^{\\prime\\prime}$ (approximating the PSF as an Airy disk for an 8\\,m telescope). At the end of the run, we find that the mean acceptance fraction (the mean fraction of steps accepted for each walker within the chain) is of $0.35$, with a maximum auto-correlation time of 79 steps.\n\n\\subsection{Results}\n\n\\begin{figure*}[!htbp]\n\\includegraphics[width=2\\columnwidth]{combined.pdf}\n\\caption{\\textit{Left to right}: observed, residuals, and best fit models for the ADI and DPI datasets (top and bottom, respectively).}\n\\label{fig:residuals_H}\n\\end{figure*}\n\n\n\n\n\n\n\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the ADI and DPI $H$ band observations.\\label{tab:res_H}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$r_0$ [AU]                       & $[40, 80]$     & $0.1$   & $60.4_{-0.5}^{+0.8}$ \\\\\n$i$ [$^{\\circ}$]                 & $[75, 88]$     & $0.1$   & $84.1_{-0.2}^{+0.2}$ \\\\\n$\\alpha_{\\mathrm{out}}$          & $[-10, -1.75]$ & $0.01$  & $-2.70_{-0.1}^{+0.1}$ \\\\\n$e$                              & $[0, 0.6]$     & $0.0025$& $0.093_{-0.014}^{+0.018}$ \\\\\n$\\Phi_{\\mathrm{e}}$ [$^{\\circ}$]    & $[0, 360]$     & $1.$    & $127.3_{-4.3}^{+12.7}$ \\\\\n$\\phi$ [$^{\\circ}$]              & $[65, 75]$     & $0.1$   & $70.6_{-0.3}^{+0.2}$ \\\\\n$\\eta$                           & $[0, 1]$       & $0.0025$& $0.47_{-0.04}^{+0.02}$ \\\\\n$\\Phi_{\\mathrm{\\eta}}$ [$^{\\circ}$] & $[0, 360]$     & $1.0$   & $138.1_{-5.6}^{+7.2}$ \\\\\n$w$ [$^{\\circ}$]                 & $[5, 180]$     & $1.0$   & $51.7_{-3.2}^{+8.8}$ \\\\\n$\\psi$                           & $[0.02, 0.12]$ & $0.005$ & $0.058_{-0.002}^{+0.001}$ \\\\\n$g$                              & $[0, 0.95]$    & $0.001$ & $0.54_{-0.02}^{+0.01}$ \\\\\n$f_{\\mathrm{ADI}}$               & $[3, 8.5]$     & $0.01$  & $6.20_{-0.07}^{+0.09}$ \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\nThe projected posterior probability distributions are displayed in Figure\\,\\ref{fig:pdf_H}, for the different free parameters. To derive the best-fit values as well as the uncertainties, we proceed similarly as in Section\\,\\ref{sec:res_alma}. The results are presented in Table\\,\\ref{tab:res_H} and Figure\\,\\ref{fig:residuals_H} shows the observations, the residuals and the best-fit models (from left to right) for the ADI and the DPI data (top and bottom rows, respectively).\n\nAll parameters seem to be well constrained. The most probable solution has a semi-major axis of 60.9\\,AU ($r_0 / [1 - e^2]$) for an eccentricity of $0.093$. With a rotation angle of $\\Phi_{\\mathrm{e}} \\sim 127^{\\circ}$ the pericenter is located slightly toward the observer, on the East side\\footnote{For $\\Phi_{\\mathrm{e}} = 180^{\\circ}$, the pericenter would be along the semi-major axis on the East side. Smaller angles would move the pericenter towards the observer, while larger angles would move the pericenter towards the back side of the disk.}. An azimuthal density variation seems to be necessary to reproduce the observations, with a damping factor $\\eta$ of $\\sim 0.47$ with a reference angle of $\\sim 138^{\\circ}$ (hence almost co-located with the pericenter of the eccentric disk). The azimuthal variation of the dust density distribution is a Gaussian profile with a width of $\\sim 50^{\\circ}$. The position angle and inclination are consistent with the results from \\citet{Buenzli2010}. The aspect ratio of $h/r \\sim 0.06$ agrees well with numerical simulations of the vertical structures of debris disks (e.g., \\citealp{Thebault2009}). Finally, the phase function is anisotropic for low scattering angles with $g \\sim 0.54$. The dust density distribution for the best fit model, viewed from above the disk, is displayed in Figure\\,\\ref{fig:best_sketch}.\n\nNonetheless, as shown in the residuals of the ADI observations, our best fit model does not manage to remove all the signal along the semi-minor axis of the disk. It successfully suppresses most of the signal at larger scattering angles, but the best fit model seems to fail at properly describing the scattering at smaller angles. We tried to implement a phase function with two weighted HG functions, but could not significantly improve the residuals. We included all the ``basic'' parameters related to the geometry of the disk ($i$, $\\phi$, $r_0$, $\\psi$) and yet failed to perfectly match the observations. Possible explanations can be related to the phase function (the HG phase function remains an approximation), the radial segregation of the grain size distribution, or the azimuthal dust density distribution (this will be further discussed in Section\\,\\ref{discuss:dust}). We crudely assumed a Gaussian profile for the azimuthal distribution, but the actual distribution could be skewed in one or another direction which could explain the brighter region along the semi-minor axis. Another (highly speculative yet interesting) explanation would be that we would be seeing an inner disk. Because of the high inclination of the disk, an inner dust belt could appear to the observer as if it was merging with the main belt. The main challenge to this explanation is that we see no indication of such a belt in the DPI observations, but the noise is larger in the innermost regions of this dataset. One possible way to address this point would be to detect gas tracing velocities compatible with a radius smaller than $61$\\,AU. Yet no CO was detected in the ALMA observations (Section\\,\\ref{sec:CO}).\n\n\n\n\n\\section{Constraining the dust mineralogy from the SED}\\label{sec:sed}\n\nThe SED of the debris disk around HD\\,61005 is constructed from the fluxes reported in Table\\,\\ref{tab:flux} and the {\\it Spitzer}/IRS spectrum. Modeling an SED from unresolved observations is a degenerate problem. We are basically trying to find the adequate temperature of the grains, which can be changed either by their radial distances, their sizes, or their nature. The modeling of the SPHERE images provide strong constraints on the geometric parameters of the disk, and we can therefore focus on better constraining the dust properties.\n\n\\subsection{Modeling the thermal emission from the disk}\n\nTo model the SED of HD\\,61005, for a given set of parameters, the goodness of fit is computed as\n\n", "itemtype": "equation", "pos": 42001, "prevtext": "\nWe then find the best scaling factor $f_{S_{12}}$ (to be multiplied to $S_{12}^{\\mathrm{avg}}$) that will minimize the difference between the profiles $S_{12}^{\\mathrm{avg}}$ and $S_{12}^{\\mathrm{obs}}$ (with uncertainties $\\sigma$)\n\n", "index": 11, "text": "\\begin{equation}\\label{eqn:minimize}\n    f_{S_{12}} = \\cfrac{\\sum \\left( \\cfrac{S_{12}^{\\mathrm{obs}} \\times S_{12}^{\\mathrm{avg}}}{\\sigma^2} \\right)}{\\sum \\left(\\cfrac{S_{12}^{\\mathrm{avg}}}{\\sigma}\\right)^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"f_{S_{12}}=\\cfrac{\\sum\\left(\\cfrac{S_{12}^{\\mathrm{obs}}\\times S_{12}^{\\mathrm%&#10;{avg}}}{\\sigma^{2}}\\right)}{\\sum\\left(\\cfrac{S_{12}^{\\mathrm{avg}}}{\\sigma}%&#10;\\right)^{2}}.\" display=\"block\"><mrow><mrow><msub><mi>f</mi><msub><mi>S</mi><mn>12</mn></msub></msub><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\cfrac</mtext></merror><mo>⁢</mo><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mo>(</mo><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\cfrac</mtext></merror><mo>⁢</mo><msubsup><mi>S</mi><mn>12</mn><mi>obs</mi></msubsup></mrow><mo>×</mo><msubsup><mi>S</mi><mn>12</mn><mi>avg</mi></msubsup></mrow><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msup><mrow><mo>(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\cfrac</mtext></merror><mo>⁢</mo><msubsup><mi>S</mi><mn>12</mn><mi>avg</mi></msubsup><mo>⁢</mo><mi>σ</mi></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $F_{\\mathrm{obs}}$ is the observed flux with its associated uncertainty $\\sigma_i$, $F_{\\star}$ the stellar contribution, and $F_{\\mathrm{model}}$ the modeled thermal emission of the debris disk. The $\\omega_i$ values are weights to the observed data points at wavelength $i$. This weighting is designed to account for the fact that we simultaneously model broadband photometric observations (e.g., {\\it Herschel}/PACS) and spectroscopic observations ({\\it Spitzer}/IRS): two adjacent points in the IRS spectrum do not have the same significance than PACS 70 and 100\\,$\\umu$m observations. We therefore opt for a similar strategy as the one described in \\citet{Ballering2013}. We compute the average spectral resolution of the IRS data and compare it to the equivalent widths of the broadband filters. One IRS point will have a weight $\\omega = 1$ and broadband photometric point will have a weight equal to the number of IRS points that would fit in the corresponding equivalent width of the filter. In Table\\,\\ref{tab:flux}, we report the equivalent widths for the various instruments used to model the thermal emission in the far-IR. These values were taken from the ``Spanish Virtual Observatory'' filter profile service\\footnote{http://svo2.cab.inta-csic.es/theory/fps3/}. For the ALMA Band\\,6 observations, we assumed the equivalent width to be equal to the spectral range ($105$\\,$\\umu$m).\n\nTo account for different mineralogical components, we use amorphous silicate grains of olivine stoichiometry \\citep[MgFeSiO$_4$, ][$\\rho = 3.5$\\,g.cm$^{-3}$]{Dorschner1995} and amorphous water ices \\citep[][$\\rho = 1.2$\\,g.cm$^{-3}$]{Li1998}. To mimic porosity, we also add the fraction of vacuum to the pool of free parameters. We mix the optical constants of the different dust components, using the Bruggeman mixing theory, and the Mie theory to compute the absorption coefficients $Q_{\\mathrm{abs}}$. Since computing $Q_{\\mathrm{abs}}$ for large grain sizes can be the bottle-neck when computing thousands of models, we first created a ``library'' of opacity files ($s_{\\mathrm{min}} = 0.01\\,\\umu$m and $s_{\\mathrm{max}} = 5$\\,mm, with steps of 10\\% for the water ices, and porosity fractions). During the modeling process, the appropriate $Q_{\\mathrm{abs}}$ are drawn and interpolated for the proper grain size distribution and composition.\n\nThe free parameters include the grain size distribution ($s_{\\mathrm{min}}$ and $p$, we fix $s_{\\mathrm{max}} = 5$\\,mm), the relative fractions for the fractions of amorphous water ices and porosity, and the inner and outer slopes for the dust density ($\\alpha_{\\mathrm{in}}$ and $\\alpha_{\\mathrm{out}}$, respectively). We fix the reference radius $r_0$ to the best fit results of the modeling of the SPHERE observations. For each set of parameters the dust mass M$_{\\mathrm{dust}}$ is found by scaling the thermal emission of the model to the observed SED (similarly to Eqn.\\,\\ref{eqn:minimize}). The values for the dust mass are saved for posterior estimation of their corresponding uncertainties. To speed up the modeling of the SED, we neglect the non azimuthal dust density distribution derived from the analysis of the SPHERE data and assume the disk to be a circular ring. We use the \\texttt{emcee} package to search for the most probable model, using 100 walkers, first burning the first 500 runs for each walkers, and then running the chain for 1000 more iterations. The acceptance fraction at the end of the run is of $0.28$ (and a maximum auto-correlation time across all parameters of 72 steps).\n\n\\subsection{Results}\n\n\\begin{figure*}[tbh]\n\\includegraphics[width=2\\columnwidth]{hist_SED.pdf}\n\\caption{Posterior probability distributions for the modeling of the SED. The solid lines mark the most probable value, and the vertical dashed lines mark the derived uncertainties.}\n\\label{fig:pdf_SED}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{HD61005_SED.pdf}\n\\caption{Spectral energy distribution of HD\\,61005. Photometric measurements are shown in red, along with the {\\it Spitzer}/IRS spectrum (uncertainties, shown in grey, are $3\\sigma$, most of them being smaller than the symbol). The dashed gray line is the photospheric model, the black and cyan lines are the best fit models (including the stellar contribution, but with and without the inner component, see text for details).}\n\\label{fig:SED}\n\\end{figure}\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the modeling of the SED.\\label{tab:res_SED}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$\\alpha_{\\mathrm{out}}$                      & $[-10, -0.5]$  & $0.04$ & $-1.92_{-0.04}^{+0.06}$ \\\\\n$p$                                          & $[-5.0, -2.0]$ & $0.02$ & $-3.84_{-0.05}^{+0.02}$ \\\\\n$s_{\\mathrm{min}}$ [$\\umu$m]                 & $[0.01, 10]$   & $0.1$  & $1.9_{-0.1}^{+0.1}$ \\\\\n$f_{\\mathrm{ice}}$                           & $[0, 0.95]$    & $0.1$  & $0.3_{-0.1}^{+0.1}$ \\\\\n$f_{\\mathrm{porosity}}$                      & $[0, 0.95]$    & $0.1$  & $0.3_{-0.1}^{+0.1}$ \\\\\nM$_{\\mathrm{dust}}$ [10$^{-1}$ M${_\\oplus}$] & -              & $0.1$  & $3.7_{-0.1}^{+0.4}$ \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\nTable\\,\\ref{tab:res_SED} summarizes the best fit results and the derived uncertainties and projected posterior probability distributions for each parameters are displayed in Figure\\,\\ref{fig:pdf_SED}. The SED of HD\\,61005, along with the photometric and spectroscopic observations (in red), the photospheric model (dashed gray), and the best-fit model (dotted-dashed and solid cyan lines without and with the stellar contribution, respectively) are shown in Figure\\,\\ref{fig:SED}. The shape of the mid- to far-IR excess is well reproduced by our model, but the turn-off point where the excess emission starts is not well matched (near $\\lambda \\sim 20$\\,$\\umu$m). This hints towards the presence of an additional component, an inner disk that has also been postulated by many authors in the literature (e.g., \\citealp{Morales2011,Ballering2013,Ricarte2013,Chen2014}). Even when using detailed dust properties (instead of Planck functions at single temperatures) to model the excess, the best fit model still underestimates the flux in the mid-IR beyond $3\\sigma$. To assess the necessity to include an inner belt, we fit a Planck function to the residuals (the only free parameter being the temperature, the scaling to the residuals being done similarly to Eqn.\\,\\ref{eqn:minimize}). We find the temperature of the Planck function to best reproduce the residuals to be $\\sim 220$\\,K. In Figure\\,\\ref{fig:SED}, the Planck function is shown as a dotted-dashed black line and the final best fit model (stellar contribution plus the inner and outer belts) as the solid black line. To assess the relevance of adding the inner disk we follow a similar approach as in \\citet[][and references therein]{Moor2015} and use the ``Akaike Information Criterion''. We find that the addition of the inner component significantly improves the final model, and therefore is deemed necessary to reproduce the whole SED of the disk around HD\\,61005.\n\nOur modeling results suggest that the outer slope of the dust density distribution is relatively shallow, which would indicate that most of the grains responsible for the emission are located in an extended disk. The minimum grain size is found to be $\\sim 1.9$\\,$\\umu$m, and the grain size distribution has a steep slope of $p \\sim -3.84$. The composition of the grains would be a mixture of amorphous silicate grains with small fraction of water ices and porosity. The total dust mass (between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$) is of the order of $0.37$\\,M$_{\\oplus}$.\n\n\n\n\n\n\n\\section{Discussion}\\label{sec:discussion}\n\nIn the following, we try to put together the results of the modeling of the ALMA, SPHERE datasets as well as of the SED. We discuss what can be inferred regarding the dust properties, the gas content, the morphology of the disk to better characterize what is happening in this system.\n\n\\subsection{Dust properties}\\label{discuss:dust}\n\n\\subsubsection{Self-subtraction corrected phase function}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{pfunc_ADI_H.pdf}\n\\caption{Phase function derived from the ADI $H$ band observations, corrected for self-subtraction effects (see text for details).}\n\\label{fig:pfunc_ADI}\n\\end{figure}\n\nWith a satisfying model for the scattered light, we can further investigate the phase function in the SPHERE ADI $H$ band observations. Indeed, the model enables us to estimate the self-subtraction introduced by the PCA analysis. To do so, we first perform the PCA on the raw data-cube and save the resulting coefficients. We then take the best fit model, produce a data-cube at the proper parallactic angles, project it into the new orthogonal basis found for the observations and multiply this projection with the same coefficients as for the raw observations (e.g., \\citealp{Soummer2012}). This provides us with an estimate of the signal from the disk that is subtracted when doing the PCA. The attenuation is estimated by the ratio $r_{\\mathrm{corr}}$ between this estimate and the original model. When deriving the phase function for the ADI dataset (similarly to Section\\,\\ref{sec:pfunc}), each pixel is multiplied by the quantity $1/(1 - r_{\\mathrm{corr}})$. Figure\\,\\ref{fig:pfunc_ADI} shows the phase function derived for the East and West sides (black and red, respectively). The ``bump'' at $\\sim 120^{\\circ}$ on the West side is an artifact introduced by $r_{\\mathrm{corr}}$ (low signal in the disk model leads to an erroneous correction factor). On Figure\\,\\ref{fig:pfunc_ADI}, we also show the phase function derived during the modeling (for $g = 0.55$), scaled to the phase function of the East for scattering angles larger than $40^{\\circ}$. The inferred HG function appears to be a relatively good representation of the corrected phase function for scattering angles larger than $\\sim 50^{\\circ}$, but severely fails to reproduce it at smaller angles. This would be an explanation to the strong residuals along the semi-minor axis in Fig.\\ref{fig:residuals_H}. Overall, this suggests quite extreme forward scattering in the disk around HD\\,61005 - a result that remains model-dependent since the PCA attenuation is estimated from our results (see also Milli et al., submitted for a similar discussion for the disk around HR\\,4796\\,A). Nonetheless, the strong peak of scattering for small angles (down to $\\sim 10^{\\circ}$) strongly points towards the presence of large dust grains in the debris disk. However, this seems in contradiction with the prior analysis of the DPI dataset where we had to actually reject the presence of large dust grains ($s \\sim 0.3$\\,$\\umu$m). For the SED, we need a whole range of sizes (from $\\umu$m- to mm-sized grains), but the emission is actually dominated by the smaller grains (discussed further in this Section). Numerous studies of debris disks around different stars (e.g., \\citealp{Rodigas2015}, \\citealp{Lebreton2012}, \\citealp{Milli2015}, Milli et al. submitted) already reported and discussed similar issues in reconciling the modeling results of different kind of observations. Throughout this paper, for their computational merits, we have either used the Mie theory or the HG prescription while both of them may not be accurate descriptions of the nature of the dust grains. \n\n\\subsubsection{Reconciling different observations}\n\n\nTo try to reconcile the different dust properties inferred from our modeling results, the radial extent of the disk is interesting to discuss. The ALMA observations point towards a narrow belt ($\\alpha_{\\mathrm{out}} \\leq -5$), while the SED, ADI, and DPI observations suggest that the disk is extended ($\\alpha_{\\mathrm{out}} \\sim -2$ or $-3$). To assess the typical grain sizes we probe with the SED, we computed the integrated infrared luminosity for each grain size bins between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, and built the cumulative distribution function. We find that more than $98$\\% of the disk infrared luminosity is accounted for by dust grains smaller than $5$\\,$\\umu$m. The rest of the (very steep) grain size distribution contribute marginally to the total emission. This means that for the DPI observations and the SED, we are observing an extended disk containing small dust grains. We computed the $\\beta$ ratio between the radiation pressure and gravitational forces as in \\citet{Burns1979}, assuming $L_* = 0.58$\\, $L_{\\odot}$ and $M_* = 1.1$\\,$M_{\\odot}$. For the dust composition found from the SED modeling, we find that grains larger than $s_{\\mathrm{blow}} \\sim 0.8$\\,$\\umu$m, for which $\\beta \\leq 0.5$,  should remain on bound orbits (assuming they were released on circular orbits). There is a small discrepancy between $s_{\\mathrm{blow}}$ and the minimum grain size we found ($s_{\\mathrm{min}} \\sim 2$\\,$\\umu$m), but as discussed in \\citet{Pawellek2014}, this could be caused by the assumption of spherical grains when modeling the SED. Assuming our inferred dust composition is not too far off compared to the real composition of the dust grains, it seems that radiation pressure should be efficient for (sub-)\\,$\\umu$m-sized grains. Consequently, the parent belt (inferred from the ALMA data) would be fairly narrow, but small grains placed on eccentric orbits (or even unbound) due to radiation pressure make the disk look more extended at near-IR wavelengths. \n\nThe strong forward scattering peak derived from the corrected phase function from the ADI observations suggests the presence of large grains in an extended disk, which seems in contradiction with the aforementioned scenario. Nonetheless, according to \\citet{Min2016}, large dust aggregates behave like large grains (the size of the whole aggregate) in scattered light and like small grains (the size of the individual monomers) for polarized light. Such aggregates also display mild backward scattering that we do not detect with our observations but may be the consequence of low S/N along the back side of the disk.\n\nTherefore, we hypothesize that the parent planetesimals are arranged in a narrow belt (traced by ALMA) and that the small-size end of the grain size distribution consists of dust aggregates that are blown away by radiation pressure. This makes the disk appear extended in the SPHERE observations and when modeling the SED. For future studies of this system, it would be interesting to implement a radial segregation of the grain size distribution (varying d$n(s)$ as a function of $r$, see for instance \\citealp{Stark2014} for a discussion of the phase function depending on the radial distance). \n\n\\subsection{Gas mass upper limits}\\label{sec:CO}\n\nNo CO emission was detected in the ALMA data, and we follow a similar procedure as the one of \\citet{Matra2015} and \\citet{Moor2015b} to derive upper limits for the CO gas mass. We extract the spectrum from the datacube reduced within CASA, centered around $230.5$\\,GHz ($^{12}$CO 2-1). The upper limit for the CO mass was determined as\n\n", "itemtype": "equation", "pos": 55026, "prevtext": "\nWe perform a simple grid search over the following parameters: $s_{\\mathrm{min}}$, $s_{\\mathrm{max}}$, and the optical properties of the dust grains. We fix $p = -3.5$, as expected for a collisional cascade in a debris disk (\\citealp{Dohnanyi1969}). For the dust composition, we consider a base medium of amorphous silicate with olivine stoichiometry (MgFeSiO$_4$, \\citealp{Dorschner1995}) to which we can add some porosity using the Bruggeman mixing rule. The minimum grain size can vary between $0.01$ and $10$\\,$\\umu$m. To constrain the maximum grain size, we vary the quantity  $\\Delta s$ ($= s_{\\mathrm{max}} - s_{\\mathrm{min}}$) between $0.01$ and $100$\\,$\\umu$m (in log space), and finally the porosity can change by steps of $10$\\%. We find that the polarized phase function at $1.63$\\,$\\umu$m is best reproduced by small spherical dust grains,\nwith typical sizes in the range $s = 0.3 \\pm 0.03$\\,$\\umu$m and a porosity fraction of $\\sim 80$\\%. The best fit solution is shown in cyan line in Figure\\,\\ref{fig:pfunc_dpi}, and reproduces well both the overall shape and the peak position of the observed phase function. In this Section, we assumed that the polarized flux is directly proportional to $S_{12}$, while it is also related to the dust density in the disk. In the rest of the paper, we will try to determine the azimuthal distribution of the dust in the disk. Therefore, this prior analysis must be regarded as a first order approximation. Overall, the motivation of this prior analysis was to reduce the dimensionality of the modeling, but it also comes at a slight cost in the interpretation of the grain size distribution. The main conclusion of this Section is that it does not seem we observe large dust grains (which would have a stronger $S_{12}$ signal at small scattering angles). In Section\\,\\ref{discuss:dust} we will further discuss this result, but it could also be the consequence of low S/N along the semi-minor axis of the disk.\n\n\\subsection{Modeling strategy}\n\nSince both the ADI and DPI datasets were taken at the same wavelength, for a given set of parameters we compute two images: an unpolarized light image using the Henyey-Greenstein (HG) analytical prescription of phase function $S_{11}$ (\\citealp{Henyey1941}) and a polarized light image using the Mie theory. Using the HG approximation, parametrized by the anisotropic scattering factor $g$ ($-1 \\leq g \\leq 1$), gives us more control to try to reproduce the observed phase function (hence less free parameters to be considered during the modeling). To reproduce the DPI observations, we use the grain properties derived previously. The absorption and scattering efficiencies as well as the M\\\"uller matrix element $S_{12}$ are computed with the Mie theory, valid for compact spherical grains. This approach may not appear self-consistent but is a way to disentangle the modeling of unpolarized and polarized light that may not be well accounted for by spherical grains (e.g., \\citealp{Milli2015}).\n\nThe pool of free parameters includes the semi latus rectum $r_0$, the inclination $i$, the position angle $\\phi$, the opening angle $\\psi$, and the outer power-law slope $\\alpha_{\\mathrm{out}}$ for the dust density distribution. Preliminary tests indicated that we can hardly constrain the inner power-law slope, so we fixed $\\alpha_{\\mathrm{in}} = 5$. This enables us to focus on other parameters that describe the geometry of the debris disk. For instance, \\citet{Buenzli2010} concluded that the eccentricity of the disk was not enough to explain the brightness asymmetry between the East and the West sides, and we aim at addressing these observational facts here. Therefore, we include the eccentricity $e$, the rotation angle $\\Phi_{\\mathrm{e}}$, the density damping $\\eta$ and its azimuthal shape (via the width $w$ of the Gaussian profile) and its reference angle $\\Phi_{\\mathrm{\\eta}}$ (see App.\\,\\ref{app:DDIT}). The azimuthal profile has the shape of a Gaussian profile with a $\\sigma = w$, a peak of $1$ for the azimuthal angle $\\Phi_{\\eta}$ and a minimum value of $\\eta \\geq 0$ (hence an amplitude of $1-\\eta$). The dust mass $M_{\\mathrm{dust}}$ is not varied, but the synthetic images are scaled during the fitting process. For the polarized images, the modeled image is the absolute value of the Stokes $Q_{\\phi}$ parameter (we are assuming that there are no multiple scattering events in the debris disk). We scale the modeled image by a factor $f_{\\mathrm{DPI}}$ that is found analytically to minimize the residuals (similarly to Eqn.\\ref{eqn:minimize}). For the ADI dataset such approach is not possible, because the post-processing of the data-cube can introduce self-subtraction effects. We therefore opted for a forward modeling strategy, similar to the one described in \\citet{Thalmann2014}. For a given set of parameters, we compute one synthetic image at the wavelength $1.63$\\,$\\umu$m. We then produce a cube of 64 images, each one rotated to match the parallactic angles of each frames of the observations (total rotation of $93.3^{\\circ}$). Each frame of the cube of synthetic images is multiplied by $f_{\\mathrm{ADI}}$ and is then subtracted to the corresponding observed frame. The PCA process is performed, keeping only the 6 main components. The end goal being to minimize the flux in the final image.\n\nThe goodness of the fit is the sum of the squared ratio between the final images (residuals for the scattered and polarized data) and the noise map (bottom row of Fig.\\,\\ref{fig:all_data}). For the modeling of both the ADI and DPI observations, we therefore have a total of 12 free parameters: $r_0$, $i$, $\\alpha_{\\mathrm{out}}$, $e$, $\\Phi_{\\mathrm{e}}$, $\\phi$, $\\eta$, $\\Phi_{\\mathrm{\\eta}}$, $w$, $\\psi$, $g$, and $f_{\\mathrm{ADI}}$. Here, we also use the \\texttt{emcee} Python package, with 100 ``walkers'' in the chain, and first burn in 500 runs for each of these walkers. We then run the chain for 2000 iterations in total (see \\citealp{MillarBlanchaer2015} for a similar modeling approach). To speed up the process, we cropped and re-sampled the SPHERE images. The size of one pixel in the new image (or cube) is re-sampled to be $2.25$ times bigger than in the original images, and the size of the new image is $200 \\times 200$ pixels, and we use a central mask of radius $0.15^{\\prime\\prime}$. We chose not to convolve the synthetic images by a PSF because the cropped and down-sampled images having a pixel size of $0.028^{\\prime\\prime}$, while the approximation of the instrumental PSF with a Gaussian profile would have a width of $0.024^{\\prime\\prime}$ (approximating the PSF as an Airy disk for an 8\\,m telescope). At the end of the run, we find that the mean acceptance fraction (the mean fraction of steps accepted for each walker within the chain) is of $0.35$, with a maximum auto-correlation time of 79 steps.\n\n\\subsection{Results}\n\n\\begin{figure*}[!htbp]\n\\includegraphics[width=2\\columnwidth]{combined.pdf}\n\\caption{\\textit{Left to right}: observed, residuals, and best fit models for the ADI and DPI datasets (top and bottom, respectively).}\n\\label{fig:residuals_H}\n\\end{figure*}\n\n\n\n\n\n\n\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the ADI and DPI $H$ band observations.\\label{tab:res_H}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$r_0$ [AU]                       & $[40, 80]$     & $0.1$   & $60.4_{-0.5}^{+0.8}$ \\\\\n$i$ [$^{\\circ}$]                 & $[75, 88]$     & $0.1$   & $84.1_{-0.2}^{+0.2}$ \\\\\n$\\alpha_{\\mathrm{out}}$          & $[-10, -1.75]$ & $0.01$  & $-2.70_{-0.1}^{+0.1}$ \\\\\n$e$                              & $[0, 0.6]$     & $0.0025$& $0.093_{-0.014}^{+0.018}$ \\\\\n$\\Phi_{\\mathrm{e}}$ [$^{\\circ}$]    & $[0, 360]$     & $1.$    & $127.3_{-4.3}^{+12.7}$ \\\\\n$\\phi$ [$^{\\circ}$]              & $[65, 75]$     & $0.1$   & $70.6_{-0.3}^{+0.2}$ \\\\\n$\\eta$                           & $[0, 1]$       & $0.0025$& $0.47_{-0.04}^{+0.02}$ \\\\\n$\\Phi_{\\mathrm{\\eta}}$ [$^{\\circ}$] & $[0, 360]$     & $1.0$   & $138.1_{-5.6}^{+7.2}$ \\\\\n$w$ [$^{\\circ}$]                 & $[5, 180]$     & $1.0$   & $51.7_{-3.2}^{+8.8}$ \\\\\n$\\psi$                           & $[0.02, 0.12]$ & $0.005$ & $0.058_{-0.002}^{+0.001}$ \\\\\n$g$                              & $[0, 0.95]$    & $0.001$ & $0.54_{-0.02}^{+0.01}$ \\\\\n$f_{\\mathrm{ADI}}$               & $[3, 8.5]$     & $0.01$  & $6.20_{-0.07}^{+0.09}$ \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\nThe projected posterior probability distributions are displayed in Figure\\,\\ref{fig:pdf_H}, for the different free parameters. To derive the best-fit values as well as the uncertainties, we proceed similarly as in Section\\,\\ref{sec:res_alma}. The results are presented in Table\\,\\ref{tab:res_H} and Figure\\,\\ref{fig:residuals_H} shows the observations, the residuals and the best-fit models (from left to right) for the ADI and the DPI data (top and bottom rows, respectively).\n\nAll parameters seem to be well constrained. The most probable solution has a semi-major axis of 60.9\\,AU ($r_0 / [1 - e^2]$) for an eccentricity of $0.093$. With a rotation angle of $\\Phi_{\\mathrm{e}} \\sim 127^{\\circ}$ the pericenter is located slightly toward the observer, on the East side\\footnote{For $\\Phi_{\\mathrm{e}} = 180^{\\circ}$, the pericenter would be along the semi-major axis on the East side. Smaller angles would move the pericenter towards the observer, while larger angles would move the pericenter towards the back side of the disk.}. An azimuthal density variation seems to be necessary to reproduce the observations, with a damping factor $\\eta$ of $\\sim 0.47$ with a reference angle of $\\sim 138^{\\circ}$ (hence almost co-located with the pericenter of the eccentric disk). The azimuthal variation of the dust density distribution is a Gaussian profile with a width of $\\sim 50^{\\circ}$. The position angle and inclination are consistent with the results from \\citet{Buenzli2010}. The aspect ratio of $h/r \\sim 0.06$ agrees well with numerical simulations of the vertical structures of debris disks (e.g., \\citealp{Thebault2009}). Finally, the phase function is anisotropic for low scattering angles with $g \\sim 0.54$. The dust density distribution for the best fit model, viewed from above the disk, is displayed in Figure\\,\\ref{fig:best_sketch}.\n\nNonetheless, as shown in the residuals of the ADI observations, our best fit model does not manage to remove all the signal along the semi-minor axis of the disk. It successfully suppresses most of the signal at larger scattering angles, but the best fit model seems to fail at properly describing the scattering at smaller angles. We tried to implement a phase function with two weighted HG functions, but could not significantly improve the residuals. We included all the ``basic'' parameters related to the geometry of the disk ($i$, $\\phi$, $r_0$, $\\psi$) and yet failed to perfectly match the observations. Possible explanations can be related to the phase function (the HG phase function remains an approximation), the radial segregation of the grain size distribution, or the azimuthal dust density distribution (this will be further discussed in Section\\,\\ref{discuss:dust}). We crudely assumed a Gaussian profile for the azimuthal distribution, but the actual distribution could be skewed in one or another direction which could explain the brighter region along the semi-minor axis. Another (highly speculative yet interesting) explanation would be that we would be seeing an inner disk. Because of the high inclination of the disk, an inner dust belt could appear to the observer as if it was merging with the main belt. The main challenge to this explanation is that we see no indication of such a belt in the DPI observations, but the noise is larger in the innermost regions of this dataset. One possible way to address this point would be to detect gas tracing velocities compatible with a radius smaller than $61$\\,AU. Yet no CO was detected in the ALMA observations (Section\\,\\ref{sec:CO}).\n\n\n\n\n\\section{Constraining the dust mineralogy from the SED}\\label{sec:sed}\n\nThe SED of the debris disk around HD\\,61005 is constructed from the fluxes reported in Table\\,\\ref{tab:flux} and the {\\it Spitzer}/IRS spectrum. Modeling an SED from unresolved observations is a degenerate problem. We are basically trying to find the adequate temperature of the grains, which can be changed either by their radial distances, their sizes, or their nature. The modeling of the SPHERE images provide strong constraints on the geometric parameters of the disk, and we can therefore focus on better constraining the dust properties.\n\n\\subsection{Modeling the thermal emission from the disk}\n\nTo model the SED of HD\\,61005, for a given set of parameters, the goodness of fit is computed as\n\n", "index": 13, "text": "\\begin{equation}\\label{eqn:chi2}\n\\chi^2 = \\sum_i \\omega_i \\times \\left[ \\frac{F_{\\mathrm{obs}} (\\lambda_i) - F_{\\star} (\\lambda_i) - F_{\\mathrm{model}} (\\lambda_i)}{\\sigma_i} \\right] ^2,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}=\\sum_{i}\\omega_{i}\\times\\left[\\frac{F_{\\mathrm{obs}}(\\lambda_{i})-F_{%&#10;\\star}(\\lambda_{i})-F_{\\mathrm{model}}(\\lambda_{i})}{\\sigma_{i}}\\right]^{2},\" display=\"block\"><mrow><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>ω</mi><mi>i</mi></msub><mo>×</mo><msup><mrow><mo>[</mo><mfrac><mrow><mrow><msub><mi>F</mi><mi>obs</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>λ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>F</mi><mo>⋆</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>λ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>F</mi><mi>model</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>λ</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><msub><mi>σ</mi><mi>i</mi></msub></mfrac><mo>]</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $m$ is the mass of the CO molecule, $d_{\\star}$ the distance of the star, $\\nu_{2-1}$ the frequency of the transition, $A_{2-1}$ the Einstein coefficient\\footnote{Taken from the SPLATALOGUE catalog at \\url{http://www.cv.nrao.edu/php/splat/}}, $x_{2-1}$ the fractional population of the upper level, and $S_{2-1}$ the observed integrated line flux. The fractional level was calculated assuming local thermal equilibrium, using the Boltzmann equation, with a temperature of $20$\\,K (as discussed in \\citealp{Moor2015b}, $M_{\\mathrm{CO}}$ is not strongly dependent on the temperature). $S_{2-1}$ was computed from the spectrum as $S_{\\mathrm{rms}}\\Delta v \\sqrt N$, where $\\Delta v$ is the channel velocity width, $N$ the number of channels over a width of $15$\\,km.s$^{-1}$ (centered at the Local Standard of Rest velocity, $v_{\\mathrm{LSR}}$), and $S_{\\mathrm{rms}}$ the standard deviation of the spectrum within that velocity range. From the heliocentric radial velocity of $22.5$\\,km.s$^{-1}$ (\\citealp{Desidera2011}), we obtain a $v_{\\mathrm{LSR}}$ of $3.68$\\,km.s$^{-1}$. Assuming optically thin gas, this leads to an upper limit of $6.9\\times 10^{-7}$\\,M$_{\\oplus}$. As discussed in \\citet{Matra2015}, the LTE hypothesis may not hold in low-density environment and our upper limit could underestimate the CO gas mass. In the ISM the CO/H$_2$ abundance is $10^{-4}$, and with our inferred dust mass of $\\sim 0.37$\\,M$_{\\oplus}$ (for our grain size distribution), this would lead to a gas to dust ratio much smaller than unity. However, it is unlikely that this ratio will remain the same in a circumstellar disk because of effects such as photo-dissociation. Overall, with the available observations leading to a non-detection, and given the several assumptions made (LTE, CO/H$_2$ ratio) we can hardly conclude on the gas to dust ratio on the debris disk. This question should be addressed by future, deeper CO observations (or other species than the CO molecule).\n\n\\subsection{Stirring of the planetesimals}\\label{sec:stirring}\n\nIn the past years, theoretical works have aimed at characterizing the time evolution of debris disks (e.g., \\citealp{Kenyon2006,Kenyon2008}). One of the purpose of these studies being to better understand the growth of planetesimals to sizes of about a thousand km, in the framework of terrestrial planetary formation. It is believed that once such large bodies have been formed, they will stir the population of smaller planetesimals. The stirring will increase the relative velocities of these planetesimals and increase their chances of collisions, therefore initiating a collisional cascade. According to these models, collisions between planetesimals become destructive only once a Pluto-sized object is formed. Since the timescale for the growth of planetesimals scales with the distance $r$ to the star, self-stirring is thought to be an inside-out process. Here, we follow a similar approach as the one described in \\citet{Moor2015} who studied several debris disks spatially resolved with the {\\it Herschel} observatory. They examined if the disks in their sample are consistent with a self-stirring scenario. To achieve this, they compared the timescale for forming a 1000\\,km-sized object in a self-stirred debris disk with the age of the stars. To quantify this timescale $t_{\\mathrm{1000}}$ (in Myr), we used Eqn.\\,41 from \\citet{Kenyon2008}, which we recall below,\n\n", "itemtype": "equation", "pos": 70366, "prevtext": "\nwhere $F_{\\mathrm{obs}}$ is the observed flux with its associated uncertainty $\\sigma_i$, $F_{\\star}$ the stellar contribution, and $F_{\\mathrm{model}}$ the modeled thermal emission of the debris disk. The $\\omega_i$ values are weights to the observed data points at wavelength $i$. This weighting is designed to account for the fact that we simultaneously model broadband photometric observations (e.g., {\\it Herschel}/PACS) and spectroscopic observations ({\\it Spitzer}/IRS): two adjacent points in the IRS spectrum do not have the same significance than PACS 70 and 100\\,$\\umu$m observations. We therefore opt for a similar strategy as the one described in \\citet{Ballering2013}. We compute the average spectral resolution of the IRS data and compare it to the equivalent widths of the broadband filters. One IRS point will have a weight $\\omega = 1$ and broadband photometric point will have a weight equal to the number of IRS points that would fit in the corresponding equivalent width of the filter. In Table\\,\\ref{tab:flux}, we report the equivalent widths for the various instruments used to model the thermal emission in the far-IR. These values were taken from the ``Spanish Virtual Observatory'' filter profile service\\footnote{http://svo2.cab.inta-csic.es/theory/fps3/}. For the ALMA Band\\,6 observations, we assumed the equivalent width to be equal to the spectral range ($105$\\,$\\umu$m).\n\nTo account for different mineralogical components, we use amorphous silicate grains of olivine stoichiometry \\citep[MgFeSiO$_4$, ][$\\rho = 3.5$\\,g.cm$^{-3}$]{Dorschner1995} and amorphous water ices \\citep[][$\\rho = 1.2$\\,g.cm$^{-3}$]{Li1998}. To mimic porosity, we also add the fraction of vacuum to the pool of free parameters. We mix the optical constants of the different dust components, using the Bruggeman mixing theory, and the Mie theory to compute the absorption coefficients $Q_{\\mathrm{abs}}$. Since computing $Q_{\\mathrm{abs}}$ for large grain sizes can be the bottle-neck when computing thousands of models, we first created a ``library'' of opacity files ($s_{\\mathrm{min}} = 0.01\\,\\umu$m and $s_{\\mathrm{max}} = 5$\\,mm, with steps of 10\\% for the water ices, and porosity fractions). During the modeling process, the appropriate $Q_{\\mathrm{abs}}$ are drawn and interpolated for the proper grain size distribution and composition.\n\nThe free parameters include the grain size distribution ($s_{\\mathrm{min}}$ and $p$, we fix $s_{\\mathrm{max}} = 5$\\,mm), the relative fractions for the fractions of amorphous water ices and porosity, and the inner and outer slopes for the dust density ($\\alpha_{\\mathrm{in}}$ and $\\alpha_{\\mathrm{out}}$, respectively). We fix the reference radius $r_0$ to the best fit results of the modeling of the SPHERE observations. For each set of parameters the dust mass M$_{\\mathrm{dust}}$ is found by scaling the thermal emission of the model to the observed SED (similarly to Eqn.\\,\\ref{eqn:minimize}). The values for the dust mass are saved for posterior estimation of their corresponding uncertainties. To speed up the modeling of the SED, we neglect the non azimuthal dust density distribution derived from the analysis of the SPHERE data and assume the disk to be a circular ring. We use the \\texttt{emcee} package to search for the most probable model, using 100 walkers, first burning the first 500 runs for each walkers, and then running the chain for 1000 more iterations. The acceptance fraction at the end of the run is of $0.28$ (and a maximum auto-correlation time across all parameters of 72 steps).\n\n\\subsection{Results}\n\n\\begin{figure*}[tbh]\n\\includegraphics[width=2\\columnwidth]{hist_SED.pdf}\n\\caption{Posterior probability distributions for the modeling of the SED. The solid lines mark the most probable value, and the vertical dashed lines mark the derived uncertainties.}\n\\label{fig:pdf_SED}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{HD61005_SED.pdf}\n\\caption{Spectral energy distribution of HD\\,61005. Photometric measurements are shown in red, along with the {\\it Spitzer}/IRS spectrum (uncertainties, shown in grey, are $3\\sigma$, most of them being smaller than the symbol). The dashed gray line is the photospheric model, the black and cyan lines are the best fit models (including the stellar contribution, but with and without the inner component, see text for details).}\n\\label{fig:SED}\n\\end{figure}\n\n\\begin{table}\n\\centering\n\\caption{Best fit results for the modeling of the SED.\\label{tab:res_SED}}\n\\begin{tabular}{@{}lccc@{}}\n\\hline\\hline\nParameter & Uniform prior & $\\sigma_{\\mathrm{kde}}$ & Best-fit value \\\\\n\\hline\n$\\alpha_{\\mathrm{out}}$                      & $[-10, -0.5]$  & $0.04$ & $-1.92_{-0.04}^{+0.06}$ \\\\\n$p$                                          & $[-5.0, -2.0]$ & $0.02$ & $-3.84_{-0.05}^{+0.02}$ \\\\\n$s_{\\mathrm{min}}$ [$\\umu$m]                 & $[0.01, 10]$   & $0.1$  & $1.9_{-0.1}^{+0.1}$ \\\\\n$f_{\\mathrm{ice}}$                           & $[0, 0.95]$    & $0.1$  & $0.3_{-0.1}^{+0.1}$ \\\\\n$f_{\\mathrm{porosity}}$                      & $[0, 0.95]$    & $0.1$  & $0.3_{-0.1}^{+0.1}$ \\\\\nM$_{\\mathrm{dust}}$ [10$^{-1}$ M${_\\oplus}$] & -              & $0.1$  & $3.7_{-0.1}^{+0.4}$ \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\nTable\\,\\ref{tab:res_SED} summarizes the best fit results and the derived uncertainties and projected posterior probability distributions for each parameters are displayed in Figure\\,\\ref{fig:pdf_SED}. The SED of HD\\,61005, along with the photometric and spectroscopic observations (in red), the photospheric model (dashed gray), and the best-fit model (dotted-dashed and solid cyan lines without and with the stellar contribution, respectively) are shown in Figure\\,\\ref{fig:SED}. The shape of the mid- to far-IR excess is well reproduced by our model, but the turn-off point where the excess emission starts is not well matched (near $\\lambda \\sim 20$\\,$\\umu$m). This hints towards the presence of an additional component, an inner disk that has also been postulated by many authors in the literature (e.g., \\citealp{Morales2011,Ballering2013,Ricarte2013,Chen2014}). Even when using detailed dust properties (instead of Planck functions at single temperatures) to model the excess, the best fit model still underestimates the flux in the mid-IR beyond $3\\sigma$. To assess the necessity to include an inner belt, we fit a Planck function to the residuals (the only free parameter being the temperature, the scaling to the residuals being done similarly to Eqn.\\,\\ref{eqn:minimize}). We find the temperature of the Planck function to best reproduce the residuals to be $\\sim 220$\\,K. In Figure\\,\\ref{fig:SED}, the Planck function is shown as a dotted-dashed black line and the final best fit model (stellar contribution plus the inner and outer belts) as the solid black line. To assess the relevance of adding the inner disk we follow a similar approach as in \\citet[][and references therein]{Moor2015} and use the ``Akaike Information Criterion''. We find that the addition of the inner component significantly improves the final model, and therefore is deemed necessary to reproduce the whole SED of the disk around HD\\,61005.\n\nOur modeling results suggest that the outer slope of the dust density distribution is relatively shallow, which would indicate that most of the grains responsible for the emission are located in an extended disk. The minimum grain size is found to be $\\sim 1.9$\\,$\\umu$m, and the grain size distribution has a steep slope of $p \\sim -3.84$. The composition of the grains would be a mixture of amorphous silicate grains with small fraction of water ices and porosity. The total dust mass (between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$) is of the order of $0.37$\\,M$_{\\oplus}$.\n\n\n\n\n\n\n\\section{Discussion}\\label{sec:discussion}\n\nIn the following, we try to put together the results of the modeling of the ALMA, SPHERE datasets as well as of the SED. We discuss what can be inferred regarding the dust properties, the gas content, the morphology of the disk to better characterize what is happening in this system.\n\n\\subsection{Dust properties}\\label{discuss:dust}\n\n\\subsubsection{Self-subtraction corrected phase function}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{pfunc_ADI_H.pdf}\n\\caption{Phase function derived from the ADI $H$ band observations, corrected for self-subtraction effects (see text for details).}\n\\label{fig:pfunc_ADI}\n\\end{figure}\n\nWith a satisfying model for the scattered light, we can further investigate the phase function in the SPHERE ADI $H$ band observations. Indeed, the model enables us to estimate the self-subtraction introduced by the PCA analysis. To do so, we first perform the PCA on the raw data-cube and save the resulting coefficients. We then take the best fit model, produce a data-cube at the proper parallactic angles, project it into the new orthogonal basis found for the observations and multiply this projection with the same coefficients as for the raw observations (e.g., \\citealp{Soummer2012}). This provides us with an estimate of the signal from the disk that is subtracted when doing the PCA. The attenuation is estimated by the ratio $r_{\\mathrm{corr}}$ between this estimate and the original model. When deriving the phase function for the ADI dataset (similarly to Section\\,\\ref{sec:pfunc}), each pixel is multiplied by the quantity $1/(1 - r_{\\mathrm{corr}})$. Figure\\,\\ref{fig:pfunc_ADI} shows the phase function derived for the East and West sides (black and red, respectively). The ``bump'' at $\\sim 120^{\\circ}$ on the West side is an artifact introduced by $r_{\\mathrm{corr}}$ (low signal in the disk model leads to an erroneous correction factor). On Figure\\,\\ref{fig:pfunc_ADI}, we also show the phase function derived during the modeling (for $g = 0.55$), scaled to the phase function of the East for scattering angles larger than $40^{\\circ}$. The inferred HG function appears to be a relatively good representation of the corrected phase function for scattering angles larger than $\\sim 50^{\\circ}$, but severely fails to reproduce it at smaller angles. This would be an explanation to the strong residuals along the semi-minor axis in Fig.\\ref{fig:residuals_H}. Overall, this suggests quite extreme forward scattering in the disk around HD\\,61005 - a result that remains model-dependent since the PCA attenuation is estimated from our results (see also Milli et al., submitted for a similar discussion for the disk around HR\\,4796\\,A). Nonetheless, the strong peak of scattering for small angles (down to $\\sim 10^{\\circ}$) strongly points towards the presence of large dust grains in the debris disk. However, this seems in contradiction with the prior analysis of the DPI dataset where we had to actually reject the presence of large dust grains ($s \\sim 0.3$\\,$\\umu$m). For the SED, we need a whole range of sizes (from $\\umu$m- to mm-sized grains), but the emission is actually dominated by the smaller grains (discussed further in this Section). Numerous studies of debris disks around different stars (e.g., \\citealp{Rodigas2015}, \\citealp{Lebreton2012}, \\citealp{Milli2015}, Milli et al. submitted) already reported and discussed similar issues in reconciling the modeling results of different kind of observations. Throughout this paper, for their computational merits, we have either used the Mie theory or the HG prescription while both of them may not be accurate descriptions of the nature of the dust grains. \n\n\\subsubsection{Reconciling different observations}\n\n\nTo try to reconcile the different dust properties inferred from our modeling results, the radial extent of the disk is interesting to discuss. The ALMA observations point towards a narrow belt ($\\alpha_{\\mathrm{out}} \\leq -5$), while the SED, ADI, and DPI observations suggest that the disk is extended ($\\alpha_{\\mathrm{out}} \\sim -2$ or $-3$). To assess the typical grain sizes we probe with the SED, we computed the integrated infrared luminosity for each grain size bins between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, and built the cumulative distribution function. We find that more than $98$\\% of the disk infrared luminosity is accounted for by dust grains smaller than $5$\\,$\\umu$m. The rest of the (very steep) grain size distribution contribute marginally to the total emission. This means that for the DPI observations and the SED, we are observing an extended disk containing small dust grains. We computed the $\\beta$ ratio between the radiation pressure and gravitational forces as in \\citet{Burns1979}, assuming $L_* = 0.58$\\, $L_{\\odot}$ and $M_* = 1.1$\\,$M_{\\odot}$. For the dust composition found from the SED modeling, we find that grains larger than $s_{\\mathrm{blow}} \\sim 0.8$\\,$\\umu$m, for which $\\beta \\leq 0.5$,  should remain on bound orbits (assuming they were released on circular orbits). There is a small discrepancy between $s_{\\mathrm{blow}}$ and the minimum grain size we found ($s_{\\mathrm{min}} \\sim 2$\\,$\\umu$m), but as discussed in \\citet{Pawellek2014}, this could be caused by the assumption of spherical grains when modeling the SED. Assuming our inferred dust composition is not too far off compared to the real composition of the dust grains, it seems that radiation pressure should be efficient for (sub-)\\,$\\umu$m-sized grains. Consequently, the parent belt (inferred from the ALMA data) would be fairly narrow, but small grains placed on eccentric orbits (or even unbound) due to radiation pressure make the disk look more extended at near-IR wavelengths. \n\nThe strong forward scattering peak derived from the corrected phase function from the ADI observations suggests the presence of large grains in an extended disk, which seems in contradiction with the aforementioned scenario. Nonetheless, according to \\citet{Min2016}, large dust aggregates behave like large grains (the size of the whole aggregate) in scattered light and like small grains (the size of the individual monomers) for polarized light. Such aggregates also display mild backward scattering that we do not detect with our observations but may be the consequence of low S/N along the back side of the disk.\n\nTherefore, we hypothesize that the parent planetesimals are arranged in a narrow belt (traced by ALMA) and that the small-size end of the grain size distribution consists of dust aggregates that are blown away by radiation pressure. This makes the disk appear extended in the SPHERE observations and when modeling the SED. For future studies of this system, it would be interesting to implement a radial segregation of the grain size distribution (varying d$n(s)$ as a function of $r$, see for instance \\citealp{Stark2014} for a discussion of the phase function depending on the radial distance). \n\n\\subsection{Gas mass upper limits}\\label{sec:CO}\n\nNo CO emission was detected in the ALMA data, and we follow a similar procedure as the one of \\citet{Matra2015} and \\citet{Moor2015b} to derive upper limits for the CO gas mass. We extract the spectrum from the datacube reduced within CASA, centered around $230.5$\\,GHz ($^{12}$CO 2-1). The upper limit for the CO mass was determined as\n\n", "index": 15, "text": "\\begin{equation}\nM_{\\mathrm{CO}} = \\frac{4 \\pi m d_{\\star}^2}{h \\nu_{2-1} A_{2-1}}\\frac{S_{2-1}}{x_{2-1}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"M_{\\mathrm{CO}}=\\frac{4\\pi md_{\\star}^{2}}{h\\nu_{2-1}A_{2-1}}\\frac{S_{2-1}}{x_%&#10;{2-1}},\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mi>CO</mi></msub><mo>=</mo><mrow><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><msubsup><mi>d</mi><mo>⋆</mo><mn>2</mn></msubsup></mrow><mrow><mi>h</mi><mo>⁢</mo><msub><mi>ν</mi><mrow><mn>2</mn><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msub><mi>A</mi><mrow><mn>2</mn><mo>-</mo><mn>1</mn></mrow></msub></mrow></mfrac><mo>⁢</mo><mfrac><msub><mi>S</mi><mrow><mn>2</mn><mo>-</mo><mn>1</mn></mrow></msub><msub><mi>x</mi><mrow><mn>2</mn><mo>-</mo><mn>1</mn></mrow></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $r$ is the distance of the dust belt, and $x_{\\mathrm{m}}$ is a scaling factor to parametrize the disk's initial surface density (the higher, the more massive). \\citet{Mustill2009} argued that $x_{\\mathrm{m}}$ values larger than 10 are highly unlikely as the initial disk would have been gravitationally unstable. Assuming that the timescale for the growth of the planetesimals is the age of the system (i.e., $t_{\\mathrm{1000}} = 40$\\,Myr), we find that $x_{\\mathrm{m}}$ should be of the order of about 3.3 (for $r = 61$\\,AU). This value would suggest that either the primordial disk was $\\sim$\\,3 times more massive than the minimum-mass solar nebula, or that other sources of stirring (e.g., induced by a planet) have to be taken into consideration for this system. Debris disks with known planets, such as the ones studied in \\citet[][e.g., HR\\,8799, $\\beta$\\,Pictoris, HD\\,95086]{Moor2015}, have much larger $x_{\\mathrm{m}}$ values ($\\geq 10$), while most of the debris disks usually have values for $x_{\\mathrm{m}}$ smaller than $3$. It is therefore reasonable to assume that the disk around HD\\,61005 is bright because self-stirring by planetesimals has recently started. Based on the distance of the dust belt and the age of the system, it is not necessary to invoke the presence of a massive planet to explain what is currently observed.\n\n\\subsection{An eccentric and asymmetric disk}\n\nMassive planets are often invoked to explain the eccentricity of a debris disk, as the planet may shepherd it. The case of Fomalhaut is a good example of such studies. The disk shows an eccentricity comparable to the one of HD\\,61005 ($e \\sim 0.11\\pm0.1$, \\citealp{Kalas2005}) and a candidate companion was detected by \\citet{Kalas2008}. Studies such as the one of \\citet{Beust2014} investigated in details the possible interactions between the planet and the planetesimal in the disk. In the past two decades, many numerical works have been led to investigate how planets can shape debris disks (e.g., \\citealp{Wyatt1999,Wyatt2006,Nesvold2013,Pearce2014,Faramaz2014}), or how the planetesimals evolve within their mutual gravitational interactions (e.g., \\citealp{Kral2015,Jackson2014}).\n\n\\subsubsection{Possible planet-disk interactions ?}\n\nVia secular interactions, an eccentric planet can shape the debris disk. Because of differential precession, the planet-disk interactions can result in a (short-lived) spiral arm (\\citealp{Wyatt1999}). Then, when taking into account the effect of collisions in the disk, the spiral will quickly dissipate (\\citealp{Nesvold2013}), and the disk will become eccentric (and apse-aligned with the planet's orbit). Because of the eccentricity, the disk is expected to be brighter at the pericenter (the so-called pericenter glow effect). Nonetheless, this may not be what is happening in the disk around HD\\,61005. First, we did not detect any point sources neither in the $H$ nor $K$ band ADI datasets, even with their large parallactic rotations. The exact detection limits on the masses of possible planets will be published in the survey paper of the SPHERE consortium, but preliminary tests using the \\texttt{PynPoint} package (\\citealp{Amara2012}) shows that we should have been able to detect planets with a contrast of about $\\sim$\\,10\\,mag in the near-IR. At an age of about 40\\,Myr, we can therefore rule out any planets with a mass larger than $\\sim$\\,7 Jupiter mass at a distance of $0.2^{\\prime\\prime}$. Second, as already discussed in \\citet[][and confirmed in this study]{Buenzli2010}, the eccentricity of the disk is not sufficient for the pericenter glow to solely explain the observed brightness asymmetry. Our modeling results suggest that there is a $\\sim$\\,50\\% reduction in density between the pericenter and the apocenter, with a peak density closer to the observer ($\\Phi_{\\mathrm{e}} \\sim \\Phi_{\\eta} \\sim 130^{\\circ}$). Given that both $\\Phi_{\\mathrm{e}}$ and $\\Phi_{\\eta}$ are free parameters and that their most probable values are so close to each other, it strongly points towards an increase of the dust density distribution at the pericenter of the eccentric disk. Interestingly, the simulations of \\citet{Pearce2014} show the opposite effect: the density is lower at the pericenter when including an eccentric planet in the disk (the particles spend more time at the apocenter than at the pericenter).\n\nIf a planet were to be detected (at other wavelengths or with other facilities), it would be interesting to confront our modeling results with the orbital parameters of the planet. But in the following, we will hypothesize that no massive planet was formed around HD\\,61005 and we will try to explain the inferred morphology of the disk under this assumption.\n\n\\subsubsection{The impact of gas in a debris disk}\n\n\\citet{Lyra2013} showed that narrow, eccentric debris disks can be the consequence of the presence of gas. While debris disks are generally thought of as depleted of gas, several recent studies have demonstrated it is not necessarily the case, even at ages as old as a few tens of Myr (e.g., \\citealp{Hughes2008,Dent2014,Kospal2013,Moor2015b}). \\citet{Lyra2013} suggested that the dust grains can heat up the surrounding gas, via photoelectric heating. This will locally increase the gas pressure and since the grains follow the pressure gradient, the pressure maximum will concentrate them even further. At the end, the disk may appear as narrow and eccentric, even though no planets are shaping it (although the original disk must be narrow). In Section\\,\\ref{sec:CO}, we concluded that the gas to dust ratio remains poorly constrained because of the (relatively strong) assumptions we made (LTE, grain size distribution, CO/H$_2$ abundance ratio). Overall, this scenario may be a viable solution to explain our findings, but cannot be verified at the moment (the azimuthal density variation would have to be addressed as well).\n\n\\subsubsection{The aftermath of a collision between Pluto-sized bodies ?}\n\nAn alternative possibility would be that we are witnessing an impact between two Pluto-sized bodies in the debris disk. This solution is mostly interesting because we find a peak of density at the pericenter of a slightly eccentric disk. In Section\\,\\ref{sec:stirring}, we concluded that self-stirring by massive planetesimals may be taking place in the 40\\,Myr old debris disk. At this age, and a radius of 60\\,AU, a few massive oligarchs may have been formed and are disrupting the orbits of other planetesimals. The collisional cross sections of these bodies would have increased along with the probabilities of intercepting each others' orbits. Numerical studies of such impacts (e.g., \\citealp{Jackson2014} and \\citealp{Kral2015}) suggest that our results may be compatible with the scenario of an impact between two massive bodies. Such a collision would release significant amount of debris, and all of them would have to pass through the same location where the collision initially occurred. This would enhance the density, as well as the chances of subsequent collisions in this particular region of the disk. The eccentricity (and complexity) of the resulting disk would depend on the eccentricity of the initial parent body. The debris disk can maintain this asymmetry for about 1\\,000 orbital periods ($\\sim 0.45$\\,Myr at 60\\,AU), according to the work of \\citet{Jackson2014}. A comparable explanation was proposed by \\citet{Stark2014} for the disk around HD\\,181327, for which the HST images show an azimuthal variation of the dust density distribution. The main difference between the two debris disks being that HD\\,181327 is much younger than HD\\,61005 (12\\,Myr versus 40\\,Myr), while the dust belt is located slightly farther away (hence self-stirring may not be happening yet). Overall, if our modeling and interpretation of the multi-wavelength observations of the Moth hold, it would suggest that massive, Pluto-sized, bodies can still be formed at a large distance from the star at an age of $\\sim 40$\\,Myr. This could be the onset of \\textit{in situ} super-Earth formation, as described in \\citet{Kenyon2015a}.\n\nThe presence of spatially separated belts (inner and outer belts) is often discussed in the context of planet-disk interactions (e.g., \\citealp{Su2013}). Massive planets may scatter away any close-by debris, hence opening a dust-free region in the disk. Planets may also be able to scatter debris from the outer regions and send them inwards, which would result in a bi-modal distribution of the dust (e.g., \\citealp{Bonsor2012}). In the case of HD\\,61005, we do not have strong constraints on the location of the inner belt. But given that the evolution of a debris disk is an inside-out process (\\citealp{Kenyon2008}), it is unlikely the inner belt is primordial. But the age of the star, the inner regions should already have been depleted of any detectable amount of small dust grains. Still assuming that there are no massive planets around HD\\,61005, is it possible to reconcile the presence of an analog of the asteroid belt with the above interpretation ? If it is indeed the case that a few oligarchs have formed in the main belt at 60\\,AU, the disk would be in an active and chaotic state. Some of these massive bodies may have collided in the main belt, but some may have scattered debris inwards. However, simulations such as the ones presented in \\citet{Jackson2014} and \\citet{Kral2015} do not display cleared gaps. Consequently, under our assumption that there are no giant planets, it seems that our interpretation of the dynamical evolution of the outer regions is not directly related with what is taking place in the inner regions. It may well be that telluric planets have formed in the inner regions and further investigation remain necessary to better constrain the location of the innermost belt.\n\n\n\n\n\n\n\n\\section{Conclusion}\\label{sec:conclusion}\n\nIn this study, we presented new VLT/SPHERE and ALMA observations of the debris disk around the 40\\,Myr old solar-type star HD\\,61005. We modeled both the radial and azimuthal distribution of the dust grains. We find that the disk is slightly eccentric ($e \\sim 0.1$), with a dust density twice smaller at the apocenter compared to the pericenter. We confirm that the eccentricity of the disk is not sufficient to explain the known brightness asymmetry. Thanks to the multi-wavelength analysis, we highlight a possible radial segregation of the grain size distribution, since the disk appears more extended at near-IR wavelengths compared to far-IR and mm wavelengths. The parent planetesimals are confined within a narrow belt (with a semi-major axis of about $61$\\,AU), while small dust grains (or dust aggregates) would be blown out by radiation pressure. No CO gas was detected with the ALMA observations and we did not detect any giant planets around the star. We propose that the inferred morphology of the disk could be the aftermath of collision(s) between Pluto-sized bodies in the main belt. The debris disk may be bright because self-stirring recently started to become significant in the belt, and it triggered a massive collision. The location of the collision became a pinch point where all debris must go through at each orbit, hence locally increasing the dust density and the chances of subsequent collisions. It may well be the early phases of the formation of super-Earth at large distances from the star. Finally, the presence of an inner belt would be consistent with the modeling of the SED, and we conclude its presence and dynamical evolution is unrelated to the evolution of the outer belt.\n\n\n\n\n\\begin{acknowledgements}\nThis paper makes use of the following ALMA data: ADS/JAO.ALMA 2012.1.00437.S. ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada), NSC and ASIAA (Taiwan), and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. J. Olofsson, H. Avenhaus, C. Caceres, H. Canovas, M. R. Schreiber, A. Bayo, and S. Casassus acknowledge support from the Millennium Nucleus RC130007 (Chilean Ministry of Economy). H. Avenhaus acknowledges support from FONDECYT 2015 Postdoctoral Grant 3150643, C. Caceres the support from CONICYT FONDECYT grant 3140592, H. Canovas the support from ALMA/CONICYT (grants 31100025 and 31130027), and A. Bayo the financial support from the Proyecto Fondecyt Iniciaci\\'on 11140572. This work was supported by the Momentum grant of the MTA CSFK Lend\\\"ulet Disk Research Group. A. Mo\\'or acknowledges support from the Bolyai Research Fellowship of the Hungarian Academy of Sciences. J. Olofsson would like to thank Daniel Foreman-Mackey for his help with the parallelization of the code with \\texttt{emcee} and Mark Booth for valuable discussions about ALMA data. This research made use of Astropy, a community-developed core Python package for Astronomy (Astropy Collaboration, 2013). This research has made use of the SIMBAD database (operated at CDS, Strasbourg, France). The authors have used the TOPCAT software (\\citealp{Taylor2005}) in this work.\n\\end{acknowledgements}\n\n\\bibliographystyle{aa}\n\\begin{thebibliography}{98}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Alexander} {et~al.}(2006){Alexander}, {Clarke}, \\&\n  {Pringle}}]{Alexander2006}\n{Alexander}, R.~D., {Clarke}, C.~J., \\& {Pringle}, J.~E. 2006, \\mnras, 369, 216\n\n\\bibitem[{Amara \\& Quanz(2012)}]{Amara2012}\nAmara, A. \\& Quanz, S.~P. 2012, Monthly Notices of the Royal Astronomical\n  Society, 427, 948\n\n\\bibitem[{{Augereau} {et~al.}(1999){Augereau}, {Lagrange}, {Mouillet},\n  {Papaloizou}, \\& {Grorod}}]{Augereau1999}\n{Augereau}, J.~C., {Lagrange}, A.~M., {Mouillet}, D., {Papaloizou}, J.~C.~B.,\n  \\& {Grorod}, P.~A. 1999, \\aap, 348, 557\n\n\\bibitem[{{Aumann} {et~al.}(1984){Aumann}, {Beichman}, {Gillett}, {de Jong},\n  {Houck}, {Low}, {Neugebauer}, {Walker}, \\& {Wesselius}}]{Aumann1984}\n{Aumann}, H.~H., {Beichman}, C.~A., {Gillett}, F.~C., {et~al.} 1984, \\apjl,\n  278, L23\n\n\\bibitem[{{Avenhaus} {et~al.}(2014){Avenhaus}, {Quanz}, {Schmid}, {Meyer},\n  {Garufi}, {Wolf}, \\& {Dominik}}]{Avenhaus2014}\n{Avenhaus}, H., {Quanz}, S.~P., {Schmid}, H.~M., {et~al.} 2014, \\apj, 781, 87\n\n\\bibitem[{{Ballering} {et~al.}(2013){Ballering}, {Rieke}, {Su}, \\&\n  {Montiel}}]{Ballering2013}\n{Ballering}, N.~P., {Rieke}, G.~H., {Su}, K.~Y.~L., \\& {Montiel}, E. 2013,\n  \\apj, 775, 55\n\n\\bibitem[{{Baraffe} {et~al.}(2015){Baraffe}, {Homeier}, {Allard}, \\&\n  {Chabrier}}]{Baraffe2015}\n{Baraffe}, I., {Homeier}, D., {Allard}, F., \\& {Chabrier}, G. 2015, \\aap, 577,\n  A42\n\n\\bibitem[{{Bayo} {et~al.}(2008){Bayo}, {Rodrigo}, {Barrado Y Navascu{\\'e}s},\n  {Solano}, {Guti{\\'e}rrez}, {Morales-Calder{\\'o}n}, \\& {Allard}}]{Bayo2008}\n{Bayo}, A., {Rodrigo}, C., {Barrado Y Navascu{\\'e}s}, D., {et~al.} 2008, \\aap,\n  492, 277\n\n\\bibitem[{{Bendo} {et~al.}(2013){Bendo}, {Griffin}, {Bock}, {Conversi},\n  {Dowell}, {Lim}, {Lu}, {North}, {Papageorgiou}, {Pearson}, {Pohlen},\n  {Polehampton}, {Schulz}, {Shupe}, {Sibthorpe}, {Spencer}, {Swinyard},\n  {Valtchanov}, \\& {Xu}}]{Bendo2013}\n{Bendo}, G.~J., {Griffin}, M.~J., {Bock}, J.~J., {et~al.} 2013, \\mnras, 433,\n  3062\n\n\\bibitem[{{Benisty} {et~al.}(2015){Benisty}, {Juhasz}, {Boccaletti},\n  {Avenhaus}, {Milli}, {Thalmann}, {Dominik}, {Pinilla}, {Buenzli}, {Pohl},\n  {Beuzit}, {Birnstiel}, {de Boer}, {Bonnefoy}, {Chauvin}, {Christiaens},\n  {Garufi}, {Grady}, {Henning}, {Huelamo}, {Isella}, {Langlois}, {M{\\'e}nard},\n  {Mouillet}, {Olofsson}, {Pantin}, {Pinte}, \\& {Pueyo}}]{Benisty2015}\n{Benisty}, M., {Juhasz}, A., {Boccaletti}, A., {et~al.} 2015, \\aap, 578, L6\n\n\\bibitem[{{Beust} {et~al.}(2014){Beust}, {Augereau}, {Bonsor}, {Graham},\n  {Kalas}, {Lebreton}, {Lagrange}, {Ertel}, {Faramaz}, \\&\n  {Th{\\'e}bault}}]{Beust2014}\n{Beust}, H., {Augereau}, J.-C., {Bonsor}, A., {et~al.} 2014, \\aap, 561, A43\n\n\\bibitem[{{Beuzit} {et~al.}(2008){Beuzit}, {Feldt}, {Dohlen}, {Mouillet},\n  {Puget}, {Wildi}, {Abe}, {Antichi}, {Baruffolo}, {Baudoz}, {Boccaletti},\n  {Carbillet}, {Charton}, {Claudi}, {Downing}, {Fabron}, {Feautrier},\n  {Fedrigo}, {Fusco}, {Gach}, {Gratton}, {Henning}, {Hubin}, {Joos}, {Kasper},\n  {Langlois}, {Lenzen}, {Moutou}, {Pavlov}, {Petit}, {Pragt}, {Rabou}, {Rigal},\n  {Roelfsema}, {Rousset}, {Saisse}, {Schmid}, {Stadler}, {Thalmann}, {Turatto},\n  {Udry}, {Vakili}, \\& {Waters}}]{Beuzit2008}\n{Beuzit}, J.-L., {Feldt}, M., {Dohlen}, K., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  18\n\n\\bibitem[{{Boccaletti} {et~al.}(2015){Boccaletti}, {Thalmann}, {Lagrange},\n  {Janson}, {Augereau}, {Schneider}, {Milli}, {Grady}, {Debes}, {Langlois},\n  {Mouillet}, {Henning}, {Dominik}, {Maire}, {Beuzit}, {Carson}, {Dohlen},\n  {Engler}, {Feldt}, {Fusco}, {Ginski}, {Girard}, {Hines}, {Kasper}, {Mawet},\n  {M{\\'e}nard}, {Meyer}, {Moutou}, {Olofsson}, {Rodigas}, {Sauvage},\n  {Schlieder}, {Schmid}, {Turatto}, {Udry}, {Vakili}, {Vigan}, {Wahhaj}, \\&\n  {Wisniewski}}]{Boccaletti2015}\n{Boccaletti}, A., {Thalmann}, C., {Lagrange}, A.-M., {et~al.} 2015, \\nat, 526,\n  230\n\n\\bibitem[{Bonsor \\& Wyatt(2012)}]{Bonsor2012}\nBonsor, A. \\& Wyatt, M.~C. 2012, Monthly Notices of the Royal Astronomical\n  Society, 420, 2990\n\n\\bibitem[{{Buenzli} {et~al.}(2010){Buenzli}, {Thalmann}, {Vigan}, {Boccaletti},\n  {Chauvin}, {Augereau}, {Meyer}, {M{\\'e}nard}, {Desidera}, {Messina},\n  {Henning}, {Carson}, {Montagnier}, {Beuzit}, {Bonavita}, {Eggenberger},\n  {Lagrange}, {Mesa}, {Mouillet}, \\& {Quanz}}]{Buenzli2010}\n{Buenzli}, E., {Thalmann}, C., {Vigan}, A., {et~al.} 2010, \\aap, 524, L1\n\n\\bibitem[{{Burns} {et~al.}(1979){Burns}, {Lamy}, \\& {Soter}}]{Burns1979}\n{Burns}, J.~A., {Lamy}, P.~L., \\& {Soter}, S. 1979, \\icarus, 40, 1\n\n\\bibitem[{{Canovas} {et~al.}(2015){Canovas}, {M{\\'e}nard}, {de Boer}, {Pinte},\n  {Avenhaus}, \\& {Schreiber}}]{Canovas2015}\n{Canovas}, H., {M{\\'e}nard}, F., {de Boer}, J., {et~al.} 2015, \\aap, 582, L7\n\n\\bibitem[{{Canovas} {et~al.}(2011){Canovas}, {Rodenhuis}, {Jeffers}, {Min}, \\&\n  {Keller}}]{Canovas2011}\n{Canovas}, H., {Rodenhuis}, M., {Jeffers}, S.~V., {Min}, M., \\& {Keller}, C.~U.\n  2011, \\aap, 531, A102\n\n\\bibitem[{{Casagrande} {et~al.}(2011){Casagrande}, {Sch{\\\"o}nrich}, {Asplund},\n  {Cassisi}, {Ram{\\'{\\i}}rez}, {Mel{\\'e}ndez}, {Bensby}, \\&\n  {Feltzing}}]{Casagrande2011}\n{Casagrande}, L., {Sch{\\\"o}nrich}, R., {Asplund}, M., {et~al.} 2011, \\aap, 530,\n  A138\n\n\\bibitem[{{Castelli} {et~al.}(1997){Castelli}, {Gratton}, \\&\n  {Kurucz}}]{Castelli1997}\n{Castelli}, F., {Gratton}, R.~G., \\& {Kurucz}, R.~L. 1997, \\aap, 318, 841\n\n\\bibitem[{{Chen} {et~al.}(2014){Chen}, {Mittal}, {Kuchner}, {Forrest}, {Lisse},\n  {Manoj}, {Sargent}, \\& {Watson}}]{Chen2014}\n{Chen}, C.~H., {Mittal}, T., {Kuchner}, M., {et~al.} 2014, \\apjs, 211, 25\n\n\\bibitem[{{Claudi} {et~al.}(2008){Claudi}, {Turatto}, {Gratton}, {Antichi},\n  {Bonavita}, {Bruno}, {Cascone}, {De Caprio}, {Desidera}, {Giro}, {Mesa},\n  {Scuderi}, {Dohlen}, {Beuzit}, \\& {Puget}}]{Claudi2008}\n{Claudi}, R.~U., {Turatto}, M., {Gratton}, R.~G., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  3\n\n\\bibitem[{{De Silva} {et~al.}(2013){De Silva}, {D'Orazi}, {Melo}, {Torres},\n  {Gieles}, {Quast}, \\& {Sterzik}}]{DeSilva2013}\n{De Silva}, G.~M., {D'Orazi}, V., {Melo}, C., {et~al.} 2013, \\mnras, 431, 1005\n\n\\bibitem[{{Dent} {et~al.}(2014){Dent}, {Wyatt}, {Roberge}, {Augereau},\n  {Casassus}, {Corder}, {Greaves}, {de Gregorio-Monsalvo}, {Hales}, {Jackson},\n  {Hughes}, {Lagrange}, {Matthews}, \\& {Wilner}}]{Dent2014}\n{Dent}, W.~R.~F., {Wyatt}, M.~C., {Roberge}, A., {et~al.} 2014, Science, 343,\n  1490\n\n\\bibitem[{{Desidera} {et~al.}(2011){Desidera}, {Covino}, {Messina}, {D'Orazi},\n  {Alcal{\\'a}}, {Brugaletta}, {Carson}, {Lanzafame}, \\&\n  {Launhardt}}]{Desidera2011}\n{Desidera}, S., {Covino}, E., {Messina}, S., {et~al.} 2011, \\aap, 529, A54\n\n\\bibitem[{{Dohlen} {et~al.}(2008){Dohlen}, {Langlois}, {Saisse}, {Hill},\n  {Origne}, {Jacquet}, {Fabron}, {Blanc}, {Llored}, {Carle}, {Moutou}, {Vigan},\n  {Boccaletti}, {Carbillet}, {Mouillet}, \\& {Beuzit}}]{Dohlen2008}\n{Dohlen}, K., {Langlois}, M., {Saisse}, M., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  3\n\n\\bibitem[{{Dohnanyi}(1969)}]{Dohnanyi1969}\n{Dohnanyi}, J.~S. 1969, \\jgr, 74, 2531\n\n\\bibitem[{{Dominik} \\& {Decin}(2003)}]{Dominik2003}\n{Dominik}, C. \\& {Decin}, G. 2003, \\apj, 598, 626\n\n\\bibitem[{{Dorschner} {et~al.}(1995){Dorschner}, {Begemann}, {Henning},\n  {J{\\\"a}ger}, \\& {Mutschke}}]{Dorschner1995}\n{Dorschner}, J., {Begemann}, B., {Henning}, T., {J{\\\"a}ger}, C., \\& {Mutschke},\n  H. 1995, \\aap, 300, 503\n\n\\bibitem[{{Dullemond} \\& {Dominik}(2008)}]{Dullemond2008}\n{Dullemond}, C.~P. \\& {Dominik}, C. 2008, \\aap, 487, 205\n\n\\bibitem[{{Eiroa} {et~al.}(2013){Eiroa}, {Marshall}, {Mora}, {Montesinos},\n  {Absil}, {Augereau}, {Bayo}, {Bryden}, {Danchi}, {del Burgo}, {Ertel},\n  {Fridlund}, {Heras}, {Krivov}, {Launhardt}, {Liseau}, {L{\\\"o}hne},\n  {Maldonado}, {Pilbratt}, {Roberge}, {Rodmann}, {Sanz-Forcada}, {Solano},\n  {Stapelfeldt}, {Th{\\'e}bault}, {Wolf}, {Ardila}, {Ar{\\'e}valo}, {Beichmann},\n  {Faramaz}, {Gonz{\\'a}lez-Garc{\\'{\\i}}a}, {Guti{\\'e}rrez}, {Lebreton},\n  {Mart{\\'{\\i}}nez-Arn{\\'a}iz}, {Meeus}, {Montes}, {Olofsson}, {Su}, {White},\n  {Barrado}, {Fukagawa}, {Gr{\\\"u}n}, {Kamp}, {Lorente}, {Morbidelli},\n  {M{\\\"u}ller}, {Mutschke}, {Nakagawa}, {Ribas}, \\& {Walker}}]{Eiroa2013}\n{Eiroa}, C., {Marshall}, J.~P., {Mora}, A., {et~al.} 2013, \\aap, 555, A11\n\n\\bibitem[{{Elliott} {et~al.}(2014){Elliott}, {Bayo}, {Melo}, {Torres},\n  {Sterzik}, \\& {Quast}}]{Elliott2014}\n{Elliott}, P., {Bayo}, A., {Melo}, C.~H.~F., {et~al.} 2014, \\aap, 568, A26\n\n\\bibitem[{{Faramaz} {et~al.}(2014){Faramaz}, {Beust}, {Th{\\'e}bault},\n  {Augereau}, {Bonsor}, {del Burgo}, {Ertel}, {Marshall}, {Milli},\n  {Montesinos}, {Mora}, {Bryden}, {Danchi}, {Eiroa}, {White}, \\&\n  {Wolf}}]{Faramaz2014}\n{Faramaz}, V., {Beust}, H., {Th{\\'e}bault}, P., {et~al.} 2014, \\aap, 563, A72\n\n\\bibitem[{Foreman-Mackey {et~al.}(2014)Foreman-Mackey, Price-Whelan, Ryan,\n  Emily, Smith, Barbary, Hogg, \\& Brewer}]{ForemanMackey2014}\nForeman-Mackey, D., Price-Whelan, A., Ryan, G., {et~al.} 2014, triangle.py\n  v0.1.1\n\n\\bibitem[{Gelman \\& Rubin(1992)}]{Gelman1992}\nGelman, A. \\& Rubin, D.~B. 1992, Statist. Sci., 7, 457\n\n\\bibitem[{{Griffin} {et~al.}(2010){Griffin}, {Abergel}, {Abreu}, {Ade},\n  {Andr{\\'e}}, {Augueres}, {Babbedge}, {Bae}, {Baillie}, {Baluteau}, {Barlow},\n  {Bendo}, {Benielli}, {Bock}, {Bonhomme}, {Brisbin}, {Brockley-Blatt},\n  {Caldwell}, {Cara}, {Castro-Rodriguez}, {Cerulli}, {Chanial}, {Chen},\n  {Clark}, {Clements}, {Clerc}, {Coker}, {Communal}, {Conversi}, {Cox},\n  {Crumb}, {Cunningham}, {Daly}, {Davis}, {de Antoni}, {Delderfield}, {Devin},\n  {di Giorgio}, {Didschuns}, {Dohlen}, {Donati}, {Dowell}, {Dowell}, {Duband},\n  {Dumaye}, {Emery}, {Ferlet}, {Ferrand}, {Fontignie}, {Fox}, {Franceschini},\n  {Frerking}, {Fulton}, {Garcia}, {Gastaud}, {Gear}, {Glenn}, {Goizel},\n  {Griffin}, {Grundy}, {Guest}, {Guillemet}, {Hargrave}, {Harwit}, {Hastings},\n  {Hatziminaoglou}, {Herman}, {Hinde}, {Hristov}, {Huang}, {Imhof}, {Isaak},\n  {Israelsson}, {Ivison}, {Jennings}, {Kiernan}, {King}, {Lange}, {Latter},\n  {Laurent}, {Laurent}, {Leeks}, {Lellouch}, {Levenson}, {Li}, {Li},\n  {Lilienthal}, {Lim}, {Liu}, {Lu}, {Madden}, {Mainetti}, {Marliani}, {McKay},\n  {Mercier}, {Molinari}, {Morris}, {Moseley}, {Mulder}, {Mur}, {Naylor},\n  {Nguyen}, {O'Halloran}, {Oliver}, {Olofsson}, {Olofsson}, {Orfei}, {Page},\n  {Pain}, {Panuzzo}, {Papageorgiou}, {Parks}, {Parr-Burman}, {Pearce},\n  {Pearson}, {P{\\'e}rez-Fournon}, {Pinsard}, {Pisano}, {Podosek}, {Pohlen},\n  {Polehampton}, {Pouliquen}, {Rigopoulou}, {Rizzo}, {Roseboom}, {Roussel},\n  {Rowan-Robinson}, {Rownd}, {Saraceno}, {Sauvage}, {Savage}, {Savini},\n  {Sawyer}, {Scharmberg}, {Schmitt}, {Schneider}, {Schulz}, {Schwartz},\n  {Shafer}, {Shupe}, {Sibthorpe}, {Sidher}, {Smith}, {Smith}, {Smith},\n  {Spencer}, {Stobie}, {Sudiwala}, {Sukhatme}, {Surace}, {Stevens}, {Swinyard},\n  {Trichas}, {Tourette}, {Triou}, {Tseng}, {Tucker}, {Turner}, {Vaccari},\n  {Valtchanov}, {Vigroux}, {Virique}, {Voellmer}, {Walker}, {Ward}, {Waskett},\n  {Weilert}, {Wesson}, {White}, {Whitehouse}, {Wilson}, {Winter}, {Woodcraft},\n  {Wright}, {Xu}, {Zavagno}, {Zemcov}, {Zhang}, \\& {Zonca}}]{Griffin2010}\n{Griffin}, M.~J., {Abergel}, A., {Abreu}, A., {et~al.} 2010, \\aap, 518, L3\n\n\\bibitem[{{Henyey} \\& {Greenstein}(1941)}]{Henyey1941}\n{Henyey}, L.~G. \\& {Greenstein}, J.~L. 1941, \\apj, 93, 70\n\n\\bibitem[{{Hern{\\'a}ndez} {et~al.}(2007){Hern{\\'a}ndez}, {Hartmann}, {Megeath},\n  {Gutermuth}, {Muzerolle}, {Calvet}, {Vivas}, {Brice{\\~n}o}, {Allen},\n  {Stauffer}, {Young}, \\& {Fazio}}]{Hernandez2007}\n{Hern{\\'a}ndez}, J., {Hartmann}, L., {Megeath}, T., {et~al.} 2007, \\apj, 662,\n  1067\n\n\\bibitem[{{Hines} {et~al.}(2007){Hines}, {Schneider}, {Hollenbach}, {Mamajek},\n  {Hillenbrand}, {Metchev}, {Meyer}, {Carpenter}, {Moro-Mart{\\'{\\i}}n},\n  {Silverstone}, {Kim}, {Henning}, {Bouwman}, \\& {Wolf}}]{Hines2007}\n{Hines}, D.~C., {Schneider}, G., {Hollenbach}, D., {et~al.} 2007, \\apjl, 671,\n  L165\n\n\\bibitem[{{Hughes} {et~al.}(2008){Hughes}, {Wilner}, {Kamp}, \\&\n  {Hogerheijde}}]{Hughes2008}\n{Hughes}, A.~M., {Wilner}, D.~J., {Kamp}, I., \\& {Hogerheijde}, M.~R. 2008,\n  \\apj, 681, 626\n\n\\bibitem[{{Jackson} {et~al.}(2014){Jackson}, {Wyatt}, {Bonsor}, \\&\n  {Veras}}]{Jackson2014}\n{Jackson}, A.~P., {Wyatt}, M.~C., {Bonsor}, A., \\& {Veras}, D. 2014, \\mnras,\n  440, 3757\n\n\\bibitem[{{Johansen} {et~al.}(2015){Johansen}, {Mac Low}, {Lacerda}, \\&\n  {Bizzarro}}]{Johansen2015}\n{Johansen}, A., {Mac Low}, M.-M., {Lacerda}, P., \\& {Bizzarro}, M. 2015,\n  Science Advances, 1, 1500109\n\n\\bibitem[{{Kalas} {et~al.}(2008){Kalas}, {Graham}, {Chiang}, {Fitzgerald},\n  {Clampin}, {Kite}, {Stapelfeldt}, {Marois}, \\& {Krist}}]{Kalas2008}\n{Kalas}, P., {Graham}, J.~R., {Chiang}, E., {et~al.} 2008, Science, 322, 1345\n\n\\bibitem[{{Kalas} {et~al.}(2005){Kalas}, {Graham}, \\& {Clampin}}]{Kalas2005}\n{Kalas}, P., {Graham}, J.~R., \\& {Clampin}, M. 2005, \\nat, 435, 1067\n\n\\bibitem[{{Kalas} {et~al.}(2015){Kalas}, {Rajan}, {Wang}, {Millar-Blanchaer},\n  {Duchene}, {Chen}, {Fitzgerald}, {Dong}, {Graham}, {Patience}, {Macintosh},\n  {Murray-Clay}, {Matthews}, {Rameau}, {Marois}, {Chilcote}, {De Rosa},\n  {Doyon}, {Draper}, {Lawler}, {Ammons}, {Arriaga}, {Bulger}, {Cotten},\n  {Follette}, {Goodsell}, {Greenbaum}, {Hibon}, {Hinkley}, {Hung}, {Ingraham},\n  {Konapacky}, {Lafreniere}, {Larkin}, {Long}, {Maire}, {Marchis}, {Metchev},\n  {Morzinski}, {Nielsen}, {Oppenheimer}, {Perrin}, {Pueyo}, {Rantakyr{\\\"o}},\n  {Ruffio}, {Saddlemyer}, {Savransky}, {Schneider}, {Sivaramakrishnan},\n  {Soummer}, {Song}, {Thomas}, {Vasisht}, {Ward-Duong}, {Wiktorowicz}, \\&\n  {Wolff}}]{Kalas2015}\n{Kalas}, P.~G., {Rajan}, A., {Wang}, J.~J., {et~al.} 2015, \\apj, 814, 32\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2006)}]{Kenyon2006}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2006, \\aj, 131, 1837\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2008)}]{Kenyon2008}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2008, \\apjs, 179, 451\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2015)}]{Kenyon2015a}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2015, \\apj, 806, 42\n\n\\bibitem[{Kospal {et~al.}(2013)Kospal, Moor, Juhasz, Abraham, Apai, Csengeri,\n  Grady, Henning, Hughes, Kiss, Pascucci, \\& Schmalzl}]{Kospal2013}\nKospal, A., Moor, A., Juhasz, A., {et~al.} 2013, The Astrophysical Journal,\n  776, 77\n\n\\bibitem[{{Kral} {et~al.}(2015){Kral}, {Th{\\'e}bault}, {Augereau},\n  {Boccaletti}, \\& {Charnoz}}]{Kral2015}\n{Kral}, Q., {Th{\\'e}bault}, P., {Augereau}, J.-C., {Boccaletti}, A., \\&\n  {Charnoz}, S. 2015, \\aap, 573, A39\n\n\\bibitem[{{Krivov}(2010)}]{Krivov2010}\n{Krivov}, A.~V. 2010, Research in Astronomy and Astrophysics, 10, 383\n\n\\bibitem[{{Lagrange} {et~al.}(2015){Lagrange}, {Langlois}, {Gratton}, {Maire},\n  {Milli}, {Olofsson}, {Vigan}, {Bailey}, {Mesa}, {Chauvin}, {Boccaletti},\n  {Galicher}, {Girard}, {Bonnefoy}, {Samland}, {Menard}, {Henning},\n  {Kenworthy}, {Thalmann}, {Beust}, {Beuzit}, {Brandner}, {Buenzli},\n  {Cheetham}, {Janson}, {le Coroller}, {Lannier}, {Mouillet}, {Peretti},\n  {Perrot}, {Salter}, {Sissa}, {Wahhaj}, {Abe}, {Desidera}, {Feldt}, {Madec},\n  {Perret}, {Petit}, {Rabou}, {Soenke}, \\& {Weber}}]{Lagrange2015}\n{Lagrange}, A.-M., {Langlois}, M., {Gratton}, R., {et~al.} 2015, ArXiv e-prints\n  [\\eprint[arXiv]{1510.02511}]\n\n\\bibitem[{{Langlois} {et~al.}(2014){Langlois}, {Dohlen}, {Vigan}, {Zurlo},\n  {Moutou}, {Schmid}, {Mili}, {Beuzit}, {Boccaletti}, {Carle}, {Costille},\n  {Dorn}, {Gluck}, {Hubin}, {Feldt}, {Kasper}, {Lizon}, {Madec}, {Le Mignant},\n  {Mouillet}, {Puget}, {Sauvage}, \\& {Wildi}}]{Langlois2014}\n{Langlois}, M., {Dohlen}, K., {Vigan}, A., {et~al.} 2014, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 9147,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  91471R\n\n\\bibitem[{{Lebouteiller} {et~al.}(2011){Lebouteiller}, {Barry}, {Spoon},\n  {Bernard-Salas}, {Sloan}, {Houck}, \\& {Weedman}}]{Lebouteiller2011}\n{Lebouteiller}, V., {Barry}, D.~J., {Spoon}, H.~W.~W., {et~al.} 2011, \\apjs,\n  196, 8\n\n\\bibitem[{Lebreton {et~al.}(2012)Lebreton, Augereau, Thi, Roberge, Donaldson,\n  Schneider, Maddison, M{\\'e}nard, Riviere-Marichalar, Mathews, Kamp, Pinte,\n  Dent, Barrado, Duch{\\^e}ne, Gonzalez, Grady, Meeus, Pantin, Williams, \\&\n  Woitke}]{Lebreton2012}\nLebreton, J., Augereau, J.-C., Thi, W.~F., {et~al.} 2012, Astronomy {\\&}\n  Astrophysics, 539, A17\n\n\\bibitem[{{Li} \\& {Greenberg}(1998)}]{Li1998}\n{Li}, A. \\& {Greenberg}, J.~M. 1998, \\aap, 331, 291\n\n\\bibitem[{Lyra \\& Kuchner(2013)}]{Lyra2013}\nLyra, W. \\& Kuchner, M. 2013, Nature, 499, 184\n\n\\bibitem[{{Maire} {et~al.}(2015){Maire}, {Bonnefoy}, {Ginski}, {Vigan},\n  {Messina}, {Mesa}, {Galicher}, {Gratton}, {Desidera}, {Kopytova}, {Millward},\n  {Thalmann}, {Claudi}, {Ehrenreich}, {Zurlo}, {Chauvin}, {Antichi},\n  {Baruffolo}, {Bazzon}, {Beuzit}, {Blanchard}, {Boccaletti}, {de Boer},\n  {Carle}, {Cascone}, {Costille}, {De Caprio}, {Delboulbe}, {Dohlen},\n  {Dominik}, {Feldt}, {Fusco}, {Girard}, {Giro}, {Gisler}, {Gluck}, {Gry},\n  {Henning}, {Hubin}, {Hugot}, {Jaquet}, {Kasper}, {Lagrange}, {Langlois}, {Le\n  Mignant}, {Llored}, {Madec}, {Martinez}, {Mawet}, {Milli}, {Moeller-Nilsson},\n  {Mouillet}, {Moulin}, {Moutou}, {Origne}, {Pavlov}, {Petit}, {Pragt},\n  {Puget}, {Ramos}, {Rochat}, {Roelfsema}, {Salasnich}, {Sauvage}, {Schmid},\n  {Turatto}, {Udry}, {Vakili}, {Wahhaj}, {Weber}, \\& {Wildi}}]{Maire2015}\n{Maire}, A.-L., {Bonnefoy}, M., {Ginski}, C., {et~al.} 2015, ArXiv e-prints\n  [\\eprint[arXiv]{1511.04072}]\n\n\\bibitem[{{Maness} {et~al.}(2009){Maness}, {Kalas}, {Peek}, {Chiang},\n  {Scherer}, {Fitzgerald}, {Graham}, {Hines}, {Schneider}, \\&\n  {Metchev}}]{Maness2009}\n{Maness}, H.~L., {Kalas}, P., {Peek}, K.~M.~G., {et~al.} 2009, \\apj, 707, 1098\n\n\\bibitem[{{Marois} {et~al.}(2006){Marois}, {Lafreni{\\`e}re}, {Doyon},\n  {Macintosh}, \\& {Nadeau}}]{Marois2006}\n{Marois}, C., {Lafreni{\\`e}re}, D., {Doyon}, R., {Macintosh}, B., \\& {Nadeau},\n  D. 2006, \\apj, 641, 556\n\n\\bibitem[{{Matr{\\`a}} {et~al.}(2015){Matr{\\`a}}, {Pani{\\'c}}, {Wyatt}, \\&\n  {Dent}}]{Matra2015}\n{Matr{\\`a}}, L., {Pani{\\'c}}, O., {Wyatt}, M.~C., \\& {Dent}, W.~R.~F. 2015,\n  \\mnras, 447, 3936\n\n\\bibitem[{{Matthews} {et~al.}(2014){Matthews}, {Krivov}, {Wyatt}, {Bryden}, \\&\n  {Eiroa}}]{Matthews2014}\n{Matthews}, B.~C., {Krivov}, A.~V., {Wyatt}, M.~C., {Bryden}, G., \\& {Eiroa},\n  C. 2014, ArXiv e-prints [\\eprint[arXiv]{1401.0743}]\n\n\\bibitem[{{Millar-Blanchaer} {et~al.}(2015){Millar-Blanchaer}, {Graham},\n  {Pueyo}, {Kalas}, {Dawson}, {Wang}, {Perrin}, {moon}, {Macintosh}, {Ammons},\n  {Barman}, {Cardwell}, {Chen}, {Chiang}, {Chilcote}, {Cotten}, {De Rosa},\n  {Draper}, {Dunn}, {Duch{\\^e}ne}, {Esposito}, {Fitzgerald}, {Follette},\n  {Goodsell}, {Greenbaum}, {Hartung}, {Hibon}, {Hinkley}, {Ingraham},\n  {Jensen-Clem}, {Konopacky}, {Larkin}, {Long}, {Maire}, {Marchis}, {Marley},\n  {Marois}, {Morzinski}, {Nielsen}, {Palmer}, {Oppenheimer}, {Poyneer},\n  {Rajan}, {Rantakyr{\\\"o}}, {Ruffio}, {Sadakuni}, {Saddlemyer}, {Schneider},\n  {Sivaramakrishnan}, {Soummer}, {Thomas}, {Vasisht}, {Vega}, {Wallace},\n  {Ward-Duong}, {Wiktorowicz}, \\& {Wolff}}]{MillarBlanchaer2015}\n{Millar-Blanchaer}, M.~A., {Graham}, J.~R., {Pueyo}, L., {et~al.} 2015, \\apj,\n  811, 18\n\n\\bibitem[{{Milli} {et~al.}(2015){Milli}, {Mawet}, {Pinte}, {Lagrange},\n  {Mouillet}, {Girard}, {Augereau}, {De Boer}, {Pueyo}, \\&\n  {Choquet}}]{Milli2015}\n{Milli}, J., {Mawet}, D., {Pinte}, C., {et~al.} 2015, \\aap, 577, A57\n\n\\bibitem[{Milli {et~al.}(2012)Milli, Mouillet, Lagrange, Boccaletti, Mawet,\n  Chauvin, \\& Bonnefoy}]{Milli2012}\nMilli, J., Mouillet, D., Lagrange, A.~M., {et~al.} 2012, Astronomy {\\&}\n  Astrophysics, 545, A111\n\n\\bibitem[{{Min} {et~al.}(2016){Min}, {Rab}, {Woitke}, {Dominik}, \\&\n  {M{\\'e}nard}}]{Min2016}\n{Min}, M., {Rab}, C., {Woitke}, P., {Dominik}, C., \\& {M{\\'e}nard}, F. 2016,\n  \\aap, 585, A13\n\n\\bibitem[{{Mo{\\'o}r} {et~al.}(2015{\\natexlab{a}}){Mo{\\'o}r}, {Henning},\n  {Juh{\\'a}sz}, {{\\'A}brah{\\'a}m}, {Balog}, {K{\\'o}sp{\\'a}l}, {Pascucci},\n  {Szab{\\'o}}, {Vavrek}, {Cur{\\'e}}, {Csengeri}, {Grady}, {G{\\\"u}sten}, \\&\n  {Kiss}}]{Moor2015b}\n{Mo{\\'o}r}, A., {Henning}, T., {Juh{\\'a}sz}, A., {et~al.} 2015{\\natexlab{a}},\n  \\apj, 814, 42\n\n\\bibitem[{{Mo{\\'o}r} {et~al.}(2015{\\natexlab{b}}){Mo{\\'o}r}, {K{\\'o}sp{\\'a}l},\n  {{\\'A}brah{\\'a}m}, {Apai}, {Balog}, {Grady}, {Henning}, {Juh{\\'a}sz}, {Kiss},\n  {Krivov}, {Pawellek}, \\& {Szab{\\'o}}}]{Moor2015}\n{Mo{\\'o}r}, A., {K{\\'o}sp{\\'a}l}, {\\'A}., {{\\'A}brah{\\'a}m}, P., {et~al.}\n  2015{\\natexlab{b}}, \\mnras, 447, 577\n\n\\bibitem[{{Morales} {et~al.}(2011){Morales}, {Rieke}, {Werner}, {Bryden},\n  {Stapelfeldt}, \\& {Su}}]{Morales2011}\n{Morales}, F.~Y., {Rieke}, G.~H., {Werner}, M.~W., {et~al.} 2011, \\apjl, 730,\n  L29\n\n\\bibitem[{{Mustill} \\& {Wyatt}(2009)}]{Mustill2009}\n{Mustill}, A.~J. \\& {Wyatt}, M.~C. 2009, \\mnras, 399, 1403\n\n\\bibitem[{Nesvold {et~al.}(2013)Nesvold, Kuchner, Rein, \\& Pan}]{Nesvold2013}\nNesvold, E.~R., Kuchner, M.~J., Rein, H., \\& Pan, M. 2013, The Astrophysical\n  Journal, 777, 144\n\n\\bibitem[{{Olofsson} {et~al.}(2013){Olofsson}, {Henning}, {Nielbock},\n  {Augereau}, {Juh{\\`a}sz}, {Oliveira}, {Absil}, \\& {Tamanai}}]{Olofsson2013}\n{Olofsson}, J., {Henning}, T., {Nielbock}, M., {et~al.} 2013, \\aap, 551, A134\n\n\\bibitem[{{Olofsson} {et~al.}(2012){Olofsson}, {Juh{\\'a}sz}, {Henning},\n  {Mutschke}, {Tamanai}, {Mo{\\'o}r}, \\& {{\\'A}brah{\\'a}m}}]{Olofsson2012}\n{Olofsson}, J., {Juh{\\'a}sz}, A., {Henning}, T., {et~al.} 2012, \\aap, 542, A90\n\n\\bibitem[{{Ott}(2010)}]{Ott2010}\n{Ott}, S. 2010, in Astronomical Society of the Pacific Conference Series, Vol.\n  434, Astronomical Data Analysis Software and Systems XIX, ed. Y.~{Mizumoto},\n  K.-I. {Morita}, \\& M.~{Ohishi}, 139\n\n\\bibitem[{{Owen} {et~al.}(2011){Owen}, {Ercolano}, \\& {Clarke}}]{Owen2011}\n{Owen}, J.~E., {Ercolano}, B., \\& {Clarke}, C.~J. 2011, \\mnras, 412, 13\n\n\\bibitem[{{Pavlov} {et~al.}(2008){Pavlov}, {M{\\\"o}ller-Nilsson}, {Feldt},\n  {Henning}, {Beuzit}, \\& {Mouillet}}]{Pavlov2008}\n{Pavlov}, A., {M{\\\"o}ller-Nilsson}, O., {Feldt}, M., {et~al.} 2008, in Society\n  of Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol.\n  7019, Society of Photo-Optical Instrumentation Engineers (SPIE) Conference\n  Series, 39\n\n\\bibitem[{Pawellek {et~al.}(2014)Pawellek, Krivov, Marshall, Montesinos,\n  Abraham, Moor, Bryden, \\& Eiroa}]{Pawellek2014}\nPawellek, N., Krivov, A.~V., Marshall, J.~P., {et~al.} 2014, The Astrophysical\n  Journal, 792, 65\n\n\\bibitem[{Pearce \\& Wyatt(2014)}]{Pearce2014}\nPearce, T.~D. \\& Wyatt, M.~C. 2014, Monthly Notices of the Royal Astronomical\n  Society, 443, 2541\n\n\\bibitem[{Pedregosa {et~al.}(2011)Pedregosa, Varoquaux, Gramfort, Michel,\n  Thirion, Grisel, Blondel, Prettenhofer, Weiss, Dubourg, Vanderplas, Passos,\n  Cournapeau, Brucher, Perrot, \\& Duchesnay}]{Pedregosa2011}\nPedregosa, F., Varoquaux, G., Gramfort, A., {et~al.} 2011, Journal of Machine\n  Learning Research, 12, 2825\n\n\\bibitem[{{Pilbratt} {et~al.}(2010){Pilbratt}, {Riedinger}, {Passvogel},\n  {Crone}, {Doyle}, {Gageur}, {Heras}, {Jewell}, {Metcalfe}, {Ott}, \\&\n  {Schmidt}}]{Pilbratt2010}\n{Pilbratt}, G.~L., {Riedinger}, J.~R., {Passvogel}, T., {et~al.} 2010, \\aap,\n  518, L1+\n\n\\bibitem[{Pinte {et~al.}(2008)Pinte, Padgett, M{\\'e}nard, Stapelfeldt,\n  Schneider, Olofsson, Pani{\\'c}, Augereau, Duch{\\^e}ne, Krist, Pontoppidan,\n  Perrin, Grady, Kessler-Silacci, van Dishoeck, Lommen, Silverstone, Hines,\n  Wolf, Blake, Henning, \\& Stecklum}]{Pinte2008}\nPinte, C., Padgett, D.~L., M{\\'e}nard, F., {et~al.} 2008, Astronomy {\\&}\n  Astrophysics, 489, 633\n\n\\bibitem[{{Poglitsch} {et~al.}(2010){Poglitsch}, {Waelkens}, {Geis},\n  {Feuchtgruber}, {Vandenbussche}, {Rodriguez}, {Krause}, {Renotte}, {van\n  Hoof}, {Saraceno}, {Cepa}, {Kerschbaum}, {Agn{\\`e}se}, {Ali}, {Altieri},\n  {Andreani}, {Augueres}, {Balog}, {Barl}, {Bauer}, {Belbachir}, {Benedettini},\n  {Billot}, {Boulade}, {Bischof}, {Blommaert}, {Callut}, {Cara}, {Cerulli},\n  {Cesarsky}, {Contursi}, {Creten}, {De Meester}, {Doublier}, {Doumayrou},\n  {Duband}, {Exter}, {Genzel}, {Gillis}, {Gr{\\\"o}zinger}, {Henning},\n  {Herreros}, {Huygen}, {Inguscio}, {Jakob}, {Jamar}, {Jean}, {de Jong},\n  {Katterloher}, {Kiss}, {Klaas}, {Lemke}, {Lutz}, {Madden}, {Marquet},\n  {Martignac}, {Mazy}, {Merken}, {Montfort}, {Morbidelli}, {M{\\\"u}ller},\n  {Nielbock}, {Okumura}, {Orfei}, {Ottensamer}, {Pezzuto}, {Popesso},\n  {Putzeys}, {Regibo}, {Reveret}, {Royer}, {Sauvage}, {Schreiber}, {Stegmaier},\n  {Schmitt}, {Schubert}, {Sturm}, {Thiel}, {Tofani}, {Vavrek}, {Wetzstein},\n  {Wieprecht}, \\& {Wiezorrek}}]{Poglitsch2010}\n{Poglitsch}, A., {Waelkens}, C., {Geis}, N., {et~al.} 2010, \\aap, 518, L2+\n\n\\bibitem[{{Ricarte} {et~al.}(2013){Ricarte}, {Moldvai}, {Hughes},\n  {Duch{\\^e}ne}, {Williams}, {Andrews}, \\& {Wilner}}]{Ricarte2013}\n{Ricarte}, A., {Moldvai}, N., {Hughes}, A.~M., {et~al.} 2013, \\apj, 774, 80\n\n\\bibitem[{Rodigas {et~al.}(2015)Rodigas, Stark, Weinberger, Debes, Hinz, Close,\n  Chen, Smith, Males, Skemer, Puglisi, Follette, Morzinski, Wu, Briguglio,\n  Esposito, Pinna, Riccardi, Schneider, \\& Xompero}]{Rodigas2015}\nRodigas, T.~J., Stark, C.~C., Weinberger, A., {et~al.} 2015, The Astrophysical\n  Journal, 798, 96\n\n\\bibitem[{{Schneider} {et~al.}(2014){Schneider}, {Grady}, {Hines}, {Stark},\n  {Debes}, {Carson}, {Kuchner}, {Perrin}, {Weinberger}, {Wisniewski},\n  {Silverstone}, {Jang-Condell}, {Henning}, {Woodgate}, {Serabyn},\n  {Moro-Martin}, {Tamura}, {Hinz}, \\& {Rodigas}}]{Schneider2014}\n{Schneider}, G., {Grady}, C.~A., {Hines}, D.~C., {et~al.} 2014, \\aj, 148, 59\n\n\\bibitem[{{Siess} {et~al.}(2000){Siess}, {Dufour}, \\& {Forestini}}]{Siess2000}\n{Siess}, L., {Dufour}, E., \\& {Forestini}, M. 2000, \\aap, 358, 593\n\n\\bibitem[{Soummer {et~al.}(2012)Soummer, Pueyo, \\& Larkin}]{Soummer2012}\nSoummer, R., Pueyo, L., \\& Larkin, J. 2012, The Astrophysical Journal, 755, L28\n\n\\bibitem[{Stark {et~al.}(2014)Stark, Schneider, Weinberger, Debes, Grady,\n  Jang-Condell, \\& Kuchner}]{Stark2014}\nStark, C.~C., Schneider, G., Weinberger, A.~J., {et~al.} 2014, The\n  Astrophysical Journal, 789, 58\n\n\\bibitem[{Su {et~al.}(2013)Su, Rieke, Malhotra, Stapelfeldt, Hughes, Bonsor,\n  Wilner, Balog, Watson, Werner, \\& Misselt}]{Su2013}\nSu, K. Y.~L., Rieke, G.~H., Malhotra, R., {et~al.} 2013, The Astrophysical\n  Journal, 763, 118\n\n\\bibitem[{{Taylor}(2005)}]{Taylor2005}\n{Taylor}, M.~B. 2005, in Astronomical Society of the Pacific Conference Series,\n  Vol. 347, Astronomical Data Analysis Software and Systems XIV, ed.\n  P.~{Shopbell}, M.~{Britton}, \\& R.~{Ebert}, 29\n\n\\bibitem[{{Thalmann} {et~al.}(2014){Thalmann}, {Mulders}, {Hodapp}, {Janson},\n  {Grady}, {Min}, {de Juan Ovelar}, {Carson}, {Brandt}, {Bonnefoy}, {McElwain},\n  {Leisenring}, {Dominik}, {Henning}, \\& {Tamura}}]{Thalmann2014}\n{Thalmann}, C., {Mulders}, G.~D., {Hodapp}, K., {et~al.} 2014, \\aap, 566, A51\n\n\\bibitem[{Thebault(2009)}]{Thebault2009}\nThebault, P. 2009, Astronomy {\\&} Astrophysics, 505, 1269\n\n\\bibitem[{{van Leeuwen}(2007)}]{2007}\n{van Leeuwen}, F. 2007, \\aap, 474, 653\n\n\\bibitem[{{Vigan} {et~al.}(2010){Vigan}, {Moutou}, {Langlois}, {Allard},\n  {Boccaletti}, {Carbillet}, {Mouillet}, \\& {Smith}}]{Vigan2010}\n{Vigan}, A., {Moutou}, C., {Langlois}, M., {et~al.} 2010, \\mnras, 407, 71\n\n\\bibitem[{{Wolf} \\& {Hillenbrand}(2005)}]{Wolf2005}\n{Wolf}, S. \\& {Hillenbrand}, L.~A. 2005, Computer Physics Communications, 171,\n  208\n\n\\bibitem[{{Wyatt}(2006)}]{Wyatt2006}\n{Wyatt}, M.~C. 2006, \\apj, 639, 1153\n\n\\bibitem[{{Wyatt}(2008)}]{Wyatt2008}\n{Wyatt}, M.~C. 2008, \\araa, 46, 339\n\n\\bibitem[{{Wyatt} {et~al.}(1999){Wyatt}, {Dermott}, {Telesco}, {Fisher},\n  {Grogan}, {Holmes}, \\& {Pi{\\~n}a}}]{Wyatt1999}\n{Wyatt}, M.~C., {Dermott}, S.~F., {Telesco}, C.~M., {et~al.} 1999, \\apj, 527,\n  918\n\n\\end{thebibliography}\n\n\\appendix\n\n\n\n\\section[]{Description of the code}\\label{app:DDIT}\n\n\\subsection{Computing the spectral energy distribution}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{DDiT_schema.pdf}\n\\caption{Schematic view of how a disk, seen edge-on, is described in the DDiT code. Different shells ($n_{\\mathrm{r}} = 10$) are represented in different fading colours, while dust belts are represented without transparency (see text for details).}\n\\label{fig:ddit}\n\\end{figure}\n\nThe DDiT code is mostly based on the code already described in \\citet[which was based on the ``Debris disk radiative transfer simulation tool'' described in \\citealt{Wolf2005}]{Olofsson2012,Olofsson2013}. However, as opposed to the work presented in \\citet{Olofsson2012,Olofsson2013}, only one dust species per model is considered in this study. The dust properties are defined by the optical constants, the density ($\\rho$), the minimum and maximum grain sizes ($s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, respectively), and the slope $p$ of the grain size distribution (d$n(s) \\propto s^p \\mathrm{d}s$, $p < 0$). The absorption efficiencies, $Q_{\\mathrm{abs}} (\\lambda, s)$, are computed using the Mie theory for $n_{\\mathrm{g}} = 100$ grain sizes logarithmically spaced between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$.\n\nConcerning the disk model itself, it is defined by the following parameters: a reference radius $r_0$, two power-law indexes $\\alpha_{\\mathrm{in}} > 0$ and $\\alpha_{\\mathrm{out}} < 0$, the opening angle of the disk ($\\psi = \\mathrm{arctan}(h/r)$, where $h$ is the height from the midplane), and the total dust mass $M_{\\mathrm{disk}}$. We first define the inner and outer radii of the disk by finding $r_{\\mathrm{in}} = r_0 \\times C^{(1/\\alpha_{\\mathrm{in}})}$ and $r_{\\mathrm{out}} = r_0 \\times C^{(1/\\alpha_{\\mathrm{out}})}$, where $C$ is a ``threshold'' value for the minimum density that we choose to be $C = 10^{-2}$. The code is 1D and the disk is divided into $n_{\\mathrm{r}}$ spherical shells centered at $r_{\\mathrm{j}}$, logarithmically spaced between $r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$ (see Figure\\,\\ref{fig:ddit}).\n\nThe dust number density distribution for the shell at distance $r_{\\mathrm{j}}$ and the grain size $s_{\\mathrm{k}}$, $N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$, is defined as\n\n", "itemtype": "equation", "pos": 73907, "prevtext": "\nwhere $m$ is the mass of the CO molecule, $d_{\\star}$ the distance of the star, $\\nu_{2-1}$ the frequency of the transition, $A_{2-1}$ the Einstein coefficient\\footnote{Taken from the SPLATALOGUE catalog at \\url{http://www.cv.nrao.edu/php/splat/}}, $x_{2-1}$ the fractional population of the upper level, and $S_{2-1}$ the observed integrated line flux. The fractional level was calculated assuming local thermal equilibrium, using the Boltzmann equation, with a temperature of $20$\\,K (as discussed in \\citealp{Moor2015b}, $M_{\\mathrm{CO}}$ is not strongly dependent on the temperature). $S_{2-1}$ was computed from the spectrum as $S_{\\mathrm{rms}}\\Delta v \\sqrt N$, where $\\Delta v$ is the channel velocity width, $N$ the number of channels over a width of $15$\\,km.s$^{-1}$ (centered at the Local Standard of Rest velocity, $v_{\\mathrm{LSR}}$), and $S_{\\mathrm{rms}}$ the standard deviation of the spectrum within that velocity range. From the heliocentric radial velocity of $22.5$\\,km.s$^{-1}$ (\\citealp{Desidera2011}), we obtain a $v_{\\mathrm{LSR}}$ of $3.68$\\,km.s$^{-1}$. Assuming optically thin gas, this leads to an upper limit of $6.9\\times 10^{-7}$\\,M$_{\\oplus}$. As discussed in \\citet{Matra2015}, the LTE hypothesis may not hold in low-density environment and our upper limit could underestimate the CO gas mass. In the ISM the CO/H$_2$ abundance is $10^{-4}$, and with our inferred dust mass of $\\sim 0.37$\\,M$_{\\oplus}$ (for our grain size distribution), this would lead to a gas to dust ratio much smaller than unity. However, it is unlikely that this ratio will remain the same in a circumstellar disk because of effects such as photo-dissociation. Overall, with the available observations leading to a non-detection, and given the several assumptions made (LTE, CO/H$_2$ ratio) we can hardly conclude on the gas to dust ratio on the debris disk. This question should be addressed by future, deeper CO observations (or other species than the CO molecule).\n\n\\subsection{Stirring of the planetesimals}\\label{sec:stirring}\n\nIn the past years, theoretical works have aimed at characterizing the time evolution of debris disks (e.g., \\citealp{Kenyon2006,Kenyon2008}). One of the purpose of these studies being to better understand the growth of planetesimals to sizes of about a thousand km, in the framework of terrestrial planetary formation. It is believed that once such large bodies have been formed, they will stir the population of smaller planetesimals. The stirring will increase the relative velocities of these planetesimals and increase their chances of collisions, therefore initiating a collisional cascade. According to these models, collisions between planetesimals become destructive only once a Pluto-sized object is formed. Since the timescale for the growth of planetesimals scales with the distance $r$ to the star, self-stirring is thought to be an inside-out process. Here, we follow a similar approach as the one described in \\citet{Moor2015} who studied several debris disks spatially resolved with the {\\it Herschel} observatory. They examined if the disks in their sample are consistent with a self-stirring scenario. To achieve this, they compared the timescale for forming a 1000\\,km-sized object in a self-stirred debris disk with the age of the stars. To quantify this timescale $t_{\\mathrm{1000}}$ (in Myr), we used Eqn.\\,41 from \\citet{Kenyon2008}, which we recall below,\n\n", "index": 17, "text": "\\begin{equation}\n  t_{\\mathrm{1000}} = 145x_{\\mathrm{m}}^{-1.15} (r/80)^3 (2M_{\\odot} / M_{\\star})^{3/2}\\,\\mathrm{[Myr]},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"t_{\\mathrm{1000}}=145x_{\\mathrm{m}}^{-1.15}(r/80)^{3}(2M_{\\odot}/M_{\\star})^{3%&#10;/2}\\,\\mathrm{[Myr]},\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mn>1000</mn></msub><mo>=</mo><mrow><mn>145</mn><mo>⁢</mo><msubsup><mi>x</mi><mi mathvariant=\"normal\">m</mi><mrow><mo>-</mo><mn>1.15</mn></mrow></msubsup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>r</mi><mo>/</mo><mn>80</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>M</mi><mo>⊙</mo></msub></mrow><mo>/</mo><msub><mi>M</mi><mo>⋆</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>Myr</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $N_{\\mathrm{s}}(s_{\\mathrm{k}})$ is a function depending solely on the grain size (similarly to Eqn.\\,2 of \\citealp{Dullemond2008})\n\n", "itemtype": "equation", "pos": 117452, "prevtext": "\nwhere $r$ is the distance of the dust belt, and $x_{\\mathrm{m}}$ is a scaling factor to parametrize the disk's initial surface density (the higher, the more massive). \\citet{Mustill2009} argued that $x_{\\mathrm{m}}$ values larger than 10 are highly unlikely as the initial disk would have been gravitationally unstable. Assuming that the timescale for the growth of the planetesimals is the age of the system (i.e., $t_{\\mathrm{1000}} = 40$\\,Myr), we find that $x_{\\mathrm{m}}$ should be of the order of about 3.3 (for $r = 61$\\,AU). This value would suggest that either the primordial disk was $\\sim$\\,3 times more massive than the minimum-mass solar nebula, or that other sources of stirring (e.g., induced by a planet) have to be taken into consideration for this system. Debris disks with known planets, such as the ones studied in \\citet[][e.g., HR\\,8799, $\\beta$\\,Pictoris, HD\\,95086]{Moor2015}, have much larger $x_{\\mathrm{m}}$ values ($\\geq 10$), while most of the debris disks usually have values for $x_{\\mathrm{m}}$ smaller than $3$. It is therefore reasonable to assume that the disk around HD\\,61005 is bright because self-stirring by planetesimals has recently started. Based on the distance of the dust belt and the age of the system, it is not necessary to invoke the presence of a massive planet to explain what is currently observed.\n\n\\subsection{An eccentric and asymmetric disk}\n\nMassive planets are often invoked to explain the eccentricity of a debris disk, as the planet may shepherd it. The case of Fomalhaut is a good example of such studies. The disk shows an eccentricity comparable to the one of HD\\,61005 ($e \\sim 0.11\\pm0.1$, \\citealp{Kalas2005}) and a candidate companion was detected by \\citet{Kalas2008}. Studies such as the one of \\citet{Beust2014} investigated in details the possible interactions between the planet and the planetesimal in the disk. In the past two decades, many numerical works have been led to investigate how planets can shape debris disks (e.g., \\citealp{Wyatt1999,Wyatt2006,Nesvold2013,Pearce2014,Faramaz2014}), or how the planetesimals evolve within their mutual gravitational interactions (e.g., \\citealp{Kral2015,Jackson2014}).\n\n\\subsubsection{Possible planet-disk interactions ?}\n\nVia secular interactions, an eccentric planet can shape the debris disk. Because of differential precession, the planet-disk interactions can result in a (short-lived) spiral arm (\\citealp{Wyatt1999}). Then, when taking into account the effect of collisions in the disk, the spiral will quickly dissipate (\\citealp{Nesvold2013}), and the disk will become eccentric (and apse-aligned with the planet's orbit). Because of the eccentricity, the disk is expected to be brighter at the pericenter (the so-called pericenter glow effect). Nonetheless, this may not be what is happening in the disk around HD\\,61005. First, we did not detect any point sources neither in the $H$ nor $K$ band ADI datasets, even with their large parallactic rotations. The exact detection limits on the masses of possible planets will be published in the survey paper of the SPHERE consortium, but preliminary tests using the \\texttt{PynPoint} package (\\citealp{Amara2012}) shows that we should have been able to detect planets with a contrast of about $\\sim$\\,10\\,mag in the near-IR. At an age of about 40\\,Myr, we can therefore rule out any planets with a mass larger than $\\sim$\\,7 Jupiter mass at a distance of $0.2^{\\prime\\prime}$. Second, as already discussed in \\citet[][and confirmed in this study]{Buenzli2010}, the eccentricity of the disk is not sufficient for the pericenter glow to solely explain the observed brightness asymmetry. Our modeling results suggest that there is a $\\sim$\\,50\\% reduction in density between the pericenter and the apocenter, with a peak density closer to the observer ($\\Phi_{\\mathrm{e}} \\sim \\Phi_{\\eta} \\sim 130^{\\circ}$). Given that both $\\Phi_{\\mathrm{e}}$ and $\\Phi_{\\eta}$ are free parameters and that their most probable values are so close to each other, it strongly points towards an increase of the dust density distribution at the pericenter of the eccentric disk. Interestingly, the simulations of \\citet{Pearce2014} show the opposite effect: the density is lower at the pericenter when including an eccentric planet in the disk (the particles spend more time at the apocenter than at the pericenter).\n\nIf a planet were to be detected (at other wavelengths or with other facilities), it would be interesting to confront our modeling results with the orbital parameters of the planet. But in the following, we will hypothesize that no massive planet was formed around HD\\,61005 and we will try to explain the inferred morphology of the disk under this assumption.\n\n\\subsubsection{The impact of gas in a debris disk}\n\n\\citet{Lyra2013} showed that narrow, eccentric debris disks can be the consequence of the presence of gas. While debris disks are generally thought of as depleted of gas, several recent studies have demonstrated it is not necessarily the case, even at ages as old as a few tens of Myr (e.g., \\citealp{Hughes2008,Dent2014,Kospal2013,Moor2015b}). \\citet{Lyra2013} suggested that the dust grains can heat up the surrounding gas, via photoelectric heating. This will locally increase the gas pressure and since the grains follow the pressure gradient, the pressure maximum will concentrate them even further. At the end, the disk may appear as narrow and eccentric, even though no planets are shaping it (although the original disk must be narrow). In Section\\,\\ref{sec:CO}, we concluded that the gas to dust ratio remains poorly constrained because of the (relatively strong) assumptions we made (LTE, grain size distribution, CO/H$_2$ abundance ratio). Overall, this scenario may be a viable solution to explain our findings, but cannot be verified at the moment (the azimuthal density variation would have to be addressed as well).\n\n\\subsubsection{The aftermath of a collision between Pluto-sized bodies ?}\n\nAn alternative possibility would be that we are witnessing an impact between two Pluto-sized bodies in the debris disk. This solution is mostly interesting because we find a peak of density at the pericenter of a slightly eccentric disk. In Section\\,\\ref{sec:stirring}, we concluded that self-stirring by massive planetesimals may be taking place in the 40\\,Myr old debris disk. At this age, and a radius of 60\\,AU, a few massive oligarchs may have been formed and are disrupting the orbits of other planetesimals. The collisional cross sections of these bodies would have increased along with the probabilities of intercepting each others' orbits. Numerical studies of such impacts (e.g., \\citealp{Jackson2014} and \\citealp{Kral2015}) suggest that our results may be compatible with the scenario of an impact between two massive bodies. Such a collision would release significant amount of debris, and all of them would have to pass through the same location where the collision initially occurred. This would enhance the density, as well as the chances of subsequent collisions in this particular region of the disk. The eccentricity (and complexity) of the resulting disk would depend on the eccentricity of the initial parent body. The debris disk can maintain this asymmetry for about 1\\,000 orbital periods ($\\sim 0.45$\\,Myr at 60\\,AU), according to the work of \\citet{Jackson2014}. A comparable explanation was proposed by \\citet{Stark2014} for the disk around HD\\,181327, for which the HST images show an azimuthal variation of the dust density distribution. The main difference between the two debris disks being that HD\\,181327 is much younger than HD\\,61005 (12\\,Myr versus 40\\,Myr), while the dust belt is located slightly farther away (hence self-stirring may not be happening yet). Overall, if our modeling and interpretation of the multi-wavelength observations of the Moth hold, it would suggest that massive, Pluto-sized, bodies can still be formed at a large distance from the star at an age of $\\sim 40$\\,Myr. This could be the onset of \\textit{in situ} super-Earth formation, as described in \\citet{Kenyon2015a}.\n\nThe presence of spatially separated belts (inner and outer belts) is often discussed in the context of planet-disk interactions (e.g., \\citealp{Su2013}). Massive planets may scatter away any close-by debris, hence opening a dust-free region in the disk. Planets may also be able to scatter debris from the outer regions and send them inwards, which would result in a bi-modal distribution of the dust (e.g., \\citealp{Bonsor2012}). In the case of HD\\,61005, we do not have strong constraints on the location of the inner belt. But given that the evolution of a debris disk is an inside-out process (\\citealp{Kenyon2008}), it is unlikely the inner belt is primordial. But the age of the star, the inner regions should already have been depleted of any detectable amount of small dust grains. Still assuming that there are no massive planets around HD\\,61005, is it possible to reconcile the presence of an analog of the asteroid belt with the above interpretation ? If it is indeed the case that a few oligarchs have formed in the main belt at 60\\,AU, the disk would be in an active and chaotic state. Some of these massive bodies may have collided in the main belt, but some may have scattered debris inwards. However, simulations such as the ones presented in \\citet{Jackson2014} and \\citet{Kral2015} do not display cleared gaps. Consequently, under our assumption that there are no giant planets, it seems that our interpretation of the dynamical evolution of the outer regions is not directly related with what is taking place in the inner regions. It may well be that telluric planets have formed in the inner regions and further investigation remain necessary to better constrain the location of the innermost belt.\n\n\n\n\n\n\n\n\\section{Conclusion}\\label{sec:conclusion}\n\nIn this study, we presented new VLT/SPHERE and ALMA observations of the debris disk around the 40\\,Myr old solar-type star HD\\,61005. We modeled both the radial and azimuthal distribution of the dust grains. We find that the disk is slightly eccentric ($e \\sim 0.1$), with a dust density twice smaller at the apocenter compared to the pericenter. We confirm that the eccentricity of the disk is not sufficient to explain the known brightness asymmetry. Thanks to the multi-wavelength analysis, we highlight a possible radial segregation of the grain size distribution, since the disk appears more extended at near-IR wavelengths compared to far-IR and mm wavelengths. The parent planetesimals are confined within a narrow belt (with a semi-major axis of about $61$\\,AU), while small dust grains (or dust aggregates) would be blown out by radiation pressure. No CO gas was detected with the ALMA observations and we did not detect any giant planets around the star. We propose that the inferred morphology of the disk could be the aftermath of collision(s) between Pluto-sized bodies in the main belt. The debris disk may be bright because self-stirring recently started to become significant in the belt, and it triggered a massive collision. The location of the collision became a pinch point where all debris must go through at each orbit, hence locally increasing the dust density and the chances of subsequent collisions. It may well be the early phases of the formation of super-Earth at large distances from the star. Finally, the presence of an inner belt would be consistent with the modeling of the SED, and we conclude its presence and dynamical evolution is unrelated to the evolution of the outer belt.\n\n\n\n\n\\begin{acknowledgements}\nThis paper makes use of the following ALMA data: ADS/JAO.ALMA 2012.1.00437.S. ALMA is a partnership of ESO (representing its member states), NSF (USA) and NINS (Japan), together with NRC (Canada), NSC and ASIAA (Taiwan), and KASI (Republic of Korea), in cooperation with the Republic of Chile. The Joint ALMA Observatory is operated by ESO, AUI/NRAO and NAOJ. J. Olofsson, H. Avenhaus, C. Caceres, H. Canovas, M. R. Schreiber, A. Bayo, and S. Casassus acknowledge support from the Millennium Nucleus RC130007 (Chilean Ministry of Economy). H. Avenhaus acknowledges support from FONDECYT 2015 Postdoctoral Grant 3150643, C. Caceres the support from CONICYT FONDECYT grant 3140592, H. Canovas the support from ALMA/CONICYT (grants 31100025 and 31130027), and A. Bayo the financial support from the Proyecto Fondecyt Iniciaci\\'on 11140572. This work was supported by the Momentum grant of the MTA CSFK Lend\\\"ulet Disk Research Group. A. Mo\\'or acknowledges support from the Bolyai Research Fellowship of the Hungarian Academy of Sciences. J. Olofsson would like to thank Daniel Foreman-Mackey for his help with the parallelization of the code with \\texttt{emcee} and Mark Booth for valuable discussions about ALMA data. This research made use of Astropy, a community-developed core Python package for Astronomy (Astropy Collaboration, 2013). This research has made use of the SIMBAD database (operated at CDS, Strasbourg, France). The authors have used the TOPCAT software (\\citealp{Taylor2005}) in this work.\n\\end{acknowledgements}\n\n\\bibliographystyle{aa}\n\\begin{thebibliography}{98}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Alexander} {et~al.}(2006){Alexander}, {Clarke}, \\&\n  {Pringle}}]{Alexander2006}\n{Alexander}, R.~D., {Clarke}, C.~J., \\& {Pringle}, J.~E. 2006, \\mnras, 369, 216\n\n\\bibitem[{Amara \\& Quanz(2012)}]{Amara2012}\nAmara, A. \\& Quanz, S.~P. 2012, Monthly Notices of the Royal Astronomical\n  Society, 427, 948\n\n\\bibitem[{{Augereau} {et~al.}(1999){Augereau}, {Lagrange}, {Mouillet},\n  {Papaloizou}, \\& {Grorod}}]{Augereau1999}\n{Augereau}, J.~C., {Lagrange}, A.~M., {Mouillet}, D., {Papaloizou}, J.~C.~B.,\n  \\& {Grorod}, P.~A. 1999, \\aap, 348, 557\n\n\\bibitem[{{Aumann} {et~al.}(1984){Aumann}, {Beichman}, {Gillett}, {de Jong},\n  {Houck}, {Low}, {Neugebauer}, {Walker}, \\& {Wesselius}}]{Aumann1984}\n{Aumann}, H.~H., {Beichman}, C.~A., {Gillett}, F.~C., {et~al.} 1984, \\apjl,\n  278, L23\n\n\\bibitem[{{Avenhaus} {et~al.}(2014){Avenhaus}, {Quanz}, {Schmid}, {Meyer},\n  {Garufi}, {Wolf}, \\& {Dominik}}]{Avenhaus2014}\n{Avenhaus}, H., {Quanz}, S.~P., {Schmid}, H.~M., {et~al.} 2014, \\apj, 781, 87\n\n\\bibitem[{{Ballering} {et~al.}(2013){Ballering}, {Rieke}, {Su}, \\&\n  {Montiel}}]{Ballering2013}\n{Ballering}, N.~P., {Rieke}, G.~H., {Su}, K.~Y.~L., \\& {Montiel}, E. 2013,\n  \\apj, 775, 55\n\n\\bibitem[{{Baraffe} {et~al.}(2015){Baraffe}, {Homeier}, {Allard}, \\&\n  {Chabrier}}]{Baraffe2015}\n{Baraffe}, I., {Homeier}, D., {Allard}, F., \\& {Chabrier}, G. 2015, \\aap, 577,\n  A42\n\n\\bibitem[{{Bayo} {et~al.}(2008){Bayo}, {Rodrigo}, {Barrado Y Navascu{\\'e}s},\n  {Solano}, {Guti{\\'e}rrez}, {Morales-Calder{\\'o}n}, \\& {Allard}}]{Bayo2008}\n{Bayo}, A., {Rodrigo}, C., {Barrado Y Navascu{\\'e}s}, D., {et~al.} 2008, \\aap,\n  492, 277\n\n\\bibitem[{{Bendo} {et~al.}(2013){Bendo}, {Griffin}, {Bock}, {Conversi},\n  {Dowell}, {Lim}, {Lu}, {North}, {Papageorgiou}, {Pearson}, {Pohlen},\n  {Polehampton}, {Schulz}, {Shupe}, {Sibthorpe}, {Spencer}, {Swinyard},\n  {Valtchanov}, \\& {Xu}}]{Bendo2013}\n{Bendo}, G.~J., {Griffin}, M.~J., {Bock}, J.~J., {et~al.} 2013, \\mnras, 433,\n  3062\n\n\\bibitem[{{Benisty} {et~al.}(2015){Benisty}, {Juhasz}, {Boccaletti},\n  {Avenhaus}, {Milli}, {Thalmann}, {Dominik}, {Pinilla}, {Buenzli}, {Pohl},\n  {Beuzit}, {Birnstiel}, {de Boer}, {Bonnefoy}, {Chauvin}, {Christiaens},\n  {Garufi}, {Grady}, {Henning}, {Huelamo}, {Isella}, {Langlois}, {M{\\'e}nard},\n  {Mouillet}, {Olofsson}, {Pantin}, {Pinte}, \\& {Pueyo}}]{Benisty2015}\n{Benisty}, M., {Juhasz}, A., {Boccaletti}, A., {et~al.} 2015, \\aap, 578, L6\n\n\\bibitem[{{Beust} {et~al.}(2014){Beust}, {Augereau}, {Bonsor}, {Graham},\n  {Kalas}, {Lebreton}, {Lagrange}, {Ertel}, {Faramaz}, \\&\n  {Th{\\'e}bault}}]{Beust2014}\n{Beust}, H., {Augereau}, J.-C., {Bonsor}, A., {et~al.} 2014, \\aap, 561, A43\n\n\\bibitem[{{Beuzit} {et~al.}(2008){Beuzit}, {Feldt}, {Dohlen}, {Mouillet},\n  {Puget}, {Wildi}, {Abe}, {Antichi}, {Baruffolo}, {Baudoz}, {Boccaletti},\n  {Carbillet}, {Charton}, {Claudi}, {Downing}, {Fabron}, {Feautrier},\n  {Fedrigo}, {Fusco}, {Gach}, {Gratton}, {Henning}, {Hubin}, {Joos}, {Kasper},\n  {Langlois}, {Lenzen}, {Moutou}, {Pavlov}, {Petit}, {Pragt}, {Rabou}, {Rigal},\n  {Roelfsema}, {Rousset}, {Saisse}, {Schmid}, {Stadler}, {Thalmann}, {Turatto},\n  {Udry}, {Vakili}, \\& {Waters}}]{Beuzit2008}\n{Beuzit}, J.-L., {Feldt}, M., {Dohlen}, K., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  18\n\n\\bibitem[{{Boccaletti} {et~al.}(2015){Boccaletti}, {Thalmann}, {Lagrange},\n  {Janson}, {Augereau}, {Schneider}, {Milli}, {Grady}, {Debes}, {Langlois},\n  {Mouillet}, {Henning}, {Dominik}, {Maire}, {Beuzit}, {Carson}, {Dohlen},\n  {Engler}, {Feldt}, {Fusco}, {Ginski}, {Girard}, {Hines}, {Kasper}, {Mawet},\n  {M{\\'e}nard}, {Meyer}, {Moutou}, {Olofsson}, {Rodigas}, {Sauvage},\n  {Schlieder}, {Schmid}, {Turatto}, {Udry}, {Vakili}, {Vigan}, {Wahhaj}, \\&\n  {Wisniewski}}]{Boccaletti2015}\n{Boccaletti}, A., {Thalmann}, C., {Lagrange}, A.-M., {et~al.} 2015, \\nat, 526,\n  230\n\n\\bibitem[{Bonsor \\& Wyatt(2012)}]{Bonsor2012}\nBonsor, A. \\& Wyatt, M.~C. 2012, Monthly Notices of the Royal Astronomical\n  Society, 420, 2990\n\n\\bibitem[{{Buenzli} {et~al.}(2010){Buenzli}, {Thalmann}, {Vigan}, {Boccaletti},\n  {Chauvin}, {Augereau}, {Meyer}, {M{\\'e}nard}, {Desidera}, {Messina},\n  {Henning}, {Carson}, {Montagnier}, {Beuzit}, {Bonavita}, {Eggenberger},\n  {Lagrange}, {Mesa}, {Mouillet}, \\& {Quanz}}]{Buenzli2010}\n{Buenzli}, E., {Thalmann}, C., {Vigan}, A., {et~al.} 2010, \\aap, 524, L1\n\n\\bibitem[{{Burns} {et~al.}(1979){Burns}, {Lamy}, \\& {Soter}}]{Burns1979}\n{Burns}, J.~A., {Lamy}, P.~L., \\& {Soter}, S. 1979, \\icarus, 40, 1\n\n\\bibitem[{{Canovas} {et~al.}(2015){Canovas}, {M{\\'e}nard}, {de Boer}, {Pinte},\n  {Avenhaus}, \\& {Schreiber}}]{Canovas2015}\n{Canovas}, H., {M{\\'e}nard}, F., {de Boer}, J., {et~al.} 2015, \\aap, 582, L7\n\n\\bibitem[{{Canovas} {et~al.}(2011){Canovas}, {Rodenhuis}, {Jeffers}, {Min}, \\&\n  {Keller}}]{Canovas2011}\n{Canovas}, H., {Rodenhuis}, M., {Jeffers}, S.~V., {Min}, M., \\& {Keller}, C.~U.\n  2011, \\aap, 531, A102\n\n\\bibitem[{{Casagrande} {et~al.}(2011){Casagrande}, {Sch{\\\"o}nrich}, {Asplund},\n  {Cassisi}, {Ram{\\'{\\i}}rez}, {Mel{\\'e}ndez}, {Bensby}, \\&\n  {Feltzing}}]{Casagrande2011}\n{Casagrande}, L., {Sch{\\\"o}nrich}, R., {Asplund}, M., {et~al.} 2011, \\aap, 530,\n  A138\n\n\\bibitem[{{Castelli} {et~al.}(1997){Castelli}, {Gratton}, \\&\n  {Kurucz}}]{Castelli1997}\n{Castelli}, F., {Gratton}, R.~G., \\& {Kurucz}, R.~L. 1997, \\aap, 318, 841\n\n\\bibitem[{{Chen} {et~al.}(2014){Chen}, {Mittal}, {Kuchner}, {Forrest}, {Lisse},\n  {Manoj}, {Sargent}, \\& {Watson}}]{Chen2014}\n{Chen}, C.~H., {Mittal}, T., {Kuchner}, M., {et~al.} 2014, \\apjs, 211, 25\n\n\\bibitem[{{Claudi} {et~al.}(2008){Claudi}, {Turatto}, {Gratton}, {Antichi},\n  {Bonavita}, {Bruno}, {Cascone}, {De Caprio}, {Desidera}, {Giro}, {Mesa},\n  {Scuderi}, {Dohlen}, {Beuzit}, \\& {Puget}}]{Claudi2008}\n{Claudi}, R.~U., {Turatto}, M., {Gratton}, R.~G., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  3\n\n\\bibitem[{{De Silva} {et~al.}(2013){De Silva}, {D'Orazi}, {Melo}, {Torres},\n  {Gieles}, {Quast}, \\& {Sterzik}}]{DeSilva2013}\n{De Silva}, G.~M., {D'Orazi}, V., {Melo}, C., {et~al.} 2013, \\mnras, 431, 1005\n\n\\bibitem[{{Dent} {et~al.}(2014){Dent}, {Wyatt}, {Roberge}, {Augereau},\n  {Casassus}, {Corder}, {Greaves}, {de Gregorio-Monsalvo}, {Hales}, {Jackson},\n  {Hughes}, {Lagrange}, {Matthews}, \\& {Wilner}}]{Dent2014}\n{Dent}, W.~R.~F., {Wyatt}, M.~C., {Roberge}, A., {et~al.} 2014, Science, 343,\n  1490\n\n\\bibitem[{{Desidera} {et~al.}(2011){Desidera}, {Covino}, {Messina}, {D'Orazi},\n  {Alcal{\\'a}}, {Brugaletta}, {Carson}, {Lanzafame}, \\&\n  {Launhardt}}]{Desidera2011}\n{Desidera}, S., {Covino}, E., {Messina}, S., {et~al.} 2011, \\aap, 529, A54\n\n\\bibitem[{{Dohlen} {et~al.}(2008){Dohlen}, {Langlois}, {Saisse}, {Hill},\n  {Origne}, {Jacquet}, {Fabron}, {Blanc}, {Llored}, {Carle}, {Moutou}, {Vigan},\n  {Boccaletti}, {Carbillet}, {Mouillet}, \\& {Beuzit}}]{Dohlen2008}\n{Dohlen}, K., {Langlois}, M., {Saisse}, M., {et~al.} 2008, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 7014,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  3\n\n\\bibitem[{{Dohnanyi}(1969)}]{Dohnanyi1969}\n{Dohnanyi}, J.~S. 1969, \\jgr, 74, 2531\n\n\\bibitem[{{Dominik} \\& {Decin}(2003)}]{Dominik2003}\n{Dominik}, C. \\& {Decin}, G. 2003, \\apj, 598, 626\n\n\\bibitem[{{Dorschner} {et~al.}(1995){Dorschner}, {Begemann}, {Henning},\n  {J{\\\"a}ger}, \\& {Mutschke}}]{Dorschner1995}\n{Dorschner}, J., {Begemann}, B., {Henning}, T., {J{\\\"a}ger}, C., \\& {Mutschke},\n  H. 1995, \\aap, 300, 503\n\n\\bibitem[{{Dullemond} \\& {Dominik}(2008)}]{Dullemond2008}\n{Dullemond}, C.~P. \\& {Dominik}, C. 2008, \\aap, 487, 205\n\n\\bibitem[{{Eiroa} {et~al.}(2013){Eiroa}, {Marshall}, {Mora}, {Montesinos},\n  {Absil}, {Augereau}, {Bayo}, {Bryden}, {Danchi}, {del Burgo}, {Ertel},\n  {Fridlund}, {Heras}, {Krivov}, {Launhardt}, {Liseau}, {L{\\\"o}hne},\n  {Maldonado}, {Pilbratt}, {Roberge}, {Rodmann}, {Sanz-Forcada}, {Solano},\n  {Stapelfeldt}, {Th{\\'e}bault}, {Wolf}, {Ardila}, {Ar{\\'e}valo}, {Beichmann},\n  {Faramaz}, {Gonz{\\'a}lez-Garc{\\'{\\i}}a}, {Guti{\\'e}rrez}, {Lebreton},\n  {Mart{\\'{\\i}}nez-Arn{\\'a}iz}, {Meeus}, {Montes}, {Olofsson}, {Su}, {White},\n  {Barrado}, {Fukagawa}, {Gr{\\\"u}n}, {Kamp}, {Lorente}, {Morbidelli},\n  {M{\\\"u}ller}, {Mutschke}, {Nakagawa}, {Ribas}, \\& {Walker}}]{Eiroa2013}\n{Eiroa}, C., {Marshall}, J.~P., {Mora}, A., {et~al.} 2013, \\aap, 555, A11\n\n\\bibitem[{{Elliott} {et~al.}(2014){Elliott}, {Bayo}, {Melo}, {Torres},\n  {Sterzik}, \\& {Quast}}]{Elliott2014}\n{Elliott}, P., {Bayo}, A., {Melo}, C.~H.~F., {et~al.} 2014, \\aap, 568, A26\n\n\\bibitem[{{Faramaz} {et~al.}(2014){Faramaz}, {Beust}, {Th{\\'e}bault},\n  {Augereau}, {Bonsor}, {del Burgo}, {Ertel}, {Marshall}, {Milli},\n  {Montesinos}, {Mora}, {Bryden}, {Danchi}, {Eiroa}, {White}, \\&\n  {Wolf}}]{Faramaz2014}\n{Faramaz}, V., {Beust}, H., {Th{\\'e}bault}, P., {et~al.} 2014, \\aap, 563, A72\n\n\\bibitem[{Foreman-Mackey {et~al.}(2014)Foreman-Mackey, Price-Whelan, Ryan,\n  Emily, Smith, Barbary, Hogg, \\& Brewer}]{ForemanMackey2014}\nForeman-Mackey, D., Price-Whelan, A., Ryan, G., {et~al.} 2014, triangle.py\n  v0.1.1\n\n\\bibitem[{Gelman \\& Rubin(1992)}]{Gelman1992}\nGelman, A. \\& Rubin, D.~B. 1992, Statist. Sci., 7, 457\n\n\\bibitem[{{Griffin} {et~al.}(2010){Griffin}, {Abergel}, {Abreu}, {Ade},\n  {Andr{\\'e}}, {Augueres}, {Babbedge}, {Bae}, {Baillie}, {Baluteau}, {Barlow},\n  {Bendo}, {Benielli}, {Bock}, {Bonhomme}, {Brisbin}, {Brockley-Blatt},\n  {Caldwell}, {Cara}, {Castro-Rodriguez}, {Cerulli}, {Chanial}, {Chen},\n  {Clark}, {Clements}, {Clerc}, {Coker}, {Communal}, {Conversi}, {Cox},\n  {Crumb}, {Cunningham}, {Daly}, {Davis}, {de Antoni}, {Delderfield}, {Devin},\n  {di Giorgio}, {Didschuns}, {Dohlen}, {Donati}, {Dowell}, {Dowell}, {Duband},\n  {Dumaye}, {Emery}, {Ferlet}, {Ferrand}, {Fontignie}, {Fox}, {Franceschini},\n  {Frerking}, {Fulton}, {Garcia}, {Gastaud}, {Gear}, {Glenn}, {Goizel},\n  {Griffin}, {Grundy}, {Guest}, {Guillemet}, {Hargrave}, {Harwit}, {Hastings},\n  {Hatziminaoglou}, {Herman}, {Hinde}, {Hristov}, {Huang}, {Imhof}, {Isaak},\n  {Israelsson}, {Ivison}, {Jennings}, {Kiernan}, {King}, {Lange}, {Latter},\n  {Laurent}, {Laurent}, {Leeks}, {Lellouch}, {Levenson}, {Li}, {Li},\n  {Lilienthal}, {Lim}, {Liu}, {Lu}, {Madden}, {Mainetti}, {Marliani}, {McKay},\n  {Mercier}, {Molinari}, {Morris}, {Moseley}, {Mulder}, {Mur}, {Naylor},\n  {Nguyen}, {O'Halloran}, {Oliver}, {Olofsson}, {Olofsson}, {Orfei}, {Page},\n  {Pain}, {Panuzzo}, {Papageorgiou}, {Parks}, {Parr-Burman}, {Pearce},\n  {Pearson}, {P{\\'e}rez-Fournon}, {Pinsard}, {Pisano}, {Podosek}, {Pohlen},\n  {Polehampton}, {Pouliquen}, {Rigopoulou}, {Rizzo}, {Roseboom}, {Roussel},\n  {Rowan-Robinson}, {Rownd}, {Saraceno}, {Sauvage}, {Savage}, {Savini},\n  {Sawyer}, {Scharmberg}, {Schmitt}, {Schneider}, {Schulz}, {Schwartz},\n  {Shafer}, {Shupe}, {Sibthorpe}, {Sidher}, {Smith}, {Smith}, {Smith},\n  {Spencer}, {Stobie}, {Sudiwala}, {Sukhatme}, {Surace}, {Stevens}, {Swinyard},\n  {Trichas}, {Tourette}, {Triou}, {Tseng}, {Tucker}, {Turner}, {Vaccari},\n  {Valtchanov}, {Vigroux}, {Virique}, {Voellmer}, {Walker}, {Ward}, {Waskett},\n  {Weilert}, {Wesson}, {White}, {Whitehouse}, {Wilson}, {Winter}, {Woodcraft},\n  {Wright}, {Xu}, {Zavagno}, {Zemcov}, {Zhang}, \\& {Zonca}}]{Griffin2010}\n{Griffin}, M.~J., {Abergel}, A., {Abreu}, A., {et~al.} 2010, \\aap, 518, L3\n\n\\bibitem[{{Henyey} \\& {Greenstein}(1941)}]{Henyey1941}\n{Henyey}, L.~G. \\& {Greenstein}, J.~L. 1941, \\apj, 93, 70\n\n\\bibitem[{{Hern{\\'a}ndez} {et~al.}(2007){Hern{\\'a}ndez}, {Hartmann}, {Megeath},\n  {Gutermuth}, {Muzerolle}, {Calvet}, {Vivas}, {Brice{\\~n}o}, {Allen},\n  {Stauffer}, {Young}, \\& {Fazio}}]{Hernandez2007}\n{Hern{\\'a}ndez}, J., {Hartmann}, L., {Megeath}, T., {et~al.} 2007, \\apj, 662,\n  1067\n\n\\bibitem[{{Hines} {et~al.}(2007){Hines}, {Schneider}, {Hollenbach}, {Mamajek},\n  {Hillenbrand}, {Metchev}, {Meyer}, {Carpenter}, {Moro-Mart{\\'{\\i}}n},\n  {Silverstone}, {Kim}, {Henning}, {Bouwman}, \\& {Wolf}}]{Hines2007}\n{Hines}, D.~C., {Schneider}, G., {Hollenbach}, D., {et~al.} 2007, \\apjl, 671,\n  L165\n\n\\bibitem[{{Hughes} {et~al.}(2008){Hughes}, {Wilner}, {Kamp}, \\&\n  {Hogerheijde}}]{Hughes2008}\n{Hughes}, A.~M., {Wilner}, D.~J., {Kamp}, I., \\& {Hogerheijde}, M.~R. 2008,\n  \\apj, 681, 626\n\n\\bibitem[{{Jackson} {et~al.}(2014){Jackson}, {Wyatt}, {Bonsor}, \\&\n  {Veras}}]{Jackson2014}\n{Jackson}, A.~P., {Wyatt}, M.~C., {Bonsor}, A., \\& {Veras}, D. 2014, \\mnras,\n  440, 3757\n\n\\bibitem[{{Johansen} {et~al.}(2015){Johansen}, {Mac Low}, {Lacerda}, \\&\n  {Bizzarro}}]{Johansen2015}\n{Johansen}, A., {Mac Low}, M.-M., {Lacerda}, P., \\& {Bizzarro}, M. 2015,\n  Science Advances, 1, 1500109\n\n\\bibitem[{{Kalas} {et~al.}(2008){Kalas}, {Graham}, {Chiang}, {Fitzgerald},\n  {Clampin}, {Kite}, {Stapelfeldt}, {Marois}, \\& {Krist}}]{Kalas2008}\n{Kalas}, P., {Graham}, J.~R., {Chiang}, E., {et~al.} 2008, Science, 322, 1345\n\n\\bibitem[{{Kalas} {et~al.}(2005){Kalas}, {Graham}, \\& {Clampin}}]{Kalas2005}\n{Kalas}, P., {Graham}, J.~R., \\& {Clampin}, M. 2005, \\nat, 435, 1067\n\n\\bibitem[{{Kalas} {et~al.}(2015){Kalas}, {Rajan}, {Wang}, {Millar-Blanchaer},\n  {Duchene}, {Chen}, {Fitzgerald}, {Dong}, {Graham}, {Patience}, {Macintosh},\n  {Murray-Clay}, {Matthews}, {Rameau}, {Marois}, {Chilcote}, {De Rosa},\n  {Doyon}, {Draper}, {Lawler}, {Ammons}, {Arriaga}, {Bulger}, {Cotten},\n  {Follette}, {Goodsell}, {Greenbaum}, {Hibon}, {Hinkley}, {Hung}, {Ingraham},\n  {Konapacky}, {Lafreniere}, {Larkin}, {Long}, {Maire}, {Marchis}, {Metchev},\n  {Morzinski}, {Nielsen}, {Oppenheimer}, {Perrin}, {Pueyo}, {Rantakyr{\\\"o}},\n  {Ruffio}, {Saddlemyer}, {Savransky}, {Schneider}, {Sivaramakrishnan},\n  {Soummer}, {Song}, {Thomas}, {Vasisht}, {Ward-Duong}, {Wiktorowicz}, \\&\n  {Wolff}}]{Kalas2015}\n{Kalas}, P.~G., {Rajan}, A., {Wang}, J.~J., {et~al.} 2015, \\apj, 814, 32\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2006)}]{Kenyon2006}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2006, \\aj, 131, 1837\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2008)}]{Kenyon2008}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2008, \\apjs, 179, 451\n\n\\bibitem[{{Kenyon} \\& {Bromley}(2015)}]{Kenyon2015a}\n{Kenyon}, S.~J. \\& {Bromley}, B.~C. 2015, \\apj, 806, 42\n\n\\bibitem[{Kospal {et~al.}(2013)Kospal, Moor, Juhasz, Abraham, Apai, Csengeri,\n  Grady, Henning, Hughes, Kiss, Pascucci, \\& Schmalzl}]{Kospal2013}\nKospal, A., Moor, A., Juhasz, A., {et~al.} 2013, The Astrophysical Journal,\n  776, 77\n\n\\bibitem[{{Kral} {et~al.}(2015){Kral}, {Th{\\'e}bault}, {Augereau},\n  {Boccaletti}, \\& {Charnoz}}]{Kral2015}\n{Kral}, Q., {Th{\\'e}bault}, P., {Augereau}, J.-C., {Boccaletti}, A., \\&\n  {Charnoz}, S. 2015, \\aap, 573, A39\n\n\\bibitem[{{Krivov}(2010)}]{Krivov2010}\n{Krivov}, A.~V. 2010, Research in Astronomy and Astrophysics, 10, 383\n\n\\bibitem[{{Lagrange} {et~al.}(2015){Lagrange}, {Langlois}, {Gratton}, {Maire},\n  {Milli}, {Olofsson}, {Vigan}, {Bailey}, {Mesa}, {Chauvin}, {Boccaletti},\n  {Galicher}, {Girard}, {Bonnefoy}, {Samland}, {Menard}, {Henning},\n  {Kenworthy}, {Thalmann}, {Beust}, {Beuzit}, {Brandner}, {Buenzli},\n  {Cheetham}, {Janson}, {le Coroller}, {Lannier}, {Mouillet}, {Peretti},\n  {Perrot}, {Salter}, {Sissa}, {Wahhaj}, {Abe}, {Desidera}, {Feldt}, {Madec},\n  {Perret}, {Petit}, {Rabou}, {Soenke}, \\& {Weber}}]{Lagrange2015}\n{Lagrange}, A.-M., {Langlois}, M., {Gratton}, R., {et~al.} 2015, ArXiv e-prints\n  [\\eprint[arXiv]{1510.02511}]\n\n\\bibitem[{{Langlois} {et~al.}(2014){Langlois}, {Dohlen}, {Vigan}, {Zurlo},\n  {Moutou}, {Schmid}, {Mili}, {Beuzit}, {Boccaletti}, {Carle}, {Costille},\n  {Dorn}, {Gluck}, {Hubin}, {Feldt}, {Kasper}, {Lizon}, {Madec}, {Le Mignant},\n  {Mouillet}, {Puget}, {Sauvage}, \\& {Wildi}}]{Langlois2014}\n{Langlois}, M., {Dohlen}, K., {Vigan}, A., {et~al.} 2014, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 9147,\n  Society of Photo-Optical Instrumentation Engineers (SPIE) Conference Series,\n  91471R\n\n\\bibitem[{{Lebouteiller} {et~al.}(2011){Lebouteiller}, {Barry}, {Spoon},\n  {Bernard-Salas}, {Sloan}, {Houck}, \\& {Weedman}}]{Lebouteiller2011}\n{Lebouteiller}, V., {Barry}, D.~J., {Spoon}, H.~W.~W., {et~al.} 2011, \\apjs,\n  196, 8\n\n\\bibitem[{Lebreton {et~al.}(2012)Lebreton, Augereau, Thi, Roberge, Donaldson,\n  Schneider, Maddison, M{\\'e}nard, Riviere-Marichalar, Mathews, Kamp, Pinte,\n  Dent, Barrado, Duch{\\^e}ne, Gonzalez, Grady, Meeus, Pantin, Williams, \\&\n  Woitke}]{Lebreton2012}\nLebreton, J., Augereau, J.-C., Thi, W.~F., {et~al.} 2012, Astronomy {\\&}\n  Astrophysics, 539, A17\n\n\\bibitem[{{Li} \\& {Greenberg}(1998)}]{Li1998}\n{Li}, A. \\& {Greenberg}, J.~M. 1998, \\aap, 331, 291\n\n\\bibitem[{Lyra \\& Kuchner(2013)}]{Lyra2013}\nLyra, W. \\& Kuchner, M. 2013, Nature, 499, 184\n\n\\bibitem[{{Maire} {et~al.}(2015){Maire}, {Bonnefoy}, {Ginski}, {Vigan},\n  {Messina}, {Mesa}, {Galicher}, {Gratton}, {Desidera}, {Kopytova}, {Millward},\n  {Thalmann}, {Claudi}, {Ehrenreich}, {Zurlo}, {Chauvin}, {Antichi},\n  {Baruffolo}, {Bazzon}, {Beuzit}, {Blanchard}, {Boccaletti}, {de Boer},\n  {Carle}, {Cascone}, {Costille}, {De Caprio}, {Delboulbe}, {Dohlen},\n  {Dominik}, {Feldt}, {Fusco}, {Girard}, {Giro}, {Gisler}, {Gluck}, {Gry},\n  {Henning}, {Hubin}, {Hugot}, {Jaquet}, {Kasper}, {Lagrange}, {Langlois}, {Le\n  Mignant}, {Llored}, {Madec}, {Martinez}, {Mawet}, {Milli}, {Moeller-Nilsson},\n  {Mouillet}, {Moulin}, {Moutou}, {Origne}, {Pavlov}, {Petit}, {Pragt},\n  {Puget}, {Ramos}, {Rochat}, {Roelfsema}, {Salasnich}, {Sauvage}, {Schmid},\n  {Turatto}, {Udry}, {Vakili}, {Wahhaj}, {Weber}, \\& {Wildi}}]{Maire2015}\n{Maire}, A.-L., {Bonnefoy}, M., {Ginski}, C., {et~al.} 2015, ArXiv e-prints\n  [\\eprint[arXiv]{1511.04072}]\n\n\\bibitem[{{Maness} {et~al.}(2009){Maness}, {Kalas}, {Peek}, {Chiang},\n  {Scherer}, {Fitzgerald}, {Graham}, {Hines}, {Schneider}, \\&\n  {Metchev}}]{Maness2009}\n{Maness}, H.~L., {Kalas}, P., {Peek}, K.~M.~G., {et~al.} 2009, \\apj, 707, 1098\n\n\\bibitem[{{Marois} {et~al.}(2006){Marois}, {Lafreni{\\`e}re}, {Doyon},\n  {Macintosh}, \\& {Nadeau}}]{Marois2006}\n{Marois}, C., {Lafreni{\\`e}re}, D., {Doyon}, R., {Macintosh}, B., \\& {Nadeau},\n  D. 2006, \\apj, 641, 556\n\n\\bibitem[{{Matr{\\`a}} {et~al.}(2015){Matr{\\`a}}, {Pani{\\'c}}, {Wyatt}, \\&\n  {Dent}}]{Matra2015}\n{Matr{\\`a}}, L., {Pani{\\'c}}, O., {Wyatt}, M.~C., \\& {Dent}, W.~R.~F. 2015,\n  \\mnras, 447, 3936\n\n\\bibitem[{{Matthews} {et~al.}(2014){Matthews}, {Krivov}, {Wyatt}, {Bryden}, \\&\n  {Eiroa}}]{Matthews2014}\n{Matthews}, B.~C., {Krivov}, A.~V., {Wyatt}, M.~C., {Bryden}, G., \\& {Eiroa},\n  C. 2014, ArXiv e-prints [\\eprint[arXiv]{1401.0743}]\n\n\\bibitem[{{Millar-Blanchaer} {et~al.}(2015){Millar-Blanchaer}, {Graham},\n  {Pueyo}, {Kalas}, {Dawson}, {Wang}, {Perrin}, {moon}, {Macintosh}, {Ammons},\n  {Barman}, {Cardwell}, {Chen}, {Chiang}, {Chilcote}, {Cotten}, {De Rosa},\n  {Draper}, {Dunn}, {Duch{\\^e}ne}, {Esposito}, {Fitzgerald}, {Follette},\n  {Goodsell}, {Greenbaum}, {Hartung}, {Hibon}, {Hinkley}, {Ingraham},\n  {Jensen-Clem}, {Konopacky}, {Larkin}, {Long}, {Maire}, {Marchis}, {Marley},\n  {Marois}, {Morzinski}, {Nielsen}, {Palmer}, {Oppenheimer}, {Poyneer},\n  {Rajan}, {Rantakyr{\\\"o}}, {Ruffio}, {Sadakuni}, {Saddlemyer}, {Schneider},\n  {Sivaramakrishnan}, {Soummer}, {Thomas}, {Vasisht}, {Vega}, {Wallace},\n  {Ward-Duong}, {Wiktorowicz}, \\& {Wolff}}]{MillarBlanchaer2015}\n{Millar-Blanchaer}, M.~A., {Graham}, J.~R., {Pueyo}, L., {et~al.} 2015, \\apj,\n  811, 18\n\n\\bibitem[{{Milli} {et~al.}(2015){Milli}, {Mawet}, {Pinte}, {Lagrange},\n  {Mouillet}, {Girard}, {Augereau}, {De Boer}, {Pueyo}, \\&\n  {Choquet}}]{Milli2015}\n{Milli}, J., {Mawet}, D., {Pinte}, C., {et~al.} 2015, \\aap, 577, A57\n\n\\bibitem[{Milli {et~al.}(2012)Milli, Mouillet, Lagrange, Boccaletti, Mawet,\n  Chauvin, \\& Bonnefoy}]{Milli2012}\nMilli, J., Mouillet, D., Lagrange, A.~M., {et~al.} 2012, Astronomy {\\&}\n  Astrophysics, 545, A111\n\n\\bibitem[{{Min} {et~al.}(2016){Min}, {Rab}, {Woitke}, {Dominik}, \\&\n  {M{\\'e}nard}}]{Min2016}\n{Min}, M., {Rab}, C., {Woitke}, P., {Dominik}, C., \\& {M{\\'e}nard}, F. 2016,\n  \\aap, 585, A13\n\n\\bibitem[{{Mo{\\'o}r} {et~al.}(2015{\\natexlab{a}}){Mo{\\'o}r}, {Henning},\n  {Juh{\\'a}sz}, {{\\'A}brah{\\'a}m}, {Balog}, {K{\\'o}sp{\\'a}l}, {Pascucci},\n  {Szab{\\'o}}, {Vavrek}, {Cur{\\'e}}, {Csengeri}, {Grady}, {G{\\\"u}sten}, \\&\n  {Kiss}}]{Moor2015b}\n{Mo{\\'o}r}, A., {Henning}, T., {Juh{\\'a}sz}, A., {et~al.} 2015{\\natexlab{a}},\n  \\apj, 814, 42\n\n\\bibitem[{{Mo{\\'o}r} {et~al.}(2015{\\natexlab{b}}){Mo{\\'o}r}, {K{\\'o}sp{\\'a}l},\n  {{\\'A}brah{\\'a}m}, {Apai}, {Balog}, {Grady}, {Henning}, {Juh{\\'a}sz}, {Kiss},\n  {Krivov}, {Pawellek}, \\& {Szab{\\'o}}}]{Moor2015}\n{Mo{\\'o}r}, A., {K{\\'o}sp{\\'a}l}, {\\'A}., {{\\'A}brah{\\'a}m}, P., {et~al.}\n  2015{\\natexlab{b}}, \\mnras, 447, 577\n\n\\bibitem[{{Morales} {et~al.}(2011){Morales}, {Rieke}, {Werner}, {Bryden},\n  {Stapelfeldt}, \\& {Su}}]{Morales2011}\n{Morales}, F.~Y., {Rieke}, G.~H., {Werner}, M.~W., {et~al.} 2011, \\apjl, 730,\n  L29\n\n\\bibitem[{{Mustill} \\& {Wyatt}(2009)}]{Mustill2009}\n{Mustill}, A.~J. \\& {Wyatt}, M.~C. 2009, \\mnras, 399, 1403\n\n\\bibitem[{Nesvold {et~al.}(2013)Nesvold, Kuchner, Rein, \\& Pan}]{Nesvold2013}\nNesvold, E.~R., Kuchner, M.~J., Rein, H., \\& Pan, M. 2013, The Astrophysical\n  Journal, 777, 144\n\n\\bibitem[{{Olofsson} {et~al.}(2013){Olofsson}, {Henning}, {Nielbock},\n  {Augereau}, {Juh{\\`a}sz}, {Oliveira}, {Absil}, \\& {Tamanai}}]{Olofsson2013}\n{Olofsson}, J., {Henning}, T., {Nielbock}, M., {et~al.} 2013, \\aap, 551, A134\n\n\\bibitem[{{Olofsson} {et~al.}(2012){Olofsson}, {Juh{\\'a}sz}, {Henning},\n  {Mutschke}, {Tamanai}, {Mo{\\'o}r}, \\& {{\\'A}brah{\\'a}m}}]{Olofsson2012}\n{Olofsson}, J., {Juh{\\'a}sz}, A., {Henning}, T., {et~al.} 2012, \\aap, 542, A90\n\n\\bibitem[{{Ott}(2010)}]{Ott2010}\n{Ott}, S. 2010, in Astronomical Society of the Pacific Conference Series, Vol.\n  434, Astronomical Data Analysis Software and Systems XIX, ed. Y.~{Mizumoto},\n  K.-I. {Morita}, \\& M.~{Ohishi}, 139\n\n\\bibitem[{{Owen} {et~al.}(2011){Owen}, {Ercolano}, \\& {Clarke}}]{Owen2011}\n{Owen}, J.~E., {Ercolano}, B., \\& {Clarke}, C.~J. 2011, \\mnras, 412, 13\n\n\\bibitem[{{Pavlov} {et~al.}(2008){Pavlov}, {M{\\\"o}ller-Nilsson}, {Feldt},\n  {Henning}, {Beuzit}, \\& {Mouillet}}]{Pavlov2008}\n{Pavlov}, A., {M{\\\"o}ller-Nilsson}, O., {Feldt}, M., {et~al.} 2008, in Society\n  of Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol.\n  7019, Society of Photo-Optical Instrumentation Engineers (SPIE) Conference\n  Series, 39\n\n\\bibitem[{Pawellek {et~al.}(2014)Pawellek, Krivov, Marshall, Montesinos,\n  Abraham, Moor, Bryden, \\& Eiroa}]{Pawellek2014}\nPawellek, N., Krivov, A.~V., Marshall, J.~P., {et~al.} 2014, The Astrophysical\n  Journal, 792, 65\n\n\\bibitem[{Pearce \\& Wyatt(2014)}]{Pearce2014}\nPearce, T.~D. \\& Wyatt, M.~C. 2014, Monthly Notices of the Royal Astronomical\n  Society, 443, 2541\n\n\\bibitem[{Pedregosa {et~al.}(2011)Pedregosa, Varoquaux, Gramfort, Michel,\n  Thirion, Grisel, Blondel, Prettenhofer, Weiss, Dubourg, Vanderplas, Passos,\n  Cournapeau, Brucher, Perrot, \\& Duchesnay}]{Pedregosa2011}\nPedregosa, F., Varoquaux, G., Gramfort, A., {et~al.} 2011, Journal of Machine\n  Learning Research, 12, 2825\n\n\\bibitem[{{Pilbratt} {et~al.}(2010){Pilbratt}, {Riedinger}, {Passvogel},\n  {Crone}, {Doyle}, {Gageur}, {Heras}, {Jewell}, {Metcalfe}, {Ott}, \\&\n  {Schmidt}}]{Pilbratt2010}\n{Pilbratt}, G.~L., {Riedinger}, J.~R., {Passvogel}, T., {et~al.} 2010, \\aap,\n  518, L1+\n\n\\bibitem[{Pinte {et~al.}(2008)Pinte, Padgett, M{\\'e}nard, Stapelfeldt,\n  Schneider, Olofsson, Pani{\\'c}, Augereau, Duch{\\^e}ne, Krist, Pontoppidan,\n  Perrin, Grady, Kessler-Silacci, van Dishoeck, Lommen, Silverstone, Hines,\n  Wolf, Blake, Henning, \\& Stecklum}]{Pinte2008}\nPinte, C., Padgett, D.~L., M{\\'e}nard, F., {et~al.} 2008, Astronomy {\\&}\n  Astrophysics, 489, 633\n\n\\bibitem[{{Poglitsch} {et~al.}(2010){Poglitsch}, {Waelkens}, {Geis},\n  {Feuchtgruber}, {Vandenbussche}, {Rodriguez}, {Krause}, {Renotte}, {van\n  Hoof}, {Saraceno}, {Cepa}, {Kerschbaum}, {Agn{\\`e}se}, {Ali}, {Altieri},\n  {Andreani}, {Augueres}, {Balog}, {Barl}, {Bauer}, {Belbachir}, {Benedettini},\n  {Billot}, {Boulade}, {Bischof}, {Blommaert}, {Callut}, {Cara}, {Cerulli},\n  {Cesarsky}, {Contursi}, {Creten}, {De Meester}, {Doublier}, {Doumayrou},\n  {Duband}, {Exter}, {Genzel}, {Gillis}, {Gr{\\\"o}zinger}, {Henning},\n  {Herreros}, {Huygen}, {Inguscio}, {Jakob}, {Jamar}, {Jean}, {de Jong},\n  {Katterloher}, {Kiss}, {Klaas}, {Lemke}, {Lutz}, {Madden}, {Marquet},\n  {Martignac}, {Mazy}, {Merken}, {Montfort}, {Morbidelli}, {M{\\\"u}ller},\n  {Nielbock}, {Okumura}, {Orfei}, {Ottensamer}, {Pezzuto}, {Popesso},\n  {Putzeys}, {Regibo}, {Reveret}, {Royer}, {Sauvage}, {Schreiber}, {Stegmaier},\n  {Schmitt}, {Schubert}, {Sturm}, {Thiel}, {Tofani}, {Vavrek}, {Wetzstein},\n  {Wieprecht}, \\& {Wiezorrek}}]{Poglitsch2010}\n{Poglitsch}, A., {Waelkens}, C., {Geis}, N., {et~al.} 2010, \\aap, 518, L2+\n\n\\bibitem[{{Ricarte} {et~al.}(2013){Ricarte}, {Moldvai}, {Hughes},\n  {Duch{\\^e}ne}, {Williams}, {Andrews}, \\& {Wilner}}]{Ricarte2013}\n{Ricarte}, A., {Moldvai}, N., {Hughes}, A.~M., {et~al.} 2013, \\apj, 774, 80\n\n\\bibitem[{Rodigas {et~al.}(2015)Rodigas, Stark, Weinberger, Debes, Hinz, Close,\n  Chen, Smith, Males, Skemer, Puglisi, Follette, Morzinski, Wu, Briguglio,\n  Esposito, Pinna, Riccardi, Schneider, \\& Xompero}]{Rodigas2015}\nRodigas, T.~J., Stark, C.~C., Weinberger, A., {et~al.} 2015, The Astrophysical\n  Journal, 798, 96\n\n\\bibitem[{{Schneider} {et~al.}(2014){Schneider}, {Grady}, {Hines}, {Stark},\n  {Debes}, {Carson}, {Kuchner}, {Perrin}, {Weinberger}, {Wisniewski},\n  {Silverstone}, {Jang-Condell}, {Henning}, {Woodgate}, {Serabyn},\n  {Moro-Martin}, {Tamura}, {Hinz}, \\& {Rodigas}}]{Schneider2014}\n{Schneider}, G., {Grady}, C.~A., {Hines}, D.~C., {et~al.} 2014, \\aj, 148, 59\n\n\\bibitem[{{Siess} {et~al.}(2000){Siess}, {Dufour}, \\& {Forestini}}]{Siess2000}\n{Siess}, L., {Dufour}, E., \\& {Forestini}, M. 2000, \\aap, 358, 593\n\n\\bibitem[{Soummer {et~al.}(2012)Soummer, Pueyo, \\& Larkin}]{Soummer2012}\nSoummer, R., Pueyo, L., \\& Larkin, J. 2012, The Astrophysical Journal, 755, L28\n\n\\bibitem[{Stark {et~al.}(2014)Stark, Schneider, Weinberger, Debes, Grady,\n  Jang-Condell, \\& Kuchner}]{Stark2014}\nStark, C.~C., Schneider, G., Weinberger, A.~J., {et~al.} 2014, The\n  Astrophysical Journal, 789, 58\n\n\\bibitem[{Su {et~al.}(2013)Su, Rieke, Malhotra, Stapelfeldt, Hughes, Bonsor,\n  Wilner, Balog, Watson, Werner, \\& Misselt}]{Su2013}\nSu, K. Y.~L., Rieke, G.~H., Malhotra, R., {et~al.} 2013, The Astrophysical\n  Journal, 763, 118\n\n\\bibitem[{{Taylor}(2005)}]{Taylor2005}\n{Taylor}, M.~B. 2005, in Astronomical Society of the Pacific Conference Series,\n  Vol. 347, Astronomical Data Analysis Software and Systems XIV, ed.\n  P.~{Shopbell}, M.~{Britton}, \\& R.~{Ebert}, 29\n\n\\bibitem[{{Thalmann} {et~al.}(2014){Thalmann}, {Mulders}, {Hodapp}, {Janson},\n  {Grady}, {Min}, {de Juan Ovelar}, {Carson}, {Brandt}, {Bonnefoy}, {McElwain},\n  {Leisenring}, {Dominik}, {Henning}, \\& {Tamura}}]{Thalmann2014}\n{Thalmann}, C., {Mulders}, G.~D., {Hodapp}, K., {et~al.} 2014, \\aap, 566, A51\n\n\\bibitem[{Thebault(2009)}]{Thebault2009}\nThebault, P. 2009, Astronomy {\\&} Astrophysics, 505, 1269\n\n\\bibitem[{{van Leeuwen}(2007)}]{2007}\n{van Leeuwen}, F. 2007, \\aap, 474, 653\n\n\\bibitem[{{Vigan} {et~al.}(2010){Vigan}, {Moutou}, {Langlois}, {Allard},\n  {Boccaletti}, {Carbillet}, {Mouillet}, \\& {Smith}}]{Vigan2010}\n{Vigan}, A., {Moutou}, C., {Langlois}, M., {et~al.} 2010, \\mnras, 407, 71\n\n\\bibitem[{{Wolf} \\& {Hillenbrand}(2005)}]{Wolf2005}\n{Wolf}, S. \\& {Hillenbrand}, L.~A. 2005, Computer Physics Communications, 171,\n  208\n\n\\bibitem[{{Wyatt}(2006)}]{Wyatt2006}\n{Wyatt}, M.~C. 2006, \\apj, 639, 1153\n\n\\bibitem[{{Wyatt}(2008)}]{Wyatt2008}\n{Wyatt}, M.~C. 2008, \\araa, 46, 339\n\n\\bibitem[{{Wyatt} {et~al.}(1999){Wyatt}, {Dermott}, {Telesco}, {Fisher},\n  {Grogan}, {Holmes}, \\& {Pi{\\~n}a}}]{Wyatt1999}\n{Wyatt}, M.~C., {Dermott}, S.~F., {Telesco}, C.~M., {et~al.} 1999, \\apj, 527,\n  918\n\n\\end{thebibliography}\n\n\\appendix\n\n\n\n\\section[]{Description of the code}\\label{app:DDIT}\n\n\\subsection{Computing the spectral energy distribution}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{DDiT_schema.pdf}\n\\caption{Schematic view of how a disk, seen edge-on, is described in the DDiT code. Different shells ($n_{\\mathrm{r}} = 10$) are represented in different fading colours, while dust belts are represented without transparency (see text for details).}\n\\label{fig:ddit}\n\\end{figure}\n\nThe DDiT code is mostly based on the code already described in \\citet[which was based on the ``Debris disk radiative transfer simulation tool'' described in \\citealt{Wolf2005}]{Olofsson2012,Olofsson2013}. However, as opposed to the work presented in \\citet{Olofsson2012,Olofsson2013}, only one dust species per model is considered in this study. The dust properties are defined by the optical constants, the density ($\\rho$), the minimum and maximum grain sizes ($s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$, respectively), and the slope $p$ of the grain size distribution (d$n(s) \\propto s^p \\mathrm{d}s$, $p < 0$). The absorption efficiencies, $Q_{\\mathrm{abs}} (\\lambda, s)$, are computed using the Mie theory for $n_{\\mathrm{g}} = 100$ grain sizes logarithmically spaced between $s_{\\mathrm{min}}$ and $s_{\\mathrm{max}}$.\n\nConcerning the disk model itself, it is defined by the following parameters: a reference radius $r_0$, two power-law indexes $\\alpha_{\\mathrm{in}} > 0$ and $\\alpha_{\\mathrm{out}} < 0$, the opening angle of the disk ($\\psi = \\mathrm{arctan}(h/r)$, where $h$ is the height from the midplane), and the total dust mass $M_{\\mathrm{disk}}$. We first define the inner and outer radii of the disk by finding $r_{\\mathrm{in}} = r_0 \\times C^{(1/\\alpha_{\\mathrm{in}})}$ and $r_{\\mathrm{out}} = r_0 \\times C^{(1/\\alpha_{\\mathrm{out}})}$, where $C$ is a ``threshold'' value for the minimum density that we choose to be $C = 10^{-2}$. The code is 1D and the disk is divided into $n_{\\mathrm{r}}$ spherical shells centered at $r_{\\mathrm{j}}$, logarithmically spaced between $r_{\\mathrm{in}}$ and $r_{\\mathrm{out}}$ (see Figure\\,\\ref{fig:ddit}).\n\nThe dust number density distribution for the shell at distance $r_{\\mathrm{j}}$ and the grain size $s_{\\mathrm{k}}$, $N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$, is defined as\n\n", "index": 19, "text": "\\begin{equation}\\label{eqn:dens}\n    N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}}) = \\left[ \\left( \\frac{r_{\\mathrm{j}}}{r_0} \\right)^{-2\\alpha_{\\mathrm{in}}} + \\left( \\frac{r_{\\mathrm{j}}}{r_0} \\right)^{-2\\alpha_{\\mathrm{out}}} \\right] ^{-1/2} \\times N_{\\mathrm{s}}(s_{\\mathrm{k}}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})=\\left[\\left(\\frac{r_{\\mathrm{%&#10;j}}}{r_{0}}\\right)^{-2\\alpha_{\\mathrm{in}}}+\\left(\\frac{r_{\\mathrm{j}}}{r_{0}}%&#10;\\right)^{-2\\alpha_{\\mathrm{out}}}\\right]^{-1/2}\\times N_{\\mathrm{s}}(s_{%&#10;\\mathrm{k}}),\" display=\"block\"><mrow><mrow><mrow><msub><mi>N</mi><mi>dens</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mi mathvariant=\"normal\">j</mi></msub><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>r</mi><mi mathvariant=\"normal\">j</mi></msub><msub><mi>r</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>α</mi><mi>in</mi></msub></mrow></mrow></msup><mo>+</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>r</mi><mi mathvariant=\"normal\">j</mi></msub><msub><mi>r</mi><mn>0</mn></msub></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>α</mi><mi>out</mi></msub></mrow></mrow></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>×</mo><msub><mi>N</mi><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $\\Delta \\mathrm{log}(s)_{\\mathrm{k}}$ is the width of each bin in logarithmic space of $s$. Since the $n_{\\mathrm{g}}$ grain sizes are logarithmically spaced, each $\\Delta \\mathrm{log}(s)_{\\mathrm{k}}$ are the same, except the first and last ones which are half of that value. The mass density distribution is then given by $M_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}}) = N_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}}) \\times 4/3 \\pi s_{\\mathrm{k}}^3 \\rho$. Both $N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$ and $M_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$ are then normalized so that the integral of $M_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}}) \\times V_{\\mathrm{j}}$ (where $V_{\\mathrm{j}}$ is the volume of the shell $\\mathrm{j}$) over $s$ and $r$ equals the total input dust mass $M_{\\mathrm{disk}}$.\n\nThe radially integrated optical depth at the wavelength of the peak of the stellar emission ($\\tau_{\\lambda\\,\\mathrm{peak}}$) is computed at the outer edge $r_{\\mathrm{out}}$, assuming a spherical symmetry of the disk. This quantity is then divided by $f_{\\psi} =  \\mathrm{sin}(\\psi)$ to obtain the final optical depth of the model, for a given $\\psi$. This $1/f_{\\psi}$ factor accounts for the fact that the code is 1D, i.e., that the disk is not a sphere but has a maximum vertical height $h$ from the midplane (hence can be seen as dust belts). On Figure\\,\\ref{fig:ddit}, the shells are shown in fading colours, while the dust belts are represented without transparency. The $f_{\\psi}$ factor is the ratio of the volume of a sphere of radius $R$ to which we subtract two spherical cones (up and down) of height $R \\times (1 - \\mathrm{sin}(\\psi))$, divided by the volume of a sphere of the same radius. One spherical cone has a volume of $2\\pi/3 R^3(1-\\mathrm{sin}(\\psi))$, which simplifies the volume ratio to $\\mathrm{sin}(\\psi)$. By doing so, we can keep $M_{\\mathrm{disk}}$ constant and leaves the output of the code unchanged while simply updating the optical depth. Once the model has been computed, a check is performed to see if $\\tau_{\\lambda\\,\\mathrm{peak}}$ is smaller than unity for the given dust mass and $\\psi$.\n\nWhen computing the SED, we consider that the contribution of scattered light is negligible at mid to far-IR wavelengths compared to the thermal emission. Furthermore, since debris disks are optically thin at all wavelengths, geometrical parameters such as the inclination have no impact on the final SED. Finally, as the observed SED is constructed from spatially unresolved observations, disk or aperture sizes do not have to be taken into consideration.\n\nFor each shell, the temperature of a dust grain is computed as a function of its size $s$ and distance $r$ to the star. Assuming radiative equilibrium, one can express $r$ as\n\n", "itemtype": "equation", "pos": 117892, "prevtext": "\nwhere $N_{\\mathrm{s}}(s_{\\mathrm{k}})$ is a function depending solely on the grain size (similarly to Eqn.\\,2 of \\citealp{Dullemond2008})\n\n", "index": 21, "text": "\\begin{equation}\n\tN_{\\mathrm{s}}(s_{\\mathrm{k}}) = \\left( \\frac{s_{\\mathrm{k}}}{s_{\\mathrm{min}}} \\right) ^{p} \\times s_{\\mathrm{k}} \\times \\Delta \\mathrm{log}(s)_{\\mathrm{k}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"N_{\\mathrm{s}}(s_{\\mathrm{k}})=\\left(\\frac{s_{\\mathrm{k}}}{s_{\\mathrm{min}}}%&#10;\\right)^{p}\\times s_{\\mathrm{k}}\\times\\Delta\\mathrm{log}(s)_{\\mathrm{k}},\" display=\"block\"><mrow><mrow><mrow><msub><mi>N</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><msub><mi>s</mi><mi>min</mi></msub></mfrac><mo>)</mo></mrow><mi>p</mi></msup><mo>×</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo>×</mo><mi mathvariant=\"normal\">Δ</mi></mrow><mo>⁢</mo><mi>log</mi><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">k</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $R_{\\star}$ is the stellar radius, $F_{\\star}$ the stellar surface flux, and $B_{\\lambda}$ the Planck function at the dust temperature $T_{\\mathrm{dust}}$. By inverting numerically the above equation, we obtain the radial dependency of the temperature. Afterwards, the flux $F_{\\mathrm{th}}$ (the thermal radiation of a single dust grain) received by an observer at distance $d_{\\star}$ is computed as\n\n", "itemtype": "equation", "pos": 120885, "prevtext": "\nwhere $\\Delta \\mathrm{log}(s)_{\\mathrm{k}}$ is the width of each bin in logarithmic space of $s$. Since the $n_{\\mathrm{g}}$ grain sizes are logarithmically spaced, each $\\Delta \\mathrm{log}(s)_{\\mathrm{k}}$ are the same, except the first and last ones which are half of that value. The mass density distribution is then given by $M_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}}) = N_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}}) \\times 4/3 \\pi s_{\\mathrm{k}}^3 \\rho$. Both $N_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$ and $M_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}})$ are then normalized so that the integral of $M_{\\mathrm{dens}}(r_{\\mathrm{j}},s_{\\mathrm{k}}) \\times V_{\\mathrm{j}}$ (where $V_{\\mathrm{j}}$ is the volume of the shell $\\mathrm{j}$) over $s$ and $r$ equals the total input dust mass $M_{\\mathrm{disk}}$.\n\nThe radially integrated optical depth at the wavelength of the peak of the stellar emission ($\\tau_{\\lambda\\,\\mathrm{peak}}$) is computed at the outer edge $r_{\\mathrm{out}}$, assuming a spherical symmetry of the disk. This quantity is then divided by $f_{\\psi} =  \\mathrm{sin}(\\psi)$ to obtain the final optical depth of the model, for a given $\\psi$. This $1/f_{\\psi}$ factor accounts for the fact that the code is 1D, i.e., that the disk is not a sphere but has a maximum vertical height $h$ from the midplane (hence can be seen as dust belts). On Figure\\,\\ref{fig:ddit}, the shells are shown in fading colours, while the dust belts are represented without transparency. The $f_{\\psi}$ factor is the ratio of the volume of a sphere of radius $R$ to which we subtract two spherical cones (up and down) of height $R \\times (1 - \\mathrm{sin}(\\psi))$, divided by the volume of a sphere of the same radius. One spherical cone has a volume of $2\\pi/3 R^3(1-\\mathrm{sin}(\\psi))$, which simplifies the volume ratio to $\\mathrm{sin}(\\psi)$. By doing so, we can keep $M_{\\mathrm{disk}}$ constant and leaves the output of the code unchanged while simply updating the optical depth. Once the model has been computed, a check is performed to see if $\\tau_{\\lambda\\,\\mathrm{peak}}$ is smaller than unity for the given dust mass and $\\psi$.\n\nWhen computing the SED, we consider that the contribution of scattered light is negligible at mid to far-IR wavelengths compared to the thermal emission. Furthermore, since debris disks are optically thin at all wavelengths, geometrical parameters such as the inclination have no impact on the final SED. Finally, as the observed SED is constructed from spatially unresolved observations, disk or aperture sizes do not have to be taken into consideration.\n\nFor each shell, the temperature of a dust grain is computed as a function of its size $s$ and distance $r$ to the star. Assuming radiative equilibrium, one can express $r$ as\n\n", "index": 23, "text": "\\begin{equation}\nr(s_{\\mathrm{k}}, T_\\mathrm{dust}) = \\frac{R_{\\star}}{2} \\times \\sqrt \\frac{\\int_{\\lambda} F_{\\star}(\\lambda) Q_{\\mathrm{abs}}(\\lambda, s_{\\mathrm{k}}) \\mathrm{d}\\lambda}{\\int_{\\lambda} \\pi B_{\\lambda}(\\lambda, T_{\\mathrm{dust}}) Q_{\\mathrm{abs}}(\\lambda, s_{\\mathrm{k}}) \\mathrm{d}\\lambda},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"r(s_{\\mathrm{k}},T_{\\mathrm{dust}})=\\frac{R_{\\star}}{2}\\times\\sqrt{\\frac{\\int_%&#10;{\\lambda}F_{\\star}(\\lambda)Q_{\\mathrm{abs}}(\\lambda,s_{\\mathrm{k}})\\mathrm{d}%&#10;\\lambda}{\\int_{\\lambda}\\pi B_{\\lambda}(\\lambda,T_{\\mathrm{dust}})Q_{\\mathrm{%&#10;abs}}(\\lambda,s_{\\mathrm{k}})\\mathrm{d}\\lambda}},\" display=\"block\"><mrow><mrow><mrow><mi>r</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo>,</mo><msub><mi>T</mi><mi>dust</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>R</mi><mo>⋆</mo></msub><mn>2</mn></mfrac><mo>×</mo><msqrt><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>λ</mi></msub><mrow><msub><mi>F</mi><mo>⋆</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Q</mi><mi>abs</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>λ</mi></mrow></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>λ</mi></msub><mrow><mi>π</mi><mo>⁢</mo><msub><mi>B</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>T</mi><mi>dust</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Q</mi><mi>abs</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>λ</mi></mrow></mrow></mrow></mfrac></msqrt></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nFor a given shell, the total thermal emission is obtained by multiplying $F_{\\mathrm{th}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}})$ by the normalised $N_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}})$. The final SED is the sum of the thermal emission from all $n_{\\mathrm{r}}$ shells.\n\n\\subsection{Computing synthetic images}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{rays.pdf}\n\\caption{Sketch of a disk (inclined by $i$) as seen from the side to illustrate the ``entry'' and ``exit'' points ($D_\\mathrm{En}$ and $D_\\mathrm{Ex}$) when computing images. The cut shows the $y$ and $z$ in the disk frame axis and is made at $x = 0$ (the $x$ axis pointing toward the reader).}\n\\label{fig:rays}\n\\end{figure}\n\nAt optical or near-IR wavelengths, stellar light scattered by dust grains can no longer be considered negligible and has to be accounted for. We follow a parallel approach as for the thermal emission and the stellar light scattered by a single dust grain is computed as follows\n\n", "itemtype": "equation", "pos": 121617, "prevtext": "\nwhere $R_{\\star}$ is the stellar radius, $F_{\\star}$ the stellar surface flux, and $B_{\\lambda}$ the Planck function at the dust temperature $T_{\\mathrm{dust}}$. By inverting numerically the above equation, we obtain the radial dependency of the temperature. Afterwards, the flux $F_{\\mathrm{th}}$ (the thermal radiation of a single dust grain) received by an observer at distance $d_{\\star}$ is computed as\n\n", "index": 25, "text": "\\begin{equation}\\label{eqn:Fth}\nF_{\\mathrm{th}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}}) = \\left( \\frac{4 \\pi s_{\\mathrm{k}}^2}{4 \\pi d_{\\star}^2} \\right) \\pi B_{\\lambda}(\\lambda, T_\\mathrm{dust,j}) Q_{\\mathrm{abs}}(\\lambda, s_{\\mathrm{k}}).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"F_{\\mathrm{th}}(\\lambda,r_{\\mathrm{j}},s_{\\mathrm{k}})=\\left(\\frac{4\\pi s_{%&#10;\\mathrm{k}}^{2}}{4\\pi d_{\\star}^{2}}\\right)\\pi B_{\\lambda}(\\lambda,T_{\\mathrm{%&#10;dust,j}})Q_{\\mathrm{abs}}(\\lambda,s_{\\mathrm{k}}).\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mi>th</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>r</mi><mi mathvariant=\"normal\">j</mi></msub><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>s</mi><mi mathvariant=\"normal\">k</mi><mn>2</mn></msubsup></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>d</mi><mo>⋆</mo><mn>2</mn></msubsup></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>B</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>T</mi><mrow><mi>dust</mi><mo>,</mo><mi mathvariant=\"normal\">j</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>Q</mi><mi>abs</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $Q_{\\mathrm{sca}}$ is the scattering efficiencies calculated with the Mie theory and $S_{11}(\\theta)$ is the scattering phase function.\n\nIn the model parametrization, we define two quantities for the image itself, the number of pixels $n_{\\mathrm{p}}$ (images are squares) and the size $l_\\mathrm{p}$ of one pixel in units of AU. Then, for each of the $n_{\\mathrm{p}}^2$ pixels in the image, we first apply adequate projection and rotation to account for the geometrical parameters $i$ and $\\phi$ (inclination and position angle, respectively). For $\\phi = 0^{\\circ}$, the semi-major axis is along the South-North direction, and the front side of the disk is chosen to be on the East side. For increasing $\\phi$ the disk rotates counter-clockwise, towards the East.\n\nSince the disk has an non-zero opening angle $\\psi$, it is not infinitely flat in the vertical direction. As in other codes (e.g. \\textsc{GRaTeR}, \\citealp{Augereau1999}), we assume a vertical Gaussian profile for the dust distribution, with a $\\sigma$ width equal to $\\psi$. This avoids having ``blocky'' images, especially for highly inclined disks. Figure\\,\\ref{fig:rays} shows a crude sketch of a cut in the $(y,z)$ reference plane of the disk, for $x = 0$. The disk has an inclination $i$ and for each pixel, we trace rays along the line of sight and search for intersections with the disk. The disk can be described by four main geometrical shapes: inner and outer shells, and upper and lower planes. Each of them can be either ``entry'' or ``exit'' points for the rays (blue and yellow lines in Fig.\\,\\ref{fig:rays}, respectively). One should note that only slightly different intersection conditions are to be considered for cases where $\\pi/2 - i <  \\psi$ (e.g., edge-on disk) and that the code can produce images for such disks. We can therefore obtain the coordinates of both the entry and exit points ($D_\\mathrm{En}$ and $D_\\mathrm{Ex}$, respectively). Since a pixel has a size $l_\\mathrm{p}$, the column between $D_\\mathrm{En}$ and $D_\\mathrm{Ex}$ (modulus of $|l|$) has a volume of $l_{\\mathrm{p}}^2 \\times |l|$. Since this column can probe a significant range of distances $r$ to the star, we divide it into $n_{\\mathrm{los}}$ boxes, along the line the sight. For each of these boxes, we evaluate the distance to the star $r$, the volume of the box $V_{\\mathrm{box}}$, and the scattering angle (dot product between the line of sight and the position in the disk with respect to the star). We then interpolate $F_{\\mathrm{th}}$, $F_{\\mathrm{scat}}$, and $N_{\\mathrm{dens}}$ at the distance $r$ of the center of the box, and interpolate the phase function at the scattering angle. We then sum the product $F_{\\mathrm{th/scat}} \\times N_{\\mathrm{dens}} \\times V_{\\mathrm{box}}$ for each boxes, to obtain both the scattered light and thermal emission for this given pixel.\n\n\\subsubsection{Polarized images}\n\nThe code can also produce polarized light images on top of the total intensity images. Neglecting multiple scattering events, a reasonable assumption in optically thin disks, we compute $F_{\\mathrm{pol}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}}, \\theta)$ similarly to Eqn.\\,\\ref{eqn:Fscat} simply replacing $S_{11}$ by $S_{12}$. The second element of the M\\\"uller matrix $S_{12}$ is calculated using the Mie theory (while $S_{11}$ can be approximated by the Henyey-Greenstein function). We can therefore produce synthetic images along the Stokes vector $Q$, which can be used to model polarimetric observations.\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{eccentric_sketch.pdf}\n\\caption{Sketch of an eccentric disk. The color-coding represents the density distribution. The rotation angle is indicated by $\\Phi_{\\mathrm{e}}$, the reference angle for the azimuthal variation by $\\Phi_{\\eta}$, and $\\eta = 0.3$ in this example.}\n\\label{fig:ecc}\n\\end{figure}\n\n\\subsubsection{Eccentric disks}\n\nThe code can produce images of eccentric disks. The inner and outer shells as described in Figure\\,\\ref{fig:rays} are modified to inner and outer walls with an eccentricity $e$ parameter and a rotation angle $\\Phi_{\\mathrm{e}}$ (see Fig.\\,\\ref{fig:ecc} for a sketch of a face-on disk). For each pixel in the image, at position $(x,y)$ (in the reference frame rotated by $\\Phi_{\\mathrm{e}}$), we check if it is in between the inner and outer walls, which are defined as,\n\n\n", "itemtype": "equation", "pos": 122874, "prevtext": "\nFor a given shell, the total thermal emission is obtained by multiplying $F_{\\mathrm{th}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}})$ by the normalised $N_{\\mathrm{dens}} (r_{\\mathrm{j}}, s_{\\mathrm{k}})$. The final SED is the sum of the thermal emission from all $n_{\\mathrm{r}}$ shells.\n\n\\subsection{Computing synthetic images}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{rays.pdf}\n\\caption{Sketch of a disk (inclined by $i$) as seen from the side to illustrate the ``entry'' and ``exit'' points ($D_\\mathrm{En}$ and $D_\\mathrm{Ex}$) when computing images. The cut shows the $y$ and $z$ in the disk frame axis and is made at $x = 0$ (the $x$ axis pointing toward the reader).}\n\\label{fig:rays}\n\\end{figure}\n\nAt optical or near-IR wavelengths, stellar light scattered by dust grains can no longer be considered negligible and has to be accounted for. We follow a parallel approach as for the thermal emission and the stellar light scattered by a single dust grain is computed as follows\n\n", "index": 27, "text": "\\begin{equation}\\label{eqn:Fscat}\nF_{\\mathrm{scat}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}}, \\theta) = \\frac{F_{\\star} (\\lambda)}{4\\pi r_{\\mathrm{j}}^2} \\pi s_{\\mathrm{k}}^2 \\left( \\frac{1}{4 \\pi d_{\\star}^2} \\right) Q_{\\mathrm{sca}}(\\lambda, s_{\\mathrm{k}}) S_{11} (\\lambda, s_{\\mathrm{k}}, \\theta),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"F_{\\mathrm{scat}}(\\lambda,r_{\\mathrm{j}},s_{\\mathrm{k}},\\theta)=\\frac{F_{\\star%&#10;}(\\lambda)}{4\\pi r_{\\mathrm{j}}^{2}}\\pi s_{\\mathrm{k}}^{2}\\left(\\frac{1}{4\\pi d%&#10;_{\\star}^{2}}\\right)Q_{\\mathrm{sca}}(\\lambda,s_{\\mathrm{k}})S_{11}(\\lambda,s_{%&#10;\\mathrm{k}},\\theta),\" display=\"block\"><mrow><mrow><mrow><msub><mi>F</mi><mi>scat</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>r</mi><mi mathvariant=\"normal\">j</mi></msub><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo>,</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><msub><mi>F</mi><mo>⋆</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>r</mi><mi mathvariant=\"normal\">j</mi><mn>2</mn></msubsup></mrow></mfrac><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>s</mi><mi mathvariant=\"normal\">k</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo>(</mo><mfrac><mn>1</mn><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>d</mi><mo>⋆</mo><mn>2</mn></msubsup></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><msub><mi>Q</mi><mi>sca</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>S</mi><mn>11</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo>,</mo><msub><mi>s</mi><mi mathvariant=\"normal\">k</mi></msub><mo>,</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nwhere $a = \\mathrm{atan2}(y, x)$. For $\\Phi_{\\mathrm{e}} = \\phi = 0^{\\circ}$, the pericenter is located on the South side.\n\n\\subsubsection{Azimuthal density variations}\n\nIt is also possible to introduce azimuthal dust density variations in the synthetic images. It is parametrized with three parameters: a damping factor $\\eta$ ($0 \\leq \\eta \\leq 1$), a reference angle $\\Phi_{\\eta}$, and the azimuthal variation follows a Gaussian profile of $\\sigma = w$ that peaks at $1$ for $\\mathrm{atan2}(y, x) = \\Phi_{\\eta}$ and has an amplitude of $1 - \\eta$. The attenuation factor is of the form\n\n", "itemtype": "equation", "pos": 127557, "prevtext": "\nwhere $Q_{\\mathrm{sca}}$ is the scattering efficiencies calculated with the Mie theory and $S_{11}(\\theta)$ is the scattering phase function.\n\nIn the model parametrization, we define two quantities for the image itself, the number of pixels $n_{\\mathrm{p}}$ (images are squares) and the size $l_\\mathrm{p}$ of one pixel in units of AU. Then, for each of the $n_{\\mathrm{p}}^2$ pixels in the image, we first apply adequate projection and rotation to account for the geometrical parameters $i$ and $\\phi$ (inclination and position angle, respectively). For $\\phi = 0^{\\circ}$, the semi-major axis is along the South-North direction, and the front side of the disk is chosen to be on the East side. For increasing $\\phi$ the disk rotates counter-clockwise, towards the East.\n\nSince the disk has an non-zero opening angle $\\psi$, it is not infinitely flat in the vertical direction. As in other codes (e.g. \\textsc{GRaTeR}, \\citealp{Augereau1999}), we assume a vertical Gaussian profile for the dust distribution, with a $\\sigma$ width equal to $\\psi$. This avoids having ``blocky'' images, especially for highly inclined disks. Figure\\,\\ref{fig:rays} shows a crude sketch of a cut in the $(y,z)$ reference plane of the disk, for $x = 0$. The disk has an inclination $i$ and for each pixel, we trace rays along the line of sight and search for intersections with the disk. The disk can be described by four main geometrical shapes: inner and outer shells, and upper and lower planes. Each of them can be either ``entry'' or ``exit'' points for the rays (blue and yellow lines in Fig.\\,\\ref{fig:rays}, respectively). One should note that only slightly different intersection conditions are to be considered for cases where $\\pi/2 - i <  \\psi$ (e.g., edge-on disk) and that the code can produce images for such disks. We can therefore obtain the coordinates of both the entry and exit points ($D_\\mathrm{En}$ and $D_\\mathrm{Ex}$, respectively). Since a pixel has a size $l_\\mathrm{p}$, the column between $D_\\mathrm{En}$ and $D_\\mathrm{Ex}$ (modulus of $|l|$) has a volume of $l_{\\mathrm{p}}^2 \\times |l|$. Since this column can probe a significant range of distances $r$ to the star, we divide it into $n_{\\mathrm{los}}$ boxes, along the line the sight. For each of these boxes, we evaluate the distance to the star $r$, the volume of the box $V_{\\mathrm{box}}$, and the scattering angle (dot product between the line of sight and the position in the disk with respect to the star). We then interpolate $F_{\\mathrm{th}}$, $F_{\\mathrm{scat}}$, and $N_{\\mathrm{dens}}$ at the distance $r$ of the center of the box, and interpolate the phase function at the scattering angle. We then sum the product $F_{\\mathrm{th/scat}} \\times N_{\\mathrm{dens}} \\times V_{\\mathrm{box}}$ for each boxes, to obtain both the scattered light and thermal emission for this given pixel.\n\n\\subsubsection{Polarized images}\n\nThe code can also produce polarized light images on top of the total intensity images. Neglecting multiple scattering events, a reasonable assumption in optically thin disks, we compute $F_{\\mathrm{pol}} (\\lambda, r_{\\mathrm{j}}, s_{\\mathrm{k}}, \\theta)$ similarly to Eqn.\\,\\ref{eqn:Fscat} simply replacing $S_{11}$ by $S_{12}$. The second element of the M\\\"uller matrix $S_{12}$ is calculated using the Mie theory (while $S_{11}$ can be approximated by the Henyey-Greenstein function). We can therefore produce synthetic images along the Stokes vector $Q$, which can be used to model polarimetric observations.\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{eccentric_sketch.pdf}\n\\caption{Sketch of an eccentric disk. The color-coding represents the density distribution. The rotation angle is indicated by $\\Phi_{\\mathrm{e}}$, the reference angle for the azimuthal variation by $\\Phi_{\\eta}$, and $\\eta = 0.3$ in this example.}\n\\label{fig:ecc}\n\\end{figure}\n\n\\subsubsection{Eccentric disks}\n\nThe code can produce images of eccentric disks. The inner and outer shells as described in Figure\\,\\ref{fig:rays} are modified to inner and outer walls with an eccentricity $e$ parameter and a rotation angle $\\Phi_{\\mathrm{e}}$ (see Fig.\\,\\ref{fig:ecc} for a sketch of a face-on disk). For each pixel in the image, at position $(x,y)$ (in the reference frame rotated by $\\Phi_{\\mathrm{e}}$), we check if it is in between the inner and outer walls, which are defined as,\n\n\n", "index": 29, "text": "\\begin{equation}\\label{eqn:ecc}\n\\mathrm{Wall}_{\\,\\mathrm{inner,\\,outer}} = \\frac{r_{\\mathrm{in,\\,out}}}{1 + e \\times \\mathrm{cos}[a + \\Phi_{\\mathrm{e}}]},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{Wall}_{\\,\\mathrm{inner,\\,outer}}=\\frac{r_{\\mathrm{in,\\,out}}}{1+e%&#10;\\times\\mathrm{cos}[a+\\Phi_{\\mathrm{e}}]},\" display=\"block\"><mrow><mrow><msub><mi>Wall</mi><mrow><mpadded lspace=\"1.7pt\" width=\"+1.7pt\"><mi>inner</mi></mpadded><mo rspace=\"4.2pt\">,</mo><mi>outer</mi></mrow></msub><mo>=</mo><mfrac><msub><mi>r</mi><mrow><mi>in</mi><mo rspace=\"4.2pt\">,</mo><mi>out</mi></mrow></msub><mrow><mn>1</mn><mo>+</mo><mrow><mrow><mi>e</mi><mo>×</mo><mi>cos</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>a</mi><mo>+</mo><msub><mi mathvariant=\"normal\">Φ</mi><mi mathvariant=\"normal\">e</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07861.tex", "nexttext": "\nFor $\\Phi_{\\eta} = \\phi = 0^{\\circ}$, the density maximum is located on the South side. For a given azimuthal angle, $N_{\\mathrm{dens}}$ is multiplied by $N_{\\mathrm{att}}$ before computing the image.\n\n\n\\section{Results}\n\n\\begin{figure*}\n\\includegraphics[width=2\\columnwidth]{emcee_H.pdf}\n\\caption{Projected posterior probability distributions for the combined modeling of the ADI and DPI $H$ band observations.}\n\\label{fig:pdf_H}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{sketch_best.pdf}\n\\caption{Top view of the dust density distribution (normalized to its maximum) for the best fit model to the SPHERE observations. The direction to the observer is indicated by the arrow, and the spatial scale in the lower right corner.}\n\\label{fig:best_sketch}\n\\end{figure}\n\n\\section{Miscellaneous}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{Uphi.pdf}\n\\caption{$U_{\\phi}$ component of the $H$ band DPI observations.}\n\\label{fig:uphi}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=1.0\\columnwidth]{uv_plane.pdf}\n\\caption{Coverage of the (u,v) plane for the ALMA observations used in this paper.}\n\\label{fig:uvplane}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=1.2\\columnwidth]{ell_phase_function.pdf}\n\\caption{Elliptical mask binned over different scattering angles to depict how the phase function is calculated. The second bin of the phase function would be the mean flux in the region highlighted in white. The color coding shows the scattering angle for a given position in the elliptical mask. The central circle shows the numerical mask to hide the central region.}\n\\label{fig:ell_pfunc}\n\\end{figure}\n\n\n\n\n\\begin{table*}\n\\centering\n\\caption{Notations used in this study.\\label{tab:notations}}\n\\begin{tabular}{@{}lcr@{}}\n\\hline\\hline\nNotations & Units & Explanation \\\\\n\\hline\n\n\\hline\n$L_{\\star}$ & $[L_{\\odot}]$ & Stellar luminosity \\\\\n$M_{\\star}$ & $[M_{\\odot}]$ & Stellar mass \\\\\n$R_{\\star}$ & $[R_{\\odot}]$ & Stellar radius \\\\\n$T_{\\star}$ & [K] & Stellar effective temperature \\\\\n$d_{\\star}$         & [pc] & Stellar distance \\\\\n$i$ & [$^{\\circ}$] & Inclination of the disk \\\\\n$\\phi$ & [$^{\\circ}$] & Position angle of the disk (disk aligned North-South for $\\phi = 0^{\\circ}$, front side is towards the East) \\\\\n$r_{0}$             & [AU] & Semi latus rectum, the semi-major axis of the disk being $r_0 / (1-e^2)$ \\\\\n$e$                 &      & Eccentricity of the disk \\\\\n$\\eta$              &      & Dust density damping factor \\\\\n$\\Phi_{\\mathrm{e}}$ & [$^{\\circ}$] & \\specialcell{Reference angle to define the pericenter (along the semi-major\\\\axis, at the southern side for $\\Phi_{\\mathrm{e}} = \\phi = 0^{\\circ}$)} \\\\\n$\\Phi_{\\eta}$ & [$^{\\circ}$] & \\specialcell{Reference angle for the peak density (along the semi-major\\\\axis, at the southern side for $\\Phi_{\\eta} = \\phi = 0^{\\circ}$)} \\\\\n$w$ & [$^{\\circ}$] & Width of the Gaussian profile for the azimuthal dust density variation\\\\\n$g$ & & Asymmetry parameter for the HG phase function \\\\\n$\\alpha_{\\mathrm{in}}$ &      & Slope for the inner dust density distribution \\\\\n$\\alpha_{\\mathrm{out}}$ &     & Slope for the outer dust density distribution \\\\\n$\\psi$ & [rad] & Opening angle of the disk \\\\\n$\\beta$ &  & Radiation pressure to gravitational forces ratio \\\\\n$s_{\\mathrm{blow}}$ & [$\\umu$m] & Dust grain size for which $\\beta = 0.5$ \\\\\n$s_{\\mathrm{min}}$ & [$\\umu$m] & Minimum grain size used in the model\\\\\n$s_{\\mathrm{max}}$ & [mm] & Maximum grain size \\\\\n$p$ & - & Grain size distribution exponent \\\\\n$f_{1300}$ & [mJy] & Flux at 1.3\\,mm \\\\\n\n$f_{\\mathrm{ice}}$ & & Fraction of water ice mixed to the dust opacity\\\\\n$f_{\\mathrm{porosity}}$ & & Fraction of vacuum mixed to the dust opacity\\\\\nM$_{\\mathrm{dust}}$ & [M$_{\\oplus}$] & Dust mass \\\\\n$f_{\\mathrm{ADI}}$ & [arbitrary] & Scaling factor for the ADI images \\\\\n\\hline\n\\end{tabular}\n\\end{table*}\n\n\n", "itemtype": "equation", "pos": 128316, "prevtext": "\nwhere $a = \\mathrm{atan2}(y, x)$. For $\\Phi_{\\mathrm{e}} = \\phi = 0^{\\circ}$, the pericenter is located on the South side.\n\n\\subsubsection{Azimuthal density variations}\n\nIt is also possible to introduce azimuthal dust density variations in the synthetic images. It is parametrized with three parameters: a damping factor $\\eta$ ($0 \\leq \\eta \\leq 1$), a reference angle $\\Phi_{\\eta}$, and the azimuthal variation follows a Gaussian profile of $\\sigma = w$ that peaks at $1$ for $\\mathrm{atan2}(y, x) = \\Phi_{\\eta}$ and has an amplitude of $1 - \\eta$. The attenuation factor is of the form\n\n", "index": 31, "text": "\\begin{equation}\n N_{\\mathrm{att}}(x, y) = \\eta + (1 - \\eta) \\times \\mathrm{exp}\\frac{-(\\mathrm{atan}(y,x) - \\Phi_{\\eta})^2}{2w^2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"N_{\\mathrm{att}}(x,y)=\\eta+(1-\\eta)\\times\\mathrm{exp}\\frac{-(\\mathrm{atan}(y,x%&#10;)-\\Phi_{\\eta})^{2}}{2w^{2}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>N</mi><mi>att</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>η</mi><mo>+</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>η</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>×</mo><mi>exp</mi></mrow><mo>⁢</mo><mfrac><mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>atan</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>y</mi><mo>,</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msub><mi mathvariant=\"normal\">Φ</mi><mi>η</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>w</mi><mn>2</mn></msup></mrow></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]