[{"file": "1601.01701.tex", "nexttext": "\nwhere $A(SFH, Z/Z_{\\odot})$ is the slope of the $D_{n}4000$--age relation, and $B$ its normalization. From eq.~\\ref{eq:D4000age}, it is therefore possible to express the \nHubble parameter as:\n\n", "itemtype": "equation", "pos": 10038, "prevtext": "\n\n\\maketitle\n\\flushbottom\n\n\n\\section{Introduction}\nAlmost 15 years have now passed since the discovery of the accelerated expansion of the Universe, based on the\nwork by refs. \\cite{Riess1998} and \\cite{Perlmutter1999}. Since then, constraining the expansion rate of the Universe as a function\nof redshift $H(z)$ has become one of the most compelling tasks of modern cosmology, since it determines the scale factor $a(t)$ in \nthe Friedmann-Lemaitre-Robertson-Walker (FLRW) metric; as a consequence, this allows us to probe the properties of the fundamental \ncomponents of the Universe, helping to better understand their nature. \nWidening the panorama of cosmological probes is therefore of extreme interest, in order to take advantage of the strength of \neach method and to keep systematics under control (for a detailed review, see ref.~\\cite{Weinberg2013}).\n\nSo far, the best measurements have been obtained with standard candles (SNe) \\cite{Riess1998,Perlmutter1999} \nand standard rulers (BAO) \\cite{Eisenstein2005,Cole2005}. These cosmological probes have provided exceptional results over the last \ndecades, and contributed, together with the study of the Cosmic Microwave \nBackground (CMB) \\cite{Planck2015}, to the development of the standard $\\Lambda$CDM cosmological model. \nOne of their main limitations, however, is that they do not constrain the Hubble\nparameter {\\color{black}directly}, but one of its integrals (e.g., the luminosity distance \\cite{Riess1998}) or the parameters that are used to model it.\nIn order to set constraints on the cosmological model, it is necessary to obtain an independent determination of the expansion \nrate, which could then be used to test the model itself.\n\nA possible way to achieve this task is given by the ``cosmic chronometers'' method. According to this method, firstly suggested by \nref.~\\cite{Jimenez2002}, the relative age of old and passive galaxies $dz/dt$ can be used to directly constrain the expansion history of the Universe. The \nmost important point to emphasize is that because the differential dating of passively evolving galaxies only depends on atomic \nphysics and does not include any integrated distance measurement over redshift, it is independent of the cosmological \nmodel or assumptions about the metric, and thus can be used to place constraints on it.\n\nIn ref.~\\cite{Moresco2012a}, analyzing a sample of $\\sim$11000 massive and passive galaxies, eight new measurements of the \nHubble parameter have been provided with an accuracy of $\\sim$5-12\\% in the redshift range $0.15<z<1.1$, significantly extending the redshift \ncoverage and precision of previous similar analysis \\cite{Simon2005,Stern2010}. The majority of the sample in this work was at low redshift \n($z<0.3$), where the most accurate constraints were obtained. The potential of this new method in comparison with more standard probes has been \nstudied by many authors \\cite{Moresco2012b, Zhao2012,Wang2012, Sorensen2013}, which demonstrated how the cosmic chronometers method \ncan be competitive for many aspects with Supernovae type Ia (SNe) and Baryon Acoustic Oscillation (BAO) in constraining cosmological parameters.\n\nIn this paper, we want to exploit the phenomenal set of data provided by the SDSS-III Baryon Oscillation Spectroscopic Survey (BOSS, \n\\cite{Schlegel2009,Eisenstein2011,Dawson2013}), which represents the largest sample of massive galaxies spectra available so far at $0.2<z<0.8$, to provide \nnew $H(z)$ measurements with the highest possible accuracy at these redshifts. This sample allows us to minimize all possible \nuncertainties, by improving the statistics used so far by $\\sim$2 orders of magnitude at these redshifts. \nBOSS data also represent a very well defined spectroscopic sample, being targeted to select the most massive envelope of the galaxy population at these \nredshifts \\cite{Maraston2013}. Moreover, the redshift range probed by BOSS proves to be fundamental to set cosmology independent \nconstraints on the redshift at which the Universe expansion turns from decelerated to accelerated, which we refer to as the cosmological \ntransition redshift \\cite{Riess2007,Lima2012,Capozziello2014,Capozziello2015}.\n\nThis paper is organized as follows. In section \\ref{sec:method} we introduce the technique, its potential drawbacks and how they are addressed. In\nsection \\ref{sec:data} we describe how the dataset has been selected and describe its properties. In section \\ref{sec:analysis} we\nprovide the stellar metallicity constraints for our sample. We also discuss how the relation between parameters and observables used\nin the method has been obtained and calibrated. Finally, in section \\ref {sec:results} we present our results, providing five new $H(z)$\npoints in the redshift range $0.35<z<0.5$, and using them, in combination with available literature data, to obtain new constraints\non the cosmological transition redshift.\n\n\n\\section{Method: the cosmic chronometers approach}\n\\label{sec:method}\nAn accurate measurement of the expansion rate as a function of cosmic time is extremely challenging. \nAn alternative and promising method is the ``cosmic chronometers'' approach, which uses the fact that \nthe expansion rate can be expressed as $H(z) ={\\dot a}/a = -1/(1+z)\\, dz/dt$.\nSince the quantity $dz$ is obtained from spectroscopic surveys with high accuracy, the only quantity to be measured is the differential \nage evolution of the Universe ($dt$) in a given redshift interval ($dz$). Therefore, a measurement of $dt$ corresponds to a direct \ncosmology-independent measurement of the Hubble parameter. \nThere are two main challenges to be faced: the identification of an optimal tracer of the aging of the Universe \nwith redshift (a ``cosmic chronometer''), and the reliable dating of its age.\n\nThe best cosmic chronometers are galaxies that are evolving passively on a timescale much longer than their age difference. \nBased on several observational results, there is general agreement that these are massive (${\\cal M}_{\\rm stars}>10^{11}\n{\\cal M}_{\\odot}$) early-type galaxies which formed the vast majority ($>$90\\%) of their stellar mass {\\color{black} rapidly ($\\sim$0.1-0.3 Gyr) early in the Universe\n(at high-redshifts $z >2-3$), and have not experienced any subsequent major episode of star formation since. Therefore they are\nthe oldest objects at any redshift \\cite{Treu2005,Renzini2006,Thomas2005,Thomas2010,Pozzetti2010,Conroy2014,\nMcDermid2015}. Thus, when observed at cosmic times considerably later than their formation epoch, the age evolution of their stars serves a clock \nthat is synchronized with the evolution of cosmic time. \nPrevious works \\cite{Bender1998,Carson2010,Moresco2011,Moresco2012a} have also demonstrated that it is possible to obtain reliable and accurate cosmic \nchronometers using passively evolving selected galaxies. Recently, the independent analysis of SDSS-DR8 luminous red galaxies by ref.~\\cite{Liu2015} has \nconfirmed that massive and quiescent galaxies can be reliably used as cosmic chronometers.\n  \nIt is important to underline that the main strength of this method is that it relies on a {\\em differential approach}. On the one hand, it should be noted that the relevant \nquantities in this approach are the relative ages $dt$, which have the advantage of factorizing out systematic effects inherent to absolute age estimates. \nOn the other hand, this method allows us to keep under control many observational biases which may \naffects this analysis. One of the main issues is the so-called progenitor bias \\cite{Franx1996,Vandokkum2000}, for which \nhigh-redshift ETGs are biased by sampling only the oldest and more massive progenitors of more local galaxies, \ntherefore changing the slope of the age-redshift relation. This effect is more severe when galaxy samples are \ncompared in wide redshift ranges, but here each \n$H(z)$ value is estimated within small redshift slices, with $\\Delta z=0.1$ (as discussed in section \\ref{sec:Hz})\ncorresponding to a difference in cosmic time of approximatively 0.7 Gyr at $z\\sim0.45$. This is a rather short time for a \npotential significant evolution of these massive and passive systems, in particular considering that \non average they would require more than the age of the Universe to double their mass \\cite{Pozzetti2010,Moresco2013}. \nMoreover, the progenitor bias dominates the low-mass range of the distribution, whereas BOSS galaxies have been selected \nto be the most massive galaxies ($\\rm log(M/M_{\\odot})\\gtrsim11$) between $0.3<z<0.7$ (see Fig. 1 of \nref.~\\cite{Maraston2013}), and further divided in bin of velocity dispersion, which is a proxy for stellar mass.\n\nTo minimize the dependence of the age estimate on evolutionary stellar population synthesis (EPS) models, refs.~\\cite{Moresco2011,Moresco2012a} proposed an improvement \nto this technique, consisting in studying a direct observable of galaxy spectra, the 4000~\\AA~ break ($D4000$), instead of galaxy ages. \nThe $D4000$ feature is a break in the observed spectrum of galaxies defined as the ratio between the continuum flux densities $\\langle F_{\\nu}\\rangle$ in a red band \nand a blue band around 4000~\\AA~restframe \\cite{Bruzual1983}. The break originates from the onset of a series of metal absorption features, and is known to correlate \nwith the stellar metallicity and age of the stellar population \\cite{Hamilton1985}, and to be less dependent on the star formation history (SFH) for old stellar populations. \nDifferent choices have been proposed to measure the $D4000$, changing \nthe range of the red and blue bands \\cite{Bruzual1983,Hamilton1985,Balogh1999}. In this work, we considered the definition with narrower bands ($D_{n}4000$, \n3850--3950~\\AA~and 4000--4100~\\AA), since it has been shown to be less affected by potential reddening effects \\cite{Balogh1999}.\nThe assumption of a linear relation between $D4000$ and age of a galaxy has been proven to be an extremely good approximation for various $D4000$ ranges \n(see refs.~\\cite{Moresco2011,Moresco2012a}), i.e.\n\n", "index": 1, "text": "\\begin{equation}\nD_{n}4000=A(SFH, Z/Z_{\\odot})\\cdot {\\rm age} + B ,\n\\label{eq:D4000age}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"D_{n}4000=A(SFH,Z/Z_{\\odot})\\cdot{\\rm age}+B,\" display=\"block\"><mrow><mrow><mrow><msub><mi>D</mi><mi>n</mi></msub><mo>⁢</mo><mn>4000</mn></mrow><mo>=</mo><mrow><mrow><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>H</mi></mrow><mo>,</mo><mrow><mi>Z</mi><mo>/</mo><msub><mi>Z</mi><mo>⊙</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>age</mi></mrow><mo>+</mo><mi>B</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01701.tex", "nexttext": "\nwhere now statistical and systematic effects have been decoupled. The factor $dz/dD_{n}4000$ is only dependent \non observables, while degeneracies between parameters or assumptions of EPS models \nare contained in the factor $A(SFH, Z/Z_{\\odot})$. The main source of systematic errors is the adopted EPS model that quantifies the dependence of the  \n$D_{n}4000$ on age, metallicity Z and SFH. \n\nIn ref.~\\cite{Moresco2012a} it was demonstrated that this new approach, which relies on the spectroscopic differential evolution of cosmic chronometers, is extremely \nrobust against the choice of EPS models, and does not strongly depend on the SFH assumptions, the reason being that the selection criteria adopted significantly reduce the \npossibility of having prolonged SFHs, and spectra are usually well-fit with models with short star formation bursts. \n\n\n\\section{Data and sample selection}\n\\label{sec:data}\n\nThe BOSS survey was designed to accurately map the clustering of large-scale structures up to $z\\sim0.7$, and in particular to measure the baryonic acoustic oscillation scale \nand constrain the expansion history of the Universe. It collected both photometric and spectroscopic\ndata for $\\sim$1.5 million galaxies over approximatively 10000 square degrees. The sample comprises the standard $ugriz$ SDSS photometry;\nthe spectroscopic sample has been photometrically targeted with a color cut in the $(g-r)$-$(r-i)$ plane to select the most massive galaxies \nwithin a passively evolving population, and with a nearly constant number density as a function of redshift up to $z\\sim0.7$ \\cite{White2011,Eisenstein2011}.\nBOSS spectra are obtained at a resolution $\\rm R\\sim2000$ in the observed wavelength range 3750--10000~\\AA. Stellar masses for a large BOSS sample \nhave been obtained by ref. \\cite{Maraston2013} through a best fit of the observed photometry. Throughout this work, we considered the estimates obtained \nassuming a Kroupa initial mass function, accounting for stellar mass losses from stellar evolution. Ref. \\cite{Thomas2013} estimated \nemission lines properties and stellar velocity dispersions on the same sample.\n\nStarting from BOSS Data Release 9 (DR9), we considered all galaxies with measured stellar masses, emission lines and stellar velocity dispersions, \nobtaining an original sample consisting of 848697 galaxies for which the $D_{n}4000$ index has been measured. \n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=0, width=0.45\\textwidth]{histmass_BOSS_def_vdisp.ps}\n\\includegraphics[angle=0, width=0.45\\textwidth]{histz_BOSS_def_vdisp.ps}\n\\caption{Stellar mass (left panel) and redshift (right panel) distributions, colored by the various velocity dispersion subsamples.\n\\label{fig:masshist}}\n\\end{center}\n\\end{figure}\n\nAs discussed in section \\ref{sec:method}, the ``cosmic chronometers'' method relies on the selection of an optimal sample of massive and passive galaxies, minimally \ncontaminated by star-forming galaxies outliers. A star-forming population, with its evolving properties (in terms of age, mass, metal content) as a function of cosmic time, \ncould potentially bias the results. On the contrary, as already discussed, the most massive and passive galaxies represent the most homogeneous sample in terms of\nepoch and timescale of formation, thus being the best tracers of the age of the Universe as a function of redshift. It is therefore of utmost importance to ensure the purity of the\nsample by removing all galaxies with residual on-going star formation. A combination of selection cuts in color, spectroscopic properties, and stellar mass \n(${\\cal M}_{\\rm stars} \\gtrsim 10^{10.75} {\\cal M}_{\\odot}$) has been demonstrated to maximize the purity of such a passively evolving galaxy sample \\cite{Moresco2013}.\\\\\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{cccccc}\n\\hline\n\\hline\nsubsample & redshift &$\\sigma$ &$\\rm log(M/M_{\\odot})$ & S/N($D_{n}4000$) & \\# of\\\\\n $\\rm[km/s]$ & range &[km/s] & & & galaxies\\\\\n\\hline\n$\\sigma\\le150$ & $0.45-0.55$ & 133 $\\pm$ 17 & 11.22 $\\pm$ 0.18 & $11.8^{+51.2}_{-5.1}$ & 5557 \\\\\n$150<\\sigma\\le200$ & $0.32-0.65$ & 182 $\\pm$ 16 & 11.25 $\\pm$ 0.18 & $11.9^{+53.9}_{-4.9}$ & 22710 \\\\\n$200<\\sigma\\le250$ & $0.33-0.75$ & 226 $\\pm$ 18 & 11.31 $\\pm$ 0.19 & $12.1^{+53.9}_{-4.9}$ & 45995 \\\\\n$250<\\sigma\\le300$ & $0.35-0.8$ & 271 $\\pm$ 17 & 11.37 $\\pm$ 0.21 & $12.4^{+54.2}_{-5}$ & 36958 \\\\\n$\\sigma>300$ & $0.45-0.85$ & 331 $\\pm$ 32 & 11.46 $\\pm$ 0.22 & $12.6^{+57.8}_{-5.2}$ & 22677 \\\\\n\\hline\n\\hline\n\\end{tabular}\n\\caption{Median properties of the sample measured on individual galaxies in each velocity dispersion subsamples.}\n\\label{tab:sample_prop}\n\\end{center}\n\\end{table}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=-90, width=0.98\\textwidth]{spectra_BOSS_massz.ps}\n\\includegraphics[angle=-90, width=0.98\\textwidth]{spectra_BOSS_massz_zoom_def.ps}\n\\caption{Median stacked spectra as a function of redshift bins and $\\rm\\sigma$ bins (the upper and lower panels of each plot respectively). The spectra in the upper panels of\neach plot are extracted at fixed $\\rm\\sigma$ (grey lines, ${\\rm 250<\\sigma<300}$), while the spectra in the lower panels are extracted at fixed redshift (colored lines, $z\\sim0.4$). \nThe upper plots show the median spectra. All spectra have been normalized near to the vertical dashed lines; therefore the differences in the upper panels \nflatten at higher wavelengths, but the steepening of the slope of the continuum with increasing mass and decreasing redshift is evident. This trend may be interpreted in the framework \nof the ``mass-downsizing'' scenario, with more massive galaxies being redder and older than less massive ones. \nThe lower plots are zoom-in around three specific absorption features, i.e. $D_{n}4000$, H$\\beta$, and Fe5015, highlighted in yellow; it is also shown, highlighted in green,\nthe region corresponding to [OIII]$\\lambda$5007 line.\n\\label{fig:spectra}}\n\\end{center}\n\\end{figure}\nWe therefore applied the following cuts to obtain our sample.\n\\begin{itemize}\n\\item {\\bf Color cut.} We selected galaxies with a color $\\rm(g-i)>2.35$ \\cite{Maraston2013}, which was proven to select `early-type' (passive) galaxies \n\\cite{Masters2011}.\n\\item {\\bf Emission line cut.} We selected galaxies without detectable emission lines, where the main cut has been done on the $\\rm[OII]\\lambda$3727 line, since, given the\nwavelength range, it is measurable throughout the entire redshift range. We selected galaxies with an equivalent width (EW) $\\rm EW([OII])<5$~\\AA~and a \nsignal-to-noise ratio (S/N(EW)) $<$ 2. The sample has been further \ncleaned by discarding galaxies with significant emission in $\\rm H\\alpha$, $\\rm[OIII]\\lambda$5008 and $\\rm H\\beta$, namely at $S/N(EW)>2$.\n\\item {\\bf $\\mathbf{D_{n}4000}$ measurement cut.} To remove low-quality measurements corresponding to spectra with lower $S/N$, we selected galaxies with an error \n$\\sigma(D_{n}4000)<0.25$, obtaining on average a S/N$(D_{n}4000)>10$.\n\\end{itemize}\nThe final sample contains 133912 galaxies, and represents the largest sample of massive and passive \ngalaxies to date, improving current statistics by $\\sim$2 orders of magnitude at these redshifts. \nThis sample was further divided into 5 velocity dispersion bins: $\\sigma<150$, \n$150<\\sigma<200$, $200<\\sigma<250$, $250<\\sigma<300$, and $\\sigma>300$ km/s. The properties of the various subsamples are reported in \nTab. \\ref{tab:sample_prop}, and the stellar mass and redshift distributions are shown in figure \\ref{fig:masshist}.\n\nMedian stacked spectra have been created for each subsample by co-adding individual spectra in redshift bins of $\\Delta z=0.025$, and the results are shown in figure \\ref{fig:spectra}.\nThe redshift binning has been optimized by choosing the smallest width for which the median $D_{n}4000$--z were not noise dominated; the choice of a small binning allows to follow\nthe redshift evolution without excessive smoothing.\n\nThe stacked spectra presented in figure \\ref{fig:spectra} are typical of a passive population, with a clear red continuum, characteristic absorption features and no noticeable emission lines, \ndemonstrating the effectiveness of the implemented selection criteria.\nA zoom-in around three specific lines is shown for $D_{n}4000$, H$\\beta$, and Fe5015 respectively. The H$\\beta$ absorption line is a feature which is almost independent of metallicity, \ndepending mostly only on the age of the galaxy population, being shallower for high ages. From the visual inspection of this line the aging of galaxies with cosmic time is evident, with \ngalaxies at higher redshifts being younger. Fe5015 is instead a good proxy of the metallicity of the galaxy; in this case no significant trend with redshift can be noticed, giving a hint of no metallicity \nevolution of this population with cosmic time. The absence of clearly visible [OIII]$\\lambda$5007 line shows the purity of the sample, where all contamination from emission-line galaxies \nhas been removed.\n\n\\section{Analysis}\n\\label{sec:analysis}\nIn this section we discuss the methods used to constrain the stellar metallicity Z and to measure and calibrate the $D_{n}4000$--z relations.\n\\subsection{Constraining the stellar metallicity}\n\\label{sec:metallicity}\nThe stellar metallicity Z of the various subsamples has been estimated from full spectral fitting of the median stacked spectra, in bins of redshift and velocity dispersion.\nThe measurements have been performed on the median stacked spectra to increase the $S/N$ from a typical value of about $\\rm5/\\AA$ for individual galaxies \\cite{Thomas2013} to \nabout $\\rm300-600/\\AA$ around $\\rm\\lambda_{rest}=5000$~\\AA. Depending on the considered bin, the final spectra were obtained by stacking from $\\sim1500$ up to $\\sim5000$ \ngalaxies (Tab.~\\ref{tab:sample_prop}). Moreover, in ref. \\cite{Citro2015} it was verified that the measurement of the metallicity on individual spectra is consistent with the one obtained on \nmedian stacked spectra. It is worth also noting that ref.~\\cite{MaStro} found a general agreement between estimates obtained from full spectral fitting and from other techniques \n(e.g. Lick indices), and these results have been more recently confirmed by ref.~\\cite{Conroy2014}.\n\nDifferent codes have been used to estimate the mass-weighted metallicity, and the results compared to quantify the robustness of the measurements, namely STARLIGHT \\cite{Cid2005}, \nVESPA \\cite{Tojeiro2007} and FIREFLY \\cite{Wilkinson2015b}.\nTo further assess the dependence of the results on the assumed parameters, each code has been run adopting two different EPS model, Bruzual \\& \nCharlot (2003) (hereafter BC03, \\cite{BC03}) and Maraston \\& Str{\\\"o}mb{\\\"a}ck (2011) (hereafter M11, \\cite{MaStro}). These two models present substantial differences, \nsuch as the treatment of the thermally pulsating asymptotic giant branch phase, the method used to estimate integrated spectra, and the stellar evolutionary \nmodels adopted to build the isochrones (for more extensive discussion, see e.g. \\cite{Maraston2006,MaStro}). Moreover, they are also based on independent libraries of stellar \nspectra, the latest MILES models \\cite{Falcon2011} for M11 and STELIB \\cite{LeBorgne2003} for BC03. The M11 models are based on a selection of libraries of empirical \nstellar spectra (Pickles, ELODIE, and STELIB), but we studied the ones with MILES models to be consistent with the work done in previous analysis \\cite{Moresco2012a}.\nThe two models provide similar metallicity ranges for exploration: \n$Z/Z_{\\odot}=[0.4,1,2.5]$ for BC03 and $Z/Z_{\\odot}=[0.5,1,2]$ for M11, and have a similar resolution, 3~\\AA~across the wavelength range from 3200~\\AA~to \n9500~\\AA~for BC03 \\cite{BC03}, and 2.54~\\AA~across the wavelength range from 3525~\\AA~to 7500~\\AA~for M11 \\cite{Beifiori2011}, similar to BOSS \nspectra \\cite{Smee2013}.\\\\ The full spectral fitting codes applied to estimate the metallicity are described here:\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.9\\textwidth]{metz_STARLIGHT_vdisp_4_norm.ps}\n\\caption{Stellar metallicity estimated from full spectral fitting with STARLIGHT, VESPA and FIREFLY (respectively left, center and right panels),\nand adopting M11 and BC03 models (respectively upper and lower panels). The grey shaded region represents the mean value, averaged\nbetween all models and codes, as discussed in the text.\n\\label{fig:metFit}}\n\\end{center}\n\\end{figure}\n\\begin{itemize}\n\\item The full-spectrum fitting code STARLIGHT \\cite{Cid2004,Cid2005} provides a fit to both the galaxy spectral continuum and spectral features. It simultaneously fits a stellar \npopulation mix, which is given as a combination of spectra defined in user-made libraries, the global stellar velocity dispersion and the amount of dust extinction (in terms of $A_{V}$). \nThe contribution of each library spectrum to the best fit model is enclosed in the so-called light-fraction and mass-fraction population vectors, which contain, respectively, the light \nand the mass fractions with which each library model contributes to the best fit spectrum at a reference wavelength $\\lambda$. The best fit model is then derived by exploring the\nparameters space through a mixture of simulated annealing and Metropolis-Hasting Markov Chain Monte Carlo techniques.\n\\item VErsatile Spectral Analysis (VESPA, \\cite{Tojeiro2007,Tojeiro2009}) is a full spectral fitting code to recover non-parametric star-formation and metallicity histories from optical \nspectra. VESPA works on a grid of ages logarithmically binned between 0.02 and 14 Gyr with a resolution adaptable to the quality of the data, increasing the resolution only where \nthe data demand it. VESPA imposes no constraints on the amount of star formation or metallicity in each age bin. VESPA finds the best-fit solution by appropriately linearizing the \nproblem and then performing a single matrix inversion to solve the problem. Errors and full covariance matrices are computed by perturbing and then fitting \nthe original best-fit solution a number of times. Dust attenuation is modeled according to either a one or two-parameter mixed-slab dust model of ref. \\cite{Charlot2000}. \n\\item FIREFLY \\cite{Wilkinson2015b} is a full spectral fitting code designed to recover galaxy properties and their errors as a function of input model ingredients, \nsuch as stellar library, whilst also mapping out stellar population property degeneracies from both the inherent degeneracies in galaxy spectra and errors in the data. It constructs \nlinear combinations of single burst in order to build up complex star formation histories. It has been tested to work well down to signal-to-noise of 5 \\cite{Wilkinson2015b}, and \nincludes an innovative method for treating the effects of dust attenuation and flux calibration through use of Fourier filters. The spectral fitting is adapted to the specific\nvelocity dispersion of the data.\n\\end{itemize}\n\nThe mass-weighted stellar metallicity estimated for the various ETG subsamples is shown in figure \\ref{fig:metFit}. The various fits show on average a slightly over-solar metallicity, \nwith a value $Z/Z_{\\odot}\\sim1-1.5$. This result is both expected on a theoretical basis, and confirmed by other independent analysis. On a theoretical basis, for galaxies which have fully\nexhausted their gas reservoir, having completed their mass assembly at high redshift and being passively evolving since then, a negligible evolution in stellar metallicity is \nexpected. Moreover refs.~\\cite{Panter2003,Gallazzi2005,Panter2007,Panter2008,Thomas2010} analyzing the Sloan Digital Sky Survey at redshifts $0<z<0.3$ similarly found a \nslightly oversolar metallicity for galaxies with masses $\\rm log(M/M_{\\odot})\\sim11$, and these measurements are confirmed also for galaxies of the same mass at much higher redshifts \n($z\\sim$1.5--2 \\cite{Toft2012,Onodera2015}).\n\nWhile no statistically significant difference is detectable between the best-fits obtained with the different codes, FIREFLY presents a slightly larger dispersion,\nthat could be due to the fact that it does not assume, as STARLIGHT, a fixed velocity dispersion. A slight difference is present between BC03 and M11 estimates, with BC03 values \npreferring a metallicity $Z/Z_{\\odot}\\sim1.5$ while M11 $Z/Z_{\\odot}\\sim1.25$; this difference is due to the difference in colors between the two models, as discussed e.g. in \nrefs.~\\cite{MaStro,Maraston2006}. It is important to notice that all best-fits find a negligible metallicity evolution, in agreement with what found from the visual inspection of the \nmedian spectra (see figure \\ref{fig:spectra}), confirming that galaxies have been evolving little over the redshift range probed.\n\nTo be as conservative as possible, we therefore decided to average the six metallicity estimates obtained with all models and codes, so that the dispersion of the obtained \ndistribution takes all the systematic uncertainties into account. In this way, we obtain a mean value for the stellar metallicity of $Z/Z_{\\odot}=1.35\\pm0.3$. We verified\nthat this estimate is also stable when calculating the median, or restricting the redshift range, being always compatible within the errorbars.\n\n\n\\subsection{Measuring and calibrating the median $D_{n}4000$--z relations}\n\\label{sec:D4000meas}\n\nFor each velocity dispersion subsample, we calculated the median $D_{n}4000$ from the individual measurements with a $\\Delta z=0.025$ redshift binning. The associated error\nhas been estimated using the median absolute deviation (MAD), defined as $\\mathrm{MAD}=1.482\\cdot \\mathrm{median}(|D_{n}4000-\\mathrm{median}\n(D_{n}4000)|)$), divided by $\\sqrt{N}$, i.e. $\\sigma_{med}(D_{n}4000)=\\mathrm{MAD}/\\sqrt{N}$ \\cite{Hoaglin1983}. We verified that the median value obtained\nfrom the individual galaxies is consistent with the value estimated on the median stacked spectrum in each bin.\n\nSigma-clipping has been applied to both red and blue $D_{n}4000$ bands of the spectrum, to remove contamination of \nresidual night sky emission lines (see figure \\ref{fig:sky}). This method provided results compatible with other approaches, but is more generic and less \ndependent on various assumptions (see appendix \\ref{sec:appsky}). The BOSS spectrograph is composed of two separate instruments, a red and a a blue arm, connected at \n$\\lambda\\sim6000$~\\AA. Any mis-calibration would impact the $D_{n}4000$ feature at $z\\sim0.5-0.6$. Indeed a strong \ncontamination (not clearly evident by visual inspection, but well detectable in the median relations) persists in all \nsubsamples in the form of a wiggle of the $D_{n}4000$--z relations at $0.5<z<0.65$. For this reason we decided to \nrestrict our analysis to $z<0.5$ (see figure \\ref{fig:throughput} in the Appendix). A more detailed discussion can be found in appendix \\ref{sec:appspectro}.\n\nThe median $D_{n}4000$--z relations are shown in the upper panel of figure \\ref{fig:HzD4000}. These relations show a clear pattern, where more massive\ngalaxies present a larger break, confirming what was found in the analysis of ref.~\\cite{Moresco2011}. This result can be interpreted in terms of redshift of formation, in particular for the\nthree bins with the higher velocity dispersions where a smaller difference in metallicity is noticeable. For these samples it can be inferred that more massive galaxies are \nolder and have formed their stellar mass at higher redshifts with respect to less massive ones, providing another observational confirmation to the mass-downsizing \nscenario \\cite{Fontana2004,Thomas2005,Cimatti2007,Cimatti2009,Thomas2010}.\n\nWe estimated the quantity $A(SFH, Z/Z_{\\odot})$ of eq. \\ref{eq:HzD4000} following the approach of \nref.~\\cite{Moresco2012a}. The $D_{n}4000$ range has been divided into two regimes \n($1.6<D_{n}4000<1.8$ and $1.8<D_{n}4000<1.95$) within which the linear approximation between \n$D_{n}4000$ and age holds with very high accuracy \\cite{Moresco2012a}. The quantity \n$A(SFH,Z/Z_{\\odot})$ has been then evaluated by averaging the slope of the $D4000$--age relations\nfor each model (M11 and BC03) and at fixed metallicity, for four different SFHs, characteristic of the selected passive \npopulation (a delayed exponentially declining SFH has been chosen, with $\\tau=0.05, 0.1, 0.2, 0.3$ Gyr). \nThe dispersion between the different SFHs has been taken into account as the associated error to \n$A(SFH,Z/Z_{\\odot})$; the results for M11 and BC03 models are listed in Tab.~\\ref{tab:Aparam}.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{|llcc|}\n\\hline \\hline\n& & $1.6<D_{n}4000<1.8$ & $1.8<D_{n}4000<1.95$\\\\\n\\hline\nM11 & $A(Z/Z_{\\odot}=0.5)$&$0.0299\\pm0.0002$&$0.0305\\pm0.0005$\\\\\nM11 & $A(Z/Z_{\\odot}=1)$&$0.065\\pm 0.001$&$0.119\\pm0.003$\\\\\nM11 & $A(Z/Z_{\\odot}=2)$&$0.138\\pm0.02$&$0.22\\pm0.02$\\\\\n\\hline\nBC03 & $A(Z/Z_{\\odot}=0.4)$&$0.02893\\pm0.00004$&$0.037\\pm0.001$\\\\\nBC03 & $A(Z/Z_{\\odot}=1)$&$0.0602\\pm 0.001$&$0.145\\pm0.007$\\\\\nBC03 & $A(Z/Z_{\\odot}=2.5)$&$0.193\\pm0.002$&$0.29\\pm0.06$\\\\\n\\hline \\hline\n\\end{tabular}\n\\caption{$A(SFH,Z/Z_{\\odot}))$ obtained from eq.~\\ref{eq:D4000age} calibrating the $D_{n}4000$-age relation (in units of [Gyr$^{-1}$] \nfor the M11 and BC03 models with different metallicities and for different $D_{n}4000$ ranges. The quoted errors are \nthe dispersion between the values evaluated for different SFH choices, as discussed in the text..}\n\\label{tab:Aparam}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.95\\textwidth]{D4000_z_BOSS_Hz_vdisp_def_mod2.ps}\n\\caption{Upper panel: median $D_{n}4000$--z relations obtained for the various velocity dispersion subsamples. The dashed lines show the theoretical $D_{n}4000$--z\nrelations estimated from M11 models (with solar metallicity) for four differed redshifts of formation, respectively 1, 1.5, 2, 2.5 from bottom to top. Lower panel: $H(z)$ \nmeasurements obtained with BC03 and M11 models, compared with literature data available in this redshift range \\cite{Simon2005,Stern2010,Moresco2012a}. \nFor illustrative purpose, the estimates obtained with BC03 models have been slightly offset in redshift.\n\\label{fig:HzD4000}}\n\\end{center}\n\\end{figure}\n\n\\section{Results}\n\\label{sec:results}\n\\subsection{The estimate of $H(z)$}\n\\label{sec:Hz}\nWe estimated the Hubble parameter $H(z)$ from eq. \\ref{eq:HzD4000}. \nTo keep under control the systematic uncertainties, we performed the analysis separately with two different EPS\nmodels, BC03 and M11, and then compared the results.\nThe method to estimate $A(SFH,Z/Z_{\\odot})$ has been discussed \nin section \\ref{sec:D4000meas}. The stellar metallicity has been taken from the analysis presented in section \\ref{sec:metallicity}, $Z/Z_{\\odot}=1.35\\pm0.3$. \nThe differential $dz/dD_{n}4000$ has been obtained from the median $D_{n}4000$--z relation presented in the upper \npanel of figure \\ref{fig:HzD4000}, considering the difference between the $i$-th and the $(i+N)$-th point for each velocity dispersion subsample. \nWe have chosen $N=4$ as a trade-off to minimize the statistical scatter of the data over the intrinsic $D_{n}4000$ evolution with redshift, simultaneously \nmaximizing the redshift sampling of $H(z)$. We therefore consider a redshift interval $\\Delta z=0.1$, which corresponds to a difference in cosmic time \n$\\sim0.7$ Gyr at $z\\sim0.45$. We checked that different choices of $N$ (provided not to be dominated by the statistical scatter of the data) do not affect the results.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{||c||ccc|cc||ccc|cc||}\n\\hline\n& \\multicolumn{5}{|c||}{M11 models} & \\multicolumn{5}{c||}{BC03 models} \\\\\n$z$ & $H(z)$ & $\\sigma_{stat}$ & $\\sigma_{syst}$ & $\\sigma_{tot}$ & \\% error & $H(z)$ & $\\sigma_{stat}$ & $\\sigma_{syst}$ & $\\sigma_{tot}$ & \\% error\\\\\n\\hline\n0.3802 & 89.3 & 3.2 & 13.7 & 14.1 & 15.8\\% & 83.0 & 4.3 & 12.9 & 13.5 & 16.3\\% \\\\\n0.4004 & 82.8 & 2.4 & 10.3 & 10.6 & 12.8\\% & 77.0 & 2.1 & 10 & 10.2 & 13.2\\% \\\\\n0.4247 & 93.7 & 2.7 & 11.4 & 11.7 & 12.4\\% & 87.1 & 2.4 & 11 & 11.2 & 12.9\\% \\\\\n0.4497 & 99.7 & 3.1 & 13 & 13.4 & 13.4\\% & 92.8 & 4.5 & 12.1 & 12.9 & 13.9\\% \\\\\n0.4783 & 86.6 & 2 & 8.5 & 8.7 & 10.1\\% & 80.9 & 2.1 & 8.8 & 9 & 11.2\\% \\\\\n\\hline \\hline\n$\\langle 0.4293\\rangle$ & 91.8 & 1 & 5.1 & 5.3 & 5.8\\% & 85.7 & 1 & 5.1 & 5.2 & 6.1\\% \\\\\n\\hline\n\\end{tabular}\n\\caption{$H(z)$ measurements (in units of [km/Mpc/s) and their errors. The relative contribution of statistical and systematic errors\nare reported, as well as the total error (estimated by summing in quadrature \n$\\sigma_{stat}$ and $\\sigma_{syst}$). These values have been estimated with M11 and BC03 EPS models respectively. \nFor each model the averaged measurement is also reported. This dataset can be downloaded from \nhttp://www.physics-astronomy.unibo.it/en/research/areas/astrophysics/cosmology-with-cosmic-chronometers.}\n\\label{tab:Hz}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.95\\textwidth]{BOSS_Hz_vdisp_def_4_M11.ps}\n\\caption{Hubble parameter constraints obtained with M11 models, compared with various literature data \\cite{Simon2005,Stern2010,Moresco2012a,Zhang2014,Moresco2015}.\nThe black point at $z=0$ is the Hubble constant constraints from ref.~\\cite{Riess2011} with the recalibration of the distance to NGC 4258 from ref.~\\cite{Humphreys2013}, i.e \n$H_{0}=73\\pm2.4$ km/s/Mpc. The solid line and the dashed regions are not a fit to the data, but show the fiducial flat $\\Lambda$CDM cosmology with its 1$\\sigma$ uncertainty \nas constrained by Planck collaboration (\\cite{Planck2015}, $H_{0}=67.8\\pm0.9$ km/s/Mpc, $\\Omega_{m}=0.308\\pm0.012$). For comparison an Einstein-de Sitter \nmodel is shown, normalized to the same $H_{0}$.\n\\label{fig:Hz2}}\n\\end{center}\n\\end{figure}\n\nThe $H(z)$ measurements extracted from the different $\\sigma$ subsamples are in good agreement, and, being statistically \nindependent, they have been combined together averaging them in bins of $\\Delta z=0.025$; we use a weighted \nmean where the weights are the corresponding error of each measurement. The results are shown in figure \\ref{fig:HzD4000}, \nand presented in Tab.~\\ref{tab:Hz}. Exploiting BOSS data, we are able to map homogeneously for the first time\nthe redshift range $0.3<z<0.5$ with an accuracy between 11\\% and 16\\%, which, as can be seen by figure \\ref{fig:HzD4000}, \nwas previously only poorly covered. The comparison between the results obtained with the two different EPS models also shows a good \nagreement, always $<1\\sigma$, confirming the robustness of the estimate as found in ref.~\\cite{Moresco2012a}. Despite the \nlarger statistic of this analysis with respect to the one of ref.~\\cite{Moresco2012a}, however, we have similar errorbars. This is \ndue to the fact that in this work we have larger uncertainty on the slope $dz/dD_{n}4000$ since we are using smaller redshift \narm ($\\Delta z=0.1$ instead of 0.3).\nPrecise measurements in this redshift range are crucial to better constrain the time at which our Universe passed from decelerated to accelerated expansion. \n\nAnalyzing Tab.~\\ref{tab:Hz}, it is clear that, with the exceptional statistics provided by the BOSS data, systematics are now\ndominating over statistical errors. Since the systematics themselves are mainly dominated by the uncertainty on metallicity \nand by the EPS model, additional work is needed to improve on the current analysis.\nWe plan to address this issue by exploiting the present dataset in a following paper, with a full and detailed spectral analysis.\n\nTo exploit the full constraining power of BOSS data, we decide also to provide a single $H(z)$ measurement, in which all mass subsamples have been averaged as discussed above,\nbut in a single point. This measurement is clearly not independent of the results reported in Tab. \\ref{tab:Hz}, and should not be used in combination with them. \nThe resulting constraint adopting M11 models is $H(z=0.4293)=91.8\\pm5.3$ km/s/Mpc, and $H(z=0.4293)=85.7\\pm5.2$ km/s/Mpc using BC03 models, \nreaching a 6\\% accuracy including both statistic and systematic errors. \nAs a comparison, we report the results obtained from the BAO analysis in the final BOSS DR12 \\cite{Cuesta2015}, where it is found \n$H(z=0.57)r_{\\rm d}/r^{\\rm fid}_{\\rm d}=100.3\\pm3.4$ km/s/Mpc and $H(z=0.32)r_{\\rm d}/r^{\\rm fid}_{\\rm d}=79.2\\pm5.5$ km/s/Mpc. Considering that\n$r^{\\rm fid}_{\\rm d}=147.10$ Mpc and $r_{\\rm d}=147.41\\pm0.30$ from Planck analysis \\cite{Planck2015}, these measurements correspond to $H(z=0.57)=100.1\\pm 3.4$ and \n$H(z=0.32)=79.0\\pm5.5$km/s/Mpc, respectively a 3.4\\% and 6.9\\% measurement.\n\n\\subsection{The measurement of the transition redshift}\n\nThe cosmological transition redshift $z_{t}$ is defined as the redshift which separates the accelerated and decelerated expansion phases \nof the Universe. The BOSS data map the redshift range close to this epoch of cosmic re-acceleration homogeneously for \nthe first time, and therefore allow us to measure it with cosmic chronometers with high accuracy.\nWe constrained $z_{t}$ by fitting all the ``cosmic chronometers'' data available so far in the literature \n\\cite{Simon2005,Stern2010,Moresco2012a,Zhang2014,Moresco2015}, including the ones obtained in this work, with a standard \n$\\chi^{2}$ approach. In this analysis, we have considered the measurements obtained assuming BC03 models, for consistency \nwith literature derivations, as presented in Tab.~\\ref{tab:Hzall} and figure \\ref{fig:Hz2}.\n\nThe transition redshift determination can be done in the standard (model-dependent) way, assuming a Friedmann-Robertson-Walker \nmetric and general relativity (i.e. $\\Lambda$CDM-like cosmological model), and in a model-independent way. \n\nFirst of all, we consider an open $\\Lambda$CDM cosmology:\n\n", "itemtype": "equation", "pos": 10333, "prevtext": "\nwhere $A(SFH, Z/Z_{\\odot})$ is the slope of the $D_{n}4000$--age relation, and $B$ its normalization. From eq.~\\ref{eq:D4000age}, it is therefore possible to express the \nHubble parameter as:\n\n", "index": 3, "text": "\\begin{equation}\nH(z)=-\\frac{1}{1+z} A(SFH, Z/Z_{\\odot}) \\frac{dz}{dD_{n}4000} ,\n\\label{eq:HzD4000}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"H(z)=-\\frac{1}{1+z}A(SFH,Z/Z_{\\odot})\\frac{dz}{dD_{n}4000},\" display=\"block\"><mrow><mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow></mfrac><mo>⁢</mo><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>S</mi><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mi>H</mi></mrow><mo>,</mo><mrow><mi>Z</mi><mo>/</mo><msub><mi>Z</mi><mo>⊙</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>z</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>D</mi><mi>n</mi></msub><mo>⁢</mo><mn>4000</mn></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01701.tex", "nexttext": "\nwhere $\\Omega_{k}=1-\\Omega_{m}-\\Omega_{\\Lambda}$. The transition redshift can be written as:\n\n", "itemtype": "equation", "pos": 40143, "prevtext": "\nwhere now statistical and systematic effects have been decoupled. The factor $dz/dD_{n}4000$ is only dependent \non observables, while degeneracies between parameters or assumptions of EPS models \nare contained in the factor $A(SFH, Z/Z_{\\odot})$. The main source of systematic errors is the adopted EPS model that quantifies the dependence of the  \n$D_{n}4000$ on age, metallicity Z and SFH. \n\nIn ref.~\\cite{Moresco2012a} it was demonstrated that this new approach, which relies on the spectroscopic differential evolution of cosmic chronometers, is extremely \nrobust against the choice of EPS models, and does not strongly depend on the SFH assumptions, the reason being that the selection criteria adopted significantly reduce the \npossibility of having prolonged SFHs, and spectra are usually well-fit with models with short star formation bursts. \n\n\n\\section{Data and sample selection}\n\\label{sec:data}\n\nThe BOSS survey was designed to accurately map the clustering of large-scale structures up to $z\\sim0.7$, and in particular to measure the baryonic acoustic oscillation scale \nand constrain the expansion history of the Universe. It collected both photometric and spectroscopic\ndata for $\\sim$1.5 million galaxies over approximatively 10000 square degrees. The sample comprises the standard $ugriz$ SDSS photometry;\nthe spectroscopic sample has been photometrically targeted with a color cut in the $(g-r)$-$(r-i)$ plane to select the most massive galaxies \nwithin a passively evolving population, and with a nearly constant number density as a function of redshift up to $z\\sim0.7$ \\cite{White2011,Eisenstein2011}.\nBOSS spectra are obtained at a resolution $\\rm R\\sim2000$ in the observed wavelength range 3750--10000~\\AA. Stellar masses for a large BOSS sample \nhave been obtained by ref. \\cite{Maraston2013} through a best fit of the observed photometry. Throughout this work, we considered the estimates obtained \nassuming a Kroupa initial mass function, accounting for stellar mass losses from stellar evolution. Ref. \\cite{Thomas2013} estimated \nemission lines properties and stellar velocity dispersions on the same sample.\n\nStarting from BOSS Data Release 9 (DR9), we considered all galaxies with measured stellar masses, emission lines and stellar velocity dispersions, \nobtaining an original sample consisting of 848697 galaxies for which the $D_{n}4000$ index has been measured. \n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=0, width=0.45\\textwidth]{histmass_BOSS_def_vdisp.ps}\n\\includegraphics[angle=0, width=0.45\\textwidth]{histz_BOSS_def_vdisp.ps}\n\\caption{Stellar mass (left panel) and redshift (right panel) distributions, colored by the various velocity dispersion subsamples.\n\\label{fig:masshist}}\n\\end{center}\n\\end{figure}\n\nAs discussed in section \\ref{sec:method}, the ``cosmic chronometers'' method relies on the selection of an optimal sample of massive and passive galaxies, minimally \ncontaminated by star-forming galaxies outliers. A star-forming population, with its evolving properties (in terms of age, mass, metal content) as a function of cosmic time, \ncould potentially bias the results. On the contrary, as already discussed, the most massive and passive galaxies represent the most homogeneous sample in terms of\nepoch and timescale of formation, thus being the best tracers of the age of the Universe as a function of redshift. It is therefore of utmost importance to ensure the purity of the\nsample by removing all galaxies with residual on-going star formation. A combination of selection cuts in color, spectroscopic properties, and stellar mass \n(${\\cal M}_{\\rm stars} \\gtrsim 10^{10.75} {\\cal M}_{\\odot}$) has been demonstrated to maximize the purity of such a passively evolving galaxy sample \\cite{Moresco2013}.\\\\\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{cccccc}\n\\hline\n\\hline\nsubsample & redshift &$\\sigma$ &$\\rm log(M/M_{\\odot})$ & S/N($D_{n}4000$) & \\# of\\\\\n $\\rm[km/s]$ & range &[km/s] & & & galaxies\\\\\n\\hline\n$\\sigma\\le150$ & $0.45-0.55$ & 133 $\\pm$ 17 & 11.22 $\\pm$ 0.18 & $11.8^{+51.2}_{-5.1}$ & 5557 \\\\\n$150<\\sigma\\le200$ & $0.32-0.65$ & 182 $\\pm$ 16 & 11.25 $\\pm$ 0.18 & $11.9^{+53.9}_{-4.9}$ & 22710 \\\\\n$200<\\sigma\\le250$ & $0.33-0.75$ & 226 $\\pm$ 18 & 11.31 $\\pm$ 0.19 & $12.1^{+53.9}_{-4.9}$ & 45995 \\\\\n$250<\\sigma\\le300$ & $0.35-0.8$ & 271 $\\pm$ 17 & 11.37 $\\pm$ 0.21 & $12.4^{+54.2}_{-5}$ & 36958 \\\\\n$\\sigma>300$ & $0.45-0.85$ & 331 $\\pm$ 32 & 11.46 $\\pm$ 0.22 & $12.6^{+57.8}_{-5.2}$ & 22677 \\\\\n\\hline\n\\hline\n\\end{tabular}\n\\caption{Median properties of the sample measured on individual galaxies in each velocity dispersion subsamples.}\n\\label{tab:sample_prop}\n\\end{center}\n\\end{table}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[angle=-90, width=0.98\\textwidth]{spectra_BOSS_massz.ps}\n\\includegraphics[angle=-90, width=0.98\\textwidth]{spectra_BOSS_massz_zoom_def.ps}\n\\caption{Median stacked spectra as a function of redshift bins and $\\rm\\sigma$ bins (the upper and lower panels of each plot respectively). The spectra in the upper panels of\neach plot are extracted at fixed $\\rm\\sigma$ (grey lines, ${\\rm 250<\\sigma<300}$), while the spectra in the lower panels are extracted at fixed redshift (colored lines, $z\\sim0.4$). \nThe upper plots show the median spectra. All spectra have been normalized near to the vertical dashed lines; therefore the differences in the upper panels \nflatten at higher wavelengths, but the steepening of the slope of the continuum with increasing mass and decreasing redshift is evident. This trend may be interpreted in the framework \nof the ``mass-downsizing'' scenario, with more massive galaxies being redder and older than less massive ones. \nThe lower plots are zoom-in around three specific absorption features, i.e. $D_{n}4000$, H$\\beta$, and Fe5015, highlighted in yellow; it is also shown, highlighted in green,\nthe region corresponding to [OIII]$\\lambda$5007 line.\n\\label{fig:spectra}}\n\\end{center}\n\\end{figure}\nWe therefore applied the following cuts to obtain our sample.\n\\begin{itemize}\n\\item {\\bf Color cut.} We selected galaxies with a color $\\rm(g-i)>2.35$ \\cite{Maraston2013}, which was proven to select `early-type' (passive) galaxies \n\\cite{Masters2011}.\n\\item {\\bf Emission line cut.} We selected galaxies without detectable emission lines, where the main cut has been done on the $\\rm[OII]\\lambda$3727 line, since, given the\nwavelength range, it is measurable throughout the entire redshift range. We selected galaxies with an equivalent width (EW) $\\rm EW([OII])<5$~\\AA~and a \nsignal-to-noise ratio (S/N(EW)) $<$ 2. The sample has been further \ncleaned by discarding galaxies with significant emission in $\\rm H\\alpha$, $\\rm[OIII]\\lambda$5008 and $\\rm H\\beta$, namely at $S/N(EW)>2$.\n\\item {\\bf $\\mathbf{D_{n}4000}$ measurement cut.} To remove low-quality measurements corresponding to spectra with lower $S/N$, we selected galaxies with an error \n$\\sigma(D_{n}4000)<0.25$, obtaining on average a S/N$(D_{n}4000)>10$.\n\\end{itemize}\nThe final sample contains 133912 galaxies, and represents the largest sample of massive and passive \ngalaxies to date, improving current statistics by $\\sim$2 orders of magnitude at these redshifts. \nThis sample was further divided into 5 velocity dispersion bins: $\\sigma<150$, \n$150<\\sigma<200$, $200<\\sigma<250$, $250<\\sigma<300$, and $\\sigma>300$ km/s. The properties of the various subsamples are reported in \nTab. \\ref{tab:sample_prop}, and the stellar mass and redshift distributions are shown in figure \\ref{fig:masshist}.\n\nMedian stacked spectra have been created for each subsample by co-adding individual spectra in redshift bins of $\\Delta z=0.025$, and the results are shown in figure \\ref{fig:spectra}.\nThe redshift binning has been optimized by choosing the smallest width for which the median $D_{n}4000$--z were not noise dominated; the choice of a small binning allows to follow\nthe redshift evolution without excessive smoothing.\n\nThe stacked spectra presented in figure \\ref{fig:spectra} are typical of a passive population, with a clear red continuum, characteristic absorption features and no noticeable emission lines, \ndemonstrating the effectiveness of the implemented selection criteria.\nA zoom-in around three specific lines is shown for $D_{n}4000$, H$\\beta$, and Fe5015 respectively. The H$\\beta$ absorption line is a feature which is almost independent of metallicity, \ndepending mostly only on the age of the galaxy population, being shallower for high ages. From the visual inspection of this line the aging of galaxies with cosmic time is evident, with \ngalaxies at higher redshifts being younger. Fe5015 is instead a good proxy of the metallicity of the galaxy; in this case no significant trend with redshift can be noticed, giving a hint of no metallicity \nevolution of this population with cosmic time. The absence of clearly visible [OIII]$\\lambda$5007 line shows the purity of the sample, where all contamination from emission-line galaxies \nhas been removed.\n\n\\section{Analysis}\n\\label{sec:analysis}\nIn this section we discuss the methods used to constrain the stellar metallicity Z and to measure and calibrate the $D_{n}4000$--z relations.\n\\subsection{Constraining the stellar metallicity}\n\\label{sec:metallicity}\nThe stellar metallicity Z of the various subsamples has been estimated from full spectral fitting of the median stacked spectra, in bins of redshift and velocity dispersion.\nThe measurements have been performed on the median stacked spectra to increase the $S/N$ from a typical value of about $\\rm5/\\AA$ for individual galaxies \\cite{Thomas2013} to \nabout $\\rm300-600/\\AA$ around $\\rm\\lambda_{rest}=5000$~\\AA. Depending on the considered bin, the final spectra were obtained by stacking from $\\sim1500$ up to $\\sim5000$ \ngalaxies (Tab.~\\ref{tab:sample_prop}). Moreover, in ref. \\cite{Citro2015} it was verified that the measurement of the metallicity on individual spectra is consistent with the one obtained on \nmedian stacked spectra. It is worth also noting that ref.~\\cite{MaStro} found a general agreement between estimates obtained from full spectral fitting and from other techniques \n(e.g. Lick indices), and these results have been more recently confirmed by ref.~\\cite{Conroy2014}.\n\nDifferent codes have been used to estimate the mass-weighted metallicity, and the results compared to quantify the robustness of the measurements, namely STARLIGHT \\cite{Cid2005}, \nVESPA \\cite{Tojeiro2007} and FIREFLY \\cite{Wilkinson2015b}.\nTo further assess the dependence of the results on the assumed parameters, each code has been run adopting two different EPS model, Bruzual \\& \nCharlot (2003) (hereafter BC03, \\cite{BC03}) and Maraston \\& Str{\\\"o}mb{\\\"a}ck (2011) (hereafter M11, \\cite{MaStro}). These two models present substantial differences, \nsuch as the treatment of the thermally pulsating asymptotic giant branch phase, the method used to estimate integrated spectra, and the stellar evolutionary \nmodels adopted to build the isochrones (for more extensive discussion, see e.g. \\cite{Maraston2006,MaStro}). Moreover, they are also based on independent libraries of stellar \nspectra, the latest MILES models \\cite{Falcon2011} for M11 and STELIB \\cite{LeBorgne2003} for BC03. The M11 models are based on a selection of libraries of empirical \nstellar spectra (Pickles, ELODIE, and STELIB), but we studied the ones with MILES models to be consistent with the work done in previous analysis \\cite{Moresco2012a}.\nThe two models provide similar metallicity ranges for exploration: \n$Z/Z_{\\odot}=[0.4,1,2.5]$ for BC03 and $Z/Z_{\\odot}=[0.5,1,2]$ for M11, and have a similar resolution, 3~\\AA~across the wavelength range from 3200~\\AA~to \n9500~\\AA~for BC03 \\cite{BC03}, and 2.54~\\AA~across the wavelength range from 3525~\\AA~to 7500~\\AA~for M11 \\cite{Beifiori2011}, similar to BOSS \nspectra \\cite{Smee2013}.\\\\ The full spectral fitting codes applied to estimate the metallicity are described here:\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.9\\textwidth]{metz_STARLIGHT_vdisp_4_norm.ps}\n\\caption{Stellar metallicity estimated from full spectral fitting with STARLIGHT, VESPA and FIREFLY (respectively left, center and right panels),\nand adopting M11 and BC03 models (respectively upper and lower panels). The grey shaded region represents the mean value, averaged\nbetween all models and codes, as discussed in the text.\n\\label{fig:metFit}}\n\\end{center}\n\\end{figure}\n\\begin{itemize}\n\\item The full-spectrum fitting code STARLIGHT \\cite{Cid2004,Cid2005} provides a fit to both the galaxy spectral continuum and spectral features. It simultaneously fits a stellar \npopulation mix, which is given as a combination of spectra defined in user-made libraries, the global stellar velocity dispersion and the amount of dust extinction (in terms of $A_{V}$). \nThe contribution of each library spectrum to the best fit model is enclosed in the so-called light-fraction and mass-fraction population vectors, which contain, respectively, the light \nand the mass fractions with which each library model contributes to the best fit spectrum at a reference wavelength $\\lambda$. The best fit model is then derived by exploring the\nparameters space through a mixture of simulated annealing and Metropolis-Hasting Markov Chain Monte Carlo techniques.\n\\item VErsatile Spectral Analysis (VESPA, \\cite{Tojeiro2007,Tojeiro2009}) is a full spectral fitting code to recover non-parametric star-formation and metallicity histories from optical \nspectra. VESPA works on a grid of ages logarithmically binned between 0.02 and 14 Gyr with a resolution adaptable to the quality of the data, increasing the resolution only where \nthe data demand it. VESPA imposes no constraints on the amount of star formation or metallicity in each age bin. VESPA finds the best-fit solution by appropriately linearizing the \nproblem and then performing a single matrix inversion to solve the problem. Errors and full covariance matrices are computed by perturbing and then fitting \nthe original best-fit solution a number of times. Dust attenuation is modeled according to either a one or two-parameter mixed-slab dust model of ref. \\cite{Charlot2000}. \n\\item FIREFLY \\cite{Wilkinson2015b} is a full spectral fitting code designed to recover galaxy properties and their errors as a function of input model ingredients, \nsuch as stellar library, whilst also mapping out stellar population property degeneracies from both the inherent degeneracies in galaxy spectra and errors in the data. It constructs \nlinear combinations of single burst in order to build up complex star formation histories. It has been tested to work well down to signal-to-noise of 5 \\cite{Wilkinson2015b}, and \nincludes an innovative method for treating the effects of dust attenuation and flux calibration through use of Fourier filters. The spectral fitting is adapted to the specific\nvelocity dispersion of the data.\n\\end{itemize}\n\nThe mass-weighted stellar metallicity estimated for the various ETG subsamples is shown in figure \\ref{fig:metFit}. The various fits show on average a slightly over-solar metallicity, \nwith a value $Z/Z_{\\odot}\\sim1-1.5$. This result is both expected on a theoretical basis, and confirmed by other independent analysis. On a theoretical basis, for galaxies which have fully\nexhausted their gas reservoir, having completed their mass assembly at high redshift and being passively evolving since then, a negligible evolution in stellar metallicity is \nexpected. Moreover refs.~\\cite{Panter2003,Gallazzi2005,Panter2007,Panter2008,Thomas2010} analyzing the Sloan Digital Sky Survey at redshifts $0<z<0.3$ similarly found a \nslightly oversolar metallicity for galaxies with masses $\\rm log(M/M_{\\odot})\\sim11$, and these measurements are confirmed also for galaxies of the same mass at much higher redshifts \n($z\\sim$1.5--2 \\cite{Toft2012,Onodera2015}).\n\nWhile no statistically significant difference is detectable between the best-fits obtained with the different codes, FIREFLY presents a slightly larger dispersion,\nthat could be due to the fact that it does not assume, as STARLIGHT, a fixed velocity dispersion. A slight difference is present between BC03 and M11 estimates, with BC03 values \npreferring a metallicity $Z/Z_{\\odot}\\sim1.5$ while M11 $Z/Z_{\\odot}\\sim1.25$; this difference is due to the difference in colors between the two models, as discussed e.g. in \nrefs.~\\cite{MaStro,Maraston2006}. It is important to notice that all best-fits find a negligible metallicity evolution, in agreement with what found from the visual inspection of the \nmedian spectra (see figure \\ref{fig:spectra}), confirming that galaxies have been evolving little over the redshift range probed.\n\nTo be as conservative as possible, we therefore decided to average the six metallicity estimates obtained with all models and codes, so that the dispersion of the obtained \ndistribution takes all the systematic uncertainties into account. In this way, we obtain a mean value for the stellar metallicity of $Z/Z_{\\odot}=1.35\\pm0.3$. We verified\nthat this estimate is also stable when calculating the median, or restricting the redshift range, being always compatible within the errorbars.\n\n\n\\subsection{Measuring and calibrating the median $D_{n}4000$--z relations}\n\\label{sec:D4000meas}\n\nFor each velocity dispersion subsample, we calculated the median $D_{n}4000$ from the individual measurements with a $\\Delta z=0.025$ redshift binning. The associated error\nhas been estimated using the median absolute deviation (MAD), defined as $\\mathrm{MAD}=1.482\\cdot \\mathrm{median}(|D_{n}4000-\\mathrm{median}\n(D_{n}4000)|)$), divided by $\\sqrt{N}$, i.e. $\\sigma_{med}(D_{n}4000)=\\mathrm{MAD}/\\sqrt{N}$ \\cite{Hoaglin1983}. We verified that the median value obtained\nfrom the individual galaxies is consistent with the value estimated on the median stacked spectrum in each bin.\n\nSigma-clipping has been applied to both red and blue $D_{n}4000$ bands of the spectrum, to remove contamination of \nresidual night sky emission lines (see figure \\ref{fig:sky}). This method provided results compatible with other approaches, but is more generic and less \ndependent on various assumptions (see appendix \\ref{sec:appsky}). The BOSS spectrograph is composed of two separate instruments, a red and a a blue arm, connected at \n$\\lambda\\sim6000$~\\AA. Any mis-calibration would impact the $D_{n}4000$ feature at $z\\sim0.5-0.6$. Indeed a strong \ncontamination (not clearly evident by visual inspection, but well detectable in the median relations) persists in all \nsubsamples in the form of a wiggle of the $D_{n}4000$--z relations at $0.5<z<0.65$. For this reason we decided to \nrestrict our analysis to $z<0.5$ (see figure \\ref{fig:throughput} in the Appendix). A more detailed discussion can be found in appendix \\ref{sec:appspectro}.\n\nThe median $D_{n}4000$--z relations are shown in the upper panel of figure \\ref{fig:HzD4000}. These relations show a clear pattern, where more massive\ngalaxies present a larger break, confirming what was found in the analysis of ref.~\\cite{Moresco2011}. This result can be interpreted in terms of redshift of formation, in particular for the\nthree bins with the higher velocity dispersions where a smaller difference in metallicity is noticeable. For these samples it can be inferred that more massive galaxies are \nolder and have formed their stellar mass at higher redshifts with respect to less massive ones, providing another observational confirmation to the mass-downsizing \nscenario \\cite{Fontana2004,Thomas2005,Cimatti2007,Cimatti2009,Thomas2010}.\n\nWe estimated the quantity $A(SFH, Z/Z_{\\odot})$ of eq. \\ref{eq:HzD4000} following the approach of \nref.~\\cite{Moresco2012a}. The $D_{n}4000$ range has been divided into two regimes \n($1.6<D_{n}4000<1.8$ and $1.8<D_{n}4000<1.95$) within which the linear approximation between \n$D_{n}4000$ and age holds with very high accuracy \\cite{Moresco2012a}. The quantity \n$A(SFH,Z/Z_{\\odot})$ has been then evaluated by averaging the slope of the $D4000$--age relations\nfor each model (M11 and BC03) and at fixed metallicity, for four different SFHs, characteristic of the selected passive \npopulation (a delayed exponentially declining SFH has been chosen, with $\\tau=0.05, 0.1, 0.2, 0.3$ Gyr). \nThe dispersion between the different SFHs has been taken into account as the associated error to \n$A(SFH,Z/Z_{\\odot})$; the results for M11 and BC03 models are listed in Tab.~\\ref{tab:Aparam}.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{|llcc|}\n\\hline \\hline\n& & $1.6<D_{n}4000<1.8$ & $1.8<D_{n}4000<1.95$\\\\\n\\hline\nM11 & $A(Z/Z_{\\odot}=0.5)$&$0.0299\\pm0.0002$&$0.0305\\pm0.0005$\\\\\nM11 & $A(Z/Z_{\\odot}=1)$&$0.065\\pm 0.001$&$0.119\\pm0.003$\\\\\nM11 & $A(Z/Z_{\\odot}=2)$&$0.138\\pm0.02$&$0.22\\pm0.02$\\\\\n\\hline\nBC03 & $A(Z/Z_{\\odot}=0.4)$&$0.02893\\pm0.00004$&$0.037\\pm0.001$\\\\\nBC03 & $A(Z/Z_{\\odot}=1)$&$0.0602\\pm 0.001$&$0.145\\pm0.007$\\\\\nBC03 & $A(Z/Z_{\\odot}=2.5)$&$0.193\\pm0.002$&$0.29\\pm0.06$\\\\\n\\hline \\hline\n\\end{tabular}\n\\caption{$A(SFH,Z/Z_{\\odot}))$ obtained from eq.~\\ref{eq:D4000age} calibrating the $D_{n}4000$-age relation (in units of [Gyr$^{-1}$] \nfor the M11 and BC03 models with different metallicities and for different $D_{n}4000$ ranges. The quoted errors are \nthe dispersion between the values evaluated for different SFH choices, as discussed in the text..}\n\\label{tab:Aparam}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.95\\textwidth]{D4000_z_BOSS_Hz_vdisp_def_mod2.ps}\n\\caption{Upper panel: median $D_{n}4000$--z relations obtained for the various velocity dispersion subsamples. The dashed lines show the theoretical $D_{n}4000$--z\nrelations estimated from M11 models (with solar metallicity) for four differed redshifts of formation, respectively 1, 1.5, 2, 2.5 from bottom to top. Lower panel: $H(z)$ \nmeasurements obtained with BC03 and M11 models, compared with literature data available in this redshift range \\cite{Simon2005,Stern2010,Moresco2012a}. \nFor illustrative purpose, the estimates obtained with BC03 models have been slightly offset in redshift.\n\\label{fig:HzD4000}}\n\\end{center}\n\\end{figure}\n\n\\section{Results}\n\\label{sec:results}\n\\subsection{The estimate of $H(z)$}\n\\label{sec:Hz}\nWe estimated the Hubble parameter $H(z)$ from eq. \\ref{eq:HzD4000}. \nTo keep under control the systematic uncertainties, we performed the analysis separately with two different EPS\nmodels, BC03 and M11, and then compared the results.\nThe method to estimate $A(SFH,Z/Z_{\\odot})$ has been discussed \nin section \\ref{sec:D4000meas}. The stellar metallicity has been taken from the analysis presented in section \\ref{sec:metallicity}, $Z/Z_{\\odot}=1.35\\pm0.3$. \nThe differential $dz/dD_{n}4000$ has been obtained from the median $D_{n}4000$--z relation presented in the upper \npanel of figure \\ref{fig:HzD4000}, considering the difference between the $i$-th and the $(i+N)$-th point for each velocity dispersion subsample. \nWe have chosen $N=4$ as a trade-off to minimize the statistical scatter of the data over the intrinsic $D_{n}4000$ evolution with redshift, simultaneously \nmaximizing the redshift sampling of $H(z)$. We therefore consider a redshift interval $\\Delta z=0.1$, which corresponds to a difference in cosmic time \n$\\sim0.7$ Gyr at $z\\sim0.45$. We checked that different choices of $N$ (provided not to be dominated by the statistical scatter of the data) do not affect the results.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{||c||ccc|cc||ccc|cc||}\n\\hline\n& \\multicolumn{5}{|c||}{M11 models} & \\multicolumn{5}{c||}{BC03 models} \\\\\n$z$ & $H(z)$ & $\\sigma_{stat}$ & $\\sigma_{syst}$ & $\\sigma_{tot}$ & \\% error & $H(z)$ & $\\sigma_{stat}$ & $\\sigma_{syst}$ & $\\sigma_{tot}$ & \\% error\\\\\n\\hline\n0.3802 & 89.3 & 3.2 & 13.7 & 14.1 & 15.8\\% & 83.0 & 4.3 & 12.9 & 13.5 & 16.3\\% \\\\\n0.4004 & 82.8 & 2.4 & 10.3 & 10.6 & 12.8\\% & 77.0 & 2.1 & 10 & 10.2 & 13.2\\% \\\\\n0.4247 & 93.7 & 2.7 & 11.4 & 11.7 & 12.4\\% & 87.1 & 2.4 & 11 & 11.2 & 12.9\\% \\\\\n0.4497 & 99.7 & 3.1 & 13 & 13.4 & 13.4\\% & 92.8 & 4.5 & 12.1 & 12.9 & 13.9\\% \\\\\n0.4783 & 86.6 & 2 & 8.5 & 8.7 & 10.1\\% & 80.9 & 2.1 & 8.8 & 9 & 11.2\\% \\\\\n\\hline \\hline\n$\\langle 0.4293\\rangle$ & 91.8 & 1 & 5.1 & 5.3 & 5.8\\% & 85.7 & 1 & 5.1 & 5.2 & 6.1\\% \\\\\n\\hline\n\\end{tabular}\n\\caption{$H(z)$ measurements (in units of [km/Mpc/s) and their errors. The relative contribution of statistical and systematic errors\nare reported, as well as the total error (estimated by summing in quadrature \n$\\sigma_{stat}$ and $\\sigma_{syst}$). These values have been estimated with M11 and BC03 EPS models respectively. \nFor each model the averaged measurement is also reported. This dataset can be downloaded from \nhttp://www.physics-astronomy.unibo.it/en/research/areas/astrophysics/cosmology-with-cosmic-chronometers.}\n\\label{tab:Hz}\n\\end{center}\n\\end{table}\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.95\\textwidth]{BOSS_Hz_vdisp_def_4_M11.ps}\n\\caption{Hubble parameter constraints obtained with M11 models, compared with various literature data \\cite{Simon2005,Stern2010,Moresco2012a,Zhang2014,Moresco2015}.\nThe black point at $z=0$ is the Hubble constant constraints from ref.~\\cite{Riess2011} with the recalibration of the distance to NGC 4258 from ref.~\\cite{Humphreys2013}, i.e \n$H_{0}=73\\pm2.4$ km/s/Mpc. The solid line and the dashed regions are not a fit to the data, but show the fiducial flat $\\Lambda$CDM cosmology with its 1$\\sigma$ uncertainty \nas constrained by Planck collaboration (\\cite{Planck2015}, $H_{0}=67.8\\pm0.9$ km/s/Mpc, $\\Omega_{m}=0.308\\pm0.012$). For comparison an Einstein-de Sitter \nmodel is shown, normalized to the same $H_{0}$.\n\\label{fig:Hz2}}\n\\end{center}\n\\end{figure}\n\nThe $H(z)$ measurements extracted from the different $\\sigma$ subsamples are in good agreement, and, being statistically \nindependent, they have been combined together averaging them in bins of $\\Delta z=0.025$; we use a weighted \nmean where the weights are the corresponding error of each measurement. The results are shown in figure \\ref{fig:HzD4000}, \nand presented in Tab.~\\ref{tab:Hz}. Exploiting BOSS data, we are able to map homogeneously for the first time\nthe redshift range $0.3<z<0.5$ with an accuracy between 11\\% and 16\\%, which, as can be seen by figure \\ref{fig:HzD4000}, \nwas previously only poorly covered. The comparison between the results obtained with the two different EPS models also shows a good \nagreement, always $<1\\sigma$, confirming the robustness of the estimate as found in ref.~\\cite{Moresco2012a}. Despite the \nlarger statistic of this analysis with respect to the one of ref.~\\cite{Moresco2012a}, however, we have similar errorbars. This is \ndue to the fact that in this work we have larger uncertainty on the slope $dz/dD_{n}4000$ since we are using smaller redshift \narm ($\\Delta z=0.1$ instead of 0.3).\nPrecise measurements in this redshift range are crucial to better constrain the time at which our Universe passed from decelerated to accelerated expansion. \n\nAnalyzing Tab.~\\ref{tab:Hz}, it is clear that, with the exceptional statistics provided by the BOSS data, systematics are now\ndominating over statistical errors. Since the systematics themselves are mainly dominated by the uncertainty on metallicity \nand by the EPS model, additional work is needed to improve on the current analysis.\nWe plan to address this issue by exploiting the present dataset in a following paper, with a full and detailed spectral analysis.\n\nTo exploit the full constraining power of BOSS data, we decide also to provide a single $H(z)$ measurement, in which all mass subsamples have been averaged as discussed above,\nbut in a single point. This measurement is clearly not independent of the results reported in Tab. \\ref{tab:Hz}, and should not be used in combination with them. \nThe resulting constraint adopting M11 models is $H(z=0.4293)=91.8\\pm5.3$ km/s/Mpc, and $H(z=0.4293)=85.7\\pm5.2$ km/s/Mpc using BC03 models, \nreaching a 6\\% accuracy including both statistic and systematic errors. \nAs a comparison, we report the results obtained from the BAO analysis in the final BOSS DR12 \\cite{Cuesta2015}, where it is found \n$H(z=0.57)r_{\\rm d}/r^{\\rm fid}_{\\rm d}=100.3\\pm3.4$ km/s/Mpc and $H(z=0.32)r_{\\rm d}/r^{\\rm fid}_{\\rm d}=79.2\\pm5.5$ km/s/Mpc. Considering that\n$r^{\\rm fid}_{\\rm d}=147.10$ Mpc and $r_{\\rm d}=147.41\\pm0.30$ from Planck analysis \\cite{Planck2015}, these measurements correspond to $H(z=0.57)=100.1\\pm 3.4$ and \n$H(z=0.32)=79.0\\pm5.5$km/s/Mpc, respectively a 3.4\\% and 6.9\\% measurement.\n\n\\subsection{The measurement of the transition redshift}\n\nThe cosmological transition redshift $z_{t}$ is defined as the redshift which separates the accelerated and decelerated expansion phases \nof the Universe. The BOSS data map the redshift range close to this epoch of cosmic re-acceleration homogeneously for \nthe first time, and therefore allow us to measure it with cosmic chronometers with high accuracy.\nWe constrained $z_{t}$ by fitting all the ``cosmic chronometers'' data available so far in the literature \n\\cite{Simon2005,Stern2010,Moresco2012a,Zhang2014,Moresco2015}, including the ones obtained in this work, with a standard \n$\\chi^{2}$ approach. In this analysis, we have considered the measurements obtained assuming BC03 models, for consistency \nwith literature derivations, as presented in Tab.~\\ref{tab:Hzall} and figure \\ref{fig:Hz2}.\n\nThe transition redshift determination can be done in the standard (model-dependent) way, assuming a Friedmann-Robertson-Walker \nmetric and general relativity (i.e. $\\Lambda$CDM-like cosmological model), and in a model-independent way. \n\nFirst of all, we consider an open $\\Lambda$CDM cosmology:\n\n", "index": 5, "text": "\\begin{equation}\nH(z)=H_{0}\\left[\\Omega_{m}(1+z)^{3}+\\Omega_{k}(1+z)^{2}+\\Omega_{\\Lambda}\\right]^{1/2} ,\n\\label{eq:Hztheor}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"H(z)=H_{0}\\left[\\Omega_{m}(1+z)^{3}+\\Omega_{k}(1+z)^{2}+\\Omega_{\\Lambda}\\right%&#10;]^{1/2},\" display=\"block\"><mrow><mrow><mrow><mi>H</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>H</mi><mn>0</mn></msub><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>m</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>k</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo>+</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mrow><mo>]</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01701.tex", "nexttext": "\nCombining equations \\ref{eq:Hztheor} and \\ref{eq:ztr}, we obtain a relation $H(z)_{mod}=f(H_{0},\\Omega_{m},z_{t}$).\nWe assumed a gaussian prior on the Hubble constant $H_{0}=73\\pm2.4$ km/s/Mpc \\cite{Riess2011,Humphreys2013,Cuesta2015}, which is a cosmology-independent, \ndirect measurement. \nFor the other parameters, we considered uniform priors $\\Omega_{m}\\in[0,1]$ and $z_{t}\\in[0,1.5]$. \nThe results are presented in figure \\ref{fig:chi2}: in the left panel the one-dimensional marginalized $\\chi^{2}$ for $z_{t}$ is shown, while the right \npanel shows the two-dimensional constraints in the $\\Omega_{m}-z_{t}$ plane. \n\nWe obtained $ z_{t}=0.64^{+0.11}_{-0.07}$, which is in good agreement with Planck (2015) results \\cite{Planck2015} assuming an open $\\Lambda$CDM \ncosmology\\footnote{see http://wiki.cosmos.esa.int/planckpla2015/index.php/Cosmological\\_Parameters.}, as shown in figure \\ref{fig:chi2}.\nOur measurement is slightly larger than the estimate from ref.~\\cite{Riess2007} ($ z_{t}=0.43^{+0.27}_{-0.08}$ at 95\\% confidence level) obtained using SNe, and more consistent \nwith the larger value of ref.~\\cite{Lima2012} ($ z_{t}=0.73^{+0.45}_{-0.13}$ at 95\\% confidence level), and with the estimate provided by the analysis of BAO in the Ly$\\alpha$ forest \nof BOSS quasars ($ z_{t}\\sim0.7$, \\cite{Busca2013}). This result is in good agreement with the estimate from an independent fit to SNe of ref.~\\cite{Capozziello2015}, providing\n$z_{t}=0.643^{+0.034}_{-0.030}$ with a class of models deviating from GR (assuming $\\Omega_{m}=0.315$). Ref.~\\cite{Capozziello2014} analyzed the constraints \non another class of $f(R)$ gravity models, and by combining SNe, BAO and older $H(z)$ measurements they obtained $z_{t}=0.7679^{+0.1831}_{-0.1829}$.\nRef.~\\cite{Farooq2013}, analyzing older $H(z)$ measurements in combination with BAO measurements in different cosmological scenarios, found a mean value\nof $z_{t}=0.74\\pm0.05$. Note that previous results were obtained from the analysis of SNe, comprising SNLS and Union2 samples, BAO and from the latest CMB \nmeasurements from Planck satellite, while in our case the measurement comes only from cosmic chronometers data and the local $H(z)$ measurement.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{lllrr|}\n\\multicolumn{4}{c}{{}}\\\\\n\\hline \\hline\n$z$ & $H(z)$ & $\\sigma_{H(z)}$ & ref.\\\\\n\\hline\n0.07 & 69.0 & 29.6 & \\cite{Zhang2014}\\\\\n0.09 & 69 & 12 & \\cite{Simon2005}\\\\\n0.12 & 68.6 & 26.2 & \\cite{Zhang2014}\\\\\n0.17 & 83 & 8 & \\cite{Simon2005}\\\\\n0.179 & 75 & 4 & \\cite{Moresco2012a}\\\\\n0.199 & 75 & 5 & \\cite{Moresco2012a}\\\\\n0.20 & 72.9 & 29.6 & \\cite{Zhang2014}\\\\\n0.27 & 77 & 14 & \\cite{Simon2005}\\\\\n0.28 & 88.8 & 36.6 & \\cite{Zhang2014}\\\\\n0.352 & 83 & 14 & \\cite{Moresco2012a}\\\\\n0.3802 & 83 & 13.5 & this work\\\\\n0.4 & 95 & 17 & \\cite{Simon2005}\\\\\n0.4004 & 77 & 10.2 & this work\\\\\n0.4247 & 87.1 & 11.2 & this work\\\\\n0.44497 & 92.8 & 12.9 & this work\\\\\n\\hline \\hline\n\\end{tabular}\n\\begin{tabular}{|lllrr|}\n\\multicolumn{4}{c}{{\\it continues}}\\\\\n\\hline \\hline\n$z$ & $H(z)$ & $\\sigma_{H(z)}$ & ref.\\\\\n\\hline\n0.4783 & 80.9 & 9 & this work\\\\\n0.48 & 97 & 62 & \\cite{Stern2010}\\\\\n0.593 & 104 & 13 & \\cite{Moresco2012a}\\\\\n0.68 & 92 & 8 & \\cite{Moresco2012a}\\\\\n0.781 & 105 & 12 & \\cite{Moresco2012a}\\\\\n0.875 & 125 & 17 & \\cite{Moresco2012a}\\\\\n0.88 & 90 & 40 & \\cite{Stern2010}\\\\\n0.9 &  117 &  23 & \\cite{Simon2005}\\\\\n1.037 & 154 & 20 & \\cite{Moresco2012a}\\\\\n1.3 & 168 & 17 & \\cite{Simon2005}\\\\\n1.363 & 160 & 33.6 & \\cite{Moresco2015}\\\\\n1.43 & 177 & 18 & \\cite{Simon2005}\\\\\n1.53 & 140 & 14 & \\cite{Simon2005}\\\\\n1.75 & 202 & 40 & \\cite{Simon2005}\\\\\n1.965 & 186.5 & 50.4 & \\cite{Moresco2015}\\\\\n\\hline \\hline\n\\end{tabular}\n\\caption{$H(z)$ measurements (in units [km/s/Mpc]) used for the cosmological analysis, and their errors.}\n\\label{tab:Hzall}\n\\end{center}\n\\end{table}\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=0, width=0.46\\textwidth]{chi2_ztransition_3_ztrOmH0_new2.ps}\n\\includegraphics[angle=0, width=0.47\\textwidth]{chi2_ztransition_2_ztrOmH0_new.ps}\n\\caption{Constraints on the cosmological transition redshift obtained in a o$\\Lambda$CDM cosmology. The left panel shows the effective $\\Delta\\chi^{2}$\nas a function of $z_{t}$. The solid line shows the constraint obtained with the data of Tab.~\\ref{tab:Hzall}, while the dashed line shows the constraint obtained without \nthe values obtained in this work. As a comparison, the grey shaded area represent the 1$\\sigma$ and 2$\\sigma$ constraints from Planck (2015) for an o$\\Lambda$CDM cosmology. \nIn the right panel the 68\\% and 95\\% two-dimensional constraints are shown in the $\\Omega_{m}-z_{t}$ plane, both with and without the new $H(z)$ data obtained in this analysis.\n\\label{fig:chi2}}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\\begin{center}\n\\includegraphics[angle=-90, width=1.\\textwidth]{BOSS_Hz_1z_vdisp_def_6_err_new.ps}\n\\caption{Constraints on the cosmological transition redshift obtained in a model-independent way. In the upper panel are shown the fitted $H(z)/(1+z)$ measurements in grey, \nwith the same coding of figure~\\ref{fig:Hz2}, where the starred symbols are the measurements obtained from this analysis; for this fit we used BC03 \nmeasurements for homogeneity with the estimates obtained in literature data. Orange points show the \nbinned values, for illustrative purposes; the analysis is performed on unbinned data. The $H_{0}$ value used in this analysis is plotted in blue. \nThe transition from decelerated to accelerated expansion is clearly visible by eye as a turn in the slope of the data. \nThe solid line represents the best fit to the data with a cosmology-independent piecewise linear function. As a comparison, model dependent 2$\\sigma$ \nconstraints obtained from Planck (2015) \\cite{Planck2015} in an open $\\Lambda$CDM cosmology are shown in yellow.\nIn the lower-left panel the effective $\\Delta\\chi^{2}$ is shown as a function of $z_{t}$, with and without considering the new\nBOSS data; the improvement of the statistical significance of the result provided by the new data is clearly evident. In the lower-right panel are presented \nfor comparison the best fits obtained for the o$\\Lambda$CDM model and for the model without a transition redshift.\n\\label{fig:chi2_mod}}\n\\end{center}\n\\end{figure}\n\n\nThe transition redshift can be also constrained without any further assumption from the function $f(z)=H(z)/(1+z)=\\dot a$, that \ndirectly maps the acceleration of the Universe. This function has a positive slope when the Universe is accelerating, and a negative slope \nwhen it is decelerating. The deceleration parameter $q$ is related to $f(z)$ by $q = -H(z)/fÕ(z)$. \nOur measurements are crucial to provide the first cosmology-independent determination of the redshift of transition between decelerated and accelerated\nexpansion, $z_{t}$, at high statistical significance. Combining them with literature data as presented in Tab.~\\ref{tab:Hzall} and adopting the most recent \nlocal distance ladder measurement of the Hubble constant $H_{0}$ \\cite{Riess2011,Humphreys2013,Cuesta2015}, which is also independent of any \ncosmology-based constraint, we obtain \n31 $H(z)/(1+z)$ measurements (see figure \\ref{fig:chi2_mod}). We fit these data with a piecewise linear function composed of two \nintervals (one for acceleration and one for deceleration), which is the simplest functional form parameterizing a change in the slope of $H(z)/(1+z)$ without \nassuming any model.\nThe transition redshift between the two regimes is a free parameter, together with the slope of the two lines and the overall amplitude. \nWe use a standard $\\chi^{2}$ approach, and, marginalizing over all other parameters, we find a transition redshift of $z_t = 0.4 \\pm 0.1$ at the 68\\% \nconfidence level, as shown in figure ~\\ref{fig:chi2_mod}.  We have also explored fitting with other functional forms like a parabola and a spline; \nhowever, the piecewise function provides the best $\\chi^2$ and the transition redshift does not change within the 68\\% confidence limit. \n\nWe also attempt a fit to the data with a straight-line, where no transition between decelerated and accelerated expansion is assumed, and compare the results.\nThe BOSS data have proven to be crucial for the detection of the transition redshift in both model-dependent and model-independent measurements, as it is evident\nfrom figure~\\ref{fig:chi2} and \\ref{fig:chi2_mod}. For the piecewise fit, without the new BOSS data we obtain no constraint on the transition redshift at a significance of 2.6$\\sigma$ \nor higher within the redshift range probed by our sample, while on the contrary, considering the new data we find that the transition redshift  for the piecewise fit is \n$0.2<z_t<0.8$ at $2\\sigma$ (95\\%) and $0.1<z_t<1.05$ at 3$\\sigma$ (99.7\\%) levels, with a detection of $0<z_{t}<1.15$ at 99.9\\% confidence level. Similarly, for the o$\\Lambda$CDM fit \nwe obtain no constraint at the 3$\\sigma$ level (99.7\\%) without the new data (with $z_t<3.5$), and $0.41<z_t<2.2$ considering them, proving that BOSS \ndata are necessary for a significant detection.\n\nDifferent estimators have been proposed in the literature to select the best model fitting a set of data; among them, the most common are the Akaike Information Criterion \n(AIC, \\cite{Akaike1974}), and the Bayesian Information Criterion (BIC, \\cite{Schwarz1978}). These criteria indicate which is the model preferred by data, \nand the level of confidence at which other models can be discarded, implementing an ``Occam razor'' selection that penalizes increasing the number of parameters. \nIn this way, they penalize over-fitting the data (for more details, see \\cite{Liddle2007}). \nGiven $k$ degrees of freedom in a model, and N data points, they are defined as:\n\n", "itemtype": "equation", "pos": 40375, "prevtext": "\nwhere $\\Omega_{k}=1-\\Omega_{m}-\\Omega_{\\Lambda}$. The transition redshift can be written as:\n\n", "index": 7, "text": "\\begin{equation}\nz_{t}=\\left[\\frac{2\\Omega_{\\Lambda}}{\\Omega_{m}}\\right]^{1/3}-1.\n\\label{eq:ztr}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"z_{t}=\\left[\\frac{2\\Omega_{\\Lambda}}{\\Omega_{m}}\\right]^{1/3}-1.\" display=\"block\"><mrow><mrow><msub><mi>z</mi><mi>t</mi></msub><mo>=</mo><mrow><msup><mrow><mo>[</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">Λ</mi></msub></mrow><msub><mi mathvariant=\"normal\">Ω</mi><mi>m</mi></msub></mfrac><mo>]</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup><mo>-</mo><mn>1</mn></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01701.tex", "nexttext": "\nThe BIC penalizes an increased number of free parameters more than AIC; moreover, ref.~\\cite{Sugiura1978} proposed a correction to AIC which is more correct for\nfinite number of data points:\n\n", "itemtype": "equation", "pos": 50214, "prevtext": "\nCombining equations \\ref{eq:Hztheor} and \\ref{eq:ztr}, we obtain a relation $H(z)_{mod}=f(H_{0},\\Omega_{m},z_{t}$).\nWe assumed a gaussian prior on the Hubble constant $H_{0}=73\\pm2.4$ km/s/Mpc \\cite{Riess2011,Humphreys2013,Cuesta2015}, which is a cosmology-independent, \ndirect measurement. \nFor the other parameters, we considered uniform priors $\\Omega_{m}\\in[0,1]$ and $z_{t}\\in[0,1.5]$. \nThe results are presented in figure \\ref{fig:chi2}: in the left panel the one-dimensional marginalized $\\chi^{2}$ for $z_{t}$ is shown, while the right \npanel shows the two-dimensional constraints in the $\\Omega_{m}-z_{t}$ plane. \n\nWe obtained $ z_{t}=0.64^{+0.11}_{-0.07}$, which is in good agreement with Planck (2015) results \\cite{Planck2015} assuming an open $\\Lambda$CDM \ncosmology\\footnote{see http://wiki.cosmos.esa.int/planckpla2015/index.php/Cosmological\\_Parameters.}, as shown in figure \\ref{fig:chi2}.\nOur measurement is slightly larger than the estimate from ref.~\\cite{Riess2007} ($ z_{t}=0.43^{+0.27}_{-0.08}$ at 95\\% confidence level) obtained using SNe, and more consistent \nwith the larger value of ref.~\\cite{Lima2012} ($ z_{t}=0.73^{+0.45}_{-0.13}$ at 95\\% confidence level), and with the estimate provided by the analysis of BAO in the Ly$\\alpha$ forest \nof BOSS quasars ($ z_{t}\\sim0.7$, \\cite{Busca2013}). This result is in good agreement with the estimate from an independent fit to SNe of ref.~\\cite{Capozziello2015}, providing\n$z_{t}=0.643^{+0.034}_{-0.030}$ with a class of models deviating from GR (assuming $\\Omega_{m}=0.315$). Ref.~\\cite{Capozziello2014} analyzed the constraints \non another class of $f(R)$ gravity models, and by combining SNe, BAO and older $H(z)$ measurements they obtained $z_{t}=0.7679^{+0.1831}_{-0.1829}$.\nRef.~\\cite{Farooq2013}, analyzing older $H(z)$ measurements in combination with BAO measurements in different cosmological scenarios, found a mean value\nof $z_{t}=0.74\\pm0.05$. Note that previous results were obtained from the analysis of SNe, comprising SNLS and Union2 samples, BAO and from the latest CMB \nmeasurements from Planck satellite, while in our case the measurement comes only from cosmic chronometers data and the local $H(z)$ measurement.\n\n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{lllrr|}\n\\multicolumn{4}{c}{{}}\\\\\n\\hline \\hline\n$z$ & $H(z)$ & $\\sigma_{H(z)}$ & ref.\\\\\n\\hline\n0.07 & 69.0 & 29.6 & \\cite{Zhang2014}\\\\\n0.09 & 69 & 12 & \\cite{Simon2005}\\\\\n0.12 & 68.6 & 26.2 & \\cite{Zhang2014}\\\\\n0.17 & 83 & 8 & \\cite{Simon2005}\\\\\n0.179 & 75 & 4 & \\cite{Moresco2012a}\\\\\n0.199 & 75 & 5 & \\cite{Moresco2012a}\\\\\n0.20 & 72.9 & 29.6 & \\cite{Zhang2014}\\\\\n0.27 & 77 & 14 & \\cite{Simon2005}\\\\\n0.28 & 88.8 & 36.6 & \\cite{Zhang2014}\\\\\n0.352 & 83 & 14 & \\cite{Moresco2012a}\\\\\n0.3802 & 83 & 13.5 & this work\\\\\n0.4 & 95 & 17 & \\cite{Simon2005}\\\\\n0.4004 & 77 & 10.2 & this work\\\\\n0.4247 & 87.1 & 11.2 & this work\\\\\n0.44497 & 92.8 & 12.9 & this work\\\\\n\\hline \\hline\n\\end{tabular}\n\\begin{tabular}{|lllrr|}\n\\multicolumn{4}{c}{{\\it continues}}\\\\\n\\hline \\hline\n$z$ & $H(z)$ & $\\sigma_{H(z)}$ & ref.\\\\\n\\hline\n0.4783 & 80.9 & 9 & this work\\\\\n0.48 & 97 & 62 & \\cite{Stern2010}\\\\\n0.593 & 104 & 13 & \\cite{Moresco2012a}\\\\\n0.68 & 92 & 8 & \\cite{Moresco2012a}\\\\\n0.781 & 105 & 12 & \\cite{Moresco2012a}\\\\\n0.875 & 125 & 17 & \\cite{Moresco2012a}\\\\\n0.88 & 90 & 40 & \\cite{Stern2010}\\\\\n0.9 &  117 &  23 & \\cite{Simon2005}\\\\\n1.037 & 154 & 20 & \\cite{Moresco2012a}\\\\\n1.3 & 168 & 17 & \\cite{Simon2005}\\\\\n1.363 & 160 & 33.6 & \\cite{Moresco2015}\\\\\n1.43 & 177 & 18 & \\cite{Simon2005}\\\\\n1.53 & 140 & 14 & \\cite{Simon2005}\\\\\n1.75 & 202 & 40 & \\cite{Simon2005}\\\\\n1.965 & 186.5 & 50.4 & \\cite{Moresco2015}\\\\\n\\hline \\hline\n\\end{tabular}\n\\caption{$H(z)$ measurements (in units [km/s/Mpc]) used for the cosmological analysis, and their errors.}\n\\label{tab:Hzall}\n\\end{center}\n\\end{table}\n\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=0, width=0.46\\textwidth]{chi2_ztransition_3_ztrOmH0_new2.ps}\n\\includegraphics[angle=0, width=0.47\\textwidth]{chi2_ztransition_2_ztrOmH0_new.ps}\n\\caption{Constraints on the cosmological transition redshift obtained in a o$\\Lambda$CDM cosmology. The left panel shows the effective $\\Delta\\chi^{2}$\nas a function of $z_{t}$. The solid line shows the constraint obtained with the data of Tab.~\\ref{tab:Hzall}, while the dashed line shows the constraint obtained without \nthe values obtained in this work. As a comparison, the grey shaded area represent the 1$\\sigma$ and 2$\\sigma$ constraints from Planck (2015) for an o$\\Lambda$CDM cosmology. \nIn the right panel the 68\\% and 95\\% two-dimensional constraints are shown in the $\\Omega_{m}-z_{t}$ plane, both with and without the new $H(z)$ data obtained in this analysis.\n\\label{fig:chi2}}\n\\end{center}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\\begin{center}\n\\includegraphics[angle=-90, width=1.\\textwidth]{BOSS_Hz_1z_vdisp_def_6_err_new.ps}\n\\caption{Constraints on the cosmological transition redshift obtained in a model-independent way. In the upper panel are shown the fitted $H(z)/(1+z)$ measurements in grey, \nwith the same coding of figure~\\ref{fig:Hz2}, where the starred symbols are the measurements obtained from this analysis; for this fit we used BC03 \nmeasurements for homogeneity with the estimates obtained in literature data. Orange points show the \nbinned values, for illustrative purposes; the analysis is performed on unbinned data. The $H_{0}$ value used in this analysis is plotted in blue. \nThe transition from decelerated to accelerated expansion is clearly visible by eye as a turn in the slope of the data. \nThe solid line represents the best fit to the data with a cosmology-independent piecewise linear function. As a comparison, model dependent 2$\\sigma$ \nconstraints obtained from Planck (2015) \\cite{Planck2015} in an open $\\Lambda$CDM cosmology are shown in yellow.\nIn the lower-left panel the effective $\\Delta\\chi^{2}$ is shown as a function of $z_{t}$, with and without considering the new\nBOSS data; the improvement of the statistical significance of the result provided by the new data is clearly evident. In the lower-right panel are presented \nfor comparison the best fits obtained for the o$\\Lambda$CDM model and for the model without a transition redshift.\n\\label{fig:chi2_mod}}\n\\end{center}\n\\end{figure}\n\n\nThe transition redshift can be also constrained without any further assumption from the function $f(z)=H(z)/(1+z)=\\dot a$, that \ndirectly maps the acceleration of the Universe. This function has a positive slope when the Universe is accelerating, and a negative slope \nwhen it is decelerating. The deceleration parameter $q$ is related to $f(z)$ by $q = -H(z)/fÕ(z)$. \nOur measurements are crucial to provide the first cosmology-independent determination of the redshift of transition between decelerated and accelerated\nexpansion, $z_{t}$, at high statistical significance. Combining them with literature data as presented in Tab.~\\ref{tab:Hzall} and adopting the most recent \nlocal distance ladder measurement of the Hubble constant $H_{0}$ \\cite{Riess2011,Humphreys2013,Cuesta2015}, which is also independent of any \ncosmology-based constraint, we obtain \n31 $H(z)/(1+z)$ measurements (see figure \\ref{fig:chi2_mod}). We fit these data with a piecewise linear function composed of two \nintervals (one for acceleration and one for deceleration), which is the simplest functional form parameterizing a change in the slope of $H(z)/(1+z)$ without \nassuming any model.\nThe transition redshift between the two regimes is a free parameter, together with the slope of the two lines and the overall amplitude. \nWe use a standard $\\chi^{2}$ approach, and, marginalizing over all other parameters, we find a transition redshift of $z_t = 0.4 \\pm 0.1$ at the 68\\% \nconfidence level, as shown in figure ~\\ref{fig:chi2_mod}.  We have also explored fitting with other functional forms like a parabola and a spline; \nhowever, the piecewise function provides the best $\\chi^2$ and the transition redshift does not change within the 68\\% confidence limit. \n\nWe also attempt a fit to the data with a straight-line, where no transition between decelerated and accelerated expansion is assumed, and compare the results.\nThe BOSS data have proven to be crucial for the detection of the transition redshift in both model-dependent and model-independent measurements, as it is evident\nfrom figure~\\ref{fig:chi2} and \\ref{fig:chi2_mod}. For the piecewise fit, without the new BOSS data we obtain no constraint on the transition redshift at a significance of 2.6$\\sigma$ \nor higher within the redshift range probed by our sample, while on the contrary, considering the new data we find that the transition redshift  for the piecewise fit is \n$0.2<z_t<0.8$ at $2\\sigma$ (95\\%) and $0.1<z_t<1.05$ at 3$\\sigma$ (99.7\\%) levels, with a detection of $0<z_{t}<1.15$ at 99.9\\% confidence level. Similarly, for the o$\\Lambda$CDM fit \nwe obtain no constraint at the 3$\\sigma$ level (99.7\\%) without the new data (with $z_t<3.5$), and $0.41<z_t<2.2$ considering them, proving that BOSS \ndata are necessary for a significant detection.\n\nDifferent estimators have been proposed in the literature to select the best model fitting a set of data; among them, the most common are the Akaike Information Criterion \n(AIC, \\cite{Akaike1974}), and the Bayesian Information Criterion (BIC, \\cite{Schwarz1978}). These criteria indicate which is the model preferred by data, \nand the level of confidence at which other models can be discarded, implementing an ``Occam razor'' selection that penalizes increasing the number of parameters. \nIn this way, they penalize over-fitting the data (for more details, see \\cite{Liddle2007}). \nGiven $k$ degrees of freedom in a model, and N data points, they are defined as:\n\n", "index": 9, "text": "\\begin{equation}\nAIC=-2 \\ln \\mathcal{L}_{max} + 2k,\\;\\;\\;\\;\\;\\;\\;\\;BIC=-2 \\ln \\mathcal{L}_{max} + k \\ln {\\rm N}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"AIC=-2\\ln\\mathcal{L}_{max}+2k,\\;\\;\\;\\;\\;\\;\\;\\;BIC=-2\\ln\\mathcal{L}_{max}+k\\ln{%&#10;\\rm N}.\" display=\"block\"><mrow><mrow><mrow><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>C</mi></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub></mrow></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi></mrow></mrow></mrow><mo rspace=\"24.9pt\">,</mo><mrow><mrow><mi>B</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>C</mi></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub></mrow></mrow></mrow><mo>+</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mi mathvariant=\"normal\">N</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01701.tex", "nexttext": "\nDifferent models are then compared in terms of their $\\Delta AIC_{c}$ or $\\Delta BIC$ based on the Jeffreys' scale \\cite{Jeffreys1961}, so that a difference $>5$\nis highly significant. In tab.~\\ref{tab:res_zt} are summarized the results. With both estimators, we find that the model preferred\nby the data is the o$\\Lambda$CDM, but without significant difference with respect to the cosmology-independent linear piecewise fit. On the contrary, \na straight-line is strongly disfavored by the data, both considering $AIC_{c}$ and $BIC$. \n\\begin{table}[t!]\n\\begin{center}\n\\begin{tabular}{ccccc}\n\\hline\n\\hline\nmodel & assumption & result & AICc & BIC\\\\\n\\hline\no$\\Lambda$CDM & cosmology & $ z_{t}=0.64^{+0.1}_{-0.06}$ & 21.41 & 25.71\\\\ \npiecewise linear fit & model-independent & $ z_{t}=0.4\\pm0.1$ & 23.99 & 28.72\\\\\nlinear fit & model-independent & -- & 32.42 & 35.29\\\\\n\\hline\n\\hline\n\\end{tabular}\n\\caption{Constraints on the cosmological transition redshift $ z_{t}$ obtained by fitting cosmic chronometer data\nwith different models. The results are presented at 68\\% confidence level; all constraints assume a gaussian prior on the Hubble constant \n$H_{0}=73\\pm2.4$ km/s/Mpc \\cite{Riess2011,Humphreys2013,Cuesta2015}.}\n\\label{tab:res_zt}\n\\end{center}\n\\end{table}\nThe model with a transition redshift is preferred at highly \nsignificant level compared to a model with no transition redshift, therefore ruling out the null hypothesis of no redshift of transition at {\\color{black}99.9\\% confidence level}.\n\nWe have shown that the choice of stellar population models does not affect the derived $H(z)$ value and that differences are always smaller than $1\\sigma$. However, this small \nsystematic shift might have a larger impact in computing the transition redshift, as it is, effectively, a derivative of $H(z)$. In our data-set only 15 $H(z)$ measurements are \nderived with M11 models. For this sub-set, following the same approach described in section \\ref{sec:Hz}, we find $z_t = 0.75\\pm0.15$ (we note, however, that at 95\\% confidence \nlevel the constraints degrade considerably because of the reduced number of points, giving $0.1 < z_t < 2$). As a further test, we also explored the full BC03 dataset, but \nusing instead M11 $H(z)$ measurements where available. This could be thought as an extreme example of systematic impact, as one should use just a given EPS \nmodel where the homogeneity of the EPS model ensures that these differences cancel out when estimating the derivative. In this case, we find $z_t = 0.75\\pm0.15$ and \n$0.25 < z_t < 1.0$ at 95\\% confidence. This is perfectly consistent with our BC03 determination, but with a larger errorbar at higher redshifts. When using Bayesian \nevidence to analyze the significance of excluding the hypothesis of no transition redshift with this latest data-set, which combines estimates from different EPS models, \nwe find a substantial-strong evidence in agreement with our general analysis. Our conclusion is that even an inhomogeneous analysis of the data provides a significant \nevidence for a transition redshift between deceleration and acceleration.\n\n\n\n\\section{Conclusions}\nIn this paper, we analyzed BOSS data to set constraints on the expansion history of the Universe\nthrough the ``cosmic chronometers'' approach. We implemented the technique suggested in refs.~\\cite{Moresco2011,Moresco2012a},\nin which it was proposed to constrain the Hubble parameter $H(z)$ from the differential evolution\nof a spectral feature, the $D_{n}4000$, of very massive and passive galaxies.\n\nThe main conclusion of this analysis can be\nsummarized as follows:\n\\begin{itemize}\n\\item We implement a strict selection criterion to extract, amongst BOSS-DR9, the most \nmassive and passive sample, the least biased by star-forming emission-lines outliers. In this way we \nselect more than 130000 massive and passive galaxies, which are binned in narrow redshift bins \nto follow the evolution of this population with cosmic time, and in velocity dispersion bins to follow this evolution \nin different mass bins.\n\\item For all the galaxies of our sample, we measure the $D_{n}4000$. We also create median stacked spectra\nin all the velocity dispersion and redshift bins, which are analyzed with a full spectral fitting technique to extract\ninformation on the stellar metallicity of the samples.\nWe apply three different full spectral fitting codes using two EPS models (BC03 and M11), to explore the dependence \nof the constraints on both the software implemented and the model adopted. These codes yield comparable results, \nsuggesting for our sample an average metallicity of $Z/Z_{\\odot}=1.35\\pm0.3$, in agreement with other independent estimates for \nthis population of galaxies.\n\\item The inspection of the median $D_{n}4000$--z relation provides evidence supporting the mass-downsizing\nscenario, with more massive galaxies having a larger break and, given the metallicity constraints obtained,\nolder ages with respect to less massive galaxies.\n\\item These measurements are used to obtain five new cosmology-independent $H(z)$ constraints in the redshift range $0.3<z<0.5$,\nwith an accuracy $\\sim$11-16\\%, taking into account both statistical and systematic error. These constraints are\nobtained adopting two different EPS models, BC03 and M11, to study the dependence of our results on models, finding\nno significant difference. These new constraints allow us to homogeneously map for the first time this range of cosmic times,\nwhich are crucial to disentangle the epoch which separates the decelerated and accelerated phases of the expansion of\nthe Universe.\n\\item To exploit the constraining power of BOSS data, we combine the five measurements, obtaining a constraint \n$H(z=0.4293)=91.8\\pm5.3$ km/s/Mpc using M11 models, and $H(z\\sim0.43)=85.7\\pm5.2$ km/s/Mpc using \nBC03 models, a 6\\% measurement including both statistical and systematic errors. This result is a complementary and cosmology-independent result that is comparable to the result\nobtained from the analysis of BAO from the final BOSS-DR12 sample \\cite{Cuesta2015}.\n\\item We use the new data obtained, jointly with other cosmic chronometers literature data, to set constraints on the cosmological\ntransition redshift, considering an open $\\Lambda$CDM cosmology. We obtain a value $\\rm z_{t}=0.64^{+0.11}_{-0.06}$ in perfect agreement \nwith the estimate from Planck (2015) \\cite{Planck2015} and SNe \\cite{Lima2012, Capozziello2014,Capozziello2015} analyses.\n\\item The new data from SDSS-III/BOSS allow us to implement also an independent fit to the function $H(z)/(1+z)$, \nwhich directly probes the acceleration of the Universe, using a functional form without any further cosmological assumption. \nIn this way, we obtain the constraint $z_{t}=0.4\\pm0.1$. At 99.9\\% confidence level, this analysis yield a detection of the transition redshift as $0<z_{t}<1.15$,\nruling out a straight-line fit, which would imply no transition from deceleration to acceleration, at very high significance. This is \nthe first time that the epoch of cosmic re-acceleration has been observed in a cosmological model-independent way.\n\\end{itemize}\n\nThis work has shown the potential of the {\\em cosmic chronometers} approach to set cosmology-independent\nconstraints on the Hubble parameter $H(z)$. This technique can be considered as a complementary tool\nwith respect to more standard ones (e.g. BAO, SNe) to set constraints on cosmological models, and\nto keep the systematic affecting each probe under control. While it has been demonstrated that in many cases\nthe constraining power of this method is comparable with the power of classical approaches,\nwe also note that at the present status the measurements are systematic-dominated. Looking towards the future, on one hand we foresee that \nan improvement in the measurement of metallicity of passive\ngalaxies will represent a decisive step to minimize systematics, and significantly reduce errorbars; on the other hand,\nit will be crucial to improve the samples at $z>0.5$, in order to maximize the accuracy of the measurements over a \nlarger redshift range. From this point of view, future missions like Euclid \\cite{Laurejis2011}, WFIRST \\cite{Spergel2013},\nDESI \\cite{DESI} and LSST \\cite{LSST} will represent an ideal starting point at these high redshifts.\n\nIn future papers, we plan to explore the capability of these new data, in combination with Planck (2015) measurements,\nto set constraints on parameters in different cosmological scenarios, focusing on the additional constraining power\nprovided by cosmic chronometers data, and to take advantage of the high-quality stacked spectra obtained in this analysis\nto set evolutionary constraints on the properties of passive galaxies.\n  \n\\acknowledgments{MM, LP and AC acknowledge financial contributions by grants ASI/INAF\nI/023/12/0 and PRIN MIUR 2010-2011 ``The dark Universe and the cosmic\nevolution of baryons: from current surveys to Euclid''. \n\nRJ and LV thank the Royal Society for financial support and the ICIC at Imperial College for \nhospitality while this work was being completed. LV is supported by the European Research \nCouncil under the European Community's Seventh Framework Programme FP7-IDEAS-Phys.LSS \n240117. Funding for this work was partially provided by the Spanish MINECO under projects \nAYA2014-58747-P and MDM-2014-0369 of ICCUB (Unidad de Excelencia ``Maria de Maeztu'')\n\nFunding for SDSS-III has been provided by the Alfred P. Sloan Foundation, the Participating \nInstitutions, the National Science Foundation, and the U.S. Department of Energy Office of \nScience. The SDSS-III web site is http://www.sdss3.org/.\n\nSDSS-III is managed by the Astrophysical Research Consortium for the Participating Institutions \nof the SDSS-III Collaboration including the University of Arizona, the Brazilian Participation Group, \nBrookhaven National Laboratory, Carnegie Mellon University, University of Florida, the French \nParticipation Group, the German Participation Group, Harvard University, the Instituto de Astrofisica \nde Canarias, the Michigan State/Notre Dame/JINA Participation Group, Johns Hopkins University, \nLawrence Berkeley National Laboratory, Max Planck Institute for Astrophysics, Max Planck Institute \nfor Extraterrestrial Physics, New Mexico State University, New York University, Ohio State University, \nPennsylvania State University, University of Portsmouth, Princeton University, the Spanish Participation \nGroup, University of Tokyo, University of Utah, Vanderbilt University, University of Virginia, University \nof Washington, and Yale University.}\n\n\n\\appendix\n\n\n\\section{Correcting for night sky emission lines residuals}\n\\label{sec:appsky}\n\n\\begin{figure}[b!]\n\\begin{center}\n\\includegraphics[angle=0, width=0.85\\textwidth]{ave_mm4_10vdisp_z0.5181_clipping_NOrestframe.ps}\n\\caption{Example of median stacked spectrum (in the observed frame) at $z=0.5181$ for the subsample with ${\\rm 250<\\sigma<300}$ km/s.\nThe median spectrum is shown in red, while in black are superimposed all the spectra used to create the stack. Particularly evident\nare the residual of the 5577~\\AA, of the 5892~\\AA~and of the 6300~\\AA~lines, highlighted with the yellow dotted lines. \nIn green are shown the regions of the red and blue bands of the $D_{n}4000$.\n\\label{fig:sky}}\n\\end{center}\n\\end{figure}\n\nNight sky line residuals can be important source of noise in (BOSS) spectra. As discussed here and within the BOSS collaboration\\footnote{See \nhttps://www.sdss3.org/dr9/spectro/caveats.php\\#night\\_sky.}, the lines at 5577~\\AA, 6300~\\AA, and 6363~\\AA~in particular may leave significant \nspikes in the spectra, and bias the measurement of the break if they happen to be in $D_{n}4000$ red or blue band. Together with the previous lines, we \nidentify in sky spectra five additional lines with significant residuals at 5892~\\AA, 5917~\\AA, 5934~\\AA~and 5955~\\AA, as shown in figure \n\\ref{fig:sky}. These residuals bias the measurement of $D_{n}4000$, leaving an imprint in the median $D_{n}4000$--z relation in the form of wiggles \n(particularly at $z\\sim0.4$) that depart from the expected theoretical behavior, as can be seen in the left plot of figure \\ref{fig:throughput}.\nTo overcome this issue, we applied a sigma-clipping procedure to the observed spectra in the red and blue bands of $D_{n}4000$,\nremoving pixels with a $>4\\sigma$ difference from the mean. This helps in particular to remove the wiggle at $z\\sim0.4$, where the strong\n5577~\\AA~line falls in the $D_{n}4000$ range.\n\nWe also explored different methods to clean the spectra from the residuals of the sky emission lines, namely cutting the contaminated pixels,\nand weighting the pixels with their variance. Each method gave similar results to the one obtained with the sigma clipping approach, being however\nmore dependent on various assumptions (such as how many pixels to cut, how to treat the removed regions, and how to properly weight the pixels).\nWe therefore decide adopt the first method, and applied it to the data.\n\n\\begin{figure}[t!]\n\\begin{center}\n\\includegraphics[angle=-90, width=0.49\\textwidth]{D4000z_BOSS_def_vdisp.ps}\n\\includegraphics[angle=-90, width=0.49\\textwidth]{plot_throughput_BOSS2.ps}\n\\caption{In the left plot is shown the median $D_{n}4000$--z relation before (open points, dotted lines) and after (filled points, solid\nlines) the sigma clipping correction; the correction is in particular effective around $z\\sim0.4$, where the 5577~\\AA~line enters the $D_{n}4000$ range. As\nin figure \\ref{fig:HzD4000}, dashed lines show $D_{n}4000$ from models.\nIn the right plot are presented the throughput curves for the red and blue arms of BOSS spectrograph (\\cite{Smee2013}, see also \nhttp://www.sdss.org/dr12/algorithms/spectrophotometry/) as a function of observed wavelength. The shaded regions with the same colors highlight the left \nand right bands where $D_{n}4000$ is calculated, at three different redshifts ($z=0.5$ in red, $z=0.58$ in green, adn $z=0.65$ in blue) around which the wiggle \nin the median $D_{n}4000$--z relations is observed, showing that at these redshifts the $D_{n}4000$ transits from the blue to the red arm of the spectrograph.\n\\label{fig:throughput}}\n\\end{center}\n\\end{figure}\n\n\\section{BOSS throughput analysis}\n\\label{sec:appspectro}\nThe BOSS spectra are obtained with two separate instruments, a blue arm and a red arm, with an overlapping region around $\\sim$6000~\\AA, as shown in the \nright plot of figure \\ref{fig:throughput}. This observed range falls exactly in the $D_{n}4000$ range, once redshifted at $z\\sim0.5$, and in particular we notice a \ncorrelation between the descending and ascending trend of the wiggle (described in Appendix A) and the $D_{n}4000$ being measured on the blue arm, in the red arm, or in between \n(see right plot of figure \\ref{fig:throughput}).\nThis correlation suggests a possible sub-optimal calibration between the two spectrographs, that results in the observed wiggle in the median $D_{n}4000$--z\nrelation. Even if this wiggle is actually small, of the order of $\\Delta D_{n}4000\\sim0.05$, it significantly affect the $H(z)$ measurement, that critically depends\non the differential $dD_{n}4000$. In order to avoid biasing our measurements, we therefore decided to restrict our analysis to $z<0.5$.\n\n\n\\bibliographystyle{ieeetr}\n\\bibliography{bib}\n\n\n", "itemtype": "equation", "pos": 50533, "prevtext": "\nThe BIC penalizes an increased number of free parameters more than AIC; moreover, ref.~\\cite{Sugiura1978} proposed a correction to AIC which is more correct for\nfinite number of data points:\n\n", "index": 11, "text": "\\begin{equation}\nAIC_{c}=AIC+\\frac{2k(k+1)}{N-k-1}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"AIC_{c}=AIC+\\frac{2k(k+1)}{N-k-1}.\" display=\"block\"><mrow><mrow><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><msub><mi>C</mi><mi>c</mi></msub></mrow><mo>=</mo><mrow><mrow><mi>A</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>C</mi></mrow><mo>+</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>N</mi><mo>-</mo><mi>k</mi><mo>-</mo><mn>1</mn></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]