[{"file": "1601.00243.tex", "nexttext": "\nHere, ${\\bf u}=(u_x,u_y)$ is the incompressible velocity field quantifying the motion of the fluid, $p$ is the 2D pressure field, and ${\\bf f} = \\chi \\sin(\\kappa y) \\hat{\\bf x}$ is the sinusoidal driving with amplitude $\\chi$ and wavenumber $\\kappa$. The parameters $\\rho$ and $\\nu$ are the density and the kinematic viscosity of the fluid being driven, respectively. Kolmogorov flow has served as a theoretically amenable model for understanding a wide variety of hydrodynamic phenomena in 2D, such as fluid instabilities \\citep{meshalkin_1961, iudovich_1965, kliatskin_1972, nepomniashchii_1976}, coherent structures \\citep{armbruster_1992, smaoui_2001}, and 2D turbulence \\citep{green_1974, chandler_2013}, to name a few. \n\nFlows realized in the real world, however, are never strictly 2D. Experimentalists often make use of confinement \\citep{bondarenko_1979, couder_1989}, stratification \\citep{marteau_1995, rivera_2005}, rotation \\citep{greenspan_1990}, or the application of a strong external magnetic field \\citep{sommeria_1986} to suppress one of the velocity components ($z$-direction) in a 3D flow, making the flow closer to 2D. The evolution of these so-called ``quasi-two-dimensional'' (Q2D) flows has often been described by modifying the 2D Navier-Stokes equation  (\\ref{eq:2dns}) with the addition of a linear friction term:\n \n", "itemtype": "equation", "pos": 2583, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract}\n\nWe present a combined experimental and numerical study of the primary and secondary bifurcations for a Kolmogorov-like flow.  The experimental system is a quasi-two-dimensional incompressible fluid flow consisting of two immiscible layers of fluid for which electromagnetic forces drive a shear flow that approximates Kolmogorov flow.  The two-dimensional (2D) direct numerical simulations (DNS) integrate a depth-averaged version of  the full three-dimensional Navier-Stokes equations \\citep{suri_2014}, which contains a (non-unity) prefactor on the advection term, previously unaccounted for in all studies.  Specifically, we present three separate 2D DNS: one that is doubly-periodic, one that is singly-periodic, and one that is non-periodic (i.e. no-slip is imposed at the lateral boundaries).  All parameters are directly calculated or measured from experimental quantities. We show that inclusion of the advection term prefactor substantially improves agreement between experiment and numerics.  However, good, quantitative agreement is found only for the non-periodic simulation, suggesting the crucial role the boundaries play in the dynamical behaviour of the flow.  Additionally, by varying the forcing profile in the non-periodic simulation, we test the sensitivity and range of validity for the model proposed by \\citet{suri_2014}.\n\n\\end{abstract}\n\n\n\n\n\\section{Introduction} \\label{sec:intro}\n\nFluid flows in two spatial dimensions have been the subject of substantial research efforts in recent decades due to numerous motivating factors.  First and foremost, geophysical flows such as  those of the atmosphere and oceans can be described to a good approximation using two-dimensional (2D) models \\citep{dritschel_2008}.  Flows in two dimensions are also much more analytically and numerically tractable compared to fully three-dimensional (3D) flows.  Providing further incentive is the prospect of gaining new insights using 2D flows to improve our understanding of turbulence, which remains unsolved despite centuries of research.\n\nPerhaps one of the best known 2D fluid flow models is the Kolmogorov flow, which was introduced by Andrey Kolmogorov in 1959 as a mathematical problem for studying hydrodynamic stability \\citep{arnold_1960}. It refers to the motion of an incompressible viscous fluid in two-dimensions ($x-y$) driven by a forcing that points along the $x$-direction and varies sinusoidally along the $y$-direction. The evolution of this 2D fluid is governed by the incompressible 2D Navier-Stokes equations, which are:\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:2dns}\n\\begin{aligned}\n\\partial_t{\\bf u} + {\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}&= -\\frac{1}{\\rho}\\nabla p + \\nu \\nabla^2 \\bf{u} + {\\bf f}, \\\\\n\\nabla \\cdot {\\bf u}&=0,\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\partial_{t}{\\bf u}+{\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}\" display=\"inline\"><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>𝐮</mi></mrow><mo>+</mo><mrow><mi>𝐮</mi><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=-\\frac{1}{\\rho}\\nabla p+\\nu\\nabla^{2}\\bf{u}+{\\bf f},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>ρ</mi></mfrac></mstyle><mo>⁢</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>p</mi></mrow></mrow></mrow><mo>+</mo><mrow><mi>ν</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>𝐮</mi></mrow></mrow><mo>+</mo><mi>𝐟</mi></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\nabla\\cdot{\\bf u}\" display=\"inline\"><mrow><mo>∇</mo><mo>⋅</mo><mi>𝐮</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1Xa.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=0,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhere $\\alpha$ is a constant. The addition of this friction term was first suggested by \\citet{bondarenko_1979} in the context of a Q2D flow realized in an electromagnetically driven shallow layer of electrolyte. In such a flow, the bottom of the fluid layer is constrained to be at rest because it is in contact with the solid surface of the container holding the fluid. As one moves away from the bottom surface into the bulk, the fluid velocity gradually increases because of viscous coupling, reaching a finite value. Hence,  the no-slip constraint at the bottom of the fluid layer causes a gradient in the magnitude of velocity along the layer thickness ($z$-direction) when the fluid is driven. \\citet{bondarenko_1979} rationalized that the dissipation due to this shear, for sufficiently shallow fluid layers, is captured by the linear friction term. In the context of Q2D flows in electrolyte layers this term has come to be known as ``Rayleigh friction.\" Experimental realizations of Kolmogorov flow, which are Q2D and use \\textit{roughly} sinusoidal driving, as well as 2D models that employ equation (\\ref{eq:2dns_wf}) are now commonly referred to as ``Kolmogorov-like flow.\"\n\nSince the 1980s, Q2D flows in thin electrolyte layers have been studied extensively in diverse contexts  using equation (\\ref{eq:2dns_wf}). For instance, several studies were conducted aimed at understanding the different regimes the flow transitions through as the strength of the forcing is increased \\citep{dolzhanskii_1992, obukhov_1983}. The effect of varying both the geometry \\citep{gledzer_1981, batchaev_1983, kolesnikov_1985a, kolesnikov_1985b, batchaev_1989} and  the number of forcing periods \\citep{batchaev_1989, thess_1992a} on these regimes was analytically and experimentally explored in detail. Additionally, equation (\\ref{eq:2dns_wf}) also formed the basis of several studies aimed at understanding the statistics of 2D turbulence, often using non-sinusoidal forms of forcing; see \\citet{tabeling_2002} for a thorough review article. More recently, the validity and limitations of equation (\\ref{eq:2dns_wf}) in describing the evolution of turbulent flows \\citep{juttner_1997, paret_1997b, akkermans_2008a}, with focus on the emergence of 3D secondary flows in Q2D experiments, was extensively studied. \\citet{satijn_2001}, as well as \\citet{Kelley_2011a}, have each provided regime diagrams indicating the range of Reynolds numbers for which a 3D experimental flow can be considered Q2D and described by equation (\\ref{eq:2dns_wf}). \n\nAcross most studies comparing Q2D experiments with theoretical predictions, however, a reliable and consistent procedure to estimate the coefficients $\\alpha$, $\\nu$, and $\\rho$  in equation (\\ref{eq:2dns_wf}) has not been followed. For instance, some studies have treated $\\alpha$ as a fitting parameter \\citep{bondarenko_1979, dolzhanskii_1990} to compare theoretical predictions with experiments, albeit with an \\textit{ad hoc} assumption that the viscous term ($\\nabla^2{\\bf u}$) was negligible. The sensitivity of the flow to experimental imperfections and deviations from quasi-two-dimensionality have not been considered, leading to a possibly erroneous estimate of $\\alpha$. Additionally, flows realized in stratified layers of fluids have viscosities and densities which vary across the depth of the fluid layers. In such cases, the numerical values of $\\nu$ and $\\rho$ used in equation (\\ref{eq:2dns_wf}) need to account for this inhomogeneity. Previous studies have not addressed this issue in a systematic manner either \\citep{juttner_1997, shats_2010, boffetta_2012}.\n\nTo address this deficiency, \\citet{suri_2014} have investigated the problem of estimating the coefficients in equation (\\ref{eq:2dns_wf}) to model Q2D flows realized in the single layer as well as the stratified two-immiscible-layer setups. Analytical expressions for $\\alpha$, $\\nu$, and $\\rho$ for both of these setups have been derived. Additionally, the following modified version of equation (\\ref{eq:2dns_wf}) governing the evolution of the free surface of the fluid layer has been suggested in order to account for the inherent three-dimensionality of a Q2D flow and describe its evolution more accurately:\n\n", "itemtype": "equation", "pos": 4144, "prevtext": "\nHere, ${\\bf u}=(u_x,u_y)$ is the incompressible velocity field quantifying the motion of the fluid, $p$ is the 2D pressure field, and ${\\bf f} = \\chi \\sin(\\kappa y) \\hat{\\bf x}$ is the sinusoidal driving with amplitude $\\chi$ and wavenumber $\\kappa$. The parameters $\\rho$ and $\\nu$ are the density and the kinematic viscosity of the fluid being driven, respectively. Kolmogorov flow has served as a theoretically amenable model for understanding a wide variety of hydrodynamic phenomena in 2D, such as fluid instabilities \\citep{meshalkin_1961, iudovich_1965, kliatskin_1972, nepomniashchii_1976}, coherent structures \\citep{armbruster_1992, smaoui_2001}, and 2D turbulence \\citep{green_1974, chandler_2013}, to name a few. \n\nFlows realized in the real world, however, are never strictly 2D. Experimentalists often make use of confinement \\citep{bondarenko_1979, couder_1989}, stratification \\citep{marteau_1995, rivera_2005}, rotation \\citep{greenspan_1990}, or the application of a strong external magnetic field \\citep{sommeria_1986} to suppress one of the velocity components ($z$-direction) in a 3D flow, making the flow closer to 2D. The evolution of these so-called ``quasi-two-dimensional'' (Q2D) flows has often been described by modifying the 2D Navier-Stokes equation  (\\ref{eq:2dns}) with the addition of a linear friction term:\n \n", "index": 3, "text": "\\begin{equation}\\label{eq:2dns_wf}\n\\partial_t{\\bf u} + {\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}= -\\frac{1}{\\rho}\\nabla p + \\nu \\nabla^2 \\bf{u} - \\alpha\\bf{u} + {\\bf f},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\partial_{t}{\\bf u}+{\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}=-\\frac{1}{\\rho}\\nabla p+%&#10;\\nu\\nabla^{2}\\bf{u}-\\alpha\\bf{u}+{\\bf f},\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>𝐮</mi></mrow><mo>+</mo><mrow><mi>𝐮</mi><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mi>ρ</mi></mfrac><mo>⁢</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>p</mi></mrow></mrow></mrow><mo>+</mo><mrow><mi>ν</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mi>𝐮</mi></mrow></mrow><mo>+</mo><mi>𝐟</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhere $\\beta\\leq1$ is a prefactor to the advection term previously unaccounted for. This new prefactor $\\beta$ accounts for the decrease of the mean inertia of the fluid layer resulting from the velocity gradient along the layer thickness. It can be easily seen that equations (\\ref{eq:2dns}) and (\\ref{eq:2dns_wf}) can be treated as special cases of (\\ref{eq:2dns_mod}) by suitable choices of the parameters $\\alpha$ and $\\beta$. Equations (\\ref{eq:2dns})-(\\ref{eq:2dns_mod}) have been presented in dimensional form to highlight the importance of each of the parameters and to facilitate direct comparison between simulations and experiment.  A nondimensional form of equation (\\ref{eq:2dns_mod}) is available in Appendix \\ref{sec:nondim}.\n\nIt is worth emphasizing that equation (\\ref{eq:2dns_mod}) has been derived from first principles by depth-averaging the full 3D Navier-Stokes equation.  The coefficients $\\alpha$, $\\nu$, and $\\beta$ can be computed by substituting experimental parameters into analytical expressions, requiring no free parameters. The goal of this article then is twofold: first, to show using a specific example that equation (\\ref{eq:2dns_mod}), in comparison to equation (\\ref{eq:2dns_wf}), provides a more accurate description of a Q2D flow, and second, to employ equation (\\ref{eq:2dns_mod}) to obtain quantitative agreement between experiment and carefully modelled numerical simulations in the study of a Kolmogorov-like flow. Special attention has been given to modelling the magnetic field and imposing physically meaningful boundary conditions, since virtually all previous theoretical studies of Kolmogorov flow have assumed periodic boundary conditions and strictly sinusoidal forcing. \n\nThe prospect of developing a 2D model that describes the evolution of a Q2D flow is particularly appealing in view of the recent attempts at developing a deterministic description of turbulence. Over the last couple of decades, there has been substantial theoretical progress \\citep{nagata_1997,kerswell_2005,eckhardt_2007,gibson_2009} in understanding transitional and weak turbulence as a dynamical process guided by exact but unstable solutions of the Navier-Stokes equation, often referred to as exact coherent structures (ECS) \\citep{waleffe_1998}. These studies predominantly focused on identifying and understanding the role of ECS in 3D flows simulated on periodic domains with simple geometries, such as pipe flow, plane Couette flow, and plane Poiseuille flow. However, experimental evidence for the role of ECS is very scarce \\citep{hof_2004,lozar_2012,dennis_2014}, in part due to technological limitations in obtaining spatiotemporally resolved 3D velocity fields. Q2D flows, on the other hand, can be quantified using 2D planar velocity fields whose measurement is a relatively easy task. Hence, along with the 2D model (\\ref{eq:2dns_mod}) describing their evolution, Q2D flows in experiments may serve as an ideal platform to develop an ECS based approach to understanding turbulence. Recently, \\citet{chandler_2013} and \\citet{lucas_2014,lucas_2015} have identified several ECS in numerical simulations of a weakly turbulent 2D Kolmogorov flow, governed by equation (\\ref{eq:2dns}). We hope that this paper helps provide a rigorous foundation for future studies in the same spirit of \\citet{chandler_2013} and \\citet{lucas_2014,lucas_2015}, albeit with a focus on relating theoretical observations with experimental ones. \n\nThis article is organized as follows. In \\S \\ref{sec:exp_setup}, we introduce the experimental setup. In \\S \\ref{sec:LSA}, we present the linear stability analysis for equations (\\ref{eq:2dns}) -- (\\ref{eq:2dns_mod}) to compare the analytical predictions of the initial instability for the three models with what is observed in the experiment. In \\S \\ref{sec:model}, we explain how we model the forcing in the experiment, and we present three different simulation domains which are used to study the effects of different boundary conditions. In \\S \\ref{sec:comparison}, we compare the flow fields obtained from experimental measurements with those from the numerical simulations for different flow regimes as the driving is increased. Then, in \\S \\ref{sec:limitations}, we address the potential sources of discrepancies between experimental observations and numerical predictions, discussing the limitations of equation (\\ref{eq:2dns_mod}). We discuss conclusions and potential improvements in \\S \\ref{sec:conclusion}.  Details of the numerical simulations have been included in Appendix \\ref{sec:num_meth}, and a nondimensional form of equation (\\ref{eq:2dns_mod}) is provided in Appendix \\ref{sec:nondim}.\n\n\\section{Experimental Setup} \\label{sec:exp_setup}\n\nWe generate a Q2D Kolmogorov-like flow in the experiment using a stratified setup with two immiscible fluid layers, first introduced by \\citet{rivera_2005}. In this configuration, a lighter electrolyte is suspended on top of a dielectric, which serves as a lubricant between the driven electrolyte layer and the solid surface at the bottom of the container. The fluid layers are set in motion by driving the electrolyte layer using Lorentz forces resulting from the interaction of a direct current and a spatially varying magnetic field generated by permanent magnets.\n\nTo create a magnetic field that is approximately periodic in one direction, we use a magnet array consisting of 14 NdFeB magnets (Grade N42). Each magnet is 15.24 cm long and 1.27 cm wide, with a thickness of $0.32 \\pm 0.01$ cm. The magnetization is through the thickness, with a surface field strength of about 0.2 T. The magnets are positioned side-by-side along their width to form a 15.24 cm $\\times$ ($14\\times1.27$ cm) $\\times$  0.32 cm array such that the adjacent magnets have fields pointing in opposite directions, normal to the plane of the array.  This magnet array is placed on a flat aluminum plate of dimensions 30.5 cm $\\times$ 30.5 cm $\\times$  1.0 cm, and rectangular pieces of aluminum with the same thickness as the magnets ($0.32 \\pm 0.02$ cm) are placed beside the magnet array to create a level surface. Manufacturing imperfections in the individual magnets and the aluminum siding result in a surface which is not adequately smooth. Hence, a thin  glass plate measuring $25.4$ cm $\\times$ $25.4$ cm in area with a thickness of $0.079 \\pm 0.005$ cm is placed atop the magnets and siding to provide a uniform bottom surface. A thin layer of black, adhesive contact paper (with approximate thickness 0.005 cm) is placed on top of the glass plate to serve as a dark background for imaging. The surface of the contact paper serves as the bottom boundary for the fluids.  We place the origin of our coordinate system at this height and the lateral centre, with the $x$-coordinate aligned with the magnet length, the $y$-coordinate pointing in the direction of the magnet periodicity, and the $z$-coordinate pointing opposite gravitational acceleration.  See figure \\ref{expsetup} for a schematic diagram.\n\n\\begin{figure}\n\\subfloat[]{\n\\begin{minipage}[c][1.2\\width]{0.5\\textwidth}\n\\includegraphics[clip,width=2.5in]{Figure_1_a.pdf}\n\\end{minipage}}\\subfloat[]{\\centering{}\n\\begin{minipage}[c][1.2\\width]{0.5\\textwidth}\n\\begin{center}\n\\includegraphics[clip,width=2.8in]{Figure_1_b.pdf}\n\\par\\end{center}\n\\end{minipage}}\n\\caption{\\label{expsetup} A schematic diagram of the two-immiscible-layer Kolmogorov-like flow experimental setup viewed (a) from above and (b) from the transverse cross section.  The fluid flow is driven by Lorentz forces arising from the interaction of a direct current density, which is passed through the electrolyte in the $y$-direction, with a spatially varying magnetic field pointed in the $\\pm z$-direction, generated by an array of permanent magnets located below the fluid layers (dashed lines in (a); black and white rectangles in (b)).  The resulting forcing is in the $\\pm x$-direction.  The flow is bounded by two end walls, two side walls (electrodes), and a no-slip bottom surface, while the top surface is a free electrolyte-air interface.  This container is mounted on an aluminum plate which is levelled and submerged in a water bath that is regulated such that the electrolyte is maintained at 23$^\\circ$C $\\pm$ 0.2$^\\circ$C.}\n\\end{figure}\n\nWalls are affixed directly onto the contact paper to create the lateral boundaries of the container that will hold the fluids. Along the $y$-direction, two rectangular bars of acrylic are placed at a distance of 17.8 cm apart, centred about the origin.  These solid boundaries for the fluid are henceforth referred to as the ``end walls.\" Along the $x$-direction, two electrodes mounted on rectangular bars of acrylic are placed at a distance of 22.9 cm, centred about the origin. These boundaries are henceforth referred to as the ``side walls\" and are used to drive the current through the electrolyte. The placement of the end walls and side walls leaves a buffer region of $d_x=1.27$ cm and $d_y=2.54$ cm, respectively, between the edge of the magnet array and these solid boundaries. See figure \\ref{expsetup} (a) for a schematic diagram depicting the locations of the walls. \n\nThe aluminum plate upon which the magnets are mounted is supported by three screws, which are adjusted to level the system. The interior of the container is filled with $122\\pm4$ mL of a dielectric fluid and $122\\pm2$ mL of an electrolyte to form two immiscible layers that are $0.30 \\pm 0.01$ cm and $0.30 \\pm 0.005$ cm thick, respectively. The dielectric fluid used is perfluorooctane, which has a viscosity of $\\mu_d = 1.30$ mPa$\\cdot$s and a density of $\\rho_d = 1769$ kg/m$^3$ at 23.0$^{\\circ}$C.  The electrolyte fluid is a solution consisting of 60\\% 1 M copper sulfate solution and 40\\% glycerol by weight.  The electrolyte's viscosity is $\\mu_c = 5.85$ mPa$\\cdot$s and the density is $\\rho_c = 1192$ kg/m$^3$ at 23.0$^{\\circ}$C.  A small amount of viscosity-matched surfactant is added to the electrolyte to lower the surface tension, and a glass lid is placed on top of the container to limit evaporation.\n\nA direct current, which serves as the control parameter, is then passed through the electrolyte; the resulting current density ranges from about 10 to 40 A/m$^2$ across the different runs. The interaction of this current density {\\bf J} ($y$-direction) with the spatially alternating magnetic field {\\bf B} ($\\pm z$-direction) results in an alternating Lorentz force {\\bf F} ($\\pm x$-direction) driving shear flow. Since passing a current through a resistive conductor (the electrolyte) results in Joule heating, a calibrated thermistor is placed in the corner of the fluid domain and the aluminum plate is immersed in a temperature-controlled water bath. The water bath is regulated such that the temperature of the electrolyte is maintained to $23.0 \\pm 0.2^{\\circ}$C.  By limiting the temperature fluctuations, the associated change in viscosity of the fluids is kept to a minimum.\n \nFor flow visualization, we add hollow glass microspheres to the fluid which are illuminated with white light emitting diodes and imaged using a camera which is positioned above the apparatus. Two separate methods are used to seed the flow with particles, either at the free surface and at the dielectric-electrolyte interface.  For free surface seeding, we add dry glass microspheres; these particles are Glass Bubbles (K15) manufactured by 3M and sieved to obtain particles with mean radius $24.5 \\pm 2$ $\\mu$m and mean density $150$ kg/m$^3$. For electrolyte-dielectric seeding, glass microspheres coated in titanium oxide (mean radius $9 \\pm 6$ $\\mu$m and mean density 800 kg/m$^3$), are mixed with perfluorooctane then injected into the perfluorooctane layer after both fluids have been poured into the box.  For the latter, although the microspheres are less dense than both fluids, they remain trapped at the dielectric-electrolyte interface due to interfacial tension.  The second method is particularly useful when the experiment will be running continuously for longer than an hour, as we observe that particles seeded at the interface remain evenly distributed much longer. For a Q2D flow, the velocity at the free surface is related to that at the interface by a constant scale factor $s=1.08$ obtained from analytical computations presented in \\citet{suri_2014}. This scale factor has been verified to within 1\\% by comparing velocity measurements from separate experiments with seeding at the interface or free surface. Throughout the paper, experimental measurements at the interface are presented in the rescaled form for consistency with those measured at the free surface.\n\nThe seeded flow is imaged at 15 Hz with a DMK 31BU03 camera manufactured by The Imaging Source; this camera has a CCD sensor with a resolution of 1024 $\\times$ 768 pixels, which results in an adequate resolution of about 53 pixels per magnet width.  The flow velocities are calculated using the PRANA particle image velocimetry (PIV) package \\citep{eckstein_2009, prana}. This software employs a multigrid PIV algorithm that deforms images to better resolve flows with high shear, as Kolmogorov-like flow has. The  velocity field is resolved on a 169 $\\times$ 126 grid, with about 9 points per magnet width.  \n\nFor the experimental measurements listed above, we obtain $\\alpha=0.064$ s$^{-1}$, $\\beta=0.83$, and $\\nu=3.26 \\times 10^{-6}$ m$^2$/s for the parameters for equation (\\ref{eq:2dns_mod}). The complexity of the flow in both the experiment and simulation is characterized by the Reynolds number, which we define as:\n\n", "itemtype": "equation", "pos": 8561, "prevtext": "\nwhere $\\alpha$ is a constant. The addition of this friction term was first suggested by \\citet{bondarenko_1979} in the context of a Q2D flow realized in an electromagnetically driven shallow layer of electrolyte. In such a flow, the bottom of the fluid layer is constrained to be at rest because it is in contact with the solid surface of the container holding the fluid. As one moves away from the bottom surface into the bulk, the fluid velocity gradually increases because of viscous coupling, reaching a finite value. Hence,  the no-slip constraint at the bottom of the fluid layer causes a gradient in the magnitude of velocity along the layer thickness ($z$-direction) when the fluid is driven. \\citet{bondarenko_1979} rationalized that the dissipation due to this shear, for sufficiently shallow fluid layers, is captured by the linear friction term. In the context of Q2D flows in electrolyte layers this term has come to be known as ``Rayleigh friction.\" Experimental realizations of Kolmogorov flow, which are Q2D and use \\textit{roughly} sinusoidal driving, as well as 2D models that employ equation (\\ref{eq:2dns_wf}) are now commonly referred to as ``Kolmogorov-like flow.\"\n\nSince the 1980s, Q2D flows in thin electrolyte layers have been studied extensively in diverse contexts  using equation (\\ref{eq:2dns_wf}). For instance, several studies were conducted aimed at understanding the different regimes the flow transitions through as the strength of the forcing is increased \\citep{dolzhanskii_1992, obukhov_1983}. The effect of varying both the geometry \\citep{gledzer_1981, batchaev_1983, kolesnikov_1985a, kolesnikov_1985b, batchaev_1989} and  the number of forcing periods \\citep{batchaev_1989, thess_1992a} on these regimes was analytically and experimentally explored in detail. Additionally, equation (\\ref{eq:2dns_wf}) also formed the basis of several studies aimed at understanding the statistics of 2D turbulence, often using non-sinusoidal forms of forcing; see \\citet{tabeling_2002} for a thorough review article. More recently, the validity and limitations of equation (\\ref{eq:2dns_wf}) in describing the evolution of turbulent flows \\citep{juttner_1997, paret_1997b, akkermans_2008a}, with focus on the emergence of 3D secondary flows in Q2D experiments, was extensively studied. \\citet{satijn_2001}, as well as \\citet{Kelley_2011a}, have each provided regime diagrams indicating the range of Reynolds numbers for which a 3D experimental flow can be considered Q2D and described by equation (\\ref{eq:2dns_wf}). \n\nAcross most studies comparing Q2D experiments with theoretical predictions, however, a reliable and consistent procedure to estimate the coefficients $\\alpha$, $\\nu$, and $\\rho$  in equation (\\ref{eq:2dns_wf}) has not been followed. For instance, some studies have treated $\\alpha$ as a fitting parameter \\citep{bondarenko_1979, dolzhanskii_1990} to compare theoretical predictions with experiments, albeit with an \\textit{ad hoc} assumption that the viscous term ($\\nabla^2{\\bf u}$) was negligible. The sensitivity of the flow to experimental imperfections and deviations from quasi-two-dimensionality have not been considered, leading to a possibly erroneous estimate of $\\alpha$. Additionally, flows realized in stratified layers of fluids have viscosities and densities which vary across the depth of the fluid layers. In such cases, the numerical values of $\\nu$ and $\\rho$ used in equation (\\ref{eq:2dns_wf}) need to account for this inhomogeneity. Previous studies have not addressed this issue in a systematic manner either \\citep{juttner_1997, shats_2010, boffetta_2012}.\n\nTo address this deficiency, \\citet{suri_2014} have investigated the problem of estimating the coefficients in equation (\\ref{eq:2dns_wf}) to model Q2D flows realized in the single layer as well as the stratified two-immiscible-layer setups. Analytical expressions for $\\alpha$, $\\nu$, and $\\rho$ for both of these setups have been derived. Additionally, the following modified version of equation (\\ref{eq:2dns_wf}) governing the evolution of the free surface of the fluid layer has been suggested in order to account for the inherent three-dimensionality of a Q2D flow and describe its evolution more accurately:\n\n", "index": 5, "text": "\\begin{equation}\\label{eq:2dns_mod}\n\\partial_t{\\bf u} + \\beta{\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}= -\\frac{1}{\\rho}\\nabla p + \\nu \\nabla^2 \\bf{u} - \\alpha\\bf{u} + {\\bf f},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\partial_{t}{\\bf u}+\\beta{\\bf u}\\cdot{\\bf{\\nabla}}{\\bf{u}}=-\\frac{1}{\\rho}%&#10;\\nabla p+\\nu\\nabla^{2}\\bf{u}-\\alpha\\bf{u}+{\\bf f},\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>𝐮</mi></mrow><mo>+</mo><mrow><mrow><mi>β</mi><mo>⁢</mo><mi>𝐮</mi></mrow><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mi>ρ</mi></mfrac><mo>⁢</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>p</mi></mrow></mrow></mrow><mo>+</mo><mrow><mi>ν</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mi>𝐮</mi></mrow></mrow><mo>+</mo><mi>𝐟</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhere $L=1.27$ cm is the width of one magnet and $U=\\sqrt{\\langle u_x^2+u_y^2 \\rangle}$ is the measured root-mean-square (rms) velocity, where $\\langle \\cdot \\rangle$ denotes spatial averaging over a central subregion that is the same dimensions as the doubly-periodic simulation (10.16 cm $\\times$ 10.16 cm) which is discussed below.  Note that from this point on, unless specified, lengths will be nondimensionalized by the characteristic length scale $L=1.27$ cm. We will now shift our attention to theoretical predictions for the initial instability of Kolmogorov-like flow by performing the linear stability analysis.\n\n\\section{Linear Stability Analysis}\\label{sec:LSA}\n\nAs mentioned in the introduction, one of the primary goals of this article is to show that equation (\\ref{eq:2dns_mod}) provides a more accurate description of a Q2D flow compared to equation (\\ref{eq:2dns_wf}).  The \\textit{proof-by-example} we present below is far from being rigorous, but is sufficient to highlight the error one incurs using equation (\\ref{eq:2dns_wf}) in place of equation (\\ref{eq:2dns_mod}) when comparing with experiments. Here, we consider a Kolmogorov-like flow on an unbounded domain with forcing that is strictly sinusoidal. It can easily be seen that when the driving is low the flow mimics the sinusoidal profile of the forcing for all the three governing equations (\\ref{eq:2dns})-(\\ref{eq:2dns_mod}), i.e. ${\\bf u} \\approx \\sin(\\kappa y)\\hat{\\bf x}$. As the strength of the forcing increases, this laminar flow is known to become unstable to longitudinal perturbations, bifurcating into a flow with time-independent vortices. This vortex pattern has the same periodicity $\\kappa$ as the laminar flow along the $y$-direction. Several previous studies have analysed this transition theoretically \\citep{meshalkin_1961, iudovich_1965, kliatskin_1972, nepomniashchii_1976}. Experiments across different setups have also confirmed this transition \\citep{bondarenko_1979, obukhov_1983, batchaev_1983} and have characterized it using the critical Reynolds number ($Re_c^{exp}$) and longitudinal wavenumber ($k_c^{exp}$) of the vortex pattern at onset of the secondary state. Linear stability analysis of the laminar flow on the unbounded domain shows that for longitudinal perturbations with wavelength $k_x = q\\kappa$ the Reynolds number at which the laminar flow goes unstable is approximately given by\n\n", "itemtype": "equation", "pos": 22339, "prevtext": "\nwhere $\\beta\\leq1$ is a prefactor to the advection term previously unaccounted for. This new prefactor $\\beta$ accounts for the decrease of the mean inertia of the fluid layer resulting from the velocity gradient along the layer thickness. It can be easily seen that equations (\\ref{eq:2dns}) and (\\ref{eq:2dns_wf}) can be treated as special cases of (\\ref{eq:2dns_mod}) by suitable choices of the parameters $\\alpha$ and $\\beta$. Equations (\\ref{eq:2dns})-(\\ref{eq:2dns_mod}) have been presented in dimensional form to highlight the importance of each of the parameters and to facilitate direct comparison between simulations and experiment.  A nondimensional form of equation (\\ref{eq:2dns_mod}) is available in Appendix \\ref{sec:nondim}.\n\nIt is worth emphasizing that equation (\\ref{eq:2dns_mod}) has been derived from first principles by depth-averaging the full 3D Navier-Stokes equation.  The coefficients $\\alpha$, $\\nu$, and $\\beta$ can be computed by substituting experimental parameters into analytical expressions, requiring no free parameters. The goal of this article then is twofold: first, to show using a specific example that equation (\\ref{eq:2dns_mod}), in comparison to equation (\\ref{eq:2dns_wf}), provides a more accurate description of a Q2D flow, and second, to employ equation (\\ref{eq:2dns_mod}) to obtain quantitative agreement between experiment and carefully modelled numerical simulations in the study of a Kolmogorov-like flow. Special attention has been given to modelling the magnetic field and imposing physically meaningful boundary conditions, since virtually all previous theoretical studies of Kolmogorov flow have assumed periodic boundary conditions and strictly sinusoidal forcing. \n\nThe prospect of developing a 2D model that describes the evolution of a Q2D flow is particularly appealing in view of the recent attempts at developing a deterministic description of turbulence. Over the last couple of decades, there has been substantial theoretical progress \\citep{nagata_1997,kerswell_2005,eckhardt_2007,gibson_2009} in understanding transitional and weak turbulence as a dynamical process guided by exact but unstable solutions of the Navier-Stokes equation, often referred to as exact coherent structures (ECS) \\citep{waleffe_1998}. These studies predominantly focused on identifying and understanding the role of ECS in 3D flows simulated on periodic domains with simple geometries, such as pipe flow, plane Couette flow, and plane Poiseuille flow. However, experimental evidence for the role of ECS is very scarce \\citep{hof_2004,lozar_2012,dennis_2014}, in part due to technological limitations in obtaining spatiotemporally resolved 3D velocity fields. Q2D flows, on the other hand, can be quantified using 2D planar velocity fields whose measurement is a relatively easy task. Hence, along with the 2D model (\\ref{eq:2dns_mod}) describing their evolution, Q2D flows in experiments may serve as an ideal platform to develop an ECS based approach to understanding turbulence. Recently, \\citet{chandler_2013} and \\citet{lucas_2014,lucas_2015} have identified several ECS in numerical simulations of a weakly turbulent 2D Kolmogorov flow, governed by equation (\\ref{eq:2dns}). We hope that this paper helps provide a rigorous foundation for future studies in the same spirit of \\citet{chandler_2013} and \\citet{lucas_2014,lucas_2015}, albeit with a focus on relating theoretical observations with experimental ones. \n\nThis article is organized as follows. In \\S \\ref{sec:exp_setup}, we introduce the experimental setup. In \\S \\ref{sec:LSA}, we present the linear stability analysis for equations (\\ref{eq:2dns}) -- (\\ref{eq:2dns_mod}) to compare the analytical predictions of the initial instability for the three models with what is observed in the experiment. In \\S \\ref{sec:model}, we explain how we model the forcing in the experiment, and we present three different simulation domains which are used to study the effects of different boundary conditions. In \\S \\ref{sec:comparison}, we compare the flow fields obtained from experimental measurements with those from the numerical simulations for different flow regimes as the driving is increased. Then, in \\S \\ref{sec:limitations}, we address the potential sources of discrepancies between experimental observations and numerical predictions, discussing the limitations of equation (\\ref{eq:2dns_mod}). We discuss conclusions and potential improvements in \\S \\ref{sec:conclusion}.  Details of the numerical simulations have been included in Appendix \\ref{sec:num_meth}, and a nondimensional form of equation (\\ref{eq:2dns_mod}) is provided in Appendix \\ref{sec:nondim}.\n\n\\section{Experimental Setup} \\label{sec:exp_setup}\n\nWe generate a Q2D Kolmogorov-like flow in the experiment using a stratified setup with two immiscible fluid layers, first introduced by \\citet{rivera_2005}. In this configuration, a lighter electrolyte is suspended on top of a dielectric, which serves as a lubricant between the driven electrolyte layer and the solid surface at the bottom of the container. The fluid layers are set in motion by driving the electrolyte layer using Lorentz forces resulting from the interaction of a direct current and a spatially varying magnetic field generated by permanent magnets.\n\nTo create a magnetic field that is approximately periodic in one direction, we use a magnet array consisting of 14 NdFeB magnets (Grade N42). Each magnet is 15.24 cm long and 1.27 cm wide, with a thickness of $0.32 \\pm 0.01$ cm. The magnetization is through the thickness, with a surface field strength of about 0.2 T. The magnets are positioned side-by-side along their width to form a 15.24 cm $\\times$ ($14\\times1.27$ cm) $\\times$  0.32 cm array such that the adjacent magnets have fields pointing in opposite directions, normal to the plane of the array.  This magnet array is placed on a flat aluminum plate of dimensions 30.5 cm $\\times$ 30.5 cm $\\times$  1.0 cm, and rectangular pieces of aluminum with the same thickness as the magnets ($0.32 \\pm 0.02$ cm) are placed beside the magnet array to create a level surface. Manufacturing imperfections in the individual magnets and the aluminum siding result in a surface which is not adequately smooth. Hence, a thin  glass plate measuring $25.4$ cm $\\times$ $25.4$ cm in area with a thickness of $0.079 \\pm 0.005$ cm is placed atop the magnets and siding to provide a uniform bottom surface. A thin layer of black, adhesive contact paper (with approximate thickness 0.005 cm) is placed on top of the glass plate to serve as a dark background for imaging. The surface of the contact paper serves as the bottom boundary for the fluids.  We place the origin of our coordinate system at this height and the lateral centre, with the $x$-coordinate aligned with the magnet length, the $y$-coordinate pointing in the direction of the magnet periodicity, and the $z$-coordinate pointing opposite gravitational acceleration.  See figure \\ref{expsetup} for a schematic diagram.\n\n\\begin{figure}\n\\subfloat[]{\n\\begin{minipage}[c][1.2\\width]{0.5\\textwidth}\n\\includegraphics[clip,width=2.5in]{Figure_1_a.pdf}\n\\end{minipage}}\\subfloat[]{\\centering{}\n\\begin{minipage}[c][1.2\\width]{0.5\\textwidth}\n\\begin{center}\n\\includegraphics[clip,width=2.8in]{Figure_1_b.pdf}\n\\par\\end{center}\n\\end{minipage}}\n\\caption{\\label{expsetup} A schematic diagram of the two-immiscible-layer Kolmogorov-like flow experimental setup viewed (a) from above and (b) from the transverse cross section.  The fluid flow is driven by Lorentz forces arising from the interaction of a direct current density, which is passed through the electrolyte in the $y$-direction, with a spatially varying magnetic field pointed in the $\\pm z$-direction, generated by an array of permanent magnets located below the fluid layers (dashed lines in (a); black and white rectangles in (b)).  The resulting forcing is in the $\\pm x$-direction.  The flow is bounded by two end walls, two side walls (electrodes), and a no-slip bottom surface, while the top surface is a free electrolyte-air interface.  This container is mounted on an aluminum plate which is levelled and submerged in a water bath that is regulated such that the electrolyte is maintained at 23$^\\circ$C $\\pm$ 0.2$^\\circ$C.}\n\\end{figure}\n\nWalls are affixed directly onto the contact paper to create the lateral boundaries of the container that will hold the fluids. Along the $y$-direction, two rectangular bars of acrylic are placed at a distance of 17.8 cm apart, centred about the origin.  These solid boundaries for the fluid are henceforth referred to as the ``end walls.\" Along the $x$-direction, two electrodes mounted on rectangular bars of acrylic are placed at a distance of 22.9 cm, centred about the origin. These boundaries are henceforth referred to as the ``side walls\" and are used to drive the current through the electrolyte. The placement of the end walls and side walls leaves a buffer region of $d_x=1.27$ cm and $d_y=2.54$ cm, respectively, between the edge of the magnet array and these solid boundaries. See figure \\ref{expsetup} (a) for a schematic diagram depicting the locations of the walls. \n\nThe aluminum plate upon which the magnets are mounted is supported by three screws, which are adjusted to level the system. The interior of the container is filled with $122\\pm4$ mL of a dielectric fluid and $122\\pm2$ mL of an electrolyte to form two immiscible layers that are $0.30 \\pm 0.01$ cm and $0.30 \\pm 0.005$ cm thick, respectively. The dielectric fluid used is perfluorooctane, which has a viscosity of $\\mu_d = 1.30$ mPa$\\cdot$s and a density of $\\rho_d = 1769$ kg/m$^3$ at 23.0$^{\\circ}$C.  The electrolyte fluid is a solution consisting of 60\\% 1 M copper sulfate solution and 40\\% glycerol by weight.  The electrolyte's viscosity is $\\mu_c = 5.85$ mPa$\\cdot$s and the density is $\\rho_c = 1192$ kg/m$^3$ at 23.0$^{\\circ}$C.  A small amount of viscosity-matched surfactant is added to the electrolyte to lower the surface tension, and a glass lid is placed on top of the container to limit evaporation.\n\nA direct current, which serves as the control parameter, is then passed through the electrolyte; the resulting current density ranges from about 10 to 40 A/m$^2$ across the different runs. The interaction of this current density {\\bf J} ($y$-direction) with the spatially alternating magnetic field {\\bf B} ($\\pm z$-direction) results in an alternating Lorentz force {\\bf F} ($\\pm x$-direction) driving shear flow. Since passing a current through a resistive conductor (the electrolyte) results in Joule heating, a calibrated thermistor is placed in the corner of the fluid domain and the aluminum plate is immersed in a temperature-controlled water bath. The water bath is regulated such that the temperature of the electrolyte is maintained to $23.0 \\pm 0.2^{\\circ}$C.  By limiting the temperature fluctuations, the associated change in viscosity of the fluids is kept to a minimum.\n \nFor flow visualization, we add hollow glass microspheres to the fluid which are illuminated with white light emitting diodes and imaged using a camera which is positioned above the apparatus. Two separate methods are used to seed the flow with particles, either at the free surface and at the dielectric-electrolyte interface.  For free surface seeding, we add dry glass microspheres; these particles are Glass Bubbles (K15) manufactured by 3M and sieved to obtain particles with mean radius $24.5 \\pm 2$ $\\mu$m and mean density $150$ kg/m$^3$. For electrolyte-dielectric seeding, glass microspheres coated in titanium oxide (mean radius $9 \\pm 6$ $\\mu$m and mean density 800 kg/m$^3$), are mixed with perfluorooctane then injected into the perfluorooctane layer after both fluids have been poured into the box.  For the latter, although the microspheres are less dense than both fluids, they remain trapped at the dielectric-electrolyte interface due to interfacial tension.  The second method is particularly useful when the experiment will be running continuously for longer than an hour, as we observe that particles seeded at the interface remain evenly distributed much longer. For a Q2D flow, the velocity at the free surface is related to that at the interface by a constant scale factor $s=1.08$ obtained from analytical computations presented in \\citet{suri_2014}. This scale factor has been verified to within 1\\% by comparing velocity measurements from separate experiments with seeding at the interface or free surface. Throughout the paper, experimental measurements at the interface are presented in the rescaled form for consistency with those measured at the free surface.\n\nThe seeded flow is imaged at 15 Hz with a DMK 31BU03 camera manufactured by The Imaging Source; this camera has a CCD sensor with a resolution of 1024 $\\times$ 768 pixels, which results in an adequate resolution of about 53 pixels per magnet width.  The flow velocities are calculated using the PRANA particle image velocimetry (PIV) package \\citep{eckstein_2009, prana}. This software employs a multigrid PIV algorithm that deforms images to better resolve flows with high shear, as Kolmogorov-like flow has. The  velocity field is resolved on a 169 $\\times$ 126 grid, with about 9 points per magnet width.  \n\nFor the experimental measurements listed above, we obtain $\\alpha=0.064$ s$^{-1}$, $\\beta=0.83$, and $\\nu=3.26 \\times 10^{-6}$ m$^2$/s for the parameters for equation (\\ref{eq:2dns_mod}). The complexity of the flow in both the experiment and simulation is characterized by the Reynolds number, which we define as:\n\n", "index": 7, "text": "\\begin{equation}\\label{eq:re_def}\nRe = \\frac{UL}{\\nu}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"Re=\\frac{UL}{\\nu}\" display=\"block\"><mrow><mrow><mi>R</mi><mo>⁢</mo><mi>e</mi></mrow><mo>=</mo><mfrac><mrow><mi>U</mi><mo>⁢</mo><mi>L</mi></mrow><mi>ν</mi></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nThis expression was computed by linearizing equation (\\ref{eq:2dns_mod}) around the laminar state and calculating the stability with respect to perturbations containing only 3 modes, all with the same longitudinal wavenumber $k_x$, i.e. $(k_x,-\\kappa)$, $(k_x,0)$, and $(k_x,\\kappa)$. Since equations (\\ref{eq:2dns}) and (\\ref{eq:2dns_wf}) are special cases of equation (\\ref{eq:2dns_mod}) one can compute the stability of the laminar flow for any of the three equations using (\\ref{eq:Re_0}). Hence, it is of interest to study (i) how the critical Reynolds number $\\displaystyle Re_c = \\min_{\\forall q}\\{Re_0(q)\\}$ and the corresponding critical wavenumber ($k_c = q_c\\kappa$) of the transition in flows governed by each of the three equations compare with those observed in experiments, and (ii) what the Reynolds number ($Re_0(q_{c}^{exp})$) predicted by equation (\\ref{eq:Re_0}) is for each of the three governing equations, using the critical wavenumber ($k_c^{exp} = \\kappa q_{c}^{exp}$) observed in the (bounded) experiment. In the following paragraphs we answer these questions. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3in]{nsc.pdf}\n\\caption{\\label{fig:nsc}Neutral stability curves from equation (\\ref{eq:Re_0}) showing the Reynolds number $Re_0$ at which the laminar flow goes unstable when subjected to a longitudinal perturbation of normalized wavenumber $q=k_x/\\kappa$. The parameters are $\\alpha=0.000$ s$^{-1}$ and $\\beta=1.00$ (black solid line), $\\alpha=0.064$ s$^{-1}$ and $\\beta=1.00$ (red dashed line), and $\\alpha=0.064$ s$^{-1}$ and $\\beta=0.83$ (blue dot-dashed line) which correspond to equations (\\ref{eq:2dns}), (\\ref{eq:2dns_wf}), and (\\ref{eq:2dns_mod}), respectively.  The black circle shows the corresponding measurement from the experiment.  In all cases, $\\nu=3.26 \\times 10^{-6}$ m$^2$/s and $\\kappa = 247.36$ m$^{-1}$ are held constant. }\n\\end{figure}\n\n\nFor $\\beta = 1$ and $\\alpha = 0$, which corresponds to the 2D Navier-Stokes equation (\\ref{eq:2dns}), one can see that the laminar flow is most unstable to long wavelength perturbations ($q_c = 0$), with the critical Reynolds number $Re_c = \\pi$. Figure \\ref{fig:nsc} shows a plot of $Re_0$ as a function of $q$ for $\\nu=3.26 \\times 10^{-6}$ m$^2$/s and $\\kappa = 247.36$ m$^{-1}$. Indicated on the same plot is $Re_c^{exp} = 11.07$ at $q_c^{exp} = 0.504$, corresponding to the instability we observe in the experiment described in \\S\\ref{sec:exp_setup}. For $q= q_c^{exp}$, the value predicted by equation (\\ref{eq:2dns}) is $Re_0(q=q_c^{exp}) =4.56$. Hence, as has been reported in earlier studies, equation (\\ref{eq:2dns}) fails to provide a quantitative description of the Q2D flow in the experiment.\n\nThis brings into focus the prediction from equation (\\ref{eq:2dns_wf}), which corresponds to $\\beta = 1$ and $\\alpha = 0.064$ s$^{-1}$, the latter value resulting from the analytical computations reported by  \\citet{satijn_2001} and \\citet{suri_2014}. All previous studies have used this equation to compare the onset of the primary instability in experiment and theory, albeit using free parameters. From the neutral stability curve plotted in figure \\ref{fig:nsc} it can be seen that the flow governed by this equation is most unstable to a perturbation with wavenumber $q_c = 0.465$, with a critical Reynolds number $Re_c = 7.60$. This finite wavenumber instability is in qualitative agreement with what one observes in experiments and is a significant improvement over that predicted using equation (\\ref{eq:2dns}). However, for $q = q_c^{exp}$, the instability predicted using equation (\\ref{eq:2dns_wf}) occurs at $Re_0(q = q_c^{exp}) =7.69$, which is still a significant underestimation of what one observes in the experiment. \n\nIn comparison, the neutral stability curve corresponding to equation (\\ref{eq:2dns_mod}) is scaled by a factor $1/\\beta$, as can be seen in equation (\\ref{eq:Re_0}). For $\\beta = 0.83$ the Reynolds number corresponding to the primary instability increases to $Re_0(q=q_c^{exp}) = 9.26$, an improvement of 14\\% over that predicted using equation (\\ref{eq:2dns_wf}). This increase in the stability of the laminar flow is due to the gradient in the magnitude of velocity along the layer depth, which results in a suppression of the effective nonlinearity of the flow; in contrast, equation (\\ref{eq:2dns_wf}) does not account for this suppression of the nonlinearity. This linear stability analysis serves as a demonstration of the importance of estimating the value of $\\beta$ correctly to achieve an accurate description of the Q2D flow. Hence, we use equation (\\ref{eq:2dns_mod}) for all numerical analysis presented in this article.\n\n\\section{Numerical Modelling} \\label{sec:model}\n\nIt is crucial to note that in the linear stability analysis presented above, we have assumed that the forcing is strictly sinusoidal and that the flow has an infinite lateral extent. This, however, is never the case with experiments, where one has to account for both the complicated magnetic field profile due to a finite-sized magnet array, as well as the role of boundaries to accurately predict transitions across various flow regimes.  In this section we present a numerical model for approximating the magnetic field due to the array of permanent magnets in the experiment (discussed in \\S \\ref{sec:exp_setup}). We then present three types of boundary conditions which form the basis of three separate DNS which are very briefly introduced at the end of this section. Details of the numerical methods employed in each of these DNS have been included in Appendix \\ref{sec:num_meth}.\n\n\\subsection{Modelling the Magnetic Field} \\label{sec:dipole}\n\nIn the discussion so far, we have evaded addressing the very important question of how one can compute the 2D forcing function ${\\bf f}$ such that equation (\\ref{eq:2dns_mod}) would then accurately describe the evolution of a Q2D flow realized in experiments. For a Kolmogorov flow, the forcing ${\\bf f}$ is sinusoidal, by definition. However, for Kolmogorov-like flows realized in electromagnetically driven shallow layers of electrolyte, ${\\bf f}$ needs to be computed by depth-averaging the 3D Lorentz force {\\bf F} arising from the interaction of the magnetic field ${\\bf B}$ with a current density ${\\bf J}$ \\citep{suri_2014}. The current density is easily calculated from geometrical considerations, but the magnetic field generated by the array of permanent magnets is quite complicated. For ${\\bf J} = J\\hat {\\bf y}$, as mentioned earlier in \\S \\ref{sec:exp_setup}, the Lorentz force density at any location $(x,y,z)$ within the electrolyte layer is given by ${\\bf F} = {\\bf J}\\times{\\bf B} =  JB_z\\hat{\\bf x}-JB_x\\hat{\\bf z}$. Here, $B_x$ and $B_z$ are the $x$- and $z$-components of the magnetic field, respectively, which vary along all three coordinates $x$, $y$, and $z$. Experimental measurements show that the typical value of $B_x$ is less than 3\\% of the value of $B_z$ at any given location within the electrolyte. \nHence, the Lorenz force density for all practical purposes can be approximated as ${\\bf F} \\approx JB_z\\hat{\\bf x}$.  Figure \\ref{fig:mag_prof} (a) shows experimental measurements of $B_z$ along the line $x = 0$ (black symbols), passing above the centre of the array at two different heights. Clearly, the magnetic field profile deviates significantly from that of a pure sinusoid, and furthermore, one cannot ignore the fringe fields near the ends of the array.\n\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=6in]{B_vs_y.pdf}}\\\\\n\\subfloat[]{\\includegraphics[width=5.3in]{B_vs_x_3D.pdf}}\n\\caption{\\label{fig:mag_prof} (a) Experimental measurements of the $z$-component of the magnetic field, $B_z$, as a function of $y$ at the longitudinal centre of the domain ($x=0$), and (b) experimental measurements of $B_z$ along the magnet centrelines at $y=\\pm\\{ 0.5, 1.5, 2.5, 3.5, 4.5, 5.5, 6.5\\} $.  Measurements are taken at a height just above the dielectric-electrolyte interface at $z=0.236$ and just below the electrolyte free surface at $z=0.472$. A least-squares fit has been performed using the data in (a) to determine the scaling factor for the dipole summation; the scaled dipole summation magnetic field is shown in red.  The experimental uncertainties are the size of the symbols or smaller.}\n\\end{figure}\n\nTo obtain a magnetic field profile that closely resembles the one in the experiment, one could measure the $z$-component of the magnetic field ($B_z$) across the entire flow domain at various heights above the magnet array. Using the measured field, one could then compute the depth-averaged forcing profile as described by \\citet{suri_2014}. However, since measuring $B_z$ on a 3D grid is an extremely tedious process, we circumvent the labour by numerically modelling the magnet array as described below.\n\nThe magnets in the array are arranged such that adjacent ones have magnetization pointing in opposite directions, along $\\pm \\hat{\\bf z}$. To obtain a magnetic field that closely resembles the one due to this array, we model each magnet as a 3D cubic lattice of identical dipoles, each with a moment $m \\hat{\\bf z}$. Changing the sign of $m$ across adjacent magnets accounts for the alternating direction of magnetization. The magnetic field at any location $(x,y,z)$ above the array is then approximated using the linear superposition of the field contribution from all of the dipoles modelling the array. Hence, we refer to this model as the ``dipole summation.\" Since the strength of the dipole $m$ cannot be measured experimentally, a single scaling parameter is calculated from a least-squares fit with the experimental measurements, taken at two heights. The rescaled dipole summation magnetic field is shown in figure \\ref{fig:mag_prof} (a) (red lines), along with the experimental measurements of $B_z$ (black symbols), corresponding to the line $x=0$ at heights $z = 0.265$ and $z = 0.438$. We stress that the rescaling factor for the dipole summation only serves as a convenience for comparing the magnetic field profiles and does not affect the Reynolds number at which the bifurcations occur, as the Reynolds number is based on the response velocity field.  Figure \\ref{fig:mag_prof} (b) shows the magnetic field comparison at $z = 0.438$ along the magnet centrelines. Note that the electrolyte layer in the experiment is bounded by the planes $z = 0.236$ and $z = 0.472$. Hence, we compute the magnetic field using the dipole summation at various heights, in steps of $0.0197$, in the region $0.236<z<0.472$ and depth-average them. This resulting depth-averaged magnetic field can then be used to compute the forcing profile ${\\bf f}$ which drives the flow in the 2D model.\n\n\\subsection{Boundary Conditions}\\label{sec:BCs}\n\nThe experimental Kolmogorov-like flow has solid walls along the lateral boundaries, resulting in a no-slip boundary condition.  However, for reasons of analytical and computational feasibility, Kolmogorov flow simulations have been studied almost exclusively in periodic 2D domains. In such domains, one can choose the longitudinal dimensions commensurate with the critical wavenumber $q_c^{exp}$. The neutral stability curves in figure \\ref{fig:nsc} would then dictate the Reynolds number at which the laminar flow goes unstable. However, this comparison ignores the role boundaries play in the stability of the laminar flow in the experiments. To address this key issue, we compare the experiment to numerical simulations realized on three types of domains, which are listed below.\n\n\\begin{itemize}\n\\item {Doubly-Periodic Domain:} This domain is chosen to coincide with the central $8\\times8$ window of the experimental domain, with its boundaries coinciding with $x = \\pm 4$ and $y = \\pm 4$. The simulated flow is constrained to be periodic in both the longitudinal and transverse directions, i.e. ${\\bf u}(x=-4,y) = {\\bf u}(x=4,y)$ and ${\\bf u}(x,y=-4) = {\\bf u}(x,y=4) $. It should be noted that the size of this domain along $x$ is approximately twice the critical longitudinal wavelength $q_c^{exp}$ of the secondary flow observed in the experiment. Along the transverse direction it spans a width equaling that of $8$ magnets. \n \n\\item {Singly-Periodic Domain:} This domain coincides with the region $-7 \\leq x \\leq 7$ and $-4 \\leq y \\leq 4$. The longitudinal dimensions are the same as that of the experiment while the transverse ones span a width equaling that of 8 magnets, like in the doubly-periodic domain. No-slip boundary conditions are imposed at the end walls, i.e. ${\\bf u}(x=\\pm 7,y) = 0$, while periodic boundary conditions are imposed along the transverse direction, i.e. ${\\bf u}(x,y=4) = {\\bf u}(x,y=-4)$. The motivation behind studying this domain is to test if both the critical Reynolds number and the longitudinal wavenumber of the secondary flow one observes in the experiment result solely from longitudinal confinement. We note that the effect of transverse confinement has been studied by \\citet{thess_1992a}, and therefore is not investigated here separately.\n \n\\item {Non-Periodic Domain:} This domain is identical to the experimental one in its lateral dimensions, i.e. $-7 \\leq x \\leq 7$ and $-9 \\leq y \\leq 9$, with no-slip boundary conditions imposed at both the end walls and side walls, i.e. ${\\bf u}(x=\\pm 7,y) = 0$ and ${\\bf u}(x,y=\\pm 9) = 0$. \n\\end{itemize}\n\n\\subsection{Direct Numerical Simulations}\\label{sec:dns}\n\nTo compare the experimental observations with those predicted by equation (\\ref{eq:2dns_mod}) with the three types of boundary conditions described above, we have performed direct numerical simulations. The flow over the doubly-periodic domain is simulated using a pseudo-spectral method in the vorticity-stream function formulation, as described in \\citet{mitchell_2013}.  This simulation is henceforth referred to as the ``doubly-periodic simulation,\" abbreviated DPS.  For the singly-periodic and the non-periodic domains, numerical simulations have been performed using a finite-difference scheme, described in \\citet{armfield_1999}. These simulations are hereafter referred to as the ``singly-periodic simulation\" (SPS) and the ``non-periodic simulation\" (NPS). The 2D forcing profiles ${\\bf f}$ for the DPS and SPS are constructed from the depth-averaged magnetic field presented in \\S \\ref{sec:dipole} by retaining the dominant periodic components along the direction of periodicity of the domain. Numerical details of all the simulations have been included in Appendix \\ref{sec:num_meth}.\n\n\\section{Comparison of Experiment and Numerics} \\label{sec:comparison}\n\nIn this section we present the results of our comparison between the experiment and the numerical simulations on the three domains described above. First, we discuss the features of the laminar flow, with a special emphasis on the effect of boundaries. Then we discuss the primary instability, which gives way to a secondary state characterized by the formation of time-independent vortices; features of this secondary state are presented. Finally, we discuss the transition of this steady vortex pattern into a time-periodic flow. \n\n\\subsection{Laminar Flow}\n\nFor low driving the flow mimics the forcing closely, resulting in spatially alternating bands of fluid flow along the $\\pm x$-directions, as can be see in figure \\ref{fig:lam_flow}. In this figure, black vectors correspond to the velocity field ${\\bf u}$ and the colour contour indicates the vorticity $\\omega$. For the experiment (figure \\ref{fig:lam_flow} (d)), the $y$-component of the velocity measured near the centre of the domain is close to zero. However, there are regions of strong recirculation near the end walls, characterized by a nonzero $y$-component of velocity. Additionally, a careful observation of the flow shows a slight tilt in the alignment of the flow bands. This tilt is due to the global circulation, in the counterclockwise direction, which results from the fluid flowing along opposite directions over the end magnets at $y = \\pm 6.5$. Figure \\ref{fig:lam_flow} (a) and (b) show the laminar flows from the DPS and SPS. It can be seen that neither of these display the tilt of the flow bands observed in the experiment since the periodic flows are devoid of any global circulation. The SPS, however, captures the turn around flow near the end walls, at least qualitatively. In contrast, one can see from figure \\ref{fig:lam_flow} (c) that flow field corresponding to the NPS looks practically indistinguishable from the experimental flow field.\n\n\\begin{figure}\n\\qquad\\subfloat[]{\\includegraphics[height=1.6in]{lam_flow_dps.pdf}}\\quad\\qquad\n\\subfloat[]{\\includegraphics[height=1.6in]{lam_flow_sps.pdf}}\\quad \\\\\n\\subfloat[]{\\includegraphics[width=2.5in]{lam_flow_nps.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.5in]{lam_flow_exp.pdf}}\\\\\n\\caption{\\label{fig:lam_flow} The laminar flow fields at $Re=8.1$ for the (a) DPS, (b) SPS, (c) NPS, and (d) experiment. The dashed lines in (d) indicate the locations of velocity profiles that are compared to the simulations in figure \\ref{fig:vel_prof}. The vorticity colourbar plotted for (a) also applies to (b-d).  The velocity vectors are downsampled in each direction by a factor of 8 for the simulations and 4 for the experiment.}\n\\end{figure}\n\nFor a quantitative description of the laminar flow profile, we have plotted the normalized longitudinal velocity for the experiment $u_x^{exp}/U$ along the line $x=0$ in figure \\ref{fig:vel_prof} (a). The location of this cross section is indicated by the vertical dashed line in figure \\ref{fig:lam_flow} (d). The normalized difference in $u_x$ between the experiment and the numerical simulations along this line is shown in figure \\ref{fig:vel_prof} (b). As can be seen, the DPS and SPS, which are only defined for $-4.0<y<4.0$, show systematic deviation from the experiment amounting to as high as 15\\% since they do not capture the tilt in the shear bands which results from global circulation. In comparison, the NPS agrees to within about 5\\% over the same region, with no clear systematic deviation. The disagreement between the experiment and NPS in this region, we believe, is a result of the dipole summation not accounting for the variation in the strength of each individual magnet. Closer to the boundaries, at $y \\approx 7$ and $y \\approx -6$, the largest difference between the NPS and the experiment is around 12\\%. The origin for this error is quite subtle and we shall defer its analysis to \\S\\ref{sec:sensitivity}.\n\n\\begin{figure}\n\\centering\n\\subfloat[]{\\qquad\\quad\\includegraphics[width=4.55in]{u_vs_y.pdf}} \\\\\n\\subfloat[]{\\includegraphics[width=4.95in]{u_vs_y_difference.pdf}}\\hfill  \\\\\n\\subfloat[]{\\qquad\\quad\\includegraphics[width=4.6in]{u_vs_x.pdf}}\\hfill \\\\\n\\subfloat[]{\\includegraphics[width=5in]{u_vs_x_difference.pdf}} \\hfill \n\\caption{\\label{fig:vel_prof} Velocity profiles and normalized differences at $Re=8.1$: (a) the normalized velocity, $u_x^{exp}/U$, as a function of $y$ at the longitudinal centre ($x=0$), (b) the normalized difference between the longitudinal velocities of the simulations and the experimental velocity profile, $(u_x^{sim}-u_x^{exp})/U$, as a function of $y$ at the longitudinal centre ($x=0$), (c) the normalized velocity, $u_x^{exp}/U$, as a function of  $x$ at the centreline of a middle magnet ($y=-0.5$), and (d) the normalized difference between the longitudinal velocities of the simulations and the experimental velocity profile, $(u_x^{sim}-u_x^{exp})/U$, as a function of $x$ at the centreline of a middle magnet ($y=-0.5$).  In (b) and (d), the DPS and SPS are plotted together, as they differ by less than 1\\%; in (d), the boundaries of the DPS are indicated by blue brackets. Note that the DPS and SPS are defined on a smaller domain, whereas the NPS and experiment extend all the way to the side walls at $y=\\pm 9$ and end walls at $x=\\pm7$.  Experimental uncertainties are the size of the symbols or smaller. }\n\\end{figure}\n\nThe normalized longitudinal velocity for the experiment $u_x^{exp}/U$ at $y=-0.5$ (along a central magnet centreline) is shown in figure \\ref{fig:vel_prof} (c). Upon careful observation, one can notice a slight asymmetry in the longitudinal velocity profile, which highlights the effect of the global circulation. In contrast, the DPS is perfectly uniform and thus does not capture this slight asymmetry, as can be seen from the plot of its difference with the experimental profile in figure \\ref{fig:vel_prof} (d) (brackets indicate the longitudinal extent of the DPS). The SPS, which is defined all the way to the end walls, also does not capture this asymmetry, as the flow in the SPS is also devoid of global circulation. However, it does capture the decay of the longitudinal velocity profile in the region $|x|\\gtrsim 5$, towards the end walls. The NPS is closest in agreement, as it displays the asymmetry observed in the experiment and captures the decay of the velocity near the end walls. \n\nIn summary, the presence of lateral boundaries in the experiment has a clear and systematic effect on the laminar flow profile, which is not captured by either the DPS or the SPS. However, the NPS succeeds in capturing these effects to a very good degree of accuracy.\n    \n\n\\subsection{Primary Instability}\n\nAs we increase the strength of the forcing, the laminar flow in the experiment becomes unstable at $Re_c^{exp} = 11.07$ and a new pattern of steady vortices appears. Since this flow is characterized by modulation of the flow bands along the longitudinal direction, we shall henceforth refer to it as the ``modulated state.\" Figure \\ref{fig:mod_state} (a-d) show the flow fields of the modulated state observed in the DPS, SPS, NPS, and experiment, respectively, at $Re = 14.1$. The counterclockwise global circulation in the experiment strongly affects the alignment of the vortices (see figure \\ref{fig:mod_state} (d)) which can be seen from comparing the modulated states for the DPS and SPS with the relevant regions of the experimental flow. However, one again, the flow fields from the NPS capture the features observed in the experimental flow remarkably well.\n\n\\begin{figure}\n\\qquad\\subfloat[]{\\includegraphics[height=1.6in]{mod_flow_dps.pdf}}\\quad\\qquad\n\\subfloat[]{\\includegraphics[height=1.6in]{mod_flow_sps.pdf}}\\quad \\\\\n\\subfloat[]{\\includegraphics[width=2.5in]{mod_flow_nps.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.5in]{mod_flow_exp.pdf}}\\\\\n\\caption{\\label{fig:mod_state} Flow fields at $Re=14.1$, midway through the modulated state regime, for the (a) DPS, (b) SPS, (c) NPS, and (d) experiment.  The vorticity colourbar plotted for (a) also applies to (b-d).  The velocity vectors are downsampled in each direction by a factor of 8 for the simulations and 4 for the experiment.}\n\\end{figure}\n\nAs mentioned in  \\S\\ref{sec:LSA}, the transition to the modulated state is characterized by the appearance of transverse velocity, $u_y\\ne 0$, in almost the entirety of the flow domain. As the driving is increased, the magnitude of this transverse velocity also increases. A bifurcation diagram characterizing the transition from the laminar to the modulated state is shown in figure \\ref{fig:bif1} (a).  The order parameter is the nondimensionalized mean square $y$-component of velocity, $\\langle u_y^2 \\rangle/U^2$, plotted as a function of $Re$.  These measurements are made over the central region $-4.0<x<4.0$ and $-4.0<y<4.0$ for all simulations and experiment.  In comparison to the experiment, the primary bifurcation in the DPS and SPS occur at much lower Reynolds numbers of $Re_c^{DPS}=9.39$ and $Re_c^{SPS}=9.64$. This result shows that imposing realistic longitudinal boundaries alone cannot capture the transition of the laminar state. In contrast, the transition in the NPS occurs at $Re_c^{NPS}$ = 10.73, a mere 3\\% underestimation of that observed in the experiment. This demonstrates that the inclusion of the correct boundary conditions, in addition to realistic modelling of the magnetic field, allows one to predict the primary instabilility to very good accuracy using equation (\\ref{eq:2dns_mod}). It is important to note that the NPS using equation (\\ref{eq:2dns_wf}) instead of equation (\\ref{eq:2dns_mod}) predicts the transition to occur at $Re_c=8.91$, which fails to predict the transition even after incorporating realistic boundaries and an accurate forcing profile.\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=2.52in]{first_bifurcation.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.4in]{wavelength.pdf}}\n\\caption{\\label{fig:bif1} (a) A bifurcation diagram showing the initial instability for the experiment and simulations.   This bifurcation occurs as the flow transitions from the laminar to the modulated state, which is characterized by the formation of time-independent vortices in a regular lattice. (b) The spatial average of the nondimensional wavelength in the $x$-direction, $\\bar{\\lambda}_x/L$, as a function of $Re$ for the modulated regime.  At each $Re$, measurements are made for $-4.0 \\le y \\le 4.0$ then averaged; the uncertainty bars indicate one standard deviation in the spatial measurements.}\n\\end{figure}\n\nAnother measure that facilitates a quantitative comparison between the experiment and the simulations is the average longitudinal wavelength $\\bar{\\lambda}_x$ associated with the vortex pattern in the modulated state regime. It is important to note that this wavelength is a spatially averaged quantity computed by measuring the separation between adjacent vortex centres and adjacent saddles in the centre region of the domain $-4.0<y<4.0$. At onset, just above the initial instability, the vortices in the experiment form a lattice with a fairly uniform separation between them, i.e. $\\bar{\\lambda}_{x,c}^{exp}/L = 3.97$. This critical wavelength $\\bar{\\lambda}_{x,c}^{exp}/L$ and the normalized wavenumber $q_c^{exp}$ introduced in the linear stability analysis in \\S\\ref{sec:LSA} are related by $\\bar{\\lambda}_{x,c}^{exp}/L = 2/q_c^{exp}$. As the forcing is increased the mean separation between the vortices increases, as can be seen from the plot of $\\bar{\\lambda}_x/L$ versus $Re$ shown in figure \\ref{fig:bif1} (b). Additionally, at higher forcing, the vortex lattice becomes spatially irregular, especially in the region $|y| \\gtrsim 3$, as can be seen in figure \\ref{fig:mod_state} (d). This spatial variation is quantified in the plot in figure \\ref{fig:bif1} (b) wherein the uncertainty bars indicate one standard deviation in the spatial variation of the separation between adjacent vortices and adjacent saddles. The large uncertainty bar on the lowest experimental measurement is due to a larger uncertainty in identifying the vortex centres and saddles when the flow is very weakly modulated. For comparison, figure \\ref{fig:bif1} (b) also shows the wavelength measured from the DPS and SPS. Neither of these are representative of what one observes in the experiment, showing practically no variation in wavelength across the domain as well as across Reynolds numbers. In contrast, the NPS captures both the spatial variation of the wavelength and the distortion of the lattice with increasing forcing quite accurately. However, for a given Reynolds number, the NPS overestimates the wavelength compared to what is observed in the experiment. The origin of this discrepancy is discussed in detail in \\S \\ref{sec:sensitivity}.\n\n\\subsection{Secondary Instability}\n\nAs we increase the forcing further, the modulated flow in the experiment undergoes a transition at $Re=17.3$ giving way to an oscillatory state with a period of 122 seconds at onset. With a quasistatic increase in the driving the amplitude of these oscillations grows, while the period remains approximately constant. The bifurcation diagram quantifying this transition is plotted in figure \\ref{fig:hopf} (a), which shows the nondimensionalized peak intensity $I/U^2$ of the temporal power spectrum spatially averaged over the region $-4.0<x<4.0$ and $-4.0<y<4.0$ as a function of $Re$. The associated power spectra are shown in figure \\ref{fig:hopf} (b). The NPS shows a very similar transition, with onset occurring at $Re=17.0$ with a period of 125 seconds. The range of $Re$ over which these periodic oscillations are observed is very narrow in both the experiment and the NPS. Note that the discrepancy between the simulation and experiment in the Reynolds number characterizing this bifurcation is a mere 2\\%.  A side-by-side comparison video showing the periodic orbits for the NPS and experiment is available in the supplementary materials online. The flow regimes explored by the DPS and the SPS are vastly different from what we observe in the experiment and NPS; hence quantitative comparison of the secondary instability is not provided here.\n\nAs we increase the driving further, the flow in both the experiment and the NPS increases in complexity, with the appearance multistability, i.e. the coexistence of stable and chaotic flows for the same Reynolds number depending on the initial conditions. Constructing a bifurcation diagram characterizing all such regimes is beyond the scope of this current study and is being probed separately.  \n\n\\begin{figure}\n\\subfloat[]{\n\\begin{minipage}[c][0.8\\width]{0.47\\textwidth}\n\\includegraphics[clip,width=2.5in]{hopf.pdf}\n\\end{minipage}}\\qquad\\subfloat[]{\\centering{}\n\\begin{minipage}[c][0.8\\width]{0.47\\textwidth}\n\\begin{center}\n\\includegraphics[clip,width=2.5in]{power_spectrum_exp.pdf}\\\\\n\\includegraphics[clip,width=2.6in]{power_spectrum_sim.pdf}\n\\par\\end{center}\n\\end{minipage}}\n\\caption{\\label{fig:hopf} (a) A bifurcation diagram showing the nondimensionalized power spectrum intensity, $I/U^2$, as a function of $Re$.  The temporal power spectrum is averaged over the region $-4.0<x<4.0$ and $-4.0<y<4.0$ before calculating the intensity $I$. This supercritical Hopf bifurcation, which occurs at $Re=17.3$ in the experiment and $Re=17.0$ in the NPS, corresponds to the flow transitioning from the modulated state to a periodic orbit. (b) The nondimensional temporal power spectrum, $P/U$, as a function of the frequency, $f$, for the experiment (top) and NPS (bottom) as the current is quasistatically increased through the periodic orbit regime.}\n\\end{figure}\n\n\n\\section{Modelling Limitations} \\label{sec:limitations}\n\nAll the results presented so far have indicated that the NPS captures the features of the experimental flow quite accurately, predicting the primary and secondary instabilities to within about 3\\%. However, one needs to be aware that the 2D equation (\\ref{eq:2dns_mod}) is a reduced model describing an inherently 3D experiment. For instance, the forcing function ${\\bf f}(x,y)$ computed by depth-averaging the 3D magnetic field $B_z(x,y,z)$ is devoid of information regarding how the magnetic field varies along $z$. The actual Q2D flow in the experiment, instead, is in response to such a 3D forcing. Furthermore, the dipole summation modelling the magnet array does not account for any possible inhomogeneities in each magnet or variation in strength across different magnets. Experimental measurements of $B_z$ at a fixed height along the cross section $x = 0$ (figure \\ref{fig:mag_prof} (a)) show that the dipole summation magnetic field deviates from the experiment by at most 5\\% in certain places. Hence, it is crucial to explore the role of these deficiencies of the numerical model. We restrict our quantitative analysis to studying the effect on the primary bifurcation.\n\n\\subsection{Non-Idealized Forcing Profiles} \\label{sec:sensitivity}\n\nAs described earlier in \\S\\ref{sec:dipole}, the dipole summation model assumes that the strength of the dipoles across magnets, as well as within each magnet, is uniform. In an effort to quantify the effects of inhomogeneous magnetization in experiments, we separate the study of variations in dipole strength across different magnets from those within a given magnet. For purposes of notational convenience, $B$ will refer to the $z$-component of the 3D dipole summation and $B_{DA}$ will refer to the $z$-component of the 2D dipole summation which has been calculated by depth-averaging over the region $0.236<z<0.472$ (the location of the electrolyte layer); $\\widetilde{B}_{DA}$ will refer to forms of the dipole summation which have been perturbed then depth-averaged. This notation is used throughout \\S\\ref{sec:sensitivity} and \\S\\ref{sec:inherent_3d}.\n\nThe first type of imperfection we explore is the variation in the strength of magnetization across different magnets, with each magnet still being uniformly magnetized. Three different forms of perturbations are studied: (i) perturbations both increasing and decreasing the dipole strength for the central 6 magnets of the magnet array, (ii) perturbations which increase the dipole strength of each of the end magnets, and (3) perturbations which decrease the dipole strength of each of the end magnets. The depth-averaged magnetic field $\\widetilde{B}_{DA}$ is then recalculated for this perturbed configuration. The normalized depth-averaged magnetic field residuals along the cross section $x=0$ (compared to the unperturbed dipole summation $B_{DA}$) are presented in figure \\ref{fig:bif_perturbation} (a). Using the perturbed depth-averaged magnetic field profile we have recomputed the laminar and modulated states and the resulting bifurcation diagram is shown in figure \\ref{fig:bif_perturbation} (b).\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=2.95in]{B_perturbations.pdf}} \\quad\n\\subfloat[]{\\includegraphics[width=2.2in]{first_bif_w_perturbations.pdf}}\n\\caption{\\label{fig:bif_perturbation} (a) A plot showing the difference between the perturbed dipole summation magnetic fields, $\\widetilde{B}_{DA}$, and the unperturbed dipole summation magnetic field, $B_{DA}$, normalized by the spatial rms depth-averaged magnetic field $\\sqrt{\\langle B_{DA} \\rangle}$.  Magnetic fields perturbed in three different ways are plotted: asymmetric perturbations near the middle (red dashed line), positive perturbations at the ends (green dot-dashed line), and negative perturbations at the ends (blue dotted line). Note that the sign of the magnetic field for each individual magnet is indicated at the top of the plot. (b) A bifurcation diagram showing the initial instability for the NPS, with various perturbations added to the dipole summation.  The first bifurcation is much more sensitive to perturbations to the magnetic field of the end magnets than the middle magnets, even though the bifurcation parameter is only measured in the middle region.}\n\\end{figure}\n\nClearly, the first bifurcation is much more affected by perturbations to each of the end magnets than perturbations to magnets near the centre of the domain.  Additionally, recall that both the bifurcation order parameter $\\langle u_y^2 \\rangle / U^2$ and the Reynolds number $Re=UL/\\nu$ are calculated over the central region of the domain: $-4.0<x<4.0$ and $-4.0<y<4.0$.  This makes the results especially surprising -- that perturbing the strength of the end magnets affects the flow at the centre more strongly than perturbing the central magnets does. This result suggests the important role that global circulation plays in determining the dynamics of the system.\n\nThe second set of perturbations we explore are those which correspond to variations in the dipole strength along the length of each individual magnet.  However, rather than varying the strength of the dipoles along their length within each magnet, we create a ``hybrid\" profile that combines the magnetic field from the idealized depth-averaged dipole summation $B_{DA}$ with experimental measurements shown in figure \\ref{fig:mag_prof} (b). This 2D hybrid field is generated from combining (i) the transverse profile at $x=0$ of the idealized depth-averaged dipole summation $B_{DA}$, and (ii) the longitudinal measurements taken along the centreline of each magnet (black markers in figure \\ref{fig:mag_prof} (b)), normalized to unity using the average value over a small central region near $x=0$. The normalization ensures that the 2D hybrid profile has the same transverse cross section at $x=0$ as the idealized dipole summation while replicating the fluctuations in the magnetic field corresponding to those measured experimentally along the longitudinal direction.  The resulting bifurcation diagram is not included, as the bifurcation curve is virtually indistinguishable from the unperturbed case.  This analysis effectively demonstrates the insensitivity of the first bifurcation to longitudinal perturbations.\n\nThe robustness of the flow to noise in the magnetic field explains why, despite using an idealized dipole summation, the laminar to modulated transition in the NPS differs by only 3\\% compared to that in the experiment. Hence, it is natural to ask if one could achieve ``perfect agreement'' between the 2D model and the Q2D experiment by replacing the dipole summation with a depth-averaged profile computed entirely using experimental measurements of the magnetic field over a 3D grid located within the electrolyte. The answer to this question is complicated as can be seen from the following discussion. The dipole summation and the experimental magnetic fields over the end magnets, for instance, differ by less than 5\\%. However, the velocity fields differ by as much as 12\\% in the same location. More importantly, this difference is systematic, i.e. over both the end magnets the simulation predicts a higher velocity magnitude compared to what is measured in the experiment (figure \\ref{fig:vel_prof} (b)). We also observe that the experimental average wavelength is systematically less than that of the NPS for the modulated regime (figure \\ref{fig:bif1} (b)). Our analysis indicates that these discrepancies are too large to be attributed solely to deviations from the uniform dipole summation, suggesting an alternative source of error. This we trace to the inherent three-dimensionality of the experiment.\n\n\\subsection{Inherent Three-Dimensionality of the Experiment} \\label{sec:inherent_3d}\n\nAs has been discussed in \\S \\ref{sec:dipole}, the Lorentz force density due to the specific arrangement of magnets employed in the experiment is, to a very good approximation, given by ${\\bf F} = JB_z(x,y,z)\\hat{\\bf x}$, where $J$ is the magnitude of current density through the electrolyte and $B_z$ is the $z$-component of the magnetic field at any given location $(x,y,z)$ within the electrolyte. In deriving equation (\\ref{eq:2dns_mod}) it was assumed \\citep{suri_2014} that $B_z$ can be decomposed as the product of a 2D profile ${B}_{z}^0(x,y)$, which depends exclusively on the extended coordinates $(x,y)$, and a decay function $D(z)$, which captures the decay of the magnetic field above the magnet array, i.e.  ${B}_z(x,y,z) = D(z) B_z^0(x,y)$. This implies that, when normalized, the planar magnetic field profiles at various heights $z$ within the electrolyte are identical. This assumption is necessary for a similar decomposition of the plane-parallel Q2D velocity field ${\\bf V}(x,y,z)$ as a product of a vertical profile $P(z)$ and a strictly 2D velocity field ${\\bf u}(x,y)$, i.e. ${\\bf V}(x,y,z) = P(z){\\bf u}(x,y)$.  Such a decomposition facilitates depth-averaging of the 3D Navier-Stokes equations resulting in the strictly 2D model given by equation (\\ref{eq:2dns_mod}). The decomposability of the magnetic field, however, cannot be exactly satisfied when one has a magnet array with finite dimensions. For instance, in figure \\ref{fig:mag_prof} (a), if one imagines rescaling the transverse magnetic profile at $z=0.265$ to match that at $z=0.438$, the profiles would \\emph{not} match over the end magnets. This is apparent by comparing, for example, the peaks at $y=-6.5$ and $y=-4.5$ at each height. The planar profiles of the magnetic field obtained from the idealized dipole summation at $z = 0.236$ (dielectric-electrolyte interface) and $z = 0.472$ (free surface), normalized by the respective rms values of the magnetic fields in the central $8 \\times 8$ region, differ by about 12\\%. This measure, obtained from the idealized dipole summation, provides a lower bound on how much the experimental fields can differ. Hence, the velocity field in the experiment is a response to an inherently 3D forcing.  As a consequence, the NPS with the depth-averaged forcing which is based on the 2D equation (\\ref{eq:2dns_mod}) fails to capture the experimental flow to some degree.\n\nTo study this possible source of discrepancy, we have recomputed the first bifurcation using planar magnetic field profiles exclusively from each height $z = 0.236$ and $z = 0.472$, which correspond to the dielectric-electrolyte interface and the free surface. We find that the resulting plots of the first bifurcation, as well as that of the wavelength of the modulated states (not included in this article), lie on either side of the experimental measurements. This result suggests that the primary reason behind the systematic difference between the NPS and the experiment is a result of deviations from quasi-two-dimensionality. This nondecomposability is the largest over the end magnets and explains why the NPS shows a systematic deviation from the experimental velocity field.\n\n\n\\section{Conclusion} \\label{sec:conclusion}\n\nIn this article, we have investigated the primary and secondary bifurcations of a Kolmogorov-like flow.  This Q2D flow, obtained in the laboratory by electromagnetically driving a stratified layer of electrolyte above an immiscible layer of dielectric, is an appealing system to study because the experimental flow can be described to a very good approximation by a strictly 2D model. Many previous works have used a semi-empirical form of the 2D Navier-Stokes equation with Rayleigh friction, which ignored the effects of the inherent three-dimensionality of the flow. Additionally, virtually all previous studies have employed doubly-periodic boundary conditions, which are non-physical, and assumed a perfectly sinusoidal forcing profile, which is difficult to realize in the laboratory.  \n\nWe have demonstrated that close, quantitative agreement between experiment and numerics is only found when one utilizes equation (\\ref{eq:2dns_mod}) with no-slip boundary conditions imposed at all lateral boundaries. To model the forcing, we numerically computed a 3D approximation to the body forcing, which was then depth-averaged to generate a 2D forcing profile. \nThis simulation results in an exceptional 3\\% discrepancy in $Re_c$ for the primary instability and a 2\\% discrepancy for the secondary instability, with a very similar oscillation period at onset. A detailed sensitivity analysis shows that the systematic deviations between the simulation and experiment are a result of the inherent three-dimensionality of the flow, which indicate a possible limitation of the 2D model.\n\nOn the experimental front, several improvements could be made in future studies. For instance, we have observed that for larger heights above the magnet array, the magnetic field profile is closer to decomposable; hence, a thicker glass plate between the magnets and fluids may improve the agreement. The tradeoff, however, is that the magnetic field ($B_z$) becomes substantially weaker, requiring larger currents ($J$) to attain the same strength of forcing.  This results in larger Joule heating, which may be problematic for carefully maintaining the Reynolds number, as heating affects the viscosity.  Since the non-decomposability of the forcing profile is largest over the end magnets, it may be beneficial to bring the side walls in closer or extend the magnet array so that the end magnets are no longer driving the flow. Use of magnets with much stricter tolerances in the uniformity of the magnetization may also lead to improvements.\n\nMany open questions remain regarding experimental realizations of Kolmogorov flow.  The effect of varying the parameters or the number of forcing periods with realistic no-slip boundary conditions imposed has not been addressed. The effect of how sensitive the flow is to the exact location of the boundaries has not been rigorously studied either. Quantitative comparisons of the transition to turbulence in the experiment and numerics are lacking as well.  Of course, an ECS-based description of turbulence is only in its infancy at the current time, and the existence of such unstable solutions in a Q2D flow is yet to be demonstrated in the literature.  We believe we have laid a solid foundation for future studies of Kolmogorov-like flow at higher Reynolds numbers, into the weakly turbulent regime.\n\nWe thank Daniel Borrero for his useful suggestions and insights, both experimentally and theoretically. J.T. is grateful to Samuel Raben for his assistance in using the PRANA PIV software package. This work is supported in part by the National Science Foundation under Grant Nos.\nCMMI-1234436 and DMS-1125302.\n\n\\appendix\n\n\\section{Nondimensional Form of Governing Equations} \\label{sec:nondim}\n\nEquation (\\ref{eq:2dns_mod}) has been presented in the dimensional form in this article in part to facilitate a direct comparison between the experimental measurements and the numerical simulations. However, nondimensional versions (with $\\beta = 1$) have formed the basis of several previous analytical and computational studies. Hence, it is useful to detail the nondimensionalization of equation (\\ref{eq:2dns_mod}) to facilitate comparison with previous studies.\n\nMost previous studies of Kolmogorov flow have employed a strictly sinusoidal forcing of form ${\\bf f} = \\chi \\sin(\\kappa y) \\hat{\\bf x}$. Since the magnetic field $B_z(x,y,z)$, and hence its depth-average $B_{DA}$, are close to being sinusoidal at the centre of the magnet array, a natural choice is to define an amplitude-profile form of the depth-averaged magnetic field such that $B_{DA} = B_0{\\widehat{B}_{DA}}$. Here ${\\widehat{B}_{DA}} \\approx \\sin(\\kappa y)$ at the centre of the array with ${\\widehat{B}_{DA}}(0,w/2) = 1$ and $B_0 = B_{DA}(0,w/2)$, where $w$ is the width of a magnet in the experiment. The depth-averaged forcing is then given by ${\\bf f} = JB_0{\\bf \\hat{f}}$, where ${\\bf{\\hat f}} = {\\widehat{B}_{DA}}\\bf{\\hat x}$.\n\nChoosing the width $w$ of a magnet as the characteristic length scale $L_s$ of the flow and a velocity scale $U_s = \\sqrt{JB_0w/\\rho}$ based on the strength of the forcing, we can rewrite equations (\\ref{eq:2dns_mod}) in terms of nondimensional variables ${\\bf u}$ and $p$ as\n \n", "itemtype": "equation", "pos": 24815, "prevtext": "\nwhere $L=1.27$ cm is the width of one magnet and $U=\\sqrt{\\langle u_x^2+u_y^2 \\rangle}$ is the measured root-mean-square (rms) velocity, where $\\langle \\cdot \\rangle$ denotes spatial averaging over a central subregion that is the same dimensions as the doubly-periodic simulation (10.16 cm $\\times$ 10.16 cm) which is discussed below.  Note that from this point on, unless specified, lengths will be nondimensionalized by the characteristic length scale $L=1.27$ cm. We will now shift our attention to theoretical predictions for the initial instability of Kolmogorov-like flow by performing the linear stability analysis.\n\n\\section{Linear Stability Analysis}\\label{sec:LSA}\n\nAs mentioned in the introduction, one of the primary goals of this article is to show that equation (\\ref{eq:2dns_mod}) provides a more accurate description of a Q2D flow compared to equation (\\ref{eq:2dns_wf}).  The \\textit{proof-by-example} we present below is far from being rigorous, but is sufficient to highlight the error one incurs using equation (\\ref{eq:2dns_wf}) in place of equation (\\ref{eq:2dns_mod}) when comparing with experiments. Here, we consider a Kolmogorov-like flow on an unbounded domain with forcing that is strictly sinusoidal. It can easily be seen that when the driving is low the flow mimics the sinusoidal profile of the forcing for all the three governing equations (\\ref{eq:2dns})-(\\ref{eq:2dns_mod}), i.e. ${\\bf u} \\approx \\sin(\\kappa y)\\hat{\\bf x}$. As the strength of the forcing increases, this laminar flow is known to become unstable to longitudinal perturbations, bifurcating into a flow with time-independent vortices. This vortex pattern has the same periodicity $\\kappa$ as the laminar flow along the $y$-direction. Several previous studies have analysed this transition theoretically \\citep{meshalkin_1961, iudovich_1965, kliatskin_1972, nepomniashchii_1976}. Experiments across different setups have also confirmed this transition \\citep{bondarenko_1979, obukhov_1983, batchaev_1983} and have characterized it using the critical Reynolds number ($Re_c^{exp}$) and longitudinal wavenumber ($k_c^{exp}$) of the vortex pattern at onset of the secondary state. Linear stability analysis of the laminar flow on the unbounded domain shows that for longitudinal perturbations with wavelength $k_x = q\\kappa$ the Reynolds number at which the laminar flow goes unstable is approximately given by\n\n", "index": 9, "text": "\\begin{equation}\\label{eq:Re_0}\nRe_0(q) = \\frac{\\pi}{\\beta}\\frac{1}{q}\\sqrt{\\frac{(1+q^2)}{(1-q^2)}\\left(q^2+\\frac{\\alpha}{\\nu\\kappa^2}\\right)\\left(1+q^2+\\frac{\\alpha}{\\nu\\kappa^2}\\right)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"Re_{0}(q)=\\frac{\\pi}{\\beta}\\frac{1}{q}\\sqrt{\\frac{(1+q^{2})}{(1-q^{2})}\\left(q%&#10;^{2}+\\frac{\\alpha}{\\nu\\kappa^{2}}\\right)\\left(1+q^{2}+\\frac{\\alpha}{\\nu\\kappa^%&#10;{2}}\\right)}.\" display=\"block\"><mrow><mrow><mrow><mi>R</mi><mo>⁢</mo><msub><mi>e</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mi>π</mi><mi>β</mi></mfrac><mo>⁢</mo><mfrac><mn>1</mn><mi>q</mi></mfrac><mo>⁢</mo><msqrt><mrow><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msup><mi>q</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msup><mi>q</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>q</mi><mn>2</mn></msup><mo>+</mo><mfrac><mi>α</mi><mrow><mi>ν</mi><mo>⁢</mo><msup><mi>κ</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><msup><mi>q</mi><mn>2</mn></msup><mo>+</mo><mfrac><mi>α</mi><mrow><mi>ν</mi><mo>⁢</mo><msup><mi>κ</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhere we used $T_s = L_s/U_s$ to nondimensionalize time. The Reynolds number $Re = U_sL_s/\\nu$ can then be expressed in terms of the strength of the forcing as $Re = \\sqrt{JB_0w^3/\\rho\\nu^2}$. The other nondimensional parameter $\\gamma = \\alpha w^2/\\nu$ captures the relative strength of viscous and frictional terms in equation (\\ref{eq:2dns_mod}). For $\\gamma = 0$ and $\\beta = 1$, we recover the familiar nondimensional form of the 2D Navier-Stokes equation.\n\n\\section{Numerical Methods} \\label{sec:num_meth}\n\nIn this Appendix, we present the details of discretization methods and numerical integration schemes employed in the NPS, SPS, and DPS.\n\n\n\\subsection{Non-Periodic Simulation (NPS) and Singly-Periodic Simulation (SPS)} \\label{sec:app_nps_sps}\n\nSince the NPS, as well as the SPS, require prescribing Dirichlet no-slip boundary conditions on the velocity field ${\\bf u}$, numerical simulations are performed using the primitive variable ($u_x$, $v_x$, and $p$) formulation by employing a semi-implicit fractional-step method detailed in \\cite{armfield_1999}. To begin with, equation (\\ref{eq:2dns_mod}) is discretized in time to obtain the following difference equation:\n\n", "itemtype": "equation", "pos": 71601, "prevtext": "\nThis expression was computed by linearizing equation (\\ref{eq:2dns_mod}) around the laminar state and calculating the stability with respect to perturbations containing only 3 modes, all with the same longitudinal wavenumber $k_x$, i.e. $(k_x,-\\kappa)$, $(k_x,0)$, and $(k_x,\\kappa)$. Since equations (\\ref{eq:2dns}) and (\\ref{eq:2dns_wf}) are special cases of equation (\\ref{eq:2dns_mod}) one can compute the stability of the laminar flow for any of the three equations using (\\ref{eq:Re_0}). Hence, it is of interest to study (i) how the critical Reynolds number $\\displaystyle Re_c = \\min_{\\forall q}\\{Re_0(q)\\}$ and the corresponding critical wavenumber ($k_c = q_c\\kappa$) of the transition in flows governed by each of the three equations compare with those observed in experiments, and (ii) what the Reynolds number ($Re_0(q_{c}^{exp})$) predicted by equation (\\ref{eq:Re_0}) is for each of the three governing equations, using the critical wavenumber ($k_c^{exp} = \\kappa q_{c}^{exp}$) observed in the (bounded) experiment. In the following paragraphs we answer these questions. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=3in]{nsc.pdf}\n\\caption{\\label{fig:nsc}Neutral stability curves from equation (\\ref{eq:Re_0}) showing the Reynolds number $Re_0$ at which the laminar flow goes unstable when subjected to a longitudinal perturbation of normalized wavenumber $q=k_x/\\kappa$. The parameters are $\\alpha=0.000$ s$^{-1}$ and $\\beta=1.00$ (black solid line), $\\alpha=0.064$ s$^{-1}$ and $\\beta=1.00$ (red dashed line), and $\\alpha=0.064$ s$^{-1}$ and $\\beta=0.83$ (blue dot-dashed line) which correspond to equations (\\ref{eq:2dns}), (\\ref{eq:2dns_wf}), and (\\ref{eq:2dns_mod}), respectively.  The black circle shows the corresponding measurement from the experiment.  In all cases, $\\nu=3.26 \\times 10^{-6}$ m$^2$/s and $\\kappa = 247.36$ m$^{-1}$ are held constant. }\n\\end{figure}\n\n\nFor $\\beta = 1$ and $\\alpha = 0$, which corresponds to the 2D Navier-Stokes equation (\\ref{eq:2dns}), one can see that the laminar flow is most unstable to long wavelength perturbations ($q_c = 0$), with the critical Reynolds number $Re_c = \\pi$. Figure \\ref{fig:nsc} shows a plot of $Re_0$ as a function of $q$ for $\\nu=3.26 \\times 10^{-6}$ m$^2$/s and $\\kappa = 247.36$ m$^{-1}$. Indicated on the same plot is $Re_c^{exp} = 11.07$ at $q_c^{exp} = 0.504$, corresponding to the instability we observe in the experiment described in \\S\\ref{sec:exp_setup}. For $q= q_c^{exp}$, the value predicted by equation (\\ref{eq:2dns}) is $Re_0(q=q_c^{exp}) =4.56$. Hence, as has been reported in earlier studies, equation (\\ref{eq:2dns}) fails to provide a quantitative description of the Q2D flow in the experiment.\n\nThis brings into focus the prediction from equation (\\ref{eq:2dns_wf}), which corresponds to $\\beta = 1$ and $\\alpha = 0.064$ s$^{-1}$, the latter value resulting from the analytical computations reported by  \\citet{satijn_2001} and \\citet{suri_2014}. All previous studies have used this equation to compare the onset of the primary instability in experiment and theory, albeit using free parameters. From the neutral stability curve plotted in figure \\ref{fig:nsc} it can be seen that the flow governed by this equation is most unstable to a perturbation with wavenumber $q_c = 0.465$, with a critical Reynolds number $Re_c = 7.60$. This finite wavenumber instability is in qualitative agreement with what one observes in experiments and is a significant improvement over that predicted using equation (\\ref{eq:2dns}). However, for $q = q_c^{exp}$, the instability predicted using equation (\\ref{eq:2dns_wf}) occurs at $Re_0(q = q_c^{exp}) =7.69$, which is still a significant underestimation of what one observes in the experiment. \n\nIn comparison, the neutral stability curve corresponding to equation (\\ref{eq:2dns_mod}) is scaled by a factor $1/\\beta$, as can be seen in equation (\\ref{eq:Re_0}). For $\\beta = 0.83$ the Reynolds number corresponding to the primary instability increases to $Re_0(q=q_c^{exp}) = 9.26$, an improvement of 14\\% over that predicted using equation (\\ref{eq:2dns_wf}). This increase in the stability of the laminar flow is due to the gradient in the magnitude of velocity along the layer depth, which results in a suppression of the effective nonlinearity of the flow; in contrast, equation (\\ref{eq:2dns_wf}) does not account for this suppression of the nonlinearity. This linear stability analysis serves as a demonstration of the importance of estimating the value of $\\beta$ correctly to achieve an accurate description of the Q2D flow. Hence, we use equation (\\ref{eq:2dns_mod}) for all numerical analysis presented in this article.\n\n\\section{Numerical Modelling} \\label{sec:model}\n\nIt is crucial to note that in the linear stability analysis presented above, we have assumed that the forcing is strictly sinusoidal and that the flow has an infinite lateral extent. This, however, is never the case with experiments, where one has to account for both the complicated magnetic field profile due to a finite-sized magnet array, as well as the role of boundaries to accurately predict transitions across various flow regimes.  In this section we present a numerical model for approximating the magnetic field due to the array of permanent magnets in the experiment (discussed in \\S \\ref{sec:exp_setup}). We then present three types of boundary conditions which form the basis of three separate DNS which are very briefly introduced at the end of this section. Details of the numerical methods employed in each of these DNS have been included in Appendix \\ref{sec:num_meth}.\n\n\\subsection{Modelling the Magnetic Field} \\label{sec:dipole}\n\nIn the discussion so far, we have evaded addressing the very important question of how one can compute the 2D forcing function ${\\bf f}$ such that equation (\\ref{eq:2dns_mod}) would then accurately describe the evolution of a Q2D flow realized in experiments. For a Kolmogorov flow, the forcing ${\\bf f}$ is sinusoidal, by definition. However, for Kolmogorov-like flows realized in electromagnetically driven shallow layers of electrolyte, ${\\bf f}$ needs to be computed by depth-averaging the 3D Lorentz force {\\bf F} arising from the interaction of the magnetic field ${\\bf B}$ with a current density ${\\bf J}$ \\citep{suri_2014}. The current density is easily calculated from geometrical considerations, but the magnetic field generated by the array of permanent magnets is quite complicated. For ${\\bf J} = J\\hat {\\bf y}$, as mentioned earlier in \\S \\ref{sec:exp_setup}, the Lorentz force density at any location $(x,y,z)$ within the electrolyte layer is given by ${\\bf F} = {\\bf J}\\times{\\bf B} =  JB_z\\hat{\\bf x}-JB_x\\hat{\\bf z}$. Here, $B_x$ and $B_z$ are the $x$- and $z$-components of the magnetic field, respectively, which vary along all three coordinates $x$, $y$, and $z$. Experimental measurements show that the typical value of $B_x$ is less than 3\\% of the value of $B_z$ at any given location within the electrolyte. \nHence, the Lorenz force density for all practical purposes can be approximated as ${\\bf F} \\approx JB_z\\hat{\\bf x}$.  Figure \\ref{fig:mag_prof} (a) shows experimental measurements of $B_z$ along the line $x = 0$ (black symbols), passing above the centre of the array at two different heights. Clearly, the magnetic field profile deviates significantly from that of a pure sinusoid, and furthermore, one cannot ignore the fringe fields near the ends of the array.\n\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=6in]{B_vs_y.pdf}}\\\\\n\\subfloat[]{\\includegraphics[width=5.3in]{B_vs_x_3D.pdf}}\n\\caption{\\label{fig:mag_prof} (a) Experimental measurements of the $z$-component of the magnetic field, $B_z$, as a function of $y$ at the longitudinal centre of the domain ($x=0$), and (b) experimental measurements of $B_z$ along the magnet centrelines at $y=\\pm\\{ 0.5, 1.5, 2.5, 3.5, 4.5, 5.5, 6.5\\} $.  Measurements are taken at a height just above the dielectric-electrolyte interface at $z=0.236$ and just below the electrolyte free surface at $z=0.472$. A least-squares fit has been performed using the data in (a) to determine the scaling factor for the dipole summation; the scaled dipole summation magnetic field is shown in red.  The experimental uncertainties are the size of the symbols or smaller.}\n\\end{figure}\n\nTo obtain a magnetic field profile that closely resembles the one in the experiment, one could measure the $z$-component of the magnetic field ($B_z$) across the entire flow domain at various heights above the magnet array. Using the measured field, one could then compute the depth-averaged forcing profile as described by \\citet{suri_2014}. However, since measuring $B_z$ on a 3D grid is an extremely tedious process, we circumvent the labour by numerically modelling the magnet array as described below.\n\nThe magnets in the array are arranged such that adjacent ones have magnetization pointing in opposite directions, along $\\pm \\hat{\\bf z}$. To obtain a magnetic field that closely resembles the one due to this array, we model each magnet as a 3D cubic lattice of identical dipoles, each with a moment $m \\hat{\\bf z}$. Changing the sign of $m$ across adjacent magnets accounts for the alternating direction of magnetization. The magnetic field at any location $(x,y,z)$ above the array is then approximated using the linear superposition of the field contribution from all of the dipoles modelling the array. Hence, we refer to this model as the ``dipole summation.\" Since the strength of the dipole $m$ cannot be measured experimentally, a single scaling parameter is calculated from a least-squares fit with the experimental measurements, taken at two heights. The rescaled dipole summation magnetic field is shown in figure \\ref{fig:mag_prof} (a) (red lines), along with the experimental measurements of $B_z$ (black symbols), corresponding to the line $x=0$ at heights $z = 0.265$ and $z = 0.438$. We stress that the rescaling factor for the dipole summation only serves as a convenience for comparing the magnetic field profiles and does not affect the Reynolds number at which the bifurcations occur, as the Reynolds number is based on the response velocity field.  Figure \\ref{fig:mag_prof} (b) shows the magnetic field comparison at $z = 0.438$ along the magnet centrelines. Note that the electrolyte layer in the experiment is bounded by the planes $z = 0.236$ and $z = 0.472$. Hence, we compute the magnetic field using the dipole summation at various heights, in steps of $0.0197$, in the region $0.236<z<0.472$ and depth-average them. This resulting depth-averaged magnetic field can then be used to compute the forcing profile ${\\bf f}$ which drives the flow in the 2D model.\n\n\\subsection{Boundary Conditions}\\label{sec:BCs}\n\nThe experimental Kolmogorov-like flow has solid walls along the lateral boundaries, resulting in a no-slip boundary condition.  However, for reasons of analytical and computational feasibility, Kolmogorov flow simulations have been studied almost exclusively in periodic 2D domains. In such domains, one can choose the longitudinal dimensions commensurate with the critical wavenumber $q_c^{exp}$. The neutral stability curves in figure \\ref{fig:nsc} would then dictate the Reynolds number at which the laminar flow goes unstable. However, this comparison ignores the role boundaries play in the stability of the laminar flow in the experiments. To address this key issue, we compare the experiment to numerical simulations realized on three types of domains, which are listed below.\n\n\\begin{itemize}\n\\item {Doubly-Periodic Domain:} This domain is chosen to coincide with the central $8\\times8$ window of the experimental domain, with its boundaries coinciding with $x = \\pm 4$ and $y = \\pm 4$. The simulated flow is constrained to be periodic in both the longitudinal and transverse directions, i.e. ${\\bf u}(x=-4,y) = {\\bf u}(x=4,y)$ and ${\\bf u}(x,y=-4) = {\\bf u}(x,y=4) $. It should be noted that the size of this domain along $x$ is approximately twice the critical longitudinal wavelength $q_c^{exp}$ of the secondary flow observed in the experiment. Along the transverse direction it spans a width equaling that of $8$ magnets. \n \n\\item {Singly-Periodic Domain:} This domain coincides with the region $-7 \\leq x \\leq 7$ and $-4 \\leq y \\leq 4$. The longitudinal dimensions are the same as that of the experiment while the transverse ones span a width equaling that of 8 magnets, like in the doubly-periodic domain. No-slip boundary conditions are imposed at the end walls, i.e. ${\\bf u}(x=\\pm 7,y) = 0$, while periodic boundary conditions are imposed along the transverse direction, i.e. ${\\bf u}(x,y=4) = {\\bf u}(x,y=-4)$. The motivation behind studying this domain is to test if both the critical Reynolds number and the longitudinal wavenumber of the secondary flow one observes in the experiment result solely from longitudinal confinement. We note that the effect of transverse confinement has been studied by \\citet{thess_1992a}, and therefore is not investigated here separately.\n \n\\item {Non-Periodic Domain:} This domain is identical to the experimental one in its lateral dimensions, i.e. $-7 \\leq x \\leq 7$ and $-9 \\leq y \\leq 9$, with no-slip boundary conditions imposed at both the end walls and side walls, i.e. ${\\bf u}(x=\\pm 7,y) = 0$ and ${\\bf u}(x,y=\\pm 9) = 0$. \n\\end{itemize}\n\n\\subsection{Direct Numerical Simulations}\\label{sec:dns}\n\nTo compare the experimental observations with those predicted by equation (\\ref{eq:2dns_mod}) with the three types of boundary conditions described above, we have performed direct numerical simulations. The flow over the doubly-periodic domain is simulated using a pseudo-spectral method in the vorticity-stream function formulation, as described in \\citet{mitchell_2013}.  This simulation is henceforth referred to as the ``doubly-periodic simulation,\" abbreviated DPS.  For the singly-periodic and the non-periodic domains, numerical simulations have been performed using a finite-difference scheme, described in \\citet{armfield_1999}. These simulations are hereafter referred to as the ``singly-periodic simulation\" (SPS) and the ``non-periodic simulation\" (NPS). The 2D forcing profiles ${\\bf f}$ for the DPS and SPS are constructed from the depth-averaged magnetic field presented in \\S \\ref{sec:dipole} by retaining the dominant periodic components along the direction of periodicity of the domain. Numerical details of all the simulations have been included in Appendix \\ref{sec:num_meth}.\n\n\\section{Comparison of Experiment and Numerics} \\label{sec:comparison}\n\nIn this section we present the results of our comparison between the experiment and the numerical simulations on the three domains described above. First, we discuss the features of the laminar flow, with a special emphasis on the effect of boundaries. Then we discuss the primary instability, which gives way to a secondary state characterized by the formation of time-independent vortices; features of this secondary state are presented. Finally, we discuss the transition of this steady vortex pattern into a time-periodic flow. \n\n\\subsection{Laminar Flow}\n\nFor low driving the flow mimics the forcing closely, resulting in spatially alternating bands of fluid flow along the $\\pm x$-directions, as can be see in figure \\ref{fig:lam_flow}. In this figure, black vectors correspond to the velocity field ${\\bf u}$ and the colour contour indicates the vorticity $\\omega$. For the experiment (figure \\ref{fig:lam_flow} (d)), the $y$-component of the velocity measured near the centre of the domain is close to zero. However, there are regions of strong recirculation near the end walls, characterized by a nonzero $y$-component of velocity. Additionally, a careful observation of the flow shows a slight tilt in the alignment of the flow bands. This tilt is due to the global circulation, in the counterclockwise direction, which results from the fluid flowing along opposite directions over the end magnets at $y = \\pm 6.5$. Figure \\ref{fig:lam_flow} (a) and (b) show the laminar flows from the DPS and SPS. It can be seen that neither of these display the tilt of the flow bands observed in the experiment since the periodic flows are devoid of any global circulation. The SPS, however, captures the turn around flow near the end walls, at least qualitatively. In contrast, one can see from figure \\ref{fig:lam_flow} (c) that flow field corresponding to the NPS looks practically indistinguishable from the experimental flow field.\n\n\\begin{figure}\n\\qquad\\subfloat[]{\\includegraphics[height=1.6in]{lam_flow_dps.pdf}}\\quad\\qquad\n\\subfloat[]{\\includegraphics[height=1.6in]{lam_flow_sps.pdf}}\\quad \\\\\n\\subfloat[]{\\includegraphics[width=2.5in]{lam_flow_nps.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.5in]{lam_flow_exp.pdf}}\\\\\n\\caption{\\label{fig:lam_flow} The laminar flow fields at $Re=8.1$ for the (a) DPS, (b) SPS, (c) NPS, and (d) experiment. The dashed lines in (d) indicate the locations of velocity profiles that are compared to the simulations in figure \\ref{fig:vel_prof}. The vorticity colourbar plotted for (a) also applies to (b-d).  The velocity vectors are downsampled in each direction by a factor of 8 for the simulations and 4 for the experiment.}\n\\end{figure}\n\nFor a quantitative description of the laminar flow profile, we have plotted the normalized longitudinal velocity for the experiment $u_x^{exp}/U$ along the line $x=0$ in figure \\ref{fig:vel_prof} (a). The location of this cross section is indicated by the vertical dashed line in figure \\ref{fig:lam_flow} (d). The normalized difference in $u_x$ between the experiment and the numerical simulations along this line is shown in figure \\ref{fig:vel_prof} (b). As can be seen, the DPS and SPS, which are only defined for $-4.0<y<4.0$, show systematic deviation from the experiment amounting to as high as 15\\% since they do not capture the tilt in the shear bands which results from global circulation. In comparison, the NPS agrees to within about 5\\% over the same region, with no clear systematic deviation. The disagreement between the experiment and NPS in this region, we believe, is a result of the dipole summation not accounting for the variation in the strength of each individual magnet. Closer to the boundaries, at $y \\approx 7$ and $y \\approx -6$, the largest difference between the NPS and the experiment is around 12\\%. The origin for this error is quite subtle and we shall defer its analysis to \\S\\ref{sec:sensitivity}.\n\n\\begin{figure}\n\\centering\n\\subfloat[]{\\qquad\\quad\\includegraphics[width=4.55in]{u_vs_y.pdf}} \\\\\n\\subfloat[]{\\includegraphics[width=4.95in]{u_vs_y_difference.pdf}}\\hfill  \\\\\n\\subfloat[]{\\qquad\\quad\\includegraphics[width=4.6in]{u_vs_x.pdf}}\\hfill \\\\\n\\subfloat[]{\\includegraphics[width=5in]{u_vs_x_difference.pdf}} \\hfill \n\\caption{\\label{fig:vel_prof} Velocity profiles and normalized differences at $Re=8.1$: (a) the normalized velocity, $u_x^{exp}/U$, as a function of $y$ at the longitudinal centre ($x=0$), (b) the normalized difference between the longitudinal velocities of the simulations and the experimental velocity profile, $(u_x^{sim}-u_x^{exp})/U$, as a function of $y$ at the longitudinal centre ($x=0$), (c) the normalized velocity, $u_x^{exp}/U$, as a function of  $x$ at the centreline of a middle magnet ($y=-0.5$), and (d) the normalized difference between the longitudinal velocities of the simulations and the experimental velocity profile, $(u_x^{sim}-u_x^{exp})/U$, as a function of $x$ at the centreline of a middle magnet ($y=-0.5$).  In (b) and (d), the DPS and SPS are plotted together, as they differ by less than 1\\%; in (d), the boundaries of the DPS are indicated by blue brackets. Note that the DPS and SPS are defined on a smaller domain, whereas the NPS and experiment extend all the way to the side walls at $y=\\pm 9$ and end walls at $x=\\pm7$.  Experimental uncertainties are the size of the symbols or smaller. }\n\\end{figure}\n\nThe normalized longitudinal velocity for the experiment $u_x^{exp}/U$ at $y=-0.5$ (along a central magnet centreline) is shown in figure \\ref{fig:vel_prof} (c). Upon careful observation, one can notice a slight asymmetry in the longitudinal velocity profile, which highlights the effect of the global circulation. In contrast, the DPS is perfectly uniform and thus does not capture this slight asymmetry, as can be seen from the plot of its difference with the experimental profile in figure \\ref{fig:vel_prof} (d) (brackets indicate the longitudinal extent of the DPS). The SPS, which is defined all the way to the end walls, also does not capture this asymmetry, as the flow in the SPS is also devoid of global circulation. However, it does capture the decay of the longitudinal velocity profile in the region $|x|\\gtrsim 5$, towards the end walls. The NPS is closest in agreement, as it displays the asymmetry observed in the experiment and captures the decay of the velocity near the end walls. \n\nIn summary, the presence of lateral boundaries in the experiment has a clear and systematic effect on the laminar flow profile, which is not captured by either the DPS or the SPS. However, the NPS succeeds in capturing these effects to a very good degree of accuracy.\n    \n\n\\subsection{Primary Instability}\n\nAs we increase the strength of the forcing, the laminar flow in the experiment becomes unstable at $Re_c^{exp} = 11.07$ and a new pattern of steady vortices appears. Since this flow is characterized by modulation of the flow bands along the longitudinal direction, we shall henceforth refer to it as the ``modulated state.\" Figure \\ref{fig:mod_state} (a-d) show the flow fields of the modulated state observed in the DPS, SPS, NPS, and experiment, respectively, at $Re = 14.1$. The counterclockwise global circulation in the experiment strongly affects the alignment of the vortices (see figure \\ref{fig:mod_state} (d)) which can be seen from comparing the modulated states for the DPS and SPS with the relevant regions of the experimental flow. However, one again, the flow fields from the NPS capture the features observed in the experimental flow remarkably well.\n\n\\begin{figure}\n\\qquad\\subfloat[]{\\includegraphics[height=1.6in]{mod_flow_dps.pdf}}\\quad\\qquad\n\\subfloat[]{\\includegraphics[height=1.6in]{mod_flow_sps.pdf}}\\quad \\\\\n\\subfloat[]{\\includegraphics[width=2.5in]{mod_flow_nps.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.5in]{mod_flow_exp.pdf}}\\\\\n\\caption{\\label{fig:mod_state} Flow fields at $Re=14.1$, midway through the modulated state regime, for the (a) DPS, (b) SPS, (c) NPS, and (d) experiment.  The vorticity colourbar plotted for (a) also applies to (b-d).  The velocity vectors are downsampled in each direction by a factor of 8 for the simulations and 4 for the experiment.}\n\\end{figure}\n\nAs mentioned in  \\S\\ref{sec:LSA}, the transition to the modulated state is characterized by the appearance of transverse velocity, $u_y\\ne 0$, in almost the entirety of the flow domain. As the driving is increased, the magnitude of this transverse velocity also increases. A bifurcation diagram characterizing the transition from the laminar to the modulated state is shown in figure \\ref{fig:bif1} (a).  The order parameter is the nondimensionalized mean square $y$-component of velocity, $\\langle u_y^2 \\rangle/U^2$, plotted as a function of $Re$.  These measurements are made over the central region $-4.0<x<4.0$ and $-4.0<y<4.0$ for all simulations and experiment.  In comparison to the experiment, the primary bifurcation in the DPS and SPS occur at much lower Reynolds numbers of $Re_c^{DPS}=9.39$ and $Re_c^{SPS}=9.64$. This result shows that imposing realistic longitudinal boundaries alone cannot capture the transition of the laminar state. In contrast, the transition in the NPS occurs at $Re_c^{NPS}$ = 10.73, a mere 3\\% underestimation of that observed in the experiment. This demonstrates that the inclusion of the correct boundary conditions, in addition to realistic modelling of the magnetic field, allows one to predict the primary instabilility to very good accuracy using equation (\\ref{eq:2dns_mod}). It is important to note that the NPS using equation (\\ref{eq:2dns_wf}) instead of equation (\\ref{eq:2dns_mod}) predicts the transition to occur at $Re_c=8.91$, which fails to predict the transition even after incorporating realistic boundaries and an accurate forcing profile.\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=2.52in]{first_bifurcation.pdf}}\\qquad\n\\subfloat[]{\\includegraphics[width=2.4in]{wavelength.pdf}}\n\\caption{\\label{fig:bif1} (a) A bifurcation diagram showing the initial instability for the experiment and simulations.   This bifurcation occurs as the flow transitions from the laminar to the modulated state, which is characterized by the formation of time-independent vortices in a regular lattice. (b) The spatial average of the nondimensional wavelength in the $x$-direction, $\\bar{\\lambda}_x/L$, as a function of $Re$ for the modulated regime.  At each $Re$, measurements are made for $-4.0 \\le y \\le 4.0$ then averaged; the uncertainty bars indicate one standard deviation in the spatial measurements.}\n\\end{figure}\n\nAnother measure that facilitates a quantitative comparison between the experiment and the simulations is the average longitudinal wavelength $\\bar{\\lambda}_x$ associated with the vortex pattern in the modulated state regime. It is important to note that this wavelength is a spatially averaged quantity computed by measuring the separation between adjacent vortex centres and adjacent saddles in the centre region of the domain $-4.0<y<4.0$. At onset, just above the initial instability, the vortices in the experiment form a lattice with a fairly uniform separation between them, i.e. $\\bar{\\lambda}_{x,c}^{exp}/L = 3.97$. This critical wavelength $\\bar{\\lambda}_{x,c}^{exp}/L$ and the normalized wavenumber $q_c^{exp}$ introduced in the linear stability analysis in \\S\\ref{sec:LSA} are related by $\\bar{\\lambda}_{x,c}^{exp}/L = 2/q_c^{exp}$. As the forcing is increased the mean separation between the vortices increases, as can be seen from the plot of $\\bar{\\lambda}_x/L$ versus $Re$ shown in figure \\ref{fig:bif1} (b). Additionally, at higher forcing, the vortex lattice becomes spatially irregular, especially in the region $|y| \\gtrsim 3$, as can be seen in figure \\ref{fig:mod_state} (d). This spatial variation is quantified in the plot in figure \\ref{fig:bif1} (b) wherein the uncertainty bars indicate one standard deviation in the spatial variation of the separation between adjacent vortices and adjacent saddles. The large uncertainty bar on the lowest experimental measurement is due to a larger uncertainty in identifying the vortex centres and saddles when the flow is very weakly modulated. For comparison, figure \\ref{fig:bif1} (b) also shows the wavelength measured from the DPS and SPS. Neither of these are representative of what one observes in the experiment, showing practically no variation in wavelength across the domain as well as across Reynolds numbers. In contrast, the NPS captures both the spatial variation of the wavelength and the distortion of the lattice with increasing forcing quite accurately. However, for a given Reynolds number, the NPS overestimates the wavelength compared to what is observed in the experiment. The origin of this discrepancy is discussed in detail in \\S \\ref{sec:sensitivity}.\n\n\\subsection{Secondary Instability}\n\nAs we increase the forcing further, the modulated flow in the experiment undergoes a transition at $Re=17.3$ giving way to an oscillatory state with a period of 122 seconds at onset. With a quasistatic increase in the driving the amplitude of these oscillations grows, while the period remains approximately constant. The bifurcation diagram quantifying this transition is plotted in figure \\ref{fig:hopf} (a), which shows the nondimensionalized peak intensity $I/U^2$ of the temporal power spectrum spatially averaged over the region $-4.0<x<4.0$ and $-4.0<y<4.0$ as a function of $Re$. The associated power spectra are shown in figure \\ref{fig:hopf} (b). The NPS shows a very similar transition, with onset occurring at $Re=17.0$ with a period of 125 seconds. The range of $Re$ over which these periodic oscillations are observed is very narrow in both the experiment and the NPS. Note that the discrepancy between the simulation and experiment in the Reynolds number characterizing this bifurcation is a mere 2\\%.  A side-by-side comparison video showing the periodic orbits for the NPS and experiment is available in the supplementary materials online. The flow regimes explored by the DPS and the SPS are vastly different from what we observe in the experiment and NPS; hence quantitative comparison of the secondary instability is not provided here.\n\nAs we increase the driving further, the flow in both the experiment and the NPS increases in complexity, with the appearance multistability, i.e. the coexistence of stable and chaotic flows for the same Reynolds number depending on the initial conditions. Constructing a bifurcation diagram characterizing all such regimes is beyond the scope of this current study and is being probed separately.  \n\n\\begin{figure}\n\\subfloat[]{\n\\begin{minipage}[c][0.8\\width]{0.47\\textwidth}\n\\includegraphics[clip,width=2.5in]{hopf.pdf}\n\\end{minipage}}\\qquad\\subfloat[]{\\centering{}\n\\begin{minipage}[c][0.8\\width]{0.47\\textwidth}\n\\begin{center}\n\\includegraphics[clip,width=2.5in]{power_spectrum_exp.pdf}\\\\\n\\includegraphics[clip,width=2.6in]{power_spectrum_sim.pdf}\n\\par\\end{center}\n\\end{minipage}}\n\\caption{\\label{fig:hopf} (a) A bifurcation diagram showing the nondimensionalized power spectrum intensity, $I/U^2$, as a function of $Re$.  The temporal power spectrum is averaged over the region $-4.0<x<4.0$ and $-4.0<y<4.0$ before calculating the intensity $I$. This supercritical Hopf bifurcation, which occurs at $Re=17.3$ in the experiment and $Re=17.0$ in the NPS, corresponds to the flow transitioning from the modulated state to a periodic orbit. (b) The nondimensional temporal power spectrum, $P/U$, as a function of the frequency, $f$, for the experiment (top) and NPS (bottom) as the current is quasistatically increased through the periodic orbit regime.}\n\\end{figure}\n\n\n\\section{Modelling Limitations} \\label{sec:limitations}\n\nAll the results presented so far have indicated that the NPS captures the features of the experimental flow quite accurately, predicting the primary and secondary instabilities to within about 3\\%. However, one needs to be aware that the 2D equation (\\ref{eq:2dns_mod}) is a reduced model describing an inherently 3D experiment. For instance, the forcing function ${\\bf f}(x,y)$ computed by depth-averaging the 3D magnetic field $B_z(x,y,z)$ is devoid of information regarding how the magnetic field varies along $z$. The actual Q2D flow in the experiment, instead, is in response to such a 3D forcing. Furthermore, the dipole summation modelling the magnet array does not account for any possible inhomogeneities in each magnet or variation in strength across different magnets. Experimental measurements of $B_z$ at a fixed height along the cross section $x = 0$ (figure \\ref{fig:mag_prof} (a)) show that the dipole summation magnetic field deviates from the experiment by at most 5\\% in certain places. Hence, it is crucial to explore the role of these deficiencies of the numerical model. We restrict our quantitative analysis to studying the effect on the primary bifurcation.\n\n\\subsection{Non-Idealized Forcing Profiles} \\label{sec:sensitivity}\n\nAs described earlier in \\S\\ref{sec:dipole}, the dipole summation model assumes that the strength of the dipoles across magnets, as well as within each magnet, is uniform. In an effort to quantify the effects of inhomogeneous magnetization in experiments, we separate the study of variations in dipole strength across different magnets from those within a given magnet. For purposes of notational convenience, $B$ will refer to the $z$-component of the 3D dipole summation and $B_{DA}$ will refer to the $z$-component of the 2D dipole summation which has been calculated by depth-averaging over the region $0.236<z<0.472$ (the location of the electrolyte layer); $\\widetilde{B}_{DA}$ will refer to forms of the dipole summation which have been perturbed then depth-averaged. This notation is used throughout \\S\\ref{sec:sensitivity} and \\S\\ref{sec:inherent_3d}.\n\nThe first type of imperfection we explore is the variation in the strength of magnetization across different magnets, with each magnet still being uniformly magnetized. Three different forms of perturbations are studied: (i) perturbations both increasing and decreasing the dipole strength for the central 6 magnets of the magnet array, (ii) perturbations which increase the dipole strength of each of the end magnets, and (3) perturbations which decrease the dipole strength of each of the end magnets. The depth-averaged magnetic field $\\widetilde{B}_{DA}$ is then recalculated for this perturbed configuration. The normalized depth-averaged magnetic field residuals along the cross section $x=0$ (compared to the unperturbed dipole summation $B_{DA}$) are presented in figure \\ref{fig:bif_perturbation} (a). Using the perturbed depth-averaged magnetic field profile we have recomputed the laminar and modulated states and the resulting bifurcation diagram is shown in figure \\ref{fig:bif_perturbation} (b).\n\n\\begin{figure}\n\\subfloat[]{\\includegraphics[width=2.95in]{B_perturbations.pdf}} \\quad\n\\subfloat[]{\\includegraphics[width=2.2in]{first_bif_w_perturbations.pdf}}\n\\caption{\\label{fig:bif_perturbation} (a) A plot showing the difference between the perturbed dipole summation magnetic fields, $\\widetilde{B}_{DA}$, and the unperturbed dipole summation magnetic field, $B_{DA}$, normalized by the spatial rms depth-averaged magnetic field $\\sqrt{\\langle B_{DA} \\rangle}$.  Magnetic fields perturbed in three different ways are plotted: asymmetric perturbations near the middle (red dashed line), positive perturbations at the ends (green dot-dashed line), and negative perturbations at the ends (blue dotted line). Note that the sign of the magnetic field for each individual magnet is indicated at the top of the plot. (b) A bifurcation diagram showing the initial instability for the NPS, with various perturbations added to the dipole summation.  The first bifurcation is much more sensitive to perturbations to the magnetic field of the end magnets than the middle magnets, even though the bifurcation parameter is only measured in the middle region.}\n\\end{figure}\n\nClearly, the first bifurcation is much more affected by perturbations to each of the end magnets than perturbations to magnets near the centre of the domain.  Additionally, recall that both the bifurcation order parameter $\\langle u_y^2 \\rangle / U^2$ and the Reynolds number $Re=UL/\\nu$ are calculated over the central region of the domain: $-4.0<x<4.0$ and $-4.0<y<4.0$.  This makes the results especially surprising -- that perturbing the strength of the end magnets affects the flow at the centre more strongly than perturbing the central magnets does. This result suggests the important role that global circulation plays in determining the dynamics of the system.\n\nThe second set of perturbations we explore are those which correspond to variations in the dipole strength along the length of each individual magnet.  However, rather than varying the strength of the dipoles along their length within each magnet, we create a ``hybrid\" profile that combines the magnetic field from the idealized depth-averaged dipole summation $B_{DA}$ with experimental measurements shown in figure \\ref{fig:mag_prof} (b). This 2D hybrid field is generated from combining (i) the transverse profile at $x=0$ of the idealized depth-averaged dipole summation $B_{DA}$, and (ii) the longitudinal measurements taken along the centreline of each magnet (black markers in figure \\ref{fig:mag_prof} (b)), normalized to unity using the average value over a small central region near $x=0$. The normalization ensures that the 2D hybrid profile has the same transverse cross section at $x=0$ as the idealized dipole summation while replicating the fluctuations in the magnetic field corresponding to those measured experimentally along the longitudinal direction.  The resulting bifurcation diagram is not included, as the bifurcation curve is virtually indistinguishable from the unperturbed case.  This analysis effectively demonstrates the insensitivity of the first bifurcation to longitudinal perturbations.\n\nThe robustness of the flow to noise in the magnetic field explains why, despite using an idealized dipole summation, the laminar to modulated transition in the NPS differs by only 3\\% compared to that in the experiment. Hence, it is natural to ask if one could achieve ``perfect agreement'' between the 2D model and the Q2D experiment by replacing the dipole summation with a depth-averaged profile computed entirely using experimental measurements of the magnetic field over a 3D grid located within the electrolyte. The answer to this question is complicated as can be seen from the following discussion. The dipole summation and the experimental magnetic fields over the end magnets, for instance, differ by less than 5\\%. However, the velocity fields differ by as much as 12\\% in the same location. More importantly, this difference is systematic, i.e. over both the end magnets the simulation predicts a higher velocity magnitude compared to what is measured in the experiment (figure \\ref{fig:vel_prof} (b)). We also observe that the experimental average wavelength is systematically less than that of the NPS for the modulated regime (figure \\ref{fig:bif1} (b)). Our analysis indicates that these discrepancies are too large to be attributed solely to deviations from the uniform dipole summation, suggesting an alternative source of error. This we trace to the inherent three-dimensionality of the experiment.\n\n\\subsection{Inherent Three-Dimensionality of the Experiment} \\label{sec:inherent_3d}\n\nAs has been discussed in \\S \\ref{sec:dipole}, the Lorentz force density due to the specific arrangement of magnets employed in the experiment is, to a very good approximation, given by ${\\bf F} = JB_z(x,y,z)\\hat{\\bf x}$, where $J$ is the magnitude of current density through the electrolyte and $B_z$ is the $z$-component of the magnetic field at any given location $(x,y,z)$ within the electrolyte. In deriving equation (\\ref{eq:2dns_mod}) it was assumed \\citep{suri_2014} that $B_z$ can be decomposed as the product of a 2D profile ${B}_{z}^0(x,y)$, which depends exclusively on the extended coordinates $(x,y)$, and a decay function $D(z)$, which captures the decay of the magnetic field above the magnet array, i.e.  ${B}_z(x,y,z) = D(z) B_z^0(x,y)$. This implies that, when normalized, the planar magnetic field profiles at various heights $z$ within the electrolyte are identical. This assumption is necessary for a similar decomposition of the plane-parallel Q2D velocity field ${\\bf V}(x,y,z)$ as a product of a vertical profile $P(z)$ and a strictly 2D velocity field ${\\bf u}(x,y)$, i.e. ${\\bf V}(x,y,z) = P(z){\\bf u}(x,y)$.  Such a decomposition facilitates depth-averaging of the 3D Navier-Stokes equations resulting in the strictly 2D model given by equation (\\ref{eq:2dns_mod}). The decomposability of the magnetic field, however, cannot be exactly satisfied when one has a magnet array with finite dimensions. For instance, in figure \\ref{fig:mag_prof} (a), if one imagines rescaling the transverse magnetic profile at $z=0.265$ to match that at $z=0.438$, the profiles would \\emph{not} match over the end magnets. This is apparent by comparing, for example, the peaks at $y=-6.5$ and $y=-4.5$ at each height. The planar profiles of the magnetic field obtained from the idealized dipole summation at $z = 0.236$ (dielectric-electrolyte interface) and $z = 0.472$ (free surface), normalized by the respective rms values of the magnetic fields in the central $8 \\times 8$ region, differ by about 12\\%. This measure, obtained from the idealized dipole summation, provides a lower bound on how much the experimental fields can differ. Hence, the velocity field in the experiment is a response to an inherently 3D forcing.  As a consequence, the NPS with the depth-averaged forcing which is based on the 2D equation (\\ref{eq:2dns_mod}) fails to capture the experimental flow to some degree.\n\nTo study this possible source of discrepancy, we have recomputed the first bifurcation using planar magnetic field profiles exclusively from each height $z = 0.236$ and $z = 0.472$, which correspond to the dielectric-electrolyte interface and the free surface. We find that the resulting plots of the first bifurcation, as well as that of the wavelength of the modulated states (not included in this article), lie on either side of the experimental measurements. This result suggests that the primary reason behind the systematic difference between the NPS and the experiment is a result of deviations from quasi-two-dimensionality. This nondecomposability is the largest over the end magnets and explains why the NPS shows a systematic deviation from the experimental velocity field.\n\n\n\\section{Conclusion} \\label{sec:conclusion}\n\nIn this article, we have investigated the primary and secondary bifurcations of a Kolmogorov-like flow.  This Q2D flow, obtained in the laboratory by electromagnetically driving a stratified layer of electrolyte above an immiscible layer of dielectric, is an appealing system to study because the experimental flow can be described to a very good approximation by a strictly 2D model. Many previous works have used a semi-empirical form of the 2D Navier-Stokes equation with Rayleigh friction, which ignored the effects of the inherent three-dimensionality of the flow. Additionally, virtually all previous studies have employed doubly-periodic boundary conditions, which are non-physical, and assumed a perfectly sinusoidal forcing profile, which is difficult to realize in the laboratory.  \n\nWe have demonstrated that close, quantitative agreement between experiment and numerics is only found when one utilizes equation (\\ref{eq:2dns_mod}) with no-slip boundary conditions imposed at all lateral boundaries. To model the forcing, we numerically computed a 3D approximation to the body forcing, which was then depth-averaged to generate a 2D forcing profile. \nThis simulation results in an exceptional 3\\% discrepancy in $Re_c$ for the primary instability and a 2\\% discrepancy for the secondary instability, with a very similar oscillation period at onset. A detailed sensitivity analysis shows that the systematic deviations between the simulation and experiment are a result of the inherent three-dimensionality of the flow, which indicate a possible limitation of the 2D model.\n\nOn the experimental front, several improvements could be made in future studies. For instance, we have observed that for larger heights above the magnet array, the magnetic field profile is closer to decomposable; hence, a thicker glass plate between the magnets and fluids may improve the agreement. The tradeoff, however, is that the magnetic field ($B_z$) becomes substantially weaker, requiring larger currents ($J$) to attain the same strength of forcing.  This results in larger Joule heating, which may be problematic for carefully maintaining the Reynolds number, as heating affects the viscosity.  Since the non-decomposability of the forcing profile is largest over the end magnets, it may be beneficial to bring the side walls in closer or extend the magnet array so that the end magnets are no longer driving the flow. Use of magnets with much stricter tolerances in the uniformity of the magnetization may also lead to improvements.\n\nMany open questions remain regarding experimental realizations of Kolmogorov flow.  The effect of varying the parameters or the number of forcing periods with realistic no-slip boundary conditions imposed has not been addressed. The effect of how sensitive the flow is to the exact location of the boundaries has not been rigorously studied either. Quantitative comparisons of the transition to turbulence in the experiment and numerics are lacking as well.  Of course, an ECS-based description of turbulence is only in its infancy at the current time, and the existence of such unstable solutions in a Q2D flow is yet to be demonstrated in the literature.  We believe we have laid a solid foundation for future studies of Kolmogorov-like flow at higher Reynolds numbers, into the weakly turbulent regime.\n\nWe thank Daniel Borrero for his useful suggestions and insights, both experimentally and theoretically. J.T. is grateful to Samuel Raben for his assistance in using the PRANA PIV software package. This work is supported in part by the National Science Foundation under Grant Nos.\nCMMI-1234436 and DMS-1125302.\n\n\\appendix\n\n\\section{Nondimensional Form of Governing Equations} \\label{sec:nondim}\n\nEquation (\\ref{eq:2dns_mod}) has been presented in the dimensional form in this article in part to facilitate a direct comparison between the experimental measurements and the numerical simulations. However, nondimensional versions (with $\\beta = 1$) have formed the basis of several previous analytical and computational studies. Hence, it is useful to detail the nondimensionalization of equation (\\ref{eq:2dns_mod}) to facilitate comparison with previous studies.\n\nMost previous studies of Kolmogorov flow have employed a strictly sinusoidal forcing of form ${\\bf f} = \\chi \\sin(\\kappa y) \\hat{\\bf x}$. Since the magnetic field $B_z(x,y,z)$, and hence its depth-average $B_{DA}$, are close to being sinusoidal at the centre of the magnet array, a natural choice is to define an amplitude-profile form of the depth-averaged magnetic field such that $B_{DA} = B_0{\\widehat{B}_{DA}}$. Here ${\\widehat{B}_{DA}} \\approx \\sin(\\kappa y)$ at the centre of the array with ${\\widehat{B}_{DA}}(0,w/2) = 1$ and $B_0 = B_{DA}(0,w/2)$, where $w$ is the width of a magnet in the experiment. The depth-averaged forcing is then given by ${\\bf f} = JB_0{\\bf \\hat{f}}$, where ${\\bf{\\hat f}} = {\\widehat{B}_{DA}}\\bf{\\hat x}$.\n\nChoosing the width $w$ of a magnet as the characteristic length scale $L_s$ of the flow and a velocity scale $U_s = \\sqrt{JB_0w/\\rho}$ based on the strength of the forcing, we can rewrite equations (\\ref{eq:2dns_mod}) in terms of nondimensional variables ${\\bf u}$ and $p$ as\n \n", "index": 11, "text": "\\begin{equation}\\label{eq:q2dns_ndim}\n\\begin{aligned}\n\\frac{\\partial {\\bf u}}{\\partial t} + \\beta {\\bf u}\\cdot\\nabla{\\bf u} &= -\\nabla p + \\frac{1}{Re}\\left(\\nabla^2 {\\bf u}- \\gamma{\\bf u}\\right) + {\\bf \\hat{f}}, \\\\\n\\nabla\\cdot{\\bf u} &= 0, \n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{\\partial{\\bf u}}{\\partial t}+\\beta{\\bf u}\\cdot\\nabla{\\bf u}\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐮</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac></mstyle><mo>+</mo><mrow><mrow><mi>β</mi><mo>⁢</mo><mi>𝐮</mi></mrow><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>𝐮</mi></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=-\\nabla p+\\frac{1}{Re}\\left(\\nabla^{2}{\\bf u}-\\gamma{\\bf u}%&#10;\\right)+{\\bf\\hat{f}},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>p</mi></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>R</mi><mo>⁢</mo><mi>e</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>𝐮</mi></mrow><mo>-</mo><mrow><mi>γ</mi><mo>⁢</mo><mi>𝐮</mi></mrow></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mover accent=\"true\"><mi>𝐟</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\nabla\\cdot{\\bf u}\" display=\"inline\"><mrow><mo>∇</mo><mo>⋅</mo><mi>𝐮</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6Xa.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=0,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nIn the above equation ${\\bf u}_{{\\textrm{{n}}}}$ and $p_{{\\textrm{{n}}}+1}$ are the velocity and kinematic pressure fields with the subscript ${\\textrm{{n}}}$ indicating a discrete time instant $t_{{\\textrm{{n}}}} = {{\\textrm{{n}}}}\\Delta t$, where $\\Delta t$ is the time step for the update. For purposes of brevity we have used the notation $\\mathcal{N}{\\bf u}_{{\\textrm{{n}}}} = {\\bf u}_{{\\textrm{{n}}}}\\cdot\\nabla{\\bf u}_{{\\textrm{{n}}}}$ and $\\mathcal{L}{\\bf u}_{{\\textrm{{n}}}} = \\nabla^2{\\bf u}_{{\\textrm{{n}}}}-\\alpha{\\bf u}_{{\\textrm{{n}}}}$ to represent the nonlinear and linear terms, respectively. As can be seen, the above equation results from a semi-implicit approximation for the temporal evolution of equation (\\ref{eq:2dns_mod}), where the linear terms in the update are treated implicitly using the Crank-Nicholson scheme while the nonlinear term is handled explicitly using the Adams-Bashforth scheme. It is important to note that the velocity field ${\\bf u}_{{\\textrm{{n}}}+1}$ at every updated instant satisfies the incompressibility condition\n\n", "itemtype": "equation", "pos": 73053, "prevtext": "\nwhere we used $T_s = L_s/U_s$ to nondimensionalize time. The Reynolds number $Re = U_sL_s/\\nu$ can then be expressed in terms of the strength of the forcing as $Re = \\sqrt{JB_0w^3/\\rho\\nu^2}$. The other nondimensional parameter $\\gamma = \\alpha w^2/\\nu$ captures the relative strength of viscous and frictional terms in equation (\\ref{eq:2dns_mod}). For $\\gamma = 0$ and $\\beta = 1$, we recover the familiar nondimensional form of the 2D Navier-Stokes equation.\n\n\\section{Numerical Methods} \\label{sec:num_meth}\n\nIn this Appendix, we present the details of discretization methods and numerical integration schemes employed in the NPS, SPS, and DPS.\n\n\n\\subsection{Non-Periodic Simulation (NPS) and Singly-Periodic Simulation (SPS)} \\label{sec:app_nps_sps}\n\nSince the NPS, as well as the SPS, require prescribing Dirichlet no-slip boundary conditions on the velocity field ${\\bf u}$, numerical simulations are performed using the primitive variable ($u_x$, $v_x$, and $p$) formulation by employing a semi-implicit fractional-step method detailed in \\cite{armfield_1999}. To begin with, equation (\\ref{eq:2dns_mod}) is discretized in time to obtain the following difference equation:\n\n", "index": 13, "text": "\\begin{equation}\\label{eq:2dns_mod_discrete}\n\\frac{{\\bf u}_{{\\textrm{{n}}}+1} - {\\bf u}_{{\\textrm{{n}}}}}{\\Delta t} + \\frac{3}{2}\\mathcal{N}{\\bf u}_{{\\textrm{{n}}}} -  \\frac{1}{2}\\mathcal{N}{\\bf u}_{{\\textrm{{n}}}-1} = -\\nabla p_{{\\textrm{{n}}}+1} + \\frac{1}{2}\\mathcal{L}({\\bf u}_{{\\textrm{{n}}}+1} + {\\bf u}_{{\\textrm{{n}}}}) + {\\bf f}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\frac{{\\bf u}_{{\\textrm{{n}}}+1}-{\\bf u}_{{\\textrm{{n}}}}}{\\Delta t}+\\frac{3}{%&#10;2}\\mathcal{N}{\\bf u}_{{\\textrm{{n}}}}-\\frac{1}{2}\\mathcal{N}{\\bf u}_{{\\textrm{%&#10;{n}}}-1}=-\\nabla p_{{\\textrm{{n}}}+1}+\\frac{1}{2}\\mathcal{L}({\\bf u}_{{\\textrm%&#10;{{n}}}+1}+{\\bf u}_{{\\textrm{{n}}}})+{\\bf f}.\" display=\"block\"><mrow><mrow><mrow><mrow><mfrac><mrow><msub><mi>𝐮</mi><mrow><mtext>n</mtext><mo>+</mo><mn>1</mn></mrow></msub><mo>-</mo><msub><mi>𝐮</mi><mtext>n</mtext></msub></mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>+</mo><mrow><mfrac><mn>3</mn><mn>2</mn></mfrac><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>⁢</mo><msub><mi>𝐮</mi><mtext>n</mtext></msub></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>⁢</mo><msub><mi>𝐮</mi><mrow><mtext>n</mtext><mo>-</mo><mn>1</mn></mrow></msub></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mo>∇</mo><mo>⁡</mo><msub><mi>p</mi><mrow><mtext>n</mtext><mo>+</mo><mn>1</mn></mrow></msub></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐮</mi><mrow><mtext>n</mtext><mo>+</mo><mn>1</mn></mrow></msub><mo>+</mo><msub><mi>𝐮</mi><mtext>n</mtext></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi>𝐟</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhich is enforced through the three-fractional-step P2 (pressure correction) projection method discussed in \\citet{armfield_1999}. \n\nSpatial discretization of the velocity and pressure fields is carried out using the standard marker and cell (MAC) staggered grid \\citep{harlow_1965}. The spatial derivatives in equation (\\ref{eq:2dns_mod_discrete}) are approximated using finite differences, the 2D Laplacian operator ($\\nabla^2$) uses a five-point stencil formula, and the nonlinear term uses a modified MAC formula \\citep{griebel_1998}. \n\nFor both the NPS and the SPS, we have chosen 20 cells per magnet width $L$ to discretize the velocity and pressure fields. Since the dimensions of the NPS are identical to the lateral dimensions of the experiment, i.e. $14\\times 18$, a total of $280\\times360$ cells were used to sample the flow domain. The SPS, however, corresponds to a domain of dimensions $14\\times8$, which maps to a region including the central eight magnets along the $y$-direction in the experiment. Hence, a total of $280\\times160$ cells were used to sample the SPS domain. For both the SPS and NPS, a time step of $\\Delta t = 1/40$ s was used for all the numerical simulations. \n\n\\subsection{Doubly-Periodic Simulation (DPS)} \\label{sec:app_dps}\n\nFor simulations on the doubly-periodic domain, it is convenient to use the vorticity-stream function formulation instead of the velocity-pressure formulation. Hence, taking the curl of equation (\\ref{eq:2dns_mod}), we obtain the following equation for the evolution of the $z$-component of vorticity  $\\omega  = (\\nabla\\times{\\bf u})\\cdot{\\bf\\hat{z}}$:\n\n", "itemtype": "equation", "pos": 74473, "prevtext": "\nIn the above equation ${\\bf u}_{{\\textrm{{n}}}}$ and $p_{{\\textrm{{n}}}+1}$ are the velocity and kinematic pressure fields with the subscript ${\\textrm{{n}}}$ indicating a discrete time instant $t_{{\\textrm{{n}}}} = {{\\textrm{{n}}}}\\Delta t$, where $\\Delta t$ is the time step for the update. For purposes of brevity we have used the notation $\\mathcal{N}{\\bf u}_{{\\textrm{{n}}}} = {\\bf u}_{{\\textrm{{n}}}}\\cdot\\nabla{\\bf u}_{{\\textrm{{n}}}}$ and $\\mathcal{L}{\\bf u}_{{\\textrm{{n}}}} = \\nabla^2{\\bf u}_{{\\textrm{{n}}}}-\\alpha{\\bf u}_{{\\textrm{{n}}}}$ to represent the nonlinear and linear terms, respectively. As can be seen, the above equation results from a semi-implicit approximation for the temporal evolution of equation (\\ref{eq:2dns_mod}), where the linear terms in the update are treated implicitly using the Crank-Nicholson scheme while the nonlinear term is handled explicitly using the Adams-Bashforth scheme. It is important to note that the velocity field ${\\bf u}_{{\\textrm{{n}}}+1}$ at every updated instant satisfies the incompressibility condition\n\n", "index": 15, "text": "\\begin{equation} \\label{eq:incomp_discrete}\n\\nabla\\cdot{\\bf u}_{{\\textrm{{n}}}+1}=0,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\nabla\\cdot{\\bf u}_{{\\textrm{{n}}}+1}=0,\" display=\"block\"><mrow><mrow><mrow><mo>∇</mo><mo>⋅</mo><msub><mi>𝐮</mi><mrow><mtext>n</mtext><mo>+</mo><mn>1</mn></mrow></msub></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": "\nwhere $W = (\\nabla\\times{\\bf f})\\cdot \\hat{\\bf z}$. The velocity field ${\\bf u}$ is computed from the 2D stream function $\\Psi(x,y)$ using the relations $u_x = \\partial\\Psi/\\partial y$ and $u_y = -\\partial\\Psi/\\partial x$; $\\Psi$ can be computed solving $-\\nabla^2\\psi = \\omega$.\n\nNumerical simulations of equation (\\ref{eq:2dvor_modified}) on the periodic domain are performed using a pseudo-spectral method \\citep{ascher_1995,mitchell_2013}. The vorticity field $\\omega$ is discretized in the Fourier space using $128$ modes along each of the $x$- and $y$-directions. Since the lateral dimensions of the periodic domain are $8\\times8$ units, the spatial resolution associated with the Fourier grid corresponds to 16 grid points per magnet width $L$. Taking the Fourier transform of equation (\\ref{eq:2dvor_modified}), we obtain:\n\n", "itemtype": "equation", "pos": 76190, "prevtext": "\nwhich is enforced through the three-fractional-step P2 (pressure correction) projection method discussed in \\citet{armfield_1999}. \n\nSpatial discretization of the velocity and pressure fields is carried out using the standard marker and cell (MAC) staggered grid \\citep{harlow_1965}. The spatial derivatives in equation (\\ref{eq:2dns_mod_discrete}) are approximated using finite differences, the 2D Laplacian operator ($\\nabla^2$) uses a five-point stencil formula, and the nonlinear term uses a modified MAC formula \\citep{griebel_1998}. \n\nFor both the NPS and the SPS, we have chosen 20 cells per magnet width $L$ to discretize the velocity and pressure fields. Since the dimensions of the NPS are identical to the lateral dimensions of the experiment, i.e. $14\\times 18$, a total of $280\\times360$ cells were used to sample the flow domain. The SPS, however, corresponds to a domain of dimensions $14\\times8$, which maps to a region including the central eight magnets along the $y$-direction in the experiment. Hence, a total of $280\\times160$ cells were used to sample the SPS domain. For both the SPS and NPS, a time step of $\\Delta t = 1/40$ s was used for all the numerical simulations. \n\n\\subsection{Doubly-Periodic Simulation (DPS)} \\label{sec:app_dps}\n\nFor simulations on the doubly-periodic domain, it is convenient to use the vorticity-stream function formulation instead of the velocity-pressure formulation. Hence, taking the curl of equation (\\ref{eq:2dns_mod}), we obtain the following equation for the evolution of the $z$-component of vorticity  $\\omega  = (\\nabla\\times{\\bf u})\\cdot{\\bf\\hat{z}}$:\n\n", "index": 17, "text": "\\begin{equation}\\label{eq:2dvor_modified}\n\\partial_t\\omega + \\beta{\\bf u}\\cdot{\\bf{\\nabla}}{\\omega}=\n\\nu \\nabla^2 \\omega - \\alpha\\omega + W,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\partial_{t}\\omega+\\beta{\\bf u}\\cdot{\\bf{\\nabla}}{\\omega}=\\nu\\nabla^{2}\\omega-%&#10;\\alpha\\omega+W,\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>ω</mi></mrow><mo>+</mo><mrow><mrow><mi>β</mi><mo>⁢</mo><mi>𝐮</mi></mrow><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>ω</mi></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>ν</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>ω</mi></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mi>ω</mi></mrow></mrow><mo>+</mo><mi>W</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00243.tex", "nexttext": " \nwhere ${\\mathcal F}[\\cdot]$ represents the Fourier transform and $\\Omega={\\mathcal F}[\\omega]$.\n\nEquation (\\ref{eq:2dvor_spectral}) is stepped forward in time ($t \\rightarrow t+\\Delta t$) using a 3-substep semi-implicit Strang-Marchuk algorithm \\citep{ascher_1995} where the first and last substeps update the vorticity field using the nonlinear term by means of a second-order explicit Runge-Kutta scheme (using $\\Delta t$/2) while the intermediate substep updates the vorticity field using an implicit second-order Crank-Nicholson scheme (using $\\Delta t$). $\\Delta t$ was chosen as $1/32$ s.\n\n\n\\bibliographystyle{jfm}\n\n\\bibliography{bifurcations}\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $W = (\\nabla\\times{\\bf f})\\cdot \\hat{\\bf z}$. The velocity field ${\\bf u}$ is computed from the 2D stream function $\\Psi(x,y)$ using the relations $u_x = \\partial\\Psi/\\partial y$ and $u_y = -\\partial\\Psi/\\partial x$; $\\Psi$ can be computed solving $-\\nabla^2\\psi = \\omega$.\n\nNumerical simulations of equation (\\ref{eq:2dvor_modified}) on the periodic domain are performed using a pseudo-spectral method \\citep{ascher_1995,mitchell_2013}. The vorticity field $\\omega$ is discretized in the Fourier space using $128$ modes along each of the $x$- and $y$-directions. Since the lateral dimensions of the periodic domain are $8\\times8$ units, the spatial resolution associated with the Fourier grid corresponds to 16 grid points per magnet width $L$. Taking the Fourier transform of equation (\\ref{eq:2dvor_modified}), we obtain:\n\n", "index": 19, "text": "\\begin{equation}\\label{eq:2dvor_spectral}\n\\partial_t\\Omega = - \\beta{\\mathcal F}[{\\bf u}\\cdot{\\bf{\\nabla}}{\\omega}] + \\nu \\nabla^2 \\Omega - \\alpha\\Omega + {\\mathcal F}[W],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\partial_{t}\\Omega=-\\beta{\\mathcal{F}}[{\\bf u}\\cdot{\\bf{\\nabla}}{\\omega}]+\\nu%&#10;\\nabla^{2}\\Omega-\\alpha\\Omega+{\\mathcal{F}}[W],\" display=\"block\"><mrow><mrow><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mo>-</mo><mrow><mi>β</mi><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mi>𝐮</mi><mo>⋅</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>ω</mi></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>+</mo><mrow><mi>ν</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow><mo>+</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>W</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]