[{"file": "1601.04715.tex", "nexttext": "\nwhere $n_{k}= 1/\\sqrt{2\\pi \\sigma_{k}^2}$ is the normalisation factor.\nTherefore, the ``observed'' LoSVD, $F(v)$, resulting from the convolution of\nthe ``real'' LoSVD ($\\mathcal{L}(v)$) and the SDSS spectral resolution profile \n($\\mathcal{R}(v)$), is given by:\n\n", "itemtype": "equation", "pos": 41709, "prevtext": "\n\n   \\title{Outflows and complex stellar kinematics in \\\\ SDSS star forming galaxies}\n\n   \\author{C. Cicone, \n\t\\inst{1,2,3} \n        \t\\and\n      \tR. Maiolino  \\inst{2,3}\n\t\\and\n\tA. Marconi \\inst{4, 5}\n\t}\n\t\\institute{Institute for Astronomy, Department of Physics, ETH Zurich, Wolfgang-Pauli-Strasse 27, CH-8093 Zurich, Switzerland \\\\ \n\t\\email{claudia.cicone@phys.ethz.ch}\n\t\\and Cavendish Laboratory, University of Cambridge 19 J. J. Thomson Avenue, Cambridge CB3 0HE, UK\\\\ \n\t \\and Kavli Institute for Cosmology, University of Cambridge, Madingley Road, Cambridge CB3 0HA, UK\\\\ \n\t\\and  Dipartimento di Fisica e Astronomia, Universit\\`a degli studi di Firenze, Via G. Sansone 1, 50019, Sesto Fiorentino (Firenze), Italy \\\\%4\n\t\\and INAF - Osservatorio Astrofisico di Arcetri, Largo E. Fermi 5, 50125, Firenze, Italy \\\\%5\n\t}\n\t\n\t\n \\date{Received xx xx xx / Accepted: xx xx xx}\n\n\\abstract{We investigate the properties of star formation-driven outflows \nby using a large spectroscopic sample of $\\sim$160,000 local ``normal''\nstar forming galaxies, drawn from the Sloan digital sky survey (SDSS), spanning a wide range of star formation rates (SFRs) and\nstellar masses (M$_*$). The galaxy sample is divided into a fine grid of bins in the ${\\rm M_*-SFR}$\nparameter space, for each of which we produce a composite spectrum by stacking together the SDSS spectra\nof the galaxies contained in that bin. We exploit the high signal-to-noise of the stacked spectra to study \nthe emergence of faint features of optical emission lines that may trace galactic outflows and would otherwise be too faint\nto detect in individual galaxy spectra. We adopt a novel approach that relies on the comparison\nbetween the line-of-sight velocity distribution (LoSVD) of the ionised gas (as traced by the [OIII]$\\lambda$5007 and\nH$\\alpha$+[NII]$\\lambda\\lambda$6548,6583 emission lines) and the LoSVD of the stars, which are used as a reference tracing virial motions.\nSignificant deviations of the gas kinematics from the stellar kinematics in the high velocity tail of the LoSVDs are interpreted\nas a signature of outflows.\nOur results suggest that the incidence of ionised outflows increases with SFR and specific SFR. \nThe outflow velocity ($v_{\\rm out}$) is found to correlate tightly with the SFR for \n$\\rm SFR>1~M_{\\odot}~yr^{-1}$, whereas at lower SFRs the \ndependence of $v_{\\rm out}$ on SFR is nearly flat. The outflow velocity, although with a much\nlarger scatter, appears to increase also with\nthe stellar velocity dispersion ($\\sigma_*$), and we infer velocities as high as\n$v_{\\rm out} \\sim (6-8) \\sigma_*$.\nStrikingly, we detect the signature of ionised outflows only in galaxies located above the main sequence (MS) of\nstar forming galaxies in the M$_*$--SFR diagram, and the incidence of such outflows\nincreases sharply with the offset from the MS.\nThis result suggests that star formation-driven outflows may be responsible for shaping the upper envelope of the MS\nby providing a self-regulating mechanism for star formation.\nFinally, our complementary analysis of the stellar kinematics reveals the presence of blue asymmetries of a few 10 km s$^{-1}$ \nin the stellar LoSVDs. The origin of such asymmetries is not clear, but a possibility is that these trace the presence, in local galaxies of a large\nnumber of high velocity runaway stars and hypervelocity stars in radial trajectories.}\n\n \\keywords{galaxies: general  -- galaxies: ISM -- galaxies:evolution -- galaxies: stellar content --\n ISM:kinematics and dynamics -- ISM: evolution}\n \n \\maketitle\n\n\n\\section{Introduction}\n\nBaryons in galaxies are engaged in a complex intertwining of mechanisms\nwhose combined effects drive galaxy evolution. Key players of this game\nare gas, stars and active galactic nuclei (AGN). Gas is the primary ingredient of\nboth star formation and black hole accretion, and its properties are therefore crucial\nfor shaping galaxies. Star formation and AGN activity can in turn heavily influence \nthe physical, chemical and kinematical conditions of gas within galaxies, thereby exerting\na ``feedback'' on galaxy evolution.\nIn a simplistic way, our current knowledge of the processes occurring in galaxies and\ninvolving gas and stars \ncan be summarised as follows. \nThe presence of gas within galaxies is a key prerequisite for star formation. \nIn local galaxies, all known star formation\ntakes place in dense molecular clouds, mostly in giant molecular clouds (GMCs, see review by \\citealt{Scoville13}).\nThe star formation process can be either smooth and quiescent, probably fostered by cosmological inflows of cold gas into galaxies\n(e.g. \\citealt{Dekel+09, Bouche+10}), or bursty, triggered by dynamical processes such as \ngalaxy interactions \\citep{Scoville13}. \nRecent studies suggested that\nthe latter mode of star formation does not contribute significantly to the cosmic star formation rate (SFR) density, accounting  \nfor only 10\\% of it even at $z\\sim 2$, i.e. the peak of the cosmic SFR density\n\\citep{Rodighiero+11}. Although we still lack conclusive observational evidence for \nthe presence of cold accretion flows feeding galaxy halos (but see promising observations by \\citealt{Cantalupo+14} and \\citealt{Hennawi+15} at\n$z\\sim2$),\nthe hypothesis that the building up of baryonic mass is a secular process\nhas been suggested by the observation of a tight correlation between\n stellar mass (${\\rm M_{*}}$) and star formation rate in star forming galaxies \\citep{Bouche+10,Lilly+13}, \n dubbed star formation ``main sequence'' (MS). The MS is a\n well-established property of the star forming galaxy population at $z\\sim0$ \\citep{Noeske+07, Peng+10} and \nis believed to persist at least up to $z\\sim4$ \\citep{Schreiber+15}, \nwith an intrinsic scatter of only $\\sim0.3$~dex.\n\nOnce star formation is activated, supernovae enrich the interstellar medium \n(ISM) with metals and, along with young and massive stars, inject energy and \n momentum into the ISM, thereby altering the physical conditions of the gas surrounding the sites\n of star formation and at the same time driving multi-phase \n galactic-scale outflows that propel part of the gas out of these regions, and in some\n cases can even expel it from the galaxy.\n The investigation of stellar feedback has triggered a wealth of both theoretical \n and observational works. For theoretical work we refer \n to the early review by \\cite{Chevalier77} for energy-driven outflows, to\n \\cite{Murray+05} for momentum-driven outflows, and to\n \\cite{Hopkins+14} for cosmological zoom-in simulations exploring the combined effect of \n multiple stellar feedback mechanisms on galaxy evolution.\n For observational work we refer to the reviews by \\cite{Veilleux+05} and \\cite{Erb15},\n the latter one focussing on high redshift.\n \nGas heating and removal resulting from intense episodes of star formation\n is believed to play a key role in galaxy evolution. For example, stellar feedback may be the \n main responsible for:\n (i) the low efficiency of star formation observed in both low and high mass\ngalaxies \\citep{Behroozi+10,Papastergis+12}, \n although for more massive galaxies an additional feedback from AGNs \n is often invoked (e.g. reviews by \\citealt{Cattaneo+09} and \\citealt{Kormendy+Ho13}); (ii) the lower gas-phase metal content\n of low-mass galaxies with respect to more massive galaxies \n \\citep{Dave+11b}, and (iii) \n the consequent enrichment of the circumgalactic medium (CGM) with metals \\citep{MacLow+Ferrara99}. Moreover,\n it has been suggested that galactic outflows driven by star formation \n may have aided the reionization of the early Universe, by creating\ngas-free paths around young star clusters thus facilitating the leakage of ionising photons \nfrom the first galaxies \\citep{Heckman+11,Erb15}.\n \nAlthough blueshifted absorption lines at optical and UV wavelengths are probably the most direct \nand accessible tool to identify outflows of ionised (and atomic) gas, especially in distant galaxies, \nnebular emission lines such as [OIII]$\\lambda$5007, H$\\alpha$ and \n[NII]$\\lambda\\lambda$6548,6584 are also widely employed to study galactic outflows,\nboth in local star forming galaxies (e.g. \\citealt{Heckman+90,Veilleux+95,Lehnert+Heckman96,Soto+12,Westmoquette+12,\nRupke+Veilleux13, Rodriguez-Zaurin+13,Bellocchi+13,Cazzoli+14,Arribas+14})\nand at higher redshifts (e.g. \\citealt{Shapiro+09,Newman+12,Harrison+12,Cano-Diaz+12,Genzel+14,Forster-Schreiber+14,Carniani+15}).\nHowever, despite the increasing number of observational studies targeting galactic outflows\nand the remarkable advances in the field,\na {\\it systematic and unbiased} investigation of star formation-driven outflows \nin a large sample of galaxies is still missing. Indeed, \nsince the outflow signature can be very faint and difficult \nto detect in individual normal galaxies, previous studies focused on rather small samples, mostly characterised\nby ``extreme'' properties (e.g. powerful and massive starbursts, \nultra-luminous infrared galaxies (ULIRGs)), hence not representative of the general galaxy population,\nalthough significant improvement has been recently made in this regard (e.g.\n\\citealt{Chen+10,Martin+12,Rubin+14,Chisholm+14}).\n\nIn this paper we study star formation-driven outflows of ionised gas as traced by faint broad\nwings of optical emission lines ([OIII]$\\lambda$5007, H$\\alpha$ and \n[NII]$\\lambda\\lambda$6548,6584) by using the largest and most unbiased spectroscopic sample\nof local galaxies currently available, the Sloan digital sky survey (SDSS).\nThe SDSS, in conjunction with the catalogues provided by the MPA-JHU analysis, \nconstitutes a huge database, whose noteworthy potential in terms of studying the\ngeneral properties of galaxies can be further exploited by stacking multiple spectra together\nto obtain very high signal-to-noise composite spectra\n(e.g. \\citealt{Chen+10,Andrews+Martini13}).\nThe stacking technique has numerous advantages, and it is particularly useful when searching for\nfaint spectral features, such as those impressed by galactic outflows, which can be missed\nin the noise of single galaxy spectra. \n\nWe divide the ${\\rm M_{*}-SFR}$\nparameter space into a fine grid of bins, each of which includes\nfrom several tens to thousands of sources. The spectra within each bin\nare then stacked together to produce a single, very high signal-to-noise\ncomposite spectrum that is representative of the spectrum of a ``typical'' galaxy in that bin,\nin which we can study the emergence of faint broad wings of optical emission lines\nthat may trace ionised outflows.\nMoreover, since stellar mass and star formation rate are intrinsically correlated\nin most star-forming galaxies (because most of them follow the MS), \nby stacking galaxies in bins of SFR and M$_*$ \nwe can investigate the trends between the outflow properties and these two parameters \nindependently, thus breaking their degeneracy resulting from the MS.\nThe SDSS database and the use of the stacking technique \nallow us to explore the incidence and properties of ionised outflows over a wide dynamical range\nof galaxy properties, i.e. ${\\rm M_{*} \\in [2 \\times 10^7, 6 \\times 10^{11}]~M_{\\odot}}$ and\n${\\rm SFR \\in [2 \\times 10^{-3}, 2 \\times 10^2 ]~M_{\\odot}~yr^{-1}}$, which is unprecedented\nin outflow studies.\n\nA rather controversial issue in studies of galactic outflows through {\\it emission} line profiles is\nthe definition of ``broad component'', which is supposed to trace\ngas in outflow, and of\n``narrow component'', which instead traces virial motions in the galaxy. \nSuch an issue has not been addressed in a systematic way by previous studies: most \nof them just rely on the $\\chi^2$ improvement\nto establish the necessity of a broad component to fit the emission line profile\n(e.g. \\citealt{Harrison+12,Westmoquette+12,Bellocchi+13,Arribas+14}).\nMoreover, even if a broad component is present, \nits association with galactic flows is not straightforward: a broad component in emission\nmay trace the high velocity tail of virialised motions within the galaxy, or galaxy interactions.\nIn this study we attempt to overcome this problem by adopting a novel strategy, consisting in directly\ncomparing the line-of-sight velocity distribution (hereafter, LoSVD) of the \nionised gas with the LoSVD of the stars, which is taken as a reference tracing virial motions. \nAccordingly, gaseous outflows are identified by deviations of the gas kinematics from the stellar\nkinematics, and in particular by the presence of an excess of gas velocity with respect to the stars in the\nhigh velocity tail of the LoSVD.\n\nSummarising, the main goal of this work is to investigate\nthe incidence and properties of galactic outflows of ionised gas as a function of a wide \nrange of galaxy properties, breaking the degeneracy between SFR and ${\\rm M_{*}}$. \nMoreover, for the first time, we push outflow studies to stellar masses and SFRs as low\nas ${\\rm 2 \\times 10^7~M_{\\odot}}$ and ${\\rm 2\\times 10^{-3} M_{\\odot}~yr^{-1}}$, respectively, a regime\nthat has not been probed before in this field.\n\nA ${\\rm H_0}$ = 70 km s$^{-1}$ Mpc$^{-1}$, ${\\rm \\Omega_{M}}$=0.27, \n${\\rm \\Omega_{\\Lambda}}$=0.73 cosmology is adopted throughout this paper.\n\n\n\\begin{figure*}[tbp]\n\\centering\n    \\includegraphics[clip=true, trim=-1.5cm 0cm 0.cm -1.5cm,angle=90,scale=0.5]{grid_sf_plot.ps}\\\\\n     \\caption{The SDSS sample of star-forming, non active galaxies selected for this study, plotted \n     in the M$_*$-SFR parameter space. The grid of 50 bins used for the stacking is shown, \n     with the bins colour-coded according to the number of spectra enclosed. The exact number of sources within\n     each bin is indicated by the yellow text. The white dashed and dotted lines \n     represent the MS relation of local star-forming galaxies with its $\\pm1\\sigma$ scatter ($=0.3$~dex).\n     The MS relation has been taken from \\cite{Peng+10} and adapted to this dataset as explained in $\\S$~\\ref{sec:stacking}.}\n   \\label{fig:grid_sf}\n\\end{figure*}\n\n\\section{Methods}\n\nIn this section we present the SDSS sample of star forming, non active galaxies\nselected for this study ($\\S$~\\ref{sec:sample_sel}). We also describe in detail the stacking procedure ($\\S$~\\ref{sec:stacking}) and the\nfitting techniques applied to the stellar continuum and to the [OIII]$\\lambda$5007 and\nH$\\alpha$+[NII]$\\lambda\\lambda$6548,6583 nebular lines to obtain the line-of-sight \nvelocity distributions of stars and ionised gas from the galaxy composite spectra ($\\S$~\\ref{sec:stellar_sub}-\n\\ref{sec:losvd_fit}).\n\n\\subsection{Sample selection}\\label{sec:sample_sel}\n\nOur galaxy sample is entirely drawn from the spectroscopic sample \nof the Sloan digital sky survey, data release 7 (SDSS DR7, \\citealt{Abazajian+09}).  \nWe operate a first selection by including only those galaxies enclosed in the MPA-JHU \ncatalogue \\footnote{Available at \\texttt{http://www.mpa-garching.mpg.de/SDSS/}}, which provides \nintrinsic and derived spectral parameters for each source,\nsuch as redshift, emission line fluxes, stellar mass, and star formation rate \\citep{Tremonti+04, Kauffmann+03c,\nBrinchmann+04, Salim+07}. The MPA-JHU analysis encompasses only SDSS DR7 sources at\n$z<0.7$.\n\nAmong the MPA-JHU galaxies, we selected only sources classified as ``star-forming''  (or ``HII'') according\nto their location on the log([OIII]/H$\\beta$) vs log([NII]/H$\\alpha$) diagram \n(i.e. the ``BPT'' diagram, \\citealt{BPT81}), by adopting the same division criteria as \\citet{Kauffmann+03c}. \nSuch selection is needed in order to avoid contamination\nfrom AGNs, which is of primary importance to constrain the star \nformation-driven feedback mechanisms in action in normal local galaxies.\n\nWe note that the BPT selection may introduce a potential bias in our sample of star forming galaxies.\nThis is due to the fact that purely star forming galaxies may still exhibit extended areas where the optical line \nratios are typical of low-ionisation emission line regions (LINERs). As a consequence, an ``HII'' galaxy \nmay be erroneously classified as ``Composite'' or ``LINER'' when its optical emission \nis averaged over a large aperture (such as the SDSS spectroscopic fibre).\nExtended LINER-like gas excitation in purely star forming galaxies can have different origins.\nIn the vast majority of local isolated (inactive) galaxies, the most plausible source of extended\nLINER-type excitation are evolved (post-AGB) stars \n\\citep{CidFernandes+11,Yan+Blanton12, Singh+13,Belfiore+15}.\nThis is in general not the case for strongly star forming galaxies such as (U)LIRGs, \nwhere there is evidence for extended LINER excitation associated with \nwidespread shocks. Indeed, both theoretical models \\citep{Allen+08} \nand spatially resolved integral field spectroscopy (IFS) \nobservations \\citep{Monreal-Ibero+06, Monreal-Ibero+10, Soto+Martin12, Rich+14, Rich+15} have\nshown that galaxy regions dominated by shock excitation exhibit optical line ratios typical of LINERs.\n\nSince extended shocks can be associated with strong outflows produced by vigorous star formation \n(e.g. \\citealt{Sharp+Bland-Hawthorn10}), our sample selection, by leaving out LINERs and \nComposite galaxies, may be biased against (U)LIRGs experiencing strong feedback from star formation. \nAlthough this is certainly a caveat to keep in mind, the nature of the widespread \nshocks that may dominate the ionised gas excitation over extended regions in (U)LIRGs \nis most likely linked to the merger process.\nThis argument is based on the lack of observational evidence \nfor shock-like excitation significantly affecting the optical line fluxes \nin {\\it isolated (U)LIRGs} \\citep{Monreal-Ibero+10, Rich+15}.\nIndeed, the point made by resolved IFS studies \\citep{Soto+Martin12, Rich+14, Rich+15} about a possible \nmisclassification of star forming galaxies hosting widespread shocks, when aperture-integrated spectra are used,\nconcerns {\\it only (U)LIRGs in a merger stage}. \nIn contrast, for isolated (U)LIRGs, the contribution from shocks to extended optical line emission \nis negligible \\citep{Monreal-Ibero+10, Rich+15}. \nTherefore, the types of shocks that can affect integrated optical line \nfluxes to the point that an ``HII'' galaxy is classified as ``Composite'' or ``LINER'' are galaxy-wide shocks produced by a complex\ninterplay of merger-driven processes, and not just by star-formation-driven outflows. For their sample of local ULIRGs, \n\\cite{Monreal-Ibero+06} explicitly \nconcluded that the LINER-type optical line ratios observed in the extranuclear regions,\nseveral kiloparsecs away from the circumnuclear starburst, are due to shocks associated with tidally-induced large-scale flows\nproduced during the merger and not to star formation-driven ``superwinds'' (which instead tend to dominate the gas kinematics in the \ninner regions of these ULIRGs that are characterised mostly by HII-type excitation). A similar conclusion was reached by \\cite{Monreal-Ibero+10}\nwho investigated the excitation source of ionised gas in a sample of 32 local LIRGs using IFS data, and \nfound that the presence and relevance of shock-type excitation is more strongly correlated with the interaction class of the system \nthan with the star formation activity (with isolated galaxies being largely dominated by HII-type excitation).\n\nIn summary, based on the observational evidence available from IFS studies, \nour BPT sample selection could lead to two possible biases:\n(i) a bias against ageing isolated galaxies dominated by old stellar populations and/or (ii) a bias against merger-driven shocks. \nThe first bias would affect massive ``retired'' galaxies \nwith stellar populations older than 1~Gyr and little ongoing star formation (e.g. \\citealt{CidFernandes+11, Singh+13}),\nhence with very little or no star formation feedback at work. The second bias would affect mergers, which are only a minor fraction \nof the local galaxy population \\citep{Patton+Atfield08} and so unimportant in our sample\\footnote{Our sample is largely\nrepresentative of the local star forming galaxy population, in contrast to previous outflow studies focussing mostly on the local (U)LIRG\npopulation (for which the merger fraction is much higher).}. \nMoreover, even if hypothesising that our analysis under-represents\nmerging (U)LIRGs experiencing strong feedback, our conclusions (e.g. $\\S$~\\ref{sec:discussion_MS}) \nwould not be affected but would actually be even strengthened: in this case\nwe would be under-representing galaxies with high SFRs/sSFRs (i.e.\ngalaxies above the Main Sequence in the M$_*$-SFR diagram, e.g. \\citealt{Combes+13, KilerciEser+14}) \nwith strong outflows, hence our investigation and \nthe relevant results could be regarded as conservative.\n\nIn addition to the BPT selection of ``HII'' galaxies, we require \na signal-to-noise greater than five in all four emission lines used in the BPT diagram (i.e. [OIII], H$\\beta$, [NII], H$\\alpha$).\nAs a consequence, the most passive galaxies, which do not show prominent\nnebular lines, are under-represented in our sample.\nWe note that, by imposing a threshold SNR on the [OIII] and [NII] line fluxes, we may introduce a bias with\nmetallicity. However, since local galaxies define a tight surface in the $\\rm M_*-\\mathcal{Z}-SFR$ plane (i.e. the ``fundamental\nmetallicity relation'', e.g. \\citealt{Mannucci+10, Lara-Lopez+10}), we do not expect galaxies {\\it within a given bin} in the $\\rm M_*-SFR$ parameter space \nto show significant variations in metallicity. Therefore, the main effect of imposing SNR constraints on the [OIII] and [NII] emission lines \nis that our sample selection does not allow us to populate certain regions of the $\\rm M_*-SFR$ parameter space, but we are\nnot introducing differential biases within the galaxy bins that are included in our sample.\n\nA general caveat for this study is that \nat the median redshift of our sample,\n$z_{\\rm med}$ = 0.073, the 3 arcsec-diameter of the SDSS spectroscopic fibre samples only the galaxy emission\nwithin $r\\lesssim2.1$~kpc. \nMoreover, the spectroscopic fibre samples a wide range of different projected sizes within our galaxy sample. Aperture effects\nare an obvious limitation of our study that will need to be taken into account in future works and that can be tackled properly\nonly by using spatially-resolved observations. In order to be able to study outflows in ``normal'' galaxies (i.e. in galaxies that\nare neither extreme starbursts nor AGN hosts) we need to wait for the completion of ongoing large IFS surveys such as\nthe CALIFA, SAMI and MaNGA surveys, although these will still have a statistics that is orders of magnitudes smaller than that provided by the SDSS.\nAnother potential source of bias is given by galaxy inclination, which can have an important effect on the detectability of outflows (e.g. \\citealt{Chen+10}).\nHowever, in terms of outflow properties, we expect the stacking of thousands of spectra to average out the effects of inclination, and so we do not expect\nour results to be greatly affected.\n\nOur final selection consists of 157,639 galaxy spectra, whose distribution\nin the ${\\rm M_{*}-SFR}$ diagram\nis shown in Fig.~\\ref{fig:grid_sf}. \nThe stellar mass of each galaxy was derived from a fit to the observed spectral energy \ndistribution (SED), obtained with SDSS broad-band photometry \\citep{Brinchmann+04, Salim+07}, \nwhich therefore takes into account the {\\it total} emission from\nthe galaxy. The SFR estimate is instead based on the H$\\alpha$ intrinsic luminosity following the procedure described by \\cite{Brinchmann+04},\nwithout applying any aperture correction to the SDSS fibre-limited spectrum: the SFRs employed in this work \nare therefore the ``fibre SFRs'' provided in the MPA-JHU catalogue. Such choice is justified by the fact that, \nin this study, we infer the properties of the gaseous and stellar kinematics by using exclusively\nthe information provided by the fibre-limited SDSS spectroscopy, hence we do not have information on the gas (and so on possible outflows)\non scales larger than those sampled by the fibre. Therefore, we believe that, given the obvious limitations of SDSS spectroscopy \n(which can be overcome only with IFS studies), it is more sensible to look for possible correlations between the properties\nof ionised outflows (on the scales sampled by the SDSS fibre) and the fibre SFRs, rather than the aperture-corrected SFRs.\nFor the stellar mass instead we have chosen to use the ``total'' M$_*$ because galactic outflows are expected to feel the effect of the entire\ngalaxy gravitational potential well, which is linked to the {\\it total} stellar mass.\n\n\\subsection{Stacking procedure}\\label{sec:stacking}\n\n\\begin{figure}[tb]\n\\centering\n    \\includegraphics[clip=true,scale=.6,angle=270]{drizzling.eps}\\\\\n     \\caption{Sketch of the ``Drizzle'' method applied to the SDSS spectra.}\n   \\label{fig:drizzling}\n\\end{figure}\n\nThe ${\\rm M_{*}-SFR}$ parameter space sampled by our SDSS galaxy selection \nis divided into a fine grid of 50 bins, as shown in Fig.~\\ref{fig:grid_sf}, and the spectra within each\nbin are stacked together to obtain very high signal-to-noise composite spectra.\nEach bin is required to include a minimum of 50 sources, but most bins contain over 100 galaxies, and the central\nones up to $\\sim20,000$. Throughout this paper, we will code each stack by its average log(SFR) and\nlog(M$_{*}$) (ID=log(SFR)\\_log(M$_{*}$)).\n\nWe also show in Fig.~\\ref{fig:grid_sf} the position of the main sequence of local star-forming\ngalaxies and its $\\pm0.3$~dex scatter \\citep{Salim+07, Peng+10}. \nSince we use fibre-limited SFRs, the reference MS for this study differs slightly from\nthe MS relationship derived by \\cite{Peng+10}, who instead used aperture-corrected SFRs.\nThe main effect of using SFRs that are not corrected for the SDSS aperture is a downward shift\nof the MS relation by $\\rm\\Delta log(SFR)=-0.4$~dex. This shift was estimated by selecting, in our sample,\ngalaxies with $0.02<z<0.085$ (to match the redshift range of \\citealt{Peng+10}) and $\\rm9.0<log(M_{*}[M_{\\odot}])<11.0$\n(i.e. the stellar mass range where the mean relationship between log(SFR) and log(M$_*$) is linear) and by fitting\nthe mean trend between log(SFR) and log(M$_*$) with a linear relationship, whose slope was constrained to be the\nsame as \\cite{Peng+10}.\nHowever, we stress that the aim of this work is not to provide\na ``general'' fit to the local MS relation of star-forming galaxies, and that \nthe MS relationship shown in Fig.~\\ref{fig:grid_sf}\nshould only be used as a reference for this galaxy sample.\nWe refer to the works by \\cite{Peng+10,Schreiber+15} and \\cite{Gavazzi+15}\nfor more detailed discussion about the MS of star forming galaxies.\n\nPrior to stacking, the galaxy spectra in each bin are de-reddened and normalised to their\nextinction-corrected H$\\beta$ line flux, which is related to the star formation\nrate in the galaxy. The reddening $E(B-V)$ is estimated from the observed\nH$\\alpha$-to-H$\\beta$ flux ratio, by using the Galactic extinction curve\nas described in \\cite{CCM89} and by assuming $R_V=A_V/E(B-V)=3.1$.\nThe spectra are then shifted to the rest-frame by using the redshifts provided by the Princeton-1D spectroscopic \npipeline\\footnote{These are heliocentric redshifts \nderived from a combination of stellar absorption lines and nebular emission lines. For additional information we refer the reader to D. Schlegel's Princeton/MIT SDSS\nSpectroscopy webpage (\\texttt{http://spectro.princeton.edu}) and to \\cite{Bolton+12}.}\nand contextually re-binned\nby using a technique based on ``Drizzle'', the method\nfor linear reconstruction of under-sampled images \\citep{Fruchter+Hook02}.\nThe drizzling consists in mapping the original redshifted SDSS spectrum into\na rest-frame pixel grid (the output spectrum) by taking into account \ntheir different pixel sizes and relative shift, as sketched in Fig.~\\ref{fig:drizzling}. \nIn practice, the flux contained in the input pixel is\naveraged into the output pixel with a weight that is proportional to the area of\noverlap between the two pixels.\nThe resulting spectra have a wavelength separation of 0.8 \\AA{} pixel$^{-1}$, i.e.\nslightly finer than the original SDSS spectra.\nThe rest-frame galaxy spectra in each bin are finally averaged together to produce a\nsingle composite spectrum (the final stack), which is then normalised to its mean.\n\n\n\\subsection{Stellar subtraction}\\label{sec:stellar_sub}\n\n\\begin{figure*}[tbp]\n\\centering\n    \\includegraphics[width=0.49\\columnwidth,angle=90]{consub_range_oiii_id1.ps}\\quad\t\n    \\includegraphics[width=0.49\\columnwidth,angle=90]{consub_range_oiii_id2.ps}\\\\\n    \\vspace{0.8cm} \n    \\includegraphics[width=0.49\\columnwidth,angle=90]{consub_range_ha_id1.ps}\\quad\n    \\includegraphics[width=0.49\\columnwidth,angle=90]{consub_range_ha_id2.ps}\\\\\n  \\vspace{0.2cm} \n     \\caption{Stellar continuum fit and subtraction over two wavelength ranges including the \n\t[OIII]$\\lambda5007$ emission line ({\\it top panels}) and the H$\\alpha$+[NII] emission lines ({\\it bottom panels}), performed\n\tfor two galaxy stacks: ID=-2.0\\_8.5 ({\\it left}) and ID=0.5\\_11.5 ({\\it right}). \n     In each plot, the upper panel shows the stacked spectrum (black) and\n     the best fit to the stellar continuum (blue), while the lower panel shows the residual\n     spectrum. The red shaded regions mark the\n     spectral windows containing nebular features and therefore masked from the stellar continuum fit.}\n   \\label{fig:consub}\n\\end{figure*}\n\n\nThe subtraction of the stellar continuum emission from the stacked spectra\nis of crucial importance for this study, which is aimed at\ndetecting faint wings of nebular emission lines. For the purpose of stellar subtraction, we\nselect as stellar templates a large set of \nsynthetic spectra of single stellar populations (SSPs) computed with \nthe P\\'EGASE-HR v3.0 code\\footnote{\\texttt{http://www2.iap.fr/pegase/pegasehr/}} \\citep{LeBorgne+04}, \nwith both low metallicities\n($\\mathcal{Z}=0.004$) and solar metallicities ($\\mathcal{Z}=0.02$). The P\\'EGASE-HR spectral templates cover\nthe wavelength range $\\lambda\\in[4000, 6800]$~\\AA{}, with a spectral resolving power of\n$R=10,000$ at $\\lambda= 5500$~\\AA{}, and are computed for a wide range of ages\n(from 10 Myr to 2 Gyr), by assuming a Salpeter initial mass function (IMF, \\citealt{Salpeter55}).\n\nWe fit the P\\'EGASE-HR templates to the nebular line-free regions of the composite galaxy spectra by using\nthe IDL implementation of the penalised pixel-fitting (pPXF) method developed by \\cite{Cappellari+Emsellem04}.\nThe stellar continuum fitting and subtraction is performed in two wavelength\nranges, i.e. $\\lambda\\in[4800, 5100]$~\\AA{} and \n $\\lambda\\in[6200, 6790]$~\\AA{}, selected to include the [OIII]$\\lambda$5007\n and the H$\\alpha$ +[NII]$\\lambda\\lambda$6548,6583 nebular emission lines,\n which are the targets of this study. \nThe nebular emission lines and ISM absorption features are masked from the \nstellar fit to prevent it from being affected by non-stellar features.\nWhen the fit is provided with a large enough number of stellar features in the non-masked portion\nof the spectrum (which is always true in the spectral region we are interested in),\nthis procedure can accurately determine the stellar contamination under the masked \nnebular lines.\nFigure~\\ref{fig:consub} shows the stellar continuum fit and subtraction\nperformed for two different stacks. We note that the pPXF procedure, \n together with the high resolution P\\'EGASE-HR templates, produces an excellent fit\nto the stellar continuum underlying the nebular features in the galaxy stacks.\n\n\n\\subsection{SDSS spectral instrumental profile}\\label{sec:instr_prof}\n\n\\begin{figure}[tbp]\n\\centering\n    \\includegraphics[clip=true,trim=1.2cm 2cm 0cm 3cm,angle=90,width=\\columnwidth]{instr_prof_tot.ps}\\\\\n     \\caption{Instrumental profile of the SDSS spectrographs, estimated \n     from bright, non-blended emission lines in the arc lamp images, selected within the wavelength range of interest for this study\n     (i.e. HgI $\\lambda$5460.753~\\AA{} for the blue cameras and NeI $\\lambda$6598.953~\\AA{} for the red cameras). \n     For each camera (blue/red) of the two spectrographs (1/2), we overplotted\n     ten representative profiles from as many different frames (corresponding to different plates) obtained by averaging the arc lamp spectra\n     over all 320 fibres. The black solid line corresponds to the mean profile.     \n     The inset highlights the presence of low-level instrumental wings (corresponding to $\\lesssim3/1000$ of the peak), \n     which are more prominent for the red cameras.\n     }\n   \\label{fig:res}\n\\end{figure}\n\nOur investigation of the kinematics of the ionised gas in local star forming galaxies, as traced by the [OIII]$\\lambda$5007\nand H$\\alpha$+[NII]$\\lambda\\lambda$6548,6583 nebular emission lines, is aimed at finding broad wings\nof the LoSVD of the ionised gas that may be signature of outflows. \nThis is done by comparing, in each galaxy stack, the LoSVD of the gas with the LoSVD of the stars.\nAs it will be explained in $\\S$~\\ref{sec:losvd_stars}, the LoSVD of the stars is derived by fitting the stellar\ncontinuum around $\\lambda=5500$~\\AA{}, i.e. in a spectral region where the stellar fit\nproduces the best results thanks to the large number of stellar absorption lines and the scarcity of nebular (ISM) features.\nHowever, in order to extract the real kinematics of stars and gas from the observed line profiles (either from\nthe nebular emission lines, in the case of the gas, or from the stellar features seen in absorption, in the case of the stars),\nthe LoSVDs of gas and stars must be deconvolved from the instrumental spectral profile. \nTherefore, it is of primary importance for our study to determine the instrumental profile of the SDSS spectrographs.\n\nThe presence of scattered light in the spectrometer may affect the spectral \ninstrumental profile, resulting in extended wings. For the purpose of our investigation, we use\nthe arc lamp calibration spectra to retrieve and \nanalyse the spectral instrumental profile of \nthe original SDSS spectrographs (adopted for SDSS-II). \nThe average SDSS instrumental profile profile, shown in Fig.~\\ref{fig:res}, is impressively clean from wings down to\n$\\lesssim3/1000$ of the peak, where some low-level instrumental wings start to appear. This effect is however negligible for our study, since it clearly cannot\naccount for the much stronger broad (and asymmetric) line wings that we detect in our galaxy stacks, as it will be shown in $\\S$~\\ref{sec:results}.\n\n\\cite{Smee+13} analyse, in their Figure 35, the spectral resolving power ($R(\\lambda) = \\lambda/(2.35*\\sigma_{\\lambda})$) of \nthe original SDSS spectrographs as a function of wavelength. The resolving power of SDSS is quite difficult to constrain \nbetween $\\lambda=5000$~\\AA{} and $\\lambda=6000$~\\AA{}, because in this spectral region $R$ does not depend monotonically on wavelength,\ndue to the transition from the blue to the red camera of the spectrographs (and some overlap between the two). In this \nstudy we adopt $R=1850$ (corresponding to ${\\rm \\sigma_v = 69~km~s^{-1}}$), which\nis the average spectral resolving power inferred from the arc lamp images (Figure~\\ref{fig:res}) and \nis on the lower side of (but still well within) the nominal range quoted in the literature for the SDSS spectrographs\n (i.e. $R\\in[1800, 2000]$).\n\n\\subsection{The LoSVD of the stars}\\label{sec:losvd_stars}\n\n\\begin{figure*}[tbp]\n\t\\centering\n    \\includegraphics[width=1.4\\columnwidth]{appendixB.eps}\\\\\n   \\caption{Stellar continuum fit over the range \n   \t\t${\\rm \\lambda \\in [5250, 5550]~\\AA{}}$ ({\\it left}) and resulting stellar LoSVD \n   \t\t({\\it right}) derived for two galaxy stacks, i.e. $\\rm ID=-0.5\\_11.0$ ({\\it panel a}) \n\t\tand $\\rm ID=-1.5\\_9.5$ ({\\it panel b}). \n\t\tIn the left panels, the stacked spectrum is plotted in black, and the best fit to \n\t\tthe stellar continuum is in blue. \n\t\tThe red dashed regions mark the spectral windows masked from the stellar\n\t\tcontinuum fit because of the presence of nebular features.\n\t\tIn the right panels, the \n\t\tred dashed line indicates the LoSVD profile obtained\n\t\tby using, in the pPXF procedure, a simple Gaussian function to model the stellar features,\n\t\twhile the blue solid line shows the stellar LoSVD profile obtained by allowing the use of Hermite polynomials\n\t\tto account for possible asymmetries of \n\t\tthe stellar absorption features \\citep{Cappellari+Emsellem04}.\n\t\tThe stellar LoSVD obtained for the stack $\\rm ID=-0.5\\_11.0$ shows a clear blue asymmetry.\n\t\tThe fit is excellent (${\\chi_{\\rm red}^2}$ = 0.8) for both stacks.}\n   \\label{fig:appendixB}\n\\end{figure*}\n\nThe pPXF method developed by \\cite{Cappellari+Emsellem04} allows us not only to\naccurately fit the stellar continuum and subtract it from\nthe stacked spectra of galaxies, but also to extract the stellar kinematics.\nThe pPXF procedure adopts a Gauss-Hermite parametrisation \nfor the stellar line-of-sight velocity distributions, which accounts for\npossible asymmetries in the stellar absorption line profiles.\n\nTo infer the stellar LoSVDs, we first convolve the stellar templates (i.e. the P\\'EGASE-HR synthetic spectra)\nwith the SDSS instrumental spectral profile obtained in $\\S$~\\ref{sec:instr_prof}. When performing\nthe stellar continuum fit by using these stellar templates (i.e. the ones convolved with the instrumental profile), the pPXF\nprocedure yields the ``real'' stellar LoSVD, i.e. the stellar LoSVD deconvolved from the instrumental profile.\nAs already mentioned in $\\S$~\\ref{sec:instr_prof}, in order to extract the stellar kinematics, it is preferable\nto perform the continuum fitting around $\\lambda\\sim5500$~\\AA{}, because this spectral region is abundant in stellar absorption\nfeatures and relatively free of nebular emission lines. For this reason, to infer the stellar LoSVDs, we fit the stellar continuum\nin wavelength ranges selected between $\\lambda=5100$~\\AA{} and $\\lambda=5850$~\\AA{} or \nbetween $\\lambda=6050$~\\AA{} and $\\lambda=6250$~\\AA{}. The range $\\lambda\\in[5850, 6050]$~\\AA{} is avoided because\nof the presence of the NaID $\\lambda\\lambda$5890,5896~\\AA{} resonance absorption doublet, which is contaminated by the galaxy ISM.\n\nAn example of continuum fitting aimed at extracting the stellar kinematics is reported in Fig.~\\ref{fig:appendixB} for two different galaxy stacks,\ni.e. $\\rm ID=-0.5\\_11.0$ and $\\rm ID=-1.5\\_9.5$. We note that the $\\rm ID=-0.5\\_11.0$ stack \nshows a significant asymmetry in its stellar LoSVD. The presence of\nasymmetries in the stellar LoSVDs has been evidenced also in \nother stacks and will be discussed \nin $\\S$~\\ref{sec:asym}.\n\n\n\\subsection{The LoSVD of the ionised gas}\\label{sec:losvd_fit}\n\n\\begin{figure*}[tbp]\n\t\\centering\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_oiii_5007_check_v_-1.5_8.0.ps}\\quad\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_ha_check_v_-1.5_8.0.ps}\\\\\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_oiii_5007_check_v_-1.0_10.5.ps}\\quad\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_ha_check_v_-1.0_10.5.ps}\\\\\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_oiii_5007_check_v_0.5_8.5.ps}\\quad\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_ha_check_v_0.5_8.5.ps}\\\\\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_oiii_5007_check_v_2.0_11.0.ps}\\quad\n    \\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_ha_check_v_2.0_11.0.ps}\\\\\n    \\caption{Examples of spectral fits to the [OIII]$\\lambda$5007 ({\\it left column}) and H$\\alpha$+[NII] ({\\it right column}) emission line\n     \t\tprofiles for four representative galaxy bins with different SFR and M$_*$. From top to bottom: ID=-1.5\\,8.0 (low SFR and low M$_*$),\n\t\tID=-1.0\\,10.5 (low SFR and high M$_*$), ID=0.5\\,8.5 (high SFR and low M$_*$), and ID=2.0\\,11.0 (high SFR and high M$_*$).\n\t\tIn each plot, the {\\it left} panel shows the fit to the data (solid curves, the total fit is in blue, the multiple Gaussian components in a \n\t\tlighter shade of blue). For comparison, we have overplotted to the data the average SDSS instrumental resolution profile\n\t\t(magenta dashed curve, from Fig.~\\ref{fig:res}). In the {\\it right} panel of each plot we show the final LoSVD of \n\t\tthe ionised gas resulting from the fit, hence deconvolved from the SDSS instrumental profile (details in $\\S$~\\ref{sec:losvd_fit}).\n\t\t}\n   \\label{fig:fit_1}\n\\end{figure*}\n\n\\begin{figure*}[tbp]\n\t\\centering\n    \t\\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_oiii_5007_check_v_0.0_10.5.ps}\\quad\n    \t\\includegraphics[clip=true,trim=1.6cm 2.cm 0.2cm 3cm,angle=90,width=\\columnwidth]{fit_ha_check_v_0.0_10.5.ps}\\\\\n     \\caption{Same as Fig.~\\ref{fig:fit_1} but for a typical bin on the MS, with intermediate SFR and M$_*$  (ID=0.0\\,10.5).}\n   \\label{fig:fit_2}\n\\end{figure*}\n\nTo infer the LoSVD of the ionised gas we fit, for each stack, the \n[OIII]$\\lambda$5007, H$\\alpha$ and [NII]$\\lambda\\lambda$6548,6583 emission lines\nwith a function that results from the convolution\nof the SDSS instrumental profile, $\\mathcal{R}(v)$, with another function $\\mathcal{L}(v)$, which by\ndefinition corresponds to the ``real'' LoSVD of ionised gas. \nTo account for potential broad wings of the LoSVD, possibly tracing\noutflows of ionised gas, $\\mathcal{L}(v)$ is parametrised by the sum of\nthree Gaussians, $l_k(v)$ ($k=$1,2,3), each centred at a velocity $v_{0,k}$, with \narea $a_k$ and standard deviation $\\sigma_k$, i.e. \n\n", "index": 1, "text": "\\begin{equation}\\label{eq:losvd_formula}\n\\mathcal{L}(v) = \\sum_{k=1}^{3}  l_{k} (v) = \\sum_{k=1}^{3} a_k\\,n_{k}\\,e^{-(v-v_{0,k})^2/2\\sigma_k^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}(v)=\\sum_{k=1}^{3}l_{k}(v)=\\sum_{k=1}^{3}a_{k}\\,n_{k}\\,e^{-(v-v_{0,%&#10;k})^{2}/2\\sigma_{k}^{2}},\" display=\"block\"><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>l</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><mpadded width=\"+1.7pt\"><msub><mi>a</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>n</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>v</mi><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><mn>2</mn></mrow><mo>⁢</mo><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup></mrow></mrow></msup></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwhere we have used the distributive property of the convolution (indicated by the \nsymbol $\\ast$) and we have defined $f_{k} (v) \\equiv  l_{k} (v) \\ast \\mathcal{R}(v)$.\nAs a result, since both $l_{k}(v)$ and $\\mathcal{R}(v)$ are Gaussians, $f_{k}(v)$ has the form:\n\n", "itemtype": "equation", "pos": 42130, "prevtext": "\nwhere $n_{k}= 1/\\sqrt{2\\pi \\sigma_{k}^2}$ is the normalisation factor.\nTherefore, the ``observed'' LoSVD, $F(v)$, resulting from the convolution of\nthe ``real'' LoSVD ($\\mathcal{L}(v)$) and the SDSS spectral resolution profile \n($\\mathcal{R}(v)$), is given by:\n\n", "index": 3, "text": "\\begin{equation}\n{F(v) = \\mathcal{L}(v) \\ast \\mathcal{R}(v) =  \\sum_{k=1}^{3} l_{k} (v) \\ast \\mathcal{R}(v) =  \\sum_{k=1}^{3} f_{k} (v)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{F(v)=\\mathcal{L}(v)\\ast\\mathcal{R}(v)=\\sum_{k=1}^{3}l_{k}(v)\\ast\\mathcal{R}(v%&#10;)=\\sum_{k=1}^{3}f_{k}(v)},\" display=\"block\"><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∗</mo><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><mrow><mrow><msub><mi>l</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∗</mo><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>f</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwith ${N_{k}}= 1/\\sqrt{2\\pi (\\sigma_{k}^2+\\sigma_R^2)}$.\n\n An emission line centred at a velocity ${v_i}$, \ncorresponding to a central wavelength $\\lambda_i$, \n will be fitted with a final function of the form:\n\n", "itemtype": "equation", "pos": 42548, "prevtext": "\nwhere we have used the distributive property of the convolution (indicated by the \nsymbol $\\ast$) and we have defined $f_{k} (v) \\equiv  l_{k} (v) \\ast \\mathcal{R}(v)$.\nAs a result, since both $l_{k}(v)$ and $\\mathcal{R}(v)$ are Gaussians, $f_{k}(v)$ has the form:\n\n", "index": 5, "text": "\\begin{equation}\nf_{k} (v) = a_k\\,N_{k} \\,e^{-(v-v_{0,k})^2/2(\\sigma_k^2+\\sigma_R^2)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"f_{k}(v)=a_{k}\\,N_{k}\\,e^{-(v-v_{0,k})^{2}/2(\\sigma_{k}^{2}+\\sigma_{R}^{2})},\" display=\"block\"><mrow><mrow><mrow><msub><mi>f</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>a</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>v</mi><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>/</mo><mn>2</mn></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>R</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nthat is, the observed LoSVD, $F(v)$, convolved with a Dirac delta function centred at the vacuum wavelength\nof the line ${\\lambda_i}$\nand whose integral ${\\varphi_i}$ is proportional to the line flux.\nFollowing Eq.~\\ref{eq:function_fit}, the final function ${\\mathcal{F}_{[OIII]}(\\lambda)}$ that we\nemploy to fit\nthe [OIII]$\\lambda$5007 emission line profile in the composite spectra is:\n\n", "itemtype": "equation", "pos": 42861, "prevtext": "\nwith ${N_{k}}= 1/\\sqrt{2\\pi (\\sigma_{k}^2+\\sigma_R^2)}$.\n\n An emission line centred at a velocity ${v_i}$, \ncorresponding to a central wavelength $\\lambda_i$, \n will be fitted with a final function of the form:\n\n", "index": 7, "text": "\\begin{equation}\n{\\mathcal{F}_i(\\lambda) = F(v) \\ast [\\varphi_i~\\delta(v-v_i)] = F(v)  \\ast \\Biggl[\\varphi_i~\\delta \\Bigl( c\\frac{\\lambda-\\lambda_i}{\\lambda_i} \\Bigr) \\Biggl] },\n\\label{eq:function_fit}\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"{\\mathcal{F}_{i}(\\lambda)=F(v)\\ast[\\varphi_{i}\\leavevmode\\nobreak\\ \\delta(v-v_%&#10;{i})]=F(v)\\ast\\Biggl{[}\\varphi_{i}\\leavevmode\\nobreak\\ \\delta\\Bigl{(}c\\frac{%&#10;\\lambda-\\lambda_{i}}{\\lambda_{i}}\\Bigr{)}\\Biggl{]}},\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mi>i</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow><mo>∗</mo><mrow><mo stretchy=\"false\">[</mo><mpadded width=\"+5pt\"><msub><mi>φ</mi><mi>i</mi></msub></mpadded><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo>-</mo><msub><mi>v</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">]</mo></mrow><mo>=</mo><mi>F</mi><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow><mo>∗</mo><mrow><mo maxsize=\"260%\" minsize=\"260%\">[</mo><mpadded width=\"+5pt\"><msub><mi>φ</mi><mi>i</mi></msub></mpadded><mi>δ</mi><mrow><mo maxsize=\"160%\" minsize=\"160%\">(</mo><mi>c</mi><mfrac><mrow><mi>λ</mi><mo>-</mo><msub><mi>λ</mi><mi>i</mi></msub></mrow><msub><mi>λ</mi><mi>i</mi></msub></mfrac><mo maxsize=\"160%\" minsize=\"160%\">)</mo></mrow><mrow><mo maxsize=\"260%\" minsize=\"260%\">]</mo><mo>,</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nSimilarly, we fit the H$\\alpha$+[NII] emission lines with a function of the form:\n\n", "itemtype": "equation", "pos": 43465, "prevtext": "\nthat is, the observed LoSVD, $F(v)$, convolved with a Dirac delta function centred at the vacuum wavelength\nof the line ${\\lambda_i}$\nand whose integral ${\\varphi_i}$ is proportional to the line flux.\nFollowing Eq.~\\ref{eq:function_fit}, the final function ${\\mathcal{F}_{[OIII]}(\\lambda)}$ that we\nemploy to fit\nthe [OIII]$\\lambda$5007 emission line profile in the composite spectra is:\n\n", "index": 9, "text": "\\begin{multline}\n{\\mathcal{F}_{[OIII]}(\\lambda)} = \\\\ {\\varphi_{[OIII]} \\sum_{k=1}^{3} a_k N_k\\,e^{-\\bigl[\\frac{c(\\lambda-\\lambda_{[OIII]})}{\\lambda_{[OIII]}}-v_{0,k}\\bigr]^2\\bigl/2\\bigl(\\sigma_k^2+\\sigma_R^2\\bigr)}}.\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\mathcal{F}_{[OIII]}(\\lambda)}=\\\\&#10;\\displaystyle{\\varphi_{[OIII]}\\sum_{k=1}^{3}a_{k}N_{k}\\,e^{-\\bigl{[}\\frac{c(%&#10;\\lambda-\\lambda_{[OIII]})}{\\lambda_{[OIII]}}-v_{0,k}\\bigr{]}^{2}\\bigl{/}2\\bigl%&#10;{(}\\sigma_{k}^{2}+\\sigma_{R}^{2}\\bigr{)}}}.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>O</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><msub><mi>φ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>O</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>a</mi><mi>k</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo maxsize=\"171%\" minsize=\"171%\">[</mo><mrow><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>λ</mi><mo>-</mo><msub><mi>λ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>O</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>O</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub></mfrac><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo maxsize=\"171%\" minsize=\"171%\">]</mo></mrow><mn>2</mn></msup><mo mathsize=\"171%\" stretchy=\"false\">/</mo><mn>2</mn></mrow><mo>⁢</mo><mrow><mo maxsize=\"171%\" minsize=\"171%\">(</mo><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>R</mi><mn>2</mn></msubsup></mrow><mo maxsize=\"171%\" minsize=\"171%\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nIn this equation, [NII] indicates the bluest line of the [NII] doublet, i.e. the [NII]$\\lambda$6548 line,\nand $\\varrho$ denotes the theoretical ratio between the rest-frame vacuum wavelengths of the [NII]$\\lambda$6548 and\n[NII]$\\lambda$6583 lines as reported in the NIST database.\n\nThe kinematics (velocity and widths) of all components fitting the H$\\alpha$+[NII]\ncomplex is set to be equal for the three transitions. Such a constrained approach is necessary \nto separate the partially blended H$\\alpha$ and\n[NII] emission lines and it improves the quality and reliability of the fit, as pointed out by\n\\cite{Westmoquette+12}. Moreover this method is justified by the fact that in star forming galaxies\nand in absence of strong shocks, the H$\\alpha$ and [NII] emission lines arise from adjacent regions.\n\nThe fit, whose input parameters are only the instrumental resolution (${\\sigma_R}$)\nand the (vacuum) central wavelengths of the different transitions (${\\lambda_i}$), provides\nus with the relative line fluxes ${\\varphi_i}$ and with other nine parameters, i.e.\n$v_{0,k}$, $\\sigma_k$ and\n$a_k$ (with the index ${k = 1,2,3}$ denoting the three Gaussian components \nused to model the observed LoSVD) from which, using Eq.~\\ref{eq:losvd_formula}, we retrieve\n${\\mathcal{L}(v)}$, i.e. the real LoSVD of the ionised gas.\nFigures \\ref{fig:fit_1} and \\ref{fig:fit_2} show example fits to the [OIII]$\\lambda$5007 and \nH$\\alpha$+[NII] emission lines as well as the resulting LoSVDs, for five representative galaxy stacks,\nhaving different SFR and M$_*$ properties (in particular, low and high SFR, low and high M$_*$, and\nintermediate SFR and M$_*$). In Figs.~\\ref{fig:fit_1} and \\ref{fig:fit_2} \nwe also show for comparison, over-plotted to the observed spectral emission line profiles, the \naverage SDSS instrumental profile (from Fig.~\\ref{fig:res}), to show that the\nbroad asymmetric wings we detected in a few of the stacks (e.g. ID=2.0\\,11.0) are not instrumental.\n\n\n\n\\section{Results}\\label{sec:results}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_oiii_5007_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\t[OIII]$\\lambda$5007 emission line. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_oiii_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_ha_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\tH$\\alpha$+[NII] emission lines. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_ha_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_stars_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the stars. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_stars_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_oiii_5007_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\t[OIII]$\\lambda$5007 emission line. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_oiii_1}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_ha_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\tH$\\alpha$+[NII] emission lines. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_ha_1}\n\\end{figure*}\n\n\\begin{figure*}[p]\n   \\includegraphics[angle=90,height=0.40\\textheight]{plot_stars_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the stars. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_stars_1}\n\\end{figure*}\n\nIn this section we present the results of our analysis of the dynamical properties of ionised gas and stars\nbased on stacked SDSS spectra of local star-forming galaxies, aimed at identifying the presence of galactic outflows.\nThroughout the remainder of the paper and in the figures, for the sake of simplicity, we will replace ``[OIII]$\\lambda$5007'' and \n``H$\\alpha$+[NII]$\\lambda\\lambda$6548,6583'' with ``[OIII]'' and ``H$\\alpha$'', respectively.\nThe reader should however keep in mind that ``H$\\alpha$'' actually refers to the H$\\alpha$ and [NII] line complex {\\it as a whole}, \nsince the LoSVDs were derived by fitting the H$\\alpha$ and [NII] lines simultaneously, as explained in $\\S$~\\ref{sec:losvd_fit}.\nThe adopted strategy is briefly summarised in $\\S$~\\ref{sec:strategy}. In $\\S$~\\ref{sec:kinematics} we analyse the general properties\nof the LoSVDs of gas and stars; in $\\S$~\\ref{sec:asym} we study the presence of asymmetric wings in the LoSVD profiles and\nfinally in $\\S$~\\ref{sec:outflows} we discuss the outflow properties.\n\n\n\\subsection{The novelty of our approach}\\label{sec:strategy}\n\nBefore presenting our results,\nwe first shortly summarise what is new in our approach to the study of galactic outflows, \nby emphasizing the advantages and strengths of this method.\nFor the first time, we study galactic outflows by directly comparing the \nLoSVD of the ionised gas (as traced by the [OIII], H$\\alpha$ and [NII] nebular emission lines) with the\nLoSVD of the stars. This has never been attempted\nbefore, primarily because previous studies could not reach the signal-to-noise needed\nto extract the stellar LoSVDs from the data, and (if any) they just relied on the comparison between\nthe velocity dispersion of gas and stars. \n\nFurthermore, this technique holds the potential of detecting the signature\nof outflows in sources spanning a wide dynamic range of physical parameters as shown in Fig.~\\ref{fig:grid_sf}, and\nin particular in faint, low mass (i.e. ${\\rm M_{*}}$ as low as ${\\rm \\sim 2\\times 10^{7}~M_{\\odot}}$) \nand moderately star-forming (i.e. SFR as low as ${\\rm \\sim 2\\times 10^{-3}~M_{\\odot}~yr^{-1}}$) galaxies. \nThe main limitations when probing outflows in galaxies having such low stellar masses and low star formation rates\nwith SDSS spectroscopy\nare both the low signal-to-noise and low spectral resolution of the associated spectra. \nIn this study, however, we overcome both these limitations. Firstly, we use the\nstacking technique to significantly improve the signal-to-noise in the\nspectra ($\\S$~\\ref{sec:stacking}). Secondly, we minimise problems associated with the limited spectral resolution \nby deconvolving the ``real'' line-of-sight velocity distribution of gas and stars from the instrumental spectral profile\nin the observed resolution-limited composite spectra (as described in\n$\\S$~\\ref{sec:instr_prof}-$\\S$~\\ref{sec:losvd_fit}). This is \nmade possible thanks to the high signal-to-noise of the stacked spectra,\nespecially for those galaxy bins in which the observed line profiles are narrow (i.e. line widths are close to the \ninstrumental resolution).\nIn particular, since, in emission lines, \noutflows are traced by a broad \ncomponent superimposed on a narrow component, \nour deconvolution technique in principle allows us\nto detect such a broad component, provided it is broad enough, even if the bulk \nof the (narrow) emission line is not resolved. \n\n\\subsection{Properties of the kinematics of gas and stars}\\label{sec:kinematics}\n\\subsubsection*{LoSVD profiles}\n\nIn the following we analyse variations in the LoSVD profiles of (ionised) gas and stars\nas a function of stellar mass and star formation rate.\nWe stress that, since the galaxy spectra have been stacked in bins of ${\\rm M_{*}}$ and\nSFR, the trends with ${\\rm M_{*}}$ and SFR can be investigated {\\it independently},\nthus breaking the degeneracy between SFR and M$_*$ that holds for star forming galaxies on the MS.\nFor each stack, we adopt the velocity corresponding to the peak of the {\\it stellar} LoSVD \nas a reference zero velocity for the LoSVD of both the stars\nand the gas.\n\nFigures~\\ref{fig:losvd_oiii_2},  \\ref{fig:losvd_ha_2} and \\ref{fig:losvd_stars_2} show\nthe variations of the LoSVD profiles of gas and stars as a function of ${\\rm M_{*}}$ \nat a fixed SFR. The most obvious trend that emerges from these figures is \nthe increasing width of the LoSVDs of both gas and stars with stellar mass at a given\nSFR. \nThis is simply a consequence of the fact that, {\\it to first order},\nthe velocity dispersion of both gas and stars primarily traces \nvirial motions that are related to the dynamical mass of the galaxy. \nThe dynamical mass of a galaxy is, to first order, proportional\nto its stellar mass, although also gas and dust contribute to it. \nTherefore, broader LoSVDs are expected at higher stellar masses,\nsimply because higher stellar masses are generally associated with higher dynamical masses.\nA comparison between Fig.~\\ref{fig:losvd_oiii_2} and \\ref{fig:losvd_ha_2} shows that\nthe [OIII] and the H$\\alpha$ LoSVD profiles are overall consistent. \n\nThe stellar LoSVDs in Fig.~\\ref{fig:losvd_stars_2} show some interesting properties:\nthey are overall quite broad, and have wings that extend up to several hundreds of\nkm~s$^{-1}$ in velocity, similar to the ionised gas traced by [OIII] and H$\\alpha$, in particular\nfor bins with ${\\rm -0.5\\leq log(SFR [M_{\\odot}~yr^{-1}])\\leq 1.5}$. This is in\npart a consequence of the velocity tail of the stellar distribution, but additional effects may be present,\nand these will be discussed in detail later in this section.\n\nFigures~\\ref{fig:losvd_oiii_1}, \\ref{fig:losvd_ha_1} and \\ref{fig:losvd_stars_1} are complementary to\nFigs.~\\ref{fig:losvd_oiii_2},  \\ref{fig:losvd_ha_2} and \\ref{fig:losvd_stars_2}: they show the\ntrends of LoSVD profiles of gas and stars as a function of SFR for fixed M$_*$.\nWe first focus on Figs.~\\ref{fig:losvd_oiii_1} and  \\ref{fig:losvd_ha_1}: at a given stellar mass,\nthe LoSVDs of [OIII]- and H$\\alpha$-emitting gas broaden at higher SFRs.\nSuch broadening is particularly evident for the ``wings'' of the line-of-sight velocity distributions, especially\nat stellar masses between ${\\rm 9.0\\leq log(M_{*} [M_{\\odot}] )\\leq 11.0}$ for the [OIII] LoSVDs, and between\n${\\rm 9.0 \\leq log(M_{*} [M_{\\odot}])\\leq 10.0}$ for the H$\\alpha$ LoSVDs. As we will discuss later in\nthis section, the overall broadening of the LoSVDs of ionised gas observed with increasing SFR at fixed M$_*$\ncould trace various stellar feedback-related phenomena, such as turbulence in the disk gas and\noutflows.\n\nA dependency of the width of the LoSVD on the SFR is also seen in the stars (Figure~\\ref{fig:losvd_stars_1}),\nalthough in a smaller measure and especially at lower stellar masses (i.e. ${\\rm log(M_{*} [M_{\\odot}])\\leq10.5}$) than, for example, in \nthe [OIII] LoSVDs (Figure~\\ref{fig:losvd_oiii_1}).  \nIn the case of the stars, the LoSVD broadening \nwith SFR (for constant ${\\rm M_{*}}$) may be\nassociated with an increase of the total dynamical mass of the systems. In particular, \nthe increase in width of the stellar LoSVDs is possibly tracing an increase of the total\ngas content in galaxies with higher SFRs, which is in turn a consequence of\nthe Schmidt--Kennicutt relation between SFR and total gas mass surface density\n\\citep{Schmidt1959, Kennicutt98}. However, this trend might be affected by a\npotential observational bias: the average projected size of galaxies decreases\nfor higher SFRs (higher SFRs correspond, on average, to more distant sources because\nof selection effects), and this may have an effect on the stellar velocity dispersion measured \nwithin the SDSS fibre.\n\nThe line-of-sight velocity distributions of [OIII] and H$\\alpha$ (Figures~\\ref{fig:losvd_oiii_2},  \n\\ref{fig:losvd_ha_2}, \\ref{fig:losvd_oiii_1}, and \\ref{fig:losvd_ha_1})\nexhibit asymmetries between the blue and the red side of the profiles. By eye inspection, such asymmetries\nappear to depend on the SFR, but a more quantitative analysis will be presented\n in $\\S$~\\ref{sec:asym}. We note that,\nquite surprisingly, also the stellar LoSVDs in Fig.~\\ref{fig:losvd_stars_2} and\n\\ref{fig:losvd_stars_1} appear, although to a smaller extent, asymmetrical; such an effect can be\nbest appreciated in bins with ${\\rm log(SFR~[M_{\\odot} yr^{-1}]) =0.5}$ and\n${\\rm log(SFR~[M_{\\odot} yr^{-1}]) =1.5}$ (Figure~\\ref{fig:losvd_stars_2}). \nAsymmetries of the LoSVDs of gas and stars will be investigated in $\\S$~\\ref{sec:asym}.\n\n\\subsubsection*{LoSVD parameters: $\\sigma$ and percentile velocities}\n\nThe next step is to extrapolate physically meaningful quantities from the\nLoSVDs of stars and gas, and investigate the relationships with galaxy properties.\nErrors on the LoSVD parameters are obtained using the bootstrap technique \\citep{Efron79}.\nThe bootstrap method consists in randomly resampling (with replacements) our\ngalaxy stacks, by generating, for each bin, resampled stacks with sample size (here indicated with $S$) equal to the original stack.\nMore specifically, for each bin in the $\\rm M_{*}-SFR$ parameter space (Figure~\\ref{fig:grid_sf}),\nwe produce $N\\gg1$ resampled stacks, each of which is obtained by randomly \nselecting $S$ galaxy spectra from the original sample of $S$ spectra included in that bin \nand by co-adding them to produce a new ``resampled'' stack. \nThe difference from the original stack is that, in the resampled stacks, the $S$ spectra to be co-added together are\nextracted randomly from the parent sample of $S$ galaxy spectra by allowing repetitions, hence the spectrum of a given\ngalaxy can be selected either once, or more than once, or never. \nAfter producing $N$ resampled stacks for each bin, we perform for each of them \nthe stellar continuum subtraction and the [OIII] and H$\\alpha$+[NII] line\nfitting, exactly in the same way as for the original stacks (see $\\S$~\\ref{sec:stellar_sub}, $\\S$~\\ref{sec:losvd_stars} and $\\S$~\\ref{sec:losvd_fit}),\nin order to retrieve the LoSVDs of stars and gas.\nTherefore, the bootstrap provides, for each bin and for a given LoSVD\nparameter of interest ($p_i$), a distribution of $N$ values. \nThe variance of this distribution of $N$ parameters\n(following on from the variance of the galaxy samples) is used to estimate the error on the measure of $p_i$.\nThe choice of the number $N$ of resampled stacks for each bin is a compromise\nbetween statistics and computational effort. We set $N=10$ for the most crowded\nbins, i.e. those including $S\\geq10,000$ galaxy spectra, $N = 50$ for bins with\n$5,000 \\leq S < 10,000$, and $N = 100$ for the remaining ones, i.e. those\nwith less than 5,000 objects.\n\nThe simplest parameter to study is the line-of-sight velocity dispersion ($\\sigma$), given by:\n\n", "itemtype": "equation", "pos": 43780, "prevtext": "\nSimilarly, we fit the H$\\alpha$+[NII] emission lines with a function of the form:\n\n", "index": 11, "text": "\\begin{multline*}\n{\\mathcal{F}_{tot}(\\lambda) = \\mathcal{F}_{H\\alpha}(\\lambda)+\\mathcal{F}_{[NII]6548}(\\lambda)+\\mathcal{F}_{[NII]6583}(\\lambda)} = \n \\\\  {\\varphi_{H\\alpha}\\sum_{k=1}^{3} a_k N_k\\,e^{-\\bigl[\\frac{c(\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}-v_{0,k}\\bigr]^2\\bigl/2\\bigl(\\sigma_k^2+\\sigma_R^2\\bigr)}} + \\\\\n  {\\varphi_{[NII]}\\sum_{k=1}^{3} a_k N_k\\,e^{-\\bigl[\\frac{c(\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}} -  \\frac{c(\\lambda_{[NII]}-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}- v_{0,k}\\bigr]^2\\bigl/2\\bigl(\\sigma_k^2+\\sigma_R^2\\bigr)}} + \\\\\n   {3\\varphi_{[NII]}\\sum_{k=1}^{3} a_k N_k\\,e^{-\\bigl[\\frac{c(\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}} -  \\frac{c(\\varrho\\lambda_{[NII]}-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}- v_{0,k}\\bigr]^2\\bigl/2\\bigl(\\sigma_k^2+\\sigma_R^2\\bigr)}}.\n\\end{multline*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"p6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\mathcal{F}_{tot}(\\lambda)=\\mathcal{F}_{H\\alpha}(\\lambda)+%&#10;\\mathcal{F}_{[NII]6548}(\\lambda)+\\mathcal{F}_{[NII]6583}(\\lambda)}=\\\\&#10;\\displaystyle{\\varphi_{H\\alpha}\\sum_{k=1}^{3}a_{k}N_{k}\\,e^{-\\bigl{[}\\frac{c(%&#10;\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}-v_{0,k}\\bigr{]}^{2}\\bigl{/}2%&#10;\\bigl{(}\\sigma_{k}^{2}+\\sigma_{R}^{2}\\bigr{)}}}+\\\\&#10;\\displaystyle{\\varphi_{[NII]}\\sum_{k=1}^{3}a_{k}N_{k}\\,e^{-\\bigl{[}\\frac{c(%&#10;\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}-\\frac{c(\\lambda_{[NII]}-\\lambda%&#10;_{H\\alpha})}{\\lambda_{H\\alpha}}-v_{0,k}\\bigr{]}^{2}\\bigl{/}2\\bigl{(}\\sigma_{k}%&#10;^{2}+\\sigma_{R}^{2}\\bigr{)}}}+\\\\&#10;\\displaystyle{3\\varphi_{[NII]}\\sum_{k=1}^{3}a_{k}N_{k}\\,e^{-\\bigl{[}\\frac{c(%&#10;\\lambda-\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}-\\frac{c(\\varrho\\lambda_{[NII]}-%&#10;\\lambda_{H\\alpha})}{\\lambda_{H\\alpha}}-v_{0,k}\\bigr{]}^{2}\\bigl{/}2\\bigl{(}%&#10;\\sigma_{k}^{2}+\\sigma_{R}^{2}\\bigr{)}}}.\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mrow><mi>t</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>t</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mn>6548</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℱ</mi><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mn>6583</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mi/></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><msub><mi>φ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>a</mi><mi>k</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo maxsize=\"171%\" minsize=\"171%\">[</mo><mrow><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>λ</mi><mo>-</mo><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mfrac><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo maxsize=\"171%\" minsize=\"171%\">]</mo></mrow><mn>2</mn></msup><mo mathsize=\"171%\" stretchy=\"false\">/</mo><mn>2</mn></mrow><mo>⁢</mo><mrow><mo maxsize=\"171%\" minsize=\"171%\">(</mo><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>R</mi><mn>2</mn></msubsup></mrow><mo maxsize=\"171%\" minsize=\"171%\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow><mo>+</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><msub><mi>φ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>a</mi><mi>k</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo maxsize=\"171%\" minsize=\"171%\">[</mo><mrow><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>λ</mi><mo>-</mo><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mfrac><mo>-</mo><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>λ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub><mo>-</mo><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mfrac><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo maxsize=\"171%\" minsize=\"171%\">]</mo></mrow><mn>2</mn></msup><mo mathsize=\"171%\" stretchy=\"false\">/</mo><mn>2</mn></mrow><mo>⁢</mo><mrow><mo maxsize=\"171%\" minsize=\"171%\">(</mo><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>R</mi><mn>2</mn></msubsup></mrow><mo maxsize=\"171%\" minsize=\"171%\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow><mo>+</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mn>3</mn><mo>⁢</mo><msub><mi>φ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>a</mi><mi>k</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>N</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mrow><msup><mrow><mo maxsize=\"171%\" minsize=\"171%\">[</mo><mrow><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>λ</mi><mo>-</mo><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mfrac><mo>-</mo><mfrac><mrow><mi>c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ϱ</mi><mo>⁢</mo><msub><mi>λ</mi><mrow><mo stretchy=\"false\">[</mo><mrow><mi>N</mi><mo>⁢</mo><mi>I</mi><mo>⁢</mo><mi>I</mi></mrow><mo stretchy=\"false\">]</mo></mrow></msub></mrow><mo>-</mo><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>λ</mi><mrow><mi>H</mi><mo>⁢</mo><mi>α</mi></mrow></msub></mfrac><mo>-</mo><msub><mi>v</mi><mrow><mn>0</mn><mo>,</mo><mi>k</mi></mrow></msub></mrow><mo maxsize=\"171%\" minsize=\"171%\">]</mo></mrow><mn>2</mn></msup><mo mathsize=\"171%\" stretchy=\"false\">/</mo><mn>2</mn></mrow><mo>⁢</mo><mrow><mo maxsize=\"171%\" minsize=\"171%\">(</mo><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>R</mi><mn>2</mn></msubsup></mrow><mo maxsize=\"171%\" minsize=\"171%\">)</mo></mrow></mrow></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwhere the line-of-sight velocity distribution described by ${\\mathcal{L}(v)}$ is normalised\nsuch as ${\\int\\mathcal{L}(v) dv = 1}$, and $v_c$ is\nthe centroid of the distribution, i.e. ${v_c = \\int v~\\mathcal{L}(v) \\textit{d} v}$.\nThe relationships between $\\sigma$ (of both the ionised gas, as traced by [OIII] and H$\\alpha$ and the stars), and galaxy\nproperties such as SFR, M$_*$ and sSFR\n(sSFR = SFR/${\\rm M_{*}}$, i.e. star formation rate per stellar mass unit)\nare shown in Fig.~\\ref{fig:sigma}. \n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_oiii_sigmav_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_ha_sigmav_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_stars_sigmav_new.ps}\n   \\caption{Line-of-sight velocity dispersion of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). The errors were obtained by applying the bootstrap method, as explained\n\t\tin the text. The grey dashed lines in the third column mark the sSFR range corresponding to the MS\n\t\tof local star-forming galaxies between ${\\rm 9.0 \\leq log(M_{*} [M_{\\odot}]) \\leq 11.0}$.\n\t\tThe Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate\n\t\tstronger correlation) is reported in each plot, along with the corresponding two-sided p-value as \n\t\tgiven in parenthesis (if the p-value is $\\leq\\alpha$,\n\t\twhere $\\alpha=0.05$ is the level of significance, the observed correlation is statistically significant).\n\t\t}\n   \\label{fig:sigma}\n\\end{figure}\n\nFor each plot in Fig.~\\ref{fig:sigma}, \nwe calculated the non-parametric Spearman\nrank correlation parameter ($\\rho\\in(0,1)$\\footnote{Calculated by using the IDL function \\texttt{R\\_CORRELATE}.}) to test the hypothesis of correlation between\nthe line-of-sight velocity dispersion of gas and stars and the galaxy properties (SFR, M$_*$, sSFR). \nIn our case, non-parametric tests such as the Spearman rank test are more appropriate than the standard\nPearson correlation coefficient ($r$), since we are dealing\nwith binned data and the relationship between $\\sigma$ and galaxy properties (if any) could be non-linear. \nA high value of $\\rho$ (e.g., $\\rho\\gtrsim0.5$) combined with a low p-value ($\\leq\\alpha$, where $\\alpha$ is the level of significance, which we set\n$\\alpha=0.05$) indicates the presence of \na statistically significant correlation. In the calculation of the p-value, \nwe allow for both positive and negative correlations (``two-sided''). \nThe results of the Spearman rank test are reported in Fig.~\\ref{fig:sigma}.\n\nAs illustrated by the clean relationships in Fig.~\\ref{fig:sigma}, our method is particularly\neffective at uncovering general trends between the dynamical properties of gas and stars and the galaxy properties.\nMoreover, Fig.~\\ref{fig:sigma} allows us to appreciate some differences between the dynamical behaviour of ionised \ngas and stars as a function of SFR and M$_*$.\nIn absolute values, the velocity dispersions of gas and \nstars are roughly consistent, with\nthe bulk of the galaxy bins showing values in the range ${\\rm 40 \\lesssim \\sigma~[ km~s^{-1} ] \\lesssim 150}$.\nHowever, for the highest stellar mass bins, i.e. ${\\rm log(M_{*} [M_{\\odot}]) \\gtrsim 10.0}$, the velocity dispersions measured\nfor the stars are slightly larger than the ones measured for the gas, especially when using H$\\alpha$ as a gas tracer.\nThis small effect can be explained by the contribution of stellar bulges in more massive galaxies.\n\\cite{Gavazzi+15} have recently shown that $>40$\\% of isolated local star-forming galaxies with \nM$_*>10^{9.5}$~M$_{\\odot}$ host stellar bulges (without distinguishing between classical bulges and pseudo-bulges), whereas\nthe fraction of stellar bulges at  M$_*<10^{9.5}$~M$_{\\odot}$ is only $\\sim5$\\%.\nWhen a galaxy has a prominent stellar bulge, its stellar LoSVD probes both the galactic disk and the bulge, whereas the\nLoSVD of the ionised gas only traces the dynamics in the disk (and, possibly, a ionised outflow), \nwhich is more subject to projection effects than the bulge. In particular, disks viewed face-on contribute \nmuch less to the broadening of the LoSVD than edge-on disks. Therefore, it is possible that, by averaging \ntogether many spectra of massive galaxies with stellar\nbulges, observed from different viewing angles, the resulting line-of-sight velocity dispersions are slightly higher for the\nstars than for the gas, because of the additional contribution from the stellar bulge.\n\nBy inspecting the plots in the first column of Fig.~\\ref{fig:sigma},\nwe note that $\\sigma_{\\rm [OIII]}$ and $\\sigma_{\\rm H\\alpha}$ are tightly correlated ($\\rho > 0.9$) with the SFR, and the correlation\nholds both at low and high stellar masses. The line-of-sight velocity dispersion of the stars is \nalso correlated with the SFR, but more weakly than the gas ($\\rho=0.795$), and the $\\rm \\sigma_{stars}-SFR$ relationship \nflattens at ${\\rm log(M_{*} [M_{\\odot}])\\sim 10.5}$ ($\\rho=0.029$, p-value=0.957).\n\nThe steady increase of gas velocity dispersion with SFR observed in Fig.~\\ref{fig:sigma}\nmay trace a combination of various physical processes.\nSince feedback-related mechanisms should affect only the gas kinematics, leaving the motions of (evolved) \nstellar populations unperturbed, we can use \nthe stellar velocity dispersion as a reference to identify trends that are not related to feedback.\nThe positive correlation between $\\sigma_{\\rm stars}$ and SFR observed at low stellar masses\nmay be due to the presence of gas contributing to the dynamical mass, the gas being traced \nby the SFR via the S--K relation, and therefore it may be related \nto an increase of gas fraction (at fixed stellar mass). \nHowever other mechanisms may\nproduce a similar effect: in the first place, as already mentioned, \na possible anti-correlation\nbetween the projected size and the SFR in galaxies, in \nconjunction with the limited SDSS fibre aperture, may\naffect the observed stellar LoSVD.\nMoreover, mergers and galaxy interactions, whose fraction is expected\nto increase at higher SFRs, can also have an impact on the observed \nLoSVDs, due to the combined motions of overlapping disks\nor tidal motions of collision, as pointed out by \\cite{Rupke+Veilleux13} in their study of \nULIRGs. However, mergers \nare relatively unimportant in the local Universe: the local galaxy merger rate\nestimated using SDSS data is about 0.01 Gyr$^{-1}$ \\citep{Patton+Atfield08}. \nAssessing the relative importance of these different factors in\nproducing the observed trend of increasing $\\sigma_{\\rm stars}$\nwith SFR (at a given ${\\rm M_{*}}$) goes beyond the scope of this paper and requires\nspatially resolved observations. \nFor what the present study is concerned, these results suggest caution in interpreting\nthe observed broadening of the ionised gas LoSVDs with SFR as {\\it entirely} due to\nfeedback-related processes, since the effects described above (and affecting both stars and gas)\nmay be at work.\n\nMoreover, as mentioned above, outflows of ionised gas are not the only feedback-related mechanisms\nthat can affect the observed gas velocity dispersions. \nHigher $\\sigma_{\\rm gas}$ may also \ntrace star formation-induced turbulence in galactic disks \\citep{Faucher-Giguere+13},\nsuch as turbulence injected in the gas by SNe explosions, which would naturally \ndepend on the SFR (e.g. \\citealt{Shetty+Ostriker12,Hopkins+12}).\nIndeed, observationally, vertical disk velocity dispersions in the gas (increased by turbulence) \nwould be convolved with circular velocities due to\ninclination effects, thereby affecting the sightline-averaged gas velocity dispersions. \n\\cite{Faucher-Giguere+13} suggested that turbulence resulting from stellar feedback regulates the \nthe rate of formation of giant molecular clouds (GMCs),\nwhere most of star formation takes place, thereby having an important role in regulating the global\ndisk-averaged star formation efficiency in galaxies \\citep{Faucher-Giguere+13}. \nThe tendency of galaxies with higher SFRs (as traced by their IR luminosity) to show \nlarger optical emission line widths was already evidenced by earlier observational studies \\citep{Veilleux+95, Lehnert+Heckman96}.\nHowever, more recent results by \\cite{Arribas+14} indicate that star formation-driven turbulence\nmay have only a marginal role in increasing the velocity dispersion of ionised gas in galaxy disks. These authors suggested\nthat, at least in (U)LIRGs, galaxy interactions and AGNs may instead be \nthe main responsible for the presence of dynamically hot gas disks.\n\nFig.~\\ref{fig:sigma} shows also the line-of-sight velocity dispersion\nof gas and stars as a function of M$_*$ (second column), with the bins colour-coded by their SFR, i.e. the \ndiagram orthogonal to the one in the first column. As already pointed out,\na positive correlation is expected since the stellar mass is a proxy for the total\ndynamical mass of a system, and higher dynamical masses result in\nhigher velocity dispersions for gas and stars. The scatter is mostly ascribable to\ndifferences in SFR. For M$_{*}>10^{10}$~M$_{\\odot}$, where the relationship between $\\sigma_{\\rm stars}$ and\nSFR flattens (as shown in the first column plot), the correlation between $\\sigma_{\\rm stars}$ and ${\\rm M_{*}}$ tightens.\n\nFor fixed stellar mass (indicated by the colour coding), the trends of $\\sigma$\nvs sSFR reported in the third column of Fig.~\\ref{fig:sigma} are identical to the trends vs SFR, only shifted\nby ${\\rm -log(M_{*})}$. This is a natural consequence of binning galaxies in the\n${\\rm M_{*}-SFR}$ parameter space. We show in these plots the range of sSFR corresponding to the\nMS of local star-forming galaxies (Figure~\\ref{fig:grid_sf}), calculated between \n${\\rm 9.0 \\leq log(M_{*}) \\leq 11.0}$\\footnote{Without including the MS scatter of $\\pm0.3$ dex in SFR.} following \\cite{Peng+10} as\ndetailed in $\\S$~\\ref{sec:stacking}.\nSuch sSFR range is very narrow, and this constitutes a fundamental property of the galaxy population:\nthe sSFR, that is the ratio between ongoing star formation (i.e. SFR) and past-integrated star formation\n(i.e. ${\\rm M_{*}}$) is roughly constant in star-forming galaxies at a given epoch \\citep{Peng+10} (however,\nsee also discussion in \\cite{Gavazzi+15} and references therein according to which the MS relation changes \nslope above a turnover stellar mass, resulting in a decrease of sSFR with M$_*$ in normal star forming galaxies).\n\nIn conclusion, the widths of the [OIII] and H$\\alpha$ LoSVDs are not the\nmost appropriate tools to investigate galactic outflows: although the correlations observed \nin Fig.~\\ref{fig:sigma} between $\\sigma$ and\nSFR (or sSFR) are likely probing also galactic outflows, there are other effects that may affect these trends,\nsuch as the previously discussed possible projection effects, star formation-induced turbulence in the disk, and the effects of variations in the total \ndynamical mass \non the virial motions of stars and gas. In order to reduce the influence of virial motions and to shed light\non the effects of galactic outflows on the ionised gas dynamics, we need to focus our investigation on the {\\it high\nvelocity tail} of the LoSVDs.\n\n\\begin{figure}[tb]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_oiii_v01_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_ha_v01_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_stars_v01_new.ps}\n   \\caption{(Modulus of the) 0.1th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 0.1th percentile\n\t\tvelocity corresponds to -3 standard deviations ($\\sigma$) from the mean velocity, and therefore it probes the\n\t\thigh velocity blueshifted tail of the LoSVD. Similarly to Fig.~\\ref{fig:sigma}, we report for each plot the Spearman\n\t\trank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v01}\n\\end{figure}\n\nTo this purpose, we calculate the 0.1th, 2.3th,15.9th, 84.1th, 97.7th and 99.9th percentile velocities \nof the LoSVDs of gas and stars. We chose these values because,\nin a Gaussian distribution, they correspond respectively to $-3\\sigma$, $-2\\sigma$, $-1\\sigma$,\n$1\\sigma$, $2\\sigma$ and $3\\sigma$, where $\\sigma$ is the standard deviation of the Gaussian distribution.\nThe $N$-th percentile velocity, $v_N$, is defined as: \n\n", "itemtype": "equation", "pos": 59952, "prevtext": "\nIn this equation, [NII] indicates the bluest line of the [NII] doublet, i.e. the [NII]$\\lambda$6548 line,\nand $\\varrho$ denotes the theoretical ratio between the rest-frame vacuum wavelengths of the [NII]$\\lambda$6548 and\n[NII]$\\lambda$6583 lines as reported in the NIST database.\n\nThe kinematics (velocity and widths) of all components fitting the H$\\alpha$+[NII]\ncomplex is set to be equal for the three transitions. Such a constrained approach is necessary \nto separate the partially blended H$\\alpha$ and\n[NII] emission lines and it improves the quality and reliability of the fit, as pointed out by\n\\cite{Westmoquette+12}. Moreover this method is justified by the fact that in star forming galaxies\nand in absence of strong shocks, the H$\\alpha$ and [NII] emission lines arise from adjacent regions.\n\nThe fit, whose input parameters are only the instrumental resolution (${\\sigma_R}$)\nand the (vacuum) central wavelengths of the different transitions (${\\lambda_i}$), provides\nus with the relative line fluxes ${\\varphi_i}$ and with other nine parameters, i.e.\n$v_{0,k}$, $\\sigma_k$ and\n$a_k$ (with the index ${k = 1,2,3}$ denoting the three Gaussian components \nused to model the observed LoSVD) from which, using Eq.~\\ref{eq:losvd_formula}, we retrieve\n${\\mathcal{L}(v)}$, i.e. the real LoSVD of the ionised gas.\nFigures \\ref{fig:fit_1} and \\ref{fig:fit_2} show example fits to the [OIII]$\\lambda$5007 and \nH$\\alpha$+[NII] emission lines as well as the resulting LoSVDs, for five representative galaxy stacks,\nhaving different SFR and M$_*$ properties (in particular, low and high SFR, low and high M$_*$, and\nintermediate SFR and M$_*$). In Figs.~\\ref{fig:fit_1} and \\ref{fig:fit_2} \nwe also show for comparison, over-plotted to the observed spectral emission line profiles, the \naverage SDSS instrumental profile (from Fig.~\\ref{fig:res}), to show that the\nbroad asymmetric wings we detected in a few of the stacks (e.g. ID=2.0\\,11.0) are not instrumental.\n\n\n\n\\section{Results}\\label{sec:results}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_oiii_5007_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\t[OIII]$\\lambda$5007 emission line. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_oiii_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_ha_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\tH$\\alpha$+[NII] emission lines. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_ha_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_stars_superimposed_losvd_2.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the stars. In each panel we have over-plotted the LoSVDs of galaxy bins identified\n\t\tby the same (average) SFR and by different (average) stellar masses, \n\t\tcolour-coded by their M$_{*}$.}\n   \\label{fig:losvd_stars_2}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_oiii_5007_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\t[OIII]$\\lambda$5007 emission line. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_oiii_1}\n\\end{figure*}\n\n\\begin{figure*}[p]\n    \\includegraphics[angle=90,height=0.40\\textheight]{plot_ha_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the ionised gas as traced by the\n     \t\tH$\\alpha$+[NII] emission lines. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_ha_1}\n\\end{figure*}\n\n\\begin{figure*}[p]\n   \\includegraphics[angle=90,height=0.40\\textheight]{plot_stars_superimposed_losvd_1.ps}\\\\\n     \\caption{Line-of-sight velocity distribution of the stars. In each panel we have \n\t\tover-plotted the LoSVDs of galaxy bins identified by the same (average) \n\t\tM$_{*}$ and by different (average) SFRs, colour-coded by their SFR.}\n   \\label{fig:losvd_stars_1}\n\\end{figure*}\n\nIn this section we present the results of our analysis of the dynamical properties of ionised gas and stars\nbased on stacked SDSS spectra of local star-forming galaxies, aimed at identifying the presence of galactic outflows.\nThroughout the remainder of the paper and in the figures, for the sake of simplicity, we will replace ``[OIII]$\\lambda$5007'' and \n``H$\\alpha$+[NII]$\\lambda\\lambda$6548,6583'' with ``[OIII]'' and ``H$\\alpha$'', respectively.\nThe reader should however keep in mind that ``H$\\alpha$'' actually refers to the H$\\alpha$ and [NII] line complex {\\it as a whole}, \nsince the LoSVDs were derived by fitting the H$\\alpha$ and [NII] lines simultaneously, as explained in $\\S$~\\ref{sec:losvd_fit}.\nThe adopted strategy is briefly summarised in $\\S$~\\ref{sec:strategy}. In $\\S$~\\ref{sec:kinematics} we analyse the general properties\nof the LoSVDs of gas and stars; in $\\S$~\\ref{sec:asym} we study the presence of asymmetric wings in the LoSVD profiles and\nfinally in $\\S$~\\ref{sec:outflows} we discuss the outflow properties.\n\n\n\\subsection{The novelty of our approach}\\label{sec:strategy}\n\nBefore presenting our results,\nwe first shortly summarise what is new in our approach to the study of galactic outflows, \nby emphasizing the advantages and strengths of this method.\nFor the first time, we study galactic outflows by directly comparing the \nLoSVD of the ionised gas (as traced by the [OIII], H$\\alpha$ and [NII] nebular emission lines) with the\nLoSVD of the stars. This has never been attempted\nbefore, primarily because previous studies could not reach the signal-to-noise needed\nto extract the stellar LoSVDs from the data, and (if any) they just relied on the comparison between\nthe velocity dispersion of gas and stars. \n\nFurthermore, this technique holds the potential of detecting the signature\nof outflows in sources spanning a wide dynamic range of physical parameters as shown in Fig.~\\ref{fig:grid_sf}, and\nin particular in faint, low mass (i.e. ${\\rm M_{*}}$ as low as ${\\rm \\sim 2\\times 10^{7}~M_{\\odot}}$) \nand moderately star-forming (i.e. SFR as low as ${\\rm \\sim 2\\times 10^{-3}~M_{\\odot}~yr^{-1}}$) galaxies. \nThe main limitations when probing outflows in galaxies having such low stellar masses and low star formation rates\nwith SDSS spectroscopy\nare both the low signal-to-noise and low spectral resolution of the associated spectra. \nIn this study, however, we overcome both these limitations. Firstly, we use the\nstacking technique to significantly improve the signal-to-noise in the\nspectra ($\\S$~\\ref{sec:stacking}). Secondly, we minimise problems associated with the limited spectral resolution \nby deconvolving the ``real'' line-of-sight velocity distribution of gas and stars from the instrumental spectral profile\nin the observed resolution-limited composite spectra (as described in\n$\\S$~\\ref{sec:instr_prof}-$\\S$~\\ref{sec:losvd_fit}). This is \nmade possible thanks to the high signal-to-noise of the stacked spectra,\nespecially for those galaxy bins in which the observed line profiles are narrow (i.e. line widths are close to the \ninstrumental resolution).\nIn particular, since, in emission lines, \noutflows are traced by a broad \ncomponent superimposed on a narrow component, \nour deconvolution technique in principle allows us\nto detect such a broad component, provided it is broad enough, even if the bulk \nof the (narrow) emission line is not resolved. \n\n\\subsection{Properties of the kinematics of gas and stars}\\label{sec:kinematics}\n\\subsubsection*{LoSVD profiles}\n\nIn the following we analyse variations in the LoSVD profiles of (ionised) gas and stars\nas a function of stellar mass and star formation rate.\nWe stress that, since the galaxy spectra have been stacked in bins of ${\\rm M_{*}}$ and\nSFR, the trends with ${\\rm M_{*}}$ and SFR can be investigated {\\it independently},\nthus breaking the degeneracy between SFR and M$_*$ that holds for star forming galaxies on the MS.\nFor each stack, we adopt the velocity corresponding to the peak of the {\\it stellar} LoSVD \nas a reference zero velocity for the LoSVD of both the stars\nand the gas.\n\nFigures~\\ref{fig:losvd_oiii_2},  \\ref{fig:losvd_ha_2} and \\ref{fig:losvd_stars_2} show\nthe variations of the LoSVD profiles of gas and stars as a function of ${\\rm M_{*}}$ \nat a fixed SFR. The most obvious trend that emerges from these figures is \nthe increasing width of the LoSVDs of both gas and stars with stellar mass at a given\nSFR. \nThis is simply a consequence of the fact that, {\\it to first order},\nthe velocity dispersion of both gas and stars primarily traces \nvirial motions that are related to the dynamical mass of the galaxy. \nThe dynamical mass of a galaxy is, to first order, proportional\nto its stellar mass, although also gas and dust contribute to it. \nTherefore, broader LoSVDs are expected at higher stellar masses,\nsimply because higher stellar masses are generally associated with higher dynamical masses.\nA comparison between Fig.~\\ref{fig:losvd_oiii_2} and \\ref{fig:losvd_ha_2} shows that\nthe [OIII] and the H$\\alpha$ LoSVD profiles are overall consistent. \n\nThe stellar LoSVDs in Fig.~\\ref{fig:losvd_stars_2} show some interesting properties:\nthey are overall quite broad, and have wings that extend up to several hundreds of\nkm~s$^{-1}$ in velocity, similar to the ionised gas traced by [OIII] and H$\\alpha$, in particular\nfor bins with ${\\rm -0.5\\leq log(SFR [M_{\\odot}~yr^{-1}])\\leq 1.5}$. This is in\npart a consequence of the velocity tail of the stellar distribution, but additional effects may be present,\nand these will be discussed in detail later in this section.\n\nFigures~\\ref{fig:losvd_oiii_1}, \\ref{fig:losvd_ha_1} and \\ref{fig:losvd_stars_1} are complementary to\nFigs.~\\ref{fig:losvd_oiii_2},  \\ref{fig:losvd_ha_2} and \\ref{fig:losvd_stars_2}: they show the\ntrends of LoSVD profiles of gas and stars as a function of SFR for fixed M$_*$.\nWe first focus on Figs.~\\ref{fig:losvd_oiii_1} and  \\ref{fig:losvd_ha_1}: at a given stellar mass,\nthe LoSVDs of [OIII]- and H$\\alpha$-emitting gas broaden at higher SFRs.\nSuch broadening is particularly evident for the ``wings'' of the line-of-sight velocity distributions, especially\nat stellar masses between ${\\rm 9.0\\leq log(M_{*} [M_{\\odot}] )\\leq 11.0}$ for the [OIII] LoSVDs, and between\n${\\rm 9.0 \\leq log(M_{*} [M_{\\odot}])\\leq 10.0}$ for the H$\\alpha$ LoSVDs. As we will discuss later in\nthis section, the overall broadening of the LoSVDs of ionised gas observed with increasing SFR at fixed M$_*$\ncould trace various stellar feedback-related phenomena, such as turbulence in the disk gas and\noutflows.\n\nA dependency of the width of the LoSVD on the SFR is also seen in the stars (Figure~\\ref{fig:losvd_stars_1}),\nalthough in a smaller measure and especially at lower stellar masses (i.e. ${\\rm log(M_{*} [M_{\\odot}])\\leq10.5}$) than, for example, in \nthe [OIII] LoSVDs (Figure~\\ref{fig:losvd_oiii_1}).  \nIn the case of the stars, the LoSVD broadening \nwith SFR (for constant ${\\rm M_{*}}$) may be\nassociated with an increase of the total dynamical mass of the systems. In particular, \nthe increase in width of the stellar LoSVDs is possibly tracing an increase of the total\ngas content in galaxies with higher SFRs, which is in turn a consequence of\nthe Schmidt--Kennicutt relation between SFR and total gas mass surface density\n\\citep{Schmidt1959, Kennicutt98}. However, this trend might be affected by a\npotential observational bias: the average projected size of galaxies decreases\nfor higher SFRs (higher SFRs correspond, on average, to more distant sources because\nof selection effects), and this may have an effect on the stellar velocity dispersion measured \nwithin the SDSS fibre.\n\nThe line-of-sight velocity distributions of [OIII] and H$\\alpha$ (Figures~\\ref{fig:losvd_oiii_2},  \n\\ref{fig:losvd_ha_2}, \\ref{fig:losvd_oiii_1}, and \\ref{fig:losvd_ha_1})\nexhibit asymmetries between the blue and the red side of the profiles. By eye inspection, such asymmetries\nappear to depend on the SFR, but a more quantitative analysis will be presented\n in $\\S$~\\ref{sec:asym}. We note that,\nquite surprisingly, also the stellar LoSVDs in Fig.~\\ref{fig:losvd_stars_2} and\n\\ref{fig:losvd_stars_1} appear, although to a smaller extent, asymmetrical; such an effect can be\nbest appreciated in bins with ${\\rm log(SFR~[M_{\\odot} yr^{-1}]) =0.5}$ and\n${\\rm log(SFR~[M_{\\odot} yr^{-1}]) =1.5}$ (Figure~\\ref{fig:losvd_stars_2}). \nAsymmetries of the LoSVDs of gas and stars will be investigated in $\\S$~\\ref{sec:asym}.\n\n\\subsubsection*{LoSVD parameters: $\\sigma$ and percentile velocities}\n\nThe next step is to extrapolate physically meaningful quantities from the\nLoSVDs of stars and gas, and investigate the relationships with galaxy properties.\nErrors on the LoSVD parameters are obtained using the bootstrap technique \\citep{Efron79}.\nThe bootstrap method consists in randomly resampling (with replacements) our\ngalaxy stacks, by generating, for each bin, resampled stacks with sample size (here indicated with $S$) equal to the original stack.\nMore specifically, for each bin in the $\\rm M_{*}-SFR$ parameter space (Figure~\\ref{fig:grid_sf}),\nwe produce $N\\gg1$ resampled stacks, each of which is obtained by randomly \nselecting $S$ galaxy spectra from the original sample of $S$ spectra included in that bin \nand by co-adding them to produce a new ``resampled'' stack. \nThe difference from the original stack is that, in the resampled stacks, the $S$ spectra to be co-added together are\nextracted randomly from the parent sample of $S$ galaxy spectra by allowing repetitions, hence the spectrum of a given\ngalaxy can be selected either once, or more than once, or never. \nAfter producing $N$ resampled stacks for each bin, we perform for each of them \nthe stellar continuum subtraction and the [OIII] and H$\\alpha$+[NII] line\nfitting, exactly in the same way as for the original stacks (see $\\S$~\\ref{sec:stellar_sub}, $\\S$~\\ref{sec:losvd_stars} and $\\S$~\\ref{sec:losvd_fit}),\nin order to retrieve the LoSVDs of stars and gas.\nTherefore, the bootstrap provides, for each bin and for a given LoSVD\nparameter of interest ($p_i$), a distribution of $N$ values. \nThe variance of this distribution of $N$ parameters\n(following on from the variance of the galaxy samples) is used to estimate the error on the measure of $p_i$.\nThe choice of the number $N$ of resampled stacks for each bin is a compromise\nbetween statistics and computational effort. We set $N=10$ for the most crowded\nbins, i.e. those including $S\\geq10,000$ galaxy spectra, $N = 50$ for bins with\n$5,000 \\leq S < 10,000$, and $N = 100$ for the remaining ones, i.e. those\nwith less than 5,000 objects.\n\nThe simplest parameter to study is the line-of-sight velocity dispersion ($\\sigma$), given by:\n\n", "index": 13, "text": "\\begin{equation}\n\\sigma = \\biggl(\\int(v - v_c)^2  \\mathcal{L}(v) dv\\biggr)^{1/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\sigma=\\biggl{(}\\int(v-v_{c})^{2}\\mathcal{L}(v)dv\\biggr{)}^{1/2},\" display=\"block\"><mrow><mrow><mi>σ</mi><mo>=</mo><msup><mrow><mo maxsize=\"210%\" minsize=\"210%\">(</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>v</mi><mo>-</mo><msub><mi>v</mi><mi>c</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>v</mi></mrow></mrow></mrow><mo maxsize=\"210%\" minsize=\"210%\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwhere $P(v < v_N)$ is the probability of observing, with the given line-of-sight velocity distribution $\\mathcal{L}(v)$, velocities\nlower than $v_N$, and ${\\int_{-\\infty}^{+\\infty} \\mathcal{L}(v) dv = 1}$.\n\nFigure~\\ref{fig:v01} shows the 0.1th percentile velocities of the [OIII], H$\\alpha$ and stellar LoSVDs as a function of SFR,\nM$_*$ and sSFR. The corresponding plots obtained for the other \npercentile velocities are shown in the Appendix (Figures~\\ref{fig:v16} to ~\\ref{fig:v99}).\nThe results of the Spearman rank test performed on the relationships between the various LoSVD parameters \n($\\sigma$ and percentile velocities) and galaxy parameters (SFR, M$_*$ and sSFR), for both gas and stars, are \nreported in Table~\\ref{table:rho_values} to facilitate the comparison between the different relationships shown in \nFigs.~\\ref{fig:sigma}, \\ref{fig:v01} and \\ref{fig:v16}--\\ref{fig:v99}.\n\n\\begin{table}[tb]\n\\small\n \\begin{minipage}{80mm}\n  \\caption{Spearman rank correlation parameters$^\\dag$}\n  \\label{table:rho_values}\n\\begin{tabular}{@{}rccc@{}}\n\\hline\n\\hline\n  \t   \t\t\t&  [OIII] \t\t\t\t\t\t& H$\\alpha$  \t\t\t&   stars   \t\\\\\n\t\t\t\t& $\\rho$ (p-value)\t         \t& \t $\\rho$ (p-value)      \t& $\\rho$ (p-value) \t\\\\\n\\hline\n$\\sigma$ vs SFR\t&\t0.906 (1.5E-19)\t\t& 0.918 (7.5E-21)\t\t&\t0.795 (5.4E-12)\t\\\\\n$v_{15.9}$ vs SFR\t&\t0.826 (1.6E-13)\t\t& 0.852 (4.4E-15)\t\t&\t0.825 (1.7E-13) \t\\\\\n$v_{2.3}$ vs SFR    \t&\t0.891 (4.7E-18)\t\t& 0.925 (8.5E-22)\t\t&\t0.792 (7.3E-12)\t\\\\\n$v_{0.1}$ vs SFR\t&\t0.938 (8.9E-24)\t\t& 0.935 (2.7E-23)\t\t&\t0.788 (1.1E-11)\t\\\\\n$v_{84.1}$ vs SFR\t&\t0.760 (1.5E-10)\t\t& 0.735 (1.2E-09)\t\t&\t0.787 (1.3E-11)\t\\\\\n$v_{97.7}$ vs SFR    &\t0.889 (6.5E-18)\t\t& 0.885 (1.6E-17)\t\t&\t0.756 (2.3E-10)\t\\\\\n$v_{99.9}$ vs SFR\t&\t0.921 (2.5E-21)\t\t& 0.894 (2.2E-18)\t\t&\t0.731 (1.7E-09)\t\\\\\n\\hline\n$\\sigma$ vs M$_*$\t&\t0.810 (9.9E-13)\t\t& 0.752 (3.0E-10)\t\t&\t0.810 (1.1E-12)\t\\\\\n$v_{15.9}$ vs M$_*$ &\t0.832 (7.0E-14)\t\t& 0.790\t(9.4E-12)\t\t&\t0.802 (2.7E-12)\t\\\\\n$v_{2.3}$ vs M$_*$   &  \t0.808 (1.3E-12)\t\t& 0.730 \t(1.8E-09)\t\t&\t0.808 (1.3E-12)\t\\\\\n$v_{0.1}$ vs M$_*$\t &\t0.678 (6.2E-08)\t\t& 0.638\t(6.3E-07)\t\t&\t0.807 (1.4E-12)\t\\\\\n$v_{84.1}$ vs M$_*$\t &\t0.886 (1.3E-17)\t\t& 0.820 (3.4E-13)\t\t&\t0.792 (7.3E-12)\t\\\\\n$v_{97.7}$ vs M$_*$  &\t0.810 (1.1E-12)\t\t& 0.754\t(2.5E-10)\t\t&\t0.815 (6.2E-13)\t\\\\\n$v_{99.9}$ vs M$_*$\t &\t0.566 (1.9E-05)\t\t& 0.657\t(2.2E-07)\t\t&\t0.811 (8.8E-13)\t\\\\\n\\hline\n$\\sigma$ vs sSFR\t&\t0.175 (0.22)\t\t\t& \t0.246 (0.085)\t\t&\t0.059 (0.69)\t\t\\\\\n$v_{15.9}$ vs sSFR\t&\t0.069 (0.64)\t\t\t& \t0.142 (0.33)\t\t\t&\t0.094 (0.52)\t\t\\\\\n$v_{2.3}$ vs sSFR    &\t0.159 (0.27)\t\t\t& \t0.268 (0.059)\t\t&\t0.054 (0.71)\t\t\\\\\n$v_{0.1}$ vs sSFR\t&\t0.332 (0.019)\t\t& \t0.371 (0.0081)\t\t&\t0.051 (0.73)  \t\\\\\n$v_{84.1}$ vs sSFR\t&\t-0.044 (0.76)\t\t& \t-0.002 (0.99)\t\t&\t0.070 (0.63)\t\t\\\\\n$v_{97.7}$ vs sSFR  &\t0.160 (0.27)\t\t\t& \t0.207 (0.15)\t\t\t&\t0.019 (0.90)\t\t\\\\\n$v_{99.9}$ vs sSFR\t&\t0.435 (0.0016)\t\t& \t0.314 (0.026)\t\t&\t-0.005 (0.97)\t\\\\\n\\hline\n\\end{tabular}\n\\end{minipage}\n\n\\begin{flushleft}\n\\small\n\\textbf{Notes:} $^\\dag$ This table lists the Spearman rank correlation\ncoefficients ($\\rho\\in(0.1)$) and corresponding two-sided p-values calculated for the relationships between LoSVD \nparameters (velocity dispersion and percentile velocities) and galaxy properties (SFR, M$_*$, sSFR)\nthat are shown in Figs.~\\ref{fig:sigma}, \\ref{fig:v01} and Figs. ~\\ref{fig:v16}--\\ref{fig:v99}.\nA high value of $\\rho$ (e.g. $\\rho\\gtrsim 0.5$) combined with a low p-value ($\\leq 0.05$) indicates\nthe presence of a statistically significant correlation.\n\\end{flushleft}\n\\end{table}\n\nIt is clear from Table~\\ref{table:rho_values} that the velocity dispersions and the\npercentile velocities show all significant correlations \nwith SFR and M$_*$, for both the gas and the stars. There are however important differences\namong the various LoSVD parameters, in particular between the 15.9th\nand the 0.1th percentile velocities.\nMore specifically, by moving towards the high velocity blueshifted tail of the LoSVD\n(i.e. from the 15.9th to the 0.1th percentile velocity), the correlation between gas velocity and SFR \ntightens (the Spearman correlation coefficient $\\rho$ increases), whereas the correlation between\nstellar velocity and SFR weakens slightly ($\\rho$ decreases). A similar trend is evidenced also for the \nredshifted tail of the LoSVD (i.e. from the 84.1th to the 99.9th percentile velocity). \nThese results strengthen the hypothesis that the high velocity tail of the ionised gas LoSVD traces\nmainly star formation-feedback related mechanisms and is little affected by other mechanisms, which instead dominate the relationships\nbetween stellar velocity and SFR.\nThe correlation between gas velocity and SFR is slightly tighter at blueshifted than at redshifted velocities\n(especially if using H$\\alpha$ as a tracer), probably because of dust extinction affecting\nmostly the receding (i.e. redshifted) side of the outflow. \nFurthermore, Table~\\ref{table:rho_values}\nshows that the correlation between ionised gas velocity and M$_*$  \nweakens (and almost breaks down, as clearly shown in the corresponding plots in Fig.~\\ref{fig:v01} and Figs.~\\ref{fig:v84}--\\ref{fig:v99}) \ntowards the high velocity tail of the LoSVD ($\\rho$ decreases), suggesting that gravity (as traced by M$_*$)\ndoes not play an important role in determining the dynamics of the high-velocity gas.\n\nIn summary, by exploring the relationships between the different percentile velocities\nof the LoSVDs of gas and stars and the galaxy parameters, we \n infer that the correlation with the SFR is tighter for the ionised gas at higher percentile velocities and, in particular,\nthat the high velocity (blueshifted or redshifted) tails of the gaseous LoSVDs depend tightly on the SFR (correlation coefficient\n$\\rho\\gtrsim0.9$) and more weakly ($\\rho<0.7$) on the stellar mass. This result supports the hypothesis that, \nin the high velocity regime, the\ngas kinematics progressively ceases to probe the dynamical mass of galaxies (which is in first approximation\ntraced by the stellar mass), but it is instead intrinsically related to the rate at which stars are formed, likely because of the\npresence of stellar feedback mechanisms. \n\nHowever, regardless of the correlations observed between the various LoSVD parameters ($\\sigma$ and percentile\nvelocities) and galaxy properties (SFR, M$_*$, sSFR) that have been discussed in this Section (Table~\\ref{table:rho_values}), \nin order to isolate the effects of outflows from other mechanisms we need to investigate the {\\it differences} between the \nLoSVDs of gas and stars. Indeed, by looking at the galaxy stacks where the difference \n$(v_{\\rm gas}-v_{\\rm stars})$ is significantly greater than zero, we can identify galaxies where the \nmotions of gas and stars are clearly decoupled, and so galaxies where outflows are most likely taking place. Differences between\nthe gaseous and stellar kinematics and their dependency on galaxy properties \nwill be investigated in $\\S$~\\ref{sec:outflows}.\n\n\\subsection{Asymmetries in the LoSVDs of gas and stars}\\label{sec:asym}\n\nAsymmetric wings of nebular emission lines usually trace perturbed gas, \nwhose dynamics is not consistent with purely\nvirial motions but that can be instead explained with radial (outward or inward) motions in conjunction with dust\nextinction effects. The presence of a blue asymmetry is commonly interpreted in terms of \noutflows, because obscuration by dust in the galaxy disk affects primarily the backside receding gas\n(e.g. \\citealt{Lehnert+Heckman96,Villar-Martin+11,Soto+12}).\n\n\\begin{figure}[tb]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1cm .5cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_oiii_v2_v98_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1cm 2.2cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_ha_v2_v98_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1cm  2.2cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_stars_v2_v98_diff_new.ps}\n   \\caption{Blue asymmetry of the [OIII] (\\emph{top panel}),  H$\\alpha$ (\\emph{middle panel}) \n   \t       and stellar (\\emph{bottom panel}) LoSVDs, as measured by the \n   \t       difference between the (moduli of the) 2.3th and 97.7th percentile velocities\n\t       (i.e. $y = |v_{2.3}|-|v_{97.7}|$). For display purposes, only the less noisy bins are plotted, i.e.\n\t       bins with either $\\sigma_{y} < 50~{\\rm km~s^{-1}}$ or $|y| \\geq 2\\sigma_{y}$.\n\t       The Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate stronger correlation) \n\t       is reported for each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant). }\n   \\label{fig:v2_v98_diff}\n\\end{figure}\n\nVisual inspection of the LoSVD profiles of gas and stars shown in Figs.~\\ref{fig:losvd_oiii_2} \nto \\ref{fig:losvd_stars_1} suggests that the line-of-sight\nvelocity distributions of both gas and stars are not symmetrical. We further investigate\nthis possibility in Fig.~\\ref{fig:v2_v98_diff}, where we plot, as a function of SFR, M$_*$ and sSFR, the\n difference between the (moduli of the) \n2.3th and 97.7th percentile velocities, i.e. ${|v_{2.3}|-|v_{97.7}|}$, evaluated for \n[OIII], H$\\alpha$ and stars.\nFigure~\\ref{fig:v2_v98_diff} shows that \nalmost all galaxy bins (a part form a few, noisier stacks) exhibit\na clear blue asymmetry in the LoSVDs of [OIII] and H$\\alpha$, with ${|v_{2.3}|-|v_{97.7}|}$ values\nranging between $\\sim0$~km~s$^{-1}$ and $\\sim100$~km~s$^{-1}$. \nVery surprisingly, also the stellar LoSVDs are affected by a blueward asymmetry, although less pronounced\nthan in the gas. The velocity difference ${|v_{2.3}|-|v_{97.7}|}$ measured for the stars is\nconsistent with zero at low SFRs. However, in galaxy bins with\n${\\rm SFR \\gtrsim 0.1~M_{\\odot}~yr^{-1}}$, ${|v_{2.3}|-|v_{97.7}|}$ increases up to\nvalues of a few tens of km~s$^{-1}$, with\nlarge uncertainties, but still significantly larger than zero and therefore inconsistent \nwith the absence of any asymmetry.\n\nThe presence of a blue asymmetry in the LoSVDs of [OIII] and H$\\alpha$ \nis suggestive of galactic outflows.\nThe hypothesis of star formation-driven outflows\nis corroborated by the correlation observed between\nthe H$\\alpha$ blue asymmetry (as traced by ${|v_{2.3}|-|v_{97.7}|}$)\nand the SFR ($\\rho$=0.594), and by the hint of a \ncorrelation observed for [OIII] ($\\rho$=0.361).\nWe note however that the dust properties of galaxies may also affect the trends observed\nfor [OIII] and H$\\alpha$ in Fig.~\\ref{fig:v2_v98_diff}.\nIndeed \\cite{Santini+14}, by using {\\it Herschel} observations of local and intermediate-redshift ($z\\lesssim2.5$)\ngalaxies, found a tight correlation between dust mass\nand star formation rate, which they interpreted as a consequence of the Schmidt--Kennicutt law\n(since dust and gas mass are related). Therefore, the positive correlation between \n${|v_{2.3}|-|v_{97.7}|}$ and SFR observed for the ionised gas is \nlikely due to the combined effect of star formation-driven outflows and \n${\\rm M_{dust}}$--SFR proportionality, since dustier galaxy disks result in more pronounced line\nasymmetries. The evidence for a relationship between LoSVD blue\nasymmetry and stellar mass is instead more marginal ($\\rho=0.362$ and $\\rho=0.279$, respectively for [OIII] and H$\\alpha$,\nsecond column of Fig.~\\ref{fig:v2_v98_diff}). The absence of a clear correlation is consistent\nwith the recent results by \\cite{Santini+14}, who showed that the positive correlation \nbetween dust and stellar mass found by previous studies significantly flattens when separating galaxies \naccording to their SFR.\n\nFigure~\\ref{fig:v2_v98_diff} shows that, in the stellar LoSVDs, blue asymmetries are also present but, due to\nthe large uncertainties, it is very difficult to investigate possible relationships with galaxy properties. However,\nwe note that there is some evidence for a weak correlation between stellar blue asymmetry and SFR ($\\rho=0.551$),\nand an even more marginal one with stellar mass ($\\rho=0.401$), vaguely recalling the corresponding trends\nobserved in ionised gas.\n\nIn Figure~\\ref{fig:appendixB} ($\\S$~\\ref{sec:losvd_stars}) we showed a check on the stellar continuum fitting for two galaxy stacks: one exhibiting \na blue asymmetry in the stellar LoSVD, and one with no asymmetry.  These plots demonstrate that the detection of such a faint\nfeature in the stellar kinematics of external galaxies is made possible thanks to the high signal-to-noise reached in the composite\nspectra, which allows us to fit the stellar continuum (and so extract the stellar kinematics) with unprecedented accuracy.\nTo our knowledge, blue asymmetries in the stellar LoSVDs of external galaxies have never been observed before.\nIndeed, while an intrinsic kinematic asymmetry or ``lopsidedness'' in the stellar distribution is certainly possible for individual galaxies \nor at specific locations within galaxies, for example\ndue to stellar bars, galaxy interactions or even \ncounter-rotating disks (e.g. \\citealt{Krajnovic+15}), such effects should average out when \ncombining the integrated spectra of thousands of different galaxies. The observation\nof an asymmetry of the stellar LoSVD that is {\\it consistently blue} (and never red) could be explained by \nthe presence of stars in radial outward motions in galaxies, combined with obscuration by dust lanes in the galactic disk.\nDust in the disk would hamper mainly the detection of stars moving away from the galaxy with a redshifted (line-of-sight) velocity component, \nhence skewing the average stellar LoSVD towards blueshifted velocities.\n\nThe blue asymmetries in the stellar LoSVDs suggest \nthat high-velocity runaway stars, hypervelocity stars (HVS, \\cite{Brown+05})\nand possibly high-velocity stellar clusters \\citep{Caldwell+14}\nin radial motions may be a rather common phenomenon in star forming galaxies.\nHigh velocity stars in radial trajectories are usually very difficult to detect even in our own galaxy.\n\\cite{Palladino+14} discovered a sample of 20 candidate hypervelocity stars in the Milky Way, \nthe bulk of which have velocities between 600 and 800~km~s$^{-1}$, and in at least\nhalf of the cases exceed the escape velocity from the Galaxy.\nThese are G- and K-type dwarf stars, hence less massive and older than the\ntypical massive B-type HVSs \\citep{Brown+12a}.\nInterestingly, the trajectories of the stars detected by \\cite{Palladino+14} are not consistent with ejection\n via three-body interactions between a binary system and the SMBH of our Galaxy or of M31, which\n is currently the most popular explanation for young B-type hypervelocity stars \\citep{Hills88,Yu+Tremaine03}\n and predicts that one component of the binary system remains in a bound orbit around the SMBH.\nOn the contrary, the HVS candidates detected by \\cite{Palladino+14} appear to \noriginate from all directions, suggesting \nthat another mechanism must be capable of accelerating stars to high speeds, such\nas a supernova explosion in a close binary system \\citep{Blaauw61, Zubovas+13b}, which is\ncurrently the most likely origin of lower speed runaways ejected from the galactic disk \\citep{Brown+15}.\nNotably, the fastest HVS ever detected, US~708, with a Galactic rest-frame velocity of 1200~km~s$^{-1}$, has been recently\nconfirmed to be a solid candidate for an ejected Type Ia supernova donor remnant \\citep{Geier+15}.\nThe supernova binary ejection scenario may be a viable explanation for our observations, supported by the tentative\ncorrelation observed in Fig.~\\ref{fig:v2_v98_diff} between the stellar blue asymmetry and the SFR.\n\n However, although HVSs may provide a plausible explanation for the blue asymmetries observed\nin the stellar LoSVDs of local star forming galaxies, the properties and origin of these features\nneed further and in-depth investigation with high signal-to-noise data such as will be delivered by ongoing \nsurveys (Gaia, MaNGA) and new facilities (MUSE, JWST, 30m class telescopes).\n  \n\\subsection{Outflow properties}\\label{sec:outflows}\n\nOverall, the presence and properties of the line-of-sight velocity distributions of ionised gas\nas derived from composite spectra of nearby non-active galaxies suggest ubiquity of \nstar formation-driven galactic outflows. However, our analysis has also highlighted the presence of\nadditional factors, other than outflows, that are likely affecting the kinematics of\nboth the ionised gas and the stars, namely\nvirial motions, projection effects, gas content, and dust extinction. \nThe next step is to try to isolate in the data the effects of gas outflows,\ndisentangling them from other mechanisms, in order to get a completely unbiased picture of their\noccurrence and properties in local galaxies.\n\n\\begin{figure}[tp]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1.cm .8cm 2.3cm,angle=90,width=1.\\columnwidth]{plot_oiii_v01_stars_v99_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 2.3cm,angle=90,width=1.\\columnwidth]{plot_ha_v01_stars_v99_diff_new.ps}\n   \\caption{Excess of line-of-sight velocity of the ionised gas with respect to the stars ($v_{\\rm gas}-v_{\\rm stars}$) as given \n   \t\tby $y = |v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\n   \t        for [OIII] (\\emph{upper panel}) and for H$\\alpha$ (\\emph{bottom panel}).\n\t       For display purposes, only the less noisy bins are plotted, i.e. only bins \n\t       with either $\\sigma_{y} < {\\rm 50~km~s^{-1}}$ or $|y| \\geq 2\\sigma_{y}$.\n\t       As explained in $\\S$~\\ref{sec:outflows}, the quantity $y$ is a reliable tracer of \n\t       ionised outflows only when it is\n\t       positive. \n\t       The Spearman rank correlation coefficient ($0<|\\rho|<1$, higher values of $|\\rho|$ indicate stronger correlation, \n\t       $\\rho<0$ if there is an anti-correlation) \n\t       is reported in each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant). }\n   \\label{fig:plot_outflow_3sigma}\n\\end{figure}\n\n\\begin{figure}[tp]\n\\centering\n   \\includegraphics[clip=true, trim=-2cm 0cm 0cm -2.1cm,angle=90,width=\\columnwidth]{plot_grid_oiii_outflow2.ps}\\\\\n   \\includegraphics[clip=true, trim=-2cm 0cm 0cm -2.1cm,angle=90,width=\\columnwidth]{plot_grid_ha_outflow2.ps}\n   \\caption{Grid of galaxy bins in the M$_*$--SFR parameter space used for the spectral stacking\n   \t(see also Fig.~\\ref{fig:grid_sf}). Each bin is colour-coded according to the line-of-sight\n      velocity difference $v_{\\rm gas}-v_{\\rm stars}$ as given by $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ for [OIII]\n     ({\\it upper panel}) and for H$\\alpha$ ({\\it lower panel}). The $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ values are also\n     reported for each bin.\n     The same bins as in Fig.~\\ref{fig:plot_outflow_3sigma} are plotted.}\n   \\label{fig:grid_outflow_3sigma}\n\\end{figure}\n\nThe plots in Figs.~\\ref{fig:sigma}, ~\\ref{fig:v01} and \\ref{fig:v2_v98_diff}\nprovided important clues on the concomitant mechanisms that have an impact on the \nLoSVDs of gas and stars. In the following, we briefly summarise\nsome logical deductions that will help us understand outflow properties:\n\\begin{enumerate}\n\\item The effects of virial motions on gas kinematics can be reduced considerably by looking at\nthe high velocity tail of the LoSVD of the ionised gas. In particular,\n the correlation between the line-of-sight velocity of the ionised gas and M$_*$ (which\nis related to the dynamical mass) is weaker for the 0.1th and 99.9th\n($\\rho\\sim0.6$) than for the 15.9th and 84.1th ($\\rho\\sim0.8$) percentile velocities (Table~\\ref{table:rho_values}). Moreover, the highest \nvelocities show the tightest correlation with the SFR ($\\rho\\gtrsim0.9$), indicating that the effects of star formation-driven \nfeedback is indeed predominant.\n\\item The stellar LoSVDs appear quite broad, with stellar \nvelocity dispersions as high as $\\sim170$~km~s$^{-1}$, \ni.e. as high as the highest $\\sigma$ observed in the ionised gas and, for large\nstellar masses, even higher than the gas, probably because of the presence of stellar bulges\nin massive galaxies combined with projection effects, as explained in $\\S$~\\ref{sec:kinematics}. \nAs a consequence, only the {\\it excess of gas\nvelocity with respect to the stars}, i.e. $v_{\\rm gas}-v_{\\rm stars}$, can reliably trace\ngas motions due to gaseous outflows.\n\\item Because of dust attenuation, the blueshifted side of the LoSVD of the gas\nis a better probe of outflowing gas than the redshifted side. Therefore, following\npoints (i) and (ii), gaseous outflows will be investigated through the 0.1th percentile velocity of the \nLoSVD of [OIII]\nand H$\\alpha$, from which we will subtract the corresponding stellar velocity.\n\\item Another complication for the study of ionised outflows is given by the presence of (modest) blue \nasymmetries in the stellar LoSVDs, \nwhose origin is not clear and may be related to\nnon virial motions of stars in galaxies. In the following analysis we\nwill assume that this effect can be reduced (if not completely removed) by \nsimply using the redshifted stellar velocities, i.e. by subtracting\nfrom the 0.1th percentile LoS velocity of the gas, the 99.9th (rather than the 0.1th) percentile LoS \nvelocity of the stars.\n\\end{enumerate}\nBy considering points 1 to 4, the most appropriate tracer of ionised outflows\nis then given by the velocity difference $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\\footnote{We  \nnote that the velocity differences \n$|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and $|v_{\\rm 0.1~gas}|-|v_{\\rm 0.1~stars}|$ \nused as outflow tracers produce results that are overall consistent. However, $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\nis probably a better choice because it allows us to minimise the effects due the \npresence of a blue asymmetry in the stellar LoSVDs, whose main consequence is lowering our\nestimate of $v_{\\rm gas}-v_{\\rm stars}$, especially when using H$\\alpha$ emission to trace the gas.}:\nthis quantity will be used to track ``secure'' outflows in\ngalaxy stacks. Indeed, if $(v_{\\rm gas}-v_{\\rm stars})>0$, then the\nkinematics of gas and stars are decoupled and we are reliably tracing gaseous outflows. \nThe only other mechanism\nthat would explain such decoupling would be galaxy mergers, but the merger fraction is\nnegligible in the local Universe \\citep{Patton+Atfield08}, so gaseous \noutflows are the only viable explanation.\n\nFigure~\\ref{fig:plot_outflow_3sigma} shows the\nrelationships between the quantity $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$, evaluated for both\n[OIII]- and H$\\alpha$-emitting gas, and the \ngalaxy physical parameters (i.e. SFR, ${\\rm M_{*}}$ and sSFR). In Fig.~\\ref{fig:grid_outflow_3sigma} we show\nthe stacking grid in the M$_*$--SFR parameter space defined by the sample of local star forming\ngalaxies used in this study (i.e. the same grid as Fig.~\\ref{fig:grid_sf}), with each bin colour-coded according to the\nvalue of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ (measured for [OIII] and H$\\alpha$).\n\nIt is worth emphasising that the negative values of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\nestimated in some galaxy bins (especially at ${\\rm log(M_{*} [M_{\\odot}]) \\geq 10.0}$), \nare probably a consequence of\nthe conjunction of projection effects and of the absence of detectable galactic outflows.\nMore specifically, ignoring galactic outflows (which usually expand out perpendicular to the galactic disk, \nalong its minor axis, as shown by observations, e.g.\n\\citealt{Lehnert+Heckman96, Heckman+00, Chen+10, Rubin+14, Cazzoli+14}), \nthe ionised gas is confined to the plane of the galactic disk, and the projection effects described in $\\S$~\\ref{sec:kinematics},\naffecting mostly observations of face-on galaxies with a prominent stellar bulge (which dominate\nthe population of high-M$_*$ galaxies, e.g. \\citealt{Gavazzi+15}), can be even more accentuated.\nFor this reason, negative values of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ simply indicate galaxy\nbins in which outflows are not present, or in which outflows are not prominent enough to be detected:\nas a consequence, this quantity can reliably trace outflows\n{\\it only when it is positive}.\n\nAlthough many attempts have been made to establish fundamental\n``scaling'' relationships linking outflows and galaxy properties \n\\citep{Martin05, Rupke+05,Chen+10, Westmoquette+12, Martin+12, Rubin+14, Arribas+14, Heckman+15},\nthe general picture remains unclear and contradictory. The main reason\nfor this impasse may be the absence of a study on galactic outflows of large statistical significance: \nmost of previous studies relied on limited samples of objects,\nshowing extreme characteristics and spanning only a narrow range\nof galaxy properties (e.g. SFR, M$_*$). As a consequence, previous results do not adequately \nrepresent the whole local population of galaxies. Our analysis instead capitalises on a large statistical\nand almost unbiased sample of local star forming galaxies, particularly suitable for determining scaling\nrelationships between galactic outflows and galaxy properties.\nMoreover, our method allows, to accurately identify and separate of the effects of star-formation driven \noutflows from the other mechanisms affecting the LoSVD of the gas. \n\nThe general picture emerging from Figs.~\\ref{fig:plot_outflow_3sigma} \nand \\ref{fig:grid_outflow_3sigma} is the following\\footnote{We stress that all results discussed in this section and in the subsequent\nanalyses do not depend on the choice of using $v_{\\rm 99.9~stars}$ instead of $v_{\\rm 0.1~stars}$ to measure $v_{\\rm stars}$.}: the excess of gas velocity\n with respect to the stars (i.e. $v_{\\rm gas}-v_{\\rm stars}$, as traced by $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$), which we use in this study to trace galactic outflows,\ndepends weakly on the SFR ($\\rho=0.602$ for [OIII], but for H$\\alpha$ the correlation with SFR is much weaker, $\\rho=0.311$, and not\nstatistically significant as indicated by the high p-value) and more tightly on the sSFR ($\\rho=0.804$ and $\\rho=0.485$ for [OIII] and H$\\alpha$ respectively).\nHowever, we note that for galaxy bins identified by higher stellar masses\nthe correlation between $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and SFR {\\it at a fixed M$_*$} \nbecomes significantly tighter for both [OIII] and H$\\alpha$, i.e. $\\rho>0.8$ (with $\\rm p-value\\ll0.05$) \nat M$_*\\geq10^{9.5}$~M$_{\\odot}$ and even more so at M$_*\\geq10^{10}$~M$_{\\odot}$, for which we measure \n$\\rho>0.95$.\n\nGlobally, there is instead no relation between \n$|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and M$_*$ (second column of Fig.~\\ref{fig:plot_outflow_3sigma}): \n$\\rho=-0.054$ for [OIII] and $\\rho=-0.242$ for H$\\alpha$, but with high p-values, implying \nthat such weak anti-correlation is not significant.\nFor some galaxy bins, an anti-correlation appears between $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and M$_*$ {\\it at a fixed SFR}.\nThis effect is however highly significant ($\\rho<-0.9$) for both [OIII] and H$\\alpha$ only at\n$\\rm log(SFR [M_{\\odot}~yr^{-1}])=-1.0$ and $\\rm log(SFR [M_{\\odot}~yr^{-1}])=0.5$.\nSince the stellar mass traces the depth of the gravitational potential in galaxies, these observations\nwould suggest that, on equal SFRs, it becomes increasingly \ndifficult to launch gaseous outflows in larger gravitational potentials \nby means of star formation feedback only.\nThis qualitatively agrees with theoretical predictions (further discussed\nin $\\S$~\\ref{sec:discussion_outflows}) as well as with \nindirect observational evidence for a mass dependance of negative feedback \nprovided by studies of the ``mass-metallicity'' relationship in galaxies\n\\citep{Tremonti+04, Maiolino+08}.\nThese studies showed that \nthe gas-phase metallicity increases steadily with stellar mass, \nat least up to ${\\rm log(M_{*} [M_{\\odot}])\\simeq 10.5}$,\nsuggesting that low mass galaxies are less able than massive galaxies to retain in their gas \nphase the metals provided by supernova explosions, probably because they are more vulnerable to galactic outflows.\n\nIn addition, Fig.~\\ref{fig:plot_outflow_3sigma} reveals some interesting differences\nbetween [OIII] and H$\\alpha$ as tracers of ionised outflows. In particular, H$\\alpha$ emission\nseems to be a worse tracer of galactic outflows than [OIII] emission:\n(i) The correlation between $v_{\\rm gas}-v_{\\rm stars}$ and SFR is considerably weaker and less\nsignificant for H$\\alpha$ than for [OIII], and the same holds for the correlation with sSFR; \n(ii) for bins with $\\rm log(M_{*} [M_{\\odot}])= 11.0$, high values\nof $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ are inferred by using [OIII], whereas no velocity excess is detected\nwhen using H$\\alpha$ emission as a gas tracer.\nQualitatively, an higher outflow ionisation in more massive galaxies\ncould explain the differences that we evidence between [OIII] and H$\\alpha$ as outflow tracers.\nWe note that it is unlikely that such a difference between the H$\\alpha$ and [OIII] LoSVDs is a consequence\nof residual stellar H$\\alpha$ absorption. Indeed, the H$\\alpha$ LoSVDs are obtained by fitting the H$\\alpha$ and\n[NII]$\\lambda\\lambda$6548,6583 lines simultaneously (see $\\S$~\\ref{sec:losvd_fit}), by constraining the kinematics \nof all components employed in the fit to be the same for the three lines. Therefore, the resulting LoSVDs reflect also\nthe kinematics traced by the [NII] lines, which are much less affected by possible residual stellar absorption.\n\nFinally, we note that there is an intriguing property of galactic outflows that stands out immediately \nfrom Fig.~\\ref{fig:grid_outflow_3sigma}:\nlocal non-active galaxies hosting powerful outflows are located {\\it above} the main sequence of star\nforming galaxies. \nThe absence (or insignificance) of galactic outflows along and/or below the MS, which\nwe show here for the first time in a clear way, probably constitutes a striking feature of the local galaxy population, and\nit may persist to higher redshifts, as marginally shown in outflow studies at $z\\sim1$ \\citep{Martin+12}.\nThe relationship between galactic outflows and the MS of star forming galaxies will be further discussed in\n$\\S$~\\ref{sec:discussion_MS}.\n\n\n\n\\section[]{Discussion}\n\n\\subsection{Implications of outflow properties for feedback models}\\label{sec:discussion_outflows}\n\nIntense star formation activity\nconveys energy and momentum to its surroundings, which can then be transmitted by various\nphysical mechanisms to larger scales, thus eventually impacting the entire host galaxy\nand affecting its capability of forming stars (negative feedback).\nAlthough negative feedback from star formation can manifest under various forms (such as galactic outflows\nof ionised, neutral and molecular gas, shocks, hot bubbles and cavities, metal-enrichment of the IGM), its direct and unambiguous \nsignature can be very difficult to detect in most galaxies.\nAs a consequence, the detailed physics underlying this phenomenon is not yet completely understood, as\nwell as its relevance for quenching star formation in galaxies.\nHowever, significant advances have been accomplished by theorists in this field, who,\nby also exploiting the valuable information provided by observational studies,\npropose two main scenarios for star formation-driven feedback to occur:\n\n\\begin{enumerate}\n\\item According to the first,``canonical'' scenario, the kinetic energy released by supernova explosions and,\nespecially in the very first stages of the starburst ($\\Delta t \\leq 10^7 \\rm yrs$) and at high metallicities ($\\mathcal{Z} \\geq \\mathcal{Z}_{\\odot}$), \nby stellar winds from OB and Wolf-Rayet stars, plays the most important role in counteracting and self-regulating star formation\n( ``energy-driven'' scenario, e.g. \\citealt{Chevalier77, Leitherer+92, Chevalier+Clegg85, Springel+Hernquist03, Veilleux+05}). \nThis feedback mechanism is subject to the thermalisation efficiency of the energy deposited into the ISM:\nsuch efficiency may vary, but it is believed to be around 1-10\\%; therefore, up to $\\sim$99\\% of \nthe total kinetic energy injected by star formation may be dissipated radiatively in dense gas \\citep{Chevalier77, \nMurray+05, Thornton+98, MacLow+Ferrara99}.\nIf the transfer from kinetic energy from SNe and stellar winds to cloud motions is efficient enough to unbind the gas in the galaxy, it can \ndrive strong and large-scale outflows \\citep{Chevalier+Clegg85}. \nA natural outcome of this model is that energy-driven outflows are more important, at a given\nSFR (which is directly related to the kinetic energy injected by supernova ejecta and by stellar winds into the ISM),\nin low mass galaxies residing in less massive dark matter halos, because it is easier \nfor gas to escape from their shallower gravitational wells \\citep{Dekel+Silk86,Springel+Hernquist03,Dave+11a}.\n\\item In the second scenario, the momentum transferred by the UV radiation from young and massive\nstars to dust and the momentum injected by supernova\nexplosions\\footnote{The latter is thought to be important especially at later stages and in regions where the infrared optical depth is low,\nsuch as at large radii from the galactic centre.} (``momentum-driven'' scenario) dominate \nthe feedback mechanism \\citep{Murray+05, Dave+11a}.\nThe advantage of momentum-driven outflows is that they can be effective even when radiative losses are high, because \nmomentum cannot be radiated away \\citep{Murray+05}. However, this feedback mechanism, in order to be effective, requires\nISM conditions that may not be satisfied in normal local star-forming galaxies, such as \nlarge optical depths to infrared radiation \\citep{Dave+11a, Hopkins+11}, as well as collisional coupling of gas and dust in the outflow\n\\citep{Murray+05, Dave+11a}. For these reasons, momentum-driven outflows may be most effective at launching\ncold and dense gas (which is likely hydrodynamically coupled to dust) in dusty star-forming\ngalaxies and AGNs \\citep{Murray+05, Fabian12}. \nWe note that in this model, according to the original formulation by \\cite{Murray+05}, the condition\nthat must be satisfied in order to launch gas outward via momentum injection\nis that the total momentum flux exceeds the gravitational force, which\ntranslates into a condition on the luminosity of the starburst $L \\geq L_{M}$, where $L_M$ is an\n``Eddington-like'' luminosity threshold. If $L\\geq L_{M}$, a momentum-driven wind\ndevelops, with velocity $v_{\\rm out} \\gtrsim 2\\sigma_{*}$ (where $\\sigma_*$ is the stellar velocity dispersion;\n\\citealt{Murray+05}).\n\\end{enumerate}\n\nIn $\\S$~\\ref{sec:outflows} we have identified the galaxy stacks displaying the signature of\ngalactic outflows as those for which the excess of gas velocity with respect to the stellar velocity, as estimated\nfrom the high-velocity tail of the LoSVD, is significant. More specifically,\nwe have considered values of ${|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$ significantly greater than zero\nas a clear signature of outflows.\nThe next step would be comparing the scaling relationships obtained for the observed\noutflows with the expectations of theoretical models.\nHowever, the quantity ${|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$, while being suitable\nfor {\\it identifying} outflows, is not appropriate for the comparison with models, because \nit has no clear interpretation in terms of the physical quantities usually employed by theorists.\nUnfortunately, because of the information lost with the stacking, it is not\npossible to estimate the mass entrained in the observed outflows,\nand therefore to calculate some important parameters such as mass-loss rate, \nkinetic power and momentum rate of the outflows, which would help to discriminate\nbetween different feedback models. Most importantly, spatially resolved spectroscopic information\nare needed to infer these quantities \\citep{Rupke+Veilleux13, Cazzoli+14, Arribas+14}. \nHowever, we can obtain a proxy of the outflow velocity, and this can be exploited to shed light on the\nphysical mechanism powering the ionised outflows.\n\nThe LoSVD of ionised gas traces a combination of dynamical\nmotions of gas clouds within the gravitational potential of the galaxy and of perturbed\nmotions due to star formation feeedback-related processes such as outflows and turbulence \nin the disk. In the following analysis, since we consider only the high-velocity tail of the LoSVD, we\nassume that outflows dominate over turbulence, and so, simplistically, that any non-gravitational motions of the gas\nat such high velocities are due to outflows and not to turbulence. Therefore, the LoSVD of the gas may be regarded as the \nconvolution of two line-of-sight velocity distributions, one tracing the virial motions,\nand the other one tracing the outflow:\n\n\n", "itemtype": "equation", "pos": 72855, "prevtext": "\nwhere the line-of-sight velocity distribution described by ${\\mathcal{L}(v)}$ is normalised\nsuch as ${\\int\\mathcal{L}(v) dv = 1}$, and $v_c$ is\nthe centroid of the distribution, i.e. ${v_c = \\int v~\\mathcal{L}(v) \\textit{d} v}$.\nThe relationships between $\\sigma$ (of both the ionised gas, as traced by [OIII] and H$\\alpha$ and the stars), and galaxy\nproperties such as SFR, M$_*$ and sSFR\n(sSFR = SFR/${\\rm M_{*}}$, i.e. star formation rate per stellar mass unit)\nare shown in Fig.~\\ref{fig:sigma}. \n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_oiii_sigmav_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_ha_sigmav_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_stars_sigmav_new.ps}\n   \\caption{Line-of-sight velocity dispersion of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). The errors were obtained by applying the bootstrap method, as explained\n\t\tin the text. The grey dashed lines in the third column mark the sSFR range corresponding to the MS\n\t\tof local star-forming galaxies between ${\\rm 9.0 \\leq log(M_{*} [M_{\\odot}]) \\leq 11.0}$.\n\t\tThe Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate\n\t\tstronger correlation) is reported in each plot, along with the corresponding two-sided p-value as \n\t\tgiven in parenthesis (if the p-value is $\\leq\\alpha$,\n\t\twhere $\\alpha=0.05$ is the level of significance, the observed correlation is statistically significant).\n\t\t}\n   \\label{fig:sigma}\n\\end{figure}\n\nFor each plot in Fig.~\\ref{fig:sigma}, \nwe calculated the non-parametric Spearman\nrank correlation parameter ($\\rho\\in(0,1)$\\footnote{Calculated by using the IDL function \\texttt{R\\_CORRELATE}.}) to test the hypothesis of correlation between\nthe line-of-sight velocity dispersion of gas and stars and the galaxy properties (SFR, M$_*$, sSFR). \nIn our case, non-parametric tests such as the Spearman rank test are more appropriate than the standard\nPearson correlation coefficient ($r$), since we are dealing\nwith binned data and the relationship between $\\sigma$ and galaxy properties (if any) could be non-linear. \nA high value of $\\rho$ (e.g., $\\rho\\gtrsim0.5$) combined with a low p-value ($\\leq\\alpha$, where $\\alpha$ is the level of significance, which we set\n$\\alpha=0.05$) indicates the presence of \na statistically significant correlation. In the calculation of the p-value, \nwe allow for both positive and negative correlations (``two-sided''). \nThe results of the Spearman rank test are reported in Fig.~\\ref{fig:sigma}.\n\nAs illustrated by the clean relationships in Fig.~\\ref{fig:sigma}, our method is particularly\neffective at uncovering general trends between the dynamical properties of gas and stars and the galaxy properties.\nMoreover, Fig.~\\ref{fig:sigma} allows us to appreciate some differences between the dynamical behaviour of ionised \ngas and stars as a function of SFR and M$_*$.\nIn absolute values, the velocity dispersions of gas and \nstars are roughly consistent, with\nthe bulk of the galaxy bins showing values in the range ${\\rm 40 \\lesssim \\sigma~[ km~s^{-1} ] \\lesssim 150}$.\nHowever, for the highest stellar mass bins, i.e. ${\\rm log(M_{*} [M_{\\odot}]) \\gtrsim 10.0}$, the velocity dispersions measured\nfor the stars are slightly larger than the ones measured for the gas, especially when using H$\\alpha$ as a gas tracer.\nThis small effect can be explained by the contribution of stellar bulges in more massive galaxies.\n\\cite{Gavazzi+15} have recently shown that $>40$\\% of isolated local star-forming galaxies with \nM$_*>10^{9.5}$~M$_{\\odot}$ host stellar bulges (without distinguishing between classical bulges and pseudo-bulges), whereas\nthe fraction of stellar bulges at  M$_*<10^{9.5}$~M$_{\\odot}$ is only $\\sim5$\\%.\nWhen a galaxy has a prominent stellar bulge, its stellar LoSVD probes both the galactic disk and the bulge, whereas the\nLoSVD of the ionised gas only traces the dynamics in the disk (and, possibly, a ionised outflow), \nwhich is more subject to projection effects than the bulge. In particular, disks viewed face-on contribute \nmuch less to the broadening of the LoSVD than edge-on disks. Therefore, it is possible that, by averaging \ntogether many spectra of massive galaxies with stellar\nbulges, observed from different viewing angles, the resulting line-of-sight velocity dispersions are slightly higher for the\nstars than for the gas, because of the additional contribution from the stellar bulge.\n\nBy inspecting the plots in the first column of Fig.~\\ref{fig:sigma},\nwe note that $\\sigma_{\\rm [OIII]}$ and $\\sigma_{\\rm H\\alpha}$ are tightly correlated ($\\rho > 0.9$) with the SFR, and the correlation\nholds both at low and high stellar masses. The line-of-sight velocity dispersion of the stars is \nalso correlated with the SFR, but more weakly than the gas ($\\rho=0.795$), and the $\\rm \\sigma_{stars}-SFR$ relationship \nflattens at ${\\rm log(M_{*} [M_{\\odot}])\\sim 10.5}$ ($\\rho=0.029$, p-value=0.957).\n\nThe steady increase of gas velocity dispersion with SFR observed in Fig.~\\ref{fig:sigma}\nmay trace a combination of various physical processes.\nSince feedback-related mechanisms should affect only the gas kinematics, leaving the motions of (evolved) \nstellar populations unperturbed, we can use \nthe stellar velocity dispersion as a reference to identify trends that are not related to feedback.\nThe positive correlation between $\\sigma_{\\rm stars}$ and SFR observed at low stellar masses\nmay be due to the presence of gas contributing to the dynamical mass, the gas being traced \nby the SFR via the S--K relation, and therefore it may be related \nto an increase of gas fraction (at fixed stellar mass). \nHowever other mechanisms may\nproduce a similar effect: in the first place, as already mentioned, \na possible anti-correlation\nbetween the projected size and the SFR in galaxies, in \nconjunction with the limited SDSS fibre aperture, may\naffect the observed stellar LoSVD.\nMoreover, mergers and galaxy interactions, whose fraction is expected\nto increase at higher SFRs, can also have an impact on the observed \nLoSVDs, due to the combined motions of overlapping disks\nor tidal motions of collision, as pointed out by \\cite{Rupke+Veilleux13} in their study of \nULIRGs. However, mergers \nare relatively unimportant in the local Universe: the local galaxy merger rate\nestimated using SDSS data is about 0.01 Gyr$^{-1}$ \\citep{Patton+Atfield08}. \nAssessing the relative importance of these different factors in\nproducing the observed trend of increasing $\\sigma_{\\rm stars}$\nwith SFR (at a given ${\\rm M_{*}}$) goes beyond the scope of this paper and requires\nspatially resolved observations. \nFor what the present study is concerned, these results suggest caution in interpreting\nthe observed broadening of the ionised gas LoSVDs with SFR as {\\it entirely} due to\nfeedback-related processes, since the effects described above (and affecting both stars and gas)\nmay be at work.\n\nMoreover, as mentioned above, outflows of ionised gas are not the only feedback-related mechanisms\nthat can affect the observed gas velocity dispersions. \nHigher $\\sigma_{\\rm gas}$ may also \ntrace star formation-induced turbulence in galactic disks \\citep{Faucher-Giguere+13},\nsuch as turbulence injected in the gas by SNe explosions, which would naturally \ndepend on the SFR (e.g. \\citealt{Shetty+Ostriker12,Hopkins+12}).\nIndeed, observationally, vertical disk velocity dispersions in the gas (increased by turbulence) \nwould be convolved with circular velocities due to\ninclination effects, thereby affecting the sightline-averaged gas velocity dispersions. \n\\cite{Faucher-Giguere+13} suggested that turbulence resulting from stellar feedback regulates the \nthe rate of formation of giant molecular clouds (GMCs),\nwhere most of star formation takes place, thereby having an important role in regulating the global\ndisk-averaged star formation efficiency in galaxies \\citep{Faucher-Giguere+13}. \nThe tendency of galaxies with higher SFRs (as traced by their IR luminosity) to show \nlarger optical emission line widths was already evidenced by earlier observational studies \\citep{Veilleux+95, Lehnert+Heckman96}.\nHowever, more recent results by \\cite{Arribas+14} indicate that star formation-driven turbulence\nmay have only a marginal role in increasing the velocity dispersion of ionised gas in galaxy disks. These authors suggested\nthat, at least in (U)LIRGs, galaxy interactions and AGNs may instead be \nthe main responsible for the presence of dynamically hot gas disks.\n\nFig.~\\ref{fig:sigma} shows also the line-of-sight velocity dispersion\nof gas and stars as a function of M$_*$ (second column), with the bins colour-coded by their SFR, i.e. the \ndiagram orthogonal to the one in the first column. As already pointed out,\na positive correlation is expected since the stellar mass is a proxy for the total\ndynamical mass of a system, and higher dynamical masses result in\nhigher velocity dispersions for gas and stars. The scatter is mostly ascribable to\ndifferences in SFR. For M$_{*}>10^{10}$~M$_{\\odot}$, where the relationship between $\\sigma_{\\rm stars}$ and\nSFR flattens (as shown in the first column plot), the correlation between $\\sigma_{\\rm stars}$ and ${\\rm M_{*}}$ tightens.\n\nFor fixed stellar mass (indicated by the colour coding), the trends of $\\sigma$\nvs sSFR reported in the third column of Fig.~\\ref{fig:sigma} are identical to the trends vs SFR, only shifted\nby ${\\rm -log(M_{*})}$. This is a natural consequence of binning galaxies in the\n${\\rm M_{*}-SFR}$ parameter space. We show in these plots the range of sSFR corresponding to the\nMS of local star-forming galaxies (Figure~\\ref{fig:grid_sf}), calculated between \n${\\rm 9.0 \\leq log(M_{*}) \\leq 11.0}$\\footnote{Without including the MS scatter of $\\pm0.3$ dex in SFR.} following \\cite{Peng+10} as\ndetailed in $\\S$~\\ref{sec:stacking}.\nSuch sSFR range is very narrow, and this constitutes a fundamental property of the galaxy population:\nthe sSFR, that is the ratio between ongoing star formation (i.e. SFR) and past-integrated star formation\n(i.e. ${\\rm M_{*}}$) is roughly constant in star-forming galaxies at a given epoch \\citep{Peng+10} (however,\nsee also discussion in \\cite{Gavazzi+15} and references therein according to which the MS relation changes \nslope above a turnover stellar mass, resulting in a decrease of sSFR with M$_*$ in normal star forming galaxies).\n\nIn conclusion, the widths of the [OIII] and H$\\alpha$ LoSVDs are not the\nmost appropriate tools to investigate galactic outflows: although the correlations observed \nin Fig.~\\ref{fig:sigma} between $\\sigma$ and\nSFR (or sSFR) are likely probing also galactic outflows, there are other effects that may affect these trends,\nsuch as the previously discussed possible projection effects, star formation-induced turbulence in the disk, and the effects of variations in the total \ndynamical mass \non the virial motions of stars and gas. In order to reduce the influence of virial motions and to shed light\non the effects of galactic outflows on the ionised gas dynamics, we need to focus our investigation on the {\\it high\nvelocity tail} of the LoSVDs.\n\n\\begin{figure}[tb]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_oiii_v01_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_ha_v01_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 1.8cm,angle=90,width=1.\\columnwidth]{plot_stars_v01_new.ps}\n   \\caption{(Modulus of the) 0.1th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 0.1th percentile\n\t\tvelocity corresponds to -3 standard deviations ($\\sigma$) from the mean velocity, and therefore it probes the\n\t\thigh velocity blueshifted tail of the LoSVD. Similarly to Fig.~\\ref{fig:sigma}, we report for each plot the Spearman\n\t\trank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v01}\n\\end{figure}\n\nTo this purpose, we calculate the 0.1th, 2.3th,15.9th, 84.1th, 97.7th and 99.9th percentile velocities \nof the LoSVDs of gas and stars. We chose these values because,\nin a Gaussian distribution, they correspond respectively to $-3\\sigma$, $-2\\sigma$, $-1\\sigma$,\n$1\\sigma$, $2\\sigma$ and $3\\sigma$, where $\\sigma$ is the standard deviation of the Gaussian distribution.\nThe $N$-th percentile velocity, $v_N$, is defined as: \n\n", "index": 15, "text": "\\begin{equation}\nP(v < v_N) = \\int_{-\\infty}^{v_N} \\mathcal{L}(v) dv = N,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"P(v&lt;v_{N})=\\int_{-\\infty}^{v_{N}}\\mathcal{L}(v)dv=N,\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo>&lt;</mo><msub><mi>v</mi><mi>N</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi mathvariant=\"normal\">∞</mi></mrow><msub><mi>v</mi><mi>N</mi></msub></msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>v</mi><mo>=</mo><mi>N</mi><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\n\nWe note that such approximation reflects the fact that \nthe typical outflows detected in our galaxy sample are rather modest, and most likely\nconsist of localised bubbles and chimneys, emanating from star forming regions spread across\nthe stellar disk (see also the case of NGC~1569 discussed by \\citealt{Martin+02}). In this scenario, the outflowing\nmaterial participates, at least to some extent, also to the virial (rotational) motions in the galaxy.\nHowever, we stress that Eq.~\\ref{eq:outflow_conv} is not universally applicable. In particular,\nEq.~\\ref{eq:outflow_conv} does not hold if the kinematics of the high velocity gas \nis largely {\\it dominated} by a large-scale ``bulk outflow'' expanding perpendicular to the disk. This is the case\nof powerful starburst-driven superwinds (e.g. M~82, NGC~253) if they are probed on scales of at least a few kpc, i.e.\nsufficiently larger than the typical vertical scale height of the stellar disk, where the motions of the gas in outflow is clearly \ndistinct from the disk motions. Indeed, even the strong ``bulk outflows'' that develop in powerful starbursts such as M~82 \nappear to originate as a collection of individual chimneys expanding out from the disk that subsequently merge to form the classical\nbiconical outflows observed on kpc scales \\citep{Wills+99,Lehnert+Heckman96}.\n\nFollowing from Eq.~\\ref{eq:outflow_conv}, by (simplistically) approximating both $\\mathcal{L}_{\\rm virial}(v)$ and $\\mathcal{L}_{\\rm outflow}(v)$\nwith Gaussian distributions, the line-of-sight velocity dispersion of the gas corresponds to:\n\n", "itemtype": "equation", "pos": 109639, "prevtext": "\nwhere $P(v < v_N)$ is the probability of observing, with the given line-of-sight velocity distribution $\\mathcal{L}(v)$, velocities\nlower than $v_N$, and ${\\int_{-\\infty}^{+\\infty} \\mathcal{L}(v) dv = 1}$.\n\nFigure~\\ref{fig:v01} shows the 0.1th percentile velocities of the [OIII], H$\\alpha$ and stellar LoSVDs as a function of SFR,\nM$_*$ and sSFR. The corresponding plots obtained for the other \npercentile velocities are shown in the Appendix (Figures~\\ref{fig:v16} to ~\\ref{fig:v99}).\nThe results of the Spearman rank test performed on the relationships between the various LoSVD parameters \n($\\sigma$ and percentile velocities) and galaxy parameters (SFR, M$_*$ and sSFR), for both gas and stars, are \nreported in Table~\\ref{table:rho_values} to facilitate the comparison between the different relationships shown in \nFigs.~\\ref{fig:sigma}, \\ref{fig:v01} and \\ref{fig:v16}--\\ref{fig:v99}.\n\n\\begin{table}[tb]\n\\small\n \\begin{minipage}{80mm}\n  \\caption{Spearman rank correlation parameters$^\\dag$}\n  \\label{table:rho_values}\n\\begin{tabular}{@{}rccc@{}}\n\\hline\n\\hline\n  \t   \t\t\t&  [OIII] \t\t\t\t\t\t& H$\\alpha$  \t\t\t&   stars   \t\\\\\n\t\t\t\t& $\\rho$ (p-value)\t         \t& \t $\\rho$ (p-value)      \t& $\\rho$ (p-value) \t\\\\\n\\hline\n$\\sigma$ vs SFR\t&\t0.906 (1.5E-19)\t\t& 0.918 (7.5E-21)\t\t&\t0.795 (5.4E-12)\t\\\\\n$v_{15.9}$ vs SFR\t&\t0.826 (1.6E-13)\t\t& 0.852 (4.4E-15)\t\t&\t0.825 (1.7E-13) \t\\\\\n$v_{2.3}$ vs SFR    \t&\t0.891 (4.7E-18)\t\t& 0.925 (8.5E-22)\t\t&\t0.792 (7.3E-12)\t\\\\\n$v_{0.1}$ vs SFR\t&\t0.938 (8.9E-24)\t\t& 0.935 (2.7E-23)\t\t&\t0.788 (1.1E-11)\t\\\\\n$v_{84.1}$ vs SFR\t&\t0.760 (1.5E-10)\t\t& 0.735 (1.2E-09)\t\t&\t0.787 (1.3E-11)\t\\\\\n$v_{97.7}$ vs SFR    &\t0.889 (6.5E-18)\t\t& 0.885 (1.6E-17)\t\t&\t0.756 (2.3E-10)\t\\\\\n$v_{99.9}$ vs SFR\t&\t0.921 (2.5E-21)\t\t& 0.894 (2.2E-18)\t\t&\t0.731 (1.7E-09)\t\\\\\n\\hline\n$\\sigma$ vs M$_*$\t&\t0.810 (9.9E-13)\t\t& 0.752 (3.0E-10)\t\t&\t0.810 (1.1E-12)\t\\\\\n$v_{15.9}$ vs M$_*$ &\t0.832 (7.0E-14)\t\t& 0.790\t(9.4E-12)\t\t&\t0.802 (2.7E-12)\t\\\\\n$v_{2.3}$ vs M$_*$   &  \t0.808 (1.3E-12)\t\t& 0.730 \t(1.8E-09)\t\t&\t0.808 (1.3E-12)\t\\\\\n$v_{0.1}$ vs M$_*$\t &\t0.678 (6.2E-08)\t\t& 0.638\t(6.3E-07)\t\t&\t0.807 (1.4E-12)\t\\\\\n$v_{84.1}$ vs M$_*$\t &\t0.886 (1.3E-17)\t\t& 0.820 (3.4E-13)\t\t&\t0.792 (7.3E-12)\t\\\\\n$v_{97.7}$ vs M$_*$  &\t0.810 (1.1E-12)\t\t& 0.754\t(2.5E-10)\t\t&\t0.815 (6.2E-13)\t\\\\\n$v_{99.9}$ vs M$_*$\t &\t0.566 (1.9E-05)\t\t& 0.657\t(2.2E-07)\t\t&\t0.811 (8.8E-13)\t\\\\\n\\hline\n$\\sigma$ vs sSFR\t&\t0.175 (0.22)\t\t\t& \t0.246 (0.085)\t\t&\t0.059 (0.69)\t\t\\\\\n$v_{15.9}$ vs sSFR\t&\t0.069 (0.64)\t\t\t& \t0.142 (0.33)\t\t\t&\t0.094 (0.52)\t\t\\\\\n$v_{2.3}$ vs sSFR    &\t0.159 (0.27)\t\t\t& \t0.268 (0.059)\t\t&\t0.054 (0.71)\t\t\\\\\n$v_{0.1}$ vs sSFR\t&\t0.332 (0.019)\t\t& \t0.371 (0.0081)\t\t&\t0.051 (0.73)  \t\\\\\n$v_{84.1}$ vs sSFR\t&\t-0.044 (0.76)\t\t& \t-0.002 (0.99)\t\t&\t0.070 (0.63)\t\t\\\\\n$v_{97.7}$ vs sSFR  &\t0.160 (0.27)\t\t\t& \t0.207 (0.15)\t\t\t&\t0.019 (0.90)\t\t\\\\\n$v_{99.9}$ vs sSFR\t&\t0.435 (0.0016)\t\t& \t0.314 (0.026)\t\t&\t-0.005 (0.97)\t\\\\\n\\hline\n\\end{tabular}\n\\end{minipage}\n\n\\begin{flushleft}\n\\small\n\\textbf{Notes:} $^\\dag$ This table lists the Spearman rank correlation\ncoefficients ($\\rho\\in(0.1)$) and corresponding two-sided p-values calculated for the relationships between LoSVD \nparameters (velocity dispersion and percentile velocities) and galaxy properties (SFR, M$_*$, sSFR)\nthat are shown in Figs.~\\ref{fig:sigma}, \\ref{fig:v01} and Figs. ~\\ref{fig:v16}--\\ref{fig:v99}.\nA high value of $\\rho$ (e.g. $\\rho\\gtrsim 0.5$) combined with a low p-value ($\\leq 0.05$) indicates\nthe presence of a statistically significant correlation.\n\\end{flushleft}\n\\end{table}\n\nIt is clear from Table~\\ref{table:rho_values} that the velocity dispersions and the\npercentile velocities show all significant correlations \nwith SFR and M$_*$, for both the gas and the stars. There are however important differences\namong the various LoSVD parameters, in particular between the 15.9th\nand the 0.1th percentile velocities.\nMore specifically, by moving towards the high velocity blueshifted tail of the LoSVD\n(i.e. from the 15.9th to the 0.1th percentile velocity), the correlation between gas velocity and SFR \ntightens (the Spearman correlation coefficient $\\rho$ increases), whereas the correlation between\nstellar velocity and SFR weakens slightly ($\\rho$ decreases). A similar trend is evidenced also for the \nredshifted tail of the LoSVD (i.e. from the 84.1th to the 99.9th percentile velocity). \nThese results strengthen the hypothesis that the high velocity tail of the ionised gas LoSVD traces\nmainly star formation-feedback related mechanisms and is little affected by other mechanisms, which instead dominate the relationships\nbetween stellar velocity and SFR.\nThe correlation between gas velocity and SFR is slightly tighter at blueshifted than at redshifted velocities\n(especially if using H$\\alpha$ as a tracer), probably because of dust extinction affecting\nmostly the receding (i.e. redshifted) side of the outflow. \nFurthermore, Table~\\ref{table:rho_values}\nshows that the correlation between ionised gas velocity and M$_*$  \nweakens (and almost breaks down, as clearly shown in the corresponding plots in Fig.~\\ref{fig:v01} and Figs.~\\ref{fig:v84}--\\ref{fig:v99}) \ntowards the high velocity tail of the LoSVD ($\\rho$ decreases), suggesting that gravity (as traced by M$_*$)\ndoes not play an important role in determining the dynamics of the high-velocity gas.\n\nIn summary, by exploring the relationships between the different percentile velocities\nof the LoSVDs of gas and stars and the galaxy parameters, we \n infer that the correlation with the SFR is tighter for the ionised gas at higher percentile velocities and, in particular,\nthat the high velocity (blueshifted or redshifted) tails of the gaseous LoSVDs depend tightly on the SFR (correlation coefficient\n$\\rho\\gtrsim0.9$) and more weakly ($\\rho<0.7$) on the stellar mass. This result supports the hypothesis that, \nin the high velocity regime, the\ngas kinematics progressively ceases to probe the dynamical mass of galaxies (which is in first approximation\ntraced by the stellar mass), but it is instead intrinsically related to the rate at which stars are formed, likely because of the\npresence of stellar feedback mechanisms. \n\nHowever, regardless of the correlations observed between the various LoSVD parameters ($\\sigma$ and percentile\nvelocities) and galaxy properties (SFR, M$_*$, sSFR) that have been discussed in this Section (Table~\\ref{table:rho_values}), \nin order to isolate the effects of outflows from other mechanisms we need to investigate the {\\it differences} between the \nLoSVDs of gas and stars. Indeed, by looking at the galaxy stacks where the difference \n$(v_{\\rm gas}-v_{\\rm stars})$ is significantly greater than zero, we can identify galaxies where the \nmotions of gas and stars are clearly decoupled, and so galaxies where outflows are most likely taking place. Differences between\nthe gaseous and stellar kinematics and their dependency on galaxy properties \nwill be investigated in $\\S$~\\ref{sec:outflows}.\n\n\\subsection{Asymmetries in the LoSVDs of gas and stars}\\label{sec:asym}\n\nAsymmetric wings of nebular emission lines usually trace perturbed gas, \nwhose dynamics is not consistent with purely\nvirial motions but that can be instead explained with radial (outward or inward) motions in conjunction with dust\nextinction effects. The presence of a blue asymmetry is commonly interpreted in terms of \noutflows, because obscuration by dust in the galaxy disk affects primarily the backside receding gas\n(e.g. \\citealt{Lehnert+Heckman96,Villar-Martin+11,Soto+12}).\n\n\\begin{figure}[tb]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1cm .5cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_oiii_v2_v98_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1cm 2.2cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_ha_v2_v98_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1cm  2.2cm 3.1cm,angle=90,width=1.\\columnwidth]{plot_stars_v2_v98_diff_new.ps}\n   \\caption{Blue asymmetry of the [OIII] (\\emph{top panel}),  H$\\alpha$ (\\emph{middle panel}) \n   \t       and stellar (\\emph{bottom panel}) LoSVDs, as measured by the \n   \t       difference between the (moduli of the) 2.3th and 97.7th percentile velocities\n\t       (i.e. $y = |v_{2.3}|-|v_{97.7}|$). For display purposes, only the less noisy bins are plotted, i.e.\n\t       bins with either $\\sigma_{y} < 50~{\\rm km~s^{-1}}$ or $|y| \\geq 2\\sigma_{y}$.\n\t       The Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate stronger correlation) \n\t       is reported for each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant). }\n   \\label{fig:v2_v98_diff}\n\\end{figure}\n\nVisual inspection of the LoSVD profiles of gas and stars shown in Figs.~\\ref{fig:losvd_oiii_2} \nto \\ref{fig:losvd_stars_1} suggests that the line-of-sight\nvelocity distributions of both gas and stars are not symmetrical. We further investigate\nthis possibility in Fig.~\\ref{fig:v2_v98_diff}, where we plot, as a function of SFR, M$_*$ and sSFR, the\n difference between the (moduli of the) \n2.3th and 97.7th percentile velocities, i.e. ${|v_{2.3}|-|v_{97.7}|}$, evaluated for \n[OIII], H$\\alpha$ and stars.\nFigure~\\ref{fig:v2_v98_diff} shows that \nalmost all galaxy bins (a part form a few, noisier stacks) exhibit\na clear blue asymmetry in the LoSVDs of [OIII] and H$\\alpha$, with ${|v_{2.3}|-|v_{97.7}|}$ values\nranging between $\\sim0$~km~s$^{-1}$ and $\\sim100$~km~s$^{-1}$. \nVery surprisingly, also the stellar LoSVDs are affected by a blueward asymmetry, although less pronounced\nthan in the gas. The velocity difference ${|v_{2.3}|-|v_{97.7}|}$ measured for the stars is\nconsistent with zero at low SFRs. However, in galaxy bins with\n${\\rm SFR \\gtrsim 0.1~M_{\\odot}~yr^{-1}}$, ${|v_{2.3}|-|v_{97.7}|}$ increases up to\nvalues of a few tens of km~s$^{-1}$, with\nlarge uncertainties, but still significantly larger than zero and therefore inconsistent \nwith the absence of any asymmetry.\n\nThe presence of a blue asymmetry in the LoSVDs of [OIII] and H$\\alpha$ \nis suggestive of galactic outflows.\nThe hypothesis of star formation-driven outflows\nis corroborated by the correlation observed between\nthe H$\\alpha$ blue asymmetry (as traced by ${|v_{2.3}|-|v_{97.7}|}$)\nand the SFR ($\\rho$=0.594), and by the hint of a \ncorrelation observed for [OIII] ($\\rho$=0.361).\nWe note however that the dust properties of galaxies may also affect the trends observed\nfor [OIII] and H$\\alpha$ in Fig.~\\ref{fig:v2_v98_diff}.\nIndeed \\cite{Santini+14}, by using {\\it Herschel} observations of local and intermediate-redshift ($z\\lesssim2.5$)\ngalaxies, found a tight correlation between dust mass\nand star formation rate, which they interpreted as a consequence of the Schmidt--Kennicutt law\n(since dust and gas mass are related). Therefore, the positive correlation between \n${|v_{2.3}|-|v_{97.7}|}$ and SFR observed for the ionised gas is \nlikely due to the combined effect of star formation-driven outflows and \n${\\rm M_{dust}}$--SFR proportionality, since dustier galaxy disks result in more pronounced line\nasymmetries. The evidence for a relationship between LoSVD blue\nasymmetry and stellar mass is instead more marginal ($\\rho=0.362$ and $\\rho=0.279$, respectively for [OIII] and H$\\alpha$,\nsecond column of Fig.~\\ref{fig:v2_v98_diff}). The absence of a clear correlation is consistent\nwith the recent results by \\cite{Santini+14}, who showed that the positive correlation \nbetween dust and stellar mass found by previous studies significantly flattens when separating galaxies \naccording to their SFR.\n\nFigure~\\ref{fig:v2_v98_diff} shows that, in the stellar LoSVDs, blue asymmetries are also present but, due to\nthe large uncertainties, it is very difficult to investigate possible relationships with galaxy properties. However,\nwe note that there is some evidence for a weak correlation between stellar blue asymmetry and SFR ($\\rho=0.551$),\nand an even more marginal one with stellar mass ($\\rho=0.401$), vaguely recalling the corresponding trends\nobserved in ionised gas.\n\nIn Figure~\\ref{fig:appendixB} ($\\S$~\\ref{sec:losvd_stars}) we showed a check on the stellar continuum fitting for two galaxy stacks: one exhibiting \na blue asymmetry in the stellar LoSVD, and one with no asymmetry.  These plots demonstrate that the detection of such a faint\nfeature in the stellar kinematics of external galaxies is made possible thanks to the high signal-to-noise reached in the composite\nspectra, which allows us to fit the stellar continuum (and so extract the stellar kinematics) with unprecedented accuracy.\nTo our knowledge, blue asymmetries in the stellar LoSVDs of external galaxies have never been observed before.\nIndeed, while an intrinsic kinematic asymmetry or ``lopsidedness'' in the stellar distribution is certainly possible for individual galaxies \nor at specific locations within galaxies, for example\ndue to stellar bars, galaxy interactions or even \ncounter-rotating disks (e.g. \\citealt{Krajnovic+15}), such effects should average out when \ncombining the integrated spectra of thousands of different galaxies. The observation\nof an asymmetry of the stellar LoSVD that is {\\it consistently blue} (and never red) could be explained by \nthe presence of stars in radial outward motions in galaxies, combined with obscuration by dust lanes in the galactic disk.\nDust in the disk would hamper mainly the detection of stars moving away from the galaxy with a redshifted (line-of-sight) velocity component, \nhence skewing the average stellar LoSVD towards blueshifted velocities.\n\nThe blue asymmetries in the stellar LoSVDs suggest \nthat high-velocity runaway stars, hypervelocity stars (HVS, \\cite{Brown+05})\nand possibly high-velocity stellar clusters \\citep{Caldwell+14}\nin radial motions may be a rather common phenomenon in star forming galaxies.\nHigh velocity stars in radial trajectories are usually very difficult to detect even in our own galaxy.\n\\cite{Palladino+14} discovered a sample of 20 candidate hypervelocity stars in the Milky Way, \nthe bulk of which have velocities between 600 and 800~km~s$^{-1}$, and in at least\nhalf of the cases exceed the escape velocity from the Galaxy.\nThese are G- and K-type dwarf stars, hence less massive and older than the\ntypical massive B-type HVSs \\citep{Brown+12a}.\nInterestingly, the trajectories of the stars detected by \\cite{Palladino+14} are not consistent with ejection\n via three-body interactions between a binary system and the SMBH of our Galaxy or of M31, which\n is currently the most popular explanation for young B-type hypervelocity stars \\citep{Hills88,Yu+Tremaine03}\n and predicts that one component of the binary system remains in a bound orbit around the SMBH.\nOn the contrary, the HVS candidates detected by \\cite{Palladino+14} appear to \noriginate from all directions, suggesting \nthat another mechanism must be capable of accelerating stars to high speeds, such\nas a supernova explosion in a close binary system \\citep{Blaauw61, Zubovas+13b}, which is\ncurrently the most likely origin of lower speed runaways ejected from the galactic disk \\citep{Brown+15}.\nNotably, the fastest HVS ever detected, US~708, with a Galactic rest-frame velocity of 1200~km~s$^{-1}$, has been recently\nconfirmed to be a solid candidate for an ejected Type Ia supernova donor remnant \\citep{Geier+15}.\nThe supernova binary ejection scenario may be a viable explanation for our observations, supported by the tentative\ncorrelation observed in Fig.~\\ref{fig:v2_v98_diff} between the stellar blue asymmetry and the SFR.\n\n However, although HVSs may provide a plausible explanation for the blue asymmetries observed\nin the stellar LoSVDs of local star forming galaxies, the properties and origin of these features\nneed further and in-depth investigation with high signal-to-noise data such as will be delivered by ongoing \nsurveys (Gaia, MaNGA) and new facilities (MUSE, JWST, 30m class telescopes).\n  \n\\subsection{Outflow properties}\\label{sec:outflows}\n\nOverall, the presence and properties of the line-of-sight velocity distributions of ionised gas\nas derived from composite spectra of nearby non-active galaxies suggest ubiquity of \nstar formation-driven galactic outflows. However, our analysis has also highlighted the presence of\nadditional factors, other than outflows, that are likely affecting the kinematics of\nboth the ionised gas and the stars, namely\nvirial motions, projection effects, gas content, and dust extinction. \nThe next step is to try to isolate in the data the effects of gas outflows,\ndisentangling them from other mechanisms, in order to get a completely unbiased picture of their\noccurrence and properties in local galaxies.\n\n\\begin{figure}[tp]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1.cm .8cm 2.3cm,angle=90,width=1.\\columnwidth]{plot_oiii_v01_stars_v99_diff_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 2.3cm,angle=90,width=1.\\columnwidth]{plot_ha_v01_stars_v99_diff_new.ps}\n   \\caption{Excess of line-of-sight velocity of the ionised gas with respect to the stars ($v_{\\rm gas}-v_{\\rm stars}$) as given \n   \t\tby $y = |v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\n   \t        for [OIII] (\\emph{upper panel}) and for H$\\alpha$ (\\emph{bottom panel}).\n\t       For display purposes, only the less noisy bins are plotted, i.e. only bins \n\t       with either $\\sigma_{y} < {\\rm 50~km~s^{-1}}$ or $|y| \\geq 2\\sigma_{y}$.\n\t       As explained in $\\S$~\\ref{sec:outflows}, the quantity $y$ is a reliable tracer of \n\t       ionised outflows only when it is\n\t       positive. \n\t       The Spearman rank correlation coefficient ($0<|\\rho|<1$, higher values of $|\\rho|$ indicate stronger correlation, \n\t       $\\rho<0$ if there is an anti-correlation) \n\t       is reported in each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant). }\n   \\label{fig:plot_outflow_3sigma}\n\\end{figure}\n\n\\begin{figure}[tp]\n\\centering\n   \\includegraphics[clip=true, trim=-2cm 0cm 0cm -2.1cm,angle=90,width=\\columnwidth]{plot_grid_oiii_outflow2.ps}\\\\\n   \\includegraphics[clip=true, trim=-2cm 0cm 0cm -2.1cm,angle=90,width=\\columnwidth]{plot_grid_ha_outflow2.ps}\n   \\caption{Grid of galaxy bins in the M$_*$--SFR parameter space used for the spectral stacking\n   \t(see also Fig.~\\ref{fig:grid_sf}). Each bin is colour-coded according to the line-of-sight\n      velocity difference $v_{\\rm gas}-v_{\\rm stars}$ as given by $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ for [OIII]\n     ({\\it upper panel}) and for H$\\alpha$ ({\\it lower panel}). The $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ values are also\n     reported for each bin.\n     The same bins as in Fig.~\\ref{fig:plot_outflow_3sigma} are plotted.}\n   \\label{fig:grid_outflow_3sigma}\n\\end{figure}\n\nThe plots in Figs.~\\ref{fig:sigma}, ~\\ref{fig:v01} and \\ref{fig:v2_v98_diff}\nprovided important clues on the concomitant mechanisms that have an impact on the \nLoSVDs of gas and stars. In the following, we briefly summarise\nsome logical deductions that will help us understand outflow properties:\n\\begin{enumerate}\n\\item The effects of virial motions on gas kinematics can be reduced considerably by looking at\nthe high velocity tail of the LoSVD of the ionised gas. In particular,\n the correlation between the line-of-sight velocity of the ionised gas and M$_*$ (which\nis related to the dynamical mass) is weaker for the 0.1th and 99.9th\n($\\rho\\sim0.6$) than for the 15.9th and 84.1th ($\\rho\\sim0.8$) percentile velocities (Table~\\ref{table:rho_values}). Moreover, the highest \nvelocities show the tightest correlation with the SFR ($\\rho\\gtrsim0.9$), indicating that the effects of star formation-driven \nfeedback is indeed predominant.\n\\item The stellar LoSVDs appear quite broad, with stellar \nvelocity dispersions as high as $\\sim170$~km~s$^{-1}$, \ni.e. as high as the highest $\\sigma$ observed in the ionised gas and, for large\nstellar masses, even higher than the gas, probably because of the presence of stellar bulges\nin massive galaxies combined with projection effects, as explained in $\\S$~\\ref{sec:kinematics}. \nAs a consequence, only the {\\it excess of gas\nvelocity with respect to the stars}, i.e. $v_{\\rm gas}-v_{\\rm stars}$, can reliably trace\ngas motions due to gaseous outflows.\n\\item Because of dust attenuation, the blueshifted side of the LoSVD of the gas\nis a better probe of outflowing gas than the redshifted side. Therefore, following\npoints (i) and (ii), gaseous outflows will be investigated through the 0.1th percentile velocity of the \nLoSVD of [OIII]\nand H$\\alpha$, from which we will subtract the corresponding stellar velocity.\n\\item Another complication for the study of ionised outflows is given by the presence of (modest) blue \nasymmetries in the stellar LoSVDs, \nwhose origin is not clear and may be related to\nnon virial motions of stars in galaxies. In the following analysis we\nwill assume that this effect can be reduced (if not completely removed) by \nsimply using the redshifted stellar velocities, i.e. by subtracting\nfrom the 0.1th percentile LoS velocity of the gas, the 99.9th (rather than the 0.1th) percentile LoS \nvelocity of the stars.\n\\end{enumerate}\nBy considering points 1 to 4, the most appropriate tracer of ionised outflows\nis then given by the velocity difference $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\\footnote{We  \nnote that the velocity differences \n$|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and $|v_{\\rm 0.1~gas}|-|v_{\\rm 0.1~stars}|$ \nused as outflow tracers produce results that are overall consistent. However, $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\nis probably a better choice because it allows us to minimise the effects due the \npresence of a blue asymmetry in the stellar LoSVDs, whose main consequence is lowering our\nestimate of $v_{\\rm gas}-v_{\\rm stars}$, especially when using H$\\alpha$ emission to trace the gas.}:\nthis quantity will be used to track ``secure'' outflows in\ngalaxy stacks. Indeed, if $(v_{\\rm gas}-v_{\\rm stars})>0$, then the\nkinematics of gas and stars are decoupled and we are reliably tracing gaseous outflows. \nThe only other mechanism\nthat would explain such decoupling would be galaxy mergers, but the merger fraction is\nnegligible in the local Universe \\citep{Patton+Atfield08}, so gaseous \noutflows are the only viable explanation.\n\nFigure~\\ref{fig:plot_outflow_3sigma} shows the\nrelationships between the quantity $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$, evaluated for both\n[OIII]- and H$\\alpha$-emitting gas, and the \ngalaxy physical parameters (i.e. SFR, ${\\rm M_{*}}$ and sSFR). In Fig.~\\ref{fig:grid_outflow_3sigma} we show\nthe stacking grid in the M$_*$--SFR parameter space defined by the sample of local star forming\ngalaxies used in this study (i.e. the same grid as Fig.~\\ref{fig:grid_sf}), with each bin colour-coded according to the\nvalue of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ (measured for [OIII] and H$\\alpha$).\n\nIt is worth emphasising that the negative values of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$\nestimated in some galaxy bins (especially at ${\\rm log(M_{*} [M_{\\odot}]) \\geq 10.0}$), \nare probably a consequence of\nthe conjunction of projection effects and of the absence of detectable galactic outflows.\nMore specifically, ignoring galactic outflows (which usually expand out perpendicular to the galactic disk, \nalong its minor axis, as shown by observations, e.g.\n\\citealt{Lehnert+Heckman96, Heckman+00, Chen+10, Rubin+14, Cazzoli+14}), \nthe ionised gas is confined to the plane of the galactic disk, and the projection effects described in $\\S$~\\ref{sec:kinematics},\naffecting mostly observations of face-on galaxies with a prominent stellar bulge (which dominate\nthe population of high-M$_*$ galaxies, e.g. \\citealt{Gavazzi+15}), can be even more accentuated.\nFor this reason, negative values of $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ simply indicate galaxy\nbins in which outflows are not present, or in which outflows are not prominent enough to be detected:\nas a consequence, this quantity can reliably trace outflows\n{\\it only when it is positive}.\n\nAlthough many attempts have been made to establish fundamental\n``scaling'' relationships linking outflows and galaxy properties \n\\citep{Martin05, Rupke+05,Chen+10, Westmoquette+12, Martin+12, Rubin+14, Arribas+14, Heckman+15},\nthe general picture remains unclear and contradictory. The main reason\nfor this impasse may be the absence of a study on galactic outflows of large statistical significance: \nmost of previous studies relied on limited samples of objects,\nshowing extreme characteristics and spanning only a narrow range\nof galaxy properties (e.g. SFR, M$_*$). As a consequence, previous results do not adequately \nrepresent the whole local population of galaxies. Our analysis instead capitalises on a large statistical\nand almost unbiased sample of local star forming galaxies, particularly suitable for determining scaling\nrelationships between galactic outflows and galaxy properties.\nMoreover, our method allows, to accurately identify and separate of the effects of star-formation driven \noutflows from the other mechanisms affecting the LoSVD of the gas. \n\nThe general picture emerging from Figs.~\\ref{fig:plot_outflow_3sigma} \nand \\ref{fig:grid_outflow_3sigma} is the following\\footnote{We stress that all results discussed in this section and in the subsequent\nanalyses do not depend on the choice of using $v_{\\rm 99.9~stars}$ instead of $v_{\\rm 0.1~stars}$ to measure $v_{\\rm stars}$.}: the excess of gas velocity\n with respect to the stars (i.e. $v_{\\rm gas}-v_{\\rm stars}$, as traced by $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$), which we use in this study to trace galactic outflows,\ndepends weakly on the SFR ($\\rho=0.602$ for [OIII], but for H$\\alpha$ the correlation with SFR is much weaker, $\\rho=0.311$, and not\nstatistically significant as indicated by the high p-value) and more tightly on the sSFR ($\\rho=0.804$ and $\\rho=0.485$ for [OIII] and H$\\alpha$ respectively).\nHowever, we note that for galaxy bins identified by higher stellar masses\nthe correlation between $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and SFR {\\it at a fixed M$_*$} \nbecomes significantly tighter for both [OIII] and H$\\alpha$, i.e. $\\rho>0.8$ (with $\\rm p-value\\ll0.05$) \nat M$_*\\geq10^{9.5}$~M$_{\\odot}$ and even more so at M$_*\\geq10^{10}$~M$_{\\odot}$, for which we measure \n$\\rho>0.95$.\n\nGlobally, there is instead no relation between \n$|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and M$_*$ (second column of Fig.~\\ref{fig:plot_outflow_3sigma}): \n$\\rho=-0.054$ for [OIII] and $\\rho=-0.242$ for H$\\alpha$, but with high p-values, implying \nthat such weak anti-correlation is not significant.\nFor some galaxy bins, an anti-correlation appears between $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ and M$_*$ {\\it at a fixed SFR}.\nThis effect is however highly significant ($\\rho<-0.9$) for both [OIII] and H$\\alpha$ only at\n$\\rm log(SFR [M_{\\odot}~yr^{-1}])=-1.0$ and $\\rm log(SFR [M_{\\odot}~yr^{-1}])=0.5$.\nSince the stellar mass traces the depth of the gravitational potential in galaxies, these observations\nwould suggest that, on equal SFRs, it becomes increasingly \ndifficult to launch gaseous outflows in larger gravitational potentials \nby means of star formation feedback only.\nThis qualitatively agrees with theoretical predictions (further discussed\nin $\\S$~\\ref{sec:discussion_outflows}) as well as with \nindirect observational evidence for a mass dependance of negative feedback \nprovided by studies of the ``mass-metallicity'' relationship in galaxies\n\\citep{Tremonti+04, Maiolino+08}.\nThese studies showed that \nthe gas-phase metallicity increases steadily with stellar mass, \nat least up to ${\\rm log(M_{*} [M_{\\odot}])\\simeq 10.5}$,\nsuggesting that low mass galaxies are less able than massive galaxies to retain in their gas \nphase the metals provided by supernova explosions, probably because they are more vulnerable to galactic outflows.\n\nIn addition, Fig.~\\ref{fig:plot_outflow_3sigma} reveals some interesting differences\nbetween [OIII] and H$\\alpha$ as tracers of ionised outflows. In particular, H$\\alpha$ emission\nseems to be a worse tracer of galactic outflows than [OIII] emission:\n(i) The correlation between $v_{\\rm gas}-v_{\\rm stars}$ and SFR is considerably weaker and less\nsignificant for H$\\alpha$ than for [OIII], and the same holds for the correlation with sSFR; \n(ii) for bins with $\\rm log(M_{*} [M_{\\odot}])= 11.0$, high values\nof $|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|$ are inferred by using [OIII], whereas no velocity excess is detected\nwhen using H$\\alpha$ emission as a gas tracer.\nQualitatively, an higher outflow ionisation in more massive galaxies\ncould explain the differences that we evidence between [OIII] and H$\\alpha$ as outflow tracers.\nWe note that it is unlikely that such a difference between the H$\\alpha$ and [OIII] LoSVDs is a consequence\nof residual stellar H$\\alpha$ absorption. Indeed, the H$\\alpha$ LoSVDs are obtained by fitting the H$\\alpha$ and\n[NII]$\\lambda\\lambda$6548,6583 lines simultaneously (see $\\S$~\\ref{sec:losvd_fit}), by constraining the kinematics \nof all components employed in the fit to be the same for the three lines. Therefore, the resulting LoSVDs reflect also\nthe kinematics traced by the [NII] lines, which are much less affected by possible residual stellar absorption.\n\nFinally, we note that there is an intriguing property of galactic outflows that stands out immediately \nfrom Fig.~\\ref{fig:grid_outflow_3sigma}:\nlocal non-active galaxies hosting powerful outflows are located {\\it above} the main sequence of star\nforming galaxies. \nThe absence (or insignificance) of galactic outflows along and/or below the MS, which\nwe show here for the first time in a clear way, probably constitutes a striking feature of the local galaxy population, and\nit may persist to higher redshifts, as marginally shown in outflow studies at $z\\sim1$ \\citep{Martin+12}.\nThe relationship between galactic outflows and the MS of star forming galaxies will be further discussed in\n$\\S$~\\ref{sec:discussion_MS}.\n\n\n\n\\section[]{Discussion}\n\n\\subsection{Implications of outflow properties for feedback models}\\label{sec:discussion_outflows}\n\nIntense star formation activity\nconveys energy and momentum to its surroundings, which can then be transmitted by various\nphysical mechanisms to larger scales, thus eventually impacting the entire host galaxy\nand affecting its capability of forming stars (negative feedback).\nAlthough negative feedback from star formation can manifest under various forms (such as galactic outflows\nof ionised, neutral and molecular gas, shocks, hot bubbles and cavities, metal-enrichment of the IGM), its direct and unambiguous \nsignature can be very difficult to detect in most galaxies.\nAs a consequence, the detailed physics underlying this phenomenon is not yet completely understood, as\nwell as its relevance for quenching star formation in galaxies.\nHowever, significant advances have been accomplished by theorists in this field, who,\nby also exploiting the valuable information provided by observational studies,\npropose two main scenarios for star formation-driven feedback to occur:\n\n\\begin{enumerate}\n\\item According to the first,``canonical'' scenario, the kinetic energy released by supernova explosions and,\nespecially in the very first stages of the starburst ($\\Delta t \\leq 10^7 \\rm yrs$) and at high metallicities ($\\mathcal{Z} \\geq \\mathcal{Z}_{\\odot}$), \nby stellar winds from OB and Wolf-Rayet stars, plays the most important role in counteracting and self-regulating star formation\n( ``energy-driven'' scenario, e.g. \\citealt{Chevalier77, Leitherer+92, Chevalier+Clegg85, Springel+Hernquist03, Veilleux+05}). \nThis feedback mechanism is subject to the thermalisation efficiency of the energy deposited into the ISM:\nsuch efficiency may vary, but it is believed to be around 1-10\\%; therefore, up to $\\sim$99\\% of \nthe total kinetic energy injected by star formation may be dissipated radiatively in dense gas \\citep{Chevalier77, \nMurray+05, Thornton+98, MacLow+Ferrara99}.\nIf the transfer from kinetic energy from SNe and stellar winds to cloud motions is efficient enough to unbind the gas in the galaxy, it can \ndrive strong and large-scale outflows \\citep{Chevalier+Clegg85}. \nA natural outcome of this model is that energy-driven outflows are more important, at a given\nSFR (which is directly related to the kinetic energy injected by supernova ejecta and by stellar winds into the ISM),\nin low mass galaxies residing in less massive dark matter halos, because it is easier \nfor gas to escape from their shallower gravitational wells \\citep{Dekel+Silk86,Springel+Hernquist03,Dave+11a}.\n\\item In the second scenario, the momentum transferred by the UV radiation from young and massive\nstars to dust and the momentum injected by supernova\nexplosions\\footnote{The latter is thought to be important especially at later stages and in regions where the infrared optical depth is low,\nsuch as at large radii from the galactic centre.} (``momentum-driven'' scenario) dominate \nthe feedback mechanism \\citep{Murray+05, Dave+11a}.\nThe advantage of momentum-driven outflows is that they can be effective even when radiative losses are high, because \nmomentum cannot be radiated away \\citep{Murray+05}. However, this feedback mechanism, in order to be effective, requires\nISM conditions that may not be satisfied in normal local star-forming galaxies, such as \nlarge optical depths to infrared radiation \\citep{Dave+11a, Hopkins+11}, as well as collisional coupling of gas and dust in the outflow\n\\citep{Murray+05, Dave+11a}. For these reasons, momentum-driven outflows may be most effective at launching\ncold and dense gas (which is likely hydrodynamically coupled to dust) in dusty star-forming\ngalaxies and AGNs \\citep{Murray+05, Fabian12}. \nWe note that in this model, according to the original formulation by \\cite{Murray+05}, the condition\nthat must be satisfied in order to launch gas outward via momentum injection\nis that the total momentum flux exceeds the gravitational force, which\ntranslates into a condition on the luminosity of the starburst $L \\geq L_{M}$, where $L_M$ is an\n``Eddington-like'' luminosity threshold. If $L\\geq L_{M}$, a momentum-driven wind\ndevelops, with velocity $v_{\\rm out} \\gtrsim 2\\sigma_{*}$ (where $\\sigma_*$ is the stellar velocity dispersion;\n\\citealt{Murray+05}).\n\\end{enumerate}\n\nIn $\\S$~\\ref{sec:outflows} we have identified the galaxy stacks displaying the signature of\ngalactic outflows as those for which the excess of gas velocity with respect to the stellar velocity, as estimated\nfrom the high-velocity tail of the LoSVD, is significant. More specifically,\nwe have considered values of ${|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$ significantly greater than zero\nas a clear signature of outflows.\nThe next step would be comparing the scaling relationships obtained for the observed\noutflows with the expectations of theoretical models.\nHowever, the quantity ${|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$, while being suitable\nfor {\\it identifying} outflows, is not appropriate for the comparison with models, because \nit has no clear interpretation in terms of the physical quantities usually employed by theorists.\nUnfortunately, because of the information lost with the stacking, it is not\npossible to estimate the mass entrained in the observed outflows,\nand therefore to calculate some important parameters such as mass-loss rate, \nkinetic power and momentum rate of the outflows, which would help to discriminate\nbetween different feedback models. Most importantly, spatially resolved spectroscopic information\nare needed to infer these quantities \\citep{Rupke+Veilleux13, Cazzoli+14, Arribas+14}. \nHowever, we can obtain a proxy of the outflow velocity, and this can be exploited to shed light on the\nphysical mechanism powering the ionised outflows.\n\nThe LoSVD of ionised gas traces a combination of dynamical\nmotions of gas clouds within the gravitational potential of the galaxy and of perturbed\nmotions due to star formation feeedback-related processes such as outflows and turbulence \nin the disk. In the following analysis, since we consider only the high-velocity tail of the LoSVD, we\nassume that outflows dominate over turbulence, and so, simplistically, that any non-gravitational motions of the gas\nat such high velocities are due to outflows and not to turbulence. Therefore, the LoSVD of the gas may be regarded as the \nconvolution of two line-of-sight velocity distributions, one tracing the virial motions,\nand the other one tracing the outflow:\n\n\n", "index": 17, "text": "\\begin{equation}\\label{eq:outflow_conv}\n\\mathcal{L}_{\\rm gas}(v) = \\mathcal{L}_{\\rm virial}(v)  \\ast \\mathcal{L}_{\\rm outflow}(v).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}_{\\rm gas}(v)=\\mathcal{L}_{\\rm virial}(v)\\ast\\mathcal{L}_{\\rm&#10;outflow%&#10;}(v).\" display=\"block\"><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>gas</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>virial</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∗</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>outflow</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwhere $\\sigma_{\\rm virial}$ can be approximated by the stellar line-of-sight velocity dispersion,\ni.e. $\\sigma_{\\rm virial} \\approx \\sigma_{\\rm stars}$.\nAs a result, the ``outflow'' line-of-sight velocity dispersion would be:\n\n", "itemtype": "equation", "pos": 111361, "prevtext": "\n\nWe note that such approximation reflects the fact that \nthe typical outflows detected in our galaxy sample are rather modest, and most likely\nconsist of localised bubbles and chimneys, emanating from star forming regions spread across\nthe stellar disk (see also the case of NGC~1569 discussed by \\citealt{Martin+02}). In this scenario, the outflowing\nmaterial participates, at least to some extent, also to the virial (rotational) motions in the galaxy.\nHowever, we stress that Eq.~\\ref{eq:outflow_conv} is not universally applicable. In particular,\nEq.~\\ref{eq:outflow_conv} does not hold if the kinematics of the high velocity gas \nis largely {\\it dominated} by a large-scale ``bulk outflow'' expanding perpendicular to the disk. This is the case\nof powerful starburst-driven superwinds (e.g. M~82, NGC~253) if they are probed on scales of at least a few kpc, i.e.\nsufficiently larger than the typical vertical scale height of the stellar disk, where the motions of the gas in outflow is clearly \ndistinct from the disk motions. Indeed, even the strong ``bulk outflows'' that develop in powerful starbursts such as M~82 \nappear to originate as a collection of individual chimneys expanding out from the disk that subsequently merge to form the classical\nbiconical outflows observed on kpc scales \\citep{Wills+99,Lehnert+Heckman96}.\n\nFollowing from Eq.~\\ref{eq:outflow_conv}, by (simplistically) approximating both $\\mathcal{L}_{\\rm virial}(v)$ and $\\mathcal{L}_{\\rm outflow}(v)$\nwith Gaussian distributions, the line-of-sight velocity dispersion of the gas corresponds to:\n\n", "index": 19, "text": "\\begin{equation}\n\\sigma_{\\rm gas}^2 =  \\sigma_{\\rm virial}^2 + \\sigma_{\\rm outflow}^2,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm gas}^{2}=\\sigma_{\\rm virial}^{2}+\\sigma_{\\rm outflow}^{2},\" display=\"block\"><mrow><mrow><msubsup><mi>σ</mi><mi>gas</mi><mn>2</mn></msubsup><mo>=</mo><mrow><msubsup><mi>σ</mi><mi>virial</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>σ</mi><mi>outflow</mi><mn>2</mn></msubsup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nWe note that Eq.~\\ref{eq:outflow_sigma} can be extended also to the percentile\nvelocities as, in the approximation of Gaussian distributions, they correspond to multiples\nof the velocity dispersion. Therefore, according to this line of reasoning, the \noutflow velocity can be approximated by the quantity $(v_{N,{\\rm gas}}^2-v_{N,{\\rm stars}}^2)^{1/2}$,\nwhere $v_{N}$ indicates the $N$-th percentile velocity. \n\nAs we commented earlier, because of the observed blue asymmetries observed in the {\\it stellar} LoSVDs \nof some galaxy stacks ($\\S$~\\ref{sec:asym}), \nthe percentile velocities on the blue side of the stellar LoSVD, i.e. the 15.9th, 2.3th and 0.1th, may be\nnot appropriate to trace virial motions in the galaxy. Therefore, in the following, we \nadopt the same strategy as in $\\S$~\\ref{sec:outflows} and define the outflow velocity as:\n\n", "itemtype": "equation", "pos": 111689, "prevtext": "\nwhere $\\sigma_{\\rm virial}$ can be approximated by the stellar line-of-sight velocity dispersion,\ni.e. $\\sigma_{\\rm virial} \\approx \\sigma_{\\rm stars}$.\nAs a result, the ``outflow'' line-of-sight velocity dispersion would be:\n\n", "index": 21, "text": "\\begin{equation}\\label{eq:outflow_sigma}\n\\sigma_{\\rm outflow} =  (\\sigma_{\\rm gas}^2 - \\sigma_{\\rm stars}^2)^{1/2}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{\\rm outflow}=(\\sigma_{\\rm gas}^{2}-\\sigma_{\\rm stars}^{2})^{1/2}.\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mi>outflow</mi></msub><mo>=</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>σ</mi><mi>gas</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>σ</mi><mi>stars</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04715.tex", "nexttext": "\nwhere the percentile velocity of the gas is chosen on the blue side of the LoSVD (because it\nis less affected by dust), i.e. $N$= 0.1, 2.3 or 15.9, and, for the stars,\nwe use $100-N$, which gives the corresponding percentile velocity on the red side of the LoSVD. \nWe note that $v_{\\rm out}$ can be inferred from Eq.~\\ref{eq:v_out} only in those cases for\nwhich $v_{N,{\\rm gas}} > v_{100-N,{\\rm stars}}$: this means that $v_{\\rm out}$ cannot be calculated\nfor quite a few bins below the MS, as illustrated by Fig.~\\ref{fig:grid_outflow_3sigma}.\n\n\\begin{figure}[tbp]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1.cm .8cm 2.7cm,angle=90,width=1.\\columnwidth]{plot_oiii_v16_stars_v84_diffsqradq_2_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1.cm 2.2cm 2.7cm,angle=90,width=1.\\columnwidth]{plot_ha_v16_stars_v84_diffsqradq_2_new.ps}\n   \\caption{Outflow velocity as given \n   \t\tby $(v_{\\rm 15.9~gas}^2-v_{\\rm 84.1~stars}^2)^{1/2}$ (see explanation in $\\S$~\\ref{sec:discussion_outflows})\n\t\tinferred from [OIII] ({\\it upper panel}) and H$\\alpha$ emission ({\\it bottom panel}), plotted as a function\n\t       of SFR, stellar velocity dispersion (as obtained from the fit to the stellar continuum), and sSFR.\n\t       The same bins as Fig. \\ref{fig:plot_outflow_3sigma} are plotted, excluding those for which\n\t       $(v_{\\rm 15.9~gas}^2-v_{\\rm 84.1~stars}^2)<0$. In the middle panels, the dashed lines indicate the \n\t       locus of points where $v_{\\rm out} = \\sigma_{\\rm stars}$.\n\t       The Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate stronger correlation) \n\t       is reported for each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant).}\n   \\label{fig:plot_outflow_vel_1sigma}\n\\end{figure}\n\n\\begin{figure}[tbp]\n\t \\centering\n   \\includegraphics[clip=true, trim=5.75cm 1cm .8cm 2.5cm,angle=90,width=1.\\columnwidth]{plot_oiii_v01_stars_v99_diffsqradq_2_new.ps}\\\\\n   \\includegraphics[clip=true, trim=1.8cm 1cm 2.2cm 2.5cm,angle=90,width=1.\\columnwidth]{plot_ha_v01_stars_v99_diffsqradq_2_new.ps}\n   \\caption{Outflow velocity as given \n   \t\tby $(v_{\\rm 0.1~gas}^2-v_{\\rm 99.9~stars}^2)^{1/2}$ (see explanation in $\\S$~\\ref{sec:discussion_outflows})\n   \t       inferred from [OIII] (\\emph{upper panel}) and H$\\alpha$ emission (\\emph{bottom panel}), plotted as a function\n\t       of SFR, stellar velocity dispersion (as obtained from the fit to the stellar continuum), and sSFR.\n\t       The same bins as Fig.~\\ref{fig:plot_outflow_3sigma} are plotted, excluding those for which\n\t       $(v_{\\rm 0.1~gas}^2-v_{\\rm 99.9~stars}^2)<0$. In the middle panels, the black dashed lines indicate the \n\t        locus where $v_{\\rm out} = \\sigma_{\\rm stars}$, and the grey dot-dashed\n\t        lines indicate the approximate upper envelopes of the distributions of values, given by the relationships:\n\t        $v_{\\rm out} = 6\\sigma_{\\rm stars}$ for [OIII], and\n\t        $v_{\\rm out} = 6\\sigma_{\\rm stars}$ for H$\\alpha$.\n\t        The Spearman rank correlation coefficient ($0<\\rho<1$, higher values of $\\rho$ indicate stronger correlation) \n\t       is reported for each plot, along with the corresponding \n\t       two-sided p-value (if the p-value is $\\leq \\alpha$, where $\\alpha=0.05$ is the level of significance, the observed correlation is \n\t       statistically significant). \n\t    }\n   \\label{fig:plot_outflow_vel_3sigma}\n\\end{figure} \n\nFigures~\\ref{fig:plot_outflow_vel_1sigma} and \\ref{fig:plot_outflow_vel_3sigma} show\nthe outflow velocity ($v_{\\rm out}$) as a function of galaxy properties (e.g. SFR, $\\sigma_*$ and sSFR), for two\ndifferent estimates of the outflow velocity, indicated as $v_{\\rm out, low}$ and $v_{\\rm out, high}$,\n probing respectively the low and the high velocity gas within the ionised outflows, \n and defined as $v_{\\rm out, low}\\equiv(v_{\\rm 15.9~gas}^2-v_{\\rm 84.1~stars}^2)^{1/2}$\nand $v_{\\rm out, high}\\equiv(v_{\\rm 0.1~gas}^2-v_{\\rm 99.9~stars}^2)^{1/2}$.\nWe note that in the middle panels of \nFig.~\\ref{fig:plot_outflow_vel_1sigma} and \\ref{fig:plot_outflow_vel_3sigma}\nthe outflow velocity is shown as a function of the stellar velocity dispersion \ninstead of the stellar mass, so that these trends can be readily compared to the predictions of \nmodels of star formation-driven feedback.\nFigures~\\ref{fig:plot_outflow_vel_1sigma} and \\ref{fig:plot_outflow_vel_3sigma} indicate\nthat the outflow velocity scales with SFR and sSFR. In particular, $v_{\\rm out, high}$, shows a very tight \n($\\rho>0.8$) correlation with the SFR. Previous studies found a similar increase of outflow\nspeed with SFR (e.g.  \\citealt{Martin05} using a sample of IR luminous galaxies at $z\\sim0$\\footnote{ Although the\ncorrelation in their Fig.~6 is mainly driven by the\nthree dwarf starbursts with detected NaID outflows from \\cite{Schwartz+Martin04}.}; \\citealt{Arribas+14} for outflows\ndetected in $z\\sim0$ (U)LIRGs; \\citealt{Chisholm+14} in local star forming and starburst galaxies; \n\\citealt{Heckman+11} and \\citealt{Heckman+15} using a a sample of UV-luminous starbursts and Lyman break\nanalogs at $z\\sim0$, \\citealt{Bradshaw+13} and \\citealt{Weiner+09} by means of a stacking analysis of star forming galaxies at the typical redshifts of $z\\sim1.2$\nand $z\\sim1.4$, respectively) and with sSFR \\citep{Bradshaw+13,Heckman+15}. However, the correlations found by previous studies are in most cases\nless significant than in our study, and inevitably based on smaller number statistics. \nFurthermore, the literature also reports many cases in which observations failed\nat finding a clear correlation between outflow velocity and SFR \n(e.g. \\citealt{Heckman+00}, \\citealt{Rupke+05}, \\citealt{Chen+10}, and \\citealt{Westmoquette+12} at $z\\sim0$ \\footnote{By using their data only,\nneither \\cite{Rupke+05} nor \\cite{Westmoquette+12} found a significant correlation between outflow velocity and SFR, the correlation\nappears only when including the dwarf starbursts from \\cite{Schwartz+Martin04}.}; \\citealt{Sato+09} at $z\\sim0.4$; \\citealt{Rubin+14} at \n$z\\sim0.5$; \\citealt{Kornei+12} and \\citealt{Martin+12} at $z\\sim1$; \n\\citealt{Erb+12} at $z\\sim1.5$). In most cases, the main issue appears to be the narrow dynamical range of host galaxy properties\nprobed by such outflow studies, which is crucial to recover scaling relations \\citep{Rupke+05,Westmoquette+12,Martin+12}.\nInspection of Figs.~\\ref{fig:plot_outflow_vel_1sigma} and \\ref{fig:plot_outflow_vel_3sigma} suggests that a strong\ncorrelation between outflow velocity and SFR is characteristic of galaxies with \n $\\rm log(SFR [M_{\\odot}~yr^{-1}]) \\gtrsim 0$; at $\\rm log(SFR[M_{\\odot}~yr^{-1}]) < 0$ \nthe dependence of $v_{\\rm out}$ on SFR is nearly flat.\n\nOverall we find that the outflow velocity increases with the stellar velocity dispersion,\nas shown by Fig.~\\ref{fig:plot_outflow_vel_3sigma} \n(a positive correlation between $v_{\\rm out, high}$ and $\\sigma_*$ is observed with\n$\\rho>0.6$ and p-value$\\ll 0.05$ \nfor both [OIII] and H$\\alpha$ outflows)\nand, to some extent, also \nby Fig.~\\ref{fig:plot_outflow_vel_1sigma} \n(a weak correlation between $v_{\\rm out, low}$ and $\\sigma_*$ is found for [OIII], although\nnot for H$\\alpha$). \n While the existence of a correlation between gas velocity and SFR is a more or\nless established property of galactic outflows, the relationship with stellar\nmass (or with the dynamical mass, as probed by the galaxy rotation speed or by the \nstellar velocity dispersion) is more controversial. \n\\cite{Lehnert+Heckman96}, in their sample of local, \nedge-on IR luminous galaxies did not find any relationship between the kinematical properties\n(emission line widths, velocity shear) of the ionised gas, as measured \nalong the minor axis\nof the disks (where outflows are found to dominate the gas kinematics), \nand galaxy rotation speeds. Similarly, \\cite{Heckman+00} showed that the NaI\noutflow velocity is unrelated to the galaxy rotational velocity. On the contrary, \\cite{Martin05} found an almost linear\nrelation with galaxy rotation speed (although they could only\ntest this relationship for a small fraction of the galaxy sample with available rotation curves).\nThe positive correlation between maximum outflow velocity and  \ngalaxy circular velocity found by \\cite{Rupke+05} is completely driven\nby the dwarf starburst sample of \\cite{Schwartz+Martin04}, highlighting once again the importance\nof probing a wide dynamical range in galaxy properties.  \nIn line with this hypothesis, \\cite{Arribas+14} found that the distribution of ionised \noutflow velocity as a function of galaxy dynamical mass\nis rather scattered in the (U)LIRG regime, i.e. for massive and highly star forming galaxies. \nThe results by \\cite{Heckman+11}, whose sample spans a wider range of galaxy properties, suggest\nthat outflow velocity and stellar mass are instead related.\nStudies at higher redshifts seem to find more consistently a correlation between outflow\nvelocity and M$_*$ in star forming galaxies \\citep{Weiner+09,Bradshaw+13,Rubin+14}.\n\nHigher stellar velocity dispersions trace deeper gravitational potentials.\nThe positive correlation that we observe in Fig.~\\ref{fig:plot_outflow_vel_3sigma} \nbetween $v_{\\rm out, high}$ and $\\sigma_*$ suggests that ionised\noutflows may still gain a velocity sufficiently high for gas to escape also from massive galaxies, and not\nonly from lower-mass galaxies (as it would be the case if the outflow velocity did not depend on M$_*$, in which\ncase the escape of the gas from low-mass galaxies would be favoured).\nHowever, we note that our analysis may be biased towards higher velocity outflows.\nIndeed, our method probably selects only outflows with\nvelocity close to or above the escape velocity from the galaxy, because we are selecting\ngas velocities in excess of the stellar velocity in order\nto avoid contamination by gas in virial motion.\nFigure~\\ref{fig:plot_outflow_vel_3sigma} also shows that, {\\it for a fixed SFR}, \nthe outflow velocity (in the high velocity regime) decreases with $\\sigma_*$. A possible explanation\nis that for a given SFR, i.e. for a given energy and momentum budget available\nto accelerate the gas, outflows are slowed down and re-captured \nby the gravitational potential in more massive galaxies,\nand therefore they become increasingly ineffective at higher masses.\n\nThe relationships between outflow velocity and stellar velocity dispersion\n(central panels of Figs.~\\ref{fig:plot_outflow_vel_1sigma} and \\ref{fig:plot_outflow_vel_3sigma}) suggest\nthat the physical mechanisms powering the lower and the higher velocity clouds in the observed ionised\noutflows may be slightly different.\nIndeed, at lower velocities ($v_{\\rm out, low}$), \nwhich trace the bulk of the gas in outflow\n\\footnote{By definition, $v_{\\rm out, high}$ probes only 0.1\\% of the LoSVD of ionised gas,\ni.e. the very high velocity tail of the outflow, which however only represents\na small fraction of the total LoSVD of the gas.}, the data points are placed\njust below the $v_{\\rm out} = \\sigma_{*}$ locus, indicating that \nradiation pressure-driven (or ``momentum-driven'') winds, which are characterised\nby $v_{\\rm out}\\gtrsim2\\sigma_*$ \\citep{Murray+05,Dave+11a}, \nare unlikely to dominate in this regime. \nInstead, these outflows may be \ngenerated by the kinetic energy injected into the ISM by\nsupernovae and stellar winds, i.e. ``energy-driven''.\nSimilarly, \\cite{Bouche+12}, by using background quasars to trace MgII blueshifted absorption\nin $z\\sim0$ galaxies, estimated outflow speeds that are on average half the escape velocity, although\nthese authors did not find any correlation with the SFR.\nOn the other hand, the situation changes significantly in the high velocity regime, \nas shown by Fig.~\\ref{fig:plot_outflow_vel_3sigma}, where the data\nlie mostly above the $v_{\\rm out} = \\sigma_*$ relationship. In this\ncase, momentum-driven winds may also be at play (see also\nfindings by \\citealt{Martin05}, \\citealt{Heckman+15} for what they define as ``strong outflows'' at $z\\sim0$, \nand by \\citealt{Weiner+09}, at $z\\sim1.4$).\nFigure ~\\ref{fig:plot_outflow_vel_3sigma} also suggests that the asymptotic velocity of\nthe observed ionised outflows is as high as $6-8~\\sigma_{\\rm stars}$, i.e. comparable to or \nhigher than the escape velocity ($v_{\\rm esc} \\simeq (5-6)\\sigma_*$, where $\\sigma_*$ is the line-of-sight\nstellar velocity dispersion, gives a conservative\nestimate of the escape velocity, e.g. \\citealt{Weiner+09}).\n\n\\subsection{The connection between galactic outflows and the main sequence of star-forming galaxies}\\label{sec:discussion_MS}\n\n\\begin{figure*}[tbp]\n\\centering\n   \\includegraphics[clip=true, trim=1.3cm 5.5cm 0.9cm 2cm,angle=90,width=1.5\\columnwidth]{plot_oiii_of3_deltams.ps}\\\\\n  \\includegraphics[clip=true, trim=1.3cm 5.5cm 1.2cm 2cm,angle=90,width=1.5\\columnwidth]{plot_ha_of3_deltams.ps}\\\\\n   \\caption{Excess of line-of-sight velocity of the ionised gas with respect to the stars (${v_{\\rm gas}-v_{\\rm stars}}$) as \n   given by ${y = |v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$, plotted as a function\n   of the offset from the local MS of star-forming galaxies. In the {\\it upper panel} the outflow velocity is measured\n   from [OIII] and in the {\\it lower panel} from H$\\alpha$. \n   As in Fig.~\\ref{fig:plot_outflow_3sigma}, only bins with either $\\sigma_{y} < {\\rm 50~km~s^{-1}}$ or ${|y| \\geq 2\\sigma_{y}}$\n   are shown. The black stars indicate the mean trend, obtained by averaging the data points (weighted with their errors) over \n   bins of  ${\\rm \\Delta log(SFR/SFR_{MS}) =0.5}.$}\n   \\label{fig:plot_of3_deltams}\n\\end{figure*}\n\nGalactic outflows and cosmic inflows are invoked as key moderators of the SFR \n(and sSFR) in galaxies through cosmic times. \nSpecifically, powerful galactic-scale outflows driven by AGNs and/or by \nextreme starburst episodes (possibly merger-driven) are thought to constitute the observational evidence\nfor the so called ``quenching'' mechanism acting on galaxies at all cosmic times\n(or ``mass-quenching'', distinct from the ``environment-quenching'',\n\\citealt{Peng+10, Peng+12}).\nSuch mechanism,\nthrough different physical processes yet poorly understood, \nshould eventually transforms disky star-forming galaxies into passive spheroids,\nthus generating the observed dichotomy between blue star forming and \nred passive galaxies \\citep{Baldry1+04}.\nCosmic inflows are believed to \nfeed galaxies through a smooth and continuous process, hence \ndirectly regulating the rate at which star formation occurs \\citep{Dekel+09,Bouche+10,Lilly+13}.\nThe tight correlation between stellar mass and SFR observed \nfrom $z\\sim0$ up to $z\\sim4$ \\citep{Schreiber+15} \nprovides the major observational support to the hypothesis\nof a ``cosmic feeding of star formation'', but direct observational evidence is still lacking.\n\nIn this scenario there is an effect that has been little explored from an observational point of view, that is\nthe possible role of galactic outflows in shaping the MS of star forming galaxies and,\nin particular, its {\\it upper envelope}.\nFigure~\\ref{fig:grid_outflow_3sigma} shows that ionised outflows are detected only in galaxies\nlocated above the MS on the ${\\rm M_{*}-SFR}$ diagram.\nThis effect can be visualised even better in Fig.~\\ref{fig:plot_of3_deltams}, where\nwe plotted the excess of line-of-sight velocity of the ionised gas with respect to the stars, i.e. \n${|v_{\\rm 0.1~gas}|-|v_{\\rm 99.9~stars}|}$ (for both [OIII] and H$\\alpha$), as a function of\nthe offset from the local MS (as derived in $\\S$~\\ref{sec:stacking}).\nFigure~\\ref{fig:plot_of3_deltams} shows a sharp increase of\noutflows at $\\rm SFR > SFR_{MS}$, where, for a given stellar mass, $\\rm SFR_{MS}$ represents\nthe SFR of a galaxy located on the MS.\nIn other words, we empirically observe that for a given stellar mass, when the SFR\nexceeds SFR$_{\\rm MS}$, the gas velocity increases significantly, with the\neffect of producing observable outflows. These outflows may eventually contribute to the suppression\nof the SFR by reducing gas available for star formation, therefore bringing the galaxy\nback onto the MS. Our observational result may reveal\na self-adjusting mechanism that explains the tightness of the local MS (i.e. $\\pm0.3$ dex). We note\nthat this hypothesis is consistent with the scenario recently proposed by \\cite{Tacchella+15}, who used \nsimulations of high-redshift star forming galaxies to explore the mechanisms that confine galaxies into a\nnarrow sequence in the ${\\rm M_{*}-SFR}$ plane.\n\nThe picture emerging from Figs.~\\ref{fig:grid_outflow_3sigma} and \\ref{fig:plot_of3_deltams} is\nconsistent with the abundant observational evidence for outflows in local starbursts and (U)LIRGs.\nOutflows of ionised, neutral and molecular gas are\na common feature of galaxies with intense star formation activity, as traced by their\nhigh infrared luminosities $L_{\\rm IR}(8-1000~{\\rm\\mu m}) \\geq 10^{11} L_{\\odot}$\n\\citep{Chung+11,Sturm+11,Westmoquette+12,Rupke+Veilleux13,Rodriguez-Zaurin+13,Veilleux+13,\nSpoon+13,Bellocchi+13, Cazzoli+14,Arribas+14, Cicone+14}.\nThese galaxies have larger SFR and sSFR than local MS galaxies (i.e. ${\\rm SFR > 10~M_{\\odot} yr^{-1}}$ and\nsSFR typically higher than ${\\rm 10^{-9}yr^{-1}}$, e.g. \\citealt{Combes+13}) \nand populate the upper-right region of the M$_{*}$--SFR diagram. \nPrevious observations at $z\\sim0$ are therefore consistent with our findings, i.e. that star formation-driven \ngalactic outflows are preferentially hosted by galaxies located above the local MS in the ${\\rm M_{*}-SFR}$ diagram.\n\nOn the contrary, except from \\cite{Martin+12}, outflows searches at higher redshifts revealed in general \nno dependency of galactic outflows on the galaxy position on the ${\\rm M_{*}-SFR}$ diagram with respect to \nthe MS \\citep{Rubin+14,Genzel+14, Forster-Schreiber+14}, although in some of these cases the observed outflows\nare plausibly driven by AGNs \\citep{Genzel+14,Forster-Schreiber+14}.\nThe majority of NaID outflows detected by \\cite{Sato+09} are hosted by\ngalaxies lying on the red sequence in the rest-frame $(U-B)$ color vs $M_B$ diagram and showing early-type morphologies. \nThese authors however note that most of the red sequence galaxies with detectable outflows in their sample may have\nsome residual star formation, as suggested by their still high IR luminosities, and/or show signs of recent\nstar formation, as indicated by their $NUV-R_{AB}$ color.  Furthermore, since AGNs\nare not excluded from their sample, an accreting super massive black hole may be\nresponsible for driving the observed outflows, especially in those galaxies which do not \nshow significant star formation activity.\n\nWe note that there are secondary effects emerging from Fig.~\\ref{fig:plot_of3_deltams}.\nOn the one hand, outflows\nseem to ``saturate'' at $\\rm log(SFR/SFR_{MS}) > 1.5$ when using [OIII] as a tracer, while\nthe scatter on the corresponding plot derived using H$\\alpha$ does not allow us to assess\nwhether a similar saturation is present also for this tracer or not.\nOn the other hand, the minimum ${\\rm SFR/SFR_{MS}}$ required to launch observable outflows\nseems to be lower (i.e. closer to 1) for [OIII], while it is about a factor of 10 larger\nfor H$\\alpha$. \n\nAn indirect implication of Fig.~\\ref{fig:plot_of3_deltams} is that galaxies located on or just below the local MS\ndo not host significant outflows, although we cannot exclude the presence of low-velocity outflows (``weak outflows'', e.g. \n\\citealt{Heckman+15}), or of fewer galaxies with important outflow activity but where the outflow is seen edge-on.\nThis implies that star formation-driven outflows are likely not responsible for the migration of blue star forming galaxies\ninto the ``red sequence'', and so they are not responsible for what we generally refer to as ``quenching'', consistent with\nwhat is found by simulations \\citep{Hopkins+12} and also consistent with recent observational evidence that, for most galaxies, \nquenching results from the cutoff of gas inflow (a process refereed to as ``strangulation'' or ``starvation'', \\citealt{Peng+Maiolino15}).\nHowever, our results clearly highlight a link between\nhigh sSFRs (i.e. sSFR in excess with respect to MS galaxies) and fast star formation-driven outflows.\n\n\\section{Summary and conclusions}\n\nGalactic outflows, ejecting gas out of the galaxy, are a manifestation of feedback.\nPowerful outflows have been observed in galaxies for decades, however it is still not clear\nwhat is their role in galaxy evolution and whether they are actually responsible for reducing or, in the most\nextreme cases, shutting off star formation in galaxies. Some key questions that we have addressed in this\nwork are: how can we reliably trace galactic outflows and estimate their properties? How do outflow properties\nrelate to the properties of the host galaxy? How do outflow properties compare to the predictions\nof galaxy evolutionary models?\n\nThe most obvious source of feedback in galaxies is star formation itself, which, by conveying \nenergy and momentum to the interstellar medium over prolonged timescales, can potentially affect future star formation\nand hence galaxy evolution.\nIn this paper we have investigated the presence and properties of star formation-driven outflows\nof ionised gas in normal galaxies by using a large spectroscopic sample of\n$\\sim160,000$ local non-active galaxies drawn from the SDSS.\nThe galaxy sample was divided into a fine grid of bins in the $\\rm M_{*} - SFR$ \nparameter space, for each of which we produced a composite spectrum by stacking together the SDSS\nspectra of the galaxies contained in that bin.\nWe exploited the high signal-to-noise of the stacked spectra to study\nthe emergence of faint features of\noptical emission lines that trace galactic outflows, which otherwise would be too faint to detect in individual\ngalaxy spectra. Not only has the stacking technique allowed us to explore the presence of\ngalactic outflows in a large and representative sample of normal galaxies, spanning a wide range\n of galaxy properties (${\\rm M_{*} \\in [2 \\times 10^7, 6 \\times 10^{11}]~M_{\\odot}}$ and\n${\\rm SFR \\in [2 \\times 10^{-3}, 2 \\times 10^2 ]~M_{\\odot}~yr^{-1}}$), but also to\nbreak the degeneracy between SFR and M$_*$ that affects the bulk of the local star forming galaxy population\n(i.e. the MS galaxies).\n\nBased on the assumption that feedback-related processes (outflows, turbulence) should affect only\nthe gas kinematics, leaving the motions of stellar populations unperturbed, we traced the kinematical signature of \nfeedback by adopting a novel approach that relies on the comparison between the LoSVD of the ionised gas \n(as traced by the [OIII] and H$\\alpha$+[NII] emission lines) and the LoSVD of the stars, which were used as a reference tracing virial motions.\nMore specifically, significant deviations of the ionised gas kinematics from the stellar kinematics\nin the high velocity tails of the LoSVDs (to minimise the effects of virial motions and turbulence) were interpreted as a signature\nof outflows.\n\nOur results suggest that the incidence of ionised outflows in local star forming galaxies \nincreases with SFR and sSFR. Moreover, at a given SFR, more\nmassive galaxies are increasingly less efficient at launching powerful outflows.\nIn galaxy stacks displaying the clearest signature of galactic outflows, the outflow velocity\n($v_{\\rm out}$) was found to correlate tightly with the SFR for \n${\\rm SFR > 1~M_{\\odot}~yr^{-1}}$, whereas at lower SFRs the dependance\nof $v_{\\rm out}$ on SFR appears nearly flat. \nThe outflow velocity, although with a much larger scatter, increases also \nwith the stellar velocity dispersion ($\\sigma_*$), and in a few galaxy stacks \nreaches values as high as $v_{\\rm out} \\sim (6-8) \\sigma_*$, indicating that \nboth energy-driven and momentum-driven winds may be at play.\n\nStrikingly, the kinematical signature of ionised outflows was detected {\\it only} in\ngalaxies located \n{\\it above the main sequence} of star forming galaxies in the ${\\rm M_{*}-SFR}$ diagram, \nand the incidence of high velocity outflows increases sharply with the offset from the MS.\nOn the one hand, this result clearly highlights a link between (specific) star formation rates in excess with respect to MS galaxies and\nfast star formation-driven outflows, suggesting that such outflows may be responsible for shaping\nthe upper envelope of the MS by providing a self-regulating mechanism for star formation.\nOn the other hand, our findings suggest that the observed outflows may have little or no role\nin the ``quenching'' of star formation in galaxies, \ni.e. the migration of blue star forming galaxies into the ``red sequence''.\n\nFinally, although our study focussed mainly on galactic outflows, a\ncomplementary analysis of the stellar kinematics revealed\nblue asymmetries (of a few 10 km s$^{-1}$) in the stellar LoSVDs of galaxies with higher SFRs and M$_*$. \nThe large uncertainties did not allow us to draw any firm conclusion\nabout the origin of such asymmetries, but a possibility is that these trace \n the presence of a large number of runaway stars and hypervelocity stars in radial\ntrajectories within local galaxies.\n\nIn this paper, besides demonstrating the advantages and limitations of applying the spectral\nstacking technique to optical emission lines for outflow studies, we proposed a new strategy \nto study galactic outflows, which relies on the direct comparison between the LoSVD of the gas and the LoSVD of the stars.\nSuch a new approach was tested with the SDSS spectroscopic sample that, although certainly valuable \nfor its large statistics, is obviously limited in terms of spatial information. However, this methodology can\nreveal its full potential if applied to resolved (IFS) observations of large galaxy samples,\nwhich are becoming available thanks to the ongoing IFS surveys (MaNGA, CALIFA and SAMI) and new powerful\ninstruments such as MUSE.\n\n\\begin{acknowledgements}\nWe thank the anonymous referee for his/her thorough review of the manuscript that significantly helped \nus improving both the analysis and the presentation of the results.\nCC gratefully acknowledges support from the Isaac Newton Studentship (University of Cambridge) and from\nthe Swiss National Science Foundation Professorship grant PP00P2\\_138979/1 (ETH Zurich).\nThis work is based on SDSS-DR7 data and makes use of the \nMPA-JHU release of spectral measurements.\nWe thank David Schlegel and Christy Tremonti for providing crucial information on the SDSS arc lamp calibration spectra,\nwhich allowed us to estimate the SDSS spectral instrumental profile shown in Fig.~\\ref{fig:res}.\nCC thanks Kevin Schawinski, Kurt Soto, Adriano Agnello and George Privon for stimulating discussions.\n\\end{acknowledgements}\n\n\\bibliography{ref}\n\\bibliographystyle{aa}\n\n\\appendix\n\n\n\n\\section{The percentile velocities of the LoSVDs}\n\nFigures~\\ref{fig:v16}, \\ref{fig:v2}, \\ref{fig:v84}, \\ref{fig:v98} and \\ref{fig:v99} show, respectively, \nthe 15.9th (-$\\sigma$), 2.3th (-2$\\sigma$), 84.1th ($\\sigma$),\n97.7th (2$\\sigma$) and 99.9th (3$\\sigma$) percentile velocities of the [OIII], H$\\alpha$ and stellar LoSVDs\nas a function of SFR, M$_*$ and sSFR. \nThe results of the Spearman rank test performed on these relationships are \nreported in Table~\\ref{table:rho_values}.\nSee further discussion in $\\S$~\\ref{sec:kinematics}. \n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_oiii_v16_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_ha_v16_new.ps}\\\\\n   \\includegraphics[clip=true, trim=2.cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_stars_v16_new.ps}\n   \\caption{(Modulus of the) 15.9th percentile velocity of LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 15.9th percentile\n\t\tvelocity corresponds to -1 standard deviation ($-\\sigma$) from the mean velocity. Similarly to Fig.~\\ref{fig:sigma}, we report for\n\t\teach plot the Spearman rank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v16}\n\\end{figure}\n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_oiii_v2_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_ha_v2_new.ps}\\\\\n   \\includegraphics[clip=true, trim=2.cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_stars_v2_new.ps}\n   \\caption{(Modulus of the) 2.3th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 2.3th percentile\n\t\tvelocity corresponds to -2 standard deviations ($-2\\sigma$) from the mean velocity.\n\t\tSimilarly to Fig.~\\ref{fig:sigma}, we report for\n\t\teach plot the Spearman rank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v2}\n\\end{figure}\n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_oiii_v84_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_ha_v84_new.ps}\\\\\n   \\includegraphics[clip=true, trim=2.cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_stars_v84_new.ps}\n   \\caption{84.1th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 84.1th percentile\n\t\tvelocity corresponds to +1 standard deviation ($\\sigma$) from the mean velocity.\n\t\tSimilarly to Fig.~\\ref{fig:sigma}, we report for\n\t\teach plot the Spearman rank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v84}\n\\end{figure}\n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_oiii_v98_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_ha_v98_new.ps}\\\\\n   \\includegraphics[clip=true, trim=2cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_stars_v98_new.ps}\n   \\caption{97.7th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 97.7th percentile\n\t\tvelocity corresponds to +2 standard deviations ($2\\sigma$) from the mean velocity.\n\t\tSimilarly to Fig.~\\ref{fig:sigma}, we report for\n\t\teach plot the Spearman rank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v98}\n\\end{figure}\n\n\\begin{figure}[tbp]\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_oiii_v99_new.ps}\\\\\n   \\includegraphics[clip=true, trim=5.75cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_ha_v99_new.ps}\\\\\n   \\includegraphics[clip=true, trim=2cm 1.cm 2.2cm 1.8cm,angle=90,width=.9\\columnwidth]{plot_stars_v99_new.ps}\n   \\caption{99.9th percentile velocity of the LoSVD of the ionised gas as traced by the \n   \t\t[OIII] (\\emph{top panel}) and H$\\alpha$ (\\emph{middle panel}) emission lines, and of the\n\t\tstars (\\emph{bottom panel}). For a Gaussian velocity distribution, the 99.9th percentile\n\t\tvelocity corresponds to +3 standard deviations ($3\\sigma$) from the mean velocity.\n\t        Similarly to Fig.~\\ref{fig:sigma}, we report for\n\t\teach plot the Spearman rank correlation coefficient $\\rho$ along with its associated two-sided p-value.}\n   \\label{fig:v99}\n\\end{figure}\n\n\n\n", "itemtype": "equation", "pos": 112666, "prevtext": "\nWe note that Eq.~\\ref{eq:outflow_sigma} can be extended also to the percentile\nvelocities as, in the approximation of Gaussian distributions, they correspond to multiples\nof the velocity dispersion. Therefore, according to this line of reasoning, the \noutflow velocity can be approximated by the quantity $(v_{N,{\\rm gas}}^2-v_{N,{\\rm stars}}^2)^{1/2}$,\nwhere $v_{N}$ indicates the $N$-th percentile velocity. \n\nAs we commented earlier, because of the observed blue asymmetries observed in the {\\it stellar} LoSVDs \nof some galaxy stacks ($\\S$~\\ref{sec:asym}), \nthe percentile velocities on the blue side of the stellar LoSVD, i.e. the 15.9th, 2.3th and 0.1th, may be\nnot appropriate to trace virial motions in the galaxy. Therefore, in the following, we \nadopt the same strategy as in $\\S$~\\ref{sec:outflows} and define the outflow velocity as:\n\n", "index": 23, "text": "\\begin{equation}\\label{eq:v_out}\nv_{\\rm out} = (v_{N,{\\rm gas}}^2-v_{100-N,{\\rm stars}}^2)^{1/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"v_{\\rm out}=(v_{N,{\\rm gas}}^{2}-v_{100-N,{\\rm stars}}^{2})^{1/2},\" display=\"block\"><mrow><mrow><msub><mi>v</mi><mi>out</mi></msub><mo>=</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>v</mi><mrow><mi>N</mi><mo>,</mo><mi>gas</mi></mrow><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>v</mi><mrow><mrow><mn>100</mn><mo>-</mo><mi>N</mi></mrow><mo>,</mo><mi>stars</mi></mrow><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}]