[{"file": "1601.02139.tex", "nexttext": "\n The results from the NEMD simulations are very sensitive to the applied field as well as to averaging processes and may cause some unexpected errors~\\cite{JCHEMPHYS}. In a typical EMD simulation, the friction coefficient is determined using velocity autocorrelation function and velocity-force correlation function~\\cite{PRE2011}. The EMD method nowadays is commonly used which overcomes the boundary conditions and field dependence problems in NEMD~\\cite{JCHEMPHYS}.\n\n\nWe employed EMD simulations\nusing the ReaxFF~\\cite{reax} potential as implemented in the well-known large scale\natomic/molecular massively parallel simulator\nï¿½LAMMPSï¿½~\\cite{lammps}. Note that the ReaxFF potential accounts\nfor different possible bond formation and bond dissociation\nof different bond orders. It also contains\nCoulomb and van der Waals potentials to describe non-bonding\ninteractions between all atoms. One of the main\nadvantages of ReaxFF is that it calculates the charge polarization\nwithin the molecules which is achieved by using\nelectronegativity and hardness parameters based on\nthe electronegativity equalization and charge equilibration\nmethods. Furthermore, the ReaxFF potential allows\nbond extension/contraction in water as well as bond-angle\nbending and it allows charge relaxation over each\natom. This is in contrast to traditional force fields for\nwater, e.g. SPC and TIP4P~\\cite{tip2005} (a rigid planar four site\ninteraction potential for water) that keep the water\nmolecules rigid during the MD simulations.\n\n\n\n\n\n\n\n\nThe computational unit cell contains 1200 carbon\natoms making up two rigid graphene layers that are separated by a\ndistance $h$. In order to calculate the shear viscosity\nof water for a constant density, i.e. 1$gcm^{-3}$, we added\nN water molecules randomly (3N atoms) in the unit cell,\nwhere N should be a function of $h$, i.e. N($h$). Before performing\nthe viscosity calculations we relax the system for\n1.5\\,ps employing the NVT ensemble at 298\\,K. In all simulations\nwe apply periodic boundary conditions without\napplying any external lateral pressure and fix the temperature\nat 298\\,K. This allows us to study the effect of\ncapillary size on the shear viscosity.\n\n In the linear transport regime EMD simulations also can be used to give the viscosity for\na liquid. It can be obtained from pressure fluctuations using the\nGreen-Kubo equation~\\cite{Mac}:\n\n", "itemtype": "equation", "pos": 8422, "prevtext": "\n\\title{Commensurate effects in the shear viscosity of water confined between graphene layers}\n\n\n\\author{M. Neek-Amal\\email{neekamal@srttu.edu} and F. M. Peeters}\n \\affiliation{Departement Fysica,\nUniversiteit Antwerpen, Groenenborgerlaan 171, B-2020 Antwerpen,\nBelgium}\n\n\n\\author{I. V. Grigorieva  and A. K. Geim}\n \\affiliation{School of Physics and Astronomy, University of Manchester, Manchester M13 9PL, UK}\n\n\n\\date{\\today}\n\n\\begin{abstract}\n\n\n\nThe rate of water flow through hydrophobic nanocapillaries is greatly enhanced as compared to that expected from macroscopic hydrodynamics. This phenomenon is usually described in terms of a relatively large slip length, which is in turn defined by such microscopic properties as the friction between water and capillary surfaces, and the viscosity of water. We show that the viscosity of water and, therefore, its flow rate are profoundly affected by the layered structure of confined water if the capillary size becomes less than 2 nm. To this end we study the structure and dynamics of water confined between two parallel graphene layers using equilibrium molecular dynamics simulations. We find that the shear viscosity is not only greatly enhanced for subnanometer capillaries, but also exhibits large oscillations that originate from commensurability between the capillary size and the size of water molecules. Such oscillating behavior of viscosity and, consequently, the slip length should be taken into account in designing and studying graphene-based and similar membranes for desalination and filtration.\n\n\n\n\n\\end{abstract}\n\n\n\\maketitle\n\n\n\n\n\nWater confined in a nanoscale channel exhibits very different properties compared to bulk water and its behavior depends strongly on the channel size and the affinity between water and a material of the confining walls~\\cite{JCHEMPHYS,science2006,maja,pnas,33,4,Kotsalis,nature2001}. Experimentally, large enhancement of the water flow rate was found for carbon nanotubes (CNT) with diameters less than a few nm~\\cite{JCHEMPHYS,science2006,maja} and, more recently, superpermeation of water through nanochannels within graphene membranes was reported~\\cite{Nair}. The measured water flow in subnanometer CNTs can be several orders of magnitude higher than the values calculated from continuum hydrodynamic models~\\cite{science2006}, which offers a possibility of developing new nanofluidics devices~\\cite{pnas,33,4}.\n\nNumerous studies based on molecular dynamics (MD) simulations  identified key factors that affect the behavior of water on the nanoscale~\\cite{JCHEMPHYS2012,NanoLett,prl2003,jchem2003,mario,ACSnano}: (i) the breakdown of the uniform fluid density (layered structure of nanoconfined water); (ii) the water-solid wall slip length much larger than capillary sizes, which effectively results in  different boundary conditions compared to bulk water in macroscopic channels, and (iii) the effective shear viscosity that is different from the bulk value.\n\nIn terms of the structure of water, there is consensus that nanoconfined water can form distinct ice-like layers at room temperature, including monolayer- and bilayer ice; different amorphous/ordered ice structures were found in a large number of MD studies. For example, monolayer ice was proposed by Zangi and Mark~\\cite{prl2003} using MD simulations with a five site and tetrahedrally coordinated model (TIP5P). They confined water between two parallel plates, applied a high lateral pressure ($P_l$) up to 2 kbar and found a non-flat monolayer of ice. Formation of a monolayer ice was also proposed as the reason for the superpermeation of water through graphene nanochannels~\\cite{Nair,nat2015}.\n\n\nUnlike the static structure,   dynamics of water on nanoscale remains highly controversial, with widely varying and conflicting results (see Ref.~\\cite{JCHEMPHYS} for a recent review). This is likely because boundary conditions are difficult to control, and measuring of the water flow close to a surface is difficult even in numerical simulations. The reported values of the slip length ($L_s$) for hydrophobic surfaces - a crucial parameter for determining water flow - vary by several orders of magnitude~\\cite{JCHEMPHYS}. For example, using nonequilibrium MD simulations Kotsalis \\emph{et al.}~\\cite{Kotsalis} found $L_s$ for water flow in a 2.71\\,nm diameter CNT  to be 11\\,nm, while Ming D. Ma  \\emph{et al.}~\\cite{SHEN}, reported the slip length of about 200-1100 nm using the same method and a nanotube of the same dimensions. It was also reported that $L_s$ is sensitive to the external field (a constant force applied to all atoms within water molecules in order to force the flow of water through CNTs)~\\cite{JCHEMPHYS,NanoLett,JCHEMPHYS2012}. The situation is rather similar for a flat graphene, in which case $L_s$  is found to be scattered in the range 1 to 80 nm~\\cite{JCHEMPHYS,NanoLett}.\n\nIn its turn, the slip length is a function of both the friction coefficient ($\\xi$) and the viscosity of confined water ($\\eta$) so that $L_s = \\eta/ \\xi$~\\cite{JCHEMPHYS,JCHEMPHYS2012}. The low-friction behavior of water inside hydrophobic capillaries is well understood as it is entropically unfavorable for a hydrophobic surface to bind to water molecules via ionic or hydrogen bonds, i.e.,  $\\xi\\propto\\rho h$, where $\\rho$ is the water density and $h$ is the distance between the two surfaces~\\cite{JCHEMPHYS}.\n\n Furthermore, the friction is affected by the surface curvature ~\\cite{NanoLett2010} and depends on the atomic structure of the confining walls, e.g. $\\xi$ for water on an ionic surface (hBN) is found to be three times larger than on graphene~\\cite{NAnoLett2014}.\n\nIn contrast, the shear viscosity of nanoconfined water is understood poorly, especially for channels narrower than a few nm~\\cite{chemRev}. Most of the experiments measured the viscosity of a liquid (e.g. water) between mica surfaces~\\cite{jnc,klein1998,1978,raviv}. Raviv \\emph{et al.}~\\cite{raviv} found that the effective viscosity of water remains within a factor of three of its bulk value when confined to films with thickness between 0.4 and 3.5\\,nm,~while Dhinojwala~\\emph{et al.}~\\cite{Garcil} found the viscosity under confinement orders of magnitude larger than in the bulk. On the other hand, MD simulations found monotonically decreasing (vanishing) viscosity of water inside CNTs as the CNT diameter falls below 1.5 nm~\\cite{nanscale,Babu}.\n\nOne of possible reasons for the contradicting results is the fact that the existing studies do not take into account that the viscosity of liquids near solid surfaces is spatially varying which should affect the effective viscosity of water in a nanochannel and, as a result, will affect the slip length and the flow rate. Yet, in the simulations, the channel size is often varied in  $\\sim$1 nm steps. Therefore the effect of sub-Angstrom changes in the channel size on the viscosity and slip length, while probably important, remains unknown.\n\nHere, by using the reactive force field (ReaxFF) potential~\\cite{reax} and employing equilibrium molecular dynamics simulations, we investigate the effect of the channel size on the structure and shear viscosity of water confined between two graphene layers. We show that sub-Angstrom variations in the channel size change the shear viscosity of water in an unexpected way. In particular, we find that the shear viscosity oscillates as a function of the distance between the confining walls, which originates from the interplay between the molecular size of water, hydrophobicity of the walls, and the complex arrangement of hydrogen bonds.  Such oscillations should have a profound effect on the slip length and the flow rate and should be taken into account in studies of water transport through nanochannels.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\textbf{Method and model}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThere are two widely used molecular dynamics methods in water transport simulations: nonequilibrium molecular dynamics (NEMD) and equilibrium molecular dynamics (EMD) simulations using classical force fields, e.g. TIP4P and SPC/E models~\\cite{prl2003,jchem2003}. The simulation setup in a typical NEMD simulation is similar to that of a real experiment~\\cite{PRE}: a field (pressure or density gradient) is applied at both ends of the capillary, then by analyzing the velocity profile the slip length is found by using\n\n", "index": 1, "text": "\\begin{equation}\nL_s=\\frac{v_x}{\\frac{\\partial v_x}{\\partial z}}|_{z=0}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{s}=\\frac{v_{x}}{\\frac{\\partial v_{x}}{\\partial z}}|_{z=0}.\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mi>s</mi></msub><mo>=</mo><msub><mrow><mfrac><msub><mi>v</mi><mi>x</mi></msub><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msub><mi>v</mi><mi>x</mi></msub></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>z</mi></mrow></mfrac></mfrac><mo fence=\"true\" stretchy=\"false\">|</mo></mrow><mrow><mi>z</mi><mo>=</mo><mn>0</mn></mrow></msub></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02139.tex", "nexttext": "\nwhere the averaging refers to thermal averaging and averaging over all water molecules, V\nis the volume, $T$ the temperature of the system, and $k_B$  the Boltzmann constant. The integrand is the\nautocorrelation function of the pressure tensor $P_{i,j}$  that has the following five independent components:\n$P_{xx}-P_{yy},P_{yy}-P_{zz},P_{xy},P_{xz}$, and $P_{yz}$. The two\n summations are taken over all five terms.\nThe autocorrelation function for measuring the shear viscosity of water decays fast over a short period of time i.e. of the\norder of a few ps~\\cite{jpcm}. We saved the $P_{i,j}$ values every 1\\,fs and averaged over a time interval of 5\\,ps.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\pagebreak\n\n\n\\large{\\textbf{Results}}\n\n\\textbf{A. Shear viscosity of bulk water}\n\n\n\nIn order to check the validity of the ReaxFF potential for the simulation of the\nviscosity of water, we first performed  extensive simulations for N=5488 water molecules in a box with  dimensions $88\\times\n88\\times42.5$\\AA$^3$ which corresponds to the density of water at room\ntemperature, $\\simeq$1 $gcm^{-3}$. We applied periodic boundary\nconditions in the three directions and kept the temperature fixed at 298\\,K\nusing Nose-Hoover thermostat. After reaching the equilibrium state, we\ncalculate the shear viscosity using Eq.~(2). The viscosity is found to be\n(4.731$\\pm0.003)\\times10^{-4}$ Pa\\,s which is in agreement with\nthe results obtained from other force fields, e.g. TIP4P yields\n(4.83$\\pm$0.09)$\\times 10^{-4}$ Pa s~\\cite{jpcm}. The experimental viscosity for bulk water is\n$\\simeq$6.0$\\times10^{-4}$\\,Pa s~\\cite{viscexp} at room temperature. The difference between experiment and MD results is likely due to the relatively small unit cell in our  MD simulations.\n\n\n\n\\textbf{B. Shear viscosity  of nanoconfined water}\n\nNext we confine water between two graphene layers while keeping the density of water molecules fixed at $1g/cm^{3}$.\nThe density is given by $\\rho=\\frac{18N}{A N_a(h-t)}$gcm$^{-3}$ for a fixed area $A=43\\times37.5\\AA^2$ (here $N_a$ is Avogadro's constant).~Accordingly, we change the distance between the graphene layers from $h$=7.5\\AA~ to  $h$=20\\AA.~We\nnote that, when estimating the volume of water, one needs to exclude the\nvolume taken up by the graphene layers by using $h-t$ instead of $h$. In our calculations we used $t\\sim 1$\\AA~as an approximation for the atomic diameter of carbon atoms.\n\n\n\n\n\n \n\nIn Fig.~\\ref{fig5}, we show the variation of the shear viscosity with $h$ at room\ntemperature. It is seen that the shear viscosity is much higher than for bulk water either at ambient or elevated pressures~\\cite{viscexp}- see the horizontal dashed lines in Fig. 1. The highest viscosity is found for $h$=7.5\\AA.~As $h$ increases, the  viscosity first decays fast and then starts oscillating as a function of $h$. We have found four minima located at $h$=9, 11.5, 15 and 18\\AA~and four maxima located at $h$=7.5,~10,~13.5, and 16.5\\AA.\n\n~In order to interpret the obtained\nresults, we divide Fig. 1 into five segments shown by different colors and will analyze the structure of\nwater at each minimum and maximum.\n\n\n\\textbf{C. Structures}\n\n\n\n\n\n\n\n\n\n\nIn agreement with previous studies ~\\cite{prl2003,nat2015} we\nfound that water confined in the graphene capillary forms\ndistinct layers. In Fig. 2, we show four snapshots of\nthe cross-sectional view of the structure of\nconfined water corresponding to the maxima (a) and\nminima (b) of the shear viscosity. To further\ncharacterize the degree of ordering into layered\nstructures, Figs. 3(a) and (b) show the corresponding\nradial distribution function (RDF) for\nthe O-O distances (for all water molecules) for the\nchannel sizes corresponding to maxima and minima in\nshear viscosity, respectively. Furthermore the\ncorresponding density profiles along the\nperpendicular direction are shown in Fig.~4.\n\n\n\\textbf{\\emph{C. I. Maxima of the shear viscosity}}.\n\n\n\n\nFor the narrowest channel (i.e. $h$=7.5\\AA,~ the first maximum in the viscosity)\na typical snapshot of the water structure is shown in\nFig. 2(a) (top panel).  Notice that two\ndistinct layers of water are formed between the graphene\nwalls, although no ordering was found in the\narrangement of water molecules within the layers.\nFurthermore, the layered structure is very stable: there is no exchange of water molecules between the two layers. The corresponding\nRDF (circles in Fig. 3(a)) has two clear peaks at 2.84 and\n5.4\\AA.~ The first peak corresponds to the nearest\nneighbor average O-O distance and the second peak\nindicates a long range order in the system.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n~For the 10\\,\\AA~channel, the first and second peaks in Fig. 3(a) are at 2.84\\,\\AA~ and 5.7\\,\\AA,~ respectively.\n Note that the second peaks for $h$=7.5\\,\\AA~ and 10\\,\\AA~are closer to each other both in height and position than to the (less pronounced) peaks for $h$=15\\,\\AA~ and 16.5\\,\\AA.~Furthermore, the  RDF values for these $h$ are notably larger than the corresponding RDF for $h$=13.5\\AA~ and\n  16.5\\AA.~This indicates a similar long range order for $h$=7.5\\,\\AA~ and 10\\,\\AA,~ with next-nearest neighbor O-O distance of 5.5\\AA~while\n   the distinctiveness of the water layers and the long range order are gradually lost for wider\nchannels.\n\n~In Fig.~4(a), we show the density profile of\n  the water molecules for the channels with $h$=7.5\\,\\AA~ and 10\\,\\AA.~There are three water layers in the $h$=10\\,\\AA~channel, each layer corresponding to a peak in the density profile in Fig.~4(a).  Importantly, while for $h$=7.5\\AA~there is no exchange of water molecules between the layers (the structure is solid-like, i.e. corresponds to ice),  for $h$=10\\AA,~ a `virtual' layer forms with lower density than the `main layers' adjacent to the graphene walls. The water molecules in this virtual layer are in  constant exchange with the main layers. This is the reason that in Fig. 2(a) the middle layer for $h$=10\\,\\AA~looks more diffuse.\n\n\n  The shear viscosity in the $h$=7.5\\AA~channel is almost 8 times\n   higher than that for $h$=10\\,\\AA.~For $h$=13.5\\AA~(16.5\\AA),~the viscosity is further reduced by an order of magnitude. As seen form Fig. 4(b), for these wider channels\n    there are four (five) distinguishable  water layers with two denser, well-defined layers adjacent to the graphene walls and more diffuse intermediate layers with almost uniform distribution of water molecules, especially for $h=$16.5\\AA.~\n\\begin{table*}\n\n\\begin{tabular}{|c|c|c|}\n\\hline\n $h$(\\AA)     & $d$(\\AA)& $\\delta$(\\AA)     \\\\\n\\hline\n$7.5$          &  2.4$\\pm$0.1 & 2.5$\\pm$0.1      \\\\\n$10$           & 2.4$\\pm$0.1 & 2.6$\\pm$0.1    \\\\\n\n\n\\hline\\hline\n$9$       &     3.6$\\pm$0.2 & 2.7$\\pm$0.2 \\\\\n$11.5$         &  3.0$\\pm$0.2& 2.7$\\pm$0.3   \\\\\n\n\n\\hline\n\\end{tabular}\\par\n\\caption {The  distance between water layers, i.e. $d$, and the distance between the two main water layers and\nthe graphene walls, i.e. $\\delta$.}\n\\label{Table:HystV}\n\n\\end{table*}\n\n\\textbf{\\emph{C. II. Minima of the shear viscosity}}.\n\nWater molecules in the channel with $h$=9\\,\\AA ~form two layers adjacent to the\ngraphene walls (main layers), somewhat similar to the\n$h$=7.5\\AA~ channel where the highest viscosity is observed.\nHowever, in this case, there are also many water molecules\nbetween the two layers that effectively connect the main\nlayers with each other (see Figs. 2(b) and 4(c)). For the\n$h$=11.5\\AA~ channel such water molecules clearly form a\nmiddle layer. However, this middle layer is not\nstable: its water molecules constantly hop between the top\nand bottom layers (main layers). This movement of water between the layers can be seen in provided Supplementary Movies~\\cite{supp}. We note that the number of water layers formed in the\ngraphene channel for $h$=9\\AA~ and $h$=11.5\\AA~ is in agreement\nwith the MD results~\\cite{nat2015}.\n\n For $h$=15\nand 18\\AA~ channels the middle layers become almost\nindistinct (see density profiles in Fig. 4(d)), again with water\nmolecules in intermediate layers constantly hopping and\nconnecting the two main layers adjacent to the graphene\nwalls. It is this hopping of water molecules between the main\nlayers that plays an essential role in decreasing the shear\nviscosity.\n\nIn fact, at the minima the viscosity of confined water becomes\nof the same order as for bulk water at ambient pressure~\\cite{viscexp} (the latter is shown In Fig. 1). This is\nconsistent with the absence of a stable layered structure due\nto the constant exchange of water molecules between the\nlayers (20$\\%$ of water molecules hop between the main layers).\n\n\n\n\n\nIn order to compare the dynamic properties of water corresponding to, for example, the first maximum and the first minimum of the shear viscosity, we performed two long time simulations for $h$=7.5\\AA~and $h$=9\\AA.~The results for a time series of the variation of z-component of the center of mass of confined water molecules\n\n", "itemtype": "equation", "pos": 10890, "prevtext": "\n The results from the NEMD simulations are very sensitive to the applied field as well as to averaging processes and may cause some unexpected errors~\\cite{JCHEMPHYS}. In a typical EMD simulation, the friction coefficient is determined using velocity autocorrelation function and velocity-force correlation function~\\cite{PRE2011}. The EMD method nowadays is commonly used which overcomes the boundary conditions and field dependence problems in NEMD~\\cite{JCHEMPHYS}.\n\n\nWe employed EMD simulations\nusing the ReaxFF~\\cite{reax} potential as implemented in the well-known large scale\natomic/molecular massively parallel simulator\nï¿½LAMMPSï¿½~\\cite{lammps}. Note that the ReaxFF potential accounts\nfor different possible bond formation and bond dissociation\nof different bond orders. It also contains\nCoulomb and van der Waals potentials to describe non-bonding\ninteractions between all atoms. One of the main\nadvantages of ReaxFF is that it calculates the charge polarization\nwithin the molecules which is achieved by using\nelectronegativity and hardness parameters based on\nthe electronegativity equalization and charge equilibration\nmethods. Furthermore, the ReaxFF potential allows\nbond extension/contraction in water as well as bond-angle\nbending and it allows charge relaxation over each\natom. This is in contrast to traditional force fields for\nwater, e.g. SPC and TIP4P~\\cite{tip2005} (a rigid planar four site\ninteraction potential for water) that keep the water\nmolecules rigid during the MD simulations.\n\n\n\n\n\n\n\n\nThe computational unit cell contains 1200 carbon\natoms making up two rigid graphene layers that are separated by a\ndistance $h$. In order to calculate the shear viscosity\nof water for a constant density, i.e. 1$gcm^{-3}$, we added\nN water molecules randomly (3N atoms) in the unit cell,\nwhere N should be a function of $h$, i.e. N($h$). Before performing\nthe viscosity calculations we relax the system for\n1.5\\,ps employing the NVT ensemble at 298\\,K. In all simulations\nwe apply periodic boundary conditions without\napplying any external lateral pressure and fix the temperature\nat 298\\,K. This allows us to study the effect of\ncapillary size on the shear viscosity.\n\n In the linear transport regime EMD simulations also can be used to give the viscosity for\na liquid. It can be obtained from pressure fluctuations using the\nGreen-Kubo equation~\\cite{Mac}:\n\n", "index": 3, "text": "\\begin{equation}\n\\eta_s=\\lim_{t\\rightarrow\\infty}\\frac{V}{k_BT}\\int^{t}_{0}\\sum_{\\alpha,\\beta}\\frac{1}{5}\\left<\\left<P_{\\alpha,\\beta}(t)P_{\\alpha,\\beta}(0)\\right>\\right>,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\eta_{s}=\\lim_{t\\rightarrow\\infty}\\frac{V}{k_{B}T}\\int^{t}_{0}\\sum_{\\alpha,%&#10;\\beta}\\frac{1}{5}\\left&lt;\\left&lt;P_{\\alpha,\\beta}(t)P_{\\alpha,\\beta}(0)\\right&gt;%&#10;\\right&gt;,\" display=\"block\"><mrow><mrow><msub><mi>η</mi><mi>s</mi></msub><mo>=</mo><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>t</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mrow><mfrac><mi>V</mi><mrow><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></msubsup><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>α</mi><mo>,</mo><mi>β</mi></mrow></munder><mrow><mfrac><mn>1</mn><mn>5</mn></mfrac><mo>⁢</mo><mrow><mo>⟨</mo><mrow><mo>⟨</mo><mrow><msub><mi>P</mi><mrow><mi>α</mi><mo>,</mo><mi>β</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>P</mi><mrow><mi>α</mi><mo>,</mo><mi>β</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⟩</mo></mrow><mo>⟩</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02139.tex", "nexttext": "\nare shown in Fig.~5. The hopping between two main layers in the case $h$=9\\AA~is seen as larger fluctuations in $Z_{cm}$ around $Z$=0.~For $h$=7.5\\AA~ we found  much smaller fluctuations around $Z=0$ which indicates freezing of water (see two corresponding movies in the Supplementary Information). The larger fluctuations of $Z_{cm}$ yield diffusive motion of water molecules along $Z$ which reduces the shear viscosity.\n\n\n\n\n\\textbf{Discussions and conclusions}\n\nOur molecular dynamics simulations reveal the strong sensitivity of the shear viscosity of confined water\n to the size of the confining channel. Increasing the channel size, even by as little as 1\\AA,~results in changes of the shear viscosity by more than an\n order of magnitude. Distinct layering of water confined between the graphene layers is apparent only for particular channel sizes.\nWe also find that i) independent of $h$,  two\n  `main layers' of water are always formed, adjacent to the graphene walls (which also have the largest number of water molecules as compared to the intermediate layers), ii) as $h$  increases beyond 15-16\\AA,~the middle layers become mixed, and  we\nobtain almost bulk water between the two  main water layers, and iii) the first peak in the O-O distance, corresponding to the nearest layer separation\noccurs around 2.84\\AA,~ almost independent of $h$, while the location of the second peak (next-nearest layer separation) depends on $h$.\n\n\n\nFrom our analysis, it is clear that\nthe shear viscosity of confined water is related to the commensurability\nbetween the size of the channel and the space\nrequired to accommodate one layer of water molecules. For $h$\nvalues corresponding to low shear viscosity (of the same\norder as the shear viscosity of bulk water), e.g. for $h$=9\nand 11.5\\AA,~ confined water is commensurate with the\nchannel size $h$. The latter results in minima in the shear viscosity. For $h$ values corresponding to the\nlarger shear viscosity, confined water is incommensurate\nwith $h$, resulting in maxima of the shear viscosity. Here\ncommensurability is controlled by two main parameters: density of water and the size of water\nmolecules.\n\n\nOne would expect that the following equation is obeyed\nfor the distance between the two graphene layers forming\nthe channel filled with layered water:\n\n", "itemtype": "equation", "pos": 19937, "prevtext": "\nwhere the averaging refers to thermal averaging and averaging over all water molecules, V\nis the volume, $T$ the temperature of the system, and $k_B$  the Boltzmann constant. The integrand is the\nautocorrelation function of the pressure tensor $P_{i,j}$  that has the following five independent components:\n$P_{xx}-P_{yy},P_{yy}-P_{zz},P_{xy},P_{xz}$, and $P_{yz}$. The two\n summations are taken over all five terms.\nThe autocorrelation function for measuring the shear viscosity of water decays fast over a short period of time i.e. of the\norder of a few ps~\\cite{jpcm}. We saved the $P_{i,j}$ values every 1\\,fs and averaged over a time interval of 5\\,ps.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\pagebreak\n\n\n\\large{\\textbf{Results}}\n\n\\textbf{A. Shear viscosity of bulk water}\n\n\n\nIn order to check the validity of the ReaxFF potential for the simulation of the\nviscosity of water, we first performed  extensive simulations for N=5488 water molecules in a box with  dimensions $88\\times\n88\\times42.5$\\AA$^3$ which corresponds to the density of water at room\ntemperature, $\\simeq$1 $gcm^{-3}$. We applied periodic boundary\nconditions in the three directions and kept the temperature fixed at 298\\,K\nusing Nose-Hoover thermostat. After reaching the equilibrium state, we\ncalculate the shear viscosity using Eq.~(2). The viscosity is found to be\n(4.731$\\pm0.003)\\times10^{-4}$ Pa\\,s which is in agreement with\nthe results obtained from other force fields, e.g. TIP4P yields\n(4.83$\\pm$0.09)$\\times 10^{-4}$ Pa s~\\cite{jpcm}. The experimental viscosity for bulk water is\n$\\simeq$6.0$\\times10^{-4}$\\,Pa s~\\cite{viscexp} at room temperature. The difference between experiment and MD results is likely due to the relatively small unit cell in our  MD simulations.\n\n\n\n\\textbf{B. Shear viscosity  of nanoconfined water}\n\nNext we confine water between two graphene layers while keeping the density of water molecules fixed at $1g/cm^{3}$.\nThe density is given by $\\rho=\\frac{18N}{A N_a(h-t)}$gcm$^{-3}$ for a fixed area $A=43\\times37.5\\AA^2$ (here $N_a$ is Avogadro's constant).~Accordingly, we change the distance between the graphene layers from $h$=7.5\\AA~ to  $h$=20\\AA.~We\nnote that, when estimating the volume of water, one needs to exclude the\nvolume taken up by the graphene layers by using $h-t$ instead of $h$. In our calculations we used $t\\sim 1$\\AA~as an approximation for the atomic diameter of carbon atoms.\n\n\n\n\n\n \n\nIn Fig.~\\ref{fig5}, we show the variation of the shear viscosity with $h$ at room\ntemperature. It is seen that the shear viscosity is much higher than for bulk water either at ambient or elevated pressures~\\cite{viscexp}- see the horizontal dashed lines in Fig. 1. The highest viscosity is found for $h$=7.5\\AA.~As $h$ increases, the  viscosity first decays fast and then starts oscillating as a function of $h$. We have found four minima located at $h$=9, 11.5, 15 and 18\\AA~and four maxima located at $h$=7.5,~10,~13.5, and 16.5\\AA.\n\n~In order to interpret the obtained\nresults, we divide Fig. 1 into five segments shown by different colors and will analyze the structure of\nwater at each minimum and maximum.\n\n\n\\textbf{C. Structures}\n\n\n\n\n\n\n\n\n\n\nIn agreement with previous studies ~\\cite{prl2003,nat2015} we\nfound that water confined in the graphene capillary forms\ndistinct layers. In Fig. 2, we show four snapshots of\nthe cross-sectional view of the structure of\nconfined water corresponding to the maxima (a) and\nminima (b) of the shear viscosity. To further\ncharacterize the degree of ordering into layered\nstructures, Figs. 3(a) and (b) show the corresponding\nradial distribution function (RDF) for\nthe O-O distances (for all water molecules) for the\nchannel sizes corresponding to maxima and minima in\nshear viscosity, respectively. Furthermore the\ncorresponding density profiles along the\nperpendicular direction are shown in Fig.~4.\n\n\n\\textbf{\\emph{C. I. Maxima of the shear viscosity}}.\n\n\n\n\nFor the narrowest channel (i.e. $h$=7.5\\AA,~ the first maximum in the viscosity)\na typical snapshot of the water structure is shown in\nFig. 2(a) (top panel).  Notice that two\ndistinct layers of water are formed between the graphene\nwalls, although no ordering was found in the\narrangement of water molecules within the layers.\nFurthermore, the layered structure is very stable: there is no exchange of water molecules between the two layers. The corresponding\nRDF (circles in Fig. 3(a)) has two clear peaks at 2.84 and\n5.4\\AA.~ The first peak corresponds to the nearest\nneighbor average O-O distance and the second peak\nindicates a long range order in the system.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n~For the 10\\,\\AA~channel, the first and second peaks in Fig. 3(a) are at 2.84\\,\\AA~ and 5.7\\,\\AA,~ respectively.\n Note that the second peaks for $h$=7.5\\,\\AA~ and 10\\,\\AA~are closer to each other both in height and position than to the (less pronounced) peaks for $h$=15\\,\\AA~ and 16.5\\,\\AA.~Furthermore, the  RDF values for these $h$ are notably larger than the corresponding RDF for $h$=13.5\\AA~ and\n  16.5\\AA.~This indicates a similar long range order for $h$=7.5\\,\\AA~ and 10\\,\\AA,~ with next-nearest neighbor O-O distance of 5.5\\AA~while\n   the distinctiveness of the water layers and the long range order are gradually lost for wider\nchannels.\n\n~In Fig.~4(a), we show the density profile of\n  the water molecules for the channels with $h$=7.5\\,\\AA~ and 10\\,\\AA.~There are three water layers in the $h$=10\\,\\AA~channel, each layer corresponding to a peak in the density profile in Fig.~4(a).  Importantly, while for $h$=7.5\\AA~there is no exchange of water molecules between the layers (the structure is solid-like, i.e. corresponds to ice),  for $h$=10\\AA,~ a `virtual' layer forms with lower density than the `main layers' adjacent to the graphene walls. The water molecules in this virtual layer are in  constant exchange with the main layers. This is the reason that in Fig. 2(a) the middle layer for $h$=10\\,\\AA~looks more diffuse.\n\n\n  The shear viscosity in the $h$=7.5\\AA~channel is almost 8 times\n   higher than that for $h$=10\\,\\AA.~For $h$=13.5\\AA~(16.5\\AA),~the viscosity is further reduced by an order of magnitude. As seen form Fig. 4(b), for these wider channels\n    there are four (five) distinguishable  water layers with two denser, well-defined layers adjacent to the graphene walls and more diffuse intermediate layers with almost uniform distribution of water molecules, especially for $h=$16.5\\AA.~\n\\begin{table*}\n\n\\begin{tabular}{|c|c|c|}\n\\hline\n $h$(\\AA)     & $d$(\\AA)& $\\delta$(\\AA)     \\\\\n\\hline\n$7.5$          &  2.4$\\pm$0.1 & 2.5$\\pm$0.1      \\\\\n$10$           & 2.4$\\pm$0.1 & 2.6$\\pm$0.1    \\\\\n\n\n\\hline\\hline\n$9$       &     3.6$\\pm$0.2 & 2.7$\\pm$0.2 \\\\\n$11.5$         &  3.0$\\pm$0.2& 2.7$\\pm$0.3   \\\\\n\n\n\\hline\n\\end{tabular}\\par\n\\caption {The  distance between water layers, i.e. $d$, and the distance between the two main water layers and\nthe graphene walls, i.e. $\\delta$.}\n\\label{Table:HystV}\n\n\\end{table*}\n\n\\textbf{\\emph{C. II. Minima of the shear viscosity}}.\n\nWater molecules in the channel with $h$=9\\,\\AA ~form two layers adjacent to the\ngraphene walls (main layers), somewhat similar to the\n$h$=7.5\\AA~ channel where the highest viscosity is observed.\nHowever, in this case, there are also many water molecules\nbetween the two layers that effectively connect the main\nlayers with each other (see Figs. 2(b) and 4(c)). For the\n$h$=11.5\\AA~ channel such water molecules clearly form a\nmiddle layer. However, this middle layer is not\nstable: its water molecules constantly hop between the top\nand bottom layers (main layers). This movement of water between the layers can be seen in provided Supplementary Movies~\\cite{supp}. We note that the number of water layers formed in the\ngraphene channel for $h$=9\\AA~ and $h$=11.5\\AA~ is in agreement\nwith the MD results~\\cite{nat2015}.\n\n For $h$=15\nand 18\\AA~ channels the middle layers become almost\nindistinct (see density profiles in Fig. 4(d)), again with water\nmolecules in intermediate layers constantly hopping and\nconnecting the two main layers adjacent to the graphene\nwalls. It is this hopping of water molecules between the main\nlayers that plays an essential role in decreasing the shear\nviscosity.\n\nIn fact, at the minima the viscosity of confined water becomes\nof the same order as for bulk water at ambient pressure~\\cite{viscexp} (the latter is shown In Fig. 1). This is\nconsistent with the absence of a stable layered structure due\nto the constant exchange of water molecules between the\nlayers (20$\\%$ of water molecules hop between the main layers).\n\n\n\n\n\nIn order to compare the dynamic properties of water corresponding to, for example, the first maximum and the first minimum of the shear viscosity, we performed two long time simulations for $h$=7.5\\AA~and $h$=9\\AA.~The results for a time series of the variation of z-component of the center of mass of confined water molecules\n\n", "index": 5, "text": "\\begin{equation}\nZ_{cm}(t)=\\frac{\\sum_{i}^{N(h)} Z_i(t)}{N(h)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"Z_{cm}(t)=\\frac{\\sum_{i}^{N(h)}Z_{i}(t)}{N(h)},\" display=\"block\"><mrow><mrow><mrow><msub><mi>Z</mi><mrow><mi>c</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msubsup><mrow><msub><mi>Z</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>h</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02139.tex", "nexttext": "\nwhere $d$ is the distance between the water layers, $n$ is the number of water layers, and $\\delta$ is the distance between the graphene sheets and one of the adjacent water layers.\nWe would expect that in general (ignoring the incommensurate effects and for a constant water density) $h_i$ should be only a function of `$n$' and consequently\n $\\delta\\cong\\delta_0\\cong2.7$\\AA~ should be independent of $h$.\nIn order to find  $\\delta$ and $d$, we performed several annealing MD simulations by cooling the system down to zero\nKelvin and were able to calculate $\\delta$ and $d$ which are listed in Table I.\nIn contrast to expectations, the obtained $d$ (and calculated $\\delta=\\frac{h-(n-1) d}{2}$),  for the two first maxima and minima indicate that $\\delta$ and $d$  are a\n   function of $h$. We found that $\\delta\\approx\\delta_0$ is only valid for the minima of the shear viscosity,\n   i.e. $h$=9\\AA~ and  11.5\\AA,~giving the condition\n   \n", "itemtype": "equation", "pos": 22328, "prevtext": "\nare shown in Fig.~5. The hopping between two main layers in the case $h$=9\\AA~is seen as larger fluctuations in $Z_{cm}$ around $Z$=0.~For $h$=7.5\\AA~ we found  much smaller fluctuations around $Z=0$ which indicates freezing of water (see two corresponding movies in the Supplementary Information). The larger fluctuations of $Z_{cm}$ yield diffusive motion of water molecules along $Z$ which reduces the shear viscosity.\n\n\n\n\n\\textbf{Discussions and conclusions}\n\nOur molecular dynamics simulations reveal the strong sensitivity of the shear viscosity of confined water\n to the size of the confining channel. Increasing the channel size, even by as little as 1\\AA,~results in changes of the shear viscosity by more than an\n order of magnitude. Distinct layering of water confined between the graphene layers is apparent only for particular channel sizes.\nWe also find that i) independent of $h$,  two\n  `main layers' of water are always formed, adjacent to the graphene walls (which also have the largest number of water molecules as compared to the intermediate layers), ii) as $h$  increases beyond 15-16\\AA,~the middle layers become mixed, and  we\nobtain almost bulk water between the two  main water layers, and iii) the first peak in the O-O distance, corresponding to the nearest layer separation\noccurs around 2.84\\AA,~ almost independent of $h$, while the location of the second peak (next-nearest layer separation) depends on $h$.\n\n\n\nFrom our analysis, it is clear that\nthe shear viscosity of confined water is related to the commensurability\nbetween the size of the channel and the space\nrequired to accommodate one layer of water molecules. For $h$\nvalues corresponding to low shear viscosity (of the same\norder as the shear viscosity of bulk water), e.g. for $h$=9\nand 11.5\\AA,~ confined water is commensurate with the\nchannel size $h$. The latter results in minima in the shear viscosity. For $h$ values corresponding to the\nlarger shear viscosity, confined water is incommensurate\nwith $h$, resulting in maxima of the shear viscosity. Here\ncommensurability is controlled by two main parameters: density of water and the size of water\nmolecules.\n\n\nOne would expect that the following equation is obeyed\nfor the distance between the two graphene layers forming\nthe channel filled with layered water:\n\n", "index": 7, "text": "\\begin{equation}\nh_{i}(n)=2\\delta+(n-1)d,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"h_{i}(n)=2\\delta+(n-1)d,\" display=\"block\"><mrow><mrow><mrow><msub><mi>h</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>δ</mi></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02139.tex", "nexttext": "\n      ~For $h$=7.5 and 10\\AA, we found $\\delta<\\delta_0$ which refers to the phase of water\n    with closer layers (shorter $d$ with respect to the minima cases) and all water molecules strongly localized within the layers. The corresponding condition is\n       \n", "itemtype": "equation", "pos": 23325, "prevtext": "\nwhere $d$ is the distance between the water layers, $n$ is the number of water layers, and $\\delta$ is the distance between the graphene sheets and one of the adjacent water layers.\nWe would expect that in general (ignoring the incommensurate effects and for a constant water density) $h_i$ should be only a function of `$n$' and consequently\n $\\delta\\cong\\delta_0\\cong2.7$\\AA~ should be independent of $h$.\nIn order to find  $\\delta$ and $d$, we performed several annealing MD simulations by cooling the system down to zero\nKelvin and were able to calculate $\\delta$ and $d$ which are listed in Table I.\nIn contrast to expectations, the obtained $d$ (and calculated $\\delta=\\frac{h-(n-1) d}{2}$),  for the two first maxima and minima indicate that $\\delta$ and $d$  are a\n   function of $h$. We found that $\\delta\\approx\\delta_0$ is only valid for the minima of the shear viscosity,\n   i.e. $h$=9\\AA~ and  11.5\\AA,~giving the condition\n   \n", "index": 9, "text": "\\begin{equation}\n  Commensurate~case: \\frac{d\\eta_s}{dh}=0,~~~   \\frac{d^2\\eta_s}{dh^2}>0 .\n   \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"Commensurate~{}case:\\frac{d\\eta_{s}}{dh}=0,~{}~{}~{}\\frac{d^{2}\\eta_{s}}{dh^{2%&#10;}}&gt;0.\" display=\"block\"><mrow><mrow><mrow><mi>C</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>e</mi></mpadded><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>e</mi></mrow><mo>:</mo><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>η</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>h</mi></mrow></mfrac><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.4pt\">,</mo><mrow><mfrac><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>η</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>h</mi><mn>2</mn></msup></mrow></mfrac><mo>&gt;</mo><mn>0</mn></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02139.tex", "nexttext": "\n\n     With decreasing  $d$ and $\\delta$\n\t the shear viscosity  increases leading to oscillations between commensurate cases (e.g. h=9\\AA~ and 11.5\\AA)~\n\t and incommensurate cases (e.g. $h$=7.5\\AA~ and 10\\AA).~ The smaller the value of $d$, the larger the vdW force between the water layers and\n\t consequently the larger the shear viscosity. \n\n It is interesting to note that the atomic force microscopy (AFM) studies show oscillations in solvation force as the distance between the AFM tip and the surface was varied, with a period approximately equal to the molecular size~\\cite{Jianping}. The layering of confined liquid and the formation and breaking of hydrogen bonds between the tip and the surface are the main reasons for these oscillations~\\cite{chemRev}. Cleveland\\emph{ et al.}~\\cite{Cleveland} observed hopping of the hydrophilic tip between four discrete levels with an average spacing of 2\\AA.~ They also observed several minima in the potential with spacings varying between 1.5 and 3.0\\AA,~which are comparable to the size of a water molecule. It can be speculated that the force minima and force maxima are due to the formation of liquid-like and a solid-like structure of water, respectively, as found in our work. A solid behavior of the confined water between tip and a gold surface was reported in scanning tunneling microscopy measurements when the tip-surface distance is $h$=7\\AA~\\cite{STM}, which is consistent with our finding for $h$=7.5\\AA~case.\n\n\nIn summary, we show that the shear viscosity of confined\nwater is controlled by the interplay between the spacing of the\nwater layers and the width of the nanochannel: The viscosity\noscillates with $h$ in such a way that it is minimum for the\ncommensurate cases (where $\\delta\\geq\\delta_0$ and and $d>$3\\AA)~and it reaches\na maximum for the incommensurate cases (where $\\delta<\\delta_0$  and $d<$3\\AA).~This is in contrast to earlier MD simulations (e.g.,\nrefs.~\\cite{nanscale,Babu}) where monotonically decreasing viscosity was\nfound for a decreasing channel size, presumably due to\nthe different model used for water (TIP3P and TIP4P-EW,  where the dipole/charge on each molrcule/atom is constant) and a different method for viscosity calculation (Eyring-MD method). As the channel size becomes larger than $~$2\\,nm,\nthe shear viscosity decreases and approaches the viscosity of\nbulk water. This is in agreement with experiments that\nindicate that the viscosity of a liquid confined between two\nsurfaces with $h>$2-3\\,nm remains close to that in the bulk\n~\\cite{jnc}.\n\n\nOur findings have an important implication that the\nslippage of water should also be strongly affected by the\ndetails of its molecular structure and the subnanometer\nchanges in the channel size. Indeed, AFM measurements on\na few-molecule thick layer of water confined between mica\nand an AFM tip found that dynamics of such water is\ndetermined predominantly by solvation effects that depend\non the exact separation between the tip and the surface~\\cite{hoffman}.\n\n\nFinally, it is worth mentioning that we performed\nseveral additional simulations for different\ndensities of confined water (which varied between\n1.7gcm$^{-3}$ and 0.7gcm$^{-3}$) and found the\nsame decreasing and oscillating behavior of the\nshear viscosity. In these simulations we fixed the\nnumber of water molecules to N=2016 and\nchanged the distance between the graphene layers.\nThe shear viscosity for the highest density (1.7gcm$^{-3}$ for $h$=7.5\\AA)~ is found to be close to 1.0 Pa s\nwhich is just twice that for water of density 1\\,gcm$^{-3}$  in a $h$=7.5\\AA~ channel shown in Fig. 2(a). Therefore the density of water can control its shear viscosity in a similar way as the channel size.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\textbf{References}\n\n\\begin{thebibliography}{13}\n\n\\bibitem{JCHEMPHYS}  Kannam, S. K.; Todd,  B. D.; Hansen, J. S.;  J. Daivis; P.. How fast does water flow in carbon nanotubes? J. Chem. Phys. 2003, 138, 094701-094709.\n\n\\bibitem{science2006} Jason K. Holt, Hyung Gyu Park, Yinmin Wang, Michael Stadermann, Alexander B. Artyukhin, Costas P. Grigoropoulos, Aleksandr Noy, and Olgica Bakajin. Fast Mass Transport Through Sub-2-Nanometer Carbon Nanotubes. Science 2006, 312, 1034-1037.\n\n\\bibitem{maja}M. Majumder, N. Chopra, R. Andrews, and B. J. Hinds. Nanoscale hydrodynamics: enhanced flow in carbon nanotubes. Nature (London)\n 2005, 438, 44.\n\n\n\\bibitem{pnas}  A. Kalra, S. Garde, and G. Hummer. Osmotic water transport through carbon nanotube membranes. Proc. Natl. Acad. Sci. U.S.A. 2003, 100, 10175.\n\\bibitem{33} R. Pit, H. Hervet  and L. Leger. Direct Experimental Evidence of Slip in Hexadecane: Solid Interfaces. Phys. Rev. Lett. 2000, 85, 980-983.\n\\bibitem{4}  G. M. Whitesides, and A. D. Stroock. Flexible methods for microfluidics. Phys. Today 2001, 54, 42-48.\n\\bibitem{Kotsalis}E. M. Kotsalis, J. H. Walther, and P. Koumoutsakos. Multiphase water flow inside carbon nanotubes. Int. J. Multiphase Flow\n2004, 30, 995-1010.\n\\bibitem{nature2001}G. Hummer, J. C. Rasaiah, and  J. P. Noworyta. Water conduction through the hydrophobic channel of a carbon nanotube. Nature (London) 2001, 414, 188-190.\n\\bibitem{Nair} R. R. Nair, H. A. Wu, P. N. Jayaram, I. V. Grigorieva, and A. K. Geim. Unimpeded Permeation of Water Through Helium-Leakâ\u0080\u0093Tight Graphene-Based Membranes. Science 2012, 335, 442-444.\n\\bibitem{JCHEMPHYS2012} Sridhar Kumar Kannam, B. D. Todd, J. S. Hansen, and Peter J. Daivis. Slip length of water on graphene: Limitations of non-equilibrium molecular dynamics simulations. J. Chem. Phys. 2012, 136, 024705-024709.\n\\bibitem{NanoLett}John. A. Thomas and Alan J. H. McGaughey. Reassessing Fast Water Transport Through Carbon Nanotubes. Nano Letters 2008, 8, 2788-2793.\n \\bibitem{prl2003} R. Zangi and A. E. Mark, Monolayer Ice. Phys. Rev. Lett. 2003, 91, 025502-025505.\n\\bibitem{jchem2003} R. Zangi and A. E. Mark, Electrofreezing of confined water. J. Chem. Phys 2004, 120, 7123-7130.\n\\bibitem{mario}M. Sobrino Fernandez Mario, M. Neek-Amal, and F. M. Peeters, AA-stacked bilayer square ice between graphene layers. Phys. Rev. B 2015, 92, 245428-245432.\n\n\\bibitem{ACSnano} Hu Qiu, Xiao Cheng Zeng, and Wanlin Guo. Water in Inhomogeneous Nanoconfinement: Coexistence of Multilayered Liquid and Transition to Ice Nanoribbons. ACS Nano {\\bf9}, 9877-9884 (2015).\n\n\\bibitem{nat2015}G. Algara-Siller, O. Lehtinen, F. C. Wang, R. R. Nair, U. Kaiser, H. A. Wu\n, A. K. Geim, and  I. V. Grigorieva. Square ice in graphene nanocapillaries. Nature (London), 2015, 519, 443-445.\n\n\n\\bibitem{SHEN} M. D. Ma, L. Shen, J. Sheridan, J. Z. Liu, C. Chen, and Q. Zheng, Friction of water slipping in carbon nanotubes. Phys.\nRev. E, 2011, 83, 036316-0.36322.\n\n\\bibitem{NanoLett2010} K. Falk, F. Sedlmeier, L. Joly, R. R. Netz, and L. Bocquet. Molecular Origin of Fast Water Transport in Carbon Nanotube Membranes: Superlubricity versus Curvature Dependent Friction. Nano Lett. 2010, 10, 4067-4073.\n\n\\bibitem{NAnoLett2014} Gabriele Tocci, Laurent Joly, and Angelos Michaelides. Friction of Water on Graphene and Hexagonal Boron Nitride from Ab Initio Methods: Very Different Slippage Despite Very Similar Interface Structures. Nano Letetrs 2014, 14, 6872-6877.\n\n\\bibitem{chemRev} A. Verdaguer, G. M. Sacha, H. Bluhm, and M. Salmeron. Molecular Structure of Water at Interfaces: Wetting at the Nanometer Scale. Chem. Rev. 2006, 106, 1478-1510.\n\\bibitem{jnc}J. N. Israelachvili. Measurment of the Viscosity of Liquids in Very Thin Films. J. Colloid Interface Sci. 1986, 110, 263-271.\n\n\\bibitem{klein1998}J. Klein and E. Kumacheva. Simple liquids confined to molecularly thin layers. I. Confinement-induced liquid-to-solid phase transitions. J. Chem. Phys., 1998, 108, 6996-7009.\n\n\\bibitem{1978} J. N. Israelachvili and  Gayle E. Adams. Measurement of forces between two mica surfaces in aqueous electrolyte solutions in the range 0â\u0080\u0093100 nm . J. Chem. Soc., Faraday Trans. I, 1978, 74, 975-1001.\n\n\\bibitem{raviv}U. Raviv, P. Laurat, and J. Klein. Fluidity of water confined to subnanometre films. Nature (London), 2004, 413, 51-54; U. Raviv, and  J. Klein. Fluidity of Bound Hydration Layers. Science  2002, 297, 1540-1543.\n\n\\bibitem{Garcil} A. Dhinojwala and  S. Granick. Relaxation Time of Confined Aqueous Films Under Shear. J. Am. Chem. Soc. 1997, 119, 241; Y. Zhu and S. Granick, Viscosity of Interfacial Water. Phys. Rev. Lett. 2001 87, 096104-096108.\n\n\\bibitem{nanscale}Hongfei Ye, Hongwu Zhang, Zhongqiang Zhang, and Yonggang Zheng. Size and temperature effects on the viscosity of water inside carbon nanotubes.  Nanoscale Research Letters, 2011, 6, 87-91.\n\n\\bibitem{Babu} J. S. Babu and S. P. Sathian. The role of activation energy and reduced viscosity on the enhancement of water flow through carbon nanotubes. J. Chem. Phys. 2011, 134, 194509-194515.\n\n\\bibitem{reax}  A. C. T. van Duin, S. Dasgupta, F. Lorant,  and W. A.\nGoddard. ReaxFF: a reactive force field for hydrocarbons. J. Phys. Chem. A, 2001, 105, 9396-9409.\n\n\\bibitem{PRE}David Schaeffel, Stoyan Yordanov, Marcus Schmelzeisen, Tetsuya Yamamoto, Michael Kappl, Roman Schmitz, Burkhard Dï¿½nweg, Hans-Jï¿½rgen Butt, and Kaloian Koynov. Hydrodynamic boundary condition of water on hydrophobic surfaces. Phys. Rev. E, 2013, 87, 051001-051004.\n\\bibitem{PRE2011}J. S. Hansen, B. D. Todd, and P. J. Daivis. Prediction of fluid velocity slip at solid surfaces. Phys. Rev. E, 2011, 84, 016313-016320.\n\n\\bibitem{lammps} S. Plimpton. Fast Parallel Algorithms for Short-Range Molecular Dynamics. J. Comp. Phys. 1995, 19, 117-136.\n\n\n\\bibitem{tip2005} J. L. Abascal and C. Vega. A general purpose model for the condensed phases of water: TIP4P/2005. J. Chem. Phys. 2005 123,  234505-234516.\n\n\n\\bibitem{Mac} Jean-Pierre Hansen and I. R. McDonald. \\emph{Theory of Simple Liquids With Applications to Soft Matter}, (ScienceDirect 2013).\n\n\n\\bibitem{jpcm} George S. Fanourgakis, J. S. Medina, and R.\nProsmiti. Determining the Bulk Viscosity of Rigid Water Models. J. Phys. Chem. A, 2012, 116, 2564-2570.\n\n\\bibitem{viscexp} Petra F$\\ddot{o}$rst, Franz Werner, and Antonio Delgado. The viscosity of water at high pressures â\u0080\u0093 especially at subzero degrees centigrade. Rheol Acta 2000, 39, 566-573.\n\n\\bibitem{supp} In the supplementary we present  two movies corresponding to the first minumum and the first maximum of the shear viscosity.\n\n\n\\bibitem{Jianping}Jianping Gao, W. D. Luedtke, and Uzi Landman. Origins of Solvation Forces in Confined Films. J. Phys. Chem. B, 1997, 101, 4013-4023.\n\n\\bibitem{Cleveland}J. P. Cleveland, T. E. Schaffer, and P. K.  Hamsa. Probing oscillatory hydration potentials using thermal-mechanical noise in an atomic-force microscope, Phys. Rev. B, 1995, 52 (12), R8692.\n\n\\bibitem{STM} E.-M. Choi, Y.-H. Yoon, S. Lee, and H. Kang. Freezing Transition of Interfacial Water at Room Temperature under Electric Fields. Phys. Rev. Lett. 2005, 95, 085701-085703.\n\n\n\n\n\n\n\n\n\n\\bibitem{hoffman} S. Jeffery, P. M. Hoffmann, J. B. Pethica, C. Ramanujan, H. O. Ozer, and A. Oral. Direct measurement of molecular stiffness and damping in confined water layers. Phys. Rev. B, 2014, 70, 054114-054121.\n\n\n\n\\end{thebibliography}\n\\pagebreak\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.53\\linewidth]{fig-visc.eps}\n\n\\caption{\\label{fig5} (color online) The variation of the shear\nviscosity of confined water between two graphene layers which are separated by a distance $h$. The result for bulk water is taken from Ref.~\\cite{viscexp}. The dashed line is a linear interpolation of the data. }\n\\end{center}\n\\end{figure}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=0.490\\linewidth]{figlayerD.eps}\n\\includegraphics[width=0.480\\linewidth]{figlayerN.eps}\n\n\\caption{\\label{fig1} (color online) Side view of snapshots of\nwater at T=298\\,K confined between two graphene layers separated by different distances. The (a) and (b) figures\n show the results corresponding to the maxima and minima of the shear viscosity shown in Fig. 1, respectively.}\n\\end{center}\n\\end{figure*}\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=0.453\\linewidth]{rdf.eps}\n\\includegraphics[width=0.453\\linewidth]{rdfD.eps}\n\\caption{\\label{fig2} (color online) Radial distribution function of the\n positions of oxygen atoms for (a) maximum and (b) minimum values of the shear viscosity of confined water between the graphene layers. The O-O distances are shown in logarithmic scale for clarity.}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[width=0.453\\linewidth]{DensityProfile-D.eps}\n\\includegraphics[width=0.453\\linewidth]{DensityProfile.eps}\n\\includegraphics[width=0.453\\linewidth]{DensityProfileMin1.eps}\n\\includegraphics[width=0.453\\linewidth]{DensityProfileMin2.eps}\n\\caption{\\label{fig3} (color online) Density profiles (perpendicular to the graphene layers) for the snapshots shown in Fig.~\\ref{fig1}. (a,b) are related to the maxima and (c,d) are related to the minima of the shear viscosity.}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\linewidth]{zcm.eps}\n\\caption{\\label{fig3} (color online) The time evolution of the z-component of the center of mass of confined water between two graphene layers which are separated by $h$=7.5\\AA~and $h$=9\\AA.}\n\\end{center}\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 23697, "prevtext": "\n      ~For $h$=7.5 and 10\\AA, we found $\\delta<\\delta_0$ which refers to the phase of water\n    with closer layers (shorter $d$ with respect to the minima cases) and all water molecules strongly localized within the layers. The corresponding condition is\n       \n", "index": 11, "text": "\\begin{equation}\n Incommensurate~case:  \\frac{d\\eta_s}{dh}=0,~~~   \\frac{d^2\\eta_s}{dh^2}<0 .\n   \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"Incommensurate~{}case:\\frac{d\\eta_{s}}{dh}=0,~{}~{}~{}\\frac{d^{2}\\eta_{s}}{dh^%&#10;{2}}&lt;0.\" display=\"block\"><mrow><mrow><mrow><mi>I</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>e</mi></mpadded><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>e</mi></mrow><mo>:</mo><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>η</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>h</mi></mrow></mfrac><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.4pt\">,</mo><mrow><mfrac><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>η</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><msup><mi>h</mi><mn>2</mn></msup></mrow></mfrac><mo>&lt;</mo><mn>0</mn></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]