[{"file": "1601.00503.tex", "nexttext": "\n\nWhere $\\left(\\frac{\\dot{M}}{\\dot{M}_{Edd}}\\right)$ is the relative accretion rate with respect to Eddington rate and $M_{BH}$  is the black hole mass of an AGN.  For II~Zw~177, $\\tau_{cross}\\sim20{\\rm~ks}$ for $\\lambda_{eff}=3440\\AA$, $\\frac{\\dot{M}}{\\dot{M}_{Edd}}=0.7$, $M_{BH}=2\\times10^{6} M_\\odot$.  The absence of UV/X-ray correlation on $20{\\rm~ks}$ time scale clearly implies that the observed UV emission is not dominated by the reprocessed emission.\n\n\n  The  extremely weak ($F_{var}\\sim1\\%$) variability of the UV with gradual  decline could be part\n  of large amplitude variability on very long time scale such as the viscous time scale. If this is case, any fluctuations\n  in the UV emission on top of the secular decline due  to changes in the accretion rate, may be related to the variations \n  in the reprocessed emission. In Fig.~\\ref{uv_variation}, we show the residuals obtained by subtracting a linear model representing secular decline from the observed UV emission. There are no significant variation within these residuals that would be attributed to low level X-ray reprocessing. Thus, we find no clear evidence for reprocessed UV emission from II~Zw~177. High S/N data are required to fully address this possibility. \n\n\nIn the intrinsic disc Comptonized (i.e., the OPTXAGNF) model, the soft X-ray excess arises from the inner disk itself.\nTherefore, the variations in the UV and the soft excess emission are expected to be correlated. The absence of any correlation between the UV and soft excess\nsuggests that the soft excess is not dominated by the thermal Comptonization in the disc. As discussed earlier, the correlation \nbetween the soft excess and powerlaw emission are consistent with that expected in the blurred reflection model provided that\nthe variations in the powerlaw component are intrinsic to the corona rather than due to the changes in the height of the corona.\n\n  \n  \n\nAlternatively, perhaps the UV emission is intrinsic to the disc and the variability is due to\nthe variation in some absorbing material in the line of sight. A varying\ncovering fraction at a few percentage level may lead to the $1$\\% variability\nseen. However, it is difficult (but perhaps not impossible) to see how a patchy absorbing region extending\nto $\\sim 2000 r_g$ could vary on such short timescale as $\\sim$ 20 ks. Such a model would also\nrequire a larger black hole mass for the system which would aggravate the problem of the short timescale\nvariability of the absorbing clouds.\n\n\nEssentially, our results indicate that the short term variability of the X-ray\nand UV emission of AGNs can be complex but have the potential to provide \nimportant clues regarding the nature and geometry of the central source. There\nis evidence that the geometry of the central regions are different for\ndifferent AGNs and even for a particular AGN, it may change in timescale of\nyears. A comprehensive observational programme for studying simultaneous UV and X-ray\nemission from several AGNs over different timescale may provide a much clearer picture\nof the dynamic nature of these sources. Such an endeavour may be possible by the future\nX-ray mission {\\it Astrosat} \\citep{2014SPIE.9144E..1SS} which will have the capability of sensitively measuring the\nsimultaneous X-ray and UV emission from AGNs. \n\n\n\\section{Acknowledgement}\n An anonymous referee is gratefully acknowledged for the suggestions/comments which improved the paper.\nMP and PKP gratefully acknowledge support by the CSIR, New Delhi under the NET fellowship program.\nThis research has made use of ($i$) NASA's Astrophysics Data System,\n($ii$) the SIMBAD database, operated at CDS, Strasbourg, France,\n($iii$) observations obtained with XMM-Newton, an ESA science mission\nwith instruments and contributions directly funded by ESA Member\nStates and NASA, and ($iv$) data, software and/or web tools obtained\nfrom the High Energy Astrophysics Science Archive Research Center\n(HEASARC), a service of the Astrophysics Science Division at NASA/GSFC\nand of the Smithsonian Astrophysical Observatory's High Energy\nAstrophysics Division.\n\n\n\\label{lastpage}\n\n\n\\bibliographystyle{mn2e} \n\\bibliography{refs}\n\n\n \n\n\n", "itemtype": "equation", "pos": 60713, "prevtext": "\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2012}\n\n\\date{\\today}\n\n\\maketitle\n\\begin{abstract}\n  We study X-ray and UV emission from the narrow-line Seyfert 1 galaxy\n  II~Zw~177 using a $137{\\rm~ks}$ long and another $13{\\rm~ks}$ short {\\it XMM-Newton}{}\n  observation performed in 2012 and 2001, respectively.  Both \n  observations show soft X-ray excess emission contributing\n  $76.9\\pm4.9\\%$ in 2012 and $58.8\\pm10.2\\%$ in 2001 in the\n  $0.3-2{\\rm~keV}$ band. We find that both blurred reflection from an\n  ionized disc and Comptonized disc emission describe the\n  observed soft excess well. Time-resolved spectroscopy\n  on scales of $\\sim20{\\rm~ks}$ reveals strong correlation between the soft\n  excess and the powerlaw components. The fractional variability amplitude $F_{var}$ derived from EPIC-pn lightcurves at different energy bands is nearly constant ($F_{var} \\sim20\\%$). This is in contrast to other\n  AGNs where the lack of short term variation in soft X-ray excess emission\n  has been attributed to intense light bending in the framework of the\n  ``lamppost''  model. Thus, the variations in powerlaw emission are most\n  likely intrinsic to corona rather than just due to the changes of height\n  of compact corona. The variable UV emission ($F_{var} \\sim 1\\%$) is\n  uncorrelated to any of the X-ray components on short timescales suggesting\n  that the UV emission is not dominated by the reprocessed emission. The\n  gradual observed decline in the UV emission in 2012 may be related to\n  the secular decline due to the changes in the accretion\n   rate. In this case, the short term X-ray variability is\nnot due to the changes in the seed photons but intrinsic to the hot corona.\n\\end{abstract}\n\n\\begin{keywords} accretion, accretion discs-- galaxies: active, galaxies: individual: II~Zw~177,\n  galaxies: nuclei, X-rays: galaxies\n\\end{keywords}\n\\section{Introduction}\n\n\\label{firstpage}\n\nMost active galactic nuclei (AGN) show complex broad-band\nspectra. The optical/UV to X-ray spectrum consist of primarily four\ncomponents -- the big blue bump (BBB), the X-ray power law emission in\nthe $\\sim0.1-100{\\rm~keV}$ band, Fe-K line near 6{\\rm~keV}~with reflection hump\nat higher energies and the soft X-ray excess emission below 2{\\rm~keV}.\nThe BBB is likely the thermal emission from a standard accretion disc\n\\citep{1973A&A....24..337S, 1978Natur.272..706S}.  According to this\nmodel the outer accretion disc with low temperature emits within the optical band\nand the inner disc with the highest temperature emits in the extreme UV.\n In rare cases of low mass AGN with high accretion rates, the disc\ncan emit in the soft X-ray band (e.g., \\citealt{2013MNRAS.434.1955D, 2015MNRAS.446..759C}).\nThe power law continuum emission is believed to originate through the Compton\nup scattering of the soft photons from the accretion disc in the hot electron plasma\n\\citep{1980A&A....86..121S, 1991ApJ...380L..51H, 2003PhR...377..389R}.\nThe Fe-K$\\alpha$ line near 6{\\rm~keV}~and the reflection hump in the\n$20-40${\\rm~keV}~band are considered together as the X-ray reflection. The\niron-K$\\alpha$ line and the reflection hump are caused by the\nphotoelectric absorption, followed by fluorescence, and the Compton\nscattering of the coronal emission in an\noptically thick medium such as accretion discs\n\\citep{1988MNRAS.233..475G, 1988ApJ...335...57L, 1991MNRAS.249..352G,\n  1995Natur.375..659T}.  Since the discovery of the soft X-ray excess\nemission \\citep{1985ApJ...297..633S, 1985MNRAS.217..105A}, the\norigin of this component has been widely debated with high energy\ntail of thermal emission from the accretion disc discussed as an early possibility\n\\citep{1985MNRAS.217..105A,1998MNRAS.301..179M, 1999ApJS..125..317L}.\nHowever, the expected thermal emission from accretion disc of AGN is too cool to\ncontribute significantly in the soft X-ray band, except for a subclass of AGN known as \nnarrow line Seyfert galaxies (NLS1s) which have low black hole mass and high\naccretion rate (e.g., \\citealt{1996A&A...305...53B}). \n\nNonetheless, in NLS1, the predicted shape of Wein tail of\ninner disc should drop faster than the observed shape of soft excess with\nenergy \\citep{1987ApJ...314..699B, 1997ApJ...477...93L}. The extent over the\nWein tail of the disc could be explained with Compton upscattering of disc photons\nthrough optically thick cool plasma \\citep{1987ApJ...321..305C}. \nThis optically thick cool plasma may reside between the interior of disc and the X-ray source\neither separated vertically \\citep{2001ApJ...557..408J} or radially\n\\citep{1998MNRAS.301..179M} or indistinct \\citep{2012MNRAS.420.1848D}. However,\nthe temperature associated with this Comptonization region remains invariant\n$kT_{e}\\sim0.1-0.2${\\rm~keV}~\\citep{2003A&A...412..317C,2004MNRAS.349L...7G,\n2009MNRAS.394..443M}. This constancy of temperature over a large range in AGN\nmasses and luminosities led to the two models for soft excess -- blurred\nreflection from relativistic photoionized accretion disc\n\\citep{2002MNRAS.331L..35F,2006MNRAS.365.1067C, 2013MNRAS.428.2901W} and smeared ionized absorption\n\\citep{2004MNRAS.349L...7G,2006MNRAS.371L..16G, 2006MNRAS.371...81S,\n2007MNRAS.381.1426M} that utilized the atomic processes. The velocity smeared\nabsorption explanation for soft excess was ruled out due to the unrealistic\nrequirement of very high velocity ($\\sim0.5 c$) of gas clouds to smooth the\ncurvature of this excess \\citep{2008MNRAS.386L...1S, 2009ApJ...694....1S}.\nHowever, the origin of soft X-ray excess is still not clearly understood since\nthese models are often spectroscopically degenerate in the sense that they fit\nthe X-ray spectra equally well (e.g., \\citealt{2004MNRAS.349L...7G,\n2005AIPC..774..317S, 2007ApJ...671.1284D}). The variability study based on\nhard/soft time lags in different energy bands and correlation\nbetween spectral components can help to remove this ambiguity between\ndifferent physical processes.\n\n After the discovery of hard X-ray lag relative to soft X-rays\n\tin binary system (e.g.,\n\t\\citealt{1988Natur.336..450M,1999ApJ...510..874N}), similar lags were also\n\tobserved in AGN \\citep{2001ApJ...554L.133P,2004MNRAS.348..783M}. The\n\torigin of hard lag is not clearly known. One possible explanation\n\tis provided by the propagation fluctuation model in which fluctuations\n\tassociated with accretion flow propagate inward in an accretion disc and\n\tthus resulting in the emission of the soft photons from relatively outer\n\tregions earlier than the hard photons from the innermost regions \\citep{1997MNRAS.292..679L,2001MNRAS.327..799K, 2006MNRAS.367..801A}. \n\tRecently, for example, {\\it Swift}{} monitoring of the radio-loud NLS1 galaxy PKS~0558--504 for\n$\\sim 1.5{\\rm~year}$ has revealed that optical leads UV and UV leads soft X-rays\non short timescales of about a week \\citep{2013MNRAS.433.1709G} possibly\nfavouring the propagation model. A new type of lag has emerged from recent\nstudies where soft photons lag to the hard photons. This is termed as the\nreverberation lag which is used to constrain the X-ray emitting region in AGN.\n\\citet{2009Natur.459..540F} discovered the reverberation lag $\\sim$ 30s for the\nfirst time in a NLS1 galaxy 1H0707--495. Since then such lags have been observed\nin dozen of Seyfert galaxies \\citep{2010MNRAS.401.2419Z, 2011MNRAS.417L..98D,\n2011MNRAS.416L..94E,\n2011MNRAS.412...59Z,2011MNRAS.418.2642Z,2013ApJ...764L...9C,\n2013MNRAS.429.2917F, 2013MNRAS.428.2795K, 2013MNRAS.431.2441D}. The most of\nabove cases reveal reverberation lag $\\sim100$s supporting the compact nature of\nX-ray emitting region within few gravitational radii of a supermassive black\nhole (SMBH).  In case of strong illumination such as that implied by observation of\nstrong blurred reflection, UV/optical emission from AGN may be dominated by the\nreprocessed emission and the variations in the optical/UV  \nband emission lag behind the X-rays (e.g., \\citealt{2014MNRAS.444.1469M}). About a five year\nlong compaign of Seyfert  1 galaxy Mrk~79 using six ground based\nobservatories for optical and {\\it RXTE}{} for X-ray observations,\n\\citet{2009MNRAS.394..427B} have shown zero lag between optical and X-rays on\ntimescale of about a day. Their study of correlated X-ray and optical emission\nsuggests X-ray reprocessing on short timescale of days and the changes in the\noptical emission on long timescale of $\\sim$ few years can be attributed to the\nvariations in the accretion rate.  \n\nThe presence or absence of\ncorrelated variability between the different X-ray spectral components\ncan also be used to constrain the models. For example, one would\nnaively expect that the soft excess should be correlated with\nthe power-law emission for the reflection model. However, it has\nbeen argued that strong gravitational light bending within the\nframework of a ``lamppost'' model where a compact  X-ray producing region \nlocated at a height illuminates the disc, may lead to absence of such correlations\n\\citep{2004MNRAS.349.1435M}. It is also difficult to eliminate the\nother models for the soft excess based on correlation studies of X-ray components\nalone. Multiwavelength variability properties and the relationship between the soft X-ray\nexcess  and the optical/UV emission from the accretion disc may\nprovide better constraints on the models for the soft X-ray excess.\n\n     \nMultiwavelength studies of AGN have shown possible relationship between the soft X-ray excess and the optical/UV big blue bump\n(e.g.,~\\citealt{1992MNRAS.256..589P,1996A&A...305...53B, 1994ApJS...95....1E, 1996ApJ...470..364E,\n2006MNRAS.366..953B, 2007MNRAS.381.1426M}). \\citet{1993A&A...274..105W} found a strong correlation\nbetween the soft X-ray slope measured with {\\it ROSAT}{} and the strength of UV emission observed with\n{\\it International Ultraviolet Explorer}{} for 58 Seyfert 1 AGN. \\citet{1998A&A...330...25G} found pronounced BBB emission in a sample\nof 76 bright soft X-ray selected AGN and the optical spectra of these AGN were bluer when the soft\nX-ray spectra were steeper. They interpreted these results as the BBB emission arising from\nComptonized accretion disc. Based on a multiwavelength campaign of Mrk~509 by\n{\\it Swift}{} and {\\it XMM-Newton}{} over a period of 100 days, \\citet{2011A&A...534A..39M} have\nfound a strong correlation between the soft X-ray excess and the optical/UV thermal emission from the\naccretion disc but no correlation between the X-ray powerlaw component\nand either the soft X-ray excess or optical/UV emission. These results\nare expected if the soft X-ray excess is produced in the thermal\nComptonization of optical/UV disc photons by a warm ($kT_e \\sim\n0.2{\\rm~keV}$) and optically thick ($\\tau \\sim 17$) corona surrounding\nthe inner disc \\citep{2011A&A...534A..39M}. Thus, multiwavelength optical/UV/X-ray variability study of AGN is an\nimportant tool to investigate the relationship between different\nemission components and to shed light on the central engine and the\norigin of soft X-ray excess. In this paper we present detailed\nbroadband X-ray spectral and UV/X-ray variability study of II~Zw~177\n-- a highly variable AGN.\n\n\nII~Zw~177 is a bright X-ray source and is listed in the {\\it ROSAT}{} X-ray\nbright source catalogue \\citep{1999A&A...349..389V}. Its luminosity\nwas measured $\\sim10^{43}~ergs~s^{-1}$ in $0.5-2~{\\rm~keV}$~band with\n{\\it XMM-Newton}{} \\citep{2009A&A...495..421B}. II~Zw~177 is a NLS1 galaxy located\nat a redshift $z=0.081$ \\citep{1998ApJS..117..319A,\n  2006A&A...455..773V, 2006MNRAS.368..479G, 2006ApJS..166..128Z,\n  2011ApJ...727...31A}.  \\citet{2006MNRAS.368..479G} studied this AGN\nusing 2001 June {\\it XMM-Newton}{} observation and grouped this AGN in the\n``General NLS1 Sample'' as opposed to the ``Complex NLS1 Sample'' and\nalso reported a broad feature near $5.8{\\rm~keV}$.  We have performed a\nlong {\\it XMM-Newton}{} observation which we analyze here. We also use the earlier\nobservation and study X-ray spectral and UV/X-ray variability.  We\norganize this paper as follows. We describe the observations and data\nreduction in Section 2. In Section 3, we detail the spectral modeling\nwith complex models. In Section 4, we present the long term X-ray spectral variability.\nWe report the UV to X-ray spectral variability in Section 5.\nWe discuss and summarize our results in Section 6. We use the luminosity distance\n($d_{L}=364{\\rm~Mpc}$) using cosmological parameters $H_{0} = 71~{\\rm\n  km~s^{-1}~Mpc^{-1}}$, $\\Omega_m = 0.27$ and $\\Omega_{\\Lambda} =\n0.73$.\n\n\\begin{table*}\n  \\noindent \\begin{centering}\n    \\caption{Observing log} \\label{obs_log}\n    \\begin{tabular*}{12.5 cm}{lccccccc}\n      \\hline\n      \\hline \n      Observatory & Observation-ID&Date&Clean exposure& Rate  \\tabularnewline\n      &         &              & EPIC-pn/MOS1/MOS2~({\\rm~ks})     &$\\rm (counts~s^{-1})$  \\tabularnewline\n      \\hline\n      {\\it XMM-Newton}{}     &  0103861201   &June 7, 2001 & 7.3/11.3/11.6    &$ 0.899\\pm0.003$ \\tabularnewline\n    \n      \" &0694580101   &May 29--30, 2012 & 83.9/109.2/110.2  & $2.02\\pm0.02$\\tabularnewline\n      \\hline\n    \\end{tabular*}\n    \\par\\end{centering} {Note-- Count rate for EPIC-pn data in\n    $0.3-10${\\rm~keV}~band.}\n\\end{table*}\n\n\\section{Observation and data reduction}\nII~Zw~177 was observed thrice with {\\it XMM-Newton}{} \\citep{2001A&A...365L...1J}. The first two\nobservations have been studied by various authors\n\\citep{2005A&A...430..927G,\n  2006MNRAS.365..688G,2006MNRAS.368..479G,2008A&A...480..611S,2009A&A...493...55E,\n  2011ApJ...727...31A, 2011A&A...530A..42C}. The first observation (ObsID:  0103861201) was\nperformed starting on 2001 June 7, 04:40 UTC with an exposure time of\n13{\\rm~ks}. In this observation, the European Photon Imaging camera (EPIC)\npn \\citep{2001A&A...365L..18S} was operated in the full window and two\nEPIC-MOS cameras \\citep{2001A&A...365L..27T} in the small window mode with\nthe medium filter. The second observation ({Obs ID: 0103862601) was performed only with\nreflection grating spectrometers (RGS1/RGS2) in the spectroscopic mode\nwith about $3{\\rm~ks}$ each. We performed the third observation in 2012 May (ObsID: 0694580101) for\nan exposure of $137{\\rm~ks}$ using the thin filter in the full window\nmode (see Table~\\ref{obs_log}).  We analyzed EPIC-pn and EPIC-MOS1/MOS2\ndata from the first and the third (2012) observations.\n      \nWe reprocessed the EPIC-pn and EPIC-MOS data using the Science Analysis System\n({\\tt SAS}) v13.0.0 \\citep{2004ASPC..314..759G} and updated calibration files.  Examination of\nlight curves extracted above $10{\\rm~keV}$ revealed the presence of flaring\nparticle background. We created good time interval (gti) files after\nexcluding the intervals of flaring particle background identified\nbased on count rate cut-off criteria. We used above criteria by selecting the count\nrate cut-off values 2.0, 0.5 in 2012 and 2.4, 0.35 in 2001 observations for EPIC-pn\nand EPIC-MOS, respectively. We filtered the event lists to\nretain the good events with patterns $\\le4$ (EPIC-pn) or $\\le12$ (EPIC-MOS)\nwith arrival times within the good time intervals and generated the\ncleaned event lists. This resulted in the useful exposures of $\\sim\n84{\\rm~ks}$ (EPIC-pn) and $\\sim110{\\rm~ks}$ (EPIC-MOS) for the 2012 observation and\n$\\sim 7{\\rm~ks}$ (EPIC-pn) and $\\sim11{\\rm~ks}$ (EPIC-MOS) for the 2001 observation\n(see Table~\\ref{obs_log}).  We extracted source spectra from circular\nregions of radii 55 and 40 arcsec for 2012 and 2001 observations, respectively. We\nalso extracted the background spectra from off-source circular regions\nwith radii in the range of 35 to 63 arcsec. We generated the\nredistribution matrix and ancillary response files using the SAS tools\n{\\tt RMFGEN} and {\\tt ARFGEN}, respectively. We grouped the spectral\ndata sets to a minimum counts of 20 per bin and oversampled by a\nfactor of 5 using the {\\tt specgroup} tool.\n\n\\begin{table*}\n  \\small\n  \\centering \n  \\caption{Best-fit spectral model parameters for the two {\\it XMM-Newton}{}~observations performed in 2012 amd 2001.} \\label{pca_ref}\n  \\begin{tabular}{llcc}\n    \\hline\n    \\hline \n    &&\\multicolumn{1}{c}{Model 1: Ionized PCA model}\\\\ \n    \\hline\n    &    &\\multicolumn{2}{c}{{\\it XMM-Newton}{}}  \\\\           \n    Model&Parameter&0694580101                                  &0103861201\\\\\n    Component && (2012 May)                                     & (2001 June)   \\\\\n    \\hline\n    Gal. abs.&$N_{H}$ ($10^{20}\\rm cm^{-2}$)         & 5.4~(*)                   & 5.4~(*) \\tabularnewline\n    POWERLAW&$\\Gamma$                                &$2.87\\pm0.04$              &$2.97_{-0.10}^{+0.08}$\\tabularnewline\n    &f$_{PL (0.3-2{\\rm~keV})}$~$~^{a}$                    &$8.4\\pm1.0$                &$8.7_{-1.2}^{+2.2}$\\tabularnewline  \n    &f$_{PL (2-10{\\rm~keV})}$~$~^{a}$                     &$1.5\\pm0.1$                &$1.3_{-0.2}^{+0.1}$\\tabularnewline  \n    ZXIPCF& $N_{H}$ ($10^{22}{\\rm cm^{-2}}$)         &$5.9_{-0.9}^{+15.7}$       &$5.4_{-2.3}^{+2.5}$\\tabularnewline\n    & $C_{f}$ ($\\%$)                                 &$54.3_{-4.4}^{+3.6}$       &$47.0_{-12.5}^{+10.9}$\\tabularnewline\n    & $\\xi$ ($\\rm erg~cm~s^{-1}$)                    &$<38.9$                    &$<26.9$\\tabularnewline         \n    BBODY& $kT_{BB}$ $({{\\rm~eV}}$)                       &$132.3_{-3.2}^{+3.6}$      &$140.9_{-9.3}^{+20.2}$\\tabularnewline\n    &f$_{BB (0.3-2{\\rm~keV})}$~$~^{a}$                    &$2.0\\pm0.2$                &$1.6_{-0.4}^{+0.3}$\\tabularnewline  \n    &$\\chi^{2}/dof$                                  &$505.6/460$                &$273.4/244$\\tabularnewline\n    $F_{X}~~^{b}$        &$f_{0.3-2{\\rm~keV}}$            &$3.0$                      &$3.5$  \\tabularnewline\n    &$f_{2-10{\\rm~keV}}$                                  &$0.95$                     &$0.96$\\tabularnewline\n    $L_{X}~~^{c}$&$L_{0.3-2{\\rm~keV}}$                    &$4.9$                      &$5.6$ \\tabularnewline\n    &$L_{2-10{\\rm~keV}}$                                  &$1.6$                      &$1.6$\\tabularnewline \\hline\n    &                       &\\multicolumn{1}{c}{Model 2: Blurred reflection model}\\\\  \\hline\n    Gal. abs.&$N_{H}$ ($10^{20}\\rm cm^{-2}$)         & 5.4~(*)                   & 5.4~(*) \\tabularnewline\n    NTHCOMP$~^{d}$ & $\\Gamma $                       &$2.56_{-0.01}^{+0.02}$     &$2.63_{-0.04}^{+0.05}$ \\tabularnewline\n    &$kT_{in}$~({\\rm~eV})                                 &$10~(*)$                   &$10$~(*) \\tabularnewline\n    &f$_{NTH (0.3-2{\\rm~keV})}$~$~^{a}$                   &$1.4_{-0.2}^{+0.3}$        &$1.7\\pm1.0$ \\tabularnewline  \n    &f$_{NTH (2-10{\\rm~keV})}$~$~^{a}$                    &$0.4\\pm0.1$                &$0.5\\pm0.2$ \\tabularnewline  \n   \n    \n    REFLIONX & $ A_{Fe}$                             &$1.0_{-0.1}^{+0.2}$        &$1$(*) \\tabularnewline\n    &$\\xi$ ($\\rm erg~cm~s^{-1}$)                     &$1161_{-140}^{+131}$       &$1701_{-614}^{+633}$ \\tabularnewline\n    &$\\Gamma$                                        &$2.56_{-0.01}^{+0.02}$ (p$_{t}$) &$2.63_{-0.04}^{+0.05}$ (p$_{t}$)  \\tabularnewline\n \n   \n    \n    KDBLUR& $ q $                                    &$3.6_{-0.3}^{+0.6}$        &$>3.3$ \\tabularnewline\n    & $R_{in}$ ($r_{g}$)                             &$<2.97$                    &$2.2_{-0.6}^{+3.0}$ \\tabularnewline\n    & $R_{out}$ ($r_{g}$)                            &$400$~(*)                  &$400$~(*) \\tabularnewline\n    & $i$ ($\\rm degree$)                             &$<37.6$                    &$43.8_{-28.1}^{+16.1}$ \\tabularnewline \n    &f$_{ref (0.3-2{\\rm~keV})}$~$~^{a}$                   &$3.3_{-0.3}^{+0.2}$        &$3.8\\pm1.0$ \\tabularnewline  \n    &$ \\chi^{2}/dof$                                 &$498.2/459$                &$267.8/244$ \\tabularnewline\n    $ F_{X}~~^{b}$                                   &$f_{0.3-2{\\rm~keV}}$            &$3.0$ &$3.4$ \\tabularnewline\n    & $f_{2-10{\\rm~keV}}$                                  &$0.89$                    &$0.92$ \\tabularnewline\n    $ L_{X}~~^{c}$&$L_{0.3-2{\\rm~keV}}$                    &$4.9$                     &$5.6$  \\tabularnewline\n    &$L_{2-10{\\rm~keV}}$                                   &$1.5$                     &$1.6$ \\tabularnewline \\hline\n    &&\\multicolumn{1}{c}{Model 3: Intrinsic disc Comtonised model}\\\\   \\hline\n    Gal. abs.&$N_{H}$ ($10^{20}\\rm cm^{-2}$)         & 5.4~(*)                   & 5.4~(*) \\tabularnewline   \n    OPTXAGNF\n    &$L/L_{Edd}$                                     &$0.65\\pm0.01$              &$0.8_{-0.1}^{+0.8}$\\tabularnewline\n    &$kT_{e}$ ({\\rm~keV})                                 &$0.20_{-0.02}^{+0.01}$     &$0.17_{-0.02}^{+0.03}$\\tabularnewline\n    &$\\tau$                                          &$>21.3$                    &$22.1_{-4.6}^{+7.7}$\\tabularnewline\n    &$r_{corona}~(r_{g})$                            &$3.7_{-0.6}^{+1.4}$        &$<6.8$\\tabularnewline\n    &$a$                                             &$0.996_{-0.002}^{+P}$      &$0.7_{-0.3}^{+P}$\\tabularnewline\n    &$f_{pl}$                                        &$0.70\\pm0.10$              &$0.6_{-0.2}^{+0.1}$\\tabularnewline\n    &$\\Gamma$                                        &$2.31\\pm0.05$              &$2.55_{-0.10}^{+0.09}$\\tabularnewline\n    &f$_{OPTX (0.3-2{\\rm~keV})}$~$~^{a}$                  &$4.68_{-0.05}^{+0.04}$     &$5.6\\pm0.2$\\tabularnewline  \n    &f$_{OPTX (2-10{\\rm~keV})}$~$~^{a}$                   &$0.97_{-0.02}^{+0.03}$     &$0.97\\pm0.05$\\tabularnewline  \n\n    &$\\chi^{2}/dof$                                  &$502.4/460$                &$275.0/244$\\tabularnewline\n    $F_{X}~~^{b}$&$f_{0.3-2{\\rm~keV}}$                     &$3.0$                      &$3.4$\\tabularnewline\n    &$f_{2-10{\\rm~keV}}$                                   &$0.96$                     &$0.97$\\tabularnewline\n    $L_{X}~~^{c}$&$L_{0.3-2{\\rm~keV}}$                     &$4.8$                      &$5.6$ \\tabularnewline\n    &$L_{2-10{\\rm~keV}}$                                   &$1.6$                      &$1.7$\\tabularnewline\n    \\hline\n\n  \\end{tabular}\n  {~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Notes-- (a) f$_{PL}$, f$_{NTH}$, f$_{ref}$ and f$_{OPTX}$ represent fluxes to respective model component and flux is measured in units $10^{-12}{\\rm~ergs~cm^{-2}~s^{-1}}$; (b) This is observed flux in units $10^{-12}{\\rm~ergs~cm^{-2}~s^{-1}}$ of a given energy band.; (c) Luminosity in units $10^{43}{\\rm~ergs~s^{-1}}$; (d) Electron temperature is fixed to 100{\\rm~keV}. P stands for pegged to hard limit.  'p$_{t}$' stands for parameter tied. Fixed parameters are indicated by an asterisk.}\n\\end{table*}\n\n\n\n\n\n\\begin{table*}\n  \\small\n   \\centering \n  \\caption{Best-fit spectral model parameters for the two {\\it XMM-Newton}{}~observations performed in 2012 amd 2001.} \\label{lp_ref}\n  \\begin{tabular}{llcc} \\hline\n &                       &\\multicolumn{1}{c}{Model : reflection model with RELCONV\\_LP}\\\\ \n  \\hline\n  Model&Parameter&0694580101                                  & 0103861201\\\\\n    Component && (2012 May)                                     & (2001 June)   \\\\\n \n    \\hline\n       Gal. abs.&$N_{H}$ ($10^{20}\\rm cm^{-2}$)         & 5.4~(*)                & 5.4~(*) \\tabularnewline\n    NTHCOMP$~^{d}$ & $\\Gamma $                       &$2.56\\pm0.02$              &$2.6\\pm0.1$  \\tabularnewline\n    &$kT_{in}$~({\\rm~eV})                                 &$10~(*)$                   &$10$~(*) \\tabularnewline\n    \n\n\n    &f$_{NTH (0.3-2{\\rm~keV})}$~$~^{a}$                   &$1.4_{-0.4}^{+0.3}$        &$2.1\\pm1.0$ \\tabularnewline  \n    &f$_{NTH (2-10{\\rm~keV})}$~$~^{a}$                    &$0.4\\pm0.1$                &$0.6\\pm0.2$ \\tabularnewline \n    REFLIONX & $ A_{Fe}$                             &$1.0_{-0.1}^{+0.2}$        &$1$(f)  \\tabularnewline\n    &$\\xi$ ($\\rm erg~cm~s^{-1}$)                     &$1135.2_{-107.4}^{+184.1}$  &$1323_{-379}^{+771}$ \\tabularnewline\n    &$\\Gamma$                                        &$2.56\\pm0.02$ (p$_{t}$)          &$2.6\\pm0.1$ (p$_{t}$) \\tabularnewline\n\n    RELCONV\\_LP& $ h $ ($r_{g}$)                     &$3.3_{-1.4}^{+0.4}$        &$<4.7$\\tabularnewline\n    &$\\Gamma$                                        &$2.56\\pm0.02$ (p$_{t}$)          &$2.6\\pm0.1$ (p$_{t}$)    \\tabularnewline\n    & $R_{in}$ ($r_{g}$)                             &$<3.1$                     &$<4.1$ \\tabularnewline\n    & a                                              &$>0.7$                     &$>0.3$ \\tabularnewline\n    & $R_{out}$ ($r_{g}$)                            &$400$~(*)                  &$400$~(*) \\tabularnewline\n    & $i$ ($\\rm degree$)                             &$18.6_{-4.3}^{+9.2}$       &$<44.3$ \\tabularnewline \n \n\n &f$_{ref (0.3-2{\\rm~keV})}$~$~^{a}$                      &$3.4_{-0.3}^{+0.4}$        &$3.4\\pm1.0$ \\tabularnewline     \n    &$ \\chi^{2}/dof$                                 &$500.2/458$                &$271.9/243$ \\tabularnewline\n    $ F_{X}~~^{b}$        &$f_{0.3-2{\\rm~keV}}$            &$3.0$                     &$3.5$ \\tabularnewline\n    & $f_{2-10{\\rm~keV}}$                                  &$0.89$                     &$0.93$ \\tabularnewline\n    $ L_{X}~~^{c}$&$L_{0.3-2{\\rm~keV}}$                    &$4.9$                      &$5.6$  \\tabularnewline\n    &$L_{2-10{\\rm~keV}}$                                   &$1.5$                      &$1.6$ \\tabularnewline \\hline\n    \\hline\n\n  \\end{tabular}\n  {{~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Notes-- (a) f$_{NTH}$ and f$_{ref}$ represent fluxes to respective model component and flux is measured in units of $10^{-12}{\\rm~ergs~cm^{-2}~s^{-1}}$; (b) This is observed flux in units of $10^{-12}{\\rm~ergs~cm^{-2}~s^{-1}}$ for a given energy band.; (c) Luminosity in units of $10^{43}{\\rm~ergs~s^{-1}}$; (d) Electron temperature is fixed to 100{\\rm~keV}. 'p$_{t}$' stands for parameter tied. Fixed parameters are indicated by an asterisk.}}\n\\end{table*}\n\n\n\n\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[height=8cm,angle=-90]{fig1a.ps}\n  \\includegraphics[height=8cm,angle=-90]{fig1b.ps}\n  \\caption{2012 long observation: (a) The data-to-model ratio based on the simple absorbed\n    POWERLAW model fitted to the EPIC-MOS1 (open squares), EPIC-MOS2 (asterisks)\n    and EPIC-pn (filled triangles) in the the $2-10{\\rm~keV}$ band and\n    extrapolated to lower energies (b) Residuals in terms\n      of $\\chi=\\rm~(Data-Model)/\\sigma$ for fitted absorbed POWERLAW\n      model in $0.3-10{\\rm~keV}$ band. }\n  \\label{pca_mod}\n\\end{figure*}\n\n\n\n\\begin{figure*}\n  \\includegraphics[scale=0.3,angle=-90]{fig2a.eps}\n  \\includegraphics[scale=0.3,angle=-90]{fig2b.eps}\n  \\caption{ Results of spectral fits to the 2012 (left) and 2001 (right) spectral data, the best-fitting ionized PCA\n    (WABS$\\times$ZXIPCF$\\times$(POWERLAW+ZBBODY)), and the deviations of the observed data from the\n    model. The symbols are the same as used in Fig.~\\ref{pca_mod}.}\n  \\label{pca_fit_spec}\n\\end{figure*}\n\n\\section{X-ray Spectral modeling}\nWe used {\\tt XSPEC} v12.8 \\citep{1996ASPC..101...17A} to analyze the spectral data sets and\nemployed the $\\chi^2$ statistics to find the best-fit models.  The\nerrors on each best-fitting parameter reflect $90\\%$ confidence level\nunless otherwise stated.\n\nWe begin with the spectral analysis of 2012 data. First, we compared\nthe EPIC-pn, EPIC-MOS1 and EPIC-MOS2 spectral data by fitting the $2-10{\\rm~keV}$\nband by a simple model CONS--\\\\TANT$\\times$WABS$\\times$POWERLAW.  Here the\nconstant has been introduced to take into account any difference\nin  flux normalization  between the instruments. \n We fixed the Galactic absorption column density\n$N_{H}=5.4\\times10^{20}$~$\\rm~cm^{-2}$\n\\citep{1990ARA&A..28..215D}. The fit resulted in\n$\\chi^{2}=293.5$ for 309 degree of freedom (dof) with $\\Gamma=2.35\\pm{0.05}$. We then\nextrapolated the model down to $0.3{\\rm~keV}$ and plotted the data-to-model\nratio in Figu~\\ref{pca_mod}~(a). We noticed that the EPIC-MOS2 data do not\nagree well below $0.5{\\rm~keV}$ with the EPIC-pn or EPIC-MOS1 data.  We\ntherefore excluded EPIC-MOS2 data below $0.5{\\rm~keV}$ from our spectral\nanalysis.  In addition, the ratio plot clearly shows strong soft X-ray\nexcess emission below $2{\\rm~keV}$.\n \nThe soft X-ray component has been observed in many Seyfert 1/QSO AGN\n(e.g., \\citealt{1985ApJ...297..633S,1985MNRAS.217..105A,1996A&A...305...53B,\n  1999MNRAS.309..113V,2006MNRAS.365.1067C}).\nThough the origin of the soft X-ray excess is not clearly understood,\nthe component can be modeled by three physically motivated models --\npartially ionized absorption,\nblurred reflection from a partially ionised accretion disc and the\nthermal Comptonization in an optically thick, cool plasma\n\\citep{1985MNRAS.217..105A,1999ApJS..125..317L,2006MNRAS.365.1067C,\n  2007ApJ...671.1284D, 2007MNRAS.374..150S,2012MNRAS.420.1848D}.  Here\nwe use these models and test their validity using the UV/X-ray\nvariability. We note that fitting the absorbed powerlaw model to the\nfull $0.3-10{\\rm~keV}$ band provided a poor fit\n($\\chi^{2}/dof=1590.1/465$) and resulted in the curvature in the\n$1.5-5{\\rm~keV}$ band and excess emission in the $0.5-1{\\rm~keV}$ emission as shown\nin Fig.~\\ref{pca_mod}~(b). Such features may be caused by complex partial\ncovering absorption (PCA) which we test first. \n\n\n\n\\subsection{Ionized partial covering model}\n\nMultiplying the simple absorbed powerlaw model with a\n  neutral partial covering absorption (ZPCFABS) model improved the fit\n  ($\\chi^2/dof=887.2/463$) with $N_H\\sim 1.4\\times10^{23}~cm^{-2}$ and covering fraction $C_{f}$\n  $\\sim 59.4\\%$. However the fit is statistically unacceptable. We also\n  tested the possible presence of partially covering ionised\n  absorption along the line of sight to the nuclear source.  We used\n  the ZXIPCF model which is an XSTAR based absorption model\n  constructed with illuminating continuum slope of $\\Gamma=2.2$ and\n  turbulent velocity of $200{\\rm~km~s^{-1}}$\n  \\citep{2008MNRAS.385L.108R}.  Replacing the neutral PCA component\n  with the ionised PCA model ZXIPCF improved the fit\n  ($\\Delta\\chi^2=-9.4$ for one additional parameter. Using a second ZXIPCF\n  component did not improve the fit further. Thus, complex\n  absorption cannot describe the observed data. Indeed, adding a simple\n  blackbody i.e., the model WABS$\\times$ZXIPCF$\\times$(POWERLAW+ZBBODY) \n  improved the fit considerable ($\\chi^2/dof = 505.6/460$). \n The blackbody temperature is  $kT_{BB}\n  \\sim 132{\\rm~eV}$ which is typical of AGN with strong soft X-ray excess.  \nAlthough this model does not fit the data in the sense that it \nrequires an adhoc blackbody component (see Fig.~\\ref{pca_fit_spec}~(a)), for completeness \nthe best-fit parameters are listed   in Table~\\ref{pca_ref}. \n\n\n\n\n\\begin{figure*}\n\n  \\includegraphics[scale=0.3,angle=-90]{fig3a.eps}\n  \\includegraphics[scale=0.3,angle=-90]{fig3b.eps}\n   \\caption{ Results of spectral fits to the 2012 (left) and 2001 (right) spectral data, the best-fitting blurred reflection\n    (WABS$\\times$(NTHCOMP+KDBLUR*REFLIONX) and the deviations of the observed data from the\n    model. The symbols are the same as used in Fig.~\\ref{pca_mod}.}\n  \\label{ref_fit_spec}\n\\end{figure*}\n\n\n\n\n\\begin{figure*}\n\n  \\includegraphics[scale=0.3,angle=-90]{fig4a.eps}\n  \\includegraphics[scale=0.3,angle=-90]{fig4b.eps}\n  \\caption{ Results of spectral fits to the 2012 (left) and 2001 (right) spectral data, the best-fitting intrinsic disc model\n    (WABS$\\times$OPTXAGNF), and the deviations of the observed data from the\n    model. The symbols are the same as used in Fig.~\\ref{pca_mod}.}\n  \\label{disc_fit_spec}\n\\end{figure*}\n\n\\begin{figure*}\n\n  \\includegraphics[scale=0.3,angle=-90]{fig5a.ps}\n  \\caption{ Ratio of observed 2001 data and the best-fit $2-10{\\rm~keV}$ absorbed\n    powerlaw model in the $0.3-10{\\rm~keV}$ band. The symbols are the same as used in Fig.~\\ref{pca_mod}.}\n  \\label{excess_fit_spec}\n\\end{figure*}\n\n\\subsection{The blurred reflection model}\nThe soft X-ray excess emission can be described by reflection from a\nrelativistic photoionized accretion disc. In the ``lamppost'' geometry, a\nhot compact plasma, above the accretion disc, emits the primary\nemission which illuminates the surface of disc material\n\\citep{1991A&A...247...25M}. The X-ray illumination is stronger in the\ninner regions of the disc due to the strong gravity of the SMBH (e.g., \\citealt{2004MNRAS.349.1435M}).\nThe emissivity of the reflected emission is often expressed as\n$\\epsilon\\propto~r^{-q}$, where $r$ is the distance from the center\nand $q$ is the emissivity index.  The soft X-ray excess can arise due\nto the numerous emission lines from the photoionised disc and Thomson\nscattering of the illuminating powerlaw emission. \n We therefore modeled the soft X-ray excess emission using the REFLIONX model which\ncharacterizes the reflected emission from partially ionized accretion\ndisc \\citep{2005MNRAS.358..211R}.  The parameters of REFLIONX are iron abundance\nrelative to solar ($A_{Fe}$), ionization parameter $\\xi=L/nr^{2}$ ( where $L$ is\nthe source luminosity, $n$ is hydrogen density and r represents the distance between\nsource and disc) and photon index which is same as the  \nilluminating powerlaw photon index. Thus, we tied REFLIONX $\\Gamma$ to POWERLAW $\\Gamma$\nrequired for disc illumination. }The model WABS$\\times$(POWERLAW+REFLIONX) improved the fit\n($\\chi^{2}/dof=963.3/462$) compared to the absorbed powerlaw. The residuals\nin above modeling could be smoothed by the gravitational and\nrelativistic effects close to the SMBH \\citep{2000PASP..112.1145F,2009Natur.459..540F}.\nWe blurred the ionized reflected emission by the convolution model KDBLUR to obtain\nthe relativistically broaden ionized reflection from the inner regions of the accretion disc.\nThe parameters of KDBLUR are emissivity index ($q$), inner and outer radii of the disc\n(R$_{in}$ and $R_{out}$) and inclination ($i$) angle between observer's line of sight and normal to the disc.\nThe WABS$\\times$(POWERLAW+KDBLUR*REFLIONX) resulted in a satisfactory fit\n($\\chi^{2}/dof=497.2/459$).  To be more\nphysically consistent, we replaced the powerlaw by a thermal \nComptonization model NTHCOMP \\citep{1996MNRAS.283..193Z}. \nIn this model, we fixed the electron\ntemperature to a high value of $100{\\rm~keV}$ and soft disc photon temperature to\n$10{\\rm~eV}$. The model WABS$\\times$(NTHCOMP+KDBLUR*REFLIONX) resulted\nin the similar $\\chi^{2}/dof=498.2/459$ as expected. We did not find any significant\nresiduals and consider this as the best-fit blurred reflection\nmodel. The spectral data, the best-fit model, and the residuals are\nshown in Fig.~\\ref{ref_fit_spec}~(a) and the best-fitting parameters are listed in\nTable~\\ref{pca_ref}. We further replaced KDBLUR by RELCONV\\_LP, which also\nconvolves with the entire reflected X-ray spectrum to blur the emission features and provides lamppost\nheight of the X-ray source. The important model parameters are height of the compact corona $h ~(r_{g})$, inner disc radius, spin, outer disc radius, inclination and illuminatiing powerlaw index.\nThe best-fit parameters of WABS$\\times$(NTHCOMP+RELCONV\\_LP*REFLIONX) are listed in Table~\\ref{lp_ref}.\n\n\\begin{figure}\n  \\centering\n \\includegraphics[height=9cm,angle=-90]{fig6.eps} \\\\\n  \\caption{ The ratio (data/model) of the 2001 EPIC spectral data sets and the best-fit NTHCOMP+DISKBB model\n    of the 2012 EPIC data sets.}\n  \\label{difference_model}\n\\end{figure}\n\n\\begin{figure}\n  \\centering\n  \\includegraphics[height=8cm, angle=0]{fig7.eps}\n  \\caption{ The selection for time slices from 2012 May EPIC-pn\n  lightcurve for time resolved spectroscopy. Dash-dotted lines show time slices of about 20ks each (A,B,C,D,E,F).  The shaded light gray time slices are the exposures exactly similar to the observed U band emission. The shaded dark gray time slice ($45-60$ ks) where flare is excluded from C interval in the analysis.}\n  \\label{time_select_curve}\n\\end{figure}\n\n\n\n\\subsection{The intrinsic disc Comptonization model}\nThe strong soft X-ray excess emission can also be modeled by thermal\nComptonization in a cool, optically thick plasma \\citep[see\ne.g.,][]{2007ApJ...671.1284D}. If the gravitational energy released is\nnot completely thermalised, then it is possible that a fraction of the\nenergy  dissipated in the inner disc elevates its\ntemperature such that it acts as an optically thick thermal\nComptonizing medium. The intrinsic disc Comptonization model (OPTXAGNF)\naccounts for the thermal Comptonization in the inner disc material\n\\citep{2012MNRAS.420.1848D}.\nThis model is an energetically consistent model in which gravitational\nenergy is distributed among different parts of the accretion disc.\nThis model itself takes care of colour\ntemperature correction at each radius to partly contribute to the soft excess.\nThe inner disc emission gets Compton upscatters from thermal Comptonization medium,\n$r_{corona}$ to r$_{ISCO}$,  which consists of an\noptically thick cool ($kT_{e}\\sim0.2${\\rm~keV}) electron plasma.  The thermal Comptonization in\nthe disc plasma is responsible for the soft X-ray excess emission. A\nfraction of total gravitational energy is also dissipated into a hot\ncorona below $r_{corona}$ which is responsible for the hard X-ray\nemission extending to a few $100{\\rm~keV}$. Thus, the OPTXAGNF model includes the\nthree components -- thermal emission from a standard disc, optically thick thermal\nComptonization in the inner disc and optically thin thermal Comptonization in a hot\ncorona below $r_{corona}$. This model provides important information on black hole spin ($a$), accretion\nrate relative to Eddington rate ($L/L_{Edd}$) and properties of optically thick\ncool plasma (elctron temperature $kT_{e}$ and optical thickness $\\tau$).\n\nTo fit the soft X-ray excess and the high energy continuum, we used\nthe model WABS$\\times$OPTXAGNF. We fixed the black hole mass to\n$2\\times10^{6}~M_{\\odot}$  \\citep{2007ApJ...667..131G, \n  2011ApJ...727...31A}, distance to $364{\\rm~Mpc}$ ($z=0.081$)\nand outer radius to $400r_{g}$. \n The residuals, obtained after fitting the model,\ndid not show any significant features with a \n$\\chi^{2}/dof=502.4/460$.  The observed data, the model and the\nresiduals are shown in Fig.~\\ref{disc_fit_spec}~(a) and the best-fit parameters\nare listed in Table \\ref{pca_ref}. There are no obvious narrow emission\nline in the Fe-K regime which may arise from \na neutral reflection component from a distant material such\nas a putative torus. To examine this further, we included a narrow Gaussian line\nwith the width fixed at $\\sigma=10{\\rm~eV}$, line energy fixed to $6.4{\\rm~keV}$ and obtained a $90\\%$ upper limit\non the equivalent width to be 0.08{\\rm~keV}.\n\nSince the model includes the emission from the outer disc, it can\nalso predict the UV emission from such a system. This can be compared with\nthe data from the Optical Monitor (OM). The reduction and reprocessing of the UV data\n  measured with the OM is described in detail in section 5. We\n  used the time-averaged count rate in the U filter to construct the U\n  band spectrum usable in XSPEC. We also used the latest response for\n  this filter \\footnote{http://xmm2.esac.esa.int/external/xmm\\_sw\\_cal/calib/om\\_files.shtml}.\n  We obtained the flux density in the U band to be $7.49\\pm0.03\\times10^{-16}$\\efluxA.\n  We estimated the predicted U band flux by extending the best fit X-ray model. For this,\nwe increased the outer radius to $10^5 r_g$ and used a Galactic reddening factor\n$E(B-V)=0.0681$ \\citep{2011ApJ...737..103S}. The estimated flux density was found to\nbe $0.810\\pm0.001\\times10^{-16}$\\efluxA. Clearly the observed UV flux \nis significantly higher than the predicted value indicating that the UV emission is not due\nto the outer disc intrinsic emission but perhaps due to X-ray reprocessing. In this\nanalysis, we have fixed the black hole mass to  $M_{BH}= 2\\times10^{6}~M_{\\odot}$\nestimated from the $M_{BH}$-line width- luminosity relation described in\n  \\citet{2007ApJ...667..131G, 2007ApJ...670...92G}  using FWHM\n  width of $H_{\\alpha}$ line. However, in addition, if we allow the mass \n  to vary, the predicted UV flux matches with the observed one\n  for $M_{BH}=3.8_{-1.9}^{+1.5}\\times10^{7}~M_{\\odot}$. The best-fit resulted in $\\chi^{2}/dof=516.5/460$.  The best-fit parameters of {\\tt TBABS$\\times$REDDEN$\\times$OPTXAGNF} are as follows: $L/L_{Edd}=<0.32$, $kT_{e}=0.19\\pm0.01$~{\\rm~keV}, $\\tau=19.9_{-1.4}^{+1.7}$, $r_{corona}=63.8_{-31.7}^{+P}~r_{g}$ (P stands for pegged to hard limit), $a<0.93$, $f_{pl}=0.4\\pm0.1$ and $\\Gamma=2.35_{-0.05}^{+0.04}$ . Since there may be uncertainties in the black\n  hole mass measurement this can be a viable option.\n\n\n \\section{Long Term X-ray Spectral Variability}\n\nTo study long term spectral variability, we next analyzed and  fitted\nthe 2001 spectral data.  As before, we compared the\nEPIC-pn, EPIC-MOS1 and EPIC-MOS2 datasets by fitting the WABS$\\times$POWERLAW\nmodel in the $2-10{\\rm~keV}$ band and comparing the data-to-model ratios in\nthe full $0.3-10{\\rm~keV}$ band after extrapolating the powerlaw model to\nthe low energies.  We did not find any significant calibration issues\namong the data sets and as before we detected strong soft X-ray excess\nemission (see Fig.~\\ref{excess_fit_spec}). We then modeled the\nbroadband spectrum in the $0.3-10{\\rm~keV}$ using the same three model as used for\nthe 2012 data.  These fits\nresulted in $\\chi^{2}/dof=273.4/244$, $261.9/243$ and $322.8/245$\nfor ionized partial covering absorption, blurred reflection and\nintrinsic disc models, respectively. The best-fit models, data and the\nresiduals are shown in Fig.~\\ref{pca_fit_spec}~(b),~\\ref{ref_fit_spec}(b)\nand ~\\ref{disc_fit_spec}(b), and the best-fit parameters are listed in\nTable~\\ref{pca_ref}. As before, we also replaced KDBLUR with\nRELCONV\\_LP to estimate the height implied for the X-ray source in the lamppost\nillumination model. The best-fit parameters of WABS$\\times$(NTHCOMP+RELCONV\\_LP*REFLIONX)\nare listed in Table~\\ref{lp_ref}.\n\n To further investigate the long term variability, we fitted both 2001 and 2012 observation by NTHCOMP+DISKBB model. We used NTHCOMP as a powerlaw component and DISKBB to describe the soft excess component. The soft excess flux obtained from DISKBB in the $0.3-2$ {\\rm~keV}~band and the NTHCOMP flux in the $2-10$ {\\rm~keV}~band remained nearly constant. The NTHCOMP flux in the $0.3-2${\\rm~keV}~band was about 16\\% higher and the photon index $\\Gamma$ slightly steeper in the 2001 observation as compared to 2012 observation indicating that the powerlaw component flattened at lower flux in 2012 (see Table ~\\ref{diff_spec}). We applied the best-fit simple model (NTHCOMP+DISKBB) of 2012 observation to 2001 observation and show the ratio of 2001 data and 2012 model in Fig.~\\ref{difference_model}.  The marginal excess is due to slightly steeper powerlaw component at higher flux in 2001. Such spectral variability i.e., steeper spectrum at high flux, is common in Seyfert 1 galaxies (e.g., \\citealt{1998ApJ...505..594N, 2001ApJ...548..694V, 2001ApJ...551..186Z, 2002ApJ...564..162R, 2011MNRAS.415.1895E}). \n\t \n\\begin{table*}\n  \\noindent\n  \\caption{Fluxes for soft X-ray excess and powerlaw in different~bands modeled with DISKBB+NTHCOMP} \\label{diff_spec}\n  \\begin{tabular}{lccccc}\n    \\hline \n    Observation   &$\\Gamma$   &$kT_{multicbb}~({\\rm~eV})$     &$f_{SE}$~($0.3-2${\\rm~keV})   &$f_{NTH}$ ($0.3-2${\\rm~keV})  &$f_{NTH}$ ($2-10${\\rm~keV})\\tabularnewline\n    \\hline\n    2001    &$2.62\\pm0.07$ &$154.0_{-5.7}^{+5.5}$  &$2.0\\pm0.3$   &$3.4\\pm0.3$   &$0.95\\pm0.05$ \\tabularnewline\n    2012    &$2.49\\pm0.03$ &$156.9\\pm2.1$   &$2.0\\pm0.1$            &$2.6\\pm0.1$           &$0.92\\pm0.02$ \\tabularnewline\n    \\hline\n  \\end{tabular}\n  {~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Note--Flux is measured in units of $10^{-12}$ \\funit.}\n\\end{table*}\n\n\n\n\n\n\\begin{table*}\n  \\noindent \\begin{centering}\n\t  \\caption{Best-fit spectral model parameters for the time-selected EPIC-pn spectra extracted based on OM exposures, and also similarly for time slices of flares.} \\label{pldbb1}\n    \\begin{tabular}{lccccccc}\n      \\hline\n      \\hline \n      Exposure &\\multicolumn{3}{c}{ POWERLAW}  & \\multicolumn{3}{c}{Soft X-ray excess}    \\tabularnewline\n      interval (ks) &$\\Gamma$ &n$_{pl}$~($10^{-4}$) &$f_{2-10{\\rm~keV}}$~($10^{-13}$) &kT$_{in}$({\\rm~eV})&n$_{multicbb}$~($10^{2}$) &$f_{0.3-2{\\rm~keV}}$~($10^{-12}$) &$\\chi^{2}/dof$ \\tabularnewline\n      \\hline\n      0-14~(\\rm A)&$2.5\\pm0.2$                &$6.4\\pm1.0$   &$7.9\\pm1.1$  &$164.4_{-9.7}^{+9.5}$ &$2.5_{-0.8}^{+0.9}$ &$1.95_{-0.5}^{+0.4}$&69.0/76\\tabularnewline\n\n      14-35~(\\rm B)&$2.5\\pm0.2$ &$6.1\\pm0.7$    &$7.2_{-0.8}^{+0.9}$  &$159.1_{-11.1}^{+10.7}$  &$2.0_{-0.7}^{+0.8}$    &$1.3_{-0.4}^{+0.3}$&66.2/86\\tabularnewline\n      35-60~(\\rm C)&$2.7\\pm0.1$ &$7.9\\pm0.7$   &$7.8\\pm0.7$          &$156.7_{-7.9}^{+8.1}$    &$2.7_{-0.8}^{+0.9}$     &$1.7_{-0.4}^{+0.3}$&135.7/111\\tabularnewline\n      60-85~(\\rm D)&$2.5\\pm0.2$ &$6.3\\pm0.8$   &$7.5_{-0.9}^{+1.0}$  &$157.5_{-8.4}^{+8.0}$    &$3.0_{-0.8}^{+0.9}$     &$1.9\\pm0.4$&99.9/91\\tabularnewline\n      85-109~(\\rm E)&$2.6\\pm0.1$ &$9.0\\pm0.7$  &$9.85_{-0.7}^{+0.8}$  &$151.2_{-5.5}^{+5.3}$    &$4.9_{-0.9}^{+1.0}$     &$2.5_{-0.4}^{+0.3}$&128.0/120\\tabularnewline\n      109-126~(\\rm F)&$2.5\\pm0.2 $&$8.4\\pm1.1$&$9.9_{-1.1}^{+1.2}$&$162.7_{-10.4}^{+9.9}$ &$2.9_{-0.9}^{+1.0}$   &$2.1\\pm0.5$&75.9/84\\tabularnewline\n      35-45~(\\rm C flare)&$2.5\\pm0.2$ &$8.3\\pm1.0$   &$10.1\\pm1.3$  &$151.5_{-9.8}^{+9.0}$    &$4.4_{-1.2}^{+1.5}$     &$2.3\\pm0.5$  &90.0/84\\tabularnewline\n      95-105~(\\rm E flare)&$2.4\\pm0.2$ &$8.6\\pm1.0$  &$12.5_{-1.3}^{+1.4}$  &$150.3_{-7.7}^{+7.3}$    &$6.5_{-1.3}^{+1.6}$     &$3.3_{-0.5}^{+0.4}$&102.2/86\\tabularnewline\n\n      \\hline\n    \\end{tabular}\n    \\par\\end{centering}\n    {~~~~~~~~Note-- $n$ represents the normalization of respective components and  flux is measured in units of \\funit~for EPIC-pn data. The fluxes of both soft excess and powerlaw components were measured from DISKBB and POWERLAW model convolving with CFLUX in the $0.3-2${\\rm~keV} ~and $2-10${\\rm~keV}~ bands, respectively. We also modified above model by Galactic absorption while fitting.}\n\\end{table*}\n\n  \\begin{figure*}\n    \\centering\n    \\includegraphics[scale=0.6]{fig8a.eps}\n  \n    \\includegraphics[height=8cm, angle=0]{fig8b.eps}\n    \\caption{ Left panel: The model independent evolution of different\n      spectral components constructed using mean sub-exposures.  Right panel:\n      The model dependent evolution of different spectral components\n      constructed using mean sub-exposures where powerlaw and soft\n      excess flux are plotted in units of $10^{-13}$ and\n      $10^{-12}$\\funit~,respectively. The UV flux density is measured in units\n      of $10^{-16}$~\\efluxA. The diamond symbol indicates the C interval where X-ray\n      flare is excluded from the analysis. The error bars are plotted with one sigma\n      error to the values.}\n    \\label{time_sel_results}\n  \\end{figure*}\n\n   \\begin{figure*}\n    \\centering\n    \\includegraphics[scale=0.6]{fig9.eps}\n    \\caption{ Fractional variability amplitude F$_{var}$ as a function of energy derived from background corrected EPIC-pn lightcurve with 500s bins. }\n    \\label{rms_spec}\n  \\end{figure*}\n\n\n\n\\section{ X-ray and UV variability during 2012 observation}\n\n\nThe long observation of 2012 allows us to study the short term variability \nof the X-rays and the UV emission from the source. \nWe constructed the lightcurve for the UV emission at\n$3440$\\text{~\\AA}  measured with the Optical Monitor\n\\citep[{OM}:][]{2001A&A...365L..36M}.  First we reprocessed the OM\ndata with the OMICHAIN tool. In the total span of $137{\\rm~ks}$ exposure,\nwe obtained 6 OM exposures (IDs: 025, 026, 027, 028, 029 and 030),\n$\\sim 4{\\rm~ks}$ each, of U filter centered at $3440$\\text{~\\AA}. We\nobtained the source count rates from the source list files\ngenerated by the OMICHAIN tool. We also verified these corrected count\nrates by performing interactive photometry of the source. We selected\nsource region with a radius of 6 pixels and an annular area for\nbackground region with inner radius of 8 pixels and outer radius of 13\npixels and obtained the background subtracted count rates from each OM\nexposure. We used a conversion\nfactor\\footnote{$http://xmm.esac.esa.int/external/xmm\\_user\\_support/documentation/$}\nof 1.94$\\times10^{-16}$\\efluxA~to convert the count rates to flux densities\nat $3440$\\text{~\\AA} and constructed the OM UV lightcurve.\nWe also derived the UV lightcurves of nearby four sources \nand compared to the UV lightcurve of II~Zw~177. We found that the UV emission from\nthe nearby sources did not vary as the UV emission of this AGN. Hence we concluded that\nthe UV variability of II~Zw~177 is intrinsically associated with the AGN.\n\n\nFurther, we extracted time-selected spectra from the EPIC-pn data.\nThe time selection is based on the OM exposures. Since each of the OM\nexposures are only $\\sim4{\\rm~ks}$ long, the corresponding time-selected X-ray\nspectra extracted for the same time window as the OM exposures were\npoor in signal-to-noise ratio. Therefore, we increased exposures of\neach time-selected spectra to include the OM exposures and required\nthat exposures of two X-ray spectra from neighbouring time slices do\nnot overlap. The time-selection for the X-ray spectra is shown in\nFig. ~\\ref{time_select_curve}.  The variations of the count rates in\n$0.3-10{\\rm~keV}$, $0.3-2{\\rm~keV}$, $2-10{\\rm~keV}$ and OM U band are shown in\nFig.~\\ref{time_sel_results}~(a). All the count rates are observed to be variable on $\\sim 20$ks timescales\nwith fractional variability amplitudes \\citep{2003MNRAS.345.1271V} of $F_{var} = 13.8\\pm 2.8$,\n$16.9\\pm 5.0$ and $1.0 \\pm 0.3$ for the hard, soft and UV fluxes, respectively (see Fig.~\\ref{time_sel_results}). Since UV exposure is outside the X-ray flare for time interval C, the inclusion of X-ray flare may bias the correlation between X-ray and UV emission. We therefore used $45-60$ks interval of time slice C without X-ray flare to derive $F_{var}$ in both soft and hard band. We found that $F_{var}$ strengthens with similar values (hard band : $F_{var}=14.9\\pm3.1\\%$, soft band : $F_{var}=23.4\\pm6.1\\%$).\n\nIt is clear from Fig.~\\ref{time_sel_results}~(a) and (b) that the \nthe X-ray fluxes (and X-ray fluxes without C flare) in the soft and hard bands are correlated, \nThe Spearman rank correlation is $0.89 ~(0.94)$ with a probability\nthat the two are not correlated $< 0.02 ~(0.01)$. However no such correlation\nexists between the UV flux and the X-ray ones with a Spearman rank probability\nthat they are not correlated  being $< 0.2~(0.2)$ and $< 0.28~(0.2)$ for the \nsoft and hard bands, respectively. Since each time selected observation\ndid not have enough quality to fit a sophisticated model we used \nan empirical one namely a combination of multicolour blackbody disc emission\n(DISKBB) to represent the soft excess and a power-law for the\nhard continuum.  The results of the\ntime-selected spectroscopy are listed in Table~\\ref{pldbb1} and\nplotted in Fig.~\\ref{time_sel_results}~(b). Again, we see that while\nthe soft excess and the hard power law fluxes are correlated, the UV \nflux is not correlated to either of them.\n\nThe EPIC-pn lightcurve of II~Zw~177 in the $0.3-10${\\rm~keV}~band has shown \nstrong X-ray flares (see intervals C and E in\nFig.~\\ref{time_select_curve}). In order to study short-term spectral variability, \nwe extracted flare spectra from the intervals $35-45{\\rm~ks}$ \nand $95-105{\\rm~ks}$  of 2012 data. \n\n We then fitted  the individual flare spectra in the C and E intervals with the\nPOWERLAW+DISKBB model. The best-fit parameters of both flares are listed in Table~\\ref{pldbb1}. We found the\npowerlaw fluxes $1.0\\pm0.1\\times10^{-12}$\\funit~ and $1.3\\pm0.1\n\\times10^{-12}$\\funit~in $2-10${\\rm~keV}~band for C and E flares, respectively. We\nalso found the soft X-ray excess fluxes $2.3\\pm0.5\\times10^{-12}$\\funit~ and\n$3.3_{-0.4}^{+0.5}\\times 10^{-12}$\\funit~in the $0.3-2${\\rm~keV}~band for C and E\nflares, respectively. Thus, our fitting clearly suggests that both powerlaw\nflux and soft X-ray flux were higher during the flare state compared to\nnearby intervals (see Table~\\ref{pldbb1}. This\ncould be caused due to the rapid changes intrinsic to the corona producing higher\npowerlaw emission and hence higher soft X-ray excess emission within the frame\nof reflection model. \n\n\nFurthermore, to study fractional variability amplitude ($F_{var}$) as a function of X-ray energy, we created rms spectrum using source lightcurves with a time binsize of 500s in the $0.3-10${\\rm~keV}~band. We used the $0.3-0.5$, $0.5-1$, $1-2$ and $2-10$ {\\rm~keV}~bands to find $F_{var}$ for each energy band. We then plotted $F_{var}$ values together as shown in Fig.~\\ref{rms_spec}. We also calculated the $F_{var}$ in the $0.3-2${\\rm~keV}~in order to compare with $F_{var}$ in the $2-10${\\rm~keV}~band using full EPIC-pn lightcurve with 500s bins. We found $F_{var}=20.1\\pm0.4\\%$ in the $0.3-2${\\rm~keV}~band which is comparable to $F_{var}=20.1\\pm1.9\\%$ in the $2-10${\\rm~keV}~band (see Fig.~\\ref{rms_spec}). On the other hand, to examine the UV emission variability, we fitted a linear model to the UV lightcurve and found the best-fit function $P(t)= 7.622-0.002~t$, where $t$ the elapsed time in unit of ks. The fit resulted into $\\chi^{2}/dof =0.39/4$. The best-fit model and data are shown in the upper panel of Fig.~\\ref{uv_variation}. We then subtracted the best-fit predicted UV flux of the line model from the observed UV flux to derive the residual lightcurve. The UV lightcurve corrected for secular decline shows no significant variability (see lower panel of Fig.~\\ref{uv_variation}). \n\n \\begin{figure*}\n    \\centering\n    \\includegraphics[scale=0.6]{fig10.eps}\n  \n\n    \\caption{ The UV emission variability : (a) The best-fit linear model $f_{M}(t)=\n    7.622-0.002~t$ to the observed UV emission $f_{U}$, showing gradual or secular decline. (b) The residuals $f_{U}-f_{M}$ show no significant variability on top of the secular decline.}\n    \\label{uv_variation}\n  \\end{figure*}\n\n  \n\n\n\n\n\n\\section{Summary \\& Discussion }\n\nWe studied the broadband UV to X-ray emission from II~Zw~177 using two\n{\\it XMM-Newton}{} observations. Our main results are as follows.\n\n$\\it(i)$  Both observations show soft X-ray excess\nemission below $2{\\rm~keV}$ which can be equally well modelled \nby a  blurred reflection and an intrinsic disc Comptonization\ncomponent. The ionized partially covering model does not describe\nthe data well.\n\n$\\it(ii)$ Between the two observations the flux in the $0.3$-$2${\\rm~keV}~\nvaried by around 16\\% while the flux in the $2$-$10$ {\\rm~keV}~ did not vary\nmuch. For the blurred reflection model, the emissivity index\n\tdid not vary and the height of the corona remains consistent ($2012 : h=\n 3.3_{-1.4}^{+0.4}r_{g} , 2001: h=<4.7r_{g}$). Perhaps X-ray\n reprocessing is not contributing to the soft X-ray flux variation. \n The small change in the soft band flux is likely due to the change\n in the shape of the powerlaw which appears to be steeper when the soft band flux was higher in 2001. \n \n\n$\\it(iii)$  For the long observation of 2012, the X-ray flux was found to be\nvariable on timescale of $\\sim20$ ks with fractional variability\namplitude of $F_{var} \\sim 15$\\%. Time resolved spectral\nfitting also revealed that the soft excess represented by  \nthermal emission is well correlated with the hard powerlaw flux.\n\n$\\it(iv)$  Extension of the best fit X-ray thermal Comptonization model\nshows that the observed UV emission is significantly higher than that\nexpected from a standard accretion disc. This discrepancy can be removed\nif the black hole mass is $\\sim 4 \\times 10^7 M_\\odot$ which is significantly\nlarger than $2 \\times 10^6 M_\\odot$ reported in the literature.\n\n\n$\\it(v) $ The UV flux is found to be weakly variable at a level of $F_{var} \\sim 1$\\%. However, the UV flux\nis not correlated to the total X-ray flux nor to the X-ray fluxes\nin the  $0.3$-$2$ and $2$-$10$ {\\rm~keV}~bands. The UV flux is also not correlated\nto the soft excess or powerlaw X-ray components. The gradual decline of the observed UV\nemission such much longer variability timescale compared to $\\sim20$ ks, and may be related \nto the secular decline resulting from changes in  the accretion rate. \n\n\nWithin the context of the blurred reflection model our results indicate that\nthe geometry i.e., location of the hard X-ray producing corona does not vary\nin this source on long timescale. The soft X-ray excess and powerlaw fluxes\nare similar and other spectral components are also found consistent except\nslight variation in photon index. Hence the marginal variability\nis not caused by the X-ray reflection on long timescale. The\nphoton index tends to be more steeper in 2001 observation. This\ncan be seen clearly in the results of the Comptonization model (see Table-2). \n\n\nThe Comptonization model also explains full X-ray band including the soft excess\nequally well to both 2012 and 2001 observations. Despite the constant temperature of cool\nComptonization medium, the slight change in accretion rate ($2012~\\rm observation : L/L_{E} = 0.65\\pm0.01$,\n$2001~\\rm observation : L/L_{E} = 0.8_{-0.1}^{+0.8}$) and hence the change in gravitational\nenergy may be causing the long-term variation in high energy emission and hence photon\nindex.\n\nThe time-resolved\nspectroscopy of 2012 observation shows that powerlaw slope was found similar in\nall time intervals. In particular, we did not observe a clear correlation between the photon index and the powerlaw flux. \nHence, the powerlaw flux variability is unlikely to be caused by the variations in the seed flux from accretion disc.\nThe variability is most likely intrinsic to the hot corona.   If the\nhard X-ray source is compact and close to the black hole, then strong light\nbending effects make the powerlaw component strongly variable and soft X-ray\nexcess weakly variable \\citep{2004MNRAS.349.1435M}. This is in contrast to the\nvariability seen in the soft X-ray excess (i.e., the reflection component) and\npowerlaw components. The soft excess (i.e., the\nreflection component) and the powerlaw fluxes are correlated with similar\nfractional variability amplitudes ($F_{var}\\sim15\\%$). Moreover, this is further strongly supported by the rms spectra shown in Fig.~\\ref{rms_spec} suggesting similar variability in soft and hard bands. \nHence, intrinsic variations in the corona, possibly unrelated \nto the changes in the height, must be responsible for the\nobserved variability of the powerlaw and its correlation with the soft X-ray excess.\nIn the blurred reflection model, the soft X-ray excess is expected to follow the intrinsic variations \nin the coronal emission. \n\n\nThe observed UV emission\nis weakly variable on timescale of $\\sim20{\\rm~ks}$  with $F_{var}\\sim1\\%$ and\nfurther shows no correlation with X-ray emission in the soft ($0.3-2{\\rm~keV}$) and hard ($2-10{\\rm~keV}$) bands or X-ray spectral\ncomponents. If the UV emission is the thermal emission from a standard disc, the U band flux with\na central wavelength of $3440$\\text{~\\AA} must arise from radii near $\\sim\n  2000r_g$ in the disc where the temperature is\n  $\\sim10^{4}{\\rm~K}$ for $M_{BH}\\sim\n  2\\times10^{6}{\\rm~M_{\\odot}}$ and accretion rate $\\dot{m}\\sim 0.7$\n  relative to the Eddington rate (as suggested by the OPTXAGNF model). At these radii, the viscous timescale \n is very long ($t_{vis} \\sim 30-3000{\\rm~years}$ for $r/H \\sim 10-100$ and $M_{BH}\\sim\n 2\\times10^6{\\rm~M_{\\odot}}$). The light crossing time is the time delay between the X-ray emission from a compact corona around the SMBH and the UV emission from the disc. If the UV emission is caused by the reprocessing of X-rays into the disc, then the UV emission is believed to lag behind the X-rays by the light crossing time. If the variable X-rays is dominated by the variations in the seed UV photons, then the X-ray emission is expected to lag behind the UV emission again by the light crossing time. Assuming only viscous heating of accretion disc, the disc emission from each radius can be described as a blackbody with distinct temperature. According to Wein's law, the blackbody temperature can be deduced from the effective wavelength ($\\lambda_{eff}$) peaking in the observed bandpass. Comparing this temperature as from the standard accretion disc, one can find the radius of accretion disc for observed emission in a given bandpass (e.g., \\citealt{2007MNRAS.375.1479S}). Thus, the light crossing time between the emitting regions of X-ray and UV emission can be derived to be \n\n", "index": 1, "text": "\\begin{equation}\n\\tau_{cross} \\approx 2.6\\times10^5 \\left(\\frac{\\lambda_{eff}}{3000~\\text{\\AA}}\\right)^{4/3}   \\left(\\frac{\\dot{M}}{\\dot{M}_{Edd}}\\right)^{1/3} \\left(\\frac{M_{BH}}{10^8M_{\\odot}}\\right)^{2/3}{\\rm~sec}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\tau_{cross}\\approx 2.6\\times 10^{5}\\left(\\frac{\\lambda_{eff}}{3000~{}\\text{%&#10;\\AA}}\\right)^{4/3}\\left(\\frac{\\dot{M}}{\\dot{M}_{Edd}}\\right)^{1/3}\\left(\\frac{%&#10;M_{BH}}{10^{8}M_{\\odot}}\\right)^{2/3}{\\rm~{}sec}.\" display=\"block\"><mrow><mrow><msub><mi>τ</mi><mrow><mi>c</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>≈</mo><mrow><mrow><mn>2.6</mn><mo>×</mo><msup><mn>10</mn><mn>5</mn></msup></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mrow><mpadded width=\"+3.3pt\"><mn>3000</mn></mpadded><mo>⁢</mo><mtext>Å</mtext></mrow></mfrac><mo>)</mo></mrow><mrow><mn>4</mn><mo>/</mo><mn>3</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><msub><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mrow><mi>E</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>d</mi></mrow></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>3</mn></mrow></msup><mo>⁢</mo><mpadded width=\"+3.3pt\"><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mrow><mi>B</mi><mo>⁢</mo><mi>H</mi></mrow></msub><mrow><msup><mn>10</mn><mn>8</mn></msup><mo>⁢</mo><msub><mi>M</mi><mo>⊙</mo></msub></mrow></mfrac><mo>)</mo></mrow><mrow><mn>2</mn><mo>/</mo><mn>3</mn></mrow></msup></mpadded><mo>⁢</mo><mi>sec</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]