[{"file": "1601.08125.tex", "nexttext": "\nwhere $\\eta$ an infinitesimal positive value, $\\epsilon_{n\\mathbf{k}}$ are the Bloch DFT Kohn-Sham eigenvalues and $f_{n{\\mathbf{k}}}$ their occupation,\n$\\tilde{\\rho}_{nm{\\mathbf{k}}}({\\mathbf{q}},{\\mathbf{G}}) = \\int d{\\mathbf{r}} \\, \\psi_{n{\\mathbf{k}}}({\\mathbf{r}})e^{-i({\\mathbf{q}}+{\\mathbf{G}})\\cdot{\\mathbf{r}}}\\psi^*_{m{\\mathbf{k}}-{\\mathbf{q}}}({\\mathbf{r}}) $ \nis constructed from the DFT Kohn-Sham wave functions $\\psi_{n{\\mathbf{k}}}({\\mathbf{r}})$,\nwith wave vectors $\\mathbf{k}$ and momentum transfer ${\\mathbf{q}}$ lying within the first Brillouin zone, spatial coordinate ${\\mathbf{r}}$, and band indices $n$ and $m$.  The TDDFT full polarizability is then determined via the Dyson equation,\n\n", "itemtype": "equation", "pos": 8670, "prevtext": "\n\n\\title{Interpretation of monoclinic hafnia valence electron energy loss spectra by TDDFT}\n\n\\author{L. Hung}\n\\altaffiliation[Current address: ]{NIST Center for Neutron Research, National Institute of Standards and Technology, Gaithersburg, Maryland 20899-6102, USA}\n\\affiliation{Laboratoire des Solides Irradi\\'es, \\'Ecole Polytechnique, CNRS, \nCEA, Universit\\'e Paris-Saclay, F-91128 Palaiseau, France}\n\\affiliation{European Theoretical Spectroscopy Facility (ETSF)}\n\\author{C. Guedj}\n\\affiliation{Univ. Grenoble Alpes, F-38000 Grenoble, France}\n\\affiliation{CEA, LETI, MINATEC campus, F38054 Grenoble, France}\n\\author{N. Bernier}\n\\affiliation{Univ. Grenoble Alpes, F-38000 Grenoble, France}\n\\affiliation{CEA, LETI, MINATEC campus, F38054 Grenoble, France}\n\\author{P. Blaise}\n\\affiliation{Univ. Grenoble Alpes, F-38000 Grenoble, France}\n\\affiliation{CEA, LETI, MINATEC campus, F38054 Grenoble, France}\n\\affiliation{European Theoretical Spectroscopy Facility (ETSF)}\n\\author{V. Olevano}\n\\affiliation{Univ. Grenoble Alpes, F-38000 Grenoble, France}\n\\affiliation{CNRS, Institut N\\'eel, F-38042 Grenoble, France}\n\\affiliation{European Theoretical Spectroscopy Facility (ETSF)}\n\\author{F. Sottile}\n\\affiliation{Laboratoire des Solides Irradi\\'es, \\'Ecole Polytechnique, CNRS, \nCEA, Universit\\'e Paris-Saclay, F-91128 Palaiseau, France}\n\\affiliation{European Theoretical Spectroscopy Facility (ETSF)}\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe present the valence electron energy-loss spectrum and the dielectric function of monoclinic hafnia (m-HfO$_2$) obtained from time-dependent density-functional theory (TDDFT) predictions and compared to energy-filtered spectroscopic imaging measurements in a high-resolution transmission-electron microscope. \nFermi's Golden Rule density-functional theory (DFT) calculations can capture the qualitative features of the energy-loss spectrum, but we find that TDDFT, which accounts for local-field effects, provides nearly quantitative agreement with experiment.\nUsing the DFT density of states and TDDFT dielectric functions, we characterize the excitations that result in the m-HfO$_2$ energy loss spectrum.\nThe sole plasmon occurs between 13-16 eV, although the peaks $\\sim$28 and above 40 eV are also due to collective excitations.\nWe furthermore elaborate on the first-principles techniques used, their accuracy, and remaining discrepancies among spectra. \nMore specifically, we assess the influence of Hf semicore electrons (5$p$ and 4$f$) on the energy-loss spectrum, and find that the inclusion of transitions from the 4$f$ band damps the energy-loss intensity in the region above 13 eV.\nWe study the impact of many-body effects in a DFT framework using the adiabatic local-density approximation (ALDA) exchange-correlation kernel, as well as from a many-body perspective using a $GW$-derived electronic structure to account for self-energy corrections.\nThese results demonstrate some cancellation of errors between self-energy and excitonic effects, even for excitations from the Hf $4f$ shell.\nWe also simulate the dispersion with increasing momentum transfer for plasmon and collective excitation peaks.\n\\end{abstract}\n\n\\pacs{77.22.Ch, 79.20.Uv, 71.15.Mb, 71.15.Qe}\n\\keywords{HfO$_2$, hafnia, monoclinic, TEM, VEELS, EELS, DFT, TDDFT}\n\n\\maketitle\n\n\\section{Introduction}\n\nHafnia-based dielectric materials are among the most promising and extensively studied high-$\\kappa$ materials, due to HfO$_2$'s high permittivity, relatively wide band gap, and compatibility with Si that make it useful for applications in micro- and nano-electronics.\\cite{ChoiReview,RobertsonReview}\nTo obtain improved dielectric and stability properties, much research focuses on doping HfO$_2$ or studying alternative interfaces and phases.\nHowever, an accurate characterization of the parent HfO$_2$ material can benefit both fundamental knowledge and technological advances.\n\nTo better understand the dielectric properties of HfO$_2$,\nwe study $P2_1/c$ monoclinic HfO$_2$ (m-HfO$_2$) by experiment and first-principles theory.\nWe acquire energy-loss spectra with both good energy resolution and nanometer-scale spatial resolution using valence electron energy-loss spectroscopy (VEELS) combined with high-resolution transmission electron microscopy (HRTEM).\\cite{Abajo,VerbeeckVanDyck}\nTo simulate VEELS, we use time-dependent density-functional theory (TDDFT)\\cite{RungeGross,GrossKohn,ZangwillSoven}.\nA complete theoretical description of all dielectric properties must take into account physical processes involved in both single-particle and collective (e.g., plasmon) excitations, and include electron-hole (excitonic) and electron-electron (self-energy) interaction effects.\nFor the energy range of VEELS, the prominent features of spectra are typically caused by collective excitations.\nFor such excitations, TDDFT has demonstrated good agreement with experiment, due to the compensation of self-energy and excitonic effects.\\cite{OlevanoReining01}\nNotably, the TDDFT and experimental energy-loss spectra of ZrO$_2$, which is isomorphous to HfO$_2$, are in quantitative agreement.\\cite{Dash}\nIn this work, we compare TDDFT-predicted energy-loss spectra for m-HfO$_2$ with HRTEM-VEELS measurements for the dual purposes of\n(1) characterizing the peaks in the energy-loss spectrum and\n(2) understanding discrepancies between theory and experiment.\nIn addition to addressing local-field (LF) effects, we examine the contributions from localized semicore wave functions (especially the 4$f$ electrons of Hf), many-body exchange-correlation effects at the adiabatic local-density approximation (ALDA) and at the $GW$ level, and nonzero momentum transfer.\nWe discuss some results in the context of anisotropic effects, which were already presented in previous work,\\cite{APL2014} but most of our results here refer to averaged spectra corresponding to polycrystalline m-HfO$_2$.\n\nThis paper is organized as follows: Sec.~\\ref{sec:methods} describes our theoretical and experimental methods.\nIn Sec.~\\ref{sec:interpretation}, we characterize the excitations reflected in the features of experimental and theoretical energy-loss spectra (and the corresponding dielectric functions).\nIn Sec.~\\ref{sec:details}, we report the theoretical spectra obtained via first-principles TDDFT calculations, separating out the various contributions mentioned above (LF, semicore electrons, exchange-correlation effects, and momentum transfer).\n\nWe summarize our results in Sec.~\\ref{sec:conclusion}.\n\n\\begin{table}\n\t\\caption{Unit cell lattice parameters for m-HfO$_2$ calculated by DFT-LDA and measured by HRTEM.}\n\t\\label{lattice_parameters}\n\t\\begin{ruledtabular}\n\t\\begin{tabular}[c]{lllll}\n\t\t& $a$ [\\AA] & $b$ [\\AA] & $c$ [\\AA] & $\\beta$ [degrees]\\\\\\hline\n\t\tDFT-LDA & 5.05 & 5.14 & 5.22 & 99.56 \\\\\n\t\tHRTEM   & 5.1156 & 5.1722 & 5.2948 & 99.259\n\t\\end{tabular}\n\t\\end{ruledtabular}\n\\end{table}\n\n\\section{Methods}\n\\label{sec:methods}\n\\subsection{Theory}\n\n\nFirst-principles calculations are carried out within the framework of Kohn-Sham density-functional theory (DFT)\\cite{HohenbergKohn,KohnSham} and TDDFT\\cite{RungeGross,GrossKohn,ZangwillSoven} using a plane wave pseudopotential implementation.\nFor the scalar-relativistic Hf pseudopotential, the semicore 5$s$, 5$p$, and 4$f$ electrons are treated as valence (in addition to the 5$d$ and 6$s$ electrons) since they have relatively low binding energies ($\\sim$64 eV, $\\sim$30 eV, and $\\sim$10 eV, respectively, in HfO$_2$) such that the 5$p$ and 4$f$ electrons contribute to the energy range of interest.\n\nA scalar-relativistic Hf pseudopotential with only 5$d$ and 6$s$ electrons as valence is also tested to demonstrate the influence of the semicore electrons.\nAll pseudopotentials are constructed using the Trouiller-Martins scheme.\\cite{TroullierMartins}\n\nThe ground-state geometry and electronic structure are computed with DFT and the local-density approximation (LDA) exchange-correlation functional.\nWe use the ABINIT code\\cite{abinit} with a kinetic energy cutoff of 150 Ha and a $4 \\times 4 \\times 4$ Monkhorst Pack k-point grid.\nThe lattice vectors and atomic positions of m-HfO$_2$ are optimized in DFT, and the resulting unit cell dimensions are in good agreement with our HRTEM measurements (Table~\\ref{lattice_parameters}) and literature values.\\cite{WangLi}\n\nUsing the DP code,\\cite{dp} we compute the dielectric function and energy-loss spectra of m-HfO$_2$ via linear-response TDDFT as follows.\nFirst, we represent the independent particle polarizability as a matrix in terms of reciprocal lattice vectors ${\\mathbf{G}}$ and ${\\mathbf{G}}'$, momentum transfer ${\\mathbf{q}}$, and energy $\\omega$:\n", "index": 1, "text": "\n\\[\n  \\chi^0_{{\\mathbf{G}}{\\mathbf{G}}'}({\\mathbf{q}},\\omega) = \n    \\sum_{n, m, {\\mathbf{k}}} (f_{m{\\mathbf{k}}} - f_{n{\\mathbf{k}}})\n  \\frac{\n\\tilde{\\rho}_{nm{\\mathbf{k}}}({\\mathbf{q}},{\\mathbf{G}})\\tilde{\\rho}^*_{nm{\\mathbf{k}}}({\\mathbf{q}},{\\mathbf{G}}')}\n{\\omega- (\\epsilon_{n{\\mathbf{k}}}-\\epsilon_{m{\\mathbf{k}}}) + i\\eta},\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\chi^{0}_{{\\mathbf{G}}{\\mathbf{G}}^{\\prime}}({\\mathbf{q}},\\omega)=\\sum_{n,m,{%&#10;\\mathbf{k}}}(f_{m{\\mathbf{k}}}-f_{n{\\mathbf{k}}})\\frac{\\tilde{\\rho}_{nm{%&#10;\\mathbf{k}}}({\\mathbf{q}},{\\mathbf{G}})\\tilde{\\rho}^{*}_{nm{\\mathbf{k}}}({%&#10;\\mathbf{q}},{\\mathbf{G}}^{\\prime})}{\\omega-(\\epsilon_{n{\\mathbf{k}}}-\\epsilon_%&#10;{m{\\mathbf{k}}})+i\\eta},\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>χ</mi><msup><mi>𝐆𝐆</mi><mo>′</mo></msup><mn>0</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐪</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>m</mi><mo>,</mo><mi>𝐤</mi></mrow></munder><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>f</mi><mrow><mi>m</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub><mo>-</mo><msub><mi>f</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐪</mi><mo>,</mo><mi>𝐆</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>𝐤</mi></mrow><mo>*</mo></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐪</mi><mo>,</mo><msup><mi>𝐆</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mi>ω</mi><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ϵ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub><mo>-</mo><msub><mi>ϵ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>𝐤</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi>η</mi></mrow></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08125.tex", "nexttext": "\nwhere $v$ is the Coulomb potential and $f_{xc}$ is the exchange-correlation kernel.  The full polarizability is related to the inverse dielectric function by $\\varepsilon^{-1} = 1+ v\\chi$, and the electron energy-loss function is $-\\Im(\\varepsilon^{-1})$.\n\nThe real and imaginary parts of the dielectric function ($\\Re(\\varepsilon)$ and $\\Im(\\varepsilon)$, respectively) are used to characterize features in the energy-loss spectra.\nFeatures located at energy losses where the $\\Re(\\varepsilon)$ passes through zero (going from negative to positive) are collective excitations known as plasmons.\nOn the other hand, if the $\\Im(\\varepsilon)$ is large at the energy of some loss-spectra feature, the feature is attributed to single-particle inter-band excitations.\nFinally, features occurring at energies where the $\\Re(\\varepsilon)$ is small but nonzero correspond to (non-plasmon) collective excitations.\n\nOur calculations of dielectric functions and energy-loss spectra are converged after including $n=300$ bands, a basis of 9475 plane waves for the wave functions, and 329 plane waves for the dielectric matrices ($\\chi^0$, $\\chi$ and $\\varepsilon$).\nHere, we sample the Brillouin zone with $4 \\times 4 \\times 4$ k-point grids shifted in low-symmetry directions.\\cite{Benedict}\nUnless otherwise indicated, the spectra have a Gaussian broadening of $1.5$ eV to smooth the sampling error over the Brillouin zone and to take into account our experimental energy resolution of $1\\sim1.3$ eV.\nAlso unless stated otherwise, the computed spectra correspond to vanishing momentum transfer ($q \\rightarrow 0$), and are averaged over three reciprocal lattice directions, for comparison to measurements taken on polycrystalline samples.\n\nBy using a TDDFT framework, our simulations allow the inclusion of LF effects, which arise from anisotropies\\cite{anisotropy} and local inhomogeneities in the material and are crucial in the description of the HfO$_2$ loss function.\nTo aid in interpreting the spectra, we also present results that leave out LF effects (NLF), by only using the diagonals of the $\\chi^0$, $\\chi$ and $\\varepsilon$ matrices.\nSuch NLF calculations correspond to Fermi's Golden Rule DFT predictions.\nMost of our calculations use TDDFT in the random-phase approximation (RPA), where $f_{xc}=0$.\nIn addition, we consider TDDFT using the ALDA exchange-correlation kernel (TDLDA).\nWe also evaluate the effect of the many-body electron-electron self-energy by applying a ``scissor operator\" (SO) to the DFT electronic structure.\nIn contrast to starting from the Kohn-Sham DFT electronic structure (as is done in most our calculations), the SO shifts eigenvalues to roughly match $GW$ quasiparticle energies\\cite{Jiang} while keeping wave functions unchanged.\n\n\n\\subsection{Experiment}\n\nOur samples (previously described in Ref.~[\\onlinecite{APL2014}]) consist of decananometric hafnia layers grown on 200 mm p-Si(100) wafers by atomic layer deposition (ALD) in a cleanroom environment dedicated to the semiconductor industry.\nALD samples are prepared with a Strata\\texttrademark\\ 400 DualBeam\\texttrademark\\ FIB/STEM system using Ga$^+$ ions energies ranging from 30 keV down to 2 keV.\nAn improvement in the quality of HRTEM-VEELS data is obtained by selective lift-off of superficial amorphous species by HF etching.\nTransmission electron microscope (TEM) lamella thickness is optimized to avoid the need for multiple scattering deconvolution processing ($< 40$ nm) and to avoid excessive surface effects ($> 15$ nm).\nThe m-HfO$_2$ samples are polycrystalline with grains of varying size (Fig.~\\ref{tem}), and appear to be stable under e-beam irradiation in the time scale of the measurements.\nHigh grade m-HfO$_2$ commercial powders are also used for verification purposes.  \n\nCross-sectional electron nanospectroscopic imaging experiments are performed in a JEOL 2010 FEF TEM operated at 200 kV in high resolution mode.\nThe acquisition is performed in the energy filtered mode (EFTEM),\\cite{EFTEM} by recording images from a selected energy-loss range from an omega filter with an energy step of 0.1 eV between each image acquisition.\nIn order to minimize experimental momentum dispersion, a nearly parallel configuration (nbed mode) is used, and the convergence angle is less than 0.2 mrad.\nThe lowest achievable collection angles is used, and the measured energy resolution is close to 1 eV.\nExperimental data are corrected using the guidelines provided by Schaffer et al.\\cite{SCHAFFER}\nFor verification, complementary results are obtained with the Cs-corrected FEI Titan microscope operated at 200 keV in STEM spectrum imaging \\cite{STEMSI} and TEM modes.\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{600k_focus_step2nm-0001-1}\n\t\\caption{Cross-sectional HRTEM image of m-HfO$_2$ showing a polycrystalline area (left) and a single crystalline domain (right).\n\t}\n\t\\label{tem}\n\\end{figure}\n\nVEELS spectra are measured for each pixel in a HRTEM image and selectively averaged to provide a spectrum representative of a random polycrystal.\nThe zero-loss (elastic) contribution is removed from a reference VEELS spectrum acquired simultaneously in the vacuum region closest to the measured region of interest.\nThe Kramers-Kronig analysis \\cite{Egerton} is then performed on the single scattering distributions using classical routines available in the Digital Micrograph\\texttrademark\\ environment to provide complex permittivities, energy-loss functions and surface-loss functions.\nQuantitative spectra are difficult to obtain because of the numerous sources of variability due to instrumentation, sample preparation and data analysis,\nand about 100 million spectra are acquired over 20 different samples to obtain sufficient statistics.\n\n\n\\section{Interpreting energy-loss spectra}\n\\label{sec:interpretation}\n\n\\subsection{TDDFT vs. HRTEM-VEELS}\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{veels-elf}\n\t\\caption{VEELS spectra for m-HfO$_2$. \n\t\tThin solid green line: HRTEM-VEELS averaged on a polycrystalline sample;\n\t\tdashed red line: DFT without LF effects;\n\t\tand solid black line: TDDFT RPA with LF effects.\n        Theoretical curves have been convoluted with a Gaussian broadening of 1.5 eV.\n\t}\n\t\\label{elf}\n\\end{figure}\n\nIn Fig.~\\ref{elf} we show the HRTEM-VEELS spectrum and TDDFT RPA energy-loss spectra with and without LF effects.\nSince the RPA NLF energy-loss spectrum is already in qualitative agreement with HRTEM-VEELS,\nwe use predictions at this level of theory to begin characterization of the m-HfO$_2$ energy-loss spectrum.\nIt is straightforward to determine which transitions contribute to each excitation using the DFT-LDA density of states (DOS) (Fig.~\\ref{dos}).\nThe nature of the excitations (single-particle, plasmon, or collective) are characterized using the RPA NLF dielectric function.\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{dos}\n\t\\caption{The density of states (DOS) for m-HfO$_2$.\n\t\tThe inset shows the projected DOS near the band gap in greater detail.}\n\t\\label{dos}\n\\end{figure}\n\nWhile qualitatively correct, RPA NLF significantly overestimates the amplitude of the energy-loss peak above 40 eV, and the shoulder and peak $\\sim$25 eV are slightly underestimated.\nThe positions of the peaks are furthermore shifted relative to experiment.\nTo improve oscillator strength and peak positions, LF effects (RPA LF) are applied.\nThe RPA LF level of theory is thus used to refine our interpretation of the m-HfO$_2$ energy-loss spectrum as well.\nFig.~\\ref{epself} plots the RPA LF dielectric function together with the RPA NLF and HRTEM-VEELS derived dielectric functions.\n\nThroughout the following discussion, we make comparisons to previously reported energy-loss spectra,\\cite{Agustin,Jin,Cheynet,Couillard,Jang,ParkYang,Liou,Behar,Vos}\nand in particular to earlier interpretations by Agustin et al.,\\cite{Agustin} Couillard et al.,\\cite{Couillard} and Park and Yang.\\cite{ParkYang}\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{mhfo2-epself}\n\t\\caption{Energy-loss function (top), imaginary part of the dielectric function (middle), and the real part of the dielectric function (bottom) for m-HfO$_2$.\n\t\tDashed red line: RPA without LF effects;\n\t\tsolid black line: RPA with LF effects;\n\t\tand dot-dashed green line: HRTEM-VEELS derived dielectric functions.\n        Theoretical curves are calculated at a reduced Lorentzian broadening of 0.1 eV.}\n\t\\label{epself}\n\\end{figure}\n\n\\subsection{Energy losses under 13 eV}\nFrom the optical onset to $\\sim$13 eV, which corresponds the initial slope of the energy-loss spectrum, transitions have single-particle inter-band character as evidenced by the peak in the $\\Im(\\varepsilon)$.\nThese transitions take place between the highest valence band (mostly O 2$p$ character) and the lowest conduction band (mostly Hf 5$d$ character). Experimentally, this region is highly sensitive to physical artifacts such as carbon contamination or other subbandgap defect levels, in addition to \\v{C}erenkov or retardation effects\\cite{Erni} and numerical artifacts due to the removal of the zero loss. Therefore this region is certainly the most difficult to access experimentally, which complicates the comparison with simulation. \n\n\\subsection{Energy losses 13-30 eV}\n\nAt the energy resolution of 1.0--1.5 eV, the region from 13 to 16 eV appears as a shoulder.\nThis feature has been characterized as either inter-band transitions between O 2$p$ and Hf 5$d$\\cite{Agustin} or a bulk plasmon.\\cite{Couillard,Liou}\nIn both our TDDFT calculations and HRTEM-VEELS measurements, the $\\Re(\\varepsilon)$ passes through zero at $\\sim$13.5 eV (dotted line in Fig.~\\ref{epself}), and we thus attribute this feature to a bulk plasmon caused by the collective excitation of O 2$p$ and Hf 5$d$ and 6$s$ electrons.\nAs will be shown, this is the only true plasmon excitation for m-HfO$_2$.\nOur theoretical predictions and experimental measurements are in remarkably good agreement for the 0-crossing that defines the plasmon energy, although the sign reversal of the real permittivity is much more pronounced in STEM rather than HRTEM experiments.\n\nThe detected oscillator strength associated with this bulk plasmon is sensitive to experimental conditions, and the resulting feature ranges from a shoulder with a similar onset energy, to a distinct peak at energies of 15 to 16 eV.\\cite{Agustin,Jin,Cheynet,Couillard,Jang,ParkYang,Liou,Behar,Vos}\nSome of the variation can attributed to the energy resolution of the measurement,\nas we see a small peak in higher-resolution theoretical spectra that becomes a shoulder after the 1.5 eV Gaussian broadening.\nWe also demonstrated in previous work that the direction of momentum transfer affects peak amplitude:\nthe shoulder of the averaged spectrum (obtained with the same energy resolution as in this work) becomes a well-defined peak in certain directions.\\cite{APL2014} \n\nIn the range of 16 to 30 eV, the energy loss spectrum is attributed primarily to excitations of Hf 4$f$ and O 2$s$ electrons.\nThe Hf 4$f$ electrons are 5 eV less bound than the O 2$s$ electrons in DFT-LDA, but their combined contribution to both the $\\Im(\\varepsilon)$ and the energy-loss spectrum appears like a continuum.\nIn fact, by modeling the semicore states separately (Sec.~\\ref{subsec:semicore}), we note that the net effect of Hf 4$f$ electrons is to damp energy-loss amplitude throughout this energy range.\nThe peak at $\\sim$28 eV was previously interpreted as a plasmon.\\cite{Agustin}\nHowever, the nonzero $\\Re(\\varepsilon)$ indicates that this collective excitation is not a true plasmon, as is also seen in the ZrO$_2$ spectrum.\\cite{Dash,Couillard}\nThe excitations between 16-28 eV have been previously described as inter-band transitions.\\cite{Couillard,ParkYang}\nHowever, our analysis shows that the $\\Im(\\varepsilon)$ decreases smoothly throughout that energy range, up to and including $\\sim$28 eV where the peak is observed, while the $\\Re(\\varepsilon)$ remains nearly flat.\nThe lack of sharp features and zero-crossings in the dielectric functions leads us to conclude that between 16-28 eV,\nexcitations gradually transition from more single-particle character to more collective character.\n\n\n\\subsection{Energy losses above 30 eV}\n\nThe broad peak from 33 to 40 eV is attributed to single-particle excitations from the Hf 5$p$ electrons,\nand the corresponding peak is clearly visible in the RPA NLF $\\Im(\\varepsilon)$.\nIn some experiments, this structure appears as a double peak,\\cite{Agustin}\nand indeed our theoretical spectrum produces a double-peaked structure as well (at $\\sim$33 and $\\sim$37 eV).\nHowever we believe that this should be interpreted as a single feature.\nThe double-peaked structure is likely due to transition oscillator strength variations associated to the varying angular momentum character along the conduction band.\nIn particular, the second peak seems associated to the onset of the hybridization with Hf 6$s$ electrons on the conduction band (see Fig.~\\ref{dos}).\n\nFinally, above 41 eV, the energy-loss spectrum has a peak whose TDDFT-predicted amplitude is significantly dependent on LF effects.\nIn the RPA NLF energy-loss spectrum, this is the most intense peak and the $\\Re(\\varepsilon)$ indicates that it is the total main plasmon in m-HfO$_2$, \\textit{i.e.} all electrons participate, including semicore.\nHowever, in RPA LF, the $\\Re(\\varepsilon)$ is no longer negative in this region and the crossing through zero is lost.\nThe LF effects change this peak to a non-plasmon collective excitation that is less intense than the peak at $\\sim$28 eV.\nBecause of the significant changes in peak amplitude in this ``LF-damped plasmon\", we are unable to definitively interpret the finer features of the peak.\nHowever, the shoulder before the peak maximum (feature G in Agustin et al.)\\cite{Agustin} may be due to LF modulation of strength, since it is also visible in our RPA LF energy-loss spectrum.\n\n\\section{First-principles analysis}\n\\label{sec:details}\n\n\\subsection{Semicore electrons}\n\\label{subsec:semicore}\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{mhfo2-epselfnc}\n\t\\caption{Energy-loss function (top), imaginary part of the dielectric function (middle), and the real part of the dielectric function (bottom) for m-HfO$_2$. \n\t\tSolid blue line: RPA NLF without semicore (Hf 4$f$ 5$p$) electrons;\n\t\tdashed red line: RPA NLF explicitly inlcuding semicore electrons;\n\t\tand dot-dashed green line: HRTEM-VEELS derived dielectric functions.\n        Theoretical curves are calculated at a reduced Lorentzian broadening of 0.1 eV.}\n\t\\label{epselfnc}\n\\end{figure}\n\nThe effect of Hf semicore electrons is illustrated in Fig.~\\ref{epselfnc}, where we show RPA NLF predictions of the energy-loss function, the $\\Im(\\varepsilon)$, and the $\\Re(\\varepsilon)$,\ncomputed using two different pseudopotentials for Hf.\nOne pseudopotential freezes semicore electrons into the core to produce the ``RPA NLF nosc\" results, while the other considers them as valence (``RPA NLF\", same as in Fig.~\\ref{epself}).\nThis comparison illustrates that the presence of semicore electrons can either increase or damp the amplitude of peaks in the energy-loss spectra.\n\nThe semicore states contribute little to the low-energy transitions ($\\omega < 13$ eV), so calculations using the two pseudopotentials produce similar results in that region.\nThere is no noticeable difference in the energy-loss function,\nalthough the pseudization of semicore states results in small changes in the dielectric functions.\nAt intermediate energies ($13\\leq\\omega\\leq30$ eV), transitions from the Hf 4$f$ band increase the oscillator strength of the $\\Im(\\varepsilon)$.\nAs a result, the x-axis crossing of the $\\Re(\\varepsilon)$ shifts from $\\sim$16 eV to $\\sim$13.5 eV.\nThese relatively small changes are amplified in the resulting energy-loss function: the red-shifted plasmon peak and the entire loss function $\\sim$13-30 eV is significantly damped by the additional Hf 4$f$ contributions.\nAt high energies ($\\omega > 30$ eV), the Hf 5$p$ transitions begin.\nIn contrast to the featureless $\\varepsilon$ obtained when semicore electrons are frozen in the pseudopotential core, the presence of the Hf 5$p$ band produces the characteristic higher-energy peak observed in m-HfO$_2$ energy-loss spectra.\n\n\\subsection{Exchange-correlation effects}\n\\label{subsec:manybody}\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{veels-elfso}\n\t\\caption{VEELS spectra for m-HfO$_2$. \n\t\tThin solid green line: HRTEM measured VEELS on a polycrystalline sample;\n        solid black line: TDDFT RPA with LF effects;\n\t\tdot-dashed blue line: TDLDA;\n\t\tand dashed magenta line: RPA with the SO-corrected electronic structure.\n        Theoretical curves have been convoluted with a Gaussian broadening of 1.5 eV.\n\t\t}\n\t\\label{elfso}\n\\end{figure}\n\nWe assess the weight of exchange-correlation effects first by using TDLDA.\nTypically, TDLDA energy-loss spectra exhibit only small improvements compared to RPA, and in particular at the highest energies and transferred momenta.\\cite{Olevano}\nThat is also the case here:\nthe shoulder and lower-energy peak appear identical, and the higher-energy peak exhibits a slight increase of the oscillator strength that brings the amplitude into almost quantitative agreement with the experiment (Fig.~\\ref{epselfso}).\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{mhfo2-epselfso}\n\t\\caption{Energy-loss function (top), imaginary part of the dielectric function (middle), and the real part of the dielectric function (bottom) for m-HfO$_2$. \n\t\tDashed red line: RPA without LF effects;\n\t\tsolid black line: RPA without LF effects on top of a SO-corrected electronic structure;\n\t\tand dot-dashed green line: HRTEM-VEELS derived dielectric functions.\n\t\tIn the inset: RPA SO real part of the dielectric function along the main reciprocal lattice directions.\n        Theoretical curves are calculated at a reduced Lorentzian broadening of 0.1 eV.\n\t}\n\t\\label{epselfso}\n\\end{figure}\n\nWe next test the explicit inclusion of electron-electron self-energy effects.\nThe DFT-LDA DOS (Fig.~\\ref{dos}) is known to underestimate binding energies and band gaps relative to $GW$ calculations and experiment,\\cite{Jiang,Bersch}\nand we attempt to correct these self-energy errors by applying a SO to the Kohn-Sham DFT-LDA electronic structure.\nThe chosen SO decreases O 2$s$ band energies by $1.8$ eV and Hf 4$f$ band energies by $3.5$ eV to mimic the quasiparticle band structure determined from the $GW$ calculation by Jiang et al.\\cite{Jiang}\nThis SO-corrected electronic structure is then used in a TDDFT calculation.\nThe resulting SO RPA energy-loss function, which includes LF effects, is shown in Fig.~\\ref{elfso}, and the loss function, the $\\Im(\\varepsilon)$, and the $\\Re(\\varepsilon)$ for SO RPA NLF are shown in Fig.~\\ref{epselfso}.\n\nThe most significant change after applying the self-energy SO is the increased plasmon intensity at $\\sim$15 eV, which changes the shoulder in the energy-loss spectrum into a well-defined peak.\nThis is attributed to the blue-shifting of the Hf 4$f$ absorption peak between 15-20 eV in the $\\Im(\\varepsilon)$.\nBecause the 4$f$ transitions damp the energy-loss amplitude (Sec.~\\ref{subsec:semicore}), the SO shift of Hf 4$f$ transitions to higher energies results in a plasmon excitation that is no longer damped and also blue shifted from $\\sim$13.5 to $\\sim$15 eV (see Fig.~\\ref{epselfso}).\n\nInitially, it may appear that this enhanced peak agrees well with the prominent plasmon peak observed in some VEELS measurements.\nHowever, when we compare theoretical spectra to VEELS at the same energy resolution, we find that SO RPA represents the plasmon less accurately than TDLDA and RPA LF.\nAn analysis of SO RPA energy-loss spectra with varied momentum transfer directions shows that the intensity of this new plasmon peak is modulated, but never fully damped to a shoulder in any direction.\nThis contrasts with TDLDA, RPA LF, and individual HRTEM-VEELS measurements at the same energy resolution, where the plasmon appears as a well defined peak or just a shoulder depending on crystal orientation (direction of momentum transfer).\\cite{APL2014}\n\nThe self-energy SO also affects the character of the peak at 25$\\sim$28 eV.\nThe originally nearly flat averaged $\\Re(\\varepsilon)$ undergoes a zero-crossing at 25 eV after applying the SO.\nThe collective excitation is thus promoted to a real plasmon.\nAgain looking into contributions from various directions of momentum transfer (inset of Fig.~\\ref{epselfso}), we see that the $\\Re(\\varepsilon)$ intersects zero for [100] and [010] momentum transfers, but not [001].\nThis predicted anisotropic plasmon resonance again contrasts with TDLDA, RPA LF, and HRTEM-VEELS spectra showing that a strong anisotropy is only observed on the first plasmon at $\\sim$13.5 eV.\\cite{APL2014}\n\nWe therefore see that the application of self-energy effects, at least as modeled using the SO, is unable to improve predictions of energy-loss spectra.\nThe self-energy SO-corrected electronic structure combined with RPA even produces worse predictions than RPA or TDLDA using the DFT electronic structure.\nThis emphasizes the need to have a balanced treatment of self-energy and excitonic interactions.\\cite{Olevano,Sottile,DelSole}\nDue to the cancellation of errors between these two effects in TDDFT,\nsimulated peaks corresponding to collective excitations have comparable amplitude to experiment.\nOn the other hand, differences remain between theory and experiment, such as the amplitude of the inter-band transition peak between $\\sim$33-40 eV and slight shifts in peak energies.\nALDA exchange-correlation does not mitigate these differences, but we expect that the explicit inclusion of both self-energy and excitonic interactions would further improve agreement of theory and experiment.\nWe would also like to emphasize that the accurate treatment of many-body effects would be particularly important close to the optical band gap ($\\omega<13$ eV).\nIn that energy range, the loss functions, which exhibit only a weak initial slope, are in good agreement, but experimental and theoretical dielectric functions present quantitative differences.\n\n\\subsection{Nonzero momentum transfer}\n\\label{subsec:momentum}\n\n\\begin{figure}\n\t\\includegraphics[width=\\columnwidth]{dispersion3d}\n\t\\caption{Energy-loss function dispersion along [001]. Open circles are a guide to the eye to indicate the dispersion of the plasmon and the collective excitation. \n    Spectra have been convoluted with a Gaussian broadening of 1.5 eV.}\n\t\\label{dispersion}\n\\end{figure}\n\nFinally, we perform TDDFT RPA LF calculations of energy-loss spectra also at non-vanishing transferred momentum to complete our picture of m-HfO$_2$ dielectric properties.\nIn Fig.~\\ref{dispersion} we show energy-loss spectra for momentum transfers ${\\mathbf{q}}$ up to the 4th Brillouin zone ($\\sim$2.5 bohr$^{-1}$) along the [001] direction.\nThere is a small positive dispersion of the collective excitation at~$\\sim$28 eV and almost no dispersion of the plasmon at low energy.\nAll excitations also exhibit damping towards the Compton regime.\nSimilar trends are observed along the other lattice directions.\nDue to the damping of excitations, anisotropies in energy-loss spectra observed at vanishing $q$ are eliminated with increasing momentum transfer.\n\n\n\\section{Conclusions}\n\\label{sec:conclusion}\nWe present TDDFT and HRTEM-VEELS energy-loss spectra and dielectric functions for m-HfO$_2$ and identify the excitations that result in the observed spectra.\nThe most prominent features of the energy-loss spectrum are the collective excitations at 13-16 eV, $\\sim$28 eV, and above 40 eV.\nOnly the 13-16 eV feature is a plasmon.\nSingle-particle inter-band transitions contribute to the oscillator strength at the optical onset, from $\\sim$16-28 eV, and from $\\sim$33-40 eV.\nBy separating out the contributions of semicore electrons, we find that the Hf 4$f$ electrons damp the energy-loss oscillator strength.\nSimulated spectra in the three lattice directions predict typical dispersive behavior of the collective excitations with increasing momentum transfer.\n\nTDDFT energy-loss spectra are computed at various levels of theory, and we find that RPA and TDLDA are in good agreement with experiment as long as LF effects are included.\nLF effects are found to significantly damp the peak above 40 eV, and to change the nature of the peak from a plasmon to a collective excitation.\nFor the same peak, the TDLDA oscillator strength is in slightly better agreement with experiment than RPA, but the two spectra do not otherwise differ.\nWe show that many-body effects are strongest from the optical edge through the plasmon peak, and that solely accounting for self-energy effects without compensating excitonic effects worsens agreement with experiment.\nTDDFT demonstrates cancellation between these two effects through much of the energy range of interest, including for excitations from the fully-occupied Hf 4$f$ shell.\nTherefore, in comparison to much more expensive many-body theory calculations, TDDFT is an efficient first-principles method to simulate and interpret VEELS.\n\n\\subsection{Acknowledgements}\n\nWe acknowledge support from the nanocharacterisation platform (PFNC) (\\url{http://www.minatec.org/pfnc-plateforme-nanocaracterisation}) for experiment. \nComputer time has been provided by the French GENCI supercomputing center through project i2012096-655 and 544.\n\n\\begin{thebibliography}{}\n\n\\bibitem{ChoiReview}\nJ. H. Choi, Y. Mao, and J. P. Chang, Mat. Sci. Eng. R \\textbf{72}, 97 (2011).\n\n\\bibitem{RobertsonReview}\nJ. Robertson, Rep. Prog. Phys. \\textbf{69}, 327 (2006).\n\n\n\n\n\n\n\n\n\n\n\\bibitem{Abajo}\nF. J. Garc\\'{i}a de Abajo,\nRev. Mod. Phys. \\textbf{82}, 209 (2010).\n\n\\bibitem{VerbeeckVanDyck}\nJ. Verbeeck, D. Van Dyck, and G. Van Tendeloo,\nSpectrochimica Acta Part B \\textbf{59}, 1529â\u0080\u00931534 (2004).\n\n\\bibitem{RungeGross}\nE. Runge and E. K. U. Gross,\nPhys. Rev. Lett. \\textbf{52}, 997 (1984). \n\n\\bibitem{GrossKohn}\nE. K. U. Gross and W. Kohn,\nPhys. Rev. Lett.  \\textbf{55}, 2850 (1985). \n\n\\bibitem{ZangwillSoven}\nA. Zangwill and P. Soven,\nPhys. Rev. A \\textbf{21}, 1561 (1980).\n\n\\bibitem{OlevanoReining01}\nV. Olevano and L. Reining,\nPhys. Rev. Lett \\textbf{86}, 5962 (2001).\n\n\\bibitem{Dash}\nL. K. Dash, N. Vast, P. Baranek, M.-C. Cheynet, and L. Reining,\nPhys. Rev. B \\textbf{70}, 245116 (2004).\n\n\\bibitem{APL2014}\nC. Guedj, L. Hung, A. Zobelli, P. Blaise, F. Sottile and V. Olevano,\nAppl. Phys. Lett. \\textbf{105}, 222904 (2014).\n\n\\bibitem{HohenbergKohn}\nP. Hohenberg and W. Kohn,\nPhys. Rev. \\textbf{136}, B864 (1964).\n\n\\bibitem{KohnSham}\nW. Kohn and L. J. Sham,\nPhys. Rev. \\textbf{140}, A1133 (1965). \n\n\\bibitem{TroullierMartins}\nN. Troullier and J. L. Martins,\nPhys. Rev. B \\textbf{43}, 1993 (1991).\n\n\\bibitem{abinit}\nX. Gonze \\textit{et al.},\nZ. Kristall. \\textbf{220}, 558 (2005).\n\n\\bibitem{WangLi}\nJ. Wang, H. P. Li, and R. Stevens, J. Mater. Sci. \\textbf{27}, 5397 (1992);\nJ. Adam and M. D. Rogers, Acta Crystallogr. \\textbf{12}, 951 (1959).\n\n\\bibitem{dp}\n\\url{http:\\\\www.dp-code.org}\n\n\\bibitem{Benedict}\nL. X. Benedict, E. L. Shirley, and R. B. Bohn, Phys. Rev. B\n\\textbf{57}, R9385 (1998)\n\n\\bibitem{anisotropy}\nS. Botti, \\textit{et al.}\nPhys. Rev. Lett. \\textbf{89}, 216803 (2002).\n\n\\bibitem{Jiang}\nH. Jiang, R. I. Gomez-Abal, P. Rinke and M. Scheffler,\nPhys. Rev. B \\textbf{81}, 085119, 2010.\n\n\\bibitem{EFTEM}\nL. Reimer, \n\\textit{Energy-filtering Transmission Electron Microscopy}\n(Springer-Verlag, Berlin, Heidelberg, 1995).\n\n\\bibitem{STEMSI}\nP. E. Batson,\nNature \\textbf{366}, 727 (1993).\n\n\\bibitem{SCHAFFER}\nB. Schaffer, G. Kothleitner, and W. Grogger,\nUltramicroscopy \\textbf{106}, 1129 (2006).\n\n\\bibitem{Egerton}\nR. F. Egerton,\n\\textit{Electron Energy-loss spectroscopy in the Electron Microscope}\n(Plenum, New York, 1996)\n\n\\bibitem{Agustin}\nM. P. Agustin, L. R. C. Fonseca, J. C. Hooker, and S. Stemmer,\nAppl. Phys. Lett. \\textbf{87}, 121909 (2005).\n\n\n\\bibitem{Jin}\nH. Jin, S. K. Oh, H. J. Kang, and S. Tougaard,\nJ. Appl. Phys. \\textbf{100}, 083713 (2006).\n\n\n\\bibitem{Cheynet}\nM. C. Cheynet, S. Pokrant, F. D. Tichelaar, and J.-L. Rouvi\\`{e}re,\nJ. Appl. Phys. \\textbf{101}, 054101, (2007).\n\n\n\\bibitem{Couillard}\nM. Couillard, M. Kociak, O. St\\'{e}phan, G. A. Botton, and C. Colliex,\nPhys. Rev. B \\textbf{76}, 165131 (2007).\n\n\n\\bibitem{Jang}\nJ. Jang, T. J. Park, J.-H. Kwon, J. H. Jang, C. S. Hwang, and M. Kim,\nAppl. Phys. Lett \\textbf{92}, 232906 (2008).\n\n\n\\bibitem{ParkYang}\nJ. Park, and M. Yang,\nMicron \\textbf{40}, 365 (2009).\n\n\n\\bibitem{Liou}\nS. C. Liou, M.-W. Chu, Y. J. Lee, M. Hong, J. Kwo and C. H. Chen,\nNew J. Phys. \\textbf{11}, 103009 (2009).\n\n\n\\bibitem{Behar}\nM. Behar, R. C. Fadanelli, I. Abril, R. Garcia-Molina, C. D. Denton, L. C. C. M. Nagamine, and N. R. Arista,\nPhys. Rev. A \\textbf{80}, 062901 (2009).\n\n\n\\bibitem{Vos}\nM. Vos and P. L. Grande,\nSurf. Sci \\textbf{630}, 1 (2014).\n\n\n\\bibitem{Erni}\nR. Erni, Ultramicr. \\textbf{160}, 80 (2016).\n\n\\bibitem{Olevano}\nV. Olevano, M. Palummo, G. Onida, and R. Del Sole,\nPhys. Rev. B \\textbf{60}, 14224 (1999).\n\n\n\\bibitem{Bersch}\nE. Bersch, S. Rangan, R. A. Bartynski, E. Garfunkel, and E. Vescovo,\nPhys. Rev. B \\textbf{78}, 085114 (2008).\n\n\\bibitem{Sottile}\nF. Sottile, M. Marsili, V. Olevano, and L. Reining,\nPhys. Reb. B \\textbf{76}, 161103 (2007).\n\n\\bibitem{DelSole}\nR. Del Sole, G. Adragna, V. Olevano, and L. Reining,\nPhys. Rev. B \\textbf{67}, 045207 (2003).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 9714, "prevtext": "\nwhere $\\eta$ an infinitesimal positive value, $\\epsilon_{n\\mathbf{k}}$ are the Bloch DFT Kohn-Sham eigenvalues and $f_{n{\\mathbf{k}}}$ their occupation,\n$\\tilde{\\rho}_{nm{\\mathbf{k}}}({\\mathbf{q}},{\\mathbf{G}}) = \\int d{\\mathbf{r}} \\, \\psi_{n{\\mathbf{k}}}({\\mathbf{r}})e^{-i({\\mathbf{q}}+{\\mathbf{G}})\\cdot{\\mathbf{r}}}\\psi^*_{m{\\mathbf{k}}-{\\mathbf{q}}}({\\mathbf{r}}) $ \nis constructed from the DFT Kohn-Sham wave functions $\\psi_{n{\\mathbf{k}}}({\\mathbf{r}})$,\nwith wave vectors $\\mathbf{k}$ and momentum transfer ${\\mathbf{q}}$ lying within the first Brillouin zone, spatial coordinate ${\\mathbf{r}}$, and band indices $n$ and $m$.  The TDDFT full polarizability is then determined via the Dyson equation,\n\n", "index": 3, "text": "\\begin{equation}\n\\chi = \\chi^0 + \\chi^0 \\left( v+ f_{xc}\\right) \\chi,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\chi=\\chi^{0}+\\chi^{0}\\left(v+f_{xc}\\right)\\chi,\" display=\"block\"><mrow><mrow><mi>χ</mi><mo>=</mo><mrow><msup><mi>χ</mi><mn>0</mn></msup><mo>+</mo><mrow><msup><mi>χ</mi><mn>0</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>v</mi><mo>+</mo><msub><mi>f</mi><mrow><mi>x</mi><mo>⁢</mo><mi>c</mi></mrow></msub></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>χ</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]