[{"file": "1601.02870.tex", "nexttext": "\n\n\n\n\nwhere $A_{nm}$ represents a coupling matrix and $g(\\Delta\\vartheta)$ is the average effect of the coupling for oscillators with \nphase difference $\\Delta\\vartheta$. \nA phase attractive coupling is assumed with  interaction function  $g(\\Delta\\vartheta) = \\sin(\\Delta\\vartheta-\\alpha) + \\sin(\\alpha)$.  The phase shift \nparameter $\\alpha$ is an important system property determined by the average shear flow near the limit cycle in the direction of perturbation caused by \ncoupling \\cite{Kuramoto:1984}, i.e. $\\alpha$ quantifies the non-isochronicity of the oscillations induced by interactions. We note that since the dynamics \nof the model equations (Eq.\\ref{eq:phasemodel}) is invariant under a \nchange of $\\alpha\\to -\\alpha$, $\\vartheta\\to -\\vartheta$ and $t\\to -t$, the phase differences and the frequency shift are inverted when $\\alpha$ \nchanges sign, such that sources become sinks of rotating waves and vice versa.\nWe assume non-normalized, bidirectional coupling $A_{mn}=A_{nm}\\in\\{0,1\\}$ on ring networks of $N=500$ oscillators with $N_{sc}=\\sigma N$ \nadditional random bidirectional links. The initial conditions for the simulations and the experiments is a rotating wave on the ring. (Random initial conditions give comparable results.)\n\\\\\nDue to phase attractive coupling  $g'(0)=\\cos\\alpha>0$ and complete connectedness of the network, \nthe fully synchronized, one-cluster state is always a linearly stable solution of (\\ref{eq:phasemodel}) \\cite{Tonjes:2010:033108}. \nHowever, the typical behavior of the network starting from globally desynchronized initial conditions, is far more complex than the intuitively expected \nrelaxation to the one-cluster state.  We characterize the state of the system by different order parameters. The $k$-cluster order parameters $R_k = \n\\left\\langle\\exp(ik\\vartheta_n)\\right\\rangle$ where the average is taken instantaneously over all oscillators, measure the coherence of the distribution of phases into $k$ \nevenly spaced clusters. The variance $\\textrm{var}\\dot\\vartheta$ of the phase velocities is a measure for frequency synchronization. These ensemble \naveraged measures are shown \nin the $\\sigma$ vs. $\\alpha$ parameter plane in Figs.~\\ref{fig-sim-model}a,b. \n\\\\\nWith small $\\sigma$, the original ring is divided into linear \nsegments between the end points of shortcuts, which can support traveling phase waves.  At the interfaces where two such traveling waves meet, \nthe phase differences in a state of stable synchronization are restricted. At low non-isochronicity and low shortcut density these interfaces can be frozen when all topological boundary conditions can be met simultaneously. We refer to such a pattern, which does not change in time, as frozen complex  \nrotating wave pattern. When the topological boundary conditions are not met (this is likely to occur with a large number \nof oscillators), slowly changing interfaces are obtained, reminiscent of vortex glasses in 2d \noscillatory media \\cite{Brito:2003:068301}. Both the Kuramoto order parameter $R_1$ and the variance of the phase velocities are small in this regime. \nWhen the shortcut density is increased,  there exists a topological cross-over to a random network without linear chain segments.\nTherefore, when $\\sigma$ is increased the system cannot maintain rotating waves and the one-cluster state becomes globally attractive\nwith $R_1 \\approx 1$. \nWhen $\\alpha$ is increased from zero, higher shortcut densities are required for complete synchronization (Figs.~\\ref{fig-sim-model}a-c).\n\\\\\nAt large values of non-isochronicity ($\\alpha\\gtrsim 1$) a qualitatively \ndifferent type of behavior exists. The topological boundary conditions for rotating phase waves along the \nring segments with stationary phase differences are very difficult to satisfy simultaneously. \nInstead, the dominant behavior is  persistent irregular dynamics with nonzero $\\textrm{var}\\dot\\vartheta$. \nThe distribution of phase differences during the transient and in frozen complex rotating  patterns becomes bimodal, suggesting a preferred phase difference that depends on $\\alpha$ \n(Fig.~\\ref{fig-sim-turb}b). \nThe emergence of persistent \nirregular dynamics is demonstrated in Fig.~\\ref{fig-sim-model}d by fixing the shortcut density $\\sigma$, and increasing the value of \n$\\alpha$.  At the transition between frozen and unfrozen complex rotating  patterns global clustering can arise resulting in a sharp increase in the \norder parameters $R_6$ or $R_7$. This global order is mediated by the end points of the shortcuts in the network (Fig.~\\ref{fig-sim-turb}f) : Due to the \nnarrow \ndistribution of phase differences in a phase locked state, \noscillators at the same distance to a crosslinked node have the same phase. Global clustering is only observable in a narrow parameter region\nat criticality and after a long, system size dependent transient. \n\\\\\nIn addition, around the transition point, before a complex rotating wave pattern becomes frozen, very long  transient dynamics \ncan be observed.  Figure \\ref{fig-sim-turb} shows an example of such transient dynamics, from random initial conditions and with negative non-\nisochronicity. The time evolution of next-neighbor phase differences demonstrates the competition between different phase patterns, with stationary \nsinks of the phase waves located at the network heterogeneities and dynamically rearranging sources which may form or annihilate upon collision with a \nsink or at phase slip events. Figures \\ref{fig-sim-turb}d,e show a transient and a stationary phase profile, respectively and Fig.\\ref{fig-sim-turb}b illustrates \nthe time evolution of the phase difference distribution. The phase differences in the stationary phase pattern are peaked sharply around $2\\pi/7$ \nresulting in a very precise wavelength and the formation of 7 global phase clusters.\n\n\n\\begin{figure}\n\\includegraphics[width=0.493\\columnwidth]{./fig1a_v5.eps}\t\\label{fig1a}\n\\includegraphics[width=0.493\\columnwidth]{./fig1b_v5.eps}\t\\label{fig1b}\n\\includegraphics[width=0.493\\columnwidth]{./fig1c_v6.eps}\t\\label{fig1c}\n\\includegraphics[width=0.493\\columnwidth]{./fig1d_v7.eps}\t\\label{fig1d}\n\\caption{(Color online) Order parameters in model (\\ref{eq:phasemodel}) at time $t=500$ as functions of shortcut density $\\sigma$ and non isochronicity parameter $\\alpha$ averaged over ten random network realizations with $N=500$ oscillators and rotating wave initial conditions. {(a)} Color coded Kuramoto order parameter $R_1$ and {(b)} variance $\\textrm{var}\\dot\\vartheta$ of phase velocities. The black and the white line in {(a)} and {(b)}, respectively, mark the contour of $R_1=0.9$. The light (green) line marks the contour line of $\\textrm{var}\\dot\\vartheta=0.2$. {(c)} Kuramoto order parameter as a function of $\\sigma$ for three different values of $\\alpha$ (cf.{\\ref{fig-sync-trans}c}). (d) Mean cluster order parameters $R_6$,$R_7$ and variance of phase velocities as functions of $\\alpha$ at $\\sigma=0.15$.}\n\\label{fig-sim-model}\n\\end{figure}\n\n\n\n\nAs shown in Fig.~\\ref{fig-sim-model}a, there also exists a narrow regime of partial synchronization for larger shortcut densities which is replaced in a \nsharp discontinuous transition by persistent incoherent phase dynamics at values of $\\alpha$ approaching $\\pi/2$ and which may be analyzed in a mean \nfield approach \\cite{Ko:2008:016203}.\\\\\n\\noindent \nTo confirm the modeling results, experiments were performed with an array of $N=20$, 1.00 mm diameter nickel\nwires on which an oscillatory metal dissolution reaction takes place measured by currents. Numerical simulations \nindicate { \\footnote{{Supplemental Material}} \\newcounter{{Note1}} \\setcounter{{Note1}}{\\value{footnote}} }  that regions of frozen rotating patterns, complete synchronization, and irregular phase dynamics can be clearly \ndistinguished even in such a small setup. The electrodes are coupled into a ring topology with additional random \ncross-connection via resistances and capacitances.\nWe report the conductance accross the coupling resistance as coupling strength $K$.\nCapacitance is used to introduce non-isochronicity through a phase shift in the coupling current \\cite{Wickramasinghe:2013:062911}{ \\footnotemark[\\value{{Note1}}] }. \nThe initial condition of the experiment is a rotating wave as shown \nin Fig.~\\ref{fig-sync-trans}a. First we describe the results with $\\alpha$=0, i.e., resistive coupling. \nWhen a random cross connection was added, one of two scenarios occurred. If the random \nshortcut connected two elements at a distance larger than 4 units, the system \nquickly converged to a fully synchronized state similar to that shown in Fig.~\\ref{fig-sync-trans}b. \nWhen the distance between the shortcut elements was smaller, the rotating waves \njumped across the connection. Figure \\ref{fig-sync-trans}d shows such pattern with two cross connections. \\\\\n\n\n\\begin{figure}\n\\includegraphics[height=0.3\\columnwidth]{./fig2a_v5.eps}\t\\label{fig2a}\\qquad\\quad\n\\includegraphics[height=0.3\\columnwidth]{./fig2b_v6.eps}\t\\label{fig2b}\n\\includegraphics[width=0.98\\columnwidth]{./fig2c_v5_small.eps}\t\\label{fig2c}\n\\includegraphics[width=0.98\\columnwidth]{./fig2def_v5.eps}\t\\label{fig2def}\n\\caption{(Color online) Long transient to a complex frozen rotating wave pattern from random initial phases in a network of $N$= 500 phase oscillators with $\\alpha$= -1.15 and \nshortcut density $\\sigma$= 0.05.\n{(a)} Ring network \nwith 26 additional random shortcuts \n{(b)} Time evolution of the density of next neighbor phase differences. The solid (red) line marks the average of $|\\Delta\\vartheta|$.\n{(c)} Time evolution of next neighbor phase differences modulus $\\pi$ (color coded). Dark (blue) colors indicate phase waves to the \nright and light (red) colors indicate phase waves to the left.  The white lines indicate phase profiles $\\vartheta_{n}$ between 150 $\\leq$ n $\\leq$ 250 shown in \nsub figures (d) at $t$= 300 and (e) at $t$= 500. \nLarge (red) circles and solid (red) lines in panels (a,d-f) indicate nodes with shortcut connections.\nBlack squares in panels (d,e) indicate dynamically realized centers of phase waves. Panel (f) shows clustering of the phases at $t$=500 with $R_7\\approx 0.9$ and cross-links (solid lines) connecting neighboring clusters.}\n\\label{fig-sim-turb}\n\\end{figure}\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.45\\columnwidth]{./fig3a_v5.eps}{\\qquad}\t\\label{fig3a}\n\\includegraphics[width=0.45\\columnwidth]{./fig3b_v5.eps}\t\\label{fig3b}\n\\includegraphics[width=0.45\\columnwidth]{./fig3c_v5.eps}{\\qquad}\t\\label{fig3c}\n\\includegraphics[width=0.45\\columnwidth]{./fig3d_v5.eps}\t\\label{fig3d}\n\\includegraphics[width=0.45\\columnwidth]{./fig3e_v5.eps}{\\qquad}\t\\label{fig3e}\n\\includegraphics[width=0.45\\columnwidth]{./fig3f_v5.eps}\t\\label{fig3f}\n\\end{center}\n\\caption{The impact of shortcuts and $\\alpha$ on the formation of complex rotating waves and on synchronization.  \n{(a)} Initial rotating wave ($V$=1105 mV, $K$=0.20 mS, $\\alpha$=0). \n{(b)} Synchrony induced by one long distance shortcut. \n{(c)} The mean order parameter with increasing number of shortcuts at $\\alpha=0$ (circles), -0.97 (squares) and -1.3 (triangles). \n$V$=1110 mV, $C\\textsubscript{c}$=82 $\\mu$F, $K$=0.10 mS at $\\alpha$=-0.97 and $K$=0.025 mS at $\\alpha$=-1.3. \n{(d)} Short distance shortcuts at $\\alpha$=0 yield jumping waves ($V$=1110 mV). \n{(e)} Long distance shortcut at $\\alpha$=-0.97 yields a frozen complex rotating  pattern with a source (triangle) away from the heterogeneity ($V$=1110 mV). \n{(f)} Long distance shortcut at $\\alpha$=0.76 yields a frozen complex rotating  pattern with a source (full square) on the heterogeneity ($V$=1245 mV, \n$C\\textsubscript{ind}$=1 mF, $K$=0.40 mS).}\n\\label{fig-sync-trans}\n\\end{figure}\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.51\\columnwidth]{./fig4a_v7.eps}\t\\label{fig4a}\n\\includegraphics[height=0.51\\columnwidth]{./fig4b_v6.eps}\t\\label{fig4b}\n\\includegraphics[height=0.51\\columnwidth]{./fig4cd_v5.eps}\t\\label{fig4cd}\n\\includegraphics[width=0.93\\columnwidth]{./Fig4e_v8.eps}\t\\label{fig4e}\n\\end{center}\n\\caption{Long transient to synchronization at $\\alpha=-1.3$ ($V$=1110 mV, $C\\textsubscript{c}$=82 $\\mu$F, $K$=0.033 mS). \n{(a)} Time evolution of next neighbor phase differences. \n{(b)} Histogram of next neighbor phase differences during the transient and the final synchronized state. \n{(c)} Histogram of the period per cycle of all electrodes (white bars are the individual periods and dark bars the transient).\n{(d)} Network topology and a typical complex rotating wave pattern during the transient.  \nArrows indicate the wave direction from sources to sinks. \n{(e)} Time evolution of the Kuramoto order parameter where the arrows indicate transitions between wave patterns through phase slips.}\n\\label{fig-phase-turb}\n\\end{figure}\n\n\n\\noindent \nWe have performed 16 independent trials adding cross-connections successively to a ring configuration. The\nmean order parameter as a function of the added number of shortcuts is shown \nin Fig.~\\ref{fig-sync-trans}c. Only three shortcuts were required for the average order parameter to exceed 0.90. \nTherefore, we can conclude that with $\\alpha=0 $ a relatively small number of shortcuts \n($\\sigma \\approx 0.15$) induces full synchrony. When $\\alpha$ was changed to -0.97, with a parallel RC coupling, we still observed rotating waves jumping over the \nconnection when the first cross-connection was placed up to a distance of 5 units \nbetween the elements. However, when the distance was larger, instead of full synchronization, \nwe observed frozen complex rotating  pattern via the formation of a source and sink pair (Fig.~\\ref{fig-sync-trans}e). \nThe order parameter vs. number of shortcuts graph in Fig.~\\ref{fig-sync-trans}c shows that with $\\alpha=-0.97$\nthe mean order parameter starts to increase for $n>3$, and it requires relatively \nlarge number ($n>6$) of random shortcuts to achieve Kuramoto order larger than 0.90.\nThe presence of jumping waves and complex rotating wave patterns thus contributes to resisting  complete synchronization. \nWhen $\\alpha$ was further changed to -1.3, the trend of resisting the fully synchronized \nstate continued. \nFigures \\ref{fig-sync-trans}e,f demonstrate the inversion of the stationary phase profile, and thus the direction of the rotating waves and the reversal of \nsource and sink, upon switching the sign of the non-isochronicity by adding a capacitance to the individual current instead of the coupling current \n\\cite{Wickramasinghe:2013:062911}{ \\footnotemark[\\value{{Note1}}] }. \nAll the patterns in Fig.~\\ref{fig-sync-trans} were reproduced by phase model simulations in { \\footnotemark[\\value{{Note1}}] }.\n\nLong transients to both frozen complex wave patterns and identical synchronization were observed in experiment. \nA long transient over $1700$s in a network with five random shortcuts near $\\alpha$=-1.3 is shown \nin Fig.~\\ref{fig-phase-turb}. \nThe time evolution of next neighbor \nphase differences during the transient is shown in Fig.~\\ref{fig-phase-turb}a. At least two competing wave patterns, which are meta stable over the \ncourse of tens of oscillations and transform via intermittent phase slips could be observed for over 700 oscillations before the  system settled into the \none-cluster state. \nAt $\\alpha=0$ the same network relaxes exponentially to synchronization in $230$s { \\footnotemark[\\value{{Note1}}] }. Numerical simulations with the phase model confirmed that by changing $\\alpha$ from \n0 to -1.3 the lifetime of the transient increases about 10 times and diverges as $\\alpha$ approaches $|\\pi/2|$ { \\footnotemark[\\value{{Note1}}] }.\nA density plot of next neighbor phase differences during and after the transient is depicted in \nFig.~\\ref{fig-phase-turb}b and shows an asymmetric distribution with a preferred wave length, skewed towards \nthe initial left-handed rotational state. \nIn addition, a wide distribution of peak to peak periods can be observed during the transient as seen in \nFig.~\\ref{fig-phase-turb}c, which marks the presence of irregular phase dynamics. A typical snapshot of a transient complex rotating wave is shown\nin Fig.~\\ref{fig-phase-turb}d. The arrows indicate the direction of the rotations as well \nas the sources (oscillators 9 and 18) and sinks (oscillators 2 and 11) of the \nunstable rotational wave pattern. \nThe order parameter (Fig.~\\ref{fig-phase-turb}e) clearly exhibits the transient behavior \nas its value changes between approximately 0.2 and 0.6 irregularly throughout \nthe transient until synchronization is achieved. \n\\\\\nIn conclusion, we have observed frozen complex rotating  patterns and long transients to synchronization in electrochemical oscillations and \nnumerical simulations of phase oscillators on a ring network topology with  sparse random shortcuts. Depending on the sign of non-isochronicity $\\alpha$, \neither the sinks or the sources are pinned to endpoints of cross-connections in the network. At increased non-isochronicity the variability in the phase \ndifferences in a phase locked state decreases until synchronization is no longer possible and persistent or very long transient phase dynamics occurs. The \npresence of long transients of irregular phase dynamics could have relevance in the functioning of biological systems, e.g., in neuron dynamics where pathological \nsynchronization can occur without apparent external perturbation or change of network topology. The experimentally recorded, irregular transient \ndynamics contributes to the few experimental examples of high dimensional transient chaos \\cite{TelLai2008}, where system size effects on the lifetime \nof the transient irregular state could be studied.\n\\\\\n\n\n\nThis material is based upon work supported by the National Science Foundation under Grant Number \nCHE-1465013. \nThe manuscript has supplemental material { \\footnotemark[\\value{{Note1}}] }.\n\\vspace{0.4cm}\n\n\n\n\n\\section*{\\bf References} \n\\bibliography{references-Saved}\n\n\n\\begin{center}\n\n\n\\textbf{\\large Supplemental Material}\n\\end{center}\n\n\n\\setcounter{equation}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\setcounter{page}{1}\n\\makeatletter\n\n\n\n\n\n\\section{Experimental Setup}\n\\noindent\n\n\n\\begin{figure}[th]\\label{fig.sm01}\n\\begin{center}\n\\includegraphics[width=0.8\\columnwidth]{./s6_expsetup_small.eps}\n\\end{center}\n\\caption{Schematic of the experiments where the electrodes (black circles) are connected\n to the working point (W) of the potentiostat. $R_{c}$ are illustrated as empty squares \n and $R_{ind}$ are illustrated by the filled squares.\n{(a)} Diagram of the twenty electrode ring network with the location of $R_{c}$ and\n$R_{ind}$ displayed. \n{(b)} Simplified diagram showing three electrodes with the addition of $C_{c}$.\n{(c)} Simplified diagram showing three electrodes with the addition of $C_{ind}$.}\n\\label{si-exp-schem}\n\\end{figure}\n\n\n\nExperiments are performed by a standard electrochemical cell with\n3 M H\\textsubscript{2}SO\\textsubscript{4} as the electrolyte. The\ncounter electrode is a platinum coated titanium rod, the reference\nelectrode is Hg/Hg\\textsubscript{2}SO\\textsubscript{4}/sat. K\\textsubscript{2}SO\\textsubscript{4},\nand the working electrode is an array of 20 nickel, 1.00 mm diameter,\nwire cross sections embedded in epoxy. The temperature is held at 10 \\textsuperscript{o}C. Each nickel\nelectrode in the array is connected to the potentiostat (ACM Instruments\nGillAC) through an individual resistance $R_{ind}$. \nThe frequencies of the electrodes are controlled by an increase or decrease of \n$R_{ind}$ and regulated to $0.4$Hz $\\pm 2.5$mHz at  $R_{ind}=1k\\Omega$ in the beginning of the experiment. \nThe system is coupled locally into a ring topology by coupling resistance\n($R_{c}$) as shown in  Fig.\\ ~\\ref{si-exp-schem}a. A constant\npotential ($V$) is applied and the oscillatory current of each electrode\nin the array is measured at 200Hz by a potential drop over $R_{ind}$. \nThe coupling strength $K$ is reported as the inverse $1/R_{c}$ of the coupling resistance. Non-isochronicity is introduced into the network by the addition of \ncapacitance C. The non-isochronticity is negative for a capacitance $C_c$ parallel to $R_{c}$ and positive for a capacitance $C_{ind}$ parallel to $R_{ind}$ as seen in \nFig.~\\ref{si-exp-schem}b,c. The level of nonisochronicity induced by the \ncapacitance in a pair of ocillators was studied in great detail in a previous \npublication \\cite{Wickramasinghe:2013:062911}.\n\n\\section{Method}\n\\noindent\n\n\\begin{figure}[th]\\label{fig.sm02}\n\\begin{center}\n\\includegraphics[width=0.9\\columnwidth]{./s7_osc_v3_small.eps}\n\\end{center}\n\\caption{Current oscillation of electrodes.\n{(a)} Space-time plot of the electrode currents on the ring network in a phase-locked rotational wave state with no shortcus \n($V$= 1105 mV, $K$= 0.20 mS, $\\alpha$= 0). \n{(b)} Space-time plot of the electrode currents on the  ring network with in-phase synchronization with a 1-11 cross connection.\n{(c)} Measured currents of cross-cut oscillators (1,2,3,6,10,11,13,17,19) showing typical irregular transient behavior ($V$= 1110 mV, $C_c$= 82$\\mu$F $K$= 0.033 mS, $\\alpha$= -1.3).\n{(d)} Measured currents of cross-cut oscillators (1,2,3,6,10,11,13,17,19) exhibiting in-phase synchronization.}\n\\label{si-osc-data}\n\\end{figure}\n\n\\begin{figure}[th]\\label{fig.sm03}\n\\begin{center}\n\\includegraphics[width=0.9\\columnwidth]{./s9_a0trans_v3.eps}\n\\end{center}\n\\caption{Short transient to synchronization at $\\alpha$ = 0 ($V$= 1105 mV, $K$= 0.033 mS).\n{(a)} Time evolution of the Kuramoto order parameter.\n{(b)} Space-time plot of the current during the transient from the initial rotational state to in-phase synchronization.}\n\\label{short-trans}\n\\end{figure}\n\n\nOnce coupled into the ring topology, global negative feedback is applied\nto linearly increase the phase difference between neighboring oscillators according to \n$\\vartheta_{n}=2\\pi n/N$. The phase pattern is stable when feedback is removed \n(see Fig.~\\ref{si-osc-data}a). Additional connections are added randomly into \nthe system with the same $R_{c}$ and $C_{c}$ value as the existing connections \nin the network. \nIf the system did not synchronize in-phase during the addition of the connection, a second \nconnection is chosen by the same method as the first and added to the network.\nThe process is repeated until in-phase synchronization is observed. Further additions of shortcuts are assumed to have no desynchronizing effect. The non-rotating, synchronized \nstate is shown as a space-time plot in Fig.~\\ref{si-osc-data}b. Transient dynamics to a synchronized state may be exponential relaxation (Fig.\\ref{short-trans}) or irregular phase dynamics with periods and amplitudes fluctating in time (Fig.~\\ref{si-osc-data}c). In synchrony, the period is identical for all \noscillators and the amplitudes are much more homogeneous as shown in Fig.~\\ref{si-osc-data}d.\n\n\\section{Determination of Alpha}\n\\noindent\n\n\\begin{figure}[th]\\label{fig.sm04}\n\\begin{center}\n\\includegraphics[width=0.49\\columnwidth]{./s8a_alpha0.eps}\n\\includegraphics[width=0.49\\columnwidth]{./s8b_alpha97.eps}\n\\includegraphics[width=0.49\\columnwidth]{./s8c_alpha1-3.eps}\n\\end{center}\n\\caption{Experimentally measured interaction functions ($V$=1105 mV, $R_{ind1}$=1 $k\\Omega$, $R_{ind2}$=900 $\\Omega$).\n{(a)} $\\alpha$=0 ($R_{c}$= 20 $k\\Omega$). \n{(b)} $\\alpha$=-0.97 ($R_{c}$= 23 $k\\Omega$, $C_{c}$= 35.65 $\\mu F$).\n{(c)} $\\alpha$=-1.3 ($R_{c}$= 69 $k\\Omega$, $C_{c}$= 47.54 $\\mu F$).}\n\\label{si-int-fun}\n\\end{figure}\nThe experimental value of non-isochronicity is determined from the interaction function of \ntwo coupled oscillators with a frequency difference of approximately 20 mHz, achieved by \nan $R_{ind}$ difference of 100 $\\Omega$. In order to examine the interaction function, \nthe coupling strength is lowered from the value of the experiments such that phase \nslips are present. The product of $R_{c}$ and $C_{c}$ is kept constant to maintain \nthe same non-isochronicity as in the experiments. The interaction function is obtained by \nplotting the derivative of the phase of an oscillator (minus its natural frequency) as a \nfunction of the phase difference between the coupled oscillators. More details on the \nprocedure is given in a previous publication \\cite{Wickramasinghe:2013:062911}. The \nexperimentally obtained interaction functions are shown in Fig.~\\ref{si-int-fun}a,b,c. \nThe value of the sine and cosine harmonic coefficients of the interaction function are \nused to calculate the non-isochronicity (or phase shift parameter):\n\n\n", "itemtype": "equation", "pos": 4446, "prevtext": "\n\n\n\n\n\\title{Complex Rotating Waves and Long Transients in a Ring-Network of Electrochemical Oscillators with Sparse Random Cross-Connections}\n\n\\author{Michael Sebek}\n\\affiliation{Department of Chemistry, \nSaint Louis University, \n3501 Laclede Ave., St. Louis, Missouri 63103, USA}\n\n\\author{Ralf T\\\"onjes}\n\\affiliation{Institute of Physics and Astronomy, \nPotsdam University, \n14476 Potsdam-Golm, Germany}\n\n\\author{Istv\\'{a}n Z. Kiss} \n\\affiliation{Department of Chemistry, \nSaint Louis University, \n3501 Laclede Ave., St. Louis, Missouri 63103, USA}\n \n\\graphicspath{{figures/}} \n\n\\date{\\today}\n\n\n\n\n\\begin{abstract}\nWe perform experiments and phase model simulations with a ring network of oscillatory electrochemical reactions to explore the effect of random connections and non-isochronocity of the interactions on the pattern formation. A few additional links facilitate the emergence of the fully synchronized state. \nWith larger non-isochronicity, complex rotating waves or persistent irregular phase dynamics can derail the convergence to global synchronization. The observed long transients of irregular phase dynamics exemplify the possibility of a sudden onset of hyper synchronous behavior without any external stimulus or network reorganization.\n\\end{abstract}\n\n\\pacs{89.75.Hc 05.45.Xt 82.47.-a}\n\\maketitle\n\n\n\n\n\n\nWave propagation of activity of oscillatory units in rings or linear\nchains is a fundamental type of pattern formation, that occurs in many\nbiological systems, e.g., motion of leach \\cite{Iwasaki:2014:978-983},\nthe segmentation clock \\cite{Lauschke:2012:101-105}, or brain\nwave activities in the cortex \\cite{Ermentrout:2001:33-44}. A rotating\npinwheel was one of the first type of chemical pattern formation identified\nin the BZ reaction on a ring \\cite{Noszticzius:1987:619-620}. As a ring geometry is often used\nin chemistry, rotating phase wave patterns have been observed in\na large number of systems, e.g., in electrochemical reactions \\cite{Varela:2005:2429-2439},\nheterogeneous catalysis \\cite{Luss:2005:254-274}, coupled BZ reactors \\cite{Laplante:1992:4931-4934} and\nmicro droplets \\cite{Tompkins:2014:4397-4402}. Mathematical analysis\nusing phase models interpreted the existence and \nlocal stability of rotating waves in ring networks \\cite{Ermentrout:1985:55-74,Ermentrout:1992:1665-1687,Kopell:1986:623-660}.\nIt was found that the fully synchronized, zero phase lag, non-rotating state is the most attracting\nsolution, locally and globally. However, with increasing system size, rotating waves with higher winding number become more\nprobable in the aggregate \\cite{Wiley:2006:015103}.\n\\\\\nComplex engineered and biological systems can often be described as networks of discrete, interacting units \\cite{Albert:2002:47-97}.  Considering the \nprevalence of phase waves on rings and chains, a fundamental question is how\nthe rotating waves manifest in networks that are composed of a regular\nring backbone with a few additional random connections. \nNumerical simulations with phase models on \nsparse directed networks with random initial phases have shown that for sufficiently non-isochronous oscillations, while the fully synchronized state is \nlocally stable, persistent irregular phase dynamics is the typically observed behavior \\cite{Tonjes:2010:033108}. Such prolonged transient behavior can \nseverely impact system response when robust\nsynchronization is required as it was demonstrated with power grid\nmodels \\cite{Menck:2014:3969} or when synchronization is undesirable, e.g., in hyper synchronous neuronal discharges during seizures \n\\cite{UhlSing2006}. \n\\\\\nIn this paper, we explore the type of spatiotemporal patterns that can be\nobtained  with oscillatory chemical reactions\non bidirectional ring networks with random long range connections. The experimental\nwork is motivated by phase model calculations that predict the presence\nof complex rotating waves and long transients in small random networks\nwith sufficiently non-isochronous oscillations.  The experimental conditions \nallow the analysis of the dependence of pattern formation on the randomness of the network topology and the level of\nnon-isochronicity of the interactions among the units. \n\\\\\n\n\n\n\n\nTo study the properties of complex rotating waves on networks we consider weakly coupled, identical limit cycle oscillators with a Kuramoto type phase \nmodel \\cite{Kuramoto:1984} for phase differences in a co-rotating frame of reference\n\n\n", "index": 1, "text": "\\begin{equation}\n\\dot \\vartheta_n = \\sum_{m=1}^N A_{nm} g(\\vartheta_m-\\vartheta_n). \n\\label{eq:phasemodel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\vartheta}_{n}=\\sum_{m=1}^{N}A_{nm}g(\\vartheta_{m}-\\vartheta_{n}).\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>ϑ</mi><mo>˙</mo></mover><mi>n</mi></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>A</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>ϑ</mi><mi>m</mi></msub><mo>-</mo><msub><mi>ϑ</mi><mi>n</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02870.tex", "nexttext": "\n\n\\noindent where $A_{1}$ is the  sine coefficient and $B_{1}$ is the cosine coefficient of \nthe first harmonic of the interaction function obtained by fast fourier transform. The same procedure \nis used for positive $\\alpha$ with the product of $R_{ind}$ and $C_{ind}$ held constant.\n\n\\section{20 Phase Oscillators}\n\\noindent\n\n\\begin{figure}[th]\\label{fig.sm05}\n\\begin{center}\n\\includegraphics[width=0.85\\columnwidth]{./s1_fig3sim_small.eps}\n\\end{center}\n\\caption{Dynamics of $N$= 20 phase oscillators.\n{(a)} Rotating wave phase simulation, ($\\alpha$= 0).\n{(b)} Synchronized state in the presence of a 1-11 cross connection.\n{(c)} Mean order parameter after transient as a function of sequentially added shortcuts.\n{(d)} Jumping wave phase simulation, ($\\alpha$= 0).\n{(e)} Phase simulation of frozen complex rotating wave pattern with a source (triangle) away \nfrom the shortcut heterogeneity, ($\\alpha$= -0.97).\n{(f)} Phase simulation of frozen complex rotating wave pattern with a sink (triangle) away \nfrom the shortcut heterogeneity, ($\\alpha$= 0.76).}\n\\label{si-fig3sim}\n\\end{figure}\n\nWhile the main text \\cite{Sebek2016} provides simulations for systems with $N$= 500 phase oscillators, \nsimulations with $N$= 20 phase oscillators were performed to demonstrate the qualitative agreement between\nexperiments and the phase model. Figure 3 of the main text \\cite{Sebek2016} is reproduced with \nphase oscillators using the same method as in the experiments. A stable \nrotational state (Fig.~\\ref{si-fig3sim}a) is found when there are no shortcuts and \n$\\alpha$=0. The stable state of complete synchronization exists with a connection between oscillator 1 and 11 (Fig.~\\ref{si-fig3sim}b).\nHowever, in contrast to the experiments this state is not reached from an initial rotating wave. Instead a slight break of the symmetry in the initial rotating wave will \nlead to in-phase synchronization on one side of the ring (jumping wave) and a rotating wave on the other part of the ring (Fig.~\\ref{si-deviate}).\n\n\nIf $\\alpha$ is increased, the number of shortcuts required to achieve synchrony increases as seen \nin the plot of the mean order parameter as a function of the number of shortcuts shown in Fig.~\\ref{si-fig3sim}c and Fig.~\\ref{si-alphsc}a. A larger number of short cuts than in the experiments is needed to achieve complete synchronization in the phase model. We attribute this to the lack of the amplitude degree of freedom in the phase model which can increase the basin of attraction of frozen complex rotating wave patterns.\nJumping waves (Fig ~\\ref{si-fig3sim}d) form with the addition of\ncross-connections over small distances at $\\alpha$= 0. If $\\alpha$ is sufficiently negative a wave source \nand a sink form with the source position away from the cross-connection network heterogeneity \nwhereas for sufficiently positive $\\alpha$ a wave source and sink form in opposing \npositions of negative $\\alpha$ (Fig.~\\ref{si-fig3sim}e,f).\n\n\nThe typical system states of frozen complex wave patterns, complete synchronization and irregular phase dynamics\nshown in Figure 1 in the main text \\cite{Sebek2016} are also observed with as few as $N$=20 phase oscillators.  Fig.~\\ref{si-alphsc}a,b show the ensemble averaged Kuramoto order parameter and the variance of phase velocities as a function of the number of short cuts and non-isochronicity $\\alpha$ for 200 random network realizations.\n\nThe transient time median to a synchronized state where the difference between the maximal and the minimal phase velocity is less than $10^{-3}$ in ring networks of $N$=20 phase oscillators with \n$N_{sc}$=5 short cuts as a function of $\\alpha$ is shown in Fig.~\\ref{si-transtime}. Our simulations show a divergence of this transient time as $\\alpha$ is increased. At low $\\alpha$ in the regime of frozen complex wave patterns the transient time median is approximately constant but increases by a factor of 10 at $\\alpha=1.3$. This behavior is consistent with the experimentally observed long and irregular transient at $\\alpha=-1.3$ which with $T_{trans} \\approx 1700s$ (\\cite{Sebek2016} Fig.4e) is about 7 times longer than the exponential relaxation with $T_{trans} \\approx 230s$ for the same network and the same coupling strength $K$=0.033 mS at $\\alpha=0$ (Fig.~\\ref{short-trans}a). \n\n\\begin{figure}\\label{fig.sm06}\n\\begin{center}\n\\includegraphics[width=0.8\\columnwidth]{./s4_deviate.eps}\n\\end{center}\n\\caption{At $\\alpha=0$ with a single connection between oscillator 1 and 11 in a ring of $N=20$ phase oscillators, and a slightly perturbed rotating wave initial condition a jumping wave accross one part of the ring and a rotating wave accross the other part of the ring forms. This configuration is not observed in the experiments which synchronize completely.}\n\\label{si-deviate}\n\\end{figure}\n\n\\begin{figure}\\label{fig.sm07}\n\\begin{center}\n\\includegraphics[width=0.493\\columnwidth]{./N20R1alphaNsc_v02.eps}\n\\includegraphics[width=0.493\\columnwidth]{./N20vardthalphaNsc_v02.eps}\n\\end{center}\n\\caption{(a) Order parameter and (b) variance of phase velocities averaged over 200 realizations of random networks with $N$=20 phase oscillators as a \nfunction of $\\alpha$ and the number of shortcuts. Initial conditions are a rotating wave of winding number one. The data was evaluated after reaching a phase locked state or at most $t=500$ time units.}\n\\label{si-alphsc}\n\\end{figure}\n\n\\begin{figure}\\label{fig.sm08}\n\\begin{center}\n\\includegraphics[width=0.7\\columnwidth]{./s3_transtime.eps}\n\\end{center}\n\\caption{Median time to phase locking as a function of $\\alpha$ \naveraged over 200 realizations, for an $N$= 20 system with five random shortcuts.}\n\\label{si-transtime}\n\\end{figure}\n\n\n\n\\section{Clustering}\n\\noindent\n\nClustering is observed for networks of identical phase oscillators with shortcut densities between $\\sigma=0.05$ and $0.2$ in a narrow parameter region along the critical line between\nthe regions of frozen complex wave patterns and irregular phase dynamics. We have not observed clustering in the experiments. The reasons for that might be the small number of oscillators, small heterogeneities in the frequencies, amplitude effects or simply not enough observations. Clustering in the simulations with $N=500$ phase oscillators is evident in the cluster order parameters shown in in Fig.~\\ref{si-clusters}. Figure 1d in the main text \\cite{Sebek2016} shows $R_6$ and $R_7$ of the same data with restricted shortcut density $\\sigma=0.05$. In our simulations of the Kuramoto phase equations on our random network model we have observed clustering in networks as large as $N=10^5$ oscillators and $N_{sc}=5000$ shortcuts. In the clustering region the cluster number and strength of the clustering a system may display is distributed with a dependence on the position on the critical line. Shown in Fig.~\\ref{si-clusters} are the average cluster order parameters. Individual systems may demonstrate stronger or weaker clustering, a different cluster number or no clustering at all.\n\n\\begin{figure}[th]\\label{fig.sm09}\n\\begin{center}\n\\includegraphics[width=0.8\\columnwidth]{./R678159_N500_v02.eps}\n\\end{center}\n\\caption{k-cluster order parameters $R_k$ - $R_6$, $R_7$, $R_8$, $R_1$, $R_5$ and $R_9$ \nas functions of shortcut density, $\\sigma$, and non-isochronicity $\\alpha$, for $N$= 500 \noscillators, averaged over 10 network realizations at $t$= 500 time units.}\n\\label{si-clusters}\n\\end{figure}\n\n\n\n\n", "itemtype": "equation", "pos": 29091, "prevtext": "\n\n\n\n\nwhere $A_{nm}$ represents a coupling matrix and $g(\\Delta\\vartheta)$ is the average effect of the coupling for oscillators with \nphase difference $\\Delta\\vartheta$. \nA phase attractive coupling is assumed with  interaction function  $g(\\Delta\\vartheta) = \\sin(\\Delta\\vartheta-\\alpha) + \\sin(\\alpha)$.  The phase shift \nparameter $\\alpha$ is an important system property determined by the average shear flow near the limit cycle in the direction of perturbation caused by \ncoupling \\cite{Kuramoto:1984}, i.e. $\\alpha$ quantifies the non-isochronicity of the oscillations induced by interactions. We note that since the dynamics \nof the model equations (Eq.\\ref{eq:phasemodel}) is invariant under a \nchange of $\\alpha\\to -\\alpha$, $\\vartheta\\to -\\vartheta$ and $t\\to -t$, the phase differences and the frequency shift are inverted when $\\alpha$ \nchanges sign, such that sources become sinks of rotating waves and vice versa.\nWe assume non-normalized, bidirectional coupling $A_{mn}=A_{nm}\\in\\{0,1\\}$ on ring networks of $N=500$ oscillators with $N_{sc}=\\sigma N$ \nadditional random bidirectional links. The initial conditions for the simulations and the experiments is a rotating wave on the ring. (Random initial conditions give comparable results.)\n\\\\\nDue to phase attractive coupling  $g'(0)=\\cos\\alpha>0$ and complete connectedness of the network, \nthe fully synchronized, one-cluster state is always a linearly stable solution of (\\ref{eq:phasemodel}) \\cite{Tonjes:2010:033108}. \nHowever, the typical behavior of the network starting from globally desynchronized initial conditions, is far more complex than the intuitively expected \nrelaxation to the one-cluster state.  We characterize the state of the system by different order parameters. The $k$-cluster order parameters $R_k = \n\\left\\langle\\exp(ik\\vartheta_n)\\right\\rangle$ where the average is taken instantaneously over all oscillators, measure the coherence of the distribution of phases into $k$ \nevenly spaced clusters. The variance $\\textrm{var}\\dot\\vartheta$ of the phase velocities is a measure for frequency synchronization. These ensemble \naveraged measures are shown \nin the $\\sigma$ vs. $\\alpha$ parameter plane in Figs.~\\ref{fig-sim-model}a,b. \n\\\\\nWith small $\\sigma$, the original ring is divided into linear \nsegments between the end points of shortcuts, which can support traveling phase waves.  At the interfaces where two such traveling waves meet, \nthe phase differences in a state of stable synchronization are restricted. At low non-isochronicity and low shortcut density these interfaces can be frozen when all topological boundary conditions can be met simultaneously. We refer to such a pattern, which does not change in time, as frozen complex  \nrotating wave pattern. When the topological boundary conditions are not met (this is likely to occur with a large number \nof oscillators), slowly changing interfaces are obtained, reminiscent of vortex glasses in 2d \noscillatory media \\cite{Brito:2003:068301}. Both the Kuramoto order parameter $R_1$ and the variance of the phase velocities are small in this regime. \nWhen the shortcut density is increased,  there exists a topological cross-over to a random network without linear chain segments.\nTherefore, when $\\sigma$ is increased the system cannot maintain rotating waves and the one-cluster state becomes globally attractive\nwith $R_1 \\approx 1$. \nWhen $\\alpha$ is increased from zero, higher shortcut densities are required for complete synchronization (Figs.~\\ref{fig-sim-model}a-c).\n\\\\\nAt large values of non-isochronicity ($\\alpha\\gtrsim 1$) a qualitatively \ndifferent type of behavior exists. The topological boundary conditions for rotating phase waves along the \nring segments with stationary phase differences are very difficult to satisfy simultaneously. \nInstead, the dominant behavior is  persistent irregular dynamics with nonzero $\\textrm{var}\\dot\\vartheta$. \nThe distribution of phase differences during the transient and in frozen complex rotating  patterns becomes bimodal, suggesting a preferred phase difference that depends on $\\alpha$ \n(Fig.~\\ref{fig-sim-turb}b). \nThe emergence of persistent \nirregular dynamics is demonstrated in Fig.~\\ref{fig-sim-model}d by fixing the shortcut density $\\sigma$, and increasing the value of \n$\\alpha$.  At the transition between frozen and unfrozen complex rotating  patterns global clustering can arise resulting in a sharp increase in the \norder parameters $R_6$ or $R_7$. This global order is mediated by the end points of the shortcuts in the network (Fig.~\\ref{fig-sim-turb}f) : Due to the \nnarrow \ndistribution of phase differences in a phase locked state, \noscillators at the same distance to a crosslinked node have the same phase. Global clustering is only observable in a narrow parameter region\nat criticality and after a long, system size dependent transient. \n\\\\\nIn addition, around the transition point, before a complex rotating wave pattern becomes frozen, very long  transient dynamics \ncan be observed.  Figure \\ref{fig-sim-turb} shows an example of such transient dynamics, from random initial conditions and with negative non-\nisochronicity. The time evolution of next-neighbor phase differences demonstrates the competition between different phase patterns, with stationary \nsinks of the phase waves located at the network heterogeneities and dynamically rearranging sources which may form or annihilate upon collision with a \nsink or at phase slip events. Figures \\ref{fig-sim-turb}d,e show a transient and a stationary phase profile, respectively and Fig.\\ref{fig-sim-turb}b illustrates \nthe time evolution of the phase difference distribution. The phase differences in the stationary phase pattern are peaked sharply around $2\\pi/7$ \nresulting in a very precise wavelength and the formation of 7 global phase clusters.\n\n\n\\begin{figure}\n\\includegraphics[width=0.493\\columnwidth]{./fig1a_v5.eps}\t\\label{fig1a}\n\\includegraphics[width=0.493\\columnwidth]{./fig1b_v5.eps}\t\\label{fig1b}\n\\includegraphics[width=0.493\\columnwidth]{./fig1c_v6.eps}\t\\label{fig1c}\n\\includegraphics[width=0.493\\columnwidth]{./fig1d_v7.eps}\t\\label{fig1d}\n\\caption{(Color online) Order parameters in model (\\ref{eq:phasemodel}) at time $t=500$ as functions of shortcut density $\\sigma$ and non isochronicity parameter $\\alpha$ averaged over ten random network realizations with $N=500$ oscillators and rotating wave initial conditions. {(a)} Color coded Kuramoto order parameter $R_1$ and {(b)} variance $\\textrm{var}\\dot\\vartheta$ of phase velocities. The black and the white line in {(a)} and {(b)}, respectively, mark the contour of $R_1=0.9$. The light (green) line marks the contour line of $\\textrm{var}\\dot\\vartheta=0.2$. {(c)} Kuramoto order parameter as a function of $\\sigma$ for three different values of $\\alpha$ (cf.{\\ref{fig-sync-trans}c}). (d) Mean cluster order parameters $R_6$,$R_7$ and variance of phase velocities as functions of $\\alpha$ at $\\sigma=0.15$.}\n\\label{fig-sim-model}\n\\end{figure}\n\n\n\n\nAs shown in Fig.~\\ref{fig-sim-model}a, there also exists a narrow regime of partial synchronization for larger shortcut densities which is replaced in a \nsharp discontinuous transition by persistent incoherent phase dynamics at values of $\\alpha$ approaching $\\pi/2$ and which may be analyzed in a mean \nfield approach \\cite{Ko:2008:016203}.\\\\\n\\noindent \nTo confirm the modeling results, experiments were performed with an array of $N=20$, 1.00 mm diameter nickel\nwires on which an oscillatory metal dissolution reaction takes place measured by currents. Numerical simulations \nindicate { \\footnote{{Supplemental Material}} \\newcounter{{Note1}} \\setcounter{{Note1}}{\\value{footnote}} }  that regions of frozen rotating patterns, complete synchronization, and irregular phase dynamics can be clearly \ndistinguished even in such a small setup. The electrodes are coupled into a ring topology with additional random \ncross-connection via resistances and capacitances.\nWe report the conductance accross the coupling resistance as coupling strength $K$.\nCapacitance is used to introduce non-isochronicity through a phase shift in the coupling current \\cite{Wickramasinghe:2013:062911}{ \\footnotemark[\\value{{Note1}}] }. \nThe initial condition of the experiment is a rotating wave as shown \nin Fig.~\\ref{fig-sync-trans}a. First we describe the results with $\\alpha$=0, i.e., resistive coupling. \nWhen a random cross connection was added, one of two scenarios occurred. If the random \nshortcut connected two elements at a distance larger than 4 units, the system \nquickly converged to a fully synchronized state similar to that shown in Fig.~\\ref{fig-sync-trans}b. \nWhen the distance between the shortcut elements was smaller, the rotating waves \njumped across the connection. Figure \\ref{fig-sync-trans}d shows such pattern with two cross connections. \\\\\n\n\n\\begin{figure}\n\\includegraphics[height=0.3\\columnwidth]{./fig2a_v5.eps}\t\\label{fig2a}\\qquad\\quad\n\\includegraphics[height=0.3\\columnwidth]{./fig2b_v6.eps}\t\\label{fig2b}\n\\includegraphics[width=0.98\\columnwidth]{./fig2c_v5_small.eps}\t\\label{fig2c}\n\\includegraphics[width=0.98\\columnwidth]{./fig2def_v5.eps}\t\\label{fig2def}\n\\caption{(Color online) Long transient to a complex frozen rotating wave pattern from random initial phases in a network of $N$= 500 phase oscillators with $\\alpha$= -1.15 and \nshortcut density $\\sigma$= 0.05.\n{(a)} Ring network \nwith 26 additional random shortcuts \n{(b)} Time evolution of the density of next neighbor phase differences. The solid (red) line marks the average of $|\\Delta\\vartheta|$.\n{(c)} Time evolution of next neighbor phase differences modulus $\\pi$ (color coded). Dark (blue) colors indicate phase waves to the \nright and light (red) colors indicate phase waves to the left.  The white lines indicate phase profiles $\\vartheta_{n}$ between 150 $\\leq$ n $\\leq$ 250 shown in \nsub figures (d) at $t$= 300 and (e) at $t$= 500. \nLarge (red) circles and solid (red) lines in panels (a,d-f) indicate nodes with shortcut connections.\nBlack squares in panels (d,e) indicate dynamically realized centers of phase waves. Panel (f) shows clustering of the phases at $t$=500 with $R_7\\approx 0.9$ and cross-links (solid lines) connecting neighboring clusters.}\n\\label{fig-sim-turb}\n\\end{figure}\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.45\\columnwidth]{./fig3a_v5.eps}{\\qquad}\t\\label{fig3a}\n\\includegraphics[width=0.45\\columnwidth]{./fig3b_v5.eps}\t\\label{fig3b}\n\\includegraphics[width=0.45\\columnwidth]{./fig3c_v5.eps}{\\qquad}\t\\label{fig3c}\n\\includegraphics[width=0.45\\columnwidth]{./fig3d_v5.eps}\t\\label{fig3d}\n\\includegraphics[width=0.45\\columnwidth]{./fig3e_v5.eps}{\\qquad}\t\\label{fig3e}\n\\includegraphics[width=0.45\\columnwidth]{./fig3f_v5.eps}\t\\label{fig3f}\n\\end{center}\n\\caption{The impact of shortcuts and $\\alpha$ on the formation of complex rotating waves and on synchronization.  \n{(a)} Initial rotating wave ($V$=1105 mV, $K$=0.20 mS, $\\alpha$=0). \n{(b)} Synchrony induced by one long distance shortcut. \n{(c)} The mean order parameter with increasing number of shortcuts at $\\alpha=0$ (circles), -0.97 (squares) and -1.3 (triangles). \n$V$=1110 mV, $C\\textsubscript{c}$=82 $\\mu$F, $K$=0.10 mS at $\\alpha$=-0.97 and $K$=0.025 mS at $\\alpha$=-1.3. \n{(d)} Short distance shortcuts at $\\alpha$=0 yield jumping waves ($V$=1110 mV). \n{(e)} Long distance shortcut at $\\alpha$=-0.97 yields a frozen complex rotating  pattern with a source (triangle) away from the heterogeneity ($V$=1110 mV). \n{(f)} Long distance shortcut at $\\alpha$=0.76 yields a frozen complex rotating  pattern with a source (full square) on the heterogeneity ($V$=1245 mV, \n$C\\textsubscript{ind}$=1 mF, $K$=0.40 mS).}\n\\label{fig-sync-trans}\n\\end{figure}\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[height=0.51\\columnwidth]{./fig4a_v7.eps}\t\\label{fig4a}\n\\includegraphics[height=0.51\\columnwidth]{./fig4b_v6.eps}\t\\label{fig4b}\n\\includegraphics[height=0.51\\columnwidth]{./fig4cd_v5.eps}\t\\label{fig4cd}\n\\includegraphics[width=0.93\\columnwidth]{./Fig4e_v8.eps}\t\\label{fig4e}\n\\end{center}\n\\caption{Long transient to synchronization at $\\alpha=-1.3$ ($V$=1110 mV, $C\\textsubscript{c}$=82 $\\mu$F, $K$=0.033 mS). \n{(a)} Time evolution of next neighbor phase differences. \n{(b)} Histogram of next neighbor phase differences during the transient and the final synchronized state. \n{(c)} Histogram of the period per cycle of all electrodes (white bars are the individual periods and dark bars the transient).\n{(d)} Network topology and a typical complex rotating wave pattern during the transient.  \nArrows indicate the wave direction from sources to sinks. \n{(e)} Time evolution of the Kuramoto order parameter where the arrows indicate transitions between wave patterns through phase slips.}\n\\label{fig-phase-turb}\n\\end{figure}\n\n\n\\noindent \nWe have performed 16 independent trials adding cross-connections successively to a ring configuration. The\nmean order parameter as a function of the added number of shortcuts is shown \nin Fig.~\\ref{fig-sync-trans}c. Only three shortcuts were required for the average order parameter to exceed 0.90. \nTherefore, we can conclude that with $\\alpha=0 $ a relatively small number of shortcuts \n($\\sigma \\approx 0.15$) induces full synchrony. When $\\alpha$ was changed to -0.97, with a parallel RC coupling, we still observed rotating waves jumping over the \nconnection when the first cross-connection was placed up to a distance of 5 units \nbetween the elements. However, when the distance was larger, instead of full synchronization, \nwe observed frozen complex rotating  pattern via the formation of a source and sink pair (Fig.~\\ref{fig-sync-trans}e). \nThe order parameter vs. number of shortcuts graph in Fig.~\\ref{fig-sync-trans}c shows that with $\\alpha=-0.97$\nthe mean order parameter starts to increase for $n>3$, and it requires relatively \nlarge number ($n>6$) of random shortcuts to achieve Kuramoto order larger than 0.90.\nThe presence of jumping waves and complex rotating wave patterns thus contributes to resisting  complete synchronization. \nWhen $\\alpha$ was further changed to -1.3, the trend of resisting the fully synchronized \nstate continued. \nFigures \\ref{fig-sync-trans}e,f demonstrate the inversion of the stationary phase profile, and thus the direction of the rotating waves and the reversal of \nsource and sink, upon switching the sign of the non-isochronicity by adding a capacitance to the individual current instead of the coupling current \n\\cite{Wickramasinghe:2013:062911}{ \\footnotemark[\\value{{Note1}}] }. \nAll the patterns in Fig.~\\ref{fig-sync-trans} were reproduced by phase model simulations in { \\footnotemark[\\value{{Note1}}] }.\n\nLong transients to both frozen complex wave patterns and identical synchronization were observed in experiment. \nA long transient over $1700$s in a network with five random shortcuts near $\\alpha$=-1.3 is shown \nin Fig.~\\ref{fig-phase-turb}. \nThe time evolution of next neighbor \nphase differences during the transient is shown in Fig.~\\ref{fig-phase-turb}a. At least two competing wave patterns, which are meta stable over the \ncourse of tens of oscillations and transform via intermittent phase slips could be observed for over 700 oscillations before the  system settled into the \none-cluster state. \nAt $\\alpha=0$ the same network relaxes exponentially to synchronization in $230$s { \\footnotemark[\\value{{Note1}}] }. Numerical simulations with the phase model confirmed that by changing $\\alpha$ from \n0 to -1.3 the lifetime of the transient increases about 10 times and diverges as $\\alpha$ approaches $|\\pi/2|$ { \\footnotemark[\\value{{Note1}}] }.\nA density plot of next neighbor phase differences during and after the transient is depicted in \nFig.~\\ref{fig-phase-turb}b and shows an asymmetric distribution with a preferred wave length, skewed towards \nthe initial left-handed rotational state. \nIn addition, a wide distribution of peak to peak periods can be observed during the transient as seen in \nFig.~\\ref{fig-phase-turb}c, which marks the presence of irregular phase dynamics. A typical snapshot of a transient complex rotating wave is shown\nin Fig.~\\ref{fig-phase-turb}d. The arrows indicate the direction of the rotations as well \nas the sources (oscillators 9 and 18) and sinks (oscillators 2 and 11) of the \nunstable rotational wave pattern. \nThe order parameter (Fig.~\\ref{fig-phase-turb}e) clearly exhibits the transient behavior \nas its value changes between approximately 0.2 and 0.6 irregularly throughout \nthe transient until synchronization is achieved. \n\\\\\nIn conclusion, we have observed frozen complex rotating  patterns and long transients to synchronization in electrochemical oscillations and \nnumerical simulations of phase oscillators on a ring network topology with  sparse random shortcuts. Depending on the sign of non-isochronicity $\\alpha$, \neither the sinks or the sources are pinned to endpoints of cross-connections in the network. At increased non-isochronicity the variability in the phase \ndifferences in a phase locked state decreases until synchronization is no longer possible and persistent or very long transient phase dynamics occurs. The \npresence of long transients of irregular phase dynamics could have relevance in the functioning of biological systems, e.g., in neuron dynamics where pathological \nsynchronization can occur without apparent external perturbation or change of network topology. The experimentally recorded, irregular transient \ndynamics contributes to the few experimental examples of high dimensional transient chaos \\cite{TelLai2008}, where system size effects on the lifetime \nof the transient irregular state could be studied.\n\\\\\n\n\n\nThis material is based upon work supported by the National Science Foundation under Grant Number \nCHE-1465013. \nThe manuscript has supplemental material { \\footnotemark[\\value{{Note1}}] }.\n\\vspace{0.4cm}\n\n\n\n\n\\section*{\\bf References} \n\\bibliography{references-Saved}\n\n\n\\begin{center}\n\n\n\\textbf{\\large Supplemental Material}\n\\end{center}\n\n\n\\setcounter{equation}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\setcounter{page}{1}\n\\makeatletter\n\n\n\n\n\n\\section{Experimental Setup}\n\\noindent\n\n\n\\begin{figure}[th]\\label{fig.sm01}\n\\begin{center}\n\\includegraphics[width=0.8\\columnwidth]{./s6_expsetup_small.eps}\n\\end{center}\n\\caption{Schematic of the experiments where the electrodes (black circles) are connected\n to the working point (W) of the potentiostat. $R_{c}$ are illustrated as empty squares \n and $R_{ind}$ are illustrated by the filled squares.\n{(a)} Diagram of the twenty electrode ring network with the location of $R_{c}$ and\n$R_{ind}$ displayed. \n{(b)} Simplified diagram showing three electrodes with the addition of $C_{c}$.\n{(c)} Simplified diagram showing three electrodes with the addition of $C_{ind}$.}\n\\label{si-exp-schem}\n\\end{figure}\n\n\n\nExperiments are performed by a standard electrochemical cell with\n3 M H\\textsubscript{2}SO\\textsubscript{4} as the electrolyte. The\ncounter electrode is a platinum coated titanium rod, the reference\nelectrode is Hg/Hg\\textsubscript{2}SO\\textsubscript{4}/sat. K\\textsubscript{2}SO\\textsubscript{4},\nand the working electrode is an array of 20 nickel, 1.00 mm diameter,\nwire cross sections embedded in epoxy. The temperature is held at 10 \\textsuperscript{o}C. Each nickel\nelectrode in the array is connected to the potentiostat (ACM Instruments\nGillAC) through an individual resistance $R_{ind}$. \nThe frequencies of the electrodes are controlled by an increase or decrease of \n$R_{ind}$ and regulated to $0.4$Hz $\\pm 2.5$mHz at  $R_{ind}=1k\\Omega$ in the beginning of the experiment. \nThe system is coupled locally into a ring topology by coupling resistance\n($R_{c}$) as shown in  Fig.\\ ~\\ref{si-exp-schem}a. A constant\npotential ($V$) is applied and the oscillatory current of each electrode\nin the array is measured at 200Hz by a potential drop over $R_{ind}$. \nThe coupling strength $K$ is reported as the inverse $1/R_{c}$ of the coupling resistance. Non-isochronicity is introduced into the network by the addition of \ncapacitance C. The non-isochronticity is negative for a capacitance $C_c$ parallel to $R_{c}$ and positive for a capacitance $C_{ind}$ parallel to $R_{ind}$ as seen in \nFig.~\\ref{si-exp-schem}b,c. The level of nonisochronicity induced by the \ncapacitance in a pair of ocillators was studied in great detail in a previous \npublication \\cite{Wickramasinghe:2013:062911}.\n\n\\section{Method}\n\\noindent\n\n\\begin{figure}[th]\\label{fig.sm02}\n\\begin{center}\n\\includegraphics[width=0.9\\columnwidth]{./s7_osc_v3_small.eps}\n\\end{center}\n\\caption{Current oscillation of electrodes.\n{(a)} Space-time plot of the electrode currents on the ring network in a phase-locked rotational wave state with no shortcus \n($V$= 1105 mV, $K$= 0.20 mS, $\\alpha$= 0). \n{(b)} Space-time plot of the electrode currents on the  ring network with in-phase synchronization with a 1-11 cross connection.\n{(c)} Measured currents of cross-cut oscillators (1,2,3,6,10,11,13,17,19) showing typical irregular transient behavior ($V$= 1110 mV, $C_c$= 82$\\mu$F $K$= 0.033 mS, $\\alpha$= -1.3).\n{(d)} Measured currents of cross-cut oscillators (1,2,3,6,10,11,13,17,19) exhibiting in-phase synchronization.}\n\\label{si-osc-data}\n\\end{figure}\n\n\\begin{figure}[th]\\label{fig.sm03}\n\\begin{center}\n\\includegraphics[width=0.9\\columnwidth]{./s9_a0trans_v3.eps}\n\\end{center}\n\\caption{Short transient to synchronization at $\\alpha$ = 0 ($V$= 1105 mV, $K$= 0.033 mS).\n{(a)} Time evolution of the Kuramoto order parameter.\n{(b)} Space-time plot of the current during the transient from the initial rotational state to in-phase synchronization.}\n\\label{short-trans}\n\\end{figure}\n\n\nOnce coupled into the ring topology, global negative feedback is applied\nto linearly increase the phase difference between neighboring oscillators according to \n$\\vartheta_{n}=2\\pi n/N$. The phase pattern is stable when feedback is removed \n(see Fig.~\\ref{si-osc-data}a). Additional connections are added randomly into \nthe system with the same $R_{c}$ and $C_{c}$ value as the existing connections \nin the network. \nIf the system did not synchronize in-phase during the addition of the connection, a second \nconnection is chosen by the same method as the first and added to the network.\nThe process is repeated until in-phase synchronization is observed. Further additions of shortcuts are assumed to have no desynchronizing effect. The non-rotating, synchronized \nstate is shown as a space-time plot in Fig.~\\ref{si-osc-data}b. Transient dynamics to a synchronized state may be exponential relaxation (Fig.\\ref{short-trans}) or irregular phase dynamics with periods and amplitudes fluctating in time (Fig.~\\ref{si-osc-data}c). In synchrony, the period is identical for all \noscillators and the amplitudes are much more homogeneous as shown in Fig.~\\ref{si-osc-data}d.\n\n\\section{Determination of Alpha}\n\\noindent\n\n\\begin{figure}[th]\\label{fig.sm04}\n\\begin{center}\n\\includegraphics[width=0.49\\columnwidth]{./s8a_alpha0.eps}\n\\includegraphics[width=0.49\\columnwidth]{./s8b_alpha97.eps}\n\\includegraphics[width=0.49\\columnwidth]{./s8c_alpha1-3.eps}\n\\end{center}\n\\caption{Experimentally measured interaction functions ($V$=1105 mV, $R_{ind1}$=1 $k\\Omega$, $R_{ind2}$=900 $\\Omega$).\n{(a)} $\\alpha$=0 ($R_{c}$= 20 $k\\Omega$). \n{(b)} $\\alpha$=-0.97 ($R_{c}$= 23 $k\\Omega$, $C_{c}$= 35.65 $\\mu F$).\n{(c)} $\\alpha$=-1.3 ($R_{c}$= 69 $k\\Omega$, $C_{c}$= 47.54 $\\mu F$).}\n\\label{si-int-fun}\n\\end{figure}\nThe experimental value of non-isochronicity is determined from the interaction function of \ntwo coupled oscillators with a frequency difference of approximately 20 mHz, achieved by \nan $R_{ind}$ difference of 100 $\\Omega$. In order to examine the interaction function, \nthe coupling strength is lowered from the value of the experiments such that phase \nslips are present. The product of $R_{c}$ and $C_{c}$ is kept constant to maintain \nthe same non-isochronicity as in the experiments. The interaction function is obtained by \nplotting the derivative of the phase of an oscillator (minus its natural frequency) as a \nfunction of the phase difference between the coupled oscillators. More details on the \nprocedure is given in a previous publication \\cite{Wickramasinghe:2013:062911}. The \nexperimentally obtained interaction functions are shown in Fig.~\\ref{si-int-fun}a,b,c. \nThe value of the sine and cosine harmonic coefficients of the interaction function are \nused to calculate the non-isochronicity (or phase shift parameter):\n\n\n", "index": 3, "text": "\\begin{equation}\n\\alpha = \\arctan\\left(\\frac{A_{1}}{B_{1}}\\right)\\,\n\\label{eq:alpha}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\alpha=\\arctan\\left(\\frac{A_{1}}{B_{1}}\\right)\\,\" display=\"block\"><mrow><mi>α</mi><mo>=</mo><mrow><mi>arctan</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>A</mi><mn>1</mn></msub><msub><mi>B</mi><mn>1</mn></msub></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}]