[{"file": "1601.04074.tex", "nexttext": "\nThis quantity permits good visualization of any abrupt change of $B$. For\ncomparison, in a pure rotational discontinuity of the field\n${L_B}^{-1}$ is $\\pi$ times the inverse width of the sheet while in \na Harris sheet it goes through infinity at the center\nof the sheet. In the figure, the pixels where ${L_B} <\n1000\\ \\hbox{km}$ are shown in color, with magnetic field lines superimposed\nas solid lines. There is a reconnection site located at $x\\sim6.8$~Mm and\n$z\\sim1.8$~Mm (black cross). Along its lifetime, the current sheet repeatedly\nexperiences the formation of plasmoids (like the one at $z\\sim2.4$~Mm in\nFigure~\\ref{lb_current}) through the development of the\ntearing-mode-instability \\citep{Furth:1963aa}. This behavior has been\ndetected in previous flux emergence experiments, e.g., in 2D by\n\\citet{Yokoyama:1996kx}, and in 3D by \\citet{archontis2006},\n\\citet{Moreno-Insertis:2013aa} and\n\\citet{archontis2014}. In our case, the timescale of\n  plasmoid formation is between several tens of seconds and a\n  few minutes. This range is compatible with the theoretical value for\n  the growth time of the tearing mode \\citep[see][]{Goldston1995}: the latter \n  is close to the geometric mean between $\\tau_a = L_B/v_a$ and $\\tau_d\n  = L_B^2/\\eta$, where $v_a$ is the Alfven velocity and $\\eta$ is the\n  diffusivity. In our current sheet, $\\tau_a = 10^{-2} - 10^{-3}$ s, and\n  $\\tau_d = 10^{7} - 10^{8}$ s, and the geometric mean of those quantities is near the\n  measured values in the experiment.\n\n\\begin{figure}\n\\epsscale{1.21} \\plotone{Figure_03.pdf}\n\\caption{Map of the inverse characteristic length of the\n  magnetic field ${L_B}$, see Equation (\\ref{eq:lb}),\n  illustrating the thin current sheet at the boundary\n  between emerged plasma and the corona. Only the pixels\n  where ${L_B} < 1000\\ \\hbox{km}$ are shown in color. Magnetic\n  field lines appear superimposed as solid lines. The black\n  cross is the central part of the reconnection\n  site. \\label{lb_current}}\n\\end{figure}   \n\nAs time goes on, the area where the orientation conflict is\nlocated grows in length because of the dome\nexpansion. During this phase, the plasmoids are ejected as part of the reconnection process,  \nprobably through the melon seed ejection mechanism \\citep{schluter1957}, \nwhich can be launched when there is an imbalance in the Lorentz force holding \nthe plasmoid on its sides along the current sheet. Some of the plasmoids also\nmerge forming bigger ones as a result of the coalescence\ninstability \\citep{Finn:1977aa}.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure*}\n\\epsscale{1.2} \\centerline{\\plotone{Figure_04.pdf}}\n\\caption{Density maps showing the formation and descending\n  phases of the cool and dense ejection. Temperature\n  contours have been superimposed to the maps to complete\n  the image: the association of colors to temperatures is\n  given in panel A. The hot coronal jet is also visible on\n  the left-hand side of the dome delineated by the pink\n  contours.  See also the accompanying Movie 1.\\label{wall}}  \n\\end{figure*}\n\n\\Needspace{5\\baselineskip}\n\\section{The ejection of cool, high-density plasma}\n\\label{sec:cold_wall}\n\nAs a result of the reconnection process taking place at the\nboundary between emerged dome and coronal material, a\nsubstantial amount of plasma with chromospheric temperatures\nand densities is ejected to coronal heights. We refer to\nthis phenomenon as the {\\it cool and dense ejection} or {\\it\n  surge} and avoid the word {\\it jet}, since the ejecta are\nnot collimated and do not have large speeds, as shown in\nthis section. In Figure~\\ref{wall}, the overall evolution of\nthe surge from the initial stages to the decay phase is\nillustrated using grayscale maps for the density and with a\nnumber of temperature contours with values indicated in\npanel A. In panels A and B we can see an apparent peeling\nprocess that is carrying dense and cool plasma to greater\nheights toward the right of the dome. At the same time, a\nhot coronal jet is forming on the left side as can be\nidentified through the pink contours in Panel B. In panel C,\nthe dome seems to be splitting into two parts at $x \\approx\n12$~Mm. In panel D, we can distinguish the cool and dense\nplasma ejection as the elongated structure located to the\nright of the emerged dome with temperatures below $3 \\times\n10^4$~K, i.e., chromospheric temperatures, including a\ncolder core of lower temperatures down to $2\\times 10^3$~K.\nAround this instant, the ejecta reach their maximum height,\n$z = 13.2$~Mm, and the density range in the surge is between\n$10^{-14}$~g cm$^{-3}$ and $10^{-11}$~g cm$^{-3}$. The rest\nof the panels (E, F, G and H) show the decay phase. During\nthe decay, the surge moves first to the left and then to the\nright in a swaying motion caused by the Lorentz force\nassociated with the bending of its magnetic field lines. The cool\nsurge remains as an easily identifiable feature until $t\n\\approx 66$~min, so its lifetime can be estimated to be\nabout $7-8$~minutes. The accompanying Movie 1 shows the time\nevolution of the density and temperature of the system. \n\nIn order to analyze the fundamental aspects of the surge, we\nhave followed more than $3 \\times 10^5$ plasma elements\nthrough Lagrangian tracing. The choice of tracers was\ncarried out at the time of maximum vertical extent of the\ncool ejection, $t= 61$~min, and is shown in panel I of\nFigure~\\ref{dome_thermo} with dots of different colors\nsuperimposed on the image. We set the side and top boundary\nof the surge to coincide with the isocontour ${T} = 3 \\times\n10^4$~K (blue curve) and use as lower limit the $z = 2$~Mm\nhorizontal axis. The tracers are then evenly distributed in that\ndomain with high-resolution spacing $\\delta x = \\delta z =\n10$~ km. For later reference, we have drawn the\ntracers in four different colors (cyan, yellow, purple and\nred) according to the four different populations of\nplasma elements that are introduced and discussed from\nSection~\\ref{subsec:thermo} onward. The resolution is high \nenough for the individual tracers to be indistinguishable in the figure: \nthe domains looks like a continuous surface. Once the distribution is\nestablished, we follow the tracers backward in time until\n$t=51$~min, to study their origin, and also forward, until\n$t=65$~min. The tracking has a high temporal cadence of\n$0.2$~seconds in order to reach good accuracy even in \nlocations with high gradients and phases of fast changes,\nlike when going through the current sheet. \n\n\n\n\\begin{figure*}\n\\epsscale{1.15} \\centerline{\\plotone{Figure_05.pdf}}\n\\caption{Panel I: Density map showing the basic distribution of the \nmore than $3 \\times 10^5$ Lagrangian tracers by means of colored domains \n(cyan, yellow, purple and red). The domains correspond to the four \ndifferent populations discussed from Section~\\ref{subsec:thermo} onward and are \ntagged with the corresponding capital letters. Panels II.1 through II.4:  Evolution of the ensemble of \ntracers from time $52$ min onward. A more continuous illustration of the time evolution is given in the \naccompanying Movie 2). \\label{dome_thermo}}\n\\end{figure*}   \n\n\nThe rest of this section is divided into three blocks devoted to the heating and cooling sources of the surge \n(Section \\ref{subsec:thermo}), the plasma\nacceleration (Section \\ref{sec:dyn}), and the velocities, densities\nand temperatures (Section \\ref{sub:velocities}).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{Heating and cooling sources}\\label{subsec:thermo}\n\n\n\\begin{figure}\n\\epsscale{1.20} \\centerline{\\plotone{Figure_06.pdf}}\n\\caption{Set of panels showing the time evolution for four\n  different plasma elements followed by Lagrangian\n  tracing. The chosen elements are representative of the\n  four different populations we found concerning the thermal\n  properties. In the panels, the temperature ${T}$ is\n  plotted in in black while ${L_B}^{-1}$ in red. This last\n  quantity allows to identify the proximity of the element\n  to the current sheet. \\label{dynamics_4}}\n\\end{figure} \n\n\nHere we analyze the heat sources and sinks in the surge, since they are key\nfor understanding its structure and evolution. From all the entropy sources\nincluded in the Bifrost code, the relevant ones for the surge are those\nresulting from the Spitzer thermal conductivity, the optically thin cooling,\nthe radiative losses by neutral hydrogen, and the ohmic and viscous\nheating. The rest, like those associated with the chromospheric radiative\nlosses by singly-ionized calcium and magnesium, have much longer\ncharacteristic times and need not be discussed. The following results are\nfocused on the rising phase of the ejecta until they reach their maximum\nheight at around $t = 61$~min. Thereafter, the characteristic times of the\nheating and cooling processes become much longer than the general\nevolutionary timescale of the surge: the temperature changes in the decay\nphase are due to adiabatic compression.\n\n\n\nThe study of the thermal properties of the individual Lagrangian elements\nallows one to discern four different plasma populations within the ejecta of\ndifferent origin and evolution that we have identified with labels ``{A}'',\n``{B}'', ``{C}'' and ``{D}'', and drawn in colors cyan,\nyellow, purple and red, respectively, in Figure~\\ref{dome_thermo}. \nIn Panel I we have already introduced the distribution of the Lagrangian \nelements when the cool ejection reaches its maximum height. \nPanels II.1 -- II.4 show the evolution of those elements during previous \nstages of the surge. These panels illustrate the origin of the plasma in the surge \nand how the different populations evolve to give rise to the distribution shown in Panel I. \nA more complete view of the formation of the surge is also provided via the \naccompanying Movie 2. The nature of the \ndifferent populations is analyzed in the following.\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Population {A}}\\label{sec:popstandard}\n\nPopulation {A}, plotted in cyan in Figure~\\ref{dome_thermo},\ncorresponds to plasma originating in the dome (see panel II.1) and it is heated through \nJoule and viscous dissipation during\nthe early stages of formation of the surge. Owing to the high density of\nthis population, those entropy sources are not able to heat the plasma to\nvalues above $3 \\times 10^4$~K. At $t=61$~min, this population covers $44\\%$\nof the cross section of the surge and its total mass per unit length in the\n$y$ direction is $10^{-3}$ g Mm$^{-1}$.  The top-left panel in\nFigure~\\ref{dynamics_4} shows with a black solid line the time evolution of\nthe temperature of a representative plasma element of this population. The\nelement jumps from dome temperatures, close to $2\\,\\times 10^3$~K, to values\naround the temperature of the hydrogen {ionization/recombination\\hskip 2pt}, namely\n$6\\,\\times 10^3$~K. In the same panel (red curve), the values of ${L_B}^{-1}$\nat the positions reached by that plasma element indicate that it passes near\nthe current sheet, but not quite through it: the typical values of ${L_B}$ in\nthe current sheet are less than $100$ km (see Figure \\ref{lb_current}).\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Population {B}}\\label{sec:popdometohot}\n\nThe second group of Lagrange tracers is what we call Population\n{B}, drawn in yellow in Figure~\\ref{dome_thermo}.  Its defining\nfeature is that the plasma elements in it, in spite of originating in the\ndome, reach temperatures between $10^5$ and $10^6$~K during the launch phase,\nand then cool down to temperatures below $3 \\times 10^4$ K. This family\nleaves the dome later than the elements of population {A}, as shown\n in the panels II.1 -- II.4 of Figure~\\ref{dome_thermo}; it ends\nup covering $34\\%$ of the surge's cross section at $t=61$~min, but it has\ncomparatively low densities, so its integrated mass at that time is $4.7\\,\\times 10^{-5}$\ng Mm$^{-1}$ only.  There are two main reasons for the sudden increase in\ntemperature of the elements of this population, namely:\n\n\n\\begin{enumerate}\n\n\\item Unlike for Population {A}, some of its plasma elements pass\n  through the current sheet, and are strongly heated there (see the yellow tracers\n  above the blue temperature contour, $3 \\times 10^{4}$ K, in panels II.3 and II.4). The top-right\n  panel in Figure~\\ref{dynamics_4} depicts an example of this behavior for a\n  representative member of this population. The characteristic\n  length ${L_B}$ reaches a small value, around $25$ km, after which it\n  decreases, indicating that the plasma element is then leaving the current\n  sheet. When in the current sheet, the Joule dissipation and, to a\n  lesser extent, the viscous dissipation become highly efficient, with\n  short characteristic timescales from several seconds to a few tens of\n  seconds, as shown in the left panel of Figure~\\ref{times_popb}.   \n\n\\item Some plasma elements of this Population, those close to the\n  blue contour on the left side of the surge in panel I of Figure~\\ref{dome_thermo}, are\n  affected by their passage through a strong shock. This shock is a central\n  feature of the dynamics of the surge and is described separately\n  (Section~\\ref{sec:the_cleft}).\n\n\\end{enumerate} \n\nAdditionally to the foregoing, the heating processes are particularly\neffective at increasing the temperature of the particles of this population\ngiven their comparatively low initial density: their late ejection from the\nemerged dome implies that the density of the latter has already been\nsubstantially reduced through the gravitational draining explained in\nSection~\\ref{sec:dome_3}. The late ejection furthermore explains their\nappearance on the left hand side of the surge and with comparatively low\ndensity (see the left side of the surge in panel D of Figure~\\ref{wall} in comparison with its right side).\n\n\\begin{figure}\n\\epsscale{1.20} \\centerline{\\plotone{Figure_07.pdf}}\n\\caption{Characteristic times of the entropy sources and\n    sinks for the representative plasma element of Population\n    {B}~used in Figure~\\ref{dynamics_4}. Left panel: Joule \n($\\tau_{Joule}^{}$) and viscous ($\\tau_{visc}^{}$) heating sources. Right panel: \n    Thermal conduction ($\\tau_{Spitz}^{}$), optically thin radiative losses\n    ($\\tau_{thin}^{}$), and radiative losses by neutral hydrogen\n    ($\\tau_{H}^{}$). \\label{times_popb}}\n\\end{figure} \n\nThe short duration of the high temperature spurt of these mass elements is\nexplained by the activation, when the temperature is nearing $10^6$ K, of \nthermal conduction and optically thin radiative losses as effective\nentropy sinks. The associated characteristic times ($\\tau_{Spitz}^{}$,\n$\\tau_{thin}^{}$, respectively) for the plasma element studied above can be\nseen (Figure~\\ref{times_popb}, right panel) to reach low values of several\nseconds ($\\tau_{Spitz}^{}$) or of a few tens of seconds\n  ($\\tau_{thin}^{}$). When $T$ decreases to values around $10^4$ K, the\n  radiative losses by neutral hydrogen can also be important (see the curve\n  labeled $\\tau_H^{}$). It is through these cooling processes that the\n  elements of this population eventually adopt the cool temperatures of the\n  surge.\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Population {C}}\\label{sec:popcold}\n\nPopulation {C}, plotted in purple in Figure~\\ref{dome_thermo},\nis a fraction of the surge coming from the dome that\nmaintains its initial temperature in the time range\nshown. At $t = 61$~min, this population covers $15\\%$ of\nthe cross section of the surge and has a small mass\ncontent, $2.8\\,\\times 10^{-5}$ g Mm$^{-1}$. \nThe Lagrangian tracing shows that the plasma elements were\ndragged passively from the dome, following the motion of the\nmagnetic field lines explained in Section \\ref{sec:accel_launch}. \nAlong this process, they are never heated by Joule or viscous dissipation. \nThe local values of ${T}$ and ${L_B}^{-1}$ for a representative plasma element of this population are\ngiven in Figure~\\ref{dynamics_4}, bottom-left panel. In fact, those plasma\nelements expand along their motion, which explains why this population is barely visible in \npanels II.1 and II.2 of Figure~\\ref{dome_thermo} in comparison with panels II.3 and II.4). \nThe density of the elements decreases by\napproximately one order of magnitude, but their temperature is kept constant\nthrough the ad-hoc heating term mentioned in Sections~\\ref{sec:2} and  \n\\ref{sec:disc_limitations}.\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Population {D}}\\label{sec:corona}\n\n\n\nA small fraction of the Lagrange elements in the surge, plotted in red in Figure\n\\ref{dome_thermo}, have tracks that start\nin coronal heights at $t < 57$ min (panels II.1 -- II.3). The ensemble of such elements is called\nPopulation {D}\\ in the following. They cover $7\\%$ of the cross section of the\nsurge at $t = 61$ min (panel I). The temperature and ${L_B}^{-1}$ evolution for a representative plasma\nelement of this population is shown in the bottom-right panel of\nFigure~\\ref{dynamics_4}. The tracks start at heights well above the\nreconnection site, with standard coronal temperature and density. When\napproaching the current sheet, though, these elements go through regions of\nlarge density gradients. The diffusion term included in the mass conservation\nequation becomes important, with characteristic timescale less than one\nminute, i.e., similar to the evolutionary time of the particles. The\nevolution that takes place then is effectively equivalent to a process of\nmixing across the density gradient with plasma elements coming from the dome,\nafter which their behavior is equivalent to that of population\n{A}. This kind of effective mixing is peculiar of population\n{D}: the density diffusion term is small for the elements of the other\npopulations. A proper study of the evolution of this population must\ntherefore await a numerical experiment with much higher spatial resolution\nand correspondingly small numerical diffusion (see also the discussion in\nSection~\\ref{sec:disc_limitations}).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{The acceleration of the surge}\\label{sec:dyn} \n\nWe turn now to the dynamics of the surge and study the acceleration of the\nplasma elements first during the launch phase (Section\n\\ref{sec:accel_launch}) and then when they are near the apex of their\ntrajectory (Section \\ref{sec:accel_apex}).\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Acceleration during the launching phase}\\label{sec:accel_launch}\n\nThe initial acceleration of the mass elements of the surge takes place when\nthey are not far from the thin current sheet that covers the top-left region of the dome (Section\n\\ref{sec:current_sheet}).  In this region, the Lorentz force may reach values\nwell above gravity because of the high curvature of the magnetic field lines after\nreconnection. The gas pressure gradient may also reach large values\nbecause of the low values of the magnetic field at the center of the current\nsheet. For an estimate, call ${a_L^{}}$ and ${a_p^{}}$ the acceleration associated with those\nforces, use ${L_B}$ as given in Equation~(\\ref{eq:lb}) and define ${L_P}$ as the\ncorresponding length scale of variation of the gas pressure. One obtains:\n\n\\begin{eqnarray}\n\t\\left | \\frac{{a_L^{}}}{{g_\\odot^{}}} \\right |\\; &=& \\;\n        \\frac{v_a^2}{2\\, L_{B}\\, {g_\\odot^{}}} \\;\\approx\\; \n        18\\,\\frac{({v_a})_{\\rm 100}^2}{({L_B})_{\\rm Mm}^{}} ,\n\t\\label{eq:aL}\\\\\n\n\\noalign{\\vspace{3mm}}\n\n\t\\left | \\frac{{a_p^{}}}{{g_\\odot^{}}} \\right | \\; &=& \\;\n           \\frac{c_s^2}{\\gamma\\, {L_P}\\, {g_\\odot^{}}} \\; \\approx \\; \n        22\\,\\frac{({c_s})_{\\rm 100}^2}{({L_P})_{\\rm Mm}^{}} ,\n\\label{eq:aP}\\\\ \\notag\n\\end{eqnarray}\n\n\n\\noindent where the subindices ``$100$'' and ``Mm'' indicate\nvelocities measured in units of $100$ km s$^{-1}$ and lengths measured\nin Mm, respectively, and $v_a$, $c_s$, ${g_\\odot^{}}$ and $\\gamma$ have their\ncustomary meaning (Alfven and sound speed, solar gravity, and ratio of\nspecific heats, respectively).  In the reconnection region, the\ncharacteristic lengths are substantially smaller than $1$ Mm and\neither the Alfven velocity or the sound speed (or both) are of order\n$100$ km s$^{-1}$. Equations~(\\ref{eq:aL}) and (\\ref{eq:aP}) tell us,\ntherefore, that ${a_L^{}}$ and ${a_p^{}}$ can easily exceed ${g_\\odot^{}}\\,$; in fact,\nin some extreme cases they reach values of a\nfew times $100\\ {g_\\odot^{}}$ for a short period of time.\n\n\n\n\\begin{figure}\n  \\epsscale{1.25} \\centerline{\\plotone{Figure_08.pdf}}\n\\caption{The vertical acceleration components ${a_{L_{z}}^{}}$\n  and ${a_{p_{z}}^{}}$ in units of ${g_\\odot^{}}$, in red and blue\n  respectively, of the same representative plasma elements\n  used in Figure~\\ref{dynamics_4}. The panels illustrate the\n  high acceleration of the plasma during the launch of the\n  cool ejection.\n\\label{new_dynamics}}\n\\end{figure} \n\n\n\nFigure~\\ref{new_dynamics} shows the vertical acceleration\ncomponents ${a_{L_{z}}^{}}$ (red) and ${a_{p_{z}}^{}}$ (blue) for the\nrepresentative Lagrangian elements used in\nFigure~\\ref{dynamics_4}. We note the following behavior: \n\n\n\n\n\\begin{itemize}\n\n\n\n\\item In Section~\\ref{sec:popstandard} we saw how the elements of population\n  {A}\\ pass near, even though not quite through, the current\n  sheet. In the top-left panel of Figure~\\ref{dynamics_4} we see how, in that\n  phase, they are ejected by the Lorentz force with accelerations of tens of ${g_\\odot^{}}$. \n  We also note the close relationship between the dynamic and\n  thermodynamical changes (compare this panel with the corresponding\n  one in Figure~\\ref{dynamics_4}).\n\n\\item In the case shown in the top-right panel (population\n  {B}), the element is ejected upward in a short time\n  interval around $t = 58.5$~min. The acceleration values are extreme\n  in this case, reaching ${a_{L_{z}}^{}}/{g_\\odot^{}} = 6.4\\times 10^2$ and\n  ${a_{p_{z}}^{}}/{g_\\odot^{}} = -3.5 \\times 10^2$ and last for about $10$~s. Those\n  values result from the fact that the element is going through the\n  current sheet at that point and the characteristic lengths are\n  correspondingly small, ${L_B} = 40$ km and ${L_P} = 50$ km (compare\n  these lengths with those shown in Figure~\\ref{lb_current}).\n\n\n\\item The elements in Population {C}, like the one shown in\n  the left-bottom panel, are the furthest away from the\n  current sheet and their characteristic lengths are the\n  largest ones. As a consequence, the acceleration values\n  are lower than for other populations but are,  anyway, typically a few to\n  several times ${g_\\odot^{}}$. \n  The plasma in this population is dragged by the magnetic field following the highly dynamical motion\ninitiated in the current sheet and the gas pressure does\nnot play any important role. \n\n\n\\item The right-bottom panel shows an element from Population\n  {D}. The large pressure gradients in the boundary between\n  the corona and the current sheet lead to a small characteristic\n  length ${L_P} = 100$ km and to the predominance of ${a_{p_{z}}^{}}$ compared\n  to ${a_{L_{z}}^{}}$. The  extreme values of the acceleration in this case are around\n  ${a_{L_{z}}^{}}/{g_\\odot^{}} = -0.8\\times 10^2$ and ${a_{p_{z}}^{}}/{g_\\odot^{}} = 1.6\n  \\times 10^2$, and last for about $20$~sec.\n\n\n\n\\end{itemize}\n\nIn the foregoing we have proved that the Lorentz force and gas\npressure gradients in the region at and near the current sheet can\neasily cause substantial accelerations of tens to hundreds of ${g_\\odot^{}}$. This\nmay seem quite large, but it is naturally associated with \nthe fact that the plasma elements must jump by, in some cases, $6$ Mm\nin height (from the top of the dome to the top of the resulting surge,\ncheck Figure~\\ref{wall}) in a matter of, say, one minute. As an\nelementary calculation shows, sustained accelerations of several times\n${g_\\odot^{}}$ (or impulsive accelerations of from tens to hundreds of\ntimes ${g_\\odot^{}}$) ought to be expected.  \n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsubsection{Acceleration near the apex of the trajectories}\\label{sec:accel_apex}\n\n\n\\begin{deluxetable}{ccccc}\n\\tablecolumns{5}\n\\tablecaption{Statistical moments of the three\n  distributions of\n  Figure~\\ref{ace_histo}.  \\label{table2}} \\tablehead{\n  \\colhead{Curve} & \\colhead{$t - t_{apex}$~(min)} &\n  \\colhead{Mean $/ {g_\\odot^{}}$} & \\colhead{${\\sigma_{\\rm st\\, dev}} / {g_\\odot^{}}$} \n  &  \\colhead{Mode $/ {g_\\odot^{}}$}\n} \\startdata\nBlack & [-1,1] & -0.99 & 6.3 & -1.1 \\\\\n\nRed & [-2,2] & -0.48 & 6.6 & -1.1 \\\\\n\nBlue & [-3,3] & \\ 0.18 & 11.\\hbox to 3mm{\\hfill}  & -1.0  \\enddata \n\\end{deluxetable}\n\n\n\nWe examine now the acceleration of the plasma elements\nduring the central period of development of the surge, namely \nwhen the Lagrange elements are close to the apex of their\ntrajectories. To do this, we call \n$t_{apex}$ the time when each individual element reaches its maximum\nheight and \nuse $t - t_{apex}$ as time variable. Figure~\\ref{ace_histo} contains\nthree histograms for the vertical accelerations of the plasma elements\nfor $|\\,t - t_{apex}| = 1$~min (black curve), $2$~min (red curve), and\n$3$~min (blue curve). Additionally, we have carried out a statistical\nstudy using the sample of the vertical accelerations of all elements\nduring the indicated time intervals with a cadence of $0.2$~s.\nThe basic moments of the statistical distribution and their mode\nare given in Table \\ref{table2}. \nThe three distributions are highly peaked (positive kurtosis) and their most\nfrequent value (the mode) is very near $-{g_\\odot^{}}$ in all cases. The mean of the\nmost representative histogram (black curve) also coincides with\n$-{g_\\odot^{}}$. Yet, the distributions are not narrow, with standard deviations\nranging from $6\\,{g_\\odot^{}}$ to $11\\,{g_\\odot^{}}$. Also: as wider time ranges around $t_{apex}$\nare chosen (red and blue curves), upward accelerations linked to the launch\nphase are more frequently represented and the mean of the distributions\nthen shifts toward positive values. \n\n\n\\begin{figure}[h]\n\\epsscale{1.25} \\centerline{\\plotone{Figure_09.pdf}}\n\\caption{Histograms of the vertical accelerations for a time interval\n  around the apex of the trajectories $|\\,t - t_{apex}| = 1$~min (black curve), \n  $2$~min (red curve), and $3$~min (blue curve). The vertical\n  lines mark $-{g_\\odot^{}}$ (thick) and the zero acceleration value\n  (thin). The statistical properties of these distributions are collected in\n  Table \\ref{table2}. \\label{ace_histo}}\n\\end{figure}\n\n\n\n\n\n\n\n\\begin{figure}\n\\epsscale{1.20}\n\\centerline{\\plotone{Figure_10.pdf}}\n\\caption{Double PDF plots for the temperature ${T}$ and either the\n  vertical velocity $u_z$ (upper panels), or the density $\\rho$ (lower\n  panels) of the Lagrangian elements. \\label{velocidades}}\n\\end{figure}\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{Further properties: velocity, temperature and density}\\label{sub:velocities}\n\nWe describe now some further properties of the ejecta:\nvelocities, temperatures and densities.\nFigure~\\ref{velocidades} contains double PDF plots for the\nvertical velocity $u_z$ (upper row), and the density $\\rho$\n(lower row) versus the temperature, ${T}$, of the Lagrangian\nelements. The panels illustrate representative phases of the\nsurge: the launch phase (A panels); and the instant where\nthe surge reaches its maximum vertical extent (B panels).\n\n\n\n\n\\begin{itemize}\n\n\\item In the A panels we see that the majority of the plasma elements\n  have cold temperatures (close to $2 \\times 10^3$~K), densities\n  around $10^{-13}$ g cm$^{-3}$, and velocities of a few tens of km\n  s$^{-1}$: these are elements located in the dome at that\n  time. Further,  there is a group of elements clustered at a\n  temperature of $6$ to $7$ thousand K, possibly near the phase of\n  hydrogen {ionization/recombination\\hskip 2pt}, with small, positive velocities\n  also of tens of km s$^{-1}$. This group contains a mixture of\n  elements that have reached that temperature either through heating\n  of cold plasma (Population {A})  or\n  cooling of hot plasma (Populations {B}\\ and {D})\n  through the action of the different entropy sources.\n  Additionally, in the density panel there are two extended tails\n  of elements toward higher temperatures and velocities. Those\n  elements correspond to, on the one hand, hot, low density\n  Population-{D}\\ plasma originating in the corona, and, on the other hand, denser plasma from Population\n  {B}\\ undergoing its heating-cooling phase. As we saw in\n  Section \\ref{sec:accel_launch}, the elements of Populations {B}\\ and\n  {D}\\ suffer the largest accelerations and, as a\n  consequence, the range of velocities is between 20-150 km\n  s$^{-1}$. \n\n\n\n\\item The B panels in the figure \n  are representative of the phase of maximum vertical\n  development of the ejection. We see that basically the\n  whole ensemble is already falling, albeit with small\n  velocities ($|u_z| < 30$ km s$^{-1}$). Concerning the\n  temperatures, there is an important concentration of\n  particles at the temperatures of hydrogen\n  {ionization/recombination\\hskip 2pt} (around $6\\times10^3$~K),\n  {ionization/recombination\\hskip 2pt} of \\ion{He}{1}/\\ion{He}{2} (around ${T} \\sim\n  10^4$~K, label ``4'') and, to a lesser extent, of \\ion{He}{2}/\\ion{He}{3} \n  (around ${T} \\sim 2 \\times 10^4$~K, label ``5'') -- see\n  also the discussion about this issue in\n  Section~\\ref{sec:disc_limitations}. The density range for this phase\n  of the cool surge is between $10^{-14}$ and\n  $10^{-11}$~g~cm~$^{-3}$. In the later phases of the surge, the\n  velocities continue in the range of a few to tens of km~s$^{-1}$. \n\n\\end{itemize}\n\n\n\nThe resulting global picture of the surge during its\nmain development phase corresponds to plasma with velocities of tens\nof km~s$^{-1}$.\nThe temperatures tend to be \n$0.6-1\\times10^4$~K (but with a small population which have retained\ntheir original cold temperature of a few thousand K) and the densities\nare in a large range between $10^{-14}$ and $10^{-11}$ g cm$^{-3}$.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\section{The detachment of the cool ejection from the dome}\\label{sec:the_cleft} \n\\begin{figure}\n\\epsscale{1.2}\n\\centerline{\\plotone{Figure_11.pdf}}\n\\caption{Left: Map of the velocity field divergence, $\\nabla\n  \\cdot$\\textbf{\\textit{u}}. Only the pixels where $\\nabla\n  \\cdot$\\textbf{\\textit{u}} $ < -0.5 $~s$^{-1}$ are shown in\n  color. Pink and blue contours are the same that in\n  Figure~\\ref{wall}. The magnetic field is superimposed as\n  black lines while the velocity field in the detachment\n  region is shown with red arrows. Right: Zoom out for the\n  previous panel to highlight the shock\n  region. The horizontal black line is the cut used \nin Figure \\ref{fastshock} to study the fast shock.\\label{cleft}}\n\\end{figure}   \n\n\nLooking back at Figure~\\ref{sec:cold_wall}, we realize that\nfrom panel D onward the ejecta adopt the shape of a detached\n{\\it wall}, a cool and dense wall. Going a little earlier in\ntime (panel C), we locate the origin of the detachment in\nthe fact that the dome is being split in two at $x\\approx\n11$ Mm, the process taking place mainly between $z\\approx 4$\nand $z\\approx 6$ Mm. The appearance of this {\\it cleft} is\nespecially noticeable following the blue temperature\ncontour (${T} = 3 \\times 10^4$~K). In\npanels D and E, the detachment is seen to be\ncomplete and the ejecta are from then on a separate\nwall-like structure.\n\nThe explanation of this phenomenon lies in the formation of a series of\nshocks above the dome starting at $t \\approx 59$~min (check also the\ndensity and temperature evolution shown in the accompanying Movie 1).\nSuccessive blobs of plasma coming up from the reconnection site along the top\nof the dome impinge on the surge. Strong shocks are created that deform and\nredirect plasma in the blob, last for a brief period of time and then\nweaken. A new \nblob arrives and creates again a shock system of the same kind.  To\nillustrate the shock region in one of these collision events,\nFigure~\\ref{cleft} (left panel: general view; right-panel: blow-up of the\nshock region) shows a map of the divergence of the velocity field, $\\nabla\n\\cdot$\\textbf{\\textit{u}}, thus signposting the locations where a large\ncompression is taking place. Further, the figure contains the blue ($3 \\times\n10^4$~K) and pink ($1.2 \\times 10^6$~K) isotemperature contours of\nFigure~\\ref{wall}, and a collection of field lines drawn as black\ncurves. Also, the arrows show the velocity field in the detachment region,\nbetween the hot jet and the cool ejecta.\n\n\nFrom the color map we see that the shock front has a wedge-like or arrowhead\nshape, which is a common feature of the successive shocks seen during the\ndetachment phenomenon. The shocks cause high levels of compression and\nheating of the plasma going through it. The two sections of the arrowhead\nshow distinctive features: the upper part, which is roughly horizontal and\nnearly perpendicular to the field lines in the postshock region, resembles a\nslow-mode shock almost of the switch-off kind. This could be related with the\nslow-mode shocks generated when plasmoids collide with the ambient magnetic\nfield after being ejected, as illustrated by\n\\cite{YangL2013}. This shock is directly related with\n  the hot jet: it is located at the base of the latter (see the pink\n  contours) and the plasma goes through it before flowing along the horn-like\n  jet field lines. We leave its study for a follow-up paper dealing with the\n  properties of the hot jet. \n\n\n\\begin{figure}\n\\epsscale{1.20}\n\\centerline{\\plotone{Figure_12.pdf}}\n\\caption{Jump relations along the horizontal black line\n    in the right panel of Figure \\ref{cleft}. The auxiliar vertical lines enclose\n    the compression region where $\\nabla \\cdot$\\textbf{\\textit{u}} $\\leq\n    -0.2$ s$^{-1}$.  Panel A: Magnetic field $B_x$ and $B_z$ in G. Panel B:\n    Temperature $T$ normalized to $4 \\times 10^5$ K, gas pressure $P_g$ in\n    erg cm$^{-3}$, and density $\\rho$ normalized to $10^{-13}$ g\n    cm$^{-3}$. Panel C: characteristic times for the Spitzer conductivity,\n    $\\tau_{Spitz}$, and the optically thin losses, $\\tau_{Thin}$, in\n    seconds. Panel D: velocities $u_x$ and $u_z$ in km\n    s$^{-1}$. \\label{fastshock}}\n\\end{figure}   \n\nThe lower, almost vertical branch of the wedge, in turn, is a shock directly\nassociated with the detachment process studied in this\nsection. The field lines cross it but subtending only a\n  small angle to the tangent direction to the shock front. $\\nabla\n  \\cdot$\\textbf{\\textit{u}} has high compression values of about\n  $-0.8$~s$^{-1}$, sometimes reaching even $-3.0$~s$^{-1}$. Plasma traverses\n  the structure from the left. Figure \\ref{fastshock} shows the profiles\n  across the shock for a number of relevant variables. To that end, we plot\n  those variables along the horizontal black line plotted in the right panel\n  of Figure \\ref{cleft}.  The $B_z$ component (panel A) is not far from the\n  perpendicular component of the field to the front normal. This component\n  increases by a factor of 2 in absolute value across the shock, which\n  suggests that the shock is a moderately strong, fast shock. This is also\n  supported by the fact that the quasi-parallel component of the velocity\n  ($u_z$, panel D) does not change substantially across the shock, whereas\n  the normal velocity changes by a factor 2, approximately.  The temperature\n  has a suggestive profile (panel B), that we can understand with the help of\n  the entropy sources (panel C). In the first half of the shock the\n  temperature increases, mostly because of the compression work experienced\n  by the plasma element when entering the shock. In the center and final half\n  of the shock, however, $T$ reaches a plateau and decreases: this is\n  probably due to the action of the heat conduction (to a limited extent also\n  of the optically thin radiation cooling): the characteristic cooling time\n  scales are low ($4$ s for the former, see panel C), and fit with the\n  duration of the transit of the plasma across the shock if one takes into\n  account the motion of the front as a whole. Finally, the density increases\n  by a factor $5$ (panel B), which is larger than the maximum allowed for\n  adiabatic shocks: the large compression ratio is reached thanks to the\n  entropy decrease due to the non-adiabatic effects.  As a further\n  consequence of the heat conduction, the thermal energy is distributed\n  efficiently along the individual field lines well beyond the shock itself,\n  giving rise to the structure along the cleft that marks the boundaries of\n  the cool ejection and lets it appear as a separate domain. The velocities\n  involved in the shock, panel D, are on the order of a hundred km s$^{-1}$.\n \n\n\n\n\n\n\nThe plasma diverted downward after crossing the vertical section of the shock\npenetrates deeper into the underlying dome as successive shock systems are\nformed. When the last one in the series ends ($t \\approx 61$~min, Panel F of\nFigure~\\ref{wall}), the surge is completely detached from the remnants of the\ndome on the left. The hot plasma domains at that time have the classical\ninverted-Y or Eiffel-tower shape commonly seen in observations, with one of\nthe legs of the tower coinciding with the {\\it cleft}. Meanwhile, the cool\nsurge enters the decay phase following the swaying motion explained at the\nbeginning of Section \\ref{sec:cold_wall}.  Both the hot and cool ejections\nfinally disappear almost simultaneously at around $t = 66$~min.\n\n\n\n\n\n\n\n\n\n\n\n\\section{Discussion}\\label{sec:5}\n\nWe have performed a 2.5D radiative-MHD numerical experiment of emergence of\nmagnetized plasma through granular convection and into the atmosphere. The\ntime evolution of the system leads to the ejection of part of the emerged\nmaterial as a cool and dense surge. The experiment was done with the Bifrost\ncode, which includes a realistic multi-component equation of state as well as\nmodules for photospheric and chromospheric radiation transfer, heat\nconduction and optically-thin radiative cooling in the corona. In the\nfollowing we first provide a comparison with observational data \n(Section \\ref{sec:disc_observations}) and then discuss the relevance of some of\nthe entropy sources not included in the flux emergence experiments so far\n(Section \\ref{sec:disc_sources}). The final paragraphs point out a number of\nlimitations of the present experiment that may be overcome in the\nfuture (Section \\ref{sec:disc_limitations}).  \n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{Observations}\\label{sec:disc_observations}\nA first block of quantities that can be compared to observations concern the\nsize, timescale and kinematic properties of the surge. A more in-depth\ncomparison must be done through a-posteriori synthesis of different spectral\nlines based on the numerical boxes. However, the most important spectral\nlines that one could use for this comparison (like {H$\\alpha$}, {\\ion{Ca}{2}}\\ H+K or\n{\\ion{He}{2}  $10830$\\,${\\textup{\\AA}}$}) require careful treatment including NLTE aspects; this\nkind of approach must therefore be left for future work.\n\n\nThe height of the surge in our experiment varies considerably in the\ndifferent stages of the evolution. At the time of maximum development, the\nejecta constitute a vertically elongated object with height about $13$ Mm and\nwidth about $2$ Mm. The observed length (see Section~\\ref{sec:introduction})\nfalls typically in the interval $10$ - $50$ Mm, so the height of our surge is\nwithin the observed range, even though toward its lower limit. This fits with\nthe fact that the experiment deals with a simple emergence event into a\ncoronal hole, whereas many classical observations refer to surges measured in\nthe context of flare episodes in active regions, which involve a larger\namount of magnetic flux and where larger structures should be expected. The\ncool ejection in our experiment lasts for about $7 - 8$ min, which, again, is\ntoward the lower limit of the observed durations (several minutes to one\nhour, \\citealt{Jiang2007}, \\citealt{Vargas2014}).  Regarding the velocities,\nalthough high velocities of up to $150$ km s$^{-1}$ can be reached along the\nlaunch phase, during most of the surge evolution the mass elements have\nrising or falling velocities below $50$ km s$^{-1}$, and the ejection is not\ncollimated.  The observations, in turn, yield a velocity range of $10 - 200$\nkm s$^{-1}$, as inferred mainly from {H$\\alpha$}\\ measurements\n(\\citealp{roy1973}, \\citealp{canfield1996}, \\citealp{Chae1999},\n\\citealp{Jibben2004}, \\citealp{Uddin2012}, \\citealp{nelson2013},\n\\citealp{Vargas2014}, among others), which is compatible with the results of\nthe experiment.\n\nConcerning the acceleration, in the experiment we have detected two different\npatterns of behavior: (1) during the launch phase, the mass elements suffer\nlarge accelerations, well in excess of solar gravity; (2) when near the apex\nof their individual trajectories, the acceleration values are remarkably\nclose to ${g_\\odot^{}}$. There is no definitive observational value to use for a\ncomparison here: in the paper by \\citet{roy1973}, the author reports a fast\nrising phase for the surge with acceleration of $0.24 - 2.1$ km s$^{-2}$,\ni.e., roughly $1 - 10\\ {g_\\odot^{}}$. Observed values for the acceleration at the\ntime of maximum and in the decay phase are more difficult to obtain. In their\nrecent paper, \\cite{nelson2013} detected an apparent parabolic trajectory for\nthe cool ejection in their study, but no particular value for the\nacceleration was given.\n\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{The relevance of the entropy sources}\\label{sec:disc_sources}\n\nAn adequate treatment of the entropy sources and sinks in the energy\nequation, or, more generally, of the material properties of the plasma, like\nits EOS, is important when studying the formation and time evolution of the\ncool ejections. Thanks to the possibilities afforded by the\nBifost code and to an extensive Lagrange tracing of the mass elements of the\nsurge, we have been able to distinguish different patterns of behavior among\nthem and group them into separate populations. One of those populations,\nPopulation {B}, provides a good illustration in that sense. That\npopulation covers $34$\\% of the surge cross section at the time of maximum\ndevelopment.  It reaches high temperatures, between $10^5$ and\n$10^6$ K, typically when going through the current sheet, but is then brought\nback down to classical surge temperatures of order $10^4$ K thanks to the\naction of the radiation losses and thermal conduction terms. This population\ncould not be obtained in more idealized experiments, like those of\n\\citealp{Yokoyama:1996kx}, \\citealp{Nishizuka:2008zl}, \\citealp{jiang2012},\n\\citealp{Moreno-Insertis:2013aa}. The first authors, for instance, find that\nthe material in the surge structure is not heated significantly along its\nlife (which would roughly correspond to the behaviour of our populations\n{A}\\ and {C}). Instead, we find that a non-small amount of the\nplasma in the surge suffers heating/cooling processes that lead them to high\ntemperatures during a fraction of its life. This explains part of the\nstructural properties of the modeled surge and may also be of interest\nconcerning its detection.   \n\nThe importance of a proper treatment of the entropy sources and of the\nequation of state may also apply to other cool ejections such as the\nmacrospicules. Chromospheric material and hotter, transition-region material\nprobably coexist in these objects, as indicated by their detection both in\n{H$\\alpha$}\\ and in the EUV line {\\ion{He}{2}  $304$\\,${\\textup{\\AA}}$}. However, the numerical\nexperiments in the literature \\citep[e.g.][]{Murawski2011,Kayshap2013} are of\nthe idealized kind, so, while possibly capturing various basic features of the\nmacrospicule phenomenon, they may also miss important aspects. \n\n\n\n\n\n\n \n \n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{The progress toward realism in the theoretical modeling of surges\n  following from flux emergence}\\label{sec:disc_limitations} \n\nThe essential component in the observed solar surge phenomenon is plasma with\nchromospheric temperatures and densities, as follows from their detection in\nspectral lines like {H$\\alpha$}, {\\ion{Ca}{2}}\\ H+K, {\\ion{Ca}{2}}\\ 8542 ${\\textup{\\AA}}$ or\n{\\ion{He}{2}  $10830$\\,${\\textup{\\AA}}$}. Like for other important phenomena of the low solar\natmosphere (prominences are a prime example for this), their theoretical\nstudy is intricate because of the difficulties of coping with the\nmaterial properties of the chromospheric plasma. All previous numerical\nstudies of surges following from flux emergence were done on the basis of\nhighly idealized models, without radiation transfer nor a multi-component\nequation of state with realistic abundances, partial ionization processes,\netc.  Our present paper constitutes a large step forward in that direction,\ngiven the degree of realism of the material modules of the Bifrost code, as\nexplained in Section~\\ref{sec:bifrost}. In the following we first compare our\nresults with those of the 3D experiment of\n\\citet{Moreno-Insertis:2013aa}. Then, a few limitations of the present\nexperiment are discussed, namely the presence in flux emergence models of cool and\ndense plasma domains in the low atmosphere, the effects of partial\nionization on Ohm's law and the lack of {ionization/recombination\\hskip 2pt}\nequilibrium in processes occurring on short timescales.\n\nOur approach allowed us to gain new insights compared with previous idealized simulations of the ejection of cool surges, even with the recent 3D experiment by \\citet{Moreno-Insertis:2013aa}.  Major differences between the two experiments come from the inclusion in our case of detailed material properties, radiation transfer and heat conduction, which have allowed us, e.g., to discern different plasma populations that later constitute the cool surge, or to study the initial interaction of the rising plasma with realistic granulation, or to identify the process of detachment and decay of the surge. In a 2D experiment one can reach much higher spatial resolution, which facilitates the study of many aspects difficult or impossible to consider in a 3D problem, like the formation and evolution of plasmoids or the shock structures associated with the jets. Finally, our Lagrange tracing has an extremely high cadence (thanks again to the reduced storage demands of a 2D experiment), and this is advantageous when pursuing the motion of the plasma elements across regions with strong gradients. On the other hand, various general properties of the surge in this paper are in agreement with the simulation of \\citet{Moreno-Insertis:2013aa}: being three-dimensional, the cool ejecta in their experiment had the shape of an almost circular plasma wall with chromospheric density surrounding the emerged region, even if the largest concentration was found at the base of the hot jet. There, the cool domain had a height ($\\sim 10$ Mm), similar to that obtained in the present 2.5D experiment, and width ($\\sim 6 $ Mm), which is wider than in the present paper, perhaps because of the lack of realistic convection cells in their experiment, which can modify the horizontal sizes of the emerged structures. The surge velocities, around $50$ km s$^{-1}$, are also within the range given by those authors for their cool ejecta.\n\nWhen large magnetized plasma domains rise from the solar interior to the low\natmosphere, a dense and cold plasma dome is formed, as repeatedly shown in\nthe numerical experiments since the 1990s. At the interface between the dome\nand the overlying atmospheric material a large density gradient\narises. Numerical codes tend to smooth that sharp density contrast through\ndiffusion, in many cases via some explicit diffusion term, like in Bifrost,\nor, in a less controllable fashion, through the hidden, intrinsic diffusion\nof the numerical scheme, like in formally ideal MHD codes. Irrespective of\nwhether a process of mixing takes place in such interfaces in the actual Sun,\nany result associated with this diffusion in the theoretical models must be\nhandled with care. In our case, we have identified a family of plasma\nelements originating in coronal heights (population {D},\nSection~\\ref{sec:corona}) whose density is increased to a large extent via\nthis kind of diffusion process when they pass near the current sheet before\nbeing incorporated to the surge. The initial mass of this family is\nnegligible compared to the final mass of the surge; in some sense, that\nfamily is swallowed by the much more dense material coming from the dome, so\nthe qualitative (and, to a large extent, quantitative) properties of the\nfinal surge should be widely independent of the evolution of this particular\npopulation.  A different issue concerns the dome itself: the large\nexpansion associated with the rise leads it to adopt cold temperatures, below\n$2000$ K. The ad-hoc heating term mentioned in Section~\\ref{sec:2} is then\nactivated in the calculation to prevent the plasma from cooling to lower\ntemperatures, for which the radiation tables used by Bifrost become inaccurate\n\\citep[see][]{Leenaarts:2011qy}. The material of the surge originates\nessentially in the dome, so, in spite of the enormous advantages of the new\ngeneration of MHD codes compared with the previous idealized models, a fully\nrealistic treatment of the evolution of the surge in its formation stage must\nawait the completion of material modules for the codes adequate \nto the very cold plasma volumes in the low atmosphere.\n\nIn the same vein, another aspect that must be improved in future models of\nthe solar surges is the use of a generalized Ohm's Law incorporating partial\nionization effects. On the basis of the general results of\n\\cite{Leake:2006kx}, \\cite{Arber:2007yf}, \\cite{Martinez-Sykora:2012uq,\n  Martinez-Sykora2015} and \\cite{Leake:2013dq}, among others, we expect that\nthese effects may allow some slippage of magnetic field and plasma via\nambipolar diffusion and counteract to some extent the cold temperatures of\nthe rising dome.  This could affect the populations obtained in the surge,\nespecially Population {C}, see section~\\ref{sec:popcold}. As a final\nitem in the list of limitations in the realism of the current model, we\nmention here the lack of non-thermal equilibrium in the ionization/recombination\nprocesses of hydrogen and helium. As already proposed long ago\n\\citep{kneer_1980}, in chromospheric processes that occur on comparatively\nfast time scales (e.g., in shocks), the ionized species, especially hydrogen\nand helium, may take longer to recombine than predicted by\nlocal-thermodynamic-equilibrium (LTE) equations (see the recent results by\n\\citealt{Leenaarts:2007sf} and \\citealt{golding2014}). This problem is\nparticularly important if one tries to obtain a posteriori, i.e., on the\nbasis of the calculated computational boxes, synthetic spectra for the\nhydrogen or helium lines from plasma at temperatures around $6 \\times 10^3$ K\n(for H) or between $1$ and $2 \\times 10^4$ K (for He). However, the time\nevolution of the system itself may also be affected in a non-negligible way\nby this departure of LTE. The inclusion of the non-equilibrium effects into\nthe models of surges is therefore another improvement that must be\nincorporated in future extensions of the present work.\n\n\n\n\n\n\n\n\n\n\n\\ \\vspace{-2mm} \n\\acknowledgments We gratefully acknowledge financial support\nby the Spanish Ministry of Economy and Competitiveness (MINECO) through\nprojects AYA2011-24808 and AYA2014-55078-P, as well as by NASA through grants\nNNX11AN98G, NNM12AB40P and NNX14AI14G (HGCR grant) and contracts NNM07AA01C\n(Hinode) and NNG09FA40C (IRIS). The authors thankfully acknowledge the\ncomputer resources and the technical expertise and assistance provided at the\nLaPalma supercomputer installation (IAC, Spain) and at the Teide\nHigh-Performance Computing facilities (Instituto Tecnologico y de Energias\nRenovables, ITER, Spain), where the calculations presented in this paper were\ncarried out.  Use for test runs of the Pleiades cluster through the computing\nproject s1061 from NASA's HEC division is also acknowledged. Finally, the\nauthors are grateful to the members of the Bifrost development team for their\nhelp with the Bifrost code, and to the anonymous referee for his/her constructive comments.\n\n\n\n\n\n\n\n\n\\bibliographystyle{apj} \\bibliography{collectionbib}\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 23737, "prevtext": "\n\n\n\n\n\n\n\\title{The cool surge following flux emergence in a radiation-MHD experiment}\n\n\n\n\n\n\n\\author{D. N\\'obrega-Siverio \\altaffilmark{1,2}, F. Moreno-Insertis\\altaffilmark{1,2}, and J. Mart\\'inez-Sykora\\altaffilmark{3,4}}\n\\affil{$^1$ Instituto de Astrofisica de Canarias, Via Lactea, s/n, E-38205 La Laguna (Tenerife), Spain}\n\\affil{$^2$ Department of Astrophysics, Universidad de La Laguna, E-38200 La Laguna (Tenerife), Spain}    \n\\affil{$^3$ Lockheed Martin Solar and Astrophysics Laboratory, Palo Alto, CA 94304, USA}\n\\affil{$^4$ Bay Area Environmental Research Institute, Petaluma, CA, USA}\n\n\\email{dnobrega@iac.es, fmi@iac.es, juanms@lmsal.com}\n\n\n\n\n\n\n\n\\begin{abstract}\n  Cool and dense ejections, typically {H$\\alpha$}\\ surges,\n  often appear alongside EUV or X-Ray coronal jets as a result of the\n  emergence of magnetized plasma from the solar interior. Idealized numerical\n  experiments explain those ejections as being indirectly associated with the\n  magnetic reconnection taking place between the emerging and preexisting\n  systems. However, those experiments miss basic elements that can\n  importantly affect the surge phenomenon. In this paper we study the cool\n  surges using a realistic treatment of the radiation transfer and material\n  plasma properties. To that end, the Bifrost code is used, which has\n  advanced modules for the equation of state of the plasma, photospheric and\n  chromospheric radiation transfer, heat conduction and optically thin\n  radiative cooling. We carry out a 2.5D experiment of the emergence of\n  magnetized plasma through (meso)granular convection cells and the low\n  atmosphere to the corona. Through detailed Lagrange tracing, we study the\n  formation and evolution of the cool ejection and, in particular, the role\n  of the entropy sources: this allows us to discern families of evolutionary\n  patterns for the plasma elements. In the launch phase many elements suffer\n  accelerations well in excess of gravity; when nearing the apex of their\n  individual trajectories, instead, the plasma elements follow\n  quasi-parabolic trajectories with acceleration close to ${g_\\odot^{}}$. We show\n  how the formation of the cool ejection is mediated by a wedge-like structure\n  composed of two shocks, one of which leads to the\n  detachment of the surge from the original emerged plasma dome.\n\\end{abstract}\n\n\\keywords{magnetohydrodynamics (MHD) $-$ methods: numerical $-$  Sun: atmosphere $-$ \nSun: chromosphere $-$ Sun: corona $-$ Sun: flares}\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\section{Introduction}\\label{sec:introduction}\nCool, chromospheric-temperature ejections are key dynamical elements of the\nsolar atmosphere. Surges, in particular, usually appear in connection with\nmagnetic flux emergence episodes, in which they are often associated with\nhot, high-speed EUV or X-ray jets. Even though observationally known for\nseveral decades now, understanding of the surges has progressed slowly and\nthere are still many unsolved questions. First detections of chromospheric\nsurges date back to the 1940s, when they were described as\n{H$\\alpha$}\\ absorption markings related with bright eruptions (flares)\ncorresponding to outward velocities followed by inward motion\n\\citep{Newton1942,Ellison1942}. Further observational properties were\nobtained in the 1970s and 1980s (\\citealp{Kirshner1971}, \\citealp{roy1973},\n\\citealp{Cao1980}, \\citealp{Schmieder1984}, among others): the surges were\nseen as blue and red shifted absorptions in {H$\\alpha$}\\ that have a length of,\ntypically, $10-50$ Mm, and line-of-sight velocities of a few to several tens\nof km s$^{-1}$, reaching, in extreme cases, $100-200$ Mm and $200$ km\ns$^{-1}$ respectively. The surges were also observed in\n{\\ion{Ca}{2}}\\ \\citep{Rust1976}; a close relationship between {H$\\alpha$}\\ surges and EUV\nejections was found as well \\citep{Schmahl1981}.  Later, different\nobservations focused on the role of the magnetic field, suggesting that the\n{H$\\alpha$}\\ surges could be an indirect result of flux emergence processes and\nthe interaction (possibly reconnection) of the upcoming magnetized plasma\nwith the ambient coronal field (\\citealp{Kurokawa1993},\n\\citealp{Schmieder1995}, \\citealp{canfield1996}, \\citealp{Chae1999}). Those\nsuggestions were based mainly on the detection of the cool ejections next to\nemerging bipolar regions and quasi-simultaneously with hot coronal plasma\njets (observed in the EUV or in X-rays).  The high resolution observations of\nthe past decade \\citep[e.g.,][]{Yoshimura2003,Jibben2004, Brooks2007,\n  Jiang2007, Uddin2012, Vargas2014} have provided further evidence for the\nfrequent relation between magnetic flux emergence, chromospheric ejections\nand hot jets.  Other chromospheric-temperature ejections such as\nmacrospicules show some analogies with the surges: they are multithermal\nstructures observed mainly in {\\ion{He}{2}  $304$\\,${\\textup{\\AA}}$}\\ and {H$\\alpha$}, with a cool core\nsurrounded by a thin sheath of $1-2\\times10^5$~K \\citep[e.g.,][]{Bohlin1975,\n  Habbal1991, Pike1997, Madjarska2006, Bennett2015}.\n\n\nConcerning the theoretical effort, the seminal paper by\n\\citet{Heyvaerts1977} (see also \\citealt{forbes1984})\ndiscussed how the emergence of magnetized plasma from the\nsolar interior could lead to a conflict of magnetic\norientation with the preexisting coronal field and hence to\nreconnection and the ejection of hot plasma. Using this flux\nemergence paradigm, \\citet{Shibata1992a} and\n\\citet{Yokoyama:1995uq,Yokoyama:1996kx} then showed, through\na 2.5D numerical model with initial uniform coronal field,\nthat cool plasma could be ejected next to a hot jet as a\nconsequence of the emergence of magnetic flux from the\ninterior: the authors tentatively identified those cool\nejections with {H$\\alpha$}\\ surges and described them as resulting from {\\it\nthe sling-shot effect due to reconnection, which produces\na \\it whip-like motion} \\citep{Yokoyama:1996kx}. \nTheir cool surge had density around $10^{-11}$ g cm$^{-3}$,\nspeeds in the range $\\approx 50 - 90$ km\ns$^{-1}$, and maximum vertical size of several Mm. \nNonetheless, due to the computational limitations\nof the time, the corona used in the experiment had\nunrealistic values of density and temperature. Using the\nsame sort of setup but with more realistic coronal\nparameters, \\cite{Nishizuka:2008zl}, through morphological\nimage comparisons, suggested that the cool ejections\nassociated with flux emergence could be the cause for\njet-like features seen in {\\ion{Ca}{2}}\\ H+K\nobservations. The more recent flux-emergence experiment of\n\\cite{jiang2012} had a canopy-type configuration of the\nambient coronal magnetic field, and also led to the ejection\nof cool and hot plasma. A study in three dimensions of the cool\nejection following magnetic flux emergence has been\npublished only recently \\citep{Moreno-Insertis:2013aa}. This\nexperiment yielded a cool (from $10^4$~K to a few times\n$10^5$~K) and dense (between $10^{-12}$ and $10^{-13}$ g\ncm$^{-3}$) wall-like plasma domain surrounding the emerged\nflux region. Through Lagrange tracing, the\nauthors explained the formation of the wall through plasma\nwhich was being transferred from the emerged region attached\nto field lines that change connectivity in the main\nreconnection site. The cool\nejecta had speeds of typically less than $50$ km s$^{-1}$\nand were not collimated.\n\n\nAll those theoretical models, whether 2D or 3D, have been\nhelpful in providing basic indications for the mechanisms\nthat may lead to the simultaneous ejection of cold and hot\nplasma; nevertheless, they lack essential physical processes\nrelevant in the photosphere, chromosphere and corona, and\ncan therefore only be taken as first steps when trying to\nunderstand the physics of the surges. The aim of the\ncurrent paper is to provide a new perspective of the cool\nejections introducing some of those physical processes, like\nthermal conduction, photospheric and chromospheric radiative\ntransfer, optically thin radiative cooling and a realistic\nequation of state (EOS). To that end we use as computational\ntool the Bifrost code \\citep{Gudiksen:2011qy}. For a first\napproach, in this paper we are using a 2.5D setup. The initial phase of\nthe flux emergence process takes place through solar-like\ngranular convection, which influences the sizes of the\nresulting structures in the low atmosphere. We can study the\nsubsequent phenomena of reconnection and plasma ejection in\nthe atmosphere with high temporal cadence and spatial\nresolution, focusing on the formation, maximum development\nand decay phases of the surge. The study includes\ndetailed Lagrange tracing of the mass elements in the surge,\nwhich allows us to analyze in detail their origin and\nthermal evolution, the role of the various entropy sources\nand the acceleration mechanisms. We show that the cool and\ndense ejection is a complex and fascinating phenomenon in\nwhich the entropy sources play an important role.\n\n\n\\begin{figure*}\n\\epsscale{1.18} \\plotone{Figure_01.pdf}\n\\caption{Left: Horizontal averages for density $\\rho$, gas\n  pressure $P_{g}$, and temperature ${T}$ for the initial\n  stratification. The values are normalized to their\n  photospheric values at $z = 0$~Mm, namely, $\\rho_{ph} =\n  3.09 \\times 10^{-7}$~g cm$^{-3}$, $P_{g_{ph}} = 1.11\n  \\times 10^{5}$~erg cm$^{-3}$, and ${{T}}_{ph}=\n  5617$~K. The dotted horizontal line delineates the unity\n  and the vertical one, the solar surface. Right:\n  Temperature map for the initial background stratification\n  for heights between $z=-2.3$~Mm and $z=7.0$~Mm. Magnetic\n  field lines appear superimposed in black. The inflow\n  region where the tube has been injected is at $x=8$~Mm\n  (black arrow). The solar surface is roughly at $z=0$~Mm\n  (dashed horizontal white line). \\label{fig1}}\n\\end{figure*}  \n\nThe layout of the present paper is as follows. Section\n\\ref{sec:2} describes the physical and numerical model. In Section\n\\ref{sec:3} we show the initial phases of the experiment prior to the\ninitiation of the cool ejection. Sections \\ref{sec:cold_wall} and \n\\ref{sec:the_cleft} analyze the surge in detail\nthrough its various phases (ejection, detachment and decay), focusing on the heating\nsources, kinematics and dynamics of the plasma elements. \nFinally, Section \\ref{sec:5} contains the\ndiscussion and the summary.\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\section{The physical and numerical model}\\label{sec:2}\n  \n\\Needspace{5\\baselineskip}\n\\subsection{The numerical code}\\label{sec:bifrost}\n\nThe experiment we present in this paper has been run using the\nradiation-magnetohydrodynamics (RMHD) Bifrost code\n\\citep{Gudiksen:2011qy}. This code includes thermal conduction along the\nmagnetic field lines and radiation transfer adequate to the photosphere,\nchromosphere and corona; it takes into account entropy sources such as\nSpitzer thermal conductivity, optically thin cooling, and radiative losses by\nneutral hydrogen, singly-ionized calcium and magnesium, among others; details\nare provided in the papers by \\cite{Skartlien2000}, \\cite{Hayek:2010ac},\n\\cite{Gudiksen:2011qy}, \\cite{Leenaarts:2011qy}, and\n\\cite{Carlsson:2012uq}. The code also has an equation of state (EOS) that\nincludes the {ionization/recombination\\hskip 2pt} of the relevant atomic species. On the\nother hand, because of the validity range of the radiation tables in the\ncode, there is an ad-hoc heating term that forces the plasma to stay above\n${T} = 1660$~K \\citep[a discussion in detail concerning this term can be\n  found in the paper by][]{Leenaarts:2011qy}. The advantages of the Bifrost\ncode probably make the simulation in this paper the most realistic one to\ndate for the formation and dynamics of surges (but see the discussion\nconcerning various limitations of the present model in\nSection~\\ref{sec:disc_limitations}).\n\nThe description of the model underlying our experiment, is\ndivided into two parts: (1) the background\nstratification, numerical grid and boundary conditions and (2) the twisted\nmagnetic tube. \n\n\\Needspace{5\\baselineskip}\n\\subsection{Background stratification, numerical grid and boundary conditions}\nConcerning the background stratification, we started from a\npreexisting statistically stationary magnetoconvection\nconfiguration that includes in a self-consistent manner the\nuppermost layers of the solar interior, the photosphere, the\nchromosphere, the transition region, and the corona. The\nconvection patterns range between granular and mesogranular.\nThe corona has a temperature of about $1$ MK and a\nquasi-uniform vertical magnetic field of $10$ G in order to\nmimic a coronal hole medium. The initial magnetic field is\ncontained in the $x-z$ plane, with $z$ being the vertical\ncoordinate. The left panel in Figure~\\ref{fig1} shows the\nhorizontal averages for our initial condition for density\n$\\rho$, gas pressure $P_g$ and temperature ${T}$, all of\nthem normalized to their photospheric values at $z=0$~Mm,\nnamely, $\\rho_{ph} = 3.09\\times10^{-7}$~g cm$^{-3}$,\n$P_{g_{ph}} = 1.11 \\times 10^{5}$~erg cm$^{-3}$ and\n${T}_{ph}= 5.62\\times10^3$~ K. In the right panel we\npresent a 2D temperature map where a number of magnetic\nfield lines have been superimposed in black. In the image,\nthe granulation pattern is distinguishable through the\nvertical field concentrations in the convective downflows\nand through the horizontal field lines in the center of the\ngranules in the photosphere.\n   \nThe physical domain is $0.0$~Mm $\\leq x \\leq$ $16.0$~Mm and $-2.6$~Mm $\\leq z\n\\leq$ $14.4$~Mm, with $z=0$~Mm corresponding to the solar surface, or more\nprecisely, to the horizontal level where $< \\tau_{500} > = 1$.  The numerical\nbox has $512\\times512$ points in the ($x,z$) directions respectively. The\ngrid is uniform in the $x$-direction with $\\Delta x=31$~km, and non-uniform\nin the vertical direction in order to better resolve the lower\nphotosphere. The vertical grid spacing varies between $19$ km, reached in the\nphotosphere and chromosphere, and $90$ km at the top and bottom of the\ndomain. The boundary conditions are periodic in the horizontal direction. At\nthe top of the box characteristic boundary conditions \\citep[as described\n  by][]{Gudiksen:2011qy} have been chosen that suppress incoming waves so as\nto eliminate any signal reflexion while the plasma can leave the domain.\nAdditionally, the corona is expected to have temperatures of order $1$ MK but\nthe two-dimensional nature of this experiment prevents a self-consistent\nmagnetic heating resulting from photospheric field line braiding, as in the\n3D experiment of \\citet{Gudiksen:2005lr}. To alleviate this problem, a {\\it\n  hot-plate} is implemented at the top boundary, meaning a Newton cooling\nterm that forces the temperature in the boundary cells to stay fixed at\n$10^6$ K. For the bottom boundary the code uses a technique often implemented\nin magnetoconvection simulations \\citep[e.g.,][]{Stein1998, hansteen2007},\nnamely, it keeps the bottom boundary open so that plasma can go across it,\nand constant entropy is set in the incoming material to keep the convection\ngoing, while the rest of the variables is extrapolated.\n      \n\\Needspace{5\\baselineskip}\n\\subsection{The twisted magnetic tube}  \nIn order to produce magnetic flux emergence, we inject a\ntwisted magnetic tube with axis pointing in the $y$-direction,\nthe ignorable coordinate in this 2.5D experiment. The\ninjection is done through the lower boundary of the box\nfollowing the method described by\n\\citet{Martinez-Sykora:2008aa}. The longitudinal and\ntransverse components of the magnetic field in the tube have\nthe canonical form of a Gaussian profile with $r$-independent\npitch (e.g. \\citealp{fan2001}),\n \n\\begin{eqnarray}\n\tB_y & = & B_0 \\, \\exp \\left( - \\frac{r^2}{R_0^2}\n        \\right), \\label{eq:btube1}\\\\\n\n\\noalign{\\vspace{3mm}}\n\n\tB_{\\theta} & = & q \\, r \\, B_y\n        , \\label{eq:btube2}\\\\ \\notag\n\\end{eqnarray}\n\n\\noindent where $r$ and $\\theta$ are the radial and azimuthal coordinates\nrelative to the tube axis, $R_0$ is a measure for the tube radius, $q$ a\nconstant twist parameter, and $B_0$ the magnetic field in the tube\naxis. To favor the emergence, we inject the tube in an inflow region, namely\n$x_0=8.0$ Mm (marked with a black arrow in the right panel of\nFigure~\\ref{fig1}). The rest of the parameters are selected within the ranges\nthat lead to a coherent emergence pattern at the surface; the chosen values\nare presented in Table \\ref{table1}. The initial axial magnetic flux is\n$\\Phi_0 = 1.5 \\times 10^{19}$~Mx, which is in the range of an ephemeral\nactive region \\citep{Zwaan:1987yf}. This magnetic field configuration \nhas positive helicity. The field lines have pitch $\\Delta y_p = 2\\pi/q = 2.6$~Mm\n independently of the radius. In other words, all field lines execute two turns\n  around the axis along a distance of $5.2$ Mm. \n\n\n\n\n\n\\begin{deluxetable}{ccccc}\n\\tablecolumns{5} \\tablewidth{0pc} \\tablecaption{Parameters\n  of the initial twisted magnetic tube.\n\\label{table1}} \\tablehead{\n  \\colhead{$x_0$ (Mm)} & \\colhead{$z_0$ (Mm)} & \\colhead{\n    $R_0$ (Mm)} & \\colhead{$q$ (Mm$^{-1}$)} & \\colhead{$B_0$\n    (kG) } } \\startdata 8.0 & -2.9 & 0.16 & 2.4 & 19\n\\enddata\n\\end{deluxetable}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   \n\\Needspace{5\\baselineskip}\n\\section{Initial phases}\\label{sec:3}\n\n\\begin{figure*}\n\\epsscale{1.27} \\centerline{\\plotone{Figure_02.pdf}}\n\n\\caption{Grey-scale maps of the magnetic field strength for\n  the initial phases of the experiment. The horizontal\n  dashed line corresponds to the solar surface. In panel C,\n  we have indicated with labels 1 through 5 the different\n  fragments resulting from the initial tube. Panel D is\n  subdivided into two parts, above and below the thick blue\n  line: magnetic field lines are superimposed in red, but\n  only in the upper subpanel, to avoid blurring the\n  structures of the interior.  \\label{seccion3}}\n\\end{figure*}   \n\n\n\nWe call {\\it initial phases} the time interval when the\ninjected magnetic flux is rising through the convection zone\nand the photosphere until it reaches the low corona, or more\nprecisely, until an emerging plasma dome is formed, as\nexplained in Section~\\ref{sec:dome_3}. The initial phases\nshare similarities with previous RMHD experiments of\nmagnetic flux emergence (\\citealp{Cheung:2007aa},\n\\citealp{Martinez-Sykora:2008aa}, \\citealp{Tortosa2009}) and\nalso with more idealized MHD experiments\n(\\citealp{Yokoyama:1996kx}, \\citealp{Magara:2001aa},\n\\citealp{fan2001}, \\citealp{archontis2004},\n\\citealp{Moreno-Insertis:2008ms},\n\\citealp{Moreno-Insertis:2013aa}).  Figure~\\ref{seccion3}\nillustrates the module of the magnetic field, $B$, at four\ndifferent instants of the initial phases. In the following,\nwe explain the different panels of the figure.\n\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{Emergence through the convection zone}\nThe first stage of the rise of the magnetic tube is an expansion away from\nthe injection point with velocities of order $1$ km s$^{-1}$.  As the tube\nrises through the convection zone, it starts to develop a dumbbell shape that\nis easily identifiable because of the high field concentration on either side\nof the tube axis, panel A in Figure \\ref{seccion3}. Afterwards (Panel B), the\naction of the convection flows on the rising tube starts to be evident. They\ndeform and break the twisted magnetic tube into smaller fragments in the\nregions of strong shear, typically where the downflows hit the tube.  We can identify\nfive large fragments during the emergence process. One of the fragments of\nthe tube, the one tagged ``(1)'' in panel C, reached the surface\napproximately $35$~minutes after the initiation of the experiment. At that\ninstant, this fragment had a horizontal size of 1.3 Mm, i.e., on the order of\na granular size. Two further pieces, ``(2)'' and ``(3)'', get to the surface at\n$t \\sim$ $38$ and $43$~min respectively, although they are smaller than the\nprevious one. The fragments labeled ``(4)'' and ``(5)'' were strongly braked\nand pushed down by the convection downflows, and they do not reach the\nsurface. Most of the eruptive phenomena observed in the atmosphere after the\nemergence are associated with the first fragment, so we focus attention onto\nit in the following.\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{Anomalous granulation and buoyancy instability}\\label{anomal}\nOnce in the photosphere, in the transition between super-\nand sub-adiabatically stratified regions, the magnetized\nplasma starts to pile up, consequently increasing the\nmagnetic pressure. The enhanced pressure produces a sideways\ngrowth of the fragment leading to an anomalous granule of\nabout $2.6$ Mm horizontal extent (Figure~\\ref{seccion3},\npanel C, $x=7.4$ to $10$ Mm), which is twice the size it had\nwhen it reached the surface. Similar anomalous granulation\nrelated with flux emergence was found in the numerical\nexperiments by \\citet{Cheung:2007aa},\n\\citet{Martinez-Sykora:2008aa}, and \\citet{Tortosa2009}, and\nin the observations by \\cite{orozco2008},\n\\cite{Guglielmino:2010lr}, and \\cite{ortiz2014}, among others.\nThe later evolution of the anomalous granule occurs in the\nframe of the buoyancy instability\n\\citep{Newcomb:1961aa}, along the general lines described\nby \\cite{Tortosa2009} and, to some extent, \nalso in idealized models without radiation \n\\citep[see][]{Magara:2001aa, archontis2004, moreno-insertis_flux_2006, \nmurray_etal_2006}. In all those cases the development of the\ninstability allows the magnetized plasma to rise well above the photospheric \nheights. \n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{The emerged magnetized dome}\\label{sec:dome_3}\n\nFollowing the buoyancy instability, the plasma belonging to\nthe anomalous granule suffers a rapid expansion into the\natmosphere with radial velocities of $15$ km s$^{-1}$ at\nheights around 1 to 2 Mm. This expansion leads to the\nclassical dome (or mountain) formation already found in the\npast (see, e.g., \\citealp{Yokoyama:1996kx},\n\\citealp{archontis2004}, \\citealp{Moreno-Insertis:2013aa}\nand references therein). In panel D of Figure~\\ref{seccion3}\nwe show the early stages of the emerged dome, between\n$z=0$~Mm and $z=2$~Mm approximately. In the upper subpanel\n(above $z=0$, marked by a thick horizontal line in blue),\nmagnetic field lines are shown superimposed in red: they are\nseen to collect into compact field line bunches at the\nlocation of photospheric downflows. One of those bunches is\nlocated at $x \\approx 7.2$~Mm; the region between those\nlines and the left side of the dome corresponds to a current\nsheet that is described in Section~\\ref{sec:current_sheet}.\n\nAs the dome expands, and as expected for expansion phenomena in the\nchromosphere \\citep[e.g.][]{Hansteen+DePontieu2006, Martinez-Sykora:2008aa,\n  Tortosa2009, Leenaarts:2011qy}, the plasma temperature decreases\nsignificantly, reaching the lower limit allowed in our simulation explained\nin Section \\ref{sec:2}.  Simultaneously, the dome interior suffers a draining\nprocess owing to the gravitational flows that take place along the loop-like\nmagnetic field lines, as described by \\citet{Moreno-Insertis:2013aa}. The\ncombination of the expansion and the draining produces a density change from\nthe values during the first stages of the dome evolution ($10^{-11}$ to\n$10^{-12}$ g cm$^{-3}$) to values on the order of $10^{-14}$ g cm$^{-3}$ in\nlater phases.\n\n\n\n\n\n\n\n\n\n\\Needspace{5\\baselineskip}\n\\subsection{The current sheet: unsteady reconnection}\\label{sec:current_sheet}\n\n\n\nThe expansion of the dome pushes its magnetic field against\nthe preexisting vertical coronal magnetic field. This\ngenerates an orientation conflict on the left-hand side of\nthe dome, giving rise to a thin concentrated current sheet.\nIn Figure~\\ref{lb_current}, we illustrate the latter using\nas inverse characteristic length of the magnetic field\nvariation the quantity\n\n", "index": 1, "text": "\\begin{equation}\n\t{L_B}^{-1} = \\frac{ \\left| \\nabla \\times\n          \\hbox{\\textbf{\\textit{B}}} \\right| }{ \\left|\n          \\hbox{\\textbf{\\textit{B}}} \\right|}.\n\t\\label{eq:lb}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{L_{B}}^{-1}=\\frac{\\left|\\nabla\\times\\hbox{{{B}}}\\right|}{\\left|\\hbox{{{B}}}%&#10;\\right|}.\" display=\"block\"><mrow><mrow><mmultiscripts><mi>L</mi><mi>B</mi><none/><none/><mrow><mo>-</mo><mn>1</mn></mrow></mmultiscripts><mo>=</mo><mfrac><mrow><mo>|</mo><mrow><mo>∇</mo><mo>×</mo><mtext>𝑩</mtext></mrow><mo>|</mo></mrow><mrow><mo>|</mo><mtext>𝑩</mtext><mo>|</mo></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]