[{"file": "1601.08060.tex", "nexttext": "\nis solved numerically. Here, ${\\bf m}$ is the magnetization, $\\gamma$ the \ngyromagnetic ratio, and ${\\bf H}_\\text{eff}$ the effective\nfield, with contributions due to exchange, Zeeman, and demagnetizing\nenergies. The size of the discretization cell used depends on the system \nsize, ranging from 3 to 5 nm, but is always bounded by the exchange length, \n$\\Lambda = (2A/\\mu_0 M_s^2)^{1/2}\\approx 5$ nm, in the in-plane directions, and \nequals $\\Delta_z$ in the out-of-plane direction. The DW velocity is calculated  once the DW structure is in the steady state; thus, the total simulation time considered is at least 300 ns.\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{Fig2A_paperdynamics.pdf}\n\\includegraphics[clip,width=0.5\\textwidth]{Fig2B_paperdynamics.pdf}\n\\caption{(color online) $v(B_\\text{ext})$ curves for different strip geometries, where \nthe  VW is the equilibrium DW structure. (a) For two strips, both having the same\nwidth of $w = 240$ nm and in-plane cell size 5 nm, and different thicknesses $\\Delta_z = 10$ nm and \n$\\Delta_z = 20$ nm. (b) The same for a strip with $w = 768$ nm, $\\Delta_z = 15$ \nnm and in-plane cell size 3 nm. For 3 mT $\\leq B_\\text{ext} \\leq$ 3.1 mT the DW is unstable; the DW width\ngrows without bound.}\n\\label{fig:fig2_dynamics}\n\\end{figure}\n\n\n\n\\section{VORTEX WALL DYNAMICS}\n\\label{vortex}\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=0cm 0cm 0cm 0.5cm,clip=true,width=0.5\\textwidth]{Fig3_paperdynamics.pdf}\n\\caption{(color online) Vortex wall dynamics in a strip with $w = 240$ nm \nand $\\Delta_z = 10$ nm for $B_\\text{ext} = 1.5$ \nmT (i.e. above the Walker field $B_\\text{W} =1.2$ mT). \nThe DW dynamics repeats a cycle where the vortex core first moves out of the strip through\nthe top strip edge, forming an ATW, followed by the injection of a vortex core from the top edge \nwith the opposite polarity, which subsequently moves across the strip to the bottom edge, \nreversing the ATW magnetization. Then a vortex, again with a polarity opposite to that of\nthe previous one, is nucleated from the bottom edge, and moves to the top edge, again\nreversing the ATW magnetization. Then the same process repeats.}\n\\label{fig:fig3_dynamics}\n\\end{figure}\n \nThe vortex wall is a DW structure characterized by the chirality or sense of rotation of the vortex, and the core polarity $p$. The latter may assume two different values, $p=\\pm$1, corresponding to the two possible out-of-plane magnetization directions of the core. Vortex wall is the equilibrium DW structure within a wide range of $w$ and \n$\\Delta_z$\\cite{nosotrosequilibrium}, and thus it is a pertinent question to \nwhat extent the dynamics exhibited by it depends on the geometry of the strip.\nTo this end, in what follows, we consider some example cases, demonstrating\nthat already in relatively narrow strips, several different kinds of field-driven \nVW dynamics may be observed.\n\n\\subsection{Vortex wall dynamics in narrow strips}\n\nTo illustrate this, we start by considering the DW velocity $v$ as a function of\nthe applied field $B_\\text{ext}$. \n In Fig. ~\\ref{fig:fig2_dynamics} we show that quite different $v(B_\\text{ext})$ curves are obtained depending on $w$ and $\\Delta_z$. Fig.~\\ref{fig:fig2_dynamics} (a) \nshows that for a relatively narrow strip width $w$ = 240 nm, considering two different \nthicknesses ($\\Delta_z =$ 10 nm and $\\Delta_z =$ 20 nm) leads to clear differences \nin the $v(B_\\text{ext})$ curves already below the $\\Delta_z$ dependent Walker field. \nIn the case of $\\Delta_z=$ 10 nm, for very small fields $v$ increases linearly with $B_\\text{ext}$, a behavior \narising from steady VW motion with the vortex core assuming an off-centre position \nwithin the strip\\cite{reviewthiaville}. For $B_\\text{ext} \\geq$ 0.4 mT the vortex \ncore is expelled out of the strip due to the gyrotropic force\\cite{malozemoff1979}, \nleading to a TW, and to a sub-linear $v(B_\\text{ext})$ relation \\cite{reviewthiaville}. In contrast, \nfor the thicker strip with $\\Delta_z =$ 20 nm, the linear dependence of $v$ on \n$B_\\text{ext}$, originating from steady VW dynamics with the vortex core within the \nstrip, persists up to the Walker field. Notice also that for $B_\\text{ext}$ such \nthat the VW has transformed into a TW for $\\Delta_z =$ 10 nm, the TW velocity for \na given $B_\\text{ext}$ exceeds the corresponding VW velocity in the system with \n$\\Delta_z =$ 20 nm. This is likely due to the large energy dissipation associated \nwith the dynamics of the vortex core \\cite{malozemoff1979}.  \n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=0cm 0cm 0cm 0.5cm,clip=true,width=0.5\\textwidth]{w240_V_t10_B4_dynamics.pdf}\n\\caption{(color online) Vortex wall dynamics in a strip with $w=240$ nm and \n$\\Delta_z=10$ nm for  $B_\\text{ext}=4$ mT (above the Walker breakdown, $B_\\text{W}=1.2$ \nmT). Now the dynamics alternates between ATWs of different magnetization, \nwith its reversal mediated by either a vortex or an antivortex core moving across \nthe strip width.}\n\\label{fig:w240_V_t10_B4_dynamics}\n\\end{figure}\n\nAbove the Walker breakdown, $v$ drops dramatically as a consequence of  \nthe onset of periodic transformations between different types of DW structures. \nAn example of this behavior is shown in Fig.~\\ref{fig:fig3_dynamics}, where the VW \ndynamics for $B_\\text{ext}=$ 1.5 mT, exceeding the Walker field $B_\\text{W}$, is \nshown for a strip with $w =$ 240 nm and $\\Delta_z$ = 10 nm (see also Supplemental Material Movie 1 \\cite{SM}). Periodic \ntransformations between VW and ATW structures are observed, mediated by the\ntransverse motion of the vortex core across the strip width. Notice that here\nthe vortex core dynamics alternates between injection from the top and bottom \nedges, followed by its top-to-bottom and bottom-to-top propagation across the \nstrip, respectively. In Ref.\\cite{reviewthiaville}, the same geometry and $B_\\text{ext}$ were \nfound to always lead to vortex core injection from the top strip edge, followed \nby its ``downwards'' motion towards the bottom edge. We have checked that this \nis due to slightly different values of $M_\\text{s}$ and $A_\\text{ex}$ \n(i.e. $M_\\text{s}$ = $8 \\times 10^{5}$ A/m and $A_\\text{ex} = 10^{-11}$ J/m,\nrespectively) used in the simulations of Ref.\\cite{reviewthiaville}. \nGiven such sensitivity to small differences in the simulation conditions,\none may expect that also other kinds of VW dynamics may be observed.\n\nAn example thereof is provided in Fig.~\\ref{fig:w240_V_t10_B4_dynamics}, where\nthe same geometry as above (i.e. $w =$ 240 nm and $\\Delta_z$ = 10 nm) is\nconsidered for a larger driving field of $B_\\text{ext} = 4$ mT. Now, the\nDW exhibits transformations between VW, ATW and AVW structures, with the\nrepeated ATW magnetization reversal mediated by alternating nucleation and \npropagation across the strip of either a vortex or an antivortex core (see also Supplemental Material Movie 2 \\cite{SM}).\nThicker strips appear to lead to a smaller number of different periodicities.\nFor instance, for $w=240$ nm and $\\Delta_z=20$ nm, only two periodicities are\nobserved for $B_\\text{ext}>B_\\text{W}$, consisting of transformations between\nVW and ATW structures. While the ATW reverses its magnetization, the VW  structures exhibit alternating polarities but no change of chirality takes place (not shown). For some fields, also a nucleation of an antivortex in the edge \nof the strip is observed, followed by an vortex-antivortex annihilation process. Thus, already \nfor relatively confined geometries, the field driven VW dynamics is quite complex,\ngiven that different geometries and applied fields may lead to numerous different\ndynamical behaviors. \n\n\\subsection{Vortex wall dynamics in wide strips}\n\nIn the case of wider strips, the VW dynamics is even more complex. \nFig.~\\ref{fig:fig2_dynamics}(b) shows  the $v(B_\\text{ext})$ curve for a strip \nwith $w = 768$ nm and $\\Delta_z = 15$ nm. As can be seen, the resulting \n$v(B_\\text{ext})$ curve is very different to those observed for more narrow strips \n[Fig.~\\ref{fig:fig2_dynamics} (a)], and consists of six different regimes. \nAnalogously to more narrow strips, at low fields the velocity increases linearly \nwith $B_\\text{ext}$, with the vortex core assuming again a steady, $B_\\text{ext}$ \ndependent off-centre position.\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.45\\textwidth]{Fig4A_paperdynamics.pdf}\n\\caption{(color online) The trajectory $y_\\text c$ of the vortex core in the vicinity\nof the edge of the system for $w=768$ nm, $\\Delta_z= 15$ nm and $B_\\text{ext}= 1.5$ mT,\nillustrating the attraction-repulsion effect. The red line at $y_c=$ 0 corresponds to the strip edge. The inset shows an example\nof the DW configuration with the vortex core close to the edge of the strip.}\n\\label{fig:fig3_2_dynamics}\n\\end{figure}\n\nFor 0.6 mT $\\leq B_\\text{ext} \\leq 2.4$ mT, the $v(B_\\text{ext})$ curve initially\nexhibits a small, negative gradient, but looks otherwise essentially like\na plateau. Thus, the DW is able to maintain a relatively high velocity of\napproximately 250 m/s, while for more narrow strips [Fig.~\\ref{fig:fig2_dynamics}(a)]\nWalker breakdown leads to significantly smaller DW velocities for most of this\nrange of $B_\\text{ext}$. This behavior arises as a consequence of the vortex\ncore moving towards the strip edge due to the gyrotropic force, but contrary\nto the behavior observed in more narrow strips, it is not able to leave the strip.\nInstead, the competition between the gyrotropic force and a repulsive interaction of \nthe vortex core with the half-antivortex (HAV) edge defect \\cite{ZIN-11} leads to \nperiodic oscillations of the vortex core $y$-position in the vicinity of the \nstrip edge. Fig.~\\ref{fig:fig3_2_dynamics} shows an example of the trajectory \n($y$ coordinate $y_\\text{c}$ as a function of time $t$) of the vortex core in a strip \nwith $w = 768$ nm and $\\Delta_z = 15$ nm with the DW subject to an applied \nfield of $B_\\text{ext} = 1.5$ mT. A snapshot of the DW configuration with\nthe vortex core close to the HAV edge defect is included. An example of this process is \nalso shown in the Supplemental Material Movie 3 \\cite{SM}. The apparent emissions of spin waves observed in the movie may be related to short-lived (faster than the frame rate) transient dynamics involving nucleation/annihilation processes. Such behavior arises in wide strips due to the interplay between the gyrotropic force and the interaction of the vortex core with the HAV being different \nto the one in narrow strips. Since \nin permalloy everything is dominated by shape anisotropy originating from the \nstrip edges, the energy needed to displace the vortex core from the middle of \nthe strip towards the edge by the gyrotropic force is smaller than in narrow \nstrips. This is evidenced also by the steep increase of $v(B_\\text{ext})$ in \nFig.~\\ref{fig:fig2_dynamics}(b) for small $B_\\text{ext}$. At the same time, \nthe HAV edge defect is more localized in relative terms in wider strips, \nthus leading to a relatively strong short-range vortex core-HAV interaction, \npreventing the former from being expelled from the strip. In other words, the \nenergy necessary to move the vortex core from its equilibrium position in \nthe middle of the strip towards the strip edge is smaller than the energy needed \nto push the core out of the strip. As a result, the core exhibits oscillatory\ndynamics close to the strip edge, and the DW assumes a relatively high\npropagation velocity. In what follows, we shall refer to this phenomenon \nas the attraction-repulsion effect.  \n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.49\\textwidth]{w768_V_t15_B25_dynamics.pdf}\n\\includegraphics[trim=0.5cm 0cm 0.5cm 0cm,clip=true,width=0.49\\textwidth]{Fig4B_paperdynamics.pdf}\n\\caption{(color online)(a) Walker breakdown-type of dynamics for \n$w=768$ nm, $\\Delta_z = 15$ nm and $B_\\text{ext}=$ 2.5 mT. The vortex\ncore exhibits asymmetric lateral oscillations, leaving the strip at the\ntop edge, but reversing the direction of motion and polarity of the core \nwell inside the strip when closer to the bottom edge.\n(b) The instability occuring for $B_\\text{ext}=3$ mT, where the DW width\ngrows without limit as the leading HAV edge defect moves faster than the\ncombination of the trailing HAV and the vortex core.}\n\\label{fig:fig4_dynamics}\n\\end{figure}\n\n\nThis behavior is characteristic of all field values within the range \n0.6 mT $\\leq B_\\text{ext} \\leq 2.4$ mT, with the exception of \n$B_\\text{ext}=2.1$ mT. Here, $v$ is a little smaller than elsewhere in \nthe plateau region visible in Fig.~\\ref{fig:fig2_dynamics} (b). \nFor that case, although most of the time the usual attraction-repulsion\neffect takes place, in rare instances the repulsion effect is strong enough to \ndisplace the vortex core all the way to the other edge of the strip, leading to a structural DW transformation (VW to ATW), and \nto a reduced DW propagation velocity. \n\nFor 2.5 mT $\\leq B_\\text{ext} \\leq 2.7$ mT, $v$ decreases abruptly \n[Fig.~\\ref{fig:fig2_dynamics} (b)]. In this regime, the DW dynamics\nexhibits repeated transitions between a VW and a kind of stretched TW\n(or ATW) structure, see Fig. \\ref{fig:fig4_dynamics}(a). The peculiar feature\nof this Walker breakdown -like dynamics is that while the vortex core is \nable to reach the top edge of the strip, transforming the DW momentarily \ninto a TW-like structure, the vortex core never reaches the opposite (bottom) \nedge of the strip. Thus, the transient TW-like structure always has the \nsame magnetization. The resulting oscillatory dynamics of the vortex core resembles \nthat observed above in the context of the attraction-repulsion effect. However,\nthe amplitude of the transverse core oscillations is significantly larger,\nleading to a higher rate of energy dissipation associated with the internal\ndynamics of the DW, resulting also in a significantly reduced DW propagation\nvelocity.\n\nFor $B_\\text{ext}=2.8$ mT and $B_\\text{ext}=2.9$ mT, the velocity increases as the \nattraction-repulsion effect appears again. In the case of $B_\\text{ext}=2.8$ mT although\nalso an attraction-repulsion effect is observed, the transformations between different DW structures (VW and ATW) are predominant. For $B_\\text{ext}=2.9$ mT \nonly the attraction-repulsion effect is observed, leading to a higher DW propagation\nvelocity [Fig.~\\ref{fig:fig2_dynamics} (b)]. \n\nFor $B_\\text{ext} = 3$ mT and $B_\\text{ext} = 3.1$ mT, the leading and trailing\nedges of the DW start to move at different velocities, implying that the DW width grows\nwithout limit, and thus the system is unable to support a compact DW structure.\nThe leading HAV moves faster than the trailing one, and the vortex core exhibits\noscillatory transverse motion in the vicinity of the latter, see \nFig. \\ref{fig:fig4_dynamics} (b). Eventually the trailing edge of the DW exits the\ncomputational window.  Such unstable DW dynamics has previously been\nreported in Ref.\\cite{ZIN-11}, and renders the measurement of a well-defined DW\nvelocity impossible. \n\nCuriously, for larger fields (3.2 mT $\\leqslant B_\\text{ext}\\leqslant 4$ mT;\nwe focus here on fields up to 4 mT) the DW structure is stable again, and \nthe $v(B_\\text{ext})$ curve displays a second high-velocity plateau with $v$ \nexceeding 250 m/s. There, after a relatively long initial transient, the\nDW dynamics proceeds as follows: In the vicinity of the leading edge HAV, the vortex\ncore exhibits similar oscillatory dynamics as in the attraction-repulsion\neffect. The trailing HAV repeatedly emits a vortex-antivortex pair, which\nsubsequently annihilates. Fig. \\ref{fig:fig5_dynamics} and the Supplemental\nMaterial Movie 4 \\cite{SM} illustrate this dynamics. Notice that while the above-mentioned\nsequence is the dominating one, sometimes the vortex-antivortex pair fails \nto annihilate in the vicinity of the trailing HAV, and is able to move to \nthe opposite edge, leading to a short period of more complex dynamics before\nthe above-mentioned sequence starts again (see Supplemental Material\nMovie 4 \\cite{SM}). Similar vortex-antivortex annihilation processes within DWs have \npreviously been reported in strips with much more confined lateral \ndimensions, and applied fields roughly 5 times as high as here\\cite{kim2008}.\n\nVortex-antivortex annihilation processes can be parallel or antiparallel depending on the polarity of the vortex-antivortex pair\\cite{hertel2006,waeyenberge2006,tetriakov2007}. When the vortex and the antivortex have the same polarity (parallel case), the process is continuous, whereas for the antiparallel one there is emission of spin waves as a result of the annihilation. This is related to the topological charges (winding number $n$) and the polarities of the defects. DW structures are composed of topological defects, which have associated winding numbers $n=$ +1 for vortices, -1 for antivortices, and $\\pm$ 1/2 for edge defects\\cite{TCH-05}. In DW structures the topological defects are compensated, leading to zero total winding number, see Fig. \\ref{fig:topological}. However, there are also other ``topological charges'' associated with the winding number and the polarity of the core of vortices and antivortices, e.g. the skyrmion charge $q=np/2$\\cite{belavin1975}. For parallel polarity, vortex and antivortex have opposite skyrmion numbers, leading to a continuous annihilation process. However, for the antiparallel case the skyrmion numbers are equal, and there is no compensation. As a result,  emission of spin waves occurs after the annihilation process\\cite{hertel2006,waeyenberge2006,tetriakov2007}. Here,  we have  observed both parallel and antiparallel  processes of annihilation of the vortex-antivortex pair.\n\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{Fig5_paperdynamics.pdf}\n\\caption{(color online)  VW dynamics for $B_\\text{ext}=3.3$ mT in a strip \nwith $w = 768$ nm and $\\Delta_z = 15$ nm. The trailing HAV edge defect \nrepeatedly emits a vortex-antivortex pair, which then annihilates, and the \nprocess is repeated.}\n\\label{fig:fig5_dynamics}\n\\end{figure}\n\nFor even larger strips the VW dynamics is again found to be different from\nthat observed in more narrow systems. For example, let us consider a strip \nwith $w = 1536$ nm and $\\Delta_z = 15$ nm, for which both VW and DVW are\nequilibrium structures (i.e. they have the same energy \\cite{nosotrosequilibrium}).\nThe $v(B_\\text{ext})$ curve obtained when starting from a VW initial state\nis shown as red squares in Fig. \\ref{fig:fig7_dynamics}. As before, the low\nfield steady/viscous regime (for $B_\\text{ext} \\leq$ 0.4 mT) is followed\nby a plateau-like regime where the velocity decreases slowly with the field \n(for 0.5 mT $\\leq B_\\text{ext} \\leq$ 1.4 mT), due to the attraction-repulsion \neffect. Contrary to the case of the more narrow strip considered in \nFig.~\\ref{fig:fig2_dynamics} (b), here no Walker breakdown is observed. Instead, \nthe attraction-repulsion regime is terminated by an instability where the \nDW width grows without bound for $B_\\text{ext}=1.5$ mT and $B_\\text{ext}=1.6$ mT.\n\nAbove this unstable regime, the velocity again                                  \ndecreases linearly with the field (1.7 mT $\\leq B_\\text{ext} \\leq$ 2.1 mT). \nAn example of the type of DW dynamics observed in this regime is shown in Fig.~\\ref{fig:fig9_dynamics} for $B_\\text{ext}=2.1$ mT (see also Supplemental Material Movie 5 \\cite{SM}). When the field is applied the vortex core is displaced from its equilibrium position, and an antivortex enters into the strip. After that, a vortex nucleates into the strip. The antivortex moves towards the previous vortex, and an annihilation process between them takes places (snapshot at 34 ns shows the DW structure just after the annihilation). Unlike in the case observed for the strip with $w=768$nm and $\\Delta_z=15$nm, where the  processes of annihilation were between the vortex and antivortex that nucleate into the strip, now the annihilation is between the antivortex and the vortex that was inside the strip previously. Once the annihilation process occurs, this part of the DW structure starts to move towards the other vortex, reducing the width of the DW structure. Again two parts of the DW structure are moving with different velocities. The vortex that does not participate in the annihilation is feeling  an attraction-repulsion effect. Although this is the main dynamical sequence, sometimes other more complex processes are observed, such as one involving a vortex and two antivortices. \n\nFor $2.2 \\leq B_\\text{ext} \\leq$ 3.6 mT, an extended region where the\nsystem is again unable to support compact DWs is encountered. Two different types of instability have been observed. For $2.2 \\leq B_\\text{ext} \\leq$ 3.4 mT the instability is like the one shown in  Fig.~\\ref{fig:fig4_dynamics} (b), where the DW width grows without limit. For  $B_\\text{ext}=$ 3.5 mT and $B_\\text{ext}=$ 3.6mT, although the DW width also increases without limit, at the same time several vortex-antivortex annihilation processes take place. \n\nFor even larger fields,\ncompact DWs are observed again, with their large velocity increasing linearly\nwith $B_\\text{ext}$. Notice that for $B_\\text{ext}=4$ mT, $v$ exceeds 550 m/s. In this\nregime, the DW dynamics is quite chaotic with transformations between  \ncomplex dynamical states. In Fig.~\\ref{fig:fig10_dynamics} \nthe DW dynamics is shown for $B_\\text{ext}=3.8$ mT (see also Supplemental Material \nMovie 6\\cite{SM}). Repeated annihilation processes between vortices and \nantivortices are observed. Note that in this regime, creation of vortices \nand antivortices occurs not only at the edges (as for lower fields), but \nalso within the strip (see  snapshots at 6, 12 and 21 ns in Fig.~\\ref{fig:fig10_dynamics}).\nSimilar processes of vortex-antivortex pair generation within the strip\nhave been reported before \\cite{zeisberger2012}.   \n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{Fig7_paperdynamics.pdf}\n\\caption{(color online) $v(B_\\text{ext})$ curves for a VW and a DVW initial state \nin a strip with $w=1536$ nm and $\\Delta_z = 15$ nm, where both structures are \nequilibrium DWs. In-plane cell size equal to 3 nm. The gray areas indicate unstable regions (no compact DWs).}\n\\label{fig:fig7_dynamics}\n\\end{figure}\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=0cm 0cm 0cm 0.5cm,clip=true,width=0.5\\textwidth]{Fig9_paperdynamics.pdf}\n\n\\caption{(color online) DW dynamics starting from a VW initial state for \n $w=1536$ nm, $\\Delta_z=15$ nm and $B_\\text{ext}=2.1$ mT. The DW dynamics shows the nucleation of an antivortex into the strip from the top edge, followed by the injection of a vortex. The antivortex moves towards the vortex that was previously in the strip, leading to an annihilation process between them. After that, the DW structure reduces its width, resulting a VW. Then the process is repeated.}\n\\label{fig:fig9_dynamics}\n\\end{figure}\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=0cm 0cm 0cm 1cm,clip=true,width=0.5\\textwidth]{Fig10_paperdynamics.pdf}\n\n\\caption{(color online) \nDW dynamics starting from a VW initial state for $w=1536$ nm, \n$\\Delta_z=15$ nm and $B_\\text{ext}=3.8$ mT. Very complex, possibly chaotic \ndynamics is observed.}\n\\label{fig:fig10_dynamics}\n\\end{figure}\n\nWe have also analyzed the dependence of the VW velocity within the low-field\nsteady/viscous regime as a function of $w$ and $\\Delta_z$,\nwithin a range of $w$ and $\\Delta_z$ such that VW is the equilibrium structure. \nThe main panel of Fig.~\\ref{fig:fig6_dynamics} shows the VW velocity as a \nfunction of $w$ for $\\Delta_z=15$ nm and $B_\\text{ext}=0.3$ mT, displaying\nan increasing trend of $v$ with $w$. Since the width of VWs in wider strips \nis larger, such a trend is in agreement with the 1d model, predicting a linear\ndependence of $v$ on the DW width \\cite{reviewthiaville}. This can also be\nrationalized by the fact that a given amount of spin rotation leads to\nDW displacements proportional to the DW width. Inset of Fig.~\\ref{fig:fig6_dynamics} \ndisplays $v$ as a function of $\\Delta_z$ for $w=768$ nm and $B_\\text{ext}=0.3$ mT,\nshowing that the VW velocity decreases with the strip thickness. This may \nbe attributed to the fact that in the steady state, the DW propagation occurs \nby a precessional motion around an out-of-plane demagnetizing or stray field, \nwhich is created by precession in the external field\\cite{nakatani2005}. As the \nthickness of the strip increases, this demagnetizing field decreases, leading to \na decreasing DW velocity.  \n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.45\\textwidth]{Fig6_paperdynamics.pdf}\n\\caption{(color online) Main figure: VW velocity $v$ as a function of the \nwidth of the strip $w$ when the thickness and field are fixed to $\\Delta_z=15$ nm \nand $B_{ext}=0.3$ mT, respectively. $w$ is in logarithmic scale. Inset: VW velocity $v$ as a function of $\\Delta_z$ \nfor $w=768$ nm and $B_\\text{ext}=0.3$ mT.}\n\\label{fig:fig6_dynamics}\n\\end{figure}\n\n\n\\section{DOUBLE VORTEX WALL DYNAMICS}\n\\label{doublevortex}\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=1cm 0cm 1cm 0.5cm,clip=true,width=0.45\\textwidth]{topologicaldefects_DWs.pdf}\n\\caption{(color online) The equilibrium DW structures in terms of their constituent \nelementary topological defects, i.e. vortices with a winding number +1 (full circles) and edge \ndefects with winding number -1/2 (empty circles).\n(a) Vortex wall, (b) double vortex wall, and (c) triple vortex wall.}\n\\label{fig:topological}\n\\end{figure}\n\nFor larger strips with widths around $1\\mu$m and above, the DVW is the equilibrium \nDW structure\\cite{nosotrosequilibrium}. This structure includes two \nvortices with opposite sense of rotation, see Fig.~\\ref{fig:fig1_dynamics}(b). As occurs for the VW, the \nDVW presents different dynamical behaviors depending on the lateral dimensions \nof the strip, and the magnitude of the driving field. Moreover, in the case of  DVW the polarities of the two vortices are an important factor that strongly affects  the dynamics. For small enough $B_\\text{ext}$ the DVW structure is stable depending on the polarities of the vortices. For the case in which the DVW is stable, the DW dynamics exhibits a unique low-field regime. However, the topology of the DVW, consisting of two vortices and \n4 HAV edge defects\\cite{TCH-05} [see Fig. \\ref{fig:topological}(b)] implies \nthat the energy barrier for transforming the DVW into \na VW is not very high. Thus, already for relatively low fields, DVWs tend to \ntransform into VWs, via a process in which one of the vortices annihilates with\ntwo edge defects at the edge of the strip. Since the total winding number of\na vortex and two edge defects is zero, this process happens easily, i.e. it does\nnot require a large applied field. \n\nThis can be illustrated by considering e.g. a strip with $w=1536$ nm and $\\Delta_z=15$ \nnm, corresponding again to the phase boundary between VW and DVW equilibrium \nstructures where they have the same energy \\cite{nosotrosequilibrium}. The \n$v(B_\\text{ext})$ curve obtained by starting from a DVW initial DW with equal polarity for both vortices (parallel case) is represented in \nFig.~\\ref{fig:fig7_dynamics}, together with the corresponding data for the VW\ninitial state in the same strip geometry (see the previous Section). For low \nfields ($B_\\text{ext} \\leqslant 0.6$ mT), the $v(B_\\text{ext})$ curves are \nquite different for the two structures, indicating that the DVW structure is \nstable against small applied fields, and thus exhibits a unique small field \nsteady/viscous regime. In this regime, the moving DVW structure initially \nexhibits transient oscillatory relative motion of the two vortex cores, with the\noscillation amplitude decreasing with time and eventually vanishing when the \nregime with steady DVW motion is reached [see Fig. \\ref{fig:fig8_dynamics} (a), \nand Supplemental Material Movie 7\\cite{SM}]. In this low-field regime the VW moves\nfaster than the DVW. This is due to the increased energy dissipation related to the\nsecond vortex core of the DVW. \n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=0cm 0cm 0cm 0.5cm,clip=true,width=0.5\\textwidth]{polarity2V.pdf}\n\\caption{(color online) DVW dynamics in a strip with $w=1536$ \nnm and $\\Delta_z=15$ nm for $B_\\text{ext}=0.3$ mT and different polarities of the vortices. \n(a) Parallel polarity; dashed lines help to see the transient relative motion of the vortex cores,\nbefore the steady state motion with a non-evolving DVW structure is reached.\n(b) Antiparallel polarity; DVW is not stable, and becomes a VW. }\n\\label{fig:fig8_dynamics}\n\\end{figure}\n\nHowever, if the polarities of the vortices are opposite (antiparallel case), the dynamics at low fields is very different. DVW is unstable and transforms into a VW, see Fig.\\ref{fig:fig8_dynamics} (b). Contrary to the static case where the polarity barely contributes to the energy of the equilibrium state\\cite{nosotrosequilibrium}, in the dynamics it plays an important role. This is because when an external field is applied, the vortex core feels a gyrotropic force\\cite{malozemoff1979}  ${\\bf F^{g}}=pG\\bf \\widehat{z}\\times \\bf v$, that depends on the polarity; $G=2\\pi Jt$ is the gyrotropic constant and $\\bf v$ the velocity. In the case of a VW  this force tries to expel\nthe vortex out through the top or bottom  edge depending on the polarity,  and independently of the vortex chirality. For DVWs with parallel polarity [see the panel top of Fig.\\ref{fig:fig8_dynamics} (a)],  both vortices will try to leave the strip through the same edge due to an equal gyrotropic force exerted on them. As in a DW structure the topological defects have to be compensated for, i.e. the total winding number must be equal to zero, only one of the vortices can be expelled. As a result, a competition between them appears, which tends to keep both vortices in the strip, see Fig. \\ref{fig:fig8_dynamics} (a). \n\nIn the case of DVW with antiparallel polarity [see top in Fig.   \\ref{fig:fig8_dynamics}(b)], the gyrotropic force on one of the vortices is opposite to the one exerted on the other. This means that one vortex will move to the top  edge, and the other to the bottom one. As a consequence one of the vortices will be expelled, i.e. the one located closer to the edge in its direction of movement. Fig. \\ref{fig:fig8_dynamics} (b) shows how the DVW transforms into a VW.\n \nReturning to the parallel case, for $B_\\text{ext}$ = 0.7 mT, the external field is strong enough to\npush one of the vortices out of the system (a process that takes place via annihilation\nof the vortex with the two HAV edge defects), and the DW transforms into a VW.\nThen, the steady state velocity equals that of the corresponding VW initial state, \na behavior that persists up to $B_\\text{ext}$ = 1.1 mT (see Fig. \n\\ref{fig:fig7_dynamics}). Thus, also here the attraction-repulsion effect is\nobserved. However, the DW dynamics exhibits some dependence on the initial \nstate also for fields exceeding 1 mT. For $B_\\text{ext}$ = 1.2 mT, the DVW\ninitial state leads to a Walker breakdown-type of behavior, with repeated\ntransitions between different DW structures (VW and ATW), similarly to the observations in Fig.~\\ref{fig:fig4_dynamics} (a). However, the corresponding system with a VW initial state displays the \nattraction-repulsion effect, and a significantly larger $v$ for the same field. Also, while \nfor a VW initial state $B_\\text{ext}$ = 1.3 mT and 1.4 mT lead to stable \nattraction-repulsion type of behavior, starting from a DVW initial state leads \nto unstable behavior where the DW width grows without limit. For $B_\\text{ext}$ \n= 1.5 mT, such an instability is encountered also when starting from the \nVW initial configuration. For $B_\\text{ext}$ =1.6 mT the instability occurs when the VW is the initial state, but not for the case in which DVW is the initial configuration. For larger fields, the two initial conditions lead \nto the same steady state dynamics, described in the previous section for the \nVW initial state, see Figs. \\ref{fig:fig9_dynamics} and \\ref{fig:fig10_dynamics}.  \n\nSimilar DVW dynamics is observed also for other $w$ and $\\Delta_z$ values\nwith DVW as the equilibrium structure. However, in the parallel case the ``critical'' field\nmagnitude at which one of the two vortices is expelled from the strip,\nleading to a VW, depends on $w$ and $\\Delta_z$ in a non-trivial fashion.\nFor some systems belonging to the DVW equilibrium phase\nthis field is quite small, around 0.1 mT. A possible explanation is that \nthe energy required to move one of the vortices towards the strip edge is\nsmaller in wider strips, given that shape anisotropy (an edge effect) is \nweaker in wider strips.\n\n\n\n\\section{TRIPLE VORTEX WALL DYNAMICS}\n\\label{triplevortex}\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{polarity3V.pdf}\n\\caption{(color online) Top view sketch of the different polarity configurations for a TVW structure.}\n\\label{fig:polarity3V}\n\\end{figure}\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{w5120_3V_B005mT_polarity.pdf}\n\\caption{(color online) TVW dynamics in a strip with $w=5120$ nm and \n$\\Delta_z=25$ nm for $B_\\text{ext}=0.05$ mT and two different configurations of the polarity. (a) TVW structure is stable against this field. (b) The initial TVW structure transforms into a DVW, which then exhibits steady dynamics within the simulation time scale.}\n\\label{fig:TVWtoDVW}\n\\end{figure}\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[clip,width=0.5\\textwidth]{w5120_3V_B01mT_polarity.pdf}\n\\caption{(color online) TVW dynamics in a strip with $w=5120$ nm and \n$\\Delta_z=25$ nm for  $B_\\text{ext}=0.1$ mT and two different configurations of the polarity. (a) The initial TVW structure \ntransforms first into a DVW, and then into a structure exhibiting the \ntopology of a VW. (b) The initial TVW structure transforms into a DVW, which then exhibits steady dynamics within the simulation time scale.}\n\\label{fig:TVWtoDVWtoVW}\n\\end{figure}\n\n\n\\begin{figure*}[t!]\n\\leavevmode\n\\centering\n\\includegraphics[clip,width=1\\textwidth]{Fig11_paperdynamics.pdf}\n\\caption{(color online) Snapshots from a strip with $w=5120$ nm and\n$\\Delta_z=5$ nm with $B_\\text{ext}=0.9$ mT. For these conditions the system\ncannot support a compact DW, resulting in an instability where a complex\nmagnetization pattern fills the strip.}\n\\label{fig:fig11_dynamics}\n\\end{figure*}\n\n\nFor strips with even larger lateral dimensions, TVW is the equilibrium DW\nstructure\\cite{nosotrosequilibrium}, see Fig.\n\\ref{fig:fig1_dynamics} (b). As in the case of DVW, also TVW tends\nto transform into simpler DW structures under applied fields for topological \nreasons. TVWs are composed of three vortices and 6 HAV edge defects, see Fig.\n\\ref{fig:topological} (c). Thus, one or two vortices can be expelled from the strip with\nrelative ease, given that they can annihilate with two HAVs at the strip edge in\na process where the total winding number is conserved. \nOnly in the case of very small fields the TVWs maintain their structure during motion depending on the polarities of the vortices. As in the DVW case, the polarity is fundamental for the stability of the TVW structure. As for TVWs there are three different vortices, the situation is more complex than in the case of DVWs. Fig. \\ref{fig:polarity3V} shows the different combinations of the polarities of the TVW structure. Contrary to the DVWs, where for parallel polarity of the vortices the DW structure is stable at low fields, for TVW the sign of the polarity is also important. For a strip with $w=5120$ nm and $\\Delta_z= 25$ nm under $B_\\text{ext}=$ 0.05 mT, we have observed that when the three vortices are parallel with polarity $p=$ -1 [Fig. \\ref{fig:polarity3V} (d)], the TVW is stable, whereas for polarity $p=$ +1 [Fig. \\ref{fig:polarity3V} (h)] TVW transforms into a DVW (not shown). This is related to the gyrotropic force exerted on the vortices and the interactions between them. Depending on the polarity the gyrotropic force acts in one direction or the other, facilitating or preventing the expulsion of the vortex  out of the strip.\n\nOn the other hand, for antiparallel polarity also the position of the vortices with a given polarity is essential in the TVW dynamics. In Figs. \\ref{fig:polarity3V} (e) and (g) two different polarity configurations are shown, where two vortices have polarity $p=$ -1 and the third one has $p=$ +1. These two configurations show different DW dynamics. To illustrate this we consider a strip  with $w=5120$ nm and $\\Delta_z=25$ nm,\nwhere TVW is one of the equilibrium DW structures\\cite{nosotrosequilibrium}, considering both polarity configurations. For $B_\\text{ext}$ = 0.05 mT and one of the above mentioned configuration, TVW is stable, keeping its structure during the simulation time, see Fig. \\ref{fig:TVWtoDVW} (a). For the second one, \nthe initial TVW transforms into a DVW as one of the three vortices is expelled from the strip. The resulting DVW exhibits steady dynamics within the simulation time scale, see Fig. \\ref{fig:TVWtoDVW} (b). This is because the vortex expelled from the strip is the one with opposite polarity, and thus the two remaining vortices in the strip are parallel. \n\nTo understand why one polarity configuration is stable and the other not, we have to consider the directions of movement of the vortices when a external magnetic field is applied. For the first configuration [Fig. \\ref{fig:TVWtoDVW} (a)], due to the gyrotropic force, the vortices situated at the left and in the center move to the top strip edge, while the third one moves towards the bottom edge. The vortices of the ends of the DW structure are very far from the edges towards which they are moving, and the vortex at the middle cannot be expelled due to the chirality of the vortices. If the vortex at the center was expelled, the two remaining vortices had equal sense of rotation, and  the resulting DW structure would not respect the basic principles of topological defects in DWs. To obtain a total winding number equal to zero,  new topological defects should be created with the corresponding cost in energy\\cite{nosotrosequilibrium}. As a result, the TVW is stable at this magnetic field. For the other case [Fig. \\ref{fig:TVWtoDVW} (b)], the vortex on the left moves to the bottom edge, whereas the other two move towards the top edge. Here, the vortices at the ends are very close to the edges, and in principle we could expect that any of them could be expelled. However, as the vortex at the center also tries to go out, a competition between this vortex and the one situated at the right appears, keeping both inside the strip. Thus, the vortex on the left is expelled more easily.\n\nAs the applied field increases, the TVW transforms into simpler DW structures for all combinations of the vortex polarities. This can be clearly seen in Fig. \\ref{fig:TVWtoDVWtoVW}, where the DW dynamics for the same strip with both polarity configurations are represented for $B_\\text{ext}$ = 0.1 mT. For the configuration where the TVW is stable at a smaller field, now two of the three vortices are expelled, leading to a VW, see Fig. \\ref{fig:TVWtoDVWtoVW} (a). Here the applied field is strong enough to push one of the vortices (the left one) out of the strip. The two remaining vortices have opposite polarities. As it was already seen in the previous section, the DVW with antiparallel polarity is unstable, and  the DW structure transforms into a VW. Fig. \\ref{fig:TVWtoDVWtoVW} (b) shows that for the other configuration, the DW dynamics is similar to the one observed for $B_\\text{ext}=$ 0.05 mT. TVW transforms in a DVW, which is stable during the simulation time because the polarities of the two vortices are parallel.\n\nSimilar results have been found for a larger strip with $w=6144$ nm and $\\Delta_{z}=25$ nm (not shown). For this case, once two of the three vortices have been expelled, the remaining DW has the topology of a VW. However, this structure is more complex than typical VWs observed in more narrow strips. \n\\\\\\\\\nFinally, we mention the fact that also for these very wide strips the system is,\nfor some combinations of the strip geometry and the applied field, unable\nto support a compact DW. The related instabilities can be quite complex,\nas illustrated in Fig. \\ref{fig:fig11_dynamics} for a strip with \n$w=5120$ nm, $\\Delta_z=5$ (corresponding to the phase boundary between\nVW and DVW equilibrium structures\\cite{nosotrosequilibrium}) and $B_\\text{ext}=$ \n0.9 mT. In this case, a complex domain/magnetization pattern starts to\nemanate from the initial DW, eventually filling the entire strip.\nThus, for such wide permalloy strips one starts to reach a situation resembling\nincreasingly that in thin films rather than nanostrips, where system-spanning\nclosure domain/Landau patterns are typically observed \\cite{SHI-00,WAC-02,FIS-11}.\n  \n\n\\section{SUMMARY AND CONCLUSIONS}\n\\label{summary}\n\nTo summarize, we have analyzed in detail DW dynamics driven by an external \nmagnetic field in wide permalloy strips, by considering a set of example\ngeometries spanning a wide range of strip widths. Our main message is that\nthe system geometry crucially affects the DW dynamics also for lateral\nstrip dimensions beyond the typical nanostrip ones which have been extensively\nstudied in the literature. Already for relatively confined systems with\nVW as the stable DW structure, several different dynamical behaviors are\nobtained, including processes such as various periodic transitions between\ndifferent DW structures, the attraction-repulsion effect, etc. These behaviors are also \nvisible in the profiles of the resulting $v(B_\\text{ext})$ curves.\nFor wider strips  where the DVWs and TVWs\nare the equilibrium DWs,  the polarities of the vortices play an important role in the dynamics. For small fields, DVW and TVW structures are stable, i.e. they maintain their structure depending on the polarity and the interactions between the vortices. As the size of the strip increases, for relatively\nsmall fields in the range of a few mT, these structures tend to transform towards DW structures with less vortices. This effect is intimately linked to the topology of such\nmore complex equilibrium DW structures. The latter can be represented as composite\nobjects of topological defects, consisting of vortices and half-antivortex edge \ndefects\\cite{TCH-05}. The transitions towards simpler DW structures proceed via \nannihilation processes conserving the winding number, and thus the energy barrier \nfor such transitions tends to be low. \n\nAnother key feature of wide permalloy strips is that they are not always able\nto support compact DWs. Indeed, as the strip width increases, shape\nanisotropy becomes weaker, eventually leading to a situation where increasing\nthe DW width without limit becomes energetically favorable. In \ndynamical situations addressed here this tends to happen via different DW \ncomponents acquiring different field-driven propagation velocities\\cite{ZIN-11},\nleading to gaps in the $v(B_\\text{ext})$ curves as the DW and therefore\nits velocity become ill-defined concepts. More generally, as the strip\nwidth increases, one would expect a crossover to a thin film-like behavior\nwith system-spanning closure domain/Landau patterns\\cite{SHI-00,WAC-02,FIS-11}\ninstead of localized DWs.\n\nFrom an experimental perspective, our study highlights the importance of\nperforming simultaneous analysis e.g. by micromagnetic simulations, to verify\nwhich of the large variety of complex dynamical behaviors corresponds to\nthe experimental conditions at hand. While our preliminary studies suggest that the attraction-repulsion effect is stable against adding random structural disorder\\cite{leliaert2014} of moderate strength, future studies should address the effects\nof e.g. thermal fluctuations and quenched disorder on DW dynamics in wide \npermalloy strips. For instance, the effect of e.g. edge roughness on the periodic\nvortex core dynamics near the strip edge\nwould be interesting to address in detail.\n\n\n\\begin{acknowledgments}\nWe thank Ilari Rissanen for sharing computational resources. This work has been supported by the Academy of Finland through its Centres\nof Excellence Programme (2012-2017) under project no. 251748, and via an Academy\nResearch Fellowship (LL, project no. 268302). We acknowledge the computational \nresources provided by the Aalto University School of Science ``Science-IT'' \nproject, as well as those provided by CSC (Finland).\n\\end{acknowledgments}\n\n\\begin{thebibliography}{99}\n\\bibitem{parkinracetrack}\nS. S. P. Parkin, M. Hayashi and L. Thomas, Science {\\bf 320}, 190 (2008).\n\\bibitem{barnes2006}\nS. E. Barnes, J. Ieda and S. Maekawa, Appl. Phys. Lett. {\\bf 89}, 122507 \n(2006).\n\\bibitem{cowburn2000} \nR. P. Cowburn and M. E. Welland, Science {\\bf 287}, 1466 (2000).\n\\bibitem{allwood2002} \nD. A. Allwood, G. Xiong, M. D. Cooke, C. C. Faulkner, D. Atkinson, \nN. Vernier and R. P. Cowburn, Science {\\bf 296}, 2003 (2002)\n\\bibitem{allwood2005} \nD. A. Allwood, G. Xiong, C. C. Faulkner, D. Atkinson, D. Petit \nand R. P. Cowburn, Science {\\bf 309}, 1688 (2005).\n\\bibitem{ono99} \nT. Ono, H. Miyajima, K. Shigeto, K. Mibu, N. Hosoito and T. Shinjo, \nScience {\\bf 284}, 468 (1999).\n\\bibitem{atkinson2003}\nD. Atkinson, D.A. Allowood, G. Xiong, M.D. Cooke, C.C. Faulkner and R.P. Cowburn, Nat. Mat. {\\bf 2}, 85 (2003).\n\\bibitem{beach2005} \nG. S. D. Beach, C. Nistor, C. Knutson, M. Tsoi and J. L. Erskine, \nNature Mater. {\\bf 4}, 741 (2005).\n\\bibitem{nakatani2005} \nY. Nakatani, A. Thiaville and J. Miltat, J. Magn. Magn. Mater. \n{\\bf 290-291}, 750 (2005).\n\\bibitem{reviewthiaville} \nA. Thiaville and Y. Nakatani, in {\\it Spin Dynamics in \nConfined magnetic Structures III}, edited by B. Hillebrands \nand A. Thiaville, Topics in Applied Physics {\\bf 101} \n(Springer, Berlin, 2006).\n\\bibitem{hayashi2007} \nM.Hayashi, L. Thomas, C. Rettner, R. Moriya and S.S.P. Parkin, \nNature Phys. {\\bf 3}, 21 (2007).\n\\bibitem{yang2008} \nJ. Yang, C. Nistor, G.S. D. Beach, and J.L. Erskine, \nPhys. Rev. B {\\bf 77},014413 (2008).\n\\bibitem{moriya2010} \nR. Moriya, M. Hayashi, L. Thomas, C. Rettner and S.S.P. Parkin, \nAppl. Phys. Lett. {\\bf 97},142506(2010).\n\\bibitem{ZIN-11}\nC. Zinoni, A. Vanhaverbeke, P. Eib, G. Salis, and R. Allenspach,\nPhys. Rev. Lett. {\\bf 107}, 207204 (2011).\n\\bibitem{hayashi2008} \nM. Hayashi, L. Thomas, C. Rettner, R. Moriya and S.S.P. Parkin, \nAppl. Phys. Lett. {\\bf 92},112510(2008).\n\\bibitem{spcklaui2003}\nM. Kl\\\"aui, C. A. F. Vaz, J. A. C. Bland, W. Wernsdorfer, G. Faini, \nE. Cambril and L. J. Heyderman, Appl. Phys. Lett. {\\bf 83}, 105 (2003).\n\\bibitem{thiaville2004}\nA. Thiaville, Y. Nakayama, J. Miltat and N. Vernier, J. Appl. Phys. \n{\\bf 95}, 7049 (2004).\n\\bibitem{klaui2005}\nM. Kl\\\"aui, P.-O. Jubert, R. Allenspach, A. Bischof, J. A. C. \nBland, G. Faini, U. R\\\"udiger, C. A. F. Vaz, L. Vila and C. Vouille,  \nPhys. Rev. Lett. {\\bf 95}, 026601 (2005).\n\\bibitem{vernier2004} \nN. Vernier, D. A. Allwood, D. Atkinson, M. D. Cooke and \nR. P. Cowburn, EPL {\\bf 65}, 526 (2004).\n\\bibitem{thiaville2005}\nA. Thiaville, Y. Nakatani, J. Miltat and Y.Suzuki, Europhys. Lett., \n{\\bf 69} (6), pp. 990-996 (2005).\n\\bibitem{yamaguchi2004}\nA. Yamaguchi, T. Ono, S. Nasu, K. Miyake, K. Mibu and T. Shinjo,  \nPhys. Rev. Lett. {\\bf 92}, 077205 (2004).\n\\bibitem{glathe2008}\nS. Glathe, R. Mattheis, and D.V. Berkov, Appl. Phys. Lett. {\\bf 93},072508 (2008).\n\\bibitem{buschowbook}\nK.H.J. Buschow and F.R. de Boer, {\\it Physics of Magnetism and Magnetic \nMaterials}. (Kluwer Academic, New York, 2003).\n\\bibitem{coeybook}\nJ.M.D. Coey, {\\it Magnetism and Magnetic Materials}, (Cambridge University Press, Cambridge, 2010)\n\\bibitem{McMichael97} \nR. D. McMichael and M. J. Donahue, IEEE Trans. Magn. {\\bf 33}, \n4167 (1997).\n\\bibitem{nosotrosequilibrium} \nV. Est\\'evez and L. Laurson, Phys. Rev. B {\\bf 91}, 054407 (2015).\n\\bibitem{klaui2004}\nM. Kl\\\"aui, C. A. F. Vaz, J. A. C. Bland, L. J. Heyderman, \nF. Nolting, A. Pavlovska, E. Bauer, S. Cherifi, S. Heun, and A. Locatelli,\nAppl. Phys. Lett. {\\bf 85}, 5637 (2004).\n\\bibitem{JAM-14}\nS. Jamet, N. Rougemaille, J. C. Toussaint, and O. Fruchart, {\\it Magnetic Nano- and Microwires: Design, synthesis, properties and applications}, edited by M. V\\'azquez ( Woodhead,Cambridge 2015).\n\\bibitem{atwbackes2007}\nD. Backes, C. Schieback, M. Kl\\\"aui, F. Junginger, H. Ehrke, \nP. Nielaba, U. R\\\"udiger, L. J. Heyderman, C. S. Chen, T. Kasama, \nR. E. Dunin-Borkowski, C. A. F. Vaz, and J. A. C. Bland, Appl. Phys. \nLett. {\\bf 91}, 112502 (2007).\n\\bibitem{nozaki99}\nY. Nozaki, K. Matsuyama, T. Ono, and H. Miyajima,\nJpn. J. Appl. Phys. Vol. {\\bf 38} (1999) 6282.\n\\bibitem{prbklaui2003}\nM. Kl\\\"aui, C. A. F. Vaz, J. A. C. Bland, T. L. Monchesky, \nJ. Unguris, E. Bauer, S. Cherifi, S. Heun, A. Locatelli, L. J. \nHeyderman, and Z. Cui, Phys. Rev. B {\\bf 68}, 134426 (2003).\n\\bibitem{annularklaui2006}\nM. Kl\\\"aui, U. R\\\"udiger, C. A. F. Vaz, J. A. C. Bland, \nS. Cherifi, A. Locatelli, S. Heun, A. Pavlovska, E. Bauer, and \nL. J. Heyderman, J. Appl. Phys. {\\bf 99}, 08G308 (2006).\n\\bibitem{vortexklaui2006}\nM. Kl\\\"aui, M. Laufenberg, L. Heyne, D. Backes, U. R\\\"udiger, \nC. A. F. Vaz, J. A. C. Bland, L. J. Heyderman, S. Cherifi, A. \nLocatelli, T. O. Mentes, and L. Aballe, Appl. Phys. Lett. {\\bf 88} \n232507 (2006).\n\\bibitem{hempe2007}\nE.-M. Hempe, M. Kl\\\"aui, T. Kasama, D. Backes, F. Junginger, \nS. Krzyk, L. J. Heyderman, R. Dunin-Borkowski, and U. R\\\"udiger, \nPhys. Stat. Sol. (a) {\\bf 204}, 3922 (2007).\n\\bibitem{nguyen2015}\nV.D. Nguyen, O. Fruchart, S. Pizzini, J. Vogel, J.-C. Toussaint, and N. Rougemaille, \nSci. Rep., {\\bf 5}, 12417 (2015).\n\\bibitem{lee2007}\nJ.-Y. Lee, K.-S. Lee, S. Choi, K.Y. Guslienko, and S.K. Kim, Phys. Rev. B {\\bf 76}, 184408 (2007).\n\\bibitem{weerts2008}\nK. Weerts, P. Neutens, L. Lagae, and G. Borghs, J. Appl. Phys. {\\bf 103}, 094307 (2008).\n\\bibitem{kunz2006}\nA. Kunz, IEEE Trans. Magn. {\\bf 42},3219 (2006).\n\\bibitem{tretiakov2008}\nO.A. Tretiakov, D. Clarke, G.-W. Chern, Y.B. Bazaliy and O. Tchernyshyov, Phys.\nRev. Lett. {\\bf 100}, 127204 (2008).\n\\bibitem{clarke2008}\nD.J. Clarke, O.A. Tretiakov, G.-W. Chern, Y.B. Bazaliy and O. Tchernyshyov, Phys.\nRev. B. {\\bf 78}, 134412 (2008).\n\\bibitem{martinez2009}\nE. Martinez, L. Lopez-Diaz, O. Alejos, L. Torres, and M. Carpentieri, Phys.\nRev. B. {\\bf 79},094430 (2009).\n\\bibitem{walker74}\nN. L. Schryer and L. R. Walker. Journal of Applied Physics {\\bf 45},5406 (1074).\n\\bibitem{mumax3}http://mumax.github.io\n\\bibitem{mumax2011} \nA. Vansteenkiste and B. Van de Wiele, J. Magn. Magn. Mater. \n{\\bf 323}, 2585 (2011).\n\\bibitem{mumax2014} \nA. Vansteenkiste {\\it et al.}, AIP Advances 4, 107133 (2014).\n\\bibitem{gilbert2004}\nT. L. Gilbert. IEEE Trans. Magn. {\\bf 40}, 3443 (2004).\n\\bibitem{brownmicromagnetism}\nW. F. Brown, Jr., {\\it Micromagnetics}. (Wiley, New York, 1963).\n\\bibitem{malozemoff1979}\nA.P. Malozemoff, J.C. Slonczewski, Magnetic Domain Wall in Bubble Materials, Academic Press, New York, 1979.\n\\bibitem{SM}\nSee Supplemental Material at [URL will be inserted by\npublisher] for movies illustrating the details of the domain \nwall dynamics discussed in the paper.\n\\bibitem{kim2008}\nS.-K. Kim, J.-Y. Lee, Y.-S. Choi, K.Y. Guslienko, and K.S. Lee, Appl. Phys. Lett. {\\bf 93}, 052503 (2008).\n\\bibitem{hertel2006}\nR. Hertel and C.M. Schneider  \nPhys. Rev. Lett. {\\bf 97}, 177202 (2006).\n\\bibitem{waeyenberge2006}\nB. Van Waeyenberge, A. Puzic, H. Stoll, K.W. Chou, T. Tyliszczak, R. Hertel, M. F\\\"{a}hnle, H. Br\\\"{u}ckl, K. Rott, G. Reiss, I. Neudecker, D. Weiss, C.H. Back and G. Sch\\\"{u}tz,\nNature, {\\bf 444}, 461 (2006).\n\\bibitem{tetriakov2007}\nO.A. Tretiakov and O. Tchernyshyov, Phys. Rev. B. {\\bf 75}, 012408 (2007).\n\\bibitem{TCH-05}\nO. Tchernyshyov and G.-W. Chern, Phys. Rev. Lett. {\\bf 95}, 197204 (2005).\n\\bibitem{belavin1975}\nA.A. Belavin and A.M. Polyakov, Pis'ma Zh. Eksp. Teor. Fiz. {\\bf 22}, 503 (1975)[JETP Lett. {\\bf 22}, 245 (1975)].\n\\bibitem{zeisberger2012} \nM. Zeisberger and R. Mattheis, J. Phys.: Matter {\\bf 24}, 024202 (2012).\n\\bibitem{SHI-00}\nT. Shinjo, T. Okuno, R. Hassdorf, K. Shigeto, and T. Ono,\nScience {\\bf 289}, 930 (2000).\n\\bibitem{WAC-02}\nA. Wachowiak, J. Wiebe, M. Bode, O. Pietzsch, M. Morgenstern,\nand R. Wiesendanger, Science {\\bf 298}, 577 (2002).\n\\bibitem{FIS-11}\nP. Fischer, M.-Y. Im, S. Kasai, K. Yamada, T. Ono, and\nA. Thiaville, Phys. Rev. B {\\bf 83}, 212402 (2011).\n\\bibitem{leliaert2014}\nJ. Leliaert, B. Van de Wiele, A. Vansteenkiste, L. Laurson, G. Durin, L. Dupr\\'e, and B. Van Waeyenberge, J. Appl. Phys. {\\bf 115}, 233903 (2014).\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 10745, "prevtext": "\n\\title{Magnetic domain wall dynamics in wide permalloy strips}\n\\author{Virginia Est\\'evez}\n\\email{virginia.esteveznuno@aalto.fi}\n\\author{Lasse Laurson}\n\\affiliation{COMP Centre of Excellence and Helsinki Institute of Physics,\nDepartment of Applied Physics, Aalto University, P.O.Box 11100, \nFI-00076 Aalto, Espoo, Finland.}\n\\begin{abstract}\nDomain walls in soft permalloy strips may exhibit various equilibrium \nmicromagnetic structures depending on the width and thickness of the strip,\nranging from the well-known transverse and vortex walls in narrow and thin\nstrips to double and triple vortex walls recently reported in wider\nstrips [V. Est\\'evez and L. Laurson, Phys. Rev. B {\\bf 91}, 054407 (2015)].\nHere we analyze the field driven dynamics of such domain walls\nin permalloy strips of widths from 240 nm up to 6 $\\mu$m,\nusing the known equilibrium domain wall structures as initial configurations.\nOur micromagnetic simulations show that the domain wall dynamics in  \nwide strips is very complex, and depends strongly on the geometry of the \nsystem, as well as on the magnitude of the driving field. We discuss in \ndetail the rich variety of the dynamical behaviors found, including dynamic \ntransitions between different domain wall structures, periodic dynamics of \na vortex core close to the strip edge, transitions towards simpler domain wall structures of the multi-vortex domain walls controlled by vortex polarity, and the fact that for some combinations \nof the strip geometry and the driving field the system cannot support a \ncompact domain wall.  \n\\end{abstract}\n\\pacs{75.60.Ch, 75.78.Fg, 75.78.Cd}\n\\maketitle\n\n\\section{Introduction}\n \nThe study of static and dynamic properties of the magnetic domain walls \n(DWs) in ferromagnetic nanostructures has recently attracted a lot of \nattention not only due to the related fundamental physics aspects, but \nalso because of the emergence of technological applications based on DWs \nand their dynamics, such as memory\\cite{parkinracetrack,barnes2006} and \nlogic devices\\cite{cowburn2000,allwood2002,allwood2005}. Consequently, DW \ndynamics in nanostrips and wires has been extensively studied, using both \napplied magnetic fields\\cite{ono99,atkinson2003,beach2005,nakatani2005,\nreviewthiaville,hayashi2007,yang2008,moriya2010, ZIN-11,hayashi2008} and \nspin-polarized electric currents\\cite{spcklaui2003,thiaville2004,klaui2005,\nvernier2004,thiaville2005,yamaguchi2004} as the driving force. \n\nOne of the typical materials used for the study of DWs and their dynamics \nin strip geometry is permalloy, a soft magnetic material with a negligible \nmagnetocrystalline anisotropy\\cite{buschowbook,coeybook}. Such systems \nexhibit in-plane domains along the long axis of the strip, induced by \nshape anisotropy. Previous works have shown that the structures of the \nDWs separating such domains may be relatively complex, and depend strongly \non the sample geometry\\cite{nakatani2005,reviewthiaville,McMichael97,klaui2004,\nnosotrosequilibrium}. For nanostrip geometries, with the strip width and thickness\nof the order of 100 nm and 10 nm or less, respectively, the known equilibrium \nDW structures are the transverse DW (TW) and the asymmetric transverse DW \n(ATW)\\cite{klaui2004,atwbackes2007,JAM-14,nozaki99,prbklaui2003,\nannularklaui2006,vortexklaui2006}. For somewhat wider and/or thicker \nstrips, the vortex DW (VW) is the stable structure\\cite{klaui2004,nozaki99,\nprbklaui2003,annularklaui2006,vortexklaui2006,hempe2007}. A related,\nthree-dimensional vortex-like flux-closing DW structure has been reported \nin permalloy strips of thickness exceeding 60 nm.\\cite{nguyen2015}\nRecently we have shown that in the case of even wider permalloy strips than\nthose with VW as the equilibrium DW structure, two additional equilibrium \nDW structures appear, namely the double vortex (DVW) and triple vortex walls \n(TVW)\\cite{nosotrosequilibrium}.      \n\nStudies of field and current driven dynamics of DWs in permalloy strips \nhave focused mostly on narrow strips with either TW or VW as the equilibrium \nDW structure\\cite{nakatani2005,reviewthiaville,beach2005,hayashi2007,yang2008,\nmoriya2010,lee2007,weerts2008,kunz2006,tretiakov2008, clarke2008,martinez2009}. \nIn both cases, the DW dynamics exhibits a Walker breakdown\\cite{walker74}, \nan instability occurring when the DW internal degrees of freedom are \nexcited by a strong enough external driving force. This force can be a magnetic field $B>B_\\text{W}$ or a spin-polarized electric current \n$J>J_\\text{W}$, with $B_\\text{W}$ and $J_\\text{W}$ the Walker field and\ncurrent density, respectively\\cite{beach2005,hayashi2007,glathe2008,\nhayashi2008}. For small driving forces, the DW velocity increases\nup to $B_\\text{W}$ or $J_\\text{W}$ (steady, or viscous regime). At the\nonset of the Walker breakdown, the DW velocity decreases abruptly as a \nconsequence of periodic transitions between different DW structures.\nIn narrow and thin strips with TW as the equilibrium structure, repeated \ntransitions between TWs of different polarities (or signs of the TW \ninternal magnetization) take place via nucleation and propagation of an \nantivortex across the strip width; we will refer to the transient state\nas the antivortex wall, or AVW\\cite{reviewthiaville}. For wider strips \nwith a VW equilibrium DW, periodic transitions between VW and TW\nstructures are typically observed\\cite{reviewthiaville,lee2007}.\nHowever, so far little is known about the DW dynamics in even \nwider strips, especially ones with DVW or TVW as the equilibrium DW \nstructure.  \n\nIn this paper we analyze numerically field driven DW dynamics in permalloy\nstrips considering a wide range of strip widths $w$ from 240 nm \nup to 6 $\\mu$m. We focus on relatively thin strips with the thickness $\\Delta_z$ \nin the range of 5 to 25 nm. Depending on $w$ and $\\Delta_z$, the equilibrium \nDW structure in such strips can be either VW, DVW or TVW\\cite{nosotrosequilibrium}\n(see Fig. \\ref{fig:fig1_dynamics} for examples of these structures). \nSince the space of parameters spanned by $w$, $\\Delta_z$ and $B_\\text{ext}$ is \nquite large, we focus on specific example cases, covering each of the three \nabove-mentioned equilibrium DW structures, and illustrating \nthe complex nature of the DW dynamics in wide strips, exhibiting also a strong \ndependence on both the geometry of the system, and on the magnitude of the driving \nfield. Already for rather confined geometries with VW as the equilibrium DW\nstructure, several possible dynamical behaviors are encountered, in particular \nfor large enough $B_\\text{ext}$ (i.e. above the small field steady/viscous regime). \nIn addition to various periodic transitions occurring between different DW structures, \nwe also report on localized oscillatory motion of the vortex core close to the\nstrip edge. This novel behavior is characteristic of wide enough strips, giving rise \nto an extended plateau in the velocity vs field curve. Another signature\nof DW dynamics in wide strips is that for some combinations of $w$, \n$\\Delta_z$ and $B_\\text{ext}$, DWs are unstable: the DW's  width \ngrows without limit as different components of the DW assume a different\npropagation velocity\\cite{ZIN-11}. DVWs are found to be structurally stable\nagainst small applied fields depending on the polarity of the vortices. In the stable case (parallel polarity), the dynamics exhibits a unique small field \nsteady/viscous regime, but larger fields tend to induce a transition\ninto a simpler VW structure, or lead to complex, turbulent-like dynamics \nwith repeated transitions between numerous different DW structures. For antiparallel polarity, the DVW transforms in a VW even for very small fields. For larger fields the dynamics observed is the same independently of the polarity. The same is \ntrue also for TVWs, whose stability at low fields depends on the polarities of the three vortices. In general the TVWs tend to transform into simpler DW structures\nduring their field-driven dynamics. The paper is organized as follows: The\nfollowing section (Section \\ref{micromagn}) describes the details of our\nmicromagnetic simulations, while in the three sections after that (Sections \\ref{vortex},\n\\ref{doublevortex} and \\ref{triplevortex}), DW dynamics starting \nfrom VW, DVW and TVW equilibrium initial configurations, respectively,\nare described and discussed. Section \\ref{summary} finishes the paper with\na summary and conclusions.\n\n\n\\begin{figure}[t!]\n\\leavevmode\n\\includegraphics[trim=1cm 0cm 1cm 2cm,clip,width=0.9\\columnwidth]\n{Fig1_paperdynamics.pdf}\n\\caption{(color online) (a) Geometry of the permalloy strip. \n(b) A top view of the magnetization in the initial state. Magnetization points \nalong the long axis of the strip within the two domains (as indicated by the \narrows) forming a head-to-head configuration. The domain wall separating these\ndomains has a geometry-depedendent equilibrium structure. Here, we consider\nsystems where the latter is either a vortex wall (VW), double vortex wall (DVW), \nor a triple vortex wall (TVW). To study the DW dynamics, an external magnetic \nfield $B_\\text{ext}$ is applied along the long axis of the strip.}\n\\label{fig:fig1_dynamics}\n\\end{figure}\n\n\n\\section{Micromagnetic Simulations}\n\\label{micromagn}\n\nThe system under study consists of a permalloy strip of width $w$ and \nthickness $\\Delta_z$, satisfying $\\Delta_z \\ll w$, see Fig.~\\ref{fig:fig1_dynamics} (a). \nTo mimic an infinitely long strip, the magnetic charges at the two ends of the strip\nare compensated. In all the cases considered the actual simulated length $l$, \ni.e. the length of the computional window which is centered at and moving with the DW, satisfies $l \\geq 4w$. The initial state \nis an in-plane head-to-head domain structure, with the equilibrium DW \nstructure\\cite{nosotrosequilibrium} corresponding to the $w$ and $\\Delta_z$ of the \nstrip in the middle of the sample, see Fig.~\\ref{fig:fig1_dynamics} (b). \nTo analyze the DW dynamics, a constant external magnetic field $B_\\text{ext}$ is \napplied along the long axis of the strip. All the results presented in this work \nhave been obtained using the typical material parameters of permalloy, i.e. \nsaturation magnetization $M_\\text{s}=860 \\times 10^3$ A/m, exchange constant \n$A_\\text{ex} = 13 \\times 10^{-12}$ J/m, and the Gilbert damping constant $\\alpha=0.01$. \nWe focus on the ideal case of perfect strips without any kind of disorder or \nimpurities, and consider a temperature $T$ equal to zero.\n\nThe micromagnetic simulations have been performed using the GPU-based micromagnetic \ncode MuMax3 \\cite{mumax3,mumax2011,mumax2014}. To calculate the magnetization dynamics \nof the system, the Landau-Lifshitz-Gilbert equation \\cite{gilbert2004,brownmicromagnetism},\n\n", "index": 1, "text": "\\begin{equation}\n\\partial {\\bf m}/\\partial t =\n\\gamma {\\bf H_{eff}} \\times {\\bf m} + \\alpha {\\bf m} \\times\n\\partial {\\bf m}/\\partial t,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\partial{\\bf m}/\\partial t=\\gamma{\\bf H_{eff}}\\times{\\bf m}+\\alpha{\\bf m}%&#10;\\times\\partial{\\bf m}/\\partial t,\" display=\"block\"><mrow><mrow><mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐦</mi></mrow><mo>/</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>γ</mi><mo>⁢</mo><msub><mi>𝐇</mi><mi>𝐞𝐟𝐟</mi></msub></mrow><mo>×</mo><mi>𝐦</mi></mrow><mo>+</mo><mrow><mrow><mrow><mi>α</mi><mo>⁢</mo><mi>𝐦</mi></mrow><mo>×</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>𝐦</mi></mrow></mrow><mo>/</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]