[{"file": "1601.03283.tex", "nexttext": "\nwhere the terms in the series are graded by the number of derivatives\nacting on the flow fields $u(x)$ \\cite{Baier:2007ix}. If the flow fields are sufficiently\nsmooth, the flow is well described in terms of the few first terms in the series,\nbut when the gradients are large, the system is no longer described in terms\nof hydrodynamics. \n\nDue to the singular geometry of an ultra-relativistic heavy-ion collision, the gradients of the \nflow fields diverge when approaching $\\tau \\rightarrow 0^+$,  the moment when the two Lorentz\ncontracted nuclei first collided. Therefore it is clear that the full time evolution of the \ncollision is not amendable for hydrodynamical description and any hydrodynamical\nsimulation has to start at some \\emph{initialization time}  $\\tau_i$ after the collision, \nwhen the hydrodynamical description has become appropriate. The dynamics before\nthis time are \\emph{prethermal} dynamics. \n\nThe minimal requirement on the prethermal model is that it smoothly and automatically\napproaches hydrodynamical flow. If this is the case, then the physical results become\nindependent of the unphysical choice of initialization time. This, however, is not the \ncase in the vast majority of current implementations where the prethermal evolution is\neither completely neglected, \nor modelled in a way that does not contain the\ncorrect physics to reach hydrodynamical flow. \nThe residual dependence\npromotes the unphysical initialization time to a physical model parameter often referred as the \\emph{thermalization time} which needs to be \nfixed by comparison to data. \nThe problem is not only phenomenological. From the theoretical point of view, the failure to\nreach correct behaviour is a sign of failure to identify the correct dominant physics.\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.4\\textwidth]{cartoon4.eps}\n\\end{center}\n\\caption{\n\\label{fig:route}\nA cartoon of the path from Color-Glass-Condensate initial condition to the thermal equilibrium in \na plane of occupancy and anisotropy. At proper time $\\tau \\sim Q_s^{-1}$, the system is parametrically\noveroccupied. Initially, the interactions are not strong enough to counter the expansion, and the system\nbecomes more anisotropic and dilute. Once the modes become underoccupied the dominant physics\nchange qualitatively and the system does not become anymore anisotropic. Eventually the underoccupied\nsystem reaches equilibrium through the process of radiative break-up that causes the trajectory eventually\nturn towards the origin in the figure. The system is described by classical field theory in the overoccupied region,\nand by effective kinetic theory both in the underoccupied and overoccupied side, except when occupancies are\nnon-perturbatively large $f\\sim 1/\\alpha$.\n}\n\\end{figure}\n\nThere have been two quite different strategies to attempt to quantitatively understand the \nprethermal evolution. On one hand, with\nholographic methods, it has become possible to follow the far-from-equilibrium\nevolution of certain gauge theories ($\\mathcal{N}=4$ SYM in the $N_c\\rightarrow \\infty$ limit)\nand observe the onset of hydrodynamical flow in collisions of sheets or lumps of supersymmetric matter \\cite{Chesler:2008hg, Chesler:2010bi}. This has made it possible to \nconstruct a model that explicitly exhibits insensitivity to \ninitialization time \\cite{vanderSchee:2013pia}.\n\n The holographic method is, however, critically limited to a very special set of theories and cannot \nbe applied to QCD. The complementary strategy has been to study\nthe prethermal evolution in QCD in the weak coupling limit (corresponding to the limit\nof $\\sqrt{s}\\rightarrow \\infty$), where in principle we expect to have analytical control of the theory.\nIn this limit, the initial condition for the prethermal evolution is fairly well understood in\nterms of the physics of saturation and the Color-Glass-Condensate framework \\cite{Gelis:2010nm}.\nThere have been several weak coupling motivated or inspired models used for phenomenology,\nbut none of these have so far quantitatively included all the necessary physics for a \nleading order calculation. However, in the recent past there has been significant progress, that will\n be reviewed in these proceedings. \n\nAt weak coupling the smallness of coupling provides us with large scale separations. \nWhile the task of following the time evolution of a full quantum field theory is an unsolved\nproblem, these scale separations make it possible to study the prethermal evolution within different\neffective theories, in particular using classical field theory and effective kinetic theory.\nBut while the scale separations make it possible to follow the time evolution of the system, they also \nmake the prethermal evolution go through several stages of very different physics, all of which\nmust be quantitatively understood for a full leading order description of the prethermal evolution.\n\nThis proceeding is organized as follows. In Sec.~\\ref{sec:route} I describe the overall features of the  thermalization process\nand what are the roles of classical field theory and effective kinetic theory in its description. In the following Sections \\ref{sec:clas} \nand  \\ref{sec:kin} I discuss briefly recent simulations in classical Yang-Mills theory and in effective kinetic theory. \nI conclude with a discussion about the relevance of weak coupling thermalization to future phenomenology.\n\n\n\\section{Route to equilibrium, degrees of freedom, and the weak coupling strategy}\n\\label{sec:route}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{cartoon_3.eps}\n\\end{center}\n\\caption{\n\\label{fig2}\nA cartoon of the strategy to bring the highly overoccupied Color-Glass-Condition initial condition to hydrodynamical region by a combination \nof classical Yang-Mills (CYM) simulations and effective kinetic theory (EKT). At early times the occupancies are non-perturbative $f\\sim 1/\\alpha$ \nthe system is described in classical YM theory. The CYM evolution however makes the system ever more dilute and anisotropic never approaching \nlocal thermal equilibrium and hydrodynamic description. When the occupancies are $1\\gg f \\gg 1/\\alpha_s$ both CYM and EKT give equally good leading\norder description and the system can be smoothly passed from classical fields to particles at arbitrary time $\\tau_{EKT}$. The subsequent evolution\nin EKT will then deviate from the classical field evolution once the occupancies become close to unity $f\\sim 1$ and smoothly and automatically asymptote to hydrodynamical evolution. \n}\n\\end{figure}\n\nAccording to the picture arising from the saturation framework and CGC, the \npost-collisional debris that are left in the midrapidity region, and that will\neventually form the hydrodynamically expanding medium, consist of parametrically\noveroccupied gluon fields at a typical saturation scale $Q_s$ \\cite{Gelis:2010nm}.That is, the \ntypical mode occupancies per unit phase phase space volume for gluons are \ninversely proportional to the coupling constant\n\n", "itemtype": "equation", "pos": 1170, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\\title{Isotropization and thermalization in heavy-ion collisions\\tnoteref{label1}}\n\n\n\n\n\n\n\n\n\n\\dochead{}\n\n\n\n\n\\title{Initial state of Heavy-Ion Collisions: Isotropization and thermalization}\n\n\n\n\n\n\n\\author[cern,stav]{Aleksi Kurkela}\n\n\\address[cern]{Theoretical Physics Department, CERN, Geneva, Switzerland}\n\\address[stav]{Faculty of Science and Technology, University of Stavanger, Norway}\n\n\\begin{abstract}\nI discuss how local thermal equilibrium and hydrodynamical flow are reached in heavy-ion collisions\nin the weak coupling limit. \n\n\\end{abstract}\n\n\\begin{keyword}\nQuark-gluon plasma, thermalization, heavy-ion collisions\n\n\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\n\n\n\\section{Introduction}\n\nOver the past decade we have seen a remarkable phenomenological success \nof describing heavy-ion collisions using relativistic hydrodynamics. In the modern\ntheoretical view, hydrodynamics is seen as a low energy effective \ntheory of the underlying quantum-field theory, and as such it is relying on an assumption\nthat the energy-momentum tensor can expanded around its thermal equilibrium value\n$T_{eq.}$ in terms of gradients of flow fields,\n\n", "index": 1, "text": "\\begin{equation}\nT^{\\mu\\nu} \\approx T_{eq.}^{\\mu\\nu}- 2 \\eta  \\nabla^{<\\mu}u^{\\nu>} +\\ldots,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"T^{\\mu\\nu}\\approx T_{eq.}^{\\mu\\nu}-2\\eta\\nabla^{&lt;\\mu}u^{\\nu&gt;}+\\ldots,\" display=\"block\"><mrow><mrow><msup><mi>T</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>≈</mo><mrow><mrow><msubsup><mi>T</mi><mrow><mi>e</mi><mi>q</mi><mo>.</mo></mrow><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msubsup><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>η</mi><mo>⁢</mo><mrow><msup><mo>∇</mo><mrow><mi/><mo>&lt;</mo><mi>μ</mi></mrow></msup><mo>⁡</mo><msup><mi>u</mi><mrow><mi>ν</mi><mo>&gt;</mo><mi/></mrow></msup></mrow></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">…</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03283.tex", "nexttext": "\nat the dominant momentum scale $Q_s$.\nIn contrast, a system that is in thermal equilibrium has phase space occupancies of the order of \nunity $f\\sim 1$ at the scale given by the temperature $T$. The challenge to understand the process of thermalization at weak coupling is then\nto understand how this overoccupied far-from-equilibrium state reaches the thermal state\nunder the violently expanding geometry of the heavy-ion collision.\n\n\nThe route the weakly coupled system takes to reach local thermal equilibrium is not straightforward. \nIndeed, it was first realized by Ref.~\\cite{Baier:2000sb} that under longitudinal expansion a system that is initially overoccupied\nbecomes underoccupied before it reaches thermal equilibrium. This behaviour is depicted\nin cartoon of Fig.~\\ref{fig:route} on a plane of occupancy and anisotropy. The interactions\nwork to bring the system directly from the overoccupied initial condition to the thermal\nequilibrium at the origin of the figure. Indeed, in the absence of expansion, the thermalization would\nproceed along a straightforward route with monotonically decreasing occupancies directly to thermal equilibrium \\cite{Kurkela:2011ti, Kurkela:2012hp,Schlichting:2012es,Kurkela:2014tea}.\nThe effect of the expansion, however, makes the system\nmore anisotropic. The combined effect of the two leads the system to miss the thermal \nequilibrium at the origin, and causes the system to flow to the underoccupied half of the diagram. This behaviour\nis examined in detail in Refs.~\\cite{Baier:2000sb,Kurkela:2011ti,Kurkela:2011ub}. \n\n\n\nOnce the system turns underoccupied, its physics changes qualitatively (in particular for inelastic scattering which\nchanges from merging to splitting), and this change eventually allows the system to reach\nthe thermal equilibrium. \n\n\nThat the system explores both the underoccupied and overoccupied regions of the diagram\nbefore settling to thermal equilibrium has a technical implication that the degrees of freedom\nthat are used to describe the system also change during the the prethermal evolution. \nOn one hand, as long as the system is overoccupied, it can be described in terms of classical Yang-Mills (CYM) theory.\n\\footnote{As long as the system is parametrically overoccupied, the fermions play only\na subleading role in thermalization as their occupancies cannot exceed 1 and therefore are always less numerous\nas the gluons. } The corrections to classical field theory description comes from non-zero coupling\n $\\alpha_s$ and from small occupancies $\\mathcal{O}(f^{-2})$ \\cite{Mueller:2002gd,Jeon:2004dh}. \nWhen the occupancies become less large, the ``quantum corrections'' arising from the expansion\nin the inverse occupancy become large, and the when $f \\sim 1$, the classical theory fails to give a faithful description of the system.  \nTherefore the classical description can never reach the thermal equilibrium with $f \\sim 1$. \n\nOn the other hand, once the system becomes underoccupied, it is better described in terms of \nparticle degrees of freedoms and their kinetic theory. The expansion parameters of the kinetic theory \ndescription are again the coupling constant itself, $\\alpha_s$, but also the occupancies $\\alpha_s f$.\nTherefore the effective kinetic theory can be used to describe systems that are underoccupied, and the \ndescription can be extended to occupancies that are large but not non-perturbatively large $f \\ll 1/\\alpha_s$, so that it can reach the thermal equilibrium but not the CGC initial condition. \n\\begin{figure}\n\\hfill\n\\includegraphics[width=0.4\\textwidth]{epelbaum_gelis}\n\\hfill\n\\includegraphics[width=0.35\\textwidth]{cdplane_schlichting}\n\\hfill\n\\vspace{-0.4cm}\n\\caption{\n\\label{fig:clas}\nClassical evolution of the system. (Left) The time evolution of the components of energy momentum tensor from\na simulation initialized with CGC initial condition from \\cite{Gelis:2013rba}. At late times the system becomes ever more anisotropic (Right) Trajectories of classical simulations in the plane of anisotropy and occupancy with different initial conditions \\cite{Berges:2013fga}. All the trajectories become eventually more anisotropic and dilute irrespective of the details of the initial condition. The classical Yang-Mills theory never thermalizes or isotropizes.\n}\n\\end{figure}\n\n\nNeither of the descriptions, the classical field theory or the kinetic theory, can cover the whole \ntime evolution of the system from the overoccupied initial condition to thermal equilibrium.  However,\na strategy where the early evolution is described by classical Yang-Mills theory and where \nthe late approach to hydrodynamics is dealt within kinetic theory, can indeed bring the overoccupied initial\ncondition to thermal equilibrium. In such strategy, the system must be passed from\none set of degrees of freedom (the classical YM fields) to another (distribution functions of kinetic theory).\nThis transfer is made possible by the parametrically large region of overlapping validity\nof both description. Indeed for\n\n", "itemtype": "equation", "pos": 8293, "prevtext": "\nwhere the terms in the series are graded by the number of derivatives\nacting on the flow fields $u(x)$ \\cite{Baier:2007ix}. If the flow fields are sufficiently\nsmooth, the flow is well described in terms of the few first terms in the series,\nbut when the gradients are large, the system is no longer described in terms\nof hydrodynamics. \n\nDue to the singular geometry of an ultra-relativistic heavy-ion collision, the gradients of the \nflow fields diverge when approaching $\\tau \\rightarrow 0^+$,  the moment when the two Lorentz\ncontracted nuclei first collided. Therefore it is clear that the full time evolution of the \ncollision is not amendable for hydrodynamical description and any hydrodynamical\nsimulation has to start at some \\emph{initialization time}  $\\tau_i$ after the collision, \nwhen the hydrodynamical description has become appropriate. The dynamics before\nthis time are \\emph{prethermal} dynamics. \n\nThe minimal requirement on the prethermal model is that it smoothly and automatically\napproaches hydrodynamical flow. If this is the case, then the physical results become\nindependent of the unphysical choice of initialization time. This, however, is not the \ncase in the vast majority of current implementations where the prethermal evolution is\neither completely neglected, \nor modelled in a way that does not contain the\ncorrect physics to reach hydrodynamical flow. \nThe residual dependence\npromotes the unphysical initialization time to a physical model parameter often referred as the \\emph{thermalization time} which needs to be \nfixed by comparison to data. \nThe problem is not only phenomenological. From the theoretical point of view, the failure to\nreach correct behaviour is a sign of failure to identify the correct dominant physics.\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.4\\textwidth]{cartoon4.eps}\n\\end{center}\n\\caption{\n\\label{fig:route}\nA cartoon of the path from Color-Glass-Condensate initial condition to the thermal equilibrium in \na plane of occupancy and anisotropy. At proper time $\\tau \\sim Q_s^{-1}$, the system is parametrically\noveroccupied. Initially, the interactions are not strong enough to counter the expansion, and the system\nbecomes more anisotropic and dilute. Once the modes become underoccupied the dominant physics\nchange qualitatively and the system does not become anymore anisotropic. Eventually the underoccupied\nsystem reaches equilibrium through the process of radiative break-up that causes the trajectory eventually\nturn towards the origin in the figure. The system is described by classical field theory in the overoccupied region,\nand by effective kinetic theory both in the underoccupied and overoccupied side, except when occupancies are\nnon-perturbatively large $f\\sim 1/\\alpha$.\n}\n\\end{figure}\n\nThere have been two quite different strategies to attempt to quantitatively understand the \nprethermal evolution. On one hand, with\nholographic methods, it has become possible to follow the far-from-equilibrium\nevolution of certain gauge theories ($\\mathcal{N}=4$ SYM in the $N_c\\rightarrow \\infty$ limit)\nand observe the onset of hydrodynamical flow in collisions of sheets or lumps of supersymmetric matter \\cite{Chesler:2008hg, Chesler:2010bi}. This has made it possible to \nconstruct a model that explicitly exhibits insensitivity to \ninitialization time \\cite{vanderSchee:2013pia}.\n\n The holographic method is, however, critically limited to a very special set of theories and cannot \nbe applied to QCD. The complementary strategy has been to study\nthe prethermal evolution in QCD in the weak coupling limit (corresponding to the limit\nof $\\sqrt{s}\\rightarrow \\infty$), where in principle we expect to have analytical control of the theory.\nIn this limit, the initial condition for the prethermal evolution is fairly well understood in\nterms of the physics of saturation and the Color-Glass-Condensate framework \\cite{Gelis:2010nm}.\nThere have been several weak coupling motivated or inspired models used for phenomenology,\nbut none of these have so far quantitatively included all the necessary physics for a \nleading order calculation. However, in the recent past there has been significant progress, that will\n be reviewed in these proceedings. \n\nAt weak coupling the smallness of coupling provides us with large scale separations. \nWhile the task of following the time evolution of a full quantum field theory is an unsolved\nproblem, these scale separations make it possible to study the prethermal evolution within different\neffective theories, in particular using classical field theory and effective kinetic theory.\nBut while the scale separations make it possible to follow the time evolution of the system, they also \nmake the prethermal evolution go through several stages of very different physics, all of which\nmust be quantitatively understood for a full leading order description of the prethermal evolution.\n\nThis proceeding is organized as follows. In Sec.~\\ref{sec:route} I describe the overall features of the  thermalization process\nand what are the roles of classical field theory and effective kinetic theory in its description. In the following Sections \\ref{sec:clas} \nand  \\ref{sec:kin} I discuss briefly recent simulations in classical Yang-Mills theory and in effective kinetic theory. \nI conclude with a discussion about the relevance of weak coupling thermalization to future phenomenology.\n\n\n\\section{Route to equilibrium, degrees of freedom, and the weak coupling strategy}\n\\label{sec:route}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{cartoon_3.eps}\n\\end{center}\n\\caption{\n\\label{fig2}\nA cartoon of the strategy to bring the highly overoccupied Color-Glass-Condition initial condition to hydrodynamical region by a combination \nof classical Yang-Mills (CYM) simulations and effective kinetic theory (EKT). At early times the occupancies are non-perturbative $f\\sim 1/\\alpha$ \nthe system is described in classical YM theory. The CYM evolution however makes the system ever more dilute and anisotropic never approaching \nlocal thermal equilibrium and hydrodynamic description. When the occupancies are $1\\gg f \\gg 1/\\alpha_s$ both CYM and EKT give equally good leading\norder description and the system can be smoothly passed from classical fields to particles at arbitrary time $\\tau_{EKT}$. The subsequent evolution\nin EKT will then deviate from the classical field evolution once the occupancies become close to unity $f\\sim 1$ and smoothly and automatically asymptote to hydrodynamical evolution. \n}\n\\end{figure}\n\nAccording to the picture arising from the saturation framework and CGC, the \npost-collisional debris that are left in the midrapidity region, and that will\neventually form the hydrodynamically expanding medium, consist of parametrically\noveroccupied gluon fields at a typical saturation scale $Q_s$ \\cite{Gelis:2010nm}.That is, the \ntypical mode occupancies per unit phase phase space volume for gluons are \ninversely proportional to the coupling constant\n\n", "index": 3, "text": "\\begin{equation}\n\\frac{d N_{gluons}}{d^3p \\, d^3x }\\equiv f \\sim \\frac{1}{\\alpha_s}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{dN_{gluons}}{d^{3}p\\,d^{3}x}\\equiv f\\sim\\frac{1}{\\alpha_{s}}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>N</mi><mrow><mi>g</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>p</mi></mpadded><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>x</mi></mrow></mfrac><mo>≡</mo><mi>f</mi><mo>∼</mo><mfrac><mn>1</mn><msub><mi>α</mi><mi>s</mi></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03283.tex", "nexttext": "\nboth the CYM and the kinetic theory give a leading order accurate description of the non-equibrium\nsystem. This region is denoted by the green area labelled ``Both'' in Fig.~\\ref{fig:route}, where \nFourier transforms of the classical fields can be interpreted as particle distributions.\n\n\n\n\n\nWithin this region, first evolving the gauge fields\naccording to the classical equations of motions and then Fourier transforming, is equivalent to first taking the Fourier transform of the fields and then evolving the distribution function in kinetic theory up to corrections that are $\\mathcal{O}(f^{-2})$, and $\\mathcal{O}(\\alpha_s f)$.\n\nA cartoon of the weak coupling strategy is displayed in Fig.~\\ref{fig2}. At early times when the occupancies are non-perturbative $f\\sim  1/\\alpha_s$ the \nsystem is described in classical Yang-Mills theory. The classical evolution will quickly dilute the system and render the occupancies perturbative  $f \\ll 1/\\alpha_s$ . At any time $\\tau_{EKT}$ during the window when the typical occupancies are large but perturbative $1 \\gg f \\gg 1/\\alpha_s$, the system may be passed to the kinetic theory description. As both descriptions are equivalent in this region, any residual dependence on $\\tau_{EKT}$ is a higher order effect.  The subsequent evolution in EKT will then deviate from the classical field evolution once the occupancies become close to unity $f\\sim 1$ and eventually it will smoothly and automatically asymptote to hydrodynamical evolution. At this point, the system may be passed at any arbitrary time $\\tau_i$ to a hydrodynamical \ndescription.\n\n\nThere has been significant quantitative progress in understanding the different pieces of this jigsaw puzzle, both\non the classical Yang-Mills side as well as on the kinetic theory side. In the rest of this contribution I will review\nsome of this progress and point out how the different works relate to the strategy outlined above. \n\n\n\n\\section{Classical field evolution}\n\\label{sec:clas}\n\nThe classical Yang-Mills simulations starting with various incarnations of CGC initial conditions\nhave appeared in the literature for a quite some time \\cite{Krasnitz:1998ns,Krasnitz:1999wc,  Lappi:2003bi}.\nMore recent simulations include, e.g., JIMWLK renormalization group evolution \\cite{Lappi:2011ju} of the initial condition. \nThe CGC initial condition is boost invariant, and therefore the early simulations were performed in 2+1D space-time dimensions. \n The boost invariance is, however, broken by fast growing (Chromo-Weibel) unstable modes seeded by \n small fluctuations (with quantum or other origin), and modern simulations have included full 3+1D dynamics\n\\cite{Berges:2013eia,Berges:2013fga,Gelis:2013rba}.\n\nFigure \\ref{fig:clas} (left) from Ref.~\\cite{Gelis:2013rba} shows the evolution of the transverse and longitudinal pressure starting from CGC initial condition\nas described by the McLerran-Venugopalan model \\cite{McLerran:1993ka}. The initial condition consists of coherent fields, leading\nto negative longitudinal pressure. The coherence is quickly lost in a time scale of $1/Q_s$ and the longitudinal \npressure becomes positive. At later times, the anisotropy $P_T/P_L$ grows consistent with the expectation\nof Fig.~\\ref{fig:route}.\n\n\n\n\nThe very early time evolution $\\tau_{EKT}\\lesssim 1/Q_s$ has been also studied analytically\nin a recent paper \\cite{Chen:2015wia}.\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.4\\textwidth]{cdplot.eps}\n\\end{center}\n\\caption{\n\\label{fig:nroute}\nTrajectories of effective kinetic theory simulations at different values of the coupling constant. The simulations start with an initial condition that is given by classical Yang-Mills simulation. The non-trivial limit of $\\alpha_s \\rightarrow 0$ with $\\alpha_s f$ fixed corresponds to classical Yang-Mills limit and the trajectory becomes ever more anisotropic and dilute. At finite $\\alpha_s$ the evolution differs from the CYM limit once $f\\sim 1$ is reached, and the subsequent evolution brings the trajectory to thermal equilibrium marked with a black cross. \n}\n\\end{figure}\n\n\nA complementary study \\cite{Berges:2013eia,Berges:2013fga} discusses the late time limit of the classical evolution. It demonstrates the robustness\nof the conclusion that the classical evolution leads to a system that becomes ever more dilute and \nanisotropic. The authors start their simulation with a broad range of different initial conditions, that is, with different\ninitial occupancies and anisotropies. It is observed that irrespective of the initial condition, the classical \nevolution leads to universal behaviour with occupancies decreasing and anisotropy increasing as a power law of proper time. This behaviour is depicted in Fig.~\\ref{fig:clas} (right), where the different simulations\nfall on a single trajectory on a plane of anisotropy and occupancy. This figure can be taken of as a numerical realization\nof the right hand side of the Fig.~\\ref{fig:route}. \n\nThe classical dynamics will make the system ever more anistropic and dilute. At some point, however, the \noccupancies become of order unity and the classical approximation fails. This breaking is not, however, \nsignalled in any way in the classical simulation; $\\hbar$ does not appear anywhere in the classical \nsimulation and the fields amplitudes can decrease ad infinitum. For a faithful description, however, before this failure one \nshould switch to the kinetic theory description, whose behaviour changes qualitatively around $f\\sim 1$.\n\n\\section{Classical particle evolution}\n\\label{sec:kin}\n\nThe effective kinetic theory (EKT) of quarks and gluons that is accurate to leading order in the coupling \nconstant, is formulated in \\cite{Arnold:2002zm}.\n The EKT is applied in a wide variety of dynamical non-equilibrium and transport phenomena, e.g., in the computation of leading order transport coefficients in QCD \\cite{Arnold:2003zc} as well as jet phenomenology \\cite{Schenke:2009gb}.  \nThe quantitative equivalence of the EKT with CYM in the overoccupied far-from-equilibrium setup\nhas been numerically demonstrated in an isotropic setup in \\cite{York:2014wja}. \n\nFig.~\\ref{fig:nroute} displays the non-equilibrium evolution of a system within kinetic theory from \\cite{Kurkela:2015qoa}. \nThe initial condition for the kinetic theory evolution is a parametrization of a CYM simulation at a switching time $\\tau_{EKT} = 1/Q_s$. The \nparametrisation is chosen to match energy density $\\varepsilon$ and $\\langle p_T \\rangle$ with the classical simulation of \\cite{Lappi:2011ju} at $\\tau_{EKT}$. The figure contains \ntrajectories from simulations with different values of the coupling constant $\\alpha_s$. The x-axis is rescaled with $\\alpha_s$ such that  \nfor all values of $\\alpha_s$, overoccupied initial condition with $f\\sim 1/\\alpha_s$ falls on the same point in the plane of occupancy and \naniostropy. With such a rescaling, taking the limit $\\alpha_s \\rightarrow 0$ keeping the initial $\\alpha_s f$ fixed, gives a non-trivial limit that \ncorresponds to the CYM. In terms of the figure, this limit corresponds to sending $f\\sim 1$ to infinitely far to the left, so that occupancies of order one are never reached in a simulation. This trajectory is labelled ``classical YM'', and indeed what is seen is consistent with CYM simulations. The system \nbecomes ever more dilute and anisotropic and never thermalizes.\n\nFor a small but non-zero $\\alpha_s$, the kinetic theory simulation eventually reaches $f\\sim 1$, and the qualitative change in the dynamics\nis clearly visible in the line labelled ``Bottom-Up'' in Fig.~\\ref{fig:nroute}. When the occupancies become small, the EKT simulation deviates from the classical limit and the growth of the anisotropy stops. Eventually the EKT evolution brings the trajectory close to thermal equilibrium  Fig.~\\ref{fig:nroute} as anticipated by \\cite{Baier:2000sb} and consistent with expectation of Fig.~\\ref{fig:route}.\n\nIncreasing the coupling further does not lead into further qualitative change. At larger couplings, the features in the trajectory arising from \nthe scale separations provided by the weak coupling do become less pronounced and the system takes a somewhat more straightforward path to equilibrium. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.45\\textwidth]{hydro_plot_F1.eps}\n\\hfill\n\\includegraphics[width=0.45\\textwidth]{hydro_plot_F10.eps}\n\\end{center}\n\\vspace{-0.4cm}\n\\caption{\nThe time evolution of the components of the energy-momentum tensor from EKT simulations with $\\alpha_s \\approx 0.03$ (left) and $\\alpha_s \\approx 0.3$ (right). The y-axis is rescaled by $\\tau^{4/3}$ so that the horizontal lines correspond to ideal hydrodynamics. The approach to hydrodynamics is governed by parameter free prediction of viscous hydrodynamics (blue dashed lines). \n\\label{fig:hydro}\n}\n\\end{figure}\n\n\n\\subsection{Hydrodynamization}\nAs the kinetic theory evolution brings the system close to thermal equilibrium, it should at late times be described by hydrodynamics. \nThis is illustrated in Fig.~\\ref{fig:hydro}, which depicts the time evolution of the components of the energy momentum tensor from \na simulation with $\\alpha_s \\approx 0.03$ (left) and $\\alpha_s \\approx 0.3$ (right). The energy\ndensity $\\varepsilon$ and the transverse and longitudinal pressures $P_T$ and $P_L$ are normalized by $\\tau^{4/3}$. With this normalization, if the evolution is described by ideal hydrodynamics (with conformal equation of state ) for which $\\varepsilon/3= P_T = P_L \\propto \\tau^{-4/3}$, the lines should be horizontal and fall on top of each other. It can be clearly seen from the figure that indeed at late times, the \nlines asymptote to horizontal lines, and at late times the system is indeed described by ideal hydrodynamics.\n\nAccording to the hydrodynamical theory, the approach to ideal hydrodynamics should be described by viscous hydrodynamics, which gives a prediction that depends only on\nthe shear viscosity $\\eta$ of the matter. As this is a well known quantity at weak coupling \\cite{Arnold:2003zc}, the comparison with \nthe parameter free prediction of hydrodynamics provides a very robust test. \nThe prediction\nfrom viscous hydrodynamics is shown as the blue dashed line in Fig.~\\ref{fig:hydro}. The approach is\nwell captured by the hydrodynamical prediction for both couplings shown. For the small coupling $\\alpha_s \\approx 0.03$,\nthe viscous hydrodynamics agrees with the kinetic theory simulation at very late times $\\tau \\sim 5000/Q_s$. The \nsimulation with intermediate coupling $\\alpha_s \\approx 0.3$ shows qualitatively similar features but differs quantitatively; it follows the hydrodynamical line already around $\\tau \\sim 10/Q_s$.\nConverting this to physical units using a typical estimate of $Q_s \\approx 2$GeV gives hydrodynamization times of $\\sim 1$fm/c. \nIt is quite remarkable that the hydrodynamical theory works already at this time, when the anisotropies are still quite large $P_L/P_T \\sim 0.2$.\n\n\n\\section{Discussions}\nIn these proceedings I have discussed the not-so-straight-forward way the heavy-ion collisions thermalize, isotropize,\nand reach hydrodynamical flow in the limit of weak coupling. The system undergoes two smoothly connected stages before hydrodynamizing, the overoccupied and the underoccupied stages. These stages must be described in terms of different degrees of freedom, either in terms of classical fields or in terms of (semi-)classical particles. \nThe thermalization times, obtained from the weak coupling framework extrapolated to intermediate couplings show agreement with the phenomenological expectation of $\\sim$1fm/c.\n\n\nThe effective kinetic theory framework that describes the thermalization is used also to describe physics at widely different energy scales in the collision such as photon production and jet quenching. As such, the unifying kinetic theory prescription and the early time dynamics builds a bridge between the soft physics of flow and hard probes. \n\nAt present there are still several caveats that need to be ironed out before the model is ready for realistic phenomenology. So far the \nstudies do not include fermions, which play a subleading role in the process of thermalization due to fermi statistics and color factors. \nHowever, the thermalization of fermions is crucial, for example, to electromagnetic probes, and if the chemical equilibration happens delayed with respect to kinematic thermalization, one could question whether the 2+1 flavour equation of state is the right EoS to use at early times in hydrodynamical simulations. The current implementation of the EKT does not allow for transverse dynamics, which is a crucial for the preflow, and the numerical role of certain plasma unstable modes is still somewhat unclear. Also, further work in the interface between the CYM and EKT is needed. However, while there are still several caveats, the list is getting shorter and the field of weak coupling thermalization is becoming a quantitative field. \n\nHow much of this theoretical exercise performed at the weak coupling limit carries through to physical heavy-ion collisions that are performed at RHIC or at the LHC, which unfortunately do not run at the asymptotic limit $\\sqrt{s}\\rightarrow \\infty$? Are we allowed to extrapolate the weak coupling results to the relevant interesting intermediate couplings around $\\alpha_s = 0.3$? A pessimist view would be to note that perturbation theory at finite temperature is notoriously badly convergent at temperatures close to $T_c$ \\cite{Kajantie:2002wa}. However, an optimist would notice that as the thermalization takes place rather fast, the resulting temperatures at $\\tau_{EKT}$ are still of order $3-4T_c$. This does lie in the temperature range where the perturbation theory in its modern incarnations seems to describe lattice results. The hydrodynamical evolution will eventually cool the system to a temperature range where a weak coupling description of the medium most likely is inappropriate, but by then the system has been already passed to a hydrodynamical description. As the hydrodynamical analysis mostly \nconstrain the minimum of $\\eta/s$ around $T_c$ \\cite{Niemi:2015qia}, not its value around $3T_c$, this picture is not in contrast with the phenomenology and the paradigm of small $\\eta/s$. \n\nSo far the strategy has been to extrapolate the weak coupling results to intermediate couplings expected to realize in physical collisions. The same goes for the strong coupling studies where the results obtained at infinite coupling are again extrapolated down to intermediate couplings. However, perhaps a better strategy than extrapolating would be to use all available information to constrain the intermediate couplings; to interpolate rather than extrapolate. First steps in this direction are taken in \\cite{Keegan:2015avk}, where non-equilibrium evolutions of strongly and weakly coupled theories with similar initial conditions are compared.  \n\nWhether the strategy is to extrapolate or to interpolate in coupling, it is clear that it is of importance to push the calculations beyond the \nleading order accuracy, both at weak and at strong coupling in order to increase precision of the results and to better evaluate at what range of couplings they provide useful constraints. While it\nwill be a long way to NLO, there have been important advances in the recent past to this direction \\cite{Ghiglieri:2015ala}. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{10}\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\expandafter\\ifx\\csname href\\endcsname\\relax\n  \\def\\href#1#2{#2} \n\\def\\path#1{#1}\\fi\n\n\n\\bibitem{Baier:2007ix}\nR.~Baier, P.~Romatschke, D.~T. Son, A.~O. Starinets, M.~A. Stephanov,\n  {Relativistic viscous hydrodynamics, conformal invariance, and holography},\n  JHEP 04 (2008) 100.\n\\newblock \\href {http://arxiv.org/abs/0712.2451} {\\path{arXiv:0712.2451}},\n  \\href {http://dx.doi.org/10.1088/1126-6708/2008/04/100}\n  {\\path{doi:10.1088/1126-6708/2008/04/100}}.\n\n\\bibitem{Chesler:2008hg}\nP.~M. Chesler, L.~G. Yaffe, {Horizon formation and far-from-equilibrium\n  isotropization in supersymmetric Yang-Mills plasma}, Phys. Rev. Lett. 102\n  (2009) 211601.\n\\newblock \\href {http://arxiv.org/abs/0812.2053} {\\path{arXiv:0812.2053}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.102.211601}\n  {\\path{doi:10.1103/PhysRevLett.102.211601}}.\n\n\\bibitem{Chesler:2010bi}\nP.~M. Chesler, L.~G. Yaffe, {Holography and colliding gravitational shock waves\n  in asymptotically $AdS_5$ spacetime}, Phys. Rev. Lett. 106 (2011) 021601.\n\\newblock \\href {http://arxiv.org/abs/1011.3562} {\\path{arXiv:1011.3562}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.106.021601}\n  {\\path{doi:10.1103/PhysRevLett.106.021601}}.\n\n\\bibitem{vanderSchee:2013pia}\nW.~van~der Schee, P.~Romatschke, S.~Pratt, {Fully Dynamical Simulation of\n  Central Nuclear Collisions}, Phys. Rev. Lett. 111~(22) (2013) 222302.\n\\newblock \\href {http://arxiv.org/abs/1307.2539} {\\path{arXiv:1307.2539}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.111.222302}\n  {\\path{doi:10.1103/PhysRevLett.111.222302}}.\n\n\\bibitem{Gelis:2010nm}\nF.~Gelis, E.~Iancu, J.~Jalilian-Marian, R.~Venugopalan, {The Color Glass\n  Condensate}, Ann. Rev. Nucl. Part. Sci. 60 (2010) 463--489.\n\\newblock \\href {http://arxiv.org/abs/1002.0333} {\\path{arXiv:1002.0333}},\n  \\href {http://dx.doi.org/10.1146/annurev.nucl.010909.083629}\n  {\\path{doi:10.1146/annurev.nucl.010909.083629}}.\n\n\\bibitem{Baier:2000sb}\nR.~Baier, A.~H. Mueller, D.~Schiff, D.~T. Son, {'Bottom up' thermalization in\n  heavy ion collisions}, Phys. Lett. B502 (2001) 51--58.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0009237}\n  {\\path{arXiv:hep-ph/0009237}}, \\href\n  {http://dx.doi.org/10.1016/S0370-2693(01)00191-5}\n  {\\path{doi:10.1016/S0370-2693(01)00191-5}}.\n\n\\bibitem{Kurkela:2011ti}\nA.~Kurkela, G.~D. Moore, {Thermalization in Weakly Coupled Nonabelian Plasmas},\n  JHEP 12 (2011) 044.\n\\newblock \\href {http://arxiv.org/abs/1107.5050} {\\path{arXiv:1107.5050}},\n  \\href {http://dx.doi.org/10.1007/JHEP12(2011)044}\n  {\\path{doi:10.1007/JHEP12(2011)044}}.\n\n\\bibitem{Kurkela:2012hp}\nA.~Kurkela, G.~D. Moore, {UV Cascade in Classical Yang-Mills Theory}, Phys.\n  Rev. D86 (2012) 056008.\n\\newblock \\href {http://arxiv.org/abs/1207.1663} {\\path{arXiv:1207.1663}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.86.056008}\n  {\\path{doi:10.1103/PhysRevD.86.056008}}.\n\n\\bibitem{Schlichting:2012es}\nS.~Schlichting, {Turbulent thermalization of weakly coupled non-abelian\n  plasmas}, Phys. Rev. D86 (2012) 065008.\n\\newblock \\href {http://arxiv.org/abs/1207.1450} {\\path{arXiv:1207.1450}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.86.065008}\n  {\\path{doi:10.1103/PhysRevD.86.065008}}.\n\n\\bibitem{Kurkela:2014tea}\nA.~Kurkela, E.~Lu, {Approach to Equilibrium in Weakly Coupled Non-Abelian\n  Plasmas}, Phys. Rev. Lett. 113~(18) (2014) 182301.\n\\newblock \\href {http://arxiv.org/abs/1405.6318} {\\path{arXiv:1405.6318}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.113.182301}\n  {\\path{doi:10.1103/PhysRevLett.113.182301}}.\n\n\\bibitem{Kurkela:2011ub}\nA.~Kurkela, G.~D. Moore, {Bjorken Flow, Plasma Instabilities, and\n  Thermalization}, JHEP 11 (2011) 120.\n\\newblock \\href {http://arxiv.org/abs/1108.4684} {\\path{arXiv:1108.4684}},\n  \\href {http://dx.doi.org/10.1007/JHEP11(2011)120}\n  {\\path{doi:10.1007/JHEP11(2011)120}}.\n\n\\bibitem{Mueller:2002gd}\nA.~H. Mueller, D.~T. Son, {On the Equivalence between the Boltzmann equation\n  and classical field theory at large occupation numbers}, Phys. Lett. B582\n  (2004) 279--287.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0212198}\n  {\\path{arXiv:hep-ph/0212198}}, \\href\n  {http://dx.doi.org/10.1016/j.physletb.2003.12.047}\n  {\\path{doi:10.1016/j.physletb.2003.12.047}}.\n\n\\bibitem{Jeon:2004dh}\nS.~Jeon, {The Boltzmann equation in classical and quantum field theory}, Phys.\n  Rev. C72 (2005) 014907.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0412121}\n  {\\path{arXiv:hep-ph/0412121}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.72.014907}\n  {\\path{doi:10.1103/PhysRevC.72.014907}}.\n\n\\bibitem{Gelis:2013rba}\nT.~Epelbaum, F.~Gelis, {Pressure isotropization in high energy heavy ion\n  collisions}, Phys. Rev. Lett. 111 (2013) 232301.\n\\newblock \\href {http://arxiv.org/abs/1307.2214} {\\path{arXiv:1307.2214}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.111.232301}\n  {\\path{doi:10.1103/PhysRevLett.111.232301}}.\n\n\\bibitem{Berges:2013fga}\nJ.~Berges, K.~Boguslavski, S.~Schlichting, R.~Venugopalan, {Universal attractor\n  in a highly occupied non-Abelian plasma}, Phys. Rev. D89~(11) (2014) 114007.\n\\newblock \\href {http://arxiv.org/abs/1311.3005} {\\path{arXiv:1311.3005}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.89.114007}\n  {\\path{doi:10.1103/PhysRevD.89.114007}}.\n\n\\bibitem{Krasnitz:1998ns}\nA.~Krasnitz, R.~Venugopalan, {Nonperturbative computation of gluon minijet\n  production in nuclear collisions at very high-energies}, Nucl. Phys. B557\n  (1999) 237.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/9809433}\n  {\\path{arXiv:hep-ph/9809433}}, \\href\n  {http://dx.doi.org/10.1016/S0550-3213(99)00366-1}\n  {\\path{doi:10.1016/S0550-3213(99)00366-1}}.\n\n\\bibitem{Krasnitz:1999wc}\nA.~Krasnitz, R.~Venugopalan, {The Initial energy density of gluons produced in\n  very high-energy nuclear collisions}, Phys. Rev. Lett. 84 (2000) 4309--4312.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/9909203}\n  {\\path{arXiv:hep-ph/9909203}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevLett.84.4309}\n  {\\path{doi:10.1103/PhysRevLett.84.4309}}.\n\n\\bibitem{Lappi:2003bi}\nT.~Lappi, {Production of gluons in the classical field model for heavy ion\n  collisions}, Phys. Rev. C67 (2003) 054903.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0303076}\n  {\\path{arXiv:hep-ph/0303076}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.67.054903}\n  {\\path{doi:10.1103/PhysRevC.67.054903}}.\n\n\\bibitem{Lappi:2011ju}\nT.~Lappi, {Gluon spectrum in the glasma from JIMWLK evolution}, Phys. Lett.\n  B703 (2011) 325--330.\n\\newblock \\href {http://arxiv.org/abs/1105.5511} {\\path{arXiv:1105.5511}},\n  \\href {http://dx.doi.org/10.1016/j.physletb.2011.08.011}\n  {\\path{doi:10.1016/j.physletb.2011.08.011}}.\n\n\\bibitem{Berges:2013eia}\nJ.~Berges, K.~Boguslavski, S.~Schlichting, R.~Venugopalan, {Turbulent\n  thermalization process in heavy-ion collisions at ultrarelativistic\n  energies}, Phys. Rev. D89~(7) (2014) 074011.\n\\newblock \\href {http://arxiv.org/abs/1303.5650} {\\path{arXiv:1303.5650}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.89.074011}\n  {\\path{doi:10.1103/PhysRevD.89.074011}}.\n\n\\bibitem{McLerran:1993ka}\nL.~D. McLerran, R.~Venugopalan, {Gluon distribution functions for very large\n  nuclei at small transverse momentum}, Phys. Rev. D49 (1994) 3352--3355.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/9311205}\n  {\\path{arXiv:hep-ph/9311205}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevD.49.3352}\n  {\\path{doi:10.1103/PhysRevD.49.3352}}.\n\n\\bibitem{Chen:2015wia}\nG.~Chen, R.~J. Fries, J.~I. Kapusta, Y.~Li, {Early Time Dynamics of Gluon\n  Fields in High Energy Nuclear Collisions}, Phys. Rev. C92 (2015) 064912.\n\\newblock \\href {http://arxiv.org/abs/1507.03524} {\\path{arXiv:1507.03524}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.92.064912}\n  {\\path{doi:10.1103/PhysRevC.92.064912}}.\n\n\\bibitem{Arnold:2002zm}\nP.~B. Arnold, G.~D. Moore, L.~G. Yaffe, {Effective kinetic theory for high\n  temperature gauge theories}, JHEP 01 (2003) 030.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0209353}\n  {\\path{arXiv:hep-ph/0209353}}, \\href\n  {http://dx.doi.org/10.1088/1126-6708/2003/01/030}\n  {\\path{doi:10.1088/1126-6708/2003/01/030}}.\n\n\\bibitem{Arnold:2003zc}\nP.~B. Arnold, G.~D. Moore, L.~G. Yaffe, {Transport coefficients in high\n  temperature gauge theories. 2. Beyond leading log}, JHEP 05 (2003) 051.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0302165}\n  {\\path{arXiv:hep-ph/0302165}}, \\href\n  {http://dx.doi.org/10.1088/1126-6708/2003/05/051}\n  {\\path{doi:10.1088/1126-6708/2003/05/051}}.\n\n\\bibitem{Schenke:2009gb}\nB.~Schenke, C.~Gale, S.~Jeon, {MARTINI: An Event generator for relativistic\n  heavy-ion collisions}, Phys. Rev. C80 (2009) 054913.\n\\newblock \\href {http://arxiv.org/abs/0909.2037} {\\path{arXiv:0909.2037}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.80.054913}\n  {\\path{doi:10.1103/PhysRevC.80.054913}}.\n\n\\bibitem{York:2014wja}\nM.~C. Abraao~York, A.~Kurkela, E.~Lu, G.~D. Moore, {UV cascade in classical\n  Yang-Mills theory via kinetic theory}, Phys. Rev. D89~(7) (2014) 074036.\n\\newblock \\href {http://arxiv.org/abs/1401.3751} {\\path{arXiv:1401.3751}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.89.074036}\n  {\\path{doi:10.1103/PhysRevD.89.074036}}.\n\n\\bibitem{Kurkela:2015qoa}\nA.~Kurkela, Y.~Zhu, {Isotropization and hydrodynamization in weakly coupled\n  heavy-ion collisions}, Phys. Rev. Lett. 115~(18) (2015) 182301.\n\\newblock \\href {http://arxiv.org/abs/1506.06647} {\\path{arXiv:1506.06647}},\n  \\href {http://dx.doi.org/10.1103/PhysRevLett.115.182301}\n  {\\path{doi:10.1103/PhysRevLett.115.182301}}.\n\n\\bibitem{Kajantie:2002wa}\nK.~Kajantie, M.~Laine, K.~Rummukainen, Y.~Schroder, {The Pressure of hot QCD up\n  to g6 ln(1/g)}, Phys. Rev. D67 (2003) 105008.\n\\newblock \\href {http://arxiv.org/abs/hep-ph/0211321}\n  {\\path{arXiv:hep-ph/0211321}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevD.67.105008}\n  {\\path{doi:10.1103/PhysRevD.67.105008}}.\n\n\\bibitem{Niemi:2015qia}\nH.~Niemi, K.~J. Eskola, R.~Paatelainen, {Event-by-event fluctuations in\n  perturbative QCD + saturation + hydro model: pinning down QCD matter shear\n  viscosity in ultrarelativistic heavy-ion collisions}\\href\n  {http://arxiv.org/abs/1505.02677} {\\path{arXiv:1505.02677}}.\n\n\\bibitem{Keegan:2015avk}\nL.~Keegan, A.~Kurkela, P.~Romatschke, W.~van~der Schee, Y.~Zhu, {Weak and\n  strong coupling equilibration in nonabelian gauge theories}\\href\n  {http://arxiv.org/abs/1512.05347} {\\path{arXiv:1512.05347}}.\n\n\\bibitem{Ghiglieri:2015ala}\nJ.~Ghiglieri, G.~D. Moore, D.~Teaney, {Jet-Medium Interactions at NLO in a\n  Weakly-Coupled Quark-Gluon Plasma}\\href {http://arxiv.org/abs/1509.07773}\n  {\\path{arXiv:1509.07773}}.\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 13412, "prevtext": "\nat the dominant momentum scale $Q_s$.\nIn contrast, a system that is in thermal equilibrium has phase space occupancies of the order of \nunity $f\\sim 1$ at the scale given by the temperature $T$. The challenge to understand the process of thermalization at weak coupling is then\nto understand how this overoccupied far-from-equilibrium state reaches the thermal state\nunder the violently expanding geometry of the heavy-ion collision.\n\n\nThe route the weakly coupled system takes to reach local thermal equilibrium is not straightforward. \nIndeed, it was first realized by Ref.~\\cite{Baier:2000sb} that under longitudinal expansion a system that is initially overoccupied\nbecomes underoccupied before it reaches thermal equilibrium. This behaviour is depicted\nin cartoon of Fig.~\\ref{fig:route} on a plane of occupancy and anisotropy. The interactions\nwork to bring the system directly from the overoccupied initial condition to the thermal\nequilibrium at the origin of the figure. Indeed, in the absence of expansion, the thermalization would\nproceed along a straightforward route with monotonically decreasing occupancies directly to thermal equilibrium \\cite{Kurkela:2011ti, Kurkela:2012hp,Schlichting:2012es,Kurkela:2014tea}.\nThe effect of the expansion, however, makes the system\nmore anisotropic. The combined effect of the two leads the system to miss the thermal \nequilibrium at the origin, and causes the system to flow to the underoccupied half of the diagram. This behaviour\nis examined in detail in Refs.~\\cite{Baier:2000sb,Kurkela:2011ti,Kurkela:2011ub}. \n\n\n\nOnce the system turns underoccupied, its physics changes qualitatively (in particular for inelastic scattering which\nchanges from merging to splitting), and this change eventually allows the system to reach\nthe thermal equilibrium. \n\n\nThat the system explores both the underoccupied and overoccupied regions of the diagram\nbefore settling to thermal equilibrium has a technical implication that the degrees of freedom\nthat are used to describe the system also change during the the prethermal evolution. \nOn one hand, as long as the system is overoccupied, it can be described in terms of classical Yang-Mills (CYM) theory.\n\\footnote{As long as the system is parametrically overoccupied, the fermions play only\na subleading role in thermalization as their occupancies cannot exceed 1 and therefore are always less numerous\nas the gluons. } The corrections to classical field theory description comes from non-zero coupling\n $\\alpha_s$ and from small occupancies $\\mathcal{O}(f^{-2})$ \\cite{Mueller:2002gd,Jeon:2004dh}. \nWhen the occupancies become less large, the ``quantum corrections'' arising from the expansion\nin the inverse occupancy become large, and the when $f \\sim 1$, the classical theory fails to give a faithful description of the system.  \nTherefore the classical description can never reach the thermal equilibrium with $f \\sim 1$. \n\nOn the other hand, once the system becomes underoccupied, it is better described in terms of \nparticle degrees of freedoms and their kinetic theory. The expansion parameters of the kinetic theory \ndescription are again the coupling constant itself, $\\alpha_s$, but also the occupancies $\\alpha_s f$.\nTherefore the effective kinetic theory can be used to describe systems that are underoccupied, and the \ndescription can be extended to occupancies that are large but not non-perturbatively large $f \\ll 1/\\alpha_s$, so that it can reach the thermal equilibrium but not the CGC initial condition. \n\\begin{figure}\n\\hfill\n\\includegraphics[width=0.4\\textwidth]{epelbaum_gelis}\n\\hfill\n\\includegraphics[width=0.35\\textwidth]{cdplane_schlichting}\n\\hfill\n\\vspace{-0.4cm}\n\\caption{\n\\label{fig:clas}\nClassical evolution of the system. (Left) The time evolution of the components of energy momentum tensor from\na simulation initialized with CGC initial condition from \\cite{Gelis:2013rba}. At late times the system becomes ever more anisotropic (Right) Trajectories of classical simulations in the plane of anisotropy and occupancy with different initial conditions \\cite{Berges:2013fga}. All the trajectories become eventually more anisotropic and dilute irrespective of the details of the initial condition. The classical Yang-Mills theory never thermalizes or isotropizes.\n}\n\\end{figure}\n\n\nNeither of the descriptions, the classical field theory or the kinetic theory, can cover the whole \ntime evolution of the system from the overoccupied initial condition to thermal equilibrium.  However,\na strategy where the early evolution is described by classical Yang-Mills theory and where \nthe late approach to hydrodynamics is dealt within kinetic theory, can indeed bring the overoccupied initial\ncondition to thermal equilibrium. In such strategy, the system must be passed from\none set of degrees of freedom (the classical YM fields) to another (distribution functions of kinetic theory).\nThis transfer is made possible by the parametrically large region of overlapping validity\nof both description. Indeed for\n\n", "index": 5, "text": "\\begin{equation}\n1 \\gg f \\gg 1/\\alpha_s,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"1\\gg f\\gg 1/\\alpha_{s},\" display=\"block\"><mrow><mrow><mn>1</mn><mo>≫</mo><mi>f</mi><mo>≫</mo><mrow><mn>1</mn><mo>/</mo><msub><mi>α</mi><mi>s</mi></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]