[{"file": "1601.03414.tex", "nexttext": "\nup to terms of higher order.    [This connection between different saddles is also related to an argument of Lipatov \\cite{Lipatov:1976ny}, see also \\cite{Balitsky:1985in}.]\n  The ambiguities at leading order $e^{-t_1/g^2}$ cancel, and the sum of perturbative and non-perturbative sectors is meaningful, \n ambiguity-free and accurate. In principle,  this is just the \"tip-of-the-iceberg\": e.g., it has now been shown in a class of QM models that these resurgent cancellations occur to all orders of the trans-series expansion \\cite{Dunne:2013ada,Dunne:2014bca}. An obvious but deep question is: can this idea  work in QFT, in particular to cure the IR-renormalon problem of asymptotically free QFT? \n\n\\noindent\n{\\bf 't Hooft's IR renormalon puzzle [1977]:} In  the asymptotically free QFTs mentioned above, there are  Borel singularities that are parametrically closer to the origin of the Borel $t$-plane, on $\\mathbb R^{+}$,  than the  $[{\\cal I}{\\overline{\\cal I}}]_\\pm$ singularity \\cite{'tHooft:1977am, Beneke:1998ui}.  \nThe $[{\\cal I}{\\overline{\\cal I}}]_\\pm$  singularity is \nrelated to the factorial combinatorial growth of the number of Feynman diagrams, while  the (more dominant)  IR renormalon singularity is related to divergences coming from phase space integration, at small internal momenta, smaller than  $\\Lambda$.    't Hooft called  these singularities ``IR renormalons\" in the hope that they would be  associated with a semiclassical saddle, such as an  instanton. \nFor example, the $[{\\cal I}{\\overline{\\cal I}}]_\\pm$ singularities are located at  $t=t_n= n (2S_I)$, but the IR-renormalon singularities are located at  $t = \\tilde t_n  \\sim  n (2S_I)/\\beta_0 $, \nwhere $\\beta_0$ is  the leading coefficient of the renormalization group beta function.  Due to this mis-matched factor of $\\beta_0$, it appears that the cancellation mechanism at work in QM cannot possibly work in QFT on ${\\mathbb R}^d$. However, there is another well-known problem in $\\mathbb {CP}^{N-1}$, Yang-Mills etc., coming from the instanton-gas picture itself. There are instantons, but the so called ``dilute instanton gas approximation\"  must be regulated, because the instanton size is a moduli parameter, whose integration leads to another IR divergence.  \n\n{\\bf The Main Idea \\cite{Argyres:2012ka, Argyres:2012vv, Dunne:2012ae, Dunne:2012zk}:} The key step is to combine the concept of  adiabatic continuity \\cite{Unsal:2007vu, Unsal:2007jx} discussed above, with  resurgence theory. \n\nAsymptotically free QFTs can be brought into a calculable semi-classical domain on  ${\\mathbb R}^{d-1} \\times S^1$, and with appropriate boundary conditions or deformation this can be continuously connected to the strongly coupled  domain of interest.\nIn the calculable  semi-classical domain, all  non-perturbative aspects of field theory  become tractable, and should not differ dramatically from the behavior on ${\\mathbb R}^d$. \n Once a small circle compactification respecting continuity is found, which is counter-part of center-symmetric background in gauge theory,   (note that high temperature limit of thermal compactification {\\it never} achieves this),  something magical occurs. E.g., the 2d  instanton in the $\\mathbb {CP}^{N-1}$ model, with action $S_I= \\frac{4\\pi}{g^2}$,   splits up into $N$  \nkink-instantons with action $\\frac{S_I}{N}= \\frac{4\\pi}{g^2N}$, which is now the minimal action semi-classical saddle  \n\\cite{Bruckmann:2007zh, Brendel:2009mp, Dunne:2012ae}.\nAt second order in semi-classical analysis, similar to Eq.\\ref{bions-amp}, there are two types of bion: we refer to them as charged and neutral bions. The neutral bions  ${\\cal B}_{ii} $ possess zero topological charge and zero ``magnetic\" charge, and can thus mix with perturbation theory. In the zero flavor $n_f=0$ theory, the neutral bion amplitude is two-fold ambiguous, and Borel-resummed perturbation theory (which transmutes to the combinatorics in reduced twisted compactification   \\cite{Dunne:2012ae, Anber:2014sda}\n  is also two fold ambiguous. Remarkably, these two ambiguities cancel each other {\\it exactly} \\cite{ Dunne:2012ae, Dunne:2012zk}. \nCorrespondingly, in the Borel plane the leading singularity is located at $t = \\tilde t_1  \\sim  (2S_I)/N $, which, since $\\beta_0=N$ for  \n$\\mathbb {CP}^{N-1}$, is the same as the location of 't Hooft's elusive renormalon ambiguity  $t = \\tilde t_1  \\sim   (2S_I)/\\beta_0 $: \n\n", "itemtype": "equation", "pos": 69543, "prevtext": "\n\\maketitle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\nThis review is a basic introduction  to some new  methods and ideas  in quantum gauge theories in four dimensions, and sigma models in two dimensions, with an underlying emphasis on making progress in the understanding of quantum chromodynamics (QCD).  The review has six short sections, each of which describes the most important concepts underlying these methods. The ideas are illustrated with simple examples.\nIn fact, all six stories are continuously connected, and  each borrows a new idea/perspective from the previous one.  Our intention is to provide a framework in quantum field theory (QFT) in which all reasonable methods,   lattice field theory, supersymmetric field theory, and  semi-classical continuum methods in  (non-supersymmetric) QFT,  among others, are treated on a similar footing, and can be used in conjunction to explain some of the mysteries of strongly interacting QFT.   \n \n \n\n\n\n\\section{Large-$N$ Orbifold and Orientifold Equivalences}\n\\label{largeN}\nLarge-$N$ orbifold/orientifold equivalence is an exact equivalence between certain sub-sectors of seemingly unrelated quantum field  theories, in the limit of large-$N$, where $N$ is the number of internal degrees of freedom. $N$ can be either the rank of the color or global symmetry group.  These equivalences provide  new and important insights into the dynamics of strongly coupled theories. Interesting examples of equivalences are: \n(i) those relating a theory on an infinite lattice to a  theory on a\nfinite-size lattice, or even on a single-site lattice, (unitary matrix model) \\cite{Eguchi:1982nm, GonzalezArroyo:1982hz,Kovtun:2007py}; \nor (ii) in the continuum, relating  a theory on ${\\mathbb R}^d$ to a theory  compactified  on ${\\mathbb R}^{d-k} \\times (S^1)^k$; or (iii) equivalences relating a  supersymmetric theory to a non-supersymmetric one \\cite{Kachru:1998ys, Bershadsky:1998cb, Armoni:2003gp,Armoni:2003fb,Armoni:2004ub,Kovtun:2003hr,Kovtun:2004bz,Unsal:2006pj,Kovtun:2005kh}. See \nFig.\\ref{orienti}.\n\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[angle=0, width=1.00\\textwidth]{orienti-VI}\n\\caption{\n({\\bf Left})  Large $N$   equivalences relating QCD(AS) and   ${\\cal N}$=1 SYM. ({\\bf Right}) \nVolume reduction and expansion are examples of orbifold projections, and center-symmetry realization governs the realization of the large-volume/small-volume equivalence (Eguchi-Kawai equivalence).\n}\n\\label{orienti}\n\\end{center}\n\\end{figure}\n\n\n\nThe main idea is the following. \nOne starts with some  ``parent\" theory, and constructs ``daughter'' theories, by using  \ncertain orbifold/orientifold projections, which amount to retaining only those fields which are invariant under a particular discrete symmetry group of the parent theory. \n For discrete abelian projections,  the planar graphs of the daughter theories  and  the parent theory coincide  \n(up to a simple rescaling of the  coupling constant), which implies the coincidence of their\nplanar perturbative expansions at $N=\\infty$ \\cite{Kachru:1998ys,Bershadsky:1998cb}. \n Clearly,  such a perturbative equivalence is an invitation to study possible non-perturbative realizations of this idea \\cite{Armoni:2003gp,Armoni:2003fb}.  Refs. \\cite{Kovtun:2003hr,Kovtun:2004bz} proved that the validity of the non-perturbative equivalence relies on certain symmetry realizations, as described below. \n \nTo appreciate the implications of such equivalences, consider a simple example. \nStart with ${\\cal N}=1$ Super-Yang-Mills (SYM) with  gauge group $SO(2N)$. The field content of the theory consists of a gauge boson, $A_{\\mu}$, and a Weyl fermion, $\\lambda$,  in the adjoint representation.  Two non-trivial ${\\mathbb Z}_2$ projections of the    parent $SO(2N)$ theory \nlead to two distinct $U (N )$ gauge theories,  see Fig~\\ref{orienti} \\cite{Unsal:2006pj}.     \nLet $J\\equiv  i \\sigma_2 \\otimes 1_N \\in SO(2N)$ denote the  symplectic form which is real and \nanti-symmetric. There are two natural \n projections,   by $J$ and  $J(-1)^F$ where $(-1)^F$ is fermion number modulo two, \n which may  be realized by the following constraints on the fields:\n\\begin{eqnarray}\nJ:  \\;  & \\; \\;\\;  A_\\mu =JA_\\mu J^T, \\qquad  \\lambda ={\\color{red} +} J\\lambda J^T, \\qquad \\Longrightarrow \\quad U(N) \\;\\;   {\\cal N}=1 \\;  {\\rm  SYM } \n\\cr\nJ(-1)^F: \\;  &A_\\mu =JA_\\mu J^T, \\qquad  \\lambda = {\\color{red} -} J\\lambda J^T, \\qquad \\Longrightarrow \\quad U(N) \\;\\;   {\\rm QCD(AS)} \n\\end{eqnarray}\nQCD(AS) is a  non-supersymmetric  gauge theory  with a single Dirac fermion  in the   two-index antisymmetric tensor representation  $\\Psi_{ij}$. \nClearly, the two daughter theories are different QFTs with different matter content, and different global symmetries. \nThe parent and $J$-daughter theories are supersymmetric, while  the $J(-1)^F$-daughter theory is non-supersymmetric.   \nIn addition to the presence vs. absence of supersymmetry in the two daughter theories, the global discrete chiral symmetry and the center symmetries of these two daughter theories are also  different. \n\n\n\n\nBefore stating the main result, we note that the daughter theories also possess a non-trivial ${\\mathbb Z}_2$ symmetry,  charge conjugation $C$, which is the image of the \nglobal part of the gauge symmetry in the parent QFT. (Think of embedding $U(N) \\times U(N)^*$ into $SO(2N)$, and note that the $J$-action interchanges $U(N) \\leftrightarrow U(N)^*$.)\nThis symmetry will be used to define a ${\\mathbb Z}_2$  neutral sector  in the daughter theory, which constitutes the image of operators in the parent theory.  Clearly, ${\\mathbb Z}_2$-odd operators are not in the image. In general orbifold projections, the discrete symmetry defining the neutral sector is the ${\\mathbb Z}_k$ cyclic permutation symmetry. \nThe operators transforming nontrivially under \n${\\mathbb Z}_2$, or ${\\mathbb Z}_k$, are also called `twisted' operators \\cite{Kachru:1998ys,Bershadsky:1998cb}. \n\n\\vspace{3mm}\n\\noindent\n{\\bf Necessary and sufficient conditions  \\cite{Kovtun:2003hr,Kovtun:2004bz}:} There exists an exact  equivalence between the neutral sectors of parent-daughter pairs as well as daughter-daughter pairs {\\it provided}:\n\\begin{itemize}\n\\item The symmetry in the parent theory used in the projection is  not spontaneously broken.  \n\\item   The symmetry  defining the neutral sector  in the daughter theory  \nis not spontaneously broken. \n\\end{itemize}\nIn the present example,  provided  the charge-conjugation $C$ is unbroken in QCD(AS), and the fermion number modulo two, $(-1)^F$,  is unbroken in ${\\cal N}=1$, \nthe $C$-even subsector of QCD(AS) is exactly equivalent to the bosonic sub-sector of  ${\\cal N}=1$ SYM \\cite{Unsal:2006pj}. The  $C$-realization is studied on the lattice \n\\cite{DeGrand:2006qb},  demonstrating the existence of both $C$-broken and unbroken phases. \n\n\n\n\\vspace{3mm}\n\\noindent\n{\\bf Why is this useful?} \n QCD(AS) is a natural generalization of $SU(3)$ QCD  to a large-$N$ limit \\cite{Armoni:2003gp} , due to the simple fact that for SU(3), the fundamental (F)  and  antisymmetric (AS) representations coincide:  $\\Psi_{ij} = \\epsilon_{ijk} \\Psi_{k}$.  So, one can take a large-$N$ limit of QCD in either of two ways. With two index irreps, fermions are unsuppressed in the large-$N$ limit: they have $O(N^2)$ degree of freedom, just like gauge bosons, and unlike fermions in the fundamental representation. \n The   exact equivalence in  the $N=\\infty$ limit allows one to convert knowledge about supersymmetric theories into improved understanding of QCD or QCD-like theories.  \n For example, one immediate prediction is that the chiral condensate in ${\\cal N}=1$ SYM and in QCD(AS) must agree up to $1/N$ corrections. The  condensate is calculable in ${\\cal N}=1$ SYM \\cite{Davies:2000nw}\n because it is an element of the chiral ring, so we learn something non-trivial about the non-supersymmetric QCD(AS) theory: \n$ \\langle  \\textstyle  {\\rm tr}  \\lambda \\lambda \\rangle^{\\rm QCD(AS) } =\n   \\langle  \\textstyle  {\\rm tr}  \\lambda \\lambda  \\rangle^{\\rm SYM}  ( 1 + O(1/{N}) )$.\n\n\n \n\n\nAnother interesting aspect of  the equivalence  is that it sometimes has  {\\it counterintuitive} consequences, which are conceptually  important in QFT.  \n A natural setting where this happens is the following.  Assume equivalence is valid. Then,   if either  the parent or daughter  theory has  a global symmetry which protects an observable, \nthen in the other theory (which does not possess the same global symmetry)  the image observable  {\\it behaves as if} it is protected by the higher symmetry of the companion \n\\cite{Armoni:2007kd,Unsal:2007fb}. Why is this so?\n\n\nConsider the following example of this kind of argument. In ${\\cal N}=1$ SYM,  because of the  trace anomaly relation,  the gluon condensate determines the ground state energy, and as such, it is an order parameter for dynamical supersymmetry breaking: \n${\\cal E}_{\\rm vac} = \\langle \\Omega | T_{00} |\\Omega\\rangle =  \\langle \\Omega | \n\\{Q_{\\alpha}, {{\\overline} Q}_{\\dot \\alpha}  \\}  |\\Omega\\rangle  \\sigma^{0}_ { \\alpha \\dot \\alpha}\n= \\frac{1}{4} \\langle \\Omega |  T_{\\mu \\mu}   | \\Omega \\rangle   \n= \\frac{1}{4} \\frac{\\beta(g)}{g^3} \\langle {\\rm tr}\\, F^2_{\\mu \\nu}\\rangle$.\n This theory has non-zero Witten index, hence, supersymmetry is unbroken \\cite{Witten:1982df}. This implies that the gluon condensate must vanish. \nAs a result of equivalence, in non-supersymmetric  QCD(AS) the gluon condensate must {\\it also} be zero, at leading order in the $1/N$ expansion, scaling as \\cite{Unsal:2007fb}:\n\\begin{eqnarray}\n \\langle  \\textstyle \\frac{1}{N} {\\text{tr}} F_{\\mu \\nu}^2  \\rangle^{\\rm QCD(AS) }\n   = \\frac{1}{N} \\Lambda^4\\ \n    \\longrightarrow {\\color{red}0} \\qquad {\\rm at}  \\; N=\\infty \n   \\label{suppressed}\n\\end{eqnarray}   \n This is a very surprising  result!\n In confining $SU(N)$ gauge theories, the natural scaling of (properly normalized)  \n non-extensive observables is $O(N^0)$. \nFor example,  the gluon condenstate in pure Yang-Mills theory  is parametrically \n $\\langle\\textstyle\\frac{1}{N}{\\rm tr} F_{\\mu \\nu}^2\\rangle^{\\rm YM} \\propto \nN^0\\Lambda^4$, and one would expect to see this  ``natural\" scaling in QCD(AS) as well.   Furthermore, QCD(AS) is non-supersymmetric, and hence one cannot use the tools of supersymmetry.  This means that, {\\it even in a supersymmetric theory}, there must be a \nnon-perturbative mechanism  for the vanishing  of the condensate, \nwhich does not rely on supersymmetry. Recall that both QCD(AS) and ${\\cal N}=1$ SYM are vector-like theories and hence the fermion determinant is positive semi-definite. Also $ {\\rm tr} F^2_{\\mu \\nu}$ is positive definite, in the Euclidean setting.  \nThis implies that the gluon condensate is the average of a positive observable  with respect to a positive measure \\cite{Shifman:1978bx, Callan:1977gz, Schafer:1996wv}. \n\n\\noindent\n{\\bf A puzzle:} The natural  QCD intuition is that the gluon condensate is positive-definite  in any confining  vector-like theory.   From the perspective of  supersymmetric QFT, the gluon condensate is zero in theories which do not break supersymmetry.  But ${\\cal N}=1$ SYM is both supersymmetric and  vector-like, and it does not break supersymmetry.  This raises an interesting question:  is it possible to explain the vanishing of the gluon condensate without using the supersymmetry (SUSY) algebra, \nfor example by using  semi-classical arguments?\n\n\nThis is the type of puzzling implication of large-$N$ orbifold/orientifold equivalence that is the most challenging.  Taking such challenges seriously may lead to a deeper understanding of \nQFT and path integrals, as we argue below. \n The resolution of this puzzle, which we discuss in \\S.\\ref{HTA} below, challenges our present \nunderstanding of the semi-classical representation of the path integral.  Our resolution introduces \n new concepts such as (contributing) complex saddles and  hidden topological angles.\n\nWe also mention that large-$N$ equivalences  also have useful applications to finite density QCD \\cite{Cherman:2010jj, Cherman:2011mh}, and reveal a certain universality of the phase structure in different QCD-like theories \\cite{Hanada:2011ju,Unsal:2007fb}.    \n\n\n\n\n\n\n\n\n\n\n\n\\section{Large-$N$ Volume Independence}\n{\\bf Birth, Death and re-birth of large-$N$ reduced models:}  \n(The subtitle  is borrowed from a recent talk by Gonzalez-Arroyo.) \nIn 1982, Eguchi and Kawai  (EK)\ncame up with one of the most remarkable  ideas in large-$N$ gauge theory \\cite{Eguchi:1982nm}. They proved that certain properties of $U(N)$ Yang-Mill theory, formulated on a periodic lattice with $\\Gamma^4$-sites,  \nare independent of the lattice size in the $N \\rightarrow \\infty$ limit, \nand can be reduced to a matrix model on $1^4$-site lattice,  \n {\\it provided} center-symmetry in the matrix model is not spontaneously broken, and translation symmetry in the lattice field theory is unbroken \\cite{Yaffe:1981vf}.  From the modern point of view, this is an orbifold equivalence. For example, starting with a unitary matrix model with $U(\\Gamma^4N)$ gauge group, and orbifolding by a proper $({\\mathbb Z}_\\Gamma)^4$, one ends up with a four-dimensional quiver (or lattice) with $U(N)$ gauge theory on $\\Gamma^4$ sites, \\cite{Kovtun:2007py}. The orbifold  equivalence gives  a   mapping  of a matrix model to Yang-Mills theory, and if valid, can be useful both numerically and analytically.   \n \nThere was important progress in the early 1980s developing the EK idea\n\\cite{Gross:1982at, Parisi:1982gp,Das:1982ux}.   In the end, the original EK proposal fails due to broken (center) symmetry at weak coupling of the lattice theory (which is continuously connected to the continuum).  Two important modifications were introduced: (i) {\\it quenched} (QEK)  \\cite{Bhanot:1982sh}, and {\\it twisted} (TEK) \\cite{GonzalezArroyo:1982ub, GonzalezArroyo:1982hz}. Eventually it was understood that even these modifications were not enough to realize the full reduction, but a newer version of TEK works, see below. See   \\cite{Bringoltz:2008av} for QEK, and  \\cite{Azeyanagi:2007su,Teper:2006sp} for TEK; and  \\cite{Lucini:2012gg}  for a review.\n \nHowever, this subject is now not only  reborn,  it is also  flourishing, with both analytic and numerical progress, and useful \nspin-offs.  QCD(adj) and deformed-Yang-Mills \\cite{Kovtun:2007py,Unsal:2008ch} and  a new version of TEK   \\cite{GonzalezArroyo:2010ss} work. One important aspect of TEK that had already been known for some time was the relation to   non-commutative field theory \\cite{Ambjorn:2000cs}. \n  Newer  and  related ideas connected to large-N reduction include the idea of adiabatic continuity, rigorous semi-classics, and  resurgence theory.   Each will be explored in subsequent sections. \n\n\n  \n\n\n\n  \\vspace{0.3cm}\n\\noindent\n{\\bf Why does the original EK idea fail?} In an interesting way, the physical reason why the original EK reduction {\\it does not work} predates the proposal itself.  And the reason why modern variants of the EK proposal {\\it must work} also predates the proposal. \nThese reasons can be seen without elaborate calculations, and can be explained almost without formulas. The main results are actually conceptual {\\it realizations} rather than calculations.\n\n\n\n\nConsider  compactifying Yang-Mills theory on ${\\mathbb R}^4$ to ${\\mathbb R}^3 \\times S^1$, instead of to a four-torus $T^4$.  $S^1$ is a thermal circle, with circumference $\\beta$ equal to the inverse temperature.  It is well-known that if we increase the temperature in pure Yang-Mills theory,  the theory moves  from the confined to the deconfined phase,  which is experimentally observed.  The associated symmetry is center-symmetry, ${\\mathbb Z}_N$, under which the order parameter  Wilson line holonomy of the gauge field in the compact  $x_4$ direction, $\\Omega({\\bf x}) = {\\rm P} e^{ i \\int_{S^1} A_4({\\bf x}, x_4)} $,  transforms non-trivially under ${\\mathbb Z}_N: {\\text{tr}}\\Omega({\\bf x}) \\rightarrow  h {\\text{tr}}\\Omega({\\bf x}), \\; h^N=1$. \n At small circle radius,  where the analysis is reliable due to weak coupling, Gross, Pisarski and Yaffe (GPY) calculated the one loop effective potential \\cite{Gross:1980br}:\n\\begin{eqnarray} \nV[\\Omega]={\\color{red} (-1)} \\times \\frac{2}{\\pi^2 \\beta^4} \\sum_{n=1}^{\\infty} \\frac{|{\\text{tr}} \\,\\Omega^n|^2}{n^4} <0  \\qquad \\Longrightarrow {\\rm center\\; instability}\n\\label{YM}\n\\end{eqnarray}\nClearly, the minus sign in front of the one-loop effective potential indicates the  center-instability of the deconfined phase, \nbecause the  potential is minimized for $\\langle\\frac{1}{N}{\\text{tr}}\\Omega \\rangle=1$.\nThis means that on ${\\mathbb R}^3 \\times S^1$, volume independence \nis achieved above a critical radius,   $\\beta>\\beta_c$,  but must fail  below a critical size $\\beta<\\beta_c$   \\cite{Yaffe:1981vf,Kiskis:2003rd}. (This is sometimes called partial reduction.)\n This also means that even if the large-$N$ theory is compactified on \n$T^3 \\times S^1_\\beta$, where $\\beta<\\beta_c$, the equivalence must fail regardless of the radius of $T^3$. Nothing changes as one moves to a QCD-like theory. The message is:\n\\begin{quote}\n  In  all QCD-like  theories, with  all representations of fermions,  and for all infinite Lie groups, Eguchi-Kawai reduction is destined to fail  in a thermal set-up at sufficiently    small thermal circle.  Thermal compactification  with $\\beta<\\beta_c$  is in direct conflict with large-$N$ reduction. \n\\end{quote}\n\n\n\n\\subsection{Boundary Conditions as an Idea,  and Center Stability in QCD(adj)}\n\\noindent\n{\\bf Why it must  work?}\nDespite the fact that thermal fluctuations are in conflict with the large-$N$ reduction idea, \n{\\it quantum fluctuations} may lead to a different behavior.  We can motivate and illustrate the idea using supersymmetry, but in fact the eventual argument does not require SUSY.\nConsider a gauge boson and a fermion in the adjoint representation of some gauge group $G$. Then, imposing periodic boundary conditions on fermions, boundary conditions which respect supersymmetry, one is guaranteed that a potential for the Wilson line is not induced to any loop order in perturbation theory.  \nThis vanishing hides a\nsimple secret.  In fact, the one-loop potential is \n\\begin{eqnarray}\n\\qquad \\qquad V[\\Omega]={\\color{red} (1-1)} \\times \\frac{2}{\\pi^2 L^4} \\sum_{n=1}^{\\infty} \\frac{|{\\text{tr}} \\Omega^n|^2}{n^4} ={\\color{red} 0} \\qquad \\Longrightarrow {\\rm perturbatively \\; marginal} \\qquad \n\\label{SYM}\n\\end{eqnarray}\n\nThe really important point   is not the cancellation itself, but the existence of the $+1$  part (which has {\\it nothing} to do with supersymmetry).  It is just the consequence of periodic boundary conditions, $\\lambda(L)=+ \\lambda(0)$,  for fermions. This tells us that the quantum fluctuations (as  \nopposed to thermal fluctuations)  of an adjoint fermion undoes the center-destabilizing effect of gauge fluctuations. This is the main idea underneath periodic boundary conditions. \nTaking one more step in this direction, i.e.,  with $n_f=2$  fermions, one ends up with center-stability which is the crucial necessary and sufficient condition for the validity of large-$N$ volume independence. \n\\begin{eqnarray}\nV[\\Omega]={\\color{red} (2-1)} \\times \\frac{2}{\\pi^2 L^4} \\sum_{n=1}^{\\infty} \\frac{|{\\text{tr}} \\Omega^n|^2}{n^4} >0  \\qquad \\Longrightarrow {\\rm center \\; stability}\n\\label{QCDadj}\n\\end{eqnarray}  \nThis simple idea provides a solution of the Eguchi-Kawai proposal  in QCD(adj). Thanks to the orientifold equivalence between QCD(AS) and QCD(adj), this is also the resolution of the problem for QCD \\cite{Kovtun:2007py}. In fact, even for $n_f=1$ (or ${\\cal N}=1$ SYM), center-symmetry remains intact due to non-perturbatively induced neutral bion effects, as discussed in \\S \\ref{bions}. \n\nLattice simulations with one-site or few-site  large-$N$ matrix models confirm this proposal \\cite{Bringoltz:2009kb, Azeyanagi:2010ne,Hietanen:2009ex}, as does an earlier simulation with massive adjoint fermions \\cite{Cossu:2009sq}, emulating ${\\mathbb R}^3 \\times S^1$ at $N=3$.\nIn the end, the resolution is a simple realization.  \nWe also note that  the potential Eq.\\ref{QCDadj} was derived earlier in the context of gauge-Higgs unification in \\cite{Hosotani:1988bm} in extra-dimensional model building, although this work did not discuss the implication of this potential for large-$N$ reduction or non-perturbative QCD(adj) dynamics. \n  \n\n\n\n\n\n\n\n\n\\subsection{Perturbative Intuition Behind Volume Independence}  \n\nInstead of providing a rigorous  background for volume independence, we would like to provide an intuitive perturbative explanation for why it works the way it does \\cite{Unsal:2010qh}.  \nThe interesting point\n is the relation between the Kaluza-Klein spectrum of perturbative modes and its dependence on the  realization of center symmetry. \n\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[angle=0, width=1 \\textwidth]{center-KK}\n\\caption{Perturbative intuition of large-$N$ volume independence.  a) Center-broken holonomy, and  standard KK- spectrum;  b)  Center-symmetric holonomy  and finer \n KK modes;\nc) $N\\rightarrow \\infty$ limit of b). \n}\n\\label{vol-ind}\n\\end{center}\n\\end{figure}\n\n\nIf center-symmetry is broken, then the eigenvalues of the Wilson line clump together. \nFig.~\\ref{vol-ind}a  shows the standard form of Kaluza-Klein towers, in which discrete momenta \nare quantized in units of $\\frac{2 \\pi}{L}$, the usual text-book picture. \n\nIf center symmetry is unbroken,  the eigenvalues  of the Wilson line  are evenly distributed around the unit circle. This results in a much finer ``KK-spectrum\", due to  ``momentum-color intertwining\".   The discrete momenta are quantized in units of  $\\frac{2 \\pi}{LN}$. See Fig.~\\ref{vol-ind}b.\n\nAt fixed $L$, and as $N \\rightarrow \\infty$, nothing special takes place in the center-broken background or with the  standard KK spectrum.  But for the center-symmetric background,  the  spacing in the Kaluza-Klein spectrum approaches zero, and the spectrum becomes indistinguishable from the perturbative spectrum of the theory on ${\\mathbb R}^4$! In other words, the scale $L$ disappears from perturbation theory as one takes the $N\\rightarrow  \\infty$ limit.  \nOne can interpret $LN\\equiv L_{\\rm eff}$ as the effective size of the compact dimension, and as one takes the $N\\rightarrow  \\infty$ limit, observables in the center-singlet sector (all local operators), and the spectrum of the theory, behave as if the theory is living on ${\\mathbb R}^4$, despite the fact that the theory still lives on a space with size $L$. A similar  structure  appears in all toroidal compactifications on ${\\mathbb R}^{d-k} \\times (S^1)^k $, provided center symmetry is unbroken. With multiple dimensions compactified,  TEK realizes an even more efficient version of this color-momentum intertwining, due to non-commutativity of the background Wilson lines in different directions.  \n\n\\noindent\n{\\bf Scales,  two regimes, adiabatic continuity and universality:} \n For center-symmetric confining theories on ${\\mathbb R}^3 \\times S^1$,  there are two different regimes:  \n\\begin{eqnarray}\n&LN\\Lambda \\gg 1,   \\;\\; {\\rm volume \\; independent,  \\; nonabelian \\; confinement, \\;incalculable}\n\\label{sa}\n\\\\\n&LN\\Lambda \\lesssim 1,  \\;\\;\\;  {\\rm volume \\; dependent, \\; \\;\\;\\; abelian \\;  confinement, \\; \\;\\;\\; \\;\\;\\;   calculable} \n\\label{sb}\n\\end{eqnarray}\nHere, ``incalculable\" means inaccessible with known analytical  techniques.  Since nature and numerical  lattice simulations know how to ``calculate\" in this regime,  this may just mean that \nthe  proper mathematical framework  and physical ideas are yet to be developed.   The first  regime Eq.\\ref{sa} is the ``real thing\", which we would like to understand. The second regime Eq.\\ref{sb} is the  ``cartoon\" of the real thing, but it is calculable.  These two regimes are very  often adiabatically connected, with no phase transition \nin between.  In cases where adiabatic continuity is believed to hold,  all non-perturbative observables  agree qualitatively, thus, the two regimes are in the same universality class.  But we cannot yet prove this in generality. \n\n\n\n\\subsection{A Puzzle and Emergent (Fermionic) Symmetry}  \nA working large-$N$ volume independence  must have  a  dramatic spectral implication. \n \n  In QCD(adj), recall that periodic boundary conditions for fermions imply that, in the operator formalism,  we are calculating a {\\it twisted (or graded)  partition function}, instead of the thermal partition function, namely, \n\\begin{eqnarray}\n\\tilde Z (L) = {\\text{tr}} \\left[  e^{-L  H} {\\color{red} (-1)^F } \\right] = Z_{\\cal B} {\\color{red} -}  Z_{\\cal F} = \\int dM [ \\rho_{\\cal B}(M) {\\color{red} -} \\rho_{\\cal F}(M) ] e^{-LM}\n\\label{tpf}\n\\end{eqnarray}\nThis object is familiar from SUSY QFT, where it is  supersymmetric Witten index \\cite{Witten:1982df}.  In non-supersymmetric theories,  its role has been understood only recently \\cite{Unsal:2007fb, Unsal:2007vu, Unsal:2007jx,  Basar:2013sza}. It can be used to find the phases of a theory as a function of the spatial compactification radius (which now has no thermal interpretation). Unlike thermal compactification,  where the theory  must move to a deconfined phase at small circle-radius, \nin spatial compactification the quantum fluctuations measured as a function of radius may lead to very different small-$L$ behavior. In particular,  in QCD(adj), at infinite-$N$, there is no phase transition as a function of radius, i.e, $\\frac{ d \\tilde Z (L) }{dL}=0$. \n\n\nVolume independence seems to be  puzzling in conjunction with the \nHagedorn  spectrum of  hadronic states.   If a theory has Hagedorn growth \\cite{Hagedorn:1965st}, with density of states \n$\\rho(M) \\sim \\frac{1}{M} \\left( \\frac{T_H}{M}\\right)^a e^{M/T_H} + \\ldots$\nwhere ellipsis are sub-leading power-law and exponential factors, \n then the partition function must diverge above a critical temperature, $T_H\\sim \\Lambda$, parametrically related to the deconfinement temperature.\n$T_H$ is the higher  limit of metastability, , see Fig.\\ref{center-sym}, at which the meta-stable confined phase ceases to exist.  The actual  deconfinement temperature is slightly lower.\nRegardless, the Hagedorn growth almost always demands the existence of a phase transition, \nwhile volume independence demands the opposite, the absence of any phase transition  \\cite{Basar:2013sza}.  How can these two contradictory demands be reconciled? \n\n The most reasonable resolution of this puzzle is an approximate spectral  \n degeneracy between the states in the bosonic and fermionic sectors, ${\\cal B}$ and ${\\cal F}$, similar to the $n_f=1$ SYM case.  Note that not only the leading Hagedorn growth, but all power law corrections and  all sub-leading exponentials must cancel  between the two factors. \nThe resolution of such a high level of conspiracy  in the $n_f>1$ case seems to be feasible with  \nthe  emergence of a fermionic symmetry at large $N$, where there is no supersymmetry: namely,  \n$\\rho_{\\cal B}(M) = \\rho_{\\cal F}(M)$, up to a possible $e^{M/(T_HN^p)}$ difference \\cite{Basar:2013sza,Basar:2014jua}, $p \\geq 1$. \nThe potential conflict with the Coleman-Mandula theorem  is resolved because at $N=\\infty$ the $S$-matrix is trivial, and hadrons are free.  \n \n\n\n\n\\section{Double-Trace Deformations:  Volume Independence vs. Adiabatic Continuity} \n\\label{sec:adiabatic}\nThere is another solution to the volume independence proposal \\cite{Unsal:2008ch}. \nSo far, this approach does not seem to be as practically useful,  but conceptually it adds a new element at  large-$N$. Furthermore, at $LN \\Lambda \\lesssim 1$ it leads to semi-classical \ncalculability in Yang-Mills and  QCD-like theories with one fermion flavor  \\cite{Shifman:2008ja}, and a regime continuously connected  to large-$LN \\Lambda$ and ${\\mathbb R}^4$.   \n\n\n\n\\noindent\n{\\bf Main idea \\cite{Unsal:2008ch}:} Consider deforming, by the addition of a double-trace operator,  the Yang-Mills theory compactified on small ${\\mathbb R}^3 \\times S^1$: \n\\begin{eqnarray}\n&S^{\\rm dYM}= S^{\\rm YM} + S^{\\rm dt} = \\int_{\\mathbb R^3 \\times S^1}   \\frac{1}{2 g^2} {\\text{tr}} F_{\\mu \\nu}^2 + \n  \\int_{\\mathbb R^3 \\times S^1} \\frac{1}{L^4} P[\\Omega({\\bf x})]  \\cr \\cr\n  & P[\\Omega]  = \\sum_{n=1}^{\\lfloor \\frac{N}{2} \\rfloor} a_n |{\\text{tr}} (\\Omega^n)|^2, \\qquad a_n > a_n^{\\rm cr} >0\n  \\label{dtd}\n\\end{eqnarray}\n \\begin{itemize}\n\\item The double-trace deformation is $O(N^2)$: it is as important as the action itself at large-$N$, and hence is {\\bf not a small perturbation of the action.} \n\\item In fact, it cannot be a small perturbation because it changes the phase structure  of the theory: it turns the deconfined phase into the confined phase. As such, one may at first guess that\nthe deformed theory has nothing to do with the original theory. This would be a natural point of objection for any sensible quantum field theorist.\n\\item But something striking happens.  The  effect of the deformation on observables  such as  the mass gap, spectra, string tension, topological susceptibility (neutral sector, center-singlet observables)\n is suppressed by $O(1/N^2)$. In other words, somewhat surprisingly, at large-$N$ {\\bf  its effect on  observables is a  small perturbation of order  $O(1/N^2)$}.  For a proof of this statement using loop equations, see \\cite{Unsal:2008ch}.\n \n \\item In the volume dependent $LN \\Lambda \\lesssim 1$ regime, the deformed theory is analytically calculable, and this regime is adiabatically connected to the $LN \\Lambda \\gg  1$ regime, with no gauge-invariant order parameter that can distinguish the two regimes. This is the realization of adiabatic continuity.  \n \n \\end{itemize}\nIn this sense, the double-trace deformation Eq.\\ref{dtd} defies standard  intuition. It is a special structure.   Veneziano once coined for us the special status of these deformations: \n``{\\it It is like a good samaritan, does the good deed, and disappears from the scene.}\"  But why is this so? \n\nThe reason is  $\\delta S= {\\color{black}+} {\\text{tr}}{\\Omega}  {\\text{tr}}{\\Omega}^{\\dagger}$, is a {\\bf positive  twisted  (center non-singlet) square operator}. The + sign  forces stability of the \ncenter-symmetry, for which  ${\\text{tr}}{\\Omega}$   is an order parameter. In the Schwinger-Dyson (or loop)  equations, one of the operators enters in some connected correlator, but the other part is always a spectator. Factorization, which is guaranteed thanks to center-stability, is then invoked, and  results in: $ \\langle {\\text{tr}} ({\\rm stuff})   {\\text{tr}}{\\Omega}^{\\dagger}  \\rangle = \\langle {\\text{tr}} ({\\rm stuff})  \\rangle  \\langle  {\\text{tr}}{\\Omega}^{\\dagger}  \\rangle  + O(1/N^2)$. \nBut  $ \\langle  {\\text{tr}}{\\Omega}^{\\dagger}  \\rangle $ is already zero because of  stabilization of the corresponding symmetry and the correction term  vanishes at $N=\\infty$.  This is the magic of center-stabilizing double-trace deformation. This construction also generalizes to other symmetry stabilizing double-trace operators \\cite{Cherman:2010jj}. Double-trace deformations have also been used in exploring {\\it partial} center-symmetry breaking phases \\cite{Ogilvie:2007tj, Myers:2007vc, Myers:2009df,Ogilvie:2012is}. \n\n\n\n\n\n\n\n  \n\\subsection{Deformed Yang-Mills and adiabatic continuity} \n\\label{adiabatic}\nThe dYM theory  in the  small-$S^1 \\times {\\mathbb R}^3$ regime  provides an example of semi-classsically calculable  confinement, which is adiabatically  connected  to pure Yang-Mills on ${\\mathbb R}^4$, and strong coupling non-abelian confinement \\cite{Unsal:2008ch,Shifman:2008ja}. \n In this sense, it is one of the most useful arenas to study non-perturbative dynamics. \nTo illustrate the basic idea, here we\ndiscuss some non-perturbative aspects of $SU(2)$ gauge theories.  \n\nAt small $S^1$,  due to weak coupling and the deformation potential,  the  $SU(2)$ theory is Higgsed down to $U(1)$   by a center-symmetric Wilson line  \n\\begin{eqnarray}\n \\Omega = \\langle \\Omega \\rangle \\times \\left( \\begin{array}{cc}\ne^{i  A_4L/ 2  } & \\cr\n& e^{-i A_4L/2 }\n\\end{array} \\right),   \\qquad  {\\rm with \\; vev} \\;\\; \n\\langle \\Omega \\rangle= \\left( \\begin{array}{cc}\ne^{i  \\frac{\\pi}{2}} & \\cr\n& e^{-i \\frac{\\pi}{2}}\n\\end{array} \\right). \n\\label{hol}\n\\end{eqnarray}\nwhere $A_4$ denotes fourth component of gauge field along Cartan subalgebra. \n Since the center symmetry is the only global symmetry that can distinguish the small and large circle regimes, and it  is {\\it unbroken}, the deformed theory exhibits {\\it adiabatic continuity}.  \nThe Wilson line behaves as a compact adjoint Higgs field, in contrast with the\n Polyakov model in which the adjoint Higgs field is non-compact and algebra valued \\cite{Polyakov:1976fu, Deligne:1999qp}.  This subtle difference in the topology of field space  has two significant consequences: first, instead of having just one type of monopole-instanton, there are two different types, ${\\cal M}_{1}$ and ${\\cal M}_{2}$. Second, there exists a \n topological $\\theta$ angle. \nOne type of monopole-instanton is the regular  3d  one, and  the other is a twisted (affine)  one  \\cite{Lee:1997vp, Kraan:1998sn}.These  defects carry two types of topological quantum numbers, magnetic and topological charge, $(Q_m, Q_T)$,  \ngive by ${\\cal M}_{1} : (+1,  +{\\textstyle {\\frac {1}{2}}})$ and ${\\cal M}_{2} : (-1,  +{\\textstyle {\\frac {1}{2}}})$. \nThe monopole-instanton operators are given by \n\\begin{eqnarray}\n&&{\\cal M}_{1} \\sim  e^{ - S_0  + i \\frac{ \\theta }{2}}  e^{ -   \\phi+i \\sigma}, \n \\qquad \n{\\cal M}_{2} \\sim  e^{ - S_0 +  i  \\frac{ \\theta  }{2} } e^{ +   \\phi - i \\sigma }, \\cr\n&&\\overline {\\cal M}_{1} \\sim  e^{ - S_0  - i \\frac{ \\theta }{2}}  e^{ -   \\phi- i \\sigma}, \n \\qquad \n\\overline  {\\cal M}_{2} \\sim  e^{ - S_0 -  i  \\frac{ \\theta  }{2} } e^{ +   \\phi + i \\sigma },  \\qquad  {\\rm where} \\;\\; \\;    \\frac{4 \\pi}{g^2}  (A_4L) \\equiv  \\phi \\, .\n\\end{eqnarray}\nHere  $\\sigma$ denotes the dual photon field, defined through the abelian duality relation,  $  \\epsilon_{ \\mu\\nu \\lambda} \\partial_{\\lambda} \\sigma  = {4 \\pi L \\over g^2 } F_{\\mu\\nu}$, and the form of the monopole-instanton amplitudes  account for long-range magnetic Coulomb interactions. Since fluctuations  $\\phi$ around background holonomy field is gapped by deformation, we set it to zero in the  discussion of long-distance physics. \n Note that the  action of the monopole-instanton  is $\\frac{1}{N}$  of the 4d-instanton action, $S_0= {\\textstyle {\\frac {1}{2}}} \\times S_I = \\frac{8 \\pi^2}{g^2N}$, with $N=2$ in the present example, and ${\\cal I}_{\\rm 4d}= {\\cal M}_{1}{\\cal M}_{2}=  e^{ - 2S_0 +  i \\theta } $ is the 4d-instanton amplitude. \n\n\n\n \\begin{itemize}\n\\item  At  $\\theta=0$,  the theory on ${\\mathbb R}^3 \\times S^1$ realizes confinement and a mass gap due to the monopole-instanton mechanism \\cite{Unsal:2008ch}, as in the  Polyakov  mechanism on ${\\mathbb R}^3$ i.e., Debye screening  in a  magnetically charged plasma  \\cite{Polyakov:1976fu}. The long-distance effective theory is \n\\begin{eqnarray}\nL^{\\rm d} (\\sigma) =&& \\frac{1}{2L} \\left( \\frac{g}{4\\pi} \\right)^2  (\\nabla  \\sigma)^2  - 4 a  e^{-S_0}   \\cos \\sigma  \n\\label{lag1}\n   \\end{eqnarray}\n   The mass gap (inverse Debye length)  is given by $m\\sim L^{-1} e^{-S_0/2} = \\Lambda(\\Lambda L)^{5/6}$.\n \n \\item Turning on the $\\theta$ angle introduces a sign problem in the Euclidean description, and in the dual description in Eq.\\ref{lag1}, alters  $ \\cos \\sigma \\rightarrow     \\cos \\left( \\textstyle \\frac{\\theta}{2} \\right)  \\cos \\sigma  $. \n For  $\\theta=\\pi$, \nthe  monopole-instanton induced  gap dies off due to destructive topological interference, between ${\\cal M}_{1}$ and $    \\overline {\\cal M}_{2}  $, and at leading order in semi-classics, the theory is gapless \\cite{Unsal:2012zj}. \nTo all orders in semi-classics the  theory must either be  gapless, or gapped and two-fold degenerate.  The latter choice is realized due to the magnetic bion mechanism, inducing a term  $e^{-2S_0} \\cos(2 \\sigma)$, originating from  the $[{\\cal M}_{1}   \\overline {\\cal M}_{2} ] $ correlated 2-event \\cite{Unsal:2012zj}.  The theory has two isolated vacua, and \n exhibits  spontaneous CP-breaking.  This is indeed compatible with the theory on  ${\\mathbb R}^4$, where the theory has a CP-symmetry at \n$\\theta=\\pi$,  which is  believed to be spontaneously broken  by the \nCP-odd condensate  $ \\langle {\\text{tr}}\\, (F_{\\mu \\nu} \\widetilde F^{\\mu \\nu})  \\rangle$.  This is again a manifestation of the adiabatic continuity idea. \n\n\\item The fact that confinement is realized by a magnetic bion mechanism has a dramatic impact.   The theory has two kinds of domain walls (lines) L$_1$, L$_2$  for which  $|\\int_{\\rm L_i} d \\sigma| =\\pi$ crossing the line,  while for an external unit charge, the monodromy of the dual photon is $\\oint d \\sigma= 2\\pi$. It is shown in \\cite{Anber:2015kea} that the string is a composite, ${\\rm L}_1 \\overline {\\rm  L}_2$ domain line, due to the $\\cos 2 \\sigma$ term.   \nConsider a segment  of ${\\rm L}_2$, and a well-separated  $q{\\overline} q=  \\overline {\\rm L}_2 {\\rm L}_1 $ pair parallel to L$_2$. Clearly,  $\\overline {\\rm L}_2 {\\rm L}_1 $ can fuse into \n${\\rm L}_2$, and reduce the energy of the system considerably. This forms  ${\\rm L}_2  {\\rm L}_1  {\\rm L}_2$ line, where the joining points are the quark and anti-quark. Since the tension of ${\\rm L}_1$  and ${\\rm L}_2$ are exactly degenerate, separating quarks on the wall does not cost any energy, i.e, quarks become liberated on the wall.  Such a scenario was proposed by S.J. Rey and Witten in the mid 1990s \\cite{Witten:1997ep} using the vacuum structure and ideas about confinement in supersymmetric theories.   The dYM theory and QCD(adj) (discussed in the next section)  are the first concrete  realization of this idea in a set-up  where the confining dynamics is analytically understood.  \n\\end{itemize}\n\n\\noindent The small circle limit of deformed YM  provides the  first  realization of the Polyakov mechanism  \\cite{Polyakov:1976fu} and generalization thereof    in  a  locally 4d setting,  thirty  years  after the original idea \\cite{Unsal:2008ch}!  As emphasized, dYM has intrinsically 4d aspects not present in the 3d Polyakov model.  There are a number of  interesting  recent works studying dYM, for example,   \\cite{Thomas:2011ee, Thomas:2012ib, Thomas:2012tu, Zhitnitsky:2013hs, Li:2014lza},  and  \\cite{Anber:2013xfa,Anber:2015wha,  Anber:2015bba}, and see  \\cite{Vairinhos:2010ha, Vairinhos:2011gv} for  initial lattice studies.\n \n \n\n\n\n\n\n\\section{Magnetic and Neutral Bions in QCD(adj):  Confinement and Center-Stability}\n\\label{bions}\nQCD(adj) compactified on ${\\mathbb R}^3 \\times S^1 $ does not break its center-symmetry when fermions are endowed with periodic boundary conditions, for any value of $n_f \\geq 1$. \nIn the small-circle regime, the theory has monopole-instantons, similar to dYM. \nTo keep the analogy with the dYM example, we continue to work with $SU(2)$  theory. \nIn contrast with the bosonic case,   \n each monopole-instanton operator has $2n_f$ fermion zero modes dictated by  Nye-Singer index theorem on ${\\mathbb R}^3 \\times S^1 $  \\cite{Nye:2000eg, Poppitz:2008hr} (also see \\cite{Poppitz:2009tw,\nPoppitz:2009uq,  Bruckmann:2003ag, Misumi:2014raa,GarciaPerez:2009mg}).\n  Thus, the monopole-instanton operators  become:\n\\begin{eqnarray}\n{\\cal M}_{1} \\sim  e^{ - S_0 }  e^{ - \\phi +i \\sigma} \\det_{I, J}  \\lambda^I \\lambda^J \n \\qquad \n{\\cal M}_{2} \\sim  e^{ - S_0  } e^{ +  \\phi - i \\sigma } \\det_{I, J}  \\lambda^I \\lambda^J   \\cr\n{\\overline} {\\cal M}_{1} \\sim  e^{ - S_0 }  e^{ -  \\phi -i \\sigma} \\det_{I, J}   {\\overline} \\lambda^I {\\overline} \\lambda^J \n \\qquad \n{\\overline} {\\cal M}_{2} \\sim  e^{ - S_0  } e^{ +   \\phi + i \\sigma }  \n\\det_{I, J}  {\\overline} \\lambda^I {\\overline} \\lambda^J \n\\label{mon-op}\n\\end{eqnarray}\nThis implies that the monopole-instantons cannot induce a mass gap and confinement in QCD(adj) \\cite{Unsal:2007jx}.  Note that the 4d instanton \n$I_{4d} \\sim {\\cal M}_{1} {\\cal M}_{2}$  has $4n_f$ fermion zero modes. \n\n\nAt a superficial level, QCD(adj) on  ${\\mathbb R}^3 \\times S^1 $  resembles the Polyakov model coupled to massless Dirac fermions on ${\\mathbb R}^3$. But the former confines, and the latter does not. \n\nTo understand the difference,  first, recall the important result \\cite{Affleck:1982as}. \n\n \\noindent \n{\\bf {\\color{black}  Affleck, Harvey, Witten [1982]}:} The Polyakov model  coupled to massless Dirac fermions on ${\\mathbb R}^3$  remains gapless non-perturbatively, and does not confine.  \nThe work of AHW was viewed as the death of the Polyakov model in theories with fermions.\n Yet, in QCD(adj) on ${\\mathbb R}^3 \\times S^1$,  it has been shown that  the theory confines, and induces a mass gap for gauge fluctuations \\cite{Unsal:2007jx}.  What is the major difference between the two? This is most easily explained in terms of global symmetries and the presence/absence of anomalies, and monopole-operators. \n\nOn  4-manifold   ${\\mathbb R}^3 \\times S^1 $,   the theory has an anomalous chiral $U(1)_A$ symmetry, reduced down to  ${\\mathbb Z}_{4n_f}$ due to instantons. The action of the ${\\mathbb Z}_{4n_f}$ on the multi-fermion part of the monopole-operator \nEq.\\ref{mon-op} is negation, but since ${\\mathbb Z}_{4n_f}$  is anomaly free, the invariance of the monopole operator demands one to shift $\\sigma \\rightarrow \\sigma + \\pi$, i.e. there is a ${\\mathbb Z}_2$ topological  shift symmetry associated with monopole-operators which forbids $e^{i (2n+1) \\sigma}$, but permits $e^{i 2n \\sigma}$, $n\\in {\\mathbb Z}^{+} $.  Thus, the generation of a mass gap for gauge fluctuations is permitted \\cite{Unsal:2007vu}.  In contrast, on a 3-manifold   $U(1)_A$ is non-anomalous,    and \n  the action of  $U(1)_A$  on the multi-fermion part of the monopole operator is continuous, say by $e^{i 4n_f \\alpha}$.  The invariance of the monopole operator demands that  $\\sigma \\rightarrow \\sigma - 4n_f \\alpha$, and this continuous shift symmetry protects the gaplessness of the dual photon \\cite{Affleck:1982as}. Relatedly,   ${\\cal M}_{2}$ does not exist on \n  ${\\mathbb R}^3$ \\cite{Unsal:2007vu}.\n\n  \n  \\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[angle=0, width=0.8 \\textwidth]{bionsetal}\n\\caption{Magnetic and topological charges \n$(Q_m, Q_T)$ of saddle-fields  in ${\\cal N}=1$ SYM   and \ntheir role in non-perturbative dynamics. In QCD(adj), monopole-instanton has $2n_f$ fermion zero modes.\n }\n\\label{bionsetal}\n\\end{center}\n\\end{figure}\n\n  \\noindent\n  On ${\\mathbb R}^3 \\times S^1$, at second order in the semi-classical expansion, there are two types of correlated two-events (or bion events):\n\\begin{eqnarray} \n&&{\\rm magnetic \\;  bions:}  \\; {\\cal B}_{12}=  [{\\cal M}_1 \\overline {\\cal M}_2]\n      \\sim  e^{-2S_0} e^{+2 i \\sigma}  ,   \\qquad   \\; {\\cal B}_{21}=  [{\\cal M}_2 \\overline {\\cal M}_1]\n      \\sim e^{-2S_0} e^{-2 i \\sigma}, \\cr    \n&&{\\rm  neutral \\;  bions:  } \\;\\;\\;\\;  {\\cal B}_{11}= [{\\cal M}_1 \\overline {\\cal M}_1]\n      \\sim  e^{-2S_0 + \\color{red} {i \\pi}}e^{ - 2\\phi} ,   \\;  \\; \\; \\;  {\\cal B}_{22}= [{\\cal M}_2 \\overline {\\cal M}_2]\n      =      e^{-2S_0 + {\\color{red}   i \\pi}}  e^{+2 \\phi}, \\qquad \\qquad\n      \\label{bions-amp}\n      \\end{eqnarray}\n   Magnetic bions  \\cite{Unsal:2007jx, Anber:2011de}  and neutral bions \\cite{  Poppitz:2011wy,  Argyres:2012ka,  Argyres:2012vv}   are \n   correlated-two-events  with magnetic and topological charges $(\\pm2, 0)$ and $(0,0)$.   The neutral bion is indistinguishable from the perturbative vacuum in the usual topological sense.  \n   But below, we discuss the meaning of  the $e^{{i \\pi}}$ factor, which arises as a {\\it hidden topological angle},  which can distinguish the two saddles.  \n    \n   \n   The magnetic and neutral bion saddles are non-self-dual. If the monopole-size is $L$, the bion saddles have a characteristic size $L/g^2$, parametrically larger than the monopole size, but  parametrically smaller than the  inter-monopole separation.  The long distance effective theory is described by the proliferation of one- and two-events, and  is given by (for $n_f  > 1$ theories,  the holonomy field $\\phi$ decouples from the IR-dynamics) \n \\begin{eqnarray}\nL^{\\rm d} (\\sigma) =&& \\textstyle{ \\frac{1}{2L} \\left( \\frac{g^2}{4\\pi} \\right)^2 }  \n[(\\nabla  \\phi)^2 + (\\nabla  \\sigma)^2 ]+  e^{-2S_0}  \\left( -\\cos {2\\sigma}  -   e^{i\\pi}  \\cosh{2\\phi} \\right)  + (n_f-1)V (\\phi)   \\cr\n&&   \\textstyle{ + {\\overline} \\lambda^I  \\sigma_i \\partial_i  \\lambda^I + \ne^{- S_0}  \\cosh \\phi  \\cos  \\sigma  (\\det_{I, J}  \\lambda^I \\lambda^J + {\\rm {c.c.}})  }\n \\label{lag3}\n   \\end{eqnarray}\n Magnetic bions lead to a mass gap for gauge fluctuations and a finite string tension, i.e. confinement.   To our knowledge, this is the first analytic demonstration of confinement in a  locally 4d (non-supersymmetric) QCD-like gauge theory, and it is a relatively unanticipated mechanism. Neither monopole-instantons, as in Polyakov model \\cite{Polyakov:1976fu}, nor monopole or dyon particles, as in Seiberg-Witten theory  \\cite{Seiberg:1994rs}, is the origin of confinement. Instead, the mechanism is \ninduced by non-selfdual bion saddles.    Furthermore, the bion-induced potential has two minima within the fundamental domain of $\\sigma$, with $\\langle e^{i \\sigma} \\rangle = \\pm 1$ associated with discrete chiral  symmetry breaking and two vacua. \n\nNeutral bions generate a non-perturbative potential for the Wilson line, and generate a \npotential between the eigenvalues of Wilson lines, i.e, preferring center-stability. \nIn the $n_f=1$ theory, since the perturbative contribution  to the Wilson line potential is absent, \ncenter stability is realized via the neutral bion mechanism. \n\nFor $1 <n_f  <n_f^{*}$, where $n_f^*$  is the lower boundary of the conformal window,  the theory is expected to exhibit $SU(n_f) \\rightarrow SO(n_f) $ non-abelian chiral symmetry breaking on \n${\\mathbb R}^4$.   At weak coupling, this symmetry is {\\it not} spontaneously broken,  and the small-$S^1 \\times {\\mathbb R}^3$ regime realizes confinement with discrete chiral symmetry breaking, but without non-abelian chiral symmetry breaking \\cite{Unsal:2007vu,Unsal:2007jx}.\n As one increases $L$, (i.e., at stronger coupling)  the monopole-induced term can lead to continuous chiral symmetry breaking, as in the Nambu-Jona-Lasinio model, but now realized as a zero temperature quantum phase transition. \nThis happens at the boundary of the semi-classically justified long-distance effective  theory. Unfortunately, there is no known microscopically reliable method to explore this regime. Nonetheless,  it is encouraging  that the reliable effective theory  based on  monopole-instantons and bions  generates confinement, discrete chiral symmetry breaking and has the seed of non-abelian chiral symmetry breaking  on QCD-like theories on $S^1 \\times {\\mathbb R}^3$.   Models  emulating this physical set-up  also exhibit   \n non-abelian chiral symmetry breaking \\cite{ Nishimura:2009me, Shuryak:2012aa, Liao:2012tw, Larsen:2015tso,Misumi:2014raa}. For other roles of  the bion saddles in diverse theories, \n see  \\cite{Misumi:2014bsa, Misumi:2014jua, Nitta:2015tua, Nitta:2014vpa}.\n  \n  \n\n  \n  \n  \\section{Toward Picard-Lefschetz Theory of Path Integration} \n  \\label{picard}\nSome aspects of the bion saddles in ${\\cal N}=1$ SYM and QCD(adj) raises  interesting puzzles. \nFor example, how can  bions (which are presumably  constructed as {\\it approximate} solutions) be responsible for {\\it exact} results such as the vanishing of vacuum energy or a condensate in  ${\\cal N}=1$ SYM. Further, consider the following facts, which at first sight seem to suggest a possible incompatibility between SUSY and semi-classical analysis: \n  \\begin{itemize}\n  \\item It is a widely known fact  that in supersymmetric theories, the ground state energy is  {\\it positive-semidefinite non-perturbatively}, and zero to all orders in perturbation theory. \n\\item It is an under-appreciated, but extremely important fact, that the contribution of {\\it real} non-perturbative saddles (e.g. instantons)  to the ground state energy is  {\\it  universally negative semi-definite} (in the absence of a topological $\\theta$-angle or Berry phase)  \\cite{Behtash:2015zha, Behtash:2015loa}. \n\n\\end{itemize}\nThe standard textbook treatment of path integrals [see\nthe beautiful book by Coleman \\cite{Coleman}, or  reviews on QCD \\cite{Schafer:1996wv}],  presents a formalism in which only real saddles are accounted for.  \nDoes this mean that semi-classical analysis and supersymmetry are incompatible with each other? The answer is no, but the answer requires a significant revision of conventional semi-classics, broadening the perspective to explicitly include {\\it complex saddles}.\n\n\\vspace{0.3cm}\n\n\\noindent\n{\\bf Euclidean  path integral in quantum mechanics:}\nAssume one is given a Euclidean path integral  over real paths/fields.  Refs.\\cite{Behtash:2015zha, Behtash:2015loa} propose that the semi-classical analysis of generic Euclidean path integrals necessarily requires complexification of the path space,  ${\\cal P}$,\n \\begin{eqnarray}\\label{eq:comp}\n x(t) \\in {\\cal P} \\longrightarrow z(t)= x(t) + i y(t) \\in  {\\cal P}^{\\mathbb C} \n \\label{comp}\n\\end{eqnarray}\nHere $ {\\cal P}^{\\mathbb C} $ denotes the complexified path space, and one should consider \npath integration over the middle-dimensional cycles $\\Gamma$ for which  ${\\mathrm{Re}} [ {\\cal S} ( z(t))] \\rightarrow \\infty$.   \nThis means that in order to find the possible set of saddles that may contribute to the path integral,  instead of solving the {\\it real} classical Euclidean equations of motion, one should solve the {\\it holomorphic} classical Euclidean equation of motion. For example, in quantum mechanics of a particle in a potential $V(x)$,  \n\n\n to find saddles, one should solve the holomorphic Newton equations in the inverted potential:\n \\begin{eqnarray}\\label{eq:eom1}\n\\frac{d^2 z}{dt^2}= +\\frac{\\partial V}{\\partial z},  \n      \\qquad {\\rm instead \\;  of }  \\qquad   \\frac{d^2 x}{dt^2}=+\\frac{\\partial V}{\\partial x} \n\\end{eqnarray}\nwhere $V(z) = V_{\\rm r}(x,y) +i V_{\\rm i}(x,y)$ is holomorphic. \nThe second one of these, the  textbook recipe, misses some of the most important contributing saddles. Note that the first equation in  Eq.\\ref{eq:eom1} is a coupled set of equations, which generically do not decouple, for the real and imaginary parts of the path. This simple fact has interesting consequences \\cite{Behtash:2015zha, Behtash:2015loa}.\n\nThe relation between holomorphization and Picard-Lefschetz theory is the following.  If we (boldly) translate standard knowledge of steepest descent cycles in finite dimensions \\cite{AGZV2, Pham}\nto infinite dimensions,  we find a complex version of gradient flow \\cite{Witten:2010cx}. For the real space path integral, this amounts to solving the complex gradient flow equations:\n\\begin{eqnarray}\n\\frac{\\partial z  (t, u)}{\\partial u} \n  =  +  \\frac{ \\delta {\\overline} {\\cal S} }{ \\delta {\\overline} z}    \n =  + \\left(  \\frac{d^2 {\\overline} z}{dt^2}  \n            -  \\frac{\\partial{\\overline} V}{\\partial {{\\overline} z}}   \\right)     \n      \\, , \\qquad\n\\label{PLW-3}\n\\end{eqnarray}\nThe holomorphic equations of motion are just the vanishing condition on the right hand side of the complex gradient flow (or Picard-Lefshetz) equations. The resulting solutions form a more complete basis for saddles which may contribute to path integral. \n\nThe practical implications of these formal ideas have not yet been fully realized in QFT.\nHowever, in the \npath integral formulation of quantum mechanical systems with bosonic and $n_f$ Grassmann fields (emulating the flavor degrees of freedom of QCD), it has been demonstrated that the counterpart of the magnetic bion is an exact {\\it real} saddle  non-selfdual solution,  and the  counterpart of the neutral  bion is an exact  {\\it complex} non-selfdual solution to the holomorphic Newton equations in the inverted potential \\cite{Behtash:2015zha, Behtash:2015loa}.\n\n\\subsection{Hidden Topological Angles and Complex Saddles}\n\\label{HTA}\n\n\nA {\\it hidden topological angle} (HTA) is an  invariant angle associated with saddle points of the complexified path integral and their descent manifolds (Lefschetz thimbles)\\cite{Behtash:2015kva, Behtash:2015kna}. \n The HTA is  distinct from  theta-parameter  in the lagrangian.  \n But in a way similar to the usual $\\theta$-parameter, which turns the instanton fugacity\n into a  complex fugacity, $e^{-S_I + i \\theta}$, the HTA also plays a similar role in the path integral saddle space. For real saddles, the HTA is zero.  \nThe  HTA plays a crucial role in the dynamics, e.g, gluon condensate, vacuum energy,  and center stability, as  discussed below. It is a conceptually new ingredient in the more rigorous understanding of semi-classics.  \n\n  Now, we can  explain the resolution of the problem that we set in \\S\\ref{largeN}:   the vanishing and anomalously small gluon condensate in, respectively,  ${\\cal N}=1$ SYM and non-supersymmetric QCD(AS). This also provides the resolution of the puzzle stated at the beginning of \\S\\ref{picard}, concerning an apparent incompatibility of SUSY with semi-classical analysis.\nTo highlight the surprising aspect of this analysis,  we recall the folklore  that  \n the gluon condensate can only receive positive semi-definite contributions in a semi-classical expansion (when the topological theta angle is set to zero) in a vector-like theory,  see  \n \\cite{Callan:1977gz, Schafer:1996wv, Shifman:1978bx}. \n\nConsider  ${\\cal N}=1$ SYM on small ${\\mathbb R}^3 \\times S^1$ where it is semi-classically calculable.   At leading order in semi-classics, the gluon condensate is zero \nbecause in the  monopole-instanton background, the measure has two unpaired fermion zero modes, and the Grassmann integral over them gives zero. At second order, there are  non-vanishing  contributions. Magnetic bions contribute positively, but there is an extra  $e^{i\\pi} $ phase associated with the neutral bion. As such, at second order in semi-classics, one has \n\\begin{eqnarray}\n\\label{cancel}\nL^4  \\langle {\\textstyle \\frac{1}{N}} {\\rm tr} F^2_{\\mu \\nu} \\rangle  \n   &=\n    (n_{ {\\cal B}_{ij}} +   e^{i  \\pi} n_{ {\\cal B}_{ii}})  = e^{-2S_0} +  e^{{\\color{red} i \\pi }} e^{-2S_0}  =  {\\color{red} 0} \\, . \n\\end{eqnarray}\nBy the trace anomaly, this translates to a result for the vacuum energy density: \n\\begin{eqnarray}\n{\\cal E}_{\\rm vac}  = \\frac{1}{4} \\frac{\\beta(g)}{g^3} \\langle {\\rm tr}\\, F^2_{\\mu \\nu}\\rangle \\propto -e^{-2S_0} -  e^{{\\color{red} i \\pi }} e^{-2S_0}  =  {\\color{red} 0} \n \\end{eqnarray} \nThe  HTA, the angle $\\pi$ in the $e^{i\\pi}$ factor accompanying the neutral bion contribution, provides the resolution of both the puzzles mentioned in \\S\\ref{largeN} and \\S\\ref{picard}, which actually turn out to be the same problem due to the trace anomaly relation. \nThe contribution of the real saddle to the vacuum energy is negative, but there also exists a complex saddle, whose action is complex due to the HTA, and its contribution to the vacuum energy is positive. Moreover, the real part of the actions of the real and complex saddles are the same, so the two contributions cancel. This is the mechanism by which the semi-classical expansion is consistent with the SUSY algebra. Both the complex saddle and the HTA are crucial for the argument. \nThis example   also demonstrates that in  using  Lefschetz thimbles, for example, either in Euclidean   semi-classics  \nor real time semi-classics (with sign problems) \\cite{Tanizaki:2014xba, Cherman:2014sba}\nor in lattice simulations \n\\cite{Cristoforetti:2012su,Cristoforetti:2013wha,Fujii:2013sra,Aarts:2014nxa},  \nall   thimbles whose Stokes multipliers are non-zero must be summed over. \nNumerical evidence for the  correctness of this perspective is also given in  \\cite{Kanazawa:2014qma,Tanizaki:2015rda,Alexandru:2015xva, Hayata:2015lzj,Fujii:2015bua}. \n\n\n\n\n\nIn  QM models  with $n_f$ Grassmann fields,    it is possible to construct exactly the non-selfdual bion solutions. They are solutions to the second-order (non-BPS) classical equations, with finite  action, and the imaginary part of their action is always a multiple of $\\pi$.   Furthermore, it has been shown that they are the  exact form of the (approximate) correlated two-instanton events, and can be identified with Lefschetz thimbles \\cite{Behtash:2015kva, Behtash:2015kna}. Interestingly, if one restricts to real solutions it is not possible to find such exact saddle solutions, and  the standard practice in the past  was to construct approximate instanton/anti-instanton quasi-solutions. The situation is much improved now. \n\n \nThe relation between the instanton type BPS solutions and our exact non-selfdual solutions is also of importance and gives more insight into the full story. \nThe position of a BPS instanton solution  is a  moduli, but with two such events, \ntheir separation is a quasi-zero mode, a parametrically small non-Gaussian mode, that needs to be integrated exactly to get the correct correlated two-event amplitude.   \n In the background of multi-instantons,  we consider decomposing the full space of fields  \n  into \n \\begin{eqnarray}\n{\\cal J}^{\\rm full} ={\\cal J}^{\\rm Gaussian} \\times {\\cal J}^{\\rm zm} \\times  {\\cal J}^{\\rm qzm}  ~.\n\\label{LT}\n \\end{eqnarray} \n where ${\\cal J}^{\\rm full}$ is the full thimble in field space, and ${\\cal J}^{\\rm Gaussian}$ are the Gaussian fluctuations of the fluctuation operator, $ {\\cal J}^{\\rm zm} $ and   $ {\\cal J}^{\\rm qzm} $  are exact and  quasi-zero mode directions. \n As shown in \\cite{Behtash:2015kna},  the relative angle between the magnetic and neutral bion  thimbles is\n\\begin{eqnarray} \n{\\rm Arg} ( \\mathcal{J}_{ {\\cal B}_{ii}} )  \n    = {\\rm Arg} (\\mathcal{J}_{ {\\cal B}_{ij}} )  + \n     \\pi\\, . \n\\end{eqnarray}\nwhich is a ${\\mathbb Z}_2^{\\rm HTA}$-worth of hidden topological angle structure. \nThis is the  origin of the vanishing of the gluon condensate and the vanishing vacuum energy  in the  semi-classical domain of ${\\cal N}=1$ SYM.    The HTA  also explains the parametric smallness of the gluon condensate in non-supersymmetric QCD(AS)\\cite{Behtash:2015kna}. Next, we discuss the role of the neutral bion and the HTA in center-symmetry realization. \n\n\n\n\n\n\\subsection{Calculability and the Deconfinement Phase Transition}\n\\label{calculability}\nStudying deconfinement or the center-symmetry-changing phase transition in continuum  QCD-like theories  by reliable analytical methods proved to be impossible until recently. Perhaps the state of the art perspective  on the subject is still the one expressed by Gross-Pisarski-Yaffe (GPY) from 1981 \\cite{Gross:1980br}: {\\it ``It is hardly  surprising that  we cannot explore the transition as the temperature is lowered, from the unconfined to the confined phase using solely weak coupling techniques.\"}   \nOne possible way around this obstacle, by considering the theory on small  $S^3 \\times S^1$, is found in \\cite{Aharony:2003sx}.    In this context, since the theory is at finite volume, a genuine phase transition is only possible at  $N=\\infty$, where the  thermodynamic limit  is achieved \\cite{Aharony:2003sx}. \n In  \\cite{Poppitz:2012sw, Poppitz:2012nz}, a new idea resolving the GPY-problem  is presented on the thermodynamic   ${\\mathbb R}^3 \\times S^1$ setting,  so that it works  for arbitrary gauge group $G$. For related works, see \\cite{Poppitz:2013zqa, \n Anber:2014lba, Anber:2013doa, Anber:2012ig, Anber:2011gn,Shuryak:2013tka}.\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[angle=0, width=1.0\\textwidth]{su3-master}\n\\caption{(Left) Continuity of calculable and incalculable phase transitions. (Right) Contour-plot of the traced  Wilson line potential in three different (semi-classical) regimes, for $SU(3)$ gauge theory. \n}\n\\label{center-sym}\n\\end{center}\n\\end{figure}\n\n \\noindent\n{\\bf The Main Idea \\cite{Poppitz:2012sw, Poppitz:2012nz}:} The goal is to find a calculable phase transition and gain insight into the transition in pure Yang-Mills theory.  Consider ${\\cal N}=1$ SYM, with a gauge boson and a fermion, and continuously connect this theory \nto pure Yang-Mills by turning on a mass term $m$ for the fermions.  \nAt $m=0$,   using the twisted partition function Eq.\\ref{tpf}   on ${\\mathbb R}^3 \\times S^1$ (i.e., non-thermal periodic boundary conditions for fermions), this theory exhibits  analyticity   \nas a function of $L$; hence, no phase transitions \\cite{Witten:1982df, Davies:2000nw}.   In fact, Eq.\\ref{tpf} is the Witten index, and is a constant, independent of $L$. \n At $m=\\infty$, the  theory reduces to pure YM. \n Consider finite and small $(m, L)$. If one takes $m\\rightarrow 0$,  $L=$ fixed, the theory lands on a  confining phase, and the center is unbroken due to the non-perturbative center-stabilizing potential induced  by the  neutral bion.  If one takes $m=$ fixed, \n$L \\rightarrow  0$,  the theory lands on a center-broken (deconfinement) regime, \ndue to the perturbative one-loop center-destabilizing  GPY-potential. This means that the two limits do not commute, and there must exist a calculable phase transition in between. Indeed there is, as shown in  Fig.~\\ref{center-sym}(left), for any simple gauge group.  More precisely,    the deconfinement phase transition in pure Yang-Mills theory is continuously connected to a quantum (non-thermal)  phase transition in mass-deformed SYM theory. This transition can be studied in a controlled way. \n \nThe surprising outcome of this idea is that  the mechanism governing the phase transition is universal, and valid for all simple groups. As an example, here we express the induced potential  in dimensionless variablles,  $\\tilde m=m/\\Lambda, \\tilde L = L \\Lambda$, just for the $SU(2)$ theory:\n\\begin{eqnarray}\n\\label{totalpotential2}\n\\tilde{V} &&= V_{\\rm neutral \\; bion} + V_{\\rm magnetic  \\; bion} + V_{\\rm mon. \\; inst.} + V_{\\rm pert.} \\\\\n&&\n \\textstyle{ = { \\color{red} + } \\cosh 2 \\phi - \\cos 2 \\sigma \n  { \\color{red} - }  {1\\over2}  {\\tilde m   \\over \\tilde{L}^2 } \\cos\\sigma \n   \\left( \\cosh \\phi - \\frac{1}{3\\log\\tilde{L}^{-1}} \n            \\phi \\sinh \\phi    \\right) \n  { \\color{red} -}  {1 \\over 1728}  \\left({\\tilde{m}  \\over  \\tilde{L}^2}\\right)^2 \n         {1 \\over  \\log^3   \\tilde{L}^{-1} } \\; \\phi^2 ~}. \\nonumber\n \\end{eqnarray}\nNeutral bions  favor  center stability and generate repulsion among the eigenvalues of the Wilson line (forcing $\\phi=\\alpha=0$ in Eq.\\ref{hol}.) Here, the crucial point is the HTA associated with the neutral bion Eq.\\ref{bions-amp}. Were it not for the HTA,  the neutral bion  would lead to a center-destabilizing effect!  \nAt finite $m$, both  the perturbative one-loop  potential,  and \nthe monopole-instantons  prefer center breaking, leading to an attraction among the eigenvalues of Wilson line. This contradicts some  folklore that  monopole-instantons favor confining Wilson line holonomy. \n\nThe semi-classical phase transition is  driven by the competition between these three effects. Fig.\\ref{center-sym}(right) shows  contour plots for  the potential for the trace of the $SU(3)$ gauge theory Wilson line  $\\langle {\\text{tr}} (\\Omega) \\rangle $ \nin three regimes: (i) confined phase; (ii) phase between the limits of meta-stability (where  confined   or deconfined holonomy minima coexist, and one of these is the the  global minimum)  and (iii) deconfined phase.  \n All three regimes have been observed in lattice simulations \\cite{Bringoltz:2005xx}. We remind the reader that this figure is not a model. There are no tuned parameters; it is the result of a controlled semi-classical computations.  \n \n This framework can also be used to investigate the effect of the \ntopological  $\\theta$-angle dependence on the phase transition and critical temperatures, see \\cite{Poppitz:2012nz, Anber:2013sga}. The most interesting  results is that $T_c(\\theta)$, the critical temperature,  is a multi-branched function, which has a minimum at  \n $\\theta=\\pi$.   These results  inspired various lattice studies, which exhibit remarkable matching to the theoretical predictions \\cite{D'Elia:2012vv, Bonati:2013tt, D'Elia:2013eua, Bonati:2015sqt}. \n The semi-classically calculable realization of center-symmetry also inspired related works in the strong coupling regime, see \\cite{Liu:2015ufa, Liu:2015jsa, Larsen:2015vaa}, and lattice simulations \\cite{Bergner:2014dua}.\n\n\n  \n\n\n\\section{Resurgence, Renormalons and Neutral Bions}\n\\label{resurgence}\n\nIn this final section, we present a brief overview of the resurgence program  in non-trivial QFTs\n such as   bosonic non-linear  sigma models in two dimensions ($\\mathbb {CP}^{N-1}$, Grassmannian, $O(N)$, principal chiral model (PCM)),  and  Yang-Mills  and one-flavor QCD-like theories  in four dimensions \\cite{Dunne:2015eaa}.  The link to the previous sections is the fact that the neutral bion can be identified as the semi-classical realization of the infrared (IR) renormalons in these asymptotically free QFTs \\cite{Argyres:2012ka, Argyres:2012vv, Dunne:2012ae, Dunne:2012zk}, and that the Lefschetz thimble construction naturally encodes resurgence.  These asymptotically free theories are incalculable on ${\\mathbb R}^d$, ($d=2,4$), for reasons explained below, and are all believed to be gapped.  \nWe describe here the analysis for the two dimensional $\\mathbb {CP}^{N-1}$ sigma model, \n\nand we comment later on  the similarities and differences for the other theories. In fact, the structure that emerges for all of these theories on ${\\mathbb R}^{d-1} \\times S^1$ exhibits a surprising level of universality. \n\nThe deep puzzles concerning these theories, emanating from profound work in the  late 1970s and early 1980s \\cite{'tHooft:1977am,Beneke:1998ui, Callan:1977gz, Schafer:1996wv},  are all very similar. \n\nRecently, progress has been made in  the non-perturbative understanding of these theories, by combining the idea of adiabatic continuity described in \\S\\ref{sec:adiabatic} above, and the mathematical formalism of resurgence.  Resurgence is a general mathematical formalism that unifies perturbative and non-perturbative expansions into a single unified framework in the form of a trans-series, such that the entire trans-series is internally self-consistent with respect to Borel summation and analytic continuation of the couplings, and naturally incorporates  Stokes phenomena \\cite{Ecalle:1981,bh90,Costin:2009,Aniceto:2013fka,Dunne:2015eaa}. These ideas have also had a profound impact on the study of matrix models and string theory\n\\cite{Marino:2008ya,Pasquetti:2009jg,Aniceto:2011nu,Aniceto:2014hoa, Garoufalidis:2010ya}.  \n\nIt is well known that perturbation theory in almost all interesting QFTs  is a divergent asymptotic expansion, even after regularization and renormalization. A powerful method to extract physical meaning from such a divergent expansion is the Borel transform, and the Borel sum. The Borel transform maps the (typically factorially divergent) series to a new convergent series: $P(g^2) = \\sum_{n=0}^\\infty a_n\\, g^{2n} \\longrightarrow BP(t) := \\sum_{n=0}^\\infty a_n\\, t^{n}/n!$,\nand the Borel sum is the Laplace integral: ${\\mathbb P}(g^2) =  \\frac{1}{g^2} \\int_0^\\infty BP(t)\\, e^{-t/g^2} dt $. \nFormally, ${\\mathbb P}(g^2)$ assigns a value to $P(g^2)$, but \nin almost all interesting QM examples, and for the above QFTs, \n $BP(t)$ has singularities at $t_i \\in {\\mathbb R}^+$ on the positive Borel axis, which means that ${\\mathbb P}(g^2)$ as defined by the integral is \\emph{ambiguous}, depending on how one deforms the contour around the singularity. In certain cases, such as the QM cubic oscillator or the Stark effect problem, there is such a singularity but it has a clear physical meaning in terms of the instability of a metastable state, so the ambiguity is easily resolved by the physical condition of causality. But in other theories, such as the symmetric double-well, or periodic potential, or in asymptotically free QFTs, the systems are stable,  and yet the ambiguous, non-perturbative imaginary contribution remains. In these cases, it implies that Borel resummed perturbation theory is incomplete on its own.\n Note that the pathological ambiguity has the non-perturbative form $\\pm i e^{-t_i/g^2}$.  \n \nIn QM with instantons there is  another,  lesser known, pathology, coming not from perturbation theory but from  the non-perturbative \"instanton-gas\" expansion itself. The one-instanton sector is well-defined and unambiguous  \\cite{Coleman}, but in the two-instanton sector, when one calculates the instanton-antiinstanton  $[{\\cal I} {\\overline} {\\cal I}]$  amplitude, via a procedure that was referred to as the  BZJ-prescription in \\cite{Argyres:2012ka,  Dunne:2012zk}, due to important works  by  Bogomolny \\cite{Bogomolny:1980ur} and  Zinn-Justin \\cite{ZinnJustin:1981dx},  one finds that  the $[{\\cal I} {\\overline} {\\cal I}]$  amplitude is also multi-fold ambiguous. \n This prescription was partly a black-box until recently, and did not always produced a sensible result. \n \nIt is  now better understood using Lefschetz thimble  techniques and complexification of path integral \\cite{Behtash:2015loa, Behtash:2015kva},  and again the net result is  that the two imaginary ambiguous non-perturbative terms cancel one another, restoring consistency of the full \"trans-series\" representation of the (real) physical quantity being computed:\n\n", "index": 1, "text": "\\begin{equation}\n{\\mathrm{Im}}[ {\\mathbb P}_\\pm(g^2) + [{\\cal I}{\\overline{\\cal I}}]_\\pm (g^2) ] = 0, \n\\label{cancel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\mathrm{Im}}[{\\mathbb{P}}_{\\pm}(g^{2})+[{\\cal I}{\\overline{\\cal I}}]_{\\pm}(g^%&#10;{2})]=0,\" display=\"block\"><mrow><mrow><mrow><mi>Im</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><msub><mi>ℙ</mi><mo>±</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mrow><mo stretchy=\"false\">[</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mo>⁢</mo><mover accent=\"true\"><mi class=\"ltx_font_mathcaligraphic\">ℐ</mi><mo>¯</mo></mover></mrow><mo stretchy=\"false\">]</mo></mrow><mo>±</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03414.tex", "nexttext": "\nHere $\\Lambda$ is the strong scale of the theory. \nBoth the ambiguity and the jump  can be interpreted as Stokes phenomenon in  field space.\n\n\n\n\n\n  \n\n  \n  \\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[angle=0, width=1.1\\textwidth]{borel-frac}\n\\vspace{-4.3cm}\n\\caption{ (Left) Borel plane for $\\mathbb {CP}^{N-1}$ on ${\\mathbb R}^2$ versus the one in the weak coupling semi-classical domain on ${\\mathbb R}^1 \\times S^1$. The neutral bion singularities coincide with the IR renormalon ones. (Right) Splitting  of a 2d instanton  into two  1d kink-instantons as the size moduli is varied in the center-symmetric background on \n${\\mathbb R}^1 \\times S^1$  for $N=2$ case. \n }\n\\label{Borel}\n\\end{center}\n\\end{figure}\n\n\n\nThe mass gap in the small ${\\mathbb R}^{1} \\times S^1$ regime is also calculable, and  is given by  $m_g \\sim (LN)^{-1} e^{- \\frac{4\\pi}{g^2N}} =\\Lambda$. \nThe gap is exactly what one expects on ${\\mathbb R}^2$ based on large-$N$ and lattice simulations. It is induced at leading order due to  kink-instantons. This formula is valid for all $N$. \n\n \nWe conclude with some comments: \n\\begin{itemize}\n \\item The leading cancellation is the first step of a bigger structure. If these resurgent cancellations proceed ad infinitum, (as they are known to do in QM models), then in the weak-coupling semi-classical domain, our formalism provides a non-perturbative continuum definition of the QFT. \n \n\n\n \\item In the $O(N \\geq 4)$ vector model,  and in the principal chiral model, there are no instantons. So how can this resurgent cancellation idea work? In fact, these QFTs have finite action non-selfdual saddles. These saddles have negative fluctuation modes, producing imaginary factors, and play a role similar to the $[\\cal I {\\overline} {\\cal I}]$-saddle \\cite{Cherman:2013yfa, \n Cherman:2014ofa,  Dunne:2015ywa}. Upon compactification, the 2d-saddles fractionalize into $N$ smaller action saddles.  Surprisingly, the saddle fractionalization structure in these theories on  ${\\mathbb R}^{1} \\times S^1$ is isomorphic to $SO(N)$  gauge theory on  ${\\mathbb R}^{3} \\times S^1$, following a pattern dictated by Lie algebra data, with multiplicities given by dual Kac labels \\cite{Dunne:2015ywa}.\n \n\n\n \\item In the calculable domain, puzzles  concerning \"large-$N$ versus instantons\"   \\cite{Witten:1978bc}  simply  disappear , because the weight  of these saddles is governed by the 't Hooft coupling. \n \n \n \\item\n By analogy with the operator product expansion, viewed as a trans-series combining non-perturbative condensates with perturbative fluctuations, one can use knowledge of the vanishing of certain condensates (e.g.,  due to some degree of SUSY) to predict novel cancellation mechanisms in perturbative sectors \\cite{Dunne:2015eoa}.\n \n \n\n\\item In Yang-Mills (and other 4d gauge theories), the \nneutral bion singularities occur at $2S_I/N$ on small $S^1 \\times {\\mathbb R}^3$,   but the leading renormalon ambiguity is expected to occur at  $4S_I/\\beta_0$ on ${\\mathbb R}^4$. \nThe crucial point (guaranteed by adiabatic continuity)  is that both singularities are at $\\frac{1}{N}$ with respect to the instanton one. The   Borel flow of singularities   remain to be understood  \\cite{Cherman:2014ofa}.\n\n\n\n  \\item \nWe see tantalizing  evidence that observables in asymptotically free QFT are in fact resurgent. The goal would be to confirm that such a  resurgence property continues to hold for strongly coupled theories on ${\\mathbb R}^d$ as well. \n\n\\end{itemize}\n\n \n \n\n\\section*{DISCLOSURE STATEMENT}\nThe authors are not aware of any affiliations, memberships, funding, or financial holdings that\nmight be perceived as affecting the objectivity of this review. \n\n\n\\section*{ACKNOWLEDGMENTS}\nWe  acknowledge useful discussions  with E. Poppitz, L. Yaffe, P. Argyres, M. Shifman, T. Sch\\\"afer,  A. Cherman, D. Dorigoni, G. Basar, T.  Sulejmanpasic, and M. Anber.  M.\\\"U.'s work  was  partially supported by the Center for Mathematical \nSciences and Applications  (CMSA) at Harvard University. Our work was supported in part by the US Department of Energy grant   DE-SC0013036 (M.U.) and DE-SC0010339 (G.D.).\n\n\n\\begin{thebibliography}{96}\n\\expandafter\\ifx\\csname\nnatexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\n\n\n\n\n \n \n \n \n \n\\bibitem{Eguchi:1982nm}\n  T.~Eguchi and H.~Kawai,\n````Reduction of Dynamical Degrees of Freedom in the Large N  Gauge Theory,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 48}, 1063 (1982).\n  \n \n\\bibitem{GonzalezArroyo:1982hz} \n  A.~Gonzalez-Arroyo and M.~Okawa,\n``The Twisted Eguchi-Kawai Model: A Reduced Model for Large N Lattice Gauge Theory,''\n  Phys.\\ Rev.\\ D {\\bf 27}, 2397 (1983).\n  \n  \n  \n\n\n\\bibitem{Kovtun:2007py} \n  P.~Kovtun, M.~Unsal and L.~G.~Yaffe,\n``Volume independence in large N(c) QCD-like gauge theories,''\n  JHEP {\\bf 0706}, 019 \n  [hep-th/0702021 [HEP-TH]].\n  \n  \n \n \n \n \n\n\n\n\\bibitem{Kachru:1998ys} \n  S.~Kachru and E.~Silverstein,\n``4-D conformal theories and strings on orbifolds,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 80}, 4855 (1998)\n  \n  [hep-th/9802183].\n  \n  \n  \n  \n\\bibitem{Bershadsky:1998cb} \n  M.~Bershadsky and A.~Johansen,\n``Large N limit of orbifold field theories,''\n  Nucl.\\ Phys.\\ B {\\bf 536}, 141 (1998)\n  \n  [hep-th/9803249].\n  \n  \n\n\n \n \n \n\\bibitem{Armoni:2003gp} \n  A.~Armoni, M.~Shifman and G.~Veneziano,\n``Exact results in nonsupersymmetric large N orientifold field theories,''\n  Nucl.\\ Phys.\\ B {\\bf 667}, 170 (2003)\n\n  [hep-th/0302163].\n  \n  \n  \n  \n\n  \n\n\\bibitem{Armoni:2003fb} \n  A.~Armoni, M.~Shifman and G.~Veneziano,\n``SUSY relics in one flavor QCD from a new 1/N expansion,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 91}, 191601 (2003)\n\n  [hep-th/0307097].\n  \n  \n\n\n\\bibitem{Armoni:2004ub} \n  A.~Armoni, M.~Shifman and G.~Veneziano,\n``Refining the proof of planar equivalence,''\n  Phys.\\ Rev.\\ D {\\bf 71}, 045015 (2005)\n\n  [hep-th/0412203].\n  \n  \n  \n    \n\n\n\n\n\n\\bibitem{Kovtun:2003hr} \n  P.~Kovtun, M.~Unsal and L.~G.~Yaffe,\n``Nonperturbative equivalences among large N(c) gauge theories with adjoint and bifundamental matter fields,''\n  JHEP {\\bf 0312}, 034 (2003)\n\n  [hep-th/0311098].\n  \n  \n  \n\n\\bibitem{Kovtun:2004bz} \n  P.~Kovtun, M.~Unsal and L.~G.~Yaffe,\n``Necessary and sufficient conditions for non-perturbative equivalences of large N(c) orbifold gauge theories,''\n  JHEP {\\bf 0507}, 008 (2005)\n\n  [hep-th/0411177].\n  \n  \n  \n  \n\n\\bibitem{Unsal:2006pj}\n  M.~\\\"Unsal, L.~G.~Yaffe,\n``(In)validity of large N orientifold equivalence,''\n  Phys.\\ Rev.\\  {\\bf D74}, 105019 (2006).\n  [arXiv:hep-th/0608180].\n\n\n  \n  \n\n\\bibitem{Kovtun:2005kh} \n  P.~Kovtun, M.~Unsal and L.~G.~Yaffe,\n``Can large N(c) equivalence between supersymmetric Yang-Mills theory and its orbifold projections be valid?,''\n  Phys.\\ Rev.\\ D {\\bf 72}, 105006 (2005)\n  \n  [hep-th/0505075].\n  \n  \n  \n  \n\n\n\\bibitem{DeGrand:2006qb} \n  T.~DeGrand and R.~Hoffmann,\n``QCD with one compact spatial dimension,''\n  JHEP {\\bf 0702}, 022 (2007)\n  \n  [hep-lat/0612012].\n  \n  \n\n  \\bibitem{Davies:2000nw}\n  N.~M.~Davies, T.~J.~Hollowood, V.~V.~Khoze,\n``Monopoles, affine algebras and the gluino condensate,''\n  J.\\ Math.\\ Phys.\\  {\\bf 44}, 3640-3656 (2003).\n  [arXiv:hep-th/0006011].\n\n\n\n\n\\bibitem{Unsal:2007fb} \n  M.~Unsal,\n``Phases of N = infinity QCD-like gauge theories on S**3 x S**1 and nonperturbative orbifold-orientifold equivalences,''\n  Phys.\\ Rev.\\ D {\\bf 76}, 025015 (2007)\n  \n  [hep-th/0703025 [HEP-TH]].\n  \n  \n\n\n\n\\bibitem{Armoni:2007kd} \n  A.~Armoni, M.~Shifman and M.~Unsal,\n``Planar Limit of Orientifold Field Theories and Emergent Center Symmetry,''\n  Phys.\\ Rev.\\ D {\\bf 77}, 045012 (2008)\n \n  [arXiv:0712.0672 [hep-th]].\n  \n  \n  \n  \n  \n\n\\bibitem{Witten:1982df}\n  E.~Witten,\n``Constraints on Supersymmetry Breaking,''\n  Nucl.\\ Phys.\\  B {\\bf 202}, 253 (1982).\n\n\n\n\\bibitem{Shifman:1978bx} \n  M.~A.~Shifman, A.~I.~Vainshtein and V.~I.~Zakharov,\n``QCD and Resonance Physics. Theoretical Foundations,''\n  Nucl.\\ Phys.\\ B {\\bf 147}, 385 (1979).\n  \n  \n  \n  \n\n\\bibitem{Callan:1977gz} \n  C.~G.~Callan, Jr., R.~F.~Dashen and D.~J.~Gross,\n``Toward a Theory of the Strong Interactions,''\n  Phys.\\ Rev.\\ D {\\bf 17}, 2717 (1978).\n  \n  \n  \n  \n  \n\\bibitem{Schafer:1996wv} \n  T.~Schaefer and E.~V.~Shuryak,\n``Instantons in QCD,''\n  Rev.\\ Mod.\\ Phys.\\  {\\bf 70}, 323 (1998)\n  \n  [hep-ph/9610451].\n  \n  \n\n\n\n\n\n\\bibitem{Hanada:2011ju} \n  M.~Hanada and N.~Yamamoto,\n``Universality of Phases in QCD and QCD-like Theories,''\n  JHEP {\\bf 1202}, 138 (2012)\n  \n  [arXiv:1103.5480 [hep-ph]].\n  \n  \n\n\n\n\\bibitem{Cherman:2010jj} \n  A.~Cherman, M.~Hanada and D.~Robles-Llana,\n``Orbifold equivalence and the sign problem at finite baryon density,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 106}, 091603 (2011)\n  \n  [arXiv:1009.1623 [hep-th]].\n  \n  \n  \n  \n  \n  \n  \n\\bibitem{Cherman:2011mh} \n  A.~Cherman and B.~C.~Tiburzi,\n``Orbifold equivalence for finite density QCD and effective field theory,''\n  JHEP {\\bf 1106}, 034 (2011)\n  \n  [arXiv:1103.1639 [hep-th]].\n  \n  \n  \n``\n  \n  \n  \n  \n\n\n\n\n\n\n\n\n\n\n\n  \n\\bibitem{Yaffe:1981vf} \n  L.~G.~Yaffe,\n``Large n Limits as Classical Mechanics,''\n  Rev.\\ Mod.\\ Phys.\\  {\\bf 54}, 407 (1982).\n\n  \n  \n\n\n\\bibitem{Gross:1982at} \n  D.~J.~Gross and Y.~Kitazawa,\n``A Quenched Momentum Prescription for Large N Theories,''\n  Nucl.\\ Phys.\\ B {\\bf 206}, 440 (1982).\n  \n  \n  \n\n\n\\bibitem{Parisi:1982gp} \n  G.~Parisi,\n``A Simple Expression for Planar Field Theories,''\n  Phys.\\ Lett.\\ B {\\bf 112}, 463 (1982).\n  \n  \n  \n\n\n\n\\bibitem{Das:1982ux} \n  S.~R.~Das and S.~R.~Wadia,\n``Translation Invariance and a Reduced Model for Summing Planar Diagrams in {QCD},''\n  Phys.\\ Lett.\\ B {\\bf 117}, 228 (1982)\n  [Phys.\\ Lett.\\ B {\\bf 121}, 456 (1983)].\n  \n  \n  \n  \n\n\n\n\\bibitem{Bhanot:1982sh} \n  G.~Bhanot, U.~M.~Heller and H.~Neuberger,\n``The Quenched Eguchi-Kawai Model,''\n  Phys.\\ Lett.\\ B {\\bf 113}, 47 (1982).\n  \n  \n  \n\n\n\n\\bibitem{GonzalezArroyo:1982ub} \n  A.~Gonzalez-Arroyo and M.~Okawa,\n``A Twisted Model for Large $N$ Lattice Gauge Theory,''\n  Phys.\\ Lett.\\ B {\\bf 120}, 174 (1983).\n  \n  \n  \n\n\n\n\n\n\n\n\n\n  \n\\bibitem{Bringoltz:2008av} \n  B.~Bringoltz and S.~R.~Sharpe,\n``Breakdown of large-$N$ quenched reduction in SU(N) lattice gauge theories,''\n  Phys.\\ Rev.\\ D {\\bf 78}, 034507 (2008)\n  \n  [arXiv:0805.2146 [hep-lat]].\n  \n  \n\n\n\n\n\\bibitem{Azeyanagi:2007su} \n  T.~Azeyanagi, M.~Hanada, T.~Hirata and T.~Ishikawa,\n``Phase structure of twisted Eguchi-Kawai model,''\n  JHEP {\\bf 0801}, 025 (2008)\n  \n  [arXiv:0711.1925 [hep-lat]].\n  \n  \n\n\n\\bibitem{Teper:2006sp} \n  M.~Teper and H.~Vairinhos,\n``Symmetry breaking in twisted Eguchi-Kawai models,''\n  Phys.\\ Lett.\\ B {\\bf 652}, 359 (2007)\n  \n  [hep-th/0612097].\n  \n  \n  \n\n\n\n\\bibitem{GonzalezArroyo:2010ss} \n  A.~Gonzalez-Arroyo and M.~Okawa,\n``Large $N$ reduction with the Twisted Eguchi-Kawai model,''\n  JHEP {\\bf 1007}, 043 (2010)\n  \n  [arXiv:1005.1981 [hep-th]].\n  \n  \n\n\n\n\n\n\n\\bibitem{Lucini:2012gg} \n  B.~Lucini and M.~Panero,\n``SU(N) gauge theories at large N,''\n  Phys.\\ Rept.\\  {\\bf 526}, 93 (2013)\n  \n  [arXiv:1210.4997 [hep-th]].\n  \n  \n\n\n\n  \n  \n\\bibitem{Unsal:2008ch}\n  M.~\\\" Unsal, L.~G.~Yaffe,\n ``Center-stabilized Yang-Mills theory: Confinement and large N volume independence,''\n  Phys.\\ Rev.\\  {\\bf D78}, 065035 (2008).\n  [arXiv:0803.0344 [hep-th]].\n\n\n\n\n\\bibitem{Ambjorn:2000cs} \n  J.~Ambjorn, Y.~M.~Makeenko, J.~Nishimura and R.~J.~Szabo,\n``Lattice gauge fields and discrete noncommutative Yang-Mills theory,''\n  JHEP {\\bf 0005}, 023 (2000)\n\n  [hep-th/0004147].\n  \n  \n\n\n\\bibitem{Gross:1980br}\n  D.~J.~Gross, R.~D.~Pisarski, L.~G.~Yaffe,\n``QCD and Instantons at Finite Temperature,''\n  Rev.\\ Mod.\\ Phys.\\  {\\bf 53}, 43 (1981).\n\n\n\n\\bibitem{Kiskis:2003rd} \n  J.~Kiskis, R.~Narayanan and H.~Neuberger,\n``Does the crossover from perturbative to nonperturbative physics in QCD become a phase transition at infinite N?,''\n  Phys.\\ Lett.\\ B {\\bf 574}, 65 (2003)\n  \n  [hep-lat/0308033].\n  \n  \n  \n  \n \n\\bibitem{Cossu:2009sq} \n  G.~Cossu and M.~D'Elia,\n``Finite size phase transitions in QCD with adjoint fermions,''\n  JHEP {\\bf 0907}, 048 (2009)\n \n  [arXiv:0904.1353 [hep-lat]].\n  \n  \n  \n  \n\\bibitem{Bringoltz:2009kb} \n  B.~Bringoltz and S.~R.~Sharpe,\n``Non-perturbative volume-reduction of large-$N$ QCD with adjoint fermions,''\n  Phys.\\ Rev.\\ D {\\bf 80}, 065031 (2009)\n  \n  [arXiv:0906.3538 [hep-lat]].\n  \n  \n\n\n\n\n     \n\\bibitem{Azeyanagi:2010ne} \n  T.~Azeyanagi, M.~Hanada, M.~Unsal and R.~Yacoby,\n``large-$N$ reduction in QCD-like theories with massive adjoint fermions,''\n  Phys.\\ Rev.\\ D {\\bf 82}, 125013 (2010)\n  \n  [arXiv:1006.0717 [hep-th]].\n  \n  \n\n  \n\n\n\n\n\\bibitem{Hietanen:2009ex}\n  A.~Hietanen and R.~Narayanan,\n``The large N limit of four dimensional Yang-Mills field coupled to  adjoint fermions on a single site lattice,''\n  JHEP {\\bf 1001}, 079 (2010)\n  [arXiv:0911.2449 [hep-lat]].\n  \n   \\bibitem{Hosotani:1988bm}\n  Y.~Hosotani,\n``Dynamics of Nonintegrable Phases and Gauge Symmetry  Breaking,''\n  Annals Phys.\\ {\\bf 190}, 233 (1989).\n\n\n  \n  \n  \n  \n  \n  \n  \n\\bibitem{Unsal:2010qh} \n  M.~\\\"Unsal and L.~G.~Yaffe,\n``Large-$N$ volume independence in conformal and confining gauge theories,''\n  JHEP {\\bf 1008}, 030 (2010)\n  [arXiv:1006.2101 [hep-th]].\n  \n\n\n\\bibitem{Unsal:2007vu}\n  M.~\\\"Unsal,\n``Abelian duality, confinement, and chiral symmetry breaking in  QCD(adj),''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 100}, 032005 (2008)\n  [arXiv:0708.1772 [hep-th]].\n\n\\bibitem{Unsal:2007jx}\n  M.~\\\"Unsal,\n``Magnetic bion condensation: A new mechanism of confinement  and mass gap in four dimensions,''\n  Phys.\\ Rev.\\  D {\\bf 80}, 065001 (2009)\n  [arXiv:0709.3269 [hep-th]].\n  \n  \n  \n\n  \n   \n\\bibitem{Basar:2013sza} \n  G.~Basar, A.~Cherman, D.~Dorigoni and M.~\\\"Unsal,\n``Volume Independence in the Large $N$ Limit and an Emergent Fermionic Symmetry,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 111}, no. 12, 121601 (2013)\n  \n  [arXiv:1306.2960 [hep-th]].\n  \n  \n\n  \n\n  \n  \n  \n\\bibitem{Basar:2014jua} \n  G.~Basar, A.~Cherman and D.~A.~McGady,\n``Bose-Fermi Degeneracies in Large $N$ Adjoint QCD,''\n  JHEP {\\bf 1507}, 016 (2015)\n  \n  [arXiv:1409.1617 [hep-th]].\n  \n  \n  \n  \n \n \n\\bibitem{Hagedorn:1965st} \n  R.~Hagedorn,\n``Statistical thermodynamics of strong interactions at high-energies,''\n  Nuovo Cim.\\ Suppl.\\  {\\bf 3}, 147 (1965).\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n  \n\\bibitem{Shifman:2008ja} \n  M.~Shifman and M.~\\\"Unsal,\n``QCD-like Theories on R(3) x S(1): A Smooth Journey from Small to Large r(S(1)) with Double-Trace Deformations,''\n  Phys.\\ Rev.\\ D {\\bf 78}, 065004 (2008)\n  [arXiv:0802.1232 [hep-th]].\n  \n  \n  \n  \n  \n\\bibitem{Ogilvie:2007tj} \n  M.~C.~Ogilvie, P.~N.~Meisinger and J.~C.~Myers,\n``Exploring Partially Confined Phases,''\n  PoS LAT {\\bf 2007}, 213 (2007)\n  [arXiv:0710.0649 [hep-lat]].\n  \n\n\n  \n\n\\bibitem{Myers:2007vc} \n  J.~C.~Myers and M.~C.~Ogilvie,\n``New phases of SU(3) and SU(4) at finite temperature,''\n  Phys.\\ Rev.\\ D {\\bf 77}, 125030 (2008)\n \n  [arXiv:0707.1869 [hep-lat]].\n  \n  \n\n\n\\bibitem{Myers:2009df} \n  J.~C.~Myers and M.~C.~Ogilvie,\n``Phase diagrams of SU(N) gauge theories with fermions in various representations,''\n  JHEP {\\bf 0907}, 095 (2009)\n  \n  [arXiv:0903.4638 [hep-th]].\n  \n  \n  \n  \n\\bibitem{Ogilvie:2012is} \n  M.~C.~Ogilvie,\n``Phases of Gauge Theories,''\n  J.\\ Phys.\\ A {\\bf 45}, 483001 (2012)\n\n  [arXiv:1211.2843 [hep-th]].\n  \n  \n\n\n\n   \n\\bibitem{Polyakov:1976fu}\n  A.~M.~Polyakov,\n``Quark confinement and topology of gauge groups,''\n  Nucl.\\ Phys.\\  B {\\bf 120}, 429 (1977).\n  \n\n\\bibitem{Deligne:1999qp}\n  E. Witten, ``Dynamics of quantum field theory,\" \n  in P.~Deligne et.\\ al.\\ (eds.) \n  {\\sl Quantum fields and strings: A course for mathematicians. Vol. \n  1, 2,} \n  Providence, USA: AMS (1999) 1-1501.\n\n\n\n\n  \n\n   \n   \\bibitem{Lee:1997vp} \n  K.~-M.~Lee and P.~Yi,\n``Monopoles and instantons on partially compactified D-branes,''\n  Phys.\\ Rev.\\ D {\\bf 56}, 3711 (1997)\n  [arXiv:hep-th/9702107].\n\n\\bibitem{Kraan:1998sn} \n  T.~C.~Kraan and P.~van Baal,\n``Monopole constituents inside SU(n) calorons,''\n  Phys.\\ Lett.\\ B {\\bf 435}, 389 (1998)\n  [arXiv:hep-th/9806034].\n  \n\n  \n   \n\n\n\\bibitem{Unsal:2012zj} \n  M.~Unsal,\n``Theta dependence, sign problems and topological interference,''\n  Phys.\\ Rev.\\ D {\\bf 86}, 105012 (2012)\n  \n  [arXiv:1201.6426 [hep-th]].\n  \n  \n\n  \n\n\n\n\n\n\n   \n\n    \n    \n    \n\n\\bibitem{Anber:2015kea} \n  M.~M.~Anber, E.~Poppitz and T.~Sulejmanpasic,\n``Strings from domain walls in supersymmetric Yang-Mills theory and adjoint QCD,''\n  Phys.\\ Rev.\\ D {\\bf 92}, no. 2, 021701 (2015)\n  \n  [arXiv:1501.06773 [hep-th]].\n  \n  \n\n    \n\n\\bibitem{Witten:1997ep} \n  E.~Witten,\n``Branes and the dynamics of QCD,''\n  Nucl.\\ Phys.\\ B {\\bf 507}, 658 (1997)\n  \n  [hep-th/9706109].\n  \n  \n\n    \n    \n    \n\\bibitem{Thomas:2011ee} \n  E.~Thomas and A.~R.~Zhitnitsky,\n``Topological Susceptibility and Contact Term in QCD. A Toy Model,''\n  Phys.\\ Rev.\\ D {\\bf 85}, 044039 (2012)\n  \n  [arXiv:1109.2608 [hep-th]].\n  \n  \n    \n    \n    \n\\bibitem{Thomas:2012ib} \n  E.~Thomas and A.~R.~Zhitnitsky,\n``Casimir scaling in gauge theories with a gap. Deformed QCD as a toy model,''\n  Phys.\\ Rev.\\ D {\\bf 86}, 065029 (2012)\n  \n  [arXiv:1203.6073 [hep-ph]].\n  \n  \n    \n    \n    \n    \n\\bibitem{Thomas:2012tu} \n  E.~Thomas and A.~R.~Zhitnitsky,\n``Long range order in gauge theories. Deformed QCD as a toy model,''\n  Phys.\\ Rev.\\ D {\\bf 87}, no. 8, 085027 (2013)\n\n  [arXiv:1208.2030 [hep-ph]].\n  \n  \n\n  \n  \n\\bibitem{Zhitnitsky:2013hs} \n  A.~R.~Zhitnitsky,\n``QCD as a topologically ordered system,''\n  Annals Phys.\\  {\\bf 336}, 462 (2013)\n \n  [arXiv:1301.7072 [hep-ph]].\n  \n  \n  \n  \n  \n\\bibitem{Li:2014lza} \n  X.~Li and M.~B.~Voloshin,\n``Metastable vacuum decay in center-stabilized Yang-Mills theory at large N,''\n  Phys.\\ Rev.\\ D {\\bf 90}, no. 10, 105028 (2014)\n \n  [arXiv:1408.3054 [hep-th]].\n  \n  \n\n\n\n\n\\bibitem{Anber:2013xfa}\n  M.~M.~Anber,\n``The abelian confinement mechanism revisited: new aspects of the Georgi-Glashow model,''\n  Annals Phys.\\  {\\bf 341} (2014) 21\n\n  [arXiv:1308.0027 [hep-th]].\n  \n  \n\n\n\n\n \n \n\\bibitem{Anber:2015wha}\n  M.~M.~Anber and E.~Poppitz,\n``On the global structure of deformed Yang-Mills theory and QCD(adj) on $ {\\mathrm{\\mathbb{R}}}^3\\times {\\mathbb{S}}^1 $,''\n  JHEP {\\bf 1510} (2015) 051\n\n  [arXiv:1508.00910 [hep-th]].\n  \n  \n\n\n\\bibitem{Anber:2015bba}\n  M.~M.~Anber and M.~Shifman,\n``Impact of Axions on Confinement in Three and Two Dimensions,''\n  Phys.\\ Rev.\\ D {\\bf 92} (2015) 6,  065020\n \n  [arXiv:1508.00716 [hep-th]].\n  \n\n\n\n\n\n  \n\\bibitem{Vairinhos:2010ha} \n  H.~Vairinhos,\n``Monte Carlo Algorithms For Reduced Lattices, Mixed Actions, And Double-Trace Deformations,''\n  arXiv:1010.1253 [hep-lat].\n  \n  \n\n\n\n\n\\bibitem{Vairinhos:2011gv} \n  H.~Vairinhos,\n``Phase transitions in center-stabilized lattice gauge theories,''\n  PoS LATTICE {\\bf 2011}, 252 (2011)\n  [arXiv:1111.0303 [hep-lat]].\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n   \n    \\bibitem{Nye:2000eg}\n  T.~M.~W.~Nye and M.~A.~Singer,\n  ``An $L^2$-Index Theorem for Dirac Operators on $S^1\\times   R^3$,''\n  [arXiv:math/0009144].\n   \n\\bibitem{Poppitz:2008hr} \n  E.~Poppitz and M.~\\\" Unsal,\n``Index theorem for topological excitations on $R^3 \\times S^1$     and Chern-Simons theory,''\n  JHEP {\\bf 0903}, 027 (2009)\n  \n\n\n\n\\bibitem{Poppitz:2009uq} \n  E.~Poppitz and M.~Unsal,\n  ``Conformality or confinement: (IR)relevance of topological excitations,''\n  JHEP {\\bf 0909}, 050 (2009)\n\n  [arXiv:0906.5156 [hep-th]].\n  \n  \n\n\n\\bibitem{Poppitz:2009tw} \n  E.~Poppitz and M.~Unsal,\n  ``Conformality or confinement (II): One-flavor CFTs and mixed-representation QCD,''\n  JHEP {\\bf 0912}, 011 (2009)\n\n  [arXiv:0910.1245 [hep-th]].\n  \n  \n\n\n\\bibitem{Bruckmann:2003ag}\n  F.~Bruckmann, D.~Nogradi and P.~van Baal,\n``Constituent monopoles through the eyes of fermion zero modes,''\n  Nucl.\\ Phys.\\  B {\\bf 666}, 197 (2003)\n  [arXiv:hep-th/0305063].\n  \n  \n\n\\bibitem{Misumi:2014raa} \n  T.~Misumi and T.~Kanazawa,\n``Adjoint QCD on $\\mathbb{R}^3\\times S^1$ with twisted fermionic boundary conditions,''\n  JHEP {\\bf 1406}, 181 (2014)\n  \n  [arXiv:1405.3113 [hep-ph]].\n  \n  \n  \n  \n  \n\\bibitem{GarciaPerez:2009mg}\n  M.~Garcia Perez, A.~Gonzalez-Arroyo and A.~Sastre,\n``Adjoint fermion zero-modes for SU(N) calorons,''\n  JHEP {\\bf 0906}, 065 (2009)\n  [arXiv:0905.0645 [hep-th]].\n\n\\bibitem{Affleck:1982as}\n  I.~Affleck, J.~A.~Harvey, E.~Witten,\n``Instantons and (Super)Symmetry Breaking in (2+1)- Dimensions,''\n  Nucl.\\ Phys.\\  {\\bf B206}, 413 (1982).\n\n\n\\bibitem{Anber:2011de}\n  M.~M.~Anber and E.~Poppitz,\n``Microscopic Structure of Magnetic Bions,''\n  JHEP {\\bf 1106} (2011) 136\n\n  [arXiv:1105.0940 [hep-th]].\n  \n  \n\n\n  \n\n\n\n\n\n\\bibitem{Poppitz:2011wy}\n  E.~Poppitz and M.~\\\"Unsal,\n``Seiberg-Witten and 'Polyakov-like' magnetic bion confinements  are continuously connected,''\n  JHEP {\\bf 1107}, 082 (2011)\n  [arXiv:1105.3969 [hep-th]].\n\n \n \n\\bibitem{Argyres:2012ka} \n  P.~C.~Argyres and M.~Unsal,\n``The semi-classical expansion and resurgence in gauge theories: new perturbative, instanton, bion, and renormalon effects,''\n  JHEP {\\bf 1208}, 063 (2012)\n\n  [arXiv:1206.1890 [hep-th]].\n  \n  \n\n\n\n\\bibitem{Argyres:2012vv} \n  P.~Argyres and M.~Unsal,\n``A semiclassical realization of infrared renormalons,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 109}, 121601 (2012)\n  \n  [arXiv:1204.1661 [hep-th]].\n  \n  \n\n\n\n\n\n\\bibitem{Seiberg:1994rs} \n  N.~Seiberg and E.~Witten,\n``Electric - magnetic duality, monopole condensation, and confinement in N=2 supersymmetric Yang-Mills theory,''\n  Nucl.\\ Phys.\\ B {\\bf 426}, 19 (1994)\n  [Nucl.\\ Phys.\\ B {\\bf 430}, 485 (1994)]\n \n  [hep-th/9407087].\n  \n  \n\n\n    \n  \n\\bibitem{Nishimura:2009me} \n  H.~Nishimura and M.~C.~Ogilvie,\n``A PNJL Model for Adjoint Fermions with Periodic Boundary Conditions,''\n  Phys.\\ Rev.\\ D {\\bf 81}, 014018 (2010)\n\n  [arXiv:0911.2696 [hep-lat]].\n  \n  \n\n\n\n\\bibitem{Shuryak:2012aa} \n  E.~Shuryak and T.~Sulejmanpasic,\n``The Chiral Symmetry Breaking/Restoration in Dyonic Vacuum,''\n  Phys.\\ Rev.\\ D {\\bf 86}, 036001 (2012)\n \n  [arXiv:1201.5624 [hep-ph]].\n  \n  \n\n\n\n\\bibitem{Liao:2012tw} \n  J.~Liao and E.~Shuryak,\n``Effect of Light Fermions on the Confinement Transition in QCD-like Theories,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 109}, 152001 (2012)\n \n  [arXiv:1206.3989 [hep-ph]].\n  \n  \n\n\n\n\n\\bibitem{Larsen:2015tso} \n  R.~Larsen and E.~Shuryak,\n``Instanton-dyon Ensemble with two Dynamical Quarks: the Chiral Symmetry Breaking,''\n  arXiv:1511.02237 [hep-ph].\n  \n\n\n\n  \n\n  \n\\bibitem{Misumi:2014bsa} \n  T.~Misumi, M.~Nitta and N.~Sakai,\n``Classifying bions in Grassmann sigma models and non-Abelian gauge theories by D-branes,''\n  PTEP {\\bf 2015}, 033B02 (2015)\n  \n  [arXiv:1409.3444 [hep-th]].\n  \n  \n\n\n  \n  \n\\bibitem{Misumi:2014jua} \n  T.~Misumi, M.~Nitta and N.~Sakai,\n``Neutral bions in the ${\\mathbb C}P^{N-1}$ model,''\n  JHEP {\\bf 1406}, 164 (2014)\n  \n  [arXiv:1404.7225 [hep-th]].\n  \n  \n  \n  \n  \n\\bibitem{Nitta:2015tua} \n  M.~Nitta,\n``Fractional instantons and bions in the principal chiral model on $ {\\mathrm{\\mathbb{R}}}^2\\times {S}^1 $ with twisted boundary conditions,''\n  JHEP {\\bf 1508}, 063 (2015)\n  \n  [arXiv:1503.06336 [hep-th]].\n  \n  \n  \n  \n  \n\\bibitem{Nitta:2014vpa} \n  M.~Nitta,\n``Fractional instantons and bions in the O $(N)$ model with twisted boundary conditions,''\n  JHEP {\\bf 1503}, 108 (2015)\n  \n  [arXiv:1412.7681 [hep-th]].\n  \n  \n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem{Behtash:2015zha} \n  A.~Behtash, G.~V.~Dunne, T.~Schaefer, T.~Sulejmanpasic and M.~Unsal,\n  ``Complexified path integrals, exact saddles and supersymmetry,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 116}, no. 1, 011601 (2016)\n\n  [arXiv:1510.00978 [hep-th]].\n  \n  \n\n\n\n\\bibitem{Behtash:2015loa} \n  A.~Behtash, G.~V.~Dunne, T.~Schaefer, T.~Sulejmanpasic and M.~Unsal,\n``Toward Picard-Lefschetz Theory of Path Integrals, Complex Saddles and Resurgence,''\n  arXiv:1510.03435 [hep-th].\n  \n  \n\n\n\n  \n\n\n\n  \n\n\\bibitem{Coleman}\n  S.~Coleman,\n``Aspects of Symmetry,''\n{\\it  Cambridge University Press, (1985) }\n\n\n\n\n \\bibitem{AGZV2}\nV.~L. Arnold, A.~N. Varchenko, and S.~M. Gusein-Zade, {\\em\n  Singularities of differentiable maps. Volume 2}\n  ``Nauka'', Moscow, 1984 (Russian), English transl., Birkh\\\"auser, Basel, 1988.\n\n\\bibitem{Pham}\nF.~Pham, \n\n  {\\em Proc. Symp. Pure Math} {\\bf 2} (1983), no.~40 319--333.\n\n\\bibitem{Witten:2010cx}\nE.~Witten, \n\n {\\em AMS/IP  Stud. Adv. Math.} {\\bf 50} (2011) 347--446,\n[ arXiv:1001.2933[hep-th]]\n\n\n\n\n\\bibitem{Behtash:2015kva} \n  A.~Behtash, E.~Poppitz, T.~Sulejmanpasic and M.~\\\"Unsal,\n``The curious incident of multi-instantons and the necessity of Lefschetz thimbles,''\n  JHEP {\\bf 1511}, 175 (2015)\n \n  [arXiv:1507.04063 [hep-th]].\n  \n  \n\n\n\\bibitem{Behtash:2015kna} \n  A.~Behtash, T.~Sulejmanpasic, T.~Schaefer and M.~\\\"Unsal,\n``Hidden topological angles and Lefschetz thimbles,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 4, 041601 (2015)\n  \n  [arXiv:1502.06624 [hep-th]].\n  \n  \n\n\n\n\n  \\bibitem{Cristoforetti:2012su}\nM.~Cristoforetti, F.~Di~Renzo,  and L.~Scorzato, \n`` New approach to the sign problem in quantum field  theories: High density QCD on a Lefschetz thimble''\n ,  {\\em Phys.Rev.} {\\bf  D86} (2012) 074506,\n[arXiv:1205.3996]\n\n\\bibitem{Cristoforetti:2013wha}\nM.~Cristoforetti, F.~Di~Renzo, A.~Mukherjee, and L.~Scorzato,  \n`` Monte Carlo  simulations on the Lefschetz thimble: Taming the sign problem'',  \n{\\em  Phys.Rev.} {\\bf D88} (2013), no.~5 051501,\n[arXiv:1303.7204]\n\n\\bibitem{Fujii:2013sra}\nH.~Fujii, D.~Honda, M.~Kato, Y.~Kikukawa, S.~Komatsu, et~al.,\n `` Hybrid  Monte Carlo on Lefschetz thimbles - A study of the residual sign problem'',\n  {\\em JHEP} {\\bf 1310} (2013) 147, \n[arXiv:1309.4371].\n\n\\bibitem{Aarts:2014nxa}\nG.~Aarts, L.~Bongiovanni, E.~Seiler, and D.~Sexty, \n`` Some remarks on  Lefschetz thimbles and complex Langevin dynamics'', \n   {\\em JHEP} {\\bf 1410} (2014) 159,\n[arXiv:1407.2090]\n  \n\n\n\\bibitem{Kanazawa:2014qma}\nT.~Kanazawa and Y.~Tanizaki, \n `` Structure of Lefschetz thimbles in simple  fermionic systems'', \n  {\\em JHEP} {\\bf 03} (2015) 044,\n  [arXiv:1412.2802].\n\n\n\n  \n  \\bibitem{Tanizaki:2015rda}\nY.~Tanizaki, Y.~Hidaka, and T.~Hayata, \n ``Lefschetz-thimble analysis of the  sign problem in one-site fermion model\",\n[arXiv:1509.07146].\n\n\\bibitem{Fujii:2015bua}\nH.~Fujii, S.~Kamata, and Y.~Kikukawa, \n  `` Lefschetz thimble structure in   one-dimensional lattice Thirring model at finite density'',\n[arXiv:1509.08176].\n\n\n  \\bibitem{Alexandru:2015xva} \n  A.~Alexandru, G.~Basar and P.~Bedaque,\n    ``  A Monte Carlo algorithm for simulating fermions on Lefschetz thimbles,''\n \n  arXiv:1510.03258 [hep-lat].\n  \n  \n\\bibitem{Hayata:2015lzj} \n  T.~Hayata, Y.~Hidaka and Y.~Tanizaki,\n     ``Complex saddle points and the sign problem in complex Langevin simulation,''\n \n  arXiv:1511.02437 [hep-lat].\n  \n\n\n \\bibitem{Tanizaki:2014xba}\nY.~Tanizaki and T.~Koike, \n  ``  Real-time Feynman path integral with  Picard--Lefschetz theory and its applications to quantum tunneling, ''\n {\\em  Annals Phys.} {\\bf 351} (2014) 250--274,\n[arXiv:1406.2386].\n\n\\bibitem{Cherman:2014sba}\nA.~Cherman and M.~{\\\"U}nsal, \n ```` Real-Time Feynman Path Integral Realization  of Instantons,''\n [arXiv:1408.0012]  \n  \n\n\n\n\n\n\\bibitem{Aharony:2003sx} \n  O.~Aharony, J.~Marsano, S.~Minwalla, K.~Papadodimas and M.~Van Raamsdonk,\n``The Hagedorn - deconfinement phase transition in weakly coupled large N gauge theories,''\n  Adv.\\ Theor.\\ Math.\\ Phys.\\  {\\bf 8}, 603 (2004)\n  \n  [hep-th/0310285].\n  \n  \n\n\n\n\n\n\\bibitem{Poppitz:2012sw} \n  E.~Poppitz, T.~Schafer and M.~Unsal,\n``Continuity, Deconfinement, and (Super) Yang-Mills Theory,''\n  JHEP {\\bf 1210}, 115 (2012)\n\n  [arXiv:1205.0290 [hep-th]].\n  \n  \n  \n  \n\\bibitem{Poppitz:2012nz} \n  E.~Poppitz, T.~Schafer and M.~Unsal,\n``Universal mechanism of (semi-classical) deconfinement and theta-dependence for all simple groups,''\n  JHEP {\\bf 1303}, 087 (2013)\n  \n  [arXiv:1212.1238 [hep-th]].\n  \n  \n\n\n\\bibitem{Poppitz:2013zqa} \n  E.~Poppitz and T.~Sulejmanpasic,\n``(S)QCD on $\\mathbb{R}^{3} \\times \\mathbb{S}^{1}$: Screening of Polyakov loop by fundamental quarks and the demise of semi-classics,''\n  JHEP {\\bf 1309}, 128 (2013)\n  \n  [arXiv:1307.1317 [hep-th]].\n  \n  \n\n\n\n\n\n\n\\bibitem{Anber:2014lba}\n  M.~M.~Anber, E.~Poppitz and B.~Teeple,\n``Deconfinement and continuity between thermal and (super) Yang-Mills theory for all gauge groups,''\n  JHEP {\\bf 1409} (2014) 040\n\n  [arXiv:1406.1199 [hep-th]].\n  \n  \n\n\n\\bibitem{Anber:2013doa}\n  M.~M.~Anber, S.~Collier, E.~Poppitz, S.~Strimas-Mackey and B.~Teeple,\n``Deconfinement in $\\mathcal{N}=1$ super Yang-Mills theory on $\\mathbb{R}^3 \\times \\mathbb{S}^1$ via dual-Coulomb gas and \"affine\" XY-model,''\n  JHEP {\\bf 1311} (2013) 142\n\n  [arXiv:1310.3522 [hep-th]].\n  \n  \n\n\n\n\\bibitem{Anber:2012ig}\n  M.~M.~Anber, S.~Collier and E.~Poppitz,\n``The $SU(3)/{\\mathbb Z}_3$ QCD(adj) deconfinement transition via the gauge theory/'affine' XY-model duality,''\n  JHEP {\\bf 1301} (2013) 126\n\n  [arXiv:1211.2824 [hep-th]].\n  \n  \n\n\n\n\\bibitem{Anber:2011gn}\n  M.~M.~Anber, E.~Poppitz and M.~Unsal,\n``2d affine XY-spin model/4d gauge theory duality and deconfinement,''\n  JHEP {\\bf 1204} (2012) 040\n \n  [arXiv:1112.6389 [hep-th]].\n  \n  \n\n\n  \n\n\n\n\\bibitem{Bringoltz:2005xx} \n  B.~Bringoltz and M.~Teper,\n``In search of a Hagedorn transition in SU(N) lattice gauge theories at large-N,''\n  Phys.\\ Rev.\\ D {\\bf 73}, 014517 (2006)\n \n  [hep-lat/0508021].\n  \n  \n\n\n\n\n\n\n\n\n\n\n\\bibitem{Shuryak:2013tka} \n  E.~Shuryak and T.~Sulejmanpasic,\n``Holonomy potential and confinement from a simple model of the gauge topology,''\n  Phys.\\ Lett.\\ B {\\bf 726}, 257 (2013)\n\n  [arXiv:1305.0796 [hep-ph]].\n  \n  \n\n\n\n\\bibitem{Liu:2015ufa} \n  Y.~Liu, E.~Shuryak and I.~Zahed,\n``Confining dyon-antidyon Coulomb liquid model. I.,''\n  Phys.\\ Rev.\\ D {\\bf 92}, no. 8, 085006 (2015)\n  \n  [arXiv:1503.03058 [hep-ph]].\n  \n  \n  \n  \n  \n\\bibitem{Anber:2013sga}\n  M.~M.~Anber,\n``$\\Theta$ dependence of the deconfining phase transition in pure $SU(N_{c})$ Yang-Mills theories,''\n  Phys.\\ Rev.\\ D {\\bf 88} (2013) 8,  085003\n \n  [arXiv:1302.2641 [hep-th]].\n  \n  \n  \n  \n\\bibitem{Liu:2015jsa} \n  Y.~Liu, E.~Shuryak and I.~Zahed,\n``Light quarks in the screened dyon-antidyon Coulomb liquid model. II.,''\n  Phys.\\ Rev.\\ D {\\bf 92}, no. 8, 085007 (2015)\n  \n  [arXiv:1503.09148 [hep-ph]].\n  \n  \n  \n  \n  \n\\bibitem{Larsen:2015vaa} \n  R.~Larsen and E.~Shuryak,\n``Interacting ensemble of the instanton-dyons and the deconfinement phase transition in the SU(2) gauge theory,''\n  Phys.\\ Rev.\\ D {\\bf 92}, no. 9, 094022 (2015)\n \n  [arXiv:1504.03341 [hep-ph]].\n  \n  \n\n\n\\bibitem{Bergner:2014dua} \n  G.~Bergner and S.~Piemonte,\n``Compactified $ \\mathcal{N}=1 $ supersymmetric Yang-Mills theory on the lattice: continuity and the disappearance of the deconfinement transition,''\n  JHEP {\\bf 1412}, 133 (2014)\n \n  [arXiv:1410.3668 [hep-lat]].\n  \n  \n\n\n\n\n\\bibitem{D'Elia:2012vv} \n  M.~D'Elia and F.~Negro,\n``$\\theta$ dependence of the deconfinement temperature in Yang-Mills theories,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 109}, 072001 (2012)\n \n  [arXiv:1205.0538 [hep-lat]].\n  \n  \n\n\n\n\\bibitem{Bonati:2013tt} \n  C.~Bonati, M.~D'Elia, H.~Panagopoulos and E.~Vicari,\n``Change of $\\theta$ Dependence in 4D SU(N) Gauge Theories Across the Deconfinement Transition,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 25, 252003 (2013)\n  \n  [arXiv:1301.7640 [hep-lat]].\n  \n  \n  \n  \n\\bibitem{D'Elia:2013eua} \n  M.~D'Elia and F.~Negro,\n``Phase diagram of Yang-Mills theories in the presence of a $\\theta$ term,''\n  Phys.\\ Rev.\\ D {\\bf 88}, no. 3, 034503 (2013)\n  \n  [arXiv:1306.2919 [hep-lat]].\n  \n  \n  \n  \n\\bibitem{Bonati:2015sqt} \n  C.~Bonati, M.~D'Elia and A.~Scapellato,\n``$\\theta$ dependence in $SU(3)$ Yang-Mills theory from analytic continuation,''\n  arXiv:1512.01544 [hep-lat].\n  \n\n\n\n\n\n\n\n\n\n\n\\bibitem{Dunne:2012ae} \n  G.~V.~Dunne and M.~Unsal,\n``Resurgence and Trans-series in Quantum Field Theory: The CP(N-1) Model,''\n  JHEP {\\bf 1211}, 170 (2012)\n  \n  [arXiv:1210.2423 [hep-th]].\n  \n  \n\n\n\\bibitem{Dunne:2012zk} \n  G.~V.~Dunne and M.~\\\"Unsal,\n``Continuity and Resurgence: towards a continuum definition of the $\\mathbb{CP}$(N-1) model,''\n  Phys.\\ Rev.\\ D {\\bf 87}, 025015 (2013)\n  \n  [arXiv:1210.3646 [hep-th]].\n  \n  \n  \n  \n\\bibitem{'tHooft:1977am} \n  G.~'t Hooft,\n``Can We Make Sense Out of Quantum Chromodynamics?,''\n  Subnucl.\\ Ser.\\  {\\bf 15}, 943 (1979).\n  \n  \n\n\n\n\\bibitem{Beneke:1998ui}\n  M.~Beneke,\n``Renormalons,''\n  Phys.\\ Rept.\\  {\\bf 317}, 1 (1999)\n  [arXiv:hep-ph/9807443].\n\n\n\\bibitem{Ecalle:1981}\nJ. \\'Ecalle,  \n{\\sl Les Fonctions Resurgentes}, v.\\ 1-3, \nPubl.\\ Math.\\ Orsay, 1981.\n\n\\bibitem{bh90}\nM. V.~Berry and C. J.~Howls,\n``Hyperasymptotics,\"\nProc.\\ R.\\ Soc.\\ Lond.\\ \\textbf{A430} (1990) 653;\n\n\\bibitem{bh91}\nM.V.~Berry and C.J.~Howls,\n``Hyperasymptotics for Integrals with Saddles,\"\nProc.\\ R.\\ Soc.\\ Lond.\\ \\textbf{A434} (1991) 657.\n\n\n\n\\bibitem{Costin:2009}\nO. Costin, \n{\\sl Asymptotics and Borel Summability}, 1st ed., \nChapman and  Hall/CRC, 2009.\n\n     \\bibitem{Aniceto:2013fka}\nI.~Aniceto and R.~Schiappa, \n``Nonperturbative Ambiguities and the Reality of Resurgent Transseries'',  \n  Commun.\\ Math.\\ Phys.\\  {\\bf 335}, no. 1, 183 (2015),\n \n [arXiv:1308.1115 [hep-th]].\n  \n  \n \n  \n\n\n\\bibitem{Marino:2008ya} \n  M.~Marino,\n``Nonperturbative effects and nonperturbative definitions in matrix models and topological strings,''\n  JHEP {\\bf 0812}, 114 (2008)\n  [arXiv:0805.3033 [hep-th]].\n  \n  \n  \n\\bibitem{Garoufalidis:2010ya}\n  S.~Garoufalidis, A.~Its, A.~Kapaev and M.~Marino,\n``Asymptotics of the instantons of Painlevé I,''\n  Int.\\ Math.\\ Res.\\ Not.\\  {\\bf 2012}, no. 3, 561 (2012)\n  \n [arXiv:1002.3634 [math.CA]].\n  \n  \n  \n  \n    \\bibitem{Pasquetti:2009jg} \n  S.~Pasquetti and R.~Schiappa,\n``Borel and Stokes Nonperturbative Phenomena in Topological String Theory and c=1 Matrix Models,''\n  Annales Henri Poincare {\\bf 11}, 351 (2010)\n  [arXiv:0907.4082 [hep-th]].\n  \n\n\n\\bibitem{Aniceto:2011nu} \n  I.~Aniceto, R.~Schiappa and M.~Vonk,\n``The Resurgence of Instantons in String Theory,''\n  Commun.\\ Num.\\ Theor.\\ Phys.\\  {\\bf 6}, 339 (2012)\n\n  [arXiv:1106.5922 [hep-th]].\n  \n  \n \n   \n\\bibitem{Aniceto:2014hoa} \n  I.~Aniceto, J.~G.~Russo and R.~Schiappa,\n``Resurgent Analysis of Localizable Observables in Supersymmetric Gauge Theories,''\n  JHEP {\\bf 1503}, 172 (2015),\n \n  [arXiv:1410.5834 [hep-th]].\n  \n  \n  \n\n\n\\bibitem{Dunne:2015eaa} \n  G.~V.~Dunne and M.~Unsal,\n``What is QFT? Resurgent trans-series, Lefschetz thimbles, and new exact saddles,''\n  arXiv:1511.05977 [hep-lat].\n  \n\n\n\\bibitem{Bogomolny:1980ur}\n  E.~B.~Bogomolny,\n``Calculation of instanton--anti-instanton contributions in quantum mechanics,''\n  Phys.\\ Lett.\\  {\\bf B91}, 431-435 (1980).\n  \n\n\\bibitem{ZinnJustin:1981dx}\n  J.~Zinn-Justin,\n``Multi-instanton contributions in quantum mechanics,''\n  Nucl.\\ Phys.\\  {\\bf B192}, 125-140 (1981).\n  \n\\bibitem{Lipatov:1976ny} \n  L.~N.~Lipatov,\n``Divergence of the Perturbation Theory Series and the Quasiclassical Theory,''\n  Sov.\\ Phys.\\ JETP {\\bf 45}, 216 (1977)\n  [Zh.\\ Eksp.\\ Teor.\\ Fiz.\\  {\\bf 72}, 411 (1977)].\n\n\n\\bibitem{Balitsky:1985in}\n  I.~I.~Balitsky, A.~V.~Yung,\n``Instanton molecular vacuum in N=1 supersymmetric quantum mechanics,''\n  Nucl.\\ Phys.\\  {\\bf B274}, 475 (1986).\n\n \n\\bibitem{Dunne:2013ada} \n  G.~V.~Dunne and M.~\\\"Unsal,\n``Generating nonperturbative physics from perturbation theory,''\n  Phys.\\ Rev.\\ D {\\bf 89}, no. 4, 041701 (2014),\n \n  [arXiv:1306.4405 [hep-th].\n  \n  \n\n   \n\\bibitem{Dunne:2014bca} \n  G.~V.~Dunne and M.~\\\"Unsal,\n``Uniform WKB, Multi-instantons, and Resurgent Trans-Series,''\n  Phys.\\ Rev.\\ D {\\bf 89}, no. 10, 105009 (2014),\n  \n  [arXiv:1401.5202 [hep-th]].\n  \n  \n  \n  \n  \n  \n  \n\\bibitem{Anber:2014sda}\n  M.~M.~Anber and T.~Sulejmanpasic,\n``The renormalon diagram in gauge theories on $ {\\mathrm{\\mathbb{R}}}3\\times {\\mathbb{S}}1 $,''\n  JHEP {\\bf 1501} (2015) 139\n\n  [arXiv:1410.0121 [hep-th]].\n  \n  \n\n\n\n\\bibitem{Bruckmann:2007zh} \n  F.~Bruckmann,\n``Instanton constituents in the O(3) model at finite temperature,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 100}, 051602 (2008)\n \n  [arXiv:0707.0775 [hep-th]].\n  \n  \n  \n  \n\\bibitem{Brendel:2009mp} \n  W.~Brendel, F.~Bruckmann, L.~Janssen, A.~Wipf and C.~Wozar,\n``Instanton constituents and fermionic zero modes in twisted CP**n models,''\n  Phys.\\ Lett.\\ B {\\bf 676}, 116 (2009)\n  \n [arXiv:0902.2328 [hep-th]].\n  \n  \n  \n  \n  \\bibitem{Cherman:2013yfa}\nA.~Cherman, D.~Dorigoni, G.~V. Dunne, and M.~{\\\"U}nsal, \n\n{\\em Phys.Rev.Lett.} {\\bf 112} (2014), no.~2 021601,\n[arXiv:1308.0127];\n\n   \n  \n  \n  \n  \n\\bibitem{Cherman:2014ofa} \n  A.~Cherman, D.~Dorigoni and M.~Unsal,\n``Decoding perturbation theory using resurgence: Stokes phenomena, new saddle points and Lefschetz thimbles,''\n  JHEP {\\bf 1510}, 056 (2015)\n \n  [arXiv:1403.1277 [hep-th]].\n  \n  \n  \n \n\n\n\\bibitem{Dunne:2015ywa} \n  G.~V.~Dunne and M.~Unsal,\n``Resurgence and Dynamics of O(N) and Grassmannian Sigma Models,''\n  JHEP {\\bf 1509}, 199 (2015)\n  \n  [arXiv:1505.07803 [hep-th]].\n  \n  \n  \n   \n\\bibitem{Witten:1978bc} \n  E.~Witten,\n``Instantons, the Quark Model, and the 1/n Expansion,''\n  Nucl.\\ Phys.\\ B {\\bf 149}, 285 (1979).\n\n  \n  \n\n  \n  \n\\bibitem{Dunne:2015eoa} \n  G.~V.~Dunne, M.~Shifman and M.~\\\"Unsal,\n``Infrared Renormalons versus Operator Product Expansions in Supersymmetric and Related Gauge Theories,''\n  Phys.\\ Rev.\\ Lett.\\  {\\bf 114}, no. 19, 191601 (2015)\n  \n  [arXiv:1502.06680 [hep-th]].\n  \n  \n\n\n\n  \n\\end{thebibliography}\n\n\n\n\n\n", "itemtype": "equation", "pos": 74086, "prevtext": "\nup to terms of higher order.    [This connection between different saddles is also related to an argument of Lipatov \\cite{Lipatov:1976ny}, see also \\cite{Balitsky:1985in}.]\n  The ambiguities at leading order $e^{-t_1/g^2}$ cancel, and the sum of perturbative and non-perturbative sectors is meaningful, \n ambiguity-free and accurate. In principle,  this is just the \"tip-of-the-iceberg\": e.g., it has now been shown in a class of QM models that these resurgent cancellations occur to all orders of the trans-series expansion \\cite{Dunne:2013ada,Dunne:2014bca}. An obvious but deep question is: can this idea  work in QFT, in particular to cure the IR-renormalon problem of asymptotically free QFT? \n\n\\noindent\n{\\bf 't Hooft's IR renormalon puzzle [1977]:} In  the asymptotically free QFTs mentioned above, there are  Borel singularities that are parametrically closer to the origin of the Borel $t$-plane, on $\\mathbb R^{+}$,  than the  $[{\\cal I}{\\overline{\\cal I}}]_\\pm$ singularity \\cite{'tHooft:1977am, Beneke:1998ui}.  \nThe $[{\\cal I}{\\overline{\\cal I}}]_\\pm$  singularity is \nrelated to the factorial combinatorial growth of the number of Feynman diagrams, while  the (more dominant)  IR renormalon singularity is related to divergences coming from phase space integration, at small internal momenta, smaller than  $\\Lambda$.    't Hooft called  these singularities ``IR renormalons\" in the hope that they would be  associated with a semiclassical saddle, such as an  instanton. \nFor example, the $[{\\cal I}{\\overline{\\cal I}}]_\\pm$ singularities are located at  $t=t_n= n (2S_I)$, but the IR-renormalon singularities are located at  $t = \\tilde t_n  \\sim  n (2S_I)/\\beta_0 $, \nwhere $\\beta_0$ is  the leading coefficient of the renormalization group beta function.  Due to this mis-matched factor of $\\beta_0$, it appears that the cancellation mechanism at work in QM cannot possibly work in QFT on ${\\mathbb R}^d$. However, there is another well-known problem in $\\mathbb {CP}^{N-1}$, Yang-Mills etc., coming from the instanton-gas picture itself. There are instantons, but the so called ``dilute instanton gas approximation\"  must be regulated, because the instanton size is a moduli parameter, whose integration leads to another IR divergence.  \n\n{\\bf The Main Idea \\cite{Argyres:2012ka, Argyres:2012vv, Dunne:2012ae, Dunne:2012zk}:} The key step is to combine the concept of  adiabatic continuity \\cite{Unsal:2007vu, Unsal:2007jx} discussed above, with  resurgence theory. \n\nAsymptotically free QFTs can be brought into a calculable semi-classical domain on  ${\\mathbb R}^{d-1} \\times S^1$, and with appropriate boundary conditions or deformation this can be continuously connected to the strongly coupled  domain of interest.\nIn the calculable  semi-classical domain, all  non-perturbative aspects of field theory  become tractable, and should not differ dramatically from the behavior on ${\\mathbb R}^d$. \n Once a small circle compactification respecting continuity is found, which is counter-part of center-symmetric background in gauge theory,   (note that high temperature limit of thermal compactification {\\it never} achieves this),  something magical occurs. E.g., the 2d  instanton in the $\\mathbb {CP}^{N-1}$ model, with action $S_I= \\frac{4\\pi}{g^2}$,   splits up into $N$  \nkink-instantons with action $\\frac{S_I}{N}= \\frac{4\\pi}{g^2N}$, which is now the minimal action semi-classical saddle  \n\\cite{Bruckmann:2007zh, Brendel:2009mp, Dunne:2012ae}.\nAt second order in semi-classical analysis, similar to Eq.\\ref{bions-amp}, there are two types of bion: we refer to them as charged and neutral bions. The neutral bions  ${\\cal B}_{ii} $ possess zero topological charge and zero ``magnetic\" charge, and can thus mix with perturbation theory. In the zero flavor $n_f=0$ theory, the neutral bion amplitude is two-fold ambiguous, and Borel-resummed perturbation theory (which transmutes to the combinatorics in reduced twisted compactification   \\cite{Dunne:2012ae, Anber:2014sda}\n  is also two fold ambiguous. Remarkably, these two ambiguities cancel each other {\\it exactly} \\cite{ Dunne:2012ae, Dunne:2012zk}. \nCorrespondingly, in the Borel plane the leading singularity is located at $t = \\tilde t_1  \\sim  (2S_I)/N $, which, since $\\beta_0=N$ for  \n$\\mathbb {CP}^{N-1}$, is the same as the location of 't Hooft's elusive renormalon ambiguity  $t = \\tilde t_1  \\sim   (2S_I)/\\beta_0 $: \n\n", "index": 3, "text": "\\begin{equation}\n{\\mathrm{Im}}[ {\\mathbb P}_\\pm(g^2) + [{\\cal B}_{ii}]_\\pm (g^2) ] = 0,  \\qquad  {\\mathrm{Im}} [{\\cal B}_{ii}]_\\pm \\sim \\pm  e^{- 2 \\frac{4\\pi}{g^2N}} \\sim \\pm \\Lambda^2\n\\label{cancel-2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\mathrm{Im}}[{\\mathbb{P}}_{\\pm}(g^{2})+[{\\cal B}_{ii}]_{\\pm}(g^{2})]=0,\\qquad%&#10;{\\mathrm{Im}}[{\\cal B}_{ii}]_{\\pm}\\sim\\pm e^{-2\\frac{4\\pi}{g^{2}N}}\\sim\\pm%&#10;\\Lambda^{2}\" display=\"block\"><mrow><mrow><mrow><mi>Im</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><msub><mi>ℙ</mi><mo>±</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mrow><mo stretchy=\"false\">[</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">]</mo></mrow><mo>±</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>g</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mrow><mi>Im</mi><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">[</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo stretchy=\"false\">]</mo></mrow><mo>±</mo></msub></mrow><mo>∼</mo><mrow><mo>±</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow><mrow><msup><mi>g</mi><mn>2</mn></msup><mo>⁢</mo><mi>N</mi></mrow></mfrac></mrow></mrow></msup></mrow><mo>∼</mo><mrow><mo>±</mo><msup><mi mathvariant=\"normal\">Λ</mi><mn>2</mn></msup></mrow></mrow></mrow></math>", "type": "latex"}]