[{"file": "1601.00081.tex", "nexttext": "\n\nWe can write the Lagrangian for a chiral 6D fermion $\\Psi_+$, in terms of its components, in the following way:\n\n\n", "itemtype": "equation", "pos": 16264, "prevtext": "\n\\maketitle\n\\section{Introduction}\nSince the first proposals at the dawn of particle physics by Nordstr\\\"om \\cite{Nordstrom:1988fi}, Kaluza \\cite{Kaluza:1921tu} and Klein \\cite{Klein:1926tv}, extra dimensional spaces have proven a useful playground for the exploration of extensions of the Standard Model (SM) of Particle Physics. Compact spaces, after the Kaluza-Klein (KK) reduction of the extra dimensional fields, naturally contain many massive replicas of the SM states, appearing as towers of KK resonances. In this paper, we are interested in the possibility that one (or more) of such states may play the role of Dark Matter. This idea is more than a decade old \\cite{Servant2003a}, and it was a natural consequence of models where all the SM fields propagate in the extra dimension, as in Universal Extra Dimension (UED) incarnations \\cite{Antoniadis:1990ew,Antoniadis:1998ig,Appelquist2000}. The stability of one of the KK modes derives from the presence of a residual discrete symmetry, left over from the breaking of the extended Poincare invariance by the compactification of the extra spatial dimensions.\nUED models have been thoroughly investigated in the flat (zero-curvature) case, while\ngeometries with non-zero curvature are much less scrutinised even though they are an interesting alternative~\\footnote{Models in warped space, or Randall-Sumdrum \\cite{Randall:1999vf}, are an exception, as the asymmetric curvature eliminates the possibility of residual discrete symmetries. For an attempt to build double-throat models with KK Dark Matter, see \\cite{Agashe:2007jb}.}. In all these models, \nit is common for the lightest Kaluza-Klein particle to be made stable in order to provide a candidate for the Dark Matter particle. \nThe stability of Dark Matter is often imposed by adding symmetries to the model (typically a new parity). The most common situation is that the interactions in the bulk of the extra space respect the parity, while the presence of fixed points where lower dimension interactions can be added violates it: one is therefore left with the only option of imposing the parity invariance by hand on the localised interactions. It was later realized in \\cite{Cacciapaglia:2009pa} that the requirement of a compact space that preserves the Dark Matter parity, including the fixed points, is a powerful selection rule on the choice of the compactification.\nIn the following we shall, therefore, consider cases in which the stability of the Dark Matter particle is not the result of such an ad-hoc symmetry, but rather a residual symmetry naturally present in the model due to its geometry and its compactification.\n\nThis idea proves the need to go beyond the minimal UED model in 5 dimensions \\cite{Appelquist2000}, where it cannot apply without enforcing parity by hand \\cite{Servant2003a}. This has motivated the construction of models in more than 5 dimensions, of which the flat 6-dimensional (6D) UED model based on the real projective plane \\cite{Cacciapaglia:2009pa} is the minimal example. Another motivation to look into the case of six dimensional UED models is the number of matter generations required in order to cancel \nthe global $SU(2)$ anomaly, which is precisely three \\cite{Dobrescu:2001ae}.\n\nTo further explore this project, in this paper we study 6D cases with positively curved extra-space, in particular we focus on quotients of the sphere by its finite symmetry groups. \nWe will thus systematically study the possible compact spaces, and select the ones that allow for an exact parity, or continuous symmetry, to be left unbroken. On spherical orbifolds, one of the main hurdles for a realistic model is the presence of light (massless) chiral fermions in the spectrum, as spin-1/2 fields typically acquire a mass from the positive curvature. One, therefore, needs to extend the model in order to cancel such mass contribution.\nProposals to this effect have been put forward in the literature, as in \\cite{Maru2010,Dohi2010}, making use of an appealing mechanism for radius stabilisation that employs a magnetic monopole of an extra $U(1)$ \\cite{RandjbarDaemi:1982hi} also leading to four dimensional chiral fermions. Another possibility for obtaining realistic fermions in the low energy spectrum of sphere-based models is to localise them on a 4-dimensions subspace. A dynamical mechanism has been proposed in \\cite{Frere:2003,Frere:2013,Frere:2015} for the localisation of fermions on a sphere inside a vortex, but while this model has many interesting features, Dark Matter is not one of them because the vortex breaks the symmetries of the sphere. As an alternative compatible with Dark Matter, we propose to study the brane-localisation of fermions on the fixed points naturally arising in orbifolds of the sphere. We leave however the requirement that the fields propagating in the bulk corresponds to SM fields, i.e. gauge vectors and the Brout-Englert-Higgs scalar. Models where the whole SM is localised and Dark Matter is provided by additional singlet fields in the bulk has been proposed, for instance in \\cite{Winslow:2010nk}.\n\nBefore entering into the details of model building and of theoretical and phenomenological constraints, in the following section we shall consider\nsome general background material. Indeed, while the subject of finite spherical symmetry groups is known in extensive detail and figures \nas part of the basics of crystallography and chemistry \\cite{flurry1980symmetry}, to our knowledge there is no systematic study of the geometric properties of the associated \norbifolds, \\textit{i.e.} the quotient spaces of the sphere by these groups, which would be readily available in the standard notation used in particle \nphysics for model building. \n\nWe therefore organise the paper with Section 2 dedicated to spherical orbifolds and their applications, where we identify a minimal model to be studied in detail in the following sections. Section 3 \ncontains the study of the spectra for scalar and gauge fields, where we apply generalised spin-weighted spherical harmonics using the formalism \nof Newman and Penrose, on the sphere and in our minimal orbifold model. Section 4 consists of a theoretical analysis of the properties of Dark Matter in this model. Section 5 deals with the collider limits by direct detection \nof Kaluza-Klein particles. Section 6 introduces the upper limit on the mass from the relic density abundance of the Dark Matter candidate.\nSection 7 discusses how the results obtained in the minimal model introduced in the previous sections can be generalised. Finally section 8 \ngives the conclusions, which can be drawn from our study.\n\n\n\\section{Spherical orbifolds}\n\\label{orbifolds}\nObtaining a realistic spectrum for fermions is one of the most challenging aspects of model building in extra dimensions: the SM consists of chiral fermions which are massless in the electroweak preserving vacuum, thus corresponding to a set of Weyl spinors. However, in spaces with more than 4 dimensions, all irreducible spinor representations are built with at least two independent Weyl spinors: the number of Weyl components in the smallest representation is $2^{\\frac{D-2}{2}}$ in even dimensions and $2^\\frac{D-1}{2}$ in odd dimensions, see for example \\cite{RauschdeTraubenberg:2005aa}.\nThese extra-components manifest themselves as extra fields in the Kaluza-Klein reduction of a theory with bulk fermions, thus providing additional unwanted massless or light states.\nA classical way around this problem is the use of orbifolds: one works in a theory where the space is reduced to its quotient by a discrete isometry group, and the fields in the quotient are fields in the original space with a requirement to have particular identification conditions (\\textit{orbifolding conditions}) under the isometry group (the \\textit{orbifolding group}). These requirements impose that some wavefunctions in the Kaluza-Klein expansion of the fields vanish (the corresponding modes are \\textit{orbifolded out} or \\textit{projected out}), thus an appropriate choice of isometry group and identification conditions allows the problematic low-lying modes to be projected out -- therefore making the fermion spectrum realistic. This idea was first used in 5 dimensions \\cite{Appelquist2000} and was further applied successfully in 6D cases \\cite{Dobrescu:2004zi,Cacciapaglia:2009pa}. Positively curved spaces, however, pose a problem that orbifolds alone cannot solve: the Lichnerovicz theorem \\cite{berline1992heat} states that in all such geometries, the lowest lying fermion mode has a non-zero mass (thus being a Dirac spinor), which is not compatible with obtaining the Standard Model fields in the lowest levels. \n\nIn this section we present two alternative ways of obtaining massless chiral fermions in the lowest Kaluza-Klein mode, where orbifolds are used in a non-standard way: the Randjbar-Daemi--Salam--Strathdee (RSS) compactification, which has been studied in the literature, and brane-localisation, which we propose as an alternative. We start by reviewing the discrete spherical symmetry groups and the orbifolds they generate, then we show how the RSS compactification provides realistic fermions but also other undesirable features that are hard to circumvent. Finally we argue for an alternative possibility based on brane-localisation, which we will study in detail.\n\n\n\\subsection{Spherical symmetry groups and their associated orbifolds}\nThe properties of spherical symmetry groups are well known from the mathematical literature \\cite{Conway2002,Conway2008}, so we mainly list them for the purpose of fixing our notation. There is, however, to our knowledge, no systematic study of the various possibilities for model building in particle physics: in particular, we will be interested in the residual symmetries of the orbifolded space, which will allow us to determine the optimal candidate models to contain a Dark Matter candidate.\n\n\n\\subsubsection{The eight families}\nThere are eight families of spherical symmetry groups:\n\\begin{itemize}\n\\item the 3 cyclic groups: \n  \\begin{itemize}\n   \\item $C_n$, generated by a $n$-fold rotational symmetry around the $z$ axis,\n    \\item their ``pyramidal'' variants $C_{nv}$, which include $n$ additional vertical mirror planes (except for $n=2$ where the two planes are identical),\n    \\item their ``horizontal'' variants $C_{nh}$, which include one horizontal mirror plane;\n  \\end{itemize}\n\\item \\textit{spiegel} groups $S_{2n}$ of $2n$-fold rotation-inversions around the $z$ axis (note that $S_{2n+1}=C_{(2n+1)v}$);\n\\item the 3 dihedral groups:\n\\begin{itemize}\n\\item  $D_n$, generated by a $\\frac{2\\pi}{n}$ rotation around the $z$ axis and $n$ $\\pi$-rotation axes in the $yx$ plane,\n\\item prismatic variants $D_{nh}$ which have an additional $xy$-mirror transformation,\n\\item anti-prismatic variants $D_{nd}$ which have $n$ additional mirror\n  planes containing the $z$ axis and the line bisecting a pair of adjacent rotation axes;\n\\end{itemize}\n\\item polyhedral groups, based on the symmetries of regular polyhedra. \n  \\begin{itemize}\n  \\item the tetrahedral group $T$ and its two extensions $T_d$ with a reflection containing one rotation axis of $T$ and $T_h$ with a reflection in a plane containing two axes of rotations in $T$,\n  \\item the octohedral group $O$ and its extension $O_h$ which is extended by a reflection around the horizontal plane.\n  \\end{itemize}\n\\end{itemize}\nEach one of the above isometry groups can be used to define a spherical orbifold.\n\n\n\n\n\\subsubsection{Symmetries and fixed points}\nThe 2-sphere covered by the two additional compact spatial dimensions is invariant under the rotation group $O(3)$, before the orbifold projection. It is thus natural to label the KK modes in the expansion in terms of ``angular momentum'' quantum numbers: the total momentum $l$ and the projection along the $z$-axis $m$. We will see in the later sections that this is indeed a convenient choice for the wavefunction basis. \nAfter the orbifolding, only a subgroup of $O(3)$ remains as the isometry group of the space. Understanding this group is\nparticularly important for Dark Matter as it is what provides the quantum numbers preventing its decay.\nWe found that there are four non-polyhedral group families that have a non-trivial symmetry group. There are three types of residual symmetries: $O(3)$,\n$O(2)$ and reflections. $O(3)$ is associated with full angular momentum selection rules, meaning that both $l$ and $m$ are conserved quantum numbers; $O(2)$, corresponding to rotational invariance around one fixed axis of the sphere, keeps only the additive quantum number $m$ conserved; finally reflections with respect to a plane act as parities on the KK modes. The list of symmetries for each class of orbifolds is provided in Table~\\ref{tab:orbprop}.\n\nAnother important feature of orbifolds is the presence of fixed points or lines: they are subspaces that are left invariant by the orbifold group and provide spots\nwhere the orbifold is not a manifold.\nOnce a field theory is defined on the orbifold space, fixed points or lines manifest themselves as branes where localised\noperators or fields are allowed. Without imposing additional symmetries, higher order operators appear, thus breaking the $O(3)$ symmetry of the sphere to the unbroken subgroups described above. For the presence of a Dark Matter candidate, therefore, it is crucial to understand both the presence of fixed points/lines and the residual symmetries.\nThese special regions, and the corresponding localised operators, will play and important role for model building and will be discussed \nin more detail in the next sections. A summary table of orbifold properties is provided in Table \\ref{tab:orbprop}.\n\\begin{table}[!h]\n\\begin{center}\n\\begin{tabular}{|c|c|ll|ll|}\n\\hline\nGroup & Symmetry & \\multicolumn{2}{c|}{Singular points} & \\multicolumn{2}{c|}{Lines}\\\\ \\hline\n\\multirow{2}{*}{$C_n$} & \\multirow{2}{*}{$O(2)_z$} & \\multirow{2}{*}{2:} & North pole & \\multirow{2}{*}{0} & \\\\\n & & & South pole & &\\\\\\hline\n$C_{nh}$ & $O(2)_z$ & 1: & Poles & 1: & Equator segment  \\\\\\hline\n\\multirow{2}{*}{$C_{nv}$} & \\multirow{2}{*}{None} & \\multirow{2}{*}{2:} & North Pole &   \\multirow{2}{*}{2:} & Eastern Meridian  \\\\\n& & & South Pole & & Western Meridian  \\\\\\hline\n\\multirow{3}{*}{$D_{n}$} & \\multirow{3}{*}{$M(xz),\\ M(xy)$}  & \\multirow{3}{*}{3:} &  Poles &  \\multirow{3}{*}{0} &   \\\\ \n\n& & & East Meridian End & &   \\\\\n& & & West Meridian End & &   \\\\\\hline\n\\multirow{4}{*}{$D_{nh}$} & \\multirow{4}{*}{None}  & \\multirow{4}{*}{4:} &  North Pole &  \\multirow{4}{*}{0} &   \\\\ \n& & & Equator Midpoint & &   \\\\\n& & & East Meridian End & &   \\\\\n& & & West Meridian End & &   \\\\\\hline\n\\multirow{3}{*}{$D_{nv}$} & \\multirow{3}{*}{None} & \\multirow{3}{*}{1:} & \\multirow{3}{*}{Poles} & \\multirow{3}{*}{3:} & Eastern Edge   \\\\\n&&&&& Southern Edge\\\\\n&&&&& Western Edge\\\\\\hline\n$S_2$ & $O(3)$  & 0 & & 0 & \\\\\\hline\n$S_{2n}$, $n>1$ & $O(2)_z$ & 1: & Poles & 0 &  \\\\\\hline\n\\multirow{3}{*}{$T$}&\\multirow{3}{*}{$M(xy)$}& \\multirow{3}{*}{3:} & North-South Corners & \\multirow{3}{*}{0} &\\\\\n& & & East Corner & &   \\\\\n& & & West Corner & &   \\\\\\hline\n\\multirow{3}{*}{$T_d$} & \\multirow{3}{*}{None} & \\multirow{3}{*}{3:} & North Corner & \\multirow{3}{*}{1:} & \\multirow{3}{*}{Equator segment}\\\\\n& & & East Corner & &   \\\\\n& & & West Corner & &   \\\\\\hline\n\\multirow{2}{*}{$T_h$} & \\multirow{2}{*}{None} &\\multirow{2}{*}{2:} & North-South Corners & \\multirow{2}{*}{1:} & \\multirow{2}{*}{Western Edge}\\\\\n& & & East Corner & &   \\\\\\hline\n\\multirow{3}{*}{$O$}&\\multirow{3}{*}{$M(xy)$}& \\multirow{3}{*}{3:} & North Corner & \\multirow{3}{*}{0} &\\\\\n& & & East-West Corners & &   \\\\\n& & & Equator Midpoint & &   \\\\\\hline\n\\multirow{3}{*}{$O_h$}&\\multirow{3}{*}{None}& \\multirow{3}{*}{3:} & North Corner & \\multirow{3}{*}{1:} & \\multirow{3}{*}{Equator segment}\\\\\n& & & East Corner & &   \\\\\n& & & West Corner & &   \\\\\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Properties of the spherical orbifolds. }\n\\label{tab:orbprop}\n\\end{table}\n\n\\subsection{The RSS mechanism and its phenomenological applications}\n\nIn six dimensions, a Dirac fermion contains four Weyl components, which can be grouped into two irreducible 6D--chiral representations:\n\n\n", "index": 1, "text": "\\begin{equation}\n  \\label{eq:1}\n  \\Psi_{6D} = \\Psi_+ + \\Psi_- = \\begin{pmatrix} \\chi_+ \\\\ \\bar\\eta_+ \\\\ 0 \\\\ 0\\end{pmatrix} + \\begin{pmatrix} 0 \\\\ 0 \\\\ \\chi_- \\\\ \\eta_- \\end{pmatrix}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Psi_{6D}=\\Psi_{+}+\\Psi_{-}=\\begin{pmatrix}\\chi_{+}\\\\&#10;\\bar{\\eta}_{+}\\\\&#10;0\\\\&#10;0\\end{pmatrix}+\\begin{pmatrix}0\\\\&#10;0\\\\&#10;\\chi_{-}\\\\&#10;\\eta_{-}\\end{pmatrix}\\,.\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Ψ</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mo>=</mo><mrow><msub><mi mathvariant=\"normal\">Ψ</mi><mo>+</mo></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Ψ</mi><mo>-</mo></msub></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>χ</mi><mo>+</mo></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mover accent=\"true\"><mi>η</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr></mtable><mo>)</mo></mrow><mo>+</mo><mpadded width=\"+1.7pt\"><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>χ</mi><mo>-</mo></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>η</mi><mo>-</mo></msub></mtd></mtr></mtable><mo>)</mo></mrow></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nwhere $\\Omega_+$ and $\\bar \\Omega_+$ are two differential operators which have conjugate eigenbases and opposite eigenvalues. \nAs such operators connect $\\chi_+$ and $\\bar \\eta_+$, their KK expansion contains the same physical states and $\\Omega_+$ and $\\bar\\Omega_+$ provide mass terms which connect the two chiralities in each level thus making explicit that we have vector-like fermion levels. The problem with fermions on the sphere is that $\\Omega_+$  does not have a null eigenvalue, thus no massless mode is present in the spectrum.\n\nA significant change to this picture can be brought by adding a gauge field background, which will generate terms of the same kind as $\\Omega_+$ since both are connexions. In particular, if a $U(1)$ gauge field ${\\ensuremath{\\mathbf{A}}}$, with coupling $g$, has a magnetic monopole background on the sphere\n\n\n", "itemtype": "equation", "pos": 16579, "prevtext": "\n\nWe can write the Lagrangian for a chiral 6D fermion $\\Psi_+$, in terms of its components, in the following way:\n\n\n", "index": 3, "text": "\\begin{equation}\n  \\label{eq:3}\n  {\\cal L}_{\\Psi_+} = \\int \\sqrt{-g} dx^6\\  i(\\chi_+^\\dagger)\\sigma_\\mu \\partial^\\mu \\chi_+ +  i(\\bar\\eta_+^\\dagger)\\sigma_\\mu \\partial^\\mu \\bar\\eta_+i+\\left( \\chi^\\dagger\\bar\\Omega_+ \\bar\\eta_+ + \\bar\\eta_+^\\dagger \\Omega_+ \\chi_+  \\right)\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{\\Psi_{+}}=\\int\\sqrt{-g}dx^{6}\\ i(\\chi_{+}^{\\dagger})\\sigma_{\\mu}%&#10;\\partial^{\\mu}\\chi_{+}+i(\\bar{\\eta}_{+}^{\\dagger})\\sigma_{\\mu}\\partial^{\\mu}%&#10;\\bar{\\eta}_{+}i+\\left(\\chi^{\\dagger}\\bar{\\Omega}_{+}\\bar{\\eta}_{+}+\\bar{\\eta}_%&#10;{+}^{\\dagger}\\Omega_{+}\\chi_{+}\\right)\\,,\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi mathvariant=\"normal\">Ψ</mi><mo>+</mo></msub></msub><mo>=</mo><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msqrt><mrow><mo>-</mo><mi>g</mi></mrow></msqrt><mo>⁢</mo><mrow><mo>𝑑</mo><mpadded width=\"+5pt\"><msup><mi>x</mi><mn>6</mn></msup></mpadded></mrow><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>χ</mi><mo>+</mo><mo>†</mo></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>σ</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><msup><mo>∂</mo><mi>μ</mi></msup><mo>⁡</mo><msub><mi>χ</mi><mo>+</mo></msub></mrow></mrow></mrow><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mover accent=\"true\"><mi>η</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo><mo>†</mo></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>σ</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><msup><mo>∂</mo><mi>μ</mi></msup><mo>⁡</mo><mrow><msub><mover accent=\"true\"><mi>η</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo></msub><mo>⁢</mo><mi>i</mi></mrow></mrow></mrow><mo>+</mo><mrow><mo>(</mo><mrow><mrow><msup><mi>χ</mi><mo>†</mo></msup><mo>⁢</mo><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>η</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo></msub></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>η</mi><mo stretchy=\"false\">¯</mo></mover><mo>+</mo><mo>†</mo></msubsup><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mo>+</mo></msub><mo>⁢</mo><msub><mi>χ</mi><mo>+</mo></msub></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nthe connexion operators are changed in a way that allows chiral fermions in the lowest mode. Indeed, the monopole gauge background provides a \n$g$-independent term in the Dirac equations and breaks the symmetry in the expansions of $\\chi$ and $\\bar\\eta$. Depending on the sign of the charge, \neither one has a constant wavefunction among its modes while the other only has non-zero kinetic energy modes. As a result, there is only one massless \nWeyl fermion KK mode for each 6D chiral fermion which interacts with the monopole background.\n\nBesides the obvious motivation from model building, there are some stronger arguments for introducing this gauge background from the study of the Einstein \nequations on the background $\\mathbb{M}_4\\times S^2$. In this case, it was established by Randjbar-Daemi, Salam and Strathdee \\cite{RandjbarDaemi:1982hi}\nthat having a stable geometry is not possible with an empty spacetime, but that a monopole gauge background fixes the sphere radius, depending on the \ngauge coupling:\n\n", "itemtype": "equation", "pos": 17721, "prevtext": "\n\nwhere $\\Omega_+$ and $\\bar \\Omega_+$ are two differential operators which have conjugate eigenbases and opposite eigenvalues. \nAs such operators connect $\\chi_+$ and $\\bar \\eta_+$, their KK expansion contains the same physical states and $\\Omega_+$ and $\\bar\\Omega_+$ provide mass terms which connect the two chiralities in each level thus making explicit that we have vector-like fermion levels. The problem with fermions on the sphere is that $\\Omega_+$  does not have a null eigenvalue, thus no massless mode is present in the spectrum.\n\nA significant change to this picture can be brought by adding a gauge field background, which will generate terms of the same kind as $\\Omega_+$ since both are connexions. In particular, if a $U(1)$ gauge field ${\\ensuremath{\\mathbf{A}}}$, with coupling $g$, has a magnetic monopole background on the sphere\n\n\n", "index": 5, "text": "\\begin{equation}\n  \\label{eq:6}\n  {\\ensuremath{\\mathbf{A}}} = \\frac{n}{2g} \\cos \\theta d\\phi,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\mathbf{A}}=\\frac{n}{2g}\\cos\\theta d\\phi,\" display=\"block\"><mrow><mrow><mi>𝐀</mi><mo>=</mo><mrow><mfrac><mi>n</mi><mrow><mn>2</mn><mo>⁢</mo><mi>g</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mi>θ</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>ϕ</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhere $G_6$ is the 6-dimensional gravitational constant, related to the usual Newton constant by $\\frac{G_6}{R^4}=\\frac{G}{R^2}$.\nThe effective 4D gauge coupling for this gauge field therefore scales like $\\sqrt{G}/R$ and numerically is of order $10^{-8}$ for{$\\unit{{}}{\\tera\\electronvolt}$} extra-dimensions. While this is a very small coupling that protects the theory from any observable effects at colliders, it has been pointed out \\cite{Dohi2010} that measurements of short range gravitational interactions can put bounds on such a gauge theory, while even a small mass around a few$\\unit{}{\\electronvolt}$ is sufficient to hide the new gauge boson from these experimental searches \\cite{Geraci2008}.\nTwo models have been proposed in the past that make use of the RSS mechanism to have chiral fermions in their low-energy spectra. They both rely on some form of explicit breaking of the $U(1)$ symmetry. \n\nThe first model \\cite{Maru2010} is defined on the orbifold called $S^2/C_2$ in our notation. Their proposal for breaking the gauge field introduced in their model is to use the gauge anomaly present in their theory if only the Standard Model fermions are included. As a result, an ${\\cal O}(1/R)$ bulk mass is expected to be given to the gauge field, putting the new interaction far beyond any short range gravity test. The situation is similar in \\cite{Dohi2010}, where the gauge symmetry is broken by the orbifold identification conditions: by imposing a charge conjugation violating identification in the geometry $G_2$, the zero-mode of the gauge field is eliminated from the spectrum, leaving only massive, ${\\cal O}(1/R)$ excitations. In both cases, gauge invariance is explicitly broken. Besides aesthetics, we think that this is potentially troublesome: the gauge breaking allows for a large number of unconstrained bulk operators with power-law scaling -- potentially largely changing the tree-level picture that the authors studied. In particular, new quadratic operators are allowed -- first of which the mass term -- modifying the equations of motions and therefore spoiling the GR argument due to the large corrections these operators introduce into the original Einstein-Maxwell equations. It is not at all clear that a stable radius is still possible under these conditions. While it is definitely true that most UED models do not provide spaces that are solutions to gravitational equations -- which is justified by their being effective field theories only valid up to at best tens of{$\\unit{{}}{\\tera\\electronvolt}$} -- this observation does take away a lot of the naturalness that the two models seem to have at tree level.\n\nAs an alternative to the extra complications that the RSS mechanism brings to particle models, we propose instead to localise fermions on the fixed points of spherical orbifolds. Such a construction does not provide a compactification mechanism and leaves gravity out of the picture, but has a reasonable justification: since localised operators are naturally generated on the fixed points of orbifolds, it is not far-fetched to allow for some fields to be localised as well.\n\n\\subsection{Selecting an orbifold for a Dark Matter model}\n\nWe wish to focus our attention on the simplest geometry compatible with the existence of Dark Matter and massless chiral fermions. \nThe first requirement is obviously that a symmetry exists after orbifolding, so that some KK modes will be stablilised. This leaves only four \npossible candidate families: $C_n$, $C_{nh}$, $D_n$ and $S_{2n}$. We also wish to localise fermions on fixed points, as this allows avoiding \nthe usual problems of bulk fermions requiring a special treatment in order to let survive only a chiral 4D fermion from a 6D one, which further \nexcludes $S_2$. Among the remaining possibilities,  $S_{2n}$ with $n>1$ provides the simplest framework for this localisation \nsince it has exactly one fixed point, leaving no ambiguity as to where the fermions should be localised. The class $C_{nh}$ also has a single fixed point with the addition of a fixed line: the line is equivalent to a circle, thus localising a fermion field there cannot give rise to chiral massless modes. Other cases have more than one fixed point: 2 for $C_n$ and $C_{nv}$, and 4 for $D_n$.\nNote that the two simplest polyhedral orbifolds, $T$ and $O$, also have a left-over parity, however determining the spectra is mathematically not an easy task.\nIn the following sections, we will therefore study \nthe phenomenology of the model with geometry $\\mathbb{M}_4\\times S^2/S_4$ in detail, and then generalise the results obtained to the other \npossible spaces.\n\n\\section{Spectra on $S^2$ and $S^2/S_4$}\n\\label{spectra}\n\n\nStarting from a spherical geometry, it is not surprising that angular momentum plays a major role in the classification of the wave-functions of KK modes, including the case of orbifolds. Spin-weighted spherical harmonics provide a \ntruly natural framework for the study of arbitrary-spin equations of motion on spaces with spherical symmetry. They were introduced \nin \\cite{Gelfand1958} for the study of representations of the Lorentz group, then independently rediscovered in \\cite{Newman1966}, \nand subsequently used to study gravitational radiation \\cite{Penrose1984}. An introductory review can be found in \\cite{Castillo2007}. \nIn recent years, spin-weighted harmonics have been successfully applied to finding compact solutions to the equations of motion of \nscalars, gauge bosons and spin-{$\\frac{1}{2}$\\ } fermions for the derivation of Kaluza-Klein spectra \\cite{Dohi2010, Dohi2014}. While previous solutions \nexisted (see \\cite{Camporesi1996, Abrikosov2002, Maru2010} and others), the simplicity of the derivation shows that the spin-weighted\nspherical-harmonic expansion is the best suited formulation of these results.\n\nIn this section, we restate basic results about spin--weighted harmonics, which will be used to obtain physical degrees of freedom of\nthe Kaluza-Klein expansion, following the derivation of \\cite{Dohi2014}.\n\n\\begin{dfn}[Spin Weight]\nLet $f$ be a function defined as\n\n", "itemtype": "equation", "pos": 18848, "prevtext": "\n\nthe connexion operators are changed in a way that allows chiral fermions in the lowest mode. Indeed, the monopole gauge background provides a \n$g$-independent term in the Dirac equations and breaks the symmetry in the expansions of $\\chi$ and $\\bar\\eta$. Depending on the sign of the charge, \neither one has a constant wavefunction among its modes while the other only has non-zero kinetic energy modes. As a result, there is only one massless \nWeyl fermion KK mode for each 6D chiral fermion which interacts with the monopole background.\n\nBesides the obvious motivation from model building, there are some stronger arguments for introducing this gauge background from the study of the Einstein \nequations on the background $\\mathbb{M}_4\\times S^2$. In this case, it was established by Randjbar-Daemi, Salam and Strathdee \\cite{RandjbarDaemi:1982hi}\nthat having a stable geometry is not possible with an empty spacetime, but that a monopole gauge background fixes the sphere radius, depending on the \ngauge coupling:\n\n", "index": 7, "text": "\\begin{equation}\n  \\label{eq:8}\n  R = \\frac{n\\sqrt{8 \\pi G_6}}{2g}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"R=\\frac{n\\sqrt{8\\pi G_{6}}}{2g}\" display=\"block\"><mrow><mi>R</mi><mo>=</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><msqrt><mrow><mn>8</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>G</mi><mn>6</mn></msub></mrow></msqrt></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>g</mi></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhere ${\\ensuremath{\\mathbf{\\hat{{v}}}}}$ defines a right-handed basis on the tangent space of\n$S^2$ at the point $\\Omega$. The function $f$ has spin-weight $s$ if\n$f(\\Omega,e^{i\\theta} {\\ensuremath{\\mathbf{\\hat{{v}}}}})=e^{is\\theta}f(\\Omega,{\\ensuremath{\\mathbf{\\hat{{v}}}}})$\n\\end{dfn}\n\nThese function are spin-$s$ representations of the $U(1)$ symmetry of the tangent space of $S^2$. As for usual spin representations, \nthey can be built from products of the spin-{$\\frac{1}{2}$\\ } representations, as illustrated explicitly in \\cite{Castillo2007}. The spin-weighted\nspherical harmonics $\\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}}Y_{lm}$ provide a particularly nice basis for functions of\na given spin weight and in particular, the usual spherical harmonics are the trivial representation, generated\nfrom the antisymmetric product of the spin-{$\\frac{1}{2}$\\ } basis. The details for this construction being of no direct consequence for our\ndiscussion, which only uses the algebraic properties of the spin-weighted spherical harmonics, we refer the readers to\n\\cite{Castillo2007} for further details and derivations.\n\\begin{dfn}[Newman-Penrose operator] We define the operator $\\eth$, and its conjugate $\\bar\\eth$, as\n\n", "itemtype": "equation", "pos": 25034, "prevtext": "\nwhere $G_6$ is the 6-dimensional gravitational constant, related to the usual Newton constant by $\\frac{G_6}{R^4}=\\frac{G}{R^2}$.\nThe effective 4D gauge coupling for this gauge field therefore scales like $\\sqrt{G}/R$ and numerically is of order $10^{-8}$ for{$\\unit{{}}{\\tera\\electronvolt}$} extra-dimensions. While this is a very small coupling that protects the theory from any observable effects at colliders, it has been pointed out \\cite{Dohi2010} that measurements of short range gravitational interactions can put bounds on such a gauge theory, while even a small mass around a few$\\unit{}{\\electronvolt}$ is sufficient to hide the new gauge boson from these experimental searches \\cite{Geraci2008}.\nTwo models have been proposed in the past that make use of the RSS mechanism to have chiral fermions in their low-energy spectra. They both rely on some form of explicit breaking of the $U(1)$ symmetry. \n\nThe first model \\cite{Maru2010} is defined on the orbifold called $S^2/C_2$ in our notation. Their proposal for breaking the gauge field introduced in their model is to use the gauge anomaly present in their theory if only the Standard Model fermions are included. As a result, an ${\\cal O}(1/R)$ bulk mass is expected to be given to the gauge field, putting the new interaction far beyond any short range gravity test. The situation is similar in \\cite{Dohi2010}, where the gauge symmetry is broken by the orbifold identification conditions: by imposing a charge conjugation violating identification in the geometry $G_2$, the zero-mode of the gauge field is eliminated from the spectrum, leaving only massive, ${\\cal O}(1/R)$ excitations. In both cases, gauge invariance is explicitly broken. Besides aesthetics, we think that this is potentially troublesome: the gauge breaking allows for a large number of unconstrained bulk operators with power-law scaling -- potentially largely changing the tree-level picture that the authors studied. In particular, new quadratic operators are allowed -- first of which the mass term -- modifying the equations of motions and therefore spoiling the GR argument due to the large corrections these operators introduce into the original Einstein-Maxwell equations. It is not at all clear that a stable radius is still possible under these conditions. While it is definitely true that most UED models do not provide spaces that are solutions to gravitational equations -- which is justified by their being effective field theories only valid up to at best tens of{$\\unit{{}}{\\tera\\electronvolt}$} -- this observation does take away a lot of the naturalness that the two models seem to have at tree level.\n\nAs an alternative to the extra complications that the RSS mechanism brings to particle models, we propose instead to localise fermions on the fixed points of spherical orbifolds. Such a construction does not provide a compactification mechanism and leaves gravity out of the picture, but has a reasonable justification: since localised operators are naturally generated on the fixed points of orbifolds, it is not far-fetched to allow for some fields to be localised as well.\n\n\\subsection{Selecting an orbifold for a Dark Matter model}\n\nWe wish to focus our attention on the simplest geometry compatible with the existence of Dark Matter and massless chiral fermions. \nThe first requirement is obviously that a symmetry exists after orbifolding, so that some KK modes will be stablilised. This leaves only four \npossible candidate families: $C_n$, $C_{nh}$, $D_n$ and $S_{2n}$. We also wish to localise fermions on fixed points, as this allows avoiding \nthe usual problems of bulk fermions requiring a special treatment in order to let survive only a chiral 4D fermion from a 6D one, which further \nexcludes $S_2$. Among the remaining possibilities,  $S_{2n}$ with $n>1$ provides the simplest framework for this localisation \nsince it has exactly one fixed point, leaving no ambiguity as to where the fermions should be localised. The class $C_{nh}$ also has a single fixed point with the addition of a fixed line: the line is equivalent to a circle, thus localising a fermion field there cannot give rise to chiral massless modes. Other cases have more than one fixed point: 2 for $C_n$ and $C_{nv}$, and 4 for $D_n$.\nNote that the two simplest polyhedral orbifolds, $T$ and $O$, also have a left-over parity, however determining the spectra is mathematically not an easy task.\nIn the following sections, we will therefore study \nthe phenomenology of the model with geometry $\\mathbb{M}_4\\times S^2/S_4$ in detail, and then generalise the results obtained to the other \npossible spaces.\n\n\\section{Spectra on $S^2$ and $S^2/S_4$}\n\\label{spectra}\n\n\nStarting from a spherical geometry, it is not surprising that angular momentum plays a major role in the classification of the wave-functions of KK modes, including the case of orbifolds. Spin-weighted spherical harmonics provide a \ntruly natural framework for the study of arbitrary-spin equations of motion on spaces with spherical symmetry. They were introduced \nin \\cite{Gelfand1958} for the study of representations of the Lorentz group, then independently rediscovered in \\cite{Newman1966}, \nand subsequently used to study gravitational radiation \\cite{Penrose1984}. An introductory review can be found in \\cite{Castillo2007}. \nIn recent years, spin-weighted harmonics have been successfully applied to finding compact solutions to the equations of motion of \nscalars, gauge bosons and spin-{$\\frac{1}{2}$\\ } fermions for the derivation of Kaluza-Klein spectra \\cite{Dohi2010, Dohi2014}. While previous solutions \nexisted (see \\cite{Camporesi1996, Abrikosov2002, Maru2010} and others), the simplicity of the derivation shows that the spin-weighted\nspherical-harmonic expansion is the best suited formulation of these results.\n\nIn this section, we restate basic results about spin--weighted harmonics, which will be used to obtain physical degrees of freedom of\nthe Kaluza-Klein expansion, following the derivation of \\cite{Dohi2014}.\n\n\\begin{dfn}[Spin Weight]\nLet $f$ be a function defined as\n\n", "index": 9, "text": "\\begin{equation}\n  \\label{eq:1}\nf:  \\left\\{ \\begin{array}{ccc} \nS^2\\times S^1 &\\rightarrow& \\mathbb{C}\\\\\n(\\Omega,{\\ensuremath{\\mathbf{\\hat{{v}}}}}) &\\mapsto & f(\\Omega, {\\ensuremath{\\mathbf{\\hat{{v}}}}})\n\\end{array}\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"f:\\left\\{\\begin{array}[]{ccc}S^{2}\\times S^{1}&amp;\\rightarrow&amp;\\mathbb{C}\\\\&#10;(\\Omega,{\\mathbf{\\hat{{v}}}})&amp;\\mapsto&amp;f(\\Omega,{\\mathbf{\\hat{{v}}}})\\end{array%&#10;}\\right.\" display=\"block\"><mrow><mi>f</mi><mo>:</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msup><mi>S</mi><mn>2</mn></msup><mo>×</mo><msup><mi>S</mi><mn>1</mn></msup></mrow></mtd><mtd columnalign=\"center\"><mo>→</mo></mtd><mtd columnalign=\"center\"><mi>ℂ</mi></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo>,</mo><mover accent=\"true\"><mi>𝐯</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow></mtd><mtd columnalign=\"center\"><mo>↦</mo></mtd><mtd columnalign=\"center\"><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo>,</mo><mover accent=\"true\"><mi>𝐯</mi><mo stretchy=\"false\">^</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\\end{dfn}\nThese operators appear naturally in calculations on the sphere.\nWe will often omit the index $s$ when it matches the explicit spin-weight index of the function we apply it to.\nThese operators respectively increase and decrease the spin-weight of spherical harmonics:\n\n", "itemtype": "equation", "pos": 26496, "prevtext": "\nwhere ${\\ensuremath{\\mathbf{\\hat{{v}}}}}$ defines a right-handed basis on the tangent space of\n$S^2$ at the point $\\Omega$. The function $f$ has spin-weight $s$ if\n$f(\\Omega,e^{i\\theta} {\\ensuremath{\\mathbf{\\hat{{v}}}}})=e^{is\\theta}f(\\Omega,{\\ensuremath{\\mathbf{\\hat{{v}}}}})$\n\\end{dfn}\n\nThese function are spin-$s$ representations of the $U(1)$ symmetry of the tangent space of $S^2$. As for usual spin representations, \nthey can be built from products of the spin-{$\\frac{1}{2}$\\ } representations, as illustrated explicitly in \\cite{Castillo2007}. The spin-weighted\nspherical harmonics $\\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}}Y_{lm}$ provide a particularly nice basis for functions of\na given spin weight and in particular, the usual spherical harmonics are the trivial representation, generated\nfrom the antisymmetric product of the spin-{$\\frac{1}{2}$\\ } basis. The details for this construction being of no direct consequence for our\ndiscussion, which only uses the algebraic properties of the spin-weighted spherical harmonics, we refer the readers to\n\\cite{Castillo2007} for further details and derivations.\n\\begin{dfn}[Newman-Penrose operator] We define the operator $\\eth$, and its conjugate $\\bar\\eth$, as\n\n", "index": 11, "text": "\\begin{equation}\n  \\label{eq:2}\n    \\begin{array}{rclrcl}\n     \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}}\\eth &=& - \\left( \\partial_\\theta + i \\frac{\\partial_\\phi}{\\sin\\theta}\n  - s \\cot \\theta\\right),\\ \\  &      \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}}\\bar\\eth &=& - \\left( \\partial_\\theta - i \\frac{\\partial_\\phi}{\\sin\\theta}\n  + s \\cot \\theta\\right).\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rclrcl}\\phantom{a\\hskip-5.0pt}{}_{s\\hskip-1.0pt}\\eth&amp;=&amp;-\\left(%&#10;\\partial_{\\theta}+i\\frac{\\partial_{\\phi}}{\\sin\\theta}-s\\cot\\theta\\right),&amp;%&#10;\\phantom{a\\hskip-5.0pt}{}_{s\\hskip-1.0pt}\\bar{\\eth}&amp;=&amp;-\\left(\\partial_{\\theta}%&#10;-i\\frac{\\partial_{\\phi}}{\\sin\\theta}+s\\cot\\theta\\right).\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\"><mtr><mtd columnalign=\"right\"><mmultiscripts><mi>ð</mi><mprescripts/><mpadded width=\"-1pt\"><mi>s</mi></mpadded><none/></mmultiscripts></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>-</mo><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>θ</mi></msub><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mfrac><msub><mo>∂</mo><mi>ϕ</mi></msub><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mfrac></mrow></mrow><mo>-</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"right\"><mmultiscripts><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mprescripts/><mpadded width=\"-1pt\"><mi>s</mi></mpadded><none/></mmultiscripts></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>-</mo><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>θ</mi></msub><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mfrac><msub><mo>∂</mo><mi>ϕ</mi></msub><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mfrac></mrow></mrow><mo>+</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nThe spin-weighted spherical harmonics are eigenfunctions of the\nrelated operators\n\n", "itemtype": "equation", "pos": 27162, "prevtext": "\n\\end{dfn}\nThese operators appear naturally in calculations on the sphere.\nWe will often omit the index $s$ when it matches the explicit spin-weight index of the function we apply it to.\nThese operators respectively increase and decrease the spin-weight of spherical harmonics:\n\n", "index": 13, "text": "\\begin{equation}\n  \\label{eq:3}\n  \\begin{array}{rclrcl}\n    \\eth \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}} Y_{lm} & = &\n\\sqrt{l(l+1)-s(s+1)} \\phantom{a\\hspace{-0.2em}}_{s+1\\hspace{-0.1em}}\nY_{lm},\\ \\  & \\bar\\eth \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}} Y_{lm} & = &\n-\\sqrt{l(l+1)-s(s-1)} \\phantom{a\\hspace{-0.2em}}_{s-1\\hspace{-0.1em}}\nY_{lm} \\,.\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rclrcl}\\eth\\phantom{a\\hskip-5.0pt}_{s\\hskip-1.0pt}Y_{lm}&amp;=&amp;%&#10;\\sqrt{l(l+1)-s(s+1)}\\phantom{a\\hskip-2.0pt}_{s+1\\hskip-1.0pt}Y_{lm},&amp;\\bar{\\eth%&#10;}\\phantom{a\\hskip-5.0pt}_{s\\hskip-1.0pt}Y_{lm}&amp;=&amp;-\\sqrt{l(l+1)-s(s-1)}\\phantom%&#10;{a\\hskip-2.0pt}_{s-1\\hskip-1.0pt}Y_{lm}\\,.\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\"><mtr><mtd columnalign=\"right\"><mrow><msub><mi>ð</mi><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><msub><msqrt><mrow><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>s</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt><mrow><mi>s</mi><mo>+</mo><mpadded width=\"-1pt\"><mn>1</mn></mpadded></mrow></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"right\"><mrow><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>-</mo><mrow><msub><msqrt><mrow><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>s</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msqrt><mrow><mi>s</mi><mo>-</mo><mpadded width=\"-1pt\"><mn>1</mn></mpadded></mrow></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhich reduce to the Laplace-Beltrami operator for $s=0$.\n\nWe will also need to use the symmetry properties of these functions:\n\n", "itemtype": "equation", "pos": 27629, "prevtext": "\nThe spin-weighted spherical harmonics are eigenfunctions of the\nrelated operators\n\n", "index": 15, "text": "\\begin{equation}\n  \\label{eq:4}\n  \\begin{array}{rclrcl}\n    \\eth\\bar\\eth \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}} Y_{lm} & = &-\n(l(l+1)-s(s-1)) \\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm},\\ \\  & \\bar\\eth\\eth \\phantom{a\\hspace{-0.5em}}_{s\\hspace{-0.1em}} Y_{lm} & = &\n-(l(l+1)-s(s+1)) \\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm}  \\,,\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rclrcl}\\eth\\bar{\\eth}\\phantom{a\\hskip-5.0pt}_{s\\hskip-1.0pt}Y_%&#10;{lm}&amp;=&amp;-(l(l+1)-s(s-1))\\phantom{a\\hskip-2.0pt}_{s\\hskip-1.0pt}Y_{lm},&amp;\\bar{%&#10;\\eth}\\eth\\phantom{a\\hskip-5.0pt}_{s\\hskip-1.0pt}Y_{lm}&amp;=&amp;-(l(l+1)-s(s+1))%&#10;\\phantom{a\\hskip-2.0pt}_{s\\hskip-1.0pt}Y_{lm}\\,,\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\"><mtr><mtd columnalign=\"right\"><mrow><mi>ð</mi><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>-</mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>s</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"right\"><mrow><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msub><mi>ð</mi><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mtd><mtd columnalign=\"center\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>-</mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>s</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>s</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nas well as the overlap integrals that will determine the selection\nrules between Kaluza-Klein levels:\n\n", "itemtype": "equation", "pos": 28141, "prevtext": "\nwhich reduce to the Laplace-Beltrami operator for $s=0$.\n\nWe will also need to use the symmetry properties of these functions:\n\n", "index": 17, "text": "\\begin{equation}\n  \\begin{array}{c}\n    \\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm}^*=(-1)^{m+s}\\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm}\\\\\n\\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm}(\\pi-\\theta,\\phi+\\pi) = (-1)^j \\phantom{a\\hspace{-0.2em}}_{-s\\hspace{-0.1em}}\nY_{lm}(\\theta,\\phi)\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{c}\\phantom{a\\hskip-2.0pt}{}_{s\\hskip-1.0pt}Y_{lm}^{*}=(-1)^{m+%&#10;s}\\phantom{a\\hskip-2.0pt}_{s\\hskip-1.0pt}Y_{lm}\\\\&#10;\\phantom{a\\hskip-2.0pt}{}_{s\\hskip-1.0pt}Y_{lm}(\\pi-\\theta,\\phi+\\pi)=(-1)^{j}%&#10;\\phantom{a\\hskip-2.0pt}_{-s\\hskip-1.0pt}Y_{lm}(\\theta,\\phi)\\end{array}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mmultiscripts><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow><mo>*</mo><mprescripts/><mpadded width=\"-1pt\"><mi>s</mi></mpadded><none/></mmultiscripts><mo>=</mo><mrow><msubsup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mpadded width=\"-1pt\"><mi>s</mi></mpadded><mrow><mi>m</mi><mo>+</mo><mi>s</mi></mrow></msubsup><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mrow><mmultiscripts><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow><none/><mprescripts/><mpadded width=\"-1pt\"><mi>s</mi></mpadded><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>π</mi><mo>-</mo><mi>θ</mi></mrow><mo>,</mo><mrow><mi>ϕ</mi><mo>+</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msubsup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mpadded width=\"-1pt\"><mi>s</mi></mpadded></mrow><mi>j</mi></msubsup><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nUsing these definitions and properties, we will review the spectra\nderived in \\cite{Dohi2014} for fields defined on a $\\mathbb{M}_4\\times S^2$.\n\n\\subsection{Scalar bosons on a sphere}\n\nScalar bosons have the most straightforward expansion as their quadratic Lagrangian is expressed with a Laplace--Beltrami\noperator. Let us look at the reduction for a scalar field $\\Phi(x^\\mu,\\theta,\\phi)$ with 6D Lagrangian\n\n", "itemtype": "equation", "pos": 28582, "prevtext": "\nas well as the overlap integrals that will determine the selection\nrules between Kaluza-Klein levels:\n\n", "index": 19, "text": "\\begin{equation}\n  \\label{eq:5}\n  \\begin{array}{rll}\n    \\int d\\Omega \\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{lm}^* \\phantom{a\\hspace{-0.2em}}_{s\\hspace{-0.1em}}\nY_{l'm'} =& \\delta_{ll'} \\delta_{mm'}&\\\\\n   \\int d \\Omega \\phantom{a\\hspace{-0.2em}}_{s_1\\hspace{-0.1em}}Y_{l_1m_1}\\times \\phantom{a\\hspace{-0.2em}}_{s_2\\hspace{-0.1em}}Y_{l_2m_2}\\times\\phantom{a\\hspace{-0.2em}}_{s_3\\hspace{-0.1em}}\nY_{l_3m_3} =&& \\\\\n \\sqrt{\\frac{l_1(l_1+1)l_2(l_2+1)l_3(l_3+1)} {4\\pi}}&\\left(\\begin{array}{ccc}\n  l_1 & l_2 & l_3\\\\\nm_1 & m_2 & m_3\n\\end{array}\\right)\n\\left(\n\\begin{array}{ccc}\n  l_1 & l_2 & l_3\\\\\n-s_1 & -s_2 & -s_3\n\\end{array}\\right)&\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rll}\\int d\\Omega\\phantom{a\\hskip-2.0pt}_{s\\hskip-1.0pt}Y_{lm}^%&#10;{*}\\phantom{a\\hskip-2.0pt}{}_{s\\hskip-1.0pt}Y_{l^{\\prime}m^{\\prime}}=&amp;\\delta_{%&#10;ll^{\\prime}}\\delta_{mm^{\\prime}}&amp;\\\\&#10;\\int d\\Omega\\phantom{a\\hskip-2.0pt}_{s_{1}\\hskip-1.0pt}Y_{l_{1}m_{1}}\\times%&#10;\\phantom{a\\hskip-2.0pt}_{s_{2}\\hskip-1.0pt}Y_{l_{2}m_{2}}\\times\\phantom{a%&#10;\\hskip-2.0pt}_{s_{3}\\hskip-1.0pt}Y_{l_{3}m_{3}}=&amp;&amp;\\\\&#10;\\sqrt{\\frac{l_{1}(l_{1}+1)l_{2}(l_{2}+1)l_{3}(l_{3}+1)}{4\\pi}}&amp;\\left(\\begin{%&#10;array}[]{ccc}l_{1}&amp;l_{2}&amp;l_{3}\\\\&#10;m_{1}&amp;m_{2}&amp;m_{3}\\end{array}\\right)\\left(\\begin{array}[]{ccc}l_{1}&amp;l_{2}&amp;l_{3}%&#10;\\\\&#10;-s_{1}&amp;-s_{2}&amp;-s_{3}\\end{array}\\right)&amp;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mo>𝑑</mo><msub><mi mathvariant=\"normal\">Ω</mi><mpadded width=\"-1pt\"><mi>s</mi></mpadded></msub></mrow><mo>⁢</mo><msubsup><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow><mo>*</mo></msubsup><mo>⁢</mo><mmultiscripts><mi>Y</mi><mrow><msup><mi>l</mi><mo>′</mo></msup><mo>⁢</mo><msup><mi>m</mi><mo>′</mo></msup></mrow><none/><mprescripts/><mpadded width=\"-1pt\"><mi>s</mi></mpadded><none/></mmultiscripts></mrow></mrow><mo>=</mo><mi/></mrow></mtd><mtd columnalign=\"left\"><mrow><msub><mi>δ</mi><mrow><mi>l</mi><mo>⁢</mo><msup><mi>l</mi><mo>′</mo></msup></mrow></msub><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>m</mi><mo>⁢</mo><msup><mi>m</mi><mo>′</mo></msup></mrow></msub></mrow></mtd><mtd/></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mrow><mrow><mo>𝑑</mo><msub><mi mathvariant=\"normal\">Ω</mi><mpadded width=\"-1pt\"><msub><mi>s</mi><mn>1</mn></msub></mpadded></msub></mrow><mo>⁢</mo><msub><mi>Y</mi><mrow><msub><mi>l</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>1</mn></msub></mrow></msub></mrow><msub><mo>×</mo><mpadded width=\"-1pt\"><msub><mi>s</mi><mn>2</mn></msub></mpadded></msub><msub><mi>Y</mi><mrow><msub><mi>l</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>2</mn></msub></mrow></msub></mrow><msub><mo>×</mo><mpadded width=\"-1pt\"><msub><mi>s</mi><mn>3</mn></msub></mpadded></msub><msub><mi>Y</mi><mrow><msub><mi>l</mi><mn>3</mn></msub><mo>⁢</mo><msub><mi>m</mi><mn>3</mn></msub></mrow></msub></mrow></mrow><mo>=</mo><mi/></mrow></mtd><mtd/><mtd/></mtr><mtr><mtd columnalign=\"right\"><msqrt><mfrac><mrow><msub><mi>l</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>l</mi><mn>1</mn></msub><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>l</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>l</mi><mn>2</mn></msub><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>l</mi><mn>3</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>l</mi><mn>3</mn></msub><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac></msqrt></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>l</mi><mn>1</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>l</mi><mn>2</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>l</mi><mn>3</mn></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><msub><mi>m</mi><mn>1</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>m</mi><mn>2</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>m</mi><mn>3</mn></msub></mtd></mtr></mtable><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><msub><mi>l</mi><mn>1</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>l</mi><mn>2</mn></msub></mtd><mtd columnalign=\"center\"><msub><mi>l</mi><mn>3</mn></msub></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mo>-</mo><msub><mi>s</mi><mn>1</mn></msub></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><msub><mi>s</mi><mn>2</mn></msub></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><msub><mi>s</mi><mn>3</mn></msub></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mtd><mtd/></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nThe Laplace--Beltrami operator is diagonal in the spherical harmonics basis, so we can expand\n\n", "itemtype": "equation", "pos": 29661, "prevtext": "\nUsing these definitions and properties, we will review the spectra\nderived in \\cite{Dohi2014} for fields defined on a $\\mathbb{M}_4\\times S^2$.\n\n\\subsection{Scalar bosons on a sphere}\n\nScalar bosons have the most straightforward expansion as their quadratic Lagrangian is expressed with a Laplace--Beltrami\noperator. Let us look at the reduction for a scalar field $\\Phi(x^\\mu,\\theta,\\phi)$ with 6D Lagrangian\n\n", "index": 21, "text": "\\begin{equation}\n  \\label{eq:6}\n  {\\cal L}_\\Phi=\\Phi\\partial_\\mu \\partial^\\mu \\Phi + \\Phi\\Delta_{S^2}\\Phi-m_\\Phi^2 \\Phi\\Phi\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{\\Phi}=\\Phi\\partial_{\\mu}\\partial^{\\mu}\\Phi+\\Phi\\Delta_{S^{2}}\\Phi-m_%&#10;{\\Phi}^{2}\\Phi\\Phi\\,.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi mathvariant=\"normal\">Φ</mi></msub><mo>=</mo><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msup><mo>∂</mo><mi>μ</mi></msup></mrow><mo>⁡</mo><mi mathvariant=\"normal\">Φ</mi></mrow></mrow><mo>+</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Δ</mi><msup><mi>S</mi><mn>2</mn></msup></msub><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow></mrow><mo>-</mo><mrow><msubsup><mi>m</mi><mi mathvariant=\"normal\">Φ</mi><mn>2</mn></msubsup><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">Φ</mi></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhich allows to write the 4D-reduced Lagrangian\n\n", "itemtype": "equation", "pos": 29897, "prevtext": "\nThe Laplace--Beltrami operator is diagonal in the spherical harmonics basis, so we can expand\n\n", "index": 23, "text": "\\begin{equation}\n  \\label{eq:7}\n  \\Phi(x^\\mu,\\theta,\\phi)=\\sum_{lm} \\frac{\\Phi_{lm}(x^\\mu) }{R}Y_{lm}(\\theta,\\phi)\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\Phi(x^{\\mu},\\theta,\\phi)=\\sum_{lm}\\frac{\\Phi_{lm}(x^{\\mu})}{R}Y_{lm}(\\theta,%&#10;\\phi)\\,,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mi>μ</mi></msup><mo>,</mo><mi>θ</mi><mo>,</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></munder><mrow><mfrac><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mi>μ</mi></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mi>R</mi></mfrac><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><mi>ϕ</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\subsection{Gauge bosons on a sphere}\nThe description of the properties of spin-1 gauge bosons can be obtained in a way, which is very similar to the derivation for the scalars.\nAt the same time some differences are crucial in terms of applications to phenomenology and model building, as discussed in the following.\n\n\\subsubsection{Degrees of freedom}\nAs usual for gauge bosons in extra-dimensional theories, the gauge field $A_M$ breaks into two parts: a 4D vector spanning the 4 components \npointing into ordinary space-time directions, and 4D scalar fields pointing along the extra space. In the KK expansion, the scalar fields contain both Goldstone bosons for the massive vectors\nin the Kaluza-Klein expansion, and physical scalars. \nThe connection between the components $A_{\\theta,\\phi}$ and the physical degrees of freedom, however, requires a non-trivial redefinition of the fields, unlike in the flat case.\nWe use the following redefinitions \\cite{Dohi2014}:\n\n", "itemtype": "equation", "pos": 30078, "prevtext": "\nwhich allows to write the 4D-reduced Lagrangian\n\n", "index": 25, "text": "\\begin{equation}\n  \\label{eq:8}\n  \\begin{array}{rl}\n    {\\cal L}_{\\Phi 4D} &= R^2\\int d\\Omega {\\cal L}_\\Phi\\\\\n&= \\displaystyle\\sum_{lm} \\Phi_{lm}^\\dagger\\partial_\\mu \\partial^\\mu \\Phi_{lm} -\n\\left(m_\\Phi^2+l(l+1)\\right) \\Phi^\\dagger_{lm} \\Phi_{lm}\\,.\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rl}{\\cal L}_{\\Phi 4D}&amp;=R^{2}\\int d\\Omega{\\cal L}_{\\Phi}\\\\&#10;&amp;=\\displaystyle\\sum_{lm}\\Phi_{lm}^{\\dagger}\\partial_{\\mu}\\partial^{\\mu}\\Phi_{%&#10;lm}-\\left(m_{\\Phi}^{2}+l(l+1)\\right)\\Phi^{\\dagger}_{lm}\\Phi_{lm}\\,.\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msub></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>=</mo><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mo>𝑑</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi mathvariant=\"normal\">Φ</mi></msub></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></munder><mrow><msubsup><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msup><mo>∂</mo><mi>μ</mi></msup></mrow><mo>⁡</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow></mrow></mrow><mo>-</mo><mrow><mrow><mo>(</mo><mrow><msubsup><mi>m</mi><mi mathvariant=\"normal\">Φ</mi><mn>2</mn></msubsup><mo>+</mo><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow><mo>†</mo></msubsup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nAs we shall see from the Lagrangian, $\\Phi$ is the physical scalar that will remain in the\nspectrum, while $\\Theta$ is a Goldstone boson, whose KK levels will be\neaten by the corresponding levels of the vector to give them mass. \n\n\\subsubsection{Gauge fixing}\n\nAs in standard gauge theories, we need a gauge fixing part for the\nLagrangian. The usual Feynman-t'Hooft part is present to fix the gauge\nof the 4D massless vector, while the rest is determined to eliminate\nthe mixing between the vector and scalar parts in the quadratic\nLagrangian \\cite{Maru2010, Dohi2014}:\n\n", "itemtype": "equation", "pos": 31329, "prevtext": "\n\n\\subsection{Gauge bosons on a sphere}\nThe description of the properties of spin-1 gauge bosons can be obtained in a way, which is very similar to the derivation for the scalars.\nAt the same time some differences are crucial in terms of applications to phenomenology and model building, as discussed in the following.\n\n\\subsubsection{Degrees of freedom}\nAs usual for gauge bosons in extra-dimensional theories, the gauge field $A_M$ breaks into two parts: a 4D vector spanning the 4 components \npointing into ordinary space-time directions, and 4D scalar fields pointing along the extra space. In the KK expansion, the scalar fields contain both Goldstone bosons for the massive vectors\nin the Kaluza-Klein expansion, and physical scalars. \nThe connection between the components $A_{\\theta,\\phi}$ and the physical degrees of freedom, however, requires a non-trivial redefinition of the fields, unlike in the flat case.\nWe use the following redefinitions \\cite{Dohi2014}:\n\n", "index": 27, "text": "\\begin{align}\n\\label{eq:9}\n\\tilde A_{\\theta} & = \\frac{A_{\\theta}}{R}\\,, & \\tilde{A}_\\phi & =  \\frac{A_\\phi}{R\\sin\\theta}\\,,  & & \\nonumber \\\\\nA_\\pm &= \\frac{1}{\\sqrt{2}}(\\tilde A_\\theta \\pm i\\tilde{A_\\phi})\\,, & \\tilde A_\\theta\n&=  \\frac{1}{\\sqrt{2}}(A_+ + A_-)\\,, & \\tilde A_\\phi&\n=  \\frac{1}{\\sqrt{2}i}(A_+ - A_-)\\,, \\nonumber \\\\\nA_+&=A_-^\\dagger\\,, & A_+ &= -i \\eth \\Xi^\\dagger\\,, & \\Xi &= \\frac{1}{\\sqrt{2}}(\\Phi + i\\Theta) \\,.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tilde{A}_{\\theta}\" display=\"inline\"><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">~</mo></mover><mi>θ</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{A_{\\theta}}{R}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><msub><mi>A</mi><mi>θ</mi></msub><mi>R</mi></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tilde{A}_{\\phi}\" display=\"inline\"><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">~</mo></mover><mi>ϕ</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m4\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{A_{\\phi}}{R\\sin\\theta}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mpadded width=\"+1.7pt\"><mstyle displaystyle=\"true\"><mfrac><msub><mi>A</mi><mi>ϕ</mi></msub><mrow><mi>R</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac></mstyle></mpadded></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A_{\\pm}\" display=\"inline\"><msub><mi>A</mi><mo>±</mo></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{\\sqrt{2}}(\\tilde{A}_{\\theta}\\pm i\\tilde{A_{\\phi}})\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><msqrt><mn>2</mn></msqrt></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">~</mo></mover><mi>θ</mi></msub><mo>±</mo><mrow><mi>i</mi><mo>⁢</mo><mover accent=\"true\"><msub><mi>A</mi><mi>ϕ</mi></msub><mo stretchy=\"false\">~</mo></mover></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tilde{A}_{\\theta}\" display=\"inline\"><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">~</mo></mover><mi>θ</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m4\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{\\sqrt{2}}(A_{+}+A_{-})\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><msqrt><mn>2</mn></msqrt></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>A</mi><mo>+</mo></msub><mo>+</mo><msub><mi>A</mi><mo>-</mo></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m5\" class=\"ltx_Math\" alttext=\"\\displaystyle\\tilde{A}_{\\phi}\" display=\"inline\"><msub><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">~</mo></mover><mi>ϕ</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m6\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{\\sqrt{2}i}(A_{+}-A_{-})\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><mi>i</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>A</mi><mo>+</mo></msub><mo>-</mo><msub><mi>A</mi><mo>-</mo></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A_{+}\" display=\"inline\"><msub><mi>A</mi><mo>+</mo></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=A_{-}^{\\dagger}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mpadded width=\"+1.7pt\"><msubsup><mi>A</mi><mo>-</mo><mo>†</mo></msubsup></mpadded></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle A_{+}\" display=\"inline\"><msub><mi>A</mi><mo>+</mo></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m4\" class=\"ltx_Math\" alttext=\"\\displaystyle=-i\\eth\\Xi^{\\dagger}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">Ξ</mi><mo>†</mo></msup></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m5\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Xi\" display=\"inline\"><mi mathvariant=\"normal\">Ξ</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m6\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{1}{\\sqrt{2}}(\\Phi+i\\Theta)\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><msqrt><mn>2</mn></msqrt></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Φ</mi><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><mi mathvariant=\"normal\">Θ</mi></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhere\n\n", "itemtype": "equation", "pos": 32344, "prevtext": "\nAs we shall see from the Lagrangian, $\\Phi$ is the physical scalar that will remain in the\nspectrum, while $\\Theta$ is a Goldstone boson, whose KK levels will be\neaten by the corresponding levels of the vector to give them mass. \n\n\\subsubsection{Gauge fixing}\n\nAs in standard gauge theories, we need a gauge fixing part for the\nLagrangian. The usual Feynman-t'Hooft part is present to fix the gauge\nof the 4D massless vector, while the rest is determined to eliminate\nthe mixing between the vector and scalar parts in the quadratic\nLagrangian \\cite{Maru2010, Dohi2014}:\n\n", "index": 29, "text": "\\begin{equation}\n  \\label{eq:10}\n  {\\cal L}_{gf}=\\frac{1}{\\xi}tr(f^2)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{gf}=\\frac{1}{\\xi}tr(f^{2})\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>g</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mi>ξ</mi></mfrac><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>f</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\subsubsection{Equations of motion and expansion}\n\nUsing these definitions, we can write the quadratic 6D Lagrangian for\nthe vector component:\n\n", "itemtype": "equation", "pos": 32435, "prevtext": "\nwhere\n\n", "index": 31, "text": "\\begin{equation}\n  \\label{eq:11}\n  f=\\eta^{\\mu\\nu} \\partial_\\mu A^\\nu +\n  \\frac{\\xi}{R^2\\sin\\theta}\\partial_\\theta \\sin\\theta A_\\theta +\n  \\frac{\\xi}{R^2\\sin^2\\theta}\\partial_\\phi A_\\phi\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"f=\\eta^{\\mu\\nu}\\partial_{\\mu}A^{\\nu}+\\frac{\\xi}{R^{2}\\sin\\theta}\\partial_{%&#10;\\theta}\\sin\\theta A_{\\theta}+\\frac{\\xi}{R^{2}\\sin^{2}\\theta}\\partial_{\\phi}A_{%&#10;\\phi}\\,.\" display=\"block\"><mrow><mrow><mi>f</mi><mo>=</mo><mrow><mrow><msup><mi>η</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msup><mi>A</mi><mi>ν</mi></msup></mrow></mrow><mo>+</mo><mrow><mfrac><mi>ξ</mi><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac><mo>⁢</mo><mrow><mrow><msub><mo>∂</mo><mi>θ</mi></msub><mo>⁡</mo><mi>sin</mi></mrow><mo>⁡</mo><mrow><mi>θ</mi><mo>⁢</mo><msub><mi>A</mi><mi>θ</mi></msub></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mi>ξ</mi><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>ϕ</mi></msub><mo>⁡</mo><mpadded width=\"+1.7pt\"><msub><mi>A</mi><mi>ϕ</mi></msub></mpadded></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nand for the scalars:\n\n", "itemtype": "equation", "pos": 32784, "prevtext": "\n\n\\subsubsection{Equations of motion and expansion}\n\nUsing these definitions, we can write the quadratic 6D Lagrangian for\nthe vector component:\n\n", "index": 33, "text": "\\begin{equation}\n  \\label{eq:12}\n  {\\cal L}_{A^\\mu}=A_\\mu \\left[ \\eta^{\\mu\\nu} \\left(\\Box +\n    \\frac{1}{R^2}\\phantom{a\\hspace{-0.5em}}_{1\\hspace{-0.1em}}\\bar\\eth \\phantom{a\\hspace{-0.5em}}_{0\\hspace{-0.1em}}\\eth\\right) - \\left(1-\\frac{1}{\\xi}\\right)\\partial^\\mu\\partial^\\nu\\right]A_\\nu\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{A^{\\mu}}=A_{\\mu}\\left[\\eta^{\\mu\\nu}\\left(\\Box+\\frac{1}{R^{2}}%&#10;\\phantom{a\\hskip-5.0pt}_{1\\hskip-1.0pt}\\bar{\\eth}\\phantom{a\\hskip-5.0pt}_{0%&#10;\\hskip-1.0pt}\\eth\\right)-\\left(1-\\frac{1}{\\xi}\\right)\\partial^{\\mu}\\partial^{%&#10;\\nu}\\right]A_{\\nu}\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msup><mi>A</mi><mi>μ</mi></msup></msub><mo>=</mo><mrow><msub><mi>A</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msup><mi>η</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>+</mo><mrow><msub><mfrac><mn>1</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac><mpadded width=\"-1pt\"><mn>1</mn></mpadded></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mn>0</mn></mpadded></msub><mo>⁢</mo><mi>ð</mi></mrow></mrow><mo>)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mn>1</mn><mi>ξ</mi></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><msup><mo>∂</mo><mi>μ</mi></msup><mo>⁡</mo><msup><mo>∂</mo><mi>ν</mi></msup></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>A</mi><mi>ν</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nthus confirming that $\\Theta$ is a Goldstone boson. The Penrose-Newman\noperators appearing in this decomposition show that the expansion for\nboth types of fields has to be in terms of usual spherical harmonics.\n\n", "itemtype": "equation", "pos": 33107, "prevtext": "\nand for the scalars:\n\n", "index": 35, "text": "\\begin{equation}\n  \\label{spectra:eq:13}\n  {\\cal L}_{\\Phi,\\Theta} = \\Phi\\;\n  \\phantom{a\\hspace{-0.5em}}_{1\\hspace{-0.1em}}\\bar\\eth\n  \\phantom{a\\hspace{-0.5em}}_{0\\hspace{-0.1em}}\\eth \\left( \\Box -\n    \\frac{1}{R^2}\\phantom{a\\hspace{-0.5em}}_{1\\hspace{-0.1em}}\\bar\\eth\n    \\phantom{a\\hspace{-0.5em}}_{0\\hspace{-0.1em}}\\eth\\right)\\Phi +\n  \\Theta\\; \\phantom{a\\hspace{-0.5em}}_{1\\hspace{-0.1em}}\\bar\\eth\n  \\phantom{a\\hspace{-0.5em}}_{0\\hspace{-0.1em}}\\eth \\left( \\Box - \\frac{\\xi}{R^2}\\phantom{a\\hspace{-0.5em}}_{1\\hspace{-0.1em}}\\bar\\eth \\phantom{a\\hspace{-0.5em}}_{0\\hspace{-0.1em}}\\eth\\right)\\Theta \\; ;\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{\\Phi,\\Theta}=\\Phi\\;\\phantom{a\\hskip-5.0pt}_{1\\hskip-1.0pt}\\bar{\\eth}%&#10;\\phantom{a\\hskip-5.0pt}_{0\\hskip-1.0pt}\\eth\\left(\\Box-\\frac{1}{R^{2}}\\phantom{%&#10;a\\hskip-5.0pt}_{1\\hskip-1.0pt}\\bar{\\eth}\\phantom{a\\hskip-5.0pt}_{0\\hskip-1.0pt%&#10;}\\eth\\right)\\Phi+\\Theta\\;\\phantom{a\\hskip-5.0pt}_{1\\hskip-1.0pt}\\bar{\\eth}%&#10;\\phantom{a\\hskip-5.0pt}_{0\\hskip-1.0pt}\\eth\\left(\\Box-\\frac{\\xi}{R^{2}}%&#10;\\phantom{a\\hskip-5.0pt}_{1\\hskip-1.0pt}\\bar{\\eth}\\phantom{a\\hskip-5.0pt}_{0%&#10;\\hskip-1.0pt}\\eth\\right)\\Theta\\;;\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi mathvariant=\"normal\">Φ</mi><mo>,</mo><mi mathvariant=\"normal\">Θ</mi></mrow></msub><mo>=</mo><mrow><mrow><msub><mpadded width=\"+2.8pt\"><mi mathvariant=\"normal\">Φ</mi></mpadded><mpadded width=\"-1pt\"><mn>1</mn></mpadded></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mn>0</mn></mpadded></msub><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mrow><msub><mfrac><mn>1</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac><mpadded width=\"-1pt\"><mn>1</mn></mpadded></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mn>0</mn></mpadded></msub><mo>⁢</mo><mi>ð</mi></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Φ</mi></mrow><mo>+</mo><mrow><msub><mpadded width=\"+2.8pt\"><mi mathvariant=\"normal\">Θ</mi></mpadded><mpadded width=\"-1pt\"><mn>1</mn></mpadded></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mn>0</mn></mpadded></msub><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mrow><msub><mfrac><mi>ξ</mi><msup><mi>R</mi><mn>2</mn></msup></mfrac><mpadded width=\"-1pt\"><mn>1</mn></mpadded></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mpadded width=\"-1pt\"><mn>0</mn></mpadded></msub><mo>⁢</mo><mi>ð</mi></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi mathvariant=\"normal\">Θ</mi></mpadded></mrow></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nThere is no zero mode for the scalar due to the extra operator in the Lagrangian. For both physical fields, the masses of level $(l,m)$ are equal to $\\sqrt{l(l+1)}$ in units of the radius $R$.\n\n\\subsection{Spectra on $S^2/S_4$}\n\n\\begin{figure}[!tb]\n  \\centering\n\\includegraphics[width=0.7\\textwidth]{S2S4rot}\n  \\caption{Representation of $S^2/S_4$ as a fundamental domain on\n    $S^2$ with boundary conditions in green - using standard\n    nomenclature for $\\mathbb{R}^2$ orbifolds \\cite{Nilse2006, Cacciapaglia:2009pa}. The fixed point\n    (orbit of the North and South poles) is shown in red. This\n  figure helps illustrate that the residual $U(1)$ symmetry of the\n  orbifold is in fact $\\phi$ translational invariance, which is\n  suggested in purple arrows}\n\\label{fig:S2S4rot}\n\\end{figure}\n\n\nHaving summarised the KK decomposition on a sphere, we now turn to the study of how the spectrum is modified on the orbifold $S^2/S_{2n}$.\nThis class of orbifolds has a single generator, and the projection consists in identifying the points $(\\theta, \\phi) \\sim G (\\theta, \\phi)$.\nThe orbifolding group generator is the following\n\n", "itemtype": "equation", "pos": 33936, "prevtext": "\nthus confirming that $\\Theta$ is a Goldstone boson. The Penrose-Newman\noperators appearing in this decomposition show that the expansion for\nboth types of fields has to be in terms of usual spherical harmonics.\n\n", "index": 37, "text": "\\begin{equation}\n  \\label{eq:14}\n  \\begin{array}{rl}\n    A_\\mu &=\\displaystyle \\sum_{lm} \\frac{A_{\\mu lm}}{R} Y_{lm}\\,,\\\\\n    \\Phi &=\\displaystyle \\sum_{l>0,m} \\frac{\\Phi_{ lm}}{R\\sqrt{l(l+1)}} Y_{lm}\\,,\\\\\n    \\Theta&= \\displaystyle\\sum_{l>0,m} \\frac{\\Theta_{lm}}{R\\sqrt{l(l+1)}} Y_{lm}\\,.\\\\\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rl}A_{\\mu}&amp;=\\displaystyle\\sum_{lm}\\frac{A_{\\mu lm}}{R}Y_{lm}\\,%&#10;,\\\\&#10;\\Phi&amp;=\\displaystyle\\sum_{l&gt;0,m}\\frac{\\Phi_{lm}}{R\\sqrt{l(l+1)}}Y_{lm}\\,,\\\\&#10;\\Theta&amp;=\\displaystyle\\sum_{l&gt;0,m}\\frac{\\Theta_{lm}}{R\\sqrt{l(l+1)}}Y_{lm}\\,.\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><msub><mi>A</mi><mi>μ</mi></msub></mtd><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></munder><mrow><mfrac><msub><mi>A</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mi>R</mi></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mi mathvariant=\"normal\">Φ</mi></mtd><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>&gt;</mo><mrow><mn>0</mn><mo>,</mo><mi>m</mi></mrow></mrow></munder><mrow><mfrac><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mrow><mi>R</mi><mo>⁢</mo><msqrt><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt></mrow></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mi mathvariant=\"normal\">Θ</mi></mtd><mtd columnalign=\"left\"><mrow><mrow><mi/><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>&gt;</mo><mrow><mn>0</mn><mo>,</mo><mi>m</mi></mrow></mrow></munder><mrow><mfrac><msub><mi mathvariant=\"normal\">Θ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mrow><mi>R</mi><mo>⁢</mo><msqrt><mrow><mi>l</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msqrt></mrow></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nand one can define the fundamental domain as shown in Figure \\ref{fig:S2S4rot}.\n\n\n\n\n\n\n\n\n\n\n\n\nThen we can easily figure out the behaviour of $Y_{lm}$ under $G$ as\n$Y_{lm}$ has parity $l$ and depends on $\\phi$ as $e^{im\\phi}$: thus we have\n\n", "itemtype": "equation", "pos": 35383, "prevtext": "\nThere is no zero mode for the scalar due to the extra operator in the Lagrangian. For both physical fields, the masses of level $(l,m)$ are equal to $\\sqrt{l(l+1)}$ in units of the radius $R$.\n\n\\subsection{Spectra on $S^2/S_4$}\n\n\\begin{figure}[!tb]\n  \\centering\n\\includegraphics[width=0.7\\textwidth]{S2S4rot}\n  \\caption{Representation of $S^2/S_4$ as a fundamental domain on\n    $S^2$ with boundary conditions in green - using standard\n    nomenclature for $\\mathbb{R}^2$ orbifolds \\cite{Nilse2006, Cacciapaglia:2009pa}. The fixed point\n    (orbit of the North and South poles) is shown in red. This\n  figure helps illustrate that the residual $U(1)$ symmetry of the\n  orbifold is in fact $\\phi$ translational invariance, which is\n  suggested in purple arrows}\n\\label{fig:S2S4rot}\n\\end{figure}\n\n\nHaving summarised the KK decomposition on a sphere, we now turn to the study of how the spectrum is modified on the orbifold $S^2/S_{2n}$.\nThis class of orbifolds has a single generator, and the projection consists in identifying the points $(\\theta, \\phi) \\sim G (\\theta, \\phi)$.\nThe orbifolding group generator is the following\n\n", "index": 39, "text": "\\begin{equation}\nG\\left\\{\n\\begin{aligned}\n\\theta&\\rightarrow\\pi-\\theta\\\\\n\\phi&\\rightarrow\\phi+\\pi\\left(1+\\frac{1}{n}\\right) \n\\end{aligned}\n\\right.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"G\\left\\{\\begin{aligned} \\displaystyle\\theta&amp;\\displaystyle\\rightarrow\\pi-\\theta%&#10;\\\\&#10;\\displaystyle\\phi&amp;\\displaystyle\\rightarrow\\phi+\\pi\\left(1+\\frac{1}{n}\\right)%&#10;\\end{aligned}\\right.\" display=\"block\"><mrow><mi>G</mi><mrow><mo>{</mo><mtable columnspacing=\"0pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mi>θ</mi></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>→</mo><mrow><mi>π</mi><mo>-</mo><mi>θ</mi></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mi>ϕ</mi></mtd><mtd columnalign=\"left\"><mrow><mi/><mo>→</mo><mrow><mi>ϕ</mi><mo>+</mo><mrow><mi>π</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><mfrac><mn>1</mn><mi>n</mi></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nFor a field $\\Psi$, the orbifolding condition can be written in\ngeneral as $G_\\Psi\\Psi(x,G\\Omega)=\\Psi(x,\\Omega)$ where\n$G_\\Psi$ is the representation of $G$ acting on $\\Psi$. If we impose\nthat the representation of $G$ is trivial for 6D scalars and gauge\nvectors, i.e. $G_\\Psi = 1$, then the modes $(l,m)$ that survive the orbifolding are:\n\\begin{itemize}\n\\item $l$ even: $\\frac{m}{n}$ is an even integer so $m=0,2n,4n,...$\n\\item $l$ odd: $\\frac{m}{n}$ is an odd integer so $m=n,3n,...$\n\\end{itemize}\nNote that a zero mode $(l,m) = (0,0)$ is consistent. This expansion is valid for the scalar (Higgs), and for spin-1 states.\nFor the scalar components of gauge vectors, the constraint that the field transforms as a 6D vector, imposes that the transformation of the scalar components are\n\n$G_A A_\\theta = - A_\\theta$ and $G_A A_\\phi=A_\\phi$, which trickles\ndown to imposing that $\\Phi$ has the following expansion:\n\\begin{itemize}\n\\item $l$ even: $\\frac{m}{n}$ is an odd integer so $m=n,3n,...$ \n\\item $l$ odd: $\\frac{m}{n}$ is an even integer so $m=0,2n,4n,...$\n\\end{itemize}\nIn the case $n=2$, which we will study in detail, this means that the first level $l=1$ only contains gauge scalars with $m=0$ and the next level is $l=2$, with gauge vectors and scalar fields at $m=0$, and gauge scalars at $m=\\pm 2$.\n\n\\section{The Lightest Rotating Particle}\n\\label{dmlevel}\n\n\n\nAs we have stated in Section \\ref{orbifolds}, we are interested in the\norbifold $S^2/S_4$ for our model because of its geometric\nfeatures. Indeed, we found that besides its single fixed point, there\nis a residual global $U(1)$ symmetry of this space. Due to Noether's Theorem,\nthis symmetry is associated with a quantum number that is conserved,\nwhich in turn means that the lightest state with the lowest non-zero value of\nthis quantum number will be stable.\n\nAs we show in Figure \\ref{fig:S2S4rot}, the residual symmetry, expressed\nin usual spherical coordinates, is simply $\\phi$ translational\ninvariance, which is directly associated to the angular momentum\nquantum number $m$. The other quantum number $l$, is not conserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\paragraph{How $l$ non-conservation appears:} the breaking of the full\nangular momentum conservation on the sphese is not completely obvious. Indeed, at\ntree level, due to the expansion in spherical harmonics, there seems\nto be the same selection rules as in the full $S^2$ case. At one loop\nhowever, the renormalisation of the theory requires localised\noperators to appear as counter--terms on the fixed point, which will affect Kaluza-Klein\nmodes in a $l$-dependent way and break $l$-selection rules.\nAdditional terms that do not conserve $l$ are due to non-local, finite, loop effects\ngenerated by non-contractible orbits on the orbifold.\n\n\\paragraph{The Dark Matter level:} we have shown that the lightest\nstate with non-zero $m$ is automatically stable from Noether's\ntheorem. Therefore, from the discussion of Section \\ref{spectra}, the\nLRP (Lightest Rotating Particle, i.e. our Dark Matter candidate) will be a scalar gauge boson in level $(2,\\pm 2)$. In the next\nsections, we will show that, to a good approximation, the lightest\nstate is the scalar excitation of the photon field, which is consistent with\nthe basic expectation of a neutral dark matter candidate.\n\n\\paragraph{Bulk fields:} to obtain a realistic model, only the electroweak gauge bosons and the scalar field inducing electroweak symmetry breaking will be allowed to propagate in the bulk. Fermions are localised on the fixed points in order to be chiral, while the gluon field is localise to avoid the presence of a stable coloured scalar in the spectrum. In fact, the only sector that connects gluon fields to the electroweak bosons are quarks: being localised, quark do not couple to the scalars in the DM level, and thus they cannot induce decays of the scalar gluon to the Dark Matter candidate. \n\n\n\\subsection{Quadratic Lagrangian for level $(2,\\pm 2)$ gauge scalars}\n\n\n\n\n\nThe levels $(2, \\pm2)$ in our model only contain scalar gauge fields. In the KK\nexpansion, one would therefore expect one scalar state in each level, and with equal mass.\nIn fact, the two levels $(2,\\pm 2)$ are related by charge conjugation: since\n$Y_{2,2}^\\dagger = Y_{2,-2}$, we also have $\\Phi_{2,2}^\\dagger=\\Phi_{2,-2}$. \nIn other words, for each generator of the gauge group in the bulk, there are 2 real scalars\nwhich form a complex scalar charged under the global $U(1)$. The global symmetry, therefore, acts as a rotation on the two degenerate levels ($O(2)$). This is in fact true for any tier with non-vanishing $m$.\n\nThe physical part of a gauge scalar's\nkinetic lagrangian is given in Equation \\ref{spectra:eq:13}:\n\n", "itemtype": "equation", "pos": 35782, "prevtext": "\nand one can define the fundamental domain as shown in Figure \\ref{fig:S2S4rot}.\n\n\n\n\n\n\n\n\n\n\n\n\nThen we can easily figure out the behaviour of $Y_{lm}$ under $G$ as\n$Y_{lm}$ has parity $l$ and depends on $\\phi$ as $e^{im\\phi}$: thus we have\n\n", "index": 41, "text": "\\begin{equation}\nY_{lm}(G\\Omega) = (-1)^lY_{lm}(\\Omega)e^{im\\pi/n}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"Y_{lm}(G\\Omega)=(-1)^{l}Y_{lm}(\\Omega)e^{im\\pi/n}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>G</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mi>l</mi></msup><mo>⁢</mo><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mrow><mrow><mi>i</mi><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>π</mi></mrow><mo>/</mo><mi>n</mi></mrow></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nWhere $\\Phi_{2,2}=\\frac{\\varphi}{\\sqrt{2}}$ is the physical definition\nfor a gauge scalar field in level $(2,\\pm 2)$ without mixing or\nsymmetry breaking.\n\nThe symmetries of the model also allow to write localised interactions on the fixed point: as we have argued above, such terms do not break the $U(1)$ protecting the Dark Matter candidate. Furthermore, localised operators are always required as counter--terms of the divergent 6D loops, thus they are necessary for a correct renormalisation of the theory.\n\n\\subsection{Mass splittings: electroweak and loop effects}\n\nNow that we have singled out which Kaluza-Klein tier will contain the dark matter candidate of our model, we need to find which field in this tier is actually the lightest, and will hence be stable. There are two sources of mass splitting for same-tier Kaluza-Klein particles: loop effects, which are usually dominant, and electroweak effects from the Higgs sector, which are most often negligible. In our case, however, the situation may be reversed as the dominant log-divergent contribution to the loop vanishes and one is left with subleading finite contributions.\n\n\\subsubsection{Electroweak symmetry breaking: tree-level spectrum}\nAt tree level, the only source of mass splitting among the $U(1)_Y$\nand $SU(2)_L$ fields is the Higgs mechanism. Let us first work out the electroweak symmetry breaking mechanism in this geometry.\n\n\n\\paragraph{Electroweak symmetry breaking.}\nThe 6D Higgs Lagrangian is defined as \n\n", "itemtype": "equation", "pos": 40563, "prevtext": "\nFor a field $\\Psi$, the orbifolding condition can be written in\ngeneral as $G_\\Psi\\Psi(x,G\\Omega)=\\Psi(x,\\Omega)$ where\n$G_\\Psi$ is the representation of $G$ acting on $\\Psi$. If we impose\nthat the representation of $G$ is trivial for 6D scalars and gauge\nvectors, i.e. $G_\\Psi = 1$, then the modes $(l,m)$ that survive the orbifolding are:\n\\begin{itemize}\n\\item $l$ even: $\\frac{m}{n}$ is an even integer so $m=0,2n,4n,...$\n\\item $l$ odd: $\\frac{m}{n}$ is an odd integer so $m=n,3n,...$\n\\end{itemize}\nNote that a zero mode $(l,m) = (0,0)$ is consistent. This expansion is valid for the scalar (Higgs), and for spin-1 states.\nFor the scalar components of gauge vectors, the constraint that the field transforms as a 6D vector, imposes that the transformation of the scalar components are\n\n$G_A A_\\theta = - A_\\theta$ and $G_A A_\\phi=A_\\phi$, which trickles\ndown to imposing that $\\Phi$ has the following expansion:\n\\begin{itemize}\n\\item $l$ even: $\\frac{m}{n}$ is an odd integer so $m=n,3n,...$ \n\\item $l$ odd: $\\frac{m}{n}$ is an even integer so $m=0,2n,4n,...$\n\\end{itemize}\nIn the case $n=2$, which we will study in detail, this means that the first level $l=1$ only contains gauge scalars with $m=0$ and the next level is $l=2$, with gauge vectors and scalar fields at $m=0$, and gauge scalars at $m=\\pm 2$.\n\n\\section{The Lightest Rotating Particle}\n\\label{dmlevel}\n\n\n\nAs we have stated in Section \\ref{orbifolds}, we are interested in the\norbifold $S^2/S_4$ for our model because of its geometric\nfeatures. Indeed, we found that besides its single fixed point, there\nis a residual global $U(1)$ symmetry of this space. Due to Noether's Theorem,\nthis symmetry is associated with a quantum number that is conserved,\nwhich in turn means that the lightest state with the lowest non-zero value of\nthis quantum number will be stable.\n\nAs we show in Figure \\ref{fig:S2S4rot}, the residual symmetry, expressed\nin usual spherical coordinates, is simply $\\phi$ translational\ninvariance, which is directly associated to the angular momentum\nquantum number $m$. The other quantum number $l$, is not conserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\paragraph{How $l$ non-conservation appears:} the breaking of the full\nangular momentum conservation on the sphese is not completely obvious. Indeed, at\ntree level, due to the expansion in spherical harmonics, there seems\nto be the same selection rules as in the full $S^2$ case. At one loop\nhowever, the renormalisation of the theory requires localised\noperators to appear as counter--terms on the fixed point, which will affect Kaluza-Klein\nmodes in a $l$-dependent way and break $l$-selection rules.\nAdditional terms that do not conserve $l$ are due to non-local, finite, loop effects\ngenerated by non-contractible orbits on the orbifold.\n\n\\paragraph{The Dark Matter level:} we have shown that the lightest\nstate with non-zero $m$ is automatically stable from Noether's\ntheorem. Therefore, from the discussion of Section \\ref{spectra}, the\nLRP (Lightest Rotating Particle, i.e. our Dark Matter candidate) will be a scalar gauge boson in level $(2,\\pm 2)$. In the next\nsections, we will show that, to a good approximation, the lightest\nstate is the scalar excitation of the photon field, which is consistent with\nthe basic expectation of a neutral dark matter candidate.\n\n\\paragraph{Bulk fields:} to obtain a realistic model, only the electroweak gauge bosons and the scalar field inducing electroweak symmetry breaking will be allowed to propagate in the bulk. Fermions are localised on the fixed points in order to be chiral, while the gluon field is localise to avoid the presence of a stable coloured scalar in the spectrum. In fact, the only sector that connects gluon fields to the electroweak bosons are quarks: being localised, quark do not couple to the scalars in the DM level, and thus they cannot induce decays of the scalar gluon to the Dark Matter candidate. \n\n\n\\subsection{Quadratic Lagrangian for level $(2,\\pm 2)$ gauge scalars}\n\n\n\n\n\nThe levels $(2, \\pm2)$ in our model only contain scalar gauge fields. In the KK\nexpansion, one would therefore expect one scalar state in each level, and with equal mass.\nIn fact, the two levels $(2,\\pm 2)$ are related by charge conjugation: since\n$Y_{2,2}^\\dagger = Y_{2,-2}$, we also have $\\Phi_{2,2}^\\dagger=\\Phi_{2,-2}$. \nIn other words, for each generator of the gauge group in the bulk, there are 2 real scalars\nwhich form a complex scalar charged under the global $U(1)$. The global symmetry, therefore, acts as a rotation on the two degenerate levels ($O(2)$). This is in fact true for any tier with non-vanishing $m$.\n\nThe physical part of a gauge scalar's\nkinetic lagrangian is given in Equation \\ref{spectra:eq:13}:\n\n", "index": 43, "text": "\\begin{equation}\n\\begin{array}{lll}\n\\mathcal{L} &= & \\int R^2 d\\Omega \\ \\Phi\\; \\hspace{0.01em}_1\\bar\\eth_0\\eth \\left( \\Box -\n  \\frac{\\hspace{0.01em}_1\\bar\\eth_0\\eth}{R^2}\\right) \\Phi \\ \\ni\\  + \\Phi_{2,-2}\\left( \\Box - \\frac{6}{R^2} \\right) \\Phi_{2,2} + \\Phi_{2,2}\\left( \\Box - \\frac{6}{R^2} \\right) \\Phi_{2,-2} \\\\\n & = &  \\Phi_{2,2}^\\dagger\\left( \\Box - \\frac{6}{R^2} \\right) \\Phi_{2,2} +\n \\Phi_{2,2}\\left( \\Box - \\frac{6}{R^2} \\right) \\Phi_{2,2}^\\dagger \\ =\\\n 2 \\Phi_{2,2}^\\dagger \\left( \\Box - \\frac{6}{R^2} \\right)\n\\Phi_{2,2} \\mathrm{\\ \\ }\\\\\n&= & \\varphi^\\dagger \\left( \\Box - \\frac{6}{R^2} \\right)  \\varphi\\\\\n\\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{lll}\\mathcal{L}&amp;=&amp;\\int R^{2}d\\Omega\\ \\Phi\\;\\hskip 0.1pt_{1}%&#10;\\bar{\\eth}_{0}\\eth\\left(\\Box-\\frac{\\hskip 0.1pt{}_{1}\\bar{\\eth}_{0}\\eth}{R^{2}%&#10;}\\right)\\Phi\\ \\ni\\ +\\Phi_{2,-2}\\left(\\Box-\\frac{6}{R^{2}}\\right)\\Phi_{2,2}+%&#10;\\Phi_{2,2}\\left(\\Box-\\frac{6}{R^{2}}\\right)\\Phi_{2,-2}\\\\&#10;&amp;=&amp;\\Phi_{2,2}^{\\dagger}\\left(\\Box-\\frac{6}{R^{2}}\\right)\\Phi_{2,2}+\\Phi_{2,2}%&#10;\\left(\\Box-\\frac{6}{R^{2}}\\right)\\Phi_{2,2}^{\\dagger}\\ =\\ 2\\Phi_{2,2}^{\\dagger%&#10;}\\left(\\Box-\\frac{6}{R^{2}}\\right)\\Phi_{2,2}\\mathrm{\\ \\ }\\\\&#10;&amp;=&amp;\\varphi^{\\dagger}\\left(\\Box-\\frac{6}{R^{2}}\\right)\\varphi\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi></mtd><mtd columnalign=\"left\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>𝑑</mo><mpadded width=\"+5pt\"><mi mathvariant=\"normal\">Ω</mi></mpadded></mrow><mo>⁢</mo><msub><mpadded width=\"+2.9pt\"><mi mathvariant=\"normal\">Φ</mi></mpadded><mn>1</mn></msub><mo>⁢</mo><msub><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mn>0</mn></msub><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mrow><mpadded lspace=\"0.1pt\" width=\"+0.1pt\"><mmultiscripts><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mn>0</mn><none/><mprescripts/><mn>1</mn><none/></mmultiscripts></mpadded><mo>⁢</mo><mi>ð</mi></mrow><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mpadded width=\"+5pt\"><mi mathvariant=\"normal\">Φ</mi></mpadded></mrow></mrow><mo rspace=\"7.5pt\">∋</mo><mrow><mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mrow><mo>-</mo><mn>2</mn></mrow></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow></msub></mrow></mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mrow><mo>-</mo><mn>2</mn></mrow></mrow></msub></mrow></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mrow><mrow><msubsup><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow><mo>†</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow></msub></mrow><mo>+</mo><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mpadded width=\"+5pt\"><msubsup><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow><mo>†</mo></msubsup></mpadded></mrow></mrow><mo>=</mo><mrow><mn> 2</mn><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow><mo>†</mo></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mrow><mn>2</mn><mo>,</mo><mn>2</mn></mrow></msub></mrow></mrow><mo separator=\"true\"> </mo></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mo>=</mo></mtd><mtd columnalign=\"left\"><mrow><msup><mi>φ</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mi mathvariant=\"normal\">□</mi><mo>-</mo><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mi>φ</mi></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nwhere $\\phi$ is a $SU(2)$ doublet:\n\n\n", "itemtype": "equation", "pos": 42693, "prevtext": "\nWhere $\\Phi_{2,2}=\\frac{\\varphi}{\\sqrt{2}}$ is the physical definition\nfor a gauge scalar field in level $(2,\\pm 2)$ without mixing or\nsymmetry breaking.\n\nThe symmetries of the model also allow to write localised interactions on the fixed point: as we have argued above, such terms do not break the $U(1)$ protecting the Dark Matter candidate. Furthermore, localised operators are always required as counter--terms of the divergent 6D loops, thus they are necessary for a correct renormalisation of the theory.\n\n\\subsection{Mass splittings: electroweak and loop effects}\n\nNow that we have singled out which Kaluza-Klein tier will contain the dark matter candidate of our model, we need to find which field in this tier is actually the lightest, and will hence be stable. There are two sources of mass splitting for same-tier Kaluza-Klein particles: loop effects, which are usually dominant, and electroweak effects from the Higgs sector, which are most often negligible. In our case, however, the situation may be reversed as the dominant log-divergent contribution to the loop vanishes and one is left with subleading finite contributions.\n\n\\subsubsection{Electroweak symmetry breaking: tree-level spectrum}\nAt tree level, the only source of mass splitting among the $U(1)_Y$\nand $SU(2)_L$ fields is the Higgs mechanism. Let us first work out the electroweak symmetry breaking mechanism in this geometry.\n\n\n\\paragraph{Electroweak symmetry breaking.}\nThe 6D Higgs Lagrangian is defined as \n\n", "index": 45, "text": "\\begin{equation}\n  \\label{eq:10}\n  {\\cal L}_H^{6D} = (D_M\\phi)^\\dagger (D^M\\phi) +\\mu_{6D}^2 \\phi^\\dagger \\phi - \\lambda_{6D}\n  (\\phi^\\dagger \\phi)^2\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{H}^{6D}=(D_{M}\\phi)^{\\dagger}(D^{M}\\phi)+\\mu_{6D}^{2}\\phi^{\\dagger}%&#10;\\phi-\\lambda_{6D}(\\phi^{\\dagger}\\phi)^{2}\" display=\"block\"><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mi>H</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msubsup><mo>=</mo><mrow><mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>D</mi><mi>M</mi></msub><mo>⁢</mo><mi>ϕ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>D</mi><mi>M</mi></msup><mo>⁢</mo><mi>ϕ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msubsup><mi>μ</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>ϕ</mi><mo>†</mo></msup><mo>⁢</mo><mi>ϕ</mi></mrow></mrow><mo>-</mo><mrow><msub><mi>λ</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>ϕ</mi><mo>†</mo></msup><mo>⁢</mo><mi>ϕ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThe Kaluza-Klein expansion is formulated in terms of spherical harmonics:\n\n", "itemtype": "equation", "pos": 42895, "prevtext": "\n\nwhere $\\phi$ is a $SU(2)$ doublet:\n\n\n", "index": 47, "text": "\\begin{equation}\n  \\label{eq:15}\n  \\phi = \\frac{1}{\\sqrt{2}}\\left( \n    \\begin{array}{c}\n      \\phi_1+i\\phi_2\\\\\n      v_{6D} + H + i\\phi_3\n    \\end{array}\n\\right)\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\phi=\\frac{1}{\\sqrt{2}}\\left(\\begin{array}[]{c}\\phi_{1}+i\\phi_{2}\\\\&#10;v_{6D}+H+i\\phi_{3}\\end{array}\\right)\\,.\" display=\"block\"><mrow><mrow><mi>ϕ</mi><mo>=</mo><mrow><mfrac><mn>1</mn><msqrt><mn>2</mn></msqrt></mfrac><mo>⁢</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ϕ</mi><mn>1</mn></msub><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ϕ</mi><mn>2</mn></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>v</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mo>+</mo><mi>H</mi><mo>+</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>ϕ</mi><mn>3</mn></msub></mrow></mrow></mtd></mtr></mtable><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThe vacuum expectation value of the field in the minimum energy state has to have a constant wavefunction to minimise kinetic energy, so its value is determined by the\nminimum of the potential as: \n\n", "itemtype": "equation", "pos": 43151, "prevtext": "\n\nThe Kaluza-Klein expansion is formulated in terms of spherical harmonics:\n\n", "index": 49, "text": "\\begin{equation}\n  \\label{eq:11}\n  \\phi(x^\\mu,\\Omega) = \\sum \\frac{Y_{lm}(\\Omega) }{R} \\phi_{lm}(x^\\mu)\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\phi(x^{\\mu},\\Omega)=\\sum\\frac{Y_{lm}(\\Omega)}{R}\\phi_{lm}(x^{\\mu})\\,.\" display=\"block\"><mrow><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mi>μ</mi></msup><mo>,</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mfrac><mrow><msub><mi>Y</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>R</mi></mfrac><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mi>μ</mi></msup><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nBecause the situation is the same as in the Standard Model in the lowest Kaluza-Klein mode $(0,0)$, we know what to expect in the Unitary gauge: the Higgs doublet will only contain one physical state, $H_{00}$, which is the Standard Model Higgs boson. In the higher modes, however, the situation is more complex as there are already Goldstone bosons for the excitations of the $W^\\pm$ and $Z$ bosons, coming from the gauge scalar levels. Counting degrees of freedom, it appears that there should be 4 physical scalar excitations per KK level which are a mixture of the Higgs and scalar gauge fields, and we can find their exact content by looking at the gauge-fixing Lagrangian to find mass eigenstates, as was done in \\cite{Cacciapaglia:2009pa}. \n\nThe gauge-fixing Lagrangian for the broken $SU(2)\\times U(1)$ is obtained by expanding on the pure Yang-Mills gauge-fixing term with the requirement that the quadratic terms mixing the Higgs field and gauge bosons be cancelled, yielding the expression:\n\n\n", "itemtype": "equation", "pos": 43472, "prevtext": "\n\nThe vacuum expectation value of the field in the minimum energy state has to have a constant wavefunction to minimise kinetic energy, so its value is determined by the\nminimum of the potential as: \n\n", "index": 51, "text": "\\begin{equation}\n  \\label{eq:12}\nv_{6D} = \\sqrt{\\frac{\\mu^2_{6D}}{2\\lambda_{6D}}}=\\frac{v_{4D}}{\\sqrt{4\\pi}R}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"v_{6D}=\\sqrt{\\frac{\\mu^{2}_{6D}}{2\\lambda_{6D}}}=\\frac{v_{4D}}{\\sqrt{4\\pi}R}\\,.\" display=\"block\"><mrow><mrow><msub><mi>v</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mo>=</mo><msqrt><mfrac><msubsup><mi>μ</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mrow><mn>2</mn><mo>⁢</mo><msub><mi>λ</mi><mrow><mn>6</mn><mo>⁢</mo><mi>D</mi></mrow></msub></mrow></mfrac></msqrt><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><msub><mi>v</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mrow><msqrt><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><mo>⁢</mo><mi>R</mi></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nwhere $a\\in \\left\\{ 1,2,3,Y\\right\\}$ and $gF_i^a=g_{(a)}F_{ij}^a\\left< {\\phi} \\right>^j$ is the the same matrix as in the typical $R_\\xi$ gauge-fixing in broken 4D gauge theories. The resulting Lagrangian terms can be sorted by their order in $\\xi$\n\n\\begin{itemize}\n\\item ${\\cal O}(\\xi^{-1})$: correction to the vector propagators that vanish in the unitary limit\n\\item ${\\cal O}(\\xi^{0})$: terms that kill mixed quadratic terms between the Higgs, gauge vectors and gauge scalars\n\\item ${\\cal O}(\\xi^{1})$: $\\xi$-dependent mass matrix that fixes which combination of the Higgs components and gauge scalars are Goldstone bosons and which are physical fields.\n\\end{itemize}\n\nThis matrix must be taken KK-level by KK-level and yields $l$-dependent admixtures of the two components in the physical state, which is its null vector. To give a simplified picture of this mixing, we show the mixing matrix in the case of an Abelian Higgs mechanism:\n\n\n", "itemtype": "equation", "pos": 44604, "prevtext": "\n\nBecause the situation is the same as in the Standard Model in the lowest Kaluza-Klein mode $(0,0)$, we know what to expect in the Unitary gauge: the Higgs doublet will only contain one physical state, $H_{00}$, which is the Standard Model Higgs boson. In the higher modes, however, the situation is more complex as there are already Goldstone bosons for the excitations of the $W^\\pm$ and $Z$ bosons, coming from the gauge scalar levels. Counting degrees of freedom, it appears that there should be 4 physical scalar excitations per KK level which are a mixture of the Higgs and scalar gauge fields, and we can find their exact content by looking at the gauge-fixing Lagrangian to find mass eigenstates, as was done in \\cite{Cacciapaglia:2009pa}. \n\nThe gauge-fixing Lagrangian for the broken $SU(2)\\times U(1)$ is obtained by expanding on the pure Yang-Mills gauge-fixing term with the requirement that the quadratic terms mixing the Higgs field and gauge bosons be cancelled, yielding the expression:\n\n\n", "index": 53, "text": "\\begin{align}\n{\\cal L}_{gf}=&-\\frac{1}{\\xi} tr(f^a f_a)\\\\\nf^a=& \\eta^{\\mu\\nu} \\partial_\\mu A_\\nu^a + \\frac{\\xi}{R^2 \\sin \\theta } \\partial_\\theta \\left( \\sin\\theta A_\\theta^a \\right) + \\frac{\\xi}{R^2 \\sin\\theta}\\partial_\\phi A_\\phi^a \\\\\n&-\\xi gF_i^a \\phi_i\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\cal L}_{gf}=\" display=\"inline\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>g</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle-\\frac{1}{\\xi}tr(f^{a}f_{a})\" display=\"inline\"><mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mi>ξ</mi></mfrac></mstyle><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>f</mi><mi>a</mi></msup><mo>⁢</mo><msub><mi>f</mi><mi>a</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle f^{a}=\" display=\"inline\"><mrow><msup><mi>f</mi><mi>a</mi></msup><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\eta^{\\mu\\nu}\\partial_{\\mu}A_{\\nu}^{a}+\\frac{\\xi}{R^{2}\\sin\\theta%&#10;}\\partial_{\\theta}\\left(\\sin\\theta A_{\\theta}^{a}\\right)+\\frac{\\xi}{R^{2}\\sin%&#10;\\theta}\\partial_{\\phi}A_{\\phi}^{a}\" display=\"inline\"><mrow><mrow><msup><mi>η</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>A</mi><mi>ν</mi><mi>a</mi></msubsup></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>ξ</mi><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>θ</mi></msub><mo>⁡</mo><mrow><mo>(</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mi>θ</mi><mo>⁢</mo><msubsup><mi>A</mi><mi>θ</mi><mi>a</mi></msubsup></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mi>ξ</mi><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mfrac></mstyle><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>ϕ</mi></msub><mo>⁡</mo><msubsup><mi>A</mi><mi>ϕ</mi><mi>a</mi></msubsup></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle-\\xi gF_{i}^{a}\\phi_{i}\" display=\"inline\"><mrow><mo>-</mo><mrow><mi>ξ</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><msubsup><mi>F</mi><mi>i</mi><mi>a</mi></msubsup><mo>⁢</mo><msub><mi>ϕ</mi><mi>i</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nwhere $\\zeta=vR$.\n\nThis matrix acts on the vector $(\\phi_0,\\Theta)^T$ where the first entry is the Higgs component whose zero mode is a Goldstone boson and the second entry is the imaginary part of the canonically normalised gauge scalar $\\Xi$.\n\nOne can note that $M^2_{gf}$ is of rank 1, showing indeed that one of its eigenvector is integrated out in the Unitary limit $\\xi\\rightarrow\\infty$ while the other does not get a $\\xi$-dependent mass and therefore is physical. A null vector of this matrix, corresponding to the physical state is \n\n\n", "itemtype": "equation", "pos": 45816, "prevtext": "\n\nwhere $a\\in \\left\\{ 1,2,3,Y\\right\\}$ and $gF_i^a=g_{(a)}F_{ij}^a\\left< {\\phi} \\right>^j$ is the the same matrix as in the typical $R_\\xi$ gauge-fixing in broken 4D gauge theories. The resulting Lagrangian terms can be sorted by their order in $\\xi$\n\n\\begin{itemize}\n\\item ${\\cal O}(\\xi^{-1})$: correction to the vector propagators that vanish in the unitary limit\n\\item ${\\cal O}(\\xi^{0})$: terms that kill mixed quadratic terms between the Higgs, gauge vectors and gauge scalars\n\\item ${\\cal O}(\\xi^{1})$: $\\xi$-dependent mass matrix that fixes which combination of the Higgs components and gauge scalars are Goldstone bosons and which are physical fields.\n\\end{itemize}\n\nThis matrix must be taken KK-level by KK-level and yields $l$-dependent admixtures of the two components in the physical state, which is its null vector. To give a simplified picture of this mixing, we show the mixing matrix in the case of an Abelian Higgs mechanism:\n\n\n", "index": 55, "text": "\\begin{equation}\nM^2_{gf}=\\frac{\\xi}{R^2}\\begin{pmatrix}g^2 \\zeta^2 & g\\zeta \\sqrt{l\\left(l+1\\right)} \\\\  g\\zeta \\sqrt{l\\left(l+1\\right)} & l\\left(l+1\\right)\n\\end{pmatrix}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"M^{2}_{gf}=\\frac{\\xi}{R^{2}}\\begin{pmatrix}g^{2}\\zeta^{2}&amp;g\\zeta\\sqrt{l\\left(l%&#10;+1\\right)}\\\\&#10;g\\zeta\\sqrt{l\\left(l+1\\right)}&amp;l\\left(l+1\\right)\\end{pmatrix}\" display=\"block\"><mrow><msubsup><mi>M</mi><mrow><mi>g</mi><mo>⁢</mo><mi>f</mi></mrow><mn>2</mn></msubsup><mo>=</mo><mrow><mfrac><mi>ξ</mi><msup><mi>R</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msup><mi>g</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>ζ</mi><mn>2</mn></msup></mrow></mtd><mtd columnalign=\"center\"><mrow><mi>g</mi><mo>⁢</mo><mi>ζ</mi><mo>⁢</mo><msqrt><mrow><mi>l</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></msqrt></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi>g</mi><mo>⁢</mo><mi>ζ</mi><mo>⁢</mo><msqrt><mrow><mi>l</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></msqrt></mrow></mtd><mtd columnalign=\"center\"><mrow><mi>l</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThe Higgs component in the Goldstone boson goes to zero at large $l$, which is expected due to the fact that the mass of the associated vector becomes very large compared to the Higgs vacuum expectation value. \nIn particular, already at $l=2$, which is the level of interest for this paper, the mixing is only 10\\% , for $1/R\\simeq v$ and $g=e$, which justifies treating $\\Theta$ completely as a Goldstone boson and keeping the Higgs components as physical.\n\nAs a result, the Higgs field has a zero mode behaving like the Standard Model Higgs field, with a constant expectation value and a neutral physical field. In the excited levels, besides the neutral field, there will be an extra neutral scalar and a charged scalar, which have the couplings of the Higgs extra-components since they have a negligible gauge-scalar component. \nTheir mass is however a free parameter: in fact, one can add a localised mass term for the scalar field and the way it affects the zero mode and the massive modes is different.\nIn other words, the mass of the KK excitations of the Higgs receive an additional additive contribution which is unrelated to the mass of the SM-like Higgs boson.\nWe will discuss the phenomenology of these states in the following sections and now turn to the mass contribution of the vacuum expectation value to the gauge boson masses.\n\n\\paragraph{Electroweak mass contribution to the gauge bosons.}\nAs we show in the Appendix \\ref{app:intlagrangian}, the quartic coupling of the Higgs field to\nthe $SU(2)$ and $U(1)$ gauge scalars has the same structure as the coupling to the Standard Model gauge bosons. It is therefore useful to\ndefine $\\varphi_W^\\pm = \\frac{\\varphi_{W_1} \\pm i\n  \\varphi_{W_2}}{\\sqrt{2}}$, $\\varphi_Z = \\cos \\theta_W \\varphi_{W_3}\n+ \\sin\\theta_W \\varphi_{B}$ and $\\varphi_A= -\\sin \\theta_W\n\\varphi_{W_3}+ \\cos\\theta_W \\varphi_{B}$. In this basis, the Higgs-induced mass Lagrangian is\n\n", "itemtype": "equation", "pos": 46548, "prevtext": "\n\nwhere $\\zeta=vR$.\n\nThis matrix acts on the vector $(\\phi_0,\\Theta)^T$ where the first entry is the Higgs component whose zero mode is a Goldstone boson and the second entry is the imaginary part of the canonically normalised gauge scalar $\\Xi$.\n\nOne can note that $M^2_{gf}$ is of rank 1, showing indeed that one of its eigenvector is integrated out in the Unitary limit $\\xi\\rightarrow\\infty$ while the other does not get a $\\xi$-dependent mass and therefore is physical. A null vector of this matrix, corresponding to the physical state is \n\n\n", "index": 57, "text": "\\begin{equation}\n\\begin{pmatrix} 1 \\\\ -\\frac{g\\zeta}{\\sqrt{l\\left(l+1\\right)}} \\end{pmatrix}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\begin{pmatrix}1\\\\&#10;-\\frac{g\\zeta}{\\sqrt{l\\left(l+1\\right)}}\\end{pmatrix}\\,.\" display=\"block\"><mrow><mpadded width=\"+1.7pt\"><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mo>-</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mi>g</mi><mo>⁢</mo><mi>ζ</mi></mrow><msqrt><mrow><mi>l</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>l</mi><mo>+</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></msqrt></mfrac></mstyle></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mpadded><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n(we use the same convention that the presence\n(absence) of bar means $m=-2$ ($m=2$) while the charge index is the\ncharge of the complete field).\nAs the structure of this mass term matches the one of the bulk mass, the spectrum can be described in terms of 4 complex fields: $\\varphi_W^+$ (and its complex conjugate $\\bar{\\varphi}_W^-$), $\\varphi_W^-$ (and $\\bar{\\varphi}_W^+$), $\\varphi_Z$ ($\\bar{\\varphi}_Z$), and $\\varphi_A$ ($\\bar{\\varphi}_A$), with masses:\n\n", "itemtype": "equation", "pos": 48576, "prevtext": "\n\nThe Higgs component in the Goldstone boson goes to zero at large $l$, which is expected due to the fact that the mass of the associated vector becomes very large compared to the Higgs vacuum expectation value. \nIn particular, already at $l=2$, which is the level of interest for this paper, the mixing is only 10\\% , for $1/R\\simeq v$ and $g=e$, which justifies treating $\\Theta$ completely as a Goldstone boson and keeping the Higgs components as physical.\n\nAs a result, the Higgs field has a zero mode behaving like the Standard Model Higgs field, with a constant expectation value and a neutral physical field. In the excited levels, besides the neutral field, there will be an extra neutral scalar and a charged scalar, which have the couplings of the Higgs extra-components since they have a negligible gauge-scalar component. \nTheir mass is however a free parameter: in fact, one can add a localised mass term for the scalar field and the way it affects the zero mode and the massive modes is different.\nIn other words, the mass of the KK excitations of the Higgs receive an additional additive contribution which is unrelated to the mass of the SM-like Higgs boson.\nWe will discuss the phenomenology of these states in the following sections and now turn to the mass contribution of the vacuum expectation value to the gauge boson masses.\n\n\\paragraph{Electroweak mass contribution to the gauge bosons.}\nAs we show in the Appendix \\ref{app:intlagrangian}, the quartic coupling of the Higgs field to\nthe $SU(2)$ and $U(1)$ gauge scalars has the same structure as the coupling to the Standard Model gauge bosons. It is therefore useful to\ndefine $\\varphi_W^\\pm = \\frac{\\varphi_{W_1} \\pm i\n  \\varphi_{W_2}}{\\sqrt{2}}$, $\\varphi_Z = \\cos \\theta_W \\varphi_{W_3}\n+ \\sin\\theta_W \\varphi_{B}$ and $\\varphi_A= -\\sin \\theta_W\n\\varphi_{W_3}+ \\cos\\theta_W \\varphi_{B}$. In this basis, the Higgs-induced mass Lagrangian is\n\n", "index": 59, "text": "\\begin{equation}\n  {\\cal L}_{m_{EW}} =   -\\frac{1}{8} g^2_{4D} v_{4D}^2 \\left[\n      \\bar \\varphi_W^+ \\varphi_W^- + \\bar\\varphi_W^- \\varphi_W^+ +\n      \\frac{\\bar\\varphi_Z \\varphi_Z}{cos^2 \\theta_W} \\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{m_{EW}}=-\\frac{1}{8}g^{2}_{4D}v_{4D}^{2}\\left[\\bar{\\varphi}_{W}^{+}%&#10;\\varphi_{W}^{-}+\\bar{\\varphi}_{W}^{-}\\varphi_{W}^{+}+\\frac{\\bar{\\varphi}_{Z}%&#10;\\varphi_{Z}}{cos^{2}\\theta_{W}}\\right]\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>m</mi><mrow><mi>E</mi><mo>⁢</mo><mi>W</mi></mrow></msub></msub><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>8</mn></mfrac><mo>⁢</mo><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>v</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow><mo>+</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>Z</mi></msub><mo>⁢</mo><msub><mi>φ</mi><mi>Z</mi></msub></mrow><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><msup><mi>s</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>θ</mi><mi>W</mi></msub></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThis mass term shows that the mass eigenstates after the Higgs\nmechanism, at tree level, are in fact determined by the same change of\nbasis as in the Standard Model and that the mass contributions induced\nare the same as the Standard Model corresponding gauge boson\nmasses. Hence at tree level, the photon scalar excitation is indeed\nthe dark matter candidate. \nNote that the mass splitting between the various states become very small in the limit of large radius, as they are proportional to the fixed value of the electroweak scale.\nThis picture may however be affected by large loop corrections, which are typically proportional to the bulk mass.\n\n\\subsubsection{Loop effects on the mass of $(2,\\pm 2)$ are small}\n\nIn extra-dimensional models, the discussion of the dark matter\ncandidate implies computing the spectrum correction at one loop\nbecause their effect largely dominates over electroweak effects\n\\cite{Cheng2002,Cacciapaglia2010}. We will however argue in this\nsection that the dominant loop mass splitting effects that could change the picture\ndisplayed in the discussion of electroweak effects are absent from\nlevel $(2,\\pm 2)$. Using a 6D picture, we can write the part of the Lagrangian that determines the masses of Kaluza-Klein gauge scalars:\n\n\n", "itemtype": "equation", "pos": 49259, "prevtext": "\n(we use the same convention that the presence\n(absence) of bar means $m=-2$ ($m=2$) while the charge index is the\ncharge of the complete field).\nAs the structure of this mass term matches the one of the bulk mass, the spectrum can be described in terms of 4 complex fields: $\\varphi_W^+$ (and its complex conjugate $\\bar{\\varphi}_W^-$), $\\varphi_W^-$ (and $\\bar{\\varphi}_W^+$), $\\varphi_Z$ ($\\bar{\\varphi}_Z$), and $\\varphi_A$ ($\\bar{\\varphi}_A$), with masses:\n\n", "index": 61, "text": "\\begin{equation}\nm_{\\varphi_W^+}^2 = m_{\\varphi_W^-}^2 = \\frac{6}{R^2} + m_W^2\\,, \\quad m_{\\varphi_Z}^2 = \\frac{6}{R^2} + m_Z^2\\,, \\quad m_{\\varphi_A}^2 = \\frac{6}{R^2}\\,. \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"m_{\\varphi_{W}^{+}}^{2}=m_{\\varphi_{W}^{-}}^{2}=\\frac{6}{R^{2}}+m_{W}^{2}\\,,%&#10;\\quad m_{\\varphi_{Z}}^{2}=\\frac{6}{R^{2}}+m_{Z}^{2}\\,,\\quad m_{\\varphi_{A}}^{2%&#10;}=\\frac{6}{R^{2}}\\,.\" display=\"block\"><mrow><mrow><mrow><msubsup><mi>m</mi><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup><mn>2</mn></msubsup><mo>=</mo><msubsup><mi>m</mi><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup><mn>2</mn></msubsup><mo>=</mo><mrow><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac><mo>+</mo><mpadded width=\"+1.7pt\"><msubsup><mi>m</mi><mi>W</mi><mn>2</mn></msubsup></mpadded></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><msubsup><mi>m</mi><msub><mi>φ</mi><mi>Z</mi></msub><mn>2</mn></msubsup><mo>=</mo><mrow><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac><mo>+</mo><mpadded width=\"+1.7pt\"><msubsup><mi>m</mi><mi>Z</mi><mn>2</mn></msubsup></mpadded></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msubsup><mi>m</mi><msub><mi>φ</mi><mi>A</mi></msub><mn>2</mn></msubsup><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mn>6</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThese terms have to be present and non-trivial to absorb all loop divergences appearing on the orbifold\\footnote{The origin of these terms is best understood in the so called ``winding mode representation\"  \\cite{DaRold2004,Cheng2002} in which the extra-dimensional part of propagators is expressed in position space. This representation is useful on orbifolds because it allows for an simple expression of the propagator in terms of the propagators on the base space: it is a sum over all the propagators between the elements of the orbit of the end- and start--point: $G_\\text{orb}(x,y)=\\sum G(M_1 x, M_2 y)$. The localised term generation is easily illustrated by a tadpole diagram $\\int dz G_\\text{orb}(x,z)G_\\text{orb}(z,z)G_\\text{orb}(z,y)$, which has a divergent part which is $\\sum\\int dz G(x,M_i z) G(M_1 z,M_1 z) G(M_j z, y)$ for points in the bulk. Fixed points however, have additional divergent terms with the same degree of divergence because some $M_1\\neq M_2$ verify $M_1 z_f = M_2 z_f$, which explains the need for localised operators to appear in the theory. \n\nThe bulk, position-dependent term appears due to loops that explicitly break the symmetry of the base space and must therefore be related to some large distance effects mixed with UV divergence. This mixing is nicely illustrated by bubble diagrams. In general, a bubble is expressed as $\\int dz_1 dz_2 G_\\text{orb}(x,z_1)G^2_\\text{orb}(z_1,z_2)G_\\text{orb}(z_2,y)$ and its divergent part is contained on the part in which $z_1=z_2$. Cutting the legs, we are interested in $G^2_\\text{orb}(z,z)$. Expanding over the winding modes, one finds that there are two kinds of divergent terms: $\\propto G^2(z,z)$, which have the same structure as on the base space and are position independent, and $G(z,z)G(z,Mz)$, which have a subdominant divergent behaviour, have no equivalent in the bulk, and are position dependent because the distance between $z$ and $Mz$ depends on $z$ in general.} \n(see for example \\cite{DaRold2004,Cheng2002,Cacciapaglia2012}). Because the localised terms are generated by more divergent loops than the bulk terms and can benefit from significant wave--function enhancements, they are expected to yield a dominant contribution. In practice, the bulk terms do cause some mass splitting but very mildly so, especially for states beyond the first KK tier \\cite{Cacciapaglia2012}, which can be intuitively justified by their large-distance origin.\n\nBecause our dark matter candidate level has non-zero angular momentum $m$, its wave--function has to be zero on the fixed point, which means that there can be no effect of the dominant localised term on its mass. While this is not sufficient to claim that the mass eigenstates in the $(2,\\pm 2)$ level are electroweak, we believe that there is a reasonable hint that the splitting is very moderate between states in the level. Due to the lack of a complete calculation of the one loop bulk terms, which is beyond the scope of the present simplified analysis, we will consider the very plausible hypothesis that the photon-like state is the lighter one. \n\n\\section{A lower limit from di--lepton searches}\n\\label{dilepton}\n\nA novel feature of models on spherical orbifold, compared to the flat case, is the presence of ``even'' states with mass equal or lower than the mass of the Dark Matter level. In the case under study, $S^2/S_4$, there is a level $(1,0)$ with mass $\\sqrt{3}$--times smaller than the DM mass, and also containing gauge scalars. Those scalars do not couple directly to the localised fermions: even though their wave functions are not vanishing on the fixed point, gauge invariance only requires a coupling of the localised fermions to the polarisation of the gauge boson along the ordinary 4D. Thus, the $(1,0)$ scalars will dominantly be pair-produced via gauge interactions, which implies small rates. \nThe level $(2,0)$, with the same mass as the Dark Matter one, is much more relevant for phenomenology: it contains spin-1 resonances of the gauge bosons together with Higgs ones. \nAn important feature derives from our choice of localising the fermions: this implies that spin-1 resonances of the gauge bosons couple to the fermions with unsuppressed gauge couplings. This situation has to be contrasted to the case of bulk fermions, where the couplings are only loop induced. As a consequence, the resonances can be abundantly produced at the LHC via Drell-Yan. The most constraining channel is due to di--lepton resonances from the production of the $Z$ and photon resonances.\n\nBoth ATLAS \\cite{ATLASCollaboration2014} and CMS \\cite{CMSCollaboration2014} have reported the results of their Run I searches for such di--lepton resonances and provide both direct yields and limits on the parameter spaces of specific Standard Model extensions. While our model shares similarities with the Sequential Standard Model that both collaborations constrained, the differences due to the presence of an extra resonance (the KK photon) and rescaled couplings -- which impact widths significantly -- are too stark to reliably reinterpret their limits. Therefore, we have recast the ATLAS analysis -- whose lepton selection criteria are most compatible with the tools available to theorists -- to derive limits by comparing our simulations to their measurements.\n\n\nWe used FeynRules \\cite{Alloul2013} to implement a Standard Model extension including\nthe two Kaluza-Klein vector resonances we wanted to investigate and\ngenerated di--lepton events -- including the $Z$ boson contribution -- using\nMadGraph5\\_aMC@NLO \\cite{Alwall2014} for parton-level simulations and PYTHIA \\cite{Andersson2006} for\nshowering and hadronisation. The PYTHIA output was further processed to account for detector\neffects using the MadAnalysis5 Delphes tune \\cite{DeFavereau2014,Dumont2014}.\n\nWe used MadAnalysis5 \\cite{Conte2012,Conte2014} at the reconstructed\nlevel to recast the ATLAS analysis in the di--electron channel. This choice was motivated by the better performance reported by the ATLAS collaboration compared to the di--muon channel as well as the selection procedure differences between the two channels, which make MadAnalysis5 more suitable for a close reproduction of the di--electron channel selection criteria.\nTable \\ref{atlasvsus} compares our selection procedure with\nthat of the ATLAS analysis for reference, and shows that it is possible to closely match all the cuts that were applied on the data.\n\n\\begin{table}[!h]\n\\centering\n  \\begin{tabular}{|c|l|c|}\n\\hline Category & ATLAS & Recast ? \\\\ \\hline\nElectron trigger & 2 ECAL clusters&No\\\\\n& consistent with E\\&M showers,&\\\\\n&$p_{T1}>\\unit{35}{\\giga\\electronvolt}$,\n$p_{T2}>\\unit{25}{\\giga\\electronvolt}$&\\\\\\hline\nTwo electrons & $\\geq 2$ reconstructed electrons & Yes \\\\\n& no charge requirement &   \\\\\\hline\nElectron rapidity &$|\\eta| < 2.47$  & Yes \\\\\n&$|\\eta|<1.37$ or $|\\eta|>1.52$&\\\\\\hline\nElectron &$E_{T_1} \\geq \\unit{40}{\\giga\\electronvolt}$ & Yes\n \\\\\ntransverse energy& $E_{T_2} \\geq \\unit{30}{\\giga\\electronvolt}$&\\\\\\hline\nLeading electron & $\\sum E_{T} \\leq 0.007 E_{T_1}\n+\\unit{5.0}{\\giga\\electronvolt}$& Yes \\\\\nisolation & within $\\Delta R \\leq 0.2$ & \\\\\\hline\nSubleading& $\\sum E_{T} \\leq 0.022 E_{T_2}\n+\\unit{6.0}{\\giga\\electronvolt}$& Yes  \\\\\nelectron  isolation & within $\\Delta R \\leq 0.2$ &\\\\\\hline\n  \\end{tabular}\n  \\caption{Cut flow of the di--lepton search: all criteria are easily reproducible using MadAnalysis5, except for the trigger.}\n  \\label{atlasvsus}\n\\end{table}\n\nThe selected events are then sorted into six di--lepton invariant mass\nbins: {$\\unit{{110-200}}{\\giga\\electronvolt}$}, {$\\unit{{200-400}}{\\giga\\electronvolt}$}, {$\\unit{{400-800}}{\\giga\\electronvolt}$}, {$\\unit{{800-1200}}{\\giga\\electronvolt}$},\n{$\\unit{{1200-3000}}{\\giga\\electronvolt}$}, {$\\unit{{3000-4500}}{\\giga\\electronvolt}$}.\n\nThe quality of our implementation was controlled using a Standard Model-only sample generated with the same procedure as the\nsignal samples and the yields in each of the six bins were compared with the background estimates from ATLAS for the $Z$ boson background\nchannel. As shown in Figure \\ref{picnorm} the results fall close to the $30\\%$ accuracy advertised by the MadAnalysis5 recasting\nguidelines \\cite{Conte2014} once a 1.27 $K$-factor (determined using aMC@NLO) is included. We determined a scaling factor for our simulations \nby taking the average of the ratios between our prediction and that of ATLAS -- which is normalised to data. Apart from this overall normalisation, \nwe can reproduce the ATLAS analysis Standard Model prediction to good accuracy.\n\\begin{figure}[!h]\n  \\centering\n\\includegraphics[width=0.8\\textwidth]{ratioRed}\n\\caption{Bin--per--bin ratios of Standard Model yields between our simulation and ATLAS's predictions, including a $K$-factor (red) and\nnormalised to ATLAS (blue)}\n\\label{picnorm}\n\\end{figure}\n\nUsing this normalisation, we can now compare our Standard Model prediction to the ATLAS data and our prediction for signals at different compactification radii. As shown in Figure \\ref{thvsexp}, the mass limit is expected to sit in the multi-TeV range, which we confirm using a statistical analysis.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[width=1\\textwidth,angle=0]{dilepton_th_vs_exp}\n\\caption{Dielectron invariant mass spectra comparison between ATLAS data (black dots), the Standard Model prediction (blue) and the prediction of our model at different values of $1/R$ ({$\\unit{{250}}{\\tera\\electronvolt}$}, {$\\unit{{800}}{\\tera\\electronvolt}$} and {$\\unit{{1600}}{\\tera\\electronvolt}$}). As we will show, the first two values are experimentally excluded while the last is compatible with the ATLAS result.}\n\\label{thvsexp}\n\\end{figure}\n\nWe set a limit on the compactification radius by computing the confidence levels (CLs) in\neach bin for our samples and we consider as excluded any sample where\nat least one bin is more than $2\\sigma$ away from the observed number\nof events. The CLs are computed with the following\nprescription:\n\\begin{itemize}\n\\item the signal is defined to be the yield obtained by processing our\n  samples, which include the contribution from $Z$ bosons and\n  interference effects.\n\\item the signal uncertainty is computed approximately. For the actual\n  extra-resonances, the ATLAS analysis uses a bin-independent $4\\%$\n  systematic uncertainty, which strongly dominates the statistical\n  uncertainty, which we always neglect. We need however to \n  include also the systematic uncertainty for the $Z$ boson contribution in\n  our sample, which we do by adding in quadrature the uncertainty\n  provided by ATLAS to the $4\\%$ contribution which we compute from\n  our simulations. This implies a double counting of some factors in\n  the $Z$ background uncertainty, which is however small as the total\n  uncertainty provided by ATLAS is significantly larger.\n\\item the background yield and uncertainty used for computing the CLs\n  confidence levels are the contribution of all other channels\n  computed by ATLAS with the uncertainties added in quadrature.\n\\end{itemize}\n\n\\begin{rst}\nThis analysis allowed us to set an exclusion limit on the radius of the sphere:\n\n", "itemtype": "equation", "pos": 50712, "prevtext": "\n\nThis mass term shows that the mass eigenstates after the Higgs\nmechanism, at tree level, are in fact determined by the same change of\nbasis as in the Standard Model and that the mass contributions induced\nare the same as the Standard Model corresponding gauge boson\nmasses. Hence at tree level, the photon scalar excitation is indeed\nthe dark matter candidate. \nNote that the mass splitting between the various states become very small in the limit of large radius, as they are proportional to the fixed value of the electroweak scale.\nThis picture may however be affected by large loop corrections, which are typically proportional to the bulk mass.\n\n\\subsubsection{Loop effects on the mass of $(2,\\pm 2)$ are small}\n\nIn extra-dimensional models, the discussion of the dark matter\ncandidate implies computing the spectrum correction at one loop\nbecause their effect largely dominates over electroweak effects\n\\cite{Cheng2002,Cacciapaglia2010}. We will however argue in this\nsection that the dominant loop mass splitting effects that could change the picture\ndisplayed in the discussion of electroweak effects are absent from\nlevel $(2,\\pm 2)$. Using a 6D picture, we can write the part of the Lagrangian that determines the masses of Kaluza-Klein gauge scalars:\n\n\n", "index": 63, "text": "\\begin{equation}\n{\\cal L}_{m_\\varphi}=\\frac{-1}{4} \\left(f_\\text{bulk}(\\theta) F_{MN} F^{MN} + 2 f_\\text{loc}\\delta(\\theta) F_{\\theta\\phi}F^{\\theta\\phi}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{m_{\\varphi}}=\\frac{-1}{4}\\left(f_{\\text{bulk}}(\\theta)F_{MN}F^{MN}+2%&#10;f_{\\text{loc}}\\delta(\\theta)F_{\\theta\\phi}F^{\\theta\\phi}\\right)\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi>m</mi><mi>φ</mi></msub></msub><mo>=</mo><mrow><mfrac><mrow><mo>-</mo><mn>1</mn></mrow><mn>4</mn></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>f</mi><mtext>bulk</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>F</mi><mrow><mi>M</mi><mo>⁢</mo><mi>N</mi></mrow></msub><mo>⁢</mo><msup><mi>F</mi><mrow><mi>M</mi><mo>⁢</mo><mi>N</mi></mrow></msup></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>f</mi><mtext>loc</mtext></msub><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>F</mi><mrow><mi>θ</mi><mo>⁢</mo><mi>ϕ</mi></mrow></msub><mo>⁢</mo><msup><mi>F</mi><mrow><mi>θ</mi><mo>⁢</mo><mi>ϕ</mi></mrow></msup></mrow></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhich translates to a lower bound on the mass of the DM candidate $M_{DM} \\sim M_{l=2}$. \n\\end{rst}\n\n\\section{An upper bound from relic density}\n\\label{dmrelic}\nLet us now turn to the phenomenology of the dark matter candidate. We have established in Section \\ref{dmlevel} that, to the\nlevel of approximation we consider, this candidate is the complex scalar excitation of the photon in tiers $(2,\\pm 2)$, which we\ndub the lightest rotating particle (LRP). In this section we proceed to compute the expected relic density of our LRP in\nthe universe today assuming the Standard Model of cosmology. In this model, dark matter is produced in the thermal bath of the hot\nprimordial universe and leaves thermal equilibrium when the expansion rate of the universe dominates annihilation rates, causing a density\nfreeze-out.\\\\\n\nAs the symmetry protecting the DM candidate is a U(1), additional contribution to the relic density may come from a primordial asymmetry \\cite{Nussinov:1985xr,Petraki:2013wwa,Zurek:2013wia}. We will not consider this possibility any further, because, as we will see, the thermal production is already excessive. It should be however noted that the asymmetric DM character may become relevant if the candidate never enters thermal equilibrium during the Universe's thermal history.\n\n\n\n\\subsection{Relic density calculations}\n\nThe calculation of the relic abundance of a stable particle species from thermal freeze-out is now a standard technique in dark matter\ntheory. The density $n$ of a dark matter particle well isolated in mass from other particles obeys the Boltzmann equation\n\n", "itemtype": "equation", "pos": 62055, "prevtext": "\n\nThese terms have to be present and non-trivial to absorb all loop divergences appearing on the orbifold\\footnote{The origin of these terms is best understood in the so called ``winding mode representation\"  \\cite{DaRold2004,Cheng2002} in which the extra-dimensional part of propagators is expressed in position space. This representation is useful on orbifolds because it allows for an simple expression of the propagator in terms of the propagators on the base space: it is a sum over all the propagators between the elements of the orbit of the end- and start--point: $G_\\text{orb}(x,y)=\\sum G(M_1 x, M_2 y)$. The localised term generation is easily illustrated by a tadpole diagram $\\int dz G_\\text{orb}(x,z)G_\\text{orb}(z,z)G_\\text{orb}(z,y)$, which has a divergent part which is $\\sum\\int dz G(x,M_i z) G(M_1 z,M_1 z) G(M_j z, y)$ for points in the bulk. Fixed points however, have additional divergent terms with the same degree of divergence because some $M_1\\neq M_2$ verify $M_1 z_f = M_2 z_f$, which explains the need for localised operators to appear in the theory. \n\nThe bulk, position-dependent term appears due to loops that explicitly break the symmetry of the base space and must therefore be related to some large distance effects mixed with UV divergence. This mixing is nicely illustrated by bubble diagrams. In general, a bubble is expressed as $\\int dz_1 dz_2 G_\\text{orb}(x,z_1)G^2_\\text{orb}(z_1,z_2)G_\\text{orb}(z_2,y)$ and its divergent part is contained on the part in which $z_1=z_2$. Cutting the legs, we are interested in $G^2_\\text{orb}(z,z)$. Expanding over the winding modes, one finds that there are two kinds of divergent terms: $\\propto G^2(z,z)$, which have the same structure as on the base space and are position independent, and $G(z,z)G(z,Mz)$, which have a subdominant divergent behaviour, have no equivalent in the bulk, and are position dependent because the distance between $z$ and $Mz$ depends on $z$ in general.} \n(see for example \\cite{DaRold2004,Cheng2002,Cacciapaglia2012}). Because the localised terms are generated by more divergent loops than the bulk terms and can benefit from significant wave--function enhancements, they are expected to yield a dominant contribution. In practice, the bulk terms do cause some mass splitting but very mildly so, especially for states beyond the first KK tier \\cite{Cacciapaglia2012}, which can be intuitively justified by their large-distance origin.\n\nBecause our dark matter candidate level has non-zero angular momentum $m$, its wave--function has to be zero on the fixed point, which means that there can be no effect of the dominant localised term on its mass. While this is not sufficient to claim that the mass eigenstates in the $(2,\\pm 2)$ level are electroweak, we believe that there is a reasonable hint that the splitting is very moderate between states in the level. Due to the lack of a complete calculation of the one loop bulk terms, which is beyond the scope of the present simplified analysis, we will consider the very plausible hypothesis that the photon-like state is the lighter one. \n\n\\section{A lower limit from di--lepton searches}\n\\label{dilepton}\n\nA novel feature of models on spherical orbifold, compared to the flat case, is the presence of ``even'' states with mass equal or lower than the mass of the Dark Matter level. In the case under study, $S^2/S_4$, there is a level $(1,0)$ with mass $\\sqrt{3}$--times smaller than the DM mass, and also containing gauge scalars. Those scalars do not couple directly to the localised fermions: even though their wave functions are not vanishing on the fixed point, gauge invariance only requires a coupling of the localised fermions to the polarisation of the gauge boson along the ordinary 4D. Thus, the $(1,0)$ scalars will dominantly be pair-produced via gauge interactions, which implies small rates. \nThe level $(2,0)$, with the same mass as the Dark Matter one, is much more relevant for phenomenology: it contains spin-1 resonances of the gauge bosons together with Higgs ones. \nAn important feature derives from our choice of localising the fermions: this implies that spin-1 resonances of the gauge bosons couple to the fermions with unsuppressed gauge couplings. This situation has to be contrasted to the case of bulk fermions, where the couplings are only loop induced. As a consequence, the resonances can be abundantly produced at the LHC via Drell-Yan. The most constraining channel is due to di--lepton resonances from the production of the $Z$ and photon resonances.\n\nBoth ATLAS \\cite{ATLASCollaboration2014} and CMS \\cite{CMSCollaboration2014} have reported the results of their Run I searches for such di--lepton resonances and provide both direct yields and limits on the parameter spaces of specific Standard Model extensions. While our model shares similarities with the Sequential Standard Model that both collaborations constrained, the differences due to the presence of an extra resonance (the KK photon) and rescaled couplings -- which impact widths significantly -- are too stark to reliably reinterpret their limits. Therefore, we have recast the ATLAS analysis -- whose lepton selection criteria are most compatible with the tools available to theorists -- to derive limits by comparing our simulations to their measurements.\n\n\nWe used FeynRules \\cite{Alloul2013} to implement a Standard Model extension including\nthe two Kaluza-Klein vector resonances we wanted to investigate and\ngenerated di--lepton events -- including the $Z$ boson contribution -- using\nMadGraph5\\_aMC@NLO \\cite{Alwall2014} for parton-level simulations and PYTHIA \\cite{Andersson2006} for\nshowering and hadronisation. The PYTHIA output was further processed to account for detector\neffects using the MadAnalysis5 Delphes tune \\cite{DeFavereau2014,Dumont2014}.\n\nWe used MadAnalysis5 \\cite{Conte2012,Conte2014} at the reconstructed\nlevel to recast the ATLAS analysis in the di--electron channel. This choice was motivated by the better performance reported by the ATLAS collaboration compared to the di--muon channel as well as the selection procedure differences between the two channels, which make MadAnalysis5 more suitable for a close reproduction of the di--electron channel selection criteria.\nTable \\ref{atlasvsus} compares our selection procedure with\nthat of the ATLAS analysis for reference, and shows that it is possible to closely match all the cuts that were applied on the data.\n\n\\begin{table}[!h]\n\\centering\n  \\begin{tabular}{|c|l|c|}\n\\hline Category & ATLAS & Recast ? \\\\ \\hline\nElectron trigger & 2 ECAL clusters&No\\\\\n& consistent with E\\&M showers,&\\\\\n&$p_{T1}>\\unit{35}{\\giga\\electronvolt}$,\n$p_{T2}>\\unit{25}{\\giga\\electronvolt}$&\\\\\\hline\nTwo electrons & $\\geq 2$ reconstructed electrons & Yes \\\\\n& no charge requirement &   \\\\\\hline\nElectron rapidity &$|\\eta| < 2.47$  & Yes \\\\\n&$|\\eta|<1.37$ or $|\\eta|>1.52$&\\\\\\hline\nElectron &$E_{T_1} \\geq \\unit{40}{\\giga\\electronvolt}$ & Yes\n \\\\\ntransverse energy& $E_{T_2} \\geq \\unit{30}{\\giga\\electronvolt}$&\\\\\\hline\nLeading electron & $\\sum E_{T} \\leq 0.007 E_{T_1}\n+\\unit{5.0}{\\giga\\electronvolt}$& Yes \\\\\nisolation & within $\\Delta R \\leq 0.2$ & \\\\\\hline\nSubleading& $\\sum E_{T} \\leq 0.022 E_{T_2}\n+\\unit{6.0}{\\giga\\electronvolt}$& Yes  \\\\\nelectron  isolation & within $\\Delta R \\leq 0.2$ &\\\\\\hline\n  \\end{tabular}\n  \\caption{Cut flow of the di--lepton search: all criteria are easily reproducible using MadAnalysis5, except for the trigger.}\n  \\label{atlasvsus}\n\\end{table}\n\nThe selected events are then sorted into six di--lepton invariant mass\nbins: {$\\unit{{110-200}}{\\giga\\electronvolt}$}, {$\\unit{{200-400}}{\\giga\\electronvolt}$}, {$\\unit{{400-800}}{\\giga\\electronvolt}$}, {$\\unit{{800-1200}}{\\giga\\electronvolt}$},\n{$\\unit{{1200-3000}}{\\giga\\electronvolt}$}, {$\\unit{{3000-4500}}{\\giga\\electronvolt}$}.\n\nThe quality of our implementation was controlled using a Standard Model-only sample generated with the same procedure as the\nsignal samples and the yields in each of the six bins were compared with the background estimates from ATLAS for the $Z$ boson background\nchannel. As shown in Figure \\ref{picnorm} the results fall close to the $30\\%$ accuracy advertised by the MadAnalysis5 recasting\nguidelines \\cite{Conte2014} once a 1.27 $K$-factor (determined using aMC@NLO) is included. We determined a scaling factor for our simulations \nby taking the average of the ratios between our prediction and that of ATLAS -- which is normalised to data. Apart from this overall normalisation, \nwe can reproduce the ATLAS analysis Standard Model prediction to good accuracy.\n\\begin{figure}[!h]\n  \\centering\n\\includegraphics[width=0.8\\textwidth]{ratioRed}\n\\caption{Bin--per--bin ratios of Standard Model yields between our simulation and ATLAS's predictions, including a $K$-factor (red) and\nnormalised to ATLAS (blue)}\n\\label{picnorm}\n\\end{figure}\n\nUsing this normalisation, we can now compare our Standard Model prediction to the ATLAS data and our prediction for signals at different compactification radii. As shown in Figure \\ref{thvsexp}, the mass limit is expected to sit in the multi-TeV range, which we confirm using a statistical analysis.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[width=1\\textwidth,angle=0]{dilepton_th_vs_exp}\n\\caption{Dielectron invariant mass spectra comparison between ATLAS data (black dots), the Standard Model prediction (blue) and the prediction of our model at different values of $1/R$ ({$\\unit{{250}}{\\tera\\electronvolt}$}, {$\\unit{{800}}{\\tera\\electronvolt}$} and {$\\unit{{1600}}{\\tera\\electronvolt}$}). As we will show, the first two values are experimentally excluded while the last is compatible with the ATLAS result.}\n\\label{thvsexp}\n\\end{figure}\n\nWe set a limit on the compactification radius by computing the confidence levels (CLs) in\neach bin for our samples and we consider as excluded any sample where\nat least one bin is more than $2\\sigma$ away from the observed number\nof events. The CLs are computed with the following\nprescription:\n\\begin{itemize}\n\\item the signal is defined to be the yield obtained by processing our\n  samples, which include the contribution from $Z$ bosons and\n  interference effects.\n\\item the signal uncertainty is computed approximately. For the actual\n  extra-resonances, the ATLAS analysis uses a bin-independent $4\\%$\n  systematic uncertainty, which strongly dominates the statistical\n  uncertainty, which we always neglect. We need however to \n  include also the systematic uncertainty for the $Z$ boson contribution in\n  our sample, which we do by adding in quadrature the uncertainty\n  provided by ATLAS to the $4\\%$ contribution which we compute from\n  our simulations. This implies a double counting of some factors in\n  the $Z$ background uncertainty, which is however small as the total\n  uncertainty provided by ATLAS is significantly larger.\n\\item the background yield and uncertainty used for computing the CLs\n  confidence levels are the contribution of all other channels\n  computed by ATLAS with the uncertainties added in quadrature.\n\\end{itemize}\n\n\\begin{rst}\nThis analysis allowed us to set an exclusion limit on the radius of the sphere:\n\n", "index": 65, "text": "\\begin{equation}\n\\frac{1}{R} > \\unit{1.6}{\\tera\\electronvolt}\\,, \\qquad M_{l=2}>{\\unit{{3.9}}{\\tera\\electronvolt}}\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{R}&gt;\\unit{1.6}{\\tera\\electronvolt}\\,,\\qquad M_{l=2}&gt;{\\unit{{3.9}}{%&#10;\\tera\\electronvolt}}\\,,\" display=\"block\"><mrow><mrow><mrow><mfrac><mn>1</mn><mi>R</mi></mfrac><mo>&gt;</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\unit</mtext></merror><mo>⁢</mo><mn>1.6</mn><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\tera</mtext></merror><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\electronvolt</mtext></merror></mrow></mrow><mo rspace=\"22.5pt\">,</mo><mrow><msub><mi>M</mi><mrow><mi>l</mi><mo>=</mo><mn>2</mn></mrow></msub><mo>&gt;</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\unit</mtext></merror><mo>⁢</mo><mn>3.9</mn><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\tera</mtext></merror><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\electronvolt</mtext></merror></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhere $H$ is the expansion rate of the universe,\n\n", "itemtype": "equation", "pos": 63791, "prevtext": "\nwhich translates to a lower bound on the mass of the DM candidate $M_{DM} \\sim M_{l=2}$. \n\\end{rst}\n\n\\section{An upper bound from relic density}\n\\label{dmrelic}\nLet us now turn to the phenomenology of the dark matter candidate. We have established in Section \\ref{dmlevel} that, to the\nlevel of approximation we consider, this candidate is the complex scalar excitation of the photon in tiers $(2,\\pm 2)$, which we\ndub the lightest rotating particle (LRP). In this section we proceed to compute the expected relic density of our LRP in\nthe universe today assuming the Standard Model of cosmology. In this model, dark matter is produced in the thermal bath of the hot\nprimordial universe and leaves thermal equilibrium when the expansion rate of the universe dominates annihilation rates, causing a density\nfreeze-out.\\\\\n\nAs the symmetry protecting the DM candidate is a U(1), additional contribution to the relic density may come from a primordial asymmetry \\cite{Nussinov:1985xr,Petraki:2013wwa,Zurek:2013wia}. We will not consider this possibility any further, because, as we will see, the thermal production is already excessive. It should be however noted that the asymmetric DM character may become relevant if the candidate never enters thermal equilibrium during the Universe's thermal history.\n\n\n\n\\subsection{Relic density calculations}\n\nThe calculation of the relic abundance of a stable particle species from thermal freeze-out is now a standard technique in dark matter\ntheory. The density $n$ of a dark matter particle well isolated in mass from other particles obeys the Boltzmann equation\n\n", "index": 67, "text": "\\begin{equation}\n  \\label{eq:dmrelic1}\n  {\\frac{\\partial {n}}{\\partial {t}}} + 3Hn = - \\left< {\\sigma v} \\right> \\left( n^2 - n_{eq} ^2\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36.m1\" class=\"ltx_Math\" alttext=\"{\\frac{\\partial{n}}{\\partial{t}}}+3Hn=-\\left&lt;{\\sigma v}\\right&gt;\\left(n^{2}-n_{%&#10;eq}^{2}\\right)\" display=\"block\"><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>n</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>+</mo><mrow><mn>3</mn><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>n</mi></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mrow><mo>⟨</mo><mrow><mi>σ</mi><mo>⁢</mo><mi>v</mi></mrow><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>n</mi><mn>2</mn></msup><mo>-</mo><msubsup><mi>n</mi><mrow><mi>e</mi><mo>⁢</mo><mi>q</mi></mrow><mn>2</mn></msubsup></mrow><mo>)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nis the thermal equilibrium density for a particle of mass $m$ with $g$\ndegrees of freedom and $\\left< {\\sigma v} \\right>$ is the thermally averaged\nself-annihilation cross-section of dark matter pairs into Standard\nModel particles. This equation can be used to derive at which\ntemperature $T_f$ dark matter ceases to be in thermal equilibrium and\nessentially is no longer produced nor annihilated. The dark matter\ndensity fraction is then expressed in terms of this temperature, the\nquadratic speed expansion of the cross section $\\left< {\\sigma v} \\right> = a + b\n\\left< {v^2} \\right>$, the Planck mass $M_{pl}$ and the number of relativistic\ndegrees of freedom at freeze-out $g_*$:\n\n", "itemtype": "equation", "pos": 63998, "prevtext": "\nwhere $H$ is the expansion rate of the universe,\n\n", "index": 69, "text": "\\begin{equation}\n  \\label{eq:dmrelic2}\n  n_{eq}=g\\left(\\frac{mT}{2\\pi} \\right)^{\\frac{3}{2}} e^{-m/T}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37.m1\" class=\"ltx_Math\" alttext=\"n_{eq}=g\\left(\\frac{mT}{2\\pi}\\right)^{\\frac{3}{2}}e^{-m/T}\" display=\"block\"><mrow><msub><mi>n</mi><mrow><mi>e</mi><mo>⁢</mo><mi>q</mi></mrow></msub><mo>=</mo><mrow><mi>g</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mrow><mi>m</mi><mo>⁢</mo><mi>T</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>)</mo></mrow><mfrac><mn>3</mn><mn>2</mn></mfrac></msup><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>m</mi><mo>/</mo><mi>T</mi></mrow></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nIt has however been noted \\cite{Griest1991} that this picture should be corrected in the\npresence of other particles that have a mass very close to that of the\ndark matter and eventually decay to the dark matter particle. In this\ncase, the near-degenerate states should all be taken into account in\nthe Boltzmann equation to\nhave a precise prediction of the dark matter density. The same authors\nprovide a simple way of treating all co--annihilation effects by noting\nthat the total density $N$ of all near-degenerate modes should\napproximately be described by a Boltzmann as all the modes will\neventually decay to dark matter. The effective Boltzmann equation is\n\n", "itemtype": "equation", "pos": 64799, "prevtext": "\nis the thermal equilibrium density for a particle of mass $m$ with $g$\ndegrees of freedom and $\\left< {\\sigma v} \\right>$ is the thermally averaged\nself-annihilation cross-section of dark matter pairs into Standard\nModel particles. This equation can be used to derive at which\ntemperature $T_f$ dark matter ceases to be in thermal equilibrium and\nessentially is no longer produced nor annihilated. The dark matter\ndensity fraction is then expressed in terms of this temperature, the\nquadratic speed expansion of the cross section $\\left< {\\sigma v} \\right> = a + b\n\\left< {v^2} \\right>$, the Planck mass $M_{pl}$ and the number of relativistic\ndegrees of freedom at freeze-out $g_*$:\n\n", "index": 71, "text": "\\begin{equation}\n  \\label{eq:dmrelic3}\n  \\Omega_{DM} h^2 \\approx \\frac{1.04\\times 10^9}{M_{pl}} \\frac{m}{T_f\n    \\sqrt{g_*}} \\frac{1}{a+3mb/T_f}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"\\Omega_{DM}h^{2}\\approx\\frac{1.04\\times 10^{9}}{M_{pl}}\\frac{m}{T_{f}\\sqrt{g_{%&#10;*}}}\\frac{1}{a+3mb/T_{f}}\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>D</mi><mo>⁢</mo><mi>M</mi></mrow></msub><mo>⁢</mo><msup><mi>h</mi><mn>2</mn></msup></mrow><mo>≈</mo><mrow><mfrac><mrow><mn>1.04</mn><mo>×</mo><msup><mn>10</mn><mn>9</mn></msup></mrow><msub><mi>M</mi><mrow><mi>p</mi><mo>⁢</mo><mi>l</mi></mrow></msub></mfrac><mo>⁢</mo><mfrac><mi>m</mi><mrow><msub><mi>T</mi><mi>f</mi></msub><mo>⁢</mo><msqrt><msub><mi>g</mi><mo>*</mo></msub></msqrt></mrow></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><mrow><mi>a</mi><mo>+</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mi>m</mi><mo>⁢</mo><mi>b</mi></mrow><mo>/</mo><msub><mi>T</mi><mi>f</mi></msub></mrow></mrow></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nwhere the effective collision rate is a weighted sum of all\nco--annihilation processes, accounting for Boltzmann factors:\n\n", "itemtype": "equation", "pos": 65627, "prevtext": "\n\nIt has however been noted \\cite{Griest1991} that this picture should be corrected in the\npresence of other particles that have a mass very close to that of the\ndark matter and eventually decay to the dark matter particle. In this\ncase, the near-degenerate states should all be taken into account in\nthe Boltzmann equation to\nhave a precise prediction of the dark matter density. The same authors\nprovide a simple way of treating all co--annihilation effects by noting\nthat the total density $N$ of all near-degenerate modes should\napproximately be described by a Boltzmann as all the modes will\neventually decay to dark matter. The effective Boltzmann equation is\n\n", "index": 73, "text": "\\begin{equation}\n  \\label{eq:dmrelic4}\n  {\\frac{\\partial {N}}{\\partial {t}}} + 3HN = - \\left< {\\sigma_{eff} v} \\right> \\left( N^2-N_{eq}^2\\right)\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"{\\frac{\\partial{N}}{\\partial{t}}}+3HN=-\\left&lt;{\\sigma_{eff}v}\\right&gt;\\left(N^{2}%&#10;-N_{eq}^{2}\\right)\\,,\" display=\"block\"><mrow><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>N</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>t</mi></mrow></mfrac><mo>+</mo><mrow><mn>3</mn><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>N</mi></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mrow><mo>⟨</mo><mrow><msub><mi>σ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>⁢</mo><mi>v</mi></mrow><mo>⟩</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>N</mi><mn>2</mn></msup><mo>-</mo><msubsup><mi>N</mi><mrow><mi>e</mi><mo>⁢</mo><mi>q</mi></mrow><mn>2</mn></msubsup></mrow><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\nIn this definition, the sums go through all species entering in $N$ (the dark matter particle and all near-degenerate states),\n$\\sigma_{ij}$ is the cross-section for the process $ij\\rightarrow SM$, $g_i$ is the number of degrees of freedom of state $i$,\n$\\Delta_i=\\frac{m_i-m_{DM}}{m_{DM}}$ and \n\n", "itemtype": "equation", "pos": 65913, "prevtext": "\nwhere the effective collision rate is a weighted sum of all\nco--annihilation processes, accounting for Boltzmann factors:\n\n", "index": 75, "text": "\\begin{equation}\n  \\label{eq:dmrelic5}\n  \\sigma_{eff}=\\sum_i^K\\sum_j^K \\sigma_{ij}\n  \\frac{g_ig_j}{g_{eff}^2}(1+\\Delta_i)^{3/2}(1+\\Delta_j)^{3/2}\n  e^{-x(\\Delta_i + \\Delta_j)}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{eff}=\\sum_{i}^{K}\\sum_{j}^{K}\\sigma_{ij}\\frac{g_{i}g_{j}}{g_{eff}^{2}}%&#10;(1+\\Delta_{i})^{3/2}(1+\\Delta_{j})^{3/2}e^{-x(\\Delta_{i}+\\Delta_{j})}\\,.\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><mi>K</mi></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi><mi>K</mi></munderover><mrow><msub><mi>σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mfrac><mrow><msub><mi>g</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>g</mi><mi>j</mi></msub></mrow><msubsup><mi>g</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow><mn>2</mn></msubsup></mfrac><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi mathvariant=\"normal\">Δ</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi mathvariant=\"normal\">Δ</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi mathvariant=\"normal\">Δ</mi><mi>i</mi></msub><mo>+</mo><msub><mi mathvariant=\"normal\">Δ</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup></mpadded></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nThe effect of co--annihilations are in particular very important in many\nKaluza-Klein dark matter models \\cite{Servant2003a,Arbey2012a} and as\nwe will see our model makes no exception, all the more as there is a\nhigh degeneracy between the LRP and other modes in the same tier.\n\nFor our relic density predictions, we used FeynRules \\cite{Alloul2013} to define models\nfrom the interaction terms we derive in Appendix \\ref{app:intlagrangian}. These FeynRules models\nwere used to generate CalcHEP models, which were then used in CalcHEP itself \\cite{Belyaev} to\nproduce Mathematica \\cite{WolframResearchInc} outputs for the relevant\ncross-sections, using which we could go through the calculations\noutlined in this section to obtain the present-day dark matter\ndensity, using dark matter annihilations and co--annihilations.\n\nThis calculation can be used to put upper bounds on the mass of the\ndark matter particle and thus, due to the competition with the\ndi--lepton searches, contribute to constrain the model. Indeed,\nthe relic density prediction typically grows with the mass of the dark\nmatter particle \\cite{Kong2005},  and it has to be compared with the latest Planck\nresult: $\\Omega h^2 = 0.1188 \\pm 0.0010$ \\cite{PlanckCollaboration2015}. This\nmeasurement gives a preferred value for the inverse radius, at which\nall the dark matter content in the universe can be consistently\nexplained by the model's LRP and any excess larger than two\nstandard deviations can be excluded. If the prediction is below the\nmeasured value, the model cannot be excluded with certainty as dark\nmatter may have multiple components. However, larger values are ruled\nout as it would lead to the overclosure of the Universe.\n\n\n\n\\subsection{Thermal relic density results}\n\nIn the following, we will consider two extreme cases: first, the case where only one state contributes to the DM relic abundance, and later we consider all the co-annihilation processes. The latter is a more realistic case, as the mass splittings we expect in this model are very small. We numerically checked that effects due to the splitting induced by the electroweak symmetry breaking are negligible, so that the results are shown in the most favourable case where such splittings are set to zero. The case without co-annihilation can be seen as a least favourable scenario.\n\n\n\\subsubsection{Annihilation process}\n\nThere is only one relevant channel for the annihilation of dark\nmatter: $\\varphi_A \\bar \\varphi_A \\rightarrow W^+ W^-$. Due to phase space\neffects, the production of $W$ excitations is largely suppressed and can therefore be\nneglected. Using the CalcHEP analytical expression for the matrix\nelement, we could compute the non-relativistic expansion of the\nassociated $\\left< {\\sigma v} \\right>$, which in turn allowed us to predict the dark matter density in our model, taking into account only\nannihilation. \n\nThis prediction is formulated as a function of the\nradius of the extra-dimension, and $\\Omega h^2$ increases with the mass scale of the\nextra-dimensions as expected. The result is presented in Figure\n\\ref{fig:dmrelicann} where the Planck preferred value is represented\nto show that the upper bound on the inverse radius inferred from this\ncalculation would be $\\frac{1}{R} \\leq {\\unit{{100}}{\\giga\\electronvolt}}$ which in turns means\n$ m_{l=2} \\leq {\\unit{{250}}{\\giga\\electronvolt}}$. This limit, however is too stringent as\nco--annihilation effects with other gauge scalars change the prediction\nfor the relic density significantly.\n\n\\subsubsection{Co--annihilation processes}\n\nAs we show in the Appendices \\ref{app:intlagrangian} and \\ref{app:channels}, there are several\nchannels available for co--annihilation of our dark matter candidate,\nonce the other electroweak gauge bosons are included in the\ncalculation. \nA list of all the processes we considered can be found in \\ref{app:channels} and we show in Figure \\ref{fig:coannsigv} a sample of thermal cross-sections computed using the dedicated CalcHEP module.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[width=0.8\\textwidth]{sigv2}\n\\caption{Characteristic sample of annihilation channels}\n\\label{fig:coannsigv}\n\\end{figure}\n\nThese processes can be sorted into several classes, as shown in Figure \\ref{fig:dmgraphs}. As we will show below, the dominant contribution comes from co--annihilation to pairs of tier-0 vector bosons (Figure \\ref{fig:ddVV}). Annihilation to fermions (Figure \\ref{fig:ddff}) is a lot less important due to the absence of s-wave processes and the associated production of a vector boson and excited vector bosons (Figure \\ref{fig:ddVVs}) is phase-space suppressed. \n\nIt is worth mentioning that we considered the possible contribution of near-resonant s-channel diagrams involving $(4,0)$ excitations like in Figure \\ref{fig:ddVV40V}, but that the resonance is still too far-off to have a significant impact on the thermal cross-sections. We should however note that a significant change can be introduced by fine-tuning the localised Higgs mass operator so that Higgs excitations hit precisely the resonance (Figure \\ref{fig:ddVV40H}). A quick estimate using a subset of all processes showed that this changes significantly the thermal cross-section -- possibly providing a small funnel in parameter space where Dark matter is allowed to be very heavy. We however leave aside the study of this fine-tuned possibility in the present work. \n\n\\begin{figure}[!h]\n  \\centering\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow V^\\mu V^\\mu$]{\\includegraphics[width=0.2\\textwidth]{ddZZ} \\label{fig:ddVV}}\n  \\hspace{1em}\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow f\\bar f$]{\\includegraphics[width=0.2\\textwidth]{ddff}\\label{fig:ddff}}\n  \\hspace{1em}\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow V^\\mu V^{*\\mu} $]{\\includegraphics[width=0.2\\textwidth]{ddZZs}\\label{fig:ddVVs}}\n  \\newline\n  \\subfigure[Vector Resonance]{\\includegraphics[width=0.2\\textwidth]{ddZZ40V}\\label{fig:ddVV40V}}\n  \\hspace{1em}\n  \\subfigure[Higgs Resonance]{\\includegraphics[width=0.2\\textwidth]{ddZZ40H}\\label{fig:ddVV40H}}\n  \\caption{Examples of classes of processes. Thick lines represent Kaluza-Klein excitations and the fermion gauge coupling is marked to highlight its localised feature.}\n  \\label{fig:dmgraphs}\n\\end{figure}\n\nWith the caveat of the possible Higgs resonance funnel, we could compute $\\left< {\\sigma v} \\right>_{eff}$ analytically and predict\nfor $\\Omega_{DM}h^2$ as a function of $\\frac{1}{R}$. The result of\nthis calculation is presented in Figure \\ref{fig:dmrelicann}.\n\\begin{figure}[!h]\n  \\centering\n\\includegraphics[width=0.6\\textwidth]{dmreliccoann}\n  \\caption{Dark matter relic density as a function of the sphere inverse\nradius with (black) and without (grey) co--annihilations. The green band is centred around the\nPlanck preferred value and its width is given by the result's standard deviation}\n\\label{fig:dmrelicann}\n\\end{figure}\nAs expected, the upper value on $\\frac{1}{R}$ is increased\nsignificantly once co--annihilations are included. We now have the\nconstraint $\\frac{1}{R}\\leq {\\unit{{220}}{\\giga\\electronvolt}}$, which translates to\n$m_{l=2}\\leq {\\unit{{540}}{\\giga\\electronvolt}}$. While the tension is reduced with the\ncollider lower bound, there is no doubt that it is sufficient to rule\nout the bulk of this model's parameter space, outside of a fine-tuned region.\n\n\\section{Other orbifolds}\nCan we generalise the exclusion of this model to the other possible spaces? As we stated in Section \\ref{orbifolds}, there are four families of non-polyhedric orbifolds that have fixed points and symmetries and, as we will see, we can use our result to draw the broad conclusion that none provides an experimentally viable framework for extending the Standard Model.\n\n\n\\begin{table}[!h]\n\\begin{center}\n\\begin{tabular}{|l|cc|cc|cccc|}\n\\hline\nOrbifold & \\multicolumn{2}{c|}{Dark Matter} & \\multicolumn{2}{c|}{Z's} & \\multicolumn{4}{c|}{wavefunction factors}\\\\\n    &   $(l,m)$  &  spin  &  $(l,m)$  &  $m_{DM}/m_{Z'}$ & NP & SP & EME & WME \\\\\\hline\n$S_4$ & $(2,\\pm2)$ & S & $(2,0)$ & $1$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & - \\\\\n$S_6$ & $(3,\\pm3)$ & V & $(2,0)$ & $\\sqrt{2}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\\hline\n$C_2$ & $(2,\\pm2)$ & V+S & $(1,0)$ & $\\sqrt{3}$ & $-\\sqrt{3}$ & $\\sqrt{3}$ &-  & - \\\\\n$C_4$ & $(4,\\pm4)$ & V+S & $(1,0)$ & $\\sqrt{10}$ & $-\\sqrt{3}$ & $\\sqrt{3}$ &-  & -\\\\\\hline\n$C_{2h}$ & $(2,\\pm2)$ & V & $(2,0)$ & $1$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\n$C_{4h}$ & $(4,\\pm4)$ & V & $(2,0)$ & $\\sqrt{10/3}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\\hline\n$D_3$ & $(4,3)$ & V+S & $(2,0)$ & $\\sqrt{10/3}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & $-\\sqrt{5}/2$ & $-\\sqrt{5}/2$  \\\\\n$D_5$ & $(6,5)$ & V+S & $(2,0)$ & $\\sqrt{7}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & $-\\sqrt{5}/2$ & $-\\sqrt{5}/2$  \\\\\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Properties of DM and lightest $Z'$ in the lowest $n$ spherical orbifolds. For DM, S stands for gauge scalars and V for gauge vectors and Higgs. The wavefunction factors refer to the fixed points as listed in Table~\\ref{tab:orbprop}.}\n\\label{tab:DMprop}\n\\end{table}\n\n\nThe argument we put forward goes as follows:\n\\begin{itemize}\n\\item[-] In all cases, there exists an even level with mass lighter or equal to the one of the DM candidate and containing a spin-1 gauge resonance with unsuppressed couplings to the localised fermions~\\footnote{Even gauge scalars are exempt from LHC constraints as they do not couple to the localised fermions at tree level.}. Thus, the constraint from the di-lepton search always applies and requires the DM state to appear in the multi-TeV range.\n\\item[-] Our analysis shows that the preferred mass range for the DM is well below the TeV, barring Higgs resonant channels. In order to reach the multi TeV scale, the annihilation cross section would need to be strongly enhanced: for $m_{DM} = 5$ TeV, one would need a cross section larger by roughly a factor of 80.\n\\item[-] The case we studied is the least favourable one, as the DM candidate is a gauge scalar. In other cases, it may be a vector, thus receiving additional contribution to the annihilation into a pair of fermions. There are also cases where the stable level contains both vector and scalar gauge states: in any case, the needed enhancement to escape the LHC bound is very unlikely to be obtained without the help of an s-channel resonant contribution.\n\\end{itemize}\nWhile our argument is qualitative, it leads us to expect that all of the cases of natural DM on the sphere is in tension with data. A summary of the main features of the first two low--$n$ orbifold for each class can be found in Table~\\ref{tab:DMprop}: it shows that in most cases the $Z'$ is lighter than the DM and has unsuppressed couplings. Thus, the LHC always implies a strong indirect constraint on the DM mass. Furthermore, the situation is always worsened for increasing $n$.\nIn the following, we will give more details for each class of orbifold.\n\n\\paragraph{Higher order $\\boldsymbol{S_{2n}}$.}\n\nWe gave a general-$n$ analysis of the spectrum of gauge bosons on $S^2/S_4$ in Section \\ref{dmlevel}. For $n>2$, one can see that there will be \nseveral $m=0$ excitations lighter than the first stable level, which will appear for $l=n$, either in the vector or the scalar sector depending on the parity \nof $n$. In particular, the level $(2,0)$ always contains the lightest even $Z'$s. As an example, the spectrum of $S^2/S_6$ is shown in Fig.\\ref{fig:specs6} ($S^2/S_4$ in Fig.\\ref{fig:specs4} for comparison): the DM candidate is a spin-1 gauge boson in levels $(3,\\pm3)$. \nThe larger wavefunction factor and the fact that the DM candidate is heavier than the $Z'$ imply stronger bounds on the DM mass.\n\n\n\n\\begin{figure}[!h]\n  \\centering\n  \\subfigure[$S_4$]{\\includegraphics[width=0.3\\textwidth]{S4spectrum}\\label{fig:specs4}}\n  \\subfigure[$S_6$]{\\includegraphics[width=0.3\\textwidth]{S6spectrum}\\label{fig:specs6}}\n  \\subfigure[$C_2$]{\\includegraphics[width=0.3\\textwidth]{Cnspectrum}\\label{fig:speccn}}\n  \\subfigure[$C_4$]{\\includegraphics[width=0.3\\textwidth]{C4spectrum}\\label{fig:specc4}}\n  \\subfigure[$C_{2h}$]{\\includegraphics[width=0.3\\textwidth]{Cnhspectrum}\\label{fig:speccnh}}\n  \\subfigure[$C_{4h}$]{\\includegraphics[width=0.3\\textwidth]{C4hspectrum}\\label{fig:specc4h}}\n  \\subfigure[$D_{3}$]{\\includegraphics[width=0.3\\textwidth]{Dnspectrum}\\label{fig:specdn}}\n  \\subfigure[$D_{5}$]{\\includegraphics[width=0.3\\textwidth]{D6spectrum}\\label{fig:specd5}}\n  \\caption{Examples of spectra of gauge bosons on $S_n$,  $C_n$, $C_{nh}$, and $D_n$, with vectors levels displayed in black and scalars in red. The vertical axis spans values of $l$ while the horizontal axis spans $m$.}\n\\end{figure}\n\n\\paragraph{Cyclic groups $\\boldsymbol{C_n}$.}\nSpaces based on the groups $C_n$ have a $m$-conserving rotational symmetry, like $S_4$. \nAs they are defined in terms of a rotation of $\\phi$ by an angle $2\\pi/n$, both vector and scalar gauge bosons have the same parities: thus each level, except the zero mode, contains both. Each mode $(l,m)$ will pick up a phase $e^{2 \\pi i \\frac{m}{n}}$, thus the modes that remain in the spectrum have $m/n$ integer.\nThis is illustrated in Figure~\\ref{fig:speccn} for $C_2$ and Figure~\\ref{fig:specc4} for $C_4$. Like for $S_{2n}$, the DM is contained in the lightest level with $m\\neq 0$, i.e. $(n, \\pm n)$, however such level contains both gauge scalars and vector (and the Higgs). This implies that the DM may have both spins, and that many states contribute to the co-annihilation processes and to the relic abundance. Nevertheless, the models always contain spin-1 gauge bosons with a mass lower than the DM one.\nThe lightest one is in $(1,0)$: even though its couplings to localised fermions are less enhanced than for $S_n$, c.f. Table~\\ref{tab:DMprop}, the fact that it is substancially lighter than the DM candidate leads to a stronger bound on the DM mass than in $S_4$.\n\n\n\nWe reckon very unlikely that the enhanced co-annihilation would raise the preferred values of the DM mass to such values, even though a specific numerical study would be required to prove our intuition.\n\n\n\n\n\\paragraph{Horizontal cyclic groups $\\boldsymbol{C_{nh}}$.}\nAdding an extra horizontal mirror identification to $C_n$ to obtain $C_{nh}$ projects out more states out of the spectrum, as it now requires vectors to have even $(l+m)$ while scalars are odd (see Fig.~\\ref{fig:speccnh} for $C_{2h}$ and Fig.~\\ref{fig:specc4h} for $C_{4h}$). This projection preserves the symmetry of $C_n$, so $m$ is also conserved in this geometry. \nThe DM level always contains gauge vectors and the Higgs resonances as the gauge scalars are projected out.\nThe lightest even spin-1 gauge boson is $(2,0)$, so that the LHC constraints are the same as for $S_4$: \nthis implies $m_{DM} > 3.9$ TeV for $C_2$ and $m_{DM} > 7$ TeV for $C_4$, and increasing values for larger $n$.\n\n\n\\paragraph{Dihedral groups $\\boldsymbol{D_n}$.}\nThe dihedral group is obtained by adding a $\\pi$-rotation around an horizontal axis to $C_n$, which keeps even $l$ modes for both scalars and vectors and projects $m\\neq 0$ states to the symmetric $Y_{lm}+Y_{l-m}$ configuration. There are two residual symmetries: a reflection around the horizontal axis and a reflexion about a vertical axis. The horizontal reflexion induces a phase $(-1)^{l+m}=(-1)^{m}$, and the vertical reflexion also induces a phase $(-1)^m$: thus, there is no odd state under the two parities for even $n$. \nThe DM level is thus the level with odd $m$ and smallest possible $l$, i.e. $(n+1,n)$. The spectrum for $D_3$ is pictures in Fig.~\\ref{fig:specdn}, while $D_5$ is represented in Fig.~\\ref{fig:specd5}. Like the case of $C_n$, each tier, except the zero mode, contains both gauge scalars and vectors. \nThe indirect LHC constraints are also determined by the gauge vectors in the level $(2,0)$, which couple directly to the localised fermions. However, in these models there are 3 independent singular points where the fermions may be localised: the poles (which are identified by the horizontal rotations), the west end of the meridian (WME at $\\theta = \\pi/2$ and $\\phi = 0$), and the east end of the meridian (EME at $\\theta = \\pi/2$ and $\\phi = \\pi/n$). \nAs it can be seen in Table~\\ref{tab:DMprop}, the wavefunction enhancement factors on the equator fixed points are a factor os $1/2$ smaller than the $S_4$ case: this can ameliorate the indirect bounds from LHC, but not substantially as the DM level is always much heavier than the $Z'$, as it arises at $l\\geq 4$.\nWe can thus conclude that the $D_n$ orbifolds are also disfavoured.\n\n\n\\section{Conclusion}\nIn this paper, we studied a class of sphere-based Extra-Dimension models with suitable geometries for featuring a dark matter candidate \nin the Kaluza-Klein spectrum. We selected the orbifolds that have a residual geometrical symmetry that prevents the decays of some resonances.\nIn order to obtain standard chiral fermions, instead of the Randjbar-Daemi--Salam--Strathdee mechanism used in previous works, we employ brane-localised fermions on orbifold fixed points. We provided a survey of all spherical symmetry \ngroups, which provided a list of locally-spherical candidates for a Kaluza-Klein dark matter model with localised fermions. \nWe constructed models where all fermions, and the gluons, are localised on a fixed point, while the electroweak gauge bosons and the Brout-Englert-Higgs field are allowed to propagate in the bulk. In general, the radius of the sphere will be bounded from above from overclosure of the Universe, while a lower pound is obtained by direct search at the LHC of even spin-1 resonances, in particular neutral $Z'$s decaying into a pair of leptons.\nFocusing on a specific simple \nmodel based on $S^2/S_4$, we studied in detail both the LHC bounds and the relic abundance constraints. We found that the two constraints completely rule out the parameter space of the model. In our study we did not explicitly include the impact of localised operators on the fixed points of the orbifold. We argued that due to the peculiar properties of this model, where the dark matter level is insensitive to such localised operators, the only operator which could help release the tension between the dark matter and collider bounds is a localised Higgs mass term. Such an operator allows to fine-tune the mass of the Higgs excitations and hit a large coannihilation resonance, making KK dark matter possible in the{$\\unit{{}}{\\tera\\electronvolt}$} region. \n\nBesides this ``Higgs funnel'' region, the tension between the two constraints is such that we can extend the conclusion to all non-polyhedral orbifold with a Dark Matter candidate. After the Run-I of the LHC, therefore, models of Dark Matter with localised fermions, based on spherical orbifold, are strongly disfavoured.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\nAD is partially supported by the ``Institut Universitaire de France''.  We also acknowledge partial support from \nthe D\\'{e}fiInphyNiTi - projet structurant TLF; the Labex-LIO (Lyon Institute of Origins) under grant ANR-10-LABX-66 and FRAMA \n(FR3127, F\\'ed\\'eration de Recherche ``Andr\\'e Marie Amp\\`ere\").\n\n\\section*{Appendices}\n\\appendix\n\\section{Lagrangian terms used for (co)annihilations}\n\\label{app:intlagrangian}\nIn this Appendix, we provide the expressions for the couplings we used in Section \\ref{dmrelic} to derive a prediction for dark matter relic density in our $S^2/S_4$ model. We provide results in the manifestly symmetric basis without Kaluza-Klein expansion and the induced term for the physical eigenstates relevant to our calculations.\n\n\\subsection{Trilinear gauge couplings}\n\nA relevant term for dark matter annihilation is the trilinear term coupling two gauge scalars to one gauge vector:\n\n\n", "itemtype": "equation", "pos": 66403, "prevtext": "\nIn this definition, the sums go through all species entering in $N$ (the dark matter particle and all near-degenerate states),\n$\\sigma_{ij}$ is the cross-section for the process $ij\\rightarrow SM$, $g_i$ is the number of degrees of freedom of state $i$,\n$\\Delta_i=\\frac{m_i-m_{DM}}{m_{DM}}$ and \n\n", "index": 77, "text": "\\begin{equation}\n  \\label{eq:dmrelic6}\n  \\sum_i^K g_i(1+\\Delta_i)^{3/2}e^{-x\\Delta_i}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"\\sum_{i}^{K}g_{i}(1+\\Delta_{i})^{3/2}e^{-x\\Delta_{i}}\\,.\" display=\"block\"><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><mi>K</mi></munderover><mrow><msub><mi>g</mi><mi>i</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi mathvariant=\"normal\">Δ</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mi>e</mi><mrow><mo>-</mo><mrow><mi>x</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Δ</mi><mi>i</mi></msub></mrow></mrow></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nFrom this expression we can derive the trilinear coupling of level\n$(2,\\pm 2)$ to the Standard Model gauge bosons:\n\n\n", "itemtype": "equation", "pos": 86297, "prevtext": "\n\nThe effect of co--annihilations are in particular very important in many\nKaluza-Klein dark matter models \\cite{Servant2003a,Arbey2012a} and as\nwe will see our model makes no exception, all the more as there is a\nhigh degeneracy between the LRP and other modes in the same tier.\n\nFor our relic density predictions, we used FeynRules \\cite{Alloul2013} to define models\nfrom the interaction terms we derive in Appendix \\ref{app:intlagrangian}. These FeynRules models\nwere used to generate CalcHEP models, which were then used in CalcHEP itself \\cite{Belyaev} to\nproduce Mathematica \\cite{WolframResearchInc} outputs for the relevant\ncross-sections, using which we could go through the calculations\noutlined in this section to obtain the present-day dark matter\ndensity, using dark matter annihilations and co--annihilations.\n\nThis calculation can be used to put upper bounds on the mass of the\ndark matter particle and thus, due to the competition with the\ndi--lepton searches, contribute to constrain the model. Indeed,\nthe relic density prediction typically grows with the mass of the dark\nmatter particle \\cite{Kong2005},  and it has to be compared with the latest Planck\nresult: $\\Omega h^2 = 0.1188 \\pm 0.0010$ \\cite{PlanckCollaboration2015}. This\nmeasurement gives a preferred value for the inverse radius, at which\nall the dark matter content in the universe can be consistently\nexplained by the model's LRP and any excess larger than two\nstandard deviations can be excluded. If the prediction is below the\nmeasured value, the model cannot be excluded with certainty as dark\nmatter may have multiple components. However, larger values are ruled\nout as it would lead to the overclosure of the Universe.\n\n\n\n\\subsection{Thermal relic density results}\n\nIn the following, we will consider two extreme cases: first, the case where only one state contributes to the DM relic abundance, and later we consider all the co-annihilation processes. The latter is a more realistic case, as the mass splittings we expect in this model are very small. We numerically checked that effects due to the splitting induced by the electroweak symmetry breaking are negligible, so that the results are shown in the most favourable case where such splittings are set to zero. The case without co-annihilation can be seen as a least favourable scenario.\n\n\n\\subsubsection{Annihilation process}\n\nThere is only one relevant channel for the annihilation of dark\nmatter: $\\varphi_A \\bar \\varphi_A \\rightarrow W^+ W^-$. Due to phase space\neffects, the production of $W$ excitations is largely suppressed and can therefore be\nneglected. Using the CalcHEP analytical expression for the matrix\nelement, we could compute the non-relativistic expansion of the\nassociated $\\left< {\\sigma v} \\right>$, which in turn allowed us to predict the dark matter density in our model, taking into account only\nannihilation. \n\nThis prediction is formulated as a function of the\nradius of the extra-dimension, and $\\Omega h^2$ increases with the mass scale of the\nextra-dimensions as expected. The result is presented in Figure\n\\ref{fig:dmrelicann} where the Planck preferred value is represented\nto show that the upper bound on the inverse radius inferred from this\ncalculation would be $\\frac{1}{R} \\leq {\\unit{{100}}{\\giga\\electronvolt}}$ which in turns means\n$ m_{l=2} \\leq {\\unit{{250}}{\\giga\\electronvolt}}$. This limit, however is too stringent as\nco--annihilation effects with other gauge scalars change the prediction\nfor the relic density significantly.\n\n\\subsubsection{Co--annihilation processes}\n\nAs we show in the Appendices \\ref{app:intlagrangian} and \\ref{app:channels}, there are several\nchannels available for co--annihilation of our dark matter candidate,\nonce the other electroweak gauge bosons are included in the\ncalculation. \nA list of all the processes we considered can be found in \\ref{app:channels} and we show in Figure \\ref{fig:coannsigv} a sample of thermal cross-sections computed using the dedicated CalcHEP module.\n\n\\begin{figure}[!h]\n\\centering\n\\includegraphics[width=0.8\\textwidth]{sigv2}\n\\caption{Characteristic sample of annihilation channels}\n\\label{fig:coannsigv}\n\\end{figure}\n\nThese processes can be sorted into several classes, as shown in Figure \\ref{fig:dmgraphs}. As we will show below, the dominant contribution comes from co--annihilation to pairs of tier-0 vector bosons (Figure \\ref{fig:ddVV}). Annihilation to fermions (Figure \\ref{fig:ddff}) is a lot less important due to the absence of s-wave processes and the associated production of a vector boson and excited vector bosons (Figure \\ref{fig:ddVVs}) is phase-space suppressed. \n\nIt is worth mentioning that we considered the possible contribution of near-resonant s-channel diagrams involving $(4,0)$ excitations like in Figure \\ref{fig:ddVV40V}, but that the resonance is still too far-off to have a significant impact on the thermal cross-sections. We should however note that a significant change can be introduced by fine-tuning the localised Higgs mass operator so that Higgs excitations hit precisely the resonance (Figure \\ref{fig:ddVV40H}). A quick estimate using a subset of all processes showed that this changes significantly the thermal cross-section -- possibly providing a small funnel in parameter space where Dark matter is allowed to be very heavy. We however leave aside the study of this fine-tuned possibility in the present work. \n\n\\begin{figure}[!h]\n  \\centering\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow V^\\mu V^\\mu$]{\\includegraphics[width=0.2\\textwidth]{ddZZ} \\label{fig:ddVV}}\n  \\hspace{1em}\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow f\\bar f$]{\\includegraphics[width=0.2\\textwidth]{ddff}\\label{fig:ddff}}\n  \\hspace{1em}\n  \\subfigure[$\\varphi\\bar\\varphi\\rightarrow V^\\mu V^{*\\mu} $]{\\includegraphics[width=0.2\\textwidth]{ddZZs}\\label{fig:ddVVs}}\n  \\newline\n  \\subfigure[Vector Resonance]{\\includegraphics[width=0.2\\textwidth]{ddZZ40V}\\label{fig:ddVV40V}}\n  \\hspace{1em}\n  \\subfigure[Higgs Resonance]{\\includegraphics[width=0.2\\textwidth]{ddZZ40H}\\label{fig:ddVV40H}}\n  \\caption{Examples of classes of processes. Thick lines represent Kaluza-Klein excitations and the fermion gauge coupling is marked to highlight its localised feature.}\n  \\label{fig:dmgraphs}\n\\end{figure}\n\nWith the caveat of the possible Higgs resonance funnel, we could compute $\\left< {\\sigma v} \\right>_{eff}$ analytically and predict\nfor $\\Omega_{DM}h^2$ as a function of $\\frac{1}{R}$. The result of\nthis calculation is presented in Figure \\ref{fig:dmrelicann}.\n\\begin{figure}[!h]\n  \\centering\n\\includegraphics[width=0.6\\textwidth]{dmreliccoann}\n  \\caption{Dark matter relic density as a function of the sphere inverse\nradius with (black) and without (grey) co--annihilations. The green band is centred around the\nPlanck preferred value and its width is given by the result's standard deviation}\n\\label{fig:dmrelicann}\n\\end{figure}\nAs expected, the upper value on $\\frac{1}{R}$ is increased\nsignificantly once co--annihilations are included. We now have the\nconstraint $\\frac{1}{R}\\leq {\\unit{{220}}{\\giga\\electronvolt}}$, which translates to\n$m_{l=2}\\leq {\\unit{{540}}{\\giga\\electronvolt}}$. While the tension is reduced with the\ncollider lower bound, there is no doubt that it is sufficient to rule\nout the bulk of this model's parameter space, outside of a fine-tuned region.\n\n\\section{Other orbifolds}\nCan we generalise the exclusion of this model to the other possible spaces? As we stated in Section \\ref{orbifolds}, there are four families of non-polyhedric orbifolds that have fixed points and symmetries and, as we will see, we can use our result to draw the broad conclusion that none provides an experimentally viable framework for extending the Standard Model.\n\n\n\\begin{table}[!h]\n\\begin{center}\n\\begin{tabular}{|l|cc|cc|cccc|}\n\\hline\nOrbifold & \\multicolumn{2}{c|}{Dark Matter} & \\multicolumn{2}{c|}{Z's} & \\multicolumn{4}{c|}{wavefunction factors}\\\\\n    &   $(l,m)$  &  spin  &  $(l,m)$  &  $m_{DM}/m_{Z'}$ & NP & SP & EME & WME \\\\\\hline\n$S_4$ & $(2,\\pm2)$ & S & $(2,0)$ & $1$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & - \\\\\n$S_6$ & $(3,\\pm3)$ & V & $(2,0)$ & $\\sqrt{2}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\\hline\n$C_2$ & $(2,\\pm2)$ & V+S & $(1,0)$ & $\\sqrt{3}$ & $-\\sqrt{3}$ & $\\sqrt{3}$ &-  & - \\\\\n$C_4$ & $(4,\\pm4)$ & V+S & $(1,0)$ & $\\sqrt{10}$ & $-\\sqrt{3}$ & $\\sqrt{3}$ &-  & -\\\\\\hline\n$C_{2h}$ & $(2,\\pm2)$ & V & $(2,0)$ & $1$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\n$C_{4h}$ & $(4,\\pm4)$ & V & $(2,0)$ & $\\sqrt{10/3}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & - & -  \\\\\\hline\n$D_3$ & $(4,3)$ & V+S & $(2,0)$ & $\\sqrt{10/3}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & $-\\sqrt{5}/2$ & $-\\sqrt{5}/2$  \\\\\n$D_5$ & $(6,5)$ & V+S & $(2,0)$ & $\\sqrt{7}$ & \\multicolumn{2}{c}{$\\sqrt{5}$} & $-\\sqrt{5}/2$ & $-\\sqrt{5}/2$  \\\\\\hline\n\\end{tabular}\n\\end{center}\n\\caption{Properties of DM and lightest $Z'$ in the lowest $n$ spherical orbifolds. For DM, S stands for gauge scalars and V for gauge vectors and Higgs. The wavefunction factors refer to the fixed points as listed in Table~\\ref{tab:orbprop}.}\n\\label{tab:DMprop}\n\\end{table}\n\n\nThe argument we put forward goes as follows:\n\\begin{itemize}\n\\item[-] In all cases, there exists an even level with mass lighter or equal to the one of the DM candidate and containing a spin-1 gauge resonance with unsuppressed couplings to the localised fermions~\\footnote{Even gauge scalars are exempt from LHC constraints as they do not couple to the localised fermions at tree level.}. Thus, the constraint from the di-lepton search always applies and requires the DM state to appear in the multi-TeV range.\n\\item[-] Our analysis shows that the preferred mass range for the DM is well below the TeV, barring Higgs resonant channels. In order to reach the multi TeV scale, the annihilation cross section would need to be strongly enhanced: for $m_{DM} = 5$ TeV, one would need a cross section larger by roughly a factor of 80.\n\\item[-] The case we studied is the least favourable one, as the DM candidate is a gauge scalar. In other cases, it may be a vector, thus receiving additional contribution to the annihilation into a pair of fermions. There are also cases where the stable level contains both vector and scalar gauge states: in any case, the needed enhancement to escape the LHC bound is very unlikely to be obtained without the help of an s-channel resonant contribution.\n\\end{itemize}\nWhile our argument is qualitative, it leads us to expect that all of the cases of natural DM on the sphere is in tension with data. A summary of the main features of the first two low--$n$ orbifold for each class can be found in Table~\\ref{tab:DMprop}: it shows that in most cases the $Z'$ is lighter than the DM and has unsuppressed couplings. Thus, the LHC always implies a strong indirect constraint on the DM mass. Furthermore, the situation is always worsened for increasing $n$.\nIn the following, we will give more details for each class of orbifold.\n\n\\paragraph{Higher order $\\boldsymbol{S_{2n}}$.}\n\nWe gave a general-$n$ analysis of the spectrum of gauge bosons on $S^2/S_4$ in Section \\ref{dmlevel}. For $n>2$, one can see that there will be \nseveral $m=0$ excitations lighter than the first stable level, which will appear for $l=n$, either in the vector or the scalar sector depending on the parity \nof $n$. In particular, the level $(2,0)$ always contains the lightest even $Z'$s. As an example, the spectrum of $S^2/S_6$ is shown in Fig.\\ref{fig:specs6} ($S^2/S_4$ in Fig.\\ref{fig:specs4} for comparison): the DM candidate is a spin-1 gauge boson in levels $(3,\\pm3)$. \nThe larger wavefunction factor and the fact that the DM candidate is heavier than the $Z'$ imply stronger bounds on the DM mass.\n\n\n\n\\begin{figure}[!h]\n  \\centering\n  \\subfigure[$S_4$]{\\includegraphics[width=0.3\\textwidth]{S4spectrum}\\label{fig:specs4}}\n  \\subfigure[$S_6$]{\\includegraphics[width=0.3\\textwidth]{S6spectrum}\\label{fig:specs6}}\n  \\subfigure[$C_2$]{\\includegraphics[width=0.3\\textwidth]{Cnspectrum}\\label{fig:speccn}}\n  \\subfigure[$C_4$]{\\includegraphics[width=0.3\\textwidth]{C4spectrum}\\label{fig:specc4}}\n  \\subfigure[$C_{2h}$]{\\includegraphics[width=0.3\\textwidth]{Cnhspectrum}\\label{fig:speccnh}}\n  \\subfigure[$C_{4h}$]{\\includegraphics[width=0.3\\textwidth]{C4hspectrum}\\label{fig:specc4h}}\n  \\subfigure[$D_{3}$]{\\includegraphics[width=0.3\\textwidth]{Dnspectrum}\\label{fig:specdn}}\n  \\subfigure[$D_{5}$]{\\includegraphics[width=0.3\\textwidth]{D6spectrum}\\label{fig:specd5}}\n  \\caption{Examples of spectra of gauge bosons on $S_n$,  $C_n$, $C_{nh}$, and $D_n$, with vectors levels displayed in black and scalars in red. The vertical axis spans values of $l$ while the horizontal axis spans $m$.}\n\\end{figure}\n\n\\paragraph{Cyclic groups $\\boldsymbol{C_n}$.}\nSpaces based on the groups $C_n$ have a $m$-conserving rotational symmetry, like $S_4$. \nAs they are defined in terms of a rotation of $\\phi$ by an angle $2\\pi/n$, both vector and scalar gauge bosons have the same parities: thus each level, except the zero mode, contains both. Each mode $(l,m)$ will pick up a phase $e^{2 \\pi i \\frac{m}{n}}$, thus the modes that remain in the spectrum have $m/n$ integer.\nThis is illustrated in Figure~\\ref{fig:speccn} for $C_2$ and Figure~\\ref{fig:specc4} for $C_4$. Like for $S_{2n}$, the DM is contained in the lightest level with $m\\neq 0$, i.e. $(n, \\pm n)$, however such level contains both gauge scalars and vector (and the Higgs). This implies that the DM may have both spins, and that many states contribute to the co-annihilation processes and to the relic abundance. Nevertheless, the models always contain spin-1 gauge bosons with a mass lower than the DM one.\nThe lightest one is in $(1,0)$: even though its couplings to localised fermions are less enhanced than for $S_n$, c.f. Table~\\ref{tab:DMprop}, the fact that it is substancially lighter than the DM candidate leads to a stronger bound on the DM mass than in $S_4$.\n\n\n\nWe reckon very unlikely that the enhanced co-annihilation would raise the preferred values of the DM mass to such values, even though a specific numerical study would be required to prove our intuition.\n\n\n\n\n\\paragraph{Horizontal cyclic groups $\\boldsymbol{C_{nh}}$.}\nAdding an extra horizontal mirror identification to $C_n$ to obtain $C_{nh}$ projects out more states out of the spectrum, as it now requires vectors to have even $(l+m)$ while scalars are odd (see Fig.~\\ref{fig:speccnh} for $C_{2h}$ and Fig.~\\ref{fig:specc4h} for $C_{4h}$). This projection preserves the symmetry of $C_n$, so $m$ is also conserved in this geometry. \nThe DM level always contains gauge vectors and the Higgs resonances as the gauge scalars are projected out.\nThe lightest even spin-1 gauge boson is $(2,0)$, so that the LHC constraints are the same as for $S_4$: \nthis implies $m_{DM} > 3.9$ TeV for $C_2$ and $m_{DM} > 7$ TeV for $C_4$, and increasing values for larger $n$.\n\n\n\\paragraph{Dihedral groups $\\boldsymbol{D_n}$.}\nThe dihedral group is obtained by adding a $\\pi$-rotation around an horizontal axis to $C_n$, which keeps even $l$ modes for both scalars and vectors and projects $m\\neq 0$ states to the symmetric $Y_{lm}+Y_{l-m}$ configuration. There are two residual symmetries: a reflection around the horizontal axis and a reflexion about a vertical axis. The horizontal reflexion induces a phase $(-1)^{l+m}=(-1)^{m}$, and the vertical reflexion also induces a phase $(-1)^m$: thus, there is no odd state under the two parities for even $n$. \nThe DM level is thus the level with odd $m$ and smallest possible $l$, i.e. $(n+1,n)$. The spectrum for $D_3$ is pictures in Fig.~\\ref{fig:specdn}, while $D_5$ is represented in Fig.~\\ref{fig:specd5}. Like the case of $C_n$, each tier, except the zero mode, contains both gauge scalars and vectors. \nThe indirect LHC constraints are also determined by the gauge vectors in the level $(2,0)$, which couple directly to the localised fermions. However, in these models there are 3 independent singular points where the fermions may be localised: the poles (which are identified by the horizontal rotations), the west end of the meridian (WME at $\\theta = \\pi/2$ and $\\phi = 0$), and the east end of the meridian (EME at $\\theta = \\pi/2$ and $\\phi = \\pi/n$). \nAs it can be seen in Table~\\ref{tab:DMprop}, the wavefunction enhancement factors on the equator fixed points are a factor os $1/2$ smaller than the $S_4$ case: this can ameliorate the indirect bounds from LHC, but not substantially as the DM level is always much heavier than the $Z'$, as it arises at $l\\geq 4$.\nWe can thus conclude that the $D_n$ orbifolds are also disfavoured.\n\n\n\\section{Conclusion}\nIn this paper, we studied a class of sphere-based Extra-Dimension models with suitable geometries for featuring a dark matter candidate \nin the Kaluza-Klein spectrum. We selected the orbifolds that have a residual geometrical symmetry that prevents the decays of some resonances.\nIn order to obtain standard chiral fermions, instead of the Randjbar-Daemi--Salam--Strathdee mechanism used in previous works, we employ brane-localised fermions on orbifold fixed points. We provided a survey of all spherical symmetry \ngroups, which provided a list of locally-spherical candidates for a Kaluza-Klein dark matter model with localised fermions. \nWe constructed models where all fermions, and the gluons, are localised on a fixed point, while the electroweak gauge bosons and the Brout-Englert-Higgs field are allowed to propagate in the bulk. In general, the radius of the sphere will be bounded from above from overclosure of the Universe, while a lower pound is obtained by direct search at the LHC of even spin-1 resonances, in particular neutral $Z'$s decaying into a pair of leptons.\nFocusing on a specific simple \nmodel based on $S^2/S_4$, we studied in detail both the LHC bounds and the relic abundance constraints. We found that the two constraints completely rule out the parameter space of the model. In our study we did not explicitly include the impact of localised operators on the fixed points of the orbifold. We argued that due to the peculiar properties of this model, where the dark matter level is insensitive to such localised operators, the only operator which could help release the tension between the dark matter and collider bounds is a localised Higgs mass term. Such an operator allows to fine-tune the mass of the Higgs excitations and hit a large coannihilation resonance, making KK dark matter possible in the{$\\unit{{}}{\\tera\\electronvolt}$} region. \n\nBesides this ``Higgs funnel'' region, the tension between the two constraints is such that we can extend the conclusion to all non-polyhedral orbifold with a Dark Matter candidate. After the Run-I of the LHC, therefore, models of Dark Matter with localised fermions, based on spherical orbifold, are strongly disfavoured.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\nAD is partially supported by the ``Institut Universitaire de France''.  We also acknowledge partial support from \nthe D\\'{e}fiInphyNiTi - projet structurant TLF; the Labex-LIO (Lyon Institute of Origins) under grant ANR-10-LABX-66 and FRAMA \n(FR3127, F\\'ed\\'eration de Recherche ``Andr\\'e Marie Amp\\`ere\").\n\n\\section*{Appendices}\n\\appendix\n\\section{Lagrangian terms used for (co)annihilations}\n\\label{app:intlagrangian}\nIn this Appendix, we provide the expressions for the couplings we used in Section \\ref{dmrelic} to derive a prediction for dark matter relic density in our $S^2/S_4$ model. We provide results in the manifestly symmetric basis without Kaluza-Klein expansion and the induced term for the physical eigenstates relevant to our calculations.\n\n\\subsection{Trilinear gauge couplings}\n\nA relevant term for dark matter annihilation is the trilinear term coupling two gauge scalars to one gauge vector:\n\n\n", "index": 79, "text": "\\begin{equation}\n  \\label{eq:1}\n {\\cal L}_{SSV}=\\frac{g}{2}\\epsilon_{abc} A_\\mu^a \\left(\n  \\eth\\Phi^b \\partial_\\mu \\bar\\eth\\Phi^c + \\bar \\eth\n  \\Phi^b \\partial\\eth\\Phi^c \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{SSV}=\\frac{g}{2}\\epsilon_{abc}A_{\\mu}^{a}\\left(\\eth\\Phi^{b}\\partial_%&#10;{\\mu}\\bar{\\eth}\\Phi^{c}+\\bar{\\eth}\\Phi^{b}\\partial\\eth\\Phi^{c}\\right).\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>S</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>V</mi></mrow></msub><mo>=</mo><mrow><mfrac><mi>g</mi><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>ϵ</mi><mrow><mi>a</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>⁢</mo><msubsup><mi>A</mi><mi>μ</mi><mi>a</mi></msubsup><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mi>ð</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>c</mi></msup></mrow></mrow></mrow><mo>+</mo><mrow><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msup><mo>⁢</mo><mrow><mo>∂</mo><mo>⁡</mo><mrow><mi>ð</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>c</mi></msup></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nand to the $(2,0)$ vector excitations:\n\n\n", "itemtype": "equation", "pos": 86608, "prevtext": "\n\nFrom this expression we can derive the trilinear coupling of level\n$(2,\\pm 2)$ to the Standard Model gauge bosons:\n\n\n", "index": 81, "text": "\\begin{equation}\n  \\label{eq:6}\n  \\begin{array}{rl}\n    {\\cal L}^{\\sc{4D}}_{\\sc{SSV}_1}= \\left. g_{4D}\\frac{1}{2i} \\right[&\n \\left(\\partial_\\mu\\bar\\varphi^+_W \\varphi^-_W\n      - \\partial_\\mu\\bar\\varphi^-_W \\varphi^+_W\\right) W^{3\\mu}_{\\sc{SM}}\n\\\\\n+&  \\left(\\partial_\\mu\\varphi^+_W \\bar\\varphi^-_W\n      - \\partial_\\mu\\varphi^-_W \\bar\\varphi^+_W\\right)\n    W^{3\\mu}_{\\sc{SM}}\\\\\n-&\\left( W^{+\\mu}_{\\sc{SM}} \\varphi_W^- - W^{-\\mu}_{\\sc{SM}} \\varphi_W^+\n\\right)\\partial_\\mu \\bar\\varphi_{W^3}\\\\\n-&\\left( W^{+\\mu}_{\\sc{SM}}\\bar \\varphi_W^- - W^{-\\mu}_{\\sc{SM}} \\bar\\varphi_W^+\n\\right)\\partial_\\mu \\varphi_{W^3}\\\\\n+&\\left( W^{+\\mu}_{\\sc{SM}} \\partial_\\mu \\varphi_W^- - W^{-\\mu}_{\\sc{SM}} \\partial_\\mu \\varphi_W^+\n\\right)\\bar\\varphi_{W^3}\\\\\n+&\\left.\\left( W^{+\\mu}_{\\sc{SM}}\\partial_\\mu \\bar \\varphi_W^- - W^{-\\mu}_{\\sc{SM}} \\partial_\\mu \\bar\\varphi_W^+\n\\right)\\varphi_{W^3}\\right]\\\\\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rl}{\\cal L}^{\\sc{4D}}_{\\sc{SSV}_{1}}=\\left.g_{4D}\\frac{1}{2i}%&#10;\\right[&amp;\\left(\\partial_{\\mu}\\bar{\\varphi}^{+}_{W}\\varphi^{-}_{W}-\\partial_{\\mu%&#10;}\\bar{\\varphi}^{-}_{W}\\varphi^{+}_{W}\\right)W^{3\\mu}_{\\sc{SM}}\\\\&#10;+&amp;\\left(\\partial_{\\mu}\\varphi^{+}_{W}\\bar{\\varphi}^{-}_{W}-\\partial_{\\mu}%&#10;\\varphi^{-}_{W}\\bar{\\varphi}^{+}_{W}\\right)W^{3\\mu}_{\\sc{SM}}\\\\&#10;-&amp;\\left(W^{+\\mu}_{\\sc{SM}}\\varphi_{W}^{-}-W^{-\\mu}_{\\sc{SM}}\\varphi_{W}^{+}%&#10;\\right)\\partial_{\\mu}\\bar{\\varphi}_{W^{3}}\\\\&#10;-&amp;\\left(W^{+\\mu}_{\\sc{SM}}\\bar{\\varphi}_{W}^{-}-W^{-\\mu}_{\\sc{SM}}\\bar{\\varphi%&#10;}_{W}^{+}\\right)\\partial_{\\mu}\\varphi_{W^{3}}\\\\&#10;+&amp;\\left(W^{+\\mu}_{\\sc{SM}}\\partial_{\\mu}\\varphi_{W}^{-}-W^{-\\mu}_{\\sc{SM}}%&#10;\\partial_{\\mu}\\varphi_{W}^{+}\\right)\\bar{\\varphi}_{W^{3}}\\\\&#10;+&amp;\\left.\\left(W^{+\\mu}_{\\sc{SM}}\\partial_{\\mu}\\bar{\\varphi}_{W}^{-}-W^{-\\mu}_{%&#10;\\sc{SM}}\\partial_{\\mu}\\bar{\\varphi}_{W}^{+}\\right)\\varphi_{W^{3}}\\right]\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SSV</mi><mn class=\"ltx_font_smallcaps\" mathvariant=\"normal\">1</mn></msub><mrow><mn class=\"ltx_font_smallcaps\" mathvariant=\"normal\">4</mn><mo>⁢</mo><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">D</mi></mrow></msubsup><mo>=</mo><msub><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>i</mi></mrow></mfrac><mo>[</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mn>3</mn><mo>⁢</mo><mi>μ</mi></mrow></msubsup></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mn>3</mn><mo>⁢</mo><mi>μ</mi></mrow></msubsup></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>-</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>-</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msub><mi>φ</mi><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><msub><mo>∂</mo><mi>μ</mi></msub><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>-</mo><msubsup><mi>W</mi><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SM</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><msub><mo>∂</mo><mi>μ</mi></msub><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>)</mo></mrow><msub><mi>φ</mi><msup><mi>W</mi><mn>3</mn></msup></msub><mo>]</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\subsection{Quadrilinear gauge couplings}\n\nQuadrilinear gauge couplings also contribute to coannihilation processes. The unexpanded symmetric term is expressed below:\n\n\n", "itemtype": "equation", "pos": 87555, "prevtext": "\n\nand to the $(2,0)$ vector excitations:\n\n\n", "index": 83, "text": "\\begin{equation}\n  \\label{eq:6}\n  \\begin{array}{rl}\n    {\\cal L}^{\\sc{4D}}_{\\sc{SSV}_2}= \\left. g_{4D}\\frac{\\sqrt{5}}{14i} \\right[&\n \\left(\\partial_\\mu\\bar\\varphi^+_W \\varphi^-_W\n      - \\partial_\\mu\\bar\\varphi^-_W \\varphi^+_W\\right) W^{3\\mu}_{(2,0)}\n\\\\\n+&  \\left(\\partial_\\mu\\varphi^+_W \\bar\\varphi^-_W\n      - \\partial_\\mu\\varphi^-_W \\bar\\varphi^+_W\\right)\n    W^{3\\mu}_{(2,0)}\\\\\n-&\\left( W^{+\\mu}_{(2,0)} \\varphi_W^- - W^{-\\mu}_{(2,0)} \\varphi_W^+\n\\right)\\partial_\\mu \\bar\\varphi_{W^3}\\\\\n-&\\left( W^{+\\mu}_{(2,0)}\\bar \\varphi_W^- - W^{-\\mu}_{(2,0)} \\bar\\varphi_W^+\n\\right)\\partial_\\mu \\varphi_{W^3}\\\\\n+&\\left( W^{+\\mu}_{(2,0)} \\partial_\\mu \\varphi_W^- - W^{-\\mu}_{(2,0)} \\partial_\\mu \\varphi_W^+\n\\right)\\bar\\varphi_{W^3}\\\\\n+&\\left.\\left( W^{+\\mu}_{(2,0)}\\partial_\\mu \\bar \\varphi_W^- - W^{-\\mu}_{(2,0)} \\partial_\\mu \\bar\\varphi_W^+\n\\right)\\varphi_{W^3}\\right]\\\\\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E44.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rl}{\\cal L}^{\\sc{4D}}_{\\sc{SSV}_{2}}=\\left.g_{4D}\\frac{\\sqrt{5%&#10;}}{14i}\\right[&amp;\\left(\\partial_{\\mu}\\bar{\\varphi}^{+}_{W}\\varphi^{-}_{W}-%&#10;\\partial_{\\mu}\\bar{\\varphi}^{-}_{W}\\varphi^{+}_{W}\\right)W^{3\\mu}_{(2,0)}\\\\&#10;+&amp;\\left(\\partial_{\\mu}\\varphi^{+}_{W}\\bar{\\varphi}^{-}_{W}-\\partial_{\\mu}%&#10;\\varphi^{-}_{W}\\bar{\\varphi}^{+}_{W}\\right)W^{3\\mu}_{(2,0)}\\\\&#10;-&amp;\\left(W^{+\\mu}_{(2,0)}\\varphi_{W}^{-}-W^{-\\mu}_{(2,0)}\\varphi_{W}^{+}\\right)%&#10;\\partial_{\\mu}\\bar{\\varphi}_{W^{3}}\\\\&#10;-&amp;\\left(W^{+\\mu}_{(2,0)}\\bar{\\varphi}_{W}^{-}-W^{-\\mu}_{(2,0)}\\bar{\\varphi}_{W%&#10;}^{+}\\right)\\partial_{\\mu}\\varphi_{W^{3}}\\\\&#10;+&amp;\\left(W^{+\\mu}_{(2,0)}\\partial_{\\mu}\\varphi_{W}^{-}-W^{-\\mu}_{(2,0)}\\partial%&#10;_{\\mu}\\varphi_{W}^{+}\\right)\\bar{\\varphi}_{W^{3}}\\\\&#10;+&amp;\\left.\\left(W^{+\\mu}_{(2,0)}\\partial_{\\mu}\\bar{\\varphi}_{W}^{-}-W^{-\\mu}_{(2%&#10;,0)}\\partial_{\\mu}\\bar{\\varphi}_{W}^{+}\\right)\\varphi_{W^{3}}\\right]\\\\&#10;\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><msub><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">SSV</mi><mn class=\"ltx_font_smallcaps\" mathvariant=\"normal\">2</mn></msub><mrow><mn class=\"ltx_font_smallcaps\" mathvariant=\"normal\">4</mn><mo>⁢</mo><mi class=\"ltx_font_smallcaps\" mathvariant=\"normal\">D</mi></mrow></msubsup><mo>=</mo><msub><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mfrac><msqrt><mn>5</mn></msqrt><mrow><mn>14</mn><mo>⁢</mo><mi>i</mi></mrow></mfrac><mo>[</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>⁢</mo><mi>μ</mi></mrow></msubsup></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mrow><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>⁢</mo><mi>μ</mi></mrow></msubsup></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>-</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>-</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msub><mi>φ</mi><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow></mrow><mo>-</mo><mrow><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><msup><mi>W</mi><mn>3</mn></msup></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mo>+</mo></mtd><mtd columnalign=\"left\"><mrow><mrow><mo>(</mo><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>+</mo><mi>μ</mi></mrow></msubsup><msub><mo>∂</mo><mi>μ</mi></msub><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>-</mo><msubsup><mi>W</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo>,</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mi>μ</mi></mrow></msubsup><msub><mo>∂</mo><mi>μ</mi></msub><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>)</mo></mrow><msub><mi>φ</mi><msup><mi>W</mi><mn>3</mn></msup></msub><mo>]</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\nwhich we can break down into different contributions.\n\n\\paragraph{Neutral scalars coupling to charged vectors}\n\nThe part ${\\cal L}_{V_sV_sWW}$ which couples neutral gauge scalars and SM $W$ bosons are all\nincluded in the first term of $\\int{\\cal L}_{SSVV}$:\n\n\n", "itemtype": "equation", "pos": 88618, "prevtext": "\n\n\\subsection{Quadrilinear gauge couplings}\n\nQuadrilinear gauge couplings also contribute to coannihilation processes. The unexpanded symmetric term is expressed below:\n\n\n", "index": 85, "text": "\\begin{equation}\n  \\label{eq:3}\n  {\\cal L}_{SSVV} = \\frac{1}{2}g^2 \\left[ A_\\mu^a A_a^\\mu \\eth \\Phi^b \\bar \\eth \\Phi_b\n  - A^a_\\mu \\eth\\Phi_a A_b^\\mu \\bar\\eth \\Phi^b  \\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E45.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{SSVV}=\\frac{1}{2}g^{2}\\left[A_{\\mu}^{a}A_{a}^{\\mu}\\eth\\Phi^{b}\\bar{%&#10;\\eth}\\Phi_{b}-A^{a}_{\\mu}\\eth\\Phi_{a}A_{b}^{\\mu}\\bar{\\eth}\\Phi^{b}\\right],\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>S</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>V</mi><mo>⁢</mo><mi>V</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msup><mi>g</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mi>A</mi><mi>μ</mi><mi>a</mi></msubsup><mo>⁢</mo><msubsup><mi>A</mi><mi>a</mi><mi>μ</mi></msubsup><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msup><mo>⁢</mo><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msub></mrow><mo>-</mo><mrow><msubsup><mi>A</mi><mi>μ</mi><mi>a</mi></msubsup><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mi>a</mi></msub><mo>⁢</mo><msubsup><mi>A</mi><mi>b</mi><mi>μ</mi></msubsup><mo>⁢</mo><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msup><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msup></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\paragraph{Neutral and charged scalars coupling to\n  neutral and charged vectors}\nThis mixed coupling ${\\cal L}_{V_sW_sVW}$ arises from the second term in $\\int{\\cal L}_{SSVV}$:\n\n\n", "itemtype": "equation", "pos": 89069, "prevtext": "\n\nwhich we can break down into different contributions.\n\n\\paragraph{Neutral scalars coupling to charged vectors}\n\nThe part ${\\cal L}_{V_sV_sWW}$ which couples neutral gauge scalars and SM $W$ bosons are all\nincluded in the first term of $\\int{\\cal L}_{SSVV}$:\n\n\n", "index": 87, "text": "\\begin{equation}\n  \\label{eq:2}\n    {\\cal L}_{ V_sV_sWW}= g^2_{4D} W^+_{SM\\mu } W_{-\\mu}^{SM}\n\\bar\\varphi_{A^3} \\varphi_{A^3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E46.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{V_{s}V_{s}WW}=g^{2}_{4D}W^{+}_{SM\\mu}W_{-\\mu}^{SM}\\bar{\\varphi}_{A^{%&#10;3}}\\varphi_{A^{3}}\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><msub><mi>V</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>V</mi><mi>s</mi></msub><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>W</mi></mrow></msub><mo>=</mo><mrow><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>W</mi><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>μ</mi></mrow><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>W</mi><mrow><mo>-</mo><mi>μ</mi></mrow><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi></mrow></msubsup><mo>⁢</mo><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><msup><mi>A</mi><mn>3</mn></msup></msub><mo>⁢</mo><msub><mi>φ</mi><msup><mi>A</mi><mn>3</mn></msup></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\paragraph{Charged scalars annihilation to charged vectors}\nThis coupling, ${\\cal L}_{W_sW_sWW}$ requires both terms from $\\int{\\cal L}_{SSVV}$:\n\n\n", "itemtype": "equation", "pos": 89390, "prevtext": "\n\n\\paragraph{Neutral and charged scalars coupling to\n  neutral and charged vectors}\nThis mixed coupling ${\\cal L}_{V_sW_sVW}$ arises from the second term in $\\int{\\cal L}_{SSVV}$:\n\n\n", "index": 89, "text": "\\begin{equation}\n  \\label{eq:4}\n      {\\cal L}_{V_sW_sVW}=- \\frac{1}{2}g_{4D} A^3_\\mu \\left[ \\varphi^3 \\left(W^{+\\mu}\\bar\\varphi_W^-+W^{-\\mu}\\bar\\varphi_W^+\\right) + \\bar\\varphi^3 \\left(W^{+\\mu}\\varphi_W^-+W^{-\\mu}\\varphi_W^+\\right) \\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E47.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{V_{s}W_{s}VW}=-\\frac{1}{2}g_{4D}A^{3}_{\\mu}\\left[\\varphi^{3}\\left(W^%&#10;{+\\mu}\\bar{\\varphi}_{W}^{-}+W^{-\\mu}\\bar{\\varphi}_{W}^{+}\\right)+\\bar{\\varphi}%&#10;^{3}\\left(W^{+\\mu}\\varphi_{W}^{-}+W^{-\\mu}\\varphi_{W}^{+}\\right)\\right]\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><msub><mi>V</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>W</mi><mi>s</mi></msub><mo>⁢</mo><mi>V</mi><mo>⁢</mo><mi>W</mi></mrow></msub><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msub><mo>⁢</mo><msubsup><mi>A</mi><mi>μ</mi><mn>3</mn></msubsup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msup><mi>φ</mi><mn>3</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msup><mi>W</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msup><mi>W</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msup><mo>⁢</mo><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mrow><msup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mn>3</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msup><mi>W</mi><mrow><mo>+</mo><mi>μ</mi></mrow></msup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msup><mi>W</mi><mrow><mo>-</mo><mi>μ</mi></mrow></msup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\paragraph{Charged scalars annihilation to neutral vectors}\nThis coupling, ${\\cal L}_{W_sW_sVV}$ requires only the first term from\n${\\cal L}_{SSVV}$:\n\n", "itemtype": "equation", "pos": 89793, "prevtext": "\n\n\\paragraph{Charged scalars annihilation to charged vectors}\nThis coupling, ${\\cal L}_{W_sW_sWW}$ requires both terms from $\\int{\\cal L}_{SSVV}$:\n\n\n", "index": 91, "text": "\\begin{equation}\n  \\label{eq:5}\n  \\begin{array}{rl}\n      {\\cal L}_{W_sW_sWW}&= \\frac{1}{2} g^2_{4D}\n\\left[ W_+^{SM\\mu} W_{-\\mu}^{SM} \\left( \\varphi_W^+ \\bar\\varphi_W^- +\n    \\varphi_W^- \\bar\\varphi_W^+ \\right) - W^{SM}_{+\\mu} W^{SM\\mu}_{+}\n  \\bar\\varphi_W^- \\varphi_W^-\\right. \\\\\n&\\left.\\phantom{aaaaaaaaa aaaaaaaaa aaaaaaaaa aaaaaaa}- W^{SM}_{-\\mu} W^{SM\\mu}_{-}\n  \\bar\\varphi_W^+ \\varphi_W^+\\right]\n  \\end{array}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E48.m1\" class=\"ltx_Math\" alttext=\"\\begin{array}[]{rl}{\\cal L}_{W_{s}W_{s}WW}&amp;=\\frac{1}{2}g^{2}_{4D}\\left[W_{+}^{%&#10;SM\\mu}W_{-\\mu}^{SM}\\left(\\varphi_{W}^{+}\\bar{\\varphi}_{W}^{-}+\\varphi_{W}^{-}%&#10;\\bar{\\varphi}_{W}^{+}\\right)-W^{SM}_{+\\mu}W^{SM\\mu}_{+}\\bar{\\varphi}_{W}^{-}%&#10;\\varphi_{W}^{-}\\right.\\\\&#10;&amp;\\left.\\phantom{aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa}-W^{SM}_{-\\mu}W^{SM\\mu}_{-}%&#10;\\bar{\\varphi}_{W}^{+}\\varphi_{W}^{+}\\right]\\end{array}\" display=\"block\"><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><msub><mi>W</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>W</mi><mi>s</mi></msub><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>W</mi></mrow></msub></mtd><mtd columnalign=\"left\"><mrow><mo>=</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mrow><mo>[</mo><msubsup><mi>W</mi><mo>+</mo><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>μ</mi></mrow></msubsup><msubsup><mi>W</mi><mrow><mo>-</mo><mi>μ</mi></mrow><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi></mrow></msubsup><mrow><mo>(</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>+</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>)</mo></mrow><mo>-</mo><msubsup><mi>W</mi><mrow><mo>+</mo><mi>μ</mi></mrow><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi></mrow></msubsup><msubsup><mi>W</mi><mo>+</mo><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>μ</mi></mrow></msubsup><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow></mrow></mtd></mtr><mtr><mtd/><mtd columnalign=\"left\"><mrow><mo>-</mo><msubsup><mi>W</mi><mrow><mo>-</mo><mi>μ</mi></mrow><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi></mrow></msubsup><msubsup><mi>W</mi><mo>-</mo><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>μ</mi></mrow></msubsup><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup><mo>]</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\subsection{Scalar gauge boson couplings to the Higgs boson}\n\nIn this section, we present the expression for the Higgs field couplings to the gauge scalars, as these provide a channel for dark matter coannihilation. The 6D gauge invariant expression for the term generating trilinear and quadratic couplings is \n\n\n", "itemtype": "equation", "pos": 90375, "prevtext": "\n\n\\paragraph{Charged scalars annihilation to neutral vectors}\nThis coupling, ${\\cal L}_{W_sW_sVV}$ requires only the first term from\n${\\cal L}_{SSVV}$:\n\n", "index": 93, "text": "\\begin{equation}\n  \\label{eq:7}\n     {\\cal L}_{W_sW_sVV} =\\frac{1}{2}g^2_{4D} A^3_{SM\\mu} A^{SM\\mu_3} \\left[\\bar\\varphi_W^+\n  \\varphi_W^- + \\bar \\varphi_W^- \\varphi_W^+ \\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E49.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{W_{s}W_{s}VV}=\\frac{1}{2}g^{2}_{4D}A^{3}_{SM\\mu}A^{SM\\mu_{3}}\\left[%&#10;\\bar{\\varphi}_{W}^{+}\\varphi_{W}^{-}+\\bar{\\varphi}_{W}^{-}\\varphi_{W}^{+}\\right]\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><msub><mi>W</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>W</mi><mi>s</mi></msub><mo>⁢</mo><mi>V</mi><mo>⁢</mo><mi>V</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>A</mi><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><mi>μ</mi></mrow><mn>3</mn></msubsup><mo>⁢</mo><msup><mi>A</mi><mrow><mi>S</mi><mo>⁢</mo><mi>M</mi><mo>⁢</mo><msub><mi>μ</mi><mn>3</mn></msub></mrow></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\paragraph{Quadratic coupling for scalar annihilation to Higgs boson pairs}\n\nThis coupling is obtained from $\\int{\\cal L}_{SSHH}$ by expanding in KK modes and projecting to physical states, which gives a 4D lagrangian term\n\n\n", "itemtype": "equation", "pos": 90881, "prevtext": "\n\n\\subsection{Scalar gauge boson couplings to the Higgs boson}\n\nIn this section, we present the expression for the Higgs field couplings to the gauge scalars, as these provide a channel for dark matter coannihilation. The 6D gauge invariant expression for the term generating trilinear and quadratic couplings is \n\n\n", "index": 95, "text": "\\begin{equation}\n  {\\cal L}_{SSHH} = - \\frac{1}{8} H^\\dagger H \\bar\\eth \\phi^a \\eth \\phi\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E50.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{SSHH}=-\\frac{1}{8}H^{\\dagger}H\\bar{\\eth}\\phi^{a}\\eth\\phi\" display=\"block\"><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>S</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>H</mi></mrow></msub><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>8</mn></mfrac><mo>⁢</mo><msup><mi>H</mi><mo>†</mo></msup><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mover accent=\"true\"><mi>ð</mi><mo stretchy=\"false\">¯</mo></mover><mo>⁢</mo><msup><mi>ϕ</mi><mi>a</mi></msup><mo>⁢</mo><mi>ð</mi><mo>⁢</mo><mi>ϕ</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\n\\paragraph{Trilinear coupling for scalar annihilation to a single Higgs boson}\n\nWe can easily generate the trilinear coupling of the dark matter level to Higgs bosons by replacing the Higgs field by its vacuum expectation value:\n\n\n", "itemtype": "equation", "pos": 91210, "prevtext": "\n\n\\paragraph{Quadratic coupling for scalar annihilation to Higgs boson pairs}\n\nThis coupling is obtained from $\\int{\\cal L}_{SSHH}$ by expanding in KK modes and projecting to physical states, which gives a 4D lagrangian term\n\n\n", "index": 97, "text": "\\begin{equation}\n  \\label{eq:9}\n      {\\cal L}_{SSHH}^{4D} = -\\frac{1}{8} g^2_{4D} hh \\left[\n      \\bar \\varphi_W^+ \\varphi_W^- + \\bar\\varphi_W^- \\varphi_W^+ +\n      \\frac{\\bar\\varphi_Z \\varphi_Z}{\\cos^2 \\theta_W} \\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E51.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{SSHH}^{4D}=-\\frac{1}{8}g^{2}_{4D}hh\\left[\\bar{\\varphi}_{W}^{+}%&#10;\\varphi_{W}^{-}+\\bar{\\varphi}_{W}^{-}\\varphi_{W}^{+}+\\frac{\\bar{\\varphi}_{Z}%&#10;\\varphi_{Z}}{\\cos^{2}\\theta_{W}}\\right]\" display=\"block\"><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>S</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>H</mi></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msubsup><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>8</mn></mfrac><mo>⁢</mo><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow><mo>+</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>Z</mi></msub><mo>⁢</mo><msub><mi>φ</mi><mi>Z</mi></msub></mrow><mrow><msup><mi>cos</mi><mn>2</mn></msup><mo>⁡</mo><msub><mi>θ</mi><mi>W</mi></msub></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00081.tex", "nexttext": "\n\\newpage\n\\section{Annihilation and coannihilation channels}\n\\label{app:channels}\n\n\\subsection{Vector Final States}\n\\begin{table}[!h]\n\\centering\n\\begin{tabular}{c|c|c||c|c|c}\nInitial state & Final state & $\\langle \\sigma v \\rangle$ & Initial\nstate & Final state & $\\langle \\sigma v \\rangle$\\\\\\hline\n$\\varphi_A\\ \\bar \\varphi_A$& $W^+_\\mu W^-_\\mu $& $\\left< {\\sigma v} \\right>_{{1}}$ &\n$\\varphi_A\\ \\bar \\varphi_Z$& $ W^+_\\mu W^-_\\mu $ & $\\left< {\\sigma v} \\right>_{{2}}$ \\\\\n$\\varphi_Z\\ \\bar \\varphi_A$& $W^+_\\mu W^-_\\mu $&$\\left< {\\sigma v} \\right>_{{2}}$ &\n$\\varphi_Z\\ \\bar \\varphi_Z$& $ W^+_\\mu W^-_\\mu $ & $\\left< {\\sigma v} \\right>_{{3}}$\\\\\n\n$\\varphi_A\\ \\bar \\varphi_W^+$& $W^+_\\mu A_\\mu $&$\\left< {\\sigma v} \\right>_{{4}}$ &\n$\\varphi_A\\ \\bar \\varphi_W^-$& $ W^-_\\mu A_\\mu $ &$\\left< {\\sigma v} \\right>_{{4}}$ \\\\\n$ \\varphi_W^+ \\bar \\varphi_A\\ $& $W^+_\\mu A_\\mu $& $\\left< {\\sigma v} \\right>_{{4}}$ &\n$ \\varphi_W^-\\bar \\varphi_A\\ $& $ W^-_\\mu A_\\mu $ & $\\left< {\\sigma v} \\right>_{{4}}$ \\\\\n\n$\\varphi_A\\ \\bar \\varphi_W^+$& $W^+_\\mu Z_\\mu $&$\\left< {\\sigma v} \\right>_{{5}}$ &\n$\\varphi_A\\ \\bar \\varphi_W^-$& $ W^-_\\mu Z_\\mu $ & $\\left< {\\sigma v} \\right>_{{5}}$ \\\\\n$ \\varphi_W^+ \\bar \\varphi_A\\ $& $W^+_\\mu Z_\\mu $&$\\left< {\\sigma v} \\right>_{{5}}$&\n$ \\varphi_W^-\\bar \\varphi_A\\ $& $ W^-_\\mu Z_\\mu $ &$\\left< {\\sigma v} \\right>_{{5}}$ \\\\\n\n$\\varphi_Z\\ \\bar \\varphi_W^+$& $W^+_\\mu Z_\\mu $& $\\left< {\\sigma v} \\right>_{{6}}$&\n$\\varphi_Z\\ \\bar \\varphi_W^-$& $ W^-_\\mu Z_\\mu $ & $\\left< {\\sigma v} \\right>_{{6}}$\\\\\n$ \\varphi_W^+ \\bar \\varphi_Z\\ $& $W^+_\\mu Z_\\mu $&$\\left< {\\sigma v} \\right>_{{6}}$ &\n$ \\varphi_W^-\\bar \\varphi_Z\\ $& $ W^-_\\mu Z_\\mu $ & $\\left< {\\sigma v} \\right>_{{6}}$\\\\\n\n$\\varphi_Z\\ \\bar \\varphi_W^+$& $W^+_\\mu A_\\mu $&$\\left< {\\sigma v} \\right>_{{7}}$ &\n$\\varphi_Z\\ \\bar \\varphi_W^-$& $ W^-_\\mu A_\\mu $ &$\\left< {\\sigma v} \\right>_{{7}}$ \\\\\n$ \\varphi_W^+ \\bar \\varphi_Z\\ $& $W^+_\\mu A_\\mu $&$\\left< {\\sigma v} \\right>_{{7}}$ &\n$ \\varphi_W^-\\bar \\varphi_Z\\ $& $ W^-_\\mu A_\\mu$ & $\\left< {\\sigma v} \\right>_{{7}}$\\\\\n\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $A_\\mu A_\\mu$ &$\\left< {\\sigma v} \\right>_{{8}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $A_\\mu A_\\mu$ & $\\left< {\\sigma v} \\right>_{{8}}$\\\\\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $Z_\\mu A_\\mu$ &$\\left< {\\sigma v} \\right>_{{9}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $Z_\\mu A_\\mu$ &$\\left< {\\sigma v} \\right>_{{9}}$ \\\\\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $Z_\\mu Z_\\mu$ &$\\left< {\\sigma v} \\right>_{{10}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $Z_\\mu Z_\\mu$ &$\\left< {\\sigma v} \\right>_{{10}}$ \\\\\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $W^+_\\mu W^-_\\mu$ &$\\left< {\\sigma v} \\right>_{{11}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $W^+_\\mu W^-_\\mu$ &$\\left< {\\sigma v} \\right>_{{11}}$ \\\\\n$\\varphi_W^+\\ \\bar \\varphi_W^+$& $W^+_\\mu W^+_\\mu$ &$\\left< {\\sigma v} \\right>_{{12}}$ &\n$\\varphi_W^-\\ \\bar \\varphi_W^-$& $W^-_\\mu W^-_\\mu$ &$\\left< {\\sigma v} \\right>_{{12}}$ \\\\\n\n\n\n\\end{tabular}\n\\caption{Coannihilation processes with vector final states}\n\\end{table}\n\n\n\n\\subsection{Higgs Final States}\n\n\\begin{table}[!h]\n\\centering\n\\begin{tabular}{c|c|c||c|c|c}\nInitial state & Final state & $\\langle \\sigma v \\rangle$ & Initial\nstate & Final state & $\\langle \\sigma v \\rangle$\\\\\\hline\n\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $H H$ & $\\left< {\\sigma v} \\right>_{{13}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $H H$ &$\\left< {\\sigma v} \\right>_{{13}}$ \\\\\n$\\varphi_Z\\ \\bar \\varphi_Z$& $H H$ &$\\left< {\\sigma v} \\right>_{{14}}$ \\\\\n\n\\end{tabular}\n\\caption{Coannihilation processes for Higgs final states}\n\\end{table}\n\n\n\n\\subsection{Fermionic Final States}\nWe define $f$ as the set of fermions in the Standard Model ($u,\\ c,\\\nt,\\ d,\\ s,\\ b,\\ e^-,\\ \\mu^-,\\ \\tau^-, \\nu_e,\\ \\nu_\\mu,\\ \\nu_\\tau$) and\n$\\bar f$ the set of antifermions. \n\\begin{table}[!h]\n\\centering\n\\begin{tabular}{c|c|c||c|c|c}\nInitial state & Final state & $\\langle \\sigma v \\rangle$ & Initial state & Final state & $\\langle \\sigma v \\rangle$\\\\\\hline\n$\\varphi_A\\ \\bar \\varphi_A$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{15}}$ &\n$\\varphi_A\\ \\bar \\varphi_Z$& $f\\bar f$ & $\\left< {\\sigma v} \\right>_{{16}}$\\\\\n$\\varphi_A\\ \\bar \\varphi_W^+$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{17}}$ &\n$\\varphi_A\\ \\bar \\varphi_W^-$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{17}}$ \\\\\n$\\varphi_Z\\ \\bar \\varphi_A$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{16}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_A$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{17}}$ \\\\\n$\\varphi_W^-\\ \\bar \\varphi_A$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{17}}$ &\n$\\varphi_Z\\ \\bar \\varphi_Z$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{18}}$ \\\\\n$\\varphi_W^+\\ \\bar \\varphi_Z$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{19}}$ &\n$\\varphi_W^-\\ \\bar \\varphi_Z$& $f\\bar f$ & $\\left< {\\sigma v} \\right>_{{19}}$\\\\\n$\\varphi_Z\\ \\bar \\varphi_W^+$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{19}}$ &\n$\\varphi_Z\\ \\bar \\varphi_W^-$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{19}}$ \\\\\n$\\varphi_W^-\\ \\bar \\varphi_W^+$& $f\\bar f$ &$\\left< {\\sigma v} \\right>_{{20}}$ &\n$\\varphi_W^+\\ \\bar \\varphi_W^-$& $f\\bar f$ & $\\left< {\\sigma v} \\right>_{{20}}$\\\\\n\n\n\n\\end{tabular}\n\\caption{Coannihilation processes with fermionic final states}\n\\end{table}\n\n\n\n\\bibliographystyle{toolfiles/JHEP}\n\\bibliography{content/biblio}\n\n\n", "itemtype": "equation", "pos": 91678, "prevtext": "\n\n\\paragraph{Trilinear coupling for scalar annihilation to a single Higgs boson}\n\nWe can easily generate the trilinear coupling of the dark matter level to Higgs bosons by replacing the Higgs field by its vacuum expectation value:\n\n\n", "index": 99, "text": "\\begin{equation}\n  \\label{eq:8}\n      {\\cal L}_{SSH}^{4D} = -\\frac{1}{4}g_{4D}^2 v h \\left[ \\bar \\varphi_W^+ \\varphi_W^- + \\bar\\varphi_W^- \\varphi_W^+ +\n      \\frac{\\bar\\varphi_Z \\varphi_Z}{cos^2 \\theta_W}  \\right] \\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E52.m1\" class=\"ltx_Math\" alttext=\"{\\cal L}_{SSH}^{4D}=-\\frac{1}{4}g_{4D}^{2}vh\\left[\\bar{\\varphi}_{W}^{+}\\varphi%&#10;_{W}^{-}+\\bar{\\varphi}_{W}^{-}\\varphi_{W}^{+}+\\frac{\\bar{\\varphi}_{Z}\\varphi_{%&#10;Z}}{cos^{2}\\theta_{W}}\\right]\\\\&#10;\" display=\"block\"><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>S</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>H</mi></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow></msubsup><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>4</mn></mfrac><mo>⁢</mo><msubsup><mi>g</mi><mrow><mn>4</mn><mo>⁢</mo><mi>D</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><mi>v</mi><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>+</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>-</mo></msubsup></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>W</mi><mo>-</mo></msubsup><mo>⁢</mo><msubsup><mi>φ</mi><mi>W</mi><mo>+</mo></msubsup></mrow><mo>+</mo><mfrac><mrow><msub><mover accent=\"true\"><mi>φ</mi><mo stretchy=\"false\">¯</mo></mover><mi>Z</mi></msub><mo>⁢</mo><msub><mi>φ</mi><mi>Z</mi></msub></mrow><mrow><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><msup><mi>s</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>θ</mi><mi>W</mi></msub></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]