[{"file": "1601.03052.tex", "nexttext": "\nwhere $M = M_{\\rm belt} + M_{\\rm star}$ is the total mass of the lensing \nsystem. In the lens plane, the physical scale corresponding to $\\theta_E$ is\n\n", "itemtype": "equation", "pos": 6078, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\\begin{abstract}\nWe propose that extrasolar asteroid belts can be detected through their \ngravitational microlensing signatures. Asteroid belt + star lens systems \ncreate so-called ``pseudo-caustics'', regions in the source plane where the \nmagnification exhibits a finite but discontinuous jump. These features allow \nsuch systems to generate distinctive microlensing light curves across a wide \nregion of belt parameter space and possess remarkably large lensing \ncross-sections. Sample light curves for a range of asteroid belt \nparameters are presented. In the near future, space-based microlensing \nsurveys (e.g., WFIRST) may be able to discover extrasolar asteroid belts \nwith masses of the order of $0.1 M_{\\oplus}$. \n\\end{abstract}\n\n\\begin{keywords}\ngravitational lensing: strong --- gravitational lensing: micro --- asteroids: general\n\\end{keywords}\n\n\\section{Introduction}\n\nGravitational microlensing has established itself as a valuable tool for \ndetecting objects covering a wide range of mass \\citep[e.g.,][]{Paczynski86}.\nSuccessful microlensing surveys began over two decades ago with target star \nfields in both the Galactic bulge \\citep{Udalski93} and the Small\nand Large Magellanic Clouds (SMC and LMC; \\citealt{Alcock93,Aubourg93}). \nAs pointed out by \\citet{Mao91}, microlensing\ncan be used to probe extrasolar planetary systems. Following the discovery\nof exoplanets through the microlensing technique \\citep[e.g.,][]{Bond04,\nUdalski05,Beaulieu06}, the number of detections has been steadily increasing\ninto the several dozens \\citep[e.g.,][]{Kains13, Gould14, Suzuki14, Batista14}.\nOwing to its sensitivity to low-mass planets and planets beyond the snow line,\nmicrolensing has emerged as an important method to detect and study exoplanets\n\\citep[e.g.,][]{Gaudi10}. In addition, microlensing can also be applied to \ndetect and characterize  free-floating planets \\citep{Gaudi02,Sumi11}. \n\nIt has also been suggested that microlensing can lend itself to the \nobservational study of various parts of the planet-formation process, like \ncircumstellar \ndiscs around source stars \\citep{Zheng05} and lens stars \\citep{Hundertmark09}.\nIn this paper, we propose to use microlensing to detect extrasolar asteroid \nbelts around lens stars.\n\nThe observational study of extrasolar asteroid belts and debris discs has \nrecently become an active field of study. Asteroid-belt and Kuiper-belt like \nanalogs have been inferred around several extrasolar systems from the observed \ninfrared excess of their host stars \\citep[e.g.,][]{Chen01,Beichman05,\nMoerchen07,Chen09,Backman09,Moerchen10}, resulting from dust generated by \ncollisions of asteroids. Multiple asteroid-sized objects have also been\nfound to transit a white dwarf \\citep[e.g.,][]{Vanderburg15,Croll15}. Residual\ntiming variations in millisecond pulsars are proposed as originating from \nasteroid belts \\citep[e.g.,][]{Shannon13}. \n\n\n\n\n\nDetermining the prevalence of extrasolar asteroid belts could shed insight \ninto the planet formation process and even help estimate the frequency of \nextraterrestrial life \\citep{Martin13}. Therefore, it would be valuable if \nwe have complementary and effective methods to probe extrasolar asteroid belts\naround main sequence stars.\n\nIn this paper, we show that microlensing by the lens system composed of a \nstar and an asteroid belt can be a promising method. Microlensing is useful \nin this regard because of its sensitivity to low-mass objects located near \nthe Einstein ring radius, which is typically on the order of a few AU. We find \nthat asteroid belt + star lenses produce a wide variety of so-called \n``pseudo-caustics'', loci in the source plane across which the \nmagnification of a source has a finite jump \n\\citep[e.g.,][]{Evans98,Rhie10,Lee14,Lake15}. A detailed investigation\non the magnification properties for the general ring/belt+point lens has \nbeen presented in \\citet{Lake15}.\nIn this paper, we show that sources passing over the pseudo-caustics can \nleave unique signatures in the resulting microlensing light curves, which\nshould be easily identifiable \nin upcoming observational surveys. Furthermore, the {pseudo-caustics}\\ occupy a \ncomparatively large region of the source plane, meaning that the lensing \ncross-section is significantly higher than in planetary microlensing events. \n\n\n\n\n\n\n\nThe structure of this paper is as follows. In Section~\\ref{sec:pss}, we recall key gravitational lensing equations and describe the {pseudo-caustics}\\ that are formed by the lenses we consider. Section~\\ref{sec:lcurves} is devoted to the presentation of model light curves for a few illustrative cases. Finally, Section~\\ref{sec:dis} consists of a summary and a discussion of our results. \n\n\\section{Magnification properties of belt+star lenses}\\label{sec:pss}\n\n\\subsection{Lensing equations}\n\nThe lens system here is composed of a star and an asteroid belt.\nWe consider lens models with both idealised narrow rings and more realistic \nwide belts, which exhibit qualitatively similar behaviors. In each model, \nthe circularly symmetric ring/belt is centred at the star. We denote the \ndistance between the observer and the lens (source) as $D_L$ \n($D_S$) and the distance between the lens and source as $D_{LS}$ \n($D_S=D_L+D_{LS}$). \nThe belt is described by an inner radius $a_i$ and an outer\nradius $a_o$ ($a_i=a_o=a$ in the case of a ring), the inclination angle $i$\n(i.e., the angle between the normal of the ring/belt plane and the line of \nsight direction), and the mass ratio $q$ of the ring/belt to the central lens \nstar.  We express the angular position vectors in the image (lens) plane and \nsource plane as ${\\boldsymbol{r}}_I = (x_I,y_I)$ and ${\\boldsymbol{r}}_S = (x_S,y_S)$, respectively, \nwith the origin being the position of the lens star and the $x$-axis oriented\nalong the major axis of the projected ring/belt. \n\nThroughout, we normalize all angular vectors and ring/belt \nsizes by the Einstein ring radius of the combined ring/belt+star system,\n\n", "index": 1, "text": "\\begin{equation} \\label{eq:er}\n\\theta_E = \\sqrt{\\frac{4GM}{c^2}\\frac{D_{LS}}{D_LD_S}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\theta_{E}=\\sqrt{\\frac{4GM}{c^{2}}\\frac{D_{LS}}{D_{L}D_{S}}},\" display=\"block\"><mrow><mrow><msub><mi>θ</mi><mi>E</mi></msub><mo>=</mo><msqrt><mrow><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi>M</mi></mrow><msup><mi>c</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><msub><mi>D</mi><mrow><mi>L</mi><mo>⁢</mo><mi>S</mi></mrow></msub><mrow><msub><mi>D</mi><mi>L</mi></msub><mo>⁢</mo><msub><mi>D</mi><mi>S</mi></msub></mrow></mfrac></mrow></msqrt></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03052.tex", "nexttext": "\nwhere $D$ satisfies $1/D = 1/D_L + 1/D_{LS}$.\n\nThe general lens equation is\n\n", "itemtype": "equation", "pos": 6331, "prevtext": "\nwhere $M = M_{\\rm belt} + M_{\\rm star}$ is the total mass of the lensing \nsystem. In the lens plane, the physical scale corresponding to $\\theta_E$ is\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:xi0}\nD_L \\theta_E \\approx 4 \\left(\\frac{D}{2{\\rm kpc}}\\right)^{1/2} \\left(\\frac{M}{M_\\odot}\\right)^{1/2} {\\rm AU},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"D_{L}\\theta_{E}\\approx 4\\left(\\frac{D}{2{\\rm kpc}}\\right)^{1/2}\\left(\\frac{M}{%&#10;M_{\\odot}}\\right)^{1/2}{\\rm AU},\" display=\"block\"><mrow><mrow><mrow><msub><mi>D</mi><mi>L</mi></msub><mo>⁢</mo><msub><mi>θ</mi><mi>E</mi></msub></mrow><mo>≈</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>D</mi><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">k</mi><mo>⁢</mo><mi mathvariant=\"normal\">p</mi><mo>⁢</mo><mi mathvariant=\"normal\">c</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>M</mi><msub><mi>M</mi><mo>⊙</mo></msub></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mi>AU</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03052.tex", "nexttext": "\nwhere ${\\boldsymbol{{\\alpha}}}({\\boldsymbol{r}}_I)$ is the normalized deflection angle caused by the lensing system for light rays at ${\\boldsymbol{r}}_I$ in the image plane.  \nThe deflection angle has the contributions from both the star and the \nring/belt. Analytic expressions for the deflection angle \n${\\boldsymbol{{\\alpha}}}({\\boldsymbol{r}}_I)$ and magnification $\\mu$ for the lenses we consider \nhere can be found in \\citet{Lake15}. \n\n\\citet{Lake15} perform a study on the gravitational lensing\nproperties with a system made of a point mass surrounded by a ring/belt\nand focus their discussions on examples with $q=1$. We refer the readers to\nthe above paper for details. In this paper, we present cases with low \nmass ratio that are more suitable for the study of extrasolar asteroid belts. \n\n\n\n\\begin{figure*}\n\\includegraphics[scale=.7]{9panel_ringmag_a13_q1e-3.pdf}\n\\caption{\n\\label{fig:panel_mag}\nMagnification maps near the centre region in the source plane for a \nlens composed of a central star\nand a narrow ring with semi-major axis $a = 1.3$ and mass ratio $q = 10^{-3}$ \nacross various inclinations. For low inclinations the ring acts as a point mass, and the perturbations it induces to the star's magnification map are small. As the inclination passes $\\sim 45^{\\circ}$, an X-shaped {pseudo-caustic}\\ feature appears. The dark regions indicate where the number of images produced by a source drops to one, with the lighter regions indicating where the number of images increases to three. As the inclination increases the limbs of the X fold down and become wider, eventually merging when the ring is seen edge-on. A source moving across these features generates a very distinctive light curve (see text for more details).}\n\\end{figure*}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{a13q1e-3_lcurves.pdf}\n\\caption{\\label{fig:a13q1e-3_lcurves}\nSample microlensing light curves for a lens with a central star and a narrow \nring with \nsemi-major axis $a=1.3$, mass ratio $q=10^{-3}$, and inclination \n$i = 80^{\\circ}$. The top-left panel shows the magnification near the centre of\nthe source plane. The circle at the top-left corner represents the dimensionless size of the source star. The other three panels show light curves corresponding to the given trajectories in the source plane, with the black dashed lines showing the light curve for the star-only case. The bottom subpanels show the ratio of light curves of the star+ring case to the star-only case. The source is\nassumed to move along each trajectory in the top-left panel from bottom-left to\ntop-right, with $t = 0$ set at the halfway point of the trajectory.\n\n}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{a09q1e-3_lcurves.pdf}\n\\caption{ \\label{fig:a09q1e-3_lcurves}\nSame as in Figure~\\ref{fig:a13q1e-3_lcurves}, but with $a = 0.9$\n}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{a13q1e-3i45_lcurves.pdf}\n\\caption{\\label{fig:a13q1e-3i45_lcurves}\nSame as in Figure~\\ref{fig:a13q1e-3_lcurves}, but with $i = 45^{\\circ}$.\n}\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{4panel_belts.pdf}\n\\caption{\\label{fig:a13q1e-3_beltlcurves}\nSame as in Figure~\\ref{fig:a13q1e-3_lcurves}, but with the ring replaced with a uniform belt with inner radius $a_i = 1.0$ and outer radius $a_o = 1.6$. Widening\nthe ring to a belt preserves the overall behavior of the light curve, but the perturbations to the star-only curve become smaller in magnitude with \nwider troughs.\n}\n\\end{figure}\n\n\\subsection{Pseudo-caustics}\n\nKey to understanding the behavior of gravitational lenses is the study of so called ``caustic curves''. The caustic set contains the points in the source plane where the magnification $\\mu$ for a point source is formally divergent and represents points where the determinant of the lens mapping Jacobian vanishes.\n\n\nNormally, the magnification is a smooth function for sources located away from the caustics. However, the belt+star lens models considered here possess regions in the source plane dubbed ``pseudo-caustics'', where the magnification is finite but changes discontinuously. Pseudo-caustics have been studied before in lensing systems with singular isothermal density distributions \\citep[e.g.,][]{Kovner87,Wang97,Shin08,Rhie10,Lee14}, where they were associated with regions where the image multiplicity changes by one. In the systems considered here, the {pseudo-caustics}\\ can be associated either with regions where the image multiplicity changes (narrow ring case) or where an image of a source suddenly changes in size (wide belt case). They are found to possess a broad variety of morphologies across the parameter space of the models we consider. A more detailed analysis of the {pseudo-caustics}\\ is presented in \\citet{Lake15}.\n\nSince the boundaries of the {pseudo-caustics}\\ represent areas where the magnification map is non-differentiable, they can in principle be found by finding points in the source plane where $|\\nabla \\mu| \\rightarrow \\infty$. \n\nIn practice, we perform an inverse ray-shooting calculation \\citep[e.g.,][]{Schneider86} by shooting rays from a uniform grid in the lens plane and collecting them on a grid in the source plane. The magnification of a cell in the source plane is then computed by dividing the number of rays it collects by the number it would collect in the absence of the lens. \n\nFigure~\\ref{fig:panel_mag} shows magnification maps in the source plane for a \nnarrow ring with $a = 1.3$ and $q = 10^{-3}$ across a range of inclinations. \nThe {pseudo-caustics}\\ show up as the X-shaped features for the cases with high \ninclinations (e.g., $i \\gtrsim 40^\\circ$), which are fairly generic for the \ntypes of lenses we consider. The mass ratio $q = 10^{-3}$ may be rather \nunrealistic for asteroid belts, but the morphologies of the {pseudo-caustics}\\ do not change \nsignificantly when $q$ is lowered (the primary change being in the width of \nthe pseudo-caustics). The $q = 10^{-3}$ case is used for the purpose of \nillustration here. When the inclination of the ring is low, the {pseudo-caustic}\\ are \nsubdued. As shown in \\citet{Lake15}, the deflection by a face-on ring is\nzero for rays passing interior to the ring and is identical to that produced\nby a point of same mass at the centre for rays passing exterior to the ring. \nTherefore, for the case of a low mass ratio, the magnification map of the\nring+star system is close to that of the central star. As the inclination \nof the ring increases, the limbs of the X-shaped feature fold down towards \nthe $x$-axis and eventually merge when the ring is seen edge-on. For the \nedge-on case, the system exhibits some features degenerate with that of an \nequal-separation triple point-mass lens \\citep[e.g.,][]{Danek15}.\n\nWe find that the {pseudo-caustics}\\ are most pronounced for rings with \nsemi-major axes at or slightly beyond the Einstein ring radii \n($1 \\lesssim a \\lesssim 2$), as is the case of caustics for planetary \nmicrolensing \\citep{Gould92}. \n\nWhen we widen the idealised narrow ring to a belt, the {pseudo-caustics}\\ become smoother \nand ``smeared out'', although the effect is not too dramatic for moderate belt \nwidths ($\\Delta a \\lesssim 0.5$). For comparison, our own asteroid belt extends \nfrom $\\sim$2.2 to $\\sim$3.2~AU \\citep{Petit01}, which if considered as a lens \naround a sun-like star halfway between the Sun and the Galactic centre gives a \ndimensionless width of $\\Delta a \\sim 0.25$.\n\nFinally, we note that the {pseudo-caustics}\\ extend out radially to cover a wide region of \nthe source plane. Therefore, any given source trajectory in the source plane \nhas a high likelihood of {pseudo-caustic}\\ crossing, implying a high asteroid belt lensing \ncross-section. The {pseudo-caustic}\\ crossing leads to distinct features in the microlensing\nlight curves as shown in \\S~\\ref{sec:lcurves}.\n\n\\section{Model Light Curves}\\label{sec:lcurves}\n\nIn this section, we present simulated light curves across a range of parameter \ncombinations to demonstrate the expected behavior of belt+star microlensing \nevents. Throughout this section, we assume the source star to be a\n$0.3M_\\odot$ M dwarf located near the Galactic centre with the belt+star \nlens located halfway to\nthe Galactic centre, i.e. we set $D_L = 4{\\rm kpc}$ and $D_S = 8{\\rm kpc}$. We take the \nlens star to be a sun-like star of mass $M_{lens} = 1{M_\\odot}$, which gives \n$\\theta_E D_L \\approx 4$AU. \n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{3panel_lcurves.pdf}\n\\caption{\\label{fig:3panel_lcurves}\nThree sample microlensing light curves for a lens composed of a star and a belt with $q = 5\\times 10^{-5}$, $i = 80^{\\circ}$ and $\\Delta a = 0.25$ for different semi-major axes and source trajectories. From left to right, the belts are centred at $a = 1,~1.2,$ and $2$, respectively. The dashed curves show the star-only case for comparison, with the bottom panels showing the ratio of the light curves of the belt+star to the star-only case. We assume a typical M dwarf source star located in the Galactic centre. Note that each light curve exhibits the same characteristic alternating magnification pattern despite having different peak magnifications. \n}\n\n\\end{figure}\n\n\\begin{figure}\n\\includegraphics[width=\\columnwidth]{updated_3panel_lowmag.pdf}\n\\caption{\\label{fig:more_3panel}\nThree more sample microlensing lightcurves for a lens composed of a central\nstar and a belt with $q = 10^{-5}$ and $i=80^\\circ$. In the left, middle,\nand right panel, the belt is centred at $a$=1.1, 1.6, and 1.3, respectively,\nall with a width $\\Delta a=0.3$. All trajectories are at relatively large \ndistances from the central star. These examples demonstrate that the large \ncross-sectional area of the {pseudo-caustics}\\ allows them to leave signatures even in \nrelatively low-magnification events.\n}\n\\end{figure}\n\n\nFigure~\\ref{fig:a13q1e-3_lcurves} shows three model light curves for a narrow \nring+star system with $a=1.3$, $q=10^{-3}$, and $i = 80^{\\circ}$. The case for\nlower mass ratio will be presented later, which has similar qualitative \nfeatures.\n\nWe focus on trajectories close to the centre, which lead to high magnification\nmicrolensing events. \nThe top left panel shows the magnification map of the central region in the \nsource plane, superimposed with the corresponding source trajectories for \nthree light curves in the other three panels. The yellow circle at the top-left \ncorner of the magnification map corresponds to the size of the source star, \nand we account for the finite source effect in calculating the light curves.\nIn each light curve, the black dashed line shows the light curve for the \nstar-only lens, with the bottom subpanel showing the ratio of the ring+star \nlight curve to the star-only one. Time is put in units of $t_E$, the Einstein radius\ncrossing time. For a typical lens-source relative velocity of $v_{\\perp} =110 ~{\\rm km\\, s^{-1}}$, $t_E$ is \n$\\sim$65 days. \n\nThe distinct X-shaped {pseudo-caustic}\\ feature in the magnification map shows up in each \nof the three light curves. Given the shape of the {pseudo-caustics}, the source\nhas a high likelihood of crossing the {pseudo-caustics}\\ twice, resulting in a light curve \nthat exhibits a rapid decrease and increase in magnification, followed by a \ncorresponding increase and decrease some time later. The \nmaximum fractional change in magnification, $\\Delta\\mu/\\mu$, can be as high\nas $\\sim$50\\%. An observed light curve exhibiting these features would provide \nstrong evidence for the presence of a ring+star lens. \n\nFigure~\\ref{fig:a09q1e-3_lcurves} is the same as Figure~\\ref{fig:a13q1e-3_lcurves} but with $a = 0.9$. Lowering the semi-major axis of the ring folds the \nX-shaped feature down onto the $x$-axis and smoothens the {pseudo-caustics}. \nThe maximum relative magnification $\\Delta\\mu/\\mu$ between the ring+star case and the star-only case decreases to 30\\%. In general, decreasing $a$ even further results in a smaller perturbation to the star-only light curve. \n\nFigure~\\ref{fig:a13q1e-3i45_lcurves} shows the case with $a = 1.3$ and \n$i = 45^{\\circ}$. Reducing the inclination has the effect of ``folding up'' \nthe X-shaped {pseudo-caustics}\\ about the $y$-axis, and increasing the separation between \nthe high and low magnification areas of the {pseudo-caustics}. Additionally, the width of \nthe {pseudo-caustics}\\ becomes smaller and the perturbations to the star-only light curve \ndecrease.\n\nFigure~\\ref{fig:a13q1e-3_beltlcurves} is again the same as \nFigure~\\ref{fig:a13q1e-3_lcurves}, but with the ring replaced by a uniform \nbelt of inner radius $a_i = 1.0$ and outer radius $a_o = 1.6$.\nIf a belt of this width were placed around a sun-like lens star, a width of $\\Delta a = 0.6$ would correspond to a physical width of $\\sim2.5$AU. Thickening the ring smooths out the {pseudo-caustics}, with the light curves retaining their overall shape but possessing slightly more subdued peaks and flatter troughs. \n\nIn Figure~\\ref{fig:3panel_lcurves} we present three sample light \ncurves for different trajectories for a system with a lower belt-to-star \nmass ratio, $q = 5\\times 10^{-5}$, which corresponds to a belt mass of \n$\\sim$$5M_\\oplus$ for an M-dwarf lens star. The inclination of the belt is\nfixed at $i = 80^{\\circ}$. From the left to right panel, the belts are \ncentred at $a = 1$, 1.2, and 2, respectively, with width $\\Delta a = \n0.25$. While the characteristic shape of the perturbations caused by the belt \nremains similar to the previous cases, the fractional change in \nmagnification drops to a level of a few percent. Approximately, the \nfractional perturbations with respect to the star-only light curve are  \nproportional to the mass ratio $q$, of the order of $0.5(q/10^{-3})$.\n\nFinally, in Figure~\\ref{fig:more_3panel} three more sample light curves are\npresented for $q = 10^{-5}$ and for relatively low magnification events, \nwhere the trajectory of the source star lies at large $r_S$. The inclination is again fixed at $i = 80^{\\circ}$ and the belts are centred at $a = 1.1,1.6,$ and $1.3$, with $\\Delta a = 0.3$ throughout. The characteristic \n{pseudo-caustic}\\ crossing features caused by the belt clearly show up, with the relative magnification dropping to sub-percent levels. \n\nOverall, microlensing events from belt+star lenses can be generically \ncharacterized by a rapid decrease and increase in magnification followed by \na reversed increase and decrease in magnification, caused by the perturbation \nfrom the asteroid belt. Such a semi-symmetric feature is seen \nacross a wide range of belt semi-major axes, \nbelt widths, belt inclinations, belt-to-star mass ratios, and source \ntrajectories, making it a robust observational signal. Such a feature is not\nusually seen in the light curves generated by other types of lensing systems,\nexcept a moderate degeneracy with an equal-separation triple point-mass lens \nwhen the belt is seen nearly edge-on.\n\n\n\\begin{figure}\n\\includegraphics[width=.95\\columnwidth,scale=.95]{test.pdf}\n\\caption{\\label{fig:test} An example of fitting a sample belt+star light curve with a planet+star \nlens model. The top panel shows the belt+star light curve (red dots) plotted against the best-fitting single lens model \n(black curve), shown in magnitudes. The bottom \npanel shows the difference between the belt+star light curve and the best-fitting single lens model (red dots) \ncompared to the difference between the best-fitting planet+star lens model and the best-fitting single lens \nmodel (blue curve).  }\n\\end{figure}\n\nThe feature is distinct from that produced by planet microlensing.\nObservationally, it would be unlikely for a belt+star microlensing event\nto be misidentified as a planet+star one. To establish this quatitatively, we perform tests\nby fitting belt+star microlensing curves with a planet+star lens model.\nWe produce theoretical belt+star microlensing light curve data and add\nphotometric errors of 5~mmag (reasonable for the best ground-based\nmicrolensing surveys for high-magnification events). We then employ the\nmethod in \\citet{Dong09} to explore the parameter space of a planet+star\nlens system to model the data. Figure~\\ref{fig:test} shows an example, taken from\na lens model with a belt of width $\\Delta a = 0.2$ centered at $a = 1.25$ and with \n$i = 80^{\\circ}$, $q = 10^{-5}$.\nIn the top panel, the points are the densely sampled light curve of the\nbelt+star lens system, and the black curve is the best-fit from a single\nlens model. The bottom panel shows the residuals to the best-fitting\nsingle lens model as well as the difference between the best-fitting\nplanet+star model and the best-fitting single lens model (in blue).\nThe planet+star model tends to fit the broad deviations from the single-lens\nmodel but fails to account for the small structures caused by the belt+star\nlens. The $\\chi^2$ difference between the planet+star and belt+star models\nis 215.7 for 902 degrees of freedom (i.e., 5.1$\\sigma$). For future applications,\na systematic investigation on the differences in planet+star, belt+star, and\nplanet+belt+star lens systems will be helpful.\n\n\\section{Summary and Discussion}\\label{sec:dis}\n\nWe investigate detecting extrasolar asteroid belts around stars through\nmicrolensing. Existence of asteroid belts leaves distinct signatures in \nmicrolensing light curves. Belt+star lenses generically create\nso-called ``{pseudo-caustics}'', regions in the source plane where the \nmagnification of a source is finite but changes discontinuously. \nThe cross-section for {pseudo-caustic}\\ crossing events is large for a wide range of \nbelt configurations. In the light curves for most source trajectories,\nthe X-shaped {pseudo-caustics}\\ lead to a rapid rise and fall (or fall and rise),\nfollowed by a subsequent reversed fall and rise (or rise and fall). Such a \ncharacteristic, semi-symmetric feature can be used to identify belt+star \nmicrolensing events.\n\n\n\nThe width of the {pseudo-caustic}\\ for systems with mass ratio $q=10^{-3}$ is about $10^{-3}$\ntimes the Einstein ring radius and decreases with decreasing mass ratio. \nFor comparison, an M dwarf near the Galactic centre has a dimensionless\nradius of $3 \\times 10^{-4}$.\nThis means that the magnification jump caused by a {pseudo-caustic}\\ crossing is smeared out by the finite\nsource effect, which ultimately limits the sensitivity to detect extrasolar\nasteroid belt systems. This means that sources at large distances \n(large values of $D_S$) are ideal, and that surveys should target main \nsequence source stars rather than giants, as has been pointed out by \n\\citet{Bennett96}. Detecting asteroid belts with $q\\lesssim 5\\times10^{-6}$ \nfor sources near the Galactic centre is an approximate lower bound for \nthe masses of belts that are likely to be observed. The same type of\nsources appear to be $\\sim 7$ times smaller if located in the LMC. Targeting\nstars in the LMC would therefore enable us to detect lower mass asteroid belts, \nalthough most upcoming surveys (i.e., WFIRST; \\citealt{Spergel15}) are \nbeing designed to target the Galactic bulge.\n\n\n\n\n \n\n\n\nThe small width of the {pseudo-caustics}\\ in the source plane also means that {pseudo-caustic}\\ crossing\nevents only last for a short period of time (e.g., minutes to hours for Galactic \ncentre sources). The required high cadence rates for detection are similar \nto those in current surveys like MOA and OGLE \\citep{Sumi10,Udalski15}. \nAs a concrete\nexample for future surveys, we consider the photometric survey towards the\nGalactic bulge by the WFIRST satellite. With a 52s exposure, the photometric\nprecision in a broad $H$ band is about $\\sigma(H)\\sim 10^{(2/15)(H-15)}$ \nmmag \\citep{Gould15}, where $H$ is the apparent magnitude of the source. \nA 0.3$M_\\odot$ M dwarf source star (with absolute magnitude $M_H\\sim 7.05$ mag; \n\\citealt{Henry93}) in the Galactic centre has an apparent magnitude \n$H\\sim 21.57$ mag, and the corresponding photometric precision is\n$\\sim 7.5$ mmag. So even for microlensing events with moderate magnifications, \npercent level features caused by extrasolar asteroid belts in the light \ncurves can be detected with high significance.\n\n\n\n\nWhile microlensing features by extrasolar asteroid belts can be detected at\nhigh precision, one may wonder wether or not asteroid belts similar to the idealised ones considered here actually exist. Clearly the key parameter here\nis the mass ratio $q$ of the asteroid belt to its parent star.\n\n\n\nThe present mass of our own asteroid \nbelt is only $\\sim5 \\times 10^{-4} M_\\oplus$ \\citep{Petit01}, giving \n$q\\sim 5\\times10^{-9}$ even for a $0.3M_\\odot$ M dwarf parent star. \nObserving such a low-mass belt would be very unlikely, even for a survey \ntargeting the LMC to reduce the finite source effect. However, our \nasteroid belt is thought to have been several orders of magnitude more massive \nin the early years of our solar system, with a primordial mass of \n$\\sim1 M_\\oplus$ before it lost most of its mass to ejection by interactions \nwith other planets \\citep{Weidenschilling77, Petit01} over a time scale of\na few Myr. For systems that lack massive planets orbiting near the belt, the \nlifetime of early, massive asteroid belts may be significantly longer. \nCold planetesimal discs / asteroid belts of masses on the order of a few \n$M_\\oplus$ at a distance a few AU from a solar mass star can be dynamically \nstable over Gyr timescales \\citep{Heng10}.  \nThere are hints from observations that massive asteroid belts or ring-like\nstructures exist. For example, the inferred parent mass of the asteroid belt \naround the A-type star $\\zeta$ Leporis from the observation of dust emission a \nfew AU from the star is about $6.7\\times10^{-2}M_\\oplus$, substantially more \nmassive than our own one. Another example comes from the eclipse light curve \nof J1407 \\citep{Kenworthy15}, which can be interpreted as caused by a \ncompanion star, J1407b, with a giant ring system ($\\sim 1 M_\\oplus$, \nextending to a radius of $\\sim 0.6$AU). \n\n\n\nOverall, it is not unlikely that belt structures with masses of \n$\\mathcal{O}(10)$ times the mass of the moon (corresponding \n$q\\gtrsim 2\\times10^{-6}$ for a typical M dwarf host star) exist, which\nin principle can produce detectable microlensing features. The favorable \nconfigurations include a reasonably high inclination ($i \\gtrsim 75^{\\circ}$) \nand a semi-major axis of $a \\gtrsim 1$. It is natural to assume that most \nasteroid belts will have semi-major axes close to the snow line, beyond which \nthe temperature from their parent stars is low enough to allow ices to form. \nThis is encouraging, given that the snow line \n$r_{\\rm snow} \\approx 2.7 (M/{M_\\odot})^{1/3}$~AU \\citep{Martin13} is fairly close \nto $\\theta_E D_L$ (around which the perturbations caused by the belt are most \nsignificant; see equation~\\ref{eq:xi0}) for a typical Galactic microlensing \nevent. \n\nIn our calculation of the microlensing signal, we assume a smooth disc \nor belt structure. In reality, a disc/belt is made of discrete bodies, and a \nsmooth disc corresponds to the limit of small bodies. Depending on the mass\ndistribution, discreteness effect in mass may need to be investigated and may \nneed to be accounted for in modeling the microlensing light curve in \nobservation.\n\nAll in all, it does not seem unreasonable to consider the existence of \nlong-lived massive asteroid belts. If they exist, microlensing is an ideal \nmethod for observing them. Observational techniques are continuing to improve, \nwith microlensing surveys reaching increasingly high levels of sensitivity. \nNew space-based surveys like WFIRST will be able to detect \nMercury-mass planets \\citep{Spergel13} and will be well-poised to make the \nfirst detections of extrasolar asteroid belts, which will provide useful \ninformation on the formation of planets and dynamical evolution of asteroid \nbelts.\n\n\\section{ACKNOWLEDGEMENTS}\nThe work is partially supported by NSF grant\nAST-1208891. The support and resources from the centre for High\nPerformance Computing at the University of Utah are gratefully acknowledged.\nS.D. is supported by the Strategic Priority Research Program ``The\nEmergence of Cosmological Structures of the Chinese Academy of\nSciences'' (Grant No. XDB09000000) and Project 11573003 supported by\nNSFC.\n\n\\bibliographystyle{mnras}\n\\bibliography{bibliography}\n\n\n", "itemtype": "equation", "pos": 6563, "prevtext": "\nwhere $D$ satisfies $1/D = 1/D_L + 1/D_{LS}$.\n\nThe general lens equation is\n\n", "index": 5, "text": "\\begin{equation}\n{\\boldsymbol{{r}}}_S={\\boldsymbol{{r}}}_I-{\\boldsymbol{{\\alpha}}}({\\boldsymbol{r}}_I),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\boldsymbol{{r}}}_{S}={\\boldsymbol{{r}}}_{I}-{\\boldsymbol{{\\alpha}}}({%&#10;\\boldsymbol{r}}_{I}),\" display=\"block\"><mrow><mrow><msub><mi>𝒓</mi><mi>S</mi></msub><mo>=</mo><mrow><msub><mi>𝒓</mi><mi>I</mi></msub><mo>-</mo><mrow><mi>𝜶</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>𝒓</mi><mi>I</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]