[{"file": "1601.08097.tex", "nexttext": "\n\nwhere $a_i \\sim\\mathrm{N}(0,\\tau^2)$ independently is a specimen-level\nrandom effect and $Z_{ij} \\sim\\mathrm{N}(0,\\sigma^2)$ is an error\nterm, where the $Z_{ij}$ are independent of each other and of the\n$a_i$, that is, fields are assumed to be conditionally independent,\ngiven the specimen. Unless otherwise stated, similar independence\nassumptions are made on random effect and error terms in the other\nmodels described in this section.\n\nThe count variable LVD was modelled using a generalised mixed model. An\noffset of unity was included to prevent zero counts, as any fields\ncontaining no vessels would not have been included in the data set,\n\n\n\\begin{eqnarray}\n\\label{LVDeqn} N_{ij} & \\sim&1 + \\operatorname{Poisson}(\\mu_{ij}),\n\\nonumber\n\\[-8pt]\n\\[-8pt]\n\\nonumber\n\\log(\\mu_{ij}) & =& \\alpha+ \\beta_{x_{ij}} + a_i.\n\\end{eqnarray}\n\nThe above formulation can be viewed as part of the general class of\nmodels for overdispersion discussed by \\citet{dean}. In order to test\nwhether this adequately captured the overdispersion in $N_{ij}$,\nresults were compared to those from a negative binomial model,\nfollowing \\citet{lindsey}.\n\nThe two vessel-level variables were modelled using an extension of the\nhierarchy to allow for field-specific random effects. Vessel area was\nlog-transformed and modelled as\n\n\n\n", "itemtype": "equation", "pos": 19673, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\\title{Lymphangiogenesis and carcinoma in the uterine cervix: Joint and\nhierarchical models for random cluster sizes and continuous outcomes}\n\\runtitle{Models for random cluster sizes and continuous outcomes}\n\n\\begin{aug}\n\n\n\\author[A]{\\fnms{T.~R.}~\\snm{Fanshawe}\\corref{}\\thanksref{m1}\\ead[label=e1]{thomas.fanshawe@phc.ox.ac.uk}},\n\\author[B]{\\fnms{C.~M.} \\snm{Chapman}\\thanksref{m2}\\ead[label=e2]{Mark.Chapman@mbht.nhs.uk}}\n\\and\n\\author[B]{\\fnms{T.}~\\snm{Crick}\\thanksref{m2}\\ead[label=e3]{tony.crick@mbht.nhs.uk}}\n\n\\runauthor{T.~R. Fanshawe, C.~M. Chapman and T. Crick}\n\\affiliation{University of Oxford\\thanksmark{m1} and Royal Lancaster\nInfirmary\\thanksmark{m2}}\n\\address[A]{T.~R. Fanshawe\\\\\nNuffield Department of Primary Care\\\\\n\\quad Health Sciences\\\\\nUniversity of Oxford\\\\\nRadcliffe Observatory Quarter\\\\\nWoodstock Road, Oxford OX2 6GG\\\\\nUnited Kingdom\\\\\n\\printead{e1}}\n\\address[B]{C.~M. Chapman\\\\\nT. Crick\\\\\nDepartment of Histopathology\\\\\nRoyal Lancaster Infirmary\\\\\nAshton Road, Lancaster\\\\\nLancashire LA1 4RP\\\\\nUnited Kingdom\\\\\n\\printead{e2}\\\\\n\\phantom{E-mail:\\ }\\printead*{e3}}\n\n\n\n\n\n\n\n\n\n\\end{aug}\n\n\n\n\\received{\\smonth{6} \\syear{2013}}\n\n\n\\revised{\\smonth{7} \\syear{2014}}\n\n\n\n\n\\begin{abstract}\nAlthough the lymphatic system is clearly linked to the metastasis of\nmost human carcinomas, the mechanisms by which lymphangiogenesis occurs\nin response to the presence of carcinoma remain unclear. Hierarchical\nmodels are presented to investigate the properties of lymphatic vessel\nproduction in 2997 fields taken from 20 individuals with invasive\ncarcinoma, 21 individuals with cervical intraepithelial neoplasia and\n21 controls. Such data demonstrate a high degree of correlation within\ntumour samples from the same individual. Joint hierarchical models\nutilising shared random effects are discussed and fitted in a Bayesian\nframework to allow for the correlation between two key outcome\nmeasures: a random cluster size (the number of lymphatic vessels in a\ntissue sample) and a continuous outcome (vessel size). Results show\nthat invasive carcinoma samples are associated with increased\nproduction of smaller and more irregularly-shaped lymphatic vessels and\nsuggest a mechanistic link between carcinoma of the cervix and\nlymphangiogenesis.\n\\end{abstract}\n\n\n\n\n\\begin{keyword}\n\\kwd{Cervical carcinoma}\n\\kwd{informative cluster size}\n\\kwd{hierarchical model}\n\\kwd{joint model}\n\\kwd{lymphangiogenesis}\n\\kwd{random effect}\n\\end{keyword}\n\\end{frontmatter}\n\n\n\\section{Introduction}\\label{sec1}\n\nObservational and randomized studies often provide data with a\nmultilevel, or hierarchical, structure, in which repeated data values\nare available in ``clusters'' at one level of the hierarchy. Each subunit\ncontributes for data analysis a certain number of observations, which\nmight vary across clusters and which might therefore be regarded as a\nrandom variable---a ``cluster-specific sample size'' or, simply ``cluster\nsize''. In recent years, consideration has been given to the issue of\nso-called ``informative cluster size'', in which the number of\nobservations within a cluster is associated with a study outcome.\n\nThis issue is potentially important in many application areas.\nProminent amongst them is the field of developmental toxicity, where,\nfor example, a correlation has been shown between animal litter size\nand animal-specific outcomes such as malformation or birthweight,\ngiving rise to a series of papers [\\citet\n{fitzmaurice,tenhave,regan,dunson,gueorguieva,ma}]. Another example\narises in periodontics, where there may be an association between tooth\nloss and tooth quality. This is explored by \\citet{williamson} and\n\\citet\n{neuhaus}; the latter paper also considers a parallel between the\\vadjust{\\goodbreak}\ngeneric problem of informative cluster size and informative drop-out in\nlongitudinal studies. Further examples appear in educational research\n[class size and examination performance, \\citet{goldstein}] and human\nperinatal epidemiology [multiple births and various outcomes, \\citet\n{hibbs}]. The general methodological approach has also been extended to\nsurvival analysis outcomes [\\citet{cong}].\n\nThis paper introduces the issue of informative cluster size in the\nanalysis of histological data taken from uterine cervical carcinoma\nsamples. Carcinoma of the uterine cervix is the second most common\nmalignant neoplasm amongst females globally, and in 2008 almost half a\nmillion individuals were diagnosed with this condition [\\citet{ferlay}].\nThe preferred route of metastasis (``spread'') for carcinomas is via the\nlymphatic system [\\citet{friedl}]. Studies into the role of the\nlymphatic system in the progression of cervical carcinoma have\ndemonstrated that the density of lymphatic vessels (LVD) is a good\nindicator of lymph node metastasis, higher tumour grades and lymphatic\ninvasion [\\citet{gombos,gao,longatto,zhangyuzhang}].\n\nMoreover, these studies suggest that cervical tumours have the ability\nto induce lymphangiogenesis, the formation of new lymphatic vessels,\nbut provide little information regarding the distribution of LVD in\nnormal cervix and premalignant conditions, and often fail to detail the\nanatomical cervical location in which LVD is measured. As 90\\% of all\ncervical lesions occur in the region known as the transformation zone,\nany difference in the LVD of this anatomical region compared with the\nother regions of the cervix (the ectocervix and endocervix) is of\nparticular importance. Together this information may help determine at\nwhat stage in the progression of the disease lymphangiogenesis takes place.\n\nPrevious studies have made observations describing the morphological\nappearance of lymphatic vessels in cervical tissue. For example, \\citet\n{gombos}, \\citet{gao} and \\citet{zhangyuzhang} observed that the\nlymphatics in normal cervical tissue appear open with regular shape,\nwhilst those in the peritumoral regions of carcinoma tissue appear\nlarge and dilate. To build\\vadjust{\\goodbreak} on this observational data, the present\nstudy aims to utilise quantitative data obtained from image analysis to\ndescribe the number, size and shape of lymphatic vessels in the uterine\ncervix via measurements of LVD, vessel area and circularity.\n\nLymphangiogenesis is thought to occur via the sprouting of endothelial\ncells from existing lymphatic vessels [Alitalo, Tammela and Petrova\n(\\citeyear{al05})]. If this is the case, a subset of smaller lymphatic vessels may\nbe visible in tissue from carcinoma specimens. The structural\narrangement of these newly formed vessels in 3D space will influence\nhow functional they are as compared to those found in the normal\ncervix. This study addresses these issues.\n\nIn the context of the more general issue of informative cluster size\ndescribed above, the methodological challenge arises when further\noutcome variables---such as the size of each vessel---are associated\nwith the number of vessels at a particular level of observation. For\nexample, in an inverse relationship such as the one described in this\npaper, large clusters contain vessels that tend to be smaller in\nmagnitude than those in small clusters, yet by their nature the large\nclusters provide more measurements for analysis. Ignoring the effects\nof clustering and cluster size may then provide incorrect inferences\nabout the outcome variable, and assessing the extent to which this is\ntrue is also one of the objectives of this paper.\n\nScientific interest in this study therefore lies not only in the number\nof lymphatic vessels observed, but also in quantitative measures of\ntheir appearance. This objective naturally suggests a joint modelling\napproach. A key requirement is that the model must be flexible enough\nto allow not only for the correlation among these outcome variables,\nbut also for the fact that they may differ in statistical distribution\nor data type (e.g., count as opposed to continuous) and at the level of\nthe hierarchy at which they are measured.\n\nIn this paper we illustrate the general modelling approach by\nconcentrating on the relationship between LVD and vessel size, adapting\nfor our application methodology that has been successfully applied in\nfields such as toxicology [\\citet{regan}]. Our modelling approach relies\non the specification of random effects that are common to both outcome\nvariables in the model. These random effects provide a mechanism by\nwhich the correlation between the outcomes can be modelled explicitly.\n\nThe paper is structured as follows. In Section~\\ref{sec2} we describe in detail\nthe data set that motivates this work, and give an exploratory\nanalysis. In Section~\\ref{hierarchical} we fit univariate hierarchical models to each of\nthe outcome variables of interest. In Section~\\ref{joint} we introduce the joint\nmodelling problem and present a bivariate model for lymphatic vessel\ndensity and lymphatic vessel area, and Section~\\ref{sec5} provides a concluding\ndiscussion.\\vadjust{\\eject}\n\n\\section{Data}\\label{sec2}\n\n\n\\subsection{Study design}\\label{sec2.1}\n\nThe data were collected as part of a study carried out at the Royal\nLancaster Infirmary, Lancaster, UK. Tissue biopsies (or ``specimens'')\nwere taken from 62 individuals. Each specimen was processed into\nparaffin blocks, which were sectioned at 4~$\\mu$m, stained and viewed\nunder a microscope, as described by \\citet{chapman}. Within each\nspecimen, areas of interest (``fields'') were selected and all lymphatic\nvessels observed within these fields were used to obtain the outcomes\nof interest, defined below.\n\nTwenty individuals provided invasive squamous cell carcinoma tissue,\nwhile 21 individuals showed premalignant growth classified as cervical\nintraepithelial neoplasia (CIN), which was additionally subclassified\nas histological grade 1, 2 or 3 (Table~\\ref{specimentable}). For these\ntwo groups of cases, fields were taken from the site of abnormal\ngrowth. Additionally, hysterectomy specimens were obtained from 21\ncontrols---defined as individuals with menorrhagia, with no abnormal\ncervical tissue. For the controls, specimens were available either from\none or, more commonly, from two distinct functional regions of the\ncervix---the ectocervix and the transformation zone.\n\nAn average of 8.8 fields were taken per specimen (range 1 to 19 fields\nper specimen), and across the whole sample an average of 5.5 lymphatic\nvessels per field provided data for analysis (range 1 to 45 vessels per\nfield). The reasons for apparent differences by group in the number of\nfields per specimen shown in Table~\\ref{specimentable} are unrelated to\noutcome variables.\n\n\n\\begin{table}\n\\caption{Number of specimens and fields per specimen}\n\\label{specimentable}\n\\begin{tabular*}{\\textwidth}{@{\\extracolsep{\\fill}}lcc@{}}\n\\hline\n &  & \\textbf{Average number of fields}\\\\\n\\textbf{Tissue type}& \\textbf{Number of specimens} & \\textbf{per specimen (range)}\\\\\n\\hline\nControl cervix & 21 & 12.7 (5 to 19)\\\\\n\\quad Ectocervix & 20 & \\phantom{0}9.2 (5 to 10)\\\\\n\\quad Transformation zone & 16 & 5.2 (2 to 9)\\[3pt]\nCIN & 21 & 5.6 (2 to 8)\\\\\n\\quad CIN1 & 10 & 5.4 (2 to 7)\\\\\n\\quad CIN2 & \\phantom{0}9 & 6.1 (2 to 8)\\\\\n\\quad CIN3 & \\phantom{0}2 & 4.5 (4 to 5)\\[3pt]\nInvasive carcinoma & 20 & \\phantom{0}8.0 (1 to 10)\\\\\n\\hline\n\\end{tabular*}\n\n\\end{table}\n\nTwo field-level outcomes and two vessel-level outcomes were of primary interest:\n\n\\begin{itemize}\n\n\\item Lymphatic vascular density (LVD)---the density of lymphatic\nvessels visible in a field.\n\n\\item Percentage lymphatic area (\\%LA)---the percentage of the total\narea of a field that is occupied by lymphatic vessels.\n\n\\item Vessel area---the area contained within the lumen of a lymphatic\nvessel, measured in $\\mu\\mathrm{m}^2$.\n\n\\item Circularity---a measure of the circularity of a lymphatic vessel,\nlying between 1 (perfectly circular) and 0 (lying in parallel lines\nacross the surface of the field).\n\\end{itemize}\n\nNote that as all fields were of the same area, LVD is almost equivalent\nto the number of lymphatic vessels in a field: a discrepancy would\narise only if a convoluted vessel were visible at two or more distinct\npoints on the same field, a scenario that is impossible to detect using\nthe data available and which we consequently ignore. The \\%LA of a\nfield can be viewed as a combined summary measure of the LVD and the\naverage vessel area of the field, while remaining an important outcome\nvariable in its own right.\n\nA sample size calculation was carried out based on analysis of variance\nto test for a difference in mean LVD (calculated across all fields,\naveraging to remove the hierarchical structure) between the three main\nstudy groups.\n\\citet{longatto} and \\citet{gao} provide information on LVD in previously\nconducted studies, although both studies purposively oversampled\nregions of high LVD. \\citet{longatto} report mean LVD values of 2.6 in\nthe control group (ignoring the distinction between ectocervix and\ntransformation zone), 5.0 for patients with squamous intraepithelial\nlesions and 17.1 for patients with invasive carcinoma. Because of\nconcerns about the nature of the sampling scheme in these studies, the\npresent study instead assumed more conservative mean LVD values in the\nthree groups of 2.6, 5.0 and 10.0, respectively, which correspond to a\nbetween-group standard deviation of 3.8. Based on further results\nprovided by \\citet{longatto}, the common within-group standard deviation\nwas assumed to be 7.5, which yields a ``difference parameter'' [\\citet\n{day}] of $3.8/7.5 \\approx0.5$. Under these assumptions, a sample size\nof 25 patients per group has approximately 90\\% power to detect an\noverall difference in mean LVD between groups at the 5\\% level of\nsignificance. Incorporating repeated measurements from different fields\ninto the analysis is likely to increase the power substantially.\n\n\n\\begin{table}\n\\caption{Mean (standard deviation) of outcome\nmeasures by tissue type}\n\\label{summarytable}\n\\begin{tabular*}{\\textwidth}{@{\\extracolsep{\\fill}}lcccc@{}}\n\n\\hline\n& \\textbf{LVD} & \\textbf{\\%LA} & \\textbf{Vessel area} & \\textbf{Circularity}\\\\\n\\hline\nControl cervix & 3.38 (2.17) & 4.05 (3.66) & 1633 (2555) & 0.57 (0.21)\\\\\n\\quad Ectocervix & 2.34 (0.90) & 3.51 (3.31) & 2062 (2764) & 0.54\n(0.21)\\\\\n\\quad Transformation zone & 5.67 (2.39) & 5.22 (4.11) & 1248 (2285) &\n0.60 (0.21)\\[3pt]\nCIN & 5.53 (1.75) & 3.76 (3.09) & \\phantom{0}912 (1489) & 0.61 (0.19)\\\\\n\\quad CIN1 & 5.33 (1.81) & 3.94 (3.72) & 1010 (1851) & 0.59 (0.20)\\\\\n\\quad CIN2 & 5.91 (1.67) & 3.90 (2.54) & \\phantom{0}869 (1166) & 0.63 (0.19)\\\\\n\\quad CIN3 & 4.44 (1.24) & 1.90 (0.84) & \\phantom{0}543 (540) & 0.64 (0.17)\\[3pt]\nInvasive carcinoma & 9.04 (4.55) &3.47 (2.20) &  \\phantom{0}523 (934) & 0.56\n(0.22)\\\\\n\\hline\n\\end{tabular*}\n\n\\end{table}\n\n\n\n\\subsection{Exploratory analysis}\\label{sec2.2}\n\nTable~\\ref{summarytable} shows the means and standard deviations of the\noutcome measures by group. The distributions of three of these\nvariables are illustrated by Figure~\\ref{boxplot}, in which the two\ncontrol tissue groups are combined, as are the three CIN groups. Vessel\narea has an extremely positively skewed distribution and is therefore\npresented on the logarithmic scale.\n\n\n\n\\begin{figure}\n\n\\includegraphics{867f01.eps}\n\n\\caption{Distributions of three outcome variables by tissue type. ``Inv.\ncarc.'' is invasive carcinoma.}\n\\label{boxplot}\n\\end{figure}\n\n\nTwo key further considerations guide our approach to analysing this\ndata-set. Firstly, outcomes vary according to the level of the\nhierarchy at which they are observed---fields within specimens, and\nvessels within fields. Figure~\\ref{fieldvariation} provides a typical\nexample, and shows the log-vessel area of vessels in the 15 fields\ntaken from the same specimen. In a similar vein, Figure~\\ref{specimenvariation} shows the variation in log-vessel area of vessels\nin the first-numbered fields taken from each specimen.\n\n\n\\begin{figure}\n\n\\includegraphics{867f02.eps}\n\n\\caption{Variation in log-vessel area for the fifteen fields taken from\na single specimen (the width of each box is proportional to the square\nroot of the number of vessels).}\n\\label{fieldvariation}\n\\end{figure}\n\n\n\n\\begin{figure}\n\n\\includegraphics{867f03.eps}\n\n\\caption{Variation in log-vessel area for the first-numbered fields\ntaken from each specimen (the width of each box is proportional to the\nsquare root of the number of vessels).}\n\\label{specimenvariation}\n\\end{figure}\n\n\n\nThe second major consideration is that the outcome variables themselves\nare correlated, notably the important variables LVD and vessel area.\nFigure~\\ref{VAversusLVD} plots log-vessel area and LVD across all\nvessels, together with the fitted curve resulting from a generalised\nadditive model fit to the data ignoring the hierarchical structure. The\nsample correlation between the two is $-0.36$, with stronger correlation\napparent in fields with fewer than fifteen vessels.\n\n\n\n\n\\begin{figure}\n\n\\includegraphics{867f04.eps}\n\n\\caption{Relationship between log-vessel area and LVD for all vessels,\nwith fitted loess curve.}\n\\label{VAversusLVD}\n\\end{figure}\n\n\n\n\\section{Hierarchical models}\n\\label{hierarchical}\n\n\n\\subsection{Notation}\n\nThe data set exhibits a clear three-level hierarchical structure, with\nvessels nested within fields, which are themselves nested within\nindividuals. For specimen $i$, field $j$ and vessel $k$, let $Y_{ij}^{\\%\n}$ denote the field-level outcome \\%LA, $Y_{ijk}^A$ the vessel-level\noutcome vessel area, and $Y_{ijk}^C$ the vessel-level outcome\ncircularity. Additionally, let $N_{ij}$ denote the field-level LVD,\nwhich can be thought of as representing the cluster-specific sample\nsize. The ranges of the subscripts are $i=1,\\ldots,n=62$, $j=1,\\ldots,n_i$\nand $k=1,\\ldots,N_{ij}$.\n\nNote that $n$ (the number of individuals) and the $n_i$ (the number of\nfields for individual $i$) are regarded as fixed, and determined by the\nstudy design, whereas $N_{ij}$ is a random variable, an observation\nthat will be explored further in Section~\\ref{joint}. Note also that\nthe $j$ subscript enumerates fields in both the ectocervix and\ntransformation zone for the fifteen controls who contribute both of\nthese tissue types. Let $x_{ij}$ denote the tissue type of specimen $i$\nand field $j$, with $x_{ij} \\equiv x_i$ for CIN and invasive carcinoma\nspecimens. In subsequent regression models results are presented\nrelative to the reference category of control ectocervix. In most cases\nthe three CIN categories were combined for the purposes of model\nfitting because of the small sample size in the CIN3 group and because\ndifferences between the other two categories were small.\n\nThe models in this section are conditional on the observed value of\n$N_{ij}$, an extremely common approach in the analysis of hierarchical\nor multilevel data, albeit one that is often made only implicitly. For\nexample, in educational research and in many cluster randomised trials\n[e.g., \\citet{carter}], random cluster sizes are widely discussed, and\nconsiderations such as school size and hospital or ward size in a\nhealth setting might reasonably be expected to demonstrate an\nassociation with outcome measures. In the present study, $N_{ij}$ is\nprespecified as a key outcome variable to which a priori\nhypotheses attain.\n\nDifferent models were formulated for each of the four outcome\nvariables, although each is a variant on the three-level hierarchical\nmodel with independent random effects governing within-level\ncorrelation [\\citet{pinheiro}].\n\n\n\\subsection{Models}\n\nFor clarity of notation in this section, subscripts are not used to\ndistinguish between corresponding parameters (such as the intercept\nparameter) for different outcomes. Percentage lymphatic area was\nmodelled untransformed as\n\n\n\n", "index": 1, "text": "\\begin{equation}\n\\label{PLAeqn} Y_{ij}^{\\%} = \\alpha+ \\beta_{x_{ij}} +\na_i + Z_{ij},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"Y_{ij}^{\\%}=\\alpha+\\beta_{x_{ij}}+a_{i}+Z_{ij},\" display=\"block\"><mrow><mrow><msubsup><mi>Y</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mo lspace=\"0pt\" rspace=\"3.5pt\">%</mo></msubsup><mo>=</mo><mrow><mi>α</mi><mo>+</mo><msub><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></msub><mo>+</mo><msub><mi>a</mi><mi>i</mi></msub><mo>+</mo><msub><mi>Z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08097.tex", "nexttext": "\n\nwith $b_{ij} \\sim\\mathrm{N}(0,\\nu^2)$ independently of the $a_i$ and\nthe $Z_{ijk}$.\n\nThe circularity variable $Y_{ijk}^C$ required a somewhat different\napproach owing to the substantive hypothesis relating to this variable.\nWhile hypotheses for the other three outcomes all referred to mean\ndifferences between tissue types, the question to be answered using the\ncircularity data is whether there is a differential in the structure of\nlymph cells drawn from specimens belonging to different groups. In\nparticular, it was hypothesised that lymphatic vessels in control\ntissue would retain a more regular structure than those in case tissue;\nin this case, control lymphatic vessels might tend to have the\nappearance of lying parallel to one another. This question is not\nreadily answered using mean circularity, which would instead measure\nthe extent to which lymphatic vessels tend to lie parallel to the plane\nat which the biopsy is taken, cutting the three-dimensional tissue at\nan arbitrary angle [\\citet{wicksell}].\n\nInstead, it is required to test whether the within-specimen,\nwithin-field variation in lymphatic vessel circularity is greater in\ncases than in controls, which would indicate a less regularly aligned\nlymphatic vessel network. Thus, using a logit transform to transform\nthe domain of $Y_{ijk}^C$ from $(0,1)$ to $(-\\infty,\\infty)$, the model\nis of the form\n\n\n\n", "itemtype": "equation", "pos": 21079, "prevtext": "\n\nwhere $a_i \\sim\\mathrm{N}(0,\\tau^2)$ independently is a specimen-level\nrandom effect and $Z_{ij} \\sim\\mathrm{N}(0,\\sigma^2)$ is an error\nterm, where the $Z_{ij}$ are independent of each other and of the\n$a_i$, that is, fields are assumed to be conditionally independent,\ngiven the specimen. Unless otherwise stated, similar independence\nassumptions are made on random effect and error terms in the other\nmodels described in this section.\n\nThe count variable LVD was modelled using a generalised mixed model. An\noffset of unity was included to prevent zero counts, as any fields\ncontaining no vessels would not have been included in the data set,\n\n\n\\begin{eqnarray}\n\\label{LVDeqn} N_{ij} & \\sim&1 + \\operatorname{Poisson}(\\mu_{ij}),\n\\nonumber\n\\[-8pt]\n\\[-8pt]\n\\nonumber\n\\log(\\mu_{ij}) & =& \\alpha+ \\beta_{x_{ij}} + a_i.\n\\end{eqnarray}\n\nThe above formulation can be viewed as part of the general class of\nmodels for overdispersion discussed by \\citet{dean}. In order to test\nwhether this adequately captured the overdispersion in $N_{ij}$,\nresults were compared to those from a negative binomial model,\nfollowing \\citet{lindsey}.\n\nThe two vessel-level variables were modelled using an extension of the\nhierarchy to allow for field-specific random effects. Vessel area was\nlog-transformed and modelled as\n\n\n\n", "index": 3, "text": "\\begin{equation}\n\\label{VAeqn} \\log\\bigl(Y_{ijk}^A\\bigr) = \\alpha+\n\\beta_{x_{ij}} + a_i + b_{ij} + Z_{ijk},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\log\\bigl{(}Y_{ijk}^{A}\\bigr{)}=\\alpha+\\beta_{x_{ij}}+a_{i}+b_{ij}+Z_{ijk},\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><msubsup><mi>Y</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow><mi>A</mi></msubsup><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>α</mi><mo>+</mo><msub><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></msub><mo>+</mo><msub><mi>a</mi><mi>i</mi></msub><mo>+</mo><msub><mi>b</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>+</mo><msub><mi>Z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08097.tex", "nexttext": "\n\nwhere random effects are specified as above, except that $b_{ij} \\sim\n\\mathrm{N}(0,\\delta_{x_{ij}} \\nu^2)$, with $\\delta_4$\n(corresponding to\ninvasive carcinoma) set to unity for identifiability, and we require to\ntest the hypothesis that all of the $\\delta$-parameters are equal\nagainst a general alternative.\n\nModels were fitted using functions in the \\texttt{nlme} and \\texttt\n{MASS} packages in \\textsf{R} [\\citet{nlmecite,MASScite,Rcite}].\n\n\n\\subsection{Results}\n\nThe results of fitting models (\\ref{PLAeqn})--(\\ref{Ceqn}) are\nsummarised in Table~\\ref{resultstable}. For all outcomes, there was\nstatistically significant clustering within specimens and also within\nfields (nonzero random effect variance parameters). Intra-cluster\ncorrelation coefficients can be estimated from the variance parameter\nestimates in Table~\\ref{resultstable}; for example, the within-specimen\nclustering effect for \\%LA is estimated as $1.20/(1.20+8.63)=0.12$. For\nthe two field-level outcomes, clustering effects are higher at the\nfield-specific level of the hierarchy than within specimens. Standard\nerrors of most fixed effect estimates are increased by a factor of\naround two compared to corresponding models that make no allowance for\nthe hierarchical data structure, and point estimates remain similar. No\nimprovement on the Poisson random effects model was seen using the\nnegative binomial distribution (in terms of change in the\nlog-likelihood), and so the Poisson formulation was retained.\n\nCompared to control ectocervix tissue, there is clear evidence that all\nother tissue types have greater LVD and smaller vessel area. The\ndifference is especially marked for invasive carcinoma tissue, for\nwhich there is an estimated 3.7-fold increase in LVD and 3.8-fold\nreduction in average vessel area compared to control ectocervix. As LVD\nand vessel area show opposing trends, as a result of the correlation\nbetween them, there are no differences between normal ectocervix, CIN\nand invasive carcinoma tissue for \\%LA, although there is evidence that\n\\%LA is higher in normal transformation zone tissue.\n\nThere is evidence that vessels tend to be more circular in control\ntransformation zone and CIN than in the other two tissue types, but\nalso evidence that the within-field variance of circularity\nmeasurements is higher in invasive carcinoma specimens than in control\nectocervix and CIN (as estimates of the relevant $\\delta$-parameters\nare significantly less than unity). Moreover, analysis of variance\ncomparing the fit of this model with the special case in which all\n$\\delta$-parameters are constrained to be equal suggests significantly\nimproved fit of the more general model ($p=0.001$). Allowing a separate\n$\\delta$-parameter for each of the three CIN categories, however, did\nnot greatly improve the fit ($p=0.07$), so the more parsimonious model\nis reported here. It should be noted that the study was not designed to\ninvestigate differences between the three CIN grades. The final model\nthus suggests greater variation in circularity amongst fields taken\nfrom invasive carcinoma tissue than for control ectocervix and CIN.\n\n\n\\begin{table}\n\\tabcolsep=0pt\n\\caption{Parameter estimates for hierarchical models}\n\\label{resultstable}\n\\begin{tabular*}{\\textwidth}{@{\\extracolsep{\\fill}}lcccc@{}}\n\\hline\n& \\textbf{LVD} & \\textbf{\\%LA} & \\textbf{Vessel area} & \\textbf{Circularity}\\\\\n& $\\bolds{\\exp(\\hat{\\beta})}$ & $\\bolds{\\hat{\\beta}}$ & $\\bolds{\\exp(\\hat{\\beta})}$ &\n$\\bolds{\\exp(\\hat\n{\\beta})}$\\\\\n\\hline\nControl cervix & \\\\\n\\quad Ectocervix & -- & -- & -- & -- \\\\\n\\quad Transformation zone & 2.37 $[2.11,2.67]$ & 1.85 $[1.05,2.65]$  & 0.53\n$[0.43,0.64]$ & 1.27 $[1.08,1.50]$\\[3pt]\nCIN & 2.31 $[1.97,2.70]$ & \\phantom{0.}0.28 $[-0.70,1.26]$ & 0.42 $[0.32,0.56]$ & 1.37\n$[1.11,1.68]$\\[3pt]\nInvasive carcinoma & 3.71 $[3.19,4.31]$ & $-0.04$ $[-0.99,0.91]$ & 0.26\n$[0.20,0.35]$ & 1.01 $[0.82,1.23]$\\[6pt]\n$\\hat{\\tau}^2$ & 0.03 $[0.02,0.06]$ & 1.20 $[0.61,2.38]$ & 0.12 $[0.07,0.20]$\n& 0.05 $[0.03,0.10]$\\\\\n$\\hat{\\nu}^2$ & -- & -- & 0.22 $[0.17,0.28]$ & 0.13 $[0.09,0.17]$\\\\\n$\\hat{\\sigma}^2$ & -- & 8.63 $[7.61,9.80]$ & 1.02 $[0.97,1.08]$ & 0.95\n$[0.88,1.03]$\\\\\n$\\hat{\\delta}_1$ & -- & -- & -- & 0.85 $[0.78,0.93]$\\\\\n$\\hat{\\delta}_2$ & -- & -- & -- & 0.98 $[0.90,1.05]$\\\\\n$\\hat{\\delta}_3$ & -- & -- & -- & 0.91 $[0.85,0.97]$\\\\\n\\hline\n\\end{tabular*}\n\n\\end{table}\n\n\n\\section{Joint models}\n\\label{joint}\n\n\n\\subsection{Introduction}\n\nThe key issue remaining to be addressed relates to the assumption made\nimplicitly in hierarchical modelling such as in Section~\\ref{hierarchical} that the cluster-specific sample sizes are fixed. In the\npresent study it is reasonable to regard the total sample size, $n$,\nand the number of fields per individual, $n_i$, to be fixed by design,\nbut the number of vessels per field, $n_{ij}$, would be more accurately\nregarded as the realisation of a random variable $N_{ij}$, which is the\ndefinition of the LVD outcome variable.\n\nFitting models that condition on the observed value of this random\nvariable may lead to incorrect inferences about the relationship\nbetween study group and other outcomes of interest. For example, there\nmay be underlying tissue-specific characteristics that are associated\nwith both an increase in LVD and a reduction in vessel size; indeed, it\nis biologically plausible that this should be the case in invasive\ncarcinoma tissue. These effects may be masked by an analysis that is\nbased on conditioning on LVD, and the conditional models may give\ninappropriate inferences about the relationship between tissue type and\nvessel size.\n\n\n\\subsection{Models}\n\nOne possible analysis strategy factorises the joint likelihood of $Y$\nand $N$ into conditional and marginal components, that is, $[Y,N|X] =\n[Y|N,X] [N|X]$, where the notation ``$[\\cdot]$'' means ``distribution of''. This\nhas the appealing property of allowing a simple marginal analysis of\n$N|X$, but raises the question of whether the models for $Y|N,X$\nconsidered in Section~\\ref{hierarchical} are satisfactory even as\nconditional models, as they do not explicitly model the correlation\nbetween $N$ and $Y$.\n\nAs a possible solution, \\citet{catalanoryan1992} discuss bivariate\nmodels in which a function of $N$ enters the expression for $[Y|N,X]$\ndirectly as a covariate. This approach is also adopted by \\citet\n{panageas} in the context of outcome of surgery when the cluster size\nis the number of patients treated for a given surgeon.\n\nGeometrical considerations and Figure~\\ref{VAversusLVD} suggest that an\nappropriate choice in the present study might be $N^{-1}$ for the\nfollowing reasons. In 2D, lymphatic vessels are approximately circular\nin appearance. The maximum total area of $m^2$ circles of equal radius\npacked into a square of area $a^2$ is $\\pi a^2/4m^2$, and so in two\ndimensions the proportion of the field area that is filled by vessels\nmight be expected to be proportional to the reciprocal $N$. Model (\\ref\n{VAeqn}) would become\n\n", "itemtype": "equation", "pos": 22581, "prevtext": "\n\nwith $b_{ij} \\sim\\mathrm{N}(0,\\nu^2)$ independently of the $a_i$ and\nthe $Z_{ijk}$.\n\nThe circularity variable $Y_{ijk}^C$ required a somewhat different\napproach owing to the substantive hypothesis relating to this variable.\nWhile hypotheses for the other three outcomes all referred to mean\ndifferences between tissue types, the question to be answered using the\ncircularity data is whether there is a differential in the structure of\nlymph cells drawn from specimens belonging to different groups. In\nparticular, it was hypothesised that lymphatic vessels in control\ntissue would retain a more regular structure than those in case tissue;\nin this case, control lymphatic vessels might tend to have the\nappearance of lying parallel to one another. This question is not\nreadily answered using mean circularity, which would instead measure\nthe extent to which lymphatic vessels tend to lie parallel to the plane\nat which the biopsy is taken, cutting the three-dimensional tissue at\nan arbitrary angle [\\citet{wicksell}].\n\nInstead, it is required to test whether the within-specimen,\nwithin-field variation in lymphatic vessel circularity is greater in\ncases than in controls, which would indicate a less regularly aligned\nlymphatic vessel network. Thus, using a logit transform to transform\nthe domain of $Y_{ijk}^C$ from $(0,1)$ to $(-\\infty,\\infty)$, the model\nis of the form\n\n\n\n", "index": 5, "text": "\\begin{equation}\n\\label{Ceqn} \\operatorname{logit}\\bigl(Y_{ijk}^C\\bigr) = \\alpha+\n\\beta_{x_{ij}} + a_i + b_{ij} + Z_{ijk},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\operatorname{logit}\\bigl{(}Y_{ijk}^{C}\\bigr{)}=\\alpha+\\beta_{x_{ij}}+a_{i}+b_%&#10;{ij}+Z_{ijk},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\operatorname</mtext></merror><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>g</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><msubsup><mi>Y</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow><mi>C</mi></msubsup><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>α</mi><mo>+</mo><msub><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></msub><mo>+</mo><msub><mi>a</mi><mi>i</mi></msub><mo>+</mo><msub><mi>b</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>+</mo><msub><mi>Z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08097.tex", "nexttext": "\n\nThis approach causes a manifest change in the parameter estimates: the\nestimates of $\\exp(\\beta)$ change to $1.09\\ [0.88,1.36]$\n(transformation zone), $0.91\\ [0.69,\\break 1.18]$ (CIN) and $0.69\\\n[0.52,0.91]$ (invasive carcinoma), and $\\hat{\\gamma}=19.7\\\n[12.0,32.6]$. However, for reasons discussed above, there are drawbacks\nto a conditional model, which in any case answers a different research\nquestion to the one of primary interest, and this simple approach also\nfails in itself to take account of the stochasticity of $N$.\n\nAn alternative is to model the joint distribution of $Y_{ijk}^A$ and\n$N_{ij}$ directly. The correlation can be modelled using a linked\nrandom effect approach:\n\n\n\\begin{eqnarray}\n\\label{common} \\log\\bigl(Y_{ijk}^A\\bigr) & =&\n\\alpha^A + \\beta^A_{x_{ij}} + \\lambda^A\na^A_i + b_{ij} + Z_{ijk},\n\\nonumber\n\\\\\nN_{ij} & \\sim&1 + \\operatorname{Poisson}(\\mu_{ij}),\n\\\\\n\\mu_{ij} & =& \\alpha^N + \\beta^N_{x_{ij}}\n+ \\lambda^N a^N_i,\n\\nonumber\n\\end{eqnarray}\n\nwhere $b_{ij}$ and $Z_{ijk}$ are as previously and, independently of\n$b_{ij}$ and $Z_{ijk}$, ${\\mathbf{a}}_i=(a^A_i,a^N_i) \\sim\\mathrm\n{N}(0,{\\bolds{\\Sigma}}\n)$, where\n\n", "itemtype": "equation", "pos": 29678, "prevtext": "\n\nwhere random effects are specified as above, except that $b_{ij} \\sim\n\\mathrm{N}(0,\\delta_{x_{ij}} \\nu^2)$, with $\\delta_4$\n(corresponding to\ninvasive carcinoma) set to unity for identifiability, and we require to\ntest the hypothesis that all of the $\\delta$-parameters are equal\nagainst a general alternative.\n\nModels were fitted using functions in the \\texttt{nlme} and \\texttt\n{MASS} packages in \\textsf{R} [\\citet{nlmecite,MASScite,Rcite}].\n\n\n\\subsection{Results}\n\nThe results of fitting models (\\ref{PLAeqn})--(\\ref{Ceqn}) are\nsummarised in Table~\\ref{resultstable}. For all outcomes, there was\nstatistically significant clustering within specimens and also within\nfields (nonzero random effect variance parameters). Intra-cluster\ncorrelation coefficients can be estimated from the variance parameter\nestimates in Table~\\ref{resultstable}; for example, the within-specimen\nclustering effect for \\%LA is estimated as $1.20/(1.20+8.63)=0.12$. For\nthe two field-level outcomes, clustering effects are higher at the\nfield-specific level of the hierarchy than within specimens. Standard\nerrors of most fixed effect estimates are increased by a factor of\naround two compared to corresponding models that make no allowance for\nthe hierarchical data structure, and point estimates remain similar. No\nimprovement on the Poisson random effects model was seen using the\nnegative binomial distribution (in terms of change in the\nlog-likelihood), and so the Poisson formulation was retained.\n\nCompared to control ectocervix tissue, there is clear evidence that all\nother tissue types have greater LVD and smaller vessel area. The\ndifference is especially marked for invasive carcinoma tissue, for\nwhich there is an estimated 3.7-fold increase in LVD and 3.8-fold\nreduction in average vessel area compared to control ectocervix. As LVD\nand vessel area show opposing trends, as a result of the correlation\nbetween them, there are no differences between normal ectocervix, CIN\nand invasive carcinoma tissue for \\%LA, although there is evidence that\n\\%LA is higher in normal transformation zone tissue.\n\nThere is evidence that vessels tend to be more circular in control\ntransformation zone and CIN than in the other two tissue types, but\nalso evidence that the within-field variance of circularity\nmeasurements is higher in invasive carcinoma specimens than in control\nectocervix and CIN (as estimates of the relevant $\\delta$-parameters\nare significantly less than unity). Moreover, analysis of variance\ncomparing the fit of this model with the special case in which all\n$\\delta$-parameters are constrained to be equal suggests significantly\nimproved fit of the more general model ($p=0.001$). Allowing a separate\n$\\delta$-parameter for each of the three CIN categories, however, did\nnot greatly improve the fit ($p=0.07$), so the more parsimonious model\nis reported here. It should be noted that the study was not designed to\ninvestigate differences between the three CIN grades. The final model\nthus suggests greater variation in circularity amongst fields taken\nfrom invasive carcinoma tissue than for control ectocervix and CIN.\n\n\n\\begin{table}\n\\tabcolsep=0pt\n\\caption{Parameter estimates for hierarchical models}\n\\label{resultstable}\n\\begin{tabular*}{\\textwidth}{@{\\extracolsep{\\fill}}lcccc@{}}\n\\hline\n& \\textbf{LVD} & \\textbf{\\%LA} & \\textbf{Vessel area} & \\textbf{Circularity}\\\\\n& $\\bolds{\\exp(\\hat{\\beta})}$ & $\\bolds{\\hat{\\beta}}$ & $\\bolds{\\exp(\\hat{\\beta})}$ &\n$\\bolds{\\exp(\\hat\n{\\beta})}$\\\\\n\\hline\nControl cervix & \\\\\n\\quad Ectocervix & -- & -- & -- & -- \\\\\n\\quad Transformation zone & 2.37 $[2.11,2.67]$ & 1.85 $[1.05,2.65]$  & 0.53\n$[0.43,0.64]$ & 1.27 $[1.08,1.50]$\\[3pt]\nCIN & 2.31 $[1.97,2.70]$ & \\phantom{0.}0.28 $[-0.70,1.26]$ & 0.42 $[0.32,0.56]$ & 1.37\n$[1.11,1.68]$\\[3pt]\nInvasive carcinoma & 3.71 $[3.19,4.31]$ & $-0.04$ $[-0.99,0.91]$ & 0.26\n$[0.20,0.35]$ & 1.01 $[0.82,1.23]$\\[6pt]\n$\\hat{\\tau}^2$ & 0.03 $[0.02,0.06]$ & 1.20 $[0.61,2.38]$ & 0.12 $[0.07,0.20]$\n& 0.05 $[0.03,0.10]$\\\\\n$\\hat{\\nu}^2$ & -- & -- & 0.22 $[0.17,0.28]$ & 0.13 $[0.09,0.17]$\\\\\n$\\hat{\\sigma}^2$ & -- & 8.63 $[7.61,9.80]$ & 1.02 $[0.97,1.08]$ & 0.95\n$[0.88,1.03]$\\\\\n$\\hat{\\delta}_1$ & -- & -- & -- & 0.85 $[0.78,0.93]$\\\\\n$\\hat{\\delta}_2$ & -- & -- & -- & 0.98 $[0.90,1.05]$\\\\\n$\\hat{\\delta}_3$ & -- & -- & -- & 0.91 $[0.85,0.97]$\\\\\n\\hline\n\\end{tabular*}\n\n\\end{table}\n\n\n\\section{Joint models}\n\\label{joint}\n\n\n\\subsection{Introduction}\n\nThe key issue remaining to be addressed relates to the assumption made\nimplicitly in hierarchical modelling such as in Section~\\ref{hierarchical} that the cluster-specific sample sizes are fixed. In the\npresent study it is reasonable to regard the total sample size, $n$,\nand the number of fields per individual, $n_i$, to be fixed by design,\nbut the number of vessels per field, $n_{ij}$, would be more accurately\nregarded as the realisation of a random variable $N_{ij}$, which is the\ndefinition of the LVD outcome variable.\n\nFitting models that condition on the observed value of this random\nvariable may lead to incorrect inferences about the relationship\nbetween study group and other outcomes of interest. For example, there\nmay be underlying tissue-specific characteristics that are associated\nwith both an increase in LVD and a reduction in vessel size; indeed, it\nis biologically plausible that this should be the case in invasive\ncarcinoma tissue. These effects may be masked by an analysis that is\nbased on conditioning on LVD, and the conditional models may give\ninappropriate inferences about the relationship between tissue type and\nvessel size.\n\n\n\\subsection{Models}\n\nOne possible analysis strategy factorises the joint likelihood of $Y$\nand $N$ into conditional and marginal components, that is, $[Y,N|X] =\n[Y|N,X] [N|X]$, where the notation ``$[\\cdot]$'' means ``distribution of''. This\nhas the appealing property of allowing a simple marginal analysis of\n$N|X$, but raises the question of whether the models for $Y|N,X$\nconsidered in Section~\\ref{hierarchical} are satisfactory even as\nconditional models, as they do not explicitly model the correlation\nbetween $N$ and $Y$.\n\nAs a possible solution, \\citet{catalanoryan1992} discuss bivariate\nmodels in which a function of $N$ enters the expression for $[Y|N,X]$\ndirectly as a covariate. This approach is also adopted by \\citet\n{panageas} in the context of outcome of surgery when the cluster size\nis the number of patients treated for a given surgeon.\n\nGeometrical considerations and Figure~\\ref{VAversusLVD} suggest that an\nappropriate choice in the present study might be $N^{-1}$ for the\nfollowing reasons. In 2D, lymphatic vessels are approximately circular\nin appearance. The maximum total area of $m^2$ circles of equal radius\npacked into a square of area $a^2$ is $\\pi a^2/4m^2$, and so in two\ndimensions the proportion of the field area that is filled by vessels\nmight be expected to be proportional to the reciprocal $N$. Model (\\ref\n{VAeqn}) would become\n\n", "index": 7, "text": "\n\\[\n\\log\\bigl(Y_{ijk}^A\\bigr) = \\alpha+ \\beta_{x_{ij}} +\n\\gamma n_{ij}^{-1} + a_i + b_{ij} +\nZ_{ijk}.\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\log\\bigl{(}Y_{ijk}^{A}\\bigr{)}=\\alpha+\\beta_{x_{ij}}+\\gamma n_{ij}^{-1}+a_{i}%&#10;+b_{ij}+Z_{ijk}.\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><msubsup><mi>Y</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow><mi>A</mi></msubsup><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>α</mi><mo>+</mo><msub><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></msub><mo>+</mo><mrow><mi>γ</mi><mo>⁢</mo><msubsup><mi>n</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mrow><mo>+</mo><msub><mi>a</mi><mi>i</mi></msub><mo>+</mo><msub><mi>b</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>+</mo><msub><mi>Z</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08097.tex", "nexttext": "\n\nThis formulation closely follows the general three-outcome model for\none continuous, one binary and one count variable discussed by \\citet\n{catalanoryan1992} and \\citet{ga2001}, and developed further by \\citet\n{gueorguieva}. The shared random effect structure considered by these\nauthors is very similar to~(\\ref{common}), although in place of the\nPoisson model for $N_{ij}$ they instead use a continuation ratio probit\nmodel, which in our notation would take the form\n\n", "itemtype": "equation", "pos": 30927, "prevtext": "\n\nThis approach causes a manifest change in the parameter estimates: the\nestimates of $\\exp(\\beta)$ change to $1.09\\ [0.88,1.36]$\n(transformation zone), $0.91\\ [0.69,\\break 1.18]$ (CIN) and $0.69\\\n[0.52,0.91]$ (invasive carcinoma), and $\\hat{\\gamma}=19.7\\\n[12.0,32.6]$. However, for reasons discussed above, there are drawbacks\nto a conditional model, which in any case answers a different research\nquestion to the one of primary interest, and this simple approach also\nfails in itself to take account of the stochasticity of $N$.\n\nAn alternative is to model the joint distribution of $Y_{ijk}^A$ and\n$N_{ij}$ directly. The correlation can be modelled using a linked\nrandom effect approach:\n\n\n\\begin{eqnarray}\n\\label{common} \\log\\bigl(Y_{ijk}^A\\bigr) & =&\n\\alpha^A + \\beta^A_{x_{ij}} + \\lambda^A\na^A_i + b_{ij} + Z_{ijk},\n\\nonumber\n\\\\\nN_{ij} & \\sim&1 + \\operatorname{Poisson}(\\mu_{ij}),\n\\\\\n\\mu_{ij} & =& \\alpha^N + \\beta^N_{x_{ij}}\n+ \\lambda^N a^N_i,\n\\nonumber\n\\end{eqnarray}\n\nwhere $b_{ij}$ and $Z_{ijk}$ are as previously and, independently of\n$b_{ij}$ and $Z_{ijk}$, ${\\mathbf{a}}_i=(a^A_i,a^N_i) \\sim\\mathrm\n{N}(0,{\\bolds{\\Sigma}}\n)$, where\n\n", "index": 9, "text": "\n\\[\n{\\bolds{\\Sigma}}= \\pmatrix{ 1 & \\rho\n\\vspace*{2pt}\\cr\n\\rho& 1}.\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"{\\bolds{\\Sigma}}=\\pmatrix{1&amp;\\rho\\cr\\rho&amp;1}.\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\bolds</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi></mrow><mo>=</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mn>1</mn></mtd><mtd columnalign=\"center\"><mi>ρ</mi></mtd></mtr><mtr><mtd columnalign=\"center\"><mi>ρ</mi></mtd><mtd columnalign=\"center\"><mn>1</mn></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08097.tex", "nexttext": "\n\nintroducing a potentially large number of additional parameters $\\delta_h$.\n\nThe work of \\citet{gueorguieva} extends the model of \\citet{dunson}, who\nprovide an integral expression for the correlation between the two\noutcomes conditional on the random effects. An advantage of this joint\napproach over the conditional one is that it gives an estimate of the\ndirect effect of tissue type on each outcome variable, similar to that\nused in joint longitudinal and survival modelling [\\citet{ibrahim}].\n\nIt is convenient to use a Bayesian framework to fit model (\\ref\n{common}). Priors were specified as follows: for each $\\alpha$ and\n$\\beta$ parameter, $\\mathrm{N}(0,10^{-6})$; for each precision\nparameter, $\\Gamma(10^{-3},10^{-3})$; $\\lambda\\sim\\operatorname\n{Unif}(-10,10)$; $\\rho\\sim\\operatorname{Unif}(-0.95,0.95)$. The prior for\n$\\rho$ was chosen with two considerations in mind: to allow that the\noutcomes might be strongly, but not perfectly, correlated, and to\nensure that draws from the distribution of $\\rho$ do not allow $\\Sigma$\nto become singular. The model was fitted in WinBUGS v1.4 [\\citet{lunn}],\nwith a burn-in period of 50,000 iterations. Posterior estimates were\nobtained from a further 50,000 iterations, with a thinning factor of~20.\nIn additional analyses to check the sensitivity to the choice of\npriors, the prior distributional forms and/or numerical values of the\nhyperparameters were varied (although always remaining ``vague'', in the\nsense of having high variance).\n\nFor comparison, this model was also fitted with $\\rho$ set to zero,\nequivalent to fitting univariate models to each of the outcomes in the\nBayesian framework.\n\n\n\\subsection{Results}\n\nTable~\\ref{jointresultstable} shows parameter estimates (median of\nposterior distribution and 95\\% credible interval) from model (\\ref\n{common}). Fitting the model with $\\rho$ set to zero gives\nnear-identical results to Table~\\ref{resultstable}, the only difference\nbeing the LVD Transformation zone parameter, for which the estimate in\nthe Bayesian model was $2.37\\ [1.96, 2.84]$. This allows direct\ncomparison of the univariate and joint results. After thinning, the\nautocorrelation of posterior samples for all parameters was negligible,\nand there was no material difference in the results according to the\nchoice of priors.\n\nPoint estimates for the $\\beta$ parameters are similar to those in\nTable~\\ref{resultstable}, but in many cases credible intervals are\nsomewhat wider. The negative estimate of $\\lambda^N$ was expected and\nis due to the negative correlation between LVD and vessel area.\nSimilarly, the estimate of $\\rho$ is negative, and suggests high\ncorrelation between the individual-level random effects. The posterior\ndistributions of most parameters, including the components of the\nrandom effects $b$, are approximately symmetric. An exception is $\\rho\n$, by virtue of being bounded through the support of the prior by $\\pm\n0.95$, which therefore has a positively skewed posterior distribution.\n\nFigure~\\ref{REfigure} shows the relationship between the fitted\nfield-level random effects from model (\\ref{VAeqn}) and LVD. This\nprovides a possible reason why the point estimates of the joint model\nare largely unchanged compared to those from the single-model, as the\nrelationship is strikingly similar to that between log-vessel area and\nLVD (Figure~\\ref{VAversusLVD}). In the univariate model the correlation\nbetween the cluster size and the outcome is implicitly accounted for\nthrough the random effects distribution, even though no such\nassociation has been specified in the formulation of the model.\n\n\n\\begin{table}\n\\caption{Parameter estimates for joint model\nfor LVD and vessel area}\n\\label{jointresultstable}\n\\begin{tabular*}{\\textwidth}{@{\\extracolsep{\\fill}}lcc@{}}\n\n\\hline\n& \\textbf{LVD} & \\textbf{Vessel area} \\\\\n& $\\bolds{\\exp(\\hat{\\beta})}$ & $\\bolds{\\exp(\\hat{\\beta})}$ \\\\\n\\hline\nControl cervix & \\\\\n\\quad Ectocervix & -- & --\\\\\n\\quad Transformation zone & 2.35 $[1.97,2.85]$ & 0.54 $[0.40,0.75]$ \\[3pt]\nCIN & 2.34 $[1.96,2.78]$ & 0.42 $[0.31,0.57]$\\[3pt]\nInvasive carcinoma & 3.78 $[3.17,4.47]$ & 0.26 $[0.20,0.36]$ \\[6pt]\n$\\hat{\\lambda^A}$ & \\multicolumn{2}{c}{$0.25\\ [0.16,0.35]$\\phantom{0.}} \\\\\n$\\hat{\\lambda^N}$ & \\multicolumn{2}{c}{$-0.13\\ [-0.18,-0.08]$} \\\\\n$\\hat{\\nu}^2$ & \\multicolumn{2}{c}{$0.19\\ [0.14,0.25]$\\phantom{0.}} \\\\\n$\\hat{\\sigma}^2$ & \\multicolumn{2}{c}{$1.01\\ [0.98,1.04]$\\phantom{0.}} \\\\\n$\\hat{\\rho}$ & \\multicolumn{2}{c}{$-0.78\\ [-0.92,-0.52]$}\\\\\n\\hline\n\\end{tabular*}\n\n\\end{table}\n\n\n\\begin{figure}\n\n\\includegraphics{867f05.eps}\n\n\\caption{Relationship between estimated vessel-level random effects\n($b_{ij}$) from model (\\protect\\ref{VAeqn}) and LVD, with fitted\nloess curve.}\n\\label{REfigure}\n\\end{figure}\n\n\n\n\n\n\\section{Discussion}\\label{sec5}\nThe analysis presented provides clear evidence of differences in\nproperties of lymphatic vessels according to presence of CIN or\ninvasive carcinoma in the cervix. Relative to the other tissue types\nconsidered, tissue taken from individuals with invasive carcinoma have\nlymphatic vessels that are greater in number, smaller in size and less\nregular in shape. In addition, this study found a difference between\nthe ectocervix and transformation zone of the control cervix, whereas\nno difference was found in LVD between control transformation zone and\nCIN groups. The main scientific conclusions were relatively unaffected\nby the decision to model the data in a joint as opposed to a univariate\nframework.\n\nThese findings are consistent with a model that asserts that\nlymphangiogenesis occurs when the cervix undergoes eversion at puberty,\nto which all experimental groups would be subject, but also suggest\nthat there is a separate lymphangiogenenic episode in the squamous\ncarcinoma group. Further investigation is needed to ascertain whether\nthe expression of genes encoding growth factors that may cause this\nadditional lymphangiogenesis occurs late in CIN or after the\nprogression to squamous cell carcinoma. Also, the average area of\nvessels in the CIN group was unexpectedly smaller than those in the\ntransformation zone, a finding not explained by this model of\nlymphangiogenesis, confirming the need for further studies. In the\ncarcinoma group, vessels were considerably smaller than in all other\ngroups, supporting the hypothesis of newer formation, and there was\nsome evidence that they are morphologically and therefore functionally\ndifferent.\n\nThe approach to statistical analysis was guided by the multilevel\nstructure of the data set, in which it was required to account for high\nwithin-specimen correlation in the outcome variables measured. The\nnegative correlation between LVD and vessel area suggested a joint\nmodel for these two outcomes would provide a measure of the direct\neffect of tissue type on the two outcomes. As one of these variables\nwas equal to the cluster-level sample size, a different analysis\nstrategy was required than that typically used, for example, for two\ncontinuous outcome variables.\n\nOur method used shared random effects in a bivariate Normal--Poisson\nframework to allow for this correlation. We used a Bayesian framework,\nalthough similar models have been considered utilising direct\nlikelihood maximisation [\\citet{gueorguieva}]. Allowing for the\nrandomness in cluster size tended to increase the standard errors of\nparameter estimates, but there were no substantial changes in the point\nestimates themselves.\n\nThis finding agrees with the results of \\citet{neuhaus}, who demonstrate\nthat for linear mixed models with random intercept only, estimators of\ncovariate effects are consistent, and are estimated equally\nefficiently, even when cluster size is ignored. They point out that the\nexception is the fixed intercept parameter ($\\alpha$), which in any\ncase is rarely of substantive interest. However, they assume that\ncluster sizes do not depend on covariates, which is not plausible in\nour application in that cluster size itself is an outcome measure, with\nstrong evidence of an association with tissue type.\n\nAdditionally, the data considered here did not warrant using random\nslope models, which have been used successfully elsewhere when\ncontinuous covariates were available [e.g., \\citet{dunson}]. In general,\nthe area of informative cluster size has received little attention in\nthe statistics literature, and has only been applied to a limited\nnumber of application areas, which is perhaps surprising given the\nrapidly increasing level of research in the area of cluster randomised trials.\n\nThe joint modelling framework considered could in principal be extended\nto the multivariate case. In our analysis this was not necessary, as\nthere was no reason why circularity should be associated with the\nnumber or size of vessels. To achieve this, similar models might be\nconsidered that use several shared random effect terms to induce\ncorrelation between the random variables. \\citet{catalanoryan1992}\nprovide further details.\n\nThis study did not attempt to distinguish between the cancer grade or\nstage of samples analysed, and also makes no link between properties of\nlymphatic vessels and metastasis or prognosis. These are both\nlimitations and possible future research directions, and it would be a\nsimple extension of the joint framework set out here to analyse data of\nthis type. In addition, in this study it was not possible to measure\neither the spatial distribution of lymphatic vessels within a specimen\nor changes in lymph structure relative to distance from the tumour\nsite, both of which may provide extra insight.\n\n\n\n\n\n\\section*{Acknowledgments}\nThis manuscript has benefitted from the comments of a reviewer, an\nEditor and an Associate Editor.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{32}\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Alitalo, Tammela and Petrova}{2005}]{al05}\n\n\\begin{barticle}[auto]\n\\bauthor{\\bsnm{Alitalo},~\\bfnm{K.}\\binits{K.}},\n\\bauthor{\\bsnm{Tammela},~\\bfnm{T.}\\binits{T.}}\n\\and\n\\bauthor{\\bsnm{Petrova},~\\bfnm{T.~V.}\\binits{T.~V.}}\n(\\byear{2005}).\n\\btitle{Lymphangiogenesis in development and human\ndisease}.\n\\bjournal{Nature}\n\\bvolume{438}\n\\bpages{946--953}.\n\\end{barticle}\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Carter}{2010}]{carter}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Carter},~\\bfnm{Ben}\\binits{B.}}\n(\\byear{2010}).\n\\btitle{Cluster size variability and imbalance in cluster randomized\ncontrolled trials}.\n\\bjournal{Stat. Med.}\n\\bvolume{29}\n\\bpages{2984--2993}.\n\\bid{doi={10.1002/sim.4050}, issn={0277-6715}, mr={2758393}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Catalano and Ryan}{1992}]{catalanoryan1992}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Catalano},~\\bfnm{P.~J.}\\binits{P.~J.}} \\AND\n\\bauthor{\\bsnm{Ryan},~\\bfnm{L.~M.}\\binits{L.~M.}}\n(\\byear{1992}).\n\\btitle{Bivariate latent variable models for clustered discrete and\ncontinuous outcomes}.\n\\bjournal{J. Amer. Statist. Assoc.}\n\\bvolume{87}\n\\bpages{651--658}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Chapman, Fanshawe and Crick}{2013}]{chapman}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Chapman},~\\bfnm{C.~M.}\\binits{C.~M.}},\n\\bauthor{\\bsnm{Fanshawe},~\\bfnm{T.~R.}\\binits{T.~R.}} \\AND\n\\bauthor{\\bsnm{Crick},~\\bfnm{T.}\\binits{T.}}\n(\\byear{2013}).\n\\btitle{An investigation into the changes of lymphatic vessel density\ndue to invasive carcinoma and cervical intraepithelial lesions of the\nuterine cervix}.\n\\bjournal{Morecambe Bay Medical Journal}\n\\bvolume{6}\n\\bpages{355--359}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Cong, Yin and Shen}{2007}]{cong}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Cong},~\\bfnm{Xiuyu~J.}\\binits{X.~J.}},\n\\bauthor{\\bsnm{Yin},~\\bfnm{Guosheng}\\binits{G.}} \\AND\n\\bauthor{\\bsnm{Shen},~\\bfnm{Yu}\\binits{Y.}}\n(\\byear{2007}).\n\\btitle{Marginal analysis of correlated failure time data with\ninformative cluster sizes}.\n\\bjournal{Biometrics}\n\\bvolume{63}\n\\bpages{663--672}.\n\\bid{doi={10.1111/j.1541-0420.2006.00730.x}, issn={0006-341X}, mr={2395702}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Day and Graham}{1989}]{day}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Day},~\\bfnm{S.~J.}\\binits{S.~J.}} \\AND\n\\bauthor{\\bsnm{Graham},~\\bfnm{D.~F.}\\binits{D.~F.}}\n(\\byear{1989}).\n\\btitle{Sample size and power for comparing two or more treatment\ngroups in clinical trials}.\n\\bjournal{BMJ}\n\\bvolume{299}\n\\bpages{663--665}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Dean}{1992}]{dean}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Dean},~\\bfnm{C.~B.}\\binits{C.~B.}}\n(\\byear{1992}).\n\\btitle{Testing for overdispersion in {P}oisson and {N}egative\n{B}inomial regression models}.\n\\bjournal{J. Amer. Statist. Assoc.}\n\\bvolume{87}\n\\bpages{451--457}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Dunson, Chen and Harry}{2003}]{dunson}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Dunson},~\\bfnm{David~B.}\\binits{D.~B.}},\n\\bauthor{\\bsnm{Chen},~\\bfnm{Zhen}\\binits{Z.}} \\AND\n\\bauthor{\\bsnm{Harry},~\\bfnm{Jean}\\binits{J.}}\n(\\byear{2003}).\n\\btitle{A {B}ayesian approach for joint modeling of cluster size and\nsubunit-specific outcomes}.\n\\bjournal{Biometrics}\n\\bvolume{59}\n\\bpages{521--530}.\n\\bid{doi={10.1111/1541-0420.00062}, issn={0006-341X}, mr={2004257}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Ferlay et~al.}{2008}]{ferlay}\n\n\\begin{bmisc}[author]\n\\bauthor{\\bsnm{Ferlay},~\\bfnm{J.}\\binits{J.}},\n\\bauthor{\\bsnm{Shin},~\\bfnm{H.~R.}\\binits{H.~R.}},\n\\bauthor{\\bsnm{Bray},~\\bfnm{F.}\\binits{F.}},\n\\bauthor{\\bsnm{Forman},~\\bfnm{D.}\\binits{D.}},\n\\bauthor{\\bsnm{Mathers},~\\bfnm{C.}\\binits{C.}} \\AND\n\\bauthor{\\bsnm{Parkin},~\\bfnm{D.~M.}\\binits{D.~M.}}\n(\\byear{2008}).\n\\bhowpublished{{GLOBOCAN} 2008 v2.0, {C}ancer incidence and mortality\nworldwide: IARC {C}ancer{B}ase no. 10 [{I}nternet] (accessed 4th\n{M}arch 2013)}.\n\\end{bmisc}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Fitzmaurice and Laird}{1995}]{fitzmaurice}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Fitzmaurice},~\\bfnm{Garrett~M.}\\binits{G.~M.}} \\AND\n\\bauthor{\\bsnm{Laird},~\\bfnm{Nan~M.}\\binits{N.~M.}}\n(\\byear{1995}).\n\\btitle{Regression models for a bivariate discrete and continuous\noutcome with clustering}.\n\\bjournal{J. Amer. Statist. Assoc.}\n\\bvolume{90}\n\\bpages{845--852}.\n\\bid{issn={0162-1459}, mr={1354003}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Friedl and Wolf}{2003}]{friedl}\n\n\\begin{barticle}[pbm]\n\\bauthor{\\bsnm{Friedl},~\\bfnm{Peter}\\binits{P.}} \\AND\n\\bauthor{\\bsnm{Wolf},~\\bfnm{Katarina}\\binits{K.}}\n(\\byear{2003}).\n\\btitle{Tumour-cell invasion and migration: Diversity and escape mechanisms}.\n\\bjournal{Nat. Rev. Cancer}\n\\bvolume{3}\n\\bpages{362--374}.\n\\bid{doi={10.1038/nrc1075}, issn={1474-175X}, pii={nrc1075}, pmid={12724734}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Gao et~al.}{2006}]{gao}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Gao},~\\bfnm{P.}\\binits{P.}},\n\\bauthor{\\bsnm{Zhou},~\\bfnm{G.~Y.}\\binits{G.~Y.}},\n\\bauthor{\\bsnm{Yin},~\\bfnm{G.}\\binits{G.}},\n\\bauthor{\\bsnm{Liu},~\\bfnm{Y.}\\binits{Y.}},\n\\bauthor{\\bsnm{Liu},~\\bfnm{Z.~Y.}\\binits{Z.~Y.}},\n\\bauthor{\\bsnm{Zhang},~\\bfnm{J.}\\binits{J.}} \\AND\n\\bauthor{\\bsnm{Hao},~\\bfnm{C.~Y.}\\binits{C.~Y.}}\n(\\byear{2006}).\n\\btitle{Lymphatic vessel density as a prognostic indicator for\npatients with stage I cervical carcinoma}.\n\\bjournal{Human Pathology}\n\\bvolume{37}\n\\bpages{719--725}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Goldstein et~al.}{2000}]{goldstein}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Goldstein},~\\bfnm{Harvey}\\binits{H.}},\n\\bauthor{\\bsnm{Yang},~\\bfnm{Min}\\binits{M.}},\n\\bauthor{\\bsnm{Omar},~\\bfnm{Rumana}\\binits{R.}},\n\\bauthor{\\bsnm{Turner},~\\bfnm{Rebecca}\\binits{R.}} \\AND\n\\bauthor{\\bsnm{Thompson},~\\bfnm{Simon}\\binits{S.}}\n(\\byear{2000}).\n\\btitle{Meta-analysis using multilevel models with an application to\nthe study of class size effects}.\n\\bjournal{J. R. Stat. Soc. Ser. C. Appl. Stat.}\n\\bvolume{49}\n\\bpages{399--412}.\n\\bid{doi={10.1111/1467-9876.00200}, issn={0035-9254}, mr={1824548}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Gombos et~al.}{2005}]{gombos}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Gombos},~\\bfnm{Z.}\\binits{Z.}},\n\\bauthor{\\bsnm{Xu},~\\bfnm{X.}\\binits{X.}},\n\\bauthor{\\bsnm{Chu},~\\bfnm{C.~S.}\\binits{C.~S.}},\n\\bauthor{\\bsnm{Zhang},~\\bfnm{P.~J.}\\binits{P.~J.}} \\AND\n\\bauthor{\\bsnm{Acs},~\\bfnm{G.}\\binits{G.}}\n(\\byear{2005}).\n\\btitle{Peritumoral lymphatic vessel density and vascular endothelial\ngrowth factor C expression in early-stage squamous cell carcinoma of\nthe uterine cervix}.\n\\bjournal{Clinical Cancer Research}\n\\bvolume{11}\n\\bpages{8364--8371}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Gueorguieva}{2005}]{gueorguieva}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Gueorguieva},~\\bfnm{Ralitza~V.}\\binits{R.~V.}}\n(\\byear{2005}).\n\\btitle{Comments about joint modeling of cluster size and binary and\ncontinuous subunit-specific outcomes}.\n\\bjournal{Biometrics}\n\\bvolume{61}\n\\bpages{862--867}.\n\\bid{doi={10.1111/j.1541-020X.2005.00409_1.x}, issn={0006-341X}, mr={2196176}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Gueorguieva and Agresti}{2001}]{ga2001}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Gueorguieva},~\\bfnm{Ralitza~V.}\\binits{R.~V.}} \\AND\n\\bauthor{\\bsnm{Agresti},~\\bfnm{Alan}\\binits{A.}}\n(\\byear{2001}).\n\\btitle{A correlated probit model for joint modeling of clustered\nbinary and continuous reponses}.\n\\bjournal{J. Amer. Statist. Assoc.}\n\\bvolume{96}\n\\bpages{1102--1112}.\n\\bid{doi={10.1198/016214501753208762}, issn={0162-1459}, mr={1947258}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Hibbs et~al.}{2010}]{hibbs}\n\n\\begin{barticle}[pbm]\n\\bauthor{\\bsnm{Hibbs},~\\bfnm{Anna~Maria}\\binits{A.~M.}},\n\\bauthor{\\bsnm{Black},~\\bfnm{Dennis}\\binits{D.}},\n\\bauthor{\\bsnm{Palermo},~\\bfnm{Lisa}\\binits{L.}},\n\\bauthor{\\bsnm{Cnaan},~\\bfnm{Avital}\\binits{A.}},\n\\bauthor{\\bsnm{Luan},~\\bfnm{Xianqun}\\binits{X.}},\n\\bauthor{\\bsnm{Truog},~\\bfnm{William~E.}\\binits{W.~E.}},\n\\bauthor{\\bsnm{Walsh},~\\bfnm{Michele~C.}\\binits{M.~C.}} \\AND\n\\bauthor{\\bsnm{Ballard},~\\bfnm{Roberta~A.}\\binits{R.~A.}}\n(\\byear{2010}).\n\\btitle{Accounting for multiple births in neonatal and perinatal\ntrials: Systematic review and case study}.\n\\bjournal{J. Pediatr.}\n\\bvolume{156}\n\\bpages{202--208}.\n\\bid{doi={10.1016/j.jpeds.2009.08.049}, issn={1097-6833},\nmid={NIHMS181732}, pii={S0022-3476(09)00870-1}, pmcid={2844328},\npmid={19969305}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Ibrahim, Chu and Chen}{2010}]{ibrahim}\n\n\\begin{barticle}[pbm]\n\\bauthor{\\bsnm{Ibrahim},~\\bfnm{Joseph~G.}\\binits{J.~G.}},\n\\bauthor{\\bsnm{Chu},~\\bfnm{Haitao}\\binits{H.}} \\AND\n\\bauthor{\\bsnm{Chen},~\\bfnm{Liddy~M.}\\binits{L.~M.}}\n(\\byear{2010}).\n\\btitle{Basic concepts and methods for joint models of longitudinal\nand survival data}.\n\\bjournal{J. Clin. Oncol.}\n\\bvolume{28}\n\\bpages{2796--2801}.\n\\bid{doi={10.1200/JCO.2009.25.0654}, issn={1527-7755},\npii={JCO.2009.25.0654}, pmcid={4503792}, pmid={20439643}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Lindsey}{1999}]{lindsey}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Lindsey},~\\bfnm{J.~K.}\\binits{J.~K.}}\n(\\byear{1999}).\n\\btitle{On the use of corrections for overdispersion}.\n\\bjournal{Applied Statistics}\n\\bvolume{48}\n\\bpages{553--561}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Longatto-Filho et~al.}{2007}]{longatto}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Longatto-Filho},~\\bfnm{A.}\\binits{A.}},\n\\bauthor{\\bsnm{Pinheiro},~\\bfnm{C.}\\binits{C.}},\n\\bauthor{\\bsnm{Pereira},~\\bfnm{S.~M.~M.}\\binits{S.~M.~M.}},\n\\bauthor{\\bsnm{Etlinger},~\\bfnm{D.}\\binits{D.}},\n\\bauthor{\\bsnm{Moreira},~\\bfnm{M.~A.~R.}\\binits{M.~A.~R.}},\n\\bauthor{\\bsnm{Jub{\\'{e}}},~\\bfnm{L.~F.}\\binits{L.~F.}},\n\\bauthor{\\bsnm{Quieroz},~\\bfnm{G.~S.}\\binits{G.~S.}},\n\\bauthor{\\bsnm{Baltazar},~\\bfnm{F.}\\binits{F.}} \\AND\n\\bauthor{\\bsnm{Schmitt},~\\bfnm{F.~C.}\\binits{F.~C.}}\n(\\byear{2007}).\n\\btitle{Lymphatic vessel density and epithelial D2-40 immunoreactivity\nin pre-invasive and invasive lesions of the uterine cervix}.\n\\bjournal{Gynecologic Oncology}\n\\bvolume{107}\n\\bpages{45--51}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Lunn et~al.}{2000}]{lunn}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Lunn},~\\bfnm{D.~J.}\\binits{D.~J.}},\n\\bauthor{\\bsnm{Thomas},~\\bfnm{A.}\\binits{A.}},\n\\bauthor{\\bsnm{Best},~\\bfnm{N.}\\binits{N.}} \\AND\n\\bauthor{\\bsnm{Spiegelhalter},~\\bfnm{D.}\\binits{D.}}\n(\\byear{2000}).\n\\btitle{Win{BUGS}---A {B}ayesian modelling framework: Concepts,\nstructure, and extensibility}.\n\\bjournal{Stat. Comput.}\n\\bvolume{10}\n\\bpages{325--337}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Ma, J{\\o}rgensen and Willms}{2009}]{ma}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Ma},~\\bfnm{Renjun}\\binits{R.}},\n\\bauthor{\\bsnm{J{\\o}rgensen},~\\bfnm{Bent}\\binits{B.}} \\AND\n\\bauthor{\\bsnm{Willms},~\\bfnm{Jon~Douglas}\\binits{J.~D.}}\n(\\byear{2009}).\n\\btitle{Clustered binary data with random cluster sizes: A dual\n{P}oisson modelling approach}.\n\\bjournal{Stat. Model.}\n\\bvolume{9}\n\\bpages{137--150}.\n\\bid{doi={10.1177/1471082X0800900203}, issn={1471-082X}, mr={2750122}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Neuhaus and McCulloch}{2011}]{neuhaus}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Neuhaus},~\\bfnm{John~M.}\\binits{J.~M.}} \\AND\n\\bauthor{\\bsnm{McCulloch},~\\bfnm{Charles~E.}\\binits{C.~E.}}\n(\\byear{2011}).\n\\btitle{Estimation of covariate effects in generalized linear mixed\nmodels with informative cluster sizes}.\n\\bjournal{Biometrika}\n\\bvolume{98}\n\\bpages{147--162}.\n\\bid{doi={10.1093/biomet/asq066}, issn={0006-3444}, mr={2804216}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Panageas et~al.}{2007}]{panageas}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Panageas},~\\bfnm{Katherine~S.}\\binits{K.~S.}},\n\\bauthor{\\bsnm{Schrag},~\\bfnm{Deborah}\\binits{D.}},\n\\bauthor{\\bsnm{Localio},~\\bfnm{A.~Russell}\\binits{A.~R.}},\n\\bauthor{\\bsnm{Venkatraman},~\\bfnm{E.~S.}\\binits{E.~S.}} \\AND\n\\bauthor{\\bsnm{Begg},~\\bfnm{Colin~B.}\\binits{C.~B.}}\n(\\byear{2007}).\n\\btitle{Properties of analysis methods that account for clustering in\nvolume-outcome studies when the primary predictor is cluster size}.\n\\bjournal{Stat. Med.}\n\\bvolume{26}\n\\bpages{2017--2035}.\n\\bid{doi={10.1002/sim.2657}, issn={0277-6715}, mr={2364289}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Pinheiro and Bates}{2000}]{pinheiro}\n\n\\begin{bbook}[author]\n\\bauthor{\\bsnm{Pinheiro},~\\bfnm{J.~C.}\\binits{J.~C.}} \\AND\n\\bauthor{\\bsnm{Bates},~\\bfnm{D.~M.}\\binits{D.~M.}}\n(\\byear{2000}).\n\\btitle{Mixed-Effects Models in S and {S-PLUS}}.\n\\bpublisher{Springer},\n\\blocation{New York}.\n\\end{bbook}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Pinheiro et~al.}{2008}]{nlmecite}\n\n\\begin{bmisc}[author]\n\\bauthor{\\bsnm{Pinheiro},~\\bfnm{Jose}\\binits{J.}},\n\\bauthor{\\bsnm{Bates},~\\bfnm{Douglas}\\binits{D.}},\n\\bauthor{\\bsnm{DebRoy},~\\bfnm{Saikat}\\binits{S.}},\n\\bauthor{\\bsnm{Sarkar},~\\bfnm{Deepayan}\\binits{D.}} \\AND\n\\borganization{the R~Core~team}\n(\\byear{2008}).\n\\bhowpublished{nlme: Linear and nonlinear mixed effects models.\nR package version 3.1-89.}\n\\end{bmisc}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{R Development Core Team}{2008}]{Rcite}\n\n\\begin{bmisc}[author]\n\\borganization{R Development Core Team}\n(\\byear{2008}).\n\\bhowpublished{R: A Language and Environment for Statistical Computing.\nR Foundation for Statistical Computing,\nVienna, Austria. ISBN 3-900051-07-0}.\n\\end{bmisc}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Regan and Catalano}{1999}]{regan}\n\n\\begin{barticle}[pbm]\n\\bauthor{\\bsnm{Regan},~\\bfnm{M.~M.}\\binits{M.~M.}} \\AND\n\\bauthor{\\bsnm{Catalano},~\\bfnm{P.~J.}\\binits{P.~J.}}\n(\\byear{1999}).\n\\btitle{Likelihood models for clustered binary and continuous\noutcomes: Application to developmental toxicology}.\n\\bjournal{Biometrics}\n\\bvolume{55}\n\\bpages{760--768}.\n\\bid{issn={0006-341X}, pmid={11315004}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Ten~Have and Chinchilli}{1998}]{tenhave}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Ten Have},~\\bfnm{Thomas~R.}\\binits{T.~R.}} \\AND\n\\bauthor{\\bsnm{Chinchilli},~\\bfnm{Vernon~M.}\\binits{V.~M.}}\n(\\byear{1998}).\n\\btitle{Two-stage negative binomial and overdispersed {P}oisson models\nfor clustered developmental toxicity data with random cluster size}.\n\\bjournal{J. Agric. Biol. Environ. Stat.}\n\\bvolume{3}\n\\bpages{75--98}.\n\\bid{doi={10.2307/1400624}, issn={1085-7117}, mr={1817034}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Venables and Ripley}{2002}]{MASScite}\n\n\\begin{bbook}[author]\n\\bauthor{\\bsnm{Venables},~\\bfnm{W.~N.}\\binits{W.~N.}} \\AND\n\\bauthor{\\bsnm{Ripley},~\\bfnm{B.~D.}\\binits{B.~D.}}\n(\\byear{2002}).\n\\btitle{Modern Applied Statistics with S},\n\\bedition{4th} ed.\n\\bpublisher{Springer},\n\\blocation{New York}.\n\n\\end{bbook}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Wicksell}{1925}]{wicksell}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Wicksell},~\\bfnm{S.~D.}\\binits{S.~D.}}\n(\\byear{1925}).\n\\btitle{The corpuscle problem: A mathematical study of a biometric problem}.\n\\bjournal{Biometrika}\n\\bvolume{17}\n\\bpages{84--99}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Williamson, Datta and\nSatten}{2003}]{williamson}\n\n\\begin{barticle}[mr]\n\\bauthor{\\bsnm{Williamson},~\\bfnm{John~M.}\\binits{J.~M.}},\n\\bauthor{\\bsnm{Datta},~\\bfnm{Somnath}\\binits{S.}} \\AND\n\\bauthor{\\bsnm{Satten},~\\bfnm{Glen~A.}\\binits{G.~A.}}\n(\\byear{2003}).\n\\btitle{Marginal analyses of clustered data when cluster size is informative}.\n\\bjournal{Biometrics}\n\\bvolume{59}\n\\bpages{36--42}.\n\\bid{doi={10.1111/1541-0420.00005}, issn={0006-341X}, mr={1978471}}\n\\end{barticle}\n\n\n\\bptok{imsref}\n\n\n\n\n\\endbibitem\n\n\n\n\\bibitem[\\protect\\citeauthoryear{Zhang, Yu and Zhang}{2009}]{zhangyuzhang}\n\n\\begin{barticle}[author]\n\\bauthor{\\bsnm{Zhang},~\\bfnm{S.}\\binits{S.}},\n\\bauthor{\\bsnm{Yu},~\\bfnm{H.}\\binits{H.}} \\AND\n\\bauthor{\\bsnm{Zhang},~\\bfnm{L.}\\binits{L.}}\n(\\byear{2009}).\n\\btitle{Clinical implications of increased lymph vessel density in the\nlymphatic metastasis of early stage invasive cervical carcinoma: A\nclinical immunohistochemical method study}.\n\\bjournal{BMC Cancer}\n\\bvolume{9}\n\\bpages{1--6}.\n\\end{barticle}\n\n\n\\bptok{imsref}\n\\endbibitem\n\\end{thebibliography}\n\n\n\n\n\n\n\\printaddresses\n\n", "itemtype": "equation", "pos": 31468, "prevtext": "\n\nThis formulation closely follows the general three-outcome model for\none continuous, one binary and one count variable discussed by \\citet\n{catalanoryan1992} and \\citet{ga2001}, and developed further by \\citet\n{gueorguieva}. The shared random effect structure considered by these\nauthors is very similar to~(\\ref{common}), although in place of the\nPoisson model for $N_{ij}$ they instead use a continuation ratio probit\nmodel, which in our notation would take the form\n\n", "index": 11, "text": "\n\\[\n\\mathrm{P}(N_{ij}=n|x_{ij},a_i) = \\Phi\\bigl(\n\\delta_n - \\beta^N_{x_{ij}} - \\lambda^N\na^N_i\\bigr) \\prod_{h=1}^{n-1}\n\\bigl\\{1 - \\Phi\\bigl(\\delta_h - \\beta ^N_{x_{ij}}\n- \\lambda^N a^N_i\\bigr)\\bigr\\},\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\mathrm{P}(N_{ij}=n|x_{ij},a_{i})=\\Phi\\bigl{(}\\delta_{n}-\\beta^{N}_{x_{ij}}-%&#10;\\lambda^{N}a^{N}_{i}\\bigr{)}\\prod_{h=1}^{n-1}\\bigl{\\{}1-\\Phi\\bigl{(}\\delta_{h}%&#10;-\\beta^{N}_{x_{ij}}-\\lambda^{N}a^{N}_{i}\\bigr{)}\\bigr{\\}},\" display=\"block\"><mrow><mi mathvariant=\"normal\">P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>N</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mi>n</mi><mo stretchy=\"false\">|</mo><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>,</mo><msub><mi>a</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi mathvariant=\"normal\">Φ</mi><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><msub><mi>δ</mi><mi>n</mi></msub><mo>-</mo><msubsup><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mi>N</mi></msubsup><mo>-</mo><msup><mi>λ</mi><mi>N</mi></msup><msubsup><mi>a</mi><mi>i</mi><mi>N</mi></msubsup><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>h</mi><mo>=</mo><mn>1</mn></mrow><mrow><mi>n</mi><mo>-</mo><mn>1</mn></mrow></munderover><mrow><mo maxsize=\"120%\" minsize=\"120%\">{</mo><mn>1</mn><mo>-</mo><mi mathvariant=\"normal\">Φ</mi><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><msub><mi>δ</mi><mi>h</mi></msub><mo>-</mo><msubsup><mi>β</mi><msub><mi>x</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mi>N</mi></msubsup><mo>-</mo><msup><mi>λ</mi><mi>N</mi></msup><msubsup><mi>a</mi><mi>i</mi><mi>N</mi></msubsup><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow><mo maxsize=\"120%\" minsize=\"120%\">}</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}]