[{"file": "1601.00446.tex", "nexttext": "\n\n\\begin{eqnarray}\n\\mathcal{F}[\\alpha](\\bm{k}) =  p_1(R_1 + i R_2) {\\rm exp} \\Bigl[ - \\{ (k \\xi -0.4)/0.2 \\}^2 \\Bigl], \n\\label{ini2}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\mathcal{F}[\\beta](\\bm{k}) =  p_2(R_3 + i R_4) {\\rm exp}\\Bigl[ - \\{ (k \\xi -0.4)/0.2 \\}^2 \\Bigl], \n\\label{ini3}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\phi (\\bm{r}) = \\alpha (\\bm{r}), \n\\label{ini4}\n\\end{eqnarray}\nwhere $R_i$ $(i=1$--4) are the random numbers in the range $[0.5,-0.5)$. The functions $\\alpha$ and $\\beta$ denote the azimuth and elevation angles, respectively, for the spin density vector, and $\\phi$ is the phase of the wave function. Because of spin-gauge symmetry in the ferromagnetic state, $\\phi$ also contains the angle related to the rotation around the spin-density-vector axis. The parameters $p_1$ and  $p_2$ are set to be $\\langle f_z \\rangle _{\\rm V} \\sim0.95$, ${\\rm max} \\hspace{1mm} [\\alpha] \\sim180$, and ${\\rm min}  \\hspace{1mm}  [\\alpha] \\sim -180$. \n\nLet us comment on Eq. (\\ref{ini4}). In the ferromagnetic state, the superfluid velocity is expressed by \n\\begin{eqnarray}\n\\bm{v} = \\frac{\\hbar}{M} \\Bigl[ \\bm{\\nabla}\\phi - {\\rm cos}\\beta \\bm{\\nabla} \\alpha  \\Bigl], \n\\label{vel_ferro}\n\\end{eqnarray}\nfrom which we can find that the gradients of $\\alpha$ and $\\phi$ induce the velocity field. \nThus, if the relation of Eq. (\\ref{ini4}) is not satisfied, the system has the large velocity field, which can cause  strong spin-density and spin-velocity interactions. This can disturb the assumption used to derive the power laws of Eq. (\\ref{spin_pow2}). Hence, to reduce these interactions, we choose Eq. (\\ref{ini4}). \n\n\\subsubsection{Numerical results}\n\n\\begin{figure} [t]\n\\begin{center}\n\\includegraphics[width=85mm]{fig1.eps}\n\\caption{(Color online)  Time development of the spin density vector $\\bm{F}$ in SWT for the inverse cascade.  We plot the spatial distribution of $F_x$ at $t/\\tau=$ (a) 0, (b) 9000, and (c) 19000. (d) is the spatial profile of $\\bm{F}$ corresponding to (c). The size of the figures is $ 256\\xi \\times 256\\xi$. These figures show that the larger structure appears as time passes, which reflects the inverse cascade. }\n\\label{fig1}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [t]\n\\begin{center}\n\\includegraphics[width=85mm]{fig2.eps}\n\\caption{(Color online)  Time development of the transverse spin correlation function in SWT for the inverse cascade. The black dashed line in the range [0.08,0.6] exhibits a $k^{-5/3}$ power law. The spectra are averaged over five calculations with different initial noise components. }\n\\label{fig2}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [b]\n\\begin{center}\n\\includegraphics[width=85mm]{fig3.eps}\n\\caption{(Color online) Time development of (a) the spatial average of the spin amplitude, $\\langle |\\bm{f}| \\rangle _{\\rm V}$, and (b) the spatial average of the canonical variable, $\\langle |a|^2 \\rangle _{\\rm V}$, which satisfy approximations (i) and (ii).}\n\\label{fig3}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [t]\n\\begin{center}\n\\includegraphics[width=85mm]{fig4.eps}\n\\caption{(Color online) Wave-number dependence of $A^{\\rm a} _{\\mu}$ (a = s,\\;ss,\\;sd, and sv; $\\mu=x,z$) at $t/\\tau=19000$. From the rotational symmetry about the $z$ axis, the behavior of $A_{y}^{a}$ is the same as that of $A_{x}^{a}$. These graphs show that the spin-density and spin-velocity interaction terms are slightly smaller than the spin-spin interaction. }\n\\label{fig4}\n\\end{center}\n\\end{figure}\n\nFigure \\ref{fig1} shows the time development of the spin density vector $\\bm{F}$. Figure \\ref{fig1}(a) is for the $x$ component of the spin density vector at the initial state and shows that $F_x$ has the spatially finer structure corresponding to the energy injection with the high-wave-number region. As  time passes, large-scale structure [Figs. \\ref{fig1}(b) and (c)] appears, which reflects the inverse cascade. In Fig. \\ref{fig1}(d), we plot the spin density vector corresponding to Fig. \\ref{fig1}(c), from which the spin density vector is found to be point in the $z$ direction and fluctuate around it. \n\nWe numerically calculate the transverse spin correlation function, showing their time development in Fig. \\ref{fig2}. \nAt the initial state, the correlation function has a large value in the wave number region near $k\\xi=0.4$, whose wavelength is comparable to the characteristic size of $F_{x}$ in Fig. \\ref{fig1}(a). In the early stage of the dynamics, the inverse cascade leads to the growth of $C_{xy}^{\\rm (s)}$ in the wave number region lower than $k\\xi=0.4$, and the $-5/3$ power law appears only in the region near $k\\xi=0.4$. As time passes sufficiently, the scaling region with the $-5/3$ power law becomes wide and finally reaches $0.08 \\alt k\\xi \\alt 0.6$. This dynamics is consistent with the inverse cascade predicted by WWT. \n\nTo investigate our SWT in detail, we check whether or not our approximations used to derive Eq. (\\ref{spin_pow2}) are satisfied. The important approximations are (i) the assumption of a ferromagnetic state, (ii) the smallness of canonical variables, and (iii) the weakness of the spin-density interaction $I^{\\rm sd} _\\mu$ and spin-velocity interaction $I^{\\rm sv} _\\mu$. \n\nTo confirm (i), the amplitude $|\\bm{f}|$ of the spin density vector is calculated; it should be unity in the fully ferromagnetic state. Figure \\ref{fig3}(a) shows the time development of its spatial average and indicates that the system almost becomes a ferromagnetic state.  For (ii), we calculate the amplitude $|a|^2$ of the canonical variables defined by Eqs. (\\ref{HP1})--(\\ref{HP3}), confirming that its spatially averaged value is much smaller than unity, as shown in Fig. \\ref{fig3}(b). \nTo check (iii), we define the following quantities: \n\\begin{eqnarray}\nA_{\\mu}^{\\rm a}(k) =  \\sum_{k-\\triangle k/2<|\\bm{k}_1|<k+\\triangle k/2} |\\mathcal{F}[I^{\\rm (a)}_{\\mu}] (\\bm{k}_1)|,   \n\\label{weak1}\n\\end{eqnarray}\nwith ${\\rm a = s,\\; ss,\\; sd,\\; and\\;  sv}$ and $\\mu =x,y,z$. \nFigure \\ref{fig4} shows the numerical results for $A_{\\mu}^{\\rm a}(k)$ at $t/\\tau=19000$ when the $-5/3$ power law widely appears. \nThese figures show that the spin-density interaction $I^{\\rm sd} _\\mu$ and spin-velocity interaction $I^{\\rm sv} _\\mu$ are slightly weaker than the spin-spin interaction $I^{\\rm ss} _\\mu$ in the scaling region $0.08 \\alt k\\xi \\alt 0.6$. In summary, our calculation basically satisfies approximations (i), (ii), and (iii). However, for (iii), the spin-density and spin-velocity interactions are not much weak.  At present, we do not sufficiently understand why the influence of density and velocity does not disturb the $-5/3$ power law.\n\nIn comparison with $A_{\\mu}^{\\rm s}(k)$, $A_{\\mu}^{\\rm ss}(k)$ is found to be weak in the region higher than $k\\xi \\sim 0.1$, which corresponds to the smallness of the canonical variable $a$. However, in the low-wave-number region $k\\xi \\alt 0.1$, the strength of the spin-spin interaction term is larger than that of the spin-linear term, so WWT becomes invalid. Actually, in this region, the $-5/3$ power law seems to be disturbed, as shown in Fig. \\ref{fig2}. Thus, we conclude that the scaling region with the $-5/3$ power law is $0.1 \\alt k\\xi \\alt 0.6$. \n\nFinally, we describe the dynamics at $t/\\tau > 19000$. The transferred mode accumulates in the low-wave-number region because any dissipation mechanism is not included in our numerical calculation. This can disturb the $-5/3$ power law. Actually, in the low-wave-number region, the correlation function tends to deviate from the $-5/3$ power law when  time sufficiently passes. \n\n\\subsubsection{Dependence on initial condition}\nWe describe how the $-5/3$ power law depends on the initial state. In our calculation, as far as we use the initial state with  energy injection in the wave number region $0.2 \\alt k\\xi \\alt 0.8$, the $-5/3$ power law appears. If we inject the energy into the initial state in the wave number region higher than $0.9/\\xi$, the numerical precision is poor, so we cannot investigate the $-5/3$ power law in this case. \n\n\\subsection{SWT for the direct cascade}\n\n\\subsubsection{Numerical condition and method}\nThe numerical setting for the direct cascade is the same as that of the inverse cascade except for the system size, numerical resolution, and initial state. \nThe system size is $64\\xi \\times 64\\xi$ and the resolution is given by $dx/\\xi=0.25$ and $dt/\\tau=4\\times10^{-3}$. For the initial state, in contrast to the inverse cascade, it is necessary for the energy to be injected into the initial state in the low-wave-number region. Then we use Eq. (\\ref{ini1}) and the following angles as the initial state:\n\\begin{eqnarray}\n\\mathcal{F}[\\alpha](\\bm{k}) =  p_1(R_1 + i R_2) {\\rm exp} \\Bigl[ -(k \\xi/0.2)^2  \\Big], \n\\label{ini5}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\mathcal{F}[\\beta](\\bm{k}) =  p_2(R_3 + i R_4)  {\\rm exp}\\Bigl[ -(k \\xi/0.2)^2 \\Bigl], \n\\label{ini6}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\phi (\\bm{r}) = \\alpha (\\bm{r}), \n\\label{ini7}\n\\end{eqnarray}\nThe parameters $p_1$ and  $p_2$ are set to be $\\langle f_z \\rangle _{\\rm V} \\sim0.95$, ${\\rm max} \\hspace{1mm} [\\alpha] \\sim180$, and ${\\rm min}  \\hspace{1mm}  [\\alpha] \\sim -180$. \n\n\\begin{figure} [t]\n\\begin{center}\n\\includegraphics[width=85mm]{fig5.eps}\n\\caption{(Color online) Time development of the spin density vector $\\bm{F}$ in SWT for the direct cascade.  We plot the spatial distribution of $F_x$ at $t/\\tau=$ (a) 0, (b) 13000, and (c) 50000. (d) is the spatial profile of $\\bm{F}$ corresponding to (c). The size of the figures is $64\\xi \\times 64 \\xi$. These figures show that the finer structure appears as time passes, which reflects the direct cascade. }\n\\label{fig5}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [b]\n\\begin{center}\n\\includegraphics[width=85mm]{fig6.eps}\n\\caption{(Color online)  Time development of the transverse spin correlation function in SWT for the direct cascade. The black dashed line in the range [0.1,3.0] exhibits a $k^{-7/3}$ power law.  The spectra are averaged over five calculations with different initial noise components. }\n\\label{fig6}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [t]\n\\begin{center}\n\\includegraphics[width=85mm]{fig7.eps}\n\\caption{(Color online) Time development of (a) the spatial average of the spin amplitude, $\\langle |\\bm{f}| \\rangle _{\\rm V}$, and (b) the spatial average of the canonical variable, $\\langle |a|^2 \\rangle _{\\rm V}$. These graphs show that the system is almost in a fully ferromagnetic state with a small spin wave amplitude, which satisfies  approximations (i) and (ii).} \n\\label{fig7}\n\\end{center}\n\\end{figure}\n\n\\begin{figure} [b]\n\\begin{center}\n\\includegraphics[width=85mm]{fig8.eps}\n\\caption{(Color online) Wave-number dependence of $A^{\\rm a} _{\\mu}$ (a = s, ss, sd, and sv; $\\mu=x,z$) at $t/\\tau=50000$. From the rotational symmetry about the $z$ axis, the behavior of $A_{y}^{a}$ is the same as that of $A_{x}^{a}$. These graphs show that the spin-density and spin-velocity interaction terms are weaker than the spin-spin interaction. }\n\\label{fig8}\n\\end{center}\n\\end{figure}\n\n\\subsubsection{Numerical results}\nFigure \\ref{fig5} shows the time development of the spin density vector $\\bm{F}$. As shown in Fig. \\ref{fig5}(a), the profile of $F_x$ at the initial state has a spatially large structure, which reflects the energy injection into the low-wave number region. As  time passes, finer structure appears in Figs. \\ref{fig5}(b) and \\ref{fig5}(c), which is caused by the nonlinear terms because these terms generate the interaction between different modes in the wave-number space. In Fig. \\ref{fig5}(d), we plot the spin density vector corresponding to Fig. \\ref{fig5}(c). \n\nSimilar to the case for the inverse cascade, we numerically calculate the transverse spin correlation function. Figure \\ref{fig6} shows the time development of this correlation function. At the initial state, the correlation function has a large value only in the low-wave-number region, which corresponds to  energy injection into the low-wave-number region. In the early stage of the dynamics, the spin wave in the low-wave-number region is transferred to the high-wave-number region, increasing the high-wave-number component of $C_{xy}^{\\rm (s)}$, which reflects the direct cascade of the spin wave energy. As time passes, the $-7/3$ power law appears in the region $1.0 \\alt k\\xi \\alt 3.0$. Although the scaling region is not wide, this dynamics is consistent with the direct cascade predicted by WWT. \n\nWe note the deviation from the $-7/3$ power law in the low-wave-number region  $k\\xi \\alt 1.0$ in Fig. \\ref{fig6}. We suspect that this may be caused by the inverse cascade. As described in the Appendix, when the spin wave energy is transferred into the high-wave-number region, the spin wave action is simultaneously transferred into the low-wave-number region. However, in the initial state, the wave action is sufficiently accumulated in the low-wave-number region, so that the inverse cascade may be suppressed. Thus, this obstruction of the inverse cascade may lead to the deviation from the $-7/3$ power law in the low-wave-number region.  \n\nIn the same way as for the inverse cascade, we also confirm the validity of the three approximations to use for the derivation of (\\ref{spin_pow2}): (i) the assumption of  a ferromagnetic state, (ii) the smallness of canonical variables, and (iii) the weakness of the spin-density interaction $I^{\\rm sd} _\\mu$ and spin-velocity interaction $I^{\\rm sv} _\\mu$. Figures \\ref{fig7}(a) and \\ref{fig7}(b) obviously show the validity of (i) and (ii). For (iii), from Fig. \\ref{fig8}, we find that the spin-density interaction and spin-velocity interaction are weaker than the spin-spin interaction, so  approximation (iii) is satisfied. Also, the spin-linear term is larger than the spin-spin interaction, which means that WWT is realized. \n\nFinally, we describe the dynamics at $t/\\tau > 50000$. In our numerical calculation, we do not add any dissipation terms to Eq. (\\ref{GP}), so that the transferred energy accumulates in the high-wave-number region, which disturbs the $-7/3$ power law. Actually, we numerically confirm that, in the high-wave-number region, the correlation function tends to deviate from the $-7/3$ power law when  time sufficiently passes. \n\n\\subsubsection{Dependence on initial condition}\nWe discuss how the $-7/3$ power law depends on the initial state. When we use the larger system size and prepare the initial state with  energy injection into the low-wave-number region, the direct cascade does not appear clearly. We expect that, in this case, because the wave number of the excited spin wave is too low, it takes much time to transfer the mode from the low-wave-number region to the high one. Thus, to see the $-7/3$ power law for the direct cascade in numerical calculations, it seems to be necessary to prepare the situation in Sec. IV B.\n\n\\section{Comments on experimental observation of power laws in SWT}\nWe discuss the possibility of observing the $-7/3$ and $-5/3$ power laws for direct and inverse cascades experimentally. In atomic BECs, in contrast to solid sate physics, the spatial distribution of the spin density vector is observable \\cite{Sad,Ven}. Thus, these power laws can be observed. \n\nIn our numerical calculation, the system is uniform and the interaction parameter is $|c_0/c_1|=20$, which are different from the real experiments where the trapping potential generates the inhomogeneity and the parameter\tis $|c_0/c_1| \\sim 200$. In this paper, for the sake of simplicity, we use the uniform system. As for the interaction parameter, we use $|c_0/c_1|=20$ since the ferromagnetic state is hard to be broken. Thus, to confirm whether or not these power laws appear in the experiment, we must perform the numerical calculation supposing the experimental situation.  In the following, we describe the important points of observing the $-7/3$ and $-5/3$ power laws in the numerical calculation or the experiment. \n\nFor the observation of the $-5/3$ power law, there are two important points. The first point is how to excite the system. As pointed out in Sec. IV A, to induce the inverse cascade in SWT, it is necessary to excite the spin wave in the high-wave-number region. A candidate for this excitation method would be the oscillation of a localized obstacle such as a Gaussian potential with small radius. The second point is to ensure the scaling region. This is concerned with the system size and energy injection scale. To obtain the wide scaling region, the system size must be larger than the energy injection scale. \n\nFor the $-7/3$ power law, the important points are basically the same as those for the inverse cascade. A candidate for the excitation methods are considered to be  the oscillation of the trapping potential or the oscillation of a localized obstacle with a large radius because it is required to excite the spin wave in the low-wave-number region to cause the direct cascade. As for the scaling region, the energy injection scale must be larger than the spatially experimental resolution of the spin density vector. \n\nIn both cases, the wave number and amplitude of the spin wave excited by the above considered method should  depend on the frequency and amplitude of the oscillation of the obstacle or the trapping potential, so  detailed investigation of these excitation methods is required. \n\n\\section{Conclusion}\nWe have analytically and numerically studied  SWT in a uniform ferromagnetic spin-1 spinor BEC at zero temperature by using the spinor GP equations. We have derived the $-7/3$ and $-5/3$ power laws for the direct and inverse cascades in the transverse spin correlation function by using \nthe previous result \\cite{Lut}. Our numerical calculation of the spinor GP equation has yielded a numerical result consistent with these power exponents, although the scaling region with the $-7/3$ power law is not so wide. Also, we checked whether or not the approximations to drive the power laws were valid. Finally, we discussed the experimental observation of the power laws. \n\n\\section*{Acknowledgments}\nThe authors are grateful to Y. Aoki for fruitful discussion. K. F.  was supported by a Grant-in-Aid for JSPS Fellows\n(Grant No. 262524). M. T.  was supported by JSPS KAKENHI Grant No. 26400366 and MEXT KAKENHI â\u0080\u009cFluctuation $\\&$ Structureâ\u0080\u009d Grant No. 26103526.\n\n\\setcounter{equation}{0}\n\\section*{Appendix : Fj\\o rtoft argument}\n\n\\begin{figure} [b]\n\\begin{center}\n\\includegraphics[width=85mm]{fig9.eps}\n\\caption{Fj\\o rtoft argument. The two conserved quantities restrict the dynamics, leading to the direct and inverse cascades (see text).}\n\\label{fig9}\n\\end{center}\n\\end{figure}\n\nWe describes the Fj\\o rtoft argument \\cite{wt1,wt2,Fjo}. In SWT, there are two conserved quantities defined by\n\\begin{eqnarray}\nE = \\sum _{\\bm k} \\mathcal{E}(k) = \\sum _{\\bm k} \\epsilon (k) n(k) \n\\end{eqnarray}\nand\n\\begin{eqnarray}\nN = \\sum _{\\bm k}  n(k), \n\\end{eqnarray}\nwhich are the spin wave energy $E$ and action $N$. The dispersion relation $\\epsilon (k)$ is given by $\\hbar^2k^2 /2M$. \nLet us consider the situation shown in Fig. \\ref{fig9}, where only a spin wave with a wave number $k_0$ is initially excited. After the time development, the spin wave is supposed to be redistributed into two spin waves with two wave numbers $k_0 /2$ and $2k_0$.  Through this dynamics, Eqs. (A1) and (A2) are independent of time, which leads to \n\\begin{eqnarray}\n\\mathcal{E}(k_0) = \\mathcal{E}(k_0/2) + \\mathcal{E}(2k_0), \n\\end{eqnarray}\n\\begin{eqnarray}\nn(k_0) = n(k_0/2) + n(2k_0). \n\\end{eqnarray}\nWe solve these coupled equations, obtaining\n\\begin{eqnarray}\nn(k_0/2) = \\frac{2}{5}n(k_0), \n\\end{eqnarray}\n\\begin{eqnarray}\nn(2k_0) = \\frac{1}{5}n(k_0), \n\\end{eqnarray}\n\\begin{eqnarray}\n\\mathcal{E}(k_0/2) = \\frac{1}{5} \\mathcal{E}(k_0), \n\\end{eqnarray}\n\\begin{eqnarray}\n\\mathcal{E}(2k_0) = \\frac{4}{5} \\mathcal{E}(k_0). \n\\end{eqnarray}\nThis result shows that the spin wave energy is transferred from the low- to high-wave-number region and vice versa  for the spin wave action.  \nThus, the direct and inverse cascades can occur in SWT because of the existence of the two conserved quantities. \nThis discussion is called the Fj\\o rtoft argument. \n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{thermal0} A. Polkovnikov, K. Sengupta, A. Silva, and M. Vengalattore, Rev. Mod. Phys. {\\bf 83} 863 (2011). \n\\bibitem{qhydor0} M. Tsubota, M. Kobayashi, and H. Takeuchi, Phys. Rep. {\\bf 522} 191 (2013).\n\n\\bibitem{KZ1} L. E. Sadler, J. M. Higbie, S. R. Leslie, M. Vengalattore, and D. M. Stamper-Kurn, Nature (London)  {\\bf 443}, 312 (2006). \n\\bibitem{KZ2} C. N. Weiler, T. W. Neely, D. R. Scherer, A. S. Bradley, M. J. Davis, and B. P. Anderson, Nature (London)  {\\bf 455}, 948 (2008).\n\\bibitem{KZ3} G. Lamporesi, S. Donadello, S. Serafini, F. Dalfovo. and G. Ferrari, Nature Phys. {\\bf 9}, 656 (2013).\n\\bibitem{KZ4} N. Navon, A. L. Gaunt, R. P. Smith. and Z. Hadzibabic, Science {\\bf 347}, 167 (2015). \n\n\\bibitem{thermal1} J. Guzman,1 G.-B. Jo, A. N. Wenz, K. W. Murch, C. K. Thomas, and D. M. Stamper-Kurn, Phys. Rev. A {\\bf 84}, 063625 (2011). \n\\bibitem{thermal2} M. Gring, M. Kuhnert, T. Langen, T. Kitagawa, B. Rauer, M. Schreitl, I. Mazets, D. Adu Smith, E. Demler, and J. Schmiedmayer, Science {\\bf 337}, 1318 (2012). \n\n\\bibitem{Henn09} E. A. L. Henn, J. A. Seman, G. Roati, K. M. F. Magalhaes, and V. S. Bagnato, Phys. Rev. Lett. { \\bf 103}, 045301 (2009).\n\\bibitem{Reeves12} M. T. Reeves, B. P. Anderson, and A. S. Bradley, Phys. Rev. A {\\bf 86}, 053621 (2012).\n\\bibitem{Neely13} T. W. Neely, A. S. Bradley, E. C. Samson, S. J. Rooney, E. M. Wright, K. J. H. Law, R. Carretero-Gonz${\\rm \\acute{a}}$lez, P. G. Kevrekidis, M. J. Davis, and B. P. Anderson, Phys. Rev. Lett. {\\bf 111}, 235301 (2013).\n\\bibitem{Kwon14} W. J. Kwon, G. Moon, J. Y. Choi, S. W. Seo, and Y. I. Shin, Phys. Rev. A {\\bf 90}, 063627 (2014).\n\n\\bibitem{Hal}{\\it Progress in Low Temperature Physics}, edited by W. P. Halperin and M. Tsubota (Elsevier, Amsterdam, 2008), Vol. XVI.\n\\bibitem{Vinen} W. F. Vinen, J. Low Temp. Phys. {\\bf 161}, 419 (2010). \n\\bibitem{Skrbek12} L. Skrbek and K. R. Sreenivasan, Phys. Fluids  {\\bf 24}, 011301 (2012).\n\n\\bibitem{Parker} N. G. Parker and C. S. Adams, Phys. Rev. Lett. {\\bf 95}, 145301 (2005).\n\\bibitem{KT07} M. Kobayashi and M. Tsubota, Phys. Rev. A {\\bf 76}, 045603 (2007).\n\n\\bibitem{Gou09} T.-L. Horng, C.-H. Hsueh, S.-W. Su, Y.-M. Kao, and S.-C. Gou, Phys. Rev. A {\\bf 80}, 023618 (2009). \n\\bibitem{Num10} R. Numasato, M. Tsubota, and V. S. L'vov, Phys. Rev. A {\\bf 81}, 063630 (2010).\n\\bibitem{Reeves13} M. T. Reeves, T. P. Billam, B. P. Anderson, and A. S. Bradley, Phys. Rev. Lett. {\\bf 110} 104501 (2013). \n\\bibitem{Billam14} T. P. Billam, M. T. Reeves, B. P. Anderson, and A. S. Bradley, Phys. Rev. Lett. {\\bf 112} 145301 (2014).\n\\bibitem{Bor11} B. Nowak, D. Sexty, and T. Gasenzer, Phys. Rev. B {\\bf 84}, 020506(R) (2011). \n\\bibitem{Bor12} B. Nowak, J. Schole, D. Sexty, and T. Gasenzer, Phys. Rev. A {\\bf 85}, 043627 (2012). \n\\bibitem{Sch12} J. Schole, B. Nowak, and T. Gasenzer, Phys. Rev. A {\\bf 86}, 013624 (2012). \n\\bibitem{White10} A. C. White, C. F. Barenghi, N. P. Proukakis, A. J. Youd, and D. H. Wacks, {\\bf 104}, 075301 (2010). \n\\bibitem{Bradley12} A. S. Bradley and B. P. Anderson, Phys. Rev. X {\\bf 2}, 041001 (2012).\n\\bibitem{White12} A. C. White, C. F. Barenghi, and N. P. Proukakis, Phys. Rev. A {\\bf 86}, 013635 (2012). \n\\bibitem{Simula14} T. Simula, M. J. Davis, and K. Helmerson, Phys. Rev. Lett. {\\bf 113}, 165302 (2014).\n\\bibitem{Stagg15} G. W. Stagg, A. J. Allen, N. G. Parker, and C. F. Barenghi, Phys. Rev. A {\\bf 91}, 013612 (2015).\n\n\\bibitem{Berl06} N. Berloff and C. Yin, J. Low Temp. Phys. {\\bf 145}, 187 (2006).  \n\\bibitem{Take10} H. Takeuchi, S. Ishino, and M. Tsubota, Phys. Rev. Lett. {\\bf 105}, 205301 (2010).   \n\\bibitem{Karl13} M. Karl, B. Nowak, and T. Gasenzer, Phys. Rev. A {\\bf 88}, 063615 (2013); Sci. Rep. {\\bf 3} 2394 (2013).\n\\bibitem{Koba14} D. Kobyakov, A. Bezett, E. Lundh, M. Marklund, and V. Bychkov, Phys. Rev. A {\\bf 89}, 013631 (2014).\n\\bibitem{Vill14} B. Villase$\\rm \\tilde{n}$or, R. Zamora-Zamora, D. Bernal, and V. Romero-Roch$\\rm \\acute{\\i}$n, Phys. Rev. A {\\bf 89}, 033611 (2014).\n\\bibitem{FT14} K. Fujimoto and M. Tsubota, Phys. Rev. A {\\bf 85}, 033642 (2012); {\\bf 88}, 063628 (2013); {\\bf 90}, 013629 (2014).\n\n\\bibitem{wt1} V. E. Zakharov, V. S. L'vov, and G. Falkovich, {\\it Kolmogorov Spectra of Turbulence I: Wave Turbulence} (Springer, Berlin, 1992).\n\\bibitem{wt2} S. Nazarenko, {\\it Wave Turbulence},  Lecture Notes in Physics Vol. 825 (Springer, Heidelberg, 2011).\n\n\\bibitem{KTU} K. Kasamatsu, M. Tsubota, and M. Ueda, Int. J. Mod. Phys. B {\\bf 19}, 1835 (2005).\n\\bibitem{KU} Y. Kawaguchi and M. Ueda, Phys. Rep. {\\bf 520}, 253 (2013).\n\\bibitem{Sta} D. M. Stamper-Kurn and M. Ueda, Rev. Mod. Phys. {\\bf 85}, 1191 (2013).\n\\bibitem{dipole1} M.A. Baranov, Phys. Rep. {\\bf 464}, 71 (2008).\n\\bibitem{dipole2} T. Lahaye, C. Menotti, L. Santos, M. Lewenstein, and T. Pfau, Rep. Prog. Phys. {\\bf 72}, 126401 (2009).\n\n\\bibitem{Lvov2003} Y. Lvov, S. Nazarenko, and R. West, Physica D, {\\bf 184}, 333 (2003). \n\\bibitem{Zakharov05} V. Zakharov and S. Nazarenko, Physica D {\\bf 201}, 203 (2005).\n\\bibitem{Naz1} S. Nazarenko and M. Onorato, Physica D {\\bf 219}, 1 (2006). \n\\bibitem{Naz2} S. Nazarenko and M. Onorato, J. Low Temp. Phys.  {\\bf 146}, 31 (2007). \n\\bibitem{Proment09} D. Proment, S. Nazarenko, and M. Onorato, Phys. Rev. A {\\bf 80}, 051603(R) (2009).\n\\bibitem{FT15} K. Fujimoto and M. Tsubota, Phys. Rev. A {\\bf 91}, 053620 (2015).\n\n\\bibitem{Zak74} V. E. Zakharov, V. S. L'vov, and S. S. Starobinets, Usp. Fiz. Nauk {\\bf 114}, 609 (1974).  \n\\bibitem{Bry88} P. H. Bryant, C. D. Jeffries, and K. Nakamura, Phys. Rev. A {\\bf 38}, 4223 (1988). \n\\bibitem{Aze91} A. Azevedo and S. M. Rezende, Phys. Rev. Lett. {\\bf 66}, 1342 (1991). \n\\bibitem{Lut} V. S. Lutovinov and V. R. Chechetkin, Zh. Eksp. Teor. Fiz. {\\bf 76}, 223 (1979) [Sov. Phys. JETP {\\bf 49}, 114 (1979)].\n\n\n\n\n\\bibitem{Mar14} G. E. Marti, A. MacRae, R. Olf, S. Lourette, F. Fang, and D. M. Stamper-Kurn, Phys. Rev. Lett. {\\bf 113}, 155302 (2014).\n\\bibitem{Sai15} H. Saito and M. Kunimi, Phys. Rev. A {\\bf 91}, 041603(R) (2015). \n\\bibitem{Tha14} N. T. Phuc, Y. Kawaguchi, and M. Ueda, Phys. Rev. Lett. {\\bf 113}, 230401 (2014). \n\\bibitem{kun15} M. Kunimi and H. Saito, Phys. Rev. A {\\bf 91}, 043624 (2015).\n\\bibitem{Kaw07} Y. Kawaguchi, H. Saito, and M. Ueda, Phys. Rev. Lett. {\\bf 98}, 110406 (2007).\n\\bibitem{Eto14} Y. Eto, H. Saito, and T. Hirano, Phys. Rev. Lett. {\\bf 112}, 185301 (2014).\n\\bibitem{Sad}L. E. Sadler, J. M. Higbie, S. R. Leslie, M. Vengalattore, and D. M. Stamper-Kurn, Nature (London) {\\bf 443}, 312 (2006).\n\\bibitem{Ven} M. Vengalattore, S. R. Leslie, J. Guzman, and D. M. Stamper-Kurn, Phys. Rev. Lett. {\\bf 100}, 170403 (2008).\n\n\n\\bibitem{Ohmi98} T. Ohmi and K. Machida, J. Phys. Soc. Jpn. \\textbf{67}, 1822 (1998).\n\\bibitem{Ho98} T.-L. Ho, Phys. Rev. Lett. \\textbf{81}, 742 (1998).\n\n\\bibitem{Lam} A. Lamacraft, Phys. Rev. A {\\bf 77}, 063622 (2008).\n\\bibitem{Bar} R. Barnett, D. Podolsky, and G. Refael,  Phys. Rev. B {\\bf 80}, 024420 (2009).\n\\bibitem{KK} K. Kudo and Y. Kawaguchi,  Phys. Rev. A {\\bf 82}, 053614 (2010);  {\\bf 84}, 043607 (2011).\n\\bibitem{YU12} E. Yukawa and M. Ueda, Phys. Rev. A {\\bf 86}, 063614 (2012).\n\n\\bibitem{anderson} R. W. Anderson, {\\it Basic Notions of Condensed Matter Physics} (Westview, Boulder, CO, 1997). \n\n\\bibitem{Fjo} Fj\\o rtoft, Tellus {\\bf 5}, 1359 (1953). \n\\bibitem{Kat} A. V. Kats and V. M. Kontorovich, Zh. Eksp. Teor. Fiz. {\\bf 65}, 206 (1973) [Sov. Phys. JETP {\\bf 38}, 102 (1974)].\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 23582, "prevtext": "\n\n\\preprint{APS/123-QED}\n\n\\title{Direct and inverse cascades of spin wave turbulence in spin-1 ferromagnetic spinor Bose-Einstein condensates} \n\n\\author{Kazuya Fujimoto}\n\\affiliation{Department of Physics, Osaka City University, Sumiyoshi-ku, Osaka 558-8585, Japan}\n\n\\author{Makoto Tsubota}\n\\affiliation{Department of Physics, Osaka City University, Sumiyoshi-ku, Osaka 558-8585, Japan}\n\\affiliation{The OCU Advanced Research Institute for Natural Science and Technology (OCARINA), Osaka City University, Sumiyoshi-ku, Osaka 558-8585, Japan}\n\n\\date{\\today}\n\n\\begin{abstract}\nWe theoretically and numerically study spin wave turbulence in spin-1 ferromagnetic spinor Bose-Einstein condensates, finding direct and inverse cascades with power-law behavior. To derive these power exponents analytically, the conventional weak wave turbulence theory is applied to the spin-1 spinor Gross-Pitaevskii equation. Then, we obtain the $-7/3$ and $-5/3$ power laws in a transverse spin correlation function for the direct and inverse cascades, respectively. To confirm these power laws, numerical calculations are performed that obtain the results consistent with these power laws. \n\\end{abstract}\n\n\\pacs{03.75.Kk,05.45.-a}\n\n\\maketitle\n\n\\section{Introduction}\nUltra-cold atomic gases give us an excellent stage to study various nonequilibrium phenomena such as dynamical phase transitions, thermalization in  isolated quantum systems \\cite{thermal0}, and quantum hydrodynamics \\cite{qhydor0}. Actually, experimental studies of the Kibble-Zureck mechanism \\cite{KZ1,KZ2,KZ3,KZ4}, thermalization in isolated one-dimensional systems \\cite{thermal1,thermal2}, and quantum turbulence (QT) \\cite{Henn09, Reeves12,Neely13,Kwon14} are widely performed, revealing novel nonequilibrium phenomena. \n \nQuantum turbulence has recently become an active area in the field of atomic Bose-Einstein condensates (BECs). \nSuch systems can provide access to topics not  addressable in superfluid helium systems \\cite{Hal,Vinen,Skrbek12}, e.g., QT in  two-dimensional systems and  in multicomponent BECs, thereby opening new directions in QT research. At present, in experimental studies of one-component atomic BECs, both three- and two-dimensional QT with many quantized vortices can be generated, being investigated in terms of anomalous expansion \\cite{Henn09}, vortex distribution \\cite{Reeves12,Neely13}, and vortex decay  \\cite{Kwon14}. Similarly, theoretical and numerical studies also address such  QT, providing discussion of features characteristic of quantized vortices such as the Kolmogorov $-5/3$ power law \\cite{Parker,KT07}, direct and inverse cascades \\cite{Gou09,Num10,Reeves13,Billam14}, nonthermal fixed points \\cite{Bor11,Bor12,Sch12}, the probability density function for superfuild velocity \\cite{White10}, vortex distributions \\cite{White12,Bradley12,Simula14}, and vortex decay  \\cite{Stagg15}. Furthermore, QT in multicomponent BECs has also been theoretically and numerically studied, giving nontrivial results for correlation functions of the wave function, the spin density vector, and the velocity field \\cite{Berl06,Take10,Karl13,Koba14,Vill14,FT14}. \n\nApart from such hydrodynamic turbulence with many quantized vortices, there is another kind of turbulence: weak wave turbulence (WWT) dominated by weakly interacting waves \\cite{wt1,wt2}. Ultra-cold gas is a superclean system with many kinds of quantum fluids such as binary BECs \\cite{KTU}, spinor BECs \\cite{KU,Sta}, and dipolar BECs \\cite{dipole1,dipole2}, and it is possible to observe  local quantities, e.g., the density profile and the spin density vector, so ultra-cold gases is one of the most suitable systems for investigating nonlinear and nonequilibrium wave dynamics such as WWT. \n\nHowever, there have been only a few  WWT studies in atomic BECs \\cite{Lvov2003,Naz1,Naz2,Zakharov05,Proment09,FT15} where the Kolmogorov-Zakharov (KZ) spectrum \\cite{wt1,wt2} has been discussed analytically and numerically in one-component atomic BECs. \nFor instance, Proment $et$ $al.$ \\cite{Proment09} investigated the connection between  three- and four-wave turbulence from the viewpoint of the growth of the condensate, studying the change of power exponents in a correlation function for a macroscopic wave function. Our recent work \\cite{FT15} focused on a density profile being observable, and we discussed the experimental observation of the direct cascade related to the KZ spectrum. \n\nIn this paper, we focus on WWT in a spin-1 ferromagnetic spinor BEC dominated by spin waves, which we call spin wave turbulence (SWT). Applying  WWT theory \\cite{wt1,wt2} to a spin-1 spinor Gross-Pitaevskii (GP) equation, we analytically find the $-7/3$ and $-5/3$ power laws in the transverse spin correlation function for direct and inverse cascades, respectively. To confirm these laws, we perform numerical calculations, obtaining  results consistent with these power exponents. In this paper, we report  details of these analytical and numerical results.\n\nBefore proceeding to the next section, we note that such a nonequilibrium phenomenon for the spin waves has already been studied in solid state physics \\cite{Zak74,Bry88,Aze91}. Previous experiments have focused on spin waves in yttrium iron garnet (YIG), where parametric instability, chaos, SWT, etc. were investigated. The distribution of  spin waves in SWT, as far as we know, has only been addressed in a single theoretical study \\cite{Lut}. \nIn magnetic materials such as YIG, the equation of motion for the spin wave is much complicated because many effects such as anisotropic fields, dipolar interactions, and thermal baths exist \\cite{Zak74,Bry88}. Thus, the dynamics of spin waves observed in  previous studies is difficult to understand.  \nAlso, the experimental methods are based on the absorption of the pump energy and thus  do not access the spatial distribution of the spin. \n\nIn distinction from solid state physics, the atomic BEC is a superclean system without any impurities and is highly controllable, being a suitable system for studying  spin wave dynamics. Actually, the dispersion relation and dynamics of spin waves in the spinor BEC have been experimentally and theoretically studied \\cite{Mar14,Sai15,Tha14,kun15,Kaw07,Eto14}. Furthermore, because the spatial profile of the spin density vector is observable \\cite{Sad,Ven},  it is possible to investigate the distribution of spin waves and the spin correlation function, which is advantageous in research on spin wave dynamics. Therefore,  atomic BECs provide an excellent stage for studying spin waves. \n\nFinally, let us comment on the difference between this work and our previous one \\cite{FT14}. The previous work focused on spin turbulence being strongly excited by the counterflow instability, where the spin density vector points in various directions and domain walls and vortices are nucleated. In contrast to this spin turbulence, in this paper we address weakly excited turbulence with a small-amplitude spin wave. Thus  SWT is another type of turbulence that is distinct from the spin turbulence addressed in our previous paper. \n\nThis article is organized as follows. Section II describes the formulation, where we introduce the spin-1 spinor GP equation and spin hydrodynamic equation. In Sec. III, we apply WWT theory to the GP equation, deriving the power laws for the transverse spin correlation function. In Sec. IV, we show our numerical results for SWT. The experimental observation of these power laws is commented upon in Sec. V. Finally, we summarize this work in Sec. VI. \n\n\\section{Formulation}\nOur model to study SWT in spinor BECs is introduced. \nFirst, we explain the spin-1 spinor GP equation describing the dynamics of the spin-1 spinor BECs at zero temperature. \nSecond, we give the spin hydrodynamic equation equivalent to the GP equation, which is useful for the application of WWT theory. \n\n\\subsection{Spin-1 spinor GP equation}\nWe consider a uniform system without a magnetic field  comprised of $N$-particle spin-1 bosons at zero temperature, which is well described by the macroscopic wave functions $\\psi _m$ $(m=1,0,-1)$ obeying the spin-1 spinor GP equations \\cite{Ohmi98,Ho98}: \n\\begin{eqnarray}\ni\\hbar \\frac{\\partial}{\\partial t} \\psi _m  =  -\\frac{\\hbar^2}{2M} \\nabla^2 \\psi _m + c_0 \\rho \\psi _m + c_1 \\bm{F}\\cdot(\\hat{\\bm{F}})_{mn} \\psi _n.  \\label{GP}\n\\end{eqnarray}\nIn this paper, Roman indices appear twice,  being summed over $-1$, 0, and 1, and,  in the same way, Greek indices are summed over $x$, $y$, and $z$. The total density and the spin density vector are given by $\\rho =  \\psi _m ^{*} \\psi _m $ and  $F_{\\mu} =  \\psi _{m}^{*} ({\\hat F}_{\\mu})_{mn} \\psi _{n}$ ($\\mu = x, y, z$), respectively, where $({\\hat F}_{\\mu})_{mn}$ are the spin-1 matrices. The parameters $M$, $c_{0}$, and $c_{1}$ refer to the particle mass and the spin-independent and spin-dependent interactions, respectively. The sign of the coefficients $c_{1}$ plays an important role in the spin dynamics. In this paper, we consider only the ferromagnetic interaction $c_{1} < 0$.\n\n\\subsection{Spin hydrodynamic equation}\nFor preparation of the following sections, we introduce the spin hydrodynamic equation derived from Eq. (\\ref{GP}). This kind of equation has been discussed in some papers \\cite{Lam,Bar,KK,YU12}. Here, we use the hydrodynamic equation derived by Yukawa and Ueda \\cite{YU12}. This equation is composed of the equations of the total density $\\rho$, the superfluid velocity $\\bm{v}$, the spin vector $f_{\\mu} = F_{\\mu}/\\rho$, and the nematic tensor $n_{\\mu \\nu} = \\psi _{m}^{*} (\\hat{N}_{\\mu \\nu})_{mn} \\psi _{n} /\\rho,$ with $(\\hat{N}_{\\mu \\nu})_{mn}  =  [ (\\hat{F}_{\\mu})_{ml} (\\hat{F}_{\\nu})_{ln} + (\\hat{F}_{\\nu})_{ml} (\\hat{F}_{\\mu})_{ln} ]/2$ and $\\bm{v} = \\hbar(\\psi_m^*\\bm{\\nabla} \\psi_m - \\psi_m\\bm{\\nabla} \\psi_m^*)/2Mi$.\n\nIn this paper, we consider the ferromagnetic interaction, so that the macroscopic wave functions can be assumed to be expressed by the fully spin-polarized state. Hence, the spin vector and the nematic tensor satisfy the relation\n\\begin{eqnarray}\nn_{\\mu\\nu} = \\frac{\\delta _{\\mu \\nu} + f_{\\mu} f_{\\nu}}{2}.\n\\end{eqnarray}\nThis assumption is valid if the interaction $c_{1}$ is negative and the excitation to the system is not so strong. \nThen, by eliminating the nematic tensor in the hydrodynamic equations of \\cite{YU12}, we obtain\n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t} \\rho +  \\bm{\\nabla} \\cdot \\rho \\bm{v} = 0, \\label{sh0}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t} \\rho f_{\\mu} +  \\bm{\\nabla} \\cdot \\rho \\bm{v}_{\\mu} = 0, \\label{sh1}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\bm{v}_{\\mu} = f_{\\mu} \\bm{v} - \\frac{\\hbar}{2M} \\epsilon _{\\mu \\nu \\lambda}  f_{\\nu} (\\bm{\\nabla} f_{\\lambda}), \\label{sh2}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t}  v_{\\mu} &+& v_{\\nu} \\nabla _{\\nu} v_{\\mu} - \\frac{\\hbar ^{2}}{2M^{2}} \\nabla _{\\mu} \\frac{\\nabla ^{2}_{\\nu} \\sqrt{\\rho}}{\\rho}  \\nonumber  \\\\ \n&+& \\frac{\\hbar^{2}}{4M^{2}\\rho} \\nabla _{\\nu} \\rho \\biggl\\{ (\\nabla_{\\mu}f_{\\lambda})(\\nabla_{\\nu}f_{\\lambda}) \n- f_{\\lambda}(\\nabla_{\\mu} \\nabla_{\\nu} f_{\\lambda})  \\biggr\\}  \\nonumber  \\\\ \n&=& -\\frac{1}{M}\\biggl\\{ c_{0}(\\nabla _{\\mu} \\rho) + c_{1} f_{\\nu} (\\nabla _{\\mu} \\rho f_{\\nu}) \\biggr\\} . \\label{sh3}\n\\end{eqnarray}\nIn the next section, we use these equations to investigate SWT analytically. \n\n\\section{Application of WWT theory to the spin hydrodynamic equation}\nWe apply  WWT theory \\cite{wt1,wt2} to the spin hydrodynamic equation, obtaining two power laws in the transverse spin correlation function for the direct and inverse cascades, respectively. In this derivation, we make use of the previous result obtained in Ref. \\cite{Lut}. \n\nFirst, we derive the equation of motion for fluctuations of the spin vector. Second, neglect of the spin-velocity and spin-density interactions is shown to make Eq. (\\ref{sh1}) the Heisenberg ferromagnetic equation, and we find that our SWT is equivalent to the previous one \\cite{Lut}. \nFinally, we derive the power laws for the transverse spin correlation function, which can be observed experimentally. \n\n\\subsection{Approximation of the spin hydrodynamic equation}\nIn our SWT, there are weak fluctuations that deviate from the ferromagnetic ground state being a fully spin-polarized state. To address these fluctuations, we decompose the spin vector, total density, and velocity field into their spatially averaged values and fluctuations as follows:\n\\begin{eqnarray}\n\\rho = \\bar{\\rho} + \\delta \\rho, \n\\end{eqnarray}\n\\begin{eqnarray}\nf_{\\mu} = \\bar{f}_{\\mu} + \\delta f_{\\mu},  \\label{spin_fluc}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\bm{v} = \\delta \\bm{v}.\n\\end{eqnarray}\nHere, the spatially averaged values are defined by $\\bar{\\rho}=\\langle \\rho \\rangle _{\\rm V}=N/V$ and $\\bar{f}_{\\mu}=\\langle f_{\\mu} \\rangle _{\\rm V}$, with the spatial average operation $\\langle \\cdots \\rangle _{\\rm V}= \\int \\cdots \\hspace{1mm} dV/V$,  total particle number $N$, and  system volume $V$. These averaged quantities are independent of time owing to the symmetry of the Hamiltonian for the spin-1 spinor GP equation (\\ref{GP}).\nIn our case, the ground state is assumed to be the fully spin-polarized state in the $z$ direction, having $\\bar{f}_{\\mu} = \\delta_{\\mu z}$.\n\nSubstituting these fluctuations into the spin hydrodynamic equations (\\ref{sh0})--(\\ref{sh2}) and retaining the spin-spin, spin-density, and spin-velocity interaction terms, we obtain\n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t} \\delta f_{\\mu} = I_{\\mu}^{\\rm (s)} + I_{\\mu}^{\\rm (ss)} + I_{\\mu}^{\\rm (sd)}  + I_{\\mu}^{\\rm (sv)},\n\\end{eqnarray}\n\\begin{eqnarray}\nI_{\\mu}^{\\rm (s)} = \\frac{\\hbar}{2M} \\epsilon_{\\mu\\nu\\lambda} \\bar{f}_{\\nu} \\triangle \\delta f_{\\lambda},\n\\end{eqnarray}\n\\begin{eqnarray}\nI_{\\mu}^{\\rm (ss)} = \\frac{\\hbar}{2M} \\epsilon_{\\mu\\nu\\lambda} \\delta f_{\\nu} \\triangle \\delta f_{\\lambda}, \n\\end{eqnarray}\n\\begin{eqnarray}\nI_{\\mu}^{\\rm (sd)} = \\Bigl[ \\frac{\\hbar}{2M\\rho} \\epsilon_{\\mu\\nu\\lambda} f_{\\nu}(\\bm{\\nabla} \\delta f_{\\lambda})  \\cdot \\bm{\\nabla} \\Bigl] \\delta \\rho,\n\\end{eqnarray}\n\\begin{eqnarray}\nI_{\\mu}^{\\rm (sv)} = -(\\delta \\bm{v}\\cdot \\bm{\\nabla})\\delta f_{\\mu},  \n\\end{eqnarray}\nwhere each term $I_{\\mu}^{\\rm (a)}$ (a = s, ss, sd,  and sv) is the spin-linear, spin-spin interaction, spin-density interaction, and spin-velocity interaction terms. \n\nAt present, we do not sufficiently understand which interactions are dominant. This issue should  depend on the initial state, interaction parameters, and methods of how to excite systems. However, in our SWT, we expect that the spin-spin interaction is stronger than other interactions because (I) the density fluctuation seems to be weak since the excitation to the system is not so strong and the inequality $c_{0} \\gg |c_{1}|$ is satisfied, and (II) the velocity fluctuation is also expected to be weak since the spin and density fluctuations are weak. \nHence, we may neglect the spin-density and spin-velocity interaction terms in SWT. \nHowever, this is speculation; therefore, in numerical calculations, we must confirm whether or not this situation is satisfied. \n\nBased on this speculation, we can neglect the spin-density and spin-velocity interactions, deriving the equation of motion for the spin vector $f_{\\mu}$:\n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t} f_{\\mu} = \\frac{\\hbar}{2M } \\epsilon_{\\mu\\nu\\lambda} f_{\\nu}  \\triangle f_{\\lambda}.\n\\label{spin_eq1}\n\\end{eqnarray}\nHere, we use Eq. (\\ref{spin_fluc}), changing the variable $\\delta f_{\\mu}$ to $f_{\\mu}$. This equation is the same as the Heisenberg ferromagnetic or the Landau-Lifshitz equation, which was originally used in solid state physics \\cite{anderson}.  \n\nIn the previous study \\cite{Lut}  WWT theory was applied to Eq. (\\ref{spin_eq1}) to study SWT in magnetic substances, allowing investigation of the distribution of the spin wave and finding the two power laws for the direct and inverse cascades. \n\n\\subsection{Power laws in the spin wave distribution  }\nWe briefly review  part of the results obtained in \\cite{Lut}, wherein SWT in three-dimensional systems was theoretically studied by applying WWT theory to Eq. (\\ref{spin_eq1}). For this application, it is necessary to transform Eq. (\\ref{spin_eq1}) to the canonical form. Then, the new complex variable $a$ is usually introduced as follows \\cite{wt1}:\n\\begin{eqnarray}\nf_{+} = f_x + if_{y} = a\\sqrt{2-a^{*}a},\n\\label{HP1}\n\\end{eqnarray}\n\\begin{eqnarray}\nf_{-} = f_x - if_{y} = a^{*}\\sqrt{2-a^{*}a},\n\\label{HP2}\n\\end{eqnarray}\n\\begin{eqnarray}\nf_{z}  = 1-a^{*}a, \n\\label{HP3}\n\\end{eqnarray}\nwhich is the classical version of the Holstein-Primakoff transformation. These are the canonical variables obeying\n\\begin{eqnarray}\ni\\hbar \\frac{\\partial}{\\partial t} a = \\frac{\\delta W}{\\delta a^{*}}, \n\\label{spin_eq2}\n\\end{eqnarray}\n\\begin{eqnarray}\nW = \\frac{\\hbar^2}{4M} \\int (\\nabla_{\\mu} f_{\\nu})^2 dV. \n\\label{spin_eq3}\n\\end{eqnarray}\n\nIn SWT, the amplitude of $|a|^2$ is much smaller than unity, so  we can expand $W$ with the power of the canonical variable $a$. Retaining the leading interaction between the spin waves, we obtain\n\\begin{eqnarray}\nW = W_{0} + W_{1},  \n\\label{spin_eq4}\n\\end{eqnarray}\n\\begin{eqnarray}\nW_{0} = \\frac{\\hbar^2}{2M} \\int |\\bm{\\nabla}a|^2   dV, \n\\label{spin_eq5}\n\\end{eqnarray}\n\\begin{eqnarray}\nW_{1} = \\frac{\\hbar^2}{8M} \\int \\Bigl[ a^2(\\bm{\\nabla}a^*)^2 + (a^*)^2(\\bm{\\nabla}a)^2 \\Bigl]  dV. \n\\label{spin_eq6}\n\\end{eqnarray}\n\nTo consider the dynamics in  wave-number space, we perform the Fourier transformation to the canonical equation (\\ref{spin_eq2}), obtaining\n\\begin{eqnarray}\ni\\hbar \\frac{\\partial}{\\partial t} \\hat{a}(\\bm{k}) = \\frac{\\partial H}{\\partial \\hat{a}^{*}(\\bm{k})}, \n\\label{spin_eq7}\n\\end{eqnarray}\nwith the Fourier component $\\hat{a} (\\bm{k})=\\mathcal{F}[a](\\bm{k}) =  \\int a(\\bm{r}) {\\rm exp} (-i \\bm{k} \\cdot \\bm{r}) dV /V$. \nThe Hamiltonian of the spin wave is given by\n\\begin{eqnarray}\nH = H_{0} + H_{1},  \n\\label{spin_eq8}\n\\end{eqnarray}\\begin{eqnarray}\nH_{0} = \\sum _{\\bm{k}_1} \\epsilon(k_1) |\\hat{a}(\\bm{k}_1)|^{2}, \n\\label{spin_eq9}\n\\end{eqnarray}\n\\begin{eqnarray}\nH_{1} =  \\frac{1}{2} \\sum _{\\bm{k}_1,\\bm{k}_2,\\bm{k}_3,\\bm{k}_4} W^{1,2}_{3,4} \\delta^{1,2}_{3,4} \\hat{a}^{*}(\\bm{k}_1) \\hat{a}^{*}(\\bm{k}_2)\\hat{a}(\\bm{k}_3)\\hat{a}(\\bm{k}_4), \n\\label{spin_eq10}\n\\end{eqnarray}\n\\begin{eqnarray}\nW^{1,2}_{3,4}=-\\frac{\\hbar^{2}}{4M}\\Bigl[ (\\bm{k}_1\\cdot\\bm{k}_2) + (\\bm{k}_3\\cdot\\bm{k}_4) \\Bigl], \n\\label{spin_eq11}\n\\end{eqnarray}\nwhere $\\delta^{1,2}_{3,4} =\\delta(\\bm{k}_1+\\bm{k}_2-\\bm{k}_3-\\bm{k}_4)$ and $\\epsilon (k)=\\hbar ^2 k^2/2M$ are the Kronecker $\\delta$ and the excitation energy for the spin wave, respectively. \n\nWe focus on the distribution of the spin wave, which is defined by \n\\begin{eqnarray}\nn(\\bm{k}) = \\biggl( \\frac{L}{2\\pi} \\biggl)^{d} \\langle |\\hat{a}(\\bm{k})|^{2} \\rangle _{\\rm en}, \n\\label{spin_dis}\n\\end{eqnarray}\nwith  system size $L$ and  system dimension $d=3$. Here the brackets $\\langle  \\cdots \\rangle _{\\rm en}$ mean the ensemble average. \nUsing  WWT theory, we derive the kinetic equation of the spin wave as \n\\begin{eqnarray}\n\\frac{\\partial}{\\partial t} n(\\bm{k}) = \\int \\mathcal{R}^{k,1}_{2,3}~d\\bm{k}_1 d\\bm{k}_2 d\\bm{k}_3,   \\label{kin_equ1}\n\\end{eqnarray}\n\\begin{eqnarray}\n\\mathcal{R}^{k,1}_{2,3} &=& 4 \\pi |W^{k,1}_{2,3}|^2  \\delta _{\\rm d}(\\epsilon^{k,1}_{2,3}) {\\delta_{\\rm d}} ^{k,1}_{2,3} \\nonumber \\\\\n&\\times&n(\\bm{k}_1)n(\\bm{k}_2)n(\\bm{k}_3)n(\\bm{k}) \\nonumber \\\\  \n&\\times& \\Biggl( \\frac{1}{n(\\bm{k})}+\\frac{1}{n(\\bm{k}_1)}-\\frac{1}{n(\\bm{k}_2)}-\\frac{1}{n(\\bm{k}_3)} \\Biggl).   \\label{kin_equ2}\n\\end{eqnarray}\nHere, the abbreviations for the Dirac delta function  $\\delta _{\\rm d}$ are defined by ${\\delta_{\\rm d}} ^{k,1}_{2,3} = \\delta_{\\rm d} (\\bm{k}+\\bm{k}_1-\\bm{k}_2-\\bm{k}_3)$ and ${\\delta_{\\rm d}} (\\epsilon ^{k,1}_{2,3}) = \\delta_{\\rm d} (\\epsilon (k)+\\epsilon (k_1)-\\epsilon (k_2)-\\epsilon (k_3))$. \n\nIn the previous study \\cite{Lut}  this equation was utilized to obtain two power laws in three-dimensional SWT:\n\\begin{eqnarray}\nn(\\bm{k}) \\propto \\left\\{ \\begin{array}{ll}\nk^{-13/3} & ({\\rm direct\\hspace{1mm}cascade}), \\\\\nk^{-11/3} & ({\\rm inverse\\hspace{1mm}cascade}). \\\\\n\\end{array} \\right.\n\\end{eqnarray}\nIn SWT, the interaction between the spin waves is a four-wave interaction, so  the action of the spin wave is conserved.\nThus, the usual Fj\\o rtoft argument \\cite{wt1,wt2,Fjo} described in the Appendix leads to the direct cascade for the spin wave energy and the inverse cascade for the action of the spin wave. \n\nWe can easily extend this result to SWT in the two-dimensional system, obtaining \n\\begin{eqnarray}\nn(\\bm{k}) \\propto \\left\\{ \\begin{array}{ll}\nk^{-4/3-d} & ({\\rm direct\\hspace{1mm}cascade}), \\\\\nk^{-2/3-d} & ({\\rm inverse\\hspace{1mm}cascade}), \\\\\n\\end{array} \\right.\n\\label{spin_pow1}\n\\end{eqnarray}\nwith $d=2,3$. The locality of these power laws can be confirmed by the result of \\cite{Kat}.\n\n\\subsection{Power laws in the transverse spin correlation function}\nIn experiments, the spin density vector can be observed by the phase contrast imaging method \\cite{Sad,Ven,Sta}. \nThus, we focus on the correlation function of the spin density vector in SWT, defining the transverse spin correlation function: \n\\begin{eqnarray}\nC_{xy}^{\\rm (s)}(k) = \\frac{1}{\\triangle k} \\sum_{k-\\triangle k/2<|\\bm{k}_1|<k+\\triangle k/2} \\Bigl[ |\\hat{F}_{x}(\\bm{k}_1)|^2+|\\hat{F}_{y}(\\bm{k}_1)|^2 \\Bigl], \n\\label{spin_corr}\n\\end{eqnarray}\nwith the Fourier component $\\hat{F}_{\\mu} (\\bm{k})=\\mathcal{F}[F_{\\mu}](\\bm{k})~(\\mu=x,y,+,-)$. \nIn our case, $\\hat{F}_{+}(\\bm{k}) \\sim\\sqrt{2} \\bar{\\rho} \\hat{a}(\\bm{k})$ is approximately satisfied, which leads to\n\\begin{eqnarray}\n\\hat{F}_{+}(\\bm{k}) \\hat{F}_{-}(\\bm{k}) \\propto |\\hat{a}(\\bm{k})|^2. \n\\end{eqnarray}\nThus, we obtain\n\\begin{eqnarray}\nC_{xy}^{\\rm (s)}(k) \\propto \\left\\{ \\begin{array}{ll}\nk^{-7/3} & ({\\rm direct\\hspace{1mm}cascade}), \\\\\nk^{-5/3} & ({\\rm inverse\\hspace{1mm}cascade}). \\\\\n\\end{array} \\right.\n\\label{spin_pow2}\n\\end{eqnarray}\nIn contrast to Eq. (\\ref{spin_pow1}), these are independent of the system dimension $d$ because of the integration over the solid angle. \n\n\\section{Numerical calculation for SWT} \nWe now present our numerical results of SWT in a two-dimensional uniform system with the GP equation. \nOur numerical calculations are performed for the direct and inverse cascades in SWT, respectively.  \nIn the calculation for the inverse cascade, to induce the mode transfer from the high-wave-number region to low one, we use the initial state where the energy is injected into the high-wave-number region. In contrast, in the calculation for the direct cascade, the state into which the energy is injected in the low-wave-number region is adopted as the initial state. \n\n\\subsection{SWT for the inverse cascade}\n\n\\subsubsection{Numerical condition and method}\nOur calculation addresses the ferromagnetic spin-1 spinor BEC in a two-dimensional system whose system size $L \\times L$ is $256\\xi \\times 256\\xi$ with $\\xi=\\hbar/\\sqrt{2Mc_0\\bar{\\rho}}$. We set the spatial resolution as $dx/\\xi=1$. The time resolution is $dt/\\tau=2\\times10^{-3}$ with $\\tau=\\hbar/c_0\\bar{\\rho}$. The interaction parameters are taken to be $c_0>0$, $c_1<0$, and $|c_0/c_1|=20$. In this situation, we numerically solve the GP equation (\\ref{GP}) by using the pseudo spectral method. \n\nWe describe how to prepare the initial state. To confirm the inverse cascade, the energy should be injected into the initial state in the high-wave-number region. Then we adopt the following state as the initial state:\n\n", "index": 1, "text": "\\begin{equation}\n\\begin{pmatrix}\n\\psi_{1}(\\bm{r})  \\\\\n\\psi_{0}(\\bm{r})  \\\\\n\\psi_{-1}(\\bm{r})\n\\end{pmatrix}\n= \\sqrt{\\bar{\\rho}} {\\rm e}^{i \\phi(\\bm{r}) }\n\\begin{pmatrix}\n{\\rm e}^{-i\\alpha(\\bm{r})} {\\rm cos}^2 \\frac{\\beta(\\bm{r})}{2}\\\\\n\\frac{1}{\\sqrt{2}} {\\rm sin } \\beta(\\bm{r}) \\\\\n{\\rm e}^{i\\alpha(\\bm{r})} {\\rm sin}^2 \\frac{\\beta(\\bm{r})}{2}\n\\end{pmatrix}\n,\n\\label{ini1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{pmatrix}\\psi_{1}(\\bm{r})\\\\&#10;\\psi_{0}(\\bm{r})\\\\&#10;\\psi_{-1}(\\bm{r})\\end{pmatrix}=\\sqrt{\\bar{\\rho}}{\\rm e}^{i\\phi(\\bm{r})}\\begin{%&#10;pmatrix}{\\rm e}^{-i\\alpha(\\bm{r})}{\\rm cos}^{2}\\frac{\\beta(\\bm{r})}{2}\\\\&#10;\\frac{1}{\\sqrt{2}}{\\rm sin}\\beta(\\bm{r})\\\\&#10;{\\rm e}^{i\\alpha(\\bm{r})}{\\rm sin}^{2}\\frac{\\beta(\\bm{r})}{2}\\end{pmatrix},\" display=\"block\"><mrow><mrow><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msub><mi>ψ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>)</mo></mrow><mo>=</mo><mrow><msqrt><mover accent=\"true\"><mi>ρ</mi><mo stretchy=\"false\">¯</mo></mover></msqrt><mo>⁢</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mo>⁢</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><msup><mi mathvariant=\"normal\">e</mi><mrow><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></msup><mo>⁢</mo><msup><mi>cos</mi><mn>2</mn></msup><mo>⁢</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mi>β</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac></mstyle></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mstyle displaystyle=\"false\"><mfrac><mn>1</mn><msqrt><mn>2</mn></msqrt></mfrac></mstyle><mo>⁢</mo><mi>sin</mi><mo>⁢</mo><mi>β</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><msup><mi mathvariant=\"normal\">e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msup><mo>⁢</mo><msup><mi>sin</mi><mn>2</mn></msup><mo>⁢</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mi>β</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac></mstyle></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]