[{"file": "1601.02920.tex", "nexttext": "\nThe maximum photon density corresponds to the CMB; its total density is about 400 photons per cubic centimeter.\n\nA region of particular interest is the so-called extragalactic background light~(EBL), \\index{EBL (extragalactic background light)}  i.e., the light in the visible and near infrared regions.\nIt  consists of the sum of starlight emitted by galaxies throughout their whole cosmic \nhistory, plus possible additional contributions, like, e.g., light from hypothetical first \nstars that formed before galaxies were assembled.\nTherefore, in principle the EBL contains important information about both the evolution of baryonic \ncomponents of galaxies and the structure of the Universe in the pre-galactic era. Note that the  light is redshifted by a factor $(1+z)$ due to the expansion of the Universe, and thus, the  visible light from old sources is detected as infrared.\nThe density of EBL photons in the region near the visible can be derived by direct deep-field observations, and by constraints on the propagation of VHE photons. A plot of the present knowledge on the density of photons in the EBL region is shown in Fig. \\ref{fig:CoppiAharonian}, left. The corresponding opacity of the Universe is illustrated in Fig. \\ref{fig:CoppiAharonian}, right. \n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.36\\textwidth]{irbsed_new4b.pdf}\n \\includegraphics[width=.49\\textwidth]{trasp2.png}\n\\caption{\\label{fig:CoppiAharonian}\nLeft:  Spectral energy distribution of the EBL as a function of the wavelength.  Open symbols correspond to lower limits from galaxy counts\nwhile filled symbols correspond to direct estimates.  The curves show a sample of different recent EBL models, as labeled. \nOn the upper axis  the TeV energy corresponding to the peak of the $\\gamma\\gamma$ cross section is plotted. From L. Costamante, IJMPD 22 (2013) 1330025.\n Right:\nCurves corresponding to the so-called gamma-ray horizon $\\tau(E,z)=1$ (lower) and to a survival probability of $e^{-\\tau(E,z)}$ = 1\\% (upper). \nAdapted from A. de Angelis, G. Galanti, M. Roncadelli, MNRAS  432 (2013) 3245.}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \\item The examination\nof the ultimate nature\nof matter and of physics  beyond the Standard Model, in particular  through searches  for dark matter, \nfor new particles in general in particular by the determination of the energy density of the vacuum, for the effects of quantum gravity. High-energy gamma astrophysics is sensitive to energy scales important\nfor particle physics, in particular  the 100 GeV scale expected for\ncold dark matter; the TeV scale, where supersymmetric particles\nmight appear; and finally, it might be possible to access indirectly   the unification scale and the Planck scale: an energy $\\sim  10^{19}$ GeV, corresponding to a mass\n$\\sqrt{\\hbar c/G}$. \n\\end{itemize}\n\nWe shall define in the following as high-energy (HE)  photons the photons above 30 MeV; as very-high-energy (VHE) the photons above 30 GeV.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA look to the sources of cosmic gamma-rays in the HE region shows a diffuse background, plus a set of localized emitters. Roughly 3000 HE emitters have been identified up to now, mostly by the Fermi-LAT, and some 200 of them are  VHE emitters as well (Fig. \\ref{fig:gammamap}). \n\n\nAbout half of the VHE gamma-ray emitters are objects in our Galaxy;   most of them can be associated to supernova remnants (SNR).\n The remaining half are extragalactic, and the space resolution of present detectors (slightly better than 0.1$^\\circ$) is not good enough to associate them with particular points in the host galaxies; we believe, however, that they are produced in the vicinity of supermassive black holes in the galaxies. The abundance of galactic objects can be explained by the fact that, being closer,  they suffer a smaller attenuation. \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=\\textwidth]{sources_jan16.png}\n\\end{center}\n\\caption\n{\\label{fig:gammamap}Sources of VHE emission plotted in galactic coordinates. \nThe background represents the high-energy gamma-rays detected by Fermi-LAT. The clear blue and pink regions correspond respectively to the visible regions within 30$^\\circ$ of the zenith from a detector at the tropic in the Northern hemisphere (approximately like MAGIC or VERITAS) and at the Southern hemisphere (approximately like H.E.S.S.).\nFrom http://tevcat.uchicago.edu/, January 2016.}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\nThe sky exhibits in particular transient events from steady emitters (``flares'') and burst of gamma-rays from previously dark regions (``gamma-ray bursts''). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{How to detect photons at different energies:  present and  near future}\n\n\n\n\n\nDue to the conversion probability in the atmosphere (whose thickness is about 28 radiation length at sea level) only satellite-based detectors can detect primary X/$\\gamma$-rays. Satellites are anyway small, being of about 1 m$^2$ their maximum dimensions \nbecause of the cost of space technology.\n If the energy of the primary particle is large enough, some of\nthe products of the shower generated by the interaction with the atmosphere, acting as a calorimeter, can reach ground-based detectors.  It is appropriate to build such detectors at high altitudes, where \natmospheric dimming is lower. The area sampled by ground-based detectors can be much larger than the typical areas of satellites. Since the fluxes of high-energy photons are low and decrease rapidly with increasing energy, \nTeV and PeV gammas can be detected only from the atmospheric showers they produce, i.e., by \nmeans of ground-based detectors.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Satellites}\n\n\nSatellite  gamma telescopes  can detect \nthe primary photons at energies lower than ground-based telescopes.\n\nMain figures of merit for a satellite-borne detector are its effective area (i.e., the product of the area \ntimes the detection efficiency), the energy resolution, the space or angular resolution \n(called as well point-spread function, or PSF).\n\n\nDetectors on satellites have a small effective area, of order of 1 m$^2$ maximum, which limits the sensitivity.\nThey have a large duty cycle,  and they \nsuffer a low rate of background events, since they can be coupled to anticoincidence systems rejecting the\ncharged cosmic rays. They have a large cost, dominated by the costs of launch and by the strong requirements of instruments which must be sent in space, with little or no possibility of intervention to fix possible bugs.\n\n\n\nThe Fermi satellite, in orbit since 2008, has an effective area of  about 1 m$^2$; its function is double, since it can also operate as a trigger for ground-based telescopes. \n\n\n\n\n\\subsection{Ground-based gamma detectors}\n\n\nGround-based VHE telescopes such as \n\nHAWC,\nH.E.S.S.\\index{H.E.S.S. telescope}, MAGIC\\index{MAGIC telescope} and VERITAS\\index{VERITAS telescope}, \ndetect the atmospheric showers produced by primary photons and cosmic rays of energy higher than \nthose observed by satellites.\n\n\nThe two kinds of detectors (on satellite and at ground) are complementary. At energies below 1 GeV or so, the showers generated by photons do not have the time to develop properly, and thus the only way to detect such photons below this energy is related to the use of satellites. Ground-based detectors have a huge effective area, so their sensitivity is high;\nthey detect a huge amount of background events, but they have low cost.\n\nThere are two main classes of ground based VHE gamma detectors: the EAS arrays \n and the Cherenkov telescopes.\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsubsection{EAS detectors}\n\n\nThe EAS detectors, such as  \nHAWC which is presently in operation, \nare large arrays of detectors sensitive to charged secondary particles generated in the atmospheric showers.\nThey have a high duty cycle and a large field-of-view, but a relatively low sensitivity.\nThe energy threshold of such detectors is rather large, in the order of a few hundred GeV -- a shower initiated by a 1 TeV photon typically \nhas its maximum 8 km a.s.l.\n\nThe principle of operation is the same as the one for the UHE cosmic rays detectors like Auger, i.e., \ndirect sampling of the charged particles in the shower. This can be achieved:\n\\begin{itemize} \n\\item\neither using a sparse array of scintillator-based detectors, Resistive-Plate Chambers (RPC), or water Cherenkov pools;\n\\item\nor by effective covering of the ground, to ensure efficient collection and hence lower the energy threshold.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\end{itemize}\nPossibly a combination of the techniques above can be used, with a central region more dense, to allow discrimination between hadron-generated and photon-generated showers, and a peripheral region.\n\nThe energy threshold of EAS detectors is at best in the 0.5 TeV - 1 TeV range, \nso they are built to detect UHE photons as well as the most energetic VHE gammas.\nAt such energies fluxes are small and large surfaces of order of~10$^4$~m$^2$ are required.\n\nConcerning the discrimination from the charged cosmic ray background,\nmuon detectors devoted to hadron rejection may be present. Otherwise, it is based on the reconstructed shower shape.\nThe direction of the detected primary particles is computed from the arrival times with an angular precision of about 1$^\\circ$. \nThe calibration can be performed by studying the shadow in the reconstructed directions caused by the Moon.\nEnergy resolution is poor.\n\nSomehow, the past generation EAS detectors were not sensitive enough and just detected a handful of sources. This lesson lead to a new EAS observatory with much larger sensitivity: the High Altitude Water Cherenkov detector HAWC, inaugurated in 2015.\n\n\n\n\n\n\n\nHAWC (Fig. \\ref{fig:hawc})\\index{HAWC observatory} is\na very high-energy gamma-ray observatory located in Mexico  at about 4100 m asl and latitude $19^{\\circ}\\,$N . \nIt consists of 300 steel tanks of $\\unit[7.3]{m}$ diameter and $\\unit[4.5]{m}$ deep,\ncovering an instrumented area of about $\\unit[22~000]{m^2}$. Each tank is filled with purified \nwater and  contains four \nPMT of 3.8 inch diameter and one high-quantum efficiency 10-inch PMT, which observe the Cherenkov light emitted in water by superluminal particles in\natmospheric air showers.\nPhotons traveling through the water typically undergo Compton scattering or produce an electron-positron pair,\nalso resulting in Cherenkov light emission. This is an advantage of the water Cherenkov technique,\nas photons constitute a large fraction of the electromagnetic component of an air shower at ground.\n\nHAWC improves the sensitivity for a Crab-like point spectrum by a factor of\n15 in comparison to MILAGRO. The sensitivity should be also such to possibly detect gamma-ray burst emissions at high energy.\n\n\\begin{figure} \n\\begin{center}\n\\includegraphics[width=.506\\textwidth]{hawc1.png}\n\\includegraphics[width=.37\\textwidth]{hawc2.png}\n\\end{center}\n\\caption{\\label{fig:hawc}\nLeft: the HAWC detector. Right: its possible extension.}\n\\end{figure}\n\n\n\n\n\n\\subsubsection{Cherenkov telescopes}\\index{Cherenkov!telescope}\n\n\nMost of the experimental results on VHE photons are presently due to\nImaging Atmospheric Cherenkov Telescopes\\index{Imaging Atmospheric Cherenkov Telescope (IACT)} \n(IACTs).\n\n\nIACTs such as the first successful cosmic detectors, called WHIPPLE\\index{WHIPPLE telescope}, and then the second generation instruments \nHEGRA\\index{HEGRA telescope} and CANGAROO\\index{CANGAROO telescope}, and presently the third generation H.E.S.S.\\index{H.E.S.S. telescope}, \nMAGIC\\index{MAGIC telescope} and \nVERITAS\\index{VERITAS telescope}, detect the Cherenkov photons produced in air by charged, locally superluminal \nparticles in atmospheric showers.\nFor reasons explained below, they have a low duty cycle (about 1000 to 1500 hours per year) and a small field-of-view (FoV), but they have a high \nsensitivity and a low energy threshold.\n\nWe refer to \\cite{ourbook} for the operation principles and for the performance and the main results of these detectors.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA simplified comparison of the characteristics of the Fermi LAT satellite detector, of the \nIACTs and of the EAS detectors (ground-based), is given in Table \\ref{tab:DetectorsComparison}.\nThe sensitivities of the above described high-energy detectors are shown in \nFig.  \\ref{fig:Sensitivities}.\n\n\\begin{table}\n\\begin{center}\n\\begin{tabular}{ | l | l | l | l | }\n                \\hline &&& \\[-.9em]\n{\\bf Quantity}        & {\\bf Fermi}       & {\\bf IACTs}          & {\\bf EAS}\n\\\\ \\hline  &&& \\[-.9em]\nEnergy range          & 20 MeV--200 GeV & 100 GeV--50 TeV    & 400 GeV--100 TeV\n\\\\         &&& \\[-.9em]\nEnergy res.     & 5-10\\%            & 15-20\\%        & $\\sim$ 50\\%\n\\\\         &&& \\[-.9em]\nDuty Cycle            & 80\\%              & 15\\%                 & $>$ 90\\%\n\\\\         &&& \\[-.9em]\nFoV                   & $4 \\pi / 5$       & 5$^\\circ$ $\\times$ 5$^\\circ$ & $4 \\pi / 6$\n\\\\         &&& \\[-.9em]\nPSF       & 0.1$^\\circ$           & 0.07$^\\circ$             & 0.5$^\\circ$\n\\\\         &&& \\[-.9em]\nSensitivity  & 1\\% Crab (1 GeV)  & 1\\% Crab (0.5 TeV)   & 0.5 Crab (5 TeV)\n\\\\        \\hline\n\\end{tabular}\n\\end{center}\n\\caption{\\label{tab:DetectorsComparison}\nA comparison of the characteristics of Fermi, the IACTs and of the EAS particle detector \narrays. Sensitivity computed over one year for Fermi and the EAS, and over 50 hours for the IACTs. \n}\n\n\n\n\\end{table}\n\n\n\\begin{figure} \n\\centering\n\\includegraphics[width=.9\\textwidth]{sensitivity.pdf}\n\\caption{\\label{fig:Sensitivities}\nSensitivities of some present and future HE gamma detectors, measured as \nthe minimum intensity source detectable at 5\\,$\\sigma$.\nThe performance for EAS and satellite detector is based on one year of data taking; for Cherenkov \ntelescopes it is based on 50 hours of data. From \\cite{ourbook}.}\n\\end{figure}\n\nThe construction of the next generation IACT, called the Cherenkov Telescope Array (CTA), has already started.\n\n\\subsection{The near future of VHE astrophysics with Cherenkov telescopes: CTA}\n\n The CTA \\cite{CTA} is a future instrument for VHE\n  gamma astrophysics that is expected to provide\n  an order of magnitude improvement in sensitivity over existing instruments (Fig. \\ref{fig:Sensitivities}).\n  \n  \nCTA is a robust collaboration, including more than 1000 scientists from all around the world, and large part of its funding (above 200 MEUR)  is granted. \nCTA is included in the 2008 roadmap of the European Strategy Forum on Research Infrastructures (ESFRI). It is one of the ``Magnificent Seven''\nexperiments  of the European strategy for astroparticle physics published by ASPERA, and highly ranked in the strategic plan for European astronomy of ASTRONET. In addition CTA is a recommended project for the next decade in the US National Academies of Sciences Decadal Review.\n\n  \n  An array of tens of telescopes will detect gamma-ray induced showers over a large area on the ground, \nincreasing the efficiency and the sensitivity, while providing a much larger number of views of each cascade. \nThis will result in both improved angular resolution and better suppression of charged cosmic-ray background events.\n \nIn the present design scenario, CTA will be deployed in two sites. \nThe southern hemisphere array, possibly in Paranal, will consist of three types of telescopes with different mirror sizes, in order to cover \nthe full energy range. In the northern hemisphere array, possibly in the Canary island of La Palma, the two larger telescope types would be deployed.\n \\begin{itemize}\n\\item The low energy (the goal is to detect showers starting from an energy of 20 GeV)  instrumentation will consist of  four 23 meter telescopes with a  FoV of about 4-5 degrees.\n\\item The medium energy range, from around 100 GeV to 1 TeV, will be covered by some 15-25 telescopes of the 12 meter class with a FoV of 6-8 degrees. An alternative design uses smaller reflectors (abot 9 m) with a secondary optics (Schwarzschild-Couder design, \\cite{vladi}).\n\\item The high energy instruments, operating above 10 TeV, will consist of a large number (of the order of 50) of small (4-6 meter diameter) telescopes with a FoV of around 10 degrees. Also in this case single-reflector designs are in competition with Schwarzschild-Couder design.\n\\end{itemize}\nPrototyping is advanced for all these telescopes, but there is still room for technical improvement (SiPM in particular).\n\nThe southern CTA will cover about three square kilometers of land with around 60 telescopes that will monitor all the energy ranges in the center of the Milky Way's galactic plane. The northern CTA will cover one square kilometer and be composed of some 20 telescopes. These telescopes will be mostly targeted at extragalactic astronomy.\n\nThe telescopes of different sizes will be disposed in concentrical circles, the largest in the center (Fig. \\ref{fig:cta}). Different modes of operation will be possible: deep field observation; pointing mode; scanning mode.\n\nCTA is expected to surpass in performance the present IACTs around 2020.\n\n\\begin{figure} \n\\begin{center}\n\\includegraphics[width=.60\\textwidth]{layoutcta.png}\n\\includegraphics[width=.37\\textwidth]{lst.png}\n\\end{center}\n\\caption{\\label{fig:cta}\nLeft: possible layout of the CTA. Right: project of the large-size telescope (LST). Credit: CTA Collaboration.}\n\\end{figure}\n\n\\subsection{The near future of EAS detectors} \n\nThere is a lot of activity on the development of EAS detector, since they are relatively cheap (of the order of 30 MEUR) and we know now what is the correct size for the detection of a relevant number of sources.\n\n\\subsubsection{HAWC+}\n\nAn upgrade of the HAWC high-energy gamma-ray observatory with a sparse array of small\noutrigger tanks is being investigated \\cite{hawcp}. For showers where the core falls outside the array there are\nambiguities in the reconstruction between the core position, the shower angle and the shower size\nor energy. An outrigger array can determine the core position for showers falling outside the main\narray elevating the ambiguities and making these showers well reconstructable.  A gain of 3-4 in\nsensitivity for gammas above 10 TeV can be obtained over what is presently achieved, and such a detector can be built in 2-3 years. Funds are already available.\n\n\n\\subsubsection{LHAASO}\n\n\nLHAASO (Large High Altitude Air Shower Observatory) is planned to  be located at about 4400 m asl and latitude $30^{\\circ}\\,$N in the Daochen site,  China.\nIt will consist of the following major components \\cite{lhaaso,pino}:\n\\begin{itemize}\n\\item 1 km$^2$ array (LHAASO-KM2A), including 5600 scintillator detectors, with 15 m spacing, for electromagnetic particle detection.\n\\item An overlapping 1 km$^2$ array of 1200, 36 m$^2$ underground water Cherenkov tanks, with 30 m spacing, for muon detection (total sensitive area 40,000 m$^2$).\n\\item A close-packed, surface water Cherenkov detector facility with a total area of 90,000 m$^2$ (LHAASO-WCDA), four times that of HAWC.\n\\item 24 wide field-of-view air Cherenkov (and fluorescence) telescopes (LHAASO-WFCTA).\n\\item 452 close-packed burst detectors, located near the center of the array, for detection of high energy secondary particles in the shower core region (LHAASO-SCDA).\n\\end{itemize}\n\n\n\n\nA configuration corresponding to 25\\% of the final detector might be ready by 2019 - 2020. It is crucial that the completion of the first 25\\% of the detector (nominally foreseen for 2018) is not too much delayed with respect to the extension of HAWC, otherwise most of its scientific impact might be scooped.\n\n\n\\subsubsection{HiSCORE}\n\nHiSCORE (Hundred*i Square-km Cosmic ORigin Explorer),\nlocated in the Tunka Valley near Lake Baikal at about 3200 m asl and latitude $51^{\\circ}\\,$N,  will consist of an array of wide-angle ($\\Omega\\sim$ 0.6-0.85 sr) light-sensitive detector stations, distributed over an area of the order of 100 km$^2$. A HiSCORE detector station consists of four photomultiplier tubes, each equipped with a light-collecting Winston cone of 30$^{\\circ}$ half-opening angle  \\cite{hiscore}. \n\nThe primary goal of this non-imaging Cherenkov detector is gamma-ray astronomy in the 10 TeV to several PeV range. A prototype array of 9 wide-angle optical stations, spread on a 300$\\times$300 m$^2$ area, has been deployed since October 2013, and technical tests are underway. \nA 1 km$^2$ engineering array has been deployed and is in commissioning.\n\nThe sensitivity of the HiSCORE standard configuration to point-sources is shown in Fig. \\ref{fig:lhaaso_sens}. The curve has been calculated for 1000 h of exposure time, corresponding to  roughly 1.4 years of serendipitous mode operation (see \\cite{hiscore} for details).\n\n\\begin{figure}\n  \\centerline{\\includegraphics[width=0.5\\textwidth]{DiSciascio_RICAP14_fig01.pdf}}\n    \\caption{Sensitivity of ground-based $\\gamma$-ray detectors to a Crab-like point source, not considering the attenuation \n    of the source at large energies (from \\cite{pino}).}\n\\label{fig:lhaaso_sens}\n\\end{figure}\n\nHiSCORE will be possibly  incorporated in TAIGA (Tunka Advanced Instrument for cosmic ray physics and Gamma Astronomy), a  hybrid detector system\nincluding  in particular IACTs for sensitivity to photons of lower energies.\n\n\n\\subsubsection{Possible EAS experiments in the Southern hemisphere}\n\nSeveral proposals are being formulated now for a EAS detector at South, which would be the key to study the VHE emission from the Galaxy. HAWC has demonstrated that present EAS technology can be competitive with the technology of large-area coverage by small Cherenkov telescopes.\n\nIn particular among the proposals are:\n\\begin{itemize}\n\\item a Southern site for HAWC, HAWC-South, to be located in the Atacama desert \\cite{hawcs};\n\\item LATTES, a hybrid water Cherenkov-RPC detector to be located in Southern America \\cite{lattes}.\n\\end{itemize}\n\n\\section{A view in a longer term}\n\nLet us analyze the possible future of gamma-ray astrophysics in, say, 15 years from now.\n\n\nGamma rays can be divided in  5 different energy regions, subjectively\nchosen\nfrom\nthe\nrequirements\nof\ndetection\ntechniques\nand of main scientific issues.\nThese energy regions are:\n\n(a) {Till a few ($\\sim$30) MeV;}\n(b) {GeV: from 30 MeV to 30 GeV:}\n(c) {Sub-TeV: from 30 GeV to 300 GeV;}\n(d) {TeV: from 300 GeV to 30 TeV;}\n(e) {PeV: from 30 TeV to a few PeV.}\n\n\n\n\n\\subsection{The region till a few MeV}\n\nThis region has important implications on the science at the TeV and above, since a good knowledge of the spectra in the MeV\nregion can constrain the fit to the emitted spectra at high energies, thus allowing:\n\\begin{itemize}\n\\item to evidence additional contributions from new physics (dark matter in particular);\n\\item to estimate cosmological absorption (due to EBL or to possible interactions with axion-like fields \\cite{darma}).\n\\end{itemize}\n\nOn top of this, The 0.3-30 MeV energy range is important per se, but experimentally difficult to study. It requires an efficient instrument working in the Compton regime with an excellent background subtraction, and possibly with sensitivity to the measurement of polarization.\nSince COMPTEL, which operated two decades ago, no space instrument obtained extra-solar gamma-ray data in the few MeV range; now\nwe are able to build an instrument one-two orders of magnitudes more sensitive than COMTEL based on Silicon technology, state-of-the-art analog readout, and efficient data acquisition. \n\nSeveral proposals (ASTROGAM \\cite{astrogam}, COMPAIR \\cite{compair}, ...) have been made, and convergence is likely for an experiment to be launched around 2025.\n\n\n\n\n\n\n\\subsection{The GeV region}\n\nIt is difficult to think for this century of an instrument for GeV photons improving substantially the performance of the Fermi LAT: the cost of space missions is such that the size of Fermi cannot be reasonably overcome with present technologies. New satellites in construction (like the Russian-Italian mission \nGAMMA400 \\cite{gamma400} and the Chinese mission HERD \\cite{herd}\\index{DAMPE mission})  improve some of the aspects of Fermi, e.g., calorimetry. For sure a satellite in the GeV region with sensitivity comparable with Fermi will be needed.\n\n\n\\subsection{The sub-TeV and TeV regions}\n\nCTA appears to have no rivals for the gamma astrophysics in the \nSub-TeV  and TeV (from a few GeV to a few TeV) energy regions. These are crucial regions for fundamental physics, and for astronomy; they\ninclude also the region where sensitivity is maximum.\n\nCTA will be probably upgraded including state-of-the art photon detection devices of higher efficiencies with respect to the present ones.\n\nThere is some room for new concepts of Cherenkov telescopes, in particular:\n\\begin{itemize}\n\\item a possible array of 4 or 5 very large detectors at 5000 m in order to boost the sensitivity around in the sub-TeV region (in particular from 20 GeV to 100 GeV) \\cite{fiveatfive}. This would boost the science potential in particular in sectors related to fundamental physics (dark matter, photon propagation from far sources);\n\\item a large-FoV detector to guarantee good coverage of the sky in the TeV region \\cite{machete}.\n\\end{itemize}\n\n\n\n\n\n\n\n\\subsection{The PeV region}\n Due to the opacity of the Universe to gamma rays, less than a handful of  sources could be visible in the Northern sky, and less than a dozen in the Southern sky, all galactic. The experiments in the Northern hemisphere (HAWC with its likely extension to HAWC+, LHAASO, TAIGA/HiSCORE if the extension up to 10 km$^2$ will be funded) provide an appropriate coverage of the Northern sky. \n \nThe situation in the Southern hemisphere  has room for improvement.   An EAS detector in the South might give substantial input with respect to the knowledge of the gamma sky, and of possible Pevatrons in the Galaxy, and outperform in this sense the SSTs of CTA. Several proposals are being formulated now, and they should join. A large detector in Southern America could compete in sensitivity with the small-size telescopes of CTA-South already at 100 TeV, offering in addition a serendipitous approach.\n\n\n\n\n\n\\begin{thebibliography}{}\n\n\n\\bibitem{ourbook} A. De Angelis and M. Pimenta, \\textit{Introduction to particle and astroparticle physics} (Springer, Heidelberg, 2015).\n\n\n\\bibitem{CTA} https://www.cta-observatory.org/\n\\bibitem{vladi} V. Vassiliev et al., Astrop. Phys.  {\\bf{28}} 10 (2007).\n\\bibitem{hawcp} A. Sandoval for the HAWC Collaboration,  arXiv:1509.04269, Presented ICRC2015, The Hague, The Netherlands.\n\\bibitem{lhaaso} M. Zha et al., Int. J. Mod. Phys.  \\textbf{10} 147 (2012) \n\\bibitem{pino} G. Di Sciascio, arXiv:1503.05512, presented at RICAP 2014, Noto, Italy.\n\\bibitem{hiscore} M. Tluczykont  et al., Astrop. Phys. \\textbf{56} 42 (2014).\n\\bibitem{hawcs} Michael DuVernois for the HAWC Collaboration, PoS(ICRC2015)967, Presented at ICRC2015, The Hague, The Netherlands.\n\\bibitem{lattes} G. Matthiae, AIP Conf.Proc. 1693 (2015) 060007  and Proc. MG14, http://w2srvg9.icra.it/upload/archivio/HE1-938MA857IO.pdf.\n\n\\bibitem{darma} A. De Angelis, M. Roncadelli and O. Mansutti, Phys. Rev. \\textbf{D 76} 121301 (2007).\n\\bibitem{astrogam} http://astrogam.iaps.inaf.it/\n\\bibitem{compair} A. Moiseev et al., arXiv:1508.07349\n\\bibitem{gamma400} http://gamma400.lebedev.ru/indexeng.html\n\\bibitem{herd} http://herd.ihep.ac.cn/\n\n\\bibitem{fiveatfive} F. Aharonian et al., arXiv:astro-ph/0006163.\n\\bibitem{machete} J. Cortina et al., http://arxiv.org/abs/1507.02532.\n\\end{thebibliography}\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 2740, "prevtext": "\n\n\n\n\\title{(Very)-High-Energy Gamma-Ray Astrophysics: the Future}\n\n\n\n\n\n\\author{Alessandro De Angelis\\inst{1}\\fnsep\\thanks{\\email{alessandro.deangelis@pd.infn.it}}}\n        \n\n\n\\institute{INFN Padova, via Marzolo 8, I-35141 Padova (Italy); LIP/IST, Av. Elias Garcia 14, 1000 Lisboa (Portugal)\n          }\n\n\\abstract{\nSeveral projects planned or proposed can significantly expand our\nknowledge of the high-energy Universe in gamma rays. Construction of the Cherenkov\ntelescope array CTA is started, and other detectors\nare planned which will use the reconstruction of extensive air\nshowers. This report explores the near future, and possible evolutions   in a longer term.\n\n}\n\n\\maketitle\n\n\n\n\n\n\\section{Introduction}\n\nAmong cosmic rays, photons are particularly important. Being neutral they can travel\nlong distances without being deflected by galactic and extragalactic magnetic fields,\nhence they allow us to directly study their emission sources. The gamma emission is also related to the emission of charged cosmic rays, and to the emission of neutrinos. Finally, gamma-rays can be the signature of new physics at fundamental scales, new particles in particular.  These facts have \npushed the scientific community during the last years  to study  high-energy gamma rays; many new results have been obtained since the beginning of the millennium, in particular thanks to the imaging atmospheric Cherenkov telescopes (IACTs) H.E.S.S., MAGIC and VERITAS. See \\cite{ourbook} for a summary of the main achievements.\n\nStill many problems are however open, in particular:\n\\begin{itemize}\n\\item The study of the origin of cosmic rays. Thanks to the first generation of  IACTs and to the AGILE and Fermi satellites, it is well established nowadays that supernova remnants (SNRs) can accelerate cosmic rays up to some 100 TeV. The mechanism of acceleration of particles up to the PeV is still to be established. Above some PeV, it is common belief that the acceleration sites should be extragalactic, but the mechanism, possibly related to the behavior of matter near supermassive black holes (SMBH), is still to be understood. \n\\item The\nstudy of the \n propagation of extragalactic gamma rays, which is a probe of cosmology and of the interaction of gamma rays with the cosmic background. \n \n Once produced,  photons must travel towards the observer. Electron-positron $(e^-e^+)$ pair production in the interaction of VHE photons off extragalactic background photons is the main source of opacity of the Universe to $\\gamma$-rays whenever the corresponding photon mean free path is of the order of the source distance, or smaller.\nThe cross-section is maximized ($\\sigma_{max} \\simeq 1.7 \\times 10^{-25}$ cm$^2$) for background photons of energy:\n \n", "index": 1, "text": "\\begin{equation} \n \\label{eq.sez.urto-1}\n\\epsilon (E) \\simeq \\left(\\frac{900 \\, {\\rm GeV}}{E} \\right) \\, {\\rm eV}~.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\epsilon(E)\\simeq\\left(\\frac{900\\,{\\rm GeV}}{E}\\right)\\,{\\rm eV}~{}.\" display=\"block\"><mrow><mrow><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≃</mo><mrow><mrow><mo>(</mo><mfrac><mrow><mpadded width=\"+1.7pt\"><mn>900</mn></mpadded><mo>⁢</mo><mi>GeV</mi></mrow><mi>E</mi></mfrac><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+3.3pt\"><mi>eV</mi></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]