[{"file": "1601.05731.tex", "nexttext": "\n\nThe comparison of the potentials yields that the relation between the two temperature scales\n\n\n", "itemtype": "equation", "pos": 17969, "prevtext": "\n\n\\title[PQM model at non-vanishing density with the unquenched Polyakov-loop potential]{Phase diagram and nucleation in the Polyakov-loop-extended Quark-Meson truncation of QCD with the unquenched Polyakov-loop potential}\n\n\\author{Rainer Stiele}\n\\address{Institut de Physique Nucl\\'eaire de Lyon, CNRS/IN2P3, Universit\\'e Claude Bernard Lyon 1, 69622 Villeurbanne Cedex, France}\n\\address{Institut f\\\"{u}r Theoretische Physik, Goethe-Universit\\\"at Frankfurt, Max-von-Laue-Stra\\ss e 1, 60438 Frankfurt am Main, Germany}\n\\eads{\\mailto{r.stiele@ipnl.in2p3.fr}}\n\n\\author{J\\\"urgen Schaffner-Bielich}\n\\address{Institut f\\\"{u}r Theoretische Physik, Goethe-Universit\\\"at Frankfurt, Max-von-Laue-Stra\\ss e 1, 60438 Frankfurt am Main, Germany}\n\\eads{\\mailto{schaffner@astro.uni-frankfurt.de}}\n\n\n\\maketitle\n\n\n\\begin{abstract}\n\tUnquenching of the Polyakov-loop potential showed to be an important improvement for the description of the phase structure and thermodynamics of strongly-interacting matter at zero quark chemical potentials with Polyakov-loop extended chiral models.\n\tThis work constitutes the first application of the quark backreaction on the Polyakov-loop potential at nonzero density. The observation is that it links the chiral and deconfinement phase transition also at small temperatures and large quark chemical potentials.\n\tThe build up of the surface tension in the Polyakov-loop extended Quark-Meson model is explored by investigating the two and 2+1--flavour Quark-Meson model and analysing the impact of the Polyakov-loop extension. In general, the order of magnitude of the surface tension is given by the chiral phase transition. The coupling of the chiral and deconfinement transition with the unquenched Polyakov-loop potential leads to the fact that the Polyakov-loop contributes at all temperatures.\n\\end{abstract}\n\n\n\n\\section{Introduction}\\label{sec:Intro}\n\n\nThe extended mean-field version of the Polyakov-loop extended Quark-Meson model and the no-sea approximation of the Polyakov-Nambu-Jona-Lasinio model showed to be capable to reproduce the crossover at vanishing densities of the strong interaction as seen in lattice calculations.\nThe important ingredients  to achieve this agreement proved to be the enhancement of the Polyakov-loop potential from a pure gauge potential to the unquenched glue potential that includes back reaction effects from quarks and including thermal fluctuations of mesons \\cite{Haas:2013qwp,Herbst:2013ufa,Torres-Rincon:2016ahl}. The lattice data were used to adjusted the free parameters, that are the critical scale of the Polyakov-loop potential and the mass of the $\\sigma$-meson. In {Ref.~\\cite{{Stiele:2013pma}}} we have applied this framework to investigate the phase structure at non-vanishing isospin before the onset of pion condensation. The present work presents the first application of the unquenched Polyakov-loop potential at nonzero net quark density and explores its applicability\\footnote{During finalising this manuscript a similar application appeared in arXiv \\cite{Kovacs:2016juc}.}. The observation is that it links the chiral and deconfinement phase transition also at small temperatures and large quark chemical potentials. This is a feature that is also seen in the functional renormailzation group improvement of the PQM model when using the Yang-Mills Polyakov-loop potential \\cite{Herbst:2010rf,Herbst:2013ail}. Therefore, the further investigation is interesting even mesonic fluctuations still have to be implemented to the equations of motion in a next step. For now results within the extended mean-field version including thermal fluctuations of mesons to thermodynamics will be presented.\nThe effect of unquenching the Polyakov-loop potential is a shift of a hypothetical critical endpoint towards smaller temperatures at similar chemical potential. Furthermore, there's a minor decrease in size of the spinodal region.\nMoreover, we discuss the build up of the surface tension in the PQM model by investigation of the two and 2+1--flavour QM model and analysing the impact of the Polyakov-loop extension. In general, the order of magnitude of the surface tension is given by the chiral phase transition. The coupling of the chiral and deconfinement transition with the unquenched Polyakov-loop potential leads to the fact that the Polyakov-loop contributes at all temperatures.\n\nIn the next section the theoretical framework that is used is explained. {Sec.~\\ref{{sec:Resultsmu0}}} summarises the results at vanishing quark chemical potentials before exploring the impact of unquenching the Polyakov-loop potential on the phase structure at nonzero quark chemical potentials in {Sec.~\\ref{{sec:ResultsMuQ}}}.\nThe build up of the surface tension in the QM framework and the impact of the Polyakov-loop extension are discussed in {Sec.~\\ref{{sec:Nucleation}}}.\nFinally, the findings are summarised in {Sec.~\\ref{{sec:Conclusions}}}.\n\n\n\n\\section{Theoretical framework}\\label{sec:Framework}\n\n\nWe perform our investigation within the 2+1-flavour extended mean-field Polyakov-loop extended Quark-Meson model enhanced by the meson contributions to thermodynamics and with a unquenched Polyakov-loop potential.\nThis framework describes two important properties of QCD that are chiral symmetry and centre symmetry.\nWhile spontaneous breaking of the former gives rise to constituent quark masses, spontaneous breaking of center symmetry indicates deconfinement.\nThese properties are described by the effective Lagrangian\n\n\\begin{eqnarray}\n\t{\\mathcal{{L}}} &=& \\bar{q} \\left({i\\slashed{D} - g \\,\\phi_5 + \\gamma_0 \\,\\mu_f}\\right) q + \\Tr\\left({{\\partial}_\\mu \\phi^\\dagger \\,{\\partial}^\\mu\\phi}\\right) -\\nonumber\\\\\n\t&&- \\,m^2\\, \\Tr \\left({\\phi^\\dagger\\phi}\\right) - \\lambda_1 \\left[ \\Tr\\left({\\phi^\\dagger\\phi}\\right) \\right]^2 - \\lambda_2\\, \\Tr \\left({\\phi^\\dagger\\phi}\\right)^2 + \\nonumber\\\\\n\t&&+\\, c \\left({\\det\\phi + \\det\\phi^\\dagger}\\right) + \\Tr \\left[ H \\left({\\phi + \\phi^\\dagger}\\right) \\right] - \\nonumber\\\\\n\t&& -\\, {\\mathcal{{U}}}\\! \\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}}}\\right)\\;,\n\t\\label{eq:Lagrangian}\n\\end{eqnarray}\n\nwhere $\\phi$ and $\\phi_5$ are 3$\\times$3 matrices that combine scalar and pseudoscalar meson fields \\cite{Lenaghan:2000ey} and ${\\mathcal{{U}}}$ is the potential of the Polyakov loop $\\Phi$ \\cite{Meisinger:1995ih,Pisarski:2000eq,Scavenius:2002ru,Mocsy:2003qw,Fukushima:2003fw,Megias:2004hj,Ratti:2005jh}, which is the trace of a Wilson loop in temporal direction over the temporal component of the gauge field $A_\\mu$ and as such in general a complex scalar field $\\Phi = {\\Phi_{\\mathrm{{r}}}} + {\\mrm{i}} {\\Phi_{\\mathrm{{i}}}}$ \\cite{Polyakov:1978vu}.\n\nThe corresponding partition function is a path integral over all occurring fields of the in-medium effective action. In a mean-field analysis, the field is replaced by its spatially and temporally constant background such that the path integral turns into an ordinary integral over that field.\nFurthermore, the integral is trivially restricted to that mean-field that contributes the most to the partition function so which minimises the effective action or potential.\nThis is how the meson fields and gauge field are treated. Substituting these fields by their expectation values their derivative terms in the Lagrangian {(\\ref{{eq:Lagrangian}})} vanish.\nThe remaining integration over the fermions can be performed following the standard derivation \\cite{Kapusta:2006pm} as Gaussian integral over Grassmann fields followed by applying the Matsubara formalism.\nThe expression of the grand-canonical potential then takes the form\n\n\\begin{eqnarray}\n\t\\hskip-10ex \\Omega\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}},{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};\\,T,\\mu_f}\\right) &=& U\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}}}\\right) + {\\mathcal{{U}}}\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};\\,T}\\right) + \\Omega_{\\mathrm{{q\\bar{q}}}}\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}},{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};\\,T, \\mu_f}\\right) \\;. \\qquad\n\t\\label{eq:grand_canon_pot}\n\\end{eqnarray}\n\nIt is a function of the order parameters for center symmetry and for chiral symmetry in the light and strange quark sector and depends on the temperature and the quark chemical potentials.\n\nThe self-interaction potential of the meson fields $U\\!\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}}}\\right)$ is that of the isospin-symmetric linear sigma model \\cite{Lenaghan:2000ey}.\nIt describes spontaneous and explicit breaking of chiral symmetry in the light and strange quark sector. For an extension that distinguishes between up and down quark condensates at non-zero isospin, see e.g.~{Ref.~\\cite{{Stiele:2013pma}}}. We use it in the form and with the phenomenological input as in our previous work in {Refs.~\\cite{{Mintz:2012mz,Haas:2013qwp,Stiele:2013pma,Beisitzer:2014kea,Zacchi:2015lwa}}}.\n\nThe fluctuation contribution of quarks and anti-quarks $\\Omega_{\\mathrm{{q\\bar{q}}}}\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}},{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};\\,T, \\mu_f}\\right)$, which comes from the fermionic determinant, includes the coupling to and between the Polyakov-loop variable and meson fields. It consists of two terms. \nOne contribution, $\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{vac}}}\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}}}\\right)$, results from the negative energy states of the Dirac sea and is ultraviolet divergent. In the standard, no-sea mean-field approximation it is neglected saying that it can be absorbed in the renormalisation of the vacuum since it has no explicit dependence on temperature and quark chemical potentials \\cite{Scavenius:2000qd}.\nHowever, it is implicitly medium-dependent via the quark condensates and can be normalised, e.g.~in the dimensional regularisation scheme yielding a logarithmic correction \\cite{Skokov:2010sf} that is taken into account in the extended mean-field analysis \\cite{Gupta:2011ez,Chatterjee:2011jd,Schaefer:2011ex}.\nThis term contributes besides the mesonic potential $U\\!\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}}}\\right)$ to the vacuum properties and has to be considered in the adjustment of the parameters of the mesonic potential to the physical meson masses and decay constants in the vacuum, so at $T=\\mu_f=0$. The dependence of $\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{vac}}}\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}}}\\right)$ on its regularisation scale cancels neatly with that of these parameters as is shown in detail in {Ref.~\\cite{{Chatterjee:2011jd}}}.\\\\\nThe remaining part to $\\Omega_{\\mathrm{{q\\bar{q}}}}$ is the kinetic quark-antiquark contribution $\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{th}}}\\left({{\\sigma_{\\mathrm{{l}}}},{\\sigma_{\\mathrm{{\\!s}}}},{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};\\,T, \\mu_f}\\right)$ that depends on the thermodynamic variables.\nAt non-vanishing quark chemical potential it contributes an imaginary part to the effective potential, $\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{th}}} = \\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{R}}} + {\\mrm{i}}\\,\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{I}}}$. This is the manifestation of the fermion sign problem in the Polyakov-loop extensions of the Quark-Meson model and NJL model \\cite{Fukushima:2006uv,Rossner:2007ik,Mintz:2012mz}.\nThe common approach to circumvent this sign problem is to redefine the Polyakov-loop $\\Phi$ and its complex conjugate ${\\bar{\\Phi}}$ as two independent, real variables, see e.g.~{Ref.~\\cite{{Ratti:2005jh}}}. But by this approach, the state of thermodynamical equilibrium is identified only with a saddle-point but not with a minimum of the effective potential. But only with equilibrium states described by minima of the effective potential one can calculate quasi-equilibrium properties of the system, such as the surface tension and nucleation rate in a first-order phase transition as we want to do here. \nAs we have shown in {Ref.~\\cite{{Mintz:2012mz}}} in accordance with {Ref.~\\cite{{Rossner:2007ik}}} another way to avoid the sign problem is to neglect the imaginary part of the effective potential as a lowest order perturbative approximation \\cite{Rossner:2007ik,Mintz:2012mz}. Dropping the complex part of the effective potential implies that the imaginary part of the Polyakov-loop ${\\Phi_{\\mathrm{{i}}}}$ is zero but this approach has the advantage that the state of equilibrium is a minimum of the effective potential.\n\nThe potential of the Polyakov loop, ${\\mathcal{{U}}}\\!\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};T}\\right)$ should mimic a background of gluons and controls the dynamics of the Polyakov loop.\nA common, simple way to obtain an effective Polyakov-loop potential is to construct a potential that respects all given symmetries and contains the spontaneous breaking of Z(3) symmetry if the system is in the deconfined phase \\cite{Svetitsky:1982gs,Svetitsky:1985ye,Banks:1983me}.\nA polynomial forms in this sense the minimal content of a Polyakov-loop potential \\cite{Pisarski:2000eq,Ratti:2005jh}.\nThe ansatz for the Polyakov-loop potential can be enhanced by including the term that arrises if one integrates out the SU(3) group volume in the generating functional for the Euclidean action. This integration can be performed via the so-called Haar measure and takes the form of a Jacobian determinant. Its logarithm adds as an effective potential to the action in the generating functional \\cite{Fukushima:2003fw,Roessner:2006xn}. Reference \\cite{Lo:2013hla} went beyond a minimal content for the Polyakov-loop potential and kept the higher order terms of the polynomial parametrisation of the Polyakov-loop potential and added the logarithmic term to consider the group volume additionally.\nOn the parameters of the parametrisations some general constraints can be imposed, especially by applying and restricting the Polyakov-loop potential to pure gauge (Yang-Mills) theory.\nThe remaining open parameters are determined in {Refs.~\\cite{{Scavenius:2002ru,Ratti:2005jh,Roessner:2006xn,Lo:2013hla}}} by fitting both the lattice data for pressure, entropy density and energy density and the evolution of the Polyakov loop $\\langle \\Phi \\rangle$ on the lattice in pure gauge theory. Reference~\\cite{Lo:2013hla} adjusted their parameters in addition to lattice data of the longitudinal and transverse Polyakov-loop susceptibilities.\nThe different parametrisations that we apply are summarised to gather with their parameter sets in \\ref{app:PloopPots} within a more detailed discussion of the Polyakov-loop potential.\\\\\nThis construction of the Polyakov-loop potential and the fitting of its parameters entails that it models the pure gauge potential ${\\mathcal{{U}}}_{\\mathrm{{YM}}}\\left({t_{\\mathrm{{YM}}}}\\right)/T^4$. The transition scale of the Polyakov-loop potential is accordingly the critical temperature of pure gauge theory, $T_0^{\\mathrm{{YM}}}=270\\,{\\mathrm{{MeV}}}$.\nHowever, in full dynamical QCD, one important effect of fermionic matter fields is to change the scale $\\Lambda_{\\mathrm{{QCD}}}$ to which the transition temperature of the Polyakov-loop potential is linked to.\nTo consider this aspect of the backreaction of quarks to the gauge sector, {Ref.~\\cite{{Schaefer:2007pw}}} estimated the running coupling of QCD by consistency with hard thermal loop perturbation theory calculations \\cite{Braun:2005uj,Braun:2006jd} and they mapped the effect to an $N_f$-dependent modification of the expansion coefficients of the Polyakov-loop potential. Their result is a $N_f$-dependent decrease of $T_0$.\nThis accounts partially for the unquenching of the pure gauge Polyakov-loop potential to an effective glue potential in QCD.\nBesides the flavour dependency of the transition scale of the glue sector, one can consider its dependence on the quark density. Such a dependency has to be expected in view of a $\\mu_{\\mathrm{{q}}}$-dependent colour screening effect due to quarks. In {Ref.~\\cite{{Schaefer:2007pw}}} a $\\mu_{\\mathrm{{q}}}$-dependent small correction to the running coupling was motivated by using HTL/HDL theory and by comparison to the one found in FRG calculations \\cite{Braun:2009gm}. The description presented in {Refs.~\\cite{{Schaefer:2007pw,Herbst:2013ail}}} can be generalised to allow for different chemical potentials for each quark flavour \\cite{Stiele:2013pma}.\n\nStill, the Polyakov-loop potential is an approximation to the Yang-Mills glue potential. However, in Polyakov-loop extended models for (full) QCD, this Polyakov-loop potential has to be replaced by the QCD glue potential that takes into account the back reaction of quarks into the Polyakov-loop effective potential.\nUsing the functional renormalisation group (FRG) approach, {Refs.~\\cite{{Braun:2007bx,Braun:2010cy,Fister:2013bh}}} calculated the non-perturbative Polyakov-loop potential of pure gauge theory and {Refs.~\\cite{{Braun:2009gm,Pawlowski:2010ht}}} the QCD analogue taking into account the backreaction of the quark degrees of freedom on the gluon propagators. The latter includes the quark part of the gluonic vacuum polarisation but does not include the fermionic part of the full QCD potential.\nAs we discussed in detail in {Ref.~\\cite{{Haas:2013qwp}}} one observes for a given nonzero reduced temperature that the shape of the potentials is very similar but that there is a shift between both potentials.\nThis observation can be exploited to estimate how to convert the Yang-Mills potential for the Polyakov loop to a glue potential in full QCD that contains back reaction effects from quarks,\n\n\\begin{eqnarray}\n\t\\frac{{\\mathcal{{U_{\\mathrm{{glue}}}}}}}{T^4} \\left({\\Phi,{\\bar{\\Phi}},t_{\\mathrm{{glue}}}}\\right) &=& \\frac{{\\mathcal{{U_{\\mathrm{{YM}}}}}}}{T_{\\mathrm{{YM}}}^4}\\left({\\Phi,{\\bar{\\Phi}},t_{\\mathrm{{YM}}}(t_{\\rm glue})}\\right) \\;,\n\t\\label{eq:gluePotYMPot}\n\\end{eqnarray}\n\nby relating the reduced temperature scales of both potentials\n\n\n", "index": 1, "text": "\\begin{equation}\n\tt_{{\\mathrm{{glue}}}}=\\frac{T-T^{\\mathrm{{glue}}}_{\\mathrm{{cr}}}}{T^{\\mathrm{{glue}}}_{\\mathrm{{cr}}}} \\qquad {\\mathrm{{and}}} \\qquad t_{\\mathrm{{YM}}}=\\frac{T_{\\mathrm{{YM}}}-T^{\\mathrm{{YM}}}_{\\mathrm{{cr}}}}{T^{\\mathrm{{YM}}}_{\\mathrm{{cr}}}}\\;.\n\t\\label{eq:reducedTemps}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"t_{{\\mathrm{{glue}}}}=\\frac{T-T^{\\mathrm{{glue}}}_{\\mathrm{{cr}}}}{T^{\\mathrm{%&#10;{glue}}}_{\\mathrm{{cr}}}}\\qquad{\\mathrm{{and}}}\\qquad t_{\\mathrm{{YM}}}=\\frac{%&#10;T_{\\mathrm{{YM}}}-T^{\\mathrm{{YM}}}_{\\mathrm{{cr}}}}{T^{\\mathrm{{YM}}}_{%&#10;\\mathrm{{cr}}}}\\;.\" display=\"block\"><mrow><mrow><mrow><msub><mi>t</mi><mi>glue</mi></msub><mo>=</mo><mrow><mfrac><mrow><mi>T</mi><mo>-</mo><msubsup><mi>T</mi><mi>cr</mi><mi>glue</mi></msubsup></mrow><msubsup><mi>T</mi><mi>cr</mi><mi>glue</mi></msubsup></mfrac><mo mathvariant=\"italic\" separator=\"true\">  </mo><mi>and</mi></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msub><mi>t</mi><mi>YM</mi></msub><mo>=</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><msub><mi>T</mi><mi>YM</mi></msub><mo>-</mo><msubsup><mi>T</mi><mi>cr</mi><mi>YM</mi></msubsup></mrow><msubsup><mi>T</mi><mi>cr</mi><mi>YM</mi></msubsup></mfrac></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05731.tex", "nexttext": "\n\nminimises the difference between both potentials, the pure gauge Polyakov-loop potential and unquenched glue potential. Limitations of this approximation and details of its derivative are given in {Ref.~\\cite{{Haas:2013qwp}}}. In this work, we will apply for the first time this unquenching of the Polyakov-loop potential at non-vanishing quark density and discuss its implications.\n\n\n\n\\section{Order Parameters and Thermodynamics at zero Chemical Potentials}\\label{sec:Resultsmu0}\n\n\nFigures \\ref{fig:thd_params_best} and \\ref{fig:ops_params_best} show those results for thermodynamics and order parameters that are the closest to the results of lattice calculations.\n\n\\begin{figure}[b]\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{pressure_muQ0_parametris_best}\n\t\\hfill\n\t\\includegraphics[width=0.49\\textwidth]{e3p_muQ0_parametris_best}\n\t\\caption{Results for the scaled pressure $p/T^4$ (left) and trace anomaly $\\left({\\epsilon-3p}\\right)/T^4$ (right) as a function of temperature at $\\mu_f=0$ for the different parametrisations of the Polyakov-loop potential.\n\tThe results are compared to the lattice calculation of {Refs.~\\cite{{Borsanyi:2013bia,Bazavov:2014pvz}}}.}\n\t\\label{fig:thd_params_best}\n\\end{figure}\n\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=0.49\\textwidth]{DeltaLS_muQ0_parametris_best}\n\t\\hfill\n\t\\includegraphics[width=0.49\\textwidth]{Ploop_muQ0_parametris_best}\n\t\\caption{Results for the subtracted chiral condensate $\\Delta_{\\mathrm{{l,s}}}$ (left) and the Polyakov loop (right) as a function of temperature at $\\mu_f=0$ for the different parametrisations of the Polyakov-loop potential. The results are compared to the lattice calculations of {Refs.~\\cite{{Borsanyi:2010bp,Bazavov:2013yv}}}.}\n\t\\label{fig:ops_params_best}\n\\end{figure}\n\nThe results for the chiral order parameter and thermodynamics either agree quantitatively with the lattice results or are at least within the trend of the data.\nA big difference is seen in the Polyakov-loop expectation value. The lattice data shows a smoother transition with significant smaller values.\nHowever, at least a part of this discrepancy originates in the inherent approximations which are still present: the derivation of the Polyakov--Quark-Meson model entails that the Polyakov-loop variable in the thermal fermionic determinant is $\\Phi\\left[\\langle{A_0}\\rangle\\right]$ and not $\\langle\\Phi\\left[A_0\\right]\\rangle$ as used in the Polyakov-loop potentials ${\\mathcal{{U}}}$ and computed on the lattice. However, the continuum definition serves as an upper bound for the lattice one, $\\Phi\\left[\\langle{A_0}\\rangle\\right]\\ge\\langle\\Phi\\rangle$. This issue discussed in detail and this difference is analysed quantitatively in {Ref.~\\cite{{Herbst:2015ona}}}.\\\\\nThe absciss{\\ae} of the figures are in units of the reduced temperature of full QCD $t = (T-T_{\\mathrm{{c}}})/T_{\\mathrm{{c}}}$. \nThis choice allows to compare the overall shape of the observables and thereby the proper inclusion of the relevant dynamics independent of a possible mismatch of the pseudocritical temperature $T_{\\mathrm{{c}}}$ that is scaled out.\nTable \\ref{tab:Tc_params_best} summarises the pseudocritical temperatures.\n\n\\begin{table}\n\t\\caption{Pseudocritical temperatures for the best results for the crossover transition at $\\mu_f=0$ with the different parametrisations of the Polyakov-loop potential presented in Figs.~\\ref{fig:thd_params_best} and \\ref{fig:ops_params_best}.\n\tThey are determined by the peak position of the chiral susceptibility ${\\partial}{\\Delta_{\\mathrm{{l,s}}}}/{\\partial}{T}$ and of the temperature derivative of the Polyakov loop ${\\partial}{\\Phi}/{\\partial}{T}$. As transition temperature of the Polyakov-loop potential $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}=240\\,{\\mathrm{{MeV}}}$ is used and $m_\\sigma=400\\,{\\mathrm{{MeV}}}$ as vacuum mass of the $\\sigma$-meson.}\n\t\\begin{center}\n\t\t\\begin{tabular}{lcc}\n\t\t\t\\hline\\hline\\vspace{-0.4cm}\\\\\n\t\t\t\t\t\t\t\t\t\t& Log\t& Poly-Log \\\\\t\n\t\t\t\\vspace{-0.4cm}\\\\\\hline\\vspace{-0.4cm}\\\\\n\t\t\t$T_{\\mathrm{{c}}}$ [MeV]\t\t\t\t& 175\t& 179 \\\\\n\t\t\t$T_{\\mathrm{{d}}}$ [MeV]\t\t\t\t& 152\t& 165 \\\\\\vspace{-0.4cm}\\\\\n\t\t\t\\hline\\hline\n\t\t\\end{tabular}\n\t\\end{center}\n\t\\label{tab:Tc_params_best}\n\\end{table}\\\\\n\n\nTo achieve a better description of the thermodynamics in the phase where chiral symmetry is broken, the thermodynamics is augmented by the contribution of a gas of thermal pions as we did in {Refs.~\\cite{{Haas:2013qwp,Stiele:2013pma,Herbst:2013ufa}}}.\nThe contribution to the pressure of each pion species is\n\n\\begin{eqnarray}\n\t\\hskip-5ex p_{\\pi^i} &=& \\frac{1}{\\left({2\\pi}\\right)^3} \\int_0^\\infty {\\mathrm{{d^3}}}k\\,\\frac{k^2}{3 E_{\\pi^i}}\\,\\frac{1}{e^{(E_{\\pi^i}-\\mu_{\\pi^i})/T}-1} \\qquad {\\mathrm{{with}}} \\qquad E_{\\pi^i}=\\sqrt{k^2+m_{\\pi^i}^2} \\qquad\n\t\\label{eq:pPi}\n\\end{eqnarray}\n\nand $\\pi^i = \\pi^0$, $\\pi^+$, $\\pi^-$. The total contribution of the pions to the pressure is accordingly $p_\\pi=p_{\\pi^0}+p_{\\pi^+}+p_{\\pi^-}$ and overall\n\n\\begin{eqnarray}\n\tp &=& -\\Omega + p_\\pi\\;.\n\t\\label{eq:ptot}\n\\end{eqnarray}\n\nFor the pion masses the in-medium masses are taken. These are determined by the second derivatives of the thermodynamical potential with respect to the pseudoscalar fields,\n\n\\begin{eqnarray}\n\tm_{{\\mathrm{{p}}},ij}^2 &=& \\left.\\frac{\\partial^2\\Omega\\left({\\varphi_{{\\mathrm{{s}}},a},\\varphi_{{\\mathrm{{p}}},b},\\Phi,{\\bar{\\Phi}};T,\\mu_f}\\right)}{\\partial\\varphi_{{\\mathrm{{p}}},i}\\,\\partial\\varphi_{{\\mathrm{{p}}},j}}\\right|_{\\mathrm{{min}}}\\;.\n\t\\label{eq:MedMesMas}\n\\end{eqnarray}\n\nThe association of the pseudoscalar fields and physical pseudoscalar mesons is such that the mass of the $\\pi^+$-meson is given by $m_{{\\mathrm{{p}}},11}$, the mass of the $\\pi^-$-meson is $m_{{\\mathrm{{p}}},22}$ and  the mass of the $\\pi^0$-meson results from $m_{{\\mathrm{{p}}},33}$. Note that the charged pions couple to isospin ($\\mu_{\\pi^\\pm}=\\pm\\mu_{\\mathrm{{I}}}=\\pm\\left|\\mu_{\\mathrm{{u}}}-\\mu_{\\mathrm{{d}}}\\right|$) and therefore, the degeneracy of their masses with that of the $\\pi^0$-meson becomes lifted for $\\sigma_3\\neq0$. Then $m_{{\\mathrm{{p}}},33}^2$ mixes with $m_{{\\mathrm{{p}}},00}^2$ and $m_{{\\mathrm{{p}}},88}^2$ since $m_{{\\mathrm{{p}}},03}^2$ and $m_{{\\mathrm{{p}}},38}^2$ become nonzero as is $m_{{\\mathrm{{p}}},08}^2$. The mass of the $\\pi^0$-meson results then from diagonalising the $0-3-8$ sector.\nUsing the in-medium pion masses {(\\ref{{eq:MedMesMas}})} the pressure of the pions is strictly speaking a field-dependent correction to the thermodynamical potential that contributes as well to the equations of motion, ${\\partial}\\Omega/{\\partial}\\varphi_i-{\\partial}{p_\\pi}/{\\partial}\\varphi_i$ and the (pseudo)scalar masses themselves. In a lowest order approximation this correction is neglected, saying that the dynamics of the system is governed by the grand canonical potential $\\Omega$ alone which determines the meson masses as well. An uncoupled pion gas with these pion masses is then added to thermodynamics as in {Eq.~(\\ref{{eq:ptot}})}. How the thermal fluctuations of mesons alter the results for the order parameters, for the meson masses themselves and for thermodynamics, we will show in {Ref.~\\cite{{Zacchi:2016}}}.\\\\\nThe pion contribution is the dominant one compared to the heavier mesons in the phase where chiral symmetry is broken as it is also shown in {Refs.~\\cite{{Herbst:2013ufa,Torres-Rincon:2016ahl}}}. Furthermore, the more massive mesons would contribute sizeable in the high temperature phase \\cite{Torres-Rincon:2016ahl} where, physically, the mesonic degrees of freedom dissolve. But this aspect of deconfinement is not covered by centre symmetry restoration. This justifies to only consider the contribution of a gas of thermal pions but no other mesons.\n\n\n\n\\section{Phase Structure at nonzero Quark Chemical Potentials}\\label{sec:ResultsMuQ}\n\n\nIn the previous section the unquenching of the Polyakov-loop potential showed to be an important improvement for the description of the phase structure and thermodynamics at zero quark chemical potentials with Polyakov-loop extended chiral models.\nNow, the impact of unquenching the Polyakov-loop potential onto the phase structure at non-vanishing net quark density will be discussed.\n\nThe results presented in the following are obtained using the polynomial-logarithmic Polyakov-loop potential.\n\nThe impact of a quark-backreaction onto the Polyakov-loop potential at finite quark densities is shown in {Fig.~\\ref{{fig:orderparsT10_YMglue}}}. The upper panels are results obtained with the unquenched Polyakov-loop potential while for the results in the lower part a pure Yang-Mills Polyakov-loop potential has been used.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{./figures/Ops_T10_glue_ab}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{./figures/Ops_T10_glue_ab_T0mu}\n\t\\vskip2ex\n\t\\includegraphics[width=.49\\textwidth]{./figures/Ops_T10_YM_ab_T0mu}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{./figures/Ops_T10_YM_ab_T0fix}\n\t\\caption{Evolution of the chiral condensates and the Polyakov loop with increasing quark chemical potential at a temperature of 10\\,MeV with the unquenched Polyakov-loop potential with a density independent $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}$ (top left),  with $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}\\left({\\mu_f}\\right)$ (top right), with the Yang-Mills Polyakov-loop potential with $T_{\\mathrm{{cr}}}^{\\mathrm{{YM}}}\\left({\\mu_f}\\right)$ (bottom left) and with a density independent $T_{\\mathrm{{cr}}}^{\\mathrm{{YM}}}$ (bottom right).}\n\t\\label{fig:orderparsT10_YMglue}\n\\end{figure}\n\nObviously, using the quark-enhanced Polyakov-loop potential the chiral and (de)confinement transition remain linked at small temperatures and large quark chemical potentials.\\\\\nThe question is whether the use of the same functional relation between pure Yang-Mills and glue effective potential found in the transition region for zero chemical potentials is justified at small temperatures and large quark chemical potentials. At small temperatures and zero density one should actually expect that Yang-Mills and effective glue potential become asymptotically the same. So the question specifies to if the impact of quarks to the Polyakov-loop potential at small temperatures and chemical potentials of the order of the critical one can be approximated  by their impact at zero density and temperatures around the pseudocritical temperature.\\\\\nThe pure Yang-Mills Polyakov-loop potential does as such not contain any explicit dependence on quark densities and therefore, the Polyakov-loop remains at its vacuum value $\\sim\\!0$ at small temperatures when the quark chemical potential is increased as is shown in the lower right part of {Fig.~\\ref{{fig:orderparsT10_YMglue}}}. Only the coupling to quarks and mesons leads to an extremely small variation.\\\\\nOne way to include a density-dependent matter backreaction onto the Polyakov-loop potential is to consider the chemical potential dependence of its transition temperature \\cite{Schaefer:2007pw,Herbst:2013ail}. This implies that the transition scale of the Polyakov-loop potential decreases with increasing chemical potential. This in turn lowers the pseudocritical temperature of the crossover transition of the Polyakov-loop at a large chemical potential towards the critical temperature of the chiral first order transition. This is shown in the lower left panel of {Fig.~\\ref{{fig:orderparsT10_YMglue}}} and {Refs.~\\cite{{Schaefer:2007pw,Herbst:2010rf,Schaefer:2011ex,Herbst:2013ail}}}. With the inclusion of meson fluctuations in a renormalisation group framework this backreaction is enough to see the chiral and (de)confinement transitions remaining linked at large chemical potentials as shown in {Refs.~\\cite{{Herbst:2010rf,Herbst:2013ail}}}.\\\\\nTherefore, the coincidence of the chiral and (de)confinement transition at large chemical potentials with the unquenched Polyakov-loop potential is qualitatively a welcome feature. Taking additionally into account the chemical potential dependence of the glue critical temperature shows then a minor impact as can be seen in comparing the upper right and upper left figures of {Fig.~\\ref{{fig:orderparsT10_YMglue}}}. The consequence of adjusting $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}$ with $\\mu_{\\mathrm{{q}}}$ is as for the Yang-Mills Polyakov-loop potential to move the Polyakov-loop to larger values at a given chemical potential.\\\\\nInterestingly enough, the evolution of the chiral order parameters is perfectly independent of the realisation of the Polyakov-loop potential as is shown in {Fig.~\\ref{{fig:orderparsT10_YMglue}}}, except of a $1\\,\\%$ decrease of the chiral condensates just before the transition when the unquenched Polyakov-loop potential is used.\n\nEven the qualitative impact of unquenching the Polyakov-loop potential, that it links chiral and (de)confinement transition is reasonable its quantitative magnitude remains in question.\nWhile pure gauge theory allows to adjust parametrisations of the Polyakov-loop potential to the minimum of the potential and the PQM/PNJL model at zero densities but nonzero temperature probes regions of the Polyakov-loop potential away from the minimum, the PQM/PNJL model at large quark chemical potentials probes the form of the Polyakov-loop potential far away from the minimum.\nThe impact of unquenching the Polyakov-loop potential is such that the Polyakov-loop becomes unbound at small temperatures and large chemical potentials for polynomial parametrisations. Only the limitation of the Polyakov loop to be smaller than one when the Haar measure is considered avoids this behaviour.\\\\\n\nHaving found a crossover at small chemical potentials and a first-order transition at small temperatures, the next step is to investigate the complete $T-\\mu_{\\mathrm{{q}}}$ phase diagram considering the before mentioned observations.\\\\\nThe phase diagram of the PQM model is shown in {Fig.~\\ref{{fig:PhaseDiagram_YMglue}}}. The effect of unquenching the Polyakov-loop potential onto the phase diagram is displayed by the comparison of the results using the Yang-Mills Polyakov-loop potential and its quark-enhanced counterpart. The (lighter) crossover lines are the pseudocritical values of the subtracted chiral condensate.\\\\\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_glueYM}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_glueYM_scaled}\n\t\\caption{Phase diagram with the Yang-Mills Polyakov-loop potential and the unquenched one, in absolute units (left) and relative units (right). The (lighter) crossover lines are the pseudocritical values of the subtracted chiral condensate. The thiner, outer lines around the first-order transition lines retrace the extension of the metastable regions.}\n\t\\label{fig:PhaseDiagram_YMglue}\n\\end{figure}\n\nFor all values of the quark chemical potential $\\mu_{\\mathrm{{q}}}=\\mu_{\\mathrm{{u}}}=\\mu_{\\mathrm{{d}}}=\\mu_{\\mathrm{{s}}}$, unquenching the Polyakov-loop potential has the consequence of lowering the transition temperature which has its origin in the effect of lowering the transition scale of the Polyakov-loop.\nIn the zero temperature limit $T\\to0$ the Polyakov-loop potential becomes independent of its variables ${\\mathcal{{U}}}\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};T=0}\\right)=0$ $\\forall\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}}}\\right)$ since gluon excitations are entirely independent of the quark chemical potential and therefore, the phase structure is that of the Quark-Meson model that is shown as well in {Fig.~\\ref{{fig:PhaseDiagram_YMglue}}}.\\\\\nWith all  uncertainties adjusted to lattice data at zero quark chemical potential, there remains a region at large chemical potentials where the phase transition is discontinuous and the order parameters show a jump. The thiner, outer lines around the first-order transition line retrace the extension of the metastable region, so to which extent the one phase remains as local minimum while the system is in the other phase which is the global minimum. The coordinates of the critical endpoints (CEP) are $\\left({T,\\mu}\\right)_{\\mathrm{{CEP}}}=\\left({65,276}\\right)\\,{\\mathrm{{MeV}}}$ with the unquenched Polyakov-loop potential and $\\left({94,283}\\right)\\,{\\mathrm{{MeV}}}$ with the Yang-Mills potential. So the main effect of including the quark backreaction onto the gluons is to lower the temperature of the CEP at a similar chemical potential.\nInterestingly enough, {Ref.~\\cite{{Biguet:2014sga}}} did a detailed analysis of the quantitative sensitivity of the CEP coordinate on the meson phenomenology in the vacuum that is used to adjust the parameters in the chiral sector. They also find a much larger sensitivity of $T_{\\mathrm{{CEP}}}$ than $\\mu_{\\mathrm{{CEP}}}$, this time for variations in the chiral sector.\n\nAt these large values of the quark or baryon chemical potential ($\\mu_{\\mathrm{{b}}}=3\\mu_{\\mathrm{{q}}}$), baryons are the relevant degrees of freedom that are not contained in the PQM model. To implement baryons as bound states of quarks and diquarks using the Fadeev and Bethe-Salpeter equations, see e.g.~{Refs.~\\cite{{Eichmann:2010je,Oettel:2000ig,Ebert:1997hr,Buck:1992wz}}}, to the PQM model remains for future work.  For work on including diquarks in two-colour QCD, see e.g.~{Refs.~\\cite{{Strodthoff:2011tz,Strodthoff:2013cua}}}. Reference \\cite{Eichmann:2015kfa} included baryonic degrees of freedom for their localisation of the CEP but finds only a small influence of these within in a few MeV.\nEven this region of the phase diagram at large chemical potentials and small temperatures is speculative within the present framework, general methods to analyse the properties of this region can be discussed, as in {Sec.~\\ref{{sec:Nucleation}}}.\n\nAn important aspect of the phase diagram at small chemical potentials is the curvature of the transition line. This can also be extracted from lattice calculations that are hampered at nonzero quark chemical potentials due to the sign problem. In the right part of {Fig.~\\ref{{fig:PhaseDiagram_YMglue}}} the transition lines are normalised by the respective pseudocritical temperatures at zero density, $T_c^0$ and the critical chemical potential at zero temperature, $\\mu_{\\mathrm{{c}}}^0$ to allow for a comparison of the curvatures. One sees that applying the unquenched Polyakov-loop potential lowers the pseudocritical temperature relatively stronger with increasing chemical potential such that the curvature of the phase transition line increases.\n\nThe influence of lowering the critical temperature of the Polyakov-loop potential with increasing density has a smaller effect on the phase diagram than unquenching the Polyakov-loop potential, as can can be seen in the comparison of Figs.~\\ref{fig:PhaseDiagram_YMglue} and \\ref{fig:PhaseDiagram_T0fixmu}.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_T0fixmu}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_T0fixmu_scaled}\n\t\\caption{Phase diagram for a constant critical scale of the unquenched Polyakov-loop potential and with the density dependence of {Ref.~\\cite{{Schaefer:2007pw}}}, in absolute units (left) and relative units (right).}\n\t\\label{fig:PhaseDiagram_T0fixmu}\n\\end{figure}\n\nTo illustrate the impact on the curvature of the transition line, in the right part of {Fig.~\\ref{{fig:PhaseDiagram_T0fixmu}}} the square of the chemical potential is chosen as abscissa. In this unit the pseudocritical temperature follows a straight line for small values of the chemical potential. Lowering the glue critical temperature with increasing chemical potential has the impact of decreasing the pseudocritical temperature such that the curvature of the transition line gets larger.\nThe location of the critical endpoint is lowered further in temperature to $\\left({T,\\mu}\\right)_{\\mathrm{{CEP}}}=\\left({47,280}\\right)\\,{\\mathrm{{MeV}}}$ when the glue critical temperature is decreased with growing chemical potential.\n\nThe curvature of the transition line is also a quantity that can be extracted from lattice calculations up to baryon chemical potentials for which terms of higher order than $(\\mu_{\\mathrm{{B}}}/T_{\\mathrm{{c}}})^2$ can be neglected. Therefore, it can serve as a test of the predictive power of the presented framework that is complementary to the one that we performed in {Ref.~\\cite{{Stiele:2013pma}}} for the isospin dependence of the pseudocritical temperature. Figure \\ref{fig:phdiag_curvature} compares the result using the unquenched Polyakov-loop potential with density-independent glue critical temperature with those of the recent lattice calculations of {Refs.~\\cite{{Bonati:2015bha,Cea:2015cya}}}.\n\n\\begin{figure}\n\t\\includegraphics[width=0.6\\textwidth]{phdiag_curvature}\n\t\\hskip-10ex\n\t\\begin{minipage}[b]{0.5\\textwidth}\n\t\t\\caption{\\label{fig:phdiag_curvature} Curvature of the pseudocritical phase transition line. Our result is compared to those of recent lattice calculations \\cite{Bonati:2015bha,Cea:2015cya} and location of latest hadron chemical equilibrium in relativistic heavy ion collisions \\cite{Cleymans:2005xv,Bazavov:2015zja}. The result of {Ref.~\\cite{{Bazavov:2015zja}}} is a lower bound.}\n\t\\end{minipage}\n\\end{figure}\n\nWe show these since they span the range of results of the latest generation of lattice calculations. The one of {Ref.~\\cite{{Bellwied:2015rza}}} is as well within this range. The result of the presented framework with its uncertainties adjusted at zero density is well within the ballpark of these lattice results within their uncertainties. The band shown for the PQM model results from the difference using the logarithmic or polynomial-logarithmic Polyakov-loop potential. This difference is further analysed in {Sec.~\\ref{{su:Pardep}}}.\nShown in {Fig.~\\ref{{fig:phdiag_curvature}}} are as well the curves on which chemical freeze-out of hadrons is expected according to the beam energy dependence of observed particle yields in relativistic heavy-ion collisions  \\cite{Cleymans:2005xv,Bazavov:2015zja}. Compared to that result in {Ref.~\\cite{{Cleymans:2005xv}}} the outcome of our calculation fulfils the expectation that the transition line lies close above the freeze-out curve. A comparison to the  lower limit given in {Ref.~\\cite{{Bazavov:2015zja}}} would violate this expectation, an observation which also holds true for most of the lattice results within their errors.\\\\\nOne ingredient to the presented model that diminishes the curvature of the crossover line is the inclusion of meson fluctuations in a renormalisation group framework \\cite{Herbst:2010rf,Herbst:2013ail}.\nIn {Ref.~\\cite{{Bratovic:2012qs}}} it was quantified how including repulsive vector interactions reduce the slope of the phase transition line. But one should be aware that by including the vector meson exchange, the model fails to describe lattice results of quark number susceptibilities as was shown in {Ref.~\\cite{{Steinheimer:2010sp,Steinheimer:2014kka}}}. Therefore, it is important to overcome the later failure to investigate the impact of vector interactions onto the curvature of the crossover line and the nature of the transition at large chemical potentials.\n\nIn general, the two minima of the potential that are degenerate on the coexistence line persist as a global and a metastable local minimum in some region of the phase diagram around the phase transition line. Going away from the coexistence line, the intervening maximum approaches the local minimum until these two extrema meet and form an inflection point that defines the spinodal line.\\\\\nFigure \\ref{fig:MetastableRegion_YMglue} compares the extension of the metastable region that is limited by the spinodal lines using the unquenched Polyakov-loop potential and the Yang-Mills potential. \n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{spinodals_glueYM}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{spinodals_glueYM_scaled}\n\t\\caption{Metastable regions of the PQM model with the Yang-Mills Polyakov-loop potential and the unquenched one. Their extension is compared in absolute units (left) and with respect to the transition line ($\\mu_{\\mathrm{{c}}}$) and the temperature of the critical end point $T_{\\mathrm{{CEP}}}$ (right).}\n\t\\label{fig:MetastableRegion_YMglue}\n\\end{figure}\n\nThe absolute location of the critical endpoint and therefore of the metastable region differs except for the lowest temperatures when the Polyakov-loop independent Quark-Meson limit is reached. But the relative extent is similar as is shown on the right side of {Fig.~\\ref{{fig:MetastableRegion_YMglue}}}. Here, the form changes from a convex shape with the Yang-Mills Polyakov-loop potential to a concave form when the matter backreaction to the Polyakov-loop potential is considered.\n\n\n\n\\subsection{\\label{su:Pardep}Dependence on the parametrisation of the Polyakov-loop potential\\protect}\n\n\nThe analysis of how well the different parametrisations of the Polyakov-loop potential are adjusted to lattice data of Yang-Mills theory shown in {Table~\\ref{{tab:Ploop_pot_data}}} and the investigation of the impact of the parametrisations on the evolution of order parameters and thermodynamics at zero chemical potentials when the potential is coupled to quarks and mesons as discussed in {Sec.~\\ref{{sec:Resultsmu0}}}, showed that the results show similar qualitative behaviour.\nFigure \\ref{fig:PhaseDiagram_params} compares the phase diagrams for the different parametrisations using the parameters as they were determined in {Sec.~\\ref{{sec:Resultsmu0}}} to get as close as possible to the lattice results for the order parameters, thermodynamics and pseudocritical temperatures.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_parametris}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{./figures/phdiag_parametris_scaled}\n\t\\caption{Phase diagram for the different parametrisations of the Polyakov-loop potential, in absolute units (left) and relative units (right).}\n\t\\label{fig:PhaseDiagram_params}\n\\end{figure}\n\nThe overall shape of the phase boundaries is similar and the polynomial-logarithmic Polyakov-loop potential leads to relatively larger transition temperatures from medium chemical potentials on.\nThe location of the critical endpoint is $\\left({T,\\mu}\\right)_{\\mathrm{{CEP}}}=\\left({47,280}\\right)\\,{\\mathrm{{MeV}}}$ with the logarithmic Polyakov-loop potential.\n\nThe zoom into metastable regions achieved with different parametrisations of the Polyakov-loop potential displayed in {Fig.~\\ref{{fig:MetastableRegion_params}}} shows in more detail that the critical endpoint with the polynomial-logarithmic glue potential deviates from the location of the critical endpoint calculated with the logarithmic Polyakov-loop potential.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{spinodals_parametris}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{spinodals_parametris_scaled}\n\t\\caption{Metastable regions of the PQM model for the different parametrisations of the Polyakov-loop potential. Their extension is compared in absolute units (left) and with respect to the transition line ($\\mu_{\\mathrm{{c}}}$) and the temperature of the critical end point $T_{\\mathrm{{CEP}}}$ (right).}\n\t\\label{fig:MetastableRegion_params}\n\\end{figure}\n\nBut once the metastable regions are corrected for the different coordinates of the critical endpoints, both parametrisations lead to an extent of the metastable region that is largely independent of the form of the Polyakov-loop potential. This is  shown on the right side of {Fig.~\\ref{{fig:MetastableRegion_params}}}.\nFurthermore, one finds that the degree of metastability that can be reached is relatively modest.\nThe extent of the metastable region shows an asymmetry for the lowest temperatures in which the spinodal line  in the chirally restored and deconfined phase has a larger distance to the coexistence line than the spinodal in the chirally restored and confined phase.\nThis observation on the asymmetric extent of the metastable region holds as well for the description of Yang-Mills theory with the different Polyakov-loop potentials and in the pure chiral Quark-Meson model.\n\n\n\n\\section{Nucleation in a Polyakov-loop extended chiral effective model}\\label{sec:Nucleation}\n\n\nHere, the properties of the phase transition in the high density and low temperature region of the phase diagram are analysed.\\\\\nThe derivation of an overestimate of the surface tension for bubble nucleation within the thin-wall approximation in {Ref.~\\cite{{Mintz:2012aua}}} shows that it is determined by two contributions. On the one hand by the distance between the two degenerate minima in the space of the order parameters and on the other hand by the shape of the effective potential along the straight line that connects both minima.\\\\\nTo discuss how the different contributions to the Polyakov--Quark-Meson Model build up the result of the surface tension, {Sec.~\\ref{{su:NucleationQM}}} presents the results within the Quark-Meson Model and {Sec.~\\ref{{su:NucleationPQM}}} discusses the effects of the Polyakov-loop extension.\n\n\n\\subsection{Nucleation within the Quark-Meson Model}\\label{su:NucleationQM}\n\n\nThe PQM model reduces to the Quark-Meson Model that governs only chiral symmetry breaking and restoration by fixing $\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}}}\\right)\\equiv\\left({1,0}\\right)$ at all temperatures and densities. This implies that the coarse-grained free energy and the estimate of the surface tension become independent of the kinetic parameter $\\kappa$ of the Polyakov-loop order parameters,\n\n\\begin{eqnarray}\n\t\\Sigma_{\\mathrm{{QM}}}^{\\mathrm{{SU(3)}}}\\left({T,\\mu_{\\mathrm{{l}}},\\mu_{\\mathrm{{s}}}}\\right) &=& \\sqrt{\\left({\\Delta\\sigma_{\\mathrm{{l}}}}\\right)^2 + \\left({\\Delta{\\sigma_{\\mathrm{{\\!s}}}}}\\right)^2}\\int_0^1{\\mathrm{{d}}}\\xi\\, \\sqrt{2\\tilde{\\Omega}\\!\\left({\\xi;T,\\mu_{\\mathrm{{l}}},\\mu_{\\mathrm{{s}}}}\\right)}\\;.\n\t\\label{eq:sigma_QM3}\n\\end{eqnarray}\n\nThe contribution of the light quark sector is already present in the SU(2) Quark-Meson Model, where the overestimate of the surface tension simply reduces to\n\n\\begin{eqnarray}\n\t\\Sigma_{\\mathrm{{QM}}}^{\\mathrm{{SU(2)}}}\\left({T,\\mu_{\\mathrm{{l}}}}\\right) &=& \\int_{\\sigma_{\\mathrm{{l}}}^{\\left({1}\\right)}}^{\\sigma_{\\mathrm{{l}}}^{\\left({2}\\right)}}{\\mathrm{{d}}}\\sigma_{\\mathrm{{l}}}\\, \\sqrt{2{\\Omega}\\!\\left({\\sigma_{\\mathrm{{l}}};T,\\mu_{\\mathrm{{l}}}}\\right)}\\;.\n\t\\label{eq:sigma_QM2}\n\\end{eqnarray}\n\nHence, differences in the surface tension of the two-flavour and 2+1--flavour Quark-Meson model arise due to a possible modification of the degenerate values of the light chiral condensate, the additional dimension of the strange chiral condensate and a  possible modification of the effective potential along the straight line connecting the minima.\nTo investigate the impact of the values of the chiral condensates, the left part of {Fig.~\\ref{{fig:QM_OPs_ST}}} shows the degenerate values that the chiral order parameters take at the first-order phase transition.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{QM_wVAC_sigma_coex}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{surface_tension_QM_wVAC}\n\t\\caption{Left: Degenerate values of the chiral condensates $\\sigma_{\\mathrm{{l}}}$ and ${\\sigma_{\\mathrm{{\\!s}}}}$ along the first-order transition line in the two and 2+1--flavour Quark-Meson model. Right: Surface tension along the coexistence line in the two and 2+1--flavour Quark-Meson model.}\n\t\\label{fig:QM_OPs_ST}\n\\end{figure}\n\nNotice that the minima merge smoothly at the critical end point.\n\nOne observes that adding strange quarks to the system weakens the transition in the light quark sector. This counteracts partially the increase of the prefactor in the surface tension {(\\ref{{eq:sigma_QM3}})} when strange quarks are taken into account.\nBut the upper limit on the surface tension presented on the right hand side of {Fig.~\\ref{{fig:QM_OPs_ST}}} is even smaller for the 2+1 quark flavour Quark-Meson model that in the two-flavour calculation. This is because the fermionic vacuum contribution at one loop order\n\n\\begin{eqnarray}\n\t\\Omega_{\\mathrm{{q\\bar{q}}}}^{\\mathrm{{vac}}}\\; &\\sim& -\\!\\sum_{f={\\mathrm{{u,d,s}}}} m_f^4 \\ln\\left({m_f}\\right)\\;,\n\\end{eqnarray}\n\ndecreases the thermodynamical potential and the hight of the barrier at the first-order phase transition and each quark flavour leads to a further decrease that is even larger the heavier the quark species.\n\nIn general, {Fig.~\\ref{{fig:QM_OPs_ST}}} shows the overestimate of the surface tension in the thin-wall approximation of the QM model along the first-order transition line. The temperature dependence of the \nsurface tension and its value at zero temperature\nis similar to the results found in {Refs.~\\cite{{Palhares:2010be,Pinto:2012aq}}}, which considered the two-flavour Quark-Meson and Nambu--Jona-Lasinio models, respectively.\nThe upper bound of $10\\,{\\mathrm{{MeV/fm}}}^2$ for the surface tension allows a quick hadron-quark phase conversion. The implications of this result for several physical scenarios, be it heavy ion collisions, proto-neutron stars or the early Universe are those as discussed in {Ref.~\\cite{{Mintz:2012mz}}}.\n\n\n\\subsection{Nucleation within the Polyakov--Quark-Meson Model}\\label{su:NucleationPQM}\n\n\nWith the Polyakov-loop extension of the Quark-Meson model, the system contains another order parameter, the Polyakov loop and the effective potential gets an additional contribution, the Polyakov-loop potential ${\\mathcal{{U}}}$. \n\n\\begin{eqnarray}\n\t\\Sigma\\left({{\\mathcal{{R}}}}\\right) &=& h\\int_0^1{\\mathrm{{d}}}\\xi\\, \\sqrt{2\\tilde{\\Omega}\\!\\left({\\xi;{\\mathcal{{R}}}}\\right)}\\;,\n\t\\label{eq:sigma_thinwall_straight_line}\n\\end{eqnarray}\n\nwith\n\n\\begin{eqnarray}\n\th^2&=& \\left({\\Delta\\sigma_{\\mathrm{{l}}}}\\right)^2 + \\left({\\Delta{\\sigma_{\\mathrm{{\\!s}}}}}\\right)^2 + \\left({\\kappa\\Delta{\\Phi_{\\mathrm{{r}}}}}\\right)^2+\\left({\\kappa\\Delta{\\Phi_{\\mathrm{{i}}}}}\\right)^2\\;,\n\t\\label{eq:definition_h2}\n\\end{eqnarray}\n\nand the straight-line approximation\n\n\\begin{eqnarray}\n\t\\phi_i &=& \\xi \\phi_i^{\\left({1}\\right)} + \\left({1-\\xi}\\right)\\phi_i^{\\left({2}\\right)}\n\\end{eqnarray}\n\nwith $0\\leq\\xi\\leq 1$, see further {Ref.~\\cite{{Mintz:2012aua}}}.\nTherefore, the Polyakov loop adds an additional  contribution to the distance between the degenerate minima at the phase transition, so to the factor $h$ in {Eq.~(\\ref{{eq:definition_h2}})}.\nAnother effect of the Polyakov-loop extension onto this quantity can be the modification of the values of the chiral condensates at the minima compared to the Quark-Meson model.\n\nThe left part of {Fig.~\\ref{{fig:PQM_OPs_coexistence}}} shows how the values of the chiral condensates of the degenerate minima at the phase transition are altered by the coupling to the Polyakov-loop. This result shows a slight dependence if and which kind of back coupling of the quarks onto the quenched Polyakov-loop potential is considered. With the Yang-Mills Polyakov-loop potential with constant transition scale the values of the chiral condensates are hardly altered compared to the Quark-Meson model result. Lowering the critical temperature of this potential with increasing density increases the gap between the values of the chiral condensates in the degenerate minima. This is not the case when the unquenched Polyakov-loop potential with constant critical scale is considered but it shifts the values of the condensates somewhat to larger values. The latter observation can be attributed to the close link of (de)confinement and chiral transition.\n\n\\begin{figure}\n\t\\centering\n\t\\includegraphics[width=.49\\textwidth]{PQM_wVAC_glue_YM_T0fixMu_sigma_coex}\n\t\\hfill\n\t\\includegraphics[width=.49\\textwidth]{PQM_wVAC_glue_YM_T0fixMu_PhiR_coex}\n\t\\caption{Degenerate values of the chiral condensates $\\sigma_{\\mathrm{{l}}}$ and ${\\sigma_{\\mathrm{{\\!s}}}}$ (left) and the Polyakov loop ${\\Phi_{\\mathrm{{r}}}}$ (right) along the first-order transition line. Compared are the results of the PQM model with the Yang-Mills Polyakov-loop potential with constant and density dependent critical scale and with the unquenched Polyakov-loop potential with constant $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}$. Note that the results for the Polyakov loop are scaled as given in the label so that they start out at similar values at the critical endpoint.\t}\n\t\\label{fig:PQM_OPs_coexistence}\n\\end{figure}\n\n\nThe values that the Polyakov loop takes in the degenerate minima at the transition are much more sensitive to the kind of Polyakov-loop potential as is shown on the right of {Fig.~\\ref{{fig:PQM_OPs_coexistence}}}. As discussed in the discussion of {Fig.~\\ref{{fig:orderparsT10_YMglue}}}, the (de)confinement and chiral transition of the light quarks remain linked in the low temperature and high density region of the phase diagram with the unquenched Polyakov-loop potential. The opposite behaviour occurs with the pure Yang-Mills Polyakov-loop potential with which the Polyakov loop takes only very small values at temperatures far below the critical scale of the Polyakov-loop potential. An intermediate behaviour for the Polyakov loop is observed with the chemical potential dependence of the transition temperature of the Polyakov-loop potential as in {Ref.~\\cite{{Schaefer:2007pw}}}. Close to the critical endpoint the Polyakov loop takes at the phase transition values of the same order as with the unquenched Polyakov-loop potential but nevertheless the (de)confinement transition decouples from the chiral phase transition of the light quarks at even smaller temperatures.\n\nThese results are obtained with the polynomial-logarithmic parametrisation of the Polyakov-loop potential with the best fit parameters of {Sec.~\\ref{{sec:Resultsmu0}}}.\nFigure \\ref{fig:SurfaceTension_glueYMfixmu} presents the corresponding results of the surface tension. The kinetic parameter $\\kappa$ of the Polyakov-loop is adjusted via the pure gauge surface tension to $\\kappa\\simeq0.818\\,T_0$.\n\n\\begin{figure}\n\t\\includegraphics[width=0.6\\textwidth]{surface_tension_PQM_wVAC_glue_YM_T0fixMu}\n\t\\hskip-10ex\n\t\\begin{minipage}[b]{0.5\\textwidth}\n\t\t\\caption{\\label{fig:SurfaceTension_glueYMfixmu}Surface tension along the coexistence line. Compared are the results of the PQM model with the Yang-Mills Polyakov-loop potential with constant and density dependent critical scale and with the unquenched Polyakov-loop potential with constant $T_{\\mathrm{{cr}}}^{\\mathrm{{glue}}}$.}\n\t\\end{minipage}\n\\end{figure}\n\nThe Polyakov-loop extension of the pure chiral Quark-Meson model leads to an increase of the surface tension. Nevertheless, the zero temperature limit is the same since gluon excitations are independent of the quark chemical potential in this limit, ${\\mathcal{{U}}}\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};T=0}\\right)=0$ $\\forall\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}}}\\right)$.\nExcept than very close to the critical endpoint, $\\Delta\\sigma_{\\mathrm{{l}}}$ is much lager than $\\Delta{\\Phi_{\\mathrm{{r}}}}$, $\\Delta{\\Phi_{\\mathrm{{i}}}}$ and $\\Delta{\\sigma_{\\mathrm{{\\!s}}}}$ so that the order of magnitude of the surface tension is set by the two-flavour Quark-Meson model. The maximum in the surface tension with the unquenched Polyakov-loop potential is the result of the increasing strength of the (de)confinement transition that comes along with the stronger transition in the chiral sector at larger chemical potentials and the tendency that a (de)confinement crossover transition sets on at chemical potentials slightly below the chiral first-order transition.\n\n\n\\section{Conclusions}\\label{sec:Conclusions}\n\n\nIn this work, thermodynamical properties and the phase structure of strongly-inter\\-acting matter have been analysed in an improved framework of the Polyakov-loop--extended Quark-Meson model with $2+1$ constituent quark flavours.\nWe applied the results of {Ref.~\\cite{{Haas:2013qwp}}} that an appropriate rescaling of the temperature can mimic the effect of the quark backreaction on the gauge sector. This offers a simple and systematic approach to improve the Polyakov-loop potential from a pure gauge potential to the unquenched glue potential in full QCD.\nMoreover, as another step beyond usual mean-field analyses not only quark quantum fluctuations at one-loop have been considered but the contribution of thermal meson fluctuations to thermodynamics was taken into account.\n\nWith the parameters adjusted in order to reproduce lattice results at zero quark densities this setting constitutes an adequate framework to investigate the phase structure of strongly-interacting matter at nonzero quark density.\nThe present work presents the first application of the unquenched Polyakov-loop potential at nonzero net quark density and explored its impact. \nIncluding the quark-backreaction on the gauge sector showed to have a big impact on the interrelation of the chiral and (de)confinement transition at non-vanishing chemical potential and these transitions remained linked even in the high quark-density and small temperature region of the phase diagram. This result is obtained ignoring any density dependence of the quark-backreaction. So, to confirm or reject this trend it remains for future work to investigate a medium dependence of the unquenching of the gauge sector.\n\nThe comparison of the curvature of the phase transition line at non-zero baryon chemical potential with recent lattice data and observations of the latest hadron chemical equilibrium in relativistic heavy-ion collisions showed an appreciable agreement.\nTesting the effective model with its parameters adjusted to provide a good description of lattice data at zero density in this fashion is crucial to understand whether it can provide a reliable description of the phase structure of the strong interaction in general.\n\nThe careful circumvention of the fermion sign problem in a way that preserved the solutions of the equation of motion as minima of the effective potential in {Ref.~\\cite{{Mintz:2012mz}}} allowed to derive a formalism to study homogeneous nucleation of bubbles in a first-order phase transition. An upper limit of the surface tension for bubble nucleation in the thin-wall approximation has been calculated. \nHere, we found that the Polyakov--Quark-Meson model with 2+1 quark flavours yields results similar to those of the two-flavour Quark-Meson model, so that the influence of both, the strange quark and the Polyakov loop at low temperatures is small. The conservative upper bound of $10\\,{\\mathrm{{MeV/fm}}}^2$ found for the surface tension allows a quick hadron-quark phase conversion.\n\nConcerning possible applications, an ingredient of investigations of quarkonium suppression in a quark-gluon plasma formed in heavy-ion collisions is the expansion of the plasma itself \\cite{Gossiaux:2009mk,Marty:2012vs}. Here, the temperature and density dependence of quark and meson masses found in the presented framework can serve as an input.\n\n\n\n\\ack\nWe thank Eduardo S.~Fraga, Hubert Hansen, Bruno W.~Mintz, Mario Mitter, Jan M.~Pawlowski, Tina K.~Herbst and Andreas Zacchi for valuable discussions and collaboration on related topics. RS acknowledges support by HIC for FAIR and the Service pour la science et la technologie pr\\`es l'Ambassade de France en Allemagne and Campus France.\n\n\n\\appendix\n\n\n\\section{Polyakov-loop potentials that respect the SU(3) group volume}\\label{app:PloopPots}\n\nThe potential of the Polyakov loop, ${\\mathcal{{U}}}\\!\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}};T}\\right)$ should mimic a background of gluons and controls the dynamics of the Polyakov loop.\nFirst computations of the effective potential in gauge theories have been performed in the 80's at asymptotically high temperatures using perturbation theory \\cite{Weiss:1980rj,Gross:1980br,Weiss:1981ev} and in the strong coupling limit on a lattice \\cite{Svetitsky:1985ye}.\nIn recent years, the non-perturbative Polyakov-loop potential has been studied using various different approaches \\cite{Braun:2007bx,Marhauser:2008fz,Braun:2009gm,Braun:2010cy,Pawlowski:2010ht,Sasaki:2012bi,Ruggieri:2012ny,Dumitru:2012fw,Diakonov:2012dx,Fukushima:2012qa,Reinhardt:2012qe,Kashiwa:2012td,Fister:2013bh,Fischer:2013eca,Herbst:2015ona}. First principle calculations of the potential are performed using different functional methods, mainly the FRG approach but as well Dyson-Schwinger equations and the 2PI-approach \\cite{Braun:2007bx,Marhauser:2008fz,Braun:2010cy,Fister:2013bh,Fischer:2013eca,Herbst:2015ona}.\nIn {Refs.~\\cite{{Braun:2009gm,Pawlowski:2010ht}}} the Polyakov-loop potential in two flavour QCD in the chiral limit has been analysed. This computation includes the full back-coupling of the matter sector on the propagators of the gauge degrees of freedom via dynamical quark-gluon interactions \\cite{Gies:2002hq,Braun:2006jd,Braun:2008pi,Braun:2014ata}.\\\\\nA much simpler way to obtain an effective Polyakov-loop potential  ${\\mathcal{{U}}}\\!\\left({\\Phi,{\\bar{\\Phi}};T}\\right)$ is to construct a potential that respects all given symmetries and contains the spontaneous breaking of Z(3) symmetry if the system is in the deconfined phase \\cite{Svetitsky:1982gs,Svetitsky:1985ye,Banks:1983me}.\nThe simplest terms that lead to a real potential, respect centre symmetry and are able to describe spontaneous symmetry breaking is a combination of terms of second and forth order ${\\mathcal{{U}}} \\sim p_2\\Phi{\\bar{\\Phi}} + p_4\\left({\\Phi{\\bar{\\Phi}}}\\right)^2$. The combination $\\Phi{\\bar{\\Phi}}$ is also invariant under $U\\!\\left({1}\\right)$ transformations. But the potential governing centre symmetry should not introduce any additional symmetries. Therefore, the potential has also to contain terms that break the global symmetry down from $O\\!\\left({2}\\right)$ to $Z\\!\\left({3}\\right)$. The simplest real term that is invariant under $Z\\!\\left({3}\\right)$ but breaks $U\\!\\left({1}\\right)$ and is symmetric under charge conjugation is $\\left({\\Phi^3+{\\bar{\\Phi}}^3}\\right)$.\nThe polynomial of the above mentioned terms form the minimal content of a Polyakov-loop potential \\cite{Pisarski:2000eq,Ratti:2005jh}, ${\\mathcal{{U}}} \\sim p_2\\!\\left({t}\\right) \\Phi{\\bar{\\Phi}} + p_3 \\left({\\Phi^3+{\\bar{\\Phi}}^3}\\right) + p_4 \\left({\\Phi{\\bar{\\Phi}}}\\right)^2$.\nThe coefficient $p_2$ has to be temperature dependent to realise the transition to a phase where $Z\\!\\left({3}\\right)$ symmetry is spontaneously broken.\nFor the later use, this temperature dependence is written in terms of a reduced temperature $t=\\left({T-T_{\\mathrm{{c}}}}\\right)/T_{\\mathrm{{c}}}$ where $T_{\\mathrm{{c}}}=T_0$ is in this case the transition temperature of the Polyakov-loop potential.\nA negative cubic term forces the nature of the transition to be of first order that would be of second order otherwise.\nThe coefficient of the forth order term has be positive so that the potential is bounded from below for large $\\Phi$ and ${\\bar{\\Phi}}$.\nThe ansatz for the Polyakov-loop potential can be enhanced by including the term that arrises if one integrates out the SU(3) group volume in the generating functional for the Euclidean action. This integration can be performed via the so-called Haar measure and takes the form of a Jacobian determinant. Its logarithm adds as an effective potential to the action in the generating functional.\nThis function already breaks the $U\\left({1}\\right)$ symmetry and with a positive coefficient the logarithm bounds the potential from below for large $\\Phi$ and ${\\bar{\\Phi}}$, so that one can drop the cubic and forth order terms of the polynomial while the kinetic part $\\sim \\Phi{\\bar{\\Phi}}$ remains \\cite{Fukushima:2003fw,Roessner:2006xn},\n\n\\begin{eqnarray}\n\t\\hskip-5ex \\frac{{\\mathcal{{U}}}_{\\mathrm{{log}}}\\left({\\Phi,{\\bar{\\Phi}},t}\\right)}{T^4} &=& p_2\\!\\left({t}\\right) \\Phi{\\bar{\\Phi}} + l\\!\\left({t}\\right) \\ln \\left[ 1 - 6 \\Phi{\\bar{\\Phi}} + 4 \\left({\\Phi^{3}+{\\bar{\\Phi}}^{3}}\\right) - 3 \\left({ \\Phi{\\bar{\\Phi}} }\\right)^{2}\\right]\\;.\n\t\\label{eq:PloopPot_log}\n\\end{eqnarray}\n\nThis potential is also qualitatively consistent with the leading order result of the strong coupling expansion \\cite{Gross:1983ju,Langelage:2010yr}.\nAn additional feature of the logarithmic term is that the potential diverges for $\\Phi,{\\bar{\\Phi}}\\to1$ thus limiting the Polyakov loop to be always smaller than one, reaching this value only asymptotically as $T\\to\\infty$. This is consistent with the relation of the Polyakov loop to the free energy of a static quark-antiquark pair.\\\\\nReference \\cite{Lo:2013hla} went beyond a minimal content for the Polyakov-loop potential and kept the higher order terms of the polynomial parametrisation of the Polyakov-loop potential and added the logarithmic term to consider the group volume additionally,\n\n\\begin{eqnarray}\n\t\\frac{{\\mathcal{{U}}}_{\\mathrm{{polylog}}}\\left({\\Phi,{\\bar{\\Phi}},t}\\right)}{T^4} &=& p_2\\!\\left({t}\\right) \\Phi{\\bar{\\Phi}} + p_3\\!\\left({t}\\right) \\left({\\Phi^3+{\\bar{\\Phi}}^3}\\right) + p_4\\!\\left({t}\\right) \\left({\\Phi{\\bar{\\Phi}}}\\right)^2 + \\nonumber\\\\\n\t&& + \\,l\\!\\left({t}\\right) \\ln \\left[ 1 - 6 \\Phi{\\bar{\\Phi}} + 4 \\left({\\Phi^{3}+{\\bar{\\Phi}}^{3}}\\right) - 3 \\left({ \\Phi{\\bar{\\Phi}} }\\right)^{2}\\right]\\;.\n\t\\label{eq:PloopPot_polylog}\n\\end{eqnarray}\n\n\nIn ${\\mathcal{{U}}}_{\\mathrm{{log}}}$ the temperature dependence of the coefficients is parametrised as a polynomial\n\n\\begin{eqnarray}\n\tc\\left({t}\\right) &=& \\sum_{n} \\frac{C_n}{\\left({1+t}\\right)^n}\\;,\n\\end{eqnarray}\n\nwhere $t=\\left({T-T_{\\mathrm{{c}}}}\\right)/T_{\\mathrm{{c}}}$ defines a reduced temperature and $T_{\\mathrm{{c}}}=T_0$ is in this case the transition temperature of the Polyakov-loop potential.\nThe coefficients of the polynomial-logarithmic parametrisation were defined in {Ref.~\\cite{{Lo:2013hla}}} in a more complex way,\n\n\\begin{eqnarray}\n\tp_i\\left({t}\\right) &=& \\left[P_0^{\\left({i}\\right)} + \\frac{P_1^{\\left({i}\\right)}}{1+t} +  \\frac{P_2^{\\left({i}\\right)}}{\\left({1+t}\\right)^2}\\right]\\Bigg/\\left[1 + \\frac{P_3^{\\left({i}\\right)}}{1+t} +  \\frac{P_4^{\\left({i}\\right)}}{\\left({1+t}\\right)^2}\\right]\n\\end{eqnarray}\n\nand\n\n\\begin{eqnarray}\n\tl\\!\\left({t}\\right) &=& \\frac{L_0}{\\left({1+t}\\right)^{L_1}} \\left[ 1- e^{{L_2}/{\\left({1+t}\\right)^{L_3}}} \\right]\\;.\n\\end{eqnarray}\n\nThe number of independent parameters of the parametrisations can be reduced by imposing some general constraints. One condition is that the Polyakov-loop variables approach unity for large temperatures. A necessary condition for the expectation values of the Polyakov loops is ${\\partial}{\\mathcal{{U}}}/{\\partial}\\Phi = {\\partial}{\\mathcal{{U}}}/{\\partial}{\\bar{\\Phi}} = 0$. To fix further parameters one applies and restricts the Polyakov-loop potential to pure gauge (Yang-Mills) theory.\nThe non-presence of dynamical quarks restricts the Polyakov-loop variable to be real, $\\Phi={\\bar{\\Phi}}$. At the transition scale of the Polyakov-loop potential $T_0$, a first order phase transition is required. If a reliable prediction of the value of the Polyakov-loop at the phase transition would be available it would further constrain the parameters. Furthermore, a gas of ${N_{\\mathrm{{c}}}}-1$ non-interacting, massless gluons should approach its Stefan-Boltzmann limit as $T\\to\\infty$.\nThe remaining open parameters are determined in {Refs.~\\cite{{Scavenius:2002ru,Ratti:2005jh,Roessner:2006xn,Lo:2013hla}}} by fitting both the lattice data for pressure, entropy density and energy density and the evolution of the Polyakov loop $\\langle \\Phi \\rangle$ on the lattice in pure gauge theory. Reference~\\cite{Lo:2013hla} adjusted their parameters in addition to lattice data of the longitudinal and transverse Polyakov-loop susceptibilities.\nThe different parameter sets are summarised in {Table~\\ref{{tab:Ploop_pot_params}}}.\n\n\\begin{table}\n\t\\caption{Parameters of the different parametrisations of the Polyakov-loop potential for fits to the lattice Yang-Mills simulations \\cite{Kaczmarek:2002mc,Boyd:1996bx} and \\cite{Lo:2013etb,Borsanyi:2012ve}.}\n\t\\begin{center}\n\t\t\\begin{tabular}{lcccccc}\n\t\t\t\\hline\\hline\\vspace{-0.3cm}\\\\\n\t\t\t        \t\t\t\t\t\t\t& $P_0$\t& $P_1$\t& $P_2$\t& $P_3$\t\\\\\n\t\t\tLog \\cite{Roessner:2006xn} \t\t& -1.755 \t& 1.235 \t& -7.6 \t&-1.75\t\\\\\n\t\t\t\\vspace{-0.3cm}\\\\\\hline\\vspace{-0.3cm}\\\\\n\t\t\tPoly-Log \\cite{Lo:2013hla}\t\t& $P_0^{\\left({2}\\right)}$\t& $P_1^{\\left({2}\\right)}$\t& $P_2^{\\left({2}\\right)}$\t& $P_3^{\\left({2}\\right)}$\t& $P_4^{\\left({2}\\right)}$\t\\\\\n\t\t\t\t\t\t\t\t\t\t& 22.07\t\t\t& -75.7\t\t\t& 45.03385\t\t& 2.77173\t\t& 3.56403\t\\\\\n\t\t\t\t\t\t\t\t\t\t& $P_0^{\\left({3}\\right)}$\t& $P_1^{\\left({3}\\right)}$\t& $P_2^{\\left({3}\\right)}$\t& $P_3^{\\left({3}\\right)}$\t& $P_4^{\\left({3}\\right)}$\t\\\\\n\t\t\t\t\t\t\t\t\t\t& -25.39805\t\t& 57.019\t\t\t& -44.7298\t\t& 3.08718\t\t& 6.72812\t\\\\\n\t\t\t\t\t\t\t\t\t\t& $P_0^{\\left({4}\\right)}$\t& $P_1^{\\left({4}\\right)}$\t& $P_2^{\\left({4}\\right)}$\t& $P_3^{\\left({4}\\right)}$\t& $P_4^{\\left({4}\\right)}$\t\\\\\n\t\t\t\t\t\t\t\t\t\t& 27.0885\t\t\t& -56.0859\t\t\t& 71.2225\t\t& 2.9715\t\t& 6.61433\t\\\\\n\t\t\t\t\t\t\t\t\t\t& $L_0$\t\t\t& $L_1$\t\t\t& $L_2$\t\t\t& $L_3$\t\\\\\n\t\t\t\t\t\t\t\t\t\t& -0.32665\t\t& -82.9823\t\t& 3.0\t\t\t\t& 5.85559\\\\\\vspace{-0.3cm}\\\\\t\t\t\t\t\n\t\t\t\\hline\\hline\n\t\t\\end{tabular}\n\t\\end{center}\n\t\\label{tab:Ploop_pot_params}\n\\end{table}\n\nResults for quantities that characterise the Polyakov-loop potential are given in {Table~\\ref{{tab:Ploop_pot_data}}}.\n\n\\begin{table}\n\t\\caption{Numbers characterising the Polyakov-loop potential. It should be $\\Phi_{T\\to\\infty}=1$, $\\left({{\\mathcal{{U}}}/p_{\\mathrm{{SB}}}}\\right)_{T\\to\\infty}=1$ and ${\\mathcal{{U}}}\\left({\\Phi_{t=0}}\\right)=0$.}\n\t\\begin{center}\n\t\t\\begin{tabular}{lcrcc}\n\t\t\t\\hline\\hline\\vspace{-0.3cm}\\\\\n\t\t\t        \t\t& $\\Phi_{t=0}$\t& ${\\mathcal{{U}}}/T^4\\left({\\Phi_{t=0}}\\right)$\t& $\\Phi_{T\\to\\infty}$\t& $\\left({{\\mathcal{{U}}}/p_{\\mathrm{{SB}}}}\\right)_{T\\to\\infty}$\t\\\\\n\t\t\t\\vspace{-0.3cm}\\\\\\hline\\vspace{-0.3cm}\\\\\n\t\t\tLog\t\t& 0.449\t\t& $-8.84\\times10^{-4}$\t\t& 1.0\t\t\t\t& 1.0\t\t\\\\\n\t\t\tPoly-Log\t& 0.348 \t\t& $-1.18\\times10^{-4}$\t\t& 1.0\t\t\t\t& 0.933\t\\\\\n\t\t\t\\vspace{-0.3cm}\\\\\t\n\t\t\t\\hline\\hline\n\t\t\\end{tabular}\n\t\\end{center}\n\t\\label{tab:Ploop_pot_data}\n\\end{table}\n\nAn apparent difference is that the polynomial-logarithmic parametrisation reaches only $\\sim93\\,\\%$ of the high temperature expectation.\nFigure \\ref{fig:PolPots_t0} compares the form of the potentials at their critical scale, i.e.~at $t=0$.\n\\begin{figure}\n\t\\includegraphics[width=0.6\\textwidth]{PolPot_onlylogs}\n\t\\hskip-10ex\n\t\\begin{minipage}[b]{0.5\\textwidth}\n\t\t\\caption{\\label{fig:PolPots_t0}Polyakov-loop potentials at their transition scale $t=0$.}\n\t\\end{minipage}\n\\end{figure}\nIt shows another important difference between the different parametrisations. The barrier between the two minima at the transition temperature differs in its width and height between the different parametrisations. This affects nucleation in Yang-Mills theory and we be discussed in {Ref.~\\cite{{Mintz:2012mz}}} how one can account partially for the impact of these different barriers on nucleation within the Polyakov--Quark-Meson model and how they influence the result of the surface tension.\n\nRewritten as functions of the real variables ${\\Phi_{\\mathrm{{r}}}}=\\left({\\Phi+{\\bar{\\Phi}}}\\right)/{2}$ and ${\\Phi_{\\mathrm{{i}}}}=\\left({\\Phi-{\\bar{\\Phi}}}\\right)/{2}$, the parametrisations of the Polyakov-loop potential are\n\n\\begin{eqnarray}\n\t\\hskip-15ex \\frac{{\\mathcal{{U}}}_{\\mathrm{{log}}}\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}},t}\\right)}{T^4} &=& p_2\\!\\left({t}\\right) \\left({{\\Phi_{\\mathrm{{r}}}}^2+{\\Phi_{\\mathrm{{i}}}}^2}\\right) +{\\nonumber}\\\\\n\t&&+l\\!\\left({t}\\right) \\ln \\left[ 1 - 6\\left({{\\Phi_{\\mathrm{{r}}}}^2 + {\\Phi_{\\mathrm{{i}}}}^2}\\right) + 8 \\left({ {\\Phi_{\\mathrm{{r}}}}^3 - 3{\\Phi_{\\mathrm{{r}}}}{\\Phi_{\\mathrm{{i}}}}^2}\\right) - 3 \\left({{\\Phi_{\\mathrm{{r}}}}^2 + {\\Phi_{\\mathrm{{i}}}}^2}\\right)^2\\right]\\;,\\label{eq:LogPloopPot_ri} \\\\\n\t\\hskip-15ex \\frac{{\\mathcal{{U}}}_{\\mathrm{{polylog}}}\\left({{\\Phi_{\\mathrm{{r}}}},{\\Phi_{\\mathrm{{i}}}},t}\\right)}{T^4} &=& p_2\\!\\left({t}\\right) \\left({{\\Phi_{\\mathrm{{r}}}}^2+{\\Phi_{\\mathrm{{i}}}}^2}\\right) + 2 p_3\\!\\left({t}\\right) \\left({{\\Phi_{\\mathrm{{r}}}}^2  -3{\\Phi_{\\mathrm{{r}}}}{\\Phi_{\\mathrm{{i}}}}^2}\\right) + p_4\\!\\left({t}\\right) \\left({{\\Phi_{\\mathrm{{r}}}}^2+{\\Phi_{\\mathrm{{i}}}}^2}\\right)^2 +{\\nonumber} \\\\\n\t&&+ l\\!\\left({t}\\right) \\ln \\left[ 1 - 6\\left({{\\Phi_{\\mathrm{{r}}}}^2 + {\\Phi_{\\mathrm{{i}}}}^2}\\right) + 8 \\left({ {\\Phi_{\\mathrm{{r}}}}^3 - 3{\\Phi_{\\mathrm{{r}}}}{\\Phi_{\\mathrm{{i}}}}^2}\\right) - 3 \\left({{\\Phi_{\\mathrm{{r}}}}^2 + {\\Phi_{\\mathrm{{i}}}}^2}\\right)^2\\right]\\;.\\label{eq:PolyLogPloopPot_ri}\n\\end{eqnarray}\n\n\n\\vskip5ex\n\n\\bibliographystyle{utphys}\n\\bibliography{../references}\n\n\n", "itemtype": "equation", "pos": 18372, "prevtext": "\n\nThe comparison of the potentials yields that the relation between the two temperature scales\n\n\n", "index": 3, "text": "\\begin{equation}\n\tt_{\\mathrm{{YM}}} (t_{\\mathrm{{glue}}}) \\approx 0.57\\, t_{\\mathrm{{glue}}}\\;\n\t\\label{eq:tYMtglue}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"t_{\\mathrm{{YM}}}(t_{\\mathrm{{glue}}})\\approx 0.57\\,t_{\\mathrm{{glue}}}\\;\" display=\"block\"><mrow><mrow><msub><mi>t</mi><mi>YM</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>glue</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><mpadded width=\"+1.7pt\"><mn>0.57</mn></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><msub><mi>t</mi><mi>glue</mi></msub></mpadded></mrow></mrow></math>", "type": "latex"}]