[{"file": "1601.04093.tex", "nexttext": "\nwhere ${\\mu}_i$ and ${\\delta}_{iz}$, $z = 1, \\ldots, M$, are measurable and adapted processes. The growth rates and volatilities ${\\mu}_i$ and ${\\delta}_{iz}$ are general and practically unrestricted (they can depend on any household characteristics), having only to satisfy a few basic regularity conditions that are discussed in Appendix \\ref{assumptions}. These conditions imply that the wealth processes for the households in the economy are continuous semimartingales, which represent a broad class of stochastic processes (for a detailed discussion, see \\citealp{Karatzas/Shreve:1991}).\\footnote{This basic setup shares much in common with the continuous-time finance literature (see, for example, \\citealp{Karatzas/Shreve:1998,Duffie:2001}). Continuous semimartingales are more general than It{\\^o} processes, which are common in the continuous-time finance literature \\citep{Nielsen:1999}.} Indeed, the martingale representation theorem \\citep{Nielsen:1999} implies that any plausible continuous wealth process can be written in the nonparametric form of equation \\eqref{wealthDynamics}. Furthermore, this section's results are also likely to apply to wealth processes that are subject to sporadic, discontinuous jumps.\\footnote{In a less general setting, \\citet{Fernholz:2015a} presents such an extension motivated by the fact that a function with sporadic, discontinuous jumps can be approximated arbitrarily well by a continuous function.} \n\n\n\nThe general, nonparametric structure of our approach implies that almost all previous empirical and theoretical models of income and wealth represent special cases of equation \\eqref{wealthDynamics}. Indeed, most of the theoretical literature on wealth distribution assumes that households are ex-ante symmetric and hence that the growth rate parameters ${\\mu}_i$ and the standard deviation parameters ${\\delta}_{iz}$ in equation \\eqref{wealthDynamics} do not persistently differ across households \\citep{Benhabib/Bisin/Zhu:2011,Jones/Kim:2014,Fernholz:2015a}.\\footnote{If it is assumed that households are ex-ante symmetric, however, then we can do even more with this setup. In particular, it is possible to describe the extent of economic mobility in the economy and examine the relationship between mobility and inequality. See \\citet{Fernholz:2015a} for a detailed discussion.} This ex-ante symmetry is, for example, a key assumption of any analyses based on Gibrat's law \\citep{Gabaix:1999,Gabaix:2009}. Even when the parameters ${\\mu}_i$ and ${\\delta}_{iz}$ do persistently differ across households, such as in much of the empirical literature on income processes \\citep{Guvenen:2009,Browning/Ejrnaes/Alvarez:2010}, this heterogeneity is usually constrained by some specific parametric structure. In this sense, then, our model encompasses and extends much of the previous related literature.\n\nOne of the model's assumptions ensures that no two households' wealth dynamics are perfectly correlated over time. In other words, markets are incomplete and all households face at least some idiosyncratic risk to their wealth holdings. This assumption is consistent with both the Bewley models of uninsurable labor income risk \\citep{Aiyagari:1994,Krussel/Smith:1998} and the more recent literature that considers uninsurable capital income risk \\citep{Angeletos/Calvet:2006,Benhabib/Bisin/Zhu:2011,Fernholz:2015a}. This section's results characterize the effect of idiosyncratic risk to households' wealth holdings on inequality.\n\nIt is useful to describe the dynamics of total wealth for the economy, which we denote by $w(t) = w_1(t) + \\cdots + w_N(t)$. In order to do so, we first characterize the covariance of wealth across different households over time. For all $i, j = 1, \\ldots, N$, let the covariance process ${\\rho}_{ij}$ be given by\n\n", "itemtype": "equation", "pos": 20306, "prevtext": "\n\n\n\\centerline{\\bf \\LARGE{A Statistical Model of Inequality}}\n\n\\blfootnote{I would like to thank seminar participants at Princeton University, UT Austin, and the University of Houston for their helpful comments. All remaining errors are my own.}\n\n\n\n\n\n\n\n\\vskip 5pt\n\n\n\n\n\\vskip 25pt\n\n\\centerline{\\large{Ricardo T. Fernholz\\symbolfootnote[1]{Robert Day School of Economics and Finance, Claremont McKenna College, 500 E. Ninth St., Claremont, CA 91711, rfernholz@cmc.edu.}}}\n\n\\vskip 3pt\n\n\\centerline{Claremont McKenna College}\n\n\\vskip 35pt\n\n\n\n\n\n\\centerline{\\large{\\today}}\n\n\\vskip 70pt\n\n\\begin{abstract}\nThis paper develops a nonparametric statistical model of wealth distribution that imposes little structure on the fluctuations of household wealth. In this setting, we use new techniques to obtain a closed-form household-by-household characterization of the stable distribution of wealth and show that this distribution is shaped entirely by two factors---the reversion rates (a measure of cross-sectional mean reversion) and idiosyncratic volatilities of wealth across different ranked households. By estimating these factors, our model can exactly match the U.S. wealth distribution. This provides information about the current trajectory of inequality as well as estimates of the distributional effects of progressive capital taxes. We find evidence that the U.S. wealth distribution might be on a temporarily unstable trajectory, thus suggesting that further increases in top wealth shares are likely in the near future. For capital taxes, we find that a small tax levied on just 1\\% of households substantially reshapes the distribution of wealth and reduces inequality.\n\\end{abstract}\n\n\n\n\n\n\\vskip 30pt\n\nJEL Codes: E21, C14, D31\n\nKeywords: wealth distribution, inequality, capital taxes, nonparametric methods\n\n\\vfill\n\n\n\\pagebreak\n\n\n\\section{Introduction} \\label{intro}\n\nRecent trends in income and wealth inequality have drawn much attention from both academic researchers and the general public. The detailed empirical work of \\citet{Atkinson/Piketty/Saez:2011}, \\citet{Davies/Sandstrom/Shorrocks/Wolff:2011}, and \\citet{Piketty:2014}, among others, documents these trends for many different countries around the world and has prompted a substantive debate about their underlying causes and the appropriate policy responses, if any. The changing nature of inequality in recent decades has also raised questions about whether these trends will reverse or continue in the future.\n\nTo address these questions empirically, we develop a statistical model of inequality derived from a more general empirical approach to rank-based processes. The model features explicitly heterogeneous households that are subject to both aggregate and idiosyncratic fluctuations in their wealth holdings. In contrast to much of the related empirical literature on income dynamics (see, for example, \\citealp{Browning/Ejrnaes/Alvarez:2010,Altonji/Smith/Vidangos:2013}), we impose no parametric structure on the underlying processes of household wealth accumulation and do not model or estimate these processes directly. Despite the minimal structure of our approach, we use new techniques to obtain a closed-form household-by-household characterization of the stable distribution of wealth.\\footnote{In a closely related theoretical paper, \\citet{Fernholz:2015a} uses these same techniques to characterize equilibrium wealth dynamics in an incomplete markets model. While this theoretical approach is necessarily less general than this paper's empirical approach, it demonstrates that our nonparametric techniques are perfectly consistent with general equilibrium.}\n\n\n\nOur characterization of the distribution of wealth yields several new results. First, we show that the stable distribution is shaped entirely by two factors---the reversion rates and idiosyncratic volatilities of wealth for different ranked households. The reversion rates of household wealth measure the rate at which household wealth cross-sectionally reverts to the mean. Because our approach allows for wealth growth rates and volatilities that vary across different ranks in the distribution, one of this paper's contributions is to extend and generalize beyond previous work that relied on the homogeneity of Gibrat's law \\citep{Gabaix:1999,Gabaix:2009}. \n\n\n\n\n\nOur statistical model can replicate any empirical distribution. Using the detailed new wealth shares data of \\citet{Saez/Zucman:2014}, we construct such a match for the 2012 U.S. wealth distribution. According to these data, there has been a clear upward trend in top wealth shares since the mid-1980s, a fact that raises significant doubt about any model that relies on an assumed steady-state or stable distribution of wealth. One innovation of our empirical approach is that it can account for changing top wealth shares and generate estimates of the future stable distribution of wealth. We provide such empirical estimates for several different scenarios for the current underlying trend in top U.S. wealth shares. These estimates yield insight into the changing nature of inequality today. In particular, our results indicate that according to the wealth shares data of \\citet{Saez/Zucman:2014}, the U.S. distribution of wealth might be on a temporarily unstable trajectory in which it splits into two divergent subpopulations, each of which forms a separate stable distribution. This unsustainable scenario suggests that further increases in the wealth shares of a tiny minority of households are likely in the near future.\n\n\n\n\n\nThe flexibility of our empirical framework allows us, in principle, to estimate the distributional effects of any tax policy. In practice, these estimates are likely to be most accurate in the case of capital taxes, since the effects of such taxes on the rate of cross-sectional mean reversion are easier to approximate. Under the assumption that a 1\\% capital tax reduces the growth rate of wealth for a household paying that tax by 1\\%, we show that a progressive capital tax of 1-2\\% levied on just 1\\% of households substantially reshapes the distribution of wealth and reduces inequality. The exact impact of this capital tax depends on the future stable U.S. distribution of wealth, but in all cases we find that this tax---which is similar to that proposed by \\citet{Piketty:2014}---significantly increases the share of total wealth held by the bottom 90\\% of households in the economy.\n\nThere are a number of purely empirical models of income distribution. Both \\citet{Guvenen:2009} and \\citet{Guvenen/Karahan/Ozkan/Song:2015}, for example, construct statistical models that replicate many aspects of the U.S. distribution of income. \\citet{Browning/Ejrnaes/Alvarez:2010} and \\citet{Altonji/Smith/Vidangos:2013} use indirect inference techniques to estimate detailed statistical models of household income dynamics, while \\citet{Bonhomme/Robin:2010} use nonparametric techniques to analyze the different shocks that affect household earnings. In addition to the fact that this paper analyzes the distribution of wealth rather than income, an important difference between this empirical literature and our approach is that we impose minimal structure on the underlying processes of household wealth accumulation and instead model the distribution of wealth directly. We view this paper and the empirical literature on income dynamics as complements, since we focus on inequality and distributional issues and show that a parametric empirical approach is not necessary to address these issues.\n\n\nThere is also an extensive theoretical literature that considers the implications of both uninsurable labor income risk and uninsurable capital income risk in different macroeconomic settings. In a simple Solow growth model setting, for example, \\citet{Nirei:2009} shows that introducing uninsurable investment risk yields a realistic Pareto distribution for top income and wealth shares. \\citet{Jones/Kim:2014} consider a model in which entrepreneurs face heterogeneous shocks to their human capital and corresponding income, and then examine the implications of different technological and policy shocks in this setting. Adopting a more general approach, \\citet{Gabaix:2009} examines several different types of stochastic processes that generate realistic steady-state Pareto distributions and that can be applied to topics ranging from the distribution of wealth to CEO compensation.\\footnote{It is also possible to generate a realistic Pareto distribution of wealth in the absence of uninsurable labor and capital income risk. See, for example, \\citet{Jones:2014}, who accomplishes this using a simple birth-death process combined with standard wealth accumulation dynamics.}\n\n\\citet{Benhabib/Bisin/Zhu:2011,Benhabib/Bisin/Zhu:2014} derive similarly realistic steady-state wealth distributions in a setup in which households face uninsurable investment risk and optimally choose how to consume and invest. In a closely related paper, \\citet{Fernholz:2015a} uses techniques similar to this paper to replicate the U.S. wealth distribution in an environment in which rational, forward-looking households face uninsurable investment risk. The theoretical literature that considers the implications of uninsurable labor income risk is even more extensive, and includes \\citet{Krussel/Smith:1998} and \\citet{Castaneda/DiazGimenez/RiosRull:2003}, among others.\\footnote{For a general survey of this literature, see \\citet{Cagetti/DeNardi:2008}.}\n\nThis paper combines elements of these empirical and theoretical literatures on income and wealth distributions. Although we focus on the distribution of wealth, it should be noted that our techniques, results, and general approach can be applied to any rank-based system for which there is stability and some continuity. Indeed, only for unstable processes where the distribution frequently and rapidly changes is our model clearly inappropriate. In terms of the broader literature on power laws in economics and finance, then, our contribution extends previous work by \\citet{Gabaix:1999,Gabaix:2009} and others who rely on equal growth rates and volatilities throughout various distributions as implied by Gibrat's law.\n\nOne of the central contributions of this paper is to construct a model that can generate an exact household-by-household match for any empirical distribution while imposing few restrictions on the underlying household wealth processes. Indeed, our approach imposes no parametric structure on either the behavior of households or the types of shocks that those households face. Furthermore, we do not assume that all households are the same ex-ante, which contrasts with many theoretical models of wealth inequality despite the empirical evidence in support of heterogeneous income profiles \\citep{Guvenen:2007,Browning/Ejrnaes/Alvarez:2010}. The only assumptions that we do impose are that household wealth can be reasonably modeled by continuous semi-martingales satisfying certain basic regularity conditions and that the distribution of wealth across households is asymptotically stable. In this way, our model and results characterize the stable distribution of wealth in a more general setting than in the previous literature.\n\nAccording to our characterization, the share of wealth held for each rank in the distribution depends only on the reversion rates and idiosyncratic volatilities of wealth for different ranked households. Regardless of how complex the underlying economic environment is, these two rank-based factors measure all aspects of this environment that are relevant to the stable distribution of wealth. As a consequence, the effect of any economic change on inequality can potentially be inferred from its effect on mean reversion and idiosyncratic volatility. In this way, our model provides a simple unified framework by which we may understand the distributional impact of many of the most important developments of the past few decades, such as skill-biased technical change, globalization, and changes in institutions and tax policies.\n\nIn order to match the model to the 2012 U.S. distribution of wealth, we estimate the idiosyncratic volatility of wealth for households across different ranks using previous work on the volatility of uninsurable investments \\citep{Flavin/Yamashita:2002,Moskowitz/Vissing-Jorgensen:2002} and labor income \\citep{Guvenen/Karahan/Ozkan/Song:2015}. With these volatility estimates, we are able to infer the implied values for the reversion rates of wealth for different ranked households. These rank-based reversion rates generate a perfect match of a stable 2012 U.S. wealth distribution.\n\nThe wealth shares data of \\citet{Saez/Zucman:2014}, however, show a clear upward trend in top wealth shares starting in the mid-1980s, which is not consistent with a stable distribution. One contribution of this paper is to introduce a methodology that addresses these stability issues and can provide estimates of the future stable distribution of wealth. In other words, even though the U.S. distribution of wealth may currently be transitioning and not stable, we can still estimate where this distribution is transitioning to. One of the strengths of these estimates is that they are purely empirical and rely on no assumptions about the underlying causes of increasing inequality. In order to generate these estimates, we adjust the reversion rates for different ranked households to account for any trends in top wealth shares. Because there is substantial uncertainty about these trends, we consider several alternative scenarios for the underlying current trend in top U.S. wealth shares and estimate the trajectory of the U.S. distribution of wealth for each scenario. These estimates reveal that the future stable distribution of wealth is quite sensitive to changes in the underlying trend in top wealth shares. These estimates are, to our knowledge, the first purely empirical estimates of the changing nature of U.S. inequality.\n\n\n\nEvery alternative scenario that we consider for the underlying current trend in top U.S. wealth shares is below the rate of increasing top shares for the last few decades as reported by \\citet{Saez/Zucman:2014}.\\footnote{This is not true of all wealth shares data, however. Some studies based on the \\emph{Survey of Consumer Finances} (SCF), for example, find smaller (or no) increases in top shares \\citep{Wolff:2010}. This is one reason why we consider many different scenarios for the current trend in top shares. Furthermore, our model is easily adjusted to match any wealth shares data and any underlying trend in top shares.} The reason we do not consider a higher-trend scenario is that the rate of increasing top shares over the past few decades is difficult to reconcile with any stable distribution of wealth. In effect, our model suggests that the changes in top shares reported by \\citet{Saez/Zucman:2014} might only be consistent with a divergent trajectory in which the U.S. wealth distribution separates into two subpopulations. This trajectory, in which a tiny minority of wealthy households will eventually hold all wealth, is unlikely to continue indefinitely, thus suggesting that some aspect of the economic environment is likely to change.\n\n\n\nThe result that inequality is entirely determined by two statistical factors means that, in principle, our framework can provide estimates about the effects of different tax policies on the distribution of wealth. All that is necessary to generate these estimates are the effects of these different tax policies on mean reversion and idiosyncratic volatilities of wealth for different ranked households. In practice, however, obtaining precise measurements of the differential impact of certain tax policies on households throughout the distribution of wealth is quite difficult. One important exception is the case of progressive capital taxes. The approach of this paper is uniquely suited to estimating the distributional effects of capital taxes because such taxes have more predictable effects on reversion rates. In particular, for the estimates we present in this paper, we assume that a 1\\% capital tax reduces the growth rate of wealth for a household paying that tax by 1\\%. Because reversion rates are measured as minus the growth rate of wealth relative to the economy for different ranked households, this 1\\% capital tax will also raise the taxed household's reversion rate by 1\\%. This assumption ignores any behavioral responses and distortions caused by taxes, but it is nonetheless a useful starting scenario to consider the distributional effects of progressive taxation. By adjusting the effect of capital taxes on the rank-based reversion rates, it is straightforward to extend this analysis to include any potential behavioral responses.\n\nUsing our model of the 2012 U.S. wealth distribution, we estimate the impact on inequality of a progressive capital tax of 1-2\\% levied on 1\\% of households in the economy. This tax is similar to the tax proposed by \\citet{Piketty:2014}, and although its full effect depends on the future stable U.S. distribution of wealth, in all cases we find that this capital tax substantially reduces inequality and reshapes the distribution of wealth. Indeed, if the 2012 U.S. wealth distribution is assumed to be stable, then our estimates suggest that this tax would reduce inequality to levels comparable to those observed in the U.S. in the 1970s. We stress that this result is not a statement about total welfare and not an endorsement of a progressive capital tax. Our model does not incorporate or measure any distortions or other costs typically associated with taxes. Instead, our analysis of the distributional effects of progressive capital taxes is meant only to enhance our overall understanding of the implications of such a policy. After all, much of the recent discussion of capital taxes has focused on how they might increase government revenues or distort economic outcomes rather than how they might affect inequality and the distribution of wealth. This paper addresses this gap in our knowledge.\n\n\n\nThe rest of this paper is organized as follows. Section \\ref{bench} presents the model and characterizes the stable distribution of wealth. Section \\ref{empiricalApps} presents several empirical applications of the model, including an analysis of the current trajectory of the U.S. wealth distribution and an estimate of the effect of progressive capital taxes on inequality. Section \\ref{conclusion} concludes. A discussion of the assumptions underlying the model and results is in Appendix \\ref{assumptions}, while all of the proofs from the paper are in Appendix \\ref{proofs}.\n\n\n\n\n\n\\vskip 70pt\n\n\n\n\\section{Model} \\label{bench}\n\nConsider an economy that is populated by $N > 1$ households.\\footnote{For consistency and simplicity, we shall refer to households holding wealth throughout this section. However, it is important to note that our approach and results are applicable to many other empirical distributions, as mentioned in the introduction.} Time is continuous and denoted by $t \\in {[\\,0,\\infty)}$, and uncertainty in this economy is represented by a filtered probability space $({\\Omega}, {\\CMcal{F}}, {\\CMcal{F}}_t, P)$. Let $\\mathbf{B}(t) = (B_1(t), \\ldots, B_M(t))$, $t \\in [0, \\infty)$, be an $M$-dimensional Brownian motion defined on the probability space, with $M \\geq N$. We assume that all stochastic processes are adapted to $\\{{\\CMcal{F}}_t; t \\in [0, \\infty)\\}$, the augmented filtration generated by $\\mathbf{B}$.\\footnote{In order to simplify the exposition, we shall omit many of the less important regularity conditions and technical details involved with continuous-time stochastic processes.}\n\n\n\\subsection{Household Wealth Dynamics}\nThe total wealth of each household $i = 1, \\ldots, N$ in this economy is given by the process $w_i$.\\footnote{By considering a discrete set of explicitly heterogeneous households, this model deviates from much of the previous literature in which there is a continuum of households. This assumption is necessary for our approach and provides analytical tractability and detail in our results.} Each of these wealth processes evolves according to the stochastic differential equation\n\n", "index": 1, "text": "\\begin{equation} \\label{wealthDynamics}\n d\\log w_i(t) = {\\mu}_i(t)\\,dt + \\sum_{z=1}^M{\\delta}_{iz}(t)\\,dB_z(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"d\\log w_{i}(t)={\\mu}_{i}(t)\\,dt+\\sum_{z=1}^{M}{\\delta}_{iz}(t)\\,dB_{z}(t),\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nApplying {It{\\^o}}'s Lemma to equation \\eqref{wealthDynamics}, we are now able to describe the dynamics of the total wealth process $w$.\n\n\\begin{lem} \\label{totalWealthLemma}\nThe dynamics of the process for total wealth in the economy $w$ are given by\n\n", "itemtype": "equation", "pos": 24236, "prevtext": "\nwhere ${\\mu}_i$ and ${\\delta}_{iz}$, $z = 1, \\ldots, M$, are measurable and adapted processes. The growth rates and volatilities ${\\mu}_i$ and ${\\delta}_{iz}$ are general and practically unrestricted (they can depend on any household characteristics), having only to satisfy a few basic regularity conditions that are discussed in Appendix \\ref{assumptions}. These conditions imply that the wealth processes for the households in the economy are continuous semimartingales, which represent a broad class of stochastic processes (for a detailed discussion, see \\citealp{Karatzas/Shreve:1991}).\\footnote{This basic setup shares much in common with the continuous-time finance literature (see, for example, \\citealp{Karatzas/Shreve:1998,Duffie:2001}). Continuous semimartingales are more general than It{\\^o} processes, which are common in the continuous-time finance literature \\citep{Nielsen:1999}.} Indeed, the martingale representation theorem \\citep{Nielsen:1999} implies that any plausible continuous wealth process can be written in the nonparametric form of equation \\eqref{wealthDynamics}. Furthermore, this section's results are also likely to apply to wealth processes that are subject to sporadic, discontinuous jumps.\\footnote{In a less general setting, \\citet{Fernholz:2015a} presents such an extension motivated by the fact that a function with sporadic, discontinuous jumps can be approximated arbitrarily well by a continuous function.} \n\n\n\nThe general, nonparametric structure of our approach implies that almost all previous empirical and theoretical models of income and wealth represent special cases of equation \\eqref{wealthDynamics}. Indeed, most of the theoretical literature on wealth distribution assumes that households are ex-ante symmetric and hence that the growth rate parameters ${\\mu}_i$ and the standard deviation parameters ${\\delta}_{iz}$ in equation \\eqref{wealthDynamics} do not persistently differ across households \\citep{Benhabib/Bisin/Zhu:2011,Jones/Kim:2014,Fernholz:2015a}.\\footnote{If it is assumed that households are ex-ante symmetric, however, then we can do even more with this setup. In particular, it is possible to describe the extent of economic mobility in the economy and examine the relationship between mobility and inequality. See \\citet{Fernholz:2015a} for a detailed discussion.} This ex-ante symmetry is, for example, a key assumption of any analyses based on Gibrat's law \\citep{Gabaix:1999,Gabaix:2009}. Even when the parameters ${\\mu}_i$ and ${\\delta}_{iz}$ do persistently differ across households, such as in much of the empirical literature on income processes \\citep{Guvenen:2009,Browning/Ejrnaes/Alvarez:2010}, this heterogeneity is usually constrained by some specific parametric structure. In this sense, then, our model encompasses and extends much of the previous related literature.\n\nOne of the model's assumptions ensures that no two households' wealth dynamics are perfectly correlated over time. In other words, markets are incomplete and all households face at least some idiosyncratic risk to their wealth holdings. This assumption is consistent with both the Bewley models of uninsurable labor income risk \\citep{Aiyagari:1994,Krussel/Smith:1998} and the more recent literature that considers uninsurable capital income risk \\citep{Angeletos/Calvet:2006,Benhabib/Bisin/Zhu:2011,Fernholz:2015a}. This section's results characterize the effect of idiosyncratic risk to households' wealth holdings on inequality.\n\nIt is useful to describe the dynamics of total wealth for the economy, which we denote by $w(t) = w_1(t) + \\cdots + w_N(t)$. In order to do so, we first characterize the covariance of wealth across different households over time. For all $i, j = 1, \\ldots, N$, let the covariance process ${\\rho}_{ij}$ be given by\n\n", "index": 3, "text": "\\begin{equation} \\label{rhoIJ}\n  {\\rho}_{ij}(t) = \\sum_{z = 1}^M{\\delta}_{iz}(t){\\delta}_{jz}(t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\rho}_{ij}(t)=\\sum_{z=1}^{M}{\\delta}_{iz}(t){\\delta}_{jz}(t).\" display=\"block\"><mrow><mrow><mrow><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nwhere\n\n", "itemtype": "equation", "pos": 24601, "prevtext": "\nApplying {It{\\^o}}'s Lemma to equation \\eqref{wealthDynamics}, we are now able to describe the dynamics of the total wealth process $w$.\n\n\\begin{lem} \\label{totalWealthLemma}\nThe dynamics of the process for total wealth in the economy $w$ are given by\n\n", "index": 5, "text": "\\begin{equation} \\label{totalWealthDynamics}\n d\\log w(t) = {\\mu}(t)\\,dt + \\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t), {\\quad\\text{\\rm a.s.}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"d\\log w(t)={\\mu}(t)\\,dt+\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(t){\\delta}_{iz}%&#10;(t)\\,dB_{z}(t),{\\quad\\text{\\rm a.s.}},\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mi>w</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor $i = 1, \\ldots, N$, and\n\n", "itemtype": "equation", "pos": 24782, "prevtext": "\nwhere\n\n", "index": 7, "text": "\\begin{equation} \\label{shares}\n \\theta_i(t) = \\frac{w_i(t)}{w(t)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\theta_{i}(t)=\\frac{w_{i}(t)}{w(t)},\" display=\"block\"><mrow><mrow><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\\end{lem}\n\nIn order to characterize the stable distribution of wealth in this economy, it is necessary to consider the dynamics of household wealth by rank. One of the key insights of this model and of this paper more generally is that rank-based wealth dynamics are the essential determinants of inequality. As we demonstrate below, there is a simple, direct, and robust relationship between rank-based growth rates of wealth and the distribution of wealth. This relationship is a purely statistical result and hence can be applied to any economic environment, no matter how complex.\n\nThe first step in achieving this characterization is to introduce notation for household rank based on total wealth holdings. For $k = 1, \\ldots, N$, let\n\n", "itemtype": "equation", "pos": 24893, "prevtext": "\nfor $i = 1, \\ldots, N$, and\n\n", "index": 9, "text": "\\begin{equation} \\label{mu}\n {\\mu}(t) = \\sum_{i=1}^N\\theta_i(t){\\mu}_i(t) + \\frac{1}{2}\\left(\\sum_{i=1}^N\\theta_i(t){\\rho}_{ii}(t) - \\sum_{i,j=1}^N\\theta_i(t)\\theta_j(t){\\rho}_{ij}(t)\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{\\mu}(t)=\\sum_{i=1}^{N}\\theta_{i}(t){\\mu}_{i}(t)+\\frac{1}{2}\\left(\\sum_{i=1}^{%&#10;N}\\theta_{i}(t){\\rho}_{ii}(t)-\\sum_{i,j=1}^{N}\\theta_{i}(t)\\theta_{j}(t){\\rho}%&#10;_{ij}(t)\\right).\" display=\"block\"><mrow><mrow><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>θ</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nso that $w_{(k)}(t)$ represents the wealth held by the household with the $k$-th most wealth among all the households in the economy at time $t$. One consequence of this definition is that\n\n", "itemtype": "equation", "pos": 25840, "prevtext": "\n\\end{lem}\n\nIn order to characterize the stable distribution of wealth in this economy, it is necessary to consider the dynamics of household wealth by rank. One of the key insights of this model and of this paper more generally is that rank-based wealth dynamics are the essential determinants of inequality. As we demonstrate below, there is a simple, direct, and robust relationship between rank-based growth rates of wealth and the distribution of wealth. This relationship is a purely statistical result and hence can be applied to any economic environment, no matter how complex.\n\nThe first step in achieving this characterization is to introduce notation for household rank based on total wealth holdings. For $k = 1, \\ldots, N$, let\n\n", "index": 11, "text": "\\begin{equation} \\label{rankWealth}\nw_{(k)}(t) = \\max_{1 \\leq i_1 < \\cdots < i_k \\leq N} \\min \\left(w_{i_1}(t), \\ldots, w_{i_k}(t)\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"w_{(k)}(t)=\\max_{1\\leq i_{1}&lt;\\cdots&lt;i_{k}\\leq N}\\min\\left(w_{i_{1}}(t),\\ldots,%&#10;w_{i_{k}}(t)\\right),\" display=\"block\"><mrow><mrow><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mi>max</mi><mrow><mn>1</mn><mo>≤</mo><msub><mi>i</mi><mn>1</mn></msub><mo>&lt;</mo><mi mathvariant=\"normal\">⋯</mi><mo>&lt;</mo><msub><mi>i</mi><mi>k</mi></msub><mo>≤</mo><mi>N</mi></mrow></munder><mo>⁡</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><msub><mi>w</mi><msub><mi>i</mi><mn>1</mn></msub></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><msub><mi>w</mi><msub><mi>i</mi><mi>k</mi></msub></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nSimilarly, let $\\theta_{(k)}(t)$ be the share of total wealth held by the $k$-th wealthiest household at time $t$, so that\n\n", "itemtype": "equation", "pos": 26183, "prevtext": "\nso that $w_{(k)}(t)$ represents the wealth held by the household with the $k$-th most wealth among all the households in the economy at time $t$. One consequence of this definition is that\n\n", "index": 13, "text": "\\begin{equation}\n \\max (w_1(t), \\ldots, w_N(t)) = w_{(1)}(t) \\geq w_{(2)}(t) \\geq \\cdots \\geq w_{(N)}(t) = \\min (w_1, \\ldots, w_N(t)).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\max(w_{1}(t),\\ldots,w_{N}(t))=w_{(1)}(t)\\geq w_{(2)}(t)\\geq\\cdots\\geq w_{(N)}%&#10;(t)=\\min(w_{1},\\ldots,w_{N}(t)).\" display=\"block\"><mrow><mrow><mrow><mi>max</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>w</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><msub><mi>w</mi><mi>N</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mi mathvariant=\"normal\">⋯</mi><mo>≥</mo><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>w</mi><mn>1</mn></msub><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>,</mo><mrow><msub><mi>w</mi><mi>N</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor $k = 1, \\ldots, N$. \n\nThe next step is to describe the dynamics of the household rank wealth processes $w_{(k)}$ and rank wealth share processes $\\theta_{(k)}$, $k = 1, \\ldots, N$. Unfortunately, this task is complicated by the fact that the max and min functions from equation \\eqref{rankWealth} are not differentiable, and hence we cannot simply apply {It{\\^o}}'s Lemma in this case. Instead, we introduce the notion of a local time to solve this problem. For any continuous process $x$, the \\emph{local time} at $0$ for $x$ is the process ${\\Lambda}_x$ defined by\n\n", "itemtype": "equation", "pos": 26456, "prevtext": "\nSimilarly, let $\\theta_{(k)}(t)$ be the share of total wealth held by the $k$-th wealthiest household at time $t$, so that\n\n", "index": 15, "text": "\\begin{equation} \\label{rankShares}\n\\theta_{(k)}(t) = \\frac{w_{(k)}(t)}{w(t)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\theta_{(k)}(t)=\\frac{w_{(k)}(t)}{w(t)},\" display=\"block\"><mrow><mrow><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nAs detailed by \\citet{Karatzas/Shreve:1991}, the local time for $x$ measures the amount of time the process $x$ spends near zero.\\footnote{For more discussion of local times, and especially their connection to rank processes, see \\citet{Fernholz:2002}.} To be able to link household rank to household index, let $p_t$ be the random permutation of $\\{1, \\ldots, N\\}$ such that for $1 \\leq i, k \\leq N$,\n\n", "itemtype": "equation", "pos": 27121, "prevtext": "\nfor $k = 1, \\ldots, N$. \n\nThe next step is to describe the dynamics of the household rank wealth processes $w_{(k)}$ and rank wealth share processes $\\theta_{(k)}$, $k = 1, \\ldots, N$. Unfortunately, this task is complicated by the fact that the max and min functions from equation \\eqref{rankWealth} are not differentiable, and hence we cannot simply apply {It{\\^o}}'s Lemma in this case. Instead, we introduce the notion of a local time to solve this problem. For any continuous process $x$, the \\emph{local time} at $0$ for $x$ is the process ${\\Lambda}_x$ defined by\n\n", "index": 17, "text": "\\begin{equation} \\label{localTime}\n {\\Lambda}_x(t) = \\frac{1}{2}\\left(|x(t)| - |x(0)| - {\\int_0^t}{\\rm sgn}(x(s))\\,dx(s)\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"{\\Lambda}_{x}(t)=\\frac{1}{2}\\left(|x(t)|-|x(0)|-{\\int_{0}^{t}}{\\rm sgn}(x(s))%&#10;\\,dx(s)\\right).\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">Λ</mi><mi>x</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mo>-</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mo>-</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>t</mi></msubsup><mrow><mi>sgn</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>x</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nThis definition implies that $p_t(k) = i$ whenever household $i$ is the $k$-th wealthiest household in the economy, with ties broken in some consistent manner.\n\n\\begin{lem} \\label{localTimeLemma}\nFor all $k = 1, \\ldots, N$, the dynamics of the household rank wealth processes $w_{(k)}$ and rank wealth share processes $\\theta_{(k)}$ are given by\n\n", "itemtype": "equation", "pos": 27667, "prevtext": "\nAs detailed by \\citet{Karatzas/Shreve:1991}, the local time for $x$ measures the amount of time the process $x$ spends near zero.\\footnote{For more discussion of local times, and especially their connection to rank processes, see \\citet{Fernholz:2002}.} To be able to link household rank to household index, let $p_t$ be the random permutation of $\\{1, \\ldots, N\\}$ such that for $1 \\leq i, k \\leq N$,\n\n", "index": 19, "text": "\\begin{equation} \\label{pTK}\n p_t(k) = i \\quad \\text{if} \\quad w_{(k)}(t) = w_i(t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"p_{t}(k)=i\\quad\\text{if}\\quad w_{(k)}(t)=w_{i}(t).\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>i</mi><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>if</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\na.s, and\n\n", "itemtype": "equation", "pos": 28112, "prevtext": "\nThis definition implies that $p_t(k) = i$ whenever household $i$ is the $k$-th wealthiest household in the economy, with ties broken in some consistent manner.\n\n\\begin{lem} \\label{localTimeLemma}\nFor all $k = 1, \\ldots, N$, the dynamics of the household rank wealth processes $w_{(k)}$ and rank wealth share processes $\\theta_{(k)}$ are given by\n\n", "index": 21, "text": "\\begin{equation} \\label{rankWealthDynamics}\n d\\log w_{(k)}(t) = d\\log w_{p_t(k)}(t) + \\frac{1}{2}d{\\Lambda}_{\\log w_{(k)} - \\log w_{(k + 1)}}(t) - \\frac{1}{2}d{\\Lambda}_{\\log w_{(k - 1)} - \\log w_{(k)}}(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"d\\log w_{(k)}(t)=d\\log w_{p_{t}(k)}(t)+\\frac{1}{2}d{\\Lambda}_{\\log w_{(k)}-%&#10;\\log w_{(k+1)}}(t)-\\frac{1}{2}d{\\Lambda}_{\\log w_{(k-1)}-\\log w_{(k)}}(t),\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\na.s., with the convention that ${\\Lambda}_{\\log w_{(0)} - \\log w_{(1)}}(t) = {\\Lambda}_{\\log w_{(N)} - \\log w_{(N+1)}}(t) = 0$.\n\\end{lem}\n\nAccording to equation \\eqref{rankWealthDynamics} from the lemma, the dynamics of wealth for the $k$-th wealthiest household in the economy are the same as those for the household that is the $k$-th wealthiest at time $t$ (household $i = p_t(k)$), plus two local time processes that capture changes in household rank (one household overtakes another in wealth) over time.\\footnote{For brevity, we write $dx_{p_t(k)}(t)$ to refer to the process $\\sum_{i = 1}^N1_{\\{i = p_t(k)\\}}dx_i(t)$ throughout this paper.} To understand this equation, note that the positive local time term ${\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}$ ensures that the wealth holdings of the $k$-th wealthiest household are always larger than those of the $k+1$-th wealthiest household, and that the negative local time term ${\\Lambda}_{\\log w_{(k - 1)} - \\log w_{(k)}}$ ensures that the wealth holdings of the $k$-th wealthiest household are always smaller than those of the $k-1$-th wealthiest. Equation \\eqref{rankWealthShareDynamics1} describes the similar dynamics of the rank wealth share processes $\\theta_{(k)}$.\n\nUsing equations \\eqref{wealthDynamics} and \\eqref{totalWealthDynamics} and the definition of $\\theta_i(t)$, we have that for all $i = 1, \\ldots, N$,\n\n", "itemtype": "equation", "pos": 28343, "prevtext": "\na.s, and\n\n", "index": 23, "text": "\\begin{equation} \\label{rankWealthShareDynamics1}\n  d\\log\\theta_{(k)}(t) = d\\log\\theta_{p_t(k)}(t) + \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}(t) - \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k - 1)} - \\log\\theta_{(k)}}(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"d\\log\\theta_{(k)}(t)=d\\log\\theta_{p_{t}(k)}(t)+\\frac{1}{2}d{\\Lambda}_{\\log%&#10;\\theta_{(k)}-\\log\\theta_{(k+1)}}(t)-\\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k-1)}-%&#10;\\log\\theta_{(k)}}(t),\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nIf we apply Lemma \\ref{localTimeLemma} to equation \\eqref{wealthShareDynamics}, then it follows that\n\n", "itemtype": "equation", "pos": 29985, "prevtext": "\na.s., with the convention that ${\\Lambda}_{\\log w_{(0)} - \\log w_{(1)}}(t) = {\\Lambda}_{\\log w_{(N)} - \\log w_{(N+1)}}(t) = 0$.\n\\end{lem}\n\nAccording to equation \\eqref{rankWealthDynamics} from the lemma, the dynamics of wealth for the $k$-th wealthiest household in the economy are the same as those for the household that is the $k$-th wealthiest at time $t$ (household $i = p_t(k)$), plus two local time processes that capture changes in household rank (one household overtakes another in wealth) over time.\\footnote{For brevity, we write $dx_{p_t(k)}(t)$ to refer to the process $\\sum_{i = 1}^N1_{\\{i = p_t(k)\\}}dx_i(t)$ throughout this paper.} To understand this equation, note that the positive local time term ${\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}$ ensures that the wealth holdings of the $k$-th wealthiest household are always larger than those of the $k+1$-th wealthiest household, and that the negative local time term ${\\Lambda}_{\\log w_{(k - 1)} - \\log w_{(k)}}$ ensures that the wealth holdings of the $k$-th wealthiest household are always smaller than those of the $k-1$-th wealthiest. Equation \\eqref{rankWealthShareDynamics1} describes the similar dynamics of the rank wealth share processes $\\theta_{(k)}$.\n\nUsing equations \\eqref{wealthDynamics} and \\eqref{totalWealthDynamics} and the definition of $\\theta_i(t)$, we have that for all $i = 1, \\ldots, N$,\n\n", "index": 25, "text": "\\begin{align}\n d\\log\\theta_i(t) & = d\\log w_i(t) - d\\log w(t) \\notag \\\\\n & = {\\mu}_i(t)\\,dt + \\sum_{z=1}^M{\\delta}_{iz}(t)\\,dB_z(t) - {\\mu}(t)\\,dt - \\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t). \\label{wealthShareDynamics}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle d\\log\\theta_{i}(t)\" display=\"inline\"><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=d\\log w_{i}(t)-d\\log w(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>w</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mi>w</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle={\\mu}_{i}(t)\\,dt+\\sum_{z=1}^{M}{\\delta}_{iz}(t)\\,dB_{z}(t)-{\\mu}%&#10;(t)\\,dt-\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(t){\\delta}_{iz}(t)\\,dB_{z}(t).\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\na.s, for all $k = 1, \\ldots, N$. Equation \\eqref{rankWealthShareDynamics2}, in turn, implies that the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ satisfies, a.s., for all $k = 1, \\ldots, N - 1$,\n\n", "itemtype": "equation", "pos": 30337, "prevtext": "\nIf we apply Lemma \\ref{localTimeLemma} to equation \\eqref{wealthShareDynamics}, then it follows that\n\n", "index": 27, "text": "\\begin{equation} \\label{rankWealthShareDynamics2}\n\\begin{aligned}\n d\\log\\theta_{(k)}(t) & = \\left({\\mu}_{p_t(k)}(t) - {\\mu}(t)\\right)\\,dt + \\sum_{z=1}^M{\\delta}_{p_t(k)z}(t)\\,dB_z(t) - \\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t) \\\\\n & \\qquad + \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}(t) - \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k - 1)} - \\log\\theta_{(k)}}(t),\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle d\\log\\theta_{(k)}(t)\" display=\"inline\"><mrow><mi>d</mi><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left({\\mu}_{p_{t}(k)}(t)-{\\mu}(t)\\right)\\,dt+\\sum_{z=1}^{M}{%&#10;\\delta}_{p_{t}(k)z}(t)\\,dB_{z}(t)-\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(t){%&#10;\\delta}_{iz}(t)\\,dB_{z}(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad+\\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k)}-\\log\\theta_{(k+1)}%&#10;}(t)-\\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k-1)}-\\log\\theta_{(k)}}(t),\" display=\"inline\"><mrow><mrow><mrow><mo lspace=\"22.5pt\">+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nThe processes for relative wealth holdings of adjacent households in the distribution of wealth as given by equation \\eqref{rankWealthShareDynamics3} are key to describing the stable distribution of wealth in this setup.\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Stable Distribution of Wealth}\nThe results presented above allow us to analytically characterize the stable distribution of wealth in this setup. Let ${\\alpha}_k$ equal the time-averaged limit of the expected growth rate of wealth for the $k$-th wealthiest household relative to the expected growth rate of wealth for the whole economy, so that\n\n", "itemtype": "equation", "pos": 30963, "prevtext": "\na.s, for all $k = 1, \\ldots, N$. Equation \\eqref{rankWealthShareDynamics2}, in turn, implies that the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ satisfies, a.s., for all $k = 1, \\ldots, N - 1$,\n\n", "index": 29, "text": "\\begin{equation} \\label{rankWealthShareDynamics3}\n\\begin{aligned}\nd\\left(\\log\\theta_{(k)}(t) - \\log\\theta_{(k+1)}(t)\\right) & =  \\left({\\mu}_{p_t(k)}(t) - {\\mu}_{p_t(k+1)}(t)\\right)\\,dt + d{\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}(t) \\\\\n& \\qquad - \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k-1)} - \\log\\theta_{(k)}}(t) - \\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k+1)} - \\log\\theta_{(k + 2)}}(t) \\\\\n& \\qquad + \\sum_{z=1}^M\\left({\\delta}_{p_t(k)z}(t) - {\\delta}_{p_t(k+1)z}(t)\\right)\\,dB_z(t).\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle d\\left(\\log\\theta_{(k)}(t)-\\log\\theta_{(k+1)}(t)\\right)\" display=\"inline\"><mrow><mi>d</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left({\\mu}_{p_{t}(k)}(t)-{\\mu}_{p_{t}(k+1)}(t)\\right)\\,dt+d{%&#10;\\Lambda}_{\\log\\theta_{(k)}-\\log\\theta_{(k+1)}}(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad-\\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k-1)}-\\log\\theta_{(k)}%&#10;}(t)-\\frac{1}{2}d{\\Lambda}_{\\log\\theta_{(k+1)}-\\log\\theta_{(k+2)}}(t)\" display=\"inline\"><mrow><mrow><mo lspace=\"22.5pt\">-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15Xb.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad+\\sum_{z=1}^{M}\\left({\\delta}_{p_{t}(k)z}(t)-{\\delta}_{p_{t%&#10;}(k+1)z}(t)\\right)\\,dB_{z}(t).\" display=\"inline\"><mrow><mrow><mo lspace=\"22.5pt\">+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor $k = 1, \\ldots, N$. The relative growth rates ${\\alpha}_k$ determine the reversion rates of household wealth and are a rough measure of the rate at which wealth cross-sectionally reverts to the mean. These parameters incorporate all aspects of the economic environment, including taxes and diminishing returns to wealth accumulation.\n\nIn a similar manner, we wish to define the time-averaged limit of the volatility of the process $\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}$, which measures the relative wealth holdings of adjacent households in the distribution of wealth. For all $k = 1, \\ldots, N - 1$, let ${\\sigma}_k$ be given by\n\n", "itemtype": "equation", "pos": 32072, "prevtext": "\nThe processes for relative wealth holdings of adjacent households in the distribution of wealth as given by equation \\eqref{rankWealthShareDynamics3} are key to describing the stable distribution of wealth in this setup.\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Stable Distribution of Wealth}\nThe results presented above allow us to analytically characterize the stable distribution of wealth in this setup. Let ${\\alpha}_k$ equal the time-averaged limit of the expected growth rate of wealth for the $k$-th wealthiest household relative to the expected growth rate of wealth for the whole economy, so that\n\n", "index": 31, "text": "\\begin{equation} \\label{alphaK}\n {\\alpha}_k = \\limT1{\\int_0^T}\\left({\\mu}_{p_t(k)}(t) - {\\mu}(t)\\right)\\,dt,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"{\\alpha}_{k}=\\limT 1{\\int_{0}^{T}}\\left({\\mu}_{p_{t}(k)}(t)-{\\mu}(t)\\right)\\,dt,\" display=\"block\"><mrow><mrow><msub><mi>α</mi><mi>k</mi></msub><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nThe relative growth rates ${\\alpha}_k$ together with the volatilities ${\\sigma}_k$ entirely determine the shape of the stable distribution of wealth in this economy. Finally, for all $k = 1, \\ldots, N$, let\n\n", "itemtype": "equation", "pos": 32833, "prevtext": "\nfor $k = 1, \\ldots, N$. The relative growth rates ${\\alpha}_k$ determine the reversion rates of household wealth and are a rough measure of the rate at which wealth cross-sectionally reverts to the mean. These parameters incorporate all aspects of the economic environment, including taxes and diminishing returns to wealth accumulation.\n\nIn a similar manner, we wish to define the time-averaged limit of the volatility of the process $\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}$, which measures the relative wealth holdings of adjacent households in the distribution of wealth. For all $k = 1, \\ldots, N - 1$, let ${\\sigma}_k$ be given by\n\n", "index": 33, "text": "\\begin{equation} \\label{sigmaK}\n {\\sigma}^2_k = \\limT1{\\int_0^T}\\sum_{z=1}^M\\left({\\delta}_{p_t(k)z}(t) - {\\delta}_{p_t(k+1)z}(t)\\right)^2\\,dt.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"{\\sigma}^{2}_{k}=\\limT 1{\\int_{0}^{T}}\\sum_{z=1}^{M}\\left({\\delta}_{p_{t}(k)z}%&#10;(t)-{\\delta}_{p_{t}(k+1)z}(t)\\right)^{2}\\,dt.\" display=\"block\"><mrow><mrow><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover><mrow><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mrow><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mn>2</mn></msup></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nLet ${\\kappa}_0 = 0$, as well. In Appendix \\ref{proofs}, we show that the parameters ${\\alpha}_k$ and ${\\kappa}_k$ are related by ${\\alpha}_k - {\\alpha}_{k+1} = \\frac{1}{2}{\\kappa}_{k-1} - {\\kappa}_k + \\frac{1}{2}{\\kappa}_{k+1}$, for all $k = 1, \\ldots, N-1$. \n\nThe distribution of wealth in this economy is \\emph{stable} if the limits in equations \\eqref{alphaK}-\\eqref{kappa} all exist and if the limits in equations \\eqref{sigmaK}-\\eqref{kappa} are positive constants. Throughout this paper, we assume that the limits in equations \\eqref{alphaK}-\\eqref{kappa} do in fact exist.\n\nThe \\emph{stable version} of the process $\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}$ is the process $\\log\\hat{\\theta}_{(k)} - \\log\\hat{\\theta}_{(k + 1)}$ defined by\n\n", "itemtype": "equation", "pos": 33199, "prevtext": "\nThe relative growth rates ${\\alpha}_k$ together with the volatilities ${\\sigma}_k$ entirely determine the shape of the stable distribution of wealth in this economy. Finally, for all $k = 1, \\ldots, N$, let\n\n", "index": 35, "text": "\\begin{equation} \\label{kappa}\n {\\kappa}_k = \\limT1{\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}(T).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"{\\kappa}_{k}=\\limT 1{\\Lambda}_{\\log\\theta_{(k)}-\\log\\theta_{(k+1)}}(T).\" display=\"block\"><mrow><mrow><msub><mi>κ</mi><mi>k</mi></msub><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor all $k = 1, \\ldots, N - 1$.\\footnote{For each $k = 1, \\ldots, N$, equation \\eqref{stableVersion} implicitly defines another Brownian motion $B(t)$, $t \\in [0, \\infty)$. These Brownian motions can covary in any way across different $k$.} The stable version of $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ replaces all of the processes from the right-hand side of equation \\eqref{rankWealthShareDynamics3} with their time-averaged limits, with the exception of the local time process ${\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}$. By considering the stable version of these relative wealth holdings processes, we are able to obtain a simple characterization of the distribution of wealth.\n\n\n\n\\begin{thm} \\label{wealthDistThm}\nThere is a stable distribution of wealth in this economy if and only if ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$, for $k = 1, \\ldots, N - 1$. Furthermore, if there is a stable distribution of wealth, then for $k = 1, \\ldots, N - 1$, this distribution satisfies\n\n", "itemtype": "equation", "pos": 34066, "prevtext": "\nLet ${\\kappa}_0 = 0$, as well. In Appendix \\ref{proofs}, we show that the parameters ${\\alpha}_k$ and ${\\kappa}_k$ are related by ${\\alpha}_k - {\\alpha}_{k+1} = \\frac{1}{2}{\\kappa}_{k-1} - {\\kappa}_k + \\frac{1}{2}{\\kappa}_{k+1}$, for all $k = 1, \\ldots, N-1$. \n\nThe distribution of wealth in this economy is \\emph{stable} if the limits in equations \\eqref{alphaK}-\\eqref{kappa} all exist and if the limits in equations \\eqref{sigmaK}-\\eqref{kappa} are positive constants. Throughout this paper, we assume that the limits in equations \\eqref{alphaK}-\\eqref{kappa} do in fact exist.\n\nThe \\emph{stable version} of the process $\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}$ is the process $\\log\\hat{\\theta}_{(k)} - \\log\\hat{\\theta}_{(k + 1)}$ defined by\n\n", "index": 37, "text": "\\begin{equation} \\label{stableVersion}\n  d\\left(\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k+1)}(t)\\right) = -{\\kappa}_k\\,dt + d{\\Lambda}_{\\log\\hat{\\theta}_{(k)} - \\log\\hat{\\theta}_{(k + 1)}}(t) + {\\sigma}_k\\,dB(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"d\\left(\\log\\hat{\\theta}_{(k)}(t)-\\log\\hat{\\theta}_{(k+1)}(t)\\right)=-{\\kappa}_%&#10;{k}\\,dt+d{\\Lambda}_{\\log\\hat{\\theta}_{(k)}-\\log\\hat{\\theta}_{(k+1)}}(t)+{%&#10;\\sigma}_{k}\\,dB(t),\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>κ</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>+</mo><mrow><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>σ</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\\end{thm}\n\nTheorem \\ref{wealthDistThm} provides an analytic household-by-household characterization of the entire stable distribution of wealth. This is achieved despite minimal assumptions on the processes that describe the dynamics of household wealth over time. In fact, as the time-averaged limits in equations \\eqref{alphaK}-\\eqref{kappa} and \\eqref{wealthDistEq} suggest, we do not assume that a steady-state distribution of wealth even exists, but rather that the system of wealth processes is asymptotically stable in the sense that the limits \\eqref{alphaK}-\\eqref{kappa} exist. Furthermore, as long as the relative growth rates, volatilities, and local times that we take limits of do not change drastically and frequently over time, then the distribution of the stable versions of $\\theta_{(k)}$ from Theorem \\ref{wealthDistThm} will accurately reflect the distribution of the true versions of these rank wealth share processes.\\footnote{\\citet{Fernholz:2002} discusses these issues in more detail and shows that Theorem \\ref{wealthDistThm} provides an accurate depiction of the U.S. stock market.} For this reason, we shall assume that equation \\eqref{wealthDistEq} approximately describes the true versions of $\\theta_{(k)}$ throughout much of this paper. The issue of stability of the distribution of wealth is discussed in more detail in Section \\ref{empiricalApps}.\n\n\n\n\nThe theorem yields two important insights. First, it shows that an understanding of rank-based household wealth dynamics is sufficient to describe the entire distribution of wealth. It is not necessary to directly model and estimate household wealth dynamics by name, denoted by index $i$, as is common in the literature on earnings dynamics. Second, the theorem shows that the only two factors that affect the distribution of wealth are the rank-based reversion rates, measured by the quantities $-{\\alpha}_k$, and the rank-based volatilities, ${\\sigma}_k$. To understand the effect of policy, institutions, technology, globalization, or any other relevant factor on inequality, then, it is necessary only to understand their effect on these reversion rates and volatilities. Furthermore, if quantitative estimates of these effects can be obtained, then Theorem \\ref{wealthDistThm} provides a quantitative description of the impact on inequality. This observation underlies our analysis of the effect of progressive capital taxes on the distribution of wealth in Section \\ref{empiricalApps}.\n\nThe characterization in equation \\eqref{wealthDistEq} extends earlier analyses of power law distributions based on Gibrat's law. Indeed, Gibrat's law is a very special case of Theorem \\ref{wealthDistThm} in which the cross-sectional mean reversion and volatility parameters ${\\alpha}_k$ and ${\\sigma}_k$ are equal across different ranks $k$. In this case, the theorem confirms that in fact this setup yields a Pareto distribution (a straight line in a log-log plot of rank $k$ versus wealth holdings $\\theta_k$) as in \\citet{Gabaix:1999,Gabaix:2009}. One of this paper's contributions is to move past Gibrat's law and characterize how growth rates and volatilities that vary across different ranks can generate any empirical distribution. In Section \\ref{empiricalApps}, we use this flexibility to construct an exact match of the U.S. wealth distribution.\n\n\n\nAccording to Theorem \\ref{wealthDistThm}, asymptotic stability of the distribution of wealth requires that the reversion rates $-{\\alpha}_k$ must sum to positive quantities, for all $k = 1, \\ldots, N - 1$. Stability, then, requires a mean reversion condition in the sense that the growth rate of wealth for the wealthiest households in the economy must be strictly below the growth rate of wealth for less wealthy households. As a consequence, even if some households are more skilled than others in that, all else equal, their expected growth rates of wealth ${\\mu}_i(t)$ are higher, stability still requires that these skilled households have lower expected growth rates of wealth when they occupy the upper ranks of the wealth distribution.\n\nIf the mean reversion condition from Theorem \\ref{wealthDistThm} is not satisfied, then the distribution of wealth will separate into divergent subpopulations. In order to describe this unstable scenario, for $1 \\leq m \\leq N$, let\n\n", "itemtype": "equation", "pos": 35291, "prevtext": "\nfor all $k = 1, \\ldots, N - 1$.\\footnote{For each $k = 1, \\ldots, N$, equation \\eqref{stableVersion} implicitly defines another Brownian motion $B(t)$, $t \\in [0, \\infty)$. These Brownian motions can covary in any way across different $k$.} The stable version of $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ replaces all of the processes from the right-hand side of equation \\eqref{rankWealthShareDynamics3} with their time-averaged limits, with the exception of the local time process ${\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}$. By considering the stable version of these relative wealth holdings processes, we are able to obtain a simple characterization of the distribution of wealth.\n\n\n\n\\begin{thm} \\label{wealthDistThm}\nThere is a stable distribution of wealth in this economy if and only if ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$, for $k = 1, \\ldots, N - 1$. Furthermore, if there is a stable distribution of wealth, then for $k = 1, \\ldots, N - 1$, this distribution satisfies\n\n", "index": 39, "text": "\\begin{equation} \\label{wealthDistEq}\n \\limT1{\\int_0^T}\\left(\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k + 1)}(t)\\right)\\,dt = \\frac{{\\sigma}^2_k}{-4({\\alpha}_1 + \\cdots + {\\alpha}_k)}, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\limT 1{\\int_{0}^{T}}\\left(\\log\\hat{\\theta}_{(k)}(t)-\\log\\hat{\\theta}_{(k+1)}(%&#10;t)\\right)\\,dt=\\frac{{\\sigma}^{2}_{k}}{-4({\\alpha}_{1}+\\cdots+{\\alpha}_{k})},{%&#10;\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nso that $A_m$ is the average relative growth rate of wealth for the top $m$ wealthiest households in the economy.\n\n\\begin{thm} \\label{wealthDistThm2}\nSuppose that the reversion rates are such that ${\\alpha}_1 + \\cdots + {\\alpha}_k \\geq 0$, for some $k < N$, and that there exists some $m < N$ such that\n\n", "itemtype": "equation", "pos": 39836, "prevtext": "\n\\end{thm}\n\nTheorem \\ref{wealthDistThm} provides an analytic household-by-household characterization of the entire stable distribution of wealth. This is achieved despite minimal assumptions on the processes that describe the dynamics of household wealth over time. In fact, as the time-averaged limits in equations \\eqref{alphaK}-\\eqref{kappa} and \\eqref{wealthDistEq} suggest, we do not assume that a steady-state distribution of wealth even exists, but rather that the system of wealth processes is asymptotically stable in the sense that the limits \\eqref{alphaK}-\\eqref{kappa} exist. Furthermore, as long as the relative growth rates, volatilities, and local times that we take limits of do not change drastically and frequently over time, then the distribution of the stable versions of $\\theta_{(k)}$ from Theorem \\ref{wealthDistThm} will accurately reflect the distribution of the true versions of these rank wealth share processes.\\footnote{\\citet{Fernholz:2002} discusses these issues in more detail and shows that Theorem \\ref{wealthDistThm} provides an accurate depiction of the U.S. stock market.} For this reason, we shall assume that equation \\eqref{wealthDistEq} approximately describes the true versions of $\\theta_{(k)}$ throughout much of this paper. The issue of stability of the distribution of wealth is discussed in more detail in Section \\ref{empiricalApps}.\n\n\n\n\nThe theorem yields two important insights. First, it shows that an understanding of rank-based household wealth dynamics is sufficient to describe the entire distribution of wealth. It is not necessary to directly model and estimate household wealth dynamics by name, denoted by index $i$, as is common in the literature on earnings dynamics. Second, the theorem shows that the only two factors that affect the distribution of wealth are the rank-based reversion rates, measured by the quantities $-{\\alpha}_k$, and the rank-based volatilities, ${\\sigma}_k$. To understand the effect of policy, institutions, technology, globalization, or any other relevant factor on inequality, then, it is necessary only to understand their effect on these reversion rates and volatilities. Furthermore, if quantitative estimates of these effects can be obtained, then Theorem \\ref{wealthDistThm} provides a quantitative description of the impact on inequality. This observation underlies our analysis of the effect of progressive capital taxes on the distribution of wealth in Section \\ref{empiricalApps}.\n\nThe characterization in equation \\eqref{wealthDistEq} extends earlier analyses of power law distributions based on Gibrat's law. Indeed, Gibrat's law is a very special case of Theorem \\ref{wealthDistThm} in which the cross-sectional mean reversion and volatility parameters ${\\alpha}_k$ and ${\\sigma}_k$ are equal across different ranks $k$. In this case, the theorem confirms that in fact this setup yields a Pareto distribution (a straight line in a log-log plot of rank $k$ versus wealth holdings $\\theta_k$) as in \\citet{Gabaix:1999,Gabaix:2009}. One of this paper's contributions is to move past Gibrat's law and characterize how growth rates and volatilities that vary across different ranks can generate any empirical distribution. In Section \\ref{empiricalApps}, we use this flexibility to construct an exact match of the U.S. wealth distribution.\n\n\n\nAccording to Theorem \\ref{wealthDistThm}, asymptotic stability of the distribution of wealth requires that the reversion rates $-{\\alpha}_k$ must sum to positive quantities, for all $k = 1, \\ldots, N - 1$. Stability, then, requires a mean reversion condition in the sense that the growth rate of wealth for the wealthiest households in the economy must be strictly below the growth rate of wealth for less wealthy households. As a consequence, even if some households are more skilled than others in that, all else equal, their expected growth rates of wealth ${\\mu}_i(t)$ are higher, stability still requires that these skilled households have lower expected growth rates of wealth when they occupy the upper ranks of the wealth distribution.\n\nIf the mean reversion condition from Theorem \\ref{wealthDistThm} is not satisfied, then the distribution of wealth will separate into divergent subpopulations. In order to describe this unstable scenario, for $1 \\leq m \\leq N$, let\n\n", "index": 41, "text": "\\begin{equation} \\label{Am}\n A_m = \\frac{{\\alpha}_1 + \\cdots + {\\alpha}_m}{m},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"A_{m}=\\frac{{\\alpha}_{1}+\\cdots+{\\alpha}_{m}}{m},\" display=\"block\"><mrow><mrow><msub><mi>A</mi><mi>m</mi></msub><mo>=</mo><mfrac><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>m</mi></msub></mrow><mi>m</mi></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nIn this case, there exists a stable distribution of wealth for the subset of ranked households $w_{(1)}, \\ldots, w_{(m)}$, and the share of total wealth held by this top subset of households satisfies\\footnote{It is unlikely but possible that there are two or more maxima and hence $A_m = A_l$ for some $l \\neq m$. In this case, there still exists a divergent subset of households, although equation \\eqref{divergeDesc} must be changed to a time-averaged limit. This divergent subset is made up of the smallest subset of households with an average relative growth rate that is a maximum. See \\citet{Fernholz/Fernholz:2014} for a proof.}\n\n", "itemtype": "equation", "pos": 40233, "prevtext": "\nso that $A_m$ is the average relative growth rate of wealth for the top $m$ wealthiest households in the economy.\n\n\\begin{thm} \\label{wealthDistThm2}\nSuppose that the reversion rates are such that ${\\alpha}_1 + \\cdots + {\\alpha}_k \\geq 0$, for some $k < N$, and that there exists some $m < N$ such that\n\n", "index": 43, "text": "\\begin{equation}\n A_m = \\max_{1 \\leq k \\leq N} A_k \\qquad \\text{and} \\qquad A_m > A_l \\;\\; \\text{for $l \\neq m$.}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"A_{m}=\\max_{1\\leq k\\leq N}A_{k}\\qquad\\text{and}\\qquad A_{m}&gt;A_{l}\\;\\;\\text{for%&#10; $l\\neq m$.}\" display=\"block\"><mrow><mrow><msub><mi>A</mi><mi>m</mi></msub><mo>=</mo><mrow><mrow><munder><mi>max</mi><mrow><mn>1</mn><mo>≤</mo><mi>k</mi><mo>≤</mo><mi>N</mi></mrow></munder><mo>⁡</mo><msub><mi>A</mi><mi>k</mi></msub></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mtext>and</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><msub><mi>A</mi><mi>m</mi></msub><mo>&gt;</mo><mrow><mpadded width=\"+5.6pt\"><msub><mi>A</mi><mi>l</mi></msub></mpadded><mo>⁢</mo><mrow><mtext>for </mtext><mrow><mi>l</mi><mo>≠</mo><mi>m</mi></mrow><mtext>.</mtext></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\\end{thm}\n\nThe stable distribution of wealth for the top subpopulation of households $w_{(1)}, \\ldots, w_{(m)}$ is described using Theorem \\ref{wealthDistThm}, with the parameters ${\\alpha}_k$ defined as the time-averaged limit of the growth rates of wealth for different ranked households relative to the growth rate of the total wealth held by this group of households (same as equation \\eqref{alphaK}, but with ${\\mu}(t)$ replaced by the growth rate of $w_{(1)} + \\cdots + w_{(m)}$) and the volatility parameters ${\\sigma}_1, \\ldots, {\\sigma}_{m - 1}$ unchanged. This wealthy subset of households forms a separate stable distribution and eventually holds all wealth in the economy. During this process of divergence, this top subset of households gradually separates from the rest of the population so that eventually there is no more mobility between groups.\\footnote{See the proof of Theorem \\ref{wealthDistThm2} in Appendix \\ref{proofs} for a proof of this mobility result.}\n\nAs we shall explain in Section \\ref{empiricalApps}, the divergent scenario of Theorem \\ref{wealthDistThm2} may in fact be relevant to the current trajectory of the U.S. distribution of wealth. This theorem describes a particularly blatant form of divergence in which the wealth holdings of some subset of rich households is growing more quickly than the total wealth of the economy. In fact, the distribution of wealth is unstable even if all households have equal growth rates of wealth and hence no subset of households is growing faster than any other. In terms of the rank-based relative growth rates ${\\alpha}_k$, this implies that ${\\alpha}_1 = \\cdots = {\\alpha}_N$ and hence that all reversion rates are equal to zero. This special case has been analyzed in detail by both \\citet{Fargione/Lehman/Polasky:2011} and \\citet{Fernholz/Fernholz:2014}, the latter of who show that in this scenario wealth becomes increasingly concentrated over time in the sense that the time-averaged limit of the top wealth share $\\theta_{(1)}$ converges to one.\n\n\n\n\n\\vfill\n\n\\pagebreak\n\n\n\\section{Empirical Applications} \\label{empiricalApps}\n\nWe wish to use the empirical approach of Section \\ref{bench} for several applications. One of this approach's strengths is that it can replicate any empirical distribution. In this section, we estimate the nonparametric model using the detailed new U.S. wealth distribution data of \\citet{Saez/Zucman:2014}.\\footnote{We use the wealth shares data of \\citet{Saez/Zucman:2014} because of its great detail, especially for top shares. It should be noted, however, that the procedure of estimating the model described in this section can be applied to any distribution of wealth.} We then use this estimated model to analyze future trends in inequality and to consider the distributional effects of progressive capital taxes under different assumptions about the future.\n\n\n\\subsection{Estimating the Model} \\label{usWealthDist}\nThroughout this paper, we set the number of households in the economy $N$ equal to one million. This number balances the need for realism with the need to perform computations and simulations in a reasonable amount of time. Furthermore, all of our results are essentially unchanged with an even larger number of households in the economy.\n\nAccording to equation \\eqref{wealthDistEq} from Theorem \\ref{wealthDistThm}, the stable distribution of wealth in the economy satisfies, for all $k = 1, \\ldots, N - 1$,\n\n", "itemtype": "equation", "pos": 40999, "prevtext": "\nIn this case, there exists a stable distribution of wealth for the subset of ranked households $w_{(1)}, \\ldots, w_{(m)}$, and the share of total wealth held by this top subset of households satisfies\\footnote{It is unlikely but possible that there are two or more maxima and hence $A_m = A_l$ for some $l \\neq m$. In this case, there still exists a divergent subset of households, although equation \\eqref{divergeDesc} must be changed to a time-averaged limit. This divergent subset is made up of the smallest subset of households with an average relative growth rate that is a maximum. See \\citet{Fernholz/Fernholz:2014} for a proof.}\n\n", "index": 45, "text": "\\begin{equation} \\label{divergeDesc}\n \\lim_{T\\to\\infty}\\theta_{(1)}(T) + \\cdots + \\theta_{(m)}(T) = 1, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\lim_{T\\to\\infty}\\theta_{(1)}(T)+\\cdots+\\theta_{(m)}(T)=1,{\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mn>1</mn><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nThis equation establishes a simple relationship between inequality as measured by the time-averaged limit of $\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k + 1)}(t)$, the rank-based reversion rates, $-{\\alpha}_k$, and the rank-based volatilities, ${\\sigma}_k$. As discussed in Section \\ref{bench}, we shall assume that equation \\eqref{wealthDistEq2} approximately describes the true versions of the wealth shares $\\theta_{(k)}$. Ideally, we would use detailed panel data on individual households' wealth holdings over time to estimate the quantities ${\\alpha}_k$ and ${\\sigma}_k$, and then confirm that these estimates replicate the observed wealth shares $\\theta_{(k)}$.\\footnote{This is the approach of \\citet{Fernholz:2002}, who shows that a similar model accurately replicates the distribution of total market capitalizations for U.S. stocks.} Of course, a comprehensive panel data set on household wealth holdings in the U.S. does not yet exist. Given these data limitations, we instead choose to use estimates of the wealth shares $\\theta_{(k)}$ and the rank-based volatilities ${\\sigma}_k$ to infer the values of the rank-based reversion rates ${\\alpha}_k$ via equation \\eqref{wealthDistEq2}. \n\n\n\nThe first step in this process is to generate estimates of the rank-based volatilities ${\\sigma}_k$. According to equation \\eqref{sigmaK}, these volatilities correspond to the time-averaged limit of the quadratic variation for the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$, which measures the relative wealth holdings of households that are adjacent in the wealth distribution. There is no research that directly estimates this quantity for U.S. household wealth holdings, but there is research that estimates the volatility of labor income and of the idiosyncratic component of capital income. We shall use these estimates to construct estimates of the volatility of relative wealth holdings.\n\n\n\n\nIn order to generate these estimates, consider the dynamic relationship between household wealth holdings, capital income, labor income, and consumption. If we let ${\\lambda}_i, c_i,$ and $r_i$ denote, respectively, the after-tax labor income, consumption, and after-tax return processes for household $i = 1, \\ldots, N$, then the dynamics of wealth over time for each household $i$ are given by\n\n", "itemtype": "equation", "pos": 44583, "prevtext": "\n\\end{thm}\n\nThe stable distribution of wealth for the top subpopulation of households $w_{(1)}, \\ldots, w_{(m)}$ is described using Theorem \\ref{wealthDistThm}, with the parameters ${\\alpha}_k$ defined as the time-averaged limit of the growth rates of wealth for different ranked households relative to the growth rate of the total wealth held by this group of households (same as equation \\eqref{alphaK}, but with ${\\mu}(t)$ replaced by the growth rate of $w_{(1)} + \\cdots + w_{(m)}$) and the volatility parameters ${\\sigma}_1, \\ldots, {\\sigma}_{m - 1}$ unchanged. This wealthy subset of households forms a separate stable distribution and eventually holds all wealth in the economy. During this process of divergence, this top subset of households gradually separates from the rest of the population so that eventually there is no more mobility between groups.\\footnote{See the proof of Theorem \\ref{wealthDistThm2} in Appendix \\ref{proofs} for a proof of this mobility result.}\n\nAs we shall explain in Section \\ref{empiricalApps}, the divergent scenario of Theorem \\ref{wealthDistThm2} may in fact be relevant to the current trajectory of the U.S. distribution of wealth. This theorem describes a particularly blatant form of divergence in which the wealth holdings of some subset of rich households is growing more quickly than the total wealth of the economy. In fact, the distribution of wealth is unstable even if all households have equal growth rates of wealth and hence no subset of households is growing faster than any other. In terms of the rank-based relative growth rates ${\\alpha}_k$, this implies that ${\\alpha}_1 = \\cdots = {\\alpha}_N$ and hence that all reversion rates are equal to zero. This special case has been analyzed in detail by both \\citet{Fargione/Lehman/Polasky:2011} and \\citet{Fernholz/Fernholz:2014}, the latter of who show that in this scenario wealth becomes increasingly concentrated over time in the sense that the time-averaged limit of the top wealth share $\\theta_{(1)}$ converges to one.\n\n\n\n\n\\vfill\n\n\\pagebreak\n\n\n\\section{Empirical Applications} \\label{empiricalApps}\n\nWe wish to use the empirical approach of Section \\ref{bench} for several applications. One of this approach's strengths is that it can replicate any empirical distribution. In this section, we estimate the nonparametric model using the detailed new U.S. wealth distribution data of \\citet{Saez/Zucman:2014}.\\footnote{We use the wealth shares data of \\citet{Saez/Zucman:2014} because of its great detail, especially for top shares. It should be noted, however, that the procedure of estimating the model described in this section can be applied to any distribution of wealth.} We then use this estimated model to analyze future trends in inequality and to consider the distributional effects of progressive capital taxes under different assumptions about the future.\n\n\n\\subsection{Estimating the Model} \\label{usWealthDist}\nThroughout this paper, we set the number of households in the economy $N$ equal to one million. This number balances the need for realism with the need to perform computations and simulations in a reasonable amount of time. Furthermore, all of our results are essentially unchanged with an even larger number of households in the economy.\n\nAccording to equation \\eqref{wealthDistEq} from Theorem \\ref{wealthDistThm}, the stable distribution of wealth in the economy satisfies, for all $k = 1, \\ldots, N - 1$,\n\n", "index": 47, "text": "\\begin{equation} \\label{wealthDistEq2}\n \\limT1{\\int_0^T}\\left(\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k + 1)}(t)\\right)\\,dt = \\frac{{\\sigma}^2_k}{-4({\\alpha}_1 + \\cdots + {\\alpha}_k)}, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\limT 1{\\int_{0}^{T}}\\left(\\log\\hat{\\theta}_{(k)}(t)-\\log\\hat{\\theta}_{(k+1)}(%&#10;t)\\right)\\,dt=\\frac{{\\sigma}^{2}_{k}}{-4({\\alpha}_{1}+\\cdots+{\\alpha}_{k})},{%&#10;\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nIt follows that to estimate the volatility of log household wealth holdings, we need estimates of the volatility of both idiosyncratic after-tax investment returns and idiosyncratic fluctuations in after-tax labor income minus consumption (savings), with the latter volatility expressed relative to total wealth holdings. Ownership of primary housing and private equity are well-documented examples of uninsurable investments subject to idiosyncratic risk. Following \\citet{Angeletos:2007}, \\citet{Benhabib/Bisin/Zhu:2011}, \\citet{Fernholz:2015a}, and much of the growing macroeconomic literature to feature idiosyncratic capital income risk, we set the standard deviation of idiosyncratic investment returns equal to $0.2$. This value is derived from the empirical analyses of \\citet{Flavin/Yamashita:2002} and \\citet{Case/Shiller:1989} for ownership of primary housing, and \\citet{Moskowitz/Vissing-Jorgensen:2002} for private equity.\n\nMeasuring the volatility of idiosyncratic fluctuations in after-tax labor income minus consumption relative to total wealth holdings is more difficult. Indeed, there is no research that directly measures this volatility. For our purposes, we wish to construct low and high estimates of this volatility, which, because it depends on household wealth holdings, will vary across the distribution of wealth. To construct these estimates, we first follow \\citet{Guvenen/Karahan/Ozkan/Song:2015} and set the standard deviation of changes in log labor income equal to $0.5$. We then combine this figure with the earnings and wealth holdings data from the 2007 \\emph{Survey of Consumer Finances} as reported by \\citet{DiazGimenez/Glover/RiosRull:2011} to construct estimates of the volatility of labor income relative to wealth holdings, which we assume is equal to the volatility of idiosyncratic fluctuations in after-tax labor income minus consumption relative to total wealth. Intentionally, these estimates may overstate the true volatility since they assume that all fluctuations in labor income both are idiosyncratic and lead to corresponding fluctuations in labor income minus consumption (there is no offsetting change in consumption).\n\n\n\nIf we add the estimated standard deviation of idiosyncratic fluctuations in labor income minus consumption relative to total wealth holdings to our estimate of the standard deviation of idiosyncratic investment returns $0.2$, then we obtain high estimates of the rank-based volatilities ${\\sigma}_k$.\\footnote{More precisely, these estimates are generated by adding the estimated variance of idiosyncratic fluctuations in labor income minus consumption relative to total wealth holdings to the estimated variance of idiosyncratic investment returns, multiplying by two, and then taking the square root.} These high estimates are reported in the third column of Table \\ref{sigmasTab}. We shall also consider low estimates of ${\\sigma}_k$, in which we assume that there is no volatility of idiosyncratic fluctuations in labor income minus consumption so that the rank-based volatilities are all equal to $\\sqrt{0.2^2 + 0.2^2} = 0.28$. These low estimates are reported in the second column of Table \\ref{sigmasTab}.\n\n\n\nTaken together, the low and high estimates of ${\\sigma}_k$ cover a wide range of plausible values for the rank-based volatilities.\\footnote{One implication of this is that these estimates of ${\\sigma}_k$ also imply a range of plausible values for the reversion rates $-{\\alpha}_k$, since these values are inferred using estimates of ${\\sigma}_k$ and the wealth shares $\\theta_{(k)}$.} This wide range reflects the substantial uncertainty that exists regarding the true volatility of the process $\\theta_{(k)} - \\theta_{(k+1)}$, which measures the relative wealth holdings of households that are adjacent in the wealth distribution. Despite this uncertainty, however, these low and high estimates of ${\\sigma}_k$ very likely provide lower and upper bounds for the true values of these parameters. Indeed, all of the available empirical evidence suggests that the true values of ${\\sigma}_k$ are above our low estimates and below our high estimates. Future work that estimates these rank-based volatilities more accurately will help to narrow this range.\n\nThe last step in estimating the model and matching the U.S. wealth distribution is to infer values for cross-sectional mean reversion $-{\\alpha}_k$ using equation \\eqref{wealthDistEq2}. Normally, this is straightforward since the system of $N - 1$ equations \\eqref{wealthDistEq2} together with the fact that ${\\alpha}_1 + \\cdots + {\\alpha}_N = 0$ yields a solution. The problem, in this case, is that there are no wealth shares data that report the wealth holdings of each individual household in the economy $\\theta_k$. Indeed, the data of \\citet{Saez/Zucman:2014} report the wealth holdings of just a few subsets of U.S. households.\n\nTo fill in the missing wealth shares data, we assume a Pareto-like distribution of wealth in which the parameter of the Pareto distribution varies across different subsets of households in a way that matches the data. In fact, we find that varying the Pareto parameter across just three subsets of households achieves a nearly perfect match of the 2012 U.S. wealth distribution as reported by \\citet{Saez/Zucman:2014}. Changing the Pareto parameter in this way is equivalent to assuming that the log-log plot of household rank versus household wealth holdings consists of three connected straight lines with different slopes.\\footnote{More specifically, there is one straight line for the top 0.01\\% of households, that line connects to another straight line with a different slope for the top 0.01-10\\% of households, and that line connects to a third straight line with a different slope for the bottom 90\\% of households. Such a distribution generates a total absolute error relative to the true U.S. distribution of wealth in 2012 of just over 0.5\\%. While it is certainly possible to vary this slope across even more subsets of households, our approach balances simplicity and accuracy without altering the model's basic results or predictions.} A plot of this kind that achieves the closest possible match for the 2012 U.S. wealth distribution is shown in Figure \\ref{wealthBasicFig}. This plot shows the value of log wealth shares $\\theta_{(k)}$ versus the log of rank $k$. Once the household wealth shares $\\theta_k$ are set, the rank-based reversion rates $-{\\alpha}_k$ are inferred by solving the system of $N - 1$ equations \\eqref{wealthDistEq2}.\n\nIn the case of a standard Pareto distribution, a log-log plot as in Figure \\ref{wealthBasicFig} appears as a single straight line with slope equal to the inverse of the Pareto parameter. Our approach is slightly more general and is preferred to restricting the stable distribution of wealth to a distribution such as Pareto or lognormal since it allows the model to more closely replicate the empirical distribution of wealth. This increased accuracy and flexibility highlights one of the model's advantages. Furthermore, our basic qualitative results remain unchanged even if we do restrict the stable distribution of wealth to a common distribution.\n\n\n\\subsection{The U.S. Wealth Distribution, Present and Future} \\label{usWealthPresentFuture}\nThe process of estimating the model as described in the previous subsection can be applied to any empirical distribution of wealth. This process yields implied values for the rank-based reversion rates $-{\\alpha}_k$ using wealth shares data and estimates of the volatilities ${\\sigma}_k$. Thus, if we use the 2012 U.S. wealth shares data of \\citet{Saez/Zucman:2014}---the most recent year these data cover---together with our low and high estimates of ${\\sigma}_k$ as reported in Table \\ref{sigmasTab}, then this generates low and high values for the rank-based reversion rates.\\footnote{Because this procedure produces two sets of one million different ${\\alpha}_k$ values, we cannot directly report these estimates in the paper.} These reversion rates generate a perfect match of a stable 2012 U.S. wealth distribution.\n\nAs the wealth shares data of \\citet{Saez/Zucman:2014} demonstrate, however, stability of the 2012 U.S. distribution of wealth is unlikely. Indeed, a stable distribution is one in which wealth shares are not trending up or down over time, but these data show that the share of total U.S. wealth held by the top 0.01\\% and 0.01-0.1\\% of households has been steadily rising since the mid-1980s. Our methodology offers several ways to address these stability issues. Most importantly, it is possible to estimate the future stable distribution of wealth using the empirical approach of Section \\ref{bench}. \n\nIn order to estimate the future stable distribution, we first observe the rate at which various wealth shares are changing in the economy, and then adjust the rank-based relative growth rates ${\\alpha}_k$ accordingly. For example, if we observe that the share of total wealth held by the top 1\\% of households is increasing at a rate of one percent per year, then we must increase by one percent the value of ${\\alpha}_k$ for all households in the top 1\\%. A similar adjustment must be made for all other subsets of households based on their changing shares of total wealth over time, as well. The future stable distribution that the current distribution of wealth is transitioning towards is then determined by the rank-based reversion rates implied by these adjusted relative growth rates ${\\alpha}_k$. One of the strengths of this empirical estimation strategy is that it depends only on the rate at which top wealth shares are changing over time and does not rely on any assumptions about the underlying causes of these changes.\n\nThe logic behind these adjustments to the parameters ${\\alpha}_k$ is simple. In a stable distribution, the growth rate of wealth of the $k$-th wealthiest household relative to the whole economy is equal to ${\\alpha}_k$. Because this distribution is stable, the share of wealth held by the $k$-th wealthiest household $\\theta_{(k)}$ should be growing by zero percent per year. If we instead observe that $\\theta_{(k)}$ is growing by one percent, then this implies that our estimate of ${\\alpha}_k$ is one percent too low.\\footnote{Of course, a more direct approach is to directly measure the relative growth rates ${\\alpha}_k$ empirically using panel data. Unfortunately, the lack of a comprehensive panel data set for wealth holdings rules this out.} Indeed, if our estimates of ${\\alpha}_k$ were correct, then the distribution of wealth would be stable, so any observed instability implies that these estimates must be adjusted.\n\nIn order to estimate the future stable distribution of wealth in the U.S., then, we shall use our estimates of mean reversion $-{\\alpha}_k$ for a stable 2012 U.S. wealth distribution and then adjust these estimates to account for different transitioning wealth shares scenarios. We consider four such scenarios. In the first, we simply assume that the U.S. wealth distribution was stable in 2012. Although this stable scenario is unrealistic given the observed changes in top wealth shares over the past few decades, as discussed above, it is nevertheless a useful baseline case to consider.\n\nIn the second scenario, we assume that the share of wealth held by the top 0.01\\% of households is increasing by 1\\% per year while the share of total wealth held by the bottom 90\\% of households is decreasing by 0.5\\% per year. No other subset of households is altering its share of total wealth in this scenario. The third scenario posits that the shares of total wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 1.5\\% and 0.5\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1\\% per year. Finally, in the fourth scenario, we assume that the shares of total wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 3\\% and 1\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1.5\\% per year.\n\n\n\nThis process of adjusting the rank-based relative growth rates ${\\alpha}_k$ to determine the adjusted reversion rates and estimate the future stable distribution of wealth in the U.S. can be applied to any observed changes in wealth shares over time. The four scenarios we consider are intended to capture a range of possible future changes in wealth shares that are of a smaller magnitude than those changes observed in the past few decades, according to the data of \\citet{Saez/Zucman:2014}.\\footnote{The changes in top shares over this same period according to the SCF are of a smaller magnitude than what is reported by \\citet{Saez/Zucman:2014}. Depending upon how the SCF data is adjusted, these data are consistent with an underlying trend somewhere between Scenarios 2 and 4.} Indeed, the magnitude of the changes observed in wealth shares over the past 30 years according to these data is difficult to reconcile with any stable distribution of wealth, a point we discuss in more detail below.\n\nThe predicted future stable distributions of wealth for the four scenarios are reported in Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4}. These future distributions vary across the low and high estimates of the volatilities ${\\sigma}_k$, although the tables show that the range of possible outcomes in between these two estimates is in most cases fairly narrow. The four scenarios taken together demonstrate that even a small upward trend in the top wealth shares of today's U.S. economy may imply a substantial increase in wealth concentration once the distribution stabilizes in the future. Indeed, Scenario 3, in which the shares of wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by a modest 1.5\\% and 0.5\\% per year, respectively, implies a future stable U.S. distribution of wealth with unprecedented levels of wealth concentration for both the low and high estimates of ${\\sigma}_k$. Scenario 4 involves an even faster upward trend in inequality than Scenario 3, so that according to Theorem \\ref{wealthDistThm2}, this scenario implies that the distribution separates into divergent subpopulations, with the top 0.01\\% of households eventually holding all wealth.\n\nFigure \\ref{wealthScenariosFig} jointly plots the distribution of wealth for all four scenarios using the high estimates of the volatilities ${\\sigma}_k$. This figure shows just how sensitive the future distribution of wealth is to upward trends in today's top wealth shares. Even though there is a modest difference between the outcomes of Scenarios 1 and 2, once the rate at which the share of wealth held by the top 0.01\\% of households is assumed to increase by more than 1\\% per year as in Scenarios 3 and 4, the future distribution of wealth transforms dramatically.\n\nThese hypothetical estimates of the future U.S. distribution of wealth are not intended as precise quantitative predictions about the future. The future is uncertain and subject to unpredictable changes in those factors that affect the distribution of wealth, such as policy, institutions, technology, and globalization. These factors will change in the future, and those changes will have an effect on the reversion rates $-{\\alpha}_k$ and hence on the stable distribution of wealth. Forecasting changes in these factors is well beyond the scope of this paper. Instead, the estimates of the future stable U.S. distribution of wealth in Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4} are intended to describe the trajectory of inequality in the absence of any future changes in the economic environment. These estimates describe where the U.S. distribution of wealth is currently headed, not whether it will actually get there before something else changes its trajectory.\n\nThe absolute concentration of wealth that occurs in Scenario 4 is part of an important set of outcomes in which there is no stable distribution of wealth. This occurs if the share of wealth held by the top 0.01\\% of households is increasing rapidly enough, since such rapid increases imply that the adjusted estimates of the rank-based relative growth rates ${\\alpha}_k$ for many households in the top 0.01\\% (those households with $k \\leq 100$) are positive. Too many values of ${\\alpha}_k$ greater than zero violates the stability condition from Theorem \\ref{wealthDistThm}, which states that ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$, for all $k = 1, \\ldots, N - 1$.\n\nIn these unstable scenarios, we know from Theorem \\ref{wealthDistThm2} that some subset of households is diverging from the rest of the population and forming a separate stable distribution that will eventually hold all wealth. This subset of households eventually separates permanently from the rest of the population so that there is no more movement into or out of this top group. In the case of Scenario 4, this divergent subpopulation consists of the top 0.01\\% of households, since most of the adjusted values of the parameters ${\\alpha}_k$ are positive for this group and negative for the rest of the population.\n\nThe dynamics by which the U.S. distribution of wealth splits in this scenario are illustrated in Figures \\ref{divergeFig1}-\\ref{divergeFig2}. Given initial wealth shares equal to those reported by \\citet{Saez/Zucman:2014} for the U.S. in 2012, Figure \\ref{divergeFig1} shows the simulated evolution over time of the shares of total wealth held by different groups within the top 1\\% of households in the economy. While the overall trend of the figure is unmistakable, it is also clear that the divergence of Scenario 4 is uneven, with the share of wealth held by the top 0.01\\% of households at times decreasing for several straight years. Over time, however, the top 0.01\\% of households gradually but steadily increase their share of total wealth, holding more than 40\\% of wealth by 2100 and over 80\\% of wealth by 2200. Figure \\ref{divergeFig2} shows this same divergent scenario for the top 1\\% of households together with the remaining 99\\% of households in the economy.\n\n\n\n\n\n\n\nIn the real world, of course, it is difficult to imagine that the distribution of wealth would ever truly separate and diverge as in Scenario 4. Long before this occurred, we would expect that some aspect of the economic environment would change. Interestingly, however, it is difficult to reject such a divergent trajectory for the current U.S. distribution of wealth. According to the wealth shares data of \\citet{Saez/Zucman:2014}, the share of wealth held by the top 0.01\\% of households in the U.S. has increased by an average of more than 3.5\\% per year since 2000 and more than 4\\% per year since 1980. Changes of this magnitude imply that the adjusted estimates of the rank-based relative growth rates ${\\alpha}_k$ are positive for the top 0.01\\% of households using both the low and high estimates of the volatilities ${\\sigma}_k$. It might be, then, that according to the wealth shares data of \\citet{Saez/Zucman:2014}, the U.S. distribution of wealth is currently on a temporarily divergent trajectory in which a tiny minority of wealthy households indefinitely increases its share of total wealth.\n\n\n\n\nUltimately, these difficult questions about the current trajectory of the U.S. distribution of wealth and its future direction cannot yet be answered definitively. The exact rate at which top U.S. wealth shares are currently growing is uncertain and varies across different data sets, as can be seen by comparing wealth shares estimates using the income-capitalization method to unadjusted or adjusted estimates from the \\emph{Survey of Consumer Finances} \\citep{Saez/Zucman:2014}. Only as more detailed and high quality data become available will we be able to provide answers with greater confidence. While this paper does provide preliminary answers and estimates, a more important contribution is to introduce a flexible empirical methodology with which to address these questions.\n\n\n\\subsection{Estimating the Effect of a Progressive Capital Tax}\nIn principle, the effects of any tax policy on the distribution of wealth can be approximated using our empirical approach. All that is necessary are estimates of the effects of the tax policy on the rank-based reversion rates $-{\\alpha}_k$ and volatilities ${\\sigma}_k$. After all, these two factors alone entirely determine the distribution of wealth. In many cases, however, obtaining reliable estimates of the impact of a tax on different households' reversion rates and volatilities of wealth is difficult. One important exception is the case of progressive capital taxes.\n\nThe empirical approach of Section \\ref{bench} is uniquely suited to estimating the distributional impact of progressive capital taxes since such taxes are designed to have more predictable effects on the growth rates of wealth for different households in the wealth distribution. For simplicity, we shall assume that a capital tax rate of 1\\% on some subset of households in the economy reduces the growth rate of wealth for those households by 1\\% (and hence also raises their reversion rates by 1\\%). Of course, this assumption does not directly take into account the equilibrium effects that such a tax may have on the saving behavior of households and the possibility that households may be able to successfully evade the tax. We choose this simplification because it represents a natural and useful benchmark case in which the reduced savings of households in response to a capital tax (which magnifies the effect of the tax) are exactly balanced by households' ability to evade the tax (which diminishes the effect of the tax). It is important to emphasize that alternative scenarios for the effect of a progressive capital tax are easily evaluated using our empirical approach by simply adjusting the tax's impact on the growth rates of household wealth accordingly.\\footnote{One major challenge of estimating the equilibrium effects of a progressive capital tax involves solving the portfolio optimization problem facing households in such an environment. Any further progress towards this end would yield information about how such a tax might alter the growth rates of wealth for different ranked households in equilibrium. This information could then be incorporated into this paper's nonparametric approach to generate general equilibrium estimates of the distributional effect of progressive capital taxes.} Indeed, it is only for brevity that we do not consider such alternative scenarios in this paper.\n\n\n\nEver since \\citet{Piketty:2014} proposed a progressive capital tax in response to increasing income and wealth inequality, much of the debate surrounding this policy has centered on how such taxes are likely to increase government revenues or distort economic outcomes rather than how they might affect the distribution of wealth. One of the contributions of this paper is to address this latter issue and provide estimates of the distributional effects of progressive capital taxes on the U.S. economy. These are purely empirical estimates that do not rely on any assumptions about the underlying causes of inequality, a point that is emphasized in the presentation of our model in Section \\ref{bench}. \n\n\n\n\n\n\n\n\n\nWe analyze a simple progressive capital tax similar to the policy proposed by \\citet{Piketty:2014}. Our version of this tax sets the capital tax rate for the top 0.5\\% of households in the economy equal to 2\\% and the rate for the top 0.5-1\\% of households equal to 1\\%, while the remaining 99\\% of households are assumed to neither pay nor receive any tax or subsidy. As a consequence, none of the revenue generated by the government from this progressive capital tax is redistributed to less wealthy households.\\footnote{It is straightforward to consider the distributional effects of such redistribution. However, since we find that these effects are quite small in our model of the U.S wealth distribution, we focus solely on the simple case of a tax without redistribution in this section.} Based on the U.S. wealth distribution data for 2012, this progressive capital tax corresponds to a 2\\% rate for those households with total wealth greater than roughly \\$6 million and a 1\\% rate for those households with total wealth between \\$4 and \\$6 million.\\footnote{The basic progressive capital tax proposed by \\citet{Piketty:2014} for Europe involves a 2\\% rate for those households with total wealth greater than \\euro 5 million, a \\%1 rate for those households with total wealth between \\euro 1 and \\euro 5 million, and no tax for the remaining households.} In terms of the parameters, we assume that this capital tax reduces the rank-based relative growth rates ${\\alpha}_k$ of those households that are taxed (the top 1\\%) by the rate at which they are taxed.\n\nIn order to examine a wide range of potential scenarios, we consider the stable distribution of wealth in the presence of this progressive capital tax for Scenarios 1-4 from Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4} using the low and high estimates of the volatilities ${\\sigma}_k$. These results are shown in Tables \\ref{taxSharesTab1}-\\ref{taxSharesTab4}. They are also shown graphically in Figures \\ref{taxFig1}-\\ref{taxFig4}, which plot the distribution of wealth both with and without a progressive capital tax for all four scenarios using the high estimates of the volatilities ${\\sigma}_k$.\n\nIn every scenario, the tables and figures show that a simple progressive capital tax imposed on just 1\\% of households in the economy substantially reshapes the distribution of wealth and reduces inequality. In the case of Scenarios 1 and 2, for example, the after-tax stable distribution of wealth is similar to the distribution observed in the U.S. in the 1970s, according to the historical wealth shares data of \\citet{Saez/Zucman:2014}. The fact that this period is one of the most egalitarian in the U.S. in the last century highlights just how significant this reduction in inequality is. Even for Scenarios 3 and 4, in which the distribution of wealth is either highly or fully concentrated at the top in the absence of a progressive capital tax, in all cases the tax reduces inequality to levels lower than those observed in the U.S. in 2012. This large effect is seen clearly in Figure \\ref{taxFig4}. Because there is no stable distribution using the high estimates of ${\\sigma}_k$ in the case of Scenario 4, this figure represents the distribution of wealth without a progressive capital tax by a vertical line indicating that the top 0.01\\% of households hold all the wealth in the economy. Only with the tax in place does a stable distribution exist, as shown by the dashed red line in the figure.\n\nHow is it that a 1-2\\% progressive capital tax levied on only 1\\% of households can reduce inequality so substantially? One might expect that such a large reduction in inequality requires that a larger subset of households be taxed. However, because the top 1\\% of households that pay the tax hold between 40-100\\% of total wealth depending upon the scenario, a large fraction of the economy's total wealth is in fact affected by this progressive capital tax. As the model demonstrates, this large fraction of total wealth is sufficient for the tax to significantly reshape the distribution of wealth.\n\nFinally, we stress that this result is not a statement about total welfare and not an endorsement of a progressive capital tax. As discussed in the introduction, our statistical model only generates empirical estimates of the distributional effects of taxes and other policies, it does not measure any distortions or costs associated with such policies. Our results about the effects of progressive capital taxes on inequality are intended only to add to our knowledge of the overall effects of such a policy.\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\vskip 70pt\n\n\n\n\\section{Conclusion} \\label{conclusion}\n\nIn this paper, we have developed a statistical model of inequality in which heterogeneous households are subject to both aggregate and idiosyncratic fluctuations in their wealth holdings. The model imposes few restrictions and no parametric structure on these fluctuations of household wealth. In this setting, we apply new techniques to obtain a closed-form household-by-household characterization of the stable distribution of wealth. According to this characterization, the distribution of wealth is shaped entirely by two factors---the reversion rates and idiosyncratic volatilities of wealth for different ranked households. The simplicity and generality of this result suggests that to understand the effect of factors such as policy, institutions, technology, or globalization on inequality, it is necessary only to understand the effect of these factors on the reversion rates and idiosyncratic volatilities of wealth. As a consequence, more detailed empirical work focused on accurately measuring the reversion rates and volatilities of wealth as well as any variation in these two factors over time and across different regions is likely to yield substantial new insights.\n\nOur statistical model can exactly match any empirical distribution, and we use the wealth shares data of \\citet{Saez/Zucman:2014} to construct such a match for the 2012 U.S. distribution of wealth. One of the challenges in analyzing this distribution is that these wealth shares data show a clear upward trend in top shares over the past three decades. These upward trends imply that any analysis that relies on a stable or steady-state distribution of wealth is flawed. This paper introduces a methodology that can address these stability issues. In particular, our approach allows us to estimate the future stable distribution of wealth in the presence of trends in top wealth shares. We present such estimates for several alternative scenarios, but the most likely scenario might be that according to the wealth shares data of \\citet{Saez/Zucman:2014}, the U.S. distribution of wealth is on a temporarily unstable trajectory in which it separates into two divergent subpopulations. We also present estimates of the distributional implications of progressive capital taxes. Specifically, we consider a capital tax of 1-2\\% levied on 1\\% of households similar to the tax proposed by \\citet{Piketty:2014}. Although the full effect of this tax depends on the uncertain future stable distribution of wealth, in all cases we find that this tax substantially reduces inequality and reshapes the distribution of wealth.\n\nThe statistical model that we develop in this paper is based on a general approach to rank-based systems. Although this approach is well-suited to modeling the distribution of wealth, it is not restricted to only modeling wealth. In fact, only in the case of unstable or i.i.d.-like processes is our general approach clearly not appropriate. This means that there are other areas of economics, such as the distribution of income and the world distribution of output, in which our tractable solution techniques may provide new information.\n\n\n\n\\pagebreak\n\n\n\\begin{spacing}{1.1}\n\n\n\\appendix\n\\section{Assumptions and Regularity Conditions} \\label{assumptions}\n\nIn this appendix, we present the assumptions and regularity conditions that are necessary for the stable wealth distribution characterization in Theorem \\ref{wealthDistThm}. As discussed in Section \\ref{bench}, these assumptions admit a large class of continuous wealth processes for the households in the economy. The first assumption establishes basic integrability conditions that are common for both continuous semimartingales and It{\\^o} processes.\n\n\\begin{ass} \\label{basicAss}\nFor all $i = 1, \\ldots, N$, the growth rate processes ${\\mu}_i$ satisfy\n\n", "itemtype": "equation", "pos": 47120, "prevtext": "\nThis equation establishes a simple relationship between inequality as measured by the time-averaged limit of $\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k + 1)}(t)$, the rank-based reversion rates, $-{\\alpha}_k$, and the rank-based volatilities, ${\\sigma}_k$. As discussed in Section \\ref{bench}, we shall assume that equation \\eqref{wealthDistEq2} approximately describes the true versions of the wealth shares $\\theta_{(k)}$. Ideally, we would use detailed panel data on individual households' wealth holdings over time to estimate the quantities ${\\alpha}_k$ and ${\\sigma}_k$, and then confirm that these estimates replicate the observed wealth shares $\\theta_{(k)}$.\\footnote{This is the approach of \\citet{Fernholz:2002}, who shows that a similar model accurately replicates the distribution of total market capitalizations for U.S. stocks.} Of course, a comprehensive panel data set on household wealth holdings in the U.S. does not yet exist. Given these data limitations, we instead choose to use estimates of the wealth shares $\\theta_{(k)}$ and the rank-based volatilities ${\\sigma}_k$ to infer the values of the rank-based reversion rates ${\\alpha}_k$ via equation \\eqref{wealthDistEq2}. \n\n\n\nThe first step in this process is to generate estimates of the rank-based volatilities ${\\sigma}_k$. According to equation \\eqref{sigmaK}, these volatilities correspond to the time-averaged limit of the quadratic variation for the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$, which measures the relative wealth holdings of households that are adjacent in the wealth distribution. There is no research that directly estimates this quantity for U.S. household wealth holdings, but there is research that estimates the volatility of labor income and of the idiosyncratic component of capital income. We shall use these estimates to construct estimates of the volatility of relative wealth holdings.\n\n\n\n\nIn order to generate these estimates, consider the dynamic relationship between household wealth holdings, capital income, labor income, and consumption. If we let ${\\lambda}_i, c_i,$ and $r_i$ denote, respectively, the after-tax labor income, consumption, and after-tax return processes for household $i = 1, \\ldots, N$, then the dynamics of wealth over time for each household $i$ are given by\n\n", "index": 49, "text": "\\begin{equation}\n dw_i(t) = w_i(t)r_i(t)\\,dt + \\left({\\lambda}_i(t) - c_i(t)\\right)\\,dt = w_i(t)\\left(r_i(t) + \\frac{{\\lambda}_i(t) - c_i(t)}{w_i(t)}\\right)\\,dt.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"dw_{i}(t)=w_{i}(t)r_{i}(t)\\,dt+\\left({\\lambda}_{i}(t)-c_{i}(t)\\right)\\,dt=w_{i%&#10;}(t)\\left(r_{i}(t)+\\frac{{\\lambda}_{i}(t)-c_{i}(t)}{w_{i}(t)}\\right)\\,dt.\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>r</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>λ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>=</mo><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>r</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mfrac><mrow><mrow><msub><mi>λ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nand the volatility processes ${\\delta}_i$ satisfy\n\n", "itemtype": "equation", "pos": 79188, "prevtext": "\nIt follows that to estimate the volatility of log household wealth holdings, we need estimates of the volatility of both idiosyncratic after-tax investment returns and idiosyncratic fluctuations in after-tax labor income minus consumption (savings), with the latter volatility expressed relative to total wealth holdings. Ownership of primary housing and private equity are well-documented examples of uninsurable investments subject to idiosyncratic risk. Following \\citet{Angeletos:2007}, \\citet{Benhabib/Bisin/Zhu:2011}, \\citet{Fernholz:2015a}, and much of the growing macroeconomic literature to feature idiosyncratic capital income risk, we set the standard deviation of idiosyncratic investment returns equal to $0.2$. This value is derived from the empirical analyses of \\citet{Flavin/Yamashita:2002} and \\citet{Case/Shiller:1989} for ownership of primary housing, and \\citet{Moskowitz/Vissing-Jorgensen:2002} for private equity.\n\nMeasuring the volatility of idiosyncratic fluctuations in after-tax labor income minus consumption relative to total wealth holdings is more difficult. Indeed, there is no research that directly measures this volatility. For our purposes, we wish to construct low and high estimates of this volatility, which, because it depends on household wealth holdings, will vary across the distribution of wealth. To construct these estimates, we first follow \\citet{Guvenen/Karahan/Ozkan/Song:2015} and set the standard deviation of changes in log labor income equal to $0.5$. We then combine this figure with the earnings and wealth holdings data from the 2007 \\emph{Survey of Consumer Finances} as reported by \\citet{DiazGimenez/Glover/RiosRull:2011} to construct estimates of the volatility of labor income relative to wealth holdings, which we assume is equal to the volatility of idiosyncratic fluctuations in after-tax labor income minus consumption relative to total wealth. Intentionally, these estimates may overstate the true volatility since they assume that all fluctuations in labor income both are idiosyncratic and lead to corresponding fluctuations in labor income minus consumption (there is no offsetting change in consumption).\n\n\n\nIf we add the estimated standard deviation of idiosyncratic fluctuations in labor income minus consumption relative to total wealth holdings to our estimate of the standard deviation of idiosyncratic investment returns $0.2$, then we obtain high estimates of the rank-based volatilities ${\\sigma}_k$.\\footnote{More precisely, these estimates are generated by adding the estimated variance of idiosyncratic fluctuations in labor income minus consumption relative to total wealth holdings to the estimated variance of idiosyncratic investment returns, multiplying by two, and then taking the square root.} These high estimates are reported in the third column of Table \\ref{sigmasTab}. We shall also consider low estimates of ${\\sigma}_k$, in which we assume that there is no volatility of idiosyncratic fluctuations in labor income minus consumption so that the rank-based volatilities are all equal to $\\sqrt{0.2^2 + 0.2^2} = 0.28$. These low estimates are reported in the second column of Table \\ref{sigmasTab}.\n\n\n\nTaken together, the low and high estimates of ${\\sigma}_k$ cover a wide range of plausible values for the rank-based volatilities.\\footnote{One implication of this is that these estimates of ${\\sigma}_k$ also imply a range of plausible values for the reversion rates $-{\\alpha}_k$, since these values are inferred using estimates of ${\\sigma}_k$ and the wealth shares $\\theta_{(k)}$.} This wide range reflects the substantial uncertainty that exists regarding the true volatility of the process $\\theta_{(k)} - \\theta_{(k+1)}$, which measures the relative wealth holdings of households that are adjacent in the wealth distribution. Despite this uncertainty, however, these low and high estimates of ${\\sigma}_k$ very likely provide lower and upper bounds for the true values of these parameters. Indeed, all of the available empirical evidence suggests that the true values of ${\\sigma}_k$ are above our low estimates and below our high estimates. Future work that estimates these rank-based volatilities more accurately will help to narrow this range.\n\nThe last step in estimating the model and matching the U.S. wealth distribution is to infer values for cross-sectional mean reversion $-{\\alpha}_k$ using equation \\eqref{wealthDistEq2}. Normally, this is straightforward since the system of $N - 1$ equations \\eqref{wealthDistEq2} together with the fact that ${\\alpha}_1 + \\cdots + {\\alpha}_N = 0$ yields a solution. The problem, in this case, is that there are no wealth shares data that report the wealth holdings of each individual household in the economy $\\theta_k$. Indeed, the data of \\citet{Saez/Zucman:2014} report the wealth holdings of just a few subsets of U.S. households.\n\nTo fill in the missing wealth shares data, we assume a Pareto-like distribution of wealth in which the parameter of the Pareto distribution varies across different subsets of households in a way that matches the data. In fact, we find that varying the Pareto parameter across just three subsets of households achieves a nearly perfect match of the 2012 U.S. wealth distribution as reported by \\citet{Saez/Zucman:2014}. Changing the Pareto parameter in this way is equivalent to assuming that the log-log plot of household rank versus household wealth holdings consists of three connected straight lines with different slopes.\\footnote{More specifically, there is one straight line for the top 0.01\\% of households, that line connects to another straight line with a different slope for the top 0.01-10\\% of households, and that line connects to a third straight line with a different slope for the bottom 90\\% of households. Such a distribution generates a total absolute error relative to the true U.S. distribution of wealth in 2012 of just over 0.5\\%. While it is certainly possible to vary this slope across even more subsets of households, our approach balances simplicity and accuracy without altering the model's basic results or predictions.} A plot of this kind that achieves the closest possible match for the 2012 U.S. wealth distribution is shown in Figure \\ref{wealthBasicFig}. This plot shows the value of log wealth shares $\\theta_{(k)}$ versus the log of rank $k$. Once the household wealth shares $\\theta_k$ are set, the rank-based reversion rates $-{\\alpha}_k$ are inferred by solving the system of $N - 1$ equations \\eqref{wealthDistEq2}.\n\nIn the case of a standard Pareto distribution, a log-log plot as in Figure \\ref{wealthBasicFig} appears as a single straight line with slope equal to the inverse of the Pareto parameter. Our approach is slightly more general and is preferred to restricting the stable distribution of wealth to a distribution such as Pareto or lognormal since it allows the model to more closely replicate the empirical distribution of wealth. This increased accuracy and flexibility highlights one of the model's advantages. Furthermore, our basic qualitative results remain unchanged even if we do restrict the stable distribution of wealth to a common distribution.\n\n\n\\subsection{The U.S. Wealth Distribution, Present and Future} \\label{usWealthPresentFuture}\nThe process of estimating the model as described in the previous subsection can be applied to any empirical distribution of wealth. This process yields implied values for the rank-based reversion rates $-{\\alpha}_k$ using wealth shares data and estimates of the volatilities ${\\sigma}_k$. Thus, if we use the 2012 U.S. wealth shares data of \\citet{Saez/Zucman:2014}---the most recent year these data cover---together with our low and high estimates of ${\\sigma}_k$ as reported in Table \\ref{sigmasTab}, then this generates low and high values for the rank-based reversion rates.\\footnote{Because this procedure produces two sets of one million different ${\\alpha}_k$ values, we cannot directly report these estimates in the paper.} These reversion rates generate a perfect match of a stable 2012 U.S. wealth distribution.\n\nAs the wealth shares data of \\citet{Saez/Zucman:2014} demonstrate, however, stability of the 2012 U.S. distribution of wealth is unlikely. Indeed, a stable distribution is one in which wealth shares are not trending up or down over time, but these data show that the share of total U.S. wealth held by the top 0.01\\% and 0.01-0.1\\% of households has been steadily rising since the mid-1980s. Our methodology offers several ways to address these stability issues. Most importantly, it is possible to estimate the future stable distribution of wealth using the empirical approach of Section \\ref{bench}. \n\nIn order to estimate the future stable distribution, we first observe the rate at which various wealth shares are changing in the economy, and then adjust the rank-based relative growth rates ${\\alpha}_k$ accordingly. For example, if we observe that the share of total wealth held by the top 1\\% of households is increasing at a rate of one percent per year, then we must increase by one percent the value of ${\\alpha}_k$ for all households in the top 1\\%. A similar adjustment must be made for all other subsets of households based on their changing shares of total wealth over time, as well. The future stable distribution that the current distribution of wealth is transitioning towards is then determined by the rank-based reversion rates implied by these adjusted relative growth rates ${\\alpha}_k$. One of the strengths of this empirical estimation strategy is that it depends only on the rate at which top wealth shares are changing over time and does not rely on any assumptions about the underlying causes of these changes.\n\nThe logic behind these adjustments to the parameters ${\\alpha}_k$ is simple. In a stable distribution, the growth rate of wealth of the $k$-th wealthiest household relative to the whole economy is equal to ${\\alpha}_k$. Because this distribution is stable, the share of wealth held by the $k$-th wealthiest household $\\theta_{(k)}$ should be growing by zero percent per year. If we instead observe that $\\theta_{(k)}$ is growing by one percent, then this implies that our estimate of ${\\alpha}_k$ is one percent too low.\\footnote{Of course, a more direct approach is to directly measure the relative growth rates ${\\alpha}_k$ empirically using panel data. Unfortunately, the lack of a comprehensive panel data set for wealth holdings rules this out.} Indeed, if our estimates of ${\\alpha}_k$ were correct, then the distribution of wealth would be stable, so any observed instability implies that these estimates must be adjusted.\n\nIn order to estimate the future stable distribution of wealth in the U.S., then, we shall use our estimates of mean reversion $-{\\alpha}_k$ for a stable 2012 U.S. wealth distribution and then adjust these estimates to account for different transitioning wealth shares scenarios. We consider four such scenarios. In the first, we simply assume that the U.S. wealth distribution was stable in 2012. Although this stable scenario is unrealistic given the observed changes in top wealth shares over the past few decades, as discussed above, it is nevertheless a useful baseline case to consider.\n\nIn the second scenario, we assume that the share of wealth held by the top 0.01\\% of households is increasing by 1\\% per year while the share of total wealth held by the bottom 90\\% of households is decreasing by 0.5\\% per year. No other subset of households is altering its share of total wealth in this scenario. The third scenario posits that the shares of total wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 1.5\\% and 0.5\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1\\% per year. Finally, in the fourth scenario, we assume that the shares of total wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 3\\% and 1\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1.5\\% per year.\n\n\n\nThis process of adjusting the rank-based relative growth rates ${\\alpha}_k$ to determine the adjusted reversion rates and estimate the future stable distribution of wealth in the U.S. can be applied to any observed changes in wealth shares over time. The four scenarios we consider are intended to capture a range of possible future changes in wealth shares that are of a smaller magnitude than those changes observed in the past few decades, according to the data of \\citet{Saez/Zucman:2014}.\\footnote{The changes in top shares over this same period according to the SCF are of a smaller magnitude than what is reported by \\citet{Saez/Zucman:2014}. Depending upon how the SCF data is adjusted, these data are consistent with an underlying trend somewhere between Scenarios 2 and 4.} Indeed, the magnitude of the changes observed in wealth shares over the past 30 years according to these data is difficult to reconcile with any stable distribution of wealth, a point we discuss in more detail below.\n\nThe predicted future stable distributions of wealth for the four scenarios are reported in Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4}. These future distributions vary across the low and high estimates of the volatilities ${\\sigma}_k$, although the tables show that the range of possible outcomes in between these two estimates is in most cases fairly narrow. The four scenarios taken together demonstrate that even a small upward trend in the top wealth shares of today's U.S. economy may imply a substantial increase in wealth concentration once the distribution stabilizes in the future. Indeed, Scenario 3, in which the shares of wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by a modest 1.5\\% and 0.5\\% per year, respectively, implies a future stable U.S. distribution of wealth with unprecedented levels of wealth concentration for both the low and high estimates of ${\\sigma}_k$. Scenario 4 involves an even faster upward trend in inequality than Scenario 3, so that according to Theorem \\ref{wealthDistThm2}, this scenario implies that the distribution separates into divergent subpopulations, with the top 0.01\\% of households eventually holding all wealth.\n\nFigure \\ref{wealthScenariosFig} jointly plots the distribution of wealth for all four scenarios using the high estimates of the volatilities ${\\sigma}_k$. This figure shows just how sensitive the future distribution of wealth is to upward trends in today's top wealth shares. Even though there is a modest difference between the outcomes of Scenarios 1 and 2, once the rate at which the share of wealth held by the top 0.01\\% of households is assumed to increase by more than 1\\% per year as in Scenarios 3 and 4, the future distribution of wealth transforms dramatically.\n\nThese hypothetical estimates of the future U.S. distribution of wealth are not intended as precise quantitative predictions about the future. The future is uncertain and subject to unpredictable changes in those factors that affect the distribution of wealth, such as policy, institutions, technology, and globalization. These factors will change in the future, and those changes will have an effect on the reversion rates $-{\\alpha}_k$ and hence on the stable distribution of wealth. Forecasting changes in these factors is well beyond the scope of this paper. Instead, the estimates of the future stable U.S. distribution of wealth in Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4} are intended to describe the trajectory of inequality in the absence of any future changes in the economic environment. These estimates describe where the U.S. distribution of wealth is currently headed, not whether it will actually get there before something else changes its trajectory.\n\nThe absolute concentration of wealth that occurs in Scenario 4 is part of an important set of outcomes in which there is no stable distribution of wealth. This occurs if the share of wealth held by the top 0.01\\% of households is increasing rapidly enough, since such rapid increases imply that the adjusted estimates of the rank-based relative growth rates ${\\alpha}_k$ for many households in the top 0.01\\% (those households with $k \\leq 100$) are positive. Too many values of ${\\alpha}_k$ greater than zero violates the stability condition from Theorem \\ref{wealthDistThm}, which states that ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$, for all $k = 1, \\ldots, N - 1$.\n\nIn these unstable scenarios, we know from Theorem \\ref{wealthDistThm2} that some subset of households is diverging from the rest of the population and forming a separate stable distribution that will eventually hold all wealth. This subset of households eventually separates permanently from the rest of the population so that there is no more movement into or out of this top group. In the case of Scenario 4, this divergent subpopulation consists of the top 0.01\\% of households, since most of the adjusted values of the parameters ${\\alpha}_k$ are positive for this group and negative for the rest of the population.\n\nThe dynamics by which the U.S. distribution of wealth splits in this scenario are illustrated in Figures \\ref{divergeFig1}-\\ref{divergeFig2}. Given initial wealth shares equal to those reported by \\citet{Saez/Zucman:2014} for the U.S. in 2012, Figure \\ref{divergeFig1} shows the simulated evolution over time of the shares of total wealth held by different groups within the top 1\\% of households in the economy. While the overall trend of the figure is unmistakable, it is also clear that the divergence of Scenario 4 is uneven, with the share of wealth held by the top 0.01\\% of households at times decreasing for several straight years. Over time, however, the top 0.01\\% of households gradually but steadily increase their share of total wealth, holding more than 40\\% of wealth by 2100 and over 80\\% of wealth by 2200. Figure \\ref{divergeFig2} shows this same divergent scenario for the top 1\\% of households together with the remaining 99\\% of households in the economy.\n\n\n\n\n\n\n\nIn the real world, of course, it is difficult to imagine that the distribution of wealth would ever truly separate and diverge as in Scenario 4. Long before this occurred, we would expect that some aspect of the economic environment would change. Interestingly, however, it is difficult to reject such a divergent trajectory for the current U.S. distribution of wealth. According to the wealth shares data of \\citet{Saez/Zucman:2014}, the share of wealth held by the top 0.01\\% of households in the U.S. has increased by an average of more than 3.5\\% per year since 2000 and more than 4\\% per year since 1980. Changes of this magnitude imply that the adjusted estimates of the rank-based relative growth rates ${\\alpha}_k$ are positive for the top 0.01\\% of households using both the low and high estimates of the volatilities ${\\sigma}_k$. It might be, then, that according to the wealth shares data of \\citet{Saez/Zucman:2014}, the U.S. distribution of wealth is currently on a temporarily divergent trajectory in which a tiny minority of wealthy households indefinitely increases its share of total wealth.\n\n\n\n\nUltimately, these difficult questions about the current trajectory of the U.S. distribution of wealth and its future direction cannot yet be answered definitively. The exact rate at which top U.S. wealth shares are currently growing is uncertain and varies across different data sets, as can be seen by comparing wealth shares estimates using the income-capitalization method to unadjusted or adjusted estimates from the \\emph{Survey of Consumer Finances} \\citep{Saez/Zucman:2014}. Only as more detailed and high quality data become available will we be able to provide answers with greater confidence. While this paper does provide preliminary answers and estimates, a more important contribution is to introduce a flexible empirical methodology with which to address these questions.\n\n\n\\subsection{Estimating the Effect of a Progressive Capital Tax}\nIn principle, the effects of any tax policy on the distribution of wealth can be approximated using our empirical approach. All that is necessary are estimates of the effects of the tax policy on the rank-based reversion rates $-{\\alpha}_k$ and volatilities ${\\sigma}_k$. After all, these two factors alone entirely determine the distribution of wealth. In many cases, however, obtaining reliable estimates of the impact of a tax on different households' reversion rates and volatilities of wealth is difficult. One important exception is the case of progressive capital taxes.\n\nThe empirical approach of Section \\ref{bench} is uniquely suited to estimating the distributional impact of progressive capital taxes since such taxes are designed to have more predictable effects on the growth rates of wealth for different households in the wealth distribution. For simplicity, we shall assume that a capital tax rate of 1\\% on some subset of households in the economy reduces the growth rate of wealth for those households by 1\\% (and hence also raises their reversion rates by 1\\%). Of course, this assumption does not directly take into account the equilibrium effects that such a tax may have on the saving behavior of households and the possibility that households may be able to successfully evade the tax. We choose this simplification because it represents a natural and useful benchmark case in which the reduced savings of households in response to a capital tax (which magnifies the effect of the tax) are exactly balanced by households' ability to evade the tax (which diminishes the effect of the tax). It is important to emphasize that alternative scenarios for the effect of a progressive capital tax are easily evaluated using our empirical approach by simply adjusting the tax's impact on the growth rates of household wealth accordingly.\\footnote{One major challenge of estimating the equilibrium effects of a progressive capital tax involves solving the portfolio optimization problem facing households in such an environment. Any further progress towards this end would yield information about how such a tax might alter the growth rates of wealth for different ranked households in equilibrium. This information could then be incorporated into this paper's nonparametric approach to generate general equilibrium estimates of the distributional effect of progressive capital taxes.} Indeed, it is only for brevity that we do not consider such alternative scenarios in this paper.\n\n\n\nEver since \\citet{Piketty:2014} proposed a progressive capital tax in response to increasing income and wealth inequality, much of the debate surrounding this policy has centered on how such taxes are likely to increase government revenues or distort economic outcomes rather than how they might affect the distribution of wealth. One of the contributions of this paper is to address this latter issue and provide estimates of the distributional effects of progressive capital taxes on the U.S. economy. These are purely empirical estimates that do not rely on any assumptions about the underlying causes of inequality, a point that is emphasized in the presentation of our model in Section \\ref{bench}. \n\n\n\n\n\n\n\n\n\nWe analyze a simple progressive capital tax similar to the policy proposed by \\citet{Piketty:2014}. Our version of this tax sets the capital tax rate for the top 0.5\\% of households in the economy equal to 2\\% and the rate for the top 0.5-1\\% of households equal to 1\\%, while the remaining 99\\% of households are assumed to neither pay nor receive any tax or subsidy. As a consequence, none of the revenue generated by the government from this progressive capital tax is redistributed to less wealthy households.\\footnote{It is straightforward to consider the distributional effects of such redistribution. However, since we find that these effects are quite small in our model of the U.S wealth distribution, we focus solely on the simple case of a tax without redistribution in this section.} Based on the U.S. wealth distribution data for 2012, this progressive capital tax corresponds to a 2\\% rate for those households with total wealth greater than roughly \\$6 million and a 1\\% rate for those households with total wealth between \\$4 and \\$6 million.\\footnote{The basic progressive capital tax proposed by \\citet{Piketty:2014} for Europe involves a 2\\% rate for those households with total wealth greater than \\euro 5 million, a \\%1 rate for those households with total wealth between \\euro 1 and \\euro 5 million, and no tax for the remaining households.} In terms of the parameters, we assume that this capital tax reduces the rank-based relative growth rates ${\\alpha}_k$ of those households that are taxed (the top 1\\%) by the rate at which they are taxed.\n\nIn order to examine a wide range of potential scenarios, we consider the stable distribution of wealth in the presence of this progressive capital tax for Scenarios 1-4 from Tables \\ref{futureSharesTab1}-\\ref{futureSharesTab4} using the low and high estimates of the volatilities ${\\sigma}_k$. These results are shown in Tables \\ref{taxSharesTab1}-\\ref{taxSharesTab4}. They are also shown graphically in Figures \\ref{taxFig1}-\\ref{taxFig4}, which plot the distribution of wealth both with and without a progressive capital tax for all four scenarios using the high estimates of the volatilities ${\\sigma}_k$.\n\nIn every scenario, the tables and figures show that a simple progressive capital tax imposed on just 1\\% of households in the economy substantially reshapes the distribution of wealth and reduces inequality. In the case of Scenarios 1 and 2, for example, the after-tax stable distribution of wealth is similar to the distribution observed in the U.S. in the 1970s, according to the historical wealth shares data of \\citet{Saez/Zucman:2014}. The fact that this period is one of the most egalitarian in the U.S. in the last century highlights just how significant this reduction in inequality is. Even for Scenarios 3 and 4, in which the distribution of wealth is either highly or fully concentrated at the top in the absence of a progressive capital tax, in all cases the tax reduces inequality to levels lower than those observed in the U.S. in 2012. This large effect is seen clearly in Figure \\ref{taxFig4}. Because there is no stable distribution using the high estimates of ${\\sigma}_k$ in the case of Scenario 4, this figure represents the distribution of wealth without a progressive capital tax by a vertical line indicating that the top 0.01\\% of households hold all the wealth in the economy. Only with the tax in place does a stable distribution exist, as shown by the dashed red line in the figure.\n\nHow is it that a 1-2\\% progressive capital tax levied on only 1\\% of households can reduce inequality so substantially? One might expect that such a large reduction in inequality requires that a larger subset of households be taxed. However, because the top 1\\% of households that pay the tax hold between 40-100\\% of total wealth depending upon the scenario, a large fraction of the economy's total wealth is in fact affected by this progressive capital tax. As the model demonstrates, this large fraction of total wealth is sufficient for the tax to significantly reshape the distribution of wealth.\n\nFinally, we stress that this result is not a statement about total welfare and not an endorsement of a progressive capital tax. As discussed in the introduction, our statistical model only generates empirical estimates of the distributional effects of taxes and other policies, it does not measure any distortions or costs associated with such policies. Our results about the effects of progressive capital taxes on inequality are intended only to add to our knowledge of the overall effects of such a policy.\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\vskip 70pt\n\n\n\n\\section{Conclusion} \\label{conclusion}\n\nIn this paper, we have developed a statistical model of inequality in which heterogeneous households are subject to both aggregate and idiosyncratic fluctuations in their wealth holdings. The model imposes few restrictions and no parametric structure on these fluctuations of household wealth. In this setting, we apply new techniques to obtain a closed-form household-by-household characterization of the stable distribution of wealth. According to this characterization, the distribution of wealth is shaped entirely by two factors---the reversion rates and idiosyncratic volatilities of wealth for different ranked households. The simplicity and generality of this result suggests that to understand the effect of factors such as policy, institutions, technology, or globalization on inequality, it is necessary only to understand the effect of these factors on the reversion rates and idiosyncratic volatilities of wealth. As a consequence, more detailed empirical work focused on accurately measuring the reversion rates and volatilities of wealth as well as any variation in these two factors over time and across different regions is likely to yield substantial new insights.\n\nOur statistical model can exactly match any empirical distribution, and we use the wealth shares data of \\citet{Saez/Zucman:2014} to construct such a match for the 2012 U.S. distribution of wealth. One of the challenges in analyzing this distribution is that these wealth shares data show a clear upward trend in top shares over the past three decades. These upward trends imply that any analysis that relies on a stable or steady-state distribution of wealth is flawed. This paper introduces a methodology that can address these stability issues. In particular, our approach allows us to estimate the future stable distribution of wealth in the presence of trends in top wealth shares. We present such estimates for several alternative scenarios, but the most likely scenario might be that according to the wealth shares data of \\citet{Saez/Zucman:2014}, the U.S. distribution of wealth is on a temporarily unstable trajectory in which it separates into two divergent subpopulations. We also present estimates of the distributional implications of progressive capital taxes. Specifically, we consider a capital tax of 1-2\\% levied on 1\\% of households similar to the tax proposed by \\citet{Piketty:2014}. Although the full effect of this tax depends on the uncertain future stable distribution of wealth, in all cases we find that this tax substantially reduces inequality and reshapes the distribution of wealth.\n\nThe statistical model that we develop in this paper is based on a general approach to rank-based systems. Although this approach is well-suited to modeling the distribution of wealth, it is not restricted to only modeling wealth. In fact, only in the case of unstable or i.i.d.-like processes is our general approach clearly not appropriate. This means that there are other areas of economics, such as the distribution of income and the world distribution of output, in which our tractable solution techniques may provide new information.\n\n\n\n\\pagebreak\n\n\n\\begin{spacing}{1.1}\n\n\n\\appendix\n\\section{Assumptions and Regularity Conditions} \\label{assumptions}\n\nIn this appendix, we present the assumptions and regularity conditions that are necessary for the stable wealth distribution characterization in Theorem \\ref{wealthDistThm}. As discussed in Section \\ref{bench}, these assumptions admit a large class of continuous wealth processes for the households in the economy. The first assumption establishes basic integrability conditions that are common for both continuous semimartingales and It{\\^o} processes.\n\n\\begin{ass} \\label{basicAss}\nFor all $i = 1, \\ldots, N$, the growth rate processes ${\\mu}_i$ satisfy\n\n", "index": 51, "text": "\\begin{equation} \\label{growthIntegrability}\n {\\int_0^T}|{\\mu}_i(t)|\\,dt < \\infty, \\quad \\text{$T > 0$,} {\\quad\\text{\\rm a.s.}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"{\\int_{0}^{T}}|{\\mu}_{i}(t)|\\,dt&lt;\\infty,\\quad\\text{$T&gt;0$,}{\\quad\\text{\\rm a.s.%&#10;}},\" display=\"block\"><mrow><mrow><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow><mo>&lt;</mo><mrow><mi mathvariant=\"normal\">∞</mi><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>T</mi><mo>&gt;</mo><mn>0</mn></mrow><mtext>,</mtext></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\\end{ass}\n\nConditions \\eqref{growthIntegrability} and \\eqref{volIntegrability} are standard in the definition of an It{\\^o} process, while condition \\eqref{volPositive} ensures that household wealth holdings contain a nonzero random component at all times. Condition \\eqref{volBounded} is similar to a boundedness condition in that it ensures that the variance of household wealth holdings does not diverge to infinity too rapidly.\n\nThe second assumption underlying our results establishes that no two households' wealth holdings be perfectly correlated over time. In other words, there must always be some idiosyncratic component to household wealth dynamics. Finally, we also assume that no household's wealth holdings relative to the economy shall disappear too rapidly.\n\n\\begin{ass} \\label{corrAss}\nThe symmetric matrix ${\\rho}(t)$, given by ${\\rho}(t) = ({\\rho}_{ij}(t))$, where $1 \\leq i, j \\leq N$, is nonsingular for all $t > 0$, a.s.\n\\end{ass}\n\n\\begin{ass} \\label{coherentAss}\nFor all $i = 1, \\ldots, N$, the wealth share processes $\\theta_i$ satisfy\n\n", "itemtype": "equation", "pos": 79382, "prevtext": "\nand the volatility processes ${\\delta}_i$ satisfy\n\n", "index": 53, "text": "\\begin{align}\n & {\\int_0^T}\\left({\\delta}^2_1(t) + \\cdots + {\\delta}^2_M(t)\\right)\\,dt < \\infty, \\quad \\text{$T > 0$,} {\\quad\\text{\\rm a.s.}}, \\label{volIntegrability} \\\\\n & {\\delta}^2_1(t) + \\cdots + {\\delta}^2_M(t) > 0, \\quad \\text{$t > 0$,} {\\quad\\text{\\rm a.s.}} \\label{volPositive} \\\\\n & \\limt1\\left({\\delta}^2_1(t) + \\cdots + {\\delta}^2_M(t)\\right) \\log\\log t = 0, \\label{volBounded} {\\quad\\text{\\rm a.s.}},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\int_{0}^{T}}\\left({\\delta}^{2}_{1}(t)+\\cdots+{\\delta}^{2}_{M}(t%&#10;)\\right)\\,dt&lt;\\infty,\\quad\\text{$T&gt;0$,}{\\quad\\text{\\rm a.s.}},\" display=\"inline\"><mrow><mrow><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><mrow><mo>(</mo><mrow><mrow><msubsup><mi>δ</mi><mn>1</mn><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msubsup><mi>δ</mi><mi>M</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow><mo>&lt;</mo><mrow><mi mathvariant=\"normal\">∞</mi><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>T</mi><mo>&gt;</mo><mn>0</mn></mrow><mtext>,</mtext></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\delta}^{2}_{1}(t)+\\cdots+{\\delta}^{2}_{M}(t)&gt;0,\\quad\\text{$t&gt;0$%&#10;,}{\\quad\\text{\\rm a.s.}}\" display=\"inline\"><mrow><mrow><mrow><msubsup><mi>δ</mi><mn>1</mn><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msubsup><mi>δ</mi><mi>M</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><mn>0</mn><mo rspace=\"12.5pt\">,</mo><mrow><mrow><mi>t</mi><mo>&gt;</mo><mn>0</mn></mrow><mtext>,</mtext></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>a.s.</mtext></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\limt 1\\left({\\delta}^{2}_{1}(t)+\\cdots+{\\delta}^{2}_{M}(t)\\right%&#10;)\\log\\log t=0,{\\quad\\text{\\rm a.s.}},\" display=\"inline\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limt</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msubsup><mi>δ</mi><mn>1</mn><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msubsup><mi>δ</mi><mi>M</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mi>log</mi><mo>⁡</mo><mi>t</mi></mrow></mrow></mrow><mo>=</mo><mrow><mn>0</mn><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\\end{ass}\n\n\n\\vskip 50pt\n\n\n\\section{Proofs} \\label{proofs}\n\nThis appendix presents the proofs of Lemmas \\ref{totalWealthLemma} and \\ref{localTimeLemma} and Theorems \\ref{wealthDistThm} and \\ref{wealthDistThm2}.\n\n\\begin{proofLemma1}\nBy definition, $w(t) = w_1(t) + \\cdots + w_N(t)$ and for all $i = 1, \\ldots, N$, $\\theta_i(t) = w_i(t)/w(t)$. This implies that\n\n", "itemtype": "equation", "pos": 80868, "prevtext": "\n\\end{ass}\n\nConditions \\eqref{growthIntegrability} and \\eqref{volIntegrability} are standard in the definition of an It{\\^o} process, while condition \\eqref{volPositive} ensures that household wealth holdings contain a nonzero random component at all times. Condition \\eqref{volBounded} is similar to a boundedness condition in that it ensures that the variance of household wealth holdings does not diverge to infinity too rapidly.\n\nThe second assumption underlying our results establishes that no two households' wealth holdings be perfectly correlated over time. In other words, there must always be some idiosyncratic component to household wealth dynamics. Finally, we also assume that no household's wealth holdings relative to the economy shall disappear too rapidly.\n\n\\begin{ass} \\label{corrAss}\nThe symmetric matrix ${\\rho}(t)$, given by ${\\rho}(t) = ({\\rho}_{ij}(t))$, where $1 \\leq i, j \\leq N$, is nonsingular for all $t > 0$, a.s.\n\\end{ass}\n\n\\begin{ass} \\label{coherentAss}\nFor all $i = 1, \\ldots, N$, the wealth share processes $\\theta_i$ satisfy\n\n", "index": 55, "text": "\\begin{equation}\n\\limt1\\log\\theta_i(t) = 0, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"\\limt 1\\log\\theta_{i}(t)=0,{\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limt</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>0</mn><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfrom which it follows that\n\n", "itemtype": "equation", "pos": 81309, "prevtext": "\n\\end{ass}\n\n\n\\vskip 50pt\n\n\n\\section{Proofs} \\label{proofs}\n\nThis appendix presents the proofs of Lemmas \\ref{totalWealthLemma} and \\ref{localTimeLemma} and Theorems \\ref{wealthDistThm} and \\ref{wealthDistThm2}.\n\n\\begin{proofLemma1}\nBy definition, $w(t) = w_1(t) + \\cdots + w_N(t)$ and for all $i = 1, \\ldots, N$, $\\theta_i(t) = w_i(t)/w(t)$. This implies that\n\n", "index": 57, "text": "\\begin{equation*}\n dw(t) = \\sum_{i=1}^Ndw_i(t) = \\sum_{i=1}^N\\theta_i(t)w(t)\\frac{dw_i(t)}{w_i(t)},\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"dw(t)=\\sum_{i=1}^{N}dw_{i}(t)=\\sum_{i=1}^{N}\\theta_{i}(t)w(t)\\frac{dw_{i}(t)}{%&#10;w_{i}(t)},\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nWe wish to show that the process satisfying equation \\eqref{totalWealthDynamics} also satisfies equation \\eqref{totalWealthDynamicsProof}.\n\nIf we apply {It{\\^o}}'s Lemma to the exponential function, then equation \\eqref{totalWealthDynamics} yields\n\n", "itemtype": "equation", "pos": 81452, "prevtext": "\nfrom which it follows that\n\n", "index": 59, "text": "\\begin{equation} \\label{totalWealthDynamicsProof}\n \\frac{dw(t)}{w(t)} = \\sum_{i=1}^N\\theta_i(t)\\frac{dw_i(t)}{w_i(t)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\frac{dw(t)}{w(t)}=\\sum_{i=1}^{N}\\theta_{i}(t)\\frac{dw_{i}(t)}{w_{i}(t)}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\na.s., where ${\\mu}(t)$ is given by equation \\eqref{mu}. Using the definition of ${\\rho}_{ij}(t)$ from equation \\eqref{rhoIJ}, we can simplify equation \\eqref{totalWealthDynamicsProof} and write\n\n", "itemtype": "equation", "pos": 81834, "prevtext": "\nWe wish to show that the process satisfying equation \\eqref{totalWealthDynamics} also satisfies equation \\eqref{totalWealthDynamicsProof}.\n\nIf we apply {It{\\^o}}'s Lemma to the exponential function, then equation \\eqref{totalWealthDynamics} yields\n\n", "index": 61, "text": "\\begin{equation} \\label{totalWealthDynamicsProof2}\n\\begin{aligned}\n dw(t) & = w(t){\\mu}(t)\\,dt + \\frac{1}{2}w(t)\\sum_{i,j=1}^N\\theta_i(t)\\theta_j(t)\\left(\\sum_{z=1}^M{\\delta}_{iz}(t){\\delta}_{jz}(t)\\right)\\,dt \\\\\n  & \\qquad + w(t)\\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t),\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle dw(t)\" display=\"inline\"><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle=w(t){\\mu}(t)\\,dt+\\frac{1}{2}w(t)\\sum_{i,j=1}^{N}\\theta_{i}(t)%&#10;\\theta_{j}(t)\\left(\\sum_{z=1}^{M}{\\delta}_{iz}(t){\\delta}_{jz}(t)\\right)\\,dt\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>θ</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>j</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad+w(t)\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(t){\\delta}_{iz}%&#10;(t)\\,dB_{z}(t),\" display=\"inline\"><mrow><mrow><mo lspace=\"22.5pt\">+</mo><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nSimilarly, the definition of ${\\mu}(t)$ from equation \\eqref{mu} allows us to further simplify equation \\eqref{totalWealthDynamicsProof3} and write\n\n", "itemtype": "equation", "pos": 82349, "prevtext": "\na.s., where ${\\mu}(t)$ is given by equation \\eqref{mu}. Using the definition of ${\\rho}_{ij}(t)$ from equation \\eqref{rhoIJ}, we can simplify equation \\eqref{totalWealthDynamicsProof} and write\n\n", "index": 63, "text": "\\begin{equation} \\label{totalWealthDynamicsProof3}\n\\frac{dw(t)}{w(t)} = \\left({\\mu}(t) + \\frac{1}{2}\\sum_{i,j=1}^N\\theta_i(t)\\theta_j(t){\\rho}_{ij}(t)\\right)\\,dt + \\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"\\frac{dw(t)}{w(t)}=\\left({\\mu}(t)+\\frac{1}{2}\\sum_{i,j=1}^{N}\\theta_{i}(t)%&#10;\\theta_{j}(t){\\rho}_{ij}(t)\\right)\\,dt+\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(%&#10;t){\\delta}_{iz}(t)\\,dB_{z}(t).\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><mrow><mrow><mo>(</mo><mrow><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>θ</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\nIf we again apply {It{\\^o}}'s Lemma to the exponential function, then equation \\eqref{wealthDynamics} yields, a.s., for all $i = 1, \\ldots, N$,\n\n", "itemtype": "equation", "pos": 82738, "prevtext": "\nSimilarly, the definition of ${\\mu}(t)$ from equation \\eqref{mu} allows us to further simplify equation \\eqref{totalWealthDynamicsProof3} and write\n\n", "index": 65, "text": "\\begin{align}\n\\frac{dw(t)}{w(t)} & = \\left(\\sum_{i=1}^N\\theta_i(t){\\mu}_i(t) + \\frac{1}{2}\\sum_{i=1}^N\\theta_i(t){\\rho}_{ii}(t)\\right)\\,dt +\\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t) \\notag \\\\\n& = \\sum_{i=1}^N\\theta_i(t)\\left({\\mu}_i(t) + \\frac{1}{2}{\\rho}_{ii}(t)\\right)\\,dt + \\sum_{i=1}^N\\sum_{z=1}^M\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t).\\label{totalWealthDynamicsProof4}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{dw(t)}{w(t)}\" display=\"inline\"><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left(\\sum_{i=1}^{N}\\theta_{i}(t){\\mu}_{i}(t)+\\frac{1}{2}\\sum_{i%&#10;=1}^{N}\\theta_{i}(t){\\rho}_{ii}(t)\\right)\\,dt+\\sum_{i=1}^{N}\\sum_{z=1}^{M}%&#10;\\theta_{i}(t){\\delta}_{iz}(t)\\,dB_{z}(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mo>(</mo><mrow><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{i=1}^{N}\\theta_{i}(t)\\left({\\mu}_{i}(t)+\\frac{1}{2}{\\rho}_%&#10;{ii}(t)\\right)\\,dt+\\sum_{i=1}^{N}\\sum_{z=1}^{M}\\theta_{i}(t){\\delta}_{iz}(t)\\,%&#10;dB_{z}(t).\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nSubstituting equation \\eqref{wealthDynamicsProof} into equation \\eqref{totalWealthDynamicsProof4} then yields\n\n", "itemtype": "equation", "pos": 83286, "prevtext": "\n\nIf we again apply {It{\\^o}}'s Lemma to the exponential function, then equation \\eqref{wealthDynamics} yields, a.s., for all $i = 1, \\ldots, N$,\n\n", "index": 67, "text": "\\begin{align}\n dw_i(t) & = w_i(t)\\left({\\mu}_i(t) + \\frac{1}{2}\\sum_{z=1}^M{\\delta}^2_{iz}(t)\\right)\\,dt + w_i(t)\\sum_{z=1}^M{\\delta}_{iz}(t)\\,dB_z(t) \\notag \\\\\n & =  w_i(t)\\left({\\mu}_i(t) + \\frac{1}{2}{\\rho}_{ii}(t)\\right)\\,dt + w_i(t)\\sum_{z=1}^M{\\delta}_{iz}(t)\\,dB_z(t). \\label{wealthDynamicsProof}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle dw_{i}(t)\" display=\"inline\"><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=w_{i}(t)\\left({\\mu}_{i}(t)+\\frac{1}{2}\\sum_{z=1}^{M}{\\delta}^{2}%&#10;_{iz}(t)\\right)\\,dt+w_{i}(t)\\sum_{z=1}^{M}{\\delta}_{iz}(t)\\,dB_{z}(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msubsup><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=w_{i}(t)\\left({\\mu}_{i}(t)+\\frac{1}{2}{\\rho}_{ii}(t)\\right)\\,dt+%&#10;w_{i}(t)\\sum_{z=1}^{M}{\\delta}_{iz}(t)\\,dB_{z}(t).\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><msub><mi>B</mi><mi>z</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nwhich completes the proof.\n\\end{proofLemma1}\n\n\\begin{proofLemma2}\nThe household wealth processes $w_i$ are absolutely continuous in the sense that the random signed measures ${\\mu}_i(t)\\,dt$ and ${\\rho}_{ii}(t)\\,dt$ are absolutely continuous with respect to Lebesgue measure. As a consequence, we can apply Lemma 4.1.7 and Proposition 4.1.11 from \\citet{Fernholz:2002}, which yields equations \\eqref{rankWealthDynamics} and \\eqref{rankWealthShareDynamics1}.\n\\end{proofLemma2}\n\n\\begin{proofTheorem1}\nThis proof follows arguments from Chapter 5 of \\citet{Fernholz:2002}. According to equation \\eqref{rankWealthShareDynamics2}, for all $k = 1, \\ldots, N$,\n\n", "itemtype": "equation", "pos": 83712, "prevtext": "\nSubstituting equation \\eqref{wealthDynamicsProof} into equation \\eqref{totalWealthDynamicsProof4} then yields\n\n", "index": 69, "text": "\\begin{equation*}\n \\frac{dw(t)}{w(t)} = \\sum_{i=1}^N\\theta_i(t)\\frac{dw_i(t)}{w_i(t)},\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"\\frac{dw(t)}{w(t)}=\\sum_{i=1}^{N}\\theta_{i}(t)\\frac{dw_{i}(t)}{w_{i}(t)},\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>w</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>w</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nConsider the asymptotic behavior of the process $\\log\\theta_{(k)}$. Assuming that the limits from equation \\eqref{kappa} exist, then according to the definition of ${\\alpha}_k$ from equation \\eqref{alphaK}, the asymptotic behavior of $\\log\\theta_{(k)}$ satisfies\n\n", "itemtype": "equation", "pos": 84468, "prevtext": "\nwhich completes the proof.\n\\end{proofLemma1}\n\n\\begin{proofLemma2}\nThe household wealth processes $w_i$ are absolutely continuous in the sense that the random signed measures ${\\mu}_i(t)\\,dt$ and ${\\rho}_{ii}(t)\\,dt$ are absolutely continuous with respect to Lebesgue measure. As a consequence, we can apply Lemma 4.1.7 and Proposition 4.1.11 from \\citet{Fernholz:2002}, which yields equations \\eqref{rankWealthDynamics} and \\eqref{rankWealthShareDynamics1}.\n\\end{proofLemma2}\n\n\\begin{proofTheorem1}\nThis proof follows arguments from Chapter 5 of \\citet{Fernholz:2002}. According to equation \\eqref{rankWealthShareDynamics2}, for all $k = 1, \\ldots, N$,\n\n", "index": 71, "text": "\\begin{equation} \\label{rankWealthShareProof1}\n\\begin{aligned}\n \\log\\theta_{(k)}(T) & = {\\int_0^T}\\left({\\mu}_{p_t(k)}(t) - {\\mu}(t)\\right)\\,dt +  \\frac{1}{2}{\\Lambda}_{\\log\\theta_{(k)} - \\log\\theta_{(k + 1)}}(T) - \\frac{1}{2}{\\Lambda}_{\\log\\theta_{(k - 1)} - \\log\\theta_{(k)}}(T) \\\\\n & \\qquad + \\sum_{z=1}^M{\\int_0^T}{\\delta}_{p_t(k)z}(t)\\,dB_z(t) - \\sum_{i=1}^N\\sum_{z=1}^M{\\int_0^T}\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t).\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\log\\theta_{(k)}(T)\" display=\"inline\"><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle={\\int_{0}^{T}}\\left({\\mu}_{p_{t}(k)}(t)-{\\mu}(t)\\right)\\,dt+%&#10;\\frac{1}{2}{\\Lambda}_{\\log\\theta_{(k)}-\\log\\theta_{(k+1)}}(T)-\\frac{1}{2}{%&#10;\\Lambda}_{\\log\\theta_{(k-1)}-\\log\\theta_{(k)}}(T)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><mrow><mo>(</mo><mrow><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad+\\sum_{z=1}^{M}{\\int_{0}^{T}}{\\delta}_{p_{t}(k)z}(t)\\,dB_{z%&#10;}(t)-\\sum_{i=1}^{N}\\sum_{z=1}^{M}{\\int_{0}^{T}}\\theta_{i}(t){\\delta}_{iz}(t)\\,%&#10;dB_{z}(t).\" display=\"inline\"><mrow><mrow><mrow><mo lspace=\"22.5pt\">+</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msub><mi>B</mi><mi>z</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msub><mi>B</mi><mi>z</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nAssumption \\ref{coherentAss} ensures that the term on the left-hand side of equation \\eqref{rankWealthShareProof2} is equal to zero, while Assumption \\ref{basicAss} ensures that the last two terms of the right-hand side of this equation are equal to zero as well (see Lemma 1.3.2 from \\citealp{Fernholz:2002}). If we simplify equation \\eqref{rankWealthShareProof2}, then, we have that\n\n", "itemtype": "equation", "pos": 85183, "prevtext": "\nConsider the asymptotic behavior of the process $\\log\\theta_{(k)}$. Assuming that the limits from equation \\eqref{kappa} exist, then according to the definition of ${\\alpha}_k$ from equation \\eqref{alphaK}, the asymptotic behavior of $\\log\\theta_{(k)}$ satisfies\n\n", "index": 73, "text": "\\begin{equation} \\label{rankWealthShareProof2}\n\\begin{aligned}\n \\limT1\\log\\theta_{(k)}(T) & = {\\alpha}_k + \\frac{1}{2}{\\kappa}_k - \\frac{1}{2}{\\kappa}_{k-1} + \\limT1\\sum_{z=1}^M{\\int_0^T}{\\delta}_{p_t(k)z}(t)\\,dB_z(t) \\\\\n & \\qquad  - \\limT1\\sum_{i=1}^N\\sum_{z=1}^M{\\int_0^T}\\theta_i(t){\\delta}_{iz}(t)\\,dB_z(t), {\\quad\\text{\\rm a.s.}}\n\\end{aligned}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\limT 1\\log\\theta_{(k)}(T)\" display=\"inline\"><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37X.m3\" class=\"ltx_Math\" alttext=\"\\displaystyle={\\alpha}_{k}+\\frac{1}{2}{\\kappa}_{k}-\\frac{1}{2}{\\kappa}_{k-1}+%&#10;\\limT 1\\sum_{z=1}^{M}{\\int_{0}^{T}}{\\delta}_{p_{t}(k)z}(t)\\,dB_{z}(t)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><mrow><msub><mi>α</mi><mi>k</mi></msub><mo>+</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi>κ</mi><mi>k</mi></msub></mrow></mrow><mo>-</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><msub><mi>κ</mi><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow></mrow><mo>+</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><msub><mi>δ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msub><mi>B</mi><mi>z</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37Xa.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\qquad-\\limT 1\\sum_{i=1}^{N}\\sum_{z=1}^{M}{\\int_{0}^{T}}\\theta_{i%&#10;}(t){\\delta}_{iz}(t)\\,dB_{z}(t),{\\quad\\text{\\rm a.s.}}\" display=\"inline\"><mrow><mrow><mo lspace=\"22.5pt\">-</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>=</mo><mn>1</mn></mrow><mi>M</mi></munderover></mstyle><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup></mstyle><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><msub><mi>B</mi><mi>z</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\n\nwhich implies that\n\n", "itemtype": "equation", "pos": 85932, "prevtext": "\nAssumption \\ref{coherentAss} ensures that the term on the left-hand side of equation \\eqref{rankWealthShareProof2} is equal to zero, while Assumption \\ref{basicAss} ensures that the last two terms of the right-hand side of this equation are equal to zero as well (see Lemma 1.3.2 from \\citealp{Fernholz:2002}). If we simplify equation \\eqref{rankWealthShareProof2}, then, we have that\n\n", "index": 75, "text": "\\begin{equation} \\label{alphaKProof}\n {\\alpha}_k = \\frac{1}{2}{\\kappa}_{k-1} - \\frac{1}{2}{\\kappa}_k,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"{\\alpha}_{k}=\\frac{1}{2}{\\kappa}_{k-1}-\\frac{1}{2}{\\kappa}_{k},\" display=\"block\"><mrow><mrow><msub><mi>α</mi><mi>k</mi></msub><mo>=</mo><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mi>k</mi></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor all $k = 1, \\ldots, N-1$. Since equation \\eqref{alphaKProof} is valid for all $k = 1, \\ldots, N$, this establishes a system of equations that we can solve for ${\\kappa}_k$. Doing this yields the equality\n\n", "itemtype": "equation", "pos": 86069, "prevtext": "\n\nwhich implies that\n\n", "index": 77, "text": "\\begin{equation} \\label{alphaKappa}\n {\\alpha}_k - {\\alpha}_{k+1} = \\frac{1}{2}{\\kappa}_{k-1} - {\\kappa}_k + \\frac{1}{2}{\\kappa}_{k+1},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"{\\alpha}_{k}-{\\alpha}_{k+1}=\\frac{1}{2}{\\kappa}_{k-1}-{\\kappa}_{k}+\\frac{1}{2}%&#10;{\\kappa}_{k+1},\" display=\"block\"><mrow><mrow><mrow><msub><mi>α</mi><mi>k</mi></msub><mo>-</mo><msub><mi>α</mi><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow></msub></mrow><mo>=</mo><mrow><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow><mo>-</mo><msub><mi>κ</mi><mi>k</mi></msub></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor all $k = 1, \\ldots, N$. Note that asymptotic stability ensures that ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$ for all $k = 1, \\ldots, N$, while the fact that ${\\alpha}_N = \\frac{1}{2}{\\kappa}_{N-1} = -({\\alpha}_1 + \\cdots + {\\alpha}_{N-1})$ ensures that ${\\alpha}_1 + \\cdots + {\\alpha}_N = 0$. Furthermore, if ${\\alpha}_1 + \\cdots + {\\alpha}_k > 0$ for some $1 \\leq k < N$, then equation \\eqref{kappaAlphaProof} generates a contradiction since ${\\kappa}_k \\geq 0$ by definition. In this case, it must be that Assumption \\ref{coherentAss} is violated and $\\limT1\\log\\theta_{(k)}(T) \\neq 0$ for some $1 \\leq k \\leq N$. This case is examined in detail in Theorem \\ref{wealthDistThm2}.\n\nThe last term on the right-hand side of equation \\eqref{rankWealthShareDynamics3} is an absolutely continuous martingale, and hence can be represented as a stochastic integral with respect to Brownian motion $B(t)$.\\footnote{This is a standard result for continuous-time stochastic processes \\citep{Karatzas/Shreve:1991,Nielsen:1999}.} This fact, together with equation \\eqref{alphaKappa} and the definitions of ${\\alpha}_k$ and ${\\sigma}_k$ from equations \\eqref{alphaK}-\\eqref{sigmaK}, motivates our use of the stable version of the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$. Recall that, by equation \\eqref{stableVersion}, this stable version is given by\n\n", "itemtype": "equation", "pos": 86427, "prevtext": "\nfor all $k = 1, \\ldots, N-1$. Since equation \\eqref{alphaKProof} is valid for all $k = 1, \\ldots, N$, this establishes a system of equations that we can solve for ${\\kappa}_k$. Doing this yields the equality\n\n", "index": 79, "text": "\\begin{equation} \\label{kappaAlphaProof}\n {\\kappa}_k = -2({\\alpha}_1 + \\cdots + {\\alpha}_k),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"{\\kappa}_{k}=-2({\\alpha}_{1}+\\cdots+{\\alpha}_{k}),\" display=\"block\"><mrow><mrow><msub><mi>κ</mi><mi>k</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nfor all $k = 1, \\ldots, N-1$. According to \\citet{Fernholz:2002}, Lemma 5.2.1, for all $k = 1, \\ldots, N-1$, the time-averaged limit of this stable version satisfies\n\n", "itemtype": "equation", "pos": 87883, "prevtext": "\nfor all $k = 1, \\ldots, N$. Note that asymptotic stability ensures that ${\\alpha}_1 + \\cdots + {\\alpha}_k < 0$ for all $k = 1, \\ldots, N$, while the fact that ${\\alpha}_N = \\frac{1}{2}{\\kappa}_{N-1} = -({\\alpha}_1 + \\cdots + {\\alpha}_{N-1})$ ensures that ${\\alpha}_1 + \\cdots + {\\alpha}_N = 0$. Furthermore, if ${\\alpha}_1 + \\cdots + {\\alpha}_k > 0$ for some $1 \\leq k < N$, then equation \\eqref{kappaAlphaProof} generates a contradiction since ${\\kappa}_k \\geq 0$ by definition. In this case, it must be that Assumption \\ref{coherentAss} is violated and $\\limT1\\log\\theta_{(k)}(T) \\neq 0$ for some $1 \\leq k \\leq N$. This case is examined in detail in Theorem \\ref{wealthDistThm2}.\n\nThe last term on the right-hand side of equation \\eqref{rankWealthShareDynamics3} is an absolutely continuous martingale, and hence can be represented as a stochastic integral with respect to Brownian motion $B(t)$.\\footnote{This is a standard result for continuous-time stochastic processes \\citep{Karatzas/Shreve:1991,Nielsen:1999}.} This fact, together with equation \\eqref{alphaKappa} and the definitions of ${\\alpha}_k$ and ${\\sigma}_k$ from equations \\eqref{alphaK}-\\eqref{sigmaK}, motivates our use of the stable version of the process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$. Recall that, by equation \\eqref{stableVersion}, this stable version is given by\n\n", "index": 81, "text": "\\begin{equation} \\label{rankWealthShareDynamicsProof}\n d\\left(\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k+1)}(t)\\right) = -{\\kappa}_k\\,dt + d{\\Lambda}_{\\log\\hat{\\theta}_{(k)} - \\log\\hat{\\theta}_{(k + 1)}}(t) + {\\sigma}_k\\,dB(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"d\\left(\\log\\hat{\\theta}_{(k)}(t)-\\log\\hat{\\theta}_{(k+1)}(t)\\right)=-{\\kappa}_%&#10;{k}\\,dt+d{\\Lambda}_{\\log\\hat{\\theta}_{(k)}-\\log\\hat{\\theta}_{(k+1)}}(t)+{%&#10;\\sigma}_{k}\\,dB(t),\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>κ</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow><mo>+</mo><mrow><mi>d</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Λ</mi><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>σ</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\na.s., where the last equality follows from equation \\eqref{kappaAlphaProof}. To the extent that the stable version of $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ from equation \\eqref{rankWealthShareDynamicsProof} approximates the true version of this process from equation \\eqref{rankWealthShareDynamics3}, the time-averaged limit of the true process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ will be approximated by $-{\\sigma}^2_k/4({\\alpha}_1 + \\cdots + {\\alpha}_k)$, for all $k = 1, \\ldots, N-1$.\n\\end{proofTheorem1}\n\n\\begin{proofTheorem2}\nNote that the divergent scenario of Theorem \\ref{wealthDistThm2} violates Assumption \\ref{coherentAss}, which states that no household's share of wealth declines to zero too quickly. In order to prove this theorem, it is necessary to show that the largest subset of households for which Assumption \\ref{coherentAss} holds is also the subset of households $m < N$ satisfying $A_m = \\max_{1 \\leq k \\leq N} A_k$ and $A_m > A_l$ for $l \\neq m$.\n\nSuppose that the top $n \\leq N$ wealthiest households in the economy form the largest subset of households for which Assumption \\ref{coherentAss} holds. More precisely, suppose that\n\n", "itemtype": "equation", "pos": 88298, "prevtext": "\nfor all $k = 1, \\ldots, N-1$. According to \\citet{Fernholz:2002}, Lemma 5.2.1, for all $k = 1, \\ldots, N-1$, the time-averaged limit of this stable version satisfies\n\n", "index": 83, "text": "\\begin{equation} \\label{thetaKProof}\n \\limT1{\\int_0^T}\\left(\\log\\hat{\\theta}_{(k)}(t) - \\log\\hat{\\theta}_{(k+1)}(t)\\right)\\,dt = \\frac{{\\sigma}^2_k}{2{\\kappa}_k} = \\frac{{\\sigma}^2_k}{-4({\\alpha}_1 + \\cdots + {\\alpha}_k)},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"\\limT 1{\\int_{0}^{T}}\\left(\\log\\hat{\\theta}_{(k)}(t)-\\log\\hat{\\theta}_{(k+1)}(%&#10;t)\\right)\\,dt=\\frac{{\\sigma}^{2}_{k}}{2{\\kappa}_{k}}=\\frac{{\\sigma}^{2}_{k}}{-%&#10;4({\\alpha}_{1}+\\cdots+{\\alpha}_{k})},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mrow><mo>(</mo><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mrow><mo stretchy=\"false\">(</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo>=</mo><mfrac><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mrow><mn>2</mn><mo>⁢</mo><msub><mi>κ</mi><mi>k</mi></msub></mrow></mfrac><mo>=</mo><mfrac><msubsup><mi>σ</mi><mi>k</mi><mn>2</mn></msubsup><mrow><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 89697, "prevtext": "\na.s., where the last equality follows from equation \\eqref{kappaAlphaProof}. To the extent that the stable version of $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ from equation \\eqref{rankWealthShareDynamicsProof} approximates the true version of this process from equation \\eqref{rankWealthShareDynamics3}, the time-averaged limit of the true process $\\log\\theta_{(k)} - \\log\\theta_{(k+1)}$ will be approximated by $-{\\sigma}^2_k/4({\\alpha}_1 + \\cdots + {\\alpha}_k)$, for all $k = 1, \\ldots, N-1$.\n\\end{proofTheorem1}\n\n\\begin{proofTheorem2}\nNote that the divergent scenario of Theorem \\ref{wealthDistThm2} violates Assumption \\ref{coherentAss}, which states that no household's share of wealth declines to zero too quickly. In order to prove this theorem, it is necessary to show that the largest subset of households for which Assumption \\ref{coherentAss} holds is also the subset of households $m < N$ satisfying $A_m = \\max_{1 \\leq k \\leq N} A_k$ and $A_m > A_l$ for $l \\neq m$.\n\nSuppose that the top $n \\leq N$ wealthiest households in the economy form the largest subset of households for which Assumption \\ref{coherentAss} holds. More precisely, suppose that\n\n", "index": 85, "text": "\\begin{equation} \\label{limProof1}\n \\limT1\\log\\theta_{(1)}(T) = \\cdots = \\limT1\\log\\theta_{(n)}(T) = 0, {\\quad\\text{\\rm a.s.}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"\\limT 1\\log\\theta_{(1)}(T)=\\cdots=\\limT 1\\log\\theta_{(n)}(T)=0,{\\quad\\text{\\rm&#10;a%&#10;.s.}},\" display=\"block\"><mrow><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mi mathvariant=\"normal\">⋯</mi><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mn>0</mn></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nso that there exists some finite time $t_0$ such that after $t_0$, the top $n$ wealthiest households are never overtaken by the remaining households in the economy again.\\footnote{The existence of the limits in equation \\eqref{limProof2} is ensured by equation \\eqref{rankWealthShareProof2} together with the assumption that the limits from equations \\eqref{alphaK}-\\eqref{kappa} exist.} Indeed, this follows because equations \\eqref{limProof1} and \\eqref{limProof2} imply that there exists some $t_0 < \\infty$ such that $\\log w_{(n)}(t) > \\log w_{(n+1)}(t)$, a.s., for all $t \\geq t_0$ and that\n\n", "itemtype": "equation", "pos": 89844, "prevtext": "\nand\n\n", "index": 87, "text": "\\begin{equation} \\label{limProof2}\n 0 > \\limT1\\log\\theta_{(n+1)}(T) \\geq \\cdots \\geq \\limT1\\log\\theta_{(N)}(T), {\\quad\\text{\\rm a.s.}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E44.m1\" class=\"ltx_Math\" alttext=\"0&gt;\\limT 1\\log\\theta_{(n+1)}(T)\\geq\\cdots\\geq\\limT 1\\log\\theta_{(N)}(T),{\\quad%&#10;\\text{\\rm a.s.}},\" display=\"block\"><mrow><mrow><mrow><mn>0</mn><mo>&gt;</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mi mathvariant=\"normal\">⋯</mi><mo>≥</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>N</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nWithout loss of generality, let the wealth holdings of the $n$ wealthiest households in the economy at time $t_0$ be $w_1(t_0), \\ldots, w_n(t_0)$.\n\nConsider the wealth holdings of the top $n$ wealthiest households in the economy, which we denote by\n\n", "itemtype": "equation", "pos": 90591, "prevtext": "\nso that there exists some finite time $t_0$ such that after $t_0$, the top $n$ wealthiest households are never overtaken by the remaining households in the economy again.\\footnote{The existence of the limits in equation \\eqref{limProof2} is ensured by equation \\eqref{rankWealthShareProof2} together with the assumption that the limits from equations \\eqref{alphaK}-\\eqref{kappa} exist.} Indeed, this follows because equations \\eqref{limProof1} and \\eqref{limProof2} imply that there exists some $t_0 < \\infty$ such that $\\log w_{(n)}(t) > \\log w_{(n+1)}(t)$, a.s., for all $t \\geq t_0$ and that\n\n", "index": 89, "text": "\\begin{equation} \\label{limThetasProof}\n \\lim_{T\\to\\infty}\\theta_{(1)}(T) + \\cdots + \\theta_{(n)}(T) = 1, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E45.m1\" class=\"ltx_Math\" alttext=\"\\lim_{T\\to\\infty}\\theta_{(1)}(T)+\\cdots+\\theta_{(n)}(T)=1,{\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mn>1</mn><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nBecause Assumption \\ref{coherentAss} is valid for the $n$ wealthiest households in the economy at time $t_0$, according to \\citet{Fernholz:2002}, Propositions 1.3.1 and 2.1.2, and using Assumption \\ref{basicAss}, equation \\eqref{volBounded}, it follows that\n\n", "itemtype": "equation", "pos": 90984, "prevtext": "\nWithout loss of generality, let the wealth holdings of the $n$ wealthiest households in the economy at time $t_0$ be $w_1(t_0), \\ldots, w_n(t_0)$.\n\nConsider the wealth holdings of the top $n$ wealthiest households in the economy, which we denote by\n\n", "index": 91, "text": "\\begin{equation*}\n w^n(t) = w_{(1)}(t) + \\cdots + w_{(n)}(t) = w_{p_t(1)}(t) + \\cdots + w_{p_t(n)}(t).\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"w^{n}(t)=w_{(1)}(t)+\\cdots+w_{(n)}(t)=w_{p_{t}(1)}(t)+\\cdots+w_{p_{t}(n)}(t).\" display=\"block\"><mrow><mrow><mrow><msup><mi>w</mi><mi>n</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msub><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>w</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><msub><mi>w</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nwhere $1 \\leq i \\leq n$. By definition, for all $i = 1, \\ldots, n$,\n\n", "itemtype": "equation", "pos": 91361, "prevtext": "\nBecause Assumption \\ref{coherentAss} is valid for the $n$ wealthiest households in the economy at time $t_0$, according to \\citet{Fernholz:2002}, Propositions 1.3.1 and 2.1.2, and using Assumption \\ref{basicAss}, equation \\eqref{volBounded}, it follows that\n\n", "index": 93, "text": "\\begin{equation} \\label{limWnProof1}\n {\\lim_{T\\to\\infty}\\frac{{\\log w^n(T)}}{T}} = \\limT1{\\int_0^T}{\\mu}_i(t)\\,dt, {\\quad\\text{\\rm a.s.}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E46.m1\" class=\"ltx_Math\" alttext=\"{\\lim_{T\\to\\infty}\\frac{{\\log w^{n}(T)}}{T}}=\\limT 1{\\int_{0}^{T}}{\\mu}_{i}(t)%&#10;\\,dt,{\\quad\\text{\\rm a.s.}},\" display=\"block\"><mrow><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><mrow><mrow><mi>log</mi><mo>⁡</mo><msup><mi>w</mi><mi>n</mi></msup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>T</mi></mfrac></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nand hence by equation \\eqref{limWnProof1},\n\n", "itemtype": "equation", "pos": 91583, "prevtext": "\nwhere $1 \\leq i \\leq n$. By definition, for all $i = 1, \\ldots, n$,\n\n", "index": 95, "text": "\\begin{equation*}\n {\\mu}_i(t) = \\sum_{k=1}^n{\\mu}_{p_t(k)}(t)I_{\\{0\\}}\\left(\\theta_i(t) - \\theta_{(k)}(t)\\right),\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"{\\mu}_{i}(t)=\\sum_{k=1}^{n}{\\mu}_{p_{t}(k)}(t)I_{\\{0\\}}\\left(\\theta_{i}(t)-%&#10;\\theta_{(k)}(t)\\right),\" display=\"block\"><mrow><mrow><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>I</mi><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo stretchy=\"false\">}</mo></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nIf the households in the economy are ex-ante symmetric, then all of them must spend equal fractions of time in any given rank \\citep{Banner/Fernholz/Karatzas:2005}. As a consequence, for all $k = 1, \\ldots, n$,\n\n", "itemtype": "equation", "pos": 91756, "prevtext": "\nand hence by equation \\eqref{limWnProof1},\n\n", "index": 97, "text": "\\begin{equation} \\label{limWnProof2}\n {\\lim_{T\\to\\infty}\\frac{{\\log w^n(T)}}{T}} = \\limT1{\\int_0^T}\\sum_{k=1}^n{\\mu}_{p_t(k)}(t)I_{\\{0\\}}\\left(\\theta_i(t) - \\theta_{(k)}(t)\\right)\\,dt, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E47.m1\" class=\"ltx_Math\" alttext=\"{\\lim_{T\\to\\infty}\\frac{{\\log w^{n}(T)}}{T}}=\\limT 1{\\int_{0}^{T}}\\sum_{k=1}^{%&#10;n}{\\mu}_{p_{t}(k)}(t)I_{\\{0\\}}\\left(\\theta_{i}(t)-\\theta_{(k)}(t)\\right)\\,dt,{%&#10;\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><mrow><mrow><mi>log</mi><mo>⁡</mo><msup><mi>w</mi><mi>n</mi></msup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>T</mi></mfrac></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>I</mi><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo stretchy=\"false\">}</mo></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nwhich together with equation \\eqref{limWnProof2} implies that\n\n", "itemtype": "equation", "pos": 92190, "prevtext": "\nIf the households in the economy are ex-ante symmetric, then all of them must spend equal fractions of time in any given rank \\citep{Banner/Fernholz/Karatzas:2005}. As a consequence, for all $k = 1, \\ldots, n$,\n\n", "index": 99, "text": "\\begin{equation*}\n \\limT1{\\int_0^T} I_{\\{0\\}}\\left(\\theta_i(t) - \\theta_{(k)}(t)\\right)\\,dt = \\frac{1}{n}, {\\quad\\text{\\rm a.s.}},\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"\\limT 1{\\int_{0}^{T}}I_{\\{0\\}}\\left(\\theta_{i}(t)-\\theta_{(k)}(t)\\right)\\,dt=%&#10;\\frac{1}{n},{\\quad\\text{\\rm a.s.}},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><msub><mi>I</mi><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo stretchy=\"false\">}</mo></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>θ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mi>n</mi></mfrac><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nBy the definition of $A_n$ from equation \\eqref{Am}, it follows that\n\n", "itemtype": "equation", "pos": 92399, "prevtext": "\nwhich together with equation \\eqref{limWnProof2} implies that\n\n", "index": 101, "text": "\\begin{equation*}\n {\\lim_{T\\to\\infty}\\frac{{\\log w^n(T)}}{T}} = \\limT1{\\int_0^T}\\frac{1}{n}\\sum_{k=1}^n{\\mu}_{p_t(k)}(t)\\,dt, {\\quad\\text{\\rm a.s.}}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"{\\lim_{T\\to\\infty}\\frac{{\\log w^{n}(T)}}{T}}=\\limT 1{\\int_{0}^{T}}\\frac{1}{n}%&#10;\\sum_{k=1}^{n}{\\mu}_{p_{t}(k)}(t)\\,dt,{\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><mrow><mrow><mi>log</mi><mo>⁡</mo><msup><mi>w</mi><mi>n</mi></msup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>T</mi></mfrac></mrow><mo>=</mo><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mfrac><mn>1</mn><mi>n</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mn>1</mn></mrow><mi>n</mi></munderover><mrow><msub><mi>μ</mi><mrow><msub><mi>p</mi><mi>t</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nOf course, because $w^n$ converges to $w$ over time, it follows by equation \\eqref{limThetasProof} that $A_n = 0$. Intuitively, the relative growth rate of $w^n$ must equal zero since $w^n$ gradually encompasses all wealth in the economy.\n\nSuppose that $m < n$. Because Assumption \\ref{coherentAss} is valid for the $n$ wealthiest households in the economy at time $t_0$, we can simply reproduce the proof of Theorem \\ref{wealthDistThm} for this top subset of households. However, if $A_m > A_n$, equation \\eqref{kappaAlphaProof} generates a contradiction since it implies that\n\n", "itemtype": "equation", "pos": 92633, "prevtext": "\nBy the definition of $A_n$ from equation \\eqref{Am}, it follows that\n\n", "index": 103, "text": "\\begin{equation*}\n {\\lim_{T\\to\\infty}\\frac{{\\log w^n(T)}}{T}} = A_n + \\limT1{\\int_0^T}{\\mu}(t)\\,dt, {\\quad\\text{\\rm a.s.}}\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex10.m1\" class=\"ltx_Math\" alttext=\"{\\lim_{T\\to\\infty}\\frac{{\\log w^{n}(T)}}{T}}=A_{n}+\\limT 1{\\int_{0}^{T}}{\\mu}(%&#10;t)\\,dt,{\\quad\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><munder><mo movablelimits=\"false\">lim</mo><mrow><mi>T</mi><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></munder><mo>⁡</mo><mfrac><mrow><mrow><mi>log</mi><mo>⁡</mo><msup><mi>w</mi><mi>n</mi></msup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>T</mi></mfrac></mrow><mo>=</mo><mrow><mrow><msub><mi>A</mi><mi>n</mi></msub><mo>+</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>T</mi></msubsup><mrow><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nwhile ${\\kappa}_k \\geq 0$ for all $1 \\leq k \\leq N$, by definition from equation \\eqref{kappa} (see also the discussion in the proof of Theorem \\ref{wealthDistThm}). Thus, we conclude that $m \\geq n$.\n\nSuppose that $m > n$, so that by definition\n\n", "itemtype": "equation", "pos": 93350, "prevtext": "\nOf course, because $w^n$ converges to $w$ over time, it follows by equation \\eqref{limThetasProof} that $A_n = 0$. Intuitively, the relative growth rate of $w^n$ must equal zero since $w^n$ gradually encompasses all wealth in the economy.\n\nSuppose that $m < n$. Because Assumption \\ref{coherentAss} is valid for the $n$ wealthiest households in the economy at time $t_0$, we can simply reproduce the proof of Theorem \\ref{wealthDistThm} for this top subset of households. However, if $A_m > A_n$, equation \\eqref{kappaAlphaProof} generates a contradiction since it implies that\n\n", "index": 105, "text": "\\begin{equation*}\n  {\\kappa}_m = -({\\alpha}_1 + \\cdots + {\\alpha}_m) = -mA_m < 0,\n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex11.m1\" class=\"ltx_Math\" alttext=\"{\\kappa}_{m}=-({\\alpha}_{1}+\\cdots+{\\alpha}_{m})=-mA_{m}&lt;0,\" display=\"block\"><mrow><mrow><msub><mi>κ</mi><mi>m</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>α</mi><mn>1</mn></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>m</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mi>m</mi><mo>⁢</mo><msub><mi>A</mi><mi>m</mi></msub></mrow></mrow><mo>&lt;</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nAccording to equation \\eqref{rankWealthShareProof2} from the proof of Theorem \\ref{wealthDistThm}, we have that\n\n", "itemtype": "equation", "pos": 93694, "prevtext": "\nwhile ${\\kappa}_k \\geq 0$ for all $1 \\leq k \\leq N$, by definition from equation \\eqref{kappa} (see also the discussion in the proof of Theorem \\ref{wealthDistThm}). Thus, we conclude that $m \\geq n$.\n\nSuppose that $m > n$, so that by definition\n\n", "index": 107, "text": "\\begin{equation} \\label{AmIneqProof}\n \\frac{{\\alpha}_{n+1} + \\cdots + {\\alpha}_m}{m - n} > A_n.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E48.m1\" class=\"ltx_Math\" alttext=\"\\frac{{\\alpha}_{n+1}+\\cdots+{\\alpha}_{m}}{m-n}&gt;A_{n}.\" display=\"block\"><mrow><mrow><mfrac><mrow><msub><mi>α</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>m</mi></msub></mrow><mrow><mi>m</mi><mo>-</mo><mi>n</mi></mrow></mfrac><mo>&gt;</mo><msub><mi>A</mi><mi>n</mi></msub></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04093.tex", "nexttext": "\nOf course, by assumption ${\\kappa}_n = 0$, since after $t_0$ the top $n$ wealthiest households are never overtaken by the remaining households in the economy again (recall the definition of a local time ${\\Lambda}_x$). Furthermore, by equation \\eqref{AmIneqProof}, it follows that ${\\alpha}_{n+1} + \\cdots + {\\alpha}_m > 0$ and hence that the right-hand side of equation \\eqref{limProof4} is greater than zero (${\\kappa}_m \\geq 0$ as well). This is a contradiction, however, since we assumed in equation \\eqref{limProof2} above that the left-hand side of equation \\eqref{limProof4} is less than zero. Thus, we conclude that $m = n$ and that the largest subset of households for which Assumption \\ref{coherentAss} holds is also the subset of households $m < N$ satisfying $A_m = \\max_{1 \\leq k \\leq N} A_k$ and $A_m > A_l$ for $l \\neq m$.\n\nHaving proved the separation and divergence of the top subset of households $w_{(1)}, \\ldots, w_{(m)}$, all that remains is to prove that this subset forms a stable distribution. This follows from Theorem \\ref{wealthDistThm} and the fact that $A_m > A_l$ for $l \\neq m$, since this condition ensures that the relative growth rates for this top subset of households satisfies the stability condition of Theorem \\ref{wealthDistThm}.\n\\end{proofTheorem2}\n\n\n\n\\end{spacing}\n\n\n\n\n\\pagebreak\n\n\n\\begin{spacing}{1.2}\n\n\\bibliographystyle{chicago}\n\\bibliography{econ}\n\n\\end{spacing}\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth & Low Estimate & High Estimate  \\\\\nPercent Rank  & Volatility ${\\sigma}_k$ & Volatility ${\\sigma}_k$ \\\\\n\n\\hline\n\n0-10     & 0.283  & 0.286  \\\\\n10-20   & 0.283  & 0.294  \\\\\n20-40   & 0.283  & 0.316  \\\\\n40-60   & 0.283  & 0.392  \\\\\n60-100 & 0.283  & 1.662  \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Low and high estimates of the volatilities ${\\sigma}_k$.} \\label{sigmasTab}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with  \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High  Estimate Volatility ${\\sigma}_k$ \\\\\n\n\\hline\n\n0-0.01    & 11.1\\%  & 11.1\\%   \\\\\n0.01-0.1 & 10.8\\%  & 10.8\\%  \\\\\n0.1-0.5   & 12.4\\%  & 12.4\\%    \\\\\n0.5-1      & 7.2\\%    & 7.2\\%     \\\\\n1-10       & 35.7\\%  & 35.7\\%  \\\\\n10-100   & 22.8\\%  & 22.8\\%   \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares for different estimates of the volatilities ${\\sigma}_k$ under Scenario 1, which assumes that the 2012 U.S. wealth distribution is stable.} \\label{futureSharesTab1}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with  \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$  \\\\\n\n\\hline\n\n0-0.01    & 36.8\\%  & 35.9\\%    \\\\\n0.01-0.1 & 7.9\\%   & 8.1\\%       \\\\\n0.1-0.5   & 8.2\\%  & 8.5\\%    \\\\\n0.5-1      & 4.7\\%    & 4.9\\%     \\\\\n1-10       & 23.4\\%  & 24.2\\%   \\\\\n10-100   & 19.0\\%  & 18.5\\%    \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares for different estimates of the volatilities ${\\sigma}_k$ under Scenario 2, which assumes that the share of wealth held by the top 0.01\\% of households is increasing by 1\\% per year while the share of total wealth held by the bottom 90\\% of households is decreasing by 0.5\\% per year.} \\label{futureSharesTab2}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with  \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$ \\\\\n\n\\hline\n\n0-0.01    & 87.9\\% & 85.9\\%  \\\\\n0.01-0.1 & 2.0\\%   & 2.3\\%    \\\\\n0.1-0.5   & 1.5\\%   & 1.8\\%     \\\\\n0.5-1      & 0.8\\%   & 1.0\\%     \\\\\n1-10       & 3.9\\%   & 4.8\\%    \\\\\n10-100   & 3.9\\%   & 4.2\\%    \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares for different estimates of the volatilities ${\\sigma}_k$ under Scenario 3, which assumes that the shares of wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 1.5\\% and 0.5\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1\\% per year.} \\label{futureSharesTab3}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$  \\\\\n\n\\hline\n\n0-0.01    & 100\\% & 100\\%   \\\\\n0.01-0.1 & 0\\%    & 0\\%       \\\\\n0.1-0.5   & 0\\%    & 0\\%       \\\\\n0.5-1      & 0\\%    & 0\\%       \\\\\n1-10       & 0\\%   & 0\\%        \\\\\n10-100   & 0\\%   & 0\\%         \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares for different estimates of the volatilities ${\\sigma}_k$ under Scenario 4, which assumes that the shares of wealth held by the top 0.01\\% and 0.01-0.1\\% of households are increasing by 3\\% and 1\\% per year, respectively, while the share of total wealth held by the bottom 90\\% of households is decreasing by 1.5\\% per year.} \\label{futureSharesTab4}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$  \\\\\n\n\\hline\n\n0-0.01    & 1.5\\%   & 1.5\\%     \\\\\n0.01-0.1 & 4.0\\%   & 4.1\\%     \\\\\n0.1-0.5   & 8.4\\%   & 8.4\\%      \\\\\n0.5-1      & 6.7\\%    & 6.8\\%     \\\\\n1-10       & 44.9\\%  & 45.0\\%  \\\\\n10-100   & 34.6\\%  & 34.2\\%   \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares with a 1-2\\% progressive capital tax on the top 1\\% of households for different estimates of the volatilities ${\\sigma}_k$ under Scenario 1.} \\label{taxSharesTab1}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with  \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$  \\\\\n\n\\hline\n\n0-0.01    & 1.8\\% & 1.9\\%        \\\\\n0.01-0.1 & 3.8\\%   & 3.9\\%      \\\\\n0.1-0.5   & 7.7\\%   & 7.9\\%       \\\\\n0.5-1      & 6.2\\%   & 6.3\\%       \\\\\n1-10       & 41.0\\%   & 42.0\\%    \\\\\n10-100   & 39.6\\%   & 37.9\\%     \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares with a 1-2\\% progressive capital tax on the top 1\\% of households for different estimates of the volatilities ${\\sigma}_k$ under Scenario 2.} \\label{taxSharesTab2}\n\\vspace{30pt}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold Wealth           & Wealth Shares with & Wealth Shares with \\\\\nPercent Rank  & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$  \\\\\n\n\\hline\n\n0-0.01    & 2.4\\% & 2.5\\%        \\\\\n0.01-0.1 & 3.9\\%   & 4.1\\%      \\\\\n0.1-0.5   & 7.2\\%   & 7.6\\%       \\\\\n0.5-1      & 5.7\\%   & 6.0\\%       \\\\\n1-10       & 37.6\\%   & 39.2\\%    \\\\\n10-100   & 43.3\\%   & 40.7\\%     \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares with a 1-2\\% progressive capital tax on the top 1\\% of households for different estimates of the volatilities ${\\sigma}_k$ under Scenario 3.} \\label{taxSharesTab3}\n\\end{table}\n\n\n\n\\begin{table}[p]\n\\vspace{5pt}\n\\begin{center}\n\\setlength{\\extrarowheight}{3pt}\n\\begin{tabular} {|c|cc|}\n\n\\hline\n\nHousehold  Wealth         & Wealth Shares with & Wealth Shares with  \\\\\nPercent Rank                & Low Estimate Volatility ${\\sigma}_k$ & High Estimate Volatility ${\\sigma}_k$ \\\\\n\n\\hline\n\n0-0.01    & 14.6\\%    & 14.8\\%       \\\\\n0.01-0.1 & 3.8\\%    & 4.0\\%       \\\\\n0.1-0.5   & 6.0\\%    & 6.4\\%        \\\\\n0.5-1      & 4.7\\%    & 4.9\\%        \\\\\n1-10       & 30.5\\%   & 32.3\\%    \\\\\n10-100   & 40.5\\%   & 37.5\\%     \\\\\n\n\\hline\n\n\\end{tabular}\n\\end{center}\n\\vspace{-7pt} \\caption{Household wealth shares with a 1-2\\% progressive capital tax on the top 1\\% of households for different estimates of the volatilities ${\\sigma}_k$ under Scenario 4.} \\label{taxSharesTab4}\n\\vspace{170pt}\n\\end{table}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-30pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{wealthBasic.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares for the model matched to the U.S. wealth distribution in 2012.}\n\\label{wealthBasicFig}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-5pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{wealthScenarios.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares for high estimates of the volatilities ${\\sigma}_k$ under Scenarios 1 (solid black line), 2 (dashed red line), 3 (dotted blue line), and 4 (vertical dot-dashed green line).}\n\\label{wealthScenariosFig}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-30pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{divergence1.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{The shares of total wealth held by the top 0.01\\% (solid black line), 0.01-0.1\\% (dashed red line), 0.1-0.5\\% (dotted green line), and 0.5-1\\% (dot-dashed blue line) of households over time for high estimates of the volatilities ${\\sigma}_k$ under Scenario 4.}\n\\label{divergeFig1}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-5pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{divergence2.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{The shares of total wealth held by the top 1\\% (solid black line), 1-10\\% (dashed red line), and bottom 90\\% (dotted green line) of households over time for high estimates of the volatilities ${\\sigma}_k$ under Scenario 4.}\n\\label{divergeFig2}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-30pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{tax1.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares with (dashed red line) and without (solid black line) a 1-2\\% progressive capital tax on the top 1\\% of households for high estimates of the volatilities ${\\sigma}_k$ under Scenario 1.}\n\\label{taxFig1}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-5pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{tax2.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares with (dashed red line) and without (solid black line) a 1-2\\% progressive capital tax on the top 1\\% of households for high estimates of the volatilities ${\\sigma}_k$ under Scenario 2.}\n\\label{taxFig2}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-30pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{tax3.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares with (dashed red line) and without (solid black line) a 1-2\\% progressive capital tax on the top 1\\% of households for high estimates of the volatilities ${\\sigma}_k$ under Scenario 3.}\n\\label{taxFig3}\n\\end{figure}\n\n\\begin{figure}[p]\n\\begin{center}\n\\vspace{-5pt}\n\\hspace{-15pt}\\scalebox{.63}{ {\\includegraphics{tax4.pdf}}}\n\\end{center}\n\\vspace{-24pt} \\caption{Household wealth shares with (dashed red line) and without (vertical solid black line) a 1-2\\% progressive capital tax on the top 1\\% of households for high estimates of the volatilities ${\\sigma}_k$ under Scenario 4.}\n\\label{taxFig4}\n\\end{figure}\n\n\n\n", "itemtype": "equation", "pos": 93917, "prevtext": "\nAccording to equation \\eqref{rankWealthShareProof2} from the proof of Theorem \\ref{wealthDistThm}, we have that\n\n", "index": 109, "text": "\\begin{equation} \\label{limProof4}\n \\limT1\\log\\theta_{(n+1)}(T) + \\cdots + \\limT1\\log\\theta_{(m)}(T) = {\\alpha}_{n+1} + \\cdots + {\\alpha}_m + \\frac{1}{2}{\\kappa}_m - \\frac{1}{2}{\\kappa}_n, {\\quad\\text{\\rm a.s.}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E49.m1\" class=\"ltx_Math\" alttext=\"\\limT 1\\log\\theta_{(n+1)}(T)+\\cdots+\\limT 1\\log\\theta_{(m)}(T)={\\alpha}_{n+1}+%&#10;\\cdots+{\\alpha}_{m}+\\frac{1}{2}{\\kappa}_{m}-\\frac{1}{2}{\\kappa}_{n},{\\quad%&#10;\\text{\\rm a.s.}}\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\limT</mtext></merror><mo>⁢</mo><mn>1</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><msub><mi>θ</mi><mrow><mo stretchy=\"false\">(</mo><mi>m</mi><mo stretchy=\"false\">)</mo></mrow></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>α</mi><mrow><mi>n</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>+</mo><msub><mi>α</mi><mi>m</mi></msub><mo>+</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mi>m</mi></msub></mrow></mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>κ</mi><mi>n</mi></msub></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mtext>a.s.</mtext></mrow></mrow></math>", "type": "latex"}]