[{"file": "1601.06969.tex", "nexttext": "\nwhere $\\sigma$ is a surface tension and $K$ is the surface curvature. This excess pressure acts on all parts\nof the bubble interface. In particular, it acts on the part $A_{sg}$ (where the index $s$ stands for\n``sapphire\" and $g$ for ``gas\") of the flat window surface that contacts the gas directly (or, more\naccurately, through a wetting film that we assume to be of homogeneous thickness). This pressure creates\nreactions forces $\\vec{F}_s^{(1)}$ and $\\vec{F}_s^{(2)}$ at each window, that act on the bubble. Each of\nthese forces is perpendicular to the corresponding window. The absolute values of $\\vec{F}_s^{(1)}$\n and $\\vec{F}_s^{(2)}$ are\nequal to $A_{sg}\\Delta p$. When the windows are exactly parallel, $\\vec{F}_s^{(1\n)}+\\vec{F}_s^{(2)}=0$ and the\nbubble remains at the cell's center. When the windows are tilted with respect to each other, the non-zero force\n$\\vec{F}_s^{(1)}+\\vec{F}_s^{(2)}$ pushes the bubble in the direction of the increasing cell thickness. This\nmotion continues until the bubble touches (through a wetting film) the copper wall of the cell, thus forming\na contact spot of the area $A_{cg}$, where the index $c$ stands for ``copper\".\nThis direct contact with the\nsolid results in another reaction force $\\vec{F}_c$ with the absolute value\n $A_{cg}\\Delta p$, such that\n\n", "itemtype": "equation", "pos": 10899, "prevtext": "\n\\title[Gas spreads]{Gas spreads on a heated wall wetted by liquid}\n\\author{Y. Garrabos}\n\\author{C. Lecoutre-Chabot}\n\\affiliation{CNRS-ESEME, Institut de Chimie de la Mati\\`{e}re Condens\\'{e}e de Bordeaux,\\\\\nUniversit\\'{e} de Bordeaux I, Avenue du Dr. Schweitzer, F-33608 Pessac Cedex, France}\n\\author{J. Hegseth}\n\\affiliation{Department of Physics, University of New Orleans, New Orleans, LA 70148}\n\\author{V. S. Nikolayev}\\email[email:]{vnikolayev@cea.fr}\n\\author{D. Beysens}\n\\affiliation{ESEME, Service des Basses Temp\\'eratures, CEA-Grenoble, France} \\altaffiliation[Mailing\naddress:] {CEA-ESEME, Institut de Chimie de la Mati\\`ere Condens\\'{e}e de Bordeaux, 87, Avenue du Dr.\nSchweitzer, 33608 Pessac Cedex, France}\n\\author{J.-P. Delville}\n\\affiliation{Centre de Physique Mol\\'eculaire, Optique et Hertzienne,\\\\\nCNRS, Universit\\'e de Bordeaux I, Cours de la Lib\\'eration, 33405 Talence Cedex, France}\n\\date{\\today}\n\\pacs{05.70.Jk, 44.35.+c, 68.03.Cd, 64.60.Fr, 68.35.Rh}\n\n\\begin{abstract}\nThis study deals with a simple pure fluid whose temperature is slightly below its critical temperature and its\ndensity is nearly critical, so that the gas and liquid phases co-exist. Under equilibrium conditions, such a\nliquid completely wets the container wall and the gas phase is always separated from the solid by a wetting\nfilm. We report a striking change in the shape of the gas-liquid interface influenced by heating under\nweightlessness where the gas phase spreads over a hot solid surface showing an apparent contact angle\n\\emph{larger} than $90^\\circ$. We show that the two-phase fluid is very sensitive to the differential vapor\nrecoil force and give an explanation that uses this non-equilibrium effect. We also show how these\nexperiments help to understand the boiling crisis, an important technological problem in high-power boiling\nheat exchange.\n\\end{abstract}\\maketitle\n\n\\section{Introduction}\n\nSingular properties of a simple fluid \\cite{1,2} appear when it is near its critical temperature, $T_c$, and\nits critical density, $\\rho_c$. When the fluid's temperature, $T$, is slightly lower than $T_c$ and the\naverage fluid density $\\rho $ is close to $\\rho_c$ the fluid exhibits perfect wetting (i.e., zero contact\nangle) of practically any solid by the liquid phase in equilibrium. In this article we study a system that is\nslightly out of equilibrium. Our experiments, performed in weightlessness\n\\cite{ChimPh,BouldGW,IJT,Sorrento,STAIF} showed that when the system's temperature $T$ is being increased to\n$T_c$, the \\emph{apparent} contact angle (see Fig.~\\ref{zoom} below for definition) becomes very large (up to\n$110^\\circ$), and the \\emph{gas} appears to spread over the solid surface. In section \\ref{sec-exp} we\ndescribe our experimental setup that allows the spreading gas to be observed. The gas-liquid interface shape\nat equilibrium, which is considered in section \\ref{sec-eq}, plays a crucial role as an initial condition for\nthe gas spreading phenomenon. The sections \\ref{sec-c} and \\ref{sec-q} deal with the observations of the\nspreading gas. A theoretical model that allows this unusual phenomenon to be explained is proposed in section\n\\ref{sec-t}. In the section \\ref{sec-b}, we discuss the boiling crisis, a phenomenon that plays an important\nrole in industrial applications, and how it is relevant to the spreading gas.\n\n\\section{Experimental setup}\\label{sec-exp}\n\nWe report results that were obtained and repeated using several samples of ${\\rm SF}_{6}$ ($T_c=318.717$~K,\n$\\rho_c=742$~kg/m$^3$). These samples were heated at various rates in cylindrical cells of various aspect\nratios on several French/Russian and French/American missions on the Mir space station using the Alice-II\ninstrument \\cite{3}. This instrument is specially designed to obtain high precision temperature control\n(stability of $\\approx 15\\,\\mu$K over 50 hours, repeatability of $\\approx 50\\,\\mu$K over 7 days). To place\nthe samples near the critical point, constant mass cells are prepared with a high precision density, to\n0.02\\%, by observing the volume fraction change of the cells as a function of temperature on the ground\n\\cite{4}.\n\nA fluid layer was sandwiched between two parallel sapphire windows and surrounded by a copper alloy housing\nin the cylindrical optical cell, the axial section of which is shown in Figure~\\ref{fig1}.\n\\begin{figure}[hbt]\n  \\begin{center}\n  \\includegraphics[height=5cm]{fig1.eps}\n  \\end{center}\n\\caption{Sketch of a cross-section of the cylindrical sample cell (with parallel windows).  The fluid volume\nis contained between two sapphire windows that are glued to a CuBeCo alloy ring. The dimensions $H$ (see Table\n\\ref{tab1}) and $D$(=12 mm) of the cell are indicated. Some glue is squeezed into the cell. The thickness of\nthe glue layer is exaggerated for illustration purposes. In weightlessness, the gas bubble should be located\nin the middle of such an 'ideal' cell, see sec.~\\ref{sec-eq} for the discussion.}\\label{fig1}\n\\end{figure}\nWe consider here three cells of the same diameter $D=12$~mm, the other parameters of which are shown in\nTable~\\ref{tab1}. The liquid-gas interface was visualized through light transmission normal to the windows.\nSince the windows were glued to the copper alloy wall, some of the glue is squeezed inside the cell as shown\nin Fig.~\\ref{fig1}. This glue forms a ring that blocks the light transmission in a thin layer of the fluid\nadjacent to the copper wall making it inaccessible for observations. Because of this glue layer, the windows\nmay also be slightly tilted with respect to each other as discussed in sec.~\\ref{sec-eq}.\n\nA 10~mm diameter ring was engraved on one of the windows of each cell in order to calibrate the\nsize of the visible area of the cell images as can be seen in each\nimage. An out-of-focus wire\ngrid, designed to visualize \\cite{Gulf} fluid inhomogeneities and/or a fluid\nflow through light refraction, was also used. The grid was occasionally moved out of the light path, so that it is not always present in all images.\n\\begin{table}\n\\begin{ruledtabular}\n\\begin{tabular}{c|c|c}\n  Cell number & Cell thickness $H$ (mm) & $(\\rho-\\rho_c)/\\rho_c$ (\\%) \\\\\n  8 & 3.016 & 0.85 \\\\\n  10 & 1.664 & 0.25 \\\\\n  11 & 4.340 & 0.87 \\\\\n\\end{tabular}\n\\end{ruledtabular}\n\\caption{Physical parameters of the experimental cells. Cell 11 has a movable piston to change the cell\nvolume. However, the volume was kept constant during these experiments.}\\label{tab1}\n\\end{table}\n\nThe sample cell is placed inside of a copper Sample Cell Unit (SCU) that, in turn, is placed inside of a\nthermostat. Heat is pumped into and out of the SCU using Peltier elements and heaters. The\ntemperature is sampled every second and is resolved to $1\\mu$K.\n\nSimilar ground based experiments were done before these experiments using a copy of the same instrument. The\ngravity forces push the denser liquid phase to the bottom of the cell and completely different behavior is\nseen, see \\cite{5}.\n\n\\section{Bubble position at equilibrium under weightlessness}\\label{sec-eq}\n\nThe gas volume fraction $\\phi$ (volume of the gas divided by the total cell volume) is defined by $\\rho$ and\nthe densities of gas and liquid for the given temperature. In our experiments, $\\phi\\approx 0.5$ and the gas\nbubble is flattened between the windows (Fig.~\\ref{fig1}) due to the large aspect ratio $D/H$ of the cell.\n\nLet us first consider an ideally cylindrical cell as opposed to the real cell. At equilibrium, the windows and\nthe copper wall are wetted by the liquid phase. Because the van der Waals forces from the walls act to make\nthe wetting film as thick as possible, the weightless bubble should be located in the cell's center. Because\nthe bubble is flattened and occupies one-half of the available volume, the distance of such a centered bubble\nto the copper wall is large (Fig.~\\ref{fig1}). The lateral centering forces are then much weaker than the\ncentering forces in the direction of the cell axis. Any small external influences in the real cell can\ndisplace the bubble laterally from the cell's center. This displacement is illustrated in\nFig.~\\ref{Theor-Exp} that shows cell 10 at room temperature.\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{Theor-exp_new.eps}\\\\\n  a\\hspace*{6cm}b\n  \\end{center}\n\\caption{The experimental image of cell 10 at room temperature (a) and the equilibrium bubble shape simulated\nfor the tilt angle of $0.46^\\circ$ (b). When superposed, the images (a) and (b) give almost perfect match. The\nouter white circle in (a) (black in (b)) shows the actual location of the cell wall. The inner black circles\nin (a) and (b) correspond to the engraved ring that allows the superposition to be made. The dark space\nbetween two these circles in the image (a) is made by the ring of glue as shown in Fig.~\\ref{fig1}. The image\n(b) is a frontal projection of the bubble shown in Fig.~\\ref{Theor-inclined}. }\\label{Theor-Exp}\n\\end{figure*}\nWe note that there are two kinds of external influences that are easily identified: residual accelerations in\nthe spacecraft and cell asymmetry.\n\nBubble images for cells 8 and 10 were recorded in four Mir missions between 1996 and 2000. Several images are\nreported in \\cite{ChimPh} (Cassiopeia mission, 1996) and in Fig.~\\ref{GMSF2} below (GMSF2 mission, 1999) for\ncell 10. It is extremely likely that the space station changed its position with respect to the residual\ngravity vector between these runs. The bubble position with respect to the cell, however, always remained the\nsame. The bubble location also varies from cell to cell without any dependence on the station's orientation.\nTherefore, we have no reason to attribute the off-center position of the bubble to the residual gravity.\n\nAlthough the cells were manufactured with high precision, the cell windows could\nnot be exactly parallel\nbecause of the glue layer as shown in Fig.~\\ref{tilt}. In the rest of this section we will discuss the influence of\nthe windows' tilt on the position and on the shape of the bubble.\n\\begin{figure}[bht]\n  \\begin{center}\n  \\includegraphics[height=4.5cm]{Cell_tilt.eps}\n  \\end{center}\n\\caption{Sketch of a cross-section of the sample cell with the tilted windows at\n equilibrium in weightlessness. The wetting film is not shown. The window tilt is possible due to the\nexistence of a space between the window's edge and the copper wall, which is filled by glue. This space and\nthe tilt are exaggerated for illustration purposes. Based on the manufacturing process a maximum tilt angle\nof $\\approx 1^\\circ$ is possible. The glue squeezed into the cell is not shown. The reaction forces that act\non the gas bubble are shown with arrows. The contact areas of the gas bubble with the solid are\nindicated.}\\label{tilt}\n\\end{figure}\n\nWhen the bubble's surface is curved, there is a constant excess pressure $\\Delta\np$ inside the bubble defined by the Laplace formula\n\n", "index": 1, "text": "\\begin{equation}\\label{Lap}\n\\Delta p=\\sigma K,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Delta p=\\sigma K,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>p</mi></mrow><mo>=</mo><mrow><mi>σ</mi><mo>⁢</mo><mi>K</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nin equilibrium, see Fig.~\\ref{tilt}.\n\nThere are two equivalent ways to find the bubble shape at equilibrium. One can solve Eq.~(\\ref{Lap}) that\nreduces to $K=$const, where the constant is obtained from the condition of the given bubble volume. The\nbubble volume is defined by the known gas volume fraction and the cell volume. One can also minimize the\ngas-liquid interface area with a bubble volume constraint. In both cases boundary conditions must be\nsatisfied (zero contact angle in our case). The resulting bubble shape obviously depends on the cell\ngeometry. It is also nearly independent of temperature as can be seen from Eq.~(\\ref{equil}), because all\nthree terms of this equation are proportional to the surface tension $\\sigma$, so that this force balance\nremains valid even near $T_c$, where $\\sigma$ disappears. There are, however, several sources of weak\ntemperature dependence of the bubble shape. First, there is weak dependence of the gas volume fraction $\\phi$\non temperature at constant average density $\\rho$. This small deviation is smallest at the critical density\n$\\rho_c$ and slightly greater in these experiments due to the very small deviation (see Table~\\ref{tab1}) of\n$\\rho$ from $\\rho_c$. Second, the curvature $K$ depends on the thickness of the wetting film that increases\nnear $T_c$. The wetting film remains small, however, in comparison with the cell thickness. Both of these\neffects are very weak.\n\nThe force $\\vec{F}_c$, which is directed horizontally in Fig.~\\ref{tilt}, causes a distortion of the bubble.\nThis distortion results in an oval image in Fig.~\\ref{Theor-Exp} instead of a circle. The degree of\ndistortion increases with the tilt angle because so does $\\vec{F}_c$. This distortion can thus be used to\nestimate the tilt angle.\n\nFor these constant volume gas bubbles, the degree of distortion should decrease with increasing cell\nthickness $H$ for the same window tilt. A larger value of $H$ results in a less compressed (more sphere-like)\nbubble shape with less area in contact with the wall. This smaller bubble curvature results in a smaller\nvalue for $\\Delta p$ according to Eq.~(\\ref{Lap}). Consequently, the force $\\vec{F}_ c$, the area $A_{cg}$ of\nthe contact with the copper wall, and the bubble distortion are smaller. This window tilt hypothesis is\nconsistent with observations: we were not able to detect any distortion of the gas bubble in cell 8 (see\nFig.~\\ref{Pegase4608}a below that corresponds to the nearly equilibrium shape) that is approximately twice as\nthick (Table~\\ref{tab1}) as cell 10 shown in Fig.~\\ref{Theor-Exp}. There is, however, some tilt in cell 8\nbecause the bubble touches the wall. We expect that the tilt angles in all of the cells are of the same order\nof magnitude because they were all manufactured using the same method.\n\nTo verify the window tilt hypothesis, we performed a 3D numerical simulation of the bubble surface by using the\nSurface Evolver finite element software \\cite{Evolver}. The result of this\ncalculation is shown in\nFig.~\\ref{Theor-inclined} for cell 10.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{Theor-inclined.eps}\n  \\end{center}\n\\caption{ The result of a 3D finite element calculation of the equilibrium gas-liquid interface for cell 10\nwith a window tilt angle of $0.46^\\circ$. The vertices of the polygonal lines indicate the location of the\ncylindrical copper wall and they are shown to guide the eye. A shape of the circular cylinder was input to\nthe simulation. The contact angle is zero. A part of the image marked by the square is enlarged to show the\ncontact area $A_{cg}$ of the gas with the copper wall (a small white rectangle crossed by two symmetry\nlines). The contact areas $A_{sg}$ with the windows have the oval shape. The projection of this bubble shape\nto the cell window is shown in Fig.~\\ref{Theor-Exp}b.}\\label{Theor-inclined}\n\\end{figure}\nThe experimentally observed bubble deformation matches the calculation performed for a tilt angle of\n$0.46^\\circ$, see Fig.~\\ref{Theor-Exp}. The simulation resulted in the interface curvature\n$K=1.389$~mm$^{-1}$ and in $A_{cg}=0.150$~mm$^2$ calculated for the bubble volume $V\\phi=26.675$~mm$^3$. From\nthis data, it is easy to calculate the effective acceleration $g_{eff}$ that would create the equivalent\nbuoyancy force $F_c=(\\rho_L-\\rho_V)V\\phi\\,g_{eff}=K\\sigma\\,A_{cg}$. It turns out that $g_{eff}=1.55\\cdot\n10^{-3}\\,g$ for $T=290$~K, where $g$ is the gravity acceleration on Earth. This $g_{eff}$ acceleration is much\nlarger than the residual steady accelerations in the Mir space station ($\\sim 10^{-6}g$) and this shows that\nthe observed bubble deformation is not caused by residual accelerations. We conclude that the window tilt\nhypothesis about the origin of the bubble deformation and its off-center position is correct.\n\nA similar off-center bubble position was observed under weightlessness in a cell similar to ours by Ikier\n\\textit{et. al.} \\cite{14} and was attributed to a residual acceleration. However, they report only one run\nin a single cell making the actual cause of the bubble off-centered position impossible to verify.\n\n\\section{Continuous heating experiments}\\label{sec-c}\n\nIn the continuous heating experiments, the cells 8, 10 and 11 were heated\nnearly linearly in time $t$. The evolution of the non-dimensional temperature\n$\\tau$ for each of these experiments is shown in Fig.~\\ref{temp}.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{gmsf2-3.eps}\n  \\end{center}\n\\caption{Reduced temperature evolution for the image sequences shown in Fig.~\\ref{GMSF2}\n (solid line),\nFig.~\\ref{GMSF3} (dotted line), and Fig.~\\ref{PrePersU2} (dashed line). The temperature values that\ncorrespond to each of the images (a-h) shown in these figures are indicated by arrows and the corresponding\nletters. The definition of $\\tau$ is discussed in the text. The temperature is measured in the body of the\nSCU. The vicinity of the critical point is enlarged in the insert.}\\label{temp}\n\\end{figure}\nThe parameter $\\tau$ is defined as $(T-T_{coex})/T_c$, where $T_{coex}$ is the temperature of the coexistence\ncurve that corresponds to the fluid's average density shown in Table~\\ref{tab1}. Note that $T_{coex}$ differs\nfrom $T_c$ only by $1-50\\,\\mu$K because the density is very close to $\\rho_c$ for all cells. A 40~min\ntemperature equilibration at $\\tau\\approx-0.033$ preceded the heating. The mean value of ${\\rm d}T/{\\rm d}t$\nat $T_c$ was $\\approx 7.2$~mK/s.\n\nFigure~\\ref{GMSF2} shows the time sequence of the images of the cell 10.\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_GMSF2.eps}\n  \\end{center}\n\\caption{Time sequence of images of the cell 10 during the continuous heating through the critical point. The\ntemperature values that correspond to each of the images (a-h) shown in these Figures are indicated in\nFig.~\\ref{temp} by arrows and the corresponding letters. This run is a repeat of the run shown in Fig.~2 of\n\\protect\\cite{ChimPh}. The gradual increase of the apparent contact angle as the gas spreads with increasing\ntemperature is clearly seen. The time corresponding to each image is shown to the left of the cell in the\nmiddle. The magnified upper regions close to the contact line from the images (e-g) are shown in\nFig.~\\ref{zoom}.}\\label{GMSF2}\n\\end{figure*}\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{Zoom.eps}\n  \\end{center}\n\\caption{The magnified upper regions close to the contact line from the images Fig.~\\ref{GMSF2}(e-g) and from\nthe images Fig.~\\ref{GMSF3}(e-h). The apparent contact angle can be ``measured\" as the angle between the\ntangents to the black glue boundary and the liquid-gas meniscus. The latter corresponds to the boundary\nbetween the wide dark and narrow bright stripes on the images. The liquid domain is to the left from the\nmeniscus. One can see that this apparent contact angle exceeds $90^\\circ$ in the images \\ref{GMSF2}g and\n\\ref{GMSF3}f.}\\label{zoom}\n\\end{figure*}\nThe interface appears dark because the liquid-gas meniscus refracts the normally incident light away from the\ncell axis. After the temperature ramp was started but still far from the critical temperature, the bubble\nshape changed. The contact area $A_{cg}$ of the gas with the copper wall appears to increase. In other\nsystems the wetting film under a growing vapor bubble is observed to evaporate \\cite{Tong}. In near-critical\nfluids, however, the heat transfer processes are more complex \\cite{Straub}. In this system we believe that\nthere may be a similar drying process, i.e., at some time the thin wetting film that separates the gas from\nthe copper wall evaporates. In fact, we have observed low contrast lines that appear within the $A_{sg}$ area\nwhen the heating begins. An example of such a line is indicated in Figure~\\ref{GMSF2}a by the white arrows.\nThe out-of-focus grid shows that these lines correspond to a sharp change in the wetting film thickness. These\nlines are most likely triple contact lines and we have actually seen them pinned by an imperfection on the\nwindows as they advance and retreat in other experiments. Since the heat conductivity of copper is larger\nthan that of sapphire, the heat is supplied to the cell mainly through the hotter copper wall. Therefore the\nfilm should evaporate on the copper wall even earlier than on the sapphire. A more refined analysis of the\ncontact line motion will be discussed elsewhere.\n\nThe increase of the $A_{cg}$ area is accompanied by an evident increase in the apparent contact angle, see\nFig.~\\ref{GMSF2}d--f and the corresponding magnified images in Fig.~\\ref{zoom}. Near the critical temperature\nthe apparent contact angle becomes \\emph{larger} than $90^\\circ$! We will analyze these effects theoretically\nin section~\\ref{sec-t}.\n\nWhile crossing the critical point, the vapor bubble is rapidly evolving. At\n$T\\approx T_c$, the surface tension vanishes, the bubble's relaxation from\nsurface tension is negligible, so that the interface shape is defined by the\nvariation of the local evaporation rate along the interface. The evaporation is\nstronger at the parts of the interface closest to the copper heating wall.\nThis effect leads to the waved interface shape shown in Fig.~\\ref{GMSF2}g.\nDiffusion causes the disappearance of the interface at $T>T_c$ as shown in\nFig.~\\ref{GMSF2}h.\n\nFigure~\\ref{GMSF3} shows the time sequence of the images of the cell 8, which\nis approximately twice as thick as cell 10.\n\\begin{figure*}[hbt]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_GMSF3.eps}\n  \\end{center}\n\\caption{Time sequence of the images from cell 8 during continuous heating through the critical point. Images\n(a-h) were taken exactly for the same values of temperature (shown in Fig.~\\ref{temp}) as corresponding\nimages in Fig.~\\ref{GMSF2}. The magnified upper regions close to the contact line from the images (e-h) are\nshown in Fig.~\\ref{zoom}.}\\label{GMSF3}\n\\end{figure*}\nThe images in Fig.~\\ref{GMSF3} were taken exactly for the same values of the non-dimensional temperature\n$\\tau$ (shown in Fig.~\\ref{temp}) as the corresponding images in Fig.~\\ref{GMSF2}. The force $\\vec{F}_c$\npushes the bubble against the cell wall as in the case of cell 10. As discussed above, this force is weaker\nthan for the cell 10 because the bubble appears almost circular at equilibrium (see Fig.~\\ref{GMSF2}a and\nFig.~\\ref{GMSF3}a). By comparing images (e) of both sequences, we can also see that the vapor spreads slower\nin cell 8. The increase of the apparent contact angle is also slower. The waved shape interface appears\nearlier in Fig.~\\ref{GMSF3}f, i.e. farther from $T_c$ than for the cell 10. The interface is still quite\nsharp in Fig.~\\ref{GMSF3}h, while it has already diffused in the case of the thinner cell\n(Fig.~\\ref{GMSF2}h). This difference can be explained by the difference in the liquid-gas interface area,\nwhich is roughly proportional to the cell thickness. The surface tension force that tends to maintain the\nconvex shape is not as strong for the thicker cell where a larger fluid volume has to be moved during the\nsame time. The diffusion time is larger for cell 8 because the size of the inhomogeneity (i.e. interface) is\nlarger.\n\nFigure~\\ref{PrePersU2} shows the time sequence of the images from cell 11, which is thicker than both the\ncells 8 and 10.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_PrePers.eps}\n  \\end{center}\n\\caption{Time sequence of images of the cell 11 during the continuous heating through the critical point. No\nbubble spreading is seen. The bubble does not touch the copper wall. The images\n(a, d, f) were taken exactly\nfor the same values of temperature (shown in Fig.~\\ref{temp}) as corresponding images in Fig.~\\ref{GMSF2} and\nFig.~\\ref{GMSF3}. The cell 11 contains three thermistors shown in image (i) by arrows. This image was taken\nafter the temperature equilibration above $T_c$.}\\label{PrePersU2}\n\\end{figure}\nThe images (a), (d) and (f) were taken for the same values of non-dimensional temperature as corresponding\nimages in Figs.~\\ref{GMSF2} and \\ref{GMSF3}. This cell contained three wetted thermistors\n(Fig.~\\ref{PrePersU2}i) that constrain the bubble surface (Fig.~\\ref{PrePersU2}a). The bubble is only slightly\nsqueezed by the windows so that the reaction forces that act on the bubble at equilibrium are weak. As a\nresult, the bubble does not touch the copper heating wall at all. Although this is not clear in the image\n(a), because of the glue near the copper wall, it is clear in image (f) where small newly formed bubbles\nseparate the initial bubble from the wall. These bubbles form from the local overheating of the fluid between\nthe large bubble and the copper wall. There is enough fluid between the large bubble and the wall so that a\nsmall bubble may grow in it. These small bubbles push the large bubble away from the wall before any\ncoalescence can take place.\n\n\nThe comparison of these three experiments clearly shows that in order to obtain the bubble spreading, the\nbubble needs to have a direct contact with the heating wall, i.e. to be pushed to the heating wall by some\nforce. Note that none of the images show any evidence of steady fluid motion that would be necessary to\nmaintain the distorted bubble shapes in Figs.~\\ref{GMSF2} and \\ref{GMSF3}. We conclude that this distortion\nof the bubble equilibrium shape cannot be caused by fluid motion.\n\nSimilar continuous heating experiments are reported by Ikier \\textit{et. al.} in \\cite{14}. However, a smaller\nheating rate (1.7~mK/s) and erratic accelerations of the cell did not allow gas spreading to be observed.\n\n\\section{Quenching experiments}\\label{sec-q}\n\nFigure~\\ref{Pegase4608} shows the time sequence of the images of cell 8\nwhen it was heated by 100~mK quenches as shown in Fig.~\\ref{Pegase4608temp}.\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_Peg.eps}\n  \\end{center}\n\\caption{Time sequence of images of cell 8 during two 100~mK quenches. The gas spreads during each quench\nthat lasts about 12~s. The equilibrium position of the vapor bubble with respect\n to the cell is shown by the\nwhite circle in each image for comparison. }\\label{Pegase4608}\n\\end{figure*}\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{PRE_PegTemp.eps}\n  \\end{center}\n\\caption{Temperature evolution during the series of quenches. The points that correspond to each of the\nimages in Fig.~\\ref{Pegase4608}(a-h) are indicated by arrows and corresponding letters. The temperature is\nmeasured in the body of the SCU.}\\label{Pegase4608temp}\n\\end{figure}\nWhile the heating rate is quite large during each quench, the time average of the heating rate 1.4~mK/s is\nsmaller than that during the continuous heating due to the waiting time of $\\approx 60$~s after each quench.\nDuring this waiting time a partial equilibration takes place. The images (a--c) show a slight bubble\nspreading that appears during a quench that is farther from the critical point than the quench shown in\nimages (d-h). After each quench as soon as the heating stops, the bubble interface begins to return to its\ninitial form (Fig.~\\ref{Pegase4608}c,d). This shows that the spreading vapor is caused by a non-equilibrium\neffect. The second quench that precedes the crossing of the critical point (Fig.~\\ref{Pegase4608}d--h) shows\nvery rapid interface motion accompanied by fluid flows.\n\nWhile the interface returns to its initial state during the waiting time of the first quench\n(Fig.~\\ref{Pegase4608}c), it does not return in the second quench (Fig.~\\ref{Pegase4608}h). This occurs\nbecause the characteristic equilibration time grows dramatically near $T_c$.\n\nThe same phenomenon of spreading gas was also observed during the heating of CO$_2$ cells in other experiments\n(Pegasus BV4705, Post-Perseus F14) carried out by our group in the Mir station. However, these experiments\nwere not designed to study the spreading gas and we do not discuss them here.\n\n\\section{Interface evolution during the heating}\\label{sec-t}\n\nThe above experimental data showed that the spreading gas and the associated interface deformation are caused\nby an out-of-equilibrium phenomenon. This is especially demonstrated by the analysis of the interface shape at\nequilibrium (sec.~\\ref{sec-eq}) and by the return to the equilibrium shape after each quench in\nsec.~\\ref{sec-q}. In this section we analyze possible causes of the spreading gas. Two causes are considered:\nMarangoni convection due to the temperature change $\\delta T_i$ along the gas-liquid interface and the\ndifferential vapor recoil.\n\n\\subsection{Marangoni convection}\n\nIf a temperature change $\\delta T_i$ exists, it will create a surface tension change $\\delta\\sigma =( {\\rm\nd}\\sigma/{\\rm d}T)\\delta T_i$ that will drive a thermo-capillary (Marangoni) flow in the bulk of both fluids\n\\cite{7,8,9}. The images obtained in our experiment are capable of visualizing convective flows from the\nshadow-graph effect. We have not seen any evidence of the steady convection that is required to create and\nmaintain the observed bubble shape continuously during the heating. We conclude that the Marangoni convection\nis absent.\n\nThis conclusion is an apparent contradiction with many works that study the Marangoni effect caused by\nevaporation (see e.g. \\cite{Palmer}). The main difference between these works and ours is in the conditions of\nevaporation. These works consider the evaporation into an \\emph{open} space where the vapor pressure is very\nsmall. The interface temperature thus follows the temperature in the bulk of the liquid and a very large\nevaporation rate is possible, limited only by the average velocity of the fluid molecules. In our case, the\ngas phase is almost at saturation pressure. This means that the total evaporation (over\n the whole gas liquid interface) is small and limited by the amount of the supplied heat consumed by the\nlatent heat. Therefore, any variation $\\delta T_i$ is rapidly dampened by the corresponding change in the\nevaporation rate, stabilizing the interface against Marangoni convection, see \\cite{Straub} for an extended\ndiscussion. This conclusion is confirmed by the experiments \\cite{Barnes}, in which Marangoni convection was\ncarefully studied in a \\emph{closed} cell with very clean water in contact with its vapor. \\emph{No}\nsurface-tension-driven convection was registered in spite of a large Marangoni number that was much greater\nthan its critical value obtained in the classical Marangoni-Benard experiments with non-volatile liquids\n\\cite{7}. It was argued in \\cite{7} that the convection was absent due to a hypothetical interface\ncontamination present in spite of many careful preventive measures. According to our reasoning, a variation\n$\\delta T_i$ would have been strongly dampened in \\cite{7} because of the saturation conditions in the sealed\ncell. We also note that even in evaporative driven Marangoni convection far from saturation, the convection\ncells may also tend to stabilize the interface resulting in intermittent cellular formation as was observed\nin \\cite{8}. It was also observed in \\cite{8} that the velocity of convection and frequency of intermittent\ncell formation decreases as the external gas becomes more saturated.\n\n\\subsection{Differential vapor recoil}\n\nWe now analyze another possible source of bubble deforming stress that does not\nrequire a temperature\ngradient along the interface. The bubble may be deformed by the normal stress exerted on the interface by the\nrecoil from departing vapor \\cite{Palmer}. Let $n(\\vec{x})$ be the evaporating mass per unit time per unit\ninterface area at the point $\\vec{x}$ on the interface. The evaporating gas moves normally to the interface,\nand exerts a force per unit area (a ``thrust\") on the liquid of\n\n\n", "itemtype": "equation", "pos": 12261, "prevtext": "\nwhere $\\sigma$ is a surface tension and $K$ is the surface curvature. This excess pressure acts on all parts\nof the bubble interface. In particular, it acts on the part $A_{sg}$ (where the index $s$ stands for\n``sapphire\" and $g$ for ``gas\") of the flat window surface that contacts the gas directly (or, more\naccurately, through a wetting film that we assume to be of homogeneous thickness). This pressure creates\nreactions forces $\\vec{F}_s^{(1)}$ and $\\vec{F}_s^{(2)}$ at each window, that act on the bubble. Each of\nthese forces is perpendicular to the corresponding window. The absolute values of $\\vec{F}_s^{(1)}$\n and $\\vec{F}_s^{(2)}$ are\nequal to $A_{sg}\\Delta p$. When the windows are exactly parallel, $\\vec{F}_s^{(1\n)}+\\vec{F}_s^{(2)}=0$ and the\nbubble remains at the cell's center. When the windows are tilted with respect to each other, the non-zero force\n$\\vec{F}_s^{(1)}+\\vec{F}_s^{(2)}$ pushes the bubble in the direction of the increasing cell thickness. This\nmotion continues until the bubble touches (through a wetting film) the copper wall of the cell, thus forming\na contact spot of the area $A_{cg}$, where the index $c$ stands for ``copper\".\nThis direct contact with the\nsolid results in another reaction force $\\vec{F}_c$ with the absolute value\n $A_{cg}\\Delta p$, such that\n\n", "index": 3, "text": "\\begin{equation}\\label{equil}\n\\vec{F}_s^{(1)}+\\vec{F}_s^{(2)}+\\vec{F}_c=0\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\vec{F}_{s}^{(1)}+\\vec{F}_{s}^{(2)}+\\vec{F}_{c}=0\" display=\"block\"><mrow><mrow><msubsup><mover accent=\"true\"><mi>F</mi><mo stretchy=\"false\">→</mo></mover><mi>s</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>+</mo><msubsup><mover accent=\"true\"><mi>F</mi><mo stretchy=\"false\">→</mo></mover><mi>s</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>+</mo><msub><mover accent=\"true\"><mi>F</mi><mo stretchy=\"false\">→</mo></mover><mi>c</mi></msub></mrow><mo>=</mo><mn>0</mn></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere $\\rho$ denotes mass density and the subscripts $L$ and $G$ refer to liquid\nand gas respectively.\n\nThe interface shape can be obtained from a quasi-static argument when the experimentally observed interface\nvelocity $v_i$ is smaller than the characteristic hydrodynamic velocity $\\sigma/ \\eta$, where $\\eta$ is the\nshear viscosity. A numerical estimate shows that the quasi-static approximation holds for the images (a-f) in\nFig.~\\ref{GMSF2}, in which the spreading is observed. The quasi-static approximation does not appear to hold\nfor the quench experiments (Fig.~\\ref{Pegase4608}), where the interface moves rapidly.\n\nAccording to the quasi-static argument \\cite{13}, the interface shape can be determined from the modified\nLaplace equation\n\n", "itemtype": "equation", "pos": 33148, "prevtext": "\nin equilibrium, see Fig.~\\ref{tilt}.\n\nThere are two equivalent ways to find the bubble shape at equilibrium. One can solve Eq.~(\\ref{Lap}) that\nreduces to $K=$const, where the constant is obtained from the condition of the given bubble volume. The\nbubble volume is defined by the known gas volume fraction and the cell volume. One can also minimize the\ngas-liquid interface area with a bubble volume constraint. In both cases boundary conditions must be\nsatisfied (zero contact angle in our case). The resulting bubble shape obviously depends on the cell\ngeometry. It is also nearly independent of temperature as can be seen from Eq.~(\\ref{equil}), because all\nthree terms of this equation are proportional to the surface tension $\\sigma$, so that this force balance\nremains valid even near $T_c$, where $\\sigma$ disappears. There are, however, several sources of weak\ntemperature dependence of the bubble shape. First, there is weak dependence of the gas volume fraction $\\phi$\non temperature at constant average density $\\rho$. This small deviation is smallest at the critical density\n$\\rho_c$ and slightly greater in these experiments due to the very small deviation (see Table~\\ref{tab1}) of\n$\\rho$ from $\\rho_c$. Second, the curvature $K$ depends on the thickness of the wetting film that increases\nnear $T_c$. The wetting film remains small, however, in comparison with the cell thickness. Both of these\neffects are very weak.\n\nThe force $\\vec{F}_c$, which is directed horizontally in Fig.~\\ref{tilt}, causes a distortion of the bubble.\nThis distortion results in an oval image in Fig.~\\ref{Theor-Exp} instead of a circle. The degree of\ndistortion increases with the tilt angle because so does $\\vec{F}_c$. This distortion can thus be used to\nestimate the tilt angle.\n\nFor these constant volume gas bubbles, the degree of distortion should decrease with increasing cell\nthickness $H$ for the same window tilt. A larger value of $H$ results in a less compressed (more sphere-like)\nbubble shape with less area in contact with the wall. This smaller bubble curvature results in a smaller\nvalue for $\\Delta p$ according to Eq.~(\\ref{Lap}). Consequently, the force $\\vec{F}_ c$, the area $A_{cg}$ of\nthe contact with the copper wall, and the bubble distortion are smaller. This window tilt hypothesis is\nconsistent with observations: we were not able to detect any distortion of the gas bubble in cell 8 (see\nFig.~\\ref{Pegase4608}a below that corresponds to the nearly equilibrium shape) that is approximately twice as\nthick (Table~\\ref{tab1}) as cell 10 shown in Fig.~\\ref{Theor-Exp}. There is, however, some tilt in cell 8\nbecause the bubble touches the wall. We expect that the tilt angles in all of the cells are of the same order\nof magnitude because they were all manufactured using the same method.\n\nTo verify the window tilt hypothesis, we performed a 3D numerical simulation of the bubble surface by using the\nSurface Evolver finite element software \\cite{Evolver}. The result of this\ncalculation is shown in\nFig.~\\ref{Theor-inclined} for cell 10.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{Theor-inclined.eps}\n  \\end{center}\n\\caption{ The result of a 3D finite element calculation of the equilibrium gas-liquid interface for cell 10\nwith a window tilt angle of $0.46^\\circ$. The vertices of the polygonal lines indicate the location of the\ncylindrical copper wall and they are shown to guide the eye. A shape of the circular cylinder was input to\nthe simulation. The contact angle is zero. A part of the image marked by the square is enlarged to show the\ncontact area $A_{cg}$ of the gas with the copper wall (a small white rectangle crossed by two symmetry\nlines). The contact areas $A_{sg}$ with the windows have the oval shape. The projection of this bubble shape\nto the cell window is shown in Fig.~\\ref{Theor-Exp}b.}\\label{Theor-inclined}\n\\end{figure}\nThe experimentally observed bubble deformation matches the calculation performed for a tilt angle of\n$0.46^\\circ$, see Fig.~\\ref{Theor-Exp}. The simulation resulted in the interface curvature\n$K=1.389$~mm$^{-1}$ and in $A_{cg}=0.150$~mm$^2$ calculated for the bubble volume $V\\phi=26.675$~mm$^3$. From\nthis data, it is easy to calculate the effective acceleration $g_{eff}$ that would create the equivalent\nbuoyancy force $F_c=(\\rho_L-\\rho_V)V\\phi\\,g_{eff}=K\\sigma\\,A_{cg}$. It turns out that $g_{eff}=1.55\\cdot\n10^{-3}\\,g$ for $T=290$~K, where $g$ is the gravity acceleration on Earth. This $g_{eff}$ acceleration is much\nlarger than the residual steady accelerations in the Mir space station ($\\sim 10^{-6}g$) and this shows that\nthe observed bubble deformation is not caused by residual accelerations. We conclude that the window tilt\nhypothesis about the origin of the bubble deformation and its off-center position is correct.\n\nA similar off-center bubble position was observed under weightlessness in a cell similar to ours by Ikier\n\\textit{et. al.} \\cite{14} and was attributed to a residual acceleration. However, they report only one run\nin a single cell making the actual cause of the bubble off-centered position impossible to verify.\n\n\\section{Continuous heating experiments}\\label{sec-c}\n\nIn the continuous heating experiments, the cells 8, 10 and 11 were heated\nnearly linearly in time $t$. The evolution of the non-dimensional temperature\n$\\tau$ for each of these experiments is shown in Fig.~\\ref{temp}.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{gmsf2-3.eps}\n  \\end{center}\n\\caption{Reduced temperature evolution for the image sequences shown in Fig.~\\ref{GMSF2}\n (solid line),\nFig.~\\ref{GMSF3} (dotted line), and Fig.~\\ref{PrePersU2} (dashed line). The temperature values that\ncorrespond to each of the images (a-h) shown in these figures are indicated by arrows and the corresponding\nletters. The definition of $\\tau$ is discussed in the text. The temperature is measured in the body of the\nSCU. The vicinity of the critical point is enlarged in the insert.}\\label{temp}\n\\end{figure}\nThe parameter $\\tau$ is defined as $(T-T_{coex})/T_c$, where $T_{coex}$ is the temperature of the coexistence\ncurve that corresponds to the fluid's average density shown in Table~\\ref{tab1}. Note that $T_{coex}$ differs\nfrom $T_c$ only by $1-50\\,\\mu$K because the density is very close to $\\rho_c$ for all cells. A 40~min\ntemperature equilibration at $\\tau\\approx-0.033$ preceded the heating. The mean value of ${\\rm d}T/{\\rm d}t$\nat $T_c$ was $\\approx 7.2$~mK/s.\n\nFigure~\\ref{GMSF2} shows the time sequence of the images of the cell 10.\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_GMSF2.eps}\n  \\end{center}\n\\caption{Time sequence of images of the cell 10 during the continuous heating through the critical point. The\ntemperature values that correspond to each of the images (a-h) shown in these Figures are indicated in\nFig.~\\ref{temp} by arrows and the corresponding letters. This run is a repeat of the run shown in Fig.~2 of\n\\protect\\cite{ChimPh}. The gradual increase of the apparent contact angle as the gas spreads with increasing\ntemperature is clearly seen. The time corresponding to each image is shown to the left of the cell in the\nmiddle. The magnified upper regions close to the contact line from the images (e-g) are shown in\nFig.~\\ref{zoom}.}\\label{GMSF2}\n\\end{figure*}\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{Zoom.eps}\n  \\end{center}\n\\caption{The magnified upper regions close to the contact line from the images Fig.~\\ref{GMSF2}(e-g) and from\nthe images Fig.~\\ref{GMSF3}(e-h). The apparent contact angle can be ``measured\" as the angle between the\ntangents to the black glue boundary and the liquid-gas meniscus. The latter corresponds to the boundary\nbetween the wide dark and narrow bright stripes on the images. The liquid domain is to the left from the\nmeniscus. One can see that this apparent contact angle exceeds $90^\\circ$ in the images \\ref{GMSF2}g and\n\\ref{GMSF3}f.}\\label{zoom}\n\\end{figure*}\nThe interface appears dark because the liquid-gas meniscus refracts the normally incident light away from the\ncell axis. After the temperature ramp was started but still far from the critical temperature, the bubble\nshape changed. The contact area $A_{cg}$ of the gas with the copper wall appears to increase. In other\nsystems the wetting film under a growing vapor bubble is observed to evaporate \\cite{Tong}. In near-critical\nfluids, however, the heat transfer processes are more complex \\cite{Straub}. In this system we believe that\nthere may be a similar drying process, i.e., at some time the thin wetting film that separates the gas from\nthe copper wall evaporates. In fact, we have observed low contrast lines that appear within the $A_{sg}$ area\nwhen the heating begins. An example of such a line is indicated in Figure~\\ref{GMSF2}a by the white arrows.\nThe out-of-focus grid shows that these lines correspond to a sharp change in the wetting film thickness. These\nlines are most likely triple contact lines and we have actually seen them pinned by an imperfection on the\nwindows as they advance and retreat in other experiments. Since the heat conductivity of copper is larger\nthan that of sapphire, the heat is supplied to the cell mainly through the hotter copper wall. Therefore the\nfilm should evaporate on the copper wall even earlier than on the sapphire. A more refined analysis of the\ncontact line motion will be discussed elsewhere.\n\nThe increase of the $A_{cg}$ area is accompanied by an evident increase in the apparent contact angle, see\nFig.~\\ref{GMSF2}d--f and the corresponding magnified images in Fig.~\\ref{zoom}. Near the critical temperature\nthe apparent contact angle becomes \\emph{larger} than $90^\\circ$! We will analyze these effects theoretically\nin section~\\ref{sec-t}.\n\nWhile crossing the critical point, the vapor bubble is rapidly evolving. At\n$T\\approx T_c$, the surface tension vanishes, the bubble's relaxation from\nsurface tension is negligible, so that the interface shape is defined by the\nvariation of the local evaporation rate along the interface. The evaporation is\nstronger at the parts of the interface closest to the copper heating wall.\nThis effect leads to the waved interface shape shown in Fig.~\\ref{GMSF2}g.\nDiffusion causes the disappearance of the interface at $T>T_c$ as shown in\nFig.~\\ref{GMSF2}h.\n\nFigure~\\ref{GMSF3} shows the time sequence of the images of the cell 8, which\nis approximately twice as thick as cell 10.\n\\begin{figure*}[hbt]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_GMSF3.eps}\n  \\end{center}\n\\caption{Time sequence of the images from cell 8 during continuous heating through the critical point. Images\n(a-h) were taken exactly for the same values of temperature (shown in Fig.~\\ref{temp}) as corresponding\nimages in Fig.~\\ref{GMSF2}. The magnified upper regions close to the contact line from the images (e-h) are\nshown in Fig.~\\ref{zoom}.}\\label{GMSF3}\n\\end{figure*}\nThe images in Fig.~\\ref{GMSF3} were taken exactly for the same values of the non-dimensional temperature\n$\\tau$ (shown in Fig.~\\ref{temp}) as the corresponding images in Fig.~\\ref{GMSF2}. The force $\\vec{F}_c$\npushes the bubble against the cell wall as in the case of cell 10. As discussed above, this force is weaker\nthan for the cell 10 because the bubble appears almost circular at equilibrium (see Fig.~\\ref{GMSF2}a and\nFig.~\\ref{GMSF3}a). By comparing images (e) of both sequences, we can also see that the vapor spreads slower\nin cell 8. The increase of the apparent contact angle is also slower. The waved shape interface appears\nearlier in Fig.~\\ref{GMSF3}f, i.e. farther from $T_c$ than for the cell 10. The interface is still quite\nsharp in Fig.~\\ref{GMSF3}h, while it has already diffused in the case of the thinner cell\n(Fig.~\\ref{GMSF2}h). This difference can be explained by the difference in the liquid-gas interface area,\nwhich is roughly proportional to the cell thickness. The surface tension force that tends to maintain the\nconvex shape is not as strong for the thicker cell where a larger fluid volume has to be moved during the\nsame time. The diffusion time is larger for cell 8 because the size of the inhomogeneity (i.e. interface) is\nlarger.\n\nFigure~\\ref{PrePersU2} shows the time sequence of the images from cell 11, which is thicker than both the\ncells 8 and 10.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_PrePers.eps}\n  \\end{center}\n\\caption{Time sequence of images of the cell 11 during the continuous heating through the critical point. No\nbubble spreading is seen. The bubble does not touch the copper wall. The images\n(a, d, f) were taken exactly\nfor the same values of temperature (shown in Fig.~\\ref{temp}) as corresponding images in Fig.~\\ref{GMSF2} and\nFig.~\\ref{GMSF3}. The cell 11 contains three thermistors shown in image (i) by arrows. This image was taken\nafter the temperature equilibration above $T_c$.}\\label{PrePersU2}\n\\end{figure}\nThe images (a), (d) and (f) were taken for the same values of non-dimensional temperature as corresponding\nimages in Figs.~\\ref{GMSF2} and \\ref{GMSF3}. This cell contained three wetted thermistors\n(Fig.~\\ref{PrePersU2}i) that constrain the bubble surface (Fig.~\\ref{PrePersU2}a). The bubble is only slightly\nsqueezed by the windows so that the reaction forces that act on the bubble at equilibrium are weak. As a\nresult, the bubble does not touch the copper heating wall at all. Although this is not clear in the image\n(a), because of the glue near the copper wall, it is clear in image (f) where small newly formed bubbles\nseparate the initial bubble from the wall. These bubbles form from the local overheating of the fluid between\nthe large bubble and the copper wall. There is enough fluid between the large bubble and the wall so that a\nsmall bubble may grow in it. These small bubbles push the large bubble away from the wall before any\ncoalescence can take place.\n\n\nThe comparison of these three experiments clearly shows that in order to obtain the bubble spreading, the\nbubble needs to have a direct contact with the heating wall, i.e. to be pushed to the heating wall by some\nforce. Note that none of the images show any evidence of steady fluid motion that would be necessary to\nmaintain the distorted bubble shapes in Figs.~\\ref{GMSF2} and \\ref{GMSF3}. We conclude that this distortion\nof the bubble equilibrium shape cannot be caused by fluid motion.\n\nSimilar continuous heating experiments are reported by Ikier \\textit{et. al.} in \\cite{14}. However, a smaller\nheating rate (1.7~mK/s) and erratic accelerations of the cell did not allow gas spreading to be observed.\n\n\\section{Quenching experiments}\\label{sec-q}\n\nFigure~\\ref{Pegase4608} shows the time sequence of the images of cell 8\nwhen it was heated by 100~mK quenches as shown in Fig.~\\ref{Pegase4608temp}.\n\\begin{figure*}[htb]\n  \\begin{center}\n  \\includegraphics[height=5cm]{PRE_Peg.eps}\n  \\end{center}\n\\caption{Time sequence of images of cell 8 during two 100~mK quenches. The gas spreads during each quench\nthat lasts about 12~s. The equilibrium position of the vapor bubble with respect\n to the cell is shown by the\nwhite circle in each image for comparison. }\\label{Pegase4608}\n\\end{figure*}\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{PRE_PegTemp.eps}\n  \\end{center}\n\\caption{Temperature evolution during the series of quenches. The points that correspond to each of the\nimages in Fig.~\\ref{Pegase4608}(a-h) are indicated by arrows and corresponding letters. The temperature is\nmeasured in the body of the SCU.}\\label{Pegase4608temp}\n\\end{figure}\nWhile the heating rate is quite large during each quench, the time average of the heating rate 1.4~mK/s is\nsmaller than that during the continuous heating due to the waiting time of $\\approx 60$~s after each quench.\nDuring this waiting time a partial equilibration takes place. The images (a--c) show a slight bubble\nspreading that appears during a quench that is farther from the critical point than the quench shown in\nimages (d-h). After each quench as soon as the heating stops, the bubble interface begins to return to its\ninitial form (Fig.~\\ref{Pegase4608}c,d). This shows that the spreading vapor is caused by a non-equilibrium\neffect. The second quench that precedes the crossing of the critical point (Fig.~\\ref{Pegase4608}d--h) shows\nvery rapid interface motion accompanied by fluid flows.\n\nWhile the interface returns to its initial state during the waiting time of the first quench\n(Fig.~\\ref{Pegase4608}c), it does not return in the second quench (Fig.~\\ref{Pegase4608}h). This occurs\nbecause the characteristic equilibration time grows dramatically near $T_c$.\n\nThe same phenomenon of spreading gas was also observed during the heating of CO$_2$ cells in other experiments\n(Pegasus BV4705, Post-Perseus F14) carried out by our group in the Mir station. However, these experiments\nwere not designed to study the spreading gas and we do not discuss them here.\n\n\\section{Interface evolution during the heating}\\label{sec-t}\n\nThe above experimental data showed that the spreading gas and the associated interface deformation are caused\nby an out-of-equilibrium phenomenon. This is especially demonstrated by the analysis of the interface shape at\nequilibrium (sec.~\\ref{sec-eq}) and by the return to the equilibrium shape after each quench in\nsec.~\\ref{sec-q}. In this section we analyze possible causes of the spreading gas. Two causes are considered:\nMarangoni convection due to the temperature change $\\delta T_i$ along the gas-liquid interface and the\ndifferential vapor recoil.\n\n\\subsection{Marangoni convection}\n\nIf a temperature change $\\delta T_i$ exists, it will create a surface tension change $\\delta\\sigma =( {\\rm\nd}\\sigma/{\\rm d}T)\\delta T_i$ that will drive a thermo-capillary (Marangoni) flow in the bulk of both fluids\n\\cite{7,8,9}. The images obtained in our experiment are capable of visualizing convective flows from the\nshadow-graph effect. We have not seen any evidence of the steady convection that is required to create and\nmaintain the observed bubble shape continuously during the heating. We conclude that the Marangoni convection\nis absent.\n\nThis conclusion is an apparent contradiction with many works that study the Marangoni effect caused by\nevaporation (see e.g. \\cite{Palmer}). The main difference between these works and ours is in the conditions of\nevaporation. These works consider the evaporation into an \\emph{open} space where the vapor pressure is very\nsmall. The interface temperature thus follows the temperature in the bulk of the liquid and a very large\nevaporation rate is possible, limited only by the average velocity of the fluid molecules. In our case, the\ngas phase is almost at saturation pressure. This means that the total evaporation (over\n the whole gas liquid interface) is small and limited by the amount of the supplied heat consumed by the\nlatent heat. Therefore, any variation $\\delta T_i$ is rapidly dampened by the corresponding change in the\nevaporation rate, stabilizing the interface against Marangoni convection, see \\cite{Straub} for an extended\ndiscussion. This conclusion is confirmed by the experiments \\cite{Barnes}, in which Marangoni convection was\ncarefully studied in a \\emph{closed} cell with very clean water in contact with its vapor. \\emph{No}\nsurface-tension-driven convection was registered in spite of a large Marangoni number that was much greater\nthan its critical value obtained in the classical Marangoni-Benard experiments with non-volatile liquids\n\\cite{7}. It was argued in \\cite{7} that the convection was absent due to a hypothetical interface\ncontamination present in spite of many careful preventive measures. According to our reasoning, a variation\n$\\delta T_i$ would have been strongly dampened in \\cite{7} because of the saturation conditions in the sealed\ncell. We also note that even in evaporative driven Marangoni convection far from saturation, the convection\ncells may also tend to stabilize the interface resulting in intermittent cellular formation as was observed\nin \\cite{8}. It was also observed in \\cite{8} that the velocity of convection and frequency of intermittent\ncell formation decreases as the external gas becomes more saturated.\n\n\\subsection{Differential vapor recoil}\n\nWe now analyze another possible source of bubble deforming stress that does not\nrequire a temperature\ngradient along the interface. The bubble may be deformed by the normal stress exerted on the interface by the\nrecoil from departing vapor \\cite{Palmer}. Let $n(\\vec{x})$ be the evaporating mass per unit time per unit\ninterface area at the point $\\vec{x}$ on the interface. The evaporating gas moves normally to the interface,\nand exerts a force per unit area (a ``thrust\") on the liquid of\n\n\n", "index": 5, "text": "\\begin{equation}\\label{Pr}\n  P_r(\\vec{x})=n^{2}(\\vec{x})(1/\\rho_G-1/\\rho_L),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"P_{r}(\\vec{x})=n^{2}(\\vec{x})(1/\\rho_{G}-1/\\rho_{L}),\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msup><mi>n</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mn>1</mn><mo>/</mo><msub><mi>ρ</mi><mi>G</mi></msub></mrow><mo>-</mo><mrow><mn>1</mn><mo>/</mo><msub><mi>ρ</mi><mi>L</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nThe 3D curvature $K$ is equal to the sum of the 2D curvature $c$ in the image plane and the 2D curvature in\nthe perpendicular plane shown in Fig.~\\ref{fig1}. For the small cell thickness $H$, this latter curvature can\nbe accurately approximated by the constant value $2/H$. This is possible because the relatively small heat\nflow through the less conductive sapphire windows implies a small $P_r$ near the contact line on the windows,\nas compared to the large value of $\\Delta p$ at this small $H$. The interface shape can thus be obtained from\nthe 2D equation\n\n", "itemtype": "equation", "pos": 33990, "prevtext": "\nwhere $\\rho$ denotes mass density and the subscripts $L$ and $G$ refer to liquid\nand gas respectively.\n\nThe interface shape can be obtained from a quasi-static argument when the experimentally observed interface\nvelocity $v_i$ is smaller than the characteristic hydrodynamic velocity $\\sigma/ \\eta$, where $\\eta$ is the\nshear viscosity. A numerical estimate shows that the quasi-static approximation holds for the images (a-f) in\nFig.~\\ref{GMSF2}, in which the spreading is observed. The quasi-static approximation does not appear to hold\nfor the quench experiments (Fig.~\\ref{Pegase4608}), where the interface moves rapidly.\n\nAccording to the quasi-static argument \\cite{13}, the interface shape can be determined from the modified\nLaplace equation\n\n", "index": 7, "text": "\\begin{equation}\\label{modLap}\n\\sigma K=\\Delta p+P_r(\\vec{x}).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\sigma K=\\Delta p+P_{r}(\\vec{x}).\" display=\"block\"><mrow><mrow><mrow><mi>σ</mi><mo>⁢</mo><mi>K</mi></mrow><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>p</mi></mrow><mo>+</mo><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere $\\Delta p'$ is a constant to be determined from the known bubble volume\nand $l$ is a coordinate that varies along the bubble contour in the image\nplane.\n\nIn order to find the distribution $n(\\vec{x})$ at the interface it is necessary to solve the entire heat\ntransfer problem. This problem is complicated by several important factors. First, we deal with a problem\nthat contains a free boundary (gas-liquid interface) the position of which should be determined. Second, this\ninterface contains lines of singularities (gas-liquid-solid contact lines) where various divergences are\npossible. Third, the adiabatic heat transfer \\cite{Straub,11, Reg} (``the piston effect\") should be taken\ninto account for near-critical fluids. The first two complications were addressed in \\cite{13,IJMF,IJHMT} for\nplane geometry, i.e. for the gas bubble growing on a plane. We have shown that $n(\\vec{x})$ can exhibit a\ndivergence at the contact line and that it decreases exponentially far away from it. Because the bulk\ntemperature varies sharply in the boundary layer adjacent to the walls of the cell \\cite{11} and the interface\ntemperature is constant, the largest portion of mass transfer across the interface takes place near the\ntriple contact line. Thus $n(\\vec{x})$ is large in the vicinity of the contact line. In this work, we present\nfirst the scaling arguments and then an approximate calculation of the bubble shape to illustrate our\nexplanation of the spreading gas in the cylindrical geometry.\n\nWe assume that $n(\\vec{x})$ has the following form:\n\n", "itemtype": "equation", "pos": 34629, "prevtext": "\nThe 3D curvature $K$ is equal to the sum of the 2D curvature $c$ in the image plane and the 2D curvature in\nthe perpendicular plane shown in Fig.~\\ref{fig1}. For the small cell thickness $H$, this latter curvature can\nbe accurately approximated by the constant value $2/H$. This is possible because the relatively small heat\nflow through the less conductive sapphire windows implies a small $P_r$ near the contact line on the windows,\nas compared to the large value of $\\Delta p$ at this small $H$. The interface shape can thus be obtained from\nthe 2D equation\n\n", "index": 9, "text": "\\begin{equation}\\label{modLap1}\n\\sigma c=\\Delta p'+P_r(l),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\sigma c=\\Delta p^{\\prime}+P_{r}(l),\" display=\"block\"><mrow><mrow><mrow><mi>σ</mi><mo>⁢</mo><mi>c</mi></mrow><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>p</mi><mo>′</mo></msup></mrow><mo>+</mo><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nas $T\\rightarrow T_c$, i.e., it has the same local behavior with respect to temperature as the critical\ntemperature is approached. The integral rate of change of mass $M$ of the gas bubble is defined as\n\n", "itemtype": "equation", "pos": 36255, "prevtext": "\nwhere $\\Delta p'$ is a constant to be determined from the known bubble volume\nand $l$ is a coordinate that varies along the bubble contour in the image\nplane.\n\nIn order to find the distribution $n(\\vec{x})$ at the interface it is necessary to solve the entire heat\ntransfer problem. This problem is complicated by several important factors. First, we deal with a problem\nthat contains a free boundary (gas-liquid interface) the position of which should be determined. Second, this\ninterface contains lines of singularities (gas-liquid-solid contact lines) where various divergences are\npossible. Third, the adiabatic heat transfer \\cite{Straub,11, Reg} (``the piston effect\") should be taken\ninto account for near-critical fluids. The first two complications were addressed in \\cite{13,IJMF,IJHMT} for\nplane geometry, i.e. for the gas bubble growing on a plane. We have shown that $n(\\vec{x})$ can exhibit a\ndivergence at the contact line and that it decreases exponentially far away from it. Because the bulk\ntemperature varies sharply in the boundary layer adjacent to the walls of the cell \\cite{11} and the interface\ntemperature is constant, the largest portion of mass transfer across the interface takes place near the\ntriple contact line. Thus $n(\\vec{x})$ is large in the vicinity of the contact line. In this work, we present\nfirst the scaling arguments and then an approximate calculation of the bubble shape to illustrate our\nexplanation of the spreading gas in the cylindrical geometry.\n\nWe assume that $n(\\vec{x})$ has the following form:\n\n", "index": 11, "text": "\\begin{equation}\\label{nsc}\n  n(\\vec{x})=g(\\vec{x})(T_c-T)^{a}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"n(\\vec{x})=g(\\vec{x})(T_{c}-T)^{a}\" display=\"block\"><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>a</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere the integration is performed over the total gas-liquid interface area. On\nthe other hand,\n\n", "itemtype": "equation", "pos": 36536, "prevtext": "\nas $T\\rightarrow T_c$, i.e., it has the same local behavior with respect to temperature as the critical\ntemperature is approached. The integral rate of change of mass $M$ of the gas bubble is defined as\n\n", "index": 13, "text": "\\begin{equation}\\label{M1}\n  {\\rm d}M/{\\rm d}t=\\int n(\\vec{x}){\\rm d}\\vec{x}\\sim(T_c-T)^{a},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm d}M/{\\rm d}t=\\int n(\\vec{x}){\\rm d}\\vec{x}\\sim(T_{c}-T)^{a},\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>M</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">d</mi></mrow><mo>⁢</mo><mi>t</mi></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mover accent=\"true\"><mi>x</mi><mo stretchy=\"false\">→</mo></mover></mrow></mrow></mrow><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>a</mi></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere $V$ is the cell volume, and $\\phi =0.5$ is assumed. Near the critical point, the co-existence curve has\nthe form $\\rho_G=\\rho_c-\\Delta\\rho/2$, where $\\Delta\\rho\\sim(T_c-T)^\\beta$ with the universal exponent\n$\\beta=0.325$, so that ${\\rm d}M/{\\rm d}t \\sim(T_c-T)^{\\beta -1}{\\rm d} T/{\\rm d}t $ as $T\\rightarrow T_c$\naccording to Eq.~(\\ref{M2}). Thus Eq.~(\\ref{M1}) results in $a=\\beta -1$ and the curvature change due to the\nvapor recoil scales as\n\n", "itemtype": "equation", "pos": 36740, "prevtext": "\nwhere the integration is performed over the total gas-liquid interface area. On\nthe other hand,\n\n", "index": 15, "text": "\\begin{equation}\\label{M2}\n  {\\rm d}M/{\\rm d}t={\\rm d}/{\\rm d}t(V\\phi\\rho_{G}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{\\rm d}M/{\\rm d}t={\\rm d}/{\\rm d}t(V\\phi\\rho_{G}),\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>M</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">d</mi></mrow><mo>⁢</mo><mi>t</mi></mrow><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">d</mi><mo>/</mo><mi mathvariant=\"normal\">d</mi></mrow><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>V</mi><mo>⁢</mo><mi>ϕ</mi><mo>⁢</mo><msub><mi>ρ</mi><mi>G</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere Eq.~(\\ref{Pr}) and the scaling relationship $\\sigma\\sim(T_c-T)^{2\\nu}$ ($\\nu=0.63$) were employed.\nBecause this critical exponent $(3\\beta-2-2\\nu\\approx -2.3)$ is very large, it should manifest itself even\nfar from the critical point in agreement with the experiments. In summary, as $T\\rightarrow T_c$, the vapor\nmass growth follows the growth of its density (the vapor volume remains constant), so that the diverging vapor\nproduction near the critical point drives a diverging recoil force.\n\nThis curvature change has a striking effect on the bubble shape because it is not homogeneously distributed\nalong the bubble interface. Since the evaporation is strongest near the copper heating wall where the\nstrongest temperature gradients form, both $P_r$ and $c$ increase strongly near this wall, i.e. near the\ntriple contact line. Note that $c$ is proportional to the second derivative of the bubble shape function,\ni.e. to the first derivative of the bubble slope. If $c$ is large, then the slope of the bubble contour\nchanges sharply when moving along the bubble contour towards the contact line, see \\cite{IJT,13,IJMF} for\nmore details. Because the interface slope changes so abruptly near the contact line, the apparent contact\nangle should be much larger than its actual value.\n\n\nBecause $c$ is proportional to the second derivative of the bubble shape function, Eq.~(\\ref{modLap1}) is a\ndifferential equation with the boundary condition given by the actual contact angle \\cite{13}. This actual\ncontact angle defines the first derivative (the slope) of the bubble shape function at the solid wall. It is\nalso specified by the interfacial tension balance and must be zero near the critical point. This condition of\nthe zero contact angle gives a boundary condition for Eq.~(\\ref{modLap1}). In order to illustrate a possible\nsolution of Eq.~(\\ref{modLap1}), we solved it using the same expression for $P_r(l)$ as in \\cite{13}\n\n", "itemtype": "equation", "pos": 37287, "prevtext": "\nwhere $V$ is the cell volume, and $\\phi =0.5$ is assumed. Near the critical point, the co-existence curve has\nthe form $\\rho_G=\\rho_c-\\Delta\\rho/2$, where $\\Delta\\rho\\sim(T_c-T)^\\beta$ with the universal exponent\n$\\beta=0.325$, so that ${\\rm d}M/{\\rm d}t \\sim(T_c-T)^{\\beta -1}{\\rm d} T/{\\rm d}t $ as $T\\rightarrow T_c$\naccording to Eq.~(\\ref{M2}). Thus Eq.~(\\ref{M1}) results in $a=\\beta -1$ and the curvature change due to the\nvapor recoil scales as\n\n", "index": 17, "text": "\\begin{equation}\\label{prs}\n  P_r /\\sigma\\sim(T_c-T)^{3\\beta-2-2\\nu},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"P_{r}/\\sigma\\sim(T_{c}-T)^{3\\beta-2-2\\nu},\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>/</mo><mi>σ</mi></mrow><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mrow><mn>3</mn><mo>⁢</mo><mi>β</mi></mrow><mo>-</mo><mn>2</mn><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>ν</mi></mrow></mrow></msup></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere $l\\in[0, L]$, $L$ being a length of the bubble half-contour with $l=0$ at\nthe solid wall. We use a\nnon-dimensional parameter $N$ to measure the influence of the vapor recoil force\nrelative to the surface\ntension. It is defined as\n\n", "itemtype": "equation", "pos": 39306, "prevtext": "\nwhere Eq.~(\\ref{Pr}) and the scaling relationship $\\sigma\\sim(T_c-T)^{2\\nu}$ ($\\nu=0.63$) were employed.\nBecause this critical exponent $(3\\beta-2-2\\nu\\approx -2.3)$ is very large, it should manifest itself even\nfar from the critical point in agreement with the experiments. In summary, as $T\\rightarrow T_c$, the vapor\nmass growth follows the growth of its density (the vapor volume remains constant), so that the diverging vapor\nproduction near the critical point drives a diverging recoil force.\n\nThis curvature change has a striking effect on the bubble shape because it is not homogeneously distributed\nalong the bubble interface. Since the evaporation is strongest near the copper heating wall where the\nstrongest temperature gradients form, both $P_r$ and $c$ increase strongly near this wall, i.e. near the\ntriple contact line. Note that $c$ is proportional to the second derivative of the bubble shape function,\ni.e. to the first derivative of the bubble slope. If $c$ is large, then the slope of the bubble contour\nchanges sharply when moving along the bubble contour towards the contact line, see \\cite{IJT,13,IJMF} for\nmore details. Because the interface slope changes so abruptly near the contact line, the apparent contact\nangle should be much larger than its actual value.\n\n\nBecause $c$ is proportional to the second derivative of the bubble shape function, Eq.~(\\ref{modLap1}) is a\ndifferential equation with the boundary condition given by the actual contact angle \\cite{13}. This actual\ncontact angle defines the first derivative (the slope) of the bubble shape function at the solid wall. It is\nalso specified by the interfacial tension balance and must be zero near the critical point. This condition of\nthe zero contact angle gives a boundary condition for Eq.~(\\ref{modLap1}). In order to illustrate a possible\nsolution of Eq.~(\\ref{modLap1}), we solved it using the same expression for $P_r(l)$ as in \\cite{13}\n\n", "index": 19, "text": "\\begin{equation}\\label{Pr-ex}\n  P_r(l)\\propto -N\\,\\log (l/L)\\,\\exp\\{(-[l/(0.1\\,L)]^2\\},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"P_{r}(l)\\propto-N\\,\\log(l/L)\\,\\exp\\{(-[l/(0.1\\,L)]^{2}\\},\" display=\"block\"><mrow><msub><mi>P</mi><mi>r</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>l</mi><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mo>-</mo><mpadded width=\"+1.7pt\"><mi>N</mi></mpadded><mi>log</mi><mrow><mo stretchy=\"false\">(</mo><mi>l</mi><mo>/</mo><mi>L</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>exp</mi><mrow><mo stretchy=\"false\">{</mo><mrow><mo stretchy=\"false\">(</mo><mo>-</mo><msup><mrow><mo stretchy=\"false\">[</mo><mi>l</mi><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mpadded width=\"+1.7pt\"><mn>0.1</mn></mpadded><mi>L</mi><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><mo stretchy=\"false\">}</mo></mrow><mo>,</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nwhere the integration is performed over the drop contour in the image plane. The numerical coefficient (see\n\\cite{13}) in Eq.~(\\ref{Pr-ex}) can be determined from  Eq.~(\\ref{Nr}), where the upper integration limit can\nbe replaced by infinity without any loss of accuracy. Although the expression Eq.~(\\ref {Pr-ex}) for the vapor\nrecoil pressure is not rigorous, it contains the main physical features of the solution of the heat conduction\nproblem: a weak divergence at the contact line and a rapid decay away from it. It is shown in \\cite{IJHMT}\nthat the rigorous numerical solutions obtained far from the critical point follow this behavior.\n\nThe result of this calculation is shown in Fig.~\\ref{fig3}.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{Theor-recoil.eps}\n  \\end{center}\n\\caption{ Calculated bubble shape for different values of the non-dimensional\nstrength of vapor recoil $N$ that goes to infinity at the critical point. Note\nthat the actual contact angle is zero for all the curves.}\\label{fig3}\n\\end{figure}\nSince Eq.~(\\ref{prs}) implies\n\n", "itemtype": "equation", "pos": 39645, "prevtext": "\nwhere $l\\in[0, L]$, $L$ being a length of the bubble half-contour with $l=0$ at\nthe solid wall. We use a\nnon-dimensional parameter $N$ to measure the influence of the vapor recoil force\nrelative to the surface\ntension. It is defined as\n\n", "index": 21, "text": "\\begin{equation}\nN={1\\over\\sigma}\\int\\limits_0^L P_r(l)\\;{\\rm d}l. \\label{Nr}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"N={1\\over\\sigma}\\int\\limits_{0}^{L}P_{r}(l)\\;{\\rm d}l.\" display=\"block\"><mrow><mrow><mi>N</mi><mo>=</mo><mrow><mfrac><mn>1</mn><mi>σ</mi></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∫</mo><mn>0</mn><mi>L</mi></munderover><mrow><msub><mi>P</mi><mi>r</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>l</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>d</mo><mi>l</mi></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nas $T\\rightarrow T_c$, the $N$ increase mimics the approach to the critical point and qualitatively explains\nthe observed shape of the vapor bubble (see Fig.~\\ref{GMSF2}). The increase of the apparent contact angle and\nof the gas-solid contact area $A_{cg}$ can be seen in Fig.~\\ref{fig3}. Note that such a calculation is not\nable to predict the wavy interface shapes like those in Fig.~\\ref{GMSF2}g or Fig.~\\ref{GMSF3}f-h, because\nthese images correspond either to $T>T_c$ (images g and h of the both figures) or to the close vicinity of\n$T_c$ where $\\sigma<v_i\\,\\eta$, see the discussion of the validity of the quasi-static approximation earlier\nin this section.\n\n\n\\section{Spreading gas and the boiling crisis}\\label{sec-b}\n\nA very similar bubble spreading was observed far from $T_c$ during boiling at large heat flux \\cite{Van,Tor}.\nWhen the heating to a surface is increased past a Critical Heat Flux (CHF) there is a sudden transition to\n``film\" boiling, where the heater becomes covered with gas and may burnout \\cite{Tong}. This ``boiling\ncrisis\" is an important practical problem in many industries where large heat fluxes are frequently used. We\ninterpret \\cite{13,IJHMT} the boiling crisis to be similar to the gas spreading shown here. The main\ndifference is that the large value of $N$ is made by a large vapor production that can be achieved during\nstrong overheating rather than by the critical effects.\n\nIt is well-documented from experiments \\cite{Tong} that the CHF decreases rapidly when the fluid pressure $p$\napproaches the critical pressure $p_c$, i.e., when $T\\rightarrow T_c$ in our constant volume system.\nPreviously, this tendency has not been well understood. The divergence of the factor $N$, discussed above,\nhelps to understand it. We first note that the evaporation rate $n$ scales as the applied heat flux $q$ and\n$N\\sim q^2$, where Eqs.~(\\ref{Pr}) and (\\ref{Nr}) are used. By assuming that the boiling crisis ($q=q_{CHF}$)\nbegins when $N$ attains its critical value $N_{CHF}\\sim 1$ (see \\cite{13}), one finds that\n\n", "itemtype": "equation", "pos": 40815, "prevtext": "\nwhere the integration is performed over the drop contour in the image plane. The numerical coefficient (see\n\\cite{13}) in Eq.~(\\ref{Pr-ex}) can be determined from  Eq.~(\\ref{Nr}), where the upper integration limit can\nbe replaced by infinity without any loss of accuracy. Although the expression Eq.~(\\ref {Pr-ex}) for the vapor\nrecoil pressure is not rigorous, it contains the main physical features of the solution of the heat conduction\nproblem: a weak divergence at the contact line and a rapid decay away from it. It is shown in \\cite{IJHMT}\nthat the rigorous numerical solutions obtained far from the critical point follow this behavior.\n\nThe result of this calculation is shown in Fig.~\\ref{fig3}.\n\\begin{figure}[htb]\n  \\begin{center}\n  \\includegraphics[height=6cm]{Theor-recoil.eps}\n  \\end{center}\n\\caption{ Calculated bubble shape for different values of the non-dimensional\nstrength of vapor recoil $N$ that goes to infinity at the critical point. Note\nthat the actual contact angle is zero for all the curves.}\\label{fig3}\n\\end{figure}\nSince Eq.~(\\ref{prs}) implies\n\n", "index": 23, "text": "\\begin{equation}\\label{Ns}\n  N\\sim(T_c-T)^{-2.3}\\rightarrow\\infty\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"N\\sim(T_{c}-T)^{-2.3}\\rightarrow\\infty\" display=\"block\"><mrow><mi>N</mi><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mo>-</mo><mn>2.3</mn></mrow></msup><mo>→</mo><mi mathvariant=\"normal\">∞</mi></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nfrom Eq.~(\\ref{Ns}). The same exponent is also valid for the pressure scaling,\n\n", "itemtype": "equation", "pos": 42944, "prevtext": "\nas $T\\rightarrow T_c$, the $N$ increase mimics the approach to the critical point and qualitatively explains\nthe observed shape of the vapor bubble (see Fig.~\\ref{GMSF2}). The increase of the apparent contact angle and\nof the gas-solid contact area $A_{cg}$ can be seen in Fig.~\\ref{fig3}. Note that such a calculation is not\nable to predict the wavy interface shapes like those in Fig.~\\ref{GMSF2}g or Fig.~\\ref{GMSF3}f-h, because\nthese images correspond either to $T>T_c$ (images g and h of the both figures) or to the close vicinity of\n$T_c$ where $\\sigma<v_i\\,\\eta$, see the discussion of the validity of the quasi-static approximation earlier\nin this section.\n\n\n\\section{Spreading gas and the boiling crisis}\\label{sec-b}\n\nA very similar bubble spreading was observed far from $T_c$ during boiling at large heat flux \\cite{Van,Tor}.\nWhen the heating to a surface is increased past a Critical Heat Flux (CHF) there is a sudden transition to\n``film\" boiling, where the heater becomes covered with gas and may burnout \\cite{Tong}. This ``boiling\ncrisis\" is an important practical problem in many industries where large heat fluxes are frequently used. We\ninterpret \\cite{13,IJHMT} the boiling crisis to be similar to the gas spreading shown here. The main\ndifference is that the large value of $N$ is made by a large vapor production that can be achieved during\nstrong overheating rather than by the critical effects.\n\nIt is well-documented from experiments \\cite{Tong} that the CHF decreases rapidly when the fluid pressure $p$\napproaches the critical pressure $p_c$, i.e., when $T\\rightarrow T_c$ in our constant volume system.\nPreviously, this tendency has not been well understood. The divergence of the factor $N$, discussed above,\nhelps to understand it. We first note that the evaporation rate $n$ scales as the applied heat flux $q$ and\n$N\\sim q^2$, where Eqs.~(\\ref{Pr}) and (\\ref{Nr}) are used. By assuming that the boiling crisis ($q=q_{CHF}$)\nbegins when $N$ attains its critical value $N_{CHF}\\sim 1$ (see \\cite{13}), one finds that\n\n", "index": 25, "text": "\\begin{equation}\\label{tchf}\n  q_{CHF}\\sim(T_c-T)^{1+\\nu-3\\beta/2}\\sim(T_c-T)^{1.1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"q_{CHF}\\sim(T_{c}-T)^{1+\\nu-3\\beta/2}\\sim(T_{c}-T)^{1.1}\" display=\"block\"><mrow><msub><mi>q</mi><mrow><mi>C</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mrow><mn>1</mn><mo>+</mo><mi>ν</mi></mrow><mo>-</mo><mrow><mrow><mn>3</mn><mo>⁢</mo><mi>β</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow></msup><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>1.1</mn></msup></mrow></math>", "type": "latex"}, {"file": "1601.06969.tex", "nexttext": "\nEq. (\\ref{pchf}) explains the observed tendency $q_{CHF}\\rightarrow 0$ as $p\\rightarrow p_c$.\n\nAlthough the strict requirements on temperature stability and the necessity of weightlessness lead to\nexperimental difficulties to study the boiling crisis in the near-critical region, they also present some\nimportant advantages. Only a very small heating rate (heat flux) is needed to reach the boiling crisis because\n$q_{CHF}$ is very small. At such low heat fluxes, the bubble growth is extremely slow due to the critical\nslowing-down. In our experiments we were able to observe the spreading gas (i.e. the dry-out that leads to\nthe boiling crisis, see Fig.~\\ref{GMSF2}) during 45~min! Such experiments not only permit an excellent time\nresolution, but also allow the complicating effects of rapid fluid motion to be avoided.\n\n\\section{Conclusions}\n\nIn our experiments we observed a gas bubble spreading over a solid wall and a large value ($>90^\\circ$) of the\napparent contact angle that appeared despite the zero actual contact angle with the solid. The spreading gas\nis a phenomenon that can occur in a sealed heated fluid cell only when the bubble is pressed against the\nheating wall. The 3D numerical calculation of the equilibrium bubble shape showed that the slightly tilted\nwindows of the experimental cell pressed the bubble against the copper side-wall. Weightless conditions are\nneeded in the near-critical region in order to observe this phenomenon when the surface tension is small and a\nbubble-like shape persists. The same phenomenon can be observed far from the critical point during boiling at\nhigh heat fluxes where it is known as the ``boiling crisis\". While the gas spreads very quickly during the\nboiling crisis far from the critical point, the near-critical region allows a very slow spreading gas to be\nobserved in great detail.\n\nWe explain this phenomenon as induced by the vapor recoil force that changes the shape of the vapor-liquid\ninterface near the triple contact line. Our preliminary calculations of the gas-liquid interface shape are\nqualitatively consistent with the experimental images. The scaling analysis gives the critical exponent for\nthe critical heat flux decrease near the critical point and explains the increase of the vapor recoil effect\nnear the critical point. We believe that there is much to be learned about the boiling crisis in the\nnear-critical region and hope that these experiments inspire more investigations.\n\n\\begin{acknowledgments}\nThis work was supported by CNES and NASA Grant NAG3-1906. A part of this work was made during the stay of V.\nN. at the UNO and he would like to thank the Department of Physics of the UNO for their hospitality. We thank\nall of the Alice II team and everyone involved in the Mir missions. We especially thank J. F. Zwilling, and\nthe french cosmonauts Claudie Andr\\'e-Deshays, L\\'eopold Eyharts, and Jean-Pierre Haigner\\'e. We thank Kenneth\nBrakke for creating the Surface Evolver software and for making it available for the scientific community.\n\\end{acknowledgments}\n\n\\begin{thebibliography}{99}\n\\bibitem{1} M. Schick, in: {\\it Liquids at Interfaces}, Eds. J. Charvolin,\nJ.-F. Joanny \\& J. Zinn-Justin, Elsevier, p.415 (1989); D. Beysens , {\\it ibid}, p. 499.\n\\bibitem{2} R.F. Kayser, J.W. Schmidt, \\& M.R. Moldover, Phys. Rev. Lett. {\\bf 54}, 707 (1985).\n\\bibitem{ChimPh} Y. Garrabos, C. Chabot, R. Wunenburger, J.-P. Delville, \\& D. Beysens, J. Chimie Physique\n{\\bf 96}, 1066 (1999).\n\\bibitem{BouldGW} J. Hegseth, Y. Garrabos, V. S. Nikolayev, C. Lecoutre-Chabot,\nR. Wunenburger, D. Beysens, \\textit{Proc. 14th Symposium on Thermophysical properties, Boulder, CO (USA) June\n25--30, 2000}, \\url{http://symp14.nist.gov/PDF/WET05HEG.PDF}, Int. J. Thermophysics, to be published (2001).\n\\bibitem{IJT} V. S. Nikolayev, D. A. Beysens, J. Hegseth, \\textit{Proc. 14th Symposium on Thermophysical properties,\nBoulder, CO (USA) June 25--30, 2000}, \\url{http://symp14.nist.gov/PDF/WET10NIK.PDF}, Int. J. Thermophysics, to\nbe published (2001).\n\\bibitem{Sorrento} Y. Garrabos, R. Wunenburger, C. Lecoutre, V. Nikolayev, D. Beysens, J. Hegseth,\n\\textit{Proc. 1st Int. Symp. on Microgravity Research \\& Applications in Physical Sciences and Biotechnology\nSorrento, Italy, Sept. 10-15, 2000}, ESA SP-454, ESTEC, Noordwijk, 157 (2000).\n\\bibitem{STAIF} Y. Garrabos, R. Wunenburger, J. Hegseth, C. Lecoutre-Chabot, D.\nBeysens, in: \\textit{Space Technology and Applications International Forum--2000}, ed. M. S. El-Genk,\nAmerican Institute of Physics, 737 (2000).\n\\bibitem{3}  R. Marcout, J.-F. Zwilling, J. M. Laherrere, Y. Garrabos, \\& D.\nBeysens, Microgravity Quaterly {\\bf 5}, 162 (1995).\n\\bibitem{4} C. Morteau, M. Salzman, Y. Garrabos, \\& D. Beysens, in: {\\it Fluids\nin Space, Proc. 2nd European Symposium on Fluids in Space }, Ed. A. Viviani, Jean-Gilder Congressi srl, Rome,\np.327 (1997).\n\\bibitem{Gulf} V. Gurfein, D. Beysens, Y. Garrabos, \\& B. Le Neindre, Opt. Comm. {\\bf 85}, 147 (1991).\n\\bibitem{5} J. P. Delville, M. Salzman, Y. Garrabos, \\& D. Beysens, in: {\\it Fluids in Space, Proc.\n2nd European Symposium on Fluids in Space }, Ed. A. Viviani, Jean-Gilder Congressi srl, Rome, p. 312 (1997).\n\\bibitem{Evolver} \\url{http://www.geom.umn.edu/software/evolver/}\n\\bibitem{14} C. Ikier, H. Klein, and D. Woermann, J. Colloid Interface Sci. {\\bf 178}, 368 (1996).\n\\bibitem{Tong} L. S. Tong, {\\it Boiling Heat Transfer and Two-Phase Flow}, Taylor \\& Francis, New York\n(1997), 2nd ed.\n\\bibitem{Straub} J. Straub, L. Eicher, \\& A. Haupt, Phys. Rev. E {\\bf 51}, 5556\n(1995).\n\\bibitem{7} J. R. A. Pearson, J. Fluid Mech. {\\bf 4}, 489 (1958).\n\\bibitem{8} J. J. Hegseth, N. Rashidnia, \\& A. Chai, Phys. Rev. E {\\bf 54}, 1640\n(1996).\n\\bibitem{9} S. H. Davis, Ann. Rev. Fluid Mech. {\\bf 19}, 403 (1987).\n\\bibitem{Palmer} H. J. Palmer, J. Fluid. Mech. {\\bf 75}, part 3, 487 (1976).\n\\bibitem{Barnes} H. K. Cammenga, D. Schreiber, G. T. Barnes, D. S. Hunter,\nJ. Colloid Interface Sci. \\textbf{98}, 585 (1984).\n\\bibitem{11} Y. Garrabos, M. Bonetti, D. Beysens, F. Perrot, T. Fr\\\"{o}hlich, P. Carl\\`{e}s,\n\\& B. Zappoli, Phys. Rev. E {\\bf 57}, 5665 (1998) and refs. therein.\n\\bibitem{Reg} R. Wunenburger, Y. Garrabos, C. Lecoutre-Chabot, D. Beysens, \\& J.\n Hegseth, Phys. Rev. Lett {\\bf 84}, 4100 (2000).\n\\bibitem{13} V. S. Nikolayev \\& D. A. Beysens, Europhys. Lett. {\\bf 47}, 345 (1999).\n\\bibitem{IJMF} V. S. Nikolayev, D.~A.~Beysens, Y. Garrabos \\& J. Hegseth,\n\\textit{Proc. 4th International Conf. on Multiphase Flow, New Orleans, May 27 -- June 1, 2001}, Int. J.\nMultiphase flow, to be published (2001).\n\\bibitem{IJHMT} V. S. Nikolayev, D.~A.~Beysens, G.-L. Lagier \\& J. Hegseth, Int.\n J. Heat Mass Transfer {\\bf 44}, 3499 (2001).\n\\bibitem{Van} H. J. van Ouwerkerk, Int. J. Heat Mass Transfer {\\bf 15}, 25--34\n(1972).\n\\bibitem{Tor} K. Torikai, K. Suzuki \\& M. Yamaguchi, JSME Int. J. Series~II {\\bf 34}, 195 (1991).\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 43122, "prevtext": "\nfrom Eq.~(\\ref{Ns}). The same exponent is also valid for the pressure scaling,\n\n", "index": 27, "text": "\\begin{equation}\\label{pchf}\n  q_{CHF}\\sim(p_c-p)^{1.1}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"q_{CHF}\\sim(p_{c}-p)^{1.1}.\" display=\"block\"><mrow><mrow><msub><mi>q</mi><mrow><mi>C</mi><mo>⁢</mo><mi>H</mi><mo>⁢</mo><mi>F</mi></mrow></msub><mo>∼</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>p</mi><mi>c</mi></msub><mo>-</mo><mi>p</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>1.1</mn></msup></mrow><mo>.</mo></mrow></math>", "type": "latex"}]