[{"file": "1601.05144.tex", "nexttext": "\nThen the total distance along the track is $\\sum_i D_i$ but, in practice, the quantity of interest\nis the distance \\emph{between} two adjacent primary EEPs.\nThe $w_j$ in Equation \\ref{eq:metric} are arbitrary weight factors applied to the individual terms.\nThe $x_j$ are columns of data from the stellar evolution track. It is convenient, but not strictly necessary, \nto use logarithmic quantities for the $x_j$ because many of the quantities used span an order of magnitude or \nmore. In principle, any quantity from the stellar evolution track may be used in Equation \\ref{eq:metric}.\nExperiments with central temperature and density indicate that both can be used effectively in the \nmetric funcion. It should be noted that the singular purpose of the metric is to place secondary EEPs \nalong the evolutionary track between two primary EEPs; the metric is not used explicitly in any later steps.\n\n\n\\subsection{Summary}\\label{ss:summary}\n\nSection \\ref{s:eep} describes a two-step process to assign EEPs and create uniform, EEP-based stellar evolution tracks\nthat can later be used for interpolation of other tracks and isochrones. The first step is to cycle through the original \nstellar evolution track and identifies the points that are coincident with the primary EEPs. The second step is to cycle \nthrough the original track again and locate the desired number of secondary EEPs between each pair of primary EEPs. \nIt is important to note that although primary and secondary EEPs are distinct in the way that they are \\emph{identified} in \nthe original stellar evolution tracks there is no difference in the way they are \\emph{used} for interpolation purposes.\nThe total number of points in the EEP-based track will equal the sum of the number of primary EEPs and the number of \nsecondary EEPs between each pair of primaries.\n\n\n\\section{Constructing new tracks and isochrones}\\label{s:interp}\nOnce a set of stellar evolution tracks has been processed onto a uniform grid of EEPs, it is \nstraightforward to interpolate new stellar evolution tracks for {\\ensuremath{\\mathrm{M_{init}}}}\\ values not included \nin the original grid and to generate isochrones; extrapolation is not permitted.\n\n\n\\subsection{Creating a new stellar evolution track}\\label{ss:track}\nThe process of generating a new stellar evolution track is as simple as identifying a subset\nof 2 or more (4 for cubic interpolation) tracks in the original grid whose {\\ensuremath{\\mathrm{M_{init}}}}\\ values \nenvelop that of the new track. Once a set of tracks with appropriate {\\ensuremath{\\mathrm{M_{init}}}}-values have been indentified,\na new track can be created by looping over all EEPs, interpolating amongst those tracks at fixed EEP number\nusing {\\ensuremath{\\mathrm{M_{init}}}}\\ as the independent variable.\nThe resulting track has the same number of EEPs as those that went into constructing it.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/m12interp}\n\\caption{Comparison of a $1.20~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ stellar evolution track created by interpolation with one \ncomputed directly by {\\texttt{{MESA}}}~{\\texttt{{star}}}.}\n\\label{fig:interp-mass}\n\\end{figure*}\n\nConsider the example shown in Figure \\ref{fig:interp-mass}, where a new stellar evolution track\nwith ${\\ensuremath{\\mathrm{M_{init}}}}=1.2~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$, created by cubic interpolation from 4 tracks with {\\ensuremath{\\mathrm{M_{init}}}} = 1.10, 1.15, \n1.25, and 1.30 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}, is compared with the actual {\\ensuremath{\\mathrm{M_{init}}}} = 1.2 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ track from the existing set \nof models. Figure \\ref{fig:interp-mass}\nshows both the H-R diagram (top row) and the central temperature-density diagram (bottom row).\nPanels on the left show the full evolutionary tracks, from pre-MS to a cooling white dwarf (WD),\nwhile on the right are shown the evolution from ZAMS to RGBTip. \n\n\n\n\n\\subsection{Creating isochrones}\\label{ss:isochrone}\n\nThe process of generating an isochrone is more involved than that of generating a new track\nbut it is, nevertheless, straightforward on a uniform grid of EEPs. For a given age, an isochrone\nis constructed by looping over the complete set of EEPs, identifying which are valid for that\nage, and then performing the necessary interpolations to arrive at the stellar parameters for that EEP.\nIn this context, an EEP is `valid' if more than one evolutionary track exists at that age for \nthat EEP. For example, an ancient isochrone (age $>$ 10 Gyr) will have no valid EEPs on the pre-MS\nwhile a very young isochrone (age $<$ 5 Myr) will have no TP-AGB or WDCS.\n\n\nThe construction of an isochrone for a given age is performed as a loop over all EEPs:\n\\begin{enumerate}\n\\item Make a list of the stellar evolution tracks that include each EEP at that age. If none exist, then cycle to the next EEP.\n\\item For that EEP and list of tracks, an ordered {\\ensuremath{\\mathrm{M_{init}}}}-age relation is constructed. \n\\item Using the input age, obtain the {\\ensuremath{\\mathrm{M_{init}}}}-value appropriate for that age and EEP by interpolation in the {\\ensuremath{\\mathrm{M_{init}}}}-age relation (see Figure \\ref{fig:nonmono}).\n\\item With {\\ensuremath{\\mathrm{M_{init}}}}\\ in hand, all stellar parameters for that EEP are obtained by another round of interpolations using {\\ensuremath{\\mathrm{M_{init}}}}\\ as the independent variable.\n\\end{enumerate}\nThe whole process is then repeated for other ages.\n\n\nInstances, primarily during the TP-AGB phase, can occur when interpolation and even finite numerical precision can lead to non-monotonic \n{\\ensuremath{\\mathrm{M_{init}}}}\\ values along a given isochrone. Such instances are numerical rather than physical and, thus, distinct from those \ndiscussed in $\\S$\\ref{ss:complications} and \\ref{ss:double}. In this case it is possible to enforce monotonicity via the \n`pool adjacent violators' (PAV) algorithm.\\footnote{\\url{http://stat.wikia.com/wiki/Isotonic\\_regression}}\nThe PAV algorithm is an iterative procedure that enforces monotonicity by searching through an array and replacing a non-monotonic value \nwith a weighted average of neighboring points.\n\n\n\n\n\n\n\n\\subsection{Mitigating non-monotonic behavior in the {\\ensuremath{\\mathrm{M_{init}}}}-age relation}\\label{ss:complications}\n\nThe standard assumption employed in isochrone construction is that, for a given EEP, the {\\ensuremath{\\mathrm{M_{init}}}}-age relation will\nbe monotonic. Thus for each age and EEP a unique {\\ensuremath{\\mathrm{M_{init}}}}\\ value is obtained. Each EEP in a given isochrone should, therefore, have a \nhigher {\\ensuremath{\\mathrm{M_{init}}}}\\ than the one before it. However, stellar physics is not always so conformant and there are instances where, over a \nsmall interval in {\\ensuremath{\\mathrm{M_{init}}}}, the {\\ensuremath{\\mathrm{M_{init}}}}-age relation is non-monotonic. \nThe mathematical formalism described above does not work in such cases. In fact, it is possible to miss the signature of such\ntransitions if the grid of stellar evolution tracks is sufficiently coarse. The finer the grid, the more pronounced the effect\n\\citep{Girardi2013}.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/nonmono_eeps}\n\\caption{Transitions in stellar physics lead to nonmonotonic {\\ensuremath{\\mathrm{M_{init}}}}-age relations in (at least) two cases. This figure demonstrates two cases where non-monotonicity occurs.  Both panels show the {\\ensuremath{\\mathrm{M_{init}}}}-age relations of three successive EEPs, denoted by different colors; the first and last EEPs (orange and green, respectively, in both panels) exhibit normal, monotonic behavior. The intermediate EEP (blue) exhibits non-monotonic behavior.\n\\emph{Left:} The \ntransition from radiative to convective core on the MS. \\emph{Right:} The transition between degenerate and non-degenerate \nonset of core He-burning \\citep{Girardi2013}. Both panels show a sequence of EEPs during which the nonmonotonic behavior appears.\nThe dashed horizontal lines in each panel indicate isochrone ages for which multiple stars would appear in the same EEP (if allowed to).\n\\label{fig:nonmono}}\n\\end{figure*}\n\nEven with careful choice of primary EEPs ($\\S$\\ref{ss:primary}) \nand distance metric ($\\S$\\ref{ss:metric}), changes in stellar physics can lead to non-monotonic behavior in the {\\ensuremath{\\mathrm{M_{init}}}}-age relation.\nThere are two well-known examples of this: the first is the appearance of the convective core during core H-burning in stars\nmore massive than $1{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$. The second is the transition between the onset of core He-burning under degenerate and non-degenerate conditions\naround 1.8-$2{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ \\citep{Girardi2013}.\\footnote{A third, weaker case is the transition from fully-convective stars to stars with\nradiative cores, which takes place around $0.35{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$. Indeed, there may be other cases but the two referred to in the text are\nthe most pronounced examples.} In both cases, the change in stellar physics leads to a marked difference in stellar \nlifetime that temporarily reverses the trend of decreasing lifetime with increasing {\\ensuremath{\\mathrm{M_{init}}}}.\n\nFigure \\ref{fig:nonmono} gives an example of such non-monotonic behavior towards the end of the MS due to the appearance of a convective\ncore (left panel) and the case presented by \\citet[][right panel]{Girardi2013}. Shown in the left panel are the {\\ensuremath{\\mathrm{M_{init}}}}-age relations for MS EEPs. \nShown in the right panel are {\\ensuremath{\\mathrm{M_{init}}}}-age relations for core He-burning EEPs. In either case, the intermediate EEP is noticeably non-monotonic. \nAn isochrone for a particular range of ages (suggested by the dashed lines in Figure \\ref{fig:nonmono}) will have two {\\ensuremath{\\mathrm{M_{init}}}}\\ values that correspond \nto the same age and the same EEP. Each point plotted in Figure \\ref{fig:nonmono} is taken from one EEP-based track from the dense grid mentioned \nearlier in the paper.  In both cases, even at a resolution of 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ the transition is marked by a discontinuity.\n\nOne way to avoid this problem is to break the non-monotonic {\\ensuremath{\\mathrm{M_{init}}}}-age relation into two monotonic relations and then choose one or the\nother to represent that EEP. This approach is less than ideal because it requires an arbitrary choice to use one and neglect the other.\nAnother approach is to artificially smooth the {\\ensuremath{\\mathrm{M_{init}}}}-age relation before interpolating a new {\\ensuremath{\\mathrm{M_{init}}}}.\n\n\n\\subsection{Embracing non-monotonic behavior in the {\\ensuremath{\\mathrm{M_{init}}}}-age relation}\\label{ss:double}\nThe discussion in $\\S$\\ref{ss:complications} suggests that if we relax the standard mathematical formalism \nfor constructing isochrones described above, then we will be able to study phenomena that we otherwise could not. \nThe most obvious case is that in which the {\\ensuremath{\\mathrm{M_{init}}}}-age relation of a given EEP is non-monotonic due to some transition \nin stellar physics over a small range of {\\ensuremath{\\mathrm{M_{init}}}}.\n\nA simple approach, perhaps the \\emph{simplest} approach, is to allow one EEP to represent as many {\\ensuremath{\\mathrm{M_{init}}}}\\ values as the \n{\\ensuremath{\\mathrm{M_{init}}}}-age relation allows.  In the case of a multi-valued {\\ensuremath{\\mathrm{M_{init}}}}-age relation we simply divide it into as many monotonic intervals \nas are present and proceed as usual. An isochrone constructed in such a manner will have the \\emph{same number of EEPs} but \na \\emph{greater number of $M_{init}$ values} than one constructed in the standard way. Following the example of Figure \\ref{fig:nonmono}, a \nmultivalued isochrone would have 2 {\\ensuremath{\\mathrm{M_{init}}}}\\ values for the non-monotonic EEP shown.\n\nOne challenge with this approach is that the resulting isochrone is itself multi-valued and, therefore, cannot be used in \nthe same way as a canonical isochrone. For example, integrating an initial mass function over a canonical isochrone is \nstraightforward but the same integral over a multi-valued isochrone is not. This alternative approach to isochrone construction\nwill require some changes in the way isochrones are used but is nevertheless a worthwhile avenue to explore.\n\n\n\n\\subsection{Convergence Tests}\\label{ss:convergence}\n\nIt is informative to consider what level of resolution is needed to faithfully reproduce the predictions of the\nunderlying grid of stellar evolution tracks in both the transformation from original tracks to EEPs and from EEPs to\nisochrones. Here we consider both in turn.\n\n\\begin{figure*}\n\\includegraphics[width=0.6\\textwidth]{figs/eepTP.pdf}\n\\caption{Demonstrating the effect of varying the number of secondary EEPs between TP-AGB and PostAGB\non the appearance of the EEP-based track as compared with the original track computed by {\\texttt{{MESA}}}~{\\texttt{{star}}}.\nThe number of secondary EEPs between the 2 primaries is listed in each panel of the figure.\\label{fig:eepTP}}\n\\end{figure*}\n\nThe first is the transformation of stellar evolution tracks to EEP-based tracks as described in $\\S$\\ref{s:eep}.\nThe resolution is entirely controlled by the number of secondary EEPs since the number of primary EEP is fixed (and few).\nThe most important consideration in setting the number of secondary EEPs between any given pair of primary \nEEPs is that the secondaries properly reproduce the morphology of the original tracks. \nIn practice, from 50 to 200 secondary EEPs between any pair of primary EEPs should be sufficient to cover smooth phases\nof stellar evolution. Here smooth is loosely defined as lacking large derivatives and/or oscillatory behavior of the \nquantities of interest. The worst case is the TP-AGB where the luminosity varies repeatedly by an order of\nmagnitude or so. To fully resolve the TP-AGB phase in isochrones requires upwards of 500 secondary EEPs between the \nTP-AGB and PostAGB primaries (Conroy et al., {\\it Nature}, in press). Consider the example given in Figure \\ref{fig:eepTP}\nwhere the luminosity evolution of the original stellar evolution track through one TP is overplotted with a sequence of \nEEP-based tracks for which the number of secondary EEPs ranges from 600 to 18. Without any sort of time-average through\nthe TP-AGB phase, the eep-based tracks with fewer than 100 EEPs show considerable variations from the original track\nand deviate by more than 5\\% in the integrated luminosity compared to the original track.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/iso_convergence}\n\\caption{The difference in mass at the RGBTip for isochrones constructed from grids with constant mass spacing shown on the x-axis.\nThe difference is taken with respect to a fiducial grid with mass spacing of 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ and the difference is given as an absolute value.\nDifferent ages are shown as different colors; the youngest ages are noisier than the others.\nThe dotted line shows the square of the mass spacing, which is a decent approximation for the mass difference.\\label{fig:iso_conv}}\n\\end{figure*}\n\nThe number of stellar evolution tracks and the {\\ensuremath{\\mathrm{M_{init}}}}\\ spacing is an important consideration in isochrone construction. The following is\na convergence test in which the {\\ensuremath{\\mathrm{M_{init}}}}\\ value reported in isochrones of various grid spacings are compared with a fiducial grid.\nThe {\\ensuremath{\\mathrm{M_{init}}}}\\ value is the result of the {\\ensuremath{\\mathrm{M_{init}}}}-age interpolation and, therefore, its value is fundamental in the isochrone construction process.\nThe fiducial grid of tracks with constant mass-spacing of 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}, mentioned previously, is sampled at successively larger intervals \nof 0.002, 0.005, 0.01, 0.02, 0.05, and 0.1 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}. Isochrones with ages between 1 and 10 Gyr are constructed from each of these \ngrids and the RGBTip mass is extracted from each isochrone. For a given age, the RGBTip mass from the fiducial grid is compared with the\neach of the coarser grids. The absolute mass difference between the fiducial grid and each of the other grids is shown, for a variety of \nages, in Figure \\ref{fig:iso_conv}. The dotted line indicates that the mass difference scales roughly as the square of the {\\ensuremath{\\mathrm{M_{init}}}}\\ spacing.\nFor example, if we require masses that are reliable at the level of 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}, then a grid with mass spacing of $\\sim0.02$ {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ should \nbe sufficient.\nWhether or not such deviations matter will depend on the application, of course, but it is worthwhile to be able to quantify these effects.\n\nUltimately, both the total number of EEPs and the {\\ensuremath{\\mathrm{M_{init}}}}-spacing of the stellar evolution grid should be determined based on the goals\nand tolerances to which they will be applied. As a starting place we recommend {\\ensuremath{\\mathrm{M_{init}}}}-spacing of 0.02 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ (at least for low-mass stars)\nand 1500-2000 EEPs to cover all the phases of evolution considered in $\\S$\\ref{ss:primary}.\n\n\n\\section{Conclusions}\\label{s:conculsions}\nA method of transforming a grid of stellar evolution models into isochrones is described in detail. The process is done in two steps.\nThe first takes the original stellar evolution tracks and converts them onto a uniform basis, suitable for interpolation, called EEPs.\nEEPs are divided into two categories: primary, which are physically-defined, and secondary, which divide the interval between two\nprimary EEPs into a number of equally-spaced points. `Equally-spaced' requires the definition of a metric function that defines a `distance'\nalong each stellar evolution track. \n\nThe second interpolates within the grid of EEP-based tracks to create both new tracks with different {\\ensuremath{\\mathrm{M_{init}}}}\\ as well as isochrones.\nThe interpolation requires construction of a relation between {\\ensuremath{\\mathrm{M_{init}}}}\\ and age for each EEP. Generally the {\\ensuremath{\\mathrm{M_{init}}}}-age relation is monotonic\nbut in some circumstances (two, in particular) a transition in stellar physics causes the {\\ensuremath{\\mathrm{M_{init}}}}-age relation to be non-monotonic. \nNon-monotonicity can be dealt with in at least two different ways, which are discussed in the text.\n\nFinally, the extent to which EEP-based tracks and isochrones represent the information in the original grid of stellar evolution tracks is\nexplored and suggestions for achieving a level of accuracy provided.\n\n\n\\acknowledgments\nThe author is supported by the Australian Research Council under grant FL110100012.\nThis paper could not have been written without invaluable contributions from Jieun Choi and Charlie \nConroy, who provided: many comments on the manuscript, the evolutionary tracks, \nextensive testing of the codes, inspiration, and additional support. Many thanks to Bill Paxton \nand the {\\texttt{{MESA}}}\\ community for making {\\texttt{{MESA}}}\\ the wonderful resource that it is.\nThe isochrone construction process described herein has benefited from discussions with Peter \nBergbusch, Brian Chaboyer, and Don VandenBerg. Finally, thanks to the anonymous referee for \nproviding useful suggestions that improved the clarity of the paper.\n\n\\clearpage\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Baraffe} {et~al.}(1997){Baraffe}, {Chabrier}, {Allard}, \\&\n  {Hauschildt}}]{Baraffe1997}\n{Baraffe}, I., {Chabrier}, G., {Allard}, F., \\& {Hauschildt}, P.~H. 1997, \\aap,\n  327, 1054\n\n\\bibitem[{{Baraffe} {et~al.}(1998){Baraffe}, {Chabrier}, {Allard}, \\&\n  {Hauschildt}}]{Baraffe1998}\n---. 1998, \\aap, 337, 403\n\n\\bibitem[{{Bergbusch} \\& {VandenBerg}(1992)}]{Bergbusch1992}\n{Bergbusch}, P.~A., \\& {VandenBerg}, D.~A. 1992, \\apjs, 81, 163\n\n\\bibitem[{{Bergbusch} \\& {VandenBerg}(2001)}]{Bergbusch2001}\n---. 2001, \\apj, 556, 322\n\n\\bibitem[{{Bressan} {et~al.}(2012){Bressan}, {Marigo}, {Girardi}, {Salasnich},\n  {Dal Cero}, {Rubele}, \\& {Nanni}}]{Bressan2012}\n{Bressan}, A., {Marigo}, P., {Girardi}, L., {et~al.} 2012, \\mnras, 427, 127\n\n\\bibitem[{{Dotter} {et~al.}(2008){Dotter}, {Chaboyer}, {Jevremovi{\\'c}},\n  {Kostov}, {Baron}, \\& {Ferguson}}]{Dotter2008}\n{Dotter}, A., {Chaboyer}, B., {Jevremovi{\\'c}}, D., {et~al.} 2008, \\apjs, 178,\n  89\n\n\\bibitem[{{Girardi} {et~al.}(2013){Girardi}, {Marigo}, {Bressan}, \\&\n  {Rosenfield}}]{Girardi2013}\n{Girardi}, L., {Marigo}, P., {Bressan}, A., \\& {Rosenfield}, P. 2013, \\apj,\n  777, 142\n\n\\bibitem[{{Paxton} {et~al.}(2011){Paxton}, {Bildsten}, {Dotter}, {Herwig},\n  {Lesaffre}, \\& {Timmes}}]{Paxton2011}\n{Paxton}, B., {Bildsten}, L., {Dotter}, A., {et~al.} 2011, \\apjs, 192, 3\n\n\\bibitem[{{Paxton} {et~al.}(2013){Paxton}, {Cantiello}, {Arras}, {Bildsten},\n  {Brown}, {Dotter}, {Mankovich}, {Montgomery}, {Stello}, {Timmes}, \\&\n  {Townsend}}]{Paxton2013}\n{Paxton}, B., {Cantiello}, M., {Arras}, P., {et~al.} 2013, ArXiv e-prints,\n  arXiv:1301.0319\n\n\\bibitem[{{Paxton} {et~al.}(2015){Paxton}, {Marchant}, {Schwab}, {Bauer},\n  {Bildsten}, {Cantiello}, {Dessart}, {Farmer}, {Hu}, {Langer}, {Townsend},\n  {Townsley}, \\& {Timmes}}]{Paxton2015}\n{Paxton}, B., {Marchant}, P., {Schwab}, J., {et~al.} 2015, ArXiv e-prints,\n  arXiv:1506.03146\n\n\\bibitem[{{Pietrinferni} {et~al.}(2004){Pietrinferni}, {Cassisi}, {Salaris}, \\&\n  {Castelli}}]{Pietrinferni2004}\n{Pietrinferni}, A., {Cassisi}, S., {Salaris}, M., \\& {Castelli}, F. 2004, \\apj,\n  612, 168\n\n\\bibitem[{{Simpson} {et~al.}(1970){Simpson}, {Hills}, {Hoffman}, {Kellman},\n  {Morton}, {Paresce}, \\& {Peterson}}]{Simpson1970}\n{Simpson}, E., {Hills}, R.~E., {Hoffman}, W., {et~al.} 1970, \\apj, 159, 895\n\n\\bibitem[{{Steffen}(1990)}]{steffen_1990_aa}\n{Steffen}, M. 1990, \\aap, 239, 443\n\n\\bibitem[{{Tognelli} {et~al.}(2011){Tognelli}, {Prada Moroni}, \\&\n  {Degl'Innocenti}}]{Tognelli2011}\n{Tognelli}, E., {Prada Moroni}, P.~G., \\& {Degl'Innocenti}, S. 2011, \\aap, 533,\n  A109\n\n\\bibitem[{{VandenBerg} {et~al.}(2012){VandenBerg}, {Bergbusch}, {Dotter},\n  {Ferguson}, {Michaud}, {Richer}, \\& {Proffitt}}]{VandenBerg2012}\n{VandenBerg}, D.~A., {Bergbusch}, P.~A., {Dotter}, A., {et~al.} 2012, \\apj,\n  755, 15\n\n\\bibitem[{{VandenBerg} {et~al.}(2006){VandenBerg}, {Bergbusch}, \\&\n  {Dowler}}]{VandenBerg2006}\n{VandenBerg}, D.~A., {Bergbusch}, P.~A., \\& {Dowler}, P.~D. 2006, \\apjs, 162,\n  375\n\n\\bibitem[{{Yi} {et~al.}(2001){Yi}, {Demarque}, {Kim}, {Lee}, {Ree}, {Lejeune},\n  \\& {Barnes}}]{Yi2001}\n{Yi}, S., {Demarque}, P., {Kim}, Y.-C., {et~al.} 2001, \\apjs, 136, 417\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 27027, "prevtext": "\n\\title{{\\texttt{{MESA}}}\\ Isochrones and Stellar Tracks (MIST) 0:\\\\ Methods for the construction of stellar isochrones}\n\n\\shorttitle{Isochrone construction}\n\\shortauthors{A.\\ Dotter}\n\n\\author{Aaron Dotter} \n\\affil{Research School of Astronomy and Astrophysics\\\\ Australian National University\\\\\n  Canberra, ACT\\\\ Australia}\n\\email{aaron.dotter@gmail.com} \n\n\\begin{abstract}\nI describe a method to transform a set of stellar evolution tracks onto a uniform basis and then interpolate within \nthat basis to construct stellar isochrones. The method accommodate a broad range of stellar types, from substellar \nobjects to high-mass stars, and phases of evolution, from the pre-main sequence to the white dwarf cooling sequence. \nI discuss situations in which stellar physics leads to departures from the otherwise monotonic relation between initial\nstellar mass and lifetime and how these may be dealt with in isochrone construction. I close with convergence tests\nand recommendations for the number of points in the uniform basis and the mass between tracks in the original grid\nrequired in order to achieve a certain level accuracy in the resulting isochrones. The programs that implement these \nmethods are free and open-source; they may be obtained from the project webpage.\\footnote{\\url{https://github.com/dotbot2000/iso}}\n\\end{abstract}\n\n\\keywords{methods: numerical --- stars: evolution}\n\n\n\\section{Introduction}\\label{s:intro}\n\nTo borrow a line from the poet John Godfrey Saxe, isochrones, like sausages, cease to inspire respect in proportion as we know how they are made.\nNevertheless, the intent of this paper is to explain one method of isochrone construction and show the results of the codes that implement the method.\n\nA stellar evolution code produces output at fixed points in time---timesteps---that allow one to follow the evolution of a model \nstar over some portion of its lifetime. Timesteps are chosen to meet various numerical tolerances and may vary by orders of \nmagnitude over the span of the evolutionary sequence. The resulting data per timestep constitutes a stellar evolution track, which is\na fundamental tool in the study of stellar evolution. The primary input parameters of a stellar evolution track are its \ninitial mass ({\\ensuremath{\\mathrm{M_{init}}}}) and chemical composition but there are a host of other details relating to the physics and numerics assumed in any model.\n\nAn isochrone is another, complimentary tool that is useful when the properties of a stellar population---rather than a single star---are of interest. \nAn isochrone is derived from a set of stellar evolution tracks spanning a range of {\\ensuremath{\\mathrm{M_{init}}}}\\ but with the same initial chemical\ncomposition. The underlying assumption in the creation of an isochrone is that all stars are formed simultaneously from a \nhomogeneous gas cloud. (Whether or not these assumptions are ever \\emph{actually} met is beyond the scope of this paper.) \nThe goal of isochrone construction is to change the independent variable from {\\ensuremath{\\mathrm{M_{init}}}}\\ in the set of stellar evolution tracks to time in the isochrones, as illustrated in Figure \\ref{fig:mass-age}.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/MassAge}\n\\caption{Schematic view of stellar evolution tracks and isochrones in the {\\ensuremath{\\mathrm{M_{init}}}}-age plane. The diagonal lines and corresponding labels mark\nthe positions of evolutionary phases up to and including the main sequence. The gray shaded region shows all post-main sequence evolution.}\n\\label{fig:mass-age}\n\\end{figure*}\n\nA representation of stellar evolution tracks and isochrones in the same plane is shown in Figure \\ref{fig:mass-age}. \nThe isochrones (horizontal lines) have been generated from the tracks (vertical lines) using the methods described in this\npaper. It should be noted, however, that the isochrones were generated from a denser grid of tracks than is\nshown here for clarity. The thin lines running diagonally through Figure \\ref{fig:mass-age} identify three different phases\nof stellar evolution (see $\\S$\\ref{ss:secondary}): the pre-main sequence (`Pre-MS'), the zero age main sequence (`ZAMS'),\nand the terminal age main sequence (`TAMS'). The shaded region above the TAMS line indicates the post-MS evolution.\n\nThe process of isochrone construction is trivial if the stellar models all have lifetimes far exceeding the desired isochrone age. \nIn this case, all that is required is a simple interpolation within each stellar evolution track to the desired age. \nThis is evident in Figure \\ref{fig:mass-age} where multiple tracks intersect with a given isochrone before and during the main sequence (MS).\nAn example of such are the Lyon models of very-low-mass stars \\citep{Baraffe1997,Baraffe1998}. \nThe problem becomes much harder when we wish to capture the late phases of stellar evolution. Referring again to Figure \\ref{fig:mass-age}, \nthe entirety of the post-MS may lie between two stellar tracks in the model grid, see the gray shaded region in the figure. In this case, we\nencounter a situation in which neighboring stellar evolution tracks in the model grid are in completely different phases of evolution \nand a sophisticated approach is required to construct isochrones that faithfully reproduce the morphology of the tracks. Many of the isochrone \nlibraries in use today, such as BaSTI \\citep{Pietrinferni2004}, Dartmouth \\citep{Dotter2008},\nPARSEC \\citep{Bressan2012}, Pisa \\citep{Tognelli2011}, Victoria-Regina \\citep{VandenBerg2006}, and Yale-Yonsei \\citep{Yi2001}, are based \non the more-sophisticated approach, one implementation of which is described in the following sections. \nThe literature describing isochrone construction is sparse considering their widespread use in astrophysics; the most notable example is \nthe work of P.\\ Bergbusch and D.\\ VandenBerg \\citep{Bergbusch1992,Bergbusch2001,VandenBerg2006,VandenBerg2012}.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/naive}\n\\caption{The filled circles show the points at which a grid of stellar evolution tracks reach 10 Gyr. The difference in {\\ensuremath{\\mathrm{M_{init}}}}\\ between each \nsuccessive point is 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}. The green line shows the simple approach to isochrone construction in which a given age is located in each \ntrack and then these points are connected by line segments. The gray line shows an isochrone made using the sophisticated approach described \nin this paper.\\label{fig:naive}}\n\\end{figure*}\n\nA common question: Isn't it possible to make isochrones from a sufficiently-finely-sampled grid of stellar evolution tracks?  Then isochrone construction \nrequires a trivial interpolation to `connect the dots' for a given age. The short answer is that such an approach is both inefficient and inelegant. \nInefficient because the number of tracks required is orders of magnitude greater than is typically seen ($10^4$-$10^5$ compared to hundreds).\nInelegant because there is a great deal of similarity between two stellar evolution tracks with comparable {\\ensuremath{\\mathrm{M_{init}}}}; a sophisticated approach to isochrone \nconstruction will exploit the similarity.\nAn example is provided in Figure \\ref{fig:naive} where isochrones were constructed using this simple approach as well as the more-sophisticated \napproach described later in this paper from a grid of stellar evolution tracks with mass sampling $\\Delta$M=0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ between 0.85 and 2.15 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ \n(1301 tracks in total).\\footnote{This mass sampling is much finer than is typically found in stellar evolution libraries, where 0.05 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}\\ sampling is \ntypical for this range of stellar masses.} The stellar evolution tracks in this grid were evolved to the white dwarf cooling sequence (WDCS) and \nthe isochrones show the full range of evolution in the tracks.\n\nThe agreement between the simple and the sophisticated in Figure \\ref{fig:naive} is decent along the main sequence but begins to break down on \nthe red giant branch (RGB). The simple approach skips from a point on the RGB to the core He-burning phase, bypassing the upper RGB, and then\nfrom core He-burning to near the bottom of the WDCS. Put another away, the difference in {\\ensuremath{\\mathrm{M_{init}}}}\\ between the early AGB and the WDCS is only 0.001 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}!\nYet this interval covers a great deal of distance in the H-R diagram and includes the brightest stars in the isochrone. \n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/iso_tracks}\n\\caption{A 13 Gyr isochrone and three stellar evolution tracks with ${\\ensuremath{\\mathrm{M_{init}}}} = 0.90, 0.95, 1.00~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$.\nThe left panel shows the entire span of a 13 Gyr isochrone (black) and the $1~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track (green). The 0.90 (red) and $0.95~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ (blue)\ntracks are only plotted from the pre-main sequence to the end of the RGB phase for clarity. The right panel focuses on the main sequence, subgiant \nbranch, and red giant branch. The isochrone is plotted as a solid line for all points that satisfy $M_{init} < 0.95~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ and as a dashed line \nelsewhere. Finally, the point at which each track has an age of 13 Gyr is shown as a filled circle; for the $1~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track this point is only \nvisible in the left panel.}\n\\label{fig:iso-tracks}\n\\end{figure*}\n\nAs a more in-depth example, consider that we wish to construct a 13 Gyr isochrone from a set of stellar evolution tracks with a mass \ninterval of $0.05~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ as visualized in Figure \\ref{fig:iso-tracks}. The $1.0~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track has a MS lifetime of 10 Gyr and a total \nlifetime of 14 Gyr. The $0.95~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track has a MS lifetime of 12.3 Gyr and a total lifetime of 16.5 Gyr. The $0.90~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track has \na MS lifetime of 15.1 Gyr and a total lifetime of 20 Gyr. At 13 Gyr the $0.9~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ model is still on the MS, the $0.95~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ \nmodel is a subgiant, and the $1~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ model is on the WDCS. The simple approach of locating the \npoint at which each track has an age of 13 Gyr and `connecting the dots' will result in an isochrone that jumps directly from the\nMS to the WDCS, skipping over all the intervening evolutionary phases. If instead we use the approach outlined in the following sections,\nthen we obtain the isochrone shown in Figure \\ref{fig:iso-tracks}, which faithfully reproduces all of the evolutionary phases. The isochrone shown \nin Figure \\ref{fig:iso-tracks} closely follows the $1 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ track from the red giant branch through to the end because the later phases \nare relatively short-lived.\n\nThe stellar evolution tracks used throughout this paper are taken from {\\texttt{{MESA}}}\\ Isochrones and Stellar Tracks (MIST; Choi et al., ApJS, submitted) \nand were computed with the stellar evolution code {\\texttt{{MESA}}}~{\\texttt{{star}}}, part of the {\\texttt{{MESA}}}\\ code \nlibrary \\citep{Paxton2011,Paxton2013,Paxton2015}.\\footnote{\\url{http://mesa.sourceforge.net}}\nThe programs that implement the methods described in the following sections are written in Fortran and use {\\texttt{{MESA}}}\\ modules, primarily for \ninterpolation. Although originally designed to ingest {\\texttt{{MESA}}}~{\\texttt{{star}}}\\ history files, it is certainly possible to incorporate tracks \nfrom other stellar evolution codes. It is only a matter of loading the tracks into the data structures used in the codes.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/03M_track_eeps}\n\\caption{A $0.3~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ stellar evolution track in the H-R diagram (right) and the {\\ensuremath{T_{\\mathrm{\\!c}}}}-{\\ensuremath{\\rho_{\\mathrm{c}}}}\\ diagram (left).\nThe original track is shown as the solid line. The primary EEPs described in \n$\\S$\\ref{ss:primary} are labeled and marked by large dots; secondary EEPs described in $\\S$\\ref{ss:secondary} are shown as small dots along the track.\\label{fig:03M}}\n\\end{figure*}\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/1M_track_eeps}\n\\caption{Equivalent to Figure \\ref{fig:03M} for a $1~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ stellar evolution track.\\label{fig:1M}}\n\\end{figure*}\n\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/5M_track_eeps}\n\\caption{Equivalent to Figure \\ref{fig:1M} for a $5~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ model. Not all primary EEPs are shown in both panels.\\label{fig:5M}}\n\\end{figure*}\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{figs/20M_track_eeps}\n\\caption{Equivalent to Figure \\ref{fig:1M} for a $20~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ model. Not all primary EEPs are shown in both panels. \nNote that in the {\\ensuremath{T_{\\mathrm{\\!c}}}}-{\\ensuremath{\\rho_{\\mathrm{c}}}}\\ plane two pairs of primary EEPs are nearly coincident: ZAMS and IAMS; RGBTip and ZACHeB.  The RGBTip primary EEP does not have the same significance in such high-mass stars but is maintained for consistency, as noted in the text.\\label{fig:20M}}\n\\end{figure*}\n\nInterpolation plays a key role in isochrone construction.  It is therefore worthwhile \nto describe the key features of the interpolation method used throughout the following sections. A cubic \ninterpolation scheme provides a good balance between smoothness, including continuous first derivatives, \nand a reasonably small number of neighboring points required to construct the interpolating function. \nOne important consideration is that the interpolation method preserve monotonicity throughout \nthe interpolation interval. This is particularly important in isochrone construction because the standard procedure\nhinges on a monotonic relation between {\\ensuremath{\\mathrm{M_{init}}}}\\ and age.\nThe piecewise-monotonic cubic interpolation method of \\citet{steffen_1990_aa}, as implemented in \nthe {\\texttt{{MESA}}}\\ {\\texttt{{interp\\_1d}}}\\ module, meets both of these criteria and is used by default in these codes.  \nAll references to interpolation throughout the remainder of this paper refer to the \\citet{steffen_1990_aa} method.\n\nUnits in this paper are generally cgs, except as explicitly noted, and ages are always given in years.\nThe following sections present the theory and relevant details of how the codes are implemented;\na practical guide to using the programs is distributed along with the codes themselves.\n\n\n\\section{Identifying equivalent evolutionary phases}\\label{s:eep}\nThe complexities of stellar structure and evolution imply that stellar evolution tracks spanning a\nrange of {\\ensuremath{\\mathrm{M_{init}}}}\\ are likely to have (perhaps vastly) different lifetimes and numbers of timesteps. \nThe model stars may experience entirely different evolutionary phases. This situation is far from ideal \nif the goal is to interpolate amongst the tracks to construct isochrones.\n\nThe task of interpolating amongst a set of stellar evolution tracks can be greatly simplified by \ntransforming the original tracks, as output by the stellar evolution code, onto a uniform basis. \nThe uniform basis is designed in such a way that each phase of stellar evolution\nis represented by a fixed number of points and that the $n$th point in one track has a comparable interpretation in another track.\nThis is accomplished by introducing the concept of \\emph{equivalent evolutionary phases} (EEPs),\na series of points that can be identified in all stellar evolution tracks.\\footnote{A description of isochrone construction using central H mass fraction as a time analog by \\citet{Simpson1970} is, to my knowledge, the earliest discussion in the literature of something like the EEP formalism. \n}\nEEPs serve as the uniform basis to describe the evolution of all stars and are divided into two categories.\n\\emph{Primary} EEPs identify a relatively small number of physically-motivated phases in the tracks.\n\\emph{Secondary} EEPs provide a uniform spacing between the primary EEPs in each track.\n\n\\begin{figure*}\n\\includegraphics[width=0.8\\textwidth]{figs/eep_tracks.pdf}\n\\caption{This figure shows how the primary and secondary EEPs are distributed along three stellar evolution tracks\nwith {\\ensuremath{\\mathrm{M_{init}}}} = 0.95, 1, and $1.05~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$.  The original tracks are plotted as solid lines; the secondary EEPs are shown as\nsmall dots and the primary EEPs are shown as large dots. This should give some indication that the EEP-based tracks \nconstitute a uniform basis.\\label{fig:eep_track}}\n\\end{figure*}\n\n\n\\subsection{Primary EEPs}\\label{ss:primary}\n\\emph{Primary} EEPs are explicitly defined for each track and have the same physical \ninterpretation across different tracks. However, since the goal of the codes described here is\nto be applicable to all stars, there is one branch point (see EEP 8 in the list below). The\ndistinction between low- and intermediate-mass stars on one hand and high-mass stars on the other\nis determined by whether or not the central temperature of the model at the end of its evolutionary \ntrack is less than the central temperature after the end of core He-burning. The ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ criterion is an \nindication of whether the models star will evolve to a cooling WD (in which case ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ is lower at the end)\nor proceed on to later stages of nuclear burning (in which case ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ is higher at the end). Furthermore, \nsubstellar objects, for which substantial nuclear burning does not occur, are treated differently. \n\nThis section lists all of the primary EEPs and explains how each is defined.\nIn what follows $X$ and $Y$ refer to the mass fractions of H and He, respectively, and subscript $c$ \ndenotes the property at the center of the star. For example, $X_c$ is the central H mass fraction.\nExamples of 0.3, 1, 5, and $20~{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$ stellar tracks with primary EEPs identified are shown in \nFigures \\ref{fig:03M}, \\ref{fig:1M}, \\ref{fig:5M}, and \\ref{fig:20M}, respectively. Note that the number of EEPs\nshown in Figures \\ref{fig:03M}-\\ref{fig:20M} has been reduced by a factor of 10 from the recommended numbers\nso that the individual EEPs may be clearly seen.\n\n\\begin{itemize}\n\\item[1.] The pre-MS EEP (PreMS) is chosen to identify the point at which the central \ntemperature (${\\ensuremath{T_{\\mathrm{\\!c}}}}$) rises above a certain value (lower than necessary for sustained nuclear reactions). \nBy default this is set at $\\log({\\ensuremath{T_{\\mathrm{\\!c}}}})=5.0$ but may be set to a different value. \nIt is recommended that the pre-MS point be chosen as early as possible.\nIf the first point in the stellar evolution track is already above this threshold, \nwe simply use the first point. It is implicitly assumed that even substellar objects, nominally\n$M \\la 0.08 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$, will meet the PreMS ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ condition.\n\n\\item[2.] The zero-age main sequence (ZAMS) EEP is taken as the first point after the H-burning \nluminosity exceeds 99.9\\% of the total luminosity \\emph{and} before the central H mass fraction \nhas fallen by below its initial value by 0.0015. In the substellar case where neither of these \ncriteria is met, the ZAMS point is taken as the maximum in ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ along the evolutionary track.\n\n\\item[3.-4.] Towards the end of core H-burning 2 primary EEPs are defined at $X_c=0.3$ (intermediate \nage main sequence: IAMS) and $X_c=10^{-12}$ (terminal age main sequence: TAMS). Two points are used \nto isolate the portion of the MS that may or may not be influenced by the presence of a \nconvective core. The practical choice of placing two primary EEPs near the end of the MS \ngreatly simplifies the treatment of the `convective hook' feature in the H-R diagram. In the substellar\ncase, for which no central H is consumed, the final point in the track is chosen as the TAMS provided\nthat the age at that point is greater than some minimum (e.g., 20 Gyr).\n\n\\item[5.] The RGB tip (RGBTip) EEP identifies the point at which the stellar luminosity reaches a maximum---or \nthe stellar ${\\ensuremath{T_{\\!\\mathrm{eff}}}}$ reaches a minimum---after core H burning is complete but before core He burning has progressed \nsignificantly. This EEP has a recognizable location on the H-R diagram of low- and intermediate mass stars, hence \nthe name, but the point defined here can also be located in high-mass stellar tracks that do not go through a `red giant' phase.\nThis is achieved by taking the point at which the luminosity reaches a maximum or the ${\\ensuremath{T_{\\!\\mathrm{eff}}}}$ reaches a minimum, \nwhichever comes first, before the center He mass fraction ($Y_c$) is significantly reduced by He burning: $Y_c \\ge Y_{c,TAMS}-0.01$.\n\n\\item[6.] The zero age core He burning (ZACHeB) EEP denotes the onset of sustained core He burning.\nThe point is identified as the ${\\ensuremath{T_{\\mathrm{\\!c}}}}$ minimum that occurs after the onset of \nHe-burning (RGBTip) while $Y_c > Y_{c,RGBTip}-0.03$. This temperature minimum \nis readily identifiable in lower-mass stars (${\\ensuremath{\\mathrm{M_{init}}}} < 2 {\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$) because the {\\ensuremath{T_{\\mathrm{\\!c}}}}-{\\ensuremath{\\rho_{\\mathrm{c}}}}\\ evolution \nin this interval has a particular shape due to the off-center ignition of He burning under degenerate\nconditions \\citep{Paxton2011}. The same feature is less obvious in higher-mass stars with \nnon-degenerate cores but still identifiable.\n\n\\item[7.] One primary EEP is identified at the end of core He burning (terminal age core He burning: \nTACHeB) corresponding $Y_c=10^{-4}$.\n\n\\item[8a.] The EEP marking the onset of the thermally-pulsing AGB (TP-AGB) is identified as the point \nafter core He burning ($Y_c < 10^{-6}$) when the difference in mass between the H-burning and He-burning \nshell is less than $0.1{\\ensuremath{{\\ensuremath{\\mathrm{{M}}}}_\\odot}}$. This is the same criterion used in {\\texttt{{MESA}}}~{\\texttt{{star}}}\\ to identify the onset of thermal pulsations. \n\n\\item[8b.] For stellar models that are massive enough to bypass the TP-AGB and proceed to later\nphases of core burning, the final EEP is set at the end of core C burning (CBurn), when the central C\nmass fraction falls below $10^{-4}$. This marks the end of the primary EEPs for massive stars. The \nremaining primary EEPs are only applicable to low- and intermediate-mass stars.\n\n\\item[9.] A post-AGB (PostAGB) EEP is identified only in stellar models that will go on to form a WD. \nIt is meant to locate the point at which the TP-AGB phase has ended and the star\nhas begun to cross the H-R diagram at nearly constant luminosity. The PostAGB EEP is defined as \nthe point at which the H-rich stellar envelope falls below 20\\% of the current stellar mass.\n\n\\item[10.] The WDCS EEP, which follows the Post-AGB, is based on the central value of the Coulomb \ncoupling parameter $\\Gamma$, with a default upper limit of 100. WDCS is only considered for models \nthat have a PostAGB EEP.\n\\end{itemize}\n\nThe code processes each primary EEP in order using the location of the previous EEP as starting point \nand searching for the conditions needed to identify the next EEP through to the end of the track.\nThe process ends either when the full list of primary EEPs have been identified or at the first \nfailure to identify a primary EEP. The list presented above is the complete list of primary EEPs\nin the code.  However, it is not necessary to use all of them.  For example, one could skip the PreMS\nprimary EEP for a grid of stellar evolution tracks that begin from the ZAMS.\n\n\n\\subsection{Secondary EEPs}\\label{ss:secondary}\n\\emph{Secondary} EEPs serve the purpose of faithfully capturing the morphology of each segment\nof the evolutionary track that lies between two adjacent primary EEPs. After the primary EEPs have \nbeen identified, each segment is populated with a number of equally-spaced secondary EEPs. \nIn order to construct a uniform basis of EEP-based tracks for interpolation, the number of secondary \nEEPs between a given pair of primary EEPs is held constant over the set of stellar evolution tracks.\nFigures \\ref{fig:03M} through \\ref{fig:20M} show both primary (as larger dots) and secondary\nEEPs (as smaller dots). Furthermore, Figure \\ref{fig:eep_track} shows 3 neighboring tracks from a\nmodel grid with the primary and secondary EEPs shown; in this case it is easy to see how the EEPs in\none track correspond to those in each of the others and, thus, form a suitable basis for interpolation.\n\nOnce the primary EEPs have been identified the stellar evolution track is ready to be converted\nfrom its original form to the new form consisting only of EEPs. The new, EEP-based track consists\nof all the primary EEPs that were identified in the original track plus a larger number of secondary\nEEPs. Using a metric function calculated along the original \ntrack ($\\S$\\ref{ss:metric}), each interval between 2 primary EEPs is divided into a fixed number of \nequally-spaced secondary EEPs; the information to be included in the EEP-based track is interpolated \nfrom the original track onto to the secondary EEPs. Processing stellar evolution tracks in this way results \nin a reduction in the size of the evolutionary tracks by a factor of $\\sim$10 without significant loss \nof information for a suitable number of secondary EEPs (see $\\S$\\ref{ss:convergence}).\n\n\n\\subsection{The metric function}\\label{ss:metric}\nFor the secondary EEPs to be `equally-spaced' we must define a metric along the evolutionary track. \nThe only (mathematical) constraint on the metric is that it must be positive definite. Traditionally \nthe metric has been defined as a Euclidean distance along the stellar evolution track in the \nHertzsprung-Russell (H-R) diagram. However, it can be useful to include an age term with appropriate weight\n\\citep[see the discussion in $\\S$4 of][]{VandenBerg2012}. The terms are weighted (stretched) such that the logarithmic \nranges spanned by a stellar evolution track in luminosity and {\\ensuremath{T_{\\!\\mathrm{eff}}}}\\ contribute to the metric\ndistance in roughly equal amounts. Additional terms, with arbitrary weights, may be added as the user wishes. \nThe metric distance $D$ along the track is defined such that $D_0=0$ and the distance between any two points \n$i$ and $i+1$ in the original evolutionary track are given by\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:metric}\nD_{i+1} = D_i + \\sqrt{ \\sum\\limits_{j=1}^N w_j (x_{j,i+1} - x_{j,i})^2 }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"D_{i+1}=D_{i}+\\sqrt{\\sum\\limits_{j=1}^{N}w_{j}(x_{j,i+1}-x_{j,i})^{2}}.\" display=\"block\"><mrow><mrow><msub><mi>D</mi><mrow><mi>i</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>=</mo><mrow><msub><mi>D</mi><mi>i</mi></msub><mo>+</mo><msqrt><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>j</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>w</mi><mi>j</mi></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>x</mi><mrow><mi>j</mi><mo>,</mo><mrow><mi>i</mi><mo>+</mo><mn>1</mn></mrow></mrow></msub><mo>-</mo><msub><mi>x</mi><mrow><mi>j</mi><mo>,</mo><mi>i</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></msqrt></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]