[{"file": "1601.07144.tex", "nexttext": "\n\nThe tumor cells and the host healthy cells grow logistically with growth rates and carrying capacities $r_{1}, K_{1}$ and $r_{2}, K_{2}$, respectively. The terms $a_{12}$ and $a_{21}$ model the competition for nutrients and space among tumor and healthy cells. A term representing the fractional cell kill of tumor cells by CTLs is given by $K(E,T)$, which constitutes the main topic of the present work. Here the parameter $\\sigma$ incorporates a constant input of lymphocytes into the tissue where the tumor develops, but it can be related to a background of NK cells as well \\citep{validpilis}. The inactivation of the effector cells and their migration from the tumor area is given by the term $d_{3}E$, whereas the parameters $g,h$ stand for the multiplication of effector cells due to tumor stimulation as well as the recruitment mediated by cytokines, such us IFN-$\\gamma$ or TNF-$\\alpha$, after the tumor and the immune cells interact. Finally, the competition between the tumor and the T cells for resources is given by $a_{31}$. These differential equations are solved using a fourth order Runge-Kutta integrator.\n\nThis continuous model has been validated \\citep{validbul} using experiments from \\cite{nkg2d} and the parameter values are listed in Table~\\ref{tab:1}. In the present work only those parameters appearing in the fractional cell kill law ($d$, $\\lambda$ and $s$) are inspected. Accordingly to the CA model, we have set $\\sigma=0$ in the ODE model since the CA does not include a constant input of effector cells. We have also selected a value $g=0.15$, which is very close to one of the values appearing in Table~\\ref{tab:1}. Importantly the CA model and the ODE model include the same type of processes. The logistic growth of tumor cells in the CA model arises as a consequence of competition for nutrients \\citep{ferreira}. There is also competition among healthy cells and tumor cells for nutrients, which in the ODE model is represented by the competing Lotka-Volterra terms between healthy and tumor cells. T cell lysis, inactivation and recruitment are also present in both models. Only the competition term between tumor and immune cells $a_{31}$ is different. Although we keep this parameter as shown in Table~\\ref{tab:1}, if desired, it can be made equal to zero. As far as we have investigated, reducing the value of this parameter produces no appreciable consequences in our study. Notwithstanding this correspondence, we recall that during the second step of our CA simulations, the tumor dynamics is freezed. Accordingly, the parameter $r_{1}$ should be made equal to zero. Again, we keep this parameter as shown in Table~\\ref{tab:1}. Reducing the value of this parameter produces no significant consequences in our study when the T cells are effective. For immunodeficient scenarios the effects are more sensitive, but still small. In other words, the dynamics of the model during the first four hours is dominated by T cell lysis, recruitment and inactivation. \n\\begin{table}\n\\centering\n\\resizebox*{10.8cm}{10.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.21cm][0.27cm]Parameter &Units  &Value &Description \\\\\n\\hline\n$r_{1}$ &day$^{-1}$ &$5.14\\times10^{-1}$ & \\small Tumor cells growth rate \\\\\n$K_{1}$ &cell & $9.8\\times10^{8}$ & \\small Tumor carrying capacity \\\\\n$a_{12}$ &cell $^{-1}$ day $^{-1}$ &$1.1\\times10^{-10}$ & \\small Competition of host cells with tumor cells \\\\\n$d(nn)$ &day$^{-1}$  & 2.20 & Saturation level of fractional tumor cell kill \\\\\n$d(nl)$ & & 3.47 &  \\\\\n$d(ln)$ & & 2.60 &  \\\\\n$d(ll)$ & & 7.86 &  \\\\\n\n  &   &   &   \\\\\n\n$s(nn)$ &None & $1.6$ & Steepness coefficientof of fractional tumor cell kill \\\\\n$s(nl)$ &  & $2.5$ & \\\\\n$s(ln)$ &  & $1.4\\times10^{-1}$ & \\\\\n$s(ll)$ &  & $4.0\\times10^{-1}$ & \\\\\n$\\lambda(nn)$ &None  & $1.2\\times10^{-1}$ & Exponent of fractional tumor cell kill \\\\\n$\\lambda(nl)$ & & $2.1\\times10^{-1}$ & \\\\\n$\\lambda(ln)$ & & $7.0\\times10^{-1}$ & \\\\\n$\\lambda(ll)$ & & $7.0\\times10^{-1}$ & \\\\\n\n  &   &   &   \\\\\n\n$r_{2}$ & day$^{-1}$ & $1.80\\times10^{-1}$ & \\small Host cells growth rate \\\\\n$K_{2}$ & cell  & $1.0\\times10^{9}$ & \\small Host cells carrying capacity \\\\\n$a_{21}$ &cell $^{-1}$ day $^{-1}$ &$4.8\\times10^{-10}$ & \\small Competition of tumor cells with host cells \\\\\n\n &  &  &  \\\\\n\n$\\sigma$ & cells day$^{-1}$ & $7.5\\times10^{4}$ & \\small Constant source of effector cells \\\\\n$d_{3}$ & day$^{-1}$  & $6.12\\times10^{-2}$ & \\small Inactivation rate of effector cells \\\\\n$g(nn)$ &day$^{-1}$ &$3.75\\times10^{-2}$ & \\small  Maximum recruitment rate \\\\\n$g(nl)$ & & $3.75\\times10^{-2}$ & \\\\\n$g(ln)$ & & $1.13\\times10^{-1}$ & \\\\\n$g(ll)$ & & $3.00\\times10^{-1}$ & \\\\\n$h$ &cell$^{2}$ &$2.02\\times10^{7}$ & \\small Steepness coefficient for the recruitment\\\\\n$a_{31}$ &cell $^{-1}$ day $^{-1}$ & $2.8\\times10^{-9}$ & \\small Immune-tumor competition \\\\\n\\hline\n\\end{tabular}}\n\\caption{The values of the parameters in the ordinary differential equation model used to fit experiments from \\cite{nkg2d}. The parenthesis represent four different cases: a primary challenge with control-transduced cells followed by a secondary one with ligand (\\emph{nl}) or control (\\emph{nn}) cells, and a primary interaction with ligand-transduced cells followed again by ligand (\\emph{ll}) or ligand-negative (\\emph{ln}) rechallenges.}\n\\label{tab:1}\n\\end{table}\n\n\\section{Results}\\label{sec:res}\n\n\\subsection{Tumors}\n\nIn Fig.~\\ref{fig:tumors} we depict the simulated solid tumors with four distinct morphologies, depending on the nutrient competition among tumor cells. The apparent three-dimensionality is an artifact resulting from the fact that we let cells pile up at the CA grid points. This piling mechanism was assumed in \\cite{ferreira} for computational simplicity, and does not have any consequence in our study, since once the tumors are grown, we proyect them to study their lysis. High values of $\\alpha$ and $\\lambda_{N}$ lead to more branchy tumors, gradually changing from spherical to filamentary. This phenomenon is explained if we consider that when some nearby neoplastic cells on the boundary of a tumor compete aggressively for nutrients, those cells that divide and take ahead at some step, preserve this advantage at the next step, stealing the nutrients to those cells left behind. These geometries are comparable to a variety of histologies \\citep{ferreira}, such us a basal cell carcinoma, a scamous papyloma, a trichoblastoma and a plasmacytoma. Note that the necrosis of tumor cells due to the scarcity of nutrients in the core of the masses has been neglected, since it has no relevance in our study. In the CA this is achieved by setting $\\theta_{nec}\\approx 0$. Except for the disconnected patterns appearing in the last row in Fig.~\\ref{fig:tumors}, motility has been also disregarded, considering sufficiently high values of $\\theta_{mig}$.\n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2a.eps}\n   \\label{subfig:sphe1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2b.eps}\n   \\label{subfig:sphe2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2c.eps}\n   \\label{subfig:sphe3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2d.eps}\n   \\label{subfig:sphe4}\n   } \\\\\n \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2e.eps}\n   \\label{subfig:pap1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2f.eps}\n   \\label{subfig:pap2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2g.eps}\n   \\label{subfig:pap3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2h.eps}\n   \\label{subfig:pap4}\n   } \\\\\n    \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2i.eps}\n   \\label{subfig:fil1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2j.eps}\n   \\label{subfig:fil2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2k.eps}\n   \\label{subfig:fil3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2l.eps}\n   \\label{subfig:fil4}\n   } \\\\\n       \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2m.eps}\n   \\label{subfig:dis1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2n.eps}\n   \\label{subfig:dis2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2o.eps}\n   \\label{subfig:dis3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2p.eps}\n   \\label{subfig:dis4}\n   } \\\\\n\\end{tabular}\n\\caption{Tumors generated using the cellular automaton model. Tumors become increasingly branchy as the competition for nutrients increases. Colors go from dark purple (one cell) to light pink (highest number of cells in a grid point for each tumor). We set the parameters $\\lambda_{M}=10$ and $\\theta_{nec}=0$ in all the cases, disregarding necrosis. (a-d) Spherical tumors with increasing size and parameters $\\alpha=2/n$, $\\lambda_{N}=25$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (e-h) Papillary tumors with increasing size and parameters $\\alpha=4/n$, $\\lambda_{N}=200$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (i-l) Filamentary tumors with increasing size and parameters $\\alpha=8/n$, $\\lambda_{N}=270$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (m-p) Disconnected tumors with increasing size and parameters $\\alpha=3/n$, $\\lambda_{N}=200$, $\\theta_{div}=0.75$ and $\\theta_{mig}=0.02$.}\n\\label{fig:tumors}\n\\end{figure}\n\n\\subsection{Effective immune response}\n\nIn the model given by Eqs.~\\eqref{eq:3},~\\eqref{eq:4} and~\\eqref{eq:5}, the fractional cell kill of tumor cells by CTLs is given by the function $K(E,T)$. In \\cite{validbul} we opted for expressing this function in the form\n\n", "itemtype": "equation", "pos": 12756, "prevtext": "\n\n\\title{On the fractional cell kill law governing the lysis of solid tumors}\n\n\\author{\n\\'{A}lvaro G. L\\'{o}pez \\and Jes\\'{u}s M. Seoane \\and \\\\ Miguel A. F. Sanju\\'{a}n\n        }\n\n\\institute{Nonlinear Dynamics, Chaos and Complex Systems Group.\\\\Departamento de F\\'isica, Universidad Rey Juan Carlos, Tulip\\'an s/n, 28933 M\\'ostoles, Madrid, Spain}\n\n\\date{\\today}\n\n\\maketitle\n\n\\begin{abstract}\nWe present \\emph{in silico} simulations and mathematical analyses supporting several hypotheses that explain the saturation expressed in the fractional cell kill law that governs the lysis of tumor cells by cytotoxic CD8$^{+}$ T cells (CTLs). In order to give insight into the significance of the parameters appearing in such law, a hybrid cellular automaton model describing the spatio-temporal evolution of tumor growth and its interaction with the cell-mediated immune response is used. When the CTLs eradicate efficiently the tumor cells, the model predicts a correlation between the morphology of the tumors and the rate at which they are lysed. As the effectiveness of the effector cells is decreased, the saturation gradually disappears. This limit is thoroughly discussed and a new fractional cell kill is proposed.\\\\\n\n\\end{abstract}\n\n\n\n\n\\keywords{Tumor growth \\and Immunology \\and Mathematical modeling \\and Cancer Dynamics}\n\n\n\n\\section{Introduction}\\label{sec:intro}\n\nImmunotherapy is lately focusing major attention among cancer therapies. Adoptive cell transfer using chimeric antigen receptors \\citep{adoptive,chimeric} or the modulation of CTLA-4 activity by means of monoclonal antibodies \\citep{ctla4} are two outstanding examples \\citep{immune}. The progress of tumor immunotherapy with T lymphocytes mainly relies on our capacity to uncover and understand the molecular and cellular bases of T-cell-mediated antitumor response. However, due to the highly complex regulatory mechanisms that control both cell growth and the immune system, this task can be hardly achieved without the use of mathematical models. From a theoretical point of view, these models provide an analytical framework in which fundamental questions concerning cancer dynamics can be addressed in a rigorous fashion. The practical reason for their development is to make quantitative predictions that permit the refinement of the existing therapies, or even the design of new ones.\n\nMathematical models of tumor growth and its interaction with the immune system \\citep{momatim} have demonstrated their potential to explain different properties of tumor-immune system interactions, as for example tumor dormancy and sneaking through. Precisely with the aim of giving insight into these two phenomena, and inspired by enzymatic kinetics, a continuous ODE model was engineered in \\cite{immutu}. This model consists of two cell populations, the tumor cells and the immune effector cells, and is in conformity with experimental results. In the hands of De Pillis and Radunskaya \\citep{pilisraduns}, the model evolved to include an interaction with the host healthy tissue. Years later, such inclusion was dropped in favor of a more specialized model, in which two interacting immune cell populations were considered: the NK cells and the CD8$^{+}$ lymphocytes. This model was validated \\citep{validpilis} using experiments in mice \\citep{nkg2d} and humans \\citep{humans}, and to that end a new fractional cell kill law was presented. In \\cite{validbul} we again integrated the immune response in a single cell population and reintroduced the healthy tissue. The resulting model, similar to that presented in \\cite{pilisraduns}, was again validated with experimental data borrowed from \\cite{nkg2d}. The fractional cell kill law was further inspected, and its limitations for weak immune responses were debated. Several hypotheses concerning the significance of the law were made.\n\nThe main purpose of this paper is to rigorously define the nature and the mathematical expression of the fractional cell kill law that governs the lysis of tumor cells by cytotoxic cells. Our study uses \\emph{in silico} simulations to ascertain the validity of the hypotheses given in \\cite{validbul}, indicating that this law emerges from spatial and geometrical restraints. In particular, simulations are provided in the limit of immunodeficient environments, showing the disappearance of the saturation of the lysis of tumor cells for high effector-to-target ratios as the immune system becomes more and more ineffective.\n\\begin{figure}\n\\centering\n\\begin{tabular}{cc}\n\\subfigure[]{\n  \\includegraphics[width=0.48\\linewidth,height=0.51\\linewidth] {figure1a.eps}\n   \\label{subfig:1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.48\\linewidth,height=0.51\\linewidth] {figure1b.eps}\n   \\label{subfig:2}\n   } \n\\end{tabular}\n\\caption{(a) Schematic representation of the cellular automaton grid in a square domain, with some tumor cells (pink) growing from its center, and some necrotic cells (gray) at its core. Two vertical vessels on the boundary supply the nutrients required for cell division and other cellular activities. The upper and lower bounds are identified, forming a cylinder. (b) To study the lysis of tumor cells, the cell co-cultures (initial conditions) are prepared by randomly placing effector cells in a rectangular region around the tumor. The size of this domain is selected so that for the maximum values of the effector-to-target ratio the region is almost filled with effector cells.}\n\\label{fig:cabas}\n\\end{figure}\n\n\\section{Models}\\label{sec:md}\n \n\\subsection{An hybrid cellular automaton model}\n\nThe simulations are accomplished by means of a cellular automaton (CA) model developed in \\cite{cahyb} to study the interactions between tumor and immune effector cells. This model was built on a previously CA model designed to study the effects of competition for nutrients and growth factors in avascular tumors \\citep{ferreira}. It is hybrid because the cells are treated discretely, allowing them to occupy diverse grid points in a particular spatial domain, and evolve according to probabilistic and direct rules. On the contrary, the diffusion of nutrients required for growth (such as glucose, oxygen and other types of nutrients) from the vessels into such spatial region is represented through linear reaction-diffusion equations, which are continuous and deterministic. Two types of nutrients are utilized in this model, making a distinction between those which are specific for cell division $N(x,y,t)$, and others $M(x,y,t)$ that are related to the remaining cellular activities. The partial differential equations for the diffusion of nutrients are\n\\begin{eqnarray}\n&\\dfrac{\\partial N}{\\partial t}&=D_{N}\\nabla^{2}N-k_{1}T N-k_{2}H N-k_{3}E N \\label{eq:1} \\\\ \n&\\dfrac{\\partial M}{\\partial t}&=D_{M}\\nabla^{2}M-k_{4}T M-k_{5}H M-k_{6}E M,\\label{eq:2} \n\\end{eqnarray}\nwhere $T(x,y,t)$, $H(x,y,t)$ and $E(x,y,t)$ are functions representing the number of tumor, healthy and immune cells at time $t$ and position $(x,y)$. For simplicity, we assume that both type of nutrients have the same diffusion coefficient $D_{N}=D_{M}=D$. Following \\cite{cahyb}, we consider that the competition parameters are equal $k_{2}=k_{3}=k_{5}=k_{6}=k$, except for the tumor cells, which compete more aggressively. We set $k_{1}=\\lambda_{N}k$ and $k_{4}=\\lambda_{M}k$, with $\\lambda_{M}$ and $\\lambda_{N}$ greater than one. An adiabatic limit is considered, assuming that the solutions are stationary. This approximation holds because the time it takes a tumor cell to complete its cell cycle, which is of the order of days \\citep{amolap}, is much longer than that of the diffusion of nutrients. A quadrilateral domain $\\Omega=[0,L]\\times[0,L]$ is considered and Dirichlet boundary conditions are imposed on the vertical sides of the domain, where the vessels are placed, assigning $N(0,y)=N(L,y)=N_{0}$ and $=M(0,y)=M(L,y)=M_{0}$. For simplicity, the horizontal upper and lower bounds of the domain obey periodic boundary conditions $N(x,0)=N(x,L)$ and $M(x,0)=M(x,L)$, wrapping them together to form a cylinder.\n\nFinally, the diffusion equations are non-dimensionalised as explained in \\cite{ferreira}, and the equations are numerically solved by using finite-difference methods with successi2ve over-relaxation. The resolution of the grid $n$ equals 300 pixels in all our simulations. For a detailed description of the CA algorithm we refere the reader to \\cite{ferreira}. The experiments here presented are carried out in two successive steps. The first is devoted to the growth of the tumors, while the second focuses on the lysis of tumor cells by CTLs.\n\\begin{enumerate}\n\\item We generate distinct solid tumors as monoclonal growths, arising after many iterations of the cellular automaton. At each CA iteration the tumor cells can divide, move or die attending to certain probabilistic rules that depend on the nutrient concentration per tumor cell and some specific parameters. Each of these parameters $\\theta_{a}$ represent the intrinsic capacity of the tumor cells to carry out a particular action $a$. The precise probabilistic laws and the corresponding actions are described in detail in Appendix~\\ref{app:caraa}. Attending to morphology, diverse types of tumors can be generated, depending on the nutrient competition parameters among tumor cells $\\alpha,\\lambda_{N}$. We simulate four types of geometries (spherical, papillary, filamentary and disconnected), and inspect four tumors of different sizes for each shape. \n\\item The lysis of tumor cells is a hand-to-hand struggle comprising several processes. After recognition of these cells through antigen presentation via MHC class I molecules, the CD8$^{+}$ T cells proceed to induce apoptosis. The principal mechanism involves the injection of proteases through pores on the cell membrane, that have been previously opened by polymerization of perforins. Even though death may take about an hour to become evident, it takes minutes for a T cell to program antigen-specific target cells to die \\citep{bioimm}. We assign a time of ten minutes for each iteration of the CA, and other choices can be made. Therefore, twenty four iterations of the CA equal the four hours after which the lysis of tumor cells is measured in the experiments \\citep{nkg2d}. Since the cell cycle time of a tumor cell is generally a few times longer, we assume a second adiabatic approximation and freeze the tumor cell dynamics during T cell lysis. \n\nThe rules governing the effector cells evolution are as follows. At each iteration, those immune cells that are in contact with at least one tumor cell, might lyse them with certain probability. The intrinsic cytotoxic capability, which in the model also accounts for the capacity of T cells to recognize tumor cells \\citep{tils}, is related to the parameter $\\theta_{lys}$. If a T cell destroys a tumor cell, recruitment might be induced in its neighboring CA elements. When immune cells are not in direct contact with a tumor cell, they can either move or become inactivated. We consider that a single T cell can not lyse more than three times, leaving the region of interest when this occurs \\citep{cahyb}. The precise probabilistic laws and the corresponding actions are again thoroughly described in Appendix~\\ref{app:caraa}. Each of the sixteen solid tumors is co-cultivated with different effector-to-target ratios as initial conditions (see Fig.~\\ref{fig:cabas}) and the lysis is computed four hours later.\n\\end{enumerate}\n\nBecause our study mainly focuses on how fast lymphocytes lyse a tumor, two important simplifications between our cellular automaton and the one presented in \\cite{cahyb} deserve notification. We have excluded the NK cells from the model, together with a constant source of immune cells.\n\n\\subsection{An ordinary differential equation model}\n\nIn the present investigation the results of the simulations performed with the cellular automaton model are fitted by means of a least-squares fitting method to a Lotka-Volterra type model. The continuous model of cell-mediated immune response to tumor growth consists of three interacting cell populations: the tumor cells $T(t)$, the host healthy cells $H(t)$ and the immune effector cells $E(t)$. Our study focus mainly on CD$8^{+}$ T lymphocytes, but the model can be easily modified to reproduce NK cell dynamics. The system of differential equations \\citep{validbul} reads\n\\begin{eqnarray}\n&\\dfrac{d T}{d t}&=r_{1}T\\left(1-\\dfrac{T}{K_{1}}\\right)-a_{1 2}H T-K(E,T)T \\label{eq:3}\\bigskip\\\\ \n& \\dfrac{d H}{d t}&=r_{2}H\\left(1-\\dfrac{H}{K_{2}}\\right)-a_{2 1}T H \\label{eq:4}\\bigskip\\\\\n& \\dfrac{d E}{d t}&=\\sigma-d_{3} E+g\\dfrac{K^{2}(E,T)T^{2}}{h+K^{2}(E,T)T^{2}}E-a_{3 1} T E\\label{eq:5},\n\\end{eqnarray}\nwith \n\n", "index": 1, "text": "\\begin{equation}\nK(E,T)=d \\dfrac{(E/T)^{\\lambda}}{s+ (E/T)^{\\lambda}}.\n\\label{eq:6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"K(E,T)=d\\dfrac{(E/T)^{\\lambda}}{s+(E/T)^{\\lambda}}.\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>E</mi><mo>/</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>λ</mi></msup><mrow><mi>s</mi><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>E</mi><mo>/</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>λ</mi></msup></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\nwith $h(T)=s T^{\\lambda}$. Written this way, the fractional cell kill clearly states that the more effector cells, the greater the fractional cell kill, but bearing in mind the saturation of antigen-mediated immune response, which depends on the tumor burden. We propose that the saturation is due to the crowding of immune effector cells, which is evident if we recall that these cells need to be in contact with tumor cells to exterminate them. In a solid tumor, once all the tumor cells on its surface are in contact with a first line of immune cells, the remaining effector cells are not lysing, although the adjacent lines behind probably contribute to immune stimulation through several feedback mechanisms. Therefore, at a certain point, no matter how many more immune cells are present in the region of interest, the rate at which the tumor is lysed remains practically unaltered. Before saturation appears, if two tumors of the same nature and different size at a certain time instant are lysed at the same rate by the immune system, the bigger tumor will require more effector cells. Put more simply, if two tumors of different size are reduced to a particular fraction of its size after a certain period of time, the bigger tumor will require more effector cells. The number of effector cells $E$ for which the fractional tumor cell kill is half of its maximum $d$, increases monotonically with the tumor size $h(T)$.\n\nWe use simulations to demonstrate that these assertions are sufficient to explain the fractional cell kill law, even though there might be others. With this purpose, for every tumor pictured in the previous section, we prepare co-cultures with different effector-to-target ratios. Then, we let the CA evolve and measure the lysis four hours later (see Fig.~\\ref{fig:lysed}). As previouly explained, the tumors have been projected before the lysis starts, to better correlate the geometry and the parameters in the fractional cell kill. Otherwise, we would have two-dimensionally distributed lymphocytes fighting three-dimensional-like tumors, as in \\cite{cahyb}. Finally, the results are fitted to the ODE model using a least-squares fitting method. We recall that such model was validated using as initial conditions typical cell populations of $10^{6}$ cells, while the CA automaton grid used can harbor at most $9\\times10^{4}$ cells. However, this is not a hurdle at all, since if desired, the cell populations in the ODE model can be renormalized and its parameters redefined so as the cell numbers coincide.\n\\begin{table}\n\\centering\n\\resizebox*{10.9cm}{5.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.21cm][0.21cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(s) &day$^{-1}$  & $9 \\pm 4$  & Saturation level of fractional tumor cell kill  \\\\\n$d$(p) & & $20 \\pm 1$ & \\\\\n$d$(f) & & $32 \\pm 2$ & \\\\\n$d$(d) & & $13 \\pm 3$ & \\\\\n$\\lambda$(s) &None  & $0.61 \\pm 0.07$ & Exponent of of fractional tumor cell kill \\\\\n$\\lambda$(p) & & $0.87 \\pm 0.04$ & \\\\\n$\\lambda$(f) & & $0.89 \\pm 0.03 $ & \\\\\n$\\lambda$(d) & & $0.63 \\pm 0.03$ & \\\\\n$s$ &None & $0.15$ & Steepness coefficient of fractional tumor cell kill  \\\\\n\n  &   &   &  \\\\\n\n$D_{F}$(s) &None & $1.09 \\pm 0.02$ & Box counting dimension of the boundary before the lysis starts \\\\\n$D_{F}$(p) &  & $1.21 \\pm 0.04$ & \\\\\n$D_{F}$(f) &  & $1.36 \\pm 0.02$ & \\\\\n$D_{F}$(d) &  & $1.72 \\pm 0.04$ & \\\\\n\\hline\n\\end{tabular}}\n\\caption{The parameter values modified in the model shown in Eqs.~\\eqref{eq:3}, \\eqref{eq:4} and \\eqref{eq:5} corresponding to an effective immune response. The parameters $\\lambda$ and $d$ are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model. The mean value and standard deviations is computed for each morphology using four different tumors sizes: spherical (s), papillary (p), filamentary (f) and disconnected (d).}\n\\label{tab:2}\n\\end{table}\n\n\nThe resulting lysis curves are depicted in Fig.~\\ref{fig:ajustelig} and the values of the parameters $d$, $\\lambda$ and $s$ in Eq.~\\eqref{eq:7} are listed in Table~\\ref{tab:2}, together with the fractal dimension $D_{F}$ of the contour of the initial tumors. Satellitosis is clearly appreciated as a consequence of T cell recruitment, and the resulting clusters of cells act like wave fronts that advance lysing the tumor. There is a correlation between the box counting dimension and the parameters $d$ and $\\lambda$ for the connected tumors examined, but this is not case for the disconnected one. In fact, the fractal dimension of the boundary of a solid tumor, is not generally a good measure concerning the cell mediated immune response. A counterexample suffices to convince ourselves, preventing us to search for power laws relating the parameters $d$ and $\\lambda$ and the fractal dimension. For example, the disconnected tumors shown in Fig.~\\ref{fig:tumors} have the highest dimensions, but this is because these tumors are very drilled, so most of the tumor cells are on its boundary. However, they are rather spherical, so that the part of the boundary that is in the center of the mass is not initially accessible to the immune system. On the other hand, a tumor with a similar distribution of cells, but none making contact among them, will have fractal dimension smaller than one, but close lytic rates. These facts explain the low values of $d$ and $\\lambda$ for such tumors, which are comparable to the spherical ones. Indeed, what matters to the cytotoxic cells is the accessibility to their enemies. The more tumor cells there are between an immune cell and a tumor cell, the lower the rate at which the effector cells kill their victims. This is starkly evident for the spherical tumors, which correspond to the smallest values of $d$ and $\\lambda$. \n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3a.eps}\n   \\label{subfig:sollig}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3b.eps}\n   \\label{subfig:paplig}\n   } \\\\\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3c.eps}\n   \\label{subfig:fillig}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3d.eps}\n   \\label{subfig:dislig}\n   } \\\\\n\\end{tabular}\n\\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ in immunocompetent environments. The parameter values of the CA related to the lysis, recruitment and inactivation are $\\theta_{lys}=0.3$, $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$, respectively. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. Here we show the results for four tumors. (a) The spherical tumor in Fig.~\\ref{subfig:sphe2}. (b) The papillary tumor in Fig.~\\ref{subfig:pap2}. (c) The filamentary tumor in Fig.~\\ref{subfig:fil4}. (d) The disconnected tumor in Fig.~\\ref{subfig:dis2}.}\n\\label{fig:ajustelig}\n\\end{figure}\n\nThus, according to our model, Eq.~\\eqref{eq:7} is a robust emergent property of the tumor-immune interaction depending on the spatial distribution of the tumor cells. It reflects the tumor size dependent saturation of an effective immune system, fruit of the crowding of the effector cells and the arduousness to establish contact with their adversaries. Nevertheless, it takes hours for the effector cells to fully lyse the tumors so far investigated, what denotes that this extrinsic limitation to the lytic capacity of the immune system is barely important compared to the immunoevasive maneuvers that tumor cells commonly orchestrate \\citep{hallmarks}.\n\n\\subsection{Ineffective immune response}\n\nTumor cells find ways to evade the immune surveillance through a broad range of mechanisms \\citep{biocan}. They can acquire the ability to repress tumor antigens, MHC class I proteins or NKG2D ligands. They may also learn to destroy receptors or to saturate them, induce suppressor T cells formation, launch counterattacks against immunocytes by releasing cytokines, avoid apoptosis, etc. It is therefore pertinent to ask ourselves if the law can cover situations in which the tumor microenvironment is immunodeficient. \n\nIn \\cite{validpilis} the authors show that the lysis curves corresponding to NK cells in the experiments borrowed from \\cite{nkg2d} do not show saturation, and that a fractional cell kill given by a simple power law $cE^{\\nu}$ works to fit such data. Because much higher values of the effector-to-target ratio are required to obtain similar values for the lysis compared to the CTLs curves, it was suggested that when the effector cells are less effective, saturation is not observed. \n\nMathematical arguments have been given \\citep{validbul} to explain this lack of saturation. Briefly, when the cytotoxic cells are less effective, only a fraction $f$ of the effector cells are interacting with the tumor. Thus we can replace $E$ by $f E$ in the fractional cell kill. Now, defining $\\tilde{s}=s /f^{\\lambda}$, the fractional cell kill law remaings unchanged. This suggests that the parameter $s$ is related to the effectiveness of the cytotoxic cells, being this parameter inversely proportional to the effectiveness of such cells. On the other hand, if the effectiveness is small enough ($f\\ll1$), then $h(T)$ dominates over $E^{\\lambda}$ in Eq.~\\eqref{eq:7}, as long as $E$ is not too high. The resulting lysis term becomes $d f^{\\lambda} E^{\\lambda} T^{1-\\lambda}/s$. This legitimates the estimation $c E^{\\nu}T$ that has been used in other works \\citep{validpilis,validbul} to reproduce the fractional cell kill of tumor cells. Nevertheless, here we do not want to introduce phenomenological laws of this type, but rather concentrate our efforts on the significance of $s$. To this end, we diminish the intrinsic cytotoxic capacity of the immune cells, which is encoded in the parameter $\\theta_{lys}$ in our cellular automaton. Higher values of this parameter represent more ineffective T cells. The results can be seen in Fig.~\\ref{fig:lysnoneffec} and the values of the parameters are listed in Table~\\ref{tab:3}. As we increase the parameter $\\theta_{lys}$, the lysis curves become progressively less convex, and at a certain point they look concave. \n\nWhen $\\theta_{lys}=10$, the ODE model can be adjusted to the CA results. However, increasing $s$ is not sufficient to reproduce this data, and considerable variations of the remaining parameters $d$ and $\\lambda$ is required. A much more dramatic case arises when $\\theta_{lys}=100$. In this case we have not been able to find any values of the parameters that represents faithfully the CA results. The best fitting provided by the ODE model exhibits strong saturation. The conclussion is that the fractional cell kill law represented by Eq.~\\eqref{eq:7} works bad for immunodefficient environments and also confuses the geometrical effects and the intrinsic cytotoxic capacity of the immune cells. In the next section, we propose a new fractional cell kill law that allows to fit the results more accurately by simply reducing the value of $s$.\n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.38\\linewidth,height=0.34\\linewidth] {figure4a.eps}\n   \\label{subfig:none1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.43\\linewidth,height=0.35\\linewidth] {figure4b.eps}\n   \\label{subfig:none2}\n   } \\\\\n\\end{tabular}\n\\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ in immunosuppressed environments. The spherical tumor represented in Fig.~\\ref{subfig:sphe2} is studied, with recruitment and inactivation CA parameters $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. (a) A more ineffective, but still effective, adaptive response is here represented, with $\\theta_{lys}=10$. (b) A value of the intrinsic cytotoxic capacity $\\theta_{lys}=100$ is set for the most ineffective immune system.}\n\\label{fig:lysnoneffec}\n\\end{figure}\n\n\\subsection{Modification of the fractional cell kill law}\n\nIn \\cite{validbul}, the particular nature of the function $h(T)$ appearing in Eq.~\\eqref{eq:7} was also discussed, proving that if instead of $h(T)=s T^{\\lambda}$, $h(T)=s T^{\\lambda+\\Delta \\lambda}$ is used, the empirical results can also be validated by simply decreasing the value of $s$, even for values $\\Delta \\lambda/\\lambda$ greater that one. This means that the original proposal of a saturating fractional cell kill depending on the quotient $E/T$ can not be guaranteed. \n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5a.eps}\n   \\label{subfig:sol00025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5b.eps}\n   \\label{subfig:sol0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5c.eps}\n   \\label{subfig:sol0025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5d.eps}\n   \\label{subfig:sol075}\n   } \\\\\n \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5e.eps}\n   \\label{subfig:pap0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5f.eps}\n   \\label{subfig:pap00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5g.eps}\n   \\label{subfig:pap0025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5h.eps}\n   \\label{subfig:pap025}\n   } \\\\\n    \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5i.eps}\n   \\label{subfig:fil00025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5j.eps}\n   \\label{subfig:fil00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5k.eps}\n   \\label{subfig:fil0017}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5l.eps}\n   \\label{subfig:fil0025}\n   } \\\\\n       \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5m.eps}\n   \\label{subfig:dis0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5n.eps}\n   \\label{subfig:dis00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5o.eps}\n   \\label{subfig:dis0015}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5p.eps}\n   \\label{subfig:dis0025}\n   } \\\\\n\\end{tabular}\n\\caption{Lysed tumors after four hours for different effector-to-target ratios. The effector cells (green) form satellites that advance destroying their neoplastic enemies (violet) and leave apoptotic bodies (light gray) behind them, ready to be phagocytosed. The parameter values of the CA are $\\theta_{lys}=0.3$, $\\theta_{rec}=1.0$, $\\theta_{inc}=0.5$, $\\lambda_{M}=10$, $\\lambda_{N}=25$ and $\\alpha=2/L$. (a-d) Spherical tumor in Fig.~\\ref{subfig:sphe2} with $E_{0}/T_{0}$ taking values on the set $\\{0.0025,0.005, 0.05, 0.75\\}$, respectively. (e-h) Papillary tumor in Fig.~\\ref{subfig:pap2} with $E_{0}/T_{0}$ taking values on the set $\\{0.005, 0.0075, 0.025, 0.25 \\}$, respectively. (i-l) Filamentary tumor in Fig.~\\ref{subfig:fil4} with $E_{0}/T_{0}$ taking values on the set $\\{0.0025,0.0075,0.025, 0.017\\}$, respectively. (m-p) Disconnected tumor in Fig.~\\ref{subfig:dis2} with $E_{0}/T_{0}$ taking values on the set $\\{0.005, 0.0075$, $0.015, 0.025\\}$, respectively.}\n\\label{fig:lysed}\n\\end{figure}\n\n\n\\begin{table}\n\\centering\n\\resizebox*{11.9cm}{3.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.17cm][0.3cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(s) &day$^{-1}$ & $3.80$ & Saturation level of the fractional tumor cell kill \\\\\n$d$(i) & & $1.56$ & \\\\\n$\\lambda$(s) &None  & $0.62$ & Exponent of the fractional tumor cell kill \\\\\n$\\lambda$(i) &  & $0.17$ &  \\\\\n$s$(s) &None & $0.50$ & Steepness coefficient of the fractional tumor cell kill \\\\\n$s$(i) & & $1.10$ &  \\\\\n\n\\hline\n\\end{tabular}}\n\\caption{The parameter values of the fractional cell kill law given by Eq.~\\eqref{eq:7}. These parameters are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model (see Fig.~\\ref{fig:lysnoneffec}. Two cases are represented: a very ineffective (i) and a semi-effective (s) immune responses.\n}\n\\label{tab:3}\n\\end{table}\n\nFurthermore, from a theoretical point of view, the function $h(T)=sT^{\\lambda}$ makes the model ill-defined in the limit of very big tumors ($T \\rightarrow \\infty$) facing a comparably small fixed number of immune cells. The reason is that in this limit we get unbounded velocity for the lysis ($K(E,T)T \\rightarrow  \\infty$). We demonstrate that $h(T)=s T$ is a much better choice. It has been shown \\citep{tils, micaelis} that for a fixed number of effector cells $E_{0}$, the Michaelis-Menten kinetics govern the lysis of tumor cells. The  value of the lytic velocity at tumor saturation, \\emph{i.e.}, when $T \\rightarrow \\infty$, is reported in such works as a measure of the intrinsic cytotoxic capability of a particular number of effector cells. A Michaelis-Menten decay in Eq.~\\eqref{eq:3} is obtained for a constant value of effector cells as long as $h(T)=sT$ in used. The value at saturation for a fixed number of effector cells is then $d E_{0}^{\\lambda}/s$. An argument supporting saturation comes from the following fact. If the number of tumor cells is much higher than a fixed number of effector cells, the velocity at which the tumor cells are lysed can not be enhanced by increasing the number of the neoplastic cells. This occurs because T cells kill tumor cells one by one, and for such ratios all the effector cells are already busy fighting other cells. In a similar fashion, for an enzymatic reaction, one can not increase arbitrarily the velocity at which the products are formed by simply adding more substrate. Precisely, this reasoning is reminiscent of the original formulation proposed by \\cite{immutu}, in which the cell populations are regarded as chemical species obeying enzymatic kinetics in the quasi-steady state regime. In such work, the tumor cells are the substrate, the effector cells are the enzyme and the products are the dead cells. Indeed, it can be analitically demonstrated that such kinetics governs the lysis of tumor cells in the cited model for a constant number of effector cells (see Appendix \\ref{app:foobar}). A fractional cell kill law that yields bounded velocity for the lysis of tumor cells when any of these two cell populations is sufficiently high compared to the other is represented by\n\n", "itemtype": "equation", "pos": 22960, "prevtext": "\n\nThe tumor cells and the host healthy cells grow logistically with growth rates and carrying capacities $r_{1}, K_{1}$ and $r_{2}, K_{2}$, respectively. The terms $a_{12}$ and $a_{21}$ model the competition for nutrients and space among tumor and healthy cells. A term representing the fractional cell kill of tumor cells by CTLs is given by $K(E,T)$, which constitutes the main topic of the present work. Here the parameter $\\sigma$ incorporates a constant input of lymphocytes into the tissue where the tumor develops, but it can be related to a background of NK cells as well \\citep{validpilis}. The inactivation of the effector cells and their migration from the tumor area is given by the term $d_{3}E$, whereas the parameters $g,h$ stand for the multiplication of effector cells due to tumor stimulation as well as the recruitment mediated by cytokines, such us IFN-$\\gamma$ or TNF-$\\alpha$, after the tumor and the immune cells interact. Finally, the competition between the tumor and the T cells for resources is given by $a_{31}$. These differential equations are solved using a fourth order Runge-Kutta integrator.\n\nThis continuous model has been validated \\citep{validbul} using experiments from \\cite{nkg2d} and the parameter values are listed in Table~\\ref{tab:1}. In the present work only those parameters appearing in the fractional cell kill law ($d$, $\\lambda$ and $s$) are inspected. Accordingly to the CA model, we have set $\\sigma=0$ in the ODE model since the CA does not include a constant input of effector cells. We have also selected a value $g=0.15$, which is very close to one of the values appearing in Table~\\ref{tab:1}. Importantly the CA model and the ODE model include the same type of processes. The logistic growth of tumor cells in the CA model arises as a consequence of competition for nutrients \\citep{ferreira}. There is also competition among healthy cells and tumor cells for nutrients, which in the ODE model is represented by the competing Lotka-Volterra terms between healthy and tumor cells. T cell lysis, inactivation and recruitment are also present in both models. Only the competition term between tumor and immune cells $a_{31}$ is different. Although we keep this parameter as shown in Table~\\ref{tab:1}, if desired, it can be made equal to zero. As far as we have investigated, reducing the value of this parameter produces no appreciable consequences in our study. Notwithstanding this correspondence, we recall that during the second step of our CA simulations, the tumor dynamics is freezed. Accordingly, the parameter $r_{1}$ should be made equal to zero. Again, we keep this parameter as shown in Table~\\ref{tab:1}. Reducing the value of this parameter produces no significant consequences in our study when the T cells are effective. For immunodeficient scenarios the effects are more sensitive, but still small. In other words, the dynamics of the model during the first four hours is dominated by T cell lysis, recruitment and inactivation. \n\\begin{table}\n\\centering\n\\resizebox*{10.8cm}{10.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.21cm][0.27cm]Parameter &Units  &Value &Description \\\\\n\\hline\n$r_{1}$ &day$^{-1}$ &$5.14\\times10^{-1}$ & \\small Tumor cells growth rate \\\\\n$K_{1}$ &cell & $9.8\\times10^{8}$ & \\small Tumor carrying capacity \\\\\n$a_{12}$ &cell $^{-1}$ day $^{-1}$ &$1.1\\times10^{-10}$ & \\small Competition of host cells with tumor cells \\\\\n$d(nn)$ &day$^{-1}$  & 2.20 & Saturation level of fractional tumor cell kill \\\\\n$d(nl)$ & & 3.47 &  \\\\\n$d(ln)$ & & 2.60 &  \\\\\n$d(ll)$ & & 7.86 &  \\\\\n\n  &   &   &   \\\\\n\n$s(nn)$ &None & $1.6$ & Steepness coefficientof of fractional tumor cell kill \\\\\n$s(nl)$ &  & $2.5$ & \\\\\n$s(ln)$ &  & $1.4\\times10^{-1}$ & \\\\\n$s(ll)$ &  & $4.0\\times10^{-1}$ & \\\\\n$\\lambda(nn)$ &None  & $1.2\\times10^{-1}$ & Exponent of fractional tumor cell kill \\\\\n$\\lambda(nl)$ & & $2.1\\times10^{-1}$ & \\\\\n$\\lambda(ln)$ & & $7.0\\times10^{-1}$ & \\\\\n$\\lambda(ll)$ & & $7.0\\times10^{-1}$ & \\\\\n\n  &   &   &   \\\\\n\n$r_{2}$ & day$^{-1}$ & $1.80\\times10^{-1}$ & \\small Host cells growth rate \\\\\n$K_{2}$ & cell  & $1.0\\times10^{9}$ & \\small Host cells carrying capacity \\\\\n$a_{21}$ &cell $^{-1}$ day $^{-1}$ &$4.8\\times10^{-10}$ & \\small Competition of tumor cells with host cells \\\\\n\n &  &  &  \\\\\n\n$\\sigma$ & cells day$^{-1}$ & $7.5\\times10^{4}$ & \\small Constant source of effector cells \\\\\n$d_{3}$ & day$^{-1}$  & $6.12\\times10^{-2}$ & \\small Inactivation rate of effector cells \\\\\n$g(nn)$ &day$^{-1}$ &$3.75\\times10^{-2}$ & \\small  Maximum recruitment rate \\\\\n$g(nl)$ & & $3.75\\times10^{-2}$ & \\\\\n$g(ln)$ & & $1.13\\times10^{-1}$ & \\\\\n$g(ll)$ & & $3.00\\times10^{-1}$ & \\\\\n$h$ &cell$^{2}$ &$2.02\\times10^{7}$ & \\small Steepness coefficient for the recruitment\\\\\n$a_{31}$ &cell $^{-1}$ day $^{-1}$ & $2.8\\times10^{-9}$ & \\small Immune-tumor competition \\\\\n\\hline\n\\end{tabular}}\n\\caption{The values of the parameters in the ordinary differential equation model used to fit experiments from \\cite{nkg2d}. The parenthesis represent four different cases: a primary challenge with control-transduced cells followed by a secondary one with ligand (\\emph{nl}) or control (\\emph{nn}) cells, and a primary interaction with ligand-transduced cells followed again by ligand (\\emph{ll}) or ligand-negative (\\emph{ln}) rechallenges.}\n\\label{tab:1}\n\\end{table}\n\n\\section{Results}\\label{sec:res}\n\n\\subsection{Tumors}\n\nIn Fig.~\\ref{fig:tumors} we depict the simulated solid tumors with four distinct morphologies, depending on the nutrient competition among tumor cells. The apparent three-dimensionality is an artifact resulting from the fact that we let cells pile up at the CA grid points. This piling mechanism was assumed in \\cite{ferreira} for computational simplicity, and does not have any consequence in our study, since once the tumors are grown, we proyect them to study their lysis. High values of $\\alpha$ and $\\lambda_{N}$ lead to more branchy tumors, gradually changing from spherical to filamentary. This phenomenon is explained if we consider that when some nearby neoplastic cells on the boundary of a tumor compete aggressively for nutrients, those cells that divide and take ahead at some step, preserve this advantage at the next step, stealing the nutrients to those cells left behind. These geometries are comparable to a variety of histologies \\citep{ferreira}, such us a basal cell carcinoma, a scamous papyloma, a trichoblastoma and a plasmacytoma. Note that the necrosis of tumor cells due to the scarcity of nutrients in the core of the masses has been neglected, since it has no relevance in our study. In the CA this is achieved by setting $\\theta_{nec}\\approx 0$. Except for the disconnected patterns appearing in the last row in Fig.~\\ref{fig:tumors}, motility has been also disregarded, considering sufficiently high values of $\\theta_{mig}$.\n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2a.eps}\n   \\label{subfig:sphe1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2b.eps}\n   \\label{subfig:sphe2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2c.eps}\n   \\label{subfig:sphe3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2d.eps}\n   \\label{subfig:sphe4}\n   } \\\\\n \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2e.eps}\n   \\label{subfig:pap1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2f.eps}\n   \\label{subfig:pap2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2g.eps}\n   \\label{subfig:pap3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2h.eps}\n   \\label{subfig:pap4}\n   } \\\\\n    \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2i.eps}\n   \\label{subfig:fil1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2j.eps}\n   \\label{subfig:fil2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2k.eps}\n   \\label{subfig:fil3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2l.eps}\n   \\label{subfig:fil4}\n   } \\\\\n       \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2m.eps}\n   \\label{subfig:dis1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2n.eps}\n   \\label{subfig:dis2}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2o.eps}\n   \\label{subfig:dis3}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure2p.eps}\n   \\label{subfig:dis4}\n   } \\\\\n\\end{tabular}\n\\caption{Tumors generated using the cellular automaton model. Tumors become increasingly branchy as the competition for nutrients increases. Colors go from dark purple (one cell) to light pink (highest number of cells in a grid point for each tumor). We set the parameters $\\lambda_{M}=10$ and $\\theta_{nec}=0$ in all the cases, disregarding necrosis. (a-d) Spherical tumors with increasing size and parameters $\\alpha=2/n$, $\\lambda_{N}=25$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (e-h) Papillary tumors with increasing size and parameters $\\alpha=4/n$, $\\lambda_{N}=200$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (i-l) Filamentary tumors with increasing size and parameters $\\alpha=8/n$, $\\lambda_{N}=270$, $\\theta_{div}=0.3$ and $\\theta_{mig}=\\infty$. (m-p) Disconnected tumors with increasing size and parameters $\\alpha=3/n$, $\\lambda_{N}=200$, $\\theta_{div}=0.75$ and $\\theta_{mig}=0.02$.}\n\\label{fig:tumors}\n\\end{figure}\n\n\\subsection{Effective immune response}\n\nIn the model given by Eqs.~\\eqref{eq:3},~\\eqref{eq:4} and~\\eqref{eq:5}, the fractional cell kill of tumor cells by CTLs is given by the function $K(E,T)$. In \\cite{validbul} we opted for expressing this function in the form\n\n", "index": 3, "text": "\\begin{equation}\nK(E,T)=d\\frac{E^{\\lambda}}{h(T) + E^{\\lambda}},\n\\label{eq:7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"K(E,T)=d\\frac{E^{\\lambda}}{h(T)+E^{\\lambda}},\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mfrac><msup><mi>E</mi><mi>λ</mi></msup><mrow><mrow><mi>h</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msup><mi>E</mi><mi>λ</mi></msup></mrow></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nFollowing the point of view of \\cite{immutu}, this law can be regarded as a Michaelis-Menten kinetics where the rate constants of the formation of the ``enzyme-substrate\" conjugates, their dissociation and their conversion to product depend nonlinearly (as power laws) on the enzyme concentration. It establishes the saturation of the velocity of the lysis of tumor cells for both the tumor and the immune cell populations. In Fig.~\\ref{subfig:6a} we first reproduce the experiments of the spherical tumor shown in Fig.~\\ref{subfig:sphe3} for $\\theta_{lys}=0.3$. This allows us to obtain the parameter values of the modified fractional cell kill law shown in Eq.~\\eqref{eq:8}. Then we carry out the simulations of the preeceding section for immunodeficient evironments and see how, mainly by increasing the value of $s$, the CA results are reproduced (see Figs.~\\ref{subfig:6b} and ~\\ref{subfig:6c}). The parameter values are listed in Table.~\\ref{tab:4}. This sheds light into the significance of this parameter, which is now manifestly related to the intrinsic cytotoxic potential of the T cells. Moreover, this implies that the limit $T \\rightarrow \\infty$, for which the quantity $d E^{\\lambda}/s$ is obtained, is not a good measure of lymphocyte cytotoxicity, as suggested in \\cite{tils, micaelis}. This limit, which for a constant value of the T cells implies a linear decay of the tumor, involves geometry as well. If we consider that there is just one immune cell, and it takes this cell an hour to lyse a tumor cell, then a spherical tumor would be reduced at approximately one cell per hour (assuming that this immune cell does not become inactivated at some step). However, if we think of more sophisticated geometries, the T cell migh have to travel noticeable distances to reach new tumor cells after lysing a certain tumor cell. Therefore, the geometry of the tumor, which is coded in the parameters $d$ and $\\lambda$, clearly affects how fast this single cell can erase it. \n\nEven though the reduction of saturation for ordinary values of the effector-to-target ratio can be justified mathematically and numerically, the change in curvature for the CA results appearing in Fig.~\\ref{subfig:6c} is hard to put on a rational basis. Since $0<\\lambda<1$, the quantity $d E^{\\lambda}/s$, as a fucntion of $E$, will always have negative curvature. Therefore, a positive feedback mechanism is required to explain the change in curvature. A candidate mechanism responsible of this phenomenon is effector cell recruitment. As the effectiveness of the T cells decreases, this terms become increasingly important. Further research concerning this mathematical function is deserved.\n\\begin{figure}\n \\centering\n \\begin{tabular}{cc}\n \\subfigure[]{\n    \\includegraphics[width=0.44\\linewidth] {figure6a.eps}\n    \\label{subfig:6a}\n    } &\n \\subfigure[]{\n    \\includegraphics[width=0.49\\linewidth] {figure6b.eps}\n    \\label{subfig:6b}\n    } \\\\\n \\multicolumn{2}{c}{\n  \\subfigure[]{\n     \\includegraphics[width=0.50\\linewidth] {figure6c.eps}\n     \\label{subfig:6c}\n     }\n     }   \n \\end{tabular}\n \\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ for increasing inneffectiveness of the lymphocytes. The spherical tumor represented in Fig.~\\ref{subfig:sphe2} is studied, with recruitment and inactivation CA parameters $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. (a) An effecetive immune response for $\\theta_{lys}=0.3$. (b) A more ineffective, but still effective, adaptive response is here represented, with $\\theta_{lys}=10$. (b) A value of the intrinsic cytotoxic capacity $\\theta_{lys}=100$ is set for the most ineffective immune system. As shown in Tab.~\\ref{tab:4}, the intrinsic cytotoxic potential of the T cells is chiefly represented by parameter $s$ in Eq.~\\eqref{eq:8}.}\n \\label{fig:6}\n \\end{figure}\n\n\\begin{table}\n\\centering\n\\resizebox*{11.2cm}{4.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.17cm][0.3cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(e) &day$^{-1}$ & $9.22$ & Saturation level of the fractional tumor cell kill \\\\\n$d$(s) & & $9.62$ &  \\\\\n$d$(i) & & $9.52$ & \\\\\n$\\lambda$(e) &None  & $0.50$ & Exponent of the fractional tumor cell kill \\\\\n$\\lambda$(s) &  & $0.51$ &  \\\\\n$\\lambda$(i) &  & $0.55$ &  \\\\\n$s$(e) &cells$^{\\lambda-1}$ & $1.0\\times10^{-5}$ & Steepness coefficient of the fractional tumor cell kill \\\\\n$s$(s) & & $1.4\\times10^{-4}$ &  \\\\\n$s$(i) & & $9.5\\times10^{-4}$ &  \\\\\n\n\\hline\n\\end{tabular}}\n\\caption{The parameter values of the fractional cell kill law appearing in Eq.~\\eqref{eq:8}. These parameters are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model (see Fig.~\\ref{fig:6}). Three cases are represented: an effective (e), a semi-effective (s) and inneffective immune responses (i). Note that it is only the parameter $s$, which is related to the intrinsic cytotoxic capacity, that varies substantially. It increases as the immune cells become less effective.}\n\\label{tab:4}\n\\end{table}\n\n\\section{Discussion} \\label{sec:dis}\n\nOur study demonstrates that the saturation of the fractional cell kill of tumor cells by their cytotoxic opponents is a consequence of cell crowding. This limitation depends on the morphology of the tumor, insofar as geometry restricts the access of effector cells to tumor cells. In theory, those tumor growing with ``spherical symmetry\" will be the harder to lyse, because many layers of tumor cells have to be erased to reach the cells at the center. We recall that the process of T cell recruitment from circulation to the tumor site is complex, involving several steps \\citep{recr}. This implies that the crowding might happen before contact with the tumor occurs, as for example, during adhesion to the endothelium. In such a case, a relation between the parameters in the fractional cell kill law and the shape of the tumor can not be established. At all events, mathematically, this extrinsic barrier to the lytic capacity of the effector cells is reflected in the parameters $d$ and $\\lambda$. The more accessible the tumor cells are, the higher both of these parameters. Interestingly, the values of $\\lambda$ are expected to be between zero and one, as suggested by the experiments and the simulations. From the enzymatic kinetics point of view, if we think of Eq.~\\eqref{eq:8} as a Hill function depending on the effector cells, this can be interpreted as non-cooperative binding. Certainly, if we pay attention to the process of lysis only, the best that an immune cell can do to another is not to interpose between itself and their adversaries. Of course, cooperative effects exist, as the recruitment term exemplifies. Quite the opposite, as the intrinsic lytic capacity of cytotoxic cells is decreased, saturation gradually vanishes. This capability is inversely proportional to the parameter $s$. It is not surprising that the limit $d E^{\\lambda}/s$ dictates the lysis when the immune response is ineffective. This occurs because saying that a small fraction of a cytotoxic cell population $f E$ interacts with a tumor is, to what the tumor concerns, equivalent to considering a small number of effector cells confronting a big tumor. \n\n\n\\section*{Aknowledgments}  \\label{sec:aknow}\n\nThis work has received financial support by the Spanish Ministry of Economy and Competitivity under project number FIS2013-40653-P. \n\n\\begin{appendices}\n \\setcounter{equation}{0} \n\\section{Cellular automaton rules} \\label{app:caraa}\n  \nThe CA rules are described for the two steps, one corresponding to the development of the tumors, and the other related to the lysis of the tumor cells by the cytotoxic T cells. They are almost the same as those used in \\cite{cahyb}, and any difference will be explicitely remarked. In what follows, $T(\\vec{x})$ and $E(\\vec{x})$ are the tumor and immune cells at position $\\vec{x}$, while $N(\\vec{x})$ and $M(\\vec{x})$ are the concentration of nutrients in nondimensional variables at position $\\vec{x}$. $N(\\vec{x})$ represents those nutrients required for cell division, and $M(\\vec{x})$ those required for other cellular activities. The paramters $\\theta_{a}$ represent the intrinsic capacity of a cell to carry out a particular action $a$.\n  \n\\subsection{First step} \nAs in previous works, the role of the healthy cells is simplified to passive competitors for nutrients that allow the tumor cells to freely divide or migrate. At each CA iteration the tumor cells are randomly selected one by one, and a dice is rolled to choose weather each of these cell divides (1), migrates (2) or dies (3).\n\\begin{enumerate}\n\\item A tumor cell divides with probability\n\n", "itemtype": "equation", "pos": 41999, "prevtext": "\nwith $h(T)=s T^{\\lambda}$. Written this way, the fractional cell kill clearly states that the more effector cells, the greater the fractional cell kill, but bearing in mind the saturation of antigen-mediated immune response, which depends on the tumor burden. We propose that the saturation is due to the crowding of immune effector cells, which is evident if we recall that these cells need to be in contact with tumor cells to exterminate them. In a solid tumor, once all the tumor cells on its surface are in contact with a first line of immune cells, the remaining effector cells are not lysing, although the adjacent lines behind probably contribute to immune stimulation through several feedback mechanisms. Therefore, at a certain point, no matter how many more immune cells are present in the region of interest, the rate at which the tumor is lysed remains practically unaltered. Before saturation appears, if two tumors of the same nature and different size at a certain time instant are lysed at the same rate by the immune system, the bigger tumor will require more effector cells. Put more simply, if two tumors of different size are reduced to a particular fraction of its size after a certain period of time, the bigger tumor will require more effector cells. The number of effector cells $E$ for which the fractional tumor cell kill is half of its maximum $d$, increases monotonically with the tumor size $h(T)$.\n\nWe use simulations to demonstrate that these assertions are sufficient to explain the fractional cell kill law, even though there might be others. With this purpose, for every tumor pictured in the previous section, we prepare co-cultures with different effector-to-target ratios. Then, we let the CA evolve and measure the lysis four hours later (see Fig.~\\ref{fig:lysed}). As previouly explained, the tumors have been projected before the lysis starts, to better correlate the geometry and the parameters in the fractional cell kill. Otherwise, we would have two-dimensionally distributed lymphocytes fighting three-dimensional-like tumors, as in \\cite{cahyb}. Finally, the results are fitted to the ODE model using a least-squares fitting method. We recall that such model was validated using as initial conditions typical cell populations of $10^{6}$ cells, while the CA automaton grid used can harbor at most $9\\times10^{4}$ cells. However, this is not a hurdle at all, since if desired, the cell populations in the ODE model can be renormalized and its parameters redefined so as the cell numbers coincide.\n\\begin{table}\n\\centering\n\\resizebox*{10.9cm}{5.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.21cm][0.21cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(s) &day$^{-1}$  & $9 \\pm 4$  & Saturation level of fractional tumor cell kill  \\\\\n$d$(p) & & $20 \\pm 1$ & \\\\\n$d$(f) & & $32 \\pm 2$ & \\\\\n$d$(d) & & $13 \\pm 3$ & \\\\\n$\\lambda$(s) &None  & $0.61 \\pm 0.07$ & Exponent of of fractional tumor cell kill \\\\\n$\\lambda$(p) & & $0.87 \\pm 0.04$ & \\\\\n$\\lambda$(f) & & $0.89 \\pm 0.03 $ & \\\\\n$\\lambda$(d) & & $0.63 \\pm 0.03$ & \\\\\n$s$ &None & $0.15$ & Steepness coefficient of fractional tumor cell kill  \\\\\n\n  &   &   &  \\\\\n\n$D_{F}$(s) &None & $1.09 \\pm 0.02$ & Box counting dimension of the boundary before the lysis starts \\\\\n$D_{F}$(p) &  & $1.21 \\pm 0.04$ & \\\\\n$D_{F}$(f) &  & $1.36 \\pm 0.02$ & \\\\\n$D_{F}$(d) &  & $1.72 \\pm 0.04$ & \\\\\n\\hline\n\\end{tabular}}\n\\caption{The parameter values modified in the model shown in Eqs.~\\eqref{eq:3}, \\eqref{eq:4} and \\eqref{eq:5} corresponding to an effective immune response. The parameters $\\lambda$ and $d$ are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model. The mean value and standard deviations is computed for each morphology using four different tumors sizes: spherical (s), papillary (p), filamentary (f) and disconnected (d).}\n\\label{tab:2}\n\\end{table}\n\n\nThe resulting lysis curves are depicted in Fig.~\\ref{fig:ajustelig} and the values of the parameters $d$, $\\lambda$ and $s$ in Eq.~\\eqref{eq:7} are listed in Table~\\ref{tab:2}, together with the fractal dimension $D_{F}$ of the contour of the initial tumors. Satellitosis is clearly appreciated as a consequence of T cell recruitment, and the resulting clusters of cells act like wave fronts that advance lysing the tumor. There is a correlation between the box counting dimension and the parameters $d$ and $\\lambda$ for the connected tumors examined, but this is not case for the disconnected one. In fact, the fractal dimension of the boundary of a solid tumor, is not generally a good measure concerning the cell mediated immune response. A counterexample suffices to convince ourselves, preventing us to search for power laws relating the parameters $d$ and $\\lambda$ and the fractal dimension. For example, the disconnected tumors shown in Fig.~\\ref{fig:tumors} have the highest dimensions, but this is because these tumors are very drilled, so most of the tumor cells are on its boundary. However, they are rather spherical, so that the part of the boundary that is in the center of the mass is not initially accessible to the immune system. On the other hand, a tumor with a similar distribution of cells, but none making contact among them, will have fractal dimension smaller than one, but close lytic rates. These facts explain the low values of $d$ and $\\lambda$ for such tumors, which are comparable to the spherical ones. Indeed, what matters to the cytotoxic cells is the accessibility to their enemies. The more tumor cells there are between an immune cell and a tumor cell, the lower the rate at which the effector cells kill their victims. This is starkly evident for the spherical tumors, which correspond to the smallest values of $d$ and $\\lambda$. \n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3a.eps}\n   \\label{subfig:sollig}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3b.eps}\n   \\label{subfig:paplig}\n   } \\\\\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3c.eps}\n   \\label{subfig:fillig}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.36\\linewidth,height=0.33\\linewidth] {figure3d.eps}\n   \\label{subfig:dislig}\n   } \\\\\n\\end{tabular}\n\\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ in immunocompetent environments. The parameter values of the CA related to the lysis, recruitment and inactivation are $\\theta_{lys}=0.3$, $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$, respectively. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. Here we show the results for four tumors. (a) The spherical tumor in Fig.~\\ref{subfig:sphe2}. (b) The papillary tumor in Fig.~\\ref{subfig:pap2}. (c) The filamentary tumor in Fig.~\\ref{subfig:fil4}. (d) The disconnected tumor in Fig.~\\ref{subfig:dis2}.}\n\\label{fig:ajustelig}\n\\end{figure}\n\nThus, according to our model, Eq.~\\eqref{eq:7} is a robust emergent property of the tumor-immune interaction depending on the spatial distribution of the tumor cells. It reflects the tumor size dependent saturation of an effective immune system, fruit of the crowding of the effector cells and the arduousness to establish contact with their adversaries. Nevertheless, it takes hours for the effector cells to fully lyse the tumors so far investigated, what denotes that this extrinsic limitation to the lytic capacity of the immune system is barely important compared to the immunoevasive maneuvers that tumor cells commonly orchestrate \\citep{hallmarks}.\n\n\\subsection{Ineffective immune response}\n\nTumor cells find ways to evade the immune surveillance through a broad range of mechanisms \\citep{biocan}. They can acquire the ability to repress tumor antigens, MHC class I proteins or NKG2D ligands. They may also learn to destroy receptors or to saturate them, induce suppressor T cells formation, launch counterattacks against immunocytes by releasing cytokines, avoid apoptosis, etc. It is therefore pertinent to ask ourselves if the law can cover situations in which the tumor microenvironment is immunodeficient. \n\nIn \\cite{validpilis} the authors show that the lysis curves corresponding to NK cells in the experiments borrowed from \\cite{nkg2d} do not show saturation, and that a fractional cell kill given by a simple power law $cE^{\\nu}$ works to fit such data. Because much higher values of the effector-to-target ratio are required to obtain similar values for the lysis compared to the CTLs curves, it was suggested that when the effector cells are less effective, saturation is not observed. \n\nMathematical arguments have been given \\citep{validbul} to explain this lack of saturation. Briefly, when the cytotoxic cells are less effective, only a fraction $f$ of the effector cells are interacting with the tumor. Thus we can replace $E$ by $f E$ in the fractional cell kill. Now, defining $\\tilde{s}=s /f^{\\lambda}$, the fractional cell kill law remaings unchanged. This suggests that the parameter $s$ is related to the effectiveness of the cytotoxic cells, being this parameter inversely proportional to the effectiveness of such cells. On the other hand, if the effectiveness is small enough ($f\\ll1$), then $h(T)$ dominates over $E^{\\lambda}$ in Eq.~\\eqref{eq:7}, as long as $E$ is not too high. The resulting lysis term becomes $d f^{\\lambda} E^{\\lambda} T^{1-\\lambda}/s$. This legitimates the estimation $c E^{\\nu}T$ that has been used in other works \\citep{validpilis,validbul} to reproduce the fractional cell kill of tumor cells. Nevertheless, here we do not want to introduce phenomenological laws of this type, but rather concentrate our efforts on the significance of $s$. To this end, we diminish the intrinsic cytotoxic capacity of the immune cells, which is encoded in the parameter $\\theta_{lys}$ in our cellular automaton. Higher values of this parameter represent more ineffective T cells. The results can be seen in Fig.~\\ref{fig:lysnoneffec} and the values of the parameters are listed in Table~\\ref{tab:3}. As we increase the parameter $\\theta_{lys}$, the lysis curves become progressively less convex, and at a certain point they look concave. \n\nWhen $\\theta_{lys}=10$, the ODE model can be adjusted to the CA results. However, increasing $s$ is not sufficient to reproduce this data, and considerable variations of the remaining parameters $d$ and $\\lambda$ is required. A much more dramatic case arises when $\\theta_{lys}=100$. In this case we have not been able to find any values of the parameters that represents faithfully the CA results. The best fitting provided by the ODE model exhibits strong saturation. The conclussion is that the fractional cell kill law represented by Eq.~\\eqref{eq:7} works bad for immunodefficient environments and also confuses the geometrical effects and the intrinsic cytotoxic capacity of the immune cells. In the next section, we propose a new fractional cell kill law that allows to fit the results more accurately by simply reducing the value of $s$.\n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.38\\linewidth,height=0.34\\linewidth] {figure4a.eps}\n   \\label{subfig:none1}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.43\\linewidth,height=0.35\\linewidth] {figure4b.eps}\n   \\label{subfig:none2}\n   } \\\\\n\\end{tabular}\n\\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ in immunosuppressed environments. The spherical tumor represented in Fig.~\\ref{subfig:sphe2} is studied, with recruitment and inactivation CA parameters $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. (a) A more ineffective, but still effective, adaptive response is here represented, with $\\theta_{lys}=10$. (b) A value of the intrinsic cytotoxic capacity $\\theta_{lys}=100$ is set for the most ineffective immune system.}\n\\label{fig:lysnoneffec}\n\\end{figure}\n\n\\subsection{Modification of the fractional cell kill law}\n\nIn \\cite{validbul}, the particular nature of the function $h(T)$ appearing in Eq.~\\eqref{eq:7} was also discussed, proving that if instead of $h(T)=s T^{\\lambda}$, $h(T)=s T^{\\lambda+\\Delta \\lambda}$ is used, the empirical results can also be validated by simply decreasing the value of $s$, even for values $\\Delta \\lambda/\\lambda$ greater that one. This means that the original proposal of a saturating fractional cell kill depending on the quotient $E/T$ can not be guaranteed. \n\\begin{figure}\n\\centering\n\\begin{tabular}{cccc}\n\\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5a.eps}\n   \\label{subfig:sol00025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5b.eps}\n   \\label{subfig:sol0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5c.eps}\n   \\label{subfig:sol0025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5d.eps}\n   \\label{subfig:sol075}\n   } \\\\\n \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5e.eps}\n   \\label{subfig:pap0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5f.eps}\n   \\label{subfig:pap00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5g.eps}\n   \\label{subfig:pap0025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5h.eps}\n   \\label{subfig:pap025}\n   } \\\\\n    \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5i.eps}\n   \\label{subfig:fil00025}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5j.eps}\n   \\label{subfig:fil00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5k.eps}\n   \\label{subfig:fil0017}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5l.eps}\n   \\label{subfig:fil0025}\n   } \\\\\n       \\subfigure[]{\n  \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5m.eps}\n   \\label{subfig:dis0005}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5n.eps}\n   \\label{subfig:dis00075}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5o.eps}\n   \\label{subfig:dis0015}\n   } &\n\\subfigure[]{\n   \\includegraphics[width=0.22\\linewidth,height=0.22\\linewidth] {figure5p.eps}\n   \\label{subfig:dis0025}\n   } \\\\\n\\end{tabular}\n\\caption{Lysed tumors after four hours for different effector-to-target ratios. The effector cells (green) form satellites that advance destroying their neoplastic enemies (violet) and leave apoptotic bodies (light gray) behind them, ready to be phagocytosed. The parameter values of the CA are $\\theta_{lys}=0.3$, $\\theta_{rec}=1.0$, $\\theta_{inc}=0.5$, $\\lambda_{M}=10$, $\\lambda_{N}=25$ and $\\alpha=2/L$. (a-d) Spherical tumor in Fig.~\\ref{subfig:sphe2} with $E_{0}/T_{0}$ taking values on the set $\\{0.0025,0.005, 0.05, 0.75\\}$, respectively. (e-h) Papillary tumor in Fig.~\\ref{subfig:pap2} with $E_{0}/T_{0}$ taking values on the set $\\{0.005, 0.0075, 0.025, 0.25 \\}$, respectively. (i-l) Filamentary tumor in Fig.~\\ref{subfig:fil4} with $E_{0}/T_{0}$ taking values on the set $\\{0.0025,0.0075,0.025, 0.017\\}$, respectively. (m-p) Disconnected tumor in Fig.~\\ref{subfig:dis2} with $E_{0}/T_{0}$ taking values on the set $\\{0.005, 0.0075$, $0.015, 0.025\\}$, respectively.}\n\\label{fig:lysed}\n\\end{figure}\n\n\n\\begin{table}\n\\centering\n\\resizebox*{11.9cm}{3.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.17cm][0.3cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(s) &day$^{-1}$ & $3.80$ & Saturation level of the fractional tumor cell kill \\\\\n$d$(i) & & $1.56$ & \\\\\n$\\lambda$(s) &None  & $0.62$ & Exponent of the fractional tumor cell kill \\\\\n$\\lambda$(i) &  & $0.17$ &  \\\\\n$s$(s) &None & $0.50$ & Steepness coefficient of the fractional tumor cell kill \\\\\n$s$(i) & & $1.10$ &  \\\\\n\n\\hline\n\\end{tabular}}\n\\caption{The parameter values of the fractional cell kill law given by Eq.~\\eqref{eq:7}. These parameters are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model (see Fig.~\\ref{fig:lysnoneffec}. Two cases are represented: a very ineffective (i) and a semi-effective (s) immune responses.\n}\n\\label{tab:3}\n\\end{table}\n\nFurthermore, from a theoretical point of view, the function $h(T)=sT^{\\lambda}$ makes the model ill-defined in the limit of very big tumors ($T \\rightarrow \\infty$) facing a comparably small fixed number of immune cells. The reason is that in this limit we get unbounded velocity for the lysis ($K(E,T)T \\rightarrow  \\infty$). We demonstrate that $h(T)=s T$ is a much better choice. It has been shown \\citep{tils, micaelis} that for a fixed number of effector cells $E_{0}$, the Michaelis-Menten kinetics govern the lysis of tumor cells. The  value of the lytic velocity at tumor saturation, \\emph{i.e.}, when $T \\rightarrow \\infty$, is reported in such works as a measure of the intrinsic cytotoxic capability of a particular number of effector cells. A Michaelis-Menten decay in Eq.~\\eqref{eq:3} is obtained for a constant value of effector cells as long as $h(T)=sT$ in used. The value at saturation for a fixed number of effector cells is then $d E_{0}^{\\lambda}/s$. An argument supporting saturation comes from the following fact. If the number of tumor cells is much higher than a fixed number of effector cells, the velocity at which the tumor cells are lysed can not be enhanced by increasing the number of the neoplastic cells. This occurs because T cells kill tumor cells one by one, and for such ratios all the effector cells are already busy fighting other cells. In a similar fashion, for an enzymatic reaction, one can not increase arbitrarily the velocity at which the products are formed by simply adding more substrate. Precisely, this reasoning is reminiscent of the original formulation proposed by \\cite{immutu}, in which the cell populations are regarded as chemical species obeying enzymatic kinetics in the quasi-steady state regime. In such work, the tumor cells are the substrate, the effector cells are the enzyme and the products are the dead cells. Indeed, it can be analitically demonstrated that such kinetics governs the lysis of tumor cells in the cited model for a constant number of effector cells (see Appendix \\ref{app:foobar}). A fractional cell kill law that yields bounded velocity for the lysis of tumor cells when any of these two cell populations is sufficiently high compared to the other is represented by\n\n", "index": 5, "text": "\\begin{equation}\nK(E,T)=d\\frac{E^{\\lambda}}{s T + E^{\\lambda}}.\n\\label{eq:8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"K(E,T)=d\\frac{E^{\\lambda}}{sT+E^{\\lambda}}.\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mfrac><msup><mi>E</mi><mi>λ</mi></msup><mrow><mrow><mi>s</mi><mo>⁢</mo><mi>T</mi></mrow><mo>+</mo><msup><mi>E</mi><mi>λ</mi></msup></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n    \nThis probability is compared to a randomly generated number with normal distribution and the same standard deviation. If the former is greater than the last, division takes place. The higher the value of $\\theta_{div}$, the more metabolic requirements for a cell to proliferate. When a cell at position $\\vec{x}=(x,y)$ divides, if there are neighboring CA elements that are not currently occupied by tumor cells, we randomly select one $\\vec{x'}=(x',y')$ and place there the newborn cell, thus making $T(\\vec{x'})=1$ and $H(\\vec{x'})=0$ or $D(\\vec{x'})=0$, where $D(\\vec{x})$ is the function representing the necrotic cells at position $\\vec{x}$. However, if all the neighboring elements are occupied, we let the cells pile up, making $T(\\vec{x}) \\rightarrow T(\\vec{x})+1$. \n\\item A tumor cell migrates with probability\n\n", "itemtype": "equation", "pos": 50906, "prevtext": "\n\nFollowing the point of view of \\cite{immutu}, this law can be regarded as a Michaelis-Menten kinetics where the rate constants of the formation of the ``enzyme-substrate\" conjugates, their dissociation and their conversion to product depend nonlinearly (as power laws) on the enzyme concentration. It establishes the saturation of the velocity of the lysis of tumor cells for both the tumor and the immune cell populations. In Fig.~\\ref{subfig:6a} we first reproduce the experiments of the spherical tumor shown in Fig.~\\ref{subfig:sphe3} for $\\theta_{lys}=0.3$. This allows us to obtain the parameter values of the modified fractional cell kill law shown in Eq.~\\eqref{eq:8}. Then we carry out the simulations of the preeceding section for immunodeficient evironments and see how, mainly by increasing the value of $s$, the CA results are reproduced (see Figs.~\\ref{subfig:6b} and ~\\ref{subfig:6c}). The parameter values are listed in Table.~\\ref{tab:4}. This sheds light into the significance of this parameter, which is now manifestly related to the intrinsic cytotoxic potential of the T cells. Moreover, this implies that the limit $T \\rightarrow \\infty$, for which the quantity $d E^{\\lambda}/s$ is obtained, is not a good measure of lymphocyte cytotoxicity, as suggested in \\cite{tils, micaelis}. This limit, which for a constant value of the T cells implies a linear decay of the tumor, involves geometry as well. If we consider that there is just one immune cell, and it takes this cell an hour to lyse a tumor cell, then a spherical tumor would be reduced at approximately one cell per hour (assuming that this immune cell does not become inactivated at some step). However, if we think of more sophisticated geometries, the T cell migh have to travel noticeable distances to reach new tumor cells after lysing a certain tumor cell. Therefore, the geometry of the tumor, which is coded in the parameters $d$ and $\\lambda$, clearly affects how fast this single cell can erase it. \n\nEven though the reduction of saturation for ordinary values of the effector-to-target ratio can be justified mathematically and numerically, the change in curvature for the CA results appearing in Fig.~\\ref{subfig:6c} is hard to put on a rational basis. Since $0<\\lambda<1$, the quantity $d E^{\\lambda}/s$, as a fucntion of $E$, will always have negative curvature. Therefore, a positive feedback mechanism is required to explain the change in curvature. A candidate mechanism responsible of this phenomenon is effector cell recruitment. As the effectiveness of the T cells decreases, this terms become increasingly important. Further research concerning this mathematical function is deserved.\n\\begin{figure}\n \\centering\n \\begin{tabular}{cc}\n \\subfigure[]{\n    \\includegraphics[width=0.44\\linewidth] {figure6a.eps}\n    \\label{subfig:6a}\n    } &\n \\subfigure[]{\n    \\includegraphics[width=0.49\\linewidth] {figure6b.eps}\n    \\label{subfig:6b}\n    } \\\\\n \\multicolumn{2}{c}{\n  \\subfigure[]{\n     \\includegraphics[width=0.50\\linewidth] {figure6c.eps}\n     \\label{subfig:6c}\n     }\n     }   \n \\end{tabular}\n \\caption{The lysis of tumor cells after four hours versus the effector-to-target ratio $E_{0}/T_{0}$ for increasing inneffectiveness of the lymphocytes. The spherical tumor represented in Fig.~\\ref{subfig:sphe2} is studied, with recruitment and inactivation CA parameters $\\theta_{rec}=1.0$ and $\\theta_{inc}=0.5$. The solid curve corresponds to the ODE model, while the points correspond to the cellular automaton results. (a) An effecetive immune response for $\\theta_{lys}=0.3$. (b) A more ineffective, but still effective, adaptive response is here represented, with $\\theta_{lys}=10$. (b) A value of the intrinsic cytotoxic capacity $\\theta_{lys}=100$ is set for the most ineffective immune system. As shown in Tab.~\\ref{tab:4}, the intrinsic cytotoxic potential of the T cells is chiefly represented by parameter $s$ in Eq.~\\eqref{eq:8}.}\n \\label{fig:6}\n \\end{figure}\n\n\\begin{table}\n\\centering\n\\resizebox*{11.2cm}{4.0cm}{\n\\begin{tabular}{|c c l l|}\n\\hline\n\\rowcolor[gray]{0.95}[0.17cm][0.3cm]Parameter &Units  &Value &Description\\\\\n\\hline\n$d$(e) &day$^{-1}$ & $9.22$ & Saturation level of the fractional tumor cell kill \\\\\n$d$(s) & & $9.62$ &  \\\\\n$d$(i) & & $9.52$ & \\\\\n$\\lambda$(e) &None  & $0.50$ & Exponent of the fractional tumor cell kill \\\\\n$\\lambda$(s) &  & $0.51$ &  \\\\\n$\\lambda$(i) &  & $0.55$ &  \\\\\n$s$(e) &cells$^{\\lambda-1}$ & $1.0\\times10^{-5}$ & Steepness coefficient of the fractional tumor cell kill \\\\\n$s$(s) & & $1.4\\times10^{-4}$ &  \\\\\n$s$(i) & & $9.5\\times10^{-4}$ &  \\\\\n\n\\hline\n\\end{tabular}}\n\\caption{The parameter values of the fractional cell kill law appearing in Eq.~\\eqref{eq:8}. These parameters are obtained through a least-square fitting of the lysis of tumor cells between the CA simulations and the ODE model (see Fig.~\\ref{fig:6}). Three cases are represented: an effective (e), a semi-effective (s) and inneffective immune responses (i). Note that it is only the parameter $s$, which is related to the intrinsic cytotoxic capacity, that varies substantially. It increases as the immune cells become less effective.}\n\\label{tab:4}\n\\end{table}\n\n\\section{Discussion} \\label{sec:dis}\n\nOur study demonstrates that the saturation of the fractional cell kill of tumor cells by their cytotoxic opponents is a consequence of cell crowding. This limitation depends on the morphology of the tumor, insofar as geometry restricts the access of effector cells to tumor cells. In theory, those tumor growing with ``spherical symmetry\" will be the harder to lyse, because many layers of tumor cells have to be erased to reach the cells at the center. We recall that the process of T cell recruitment from circulation to the tumor site is complex, involving several steps \\citep{recr}. This implies that the crowding might happen before contact with the tumor occurs, as for example, during adhesion to the endothelium. In such a case, a relation between the parameters in the fractional cell kill law and the shape of the tumor can not be established. At all events, mathematically, this extrinsic barrier to the lytic capacity of the effector cells is reflected in the parameters $d$ and $\\lambda$. The more accessible the tumor cells are, the higher both of these parameters. Interestingly, the values of $\\lambda$ are expected to be between zero and one, as suggested by the experiments and the simulations. From the enzymatic kinetics point of view, if we think of Eq.~\\eqref{eq:8} as a Hill function depending on the effector cells, this can be interpreted as non-cooperative binding. Certainly, if we pay attention to the process of lysis only, the best that an immune cell can do to another is not to interpose between itself and their adversaries. Of course, cooperative effects exist, as the recruitment term exemplifies. Quite the opposite, as the intrinsic lytic capacity of cytotoxic cells is decreased, saturation gradually vanishes. This capability is inversely proportional to the parameter $s$. It is not surprising that the limit $d E^{\\lambda}/s$ dictates the lysis when the immune response is ineffective. This occurs because saying that a small fraction of a cytotoxic cell population $f E$ interacts with a tumor is, to what the tumor concerns, equivalent to considering a small number of effector cells confronting a big tumor. \n\n\n\\section*{Aknowledgments}  \\label{sec:aknow}\n\nThis work has received financial support by the Spanish Ministry of Economy and Competitivity under project number FIS2013-40653-P. \n\n\\begin{appendices}\n \\setcounter{equation}{0} \n\\section{Cellular automaton rules} \\label{app:caraa}\n  \nThe CA rules are described for the two steps, one corresponding to the development of the tumors, and the other related to the lysis of the tumor cells by the cytotoxic T cells. They are almost the same as those used in \\cite{cahyb}, and any difference will be explicitely remarked. In what follows, $T(\\vec{x})$ and $E(\\vec{x})$ are the tumor and immune cells at position $\\vec{x}$, while $N(\\vec{x})$ and $M(\\vec{x})$ are the concentration of nutrients in nondimensional variables at position $\\vec{x}$. $N(\\vec{x})$ represents those nutrients required for cell division, and $M(\\vec{x})$ those required for other cellular activities. The paramters $\\theta_{a}$ represent the intrinsic capacity of a cell to carry out a particular action $a$.\n  \n\\subsection{First step} \nAs in previous works, the role of the healthy cells is simplified to passive competitors for nutrients that allow the tumor cells to freely divide or migrate. At each CA iteration the tumor cells are randomly selected one by one, and a dice is rolled to choose weather each of these cell divides (1), migrates (2) or dies (3).\n\\begin{enumerate}\n\\item A tumor cell divides with probability\n\n", "index": 7, "text": "\\begin{equation}\nP_{div}=1-\\exp\\left(-\\dfrac{(N/T)^{2}}{\\theta_{div}^{2}}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P_{div}=1-\\exp\\left(-\\dfrac{(N/T)^{2}}{\\theta_{div}^{2}}\\right).\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>d</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>v</mi></mrow></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>N</mi><mo>/</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msubsup><mi>θ</mi><mrow><mi>d</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>v</mi></mrow><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n    \nIf $P_{mig}$ is greater than the probability of a randomly generated number, migration proceeds, otherwise it does not. The higher the value of $\\theta_{mig}$, the more metabolic requirements for a cell to migrate, unless there are too many tumor cells. When a cell at position $\\vec{x}$ moves, if there are neighboring CA elements that are not currently occupied by tumor cells, we randomly select one at $\\vec{x'}$ and place the cell there. If there is more than one cell in the original position, the moving cell simply replaces the healthy or the necrotic cell, thus making the transformation $T(\\vec{x}) \\rightarrow T(\\vec{x})-1$, $T(\\vec{x'})=1$ and $H(\\vec{x'})=0$ or $D(\\vec{x'})=0$. \n\\item On the other hand, if there is only one tumor cell at $\\vec{x}$, then it interchanges its position with the healthy or necrotic cell at $\\vec{x'}$. If all the neighboring elements are occupied, we displace the cell to a randomly selected neighboring element.\n\\item A tumor cell dies with probability\n\n", "itemtype": "equation", "pos": 51828, "prevtext": "\n    \nThis probability is compared to a randomly generated number with normal distribution and the same standard deviation. If the former is greater than the last, division takes place. The higher the value of $\\theta_{div}$, the more metabolic requirements for a cell to proliferate. When a cell at position $\\vec{x}=(x,y)$ divides, if there are neighboring CA elements that are not currently occupied by tumor cells, we randomly select one $\\vec{x'}=(x',y')$ and place there the newborn cell, thus making $T(\\vec{x'})=1$ and $H(\\vec{x'})=0$ or $D(\\vec{x'})=0$, where $D(\\vec{x})$ is the function representing the necrotic cells at position $\\vec{x}$. However, if all the neighboring elements are occupied, we let the cells pile up, making $T(\\vec{x}) \\rightarrow T(\\vec{x})+1$. \n\\item A tumor cell migrates with probability\n\n", "index": 9, "text": "\\begin{equation}\nP_{mig}=1-\\exp\\left(-\\dfrac{(\\sqrt{T}M)^{2}}{\\theta_{mig}^{2}}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"P_{mig}=1-\\exp\\left(-\\dfrac{(\\sqrt{T}M)^{2}}{\\theta_{mig}^{2}}\\right).\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>g</mi></mrow></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msqrt><mi>T</mi></msqrt><mo>⁢</mo><mi>M</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msubsup><mi>θ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>g</mi></mrow><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n        \nIf $P_{nec}$ is higher than the probability of a randomly generated number, necrosis proceeds, otherwise it does not. The higher the value of $\\theta_{nec}$, the greater the probability for a cell to die. When a cell at position $\\vec{x}$ dies, we make $T(\\vec{x}) \\rightarrow T(\\vec{x})-1$. If this is the only cell at $\\vec{x}$, then $D(\\vec{x})=1$.\n\\end{enumerate} \n    \n\\subsection{Second step}\n\nAt each CA iteration the immune cells that have one or more tumor cells as first neighbors, carry out an attempt to lyse a randomly chosen surrounding tumor cell. This process occurs with probability\n\n", "itemtype": "equation", "pos": 52935, "prevtext": "\n    \nIf $P_{mig}$ is greater than the probability of a randomly generated number, migration proceeds, otherwise it does not. The higher the value of $\\theta_{mig}$, the more metabolic requirements for a cell to migrate, unless there are too many tumor cells. When a cell at position $\\vec{x}$ moves, if there are neighboring CA elements that are not currently occupied by tumor cells, we randomly select one at $\\vec{x'}$ and place the cell there. If there is more than one cell in the original position, the moving cell simply replaces the healthy or the necrotic cell, thus making the transformation $T(\\vec{x}) \\rightarrow T(\\vec{x})-1$, $T(\\vec{x'})=1$ and $H(\\vec{x'})=0$ or $D(\\vec{x'})=0$. \n\\item On the other hand, if there is only one tumor cell at $\\vec{x}$, then it interchanges its position with the healthy or necrotic cell at $\\vec{x'}$. If all the neighboring elements are occupied, we displace the cell to a randomly selected neighboring element.\n\\item A tumor cell dies with probability\n\n", "index": 11, "text": "\\begin{equation}\nP_{nec}=\\exp\\left(-\\dfrac{(M/T)^{2}}{\\theta_{nec}^{2}}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"P_{nec}=\\exp\\left(-\\dfrac{(M/T)^{2}}{\\theta_{nec}^{2}}\\right).\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>n</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>=</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>M</mi><mo>/</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msubsup><mi>θ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>c</mi></mrow><mn>2</mn></msubsup></mfrac></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\nwhere $\\eta_{n}$ indicates summation up to the $n$-th nearest neighbors. If $P_{lys}$ is higher than the probability of a randomly generated number, then the selected tumor cell dies. Therefore $T(\\vec{x'})=0$, $D(\\vec{x'})=1$ and the immune cell counter decreases by a unit.  \nIf the counter reaches a value of zero, it dies and it is replaced by a healthy cell. The smaller the value of $\\theta_{lys}$, the greater the probability for an effector cell to lyse a tumor cell. This parameter was not present in \\cite{cahyb} and is introduced here to model the intrinsic cytotoxicity of T cells. When a tumor cell is destroyed by an immune cell, the first neighboring cells are flagged for recruitment. For each CA element without tumor cells a new immune cell is born with probability\n\n", "itemtype": "equation", "pos": 53639, "prevtext": "\n        \nIf $P_{nec}$ is higher than the probability of a randomly generated number, necrosis proceeds, otherwise it does not. The higher the value of $\\theta_{nec}$, the greater the probability for a cell to die. When a cell at position $\\vec{x}$ dies, we make $T(\\vec{x}) \\rightarrow T(\\vec{x})-1$. If this is the only cell at $\\vec{x}$, then $D(\\vec{x})=1$.\n\\end{enumerate} \n    \n\\subsection{Second step}\n\nAt each CA iteration the immune cells that have one or more tumor cells as first neighbors, carry out an attempt to lyse a randomly chosen surrounding tumor cell. This process occurs with probability\n\n", "index": 13, "text": "\\begin{equation}\nP_{lys}=1-\\exp\\left(-\\dfrac{1}{\\theta_{lys}^{2}}\\left(\\sum_{i\\in\\eta_{1}}E_{i}\\right)^{2}\\right),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"P_{lys}=1-\\exp\\left(-\\dfrac{1}{\\theta_{lys}^{2}}\\left(\\sum_{i\\in\\eta_{1}}E_{i}%&#10;\\right)^{2}\\right),\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>l</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><msubsup><mi>θ</mi><mrow><mi>l</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow><mn>2</mn></msubsup></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>∈</mo><msub><mi>η</mi><mn>1</mn></msub></mrow></munder><msub><mi>E</mi><mi>i</mi></msub></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nIf $P_{rec}$ is higher than the probability of a randomly generated number, recruitment proceeds. The higher the value of $\\theta_{rec}$, the less surrounding tumor cells that are required for T cell recruitment to success. When a cell is recruited at position $\\vec{x'}$, we make $D(\\vec{x'})=0$ or $H(\\vec{x'})=0$, and $E(\\vec{x'})=1$. \n        \nThose effector cells which immediate neighborhood is not occupied by tumor cells, either migrate or become inactivated. To decide which of these two processes is carried out, a coin is flipped. If the output is migration, it occurs for sure. In the opposite case, inactivation occurs with probability\n\n", "itemtype": "equation", "pos": 54553, "prevtext": "\nwhere $\\eta_{n}$ indicates summation up to the $n$-th nearest neighbors. If $P_{lys}$ is higher than the probability of a randomly generated number, then the selected tumor cell dies. Therefore $T(\\vec{x'})=0$, $D(\\vec{x'})=1$ and the immune cell counter decreases by a unit.  \nIf the counter reaches a value of zero, it dies and it is replaced by a healthy cell. The smaller the value of $\\theta_{lys}$, the greater the probability for an effector cell to lyse a tumor cell. This parameter was not present in \\cite{cahyb} and is introduced here to model the intrinsic cytotoxicity of T cells. When a tumor cell is destroyed by an immune cell, the first neighboring cells are flagged for recruitment. For each CA element without tumor cells a new immune cell is born with probability\n\n", "index": 15, "text": "\\begin{equation}\nP_{rec}=\\exp\\left(-\\dfrac{1}{\\theta_{rec}^{2}}\\left(\\sum_{i\\in\\eta_{1}}T_{i}\\right)^{-2}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"P_{rec}=\\exp\\left(-\\dfrac{1}{\\theta_{rec}^{2}}\\left(\\sum_{i\\in\\eta_{1}}T_{i}%&#10;\\right)^{-2}\\right).\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>=</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><msubsup><mi>θ</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>c</mi></mrow><mn>2</mn></msubsup></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>∈</mo><msub><mi>η</mi><mn>1</mn></msub></mrow></munder><msub><mi>T</mi><mi>i</mi></msub></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\nIf $P_{inc}$ is higher than the probability of a randomly generated number, inactivation proceeds. The smaller the value of $\\theta_{inc}$, the less surrounding tumor cells that are required for a T cell to become inactivated. When a cell disappears from position $\\vec{x}$, we simply make $H(\\vec{x})=1$ and $E(\\vec{x})=0$.\n    \n \\setcounter{equation}{0} \n\\section*{APPENDIX B. The fractional cell kill law as a Michaelis-Menten kinetics} \\label{app:foobar}\n\nThe fractional cell kill law in Eq.~\\eqref{eq:8} can be derived from the Michaelis-Menten kinetics \\citep{micamen,mimen} assuming that the rate constants of the reaction depend on the enzyme concentration. During the process of lysis, the effector cells $E$ bound to the tumor cells $T$ forming complexes $C$, and dead tumor cells $T^{*}$ result from this interaction. Therefore, the tumor cells play the role of the substrate and the effector cells act as the enzyme. This cellular reaction can be written in the form\n\n", "itemtype": "equation", "pos": 55332, "prevtext": "\n\nIf $P_{rec}$ is higher than the probability of a randomly generated number, recruitment proceeds. The higher the value of $\\theta_{rec}$, the less surrounding tumor cells that are required for T cell recruitment to success. When a cell is recruited at position $\\vec{x'}$, we make $D(\\vec{x'})=0$ or $H(\\vec{x'})=0$, and $E(\\vec{x'})=1$. \n        \nThose effector cells which immediate neighborhood is not occupied by tumor cells, either migrate or become inactivated. To decide which of these two processes is carried out, a coin is flipped. If the output is migration, it occurs for sure. In the opposite case, inactivation occurs with probability\n\n", "index": 17, "text": "\\begin{equation}\nP_{inc}=1-\\exp\\left(-\\dfrac{1}{\\theta_{inc}^{2}}\\left(\\sum_{i\\in\\eta_{3}}T_{i}\\right)^{-2}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"P_{inc}=1-\\exp\\left(-\\dfrac{1}{\\theta_{inc}^{2}}\\left(\\sum_{i\\in\\eta_{3}}T_{i}%&#10;\\right)^{-2}\\right).\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><msubsup><mi>θ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>c</mi></mrow><mn>2</mn></msubsup></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>∈</mo><msub><mi>η</mi><mn>3</mn></msub></mrow></munder><msub><mi>T</mi><mi>i</mi></msub></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nOnce a tumor cell is induced to apoptosis it can not resurrect, so we must set $k_{-2}=0$. Generally, also the backward reaction represented by $k_{-1}$ should be disregarded, since after tumor cell recognition and complex formation, destruction proceeds. However, we keep this term for reasons explained bellow. \n\nAssuming that the law of mass action holds, the system of differential equations governing the reactions is\n\\begin{eqnarray}\n&\\dfrac{d [E]}{d t}&=-k_{1}[E][T]+(k_{-1}+k_{2})[C] \\label{eq:b2}\\bigskip\\\\\n&\\dfrac{d [T]}{d t}&=-k_{1}[E][T]+k_{-1}[C] \\label{eq:b3}\\bigskip\\\\\n&\\dfrac{d [C]}{d t}&=k_{1}[E][T]-(k_{-1}+k_{2})[C] \\label{eq:b4}\\bigskip\\\\\n&\\dfrac{d [T^{*}]}{d t}&=k_{2}[C]. \\label{eq:b5}\n\\end{eqnarray}\n\n\nThe Briggs-Haldane \\citep{brha} quasi-steady state approximation $\\dot{[C]}=0$ was assumed in \\cite{immutu}. This approximation requires\n\n", "itemtype": "equation", "pos": 56442, "prevtext": "\nIf $P_{inc}$ is higher than the probability of a randomly generated number, inactivation proceeds. The smaller the value of $\\theta_{inc}$, the less surrounding tumor cells that are required for a T cell to become inactivated. When a cell disappears from position $\\vec{x}$, we simply make $H(\\vec{x})=1$ and $E(\\vec{x})=0$.\n    \n \\setcounter{equation}{0} \n\\section*{APPENDIX B. The fractional cell kill law as a Michaelis-Menten kinetics} \\label{app:foobar}\n\nThe fractional cell kill law in Eq.~\\eqref{eq:8} can be derived from the Michaelis-Menten kinetics \\citep{micamen,mimen} assuming that the rate constants of the reaction depend on the enzyme concentration. During the process of lysis, the effector cells $E$ bound to the tumor cells $T$ forming complexes $C$, and dead tumor cells $T^{*}$ result from this interaction. Therefore, the tumor cells play the role of the substrate and the effector cells act as the enzyme. This cellular reaction can be written in the form\n\n", "index": 19, "text": "\\begin{equation}\nE+T \\underset{k_{-1}}{\\overset{k_{1}}{\\rightleftharpoons}} C \\underset{k_{-2}}{\\overset{k_{2}}{\\rightleftharpoons}} T^{*}+E.\n\\label{eq:b1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"E+T\\underset{k_{-1}}{\\overset{k_{1}}{\\rightleftharpoons}}C\\underset{k_{-2}}{%&#10;\\overset{k_{2}}{\\rightleftharpoons}}T^{*}+E.\" display=\"block\"><mrow><mrow><mi>E</mi><mo>+</mo><mrow><mi>T</mi><mo>⁢</mo><munderover accent=\"true\" accentunder=\"true\"><mo>⇌</mo><msub><mi mathsize=\"142%\">k</mi><mrow><mo mathsize=\"140%\" stretchy=\"false\">-</mo><mn mathsize=\"140%\">1</mn></mrow></msub><msub><mi>k</mi><mn>1</mn></msub></munderover><mo>⁢</mo><mi>C</mi><mo>⁢</mo><munderover accent=\"true\" accentunder=\"true\"><mo>⇌</mo><msub><mi mathsize=\"142%\">k</mi><mrow><mo mathsize=\"140%\" stretchy=\"false\">-</mo><mn mathsize=\"140%\">2</mn></mrow></msub><msub><mi>k</mi><mn>2</mn></msub></munderover><mo>⁢</mo><msup><mi>T</mi><mo>*</mo></msup></mrow><mo>+</mo><mi>E</mi></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\nwhere $K_{M}=(k_{-1}+k_{2})/k_{1}$ is the Michaelis constant, and $[E_{0}]$ and $[T_{0}]$ are the initial concentrations of the effector and the tumor cells respectively.\n\nBecause we are dealing with situations in which the substrate concentration can be smaller than the enzyme, the quasi-steady state approximation implies $K_{M}\\gg[E_{0}]$. Since this condition can not be generally guaranteed, instead, we consider Michaelis and Menten original formulation, and suppose that the substrate is in instantaneous equilibrium with the complex. We believe this is more reasonable, beacuse it takes about an hour for a cytotoxic T cell to fully lyse a tumor cell and, if the cells are effective, the recognition and complex formation should occur quite fast when brought together. In this manner, we have $k_{1}[E][T]=k_{-1}[C]$. From Eqs.~\\eqref{eq:b2} and~\\eqref{eq:b4} we get the conservation law $[E]+[C]=[E_{0}]$. These two equations put together and substituted in Eq.~\\eqref{eq:b5} yield\n\n", "itemtype": "equation", "pos": 57476, "prevtext": "\n\nOnce a tumor cell is induced to apoptosis it can not resurrect, so we must set $k_{-2}=0$. Generally, also the backward reaction represented by $k_{-1}$ should be disregarded, since after tumor cell recognition and complex formation, destruction proceeds. However, we keep this term for reasons explained bellow. \n\nAssuming that the law of mass action holds, the system of differential equations governing the reactions is\n\\begin{eqnarray}\n&\\dfrac{d [E]}{d t}&=-k_{1}[E][T]+(k_{-1}+k_{2})[C] \\label{eq:b2}\\bigskip\\\\\n&\\dfrac{d [T]}{d t}&=-k_{1}[E][T]+k_{-1}[C] \\label{eq:b3}\\bigskip\\\\\n&\\dfrac{d [C]}{d t}&=k_{1}[E][T]-(k_{-1}+k_{2})[C] \\label{eq:b4}\\bigskip\\\\\n&\\dfrac{d [T^{*}]}{d t}&=k_{2}[C]. \\label{eq:b5}\n\\end{eqnarray}\n\n\nThe Briggs-Haldane \\citep{brha} quasi-steady state approximation $\\dot{[C]}=0$ was assumed in \\cite{immutu}. This approximation requires\n\n", "index": 21, "text": "\\begin{equation}\n \\dfrac{[E_{0}]}{[T_{0}]+K_{M}}\\ll1,\n\\label{eq:b6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{[E_{0}]}{[T_{0}]+K_{M}}\\ll 1,\" display=\"block\"><mrow><mrow><mfrac><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mrow><mrow><mo stretchy=\"false\">[</mo><msub><mi>T</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mo>+</mo><msub><mi>K</mi><mi>M</mi></msub></mrow></mfrac><mo>≪</mo><mn>1</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nSo far, this is nothing else but the Michaelis-Menten kinetics. It is at this point that we have to consider a dependence of the rate constants of the reaction on the concentration of the effector cells. The mathematical relations are derived heuristically, based on the idea that for higher concentrations of the immune cells the rate constants vary in a such a manner that the reaction is pushed backwards. Since saturation is due to crowding of T cells, and this depends on the geometry of the tumor, it seems a natural choice to use power laws.\n\nOnce the first lines of effector cells cover the surface of a solid tumor, the remaining immune cells are not in contact with it. Alternatively, an equivalent argument is attained if we suppose that the non-interacting effector cells do interact with some tumor cells unsuccesfully (say ghost tumor cells), so that the complexes are dissociated without lysis. The more effector cells, the higher the rate of dissociation, and when the number of effector cells is small compared to the number of tumor cells, the dissociation should vanish. Therefore, we consider a power law dependence $k_{-1}([E_{0}])=\\kappa_{-1}[E_{0}]^{\\alpha}$, with $0<\\alpha<1$, as suggested from the experiments. Substitution in Eq.~\\eqref{eq:b7} yields\n\n", "itemtype": "equation", "pos": 58551, "prevtext": "\nwhere $K_{M}=(k_{-1}+k_{2})/k_{1}$ is the Michaelis constant, and $[E_{0}]$ and $[T_{0}]$ are the initial concentrations of the effector and the tumor cells respectively.\n\nBecause we are dealing with situations in which the substrate concentration can be smaller than the enzyme, the quasi-steady state approximation implies $K_{M}\\gg[E_{0}]$. Since this condition can not be generally guaranteed, instead, we consider Michaelis and Menten original formulation, and suppose that the substrate is in instantaneous equilibrium with the complex. We believe this is more reasonable, beacuse it takes about an hour for a cytotoxic T cell to fully lyse a tumor cell and, if the cells are effective, the recognition and complex formation should occur quite fast when brought together. In this manner, we have $k_{1}[E][T]=k_{-1}[C]$. From Eqs.~\\eqref{eq:b2} and~\\eqref{eq:b4} we get the conservation law $[E]+[C]=[E_{0}]$. These two equations put together and substituted in Eq.~\\eqref{eq:b5} yield\n\n", "index": 23, "text": "\\begin{equation}\n\\dfrac{d [T^{*}]}{d t}=k_{2}k_{1}[E_{0}]\\dfrac{[T]}{k_{1}[T]+k_{-1}}.\n\\label{eq:b7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{d[T^{*}]}{dt}=k_{2}k_{1}[E_{0}]\\dfrac{[T]}{k_{1}[T]+k_{-1}}.\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>T</mi><mo>*</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><msub><mi>k</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>k</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mfrac><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow><mrow><mrow><msub><mi>k</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><msub><mi>k</mi><mrow><mo>-</mo><mn>1</mn></mrow></msub></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nThe fractional cell production of dead cells in this equation already resembles very much to Eq.~\\eqref{eq:8}. To obtain the exact result we have to consider dependence of $k_{1}$ and $k_{2}$ on the effector concentration as well. Note that for the inverse reaction to take place complexes have to be formed first, and this requires some time. Therefore, saying that complexes dissociate without lysis is not exactly equivalent to stating that the complexes are not formed. These rates should decay for increasing concentrations of the effector cells, diminishing the rate of formation of complexes and products. Once again, we postulate power law relations in the form $k_{1}([E_{0}])=\\kappa_{1}[E_{0}]^{-\\beta}$ and $k_{2}([E_{0}])=\\kappa_{2}[E_{0}]^{-\\gamma}$ where again $0<\\beta<1$ and $0<\\gamma<1$. It might result surprising that in the limit $[E_{0}]\\rightarrow\\infty$ these functional relations tend to zero, suggesting that the reaction stops. However, this is not the case, because when subsituted in Eqs.~\\eqref{eq:b2},~\\eqref{eq:b3},~\\eqref{eq:b4} and~\\eqref{eq:b5}, $k_{1}([E])[E]$ and $k_{2}([E])[C]$ both increase with the number of effector cells. Replacing the rate functions in Eq.~\\eqref{eq:b8} we obtain\n\n", "itemtype": "equation", "pos": 59946, "prevtext": "\n\nSo far, this is nothing else but the Michaelis-Menten kinetics. It is at this point that we have to consider a dependence of the rate constants of the reaction on the concentration of the effector cells. The mathematical relations are derived heuristically, based on the idea that for higher concentrations of the immune cells the rate constants vary in a such a manner that the reaction is pushed backwards. Since saturation is due to crowding of T cells, and this depends on the geometry of the tumor, it seems a natural choice to use power laws.\n\nOnce the first lines of effector cells cover the surface of a solid tumor, the remaining immune cells are not in contact with it. Alternatively, an equivalent argument is attained if we suppose that the non-interacting effector cells do interact with some tumor cells unsuccesfully (say ghost tumor cells), so that the complexes are dissociated without lysis. The more effector cells, the higher the rate of dissociation, and when the number of effector cells is small compared to the number of tumor cells, the dissociation should vanish. Therefore, we consider a power law dependence $k_{-1}([E_{0}])=\\kappa_{-1}[E_{0}]^{\\alpha}$, with $0<\\alpha<1$, as suggested from the experiments. Substitution in Eq.~\\eqref{eq:b7} yields\n\n", "index": 25, "text": "\\begin{equation}\n\\dfrac{d [T^{*}]}{d t}=k_{2}k_{1}\\dfrac{[E_{0}]}{k_{1}[T]+\\kappa_{-1}[E_{0}]^{\\alpha}}[T].\n\\label{eq:b8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{d[T^{*}]}{dt}=k_{2}k_{1}\\dfrac{[E_{0}]}{k_{1}[T]+\\kappa_{-1}[E_{0}]^{%&#10;\\alpha}}[T].\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>T</mi><mo>*</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><msub><mi>k</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>k</mi><mn>1</mn></msub><mo>⁢</mo><mfrac><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mrow><mrow><msub><mi>k</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>κ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mi>α</mi></msup></mrow></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\nWe now rename the constants $\\lambda=\\alpha+\\beta$,  $s=\\kappa_{1}/\\kappa_{-1}$, $d=\\kappa_{1}\\kappa_{2}/\\kappa_{-1}$, and remember that the velocity for the lysis must remain bounded for $[E_{0}]\\rightarrow\\infty$, what imposes the constraint $\\alpha+\\beta+\\gamma=1$. Thus, the result is\n\n", "itemtype": "equation", "pos": 61309, "prevtext": "\n\nThe fractional cell production of dead cells in this equation already resembles very much to Eq.~\\eqref{eq:8}. To obtain the exact result we have to consider dependence of $k_{1}$ and $k_{2}$ on the effector concentration as well. Note that for the inverse reaction to take place complexes have to be formed first, and this requires some time. Therefore, saying that complexes dissociate without lysis is not exactly equivalent to stating that the complexes are not formed. These rates should decay for increasing concentrations of the effector cells, diminishing the rate of formation of complexes and products. Once again, we postulate power law relations in the form $k_{1}([E_{0}])=\\kappa_{1}[E_{0}]^{-\\beta}$ and $k_{2}([E_{0}])=\\kappa_{2}[E_{0}]^{-\\gamma}$ where again $0<\\beta<1$ and $0<\\gamma<1$. It might result surprising that in the limit $[E_{0}]\\rightarrow\\infty$ these functional relations tend to zero, suggesting that the reaction stops. However, this is not the case, because when subsituted in Eqs.~\\eqref{eq:b2},~\\eqref{eq:b3},~\\eqref{eq:b4} and~\\eqref{eq:b5}, $k_{1}([E])[E]$ and $k_{2}([E])[C]$ both increase with the number of effector cells. Replacing the rate functions in Eq.~\\eqref{eq:b8} we obtain\n\n", "index": 27, "text": "\\begin{equation}\n\\dfrac{d [T^{*}]}{d t}=\\dfrac{\\kappa_{1}\\kappa_{2}}{\\kappa_{-1}}\\dfrac{[E_{0}]^{1-\\gamma}}{\\dfrac{\\kappa_{1}}{\\kappa_{-1}}[T]+[E_{0}]^{\\alpha+\\beta}}[T].\n\\label{eq:b9}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{d[T^{*}]}{dt}=\\dfrac{\\kappa_{1}\\kappa_{2}}{\\kappa_{-1}}\\dfrac{[E_{0}]^{%&#10;1-\\gamma}}{\\dfrac{\\kappa_{1}}{\\kappa_{-1}}[T]+[E_{0}]^{\\alpha+\\beta}}[T].\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>T</mi><mo>*</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mfrac><mrow><msub><mi>κ</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>κ</mi><mn>2</mn></msub></mrow><msub><mi>κ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msub></mfrac><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mrow><mn>1</mn><mo>-</mo><mi>γ</mi></mrow></msup><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><msub><mi>κ</mi><mn>1</mn></msub><msub><mi>κ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msub></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mrow><mi>α</mi><mo>+</mo><mi>β</mi></mrow></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07144.tex", "nexttext": "\n\n\n\\end{appendices}\n\n\n\\begin{thebibliography}{}\n\n\n\n\\bibitem[Bellomo and Preziosi(2000)]{momatim}\nBellomo N, Preziosi L (2000) Modelling and mathematical problems related to tumor evolution and its interaction with the immune system. Mathl Comput Modelling 32:413-452. doi:10.1016/S0895-7177(00)00143-6\n\n\\bibitem[Briggs and Haldane(1925)]{brha}\nBriggs GE, Haldane JBS (1925) A note on the kinematics of enzyme action. Biochem J 19:338-339.\n\n\\bibitem[Cooper and Hausman(2004)]{amolap}\nCooper CM, Hausman RE (2004) The cell: a molecular approach Washington, DC:ASM.\n\n\\bibitem[Couzin-Frankel(2013)]{immune}\nCouzin-Frankel J (2013) Cancer immunotherapy. Science 342:1432-1433. doi:10.1126/science.342.6165.1432 \n\n\\bibitem[De Pillis and Radunskaya(2003)]{pilisraduns}\nDe Pillis LG, Radunskaya A (2003) The dynamics of an optimally controlled tumor model: a case study. Mathl Comput Modelling 37:1221-1244. doi:10.1016/S0895-7177(03)00133-X\n\n\\bibitem[De Pillis et al.(2005)]{validpilis}\nDe Pillis LG, Radunskaya AE, Wiseman CL (2005) A validated mathematical model of cell-mediated immune response to tumor growth. Cancer Res 65:235-252. doi: 10.1158/0008-5472.CAN-05-0564\n\n\\bibitem[Diefenbach et al.(2001)]{nkg2d}\nDiefenbach A, Jensen ER, Jamieson AM, Rauelt DG (2001) Rae1 and H60 ligands of the NKG2D receptor stimulate tumor immunity. Nature 413:165-171. doi:10.1038/35093109\n\n\\bibitem[Dudley et al.(2002)]{humans}\nDudley ME, Wunderlich JR, Robbins PF, Yang JC, Hwu P, Schwartzentruber J et al (2002) Cancer regression and autoimmunity in patients after clonal repopulation with antitumor lymphocytes. Science 298:850-854. doi:10.1126/science.1076514\n\n\\bibitem[Ferreira et al.(2002)]{ferreira}\nFerreira Jr SC, Martins ML, Vilela MJ (2002) Reaction-diffusion model for the growth of avascular tumor. Phys Rev E 67:051914. doi:10.1103/PhysRevE.65.02190\n\n\\bibitem[Gattinoni et al.(2006)]{adoptive}\nGattinoni L, Powell Jr DJ, Rosenberg SA, Restifo NP (2006) Adoptive immunotherapy for cancer: building on success. Nat Rev Immunol. 6:383-393. doi:10.1038/nri3191 \n\n\\bibitem[Hanahan and Weinberg(2011)]{hallmarks}\nHanahan D, Weinberg RA (2011) Hallmarks of Cancer: the next generation. Cell 144:646-673. doi:10.1016/j.cell.2011.02.013\n\n\\bibitem[Holmes(1985)]{tils}\nHolmes EC (1985) Immunology of tumor infiltrating lymphocytes. Ann Surg 201:158-163.\n\n\\bibitem[Janeway et al.(2012)]{bioimm}\nJaneway CA, Travers P, Walport M, Shlomchik MJ (2012) Immunobiology  New York, Garland Science. \n\n\\bibitem[Jhonson and Goody(2011)]{mimen}\nJhonson KA, Goody RS (2011) The original Michaelis constant: translation of the 1913 Michaelis-Menten paper. Biochemistry 50:8264-8269. doi:10.1021/bi201284u\n\n\\bibitem[Kalos et al.(2011)]{chimeric}\nKalos M, Levine BL, Porter DL, Katz S, Grupp SA, Bagg A et al (2011) T cells with chimeric antigen receptors have potent antitumor effects and can establish memory in patients with advanced leukemia. Sci Transl Med 3:95ra73. doi:10.1126/scitranslmed.3002842 \n\n\\bibitem[Kuznetsov et al.(1994)]{immutu} Kuznetsov VA, Makalkin IA, Taylor MA, Perelson AS (1994) Nonlinear dynamics of immunogenic tumors: parameter estimation and global bifurcation analysis. Bull Math Biol 56:295-321.\n\n\\bibitem[Lopez et al.(2014)]{validbul}\nLopez AG, Seoane JM, Sanjuan MAF (2014) A validated mathematical model of tumor growth including tumor-host interaction, cell-mediated immune response and chemotherapy. Bull Math Biol 76:2884-2906. doi:10.1007/s11538-014-0037-5\n\n\\bibitem[Mallet and De Pillis(2006)]{cahyb}\nMallet DG, De Pillis LG (2006) A cellular automata model of tumor-immune system interactions. J Theor Biol 239:334-350. doi:10.1016/j.jtbi.2005.08.002\n\n\\bibitem[Michaelis and Menten(1913)]{micamen}\nMichaelis L, Menten ML (1913) Die Kinetik der Invertinwirkun. Biochem Z 49:333-369. \n\n\\bibitem[Ribas et al.(2005)]{ctla4}\nRibas A, Camacho LH, Lopez-Berestein G, Pavlov D, Bulanhagui CA, Millham R et al (2005) Antitumor activity in melanoma and anti-self responses in a phase I trial with the anti-cytotoxic T lymphocyte-associated antigen 4 monoclonal antibody CP-675,206. J Clin Oncol 23:8968-8977. doi: 10.1200/JCO.2005.01.109\n\n\\bibitem[Slaney et al.(2014)]{recr}\nSlaney CY, Kershaw MH, Darcy PK (2014) Trafficking of T cells into tumors. Cancer Res 74:7168-7174. doi:10.1158/0008-5472.CAN-14-2458\n\n\\bibitem[Ulberg et al.(1981)]{micaelis}\nUlberg M, Merril J, Jondal M (1981) Interferon induced NK augmentation in humans: an analysis of target recognition, effector cell recruitment and effector cell recycling. Scand J Immunol. 14:285-292.\n\n\\bibitem[Weinberg(2013)]{biocan}\nWeinberg RA (2013). The Biology of Cancer New York, Garland Science. \n\n\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 61799, "prevtext": "\n\nWe now rename the constants $\\lambda=\\alpha+\\beta$,  $s=\\kappa_{1}/\\kappa_{-1}$, $d=\\kappa_{1}\\kappa_{2}/\\kappa_{-1}$, and remember that the velocity for the lysis must remain bounded for $[E_{0}]\\rightarrow\\infty$, what imposes the constraint $\\alpha+\\beta+\\gamma=1$. Thus, the result is\n\n", "index": 29, "text": "\\begin{equation}\n\\dfrac{d [T^{*}]}{d t}=d \\dfrac{[E_{0}]^{\\lambda}}{s [T]+[E_{0}]^{\\lambda}}[T].\n\\label{eq:b10}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"\\dfrac{d[T^{*}]}{dt}=d\\dfrac{[E_{0}]^{\\lambda}}{s[T]+[E_{0}]^{\\lambda}}[T].\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><msup><mi>T</mi><mo>*</mo></msup><mo stretchy=\"false\">]</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mfrac><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mi>λ</mi></msup><mrow><mrow><mi>s</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>+</mo><msup><mrow><mo stretchy=\"false\">[</mo><msub><mi>E</mi><mn>0</mn></msub><mo stretchy=\"false\">]</mo></mrow><mi>λ</mi></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>T</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]