[{"file": "1601.01845.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 19986, "prevtext": "\n\n\\date{Accepted, Received; in original form }\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{2012}\n\n\\maketitle\n\n\\label{firstpage}\n\n\\begin{abstract}\nThe stars in the Magellanic Clouds with the largest degree of obscuration\nare used to probe the highly uncertain physics of stars in the asymptotic giant\nbranch (AGB) phase of evolution. Carbon stars in particular, provide key information\non the amount of third dredge-up (TDU) and mass loss.\nWe use two independent stellar evolution codes to test how a different treatment\nof the physics affects the evolution on the AGB. The output from the two codes are\nused to determine the rates of dust formation in the circumstellar envelope, where the\nmethod used to determine the dust is the same for each case.\nThe stars with the largest degree of obscuration in the LMC and SMC are identified as\nthe progeny of objects of initial mass $2.5-3~M_{\\odot}$ and $\\sim 1.5~M_{\\odot}$,\nrespectively. This difference in mass is motivated by the difference in the star\nformation histories of the two galaxies, and offers a simple explanation of the redder\ninfrared colours of C-stars in the LMC compared to their counterparts in the SMC.\nThe comparison with the Spitzer colours of C-rich AGB stars in the SMC shows that a minimum\nsurface carbon mass fraction $X(C) \\sim 5\\times 10^{-3}$ must have been reached by\nstars of initial mass around $1.5~M_{\\odot}$.\nOur results confirm the necessity of adopting low-temperature opacities in stellar evolutionary\nmodels of AGB stars. These opacities allow the stars to obtain mass-loss\nrates high enough ($\\gtrsim 10^{-4}M_{\\odot}/yr$) to produce the amount of dust needed\nto reproduce the Spitzer colours.\n\\end{abstract}\n\n\n\n\\begin{keywords}\nStars: abundances -- Stars: AGB and post-AGB, galaxies: Magellanic Clouds \n\\end{keywords}\n\n\n\n\\section{Introduction}\nThe recent years have witnessed a growing interest in the evolution of stars of low\nand intermediate mass ($M < 8~M_{\\odot}$), which evolve through the asymptotic giant branch (AGB)\nafter the end of core helium burning.  While this evolutionary phase only accounts for a\nvery small percentage of the overall lifetime, it is extremely important\nbecause it is during the AGB when the richest nucleosynthesis occurs as well as the most intense\nmass loss. This means that AGB stars are able to enrich their environment with gas \nchemically altered by internal nuclear processes and with the dust formed in their wind.\n\nThe unsolved problems of galaxy formation and chemical evolution at all redshifts requires\na full understanding of the topic of stellar evolution and nucleosynthesis of AGB stars.\nParticular areas where AGB stars have proven useful include inferring the masses of galaxies\nat high redshifts, owing to their large infrared luminosities (Maraston et al. 2006);\nchemical evolution of galaxies (Romano et al. 2010), owing to the ability of AGB stars to\nenrich their environment with stellar winds; \nbecause of the efficiency of the dust formation process in their winds, AGB stars play a \ncrucial role in the formation and evolution of galaxies (Santini et al. 2014); \nrecent studies suggested a relevant contribution from AGB stars to the dust \ncontent of high-redshift quasars (Valiante et al. 2011),\ncontrary to earlier investigations, which stressed the dominant role of supernovae (SNe)\n\\citep{todini01, nozawa03, maiolino04}; finally, AGB \nstars $\\gtrsim 5~M_{\\odot}$ are one of the favoured polluters for providing the\ngas required to form second generation stars in globular clusters \\citep{ventura01}.\n\nWhile theoretical models of AGB stars have seen significant progress over the last few years\n(e.g., Karakas \\& Lattanzio 2014), the results are still not completely reliable. This is\nprimarily because we still do not understand how mass loss or convection work in stars.\nThe problem with convection manifests itself in two important ways in AGB stars. The first \nis through the efficiency of third dredge-up (TDU), which is the inward penetration of the\nconvective envelope following each thermal pulse. The efficiency or depth of TDU depends on how \nconvective borders are treated numerically \\citep[e.g.,][]{frost96}.\nThe second is through temperature gradients in convective regions, which cannot be \ncalculated from first principles (Ventura \\& D'Antona 2005).  \nTherefore comparing theoretical AGB models with observations is crucial in order to \nsubstantially improve the predictive power of the stellar evolution models.\n\nThe Magellanic Clouds (MCs) are an ideal environment to test theoretical predictions, \nbecause they are relatively close (51 kpc and 61 kpc respectively, \nfor the LMC and SMC, Cioni et al. 2000; Keller \\& Wood 2006) and the low reddening \n($E_{B-V}=0.15$~mag and 0.04 mag, respectively, for the LMC and SMC, Westerlund\n1997). Furthermore, the study of the MCs provides a wider range of possibilities in\ncomparison with the Milky Way, because the interstellar medium of our Galaxy is highly \nobscuring and the distances of the stars are unknown. Also, the MCs probe a lower \nmetallicity than the disc of our Galaxy.\n\nVarious dedicated surveys have been devoted to observe the AGB population of the MCs:\nthe Magellanic Clouds Photometric Survey \\citep[MCPS,][]{zaritsky04}, the Two Micron All \nSky Survey \\citep[2MASS,][]{skrutskie06}, the Deep Near Infrared Survey of the Southern \nSky \\citep[DENIS,][]{epchtein94}, the Surveying the Agents of a Galaxy's Evolution \nSurveys with the {\\it Spitzer telescope} for the LMC \\citep[SAGE--LMC,][]{meixner06}\nand the SMC \\citep[SAGE--SMC,][]{gordon11}, and {\\it HERschel} \nInventory of The Agents of Galaxy Evolution \\citep[HERITAGE,][]{meixner10, meixner13}.\n\nThese surveys have produced a wealth of data on AGB stars, which can be used to compare\nto the results of theoretical calculations. To reproduce the observed infrared (IR) \ncolours, which are sensitive to the amount of dust formed in the circumstellar envelope, \nsome research groups couple the description of the internal star with the dust formation \nprocess in the wind. This approach was first set up by the Heidelberg \nteam \\citep{fg01, fg02, fg06} and later used by other independent \ninvestigators \\citep{paperI, paperII, paperIII, paperIV, nanni13a, nanni13b, nanni14}.\n\nAgainst this background, we have started a research project aimed at constraining \nthe uncertain physics of AGB evolution, by focusing our attention on the most obscured \nAGB stars in the MCs.\n\nThis study follows \\citet{marigo08}, who built theoretical isochrones which included\nthe AGB phase and extended the isochrones to the IR bands.  Here we take a step forward by\nrelaxing some of the assumptions made by \\citet{marigo08}. These include determining the expansion\nvelocity of the wind and the final dust to gas ratio, and we model the AGB phase by \nthe full integration of the stellar structure equations, rather than using a synthetic \napproach. We base our analysis on AGB models calculated from two independent stellar\nevolution codes which made a significant contribution to the literature of AGB stars over the\npast couple of decades:  MONASH \\citep{frost96} and ATON \\citep{ventura98}.\nThe two codes have been developed and updated independently and include \nnumerous differences between each other in the numerical structure and in the physical \ningredients used. This procedure provides us with a much more complete and critical \nanalysis because: a) it adds robustness to common findings; b) the discrepancy between \nresults provide an estimate of the uncertainty associated with that result; and c) the \ncomparison with the observations may allow us to select the most appropriate description \nof a given phenomenon (e.g., the treatment of convective borders).\n \nIn the first paper of this series \\citep{ventura15a} we focused on oxygen-rich stars \nin the LMC with the brightest IR emission, interpreted as the progeny of $5-6~M_{\\odot}$\nstars experiencing hot bottom burning (HBB). \n\nIn this paper we turn to the carbon star population in the MCs. \nThe goal of the present investigation is to use the sample of numerous C-rich AGB stars \nto reconstruct the various stages of their evolutionary history. In particular, we are\ninterested in studying the amount of carbon accumulated in the external mantle \nand the rate at which their envelope has been gradually lost by stellar winds. \n\nWe will preferentially concentrate on the C-stars with the largest degree of obscuration, \nfor which the mass and chemical composition of the progenitors can be established; \nthis makes the comparison with the models easier and more reliable.\n\nThe paper is organised as follows. Section \\ref{mcs} presents an overview of the\nobservations of the AGB population of the MCs, with a summary of the interpretative\nanalysis proposed so far. The physical ingredients used to\ncalculate the evolutionary sequences presented here and the method followed to\ndescribe the dust formation process and to produce synthetic spectra are given \nin Section \\ref{inputs}. Section \\ref{evolution} presents the results concerning\nthe main evolution and dust properties of the stars currently evolving through the\nC-rich AGB phase in the MCs. The comparison between the AGB stars with the largest degree\nof obscuration and the results from theoretical models is given in Section \\ref{colours},\nwhile Section 6 discusses our interpretation in terms of other observational parameters as \nwell as future observations to test it. Conclusions are presented in Section \\ref{concl}.\n\n\n\\section{AGB stars in the Magellanic Clouds}\n\\label{mcs}\nThe results from the surveys MCPS, 2MASS and DENIS have been used to derive information on the \ninternal structure and on the efficiency of the mechanisms that are altering the surface \nchemical composition of AGB stars.\n\nStudies focused on the interpretation of the luminosity function of carbon stars in the \nLMC and SMC have provided important information on the efficiency of \nTDU and the core mass at which TDU begins \\citep{martin93,marigo99, karakas02, izzard04, \nmarigo07, stancliffe05}.\n\nThe mid-IR {\\it Spitzer} data, combined with near-IR 2MASS photometry, have been extensively used to\nderive the main properties of the stars observed, specifically the luminosity, the rate\nof mass loss, and the dust injection rate\n\\citep{martin07, riebel10, riebel12, srinivasan09, srinivasan11, boyer11, boyer12}.\nVarious methods have been proposed to classify the observed stars and\nseparate carbon stars from their oxygen-rich\ncounterparts \\citep{cioni00a, cioni00b, cioni06}. The stars with the highest\ndegree of obscuration have been traditionally referred to as \"extreme\" \\citep{blum06}, \nowing to their extremely red IR colours and the uncertain surface chemical composition.\n\nIn a series of papers \\citep{flavia14, flavia15a, flavia15b} we tackled the\nproblem of interpreting the IR observations of the MCs AGB star population by \nconfronting the observational evidence with results of full AGB evolutionary models.\nThe models also account for dust formation in the circumstellar envelope. \nThe latter ingredient is mandatory because radiation from the central object\nis reprocessed to longer, infrared wavelengths by dust.\n\nBased on the results by \\citet{flavia15a}, \\citet{ventura15a} performed an extensive \nexploration of the various input used to build AGB evolutionary sequences of oxygen-rich \nintermediate-mass stars in the LMC. The study, which used results from different evolutionary\ncodes, found that the expected position in the various IR colour--colour \nplanes occupied by oxygen-rich AGB stars during the phase with the strongest \nobscuration is practically independent of the details of AGB modelling.\n\nIn this paper we turn our attention to the C-star population in the LMC and SMC.\n\\citet{flavia14} characterised the AGB stars \npopulating the diagonal band in the CCD of the two galaxies, extending to \n$[3.6]-[4.5] \\sim 3$ \\citep[LMC,][]{srinivasan11} and $[3.6]-[4.5] \\sim 1.2$ \n\\citep[SMC,][]{boyer11}, as carbon stars \\citep[see also][]{flavia15a, flavia15b}. \nThe scenario proposed by \\citet{flavia14} is that the observed bands represent obscuration \nsequences: the stars move across the diagonal band as they become more enriched  \nin carbon, owing to the effects of TDU. \nThe subsequent investigations by \\citet{flavia15a,flavia15b} followed a population synthesis\napproach, which allowed us to determine the expected distribution of stars in the colour--colour \nand colour--magnitude planes obtained with the {\\it Spitzer} bands. These studies are based\non the star formation history of the MCs by \\citet{harris04, harris09} and on the evolutionary\ntimes of stars of various mass and metallicity, reported in Table 1 in \\citet{flavia15a}.\n\nOne general result is that the regions of the observational planes where highly-obscured\ncarbon stars are found are not well populated.\nThis is because the evolutionary time scales get shorter as the star becomes enriched in\ncarbon, owing to the considerable increase in the rate of mass loss. This has important\nconsequences on the (current) mass distribution of the carbon stars observed. All the\nstars with initial mass in the range $\\sim 1.25-3~M_{\\odot}$ evolve as carbon stars from\na given stage of the evolution until the removal of the envelope, where the final\nstellar mass is $\\sim 0.6~M_{\\odot}$.\nOn the other hand, for the reasons given above, the very \nfinal evolutionary phases have a very short duration. The combination of these two\nfactors makes the mass distribution of the LMC to peak around $\\sim 1.3-1.4~M_{\\odot}$, \nin nice agreement with the analysis based on pulsation periods by \\citet{boyer15}.\n\n\\citet{flavia15a} found that in the LMC the C-rich AGB stars with the reddest\ninfrared colours formed during \nthe $\\sim 300$ Myr long epoch of high star formation, which occurred $\\sim 500$ Myr \nago, when most of the stars formed from gas with metallicity $Z=0.008$.\nAn age of $\\sim 300-500$ Myr corresponds to stars with initial masses $\\sim 2.5-3~M_{\\odot}$.\n\nBy applying to the SMC the same population synthesis analysis, \\citet{flavia15b} found\nthat the stars exhibiting the largest obscuration descend from $\\sim 1.5~M_{\\odot}$ stars,\nformed $\\sim 2$ Gyr ago, when the dominant metallicity of the interstellar medium was \n$Z=0.004$. Contrary to the LMC, only a negligible fraction of stars descending from \n$\\sim 2.5-3~M_{\\odot}$ objects are expected to evolve nowadays through the very final\nAGB phases of highest obscuration, because the SFR of the SMC exhibits a much narrower\npeak than the LMC at $\\sim 500$ Myr ago.\n\nWe will focus on these masses and metallicities in the following sections.\n\n\n\n\\section{Numerical and physical inputs}\n\\label{inputs}\n\\subsection{Stellar evolution models}\nThis work is based on evolutionary sequences calculated with the ATON code \\citep{ventura98} \nand with the Monash version of the Mount Stromlo Stellar Structure Program \n\\citep[MONASH,][]{frost96}. \nExhaustive discussions on the numerical and physical input adopted are found in the papers by \n\\citet{ventura13} and \\citet{karakas10}, which also provide a detailed description of the chemical \nand physical properties of the AGB evolution of these stars. \n\n\nThe main differences between the two sets of models \nare the treatment of convection, the description of mass loss, and the calculation of\nmolecular opacities in the low-temperature region of the envelope:\n\n\\begin{itemize} \n\n\\item{In the ATON code the convective instability is described by means of the Full\nSpectrum of Turbulence model developed by \\citet{cm91}, whereas in the MONASH case \nthe traditional mixing length theory is used.}\n\n\\item{The ATON sequences are calculated by coupling nuclear burning and mixing of chemicals\nin a diffusive-like scheme. Overshoot of convective eddies into radiatively stable regions\nis described by means of an exponential decay of velocities from the convective/radiative\ninterface, fixed by the Schwarzschild criterion. The e-folding distance is assumed to\nbe $0.002H_p$ (where $H_p$ is the pressure scale height calculated at the formal boundary\nof convection), in agreement with the calibration based on the observed luminosity\nfunction of carbon stars in the LMC, given by \\citet{paperIV}. The MONASH models \nof \\citet{karakas10} \nassume instantaneous mixing and no overshoot beyond the formal Schwarzschild boundary\nis applied. However, the MONASH models  implement an algorithm to search for a \nneutrally stable point \\citep[e.g.][]{lattanzio86}, which has been shown to increase\nthe amount of TDU relative to models without \\citep{frost96}. Note that in low-mass AGB\nmodels the amount of TDU found by this algorithm is still less than required to match the \nC/O transition luminosity of MC AGB stars and some formal overshoot had to be applied \n\\citep{kamath12}. \n}\n\n\\item{The mass loss rate for oxygen-rich models in the ATON case is determined via the \n\\citet{blocker95} treatment; for carbon stars ATON uses the results from the Berlin group\n\\citep{wachter02, wachter08}. MONASH models rely on the classic description by \\citet{VW93}.}\n\n\\item{In the ATON sequences, molecular opacities in the low-temperature regime (below \n$10^4$ K) are calculated by means of the AESOPUS tool \\citep{marigo09}. \nThe opacities are suitably constructed to follow the changes in the chemical composition \nof the envelope, particularly of the individual abundances of carbon, nitrogen, and oxygen.\nThe MONASH models from \\citet{karakas10} include an approximate treatment for the molecular \nopacities (in particular CN, CO, H$_2$O and TiO) using the formulations from \\citet{bessel89} with\nthe corrections by \\citet{chiosi93}. These fits do include some compositional dependence, \nbut do not account for large variations in the CNO species.} \n\n\\end{itemize}\n\n\\begin{figure*}\n\\begin{minipage}{0.48\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figlumtot.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.48\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figteftot.pdf}}\n\\end{minipage}\n\\vskip-70pt\n\\begin{minipage}{0.48\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figmlostot.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.48\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figcarbtot.pdf}}\n\\end{minipage}\n\\vskip-50pt\n\\caption{The variation of luminosity (top--left panel), effective temperature (top--right),\nrate of mass loss (bottom--left) and surface carbon mass fraction (bottom--right) \nduring the AGB phase of models of various mass and metallicity, calculated with MONASH \nand ATON codes. The ATON models of initial mass $2.5, 3~M_{\\odot}$ and metallicity\n$Z=8\\times 10^{-3}$ are indicated with solid, black lines, whereas the ATON $1.5~M_{\\odot}$,\n$Z=4\\times 10^{-3}$ evolutionary sequence is plotted with a solid, red track. The dotted,\nmagenta and green lines indicate the evolution of the MONASH models of metallicity\n$Z=8\\times 10^{-3}$ and initial mass, respectively, $3~M_{\\odot}$ and $2.25~M_{\\odot}$;\nthe MONASH model of mass $1.5~M_{\\odot}$ and $Z=4\\times 10^{-3}$ is indicated with a\ndashed, blue line. Note that while the ATON tracks show the whole AGB evolution, \nincluding the thermal pulses, the MONASH lines are limited to the inter-pulse phases.}\n\\label{fmodel}\n\\end{figure*}\n\n\n\\subsection{Dust formation in the winds of AGB stars}\n\\label{dustmodel}\nThe growth of dust particles in the circumstellar envelope is described following\nthe pioneering explorations by the Heidelberg group \\citep{gs85, gs99, \nfg01, fg02, fg06, zhukovska08}. The wind is assumed to expand isotropically\nfrom the surface of the star; the velocity is held constant until gas molecules\nenter the region where condensation into dust particles is favoured. As far as\na minimum amount of dust is formed, the results are independent of the adopted\ninitial velocity.\n\nThe model is based on the equation of momentum conservation and on a differential \nrelation for the radial variation of the optical depth:\n\n\n", "index": 1, "text": "\\begin{equation}\nv{dv\\over dr}=-{GM\\over r^2}(1-\\Gamma)\n\\label{eqv}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"v{dv\\over dr}=-{GM\\over r^{2}}(1-\\Gamma)\" display=\"block\"><mrow><mrow><mi>v</mi><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>v</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>r</mi></mrow></mfrac></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mrow><mi>G</mi><mo>⁢</mo><mi>M</mi></mrow><msup><mi>r</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi mathvariant=\"normal\">Γ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\\noindent\n$\\Gamma={kL\\over 4\\pi cGM}$ accounts for the effects of radiation pressure on\ndust grains, while $k$ is the extinction coefficient.\n\nThe description of the wind is completed by the equation giving the radial\nvariation of temperature and by the mass continuity relation:\n\n\n", "itemtype": "equation", "pos": 20070, "prevtext": "\n\n\n", "index": 3, "text": "\\begin{equation}\n{d\\tau_L\\over dr}=-\\rho k{R^2\\over r^2}\n\\label{eqtau}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{d\\tau_{L}\\over dr}=-\\rho k{R^{2}\\over r^{2}}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>τ</mi><mi>L</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>r</mi></mrow></mfrac><mo>=</mo><mrow><mo>-</mo><mrow><mi>ρ</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mfrac><msup><mi>R</mi><mn>2</mn></msup><msup><mi>r</mi><mn>2</mn></msup></mfrac></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 20438, "prevtext": "\n\n\\noindent\n$\\Gamma={kL\\over 4\\pi cGM}$ accounts for the effects of radiation pressure on\ndust grains, while $k$ is the extinction coefficient.\n\nThe description of the wind is completed by the equation giving the radial\nvariation of temperature and by the mass continuity relation:\n\n\n", "index": 5, "text": "\\begin{equation}\nT^4={1\\over 2}T_{\\rm eff}^4 \\left[ 1-\\sqrt{1-{R^2\\over r^2}}+{3\\over 2}\\tau_L \\right].\n\\label{eqt}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"T^{4}={1\\over 2}T_{\\rm eff}^{4}\\left[1-\\sqrt{1-{R^{2}\\over r^{2}}}+{3\\over 2}%&#10;\\tau_{L}\\right].\" display=\"block\"><mrow><mrow><msup><mi>T</mi><mn>4</mn></msup><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msubsup><mi>T</mi><mi>eff</mi><mn>4</mn></msubsup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mn>1</mn><mo>-</mo><msqrt><mrow><mn>1</mn><mo>-</mo><mfrac><msup><mi>R</mi><mn>2</mn></msup><msup><mi>r</mi><mn>2</mn></msup></mfrac></mrow></msqrt></mrow><mo>+</mo><mrow><mfrac><mn>3</mn><mn>2</mn></mfrac><mo>⁢</mo><msub><mi>τ</mi><mi>L</mi></msub></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\\noindent\nHere we focus on carbon-rich environments, where the surface carbon abundance exceeds oxygen.\nIn this case the two main dust species formed are solid carbon (C) and silicon carbide (SiC).\nThe condensation reactions by which the two species form are, respectively,\n$C_2H_2 \\rightarrow 2C(s)+H_2$ and $2Si+C_2H_2 \\rightarrow 2SiC(s)+H_2$\n\\citep[see, e.g.][]{fg06}. The condensation\ntemperatures are 1100 K (C) and 1400 K (SiC). The growth rate of dust grains\n($da_C/dt$ and $da_{SiC}/dt$) is proportional to the least abundant among the species \ninvolved in the condensation reactions, namely $C_2H_2$ and silicon. Considering the\nhigh stability of CO and SiS molecules, we have\n\n\n", "itemtype": "equation", "pos": 20570, "prevtext": "\n\n\n", "index": 7, "text": "\\begin{equation}\n\\dot{M}=4\\pi r^2 \\rho v\n\\label{eqrho}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\dot{M}=4\\pi r^{2}\\rho v\" display=\"block\"><mrow><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mo>=</mo><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup><mo>⁢</mo><mi>ρ</mi><mo>⁢</mo><mi>v</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\n", "itemtype": "equation", "pos": 21329, "prevtext": "\n\n\\noindent\nHere we focus on carbon-rich environments, where the surface carbon abundance exceeds oxygen.\nIn this case the two main dust species formed are solid carbon (C) and silicon carbide (SiC).\nThe condensation reactions by which the two species form are, respectively,\n$C_2H_2 \\rightarrow 2C(s)+H_2$ and $2Si+C_2H_2 \\rightarrow 2SiC(s)+H_2$\n\\citep[see, e.g.][]{fg06}. The condensation\ntemperatures are 1100 K (C) and 1400 K (SiC). The growth rate of dust grains\n($da_C/dt$ and $da_{SiC}/dt$) is proportional to the least abundant among the species \ninvolved in the condensation reactions, namely $C_2H_2$ and silicon. Considering the\nhigh stability of CO and SiS molecules, we have\n\n\n", "index": 9, "text": "\\begin{equation}\n{da_C \\over dt} \\propto n_{C_2H_2} \\propto (1-f_C)n_C-n_O-(1-f_{SiC})n_{Si}\n\\label{acar}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"{da_{C}\\over dt}\\propto n_{C_{2}H_{2}}\\propto(1-f_{C})n_{C}-n_{O}-(1-f_{SiC})n%&#10;_{Si}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>a</mi><mi>C</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>∝</mo><msub><mi>n</mi><mrow><msub><mi>C</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>H</mi><mn>2</mn></msub></mrow></msub><mo>∝</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mi>C</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>n</mi><mi>C</mi></msub></mrow><mo>-</mo><msub><mi>n</mi><mi>O</mi></msub><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mrow><mi>S</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>C</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>n</mi><mrow><mi>S</mi><mo>⁢</mo><mi>i</mi></mrow></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\\noindent\nIn the above equations $f_C$ ($f_{SiC}$) indicates the fraction of\ncarbon (silicon) molecules condensed into dust particles.\n\nSiC is the most stable species and forms at higher temperatures, \nthus closer to the surface of the star. Equation \\ref{asic} indicates an upper limit\nto the growth of SiC particles, reached when the fraction of silicon molecules\ncondensing into SiC approaches $f_{SiC} = 1-n_S/n_{SiC} \\sim 0.55$. Because neither \nsilicon nor sulphur undergo significant variations along the life of stars of intermediate\nmass, this quantity remains constant during the AGB phase.\n\nWhile the formation of SiC grains is important for the IR properties of the SED of AGB stars, \nit does not influence the dynamical status of the wind. This is because SiC particles are\nextremely transparent to electromagnetic radiation and thus do not contribute to the\nacceleration of the wind via radiation pressure.\n\nSolid carbon is less stable than SiC, therefore the zone where the formation of carbon \ngrains occurs is more external than the region where SiC particles begin to form. \nBecause the surface carbon abundance is generally much higher than that of silicon, \ncontrary to SiC, \nno saturation in the carbon dust formation process occurs.  The only exception is at the very \nbeginning of the C-rich phase, when the carbon excess with respect to oxygen is very small, \nwhich prevents the formation of significant quantities of carbon dust (see equation \n\\ref{acar}). \n\nHowever, because of the very large values attained by the extinction coefficient of solid \ncarbon grains, the growth of these particles is commonly halted by the considerable \nexpansion of the wind, which determines a fast drop in the gas density, according to \nequation \\ref{eqrho}.\n\nWe may safely assume in this case (e.g., equation \\ref{acar}) that the key \nquantity is the density of $C_2H_2$ molecules\\footnote{This is consistent with mid-IR \nspectroscopic observations of Galactic and MCs AGB stars, which show that C$_{2}$H$_{2}$ \nis very abundant in their circumstellar envelopes (e.g., van Loon et al. 1999; Yang et al. \n2004; Lagadec et al. 2007; van Loon et al. 2008).}. The density of $C_2H_2$ in turn \ndepends on the surface carbon mass fraction and on the density of the wind in the region \nwhere condensation occurs, i.e., the zone where the temperature is $T_C = 1100$ K; \nwe refer to the density of this region as $\\rho_C$.\n\nBecause the typical distance from the surface at which solid carbon forms is $\\sim 10~R_*$, \nwe may safely expand equation \\ref{eqt} assuming that $R_*/r \\ll 1$, to obtain \n\n\n", "itemtype": "equation", "pos": 21451, "prevtext": "\n\n\n", "index": 11, "text": "\\begin{equation}\n{da_{SiC} \\over dt} \\propto (1-f_{SiC})n_{Si}-n_S\n\\label{asic}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{da_{SiC}\\over dt}\\propto(1-f_{SiC})n_{Si}-n_{S}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>a</mi><mrow><mi>S</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>C</mi></mrow></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>∝</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>f</mi><mrow><mi>S</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>C</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>n</mi><mrow><mi>S</mi><mo>⁢</mo><mi>i</mi></mrow></msub></mrow><mo>-</mo><msub><mi>n</mi><mi>S</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\\noindent\nThe combination of equations \\ref{eqrho} and \\ref{approx} leads to:\n\n\n", "itemtype": "equation", "pos": 24147, "prevtext": "\n\n\\noindent\nIn the above equations $f_C$ ($f_{SiC}$) indicates the fraction of\ncarbon (silicon) molecules condensed into dust particles.\n\nSiC is the most stable species and forms at higher temperatures, \nthus closer to the surface of the star. Equation \\ref{asic} indicates an upper limit\nto the growth of SiC particles, reached when the fraction of silicon molecules\ncondensing into SiC approaches $f_{SiC} = 1-n_S/n_{SiC} \\sim 0.55$. Because neither \nsilicon nor sulphur undergo significant variations along the life of stars of intermediate\nmass, this quantity remains constant during the AGB phase.\n\nWhile the formation of SiC grains is important for the IR properties of the SED of AGB stars, \nit does not influence the dynamical status of the wind. This is because SiC particles are\nextremely transparent to electromagnetic radiation and thus do not contribute to the\nacceleration of the wind via radiation pressure.\n\nSolid carbon is less stable than SiC, therefore the zone where the formation of carbon \ngrains occurs is more external than the region where SiC particles begin to form. \nBecause the surface carbon abundance is generally much higher than that of silicon, \ncontrary to SiC, \nno saturation in the carbon dust formation process occurs.  The only exception is at the very \nbeginning of the C-rich phase, when the carbon excess with respect to oxygen is very small, \nwhich prevents the formation of significant quantities of carbon dust (see equation \n\\ref{acar}). \n\nHowever, because of the very large values attained by the extinction coefficient of solid \ncarbon grains, the growth of these particles is commonly halted by the considerable \nexpansion of the wind, which determines a fast drop in the gas density, according to \nequation \\ref{eqrho}.\n\nWe may safely assume in this case (e.g., equation \\ref{acar}) that the key \nquantity is the density of $C_2H_2$ molecules\\footnote{This is consistent with mid-IR \nspectroscopic observations of Galactic and MCs AGB stars, which show that C$_{2}$H$_{2}$ \nis very abundant in their circumstellar envelopes (e.g., van Loon et al. 1999; Yang et al. \n2004; Lagadec et al. 2007; van Loon et al. 2008).}. The density of $C_2H_2$ in turn \ndepends on the surface carbon mass fraction and on the density of the wind in the region \nwhere condensation occurs, i.e., the zone where the temperature is $T_C = 1100$ K; \nwe refer to the density of this region as $\\rho_C$.\n\nBecause the typical distance from the surface at which solid carbon forms is $\\sim 10~R_*$, \nwe may safely expand equation \\ref{eqt} assuming that $R_*/r \\ll 1$, to obtain \n\n\n", "index": 13, "text": "\\begin{equation}\n(R_*/r)^2 \\sim 4(T_C/T_{\\rm eff})^4-4/3\\tau_L\n\\label{approx}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"(R_{*}/r)^{2}\\sim 4(T_{C}/T_{\\rm eff})^{4}-4/3\\tau_{L}\" display=\"block\"><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mo>*</mo></msub><mo>/</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>∼</mo><mrow><mrow><mn>4</mn><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>C</mi></msub><mo>/</mo><msub><mi>T</mi><mi>eff</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>4</mn></msup></mrow><mo>-</mo><mrow><mrow><mn>4</mn><mo>/</mo><mn>3</mn></mrow><mo>⁢</mo><msub><mi>τ</mi><mi>L</mi></msub></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01845.tex", "nexttext": "\n\n\\noindent\nThe first term on the right hand side of equation \\ref{rhof} is dominant. Therefore, the\nnumber of $C_2H_2$ molecules available to form solid carbon is determined by the carbon \nmass fraction, X(C) and the $\\dot M/L$ ratio.\n\nWe may therefore conclude that the winds of carbon stars have the following stratification:\n\n\\begin{itemize}\n\n\\item{SiC forms in an internal zone, at a temperature of $\\sim 1400$ K. In most cases \nthe growth of SiC particles is halted by saturation, which occurrs when the fraction of\ngaseous silicon condensing into dust approaches $\\sim 55 \\%$ (see discussion in the \nprevious section). The wind is modestly accelerated by formation of SiC, because this \nspecies is highly transparent to radiation.}\n\n\\item{Solid carbon particles form in more external regions, where the temperature is\n$\\sim 1100$K. In this case the wind is greatly accelerated owing to the high values of\nthe extinction coefficient of carbon dust. The factors mostly relevant to formation of\nsolid carbon are the $\\dot M/L$ ratio and the surface carbon mass fraction.}\n\n\\end{itemize}\n\n\n\n\\subsection{Synthetic spectra}\n\\label{spectramodel}\nTo determine the magnitudes in the {\\it Spitzer} bands used in the present analysis \nwe follow the same\napproach used in \\citet{ventura15a} and discussed in detail in \\citet{flavia15a}.\nBased on the values of mass, luminosity, effective temperature, mass-loss rate and \nsurface chemical composition calculated from the MONASH and ATON codes, we apply\nthe model of dust formation described in Section \\ref{dustmodel} to determine the size of the dust \ngrains formed and the optical depth (here we use the value at $10~\\mu$m, $\\tau_{10}$).\n\nThese ingredients are used by the code DUSTY \\citep{dusty} to calculate the synthetic \nspectra of each selected point along the evolutionary sequence. The magnitudes in the \nvarious bands are obtained by convolution with the appropriate transmission curves.\nDUSTY needs as input parameters the effective temperature of the star, the\nradial profile of the density of the gas and the dust composition of the wind, in terms\nof the percentage of the various species present and of the size of the dust particles\nformed. All these quantities are known based on the results of stellar evolution and of\nthe description of the wind. \n\n \n\\section{Carbon stars in the Magellanic Clouds: evolution and dust properties}\n\\label{evolution}\nWe focus now on the stars that account for most of the C-star population in the LMC and SMC. \nFor the LMC we consider models of initial mass $\\sim 2.5-3~M_{\\odot}$ and metallicity \n$Z=8\\times 10^{-3}$. To compare models with the same core mass, while in the ATON case\nwe show models of initial mass $2.5~M_{\\odot}$ and $3~M_{\\odot}$, in the MONASH case we\npresent the  $2.25~M_{\\odot}$ and $3~M_{\\odot}$ models; this is due to a slight difference\nin the mass vs core mass relationships found with the two codes in the range of masses\nclose to the limit to experience the helium flash.\nFor the SMC we analyse the evolution of $\\sim 1.5~M_{\\odot}$ stars of metallicity \n$Z=4\\times 10^{-3}$. \n \n\\subsection{Physical properties of carbon stars} \nThe evolution of these models is shown in Fig. \\ref{fmodel}, where we plot the luminosity,\neffective temperature, mass-loss rate and surface carbon abundance as a function of time\nfrom the beginning of the thermally-pulsing AGB phase. \n \nThe top, left panel of Fig. \\ref{fmodel} shows that the ATON and MONASH models evolve \nat similar luminosities, an indication that the core masses are similar. \nNote that in this case we do not expect any effect of convection modelling on the\nbehaviour of luminosity, because stars in this range of mass do not experience \nHBB. This is at odds with the analysis by \\citet{ventura15a}, where the\nATON and MONASH models of $5-6~M_{\\odot}$ stars were shown to evolve at different luminosities.\nThe only meaningful difference difference is the duration of the whole AGB phase, which \nis systematically longer in the MONASH models; we will come back to this point shortly. \nThe duration of the AGB phase is not monotonic with mass: the $2.5~M_{\\odot}$ model\nevolves for a longer time compared to their $1.5~M_{\\odot}$ and $3~M_{\\odot}$ counterparts. \nThis is because the relationship between the core mass at the beginning of the AGB phase \nand the initial mass of the stars has a minimum at $\\sim 2.5~M_{\\odot}$, which makes the \ngrowth of the luminosity of the $2.5~M_{\\odot}$ model in the initial AGB phases slower \nthan in the other cases.\n\nIn the phases before the C-star phase is reached, the effective temperatures of models \nof the same mass are similar in the MONASH and ATON cases (see top, right panel of\nFig. \\ref{fmodel}). After the C/O ratio exceeds unity, the effects of the different \nlow-temperature opacities takes over: the ATON models, owing to the expansion of the \nexternal regions triggered by the increase in the opacity, evolve to lower temperatures, \ndown to $\\sim 2000$ K, whereas in the MONASH models we find $T_{\\rm eff} > 2400$ K. This effect\nis extensively discussed in \\citet{vm09, vm10}.\n\nThe difference in the surface temperature has a direct effect on the rate of mass loss.\nAs shown in the bottom, left panel of Fig. \\ref{fmodel}, $\\dot{M}$ exceeds\n$10^{-4}~M_{\\odot}$/yr in the ATON models of $Z=8\\times 10^{-3}$, whereas in the MONASH  \ncase it is $\\sim 3-4$ times smaller; in the $1.5~M_{\\odot}$ model of metallicity \n$Z=4\\times 10^{-3}$ the difference is smaller\n($2\\times 10^{-5}~M_{\\odot}$/yr and $3\\times 10^{-5}~M_{\\odot}$/yr in the MONASH and\nATON models, respectively). This is not only due to the more expanded, hence less \ngravitationally bound, configurations of lower $T_{\\rm eff}$'s models; a further reason\nfor the higher $\\dot M$'s of the ATON models is the use of the formulation by\n\\citet{wachter02, wachter08}, which favours large rates of mass loss in carbon rich,\nlow $T_{\\rm eff}$ stars. The rate of mass loss in the ATON models is\ngenerally larger than in the MONASH cases also during the early AGB phases. \nThis is due to the differences between the \\citet{blocker95} and \\citet{VW93}\nformulae for M stars. This is not a major problem here because little mass is lost\nduring the oxygen-rich phase of these stars and, as will be shown in the following,\nthe amount of dust formed during these evolutionary phases is negligible in comparison\nto the late evolutionary phases, when the stars are carbon-rich.\n\n\\subsection{The change in the surface chemistry}\nConcerning the surface chemistry, we show in the bottom, right panel of \nFig. \\ref{fmodel} the variation of the carbon abundance in the same models shown in \nthe other panels. The most relevant difference between the results found with the two\nevolution codes is found in the $3~M_{\\odot}$ case, for which the \nMONASH and ATON models reach final carbon mass fractions of $X_C=0.0185$ and\n$X_C=0.01$, respectively. This situation is reversed in lower mass models; indeed in\nthe $1.5~M_{\\odot}$ ATON case the final surface carbon is $X_C \\sim 0.007$, a factor of 2\nhigher than MONASH. This is because the MONASH models do not show very efficient\ndredge-up at the minimum mass for C-star production, a problem that has been discussed\nextensively in \\citet{kamath12} and \\citet{karakas10b}. The 1.5${M_{\\odot}}$ model only dredges \nup $0.0096~M_{\\odot}$ of material from the He-intershell, with a minimum core mass for TDU of \n0.6$~{M_{\\odot}}$. \\citet{kamath12} found  that the minimum mass for TDU in LMC AGB stars should \nbe lower, at 0.58$~{M_{\\odot}}$, indicating that convective overshoot should probably be applied \n\\citep[see also, e.g.,][]{marigo99}. To reach surface carbon mass fractions \n$X_C > 0.005$ an extra-mixing zone extending over two pressure scale heights below\nthe base of the convective envelope needs to be applied. This is entirely consistent with\nthe analysis by \\citet{kamath12}, who invoked an overshoot of similar extension to\nmatch the observations of AGB stars in MCs clusters.\n\nThese dissimilarities between the results obtained with the two evolution codes are \nnot surprising, given the considerable sensitivity of the carbon enrichment of the \nsurface layers to the details of the treatment of convective borders, as thoroughly \ndocumented in the literature \\citep{karakas14}.\n\n\\subsection{Dust formation in the circumstellar envelope}\n\\label{dustgrain}\n\n\\begin{figure*}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{fxcac.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{fxctau.pdf}}\n\\end{minipage}\n\\vskip-50pt\n\\caption{The variation of the size of the olivine (oxygen-rich phases) and solid\ncarbon (carbon stars) dust grains (left panel) and of the optical depth at \n$10 \\mu$m (right) in the same models shown in Fig.~\\ref{fmodel}. On the abscissa \nwe show the surface carbon abundance, increasing during the AGB phase.\nSymbols along the tracks in the left panel indicate the initial mass and whether\nthe MONASH (M) or ATON (A) code was used for the calculation.\n}\n\\label{ftau}\n\\end{figure*}\n\n\nThe changes in the spectral energy distribution of AGB stars are correlated with \nevolution properties. This reflects the variation of the main physical parameters \n(e.g., mass loss) and of the quantity of dust in the circumstellar envelope.\n\nFig.~\\ref{ftau} shows the evolution of the size of the dust grains formed (left panel)\nand the optical depth at wavelength $\\lambda=10~\\mu$m, $\\tau_{10}$, for the same\nmodels shown in Fig.~\\ref{fmodel}. For clarity, we only show the dimension of\nthe dust particles formed in greater quantities, which provide the dominant contribution\nto the acceleration of the wind, i.e., olivine (oxygen-rich phases) and\nsolid carbon (C-stars). $\\tau_{10}$ is plotted on a logarithmic scale, which allows \nus to discuss the early AGB phase, which is otherwise undetectable on a linear scale \nplot. On the abscissa we show the surface mass fraction of carbon, which increases \nduring the AGB phase.\n\nThe following results are in common between the MONASH and ATON models:\n\n(i) little dust formation occurs until the C/O ratio is close to unity. \nAs shown in Fig. \\ref{ftau}, the olivine grains barely exceed a nanometer \nsize and the optical depth is very small. The SED of the star is unaffected by dust \nduring these phases. This holds independently of mass and metallicity.\n\n\n\\begin{figure*}\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figsmcsize.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figsmcvel.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figsmctau.pdf}}\n\\end{minipage}\n\\vskip-40pt\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figlmcsize.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figlmcvel.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.32\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figlmctau.pdf}}\n\\end{minipage}\n\\vskip-30pt\n\\caption{The radial stratification of the size of SiC and carbon grains (left panels),\nwind velocity (middle) and $\\tau_L$ (right) in different phases during the AGB evolution\nof models of initial mass $1.5~M_{\\odot}$ (top) and $2.5~M_{\\odot}$ (bottom). On the\nabscissa we show the distance from the surface of the star, on a logarithmic scale, \nmeasured in stellar radii units. Black, dotted--dashed, red dotted  and dashed, blue \ntracks refer to ATON models taken, respectively, at the beginning of the C-star phase, \nin an intermediate stage after becoming C-star and at the end of the AGB evolution.\nSolid, green lines correspond to MONASH models of initial mass $1.5~M_{\\odot}$ (top) and \n$3~M_{\\odot}$ (bottom), taken in the final evolutionary phases. The shaded regions outlined\nin the right panels indicate the zones where formation of SiC and solid carbon dust \noccurs.\n}\n\\label{fstrat}\n\\end{figure*}\n\n\n(ii) The quantity of carbon dust formed increases during the subsequent C-star evolution,\nas confirmed by the rise of the grain size and $\\tau_{10}$, shown in Fig.~\\ref{ftau}.\nThis can be understood based on the discussion in Section \\ref{dustmodel}, because\nboth factors affecting formation of carbonaceous dust, namely the surface \ncarbon abundance and the $\\dot M/L$ ratio, increase after becoming C-rich (see \nFig.~\\ref{fmodel}). \n\n(iii) The amount of dust formed in the winds of \nthe $\\sim 1.5~M_{\\odot}$ star is significantly smaller than in their counterparts of higher \nmass. This is because the $2.5-3~M_{\\odot}$ models, particularly during\nthe final AGB phases, attain a higher surface carbon abundance, which in turn leads to \nlower effective temperatures and higher rates of mass loss;\nthis can be clearly seen in Fig.~\\ref{fmodel}.\n\n\\subsection{Thermodynamic and chemical structure of the wind}\nTo understand how the conditions in the wind evolve, we show in Fig.~\\ref{fstrat} \nthe stratification of the circumstellar envelope in three distinct stages of the\ncarbon star phase of the $1.5~M_{\\odot}$, $Z=4\\times 10^{-3}$ (top panel) and the \n$2.5~M_{\\odot}$, $Z=8\\times 10^{-3}$ ATON models.\nThe plots illustrate conditions at the beginning of the AGB phase,  the very end of the\nAGB evolution and an intermediate phase. In the same figure we also show the MONASH \nmodels of mass $1.5~M_{\\odot}$ and $3~M_{\\odot}$ during the final AGB phases. The \npanels of the figure show the radial distribution of the grains size of SiC and solid \ncarbon, the velocity of the wind, and $\\tau_L$, the quantity entering equations \\ref{eqtau} \nand \\ref{eqt}.\n\nFormation of SiC occurs in an internal zone,\n$\\sim 2-3$ stellar radii away from the surface, where the temperature is $T \\sim 1400$ K. \nBecause SiC is highly transparent to stellar radiation, the velocity of the wind stays \nconstant in the region of SiC formation. At the very beginning of the carbon star phase \nSiC is produced in modest quantities, with grains of a few nanometers in size. In more \nadvanced phases saturation condition occurs, the dimension of SiC grains grow to \n$0.065 \\mu$m and $0.081 \\mu$m in the $1.5~M_{\\odot}$ and $2.5~M_{\\odot}$ cases, \nrespectively. This is because silicon in the envelope is either locked into SiS molecules \nor condensed into SiC particles. The difference in the SiC grain size is due to the \ndependence of the surface silicon abundance on initial metallicity.\n\n\n\\begin{figure*}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{fsed15msun.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{fsed25msun.pdf}}\n\\end{minipage}\n\\vskip-40pt\n\\caption{The evolution of the SED of low-mass stars\nevolving to the C-star stage during the AGB phase. The solid, magenta lines correspond\nto the SED at the beginning of the AGB phase, when the stars are still oxygen-rich.\nDotted--dashed, dotted and dashed tracks correspond to the same model as in \nFig.~\\ref{fstrat}. \n}\n\\label{fsed}\n\\end{figure*}\n\n\nFormation of carbon grains occurs $\\sim 7-10$ stellar radii away from the surface, \nwhere the temperature is $T\\sim 1100$ K. Carbon is produced in greater quantities compared \nto SiC, owing to the higher availability of carbon molecules in comparison to silicon. \nThe formation of carbon dust is accompanied by the acceleration of the wind. The location \nof the carbon condensation zone is gradually shifted outwards during the AGB evolution; \nthis is because the slope of the T(r) relation is smaller for lower effective temperatures\nand the higher $\\tau_L$ also result in pushing out the region where \n$T\\sim 1100$ K (see equation \\ref{eqt}). The typical size of the carbon grains formed, \n$a_C$, is of the order of $0.1-0.2~\\mu$m and increases during the AGB evolution. In the \nfinal evolutionary phases of the $2.5~M_{\\odot}$ model we find $a_C \\sim 0.3~\\mu$m, \nwhereas we get a maximum dimension $a_C \\sim 0.2~\\mu$m in the $1.5~M_{\\odot}$ case.\n\nIn the comparison between the SiC and solid carbon dust formed, we note that\nthe amount of SiC, after saturation conditions occur, stays constant during the\nAGB evolution. On the other hand larger and larger quantities of solid carbon grains\nare formed as the star accumulates carbon in the surface regions. Therefore, we expect\nthat the SiC/C ratio decreases during the AGB evolution (see Fig.~\\ref{fsed} and section 6). \n\nThe velocity reached by the wind also increases during the evolution of these stars,\nspanning the range $10-50$ km/s.\n\n\\subsection{An overview of MONASH and ATON results}\nThe comparison between the MONASH and ATON results allows us to study\nthe main factors affecting carbonaceous dust formation in AGB stars.\n\nThe evolution of the infrared properties of these stars is strongly related to the \namount of dust formed. \nAs discussed in section \\ref{dustmodel}, formation of solid carbon is determined\nby the surface carbon abundance and the $\\dot M/L$ ratio. The former is relevant \nat the beginning of the C-star phase, as confirmed by the steep slope of the \n$a_C$ vs X(C) and $\\tau_{10}$ vs X(C) relations shown in Fig.~\\ref{ftau}. This is\nbecause the growth rate of carbon dust is proportional to the density of \n$C_2H_2$ molecules, which in turn, is given by the carbon excess with respect to\noxygen (see equation \\ref{acar}). For small carbon abundances even a small change\nof X(C) favours a high percentage increase in $n_{C_2H_2}$, which results in a\nsignificant rise in the growth rate of carbon grains. After the surface carbon exceeds\n$X(C) \\sim 5\\times 10^{-3}$ the relative weight of this factor diminishes, because any \nadditional change will result in a smaller percentage increase in the number density\nof $C_2H_2$ particles; the $\\dot M /L$ ratio plays a dominant role here.\n\nFig~\\ref{ftau} shows that at the end of the AGB evolution higher values of $\\tau_{10}$ are\nreached in the ATON models. For $M=1.5~M_{\\odot}$ we find $\\tau_{10} = 0.1$ in the\nMONASH model, whereas we obtain $\\tau_{10} = 0.7$ in the ATON case. \nIn this case the star reaches relatively small carbon abundances, $X(C) < 7\\times 10^{-3}$.\nFollowing the above discussion, we know that this is the domain most affected by the \ncarbon content. The ATON model produces more dust than MONASH (see left panel of \nFig.~\\ref{ftau}), owing to the higher availability of carbon in the surface regions, \nas shown in the bottom--right panel of Fig.~\\ref{fmodel}. The infrared \nemission is consequently more intense in the ATON case.\n\nTurning to models of higher mass and metallicity, we find that the $3~M_{\\odot}$ MONASH \nmodel evolves to $\\tau_{10} \\sim 1$, while the $2.5~M_{\\odot}$ ATON model reaches \n$\\tau_{10} \\sim 5$ at the end of the AGB phase. \nStars of this mass undergo more TDU events, thus becoming more C-rich\nduring the AGB evolution. The rate of mass loss plays a dominant role here in\naffecting dust formation. This is confirmed by the comparison between the\nMONASH model of $3~M_{\\odot}$ with the ATON, $2.5~M_{\\odot}$ case: despite the former\nexperiences a larger carbon enrichment (see Fig.~\\ref{fmodel}), the latter reaches higher \noptical depths in the final phases, owing to the higher rate of mass loss experienced.\n\n\n\n\\begin{figure*}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figSMC.pdf}}\n\\end{minipage}\n\\begin{minipage}{0.47\\textwidth}\n\\resizebox{1.\\hsize}{!}{\\includegraphics{figLMC.pdf}}\n\\end{minipage}\n\\vskip-40pt\n\\caption{Left: The observations of SMC AGB stars by \\citet{boyer11} in the\ncolour--colour $[3.6]-[4.5],[5.8]-[8.0]$ diagram. The $1.5~M_{\\odot}$ evolutionary\ntracks calculated with the MONASH (open, blue triangles) and ATON (full, red triangles)\nare shown. The region delimited by the dashed lines corresponds to the zone where\nobscured C-stars evolve, according to the interpretation by \\citet{flavia15b}.\nRight: Observations of LMC, AGB stars by \\citet{riebel12}; the evolutionary tracks\ncorrespond to MONASH models of initial mass $2.25~M_{\\odot}$ (open, green squares),\n$3~M_{\\odot}$ (open, magenta circles) and to ATON models of initial mass\n$2.5~M_{\\odot}$ (full, black squares), $3~M_{\\odot}$ (full, orange circles).\nThe region delimited by dashed lines, similarly to the left panel, indicates\nthe zone populated by C-stars with an intense infrared emission \\citep{flavia15a}.\n}\n\\label{fmcs}\n\\end{figure*}\n\n\n\\section{Spitzer colours of carbon stars in the MCs}\n\\label{colours}\nAs discussed in the previous sections, the evolution of AGB stars with progenitors of\nmass below $\\sim 3~M_{\\odot}$ is driven by the progressive enrichment of carbon in the\nsurface regions. The SED of these stars gradually shifts to the IR, with the peak of the \nemission moving to longer wavelengths. This is illustrated in Fig.~\\ref{fsed}, where we \nshow the SED of the $1.5~M_{\\odot}$, $Z=4\\times 10^{-3}$ (left panel) and $2.5~M_{\\odot}$, \n$Z=8\\times 10^{-3}$ models, in four evolutionary phases from the beginning of the \nAGB evolution, with practically no dust effects, to the very final phases. \nAt the end of the AGB phase the SED of the $2.5~M_{\\odot}$ model peaks at longer \nwavelengths compared to the $1.5~M_{\\odot}$ case, \nfor the reasons given in Section \\ref{dustgrain}.\n\nFig.~\\ref{fmcs} shows AGB stars in the SMC (left panel) and LMC (right) on the \ncolour--colour ($[3.6]-[4.5], [5.8]-[8.0]$) plane. The regions delimited by the \ndashed lines are the C-star locii, according to\n\\citet{flavia15a, flavia15b}. As discussed in section \\ref{mcs}, most of the obscured \nC-stars in the LMC descend from $\\sim 2.5-3~M_{\\odot}$ progenitors, whereas in the SMC the \nobjects with the reddest IR colours are the progeny of $\\sim 1.5~M_{\\odot}$ stars. \nTherefore the SEDs, corresponding to the end of the AGB phase (dashed lines),\nshown in Fig.~\\ref{fsed}, provide an indication of the typical colours of the most\nobscured AGB stars in the two galaxies. The synthetic SEDs confirm that the most\nobscured LMC AGB stars reach redder $[3.6]-[4.5]$ colours than their SMC\ncounterparts. This explains why the C-star locus in the LMC is more\nextended towards the red (up to $[3.6]-[4.5] \\sim 3$) than in the SMC\n($[3.6]-[4.5] \\sim 1.2$)\n\nThis explanation is in constrast to the interpretation by \\citet{jacco08},\nwho invoked a metallicity dependence on dust formation to explain the stronger dust emission \nshown by carbon stars in the LMC compared to the SMC. Note that the present\nworking hypothesis is focused on stars with the reddest colours, thus it is not\nin contrast with the assumption that C-star formation is easier in the SMC becaue of \nthe lower average metallicity \\citep{sloan08}.\n\nThe overall population of C-stars in the MCs is composed of a range of masses and \nchemistries \\citep{flavia15a, flavia15b}, which in the general case prevents us\nfrom identifying the progenitors of the \nindividual sources observed. To overcome this difficulty we focus on the AGB stars\npopulating the terminal side of the obscuration sequences of C-stars. \nAs discussed in section \\ref{mcs}, each star becoming C rich spends only a very\nsmall percentage of the AGB in the last evolutionary phase with the highest\ndegree of obscuration. Therefore only stars of masses and metallicities given above can be\nobserved in such advanced evolutionary phases.\n\nFig.~\\ref{fmcs} shows the evolutionary tracks corresponding\nto the same MONASH and ATON models shown in Fig.~\\ref{ftau}.\nAll the evolutionary sequences reproduce the diagonal band where C-stars evolve.\nThe only discrepancy between models and the observations concerns the C-stars\npopulating the bluest region of the CCD, centred at \n$([3.6]-[4.5], [5.8]-[8.0]) = (-0.1, 0.5)$. This group of stars present no signature of\ndust, consequently the synthetic spectrum is entirely determined by the GRAMS SED \nused to model the atmosphere of the central star. \nThe reason for the difference is the absorption feature due to CO and\nC$_{3}$ molecules, which is not included in the GRAMS models. This is however\nnot an issue for the present analysis, because this feature \nvanishes when dust is present in the circumstellar envelope \\citep{boyer11}.\n\nThe fact that both MONASH and ATON sequences trace the observations further reinforces \nthe main conclusions by \\citet{flavia15a, flavia15b}: the diagonal bands in \nthe CCD of the LMC and SMC are obscuration sequences. The stars with the reddest colours \ncorrespond to those more enriched in carbon, with a larger amount of carbonaceous \ndust in the circumstellar envelope.\n\nFig.~\\ref{fmcs} shows that the ATON models nicely reproduce the observations, the \nevolutionary tracks reaching the terminal points of the observed sequences, both in the SMC\nand LMC cases. The MONASH models reproduce most of the AGB stars along the obscuration\nsequences, yet they do not extend to the reddest IR colours observed.\nThis can be explained on the basis of the discussion in the previous section and of the \nresults shown in Fig.~\\ref{ftau} and \\ref{fstrat}. For the SMC, the reason for the higher \ndegree of obscuration reached by the ATON sequences is mainly related to the higher quantity of\ncarbon accumulated in $1.5~M_{\\odot}$ stars during the AGB. For the LMC case, \nthe main reason for the discrepancy among MONASH and ATON models is the difference in the \ndescription of the low-temperature molecular opacities in C-rich environments and in the \nmass-loss modelling (see section \\ref{inputs}). These in turn affect the IR properties of \nthe reddest AGB stars in the LMC, which reflects the mass-loss rate experienced in the final \nAGB phases, which, in turn is related to the effective temperature.\n\nThese arguments lead us to conclude that reproducing the IR colours of the \nmost obscured AGB stars in the SMC requires models of stars of initial mass \n$1.5~M_{\\odot}$ to achieve a surface carbon abundance $X(C) > 0.005$. \nIn order to reproduce the IR colours of the LMC AGB stars, we conclude that the main\nphysical ingredient is the low-temperature opacities used in the calculations.\nThe use of low-temperature opacities that follow the chemical composition of the\nenvelope is especially important for stars with masses $2.5-3~M_{\\odot}$, which in the last \nphases reach surface carbon abundances $X(C) > 0.01$. Furthermore, the description of mass \nloss in C-rich environments, where significant amounts of dust form, must be \nbased on hydrodynamical wind models including dust formation in radiative transfer\nequations. \n\n\n\n\n\n\\begin{table*}\n\\begin{center}\n\\caption{} \n\\begin{tabular}{c|c|c|c|c|c|c|c|c|c|c|}\n\\hline\n\\hline \n & $[3.6]-[4.5]$ & $\\tau_{10}$ & $a_{SiC} (\\mu m)$ & $a_C(\\mu m)$ & Age (Gyr) & \n $M/M_{\\odot}$ & $L/(10^3L_{\\odot})$ & $T_{\\rm eff}$ & $\\dot M/(10^{-5}M_{\\odot}/$yr) & Z \\\\  \n\\hline\nLMC & 3.4 & 4.5 & 0.082 & 0.28 & 0.4--0.7 &  2.5--3 & $8-10$ & 2000 & 15 & $8\\times 10^{-3}$ \\\\\nSMC & 1.2 & 0.7 & 0.063 & 0.21 & 1.5      &  1.5    & $6-7$  & 2500 & 3  & $4\\times 10^{-3}$ \\\\\n\\hline \n\\hline \n\\end{tabular}\n\\end{center}\n\\label{tabrates}\n\\end{table*}\n\n\n\n\nWe stress that the results obtained by MONASH and ATON codes are fairly similar \nfor most of the AGB phase, for the masses and metallicities investigated here. Significant \ndifferences are found only during the two last interpulse phases. For this reason,\nthe change in the physical ingredients discussed are crucial for a correct\ndetermination of the dust properties of these stars and, more generally, for the interpretation\nof IR properties of more complex stellar populations, where a significant population\nof C-stars is expected. On the other hand, we expect little effects for the other\nresults not directly related to dust, primarily the stellar yields, which reflect the\nwhole AGB phase. \n\n\\section{What do we learn from obscured carbon stars in the MCs?}\nThe models presented here nicely reproduce the mid--infrared colours for the SMC \nand LMC. According to our schematization AGB stars become more and more obscured as the \ncarbon in the envelope increases. If this is correct, the LMC proves the ideal environment \nto host C-stars with an extremely intense infrared emission. This is because the SFH of the LMC \npeaks at $\\sim 500$ Myr \\citep{harris09}, the formation epoch of $\\sim 2.5-3~M_{\\odot}$ \nstars which are those reaching the largest abundances of carbon in the final evolutionary \nphases (see Fig.~\\ref{fmodel}). If this understanding is confirmed, we reach the general \nconclusion that the degree of obscuration of the reddest stars in the LMC is the highest \namong C-rich AGB stars; for stars exhibiting a higher degree of obscuration, \nan AGB origin can be disregarded.\n\nTable 1 reports the main properties of the individual stars which according to our interpretation\npopulate the reddest portion of the C-star sequence in the CCD of the MCs. Observational \nconfirmation of these quantities (in particular of the predicted radial stratification of the\nSiC and carbon grains) would be ideal to assess the robustness of our\nmodelling and interpretation. Unfortunately this is challenging with\npresent astronomical instrumentation. \n\nConcerning the synthetic SEDs of the stars examined here, we note that the dashed track \nin the right panel of Fig.~\\ref{fsed} is extremely similar to the SED of the extreme carbon \nstar shown in the top-left panel of Figure 7 by Riebel et al. (2012), which\nis taken as a representative member of the group of most obscured C-stars in the LMC.\nInterestingly, in SMC C-rich AGB stars the C$_{2}$H$_{2}$ and SiC features are\nobserved to be stronger and weaker, respectively, than in the LMC stars (e.g.,\nLagadec et al. 2007; Zijlstra et al. 2006, van Loon et al. 2006, 2008). \nIndeed, our synthetic SEDs, which show an\nintermediate stage after becoming C-rich (red-dotted lines in Fig.~\\ref{fsed}),\nreproduce well this observation. The 3.1 $\\mu$m C$_{2}$H$_{2}$ $+$ HCN\nabsorption feature is stronger in a $1.5~M_{\\odot}$ SMC AGB star than in the $3~M_{\\odot}$\nLMC case, while the opposite is seen for the $\\sim$11.5 $\\mu$m SiC feature. This is \nin agreement with our framework because the production of SiC (see discussion in section \n\\ref{dustmodel}) scales with the amount of silicon available at the surface, which in turn, \nis proportional to the metallicity of the stars. Therefore production of SiC is favoured \nin the LMC, because the metallicity of the C-stars in this galaxy, particularly those \nforming the largest quantities of dust, is generally larger than their counterparts in the \nSMC. On the other hand carbon dust production is approximately independent of\nmetallicity, because the carbon accumulated to the surface of these stars is of \nprimary origin.\n\nAs for the global properties of these objects, \\citet{riebel12} find that the luminosities\nof the most obscured C-stars in the LMC are within the range \n$6\\times 10^3 < L/L_{\\odot} < 10^4$, which nicely overlaps with the range of\nluminosities for the LMC reported in Table 1. \n\nConcerning the mass loss rates, \\citet{riebel12} find that the C-stars in the LMC with\nthe highest degree of obscuration inject into the interstellar medium carbonaceous \ndust with a rate of $\\sim 10^{-7} M_{\\odot}/$yr. This is translated into an overall\nmass-loss rate of $\\sim 2\\times 10^{-5} M_{\\odot}/$yr\\footnote{To find the mass-loss\nrate from the dust rate we adopted a gas/dust ratio $\\sim 200$. This is indeed what we\nfind based on our models, with a carbon mass fraction slightly above $1\\%$ and a\npercentage of gaseous carbon condensed into dust of $\\sim 50\\%$.}. This quantity is\nsignificantly smaller than the result reported in Table 1, which is in much better\nagreement with the results published by \\citet{vista, vanloon06, martin07}.\n\nOn the chemical side, we have seen that the conclusions we may draw for the SMC\nand LMC are different. In the former case, we showed that within the context of\nour description of the AGB and dust systems the colours of the C-stars exhibiting\nthe highest degree of obscuration are reproduced only if the amount of carbon\naccumulated at the surface exceeds $\\sim 0.5\\%$ of the total mass. This\nC abundance this corresponds to a C/O ratio above 3. The IR colours of the most \nobscured LMC C-stars are however less sensitive to the surface carbon abundance \nthan their SMC counterparts. The uncertainties affecting the degree of carbon\nenrichment are still significant, which is confirmed\nby the differences between the MONASH (surface carbon mass fraction slightly\nbelow 0.02, C/O$\\sim$10) and ATON (X(C)$\\sim$0.01, C/O$\\sim$3) models. \n\nThe most obscured C-stars in the MCs are very faint in the optical domain but\nmuch brighter in the near-IR. Thus the best observational way to test the\ndifferent nature (i.e., progenitor masses) of the obscured C-stars in the SMC\nand LMC would be to obtain follow-up high-resolution \n($R={\\lambda\\over \\delta \\lambda}>$20,000) near-IR (JHK\nbands) spectroscopy of these stars. This can be done with actual instrumentation\n(e.g., CRIRES at ESO/VLT). From such spectra one could get the CNO elemental\nabundances, which are expected to be different in both types of stars (see e.g.,\nVentura et al. 2015b).\n\nOn the other hand, an analysis of the chemical composition of PNe in the MCs\nwould provide important complementary information on the chemical enrichment\nof C-stars in these galaxies. This is because only small surface abundance changes\nare expected from the final AGB phase to the PN stage. For example, \\citet{ventura15b} \nshowed that the most C-enriched PNe in the LMC display carbon abundances below\nX(C)$\\sim$0.01, in agreement with the $2.5~M_{\\odot}$ and $3~M_{\\odot}$ ATON models and\nwith the $2.25~M_{\\odot}$ MONASH model (see the bottom-right panel in Fig.~\\ref{fmodel}). \nThe extension of this type of analysis to a much wider sample of PNe in the LMC (and \nalso to the SMC PNe) will help us to understand whether this upper limit in the carbon\nabundance is real, or due to the limited sample of PNe examined.\n\n\n\\section{Conclusions}\n\\label{concl}\nWe use {\\it Spitzer} IR data of C-stars in the Magellanic Clouds to improve our understanding of \nthe evolution of AGB stars with masses below  $\\sim 3~M_{\\odot}$, which become carbon\nstars through repeated TDU events. We focus on the objects with the highest degree\nof obscuration,  because it is easier to characterise their progenitors in terms of their \ninitial masses and metallicities. This is due to differences in the SFH between the \nSMC and the LMC, allowing us to investigate stars of different mass. The analysis of the \nSMC permits to study the evolutionary properties of AGB stars of mass $\\sim 1.5~M_{\\odot}$, \nwhereas we use the LMC to investigate higher mass stars, with $\\sim 2.5-3~M_{\\odot}$. \n\nThe LMC sequence of C-stars extends to redder IR colours ($[3.6]-[4.5] \\sim 3$) compared \nto the SMC ($[3.6]-[4.5] \\sim 1.2$). According to our interpretation, this is because of \nthe higher quantity of carbonaceous dust forming in the circumstellar envelope \nof $\\sim 2.5-3~M_{\\odot}$ stars, in comparison with their lower mass ($\\sim 1.5~M_{\\odot}$)\ncounterparts evolving in the SMC.\n\nThe comparison between models and observations suggests the following: a) in \n$\\sim 1.5~M_{\\odot}$ AGB stars TDU must be efficient enough to produce a surface carbon \nabundance above $X(C) \\sim 0.005$ before the end of the AGB phase; b) to correctly \nmodel the late AGB phases of stars of mass $\\sim 2.5-3~M_{\\odot}$ it is mandatory to \ninclude the carbon enrichment in the calculation of the low-temperature molecular \nopacities \\citep{marigo02,vm09,vm10,kamath12}. In addition, the description of mass loss \nmust rely on hydrodynamical simulations, which take into account dust formation. These \nphysical ingredients are crucial in order to reproduce the extremely red colours of the \nC-stars in the LMC with the largest degree of obscuration. Based on our modelling,\nthese stars evolve at effective temperatures close to $\\sim 2000$ K and loose their\nexternal mantle with a rate slightly above $10^{-4}~M_{\\odot}/$yr.\n\nIf our understanding is correct, we expect that the most obscured stars in the SMC \nare surrounded by a more internal region with SiC dust grains\n$\\sim 0.06 \\mu$m sized, and a more external zone, $\\sim 10$ stellar radii from the \nsurface of the star, where SiC grains and $\\sim 0.2~\\mu$m sized, solid carbon \nparticles are present. In the counterparts in the LMC, the higher metallicity favours a larger\ngrowth of SiC grains, which reach dimensions of the order of $\\sim 0.06~\\mu$m.\nSolid carbon grains on the other hand can grow to $\\sim 0.28~\\mu$m, because\nthese stars are more enriched in gaseous carbon than their counterparts \nof smaller mass.\n\nHigh-resolution near-IR spectroscopy of the most obscured C-stars in the SMC and LMC as \nwell as the analysis of a wider MC PNe sample will allow us to test the conclusions reached \nhere; i.e., the most obscured C-rich AGB stars in the LMC are the descendants of stars \nwith higher initial masses than their SMC counterparts.\n\n\\section*{Acknowledgments}\nThe authors are indebted to the referee, J. Th. van Loon, for the careful reading of the\nmanuscript and for the several comments, that help improving significantly the quality\nof this work. P.V. was supported by PRIN MIUR 2011 \"The Chemical and Dynamical Evolution \nof the Milky Way and Local Group Galaxies\" (PI: F. Matteucci), prot. 2010LY5N2T. A.I.K. \nwas supported through an Australian Research Council Future Fellowship (FT110100475). \nDAGH was funded by the Ram\\'on y Cajal fellowship number RYC$-$2013$-$14182 and he \nacknowledges support \nprovided by the Spanish Ministry of Economy and Competitiveness (MINECO) under grant \nAYA$-$2014$-$58082-P. F.D. and M.D.C. acknowledge support from the Observatory of Rome.\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem[\\protect\\citeauthoryear{Allard et al. et al.}{2012}]{nextgen}\nAllard F., Homeier D., Freytag B., 2012, Philosophical Transactions of the \nRoyal Society A: Mathematical, Physical and Engineering Sciences, vol. 370, \nissue 1968, p2765\n\\bibitem[Becker \\& Iben(1980)]{becker80} Becker S.~A., Iben I. Jr.\\ 1980, ApJ, 237, 111 \n\\bibitem[Bessell et al.(1989)]{bessel89} Bessell M.~S., Brett J.~M., Wood P.~R., \nScholz M.\\ 1989, A\\&AS, 77, 1\n\\bibitem[Bladh \\& H{\\\"o}fner(2012)]{bladh12} Bladh S., H{\\\"o}fner S.\\ 2012, A\\&A, 546, 76\n\\bibitem[\\protect\\citeauthoryear{Bl\\\"ocker}{1995}]{blocker95}\nBl\\\"ocker T., 1995, A\\&A, 297, 727\n\\bibitem[\\protect\\citeauthoryear{Bl\\\"ocker \\& Sch\\\"onberner}{1991}]{blocker91}\nBl\\\"ocker T., Sch\\\"onberner D., 1991, A\\&A, 244, L43\n\\bibitem[\\protect\\citeauthoryear{Blum et al.}{2006}]{blum06}\nBlum R.~D. et al., 2006, AJ, 132, 2034\n\\bibitem[Boyer et al.(2011)]{boyer11} Boyer M.~L., Srinivasan S., \nvan Loon, J.~T., et al.\\ 2011, AJ, 142, 103 \n\\bibitem[\\protect\\citeauthoryear{Boyer et al.}{2012}]{boyer12}\nBoyer M.~L., Srinivasan S., Riebel D., McDonald I., van Loon J.~Th., Clayton G.~C.,\nGordon K.~D., Meixner M., Sargent B.~A., Sloan G.~C., 2012, ApJ, 748, 40\n\\bibitem[\\protect\\citeauthoryear{Boyer et al.}{2015}]{boyer15}\nBoyer M.~L., McDonald I., Srinivasan S., et al. 2015, ApJ, 810, 116\n\\bibitem[\\protect\\citeauthoryear{Canuto \\& Mazzitelli}{1991}]{cm91}\nCanuto V.~M.~C., Mazzitelli I., 1991, ApJ, 370, 295\n\\bibitem[\\protect\\citeauthoryear{Carrera et al.}{2008}]{carrera08}\nCarrera R., Gallart C., Hardy E., Aparicio A., Zinn R., 2008, AJ, 135, 836\n\\bibitem[Chiosi et al.(1993)]{chiosi93} Chiosi C., Wood P.~R., Capitanio N.\\ 1993, ApJS, \n86, 541 \n\\bibitem[\\protect\\citeauthoryear{Cioni et al.}{2000a}]{cioni00a}\nCioni, M.-R. L., Loup, C., Habing, H. J., et al., 2000a, A\\&AS, 144, 235\n\\bibitem[\\protect\\citeauthoryear{Cioni et al.}{2000b}]{cioni00b}\nCioni M.-R. L., Habing H. J.,  Israel F. P., 2000b, A\\&A, 358, L9\n\\bibitem[Cioni et al.(2006)]{cioni06} Cioni M.-R.~L., Girardi L., Marigo P., \nHabing H.~J.\\ 2006, A\\&A, 448, 77\n\\bibitem[D'Antona \\& Mazzitelli(1996)]{dantona96} D'Antona,F., Mazzitelli I.\\ 1996, \nApJ, 470, 1093 \n\\bibitem[\\protect\\citeauthoryear{Dell'Agli et al.}{2014}]{flavia14}\nDell'Agli F., Ventura P., Garc{\\'{\\i}}a-Hern{\\'a}ndez D.~A., Schneider R., Di Criscienzo M., \nBrocato E., D'Antona F., Rossi C., 2014, MNRAS, 442, L38\n\\bibitem[\\protect\\citeauthoryear{Dell'Agli et al.}{2015a}]{flavia15a}\nDell'Agli F., Ventura P., Schneider R., Di Criscienzo M., Garc{\\'{\\i}}a-Hern{\\'a}ndez D.~A.,  \nRossi C., Brocato E.  2015a, MNRAS, 447, 2992\n\\bibitem[\\protect\\citeauthoryear{Dell'Agli et al.}{2015b}]{flavia15b}\nDell'Agli F., Garc{\\'{\\i}}a-Hern{\\'a}ndez D.~A., Ventura P., Schneider R., Di Criscienzo M.,   \nRossi C. 2015b, MNRAS, in press\n\\bibitem[\\protect\\citeauthoryear{Di Criscienzo et al.}{2013}]{paperIII}\nDi Criscienzo M., Dell'Agli F., Ventura P., Schneider R., Valiante R., \nLa Franca F., Rossi C., Gallerani S., Maiolino, R., 2013, MNRAS, 433, 313\n\\bibitem[Doherty et al.(2014a)]{doherty14a} Doherty C.~L., Gil-Pons P., Lau H.~H.~B., \nLattanzio J.~C., Siess L.\\ 2014a, MNRAS, 437, 195 \n\\bibitem[Doherty et al.(2014b)]{doherty14b} Doherty C.~L., Gil-Pons P., Lau H.~H.~B., \nLattanzio J.~C., Siess L., Campbell S.~W. \\ 2014b, MNRAS, 441, 582 \n\\bibitem[\\protect\\citeauthoryear{Epchtein et al.}{1994}]{epchtein94}\nEpchtein N. et al., 1994, Ap\\&SS, 217, 3\n\\bibitem[\\protect\\citeauthoryear{Feast}{1999}]{feast99}\nFeast M., 1999, PASP, 111, 775\n\\bibitem[\\protect\\citeauthoryear{Ferrarotti \\& Gail}{2001}]{fg01}\nFerrarotti A.~D., Gail H.~P., 2001, A\\&A, 371, 133\n\\bibitem[\\protect\\citeauthoryear{Ferrarotti \\& Gail}{2002}]{fg02}\nFerrarotti A.~D., Gail H.~P., 2002, A\\&A, 382, 256\n\\bibitem[\\protect\\citeauthoryear{Ferrarotti \\& Gail}{2006}]{fg06}\nFerrarotti A.~D., Gail H.~P., 2006, A\\&A, 553, 576\n\\bibitem[Frost \\& Lattanzio(1996)]{frost96} Frost C.~A., Lattanzio J.~C.\\ 1996, ApJ, 473, 383 \n\\bibitem[\\protect\\citeauthoryear{Gail \\& Sedlmayr}{1985}]{gs85}\nGail H.~P., Sedlmayr E., 1985, A\\&A, 148, 183\n\\bibitem[\\protect\\citeauthoryear{Gail \\& Sedlmayr}{1999}]{gs99}\nGail H.~P., Sedlmayr E., 1999, A\\&A, 347, 594\n\\bibitem[\\protect\\citeauthoryear{Gordon et al.}{2011}]{gordon11}\nGordon K.~D. et al. 2011, AJ, 142, 102\n\\bibitem[\\protect\\citeauthoryear{Grevesse \\& Sauval}{1998}]{gs98}\nGrevesse N., Sauval A.~J, 1998, SSrv, 85, 161\n\\bibitem[Groenewegen \\& de Jong(1993)]{martin93} Groenewegen M.~A.~T., de Jong T.\\ 1993, \nA\\&A, 267, 410\n\\bibitem[Groenewegen et al.(2007)]{martin07} \nGroenewegen M.~A.~T., Wood P.~R., Sloan G.~C., et al.\\ 2007, MNRAS, 376, 313 \n\\bibitem[Gullieuszik et al.(2012)]{vista} Gullieuszik M., Groenewegen M.~A.~T., \nCioni M.-R.~L., et al.\\ 2012, A\\&A, 537, A105\n\\bibitem[Harris \\& Zaritsky(2004)]{harris04} Harris J., Zaritsky D.\\ 2004, AJ, 127, 1531 \n\\bibitem[\\protect\\citeauthoryear{Harris \\& Zaritsky}{2009}]{harris09}\nHarris J., Zaritsky D. 2009, ApJ, 138, 1243\n\\bibitem[Herwig(2005)]{herwig05} Herwig F.\\ 2005, ARA\\&A, 43, 435 \n\\bibitem[\\protect\\citeauthoryear{H{\\\"o}fner}{2008}]{hofner08}\nH{\\\"o}fner S. 2008, A\\&A, 491, L1\n\\bibitem[\\protect\\citeauthoryear{Herwig}{2005}]{herwig05}\nHerwig F., 2005, AR\\&A, 43, 435\n\\bibitem[Iben(1982)]{iben82} Iben I. Jr.\\ 1982, ApJ, 260, 821\n\\bibitem[Iben \\& Renzini(1983)]{iben83} Iben I. Jr., Renzini A.\\ 1983, ARA\\&A 21, 271 \n\\bibitem[Izzard et al.(2004)]{izzard04} Izzard R.~G., Tout C.~A., Karakas A.~I., \nPols O.~R.\\ 2004, MNRAS, 350, 407\n\\bibitem[Lagadec et al.(2007)]{lagadec07} Lagadec E., Zijlstra A.~A., Sloan G.~C. et al. \n2007, MNRAS, 376, 1270\n\\bibitem[Lattanzio(1986)]{lattanzio86} Lattanzio J.~C.\\ 1986, ApJ, 311, 708 \n\\bibitem[Kamath et al.(2012)]{kamath12} Kamath D., Karakas A.~I., Wood, P.~R.\\ 2012, ApJ, \n746, 20 \n\\bibitem[Karakas et al.(2002)]{karakas02} Karakas A.~I., \nLattanzio J.~C., Pols O.~R.\\ 2002, PASA, 19, 515\n\\bibitem[Karakas \\& Lattanzio(2007)]{karakas07} Karakas A., Lattanzio J.~C.\\ 2007, PASA, 24, 103 \n\\bibitem[Karakas(2010)]{karakas10} Karakas A.~I.\\ 2010, MNRAS, 403, 1413 \n\\bibitem[Karakas et al.(2010b)]{karakas10b} Karakas A.~I., Campbell S.~W., \nStancliffe R.~J.\\ 2010, ApJ, 713, 374\n\\bibitem[Karakas(2011)]{karakas11} Karakas A.~I.\\ 2011, in: Why Galaxies Care about AGB \nStars II: Shining Examples and Common Inhabitants, ASPC, 445, 3\n\\bibitem[Karakas \\& Lattanzio(2014)]{karakas14} Karakas A.~I., Lattanzio J.~C.\\ 2014, PASA, 31, e030 \n\\bibitem[Maiolino et al.(2004)]{maiolino04} Maiolino R., Schneider R., Oliva E., \net al.\\ 2004, Nature, 431, 533 \n\\bibitem[Marigo(2002)]{marigo02} Marigo P.\\ 2002, A\\&A, 387, 507 \n\\bibitem[\\protect\\citeauthoryear{Marigo \\& Aringer}{2009}]{marigo09} \nMarigo P., Aringer B., 2009, A\\&A, 508, 1538\n\\bibitem[Marigo \\& Girardi(2007)]{marigo07} Marigo P., Girardi L.\\ 2007, A\\&A, 469, 23\n\\bibitem[Marigo et al.(1999)]{marigo99} Marigo P., Girardi L., Bressan A.\\ 1999, A\\&A, 344, 123\n\\bibitem[Marigo et al.(2008)]{marigo08} Marigo P., Girardi L., Bressan A., \nGroenewegen M. A. T., Silva L., Granato, G. L.\\ 2008, A\\&A, 482, 883\n\\bibitem[\\protect\\citeauthoryear{Matsuura et al.}{2009}]{matsuura09} \nMatsuura M., et al., 2009, MNRAS, 396, 918\n\\bibitem[\\protect\\citeauthoryear{Matsuura et al.}{2013}]{matsuura13} \nMatsuura M., Woods P.~V., Owen P.~J., 2013, MNRAS, 429, 2527\n\\bibitem[\\protect\\citeauthoryear{Meixner et al.}{2006}]{meixner06} \nMeixner M. et al. 2006, AJ, 132, 2268\n\\bibitem[\\protect\\citeauthoryear{Meixner et al.}{2010}]{meixner10} \nMeixner M. et al. 2010, A\\&A, 518, L71\n\\bibitem[\\protect\\citeauthoryear{Meixner et al.}{2013}]{meixner13} \nMeixner M. et al. 2013, ApJ, 146, 62\n\\bibitem[\\protect\\citeauthoryear{Nanni et al.}{2013a}]{nanni13a} \nNanni A., Bressan A., Marigo P., Girardi L., 2013a, MNRAS, 434, 488\n\\bibitem[\\protect\\citeauthoryear{Nanni et al.}{2013b}]{nanni13b} \nNanni A., Bressan A., Marigo P., Girardi L., 2013b, MNRAS, 434, 2390\n\\bibitem[\\protect\\citeauthoryear{Nanni et al.}{2014}]{nanni14} \nNanni A. Bressan A. Marigo P. Girardi L., 2014, MNRAS, 438, 2328\n\\bibitem[\\protect\\citeauthoryear{Nenkova et al.}{1999}]{dusty} \nNenkova M., Ivezi{\\'c} {\\v Z}., Elitzur M., 1999, in: LPIContributions 969,\nWorkshop on Thermal Emission Spectroscopy and Analysis of Dust, Disks, and \nRegoliths, ed. A. Sprague, D. K. Lynch, \\& M. Sitko (Houston, TX: Lunar and \nPlanetary Institute), 20\n\\bibitem[\\protect\\citeauthoryear{Nozawa et al.}{2003}]{nozawa03}\nNozawa T., Kozasa T., Umeda H., Maeda K., Nomoto K. 2003, ApJ, 598, 785\n\\bibitem[Paczy{\\'n}ski(1970)]{paczynski} Paczy{\\'n}ski, B.\\ 1970, \nActa Astr., 20, 47 \n\\bibitem[Piatti(2012)]{piatti12} Piatti A.~E.\\ 2012, MNRAS\n422, 1109 \n\\bibitem[\\protect\\citeauthoryear{Piatti \\& Geisler}{2013}]{piatti13} \nPiatti A.E., Geisler G., 2013, AJ, 145, 17\n\\bibitem[\\protect\\citeauthoryear{Renzini \\& Voli}{1981}]{renzini81} Renzini A.,\nVoli M., 1981, A\\&A, 94, 175\n\\bibitem[\\protect\\citeauthoryear{Riebel et al.}{2010}]{riebel10} \nRiebel D., Meixner M., Fraser O., Srinivasan S., Cook K., Vijh U., 2010, ApJ, 723, 1195\n\\bibitem[\\protect\\citeauthoryear{Riebel et al.}{2012}]{riebel12} \nRiebel D., Srinivasan S., Sargent B., Meixner M., 2012, AJ, 753, 71\n\\bibitem[Romano et al.(2010)]{romano10} Romano D., Karakas A.~I., Tosi M., \nMatteucci F.\\ 2010, A\\&A 522, AA32 \n\\bibitem[\\protect\\citeauthoryear{Schwarzschild \\& Harm}{1965}]{schw65}\nSchwarzschild M.,  Harm R. 1965, ApJ, 142, 855\n\\bibitem[\\protect\\citeauthoryear{Schwarzschild \\& Harm}{1967}]{schw67}\nSchwarzschild M.,  Harm R. 1967, ApJ, 145, 496\n\\bibitem[\\protect\\citeauthoryear{Skrutskie et al.}{2006}]{skrutskie06} \nSkrutskie M.~F. et al., 2006, AJ, 131, 1163\n\\bibitem[\\protect\\citeauthoryear{Schlegel et al.}{1998}]{schlegel98} \nSchlegel D.~J., Finkbeiner D.~P., Davis M., 1998, ApJ, 500, 525\n\\bibitem[Schneider et al.(2014)]{schneider14} Schneider R., \nValiante R., Ventura P., Dell'Agli F., Di Criscienzo M., Hirashita H.,\nKemper F. \\ 2014, MNRAS, 442, 1440 \n\\bibitem[\\protect\\citeauthoryear{Skrutskie}{1998}]{skrutskie98} \nSkrutskie M. 1998, in: The Impact of Near-Infrared Sky Surveys\non Galactic and Extragalactic Astronomy, Proc. of the 3rd Euroconference \non Near-Infrared Surveys, ed. N. Epchtein, Astrophysics and Space Science \nlibrary (Dordrecht: Kluwer), 230, 11 \n\\bibitem[Sloan et al.(2008)]{sloan08} Sloan G. C., Kraemer K. E., Wood P. R., \nZijlstra A. A., Bernard-Salas J., Devost D., Houck, J. R. \\ 2008, ApJ, 686, 1056 \n\\bibitem[\\protect\\citeauthoryear{Srinivasan et al.}{2009}]{srinivasan09} \nSrinivasan S. et al., 2009, AJ, 137, 4810\n\\bibitem[Srinivasan et al.(2011)]{srinivasan11} Srinivasan S., Sargent B.~A., \nMeixner, M.\\ 2011, A\\&A, 532, A54 \n\\bibitem[Stancliffe et al.(2005)]{stancliffe05} Stancliffe R.~J., Izzard R.~G.,\nTout C.~A.\\ 2005, MNRAS, 356, L1 \n\\bibitem[Todini \\& Ferrara (2001)]{todini01} Todini P., Ferrara A. 2001, MNRAS, 325, 726\n\\bibitem[\\protect\\citeauthoryear{Valiante et al.}{2009}]{valiante09}\nValiante R., Schneider R., Bianchi S., Andersen A., Anja C., 2009, MNRAS, 397, 1661\n\\bibitem[\\protect\\citeauthoryear{van Loon et al.}{1999}]{jacco99} van Loon J.~Th., \nZijlstra A.~A., Groenewegen M.~A.~T. 1999, A\\&A, 346, 805\n\\bibitem[van Loon(2006)]{vanloon06} van Loon, J.\\ 2006, \nAstronomical Society of the Pacific Conference Series, 357, 155 \n\\bibitem[van Loon et al.(2006)]{jacco06} van Loon J. Th., Marshall J. R., Cohen M., \nMatsuura M., Wood P. R., Yamamura I., Zijlstra A. A. \\ 2006, A\\&A, 447, 971 \n\\bibitem[van Loon et al.(2008)]{jacco08} van Loon J.~T., Cohen M., Oliveira J.~M., \n Matsuura M., McDonald I., Sloan G.~C., Wood P.~R., Zijlstra A.~A. \\ 2008, A\\&A, 487, 1055\n\\bibitem[Vassiliadis \\& Wood(1993)]{VW93} Vassiliadis E., Wood P.~R.\\ 1993, ApJ, 413, 641 \n\\bibitem[Ventura et al.(2001)]{ventura01} Ventura P., D'Antona F., Mazzitelli I., \nGratton R.\\ 2001, ApJ, 550, L65 \n\\bibitem[\\protect\\citeauthoryear{Ventura \\& D'Antona}{2005}]{vd05}\nVentura P., D'Antona F., 2005, A\\&A, 431, 279\n\\bibitem[\\protect\\citeauthoryear{Ventura \\& D'Antona}{2008}]{ventura08} \nVentura P., D'Antona F., 2008, A\\&A, 479, 805\n\\bibitem[\\protect\\citeauthoryear{Ventura \\& D'Antona}{2009}]{ventura09} \nVentura P., D'Antona F., 2009, MNRAS, 499, 835\n\\bibitem[Ventura et al.(2001)]{ventura01} Ventura P., D'Antona F., Mazzitelli I., \nGratton R.\\ 2001, ApJL, 550, L65 \n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{2012a}]{paperI} \nVentura P., Di Criscienzo M., Schneider R., Carini R., Valiante R., D'Antona F., \nGallerani S., Maiolino R., Tornamb\\'e A., 2012a, MNRAS, 420, 1442\n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{2012b}]{paperII} \nVentura P., Di Criscienzo M., Schneider R., Carini R., Valiante R., D'Antona F., \nGallerani S., Maiolino R., Tornamb\\'e A., 2012b, MNRAS, 424, 2345\n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{2014a}]{paperIV} \nVentura P., Dell'Agli F., Di Criscienzo M., Schneider R., Rossi C., La Franca F., \nGallerani S., Valiante R., 2014a, MNRAS, 439, 977\n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{2013}]{ventura13} \nVentura P., Di Criscienzo, M., Carini R., D'Antona F., 2013, MNRAS, 431, 3642\n\\bibitem[Ventura et al.(2015a)]{ventura15a} Ventura P., Karakas A.~I., Dell'Agli F., \nBoyer M.~L., Garc{\\'{\\i}}a-Hern{\\'a}ndez D.~A., Di Criscienzo M., Schneider R. 2015a, \nMNRAS, 450, 3181 \n\\bibitem[\\protect\\citeauthoryear{Ventura \\& Marigo}{2009}]{vm09} Ventura P.,\nMarigo P., 2009, MNRAS, 399, L54\n\\bibitem[\\protect\\citeauthoryear{Ventura \\& Marigo}{2010}]{vm10} Ventura P.,\nMarigo P., 2010, MNRAS, 408, 2476\n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{2015b}]{ventura15b} Ventura P., \nStanghellini L., Dell'Agli F., Garc{\\'{\\i}}a-Hern{\\'a}ndez D.~A., Di Criscienzo, M.\\ 2015b, \nMNRAS, 452, 3679 \n\\bibitem[\\protect\\citeauthoryear{Ventura et al.}{1998}]{ventura98} Ventura P.,\nZeppieri A., Mazzitelli I., D'Antona F., 1998, A\\&A, 334, 953\n\\bibitem[\\protect\\citeauthoryear{Wachter et al.}{2002}]{wachter02} \nWachter A., Schr\\\"oder K.~P., Winters J.~M., Arndt T.~U., Sedlmayr E., 2002, A\\&A, 384, 452\n\\bibitem[\\protect\\citeauthoryear{Wachter et al.}{2008}]{wachter08} \nWachter A., Winters J.~M., Schr\\\"oder K.~P., Sedlmayr E., 2008, A\\&A, 486, 497\n\\bibitem[\\protect\\citeauthoryear{Weisz et al.}{2013}]{weisz13} \nWeisz D.~R., Dolphin A.~E., Skillman E.~D., Holtzman J., Dalcanton J.~J., \nCole A.~A., Neary K., 2013, MNRAS, 431, 364\n\\bibitem[\\protect\\citeauthoryear{Wood}{1979}]{wood79} Wood P.~R., 2004, ApJ, 227, 220\n\\bibitem[Woods et al.(2011)]{woods11} Woods, P.~M., Oliveira, \nJ.~M., Kemper, F., et al.\\ 2011, MNRAS, 411, 1597 \n\\bibitem[Yang et al.(2004)]{yang04} Yang X., Chen P., He J. 2004, A\\&A, 414, 1049\n\\bibitem[\\protect\\citeauthoryear{Zaritsky et al.}{2004}]{zaritsky04}\nZaritsky D., Harris J., Thompson I.~B., Grebel E.~K. 2004, AJ, 128, 1606\n\\bibitem[\\protect\\citeauthoryear{Zhukovska et al.}{2008}]{zhukovska08}\nZhukovska S., Gail H.-P., Trieloff M., 2008, A\\&A, 479, 453\n\\bibitem[\\protect\\citeauthoryear{Zhukovska \\& Henning}{2013}]{zhukovska13}\nZhukovska S., Henning T., 2013, A\\&A, 555, 99\n\\bibitem[\\protect\\citeauthoryear{Zijlstra et al.}{2006}]{albert06} Zijlstra A.~A., \nMatsuura M., Wood P.~R. et al. 2006, MNRAS, 370, 1961\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 24320, "prevtext": "\n\n\\noindent\nThe combination of equations \\ref{eqrho} and \\ref{approx} leads to:\n\n\n", "index": 15, "text": "\\begin{equation}\n\\rho_C \\sim {\\dot M\\over v} \\left[ {T_C^4 \\over L} - {\\tau_L\\over 12\\pi \\sigma R_*^2} \\right]\n\\label{rhof}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\rho_{C}\\sim{\\dot{M}\\over v}\\left[{T_{C}^{4}\\over L}-{\\tau_{L}\\over 12\\pi%&#10;\\sigma R_{*}^{2}}\\right]\" display=\"block\"><mrow><msub><mi>ρ</mi><mi>C</mi></msub><mo>∼</mo><mrow><mfrac><mover accent=\"true\"><mi>M</mi><mo>˙</mo></mover><mi>v</mi></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><msubsup><mi>T</mi><mi>C</mi><mn>4</mn></msubsup><mi>L</mi></mfrac><mo>-</mo><mfrac><msub><mi>τ</mi><mi>L</mi></msub><mrow><mn>12</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><msubsup><mi>R</mi><mo>*</mo><mn>2</mn></msubsup></mrow></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}]