[{"file": "1601.00229.tex", "nexttext": "\n\nThen the agent will adjust its price to get closer to $\\mu_{spread}$ in the following way:\n", "itemtype": "equation", "pos": 32370, "prevtext": "\n\n\\title{A detailed heterogeneous agent model for a single asset\n  financial market with trading via an order book}\n\n\\author{Roberto Mota N  and Hern\\'an Larralde}\n\\address{Instituto de Ciencias F\\'isicas, Universidad Nacional Aut\\'onoma de M\\'exico, Cuernavaca, Morelos, C.P. 62210, M\\'exico}\n\n\\ead{mvr@fis.unam.mx}\n\n\n\n\\begin{abstract}\nWe present an agent based model of a single asset financial market\nthat is capable of replicating several non-trivial statistical\nproperties observed in real financial markets, generically referred to\nas stylized facts. While previous models reported in the literature\nare also capable of replicating some of these statistical properties,\nin general, they tend to oversimplify either the trading mechanisms or\nthe behavior of the agents. In our model, we strived to capture the\nmost important characteristics of both aspects to create agents that\nemploy strategies inspired on those used in real markets, and, at the\nsame time, a more realistic trade mechanism based on a double auction\norder book. We study the role of the distinct types of trader on the\nreturn statistics: specifically, correlation properties (or lack\nthereof), volatilty clustering, heavy tails, and the degree to which\nthe distribution can be described by a log-normal. Further, by\nintroducing the practice of ``profit taking'', our model is also\ncapable of replicating the stylized fact related to an asymmetry in\nthe distribution of losses and gains.\n\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\n\nIn the past five decades a great number of time series of prices of\nvarious financial markets have become publicly available and been\nsubjected to analysis to characterize their statistical properties\n\\cite{Pagan1996,Cont2001,Mantegna1999,Mandelbrot1963,Mandelbrot1967}.\nFrom the study of these time series, a set of properties common to\nmany different markets, time periods and instruments, have been\nidentified. The universality of these properties is of interest\nbecause events that may affect the changes of price (returns) in a\ncertain market need not be the same that affect the changes in another\nmarket. Nevertheless, the results of these investigations show that\nthe variations in prices share some non trivial statistical properties\nwhich have been called \\textit{stylized facts}. In this work we\npresent and study a model of a financial market and its participants\nwhich reproduces these stylized facts. Among the key results found in\nour model is that the emergence of asymmetry in the distribution of\nprice changes is linked to a trading practice employed in real\nfinancial markets called \\textit{profit taking}.\n\nThe majority of approaches used today to model financial markets fall\ninto one of two categories: statistical models adjusted with to fit\nthe history of past prices and the so called Dynamic Stochastic\nGeneral Equilibrium (DSGE) models. The first kind of models are\nable to produce reasonable representations and volatility forecasts of\nfinancial systems\\cite{Brownlees2011} as long as the statistical\nproperties of the prices with which they were calibrated do not change\nby a large margin. The second kind of models assume a \"representative\nagent'' for each of the participant sectors in the financial system,\nwith the goal of these representative agents being the maximization of\ntheir utility\\cite{Sbordone2010}. To avoid creating deterministic\ndynamics without periods of depression or growth, DSGE models use\nexogenous stochastic terms which are supposed to mimic the varying\nconditions of the market, such as sudden peaks in the demand of a\ncertain financial instrument or changes in the pricing of a commodity.\n\nDespite of the fact that these models are capable of providing some\nexplanations of the phenomena observed in financial markets, the\npremises over which they are built are crude approximations of\nreality\\cite{Farmer2009,DeGrauwe2010} and as a such they are not\nuseful to gain insight into statistical phenomena as rich at that\nobserved in the empirical analysis of financial time series.\\\\\n\nThis situation has given rise to the exploration of financial systems\nas \"complex systems\", \\cite{Bonabeau2002} considering financial markets as\nsomething closer to what they actually are: systems where great number\nof different components interact amongst each other in a way that\ngives rise spontaneously to the observed macroscopic statistical\nproperties.\n\nAmong the many types of models which consider the complexity of\nfinancial markets, there is a particular kind called Agent Based\nModels which employ a bottom-up approach and allow the modeler\nto trace back the emergence of the macroscopic statistical properties\nof the system as a consequence of the microscopic behavioral traits of\nits constituent agents\\cite{Tesfatsion2006}. Many models have been\ncreated that are capable of reproducing several stylized facts and\ngiving microscopic explanations of their origins. These models have\nbeen constructed, in general, in one of two ways: there are models in\nwhich the agents do not use a particular set of strategies and instead\nparticipate in the market in a random fashion, and models in which the\nagents follow different specific strategies inspired in actual\nstrategies used by participants of real markets. The first type of\nmodels usually make use of market trading structures similar to those\nused in real markets, such a double auction order books, and as a\nconsequence the price formation is directly driven by the offers (to\nbuy and sell) supplied by the agents\n\\cite{Preis2006,Farmer2005,Maslov2000,Challet2003,Thilo2012}, while\nthe latter type of models usually have prices adjusted in a stochastic\nmanner\\cite{Lux2000,Cont2007,Bertella2014,Alfi2009}.  Our aim in this\npaper is to present a model in which trading is mediated through an\norder book with agents employing realistic non-random strategies,\nwhich reproduces most of the main stylized facts observed in financial\ndata.\n\n\\subsection{Stylized facts}\nAmong the stylized facts reported in the literature, the most\nwidespread, which we study in this paper, are the following:\n\n\\textbf{Absence of auto-correlations}\n\nIt is a well known fact that auto-correlation function of the returns\n$R(t)$ is essentially zero for any value of the lag $\\tau$ (except at\nvery short time in which there is a negative correlation ``bounce''\n\\cite{Cont2001}) This characteristic has been used as support for the\nefficient market hypothesis \\cite{Bera2015} since, by having zero\ncorrelation, the changes in the sign of price changes are\nunpredictable.  As a consequence of this unpredictability there is it\nis not possible to incur in the practice of arbitrage. This has led\npeople to also name this stylized fact as \\textit{absence of\n  arbitrage}\\cite{Cristelli2014}.\n\n\\textbf{Volatility Clustering}\n\nThe absence of correlations presented by the returns has been used as\nevidence that supports a series of models in which, for example, it is\nassumed that the prices behave like random walks with independent and\nidentically distributed returns \\cite{Fama1970}. Nevertheless, in\naddition to the absence of auto-correlations in the raw returns\nseries, it has been observed that some non lineal functions of returns\ndo exhibit auto-correlations that remain positive for relatively long\ntimes. This behavior implies that the returns have a tendency to\n\"agglomerate\" in time in groups of similar magnitude but unpredictable\nsign. In the words of Benoit Mandelbrot, who was the first to report\nthis behavior: \"large changes tend to be followed by large changes, of\neither sign, and small changes tend to be followed by small changes\"\n\\cite{Mandelbrot1963}.\n \n\\textbf{Heavy tailed distribution of returns}\n\nEmpirical studies have shown that the distributions of price changes\ndo not have a normal distribution\n\\cite{Mandelbrot1963,Bouchaud2001,Plerou1999}, thus implying that\nprices do not evolve in time as a Brownian random walk. Studies of the\ncomplementary cumulative distribution, defined as:\n\n\\begin{displaymath}\nF(x) = 1 - Prob(X < x),\n\\end{displaymath}\n\nhave shown that it behaves approximately as a power law $F(x) \\sim\nx^{-\\beta}$ with an exponent $\\beta \\in [2,4]$\n\\cite{Cristelli2014,Bouchaud2001}. This means that it is more likely\nto observe large price fluctuations than it would be if the prices\nfollowed a Brownian random walk. One way to quantify how much a\ndistribution deviates from a normal distribution is to measure its\nexcess kurtosis $\\kappa$\\cite{DeCarlo1997}, which should have a value\nof $\\kappa=0$ for a normal distribution and a positive value for a\ndistribution with heavy tails. Measurements of this quantity have\nfound values of $\\kappa$ far from the normal regime; for instance, the\nkurtosis for the Standard \\& Poor's index measured over time intervals\nof 5 minutes has been reported to have a value of $\\kappa \\approx\n16$\\cite{Cont1997}.\n\n\\textbf{Asymmetry in the distribution of returns} \n\nIn addition to the heavy tailed returns distribution, it has also been\nobserved that in many markets, large negative returns are present but\nthere are not equally large positive returns. This characteristic is\nrelated to a negative skewness in the returns distribution, which has\nbeen reported in empirical studies\\cite{Cont2001}.\n\n\\textbf{Log-normal distribution of volatilities} \n\nThe probability distribution of the volatility of individual firm\nshares and of indexes, defined as the average of the absolute returns\nover a time window, is well approximated by a log-normal distribution\nin its central part, while its tail is well adjusted by a power law\nwith exponent $\\mu$ satisfying $ \\mu \\approx 3$\\cite{Yanhui1999}.\n\nIn the next section we present a detailed description of the agent\nbased model we propose: We begin by describing the double auction\norder book mechanism for buying and selling, followed by the trading\nrules employed by each type of agent: technical and fundamental. Our\ntechnical agents follow a ``Moving average oscilator'' strategy\n\\cite{Brock1992}, which is commonly used by real technical traders. These\ntraders also incur in profit taking if the price of the asset exceeds\na certain threshold. Heterogeneity among technical agents is achieved\nby assigning different strategy parameters (``personalities'') to\ndifferent subsets of the technical agent population. The fundamental\nagents in our model ``choose'' a fundamental price, and change it\naccording to the influx of news as well as distance to the positions\nof the rest of the agents in the market. The fundamental prices chosen\nby these agents, and their reaction to the incoming news, differ\nbetween each of the fundamental agents, as happens in real life.\n\nAfter describing the model, the paper continues with a section in\nwhich we present the results obtained in simulations of the model and\nwe focus on the stylized facts listed above, comparing the behavior of\nthe model with representative empirical data. We also study the effect\nof varying the relative populations of agents as well as the\nparameters that control the practice of profit taking by the technical\nagents in the system.\n\nWe end with a section of concluding remarks.\n\n\n\\section{Model}\n\\subsection{General Aspects}\nThe model represents a financial market in wich a single asset, whose\nprice is denoted by $P_{t}$ is traded through a double auction order\nbook by $N$ agents. A double auction order book is the collection of\nall the \\textit{orders}, with an order being an offer to sell (ask) or\nto buy (bid) some amount of an asset. The orders are separated in two\ntypes, there are market orders and limit orders \\cite{Harris2002}.\nMarket orders only specify the amount of units of the asset that its\nowner wants to buy or to sell (the volume), and the price at which\nthese orders are executed is the best available price in the order\nbook at that moment. The best prices in the book are called\n\\textit{best ask}, which corresponds to the order to sell at the\nlowest price, and the \\textit{best bid}, which corresponds to the\norder to buy at the highest price; the difference between the best ask\nand the best bid is called \\textit{spread}. Limit orders, on the other\nhand, do specify both a volume and a limit price which is the lowest\nor highest at which the owner of the order is willing to trade. If the\nowner of a limit order wishes to buy, then the limit price is the\nhighest price the owner is willing to pay to buy the required volume\nspecified in the order, similarly, if the owner of the order wishes to\nsell, the limit price is the lowest price the owner is willing to\naccept to sell the asset. When a limit order of a certain type, say a\nbuy order (respectively, a sell order) enters the book with a price\nwhich is higher (lower) than the best ask (bid) price, then a trade is\nexecuted. Figure \\ref{fig:OrderBookStructure} shows the basic\nstructure of an order book and Figure \\ref{fig:OrderBookDynamics}\nshows the process of storage or elimination of limit orders.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{Imagenes/TeoriaModelo/Ejemplo_OrderBook_ENG}\n\\caption{Structure of an order book. Limit orders are stored using a\n  price-time precedence rule: first they are stored in the level\n  corresponding to their price and then they are ordered by their time\n  of arrival. The difference between the price of the order to sell at\n  the lowest price (best ask) and the price of the order to buy at the\n  highest price (best bid) is called {\\it spread}.}\n\\label{fig:OrderBookStructure}\n\\end{figure}\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.85\\textwidth]{Imagenes/TeoriaModelo/Order_Book_Dynamics}\n\\caption{Dynamics of order storage and removal. When a new limit order\n  arrives to the book, if its price is such that it crosses the price\n  of the best order of the opposite type, a transaction occurs. If the\n  price does not cross the opposite best price, the order is stored at\n  its corresponding price level.}\n\\label{fig:OrderBookDynamics}\n\\end{figure}\n \n\nIn the model, the population of agents is divided into two different\nsub-populations, with each sub-population employing one of two\nbasic trading strategies: fundamental analysis or technical\nanalysis.  \n\nAgents employing fundamental analysis believe that on the long run,\nthe price of the asset $P_{t}$ will reach its \\textit{fundamental\n  price} $p_{f}$ which represents the estimation of the \"true\" value\nof the asset based on the information that each agent possesses. In\ngeneral, the fundamental prices of an asset are different for every\nfundamental agent. The strategy of a fundamental agent is then to try\nto take advantage of the deviations between asset's price $P_{t}$ and\nthe the agent's estimated fundamental price $p_{f}$, before the latter\nprice is reached. Agents employing technical analysis, on the other\nhand, try to identify and exploit trends in the price time series.\n\nThese two types of strategies are representative of the main\nstrategies used in real life trading and were first introduced in the\nLux-Marchesi (LM) model \\cite{Lux1999}. The effects of these\nstrategies on the dynamics of the price are opposed: while fundamental\nagents tend to stabilize the prices around the average value of their\nfundamental prices, technical agents tend to create periods of violent\nprice changes.  \n\nMost of the parameters controlling the behavior of each agent are\nassigned at the beginning of each simulation, and even if two agents\nbelong to the same group (fundamental or technical) the difference in\nthe values of their controlling parameters will generate different\n\"personalities\", in such a way that, for example, there can be agents\nwilling to pay more than other agents to obtain a unit of the asset,\nor other agents may wait longer before placing an order.\n\nWe make time run in discrete units corresponding to simulation steps\nand on each simulation step, each fundamental agent will engage in\ntrading with a probability $p_{active}$ while technical agents will be\nactive when they observe a favorable trend or when they can\nobtain a high immediate profit, as will be explained later.  \n\nIn our system, every agent is assigned unlimited credit, and short\nselling is allowed. These two liberties are meant to ensure that an\nagent is able to engage in trading whenever it becomes active, thus\nproviding the market with enough liquidity.\n\nAlthough the model we propose includes the main components of the\nLux-Marchesi model, there are important differences in the way in\nwhich we designed both the agents and the market environment. Of\ncentral importance is the fact that in our model the process of price\nformation is directly governed by the demand and supply provided by\nthe agents and all the transactions are mediated through a double\nauction order book; as well as the fact that by assigning different\nparameters, leading to different ``personalities'', we include\nheterogeneity within each type of trader. Further, in our model the\nonly source of ``exogenous'' randomness, are the entry times of the\nfundamental agents and the time of arrival and nature of the news in\nthe system. Other sources of randomness concern the reactions of the\nfundamental agents to the incoming news.\n \n\\subsection{Types of Agents}\n\n\\subsubsection{Technical Agents}\nAs mentioned before, technical agents employ ``technical analysis'' in\nan attempt to predict the future behavior of the price time series\nwith the purpose of exploiting the knowledge of that future behavior.\n\nIn our model, technical agents utilize a technique used in real life\ncalled Moving Average-Oscillator (MAO), which consists in a pair of\nmoving averages with different window size: a long period average\ncalled the \\textit{slow moving average}, and a short period average\naptly called the \\textit{fast moving average}. The fast moving average\nis intended to capture the tendency of the price movements in a short\nterm and the slow moving average has the purpose of capturing the long\nterm trend. Figure \\ref{fig:MAO} shows an example of this technical\nindicator.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=1.0\\textwidth]{Imagenes/TeoriaModelo/MAO}\n\\caption{Moving average-oscillator (MAO). This is a common technical\n  indicator which is formed by two moving averages of different window\n  sizes that are constantly observed. The moving average with the\n  largest window size is called \\textit{fast moving average} and the\n  one with the smallest window is called \\textit{slow moving\n    average}. When the fast moving average crosses the slow one from\n  below, a signal to buy is generated; conversely, when the fast\n  moving average crosses the slow from above, a signal to sell is\n  generated.}\n\\label{fig:MAO}\n\\end{figure}\n\nWhen the fast average crosses the slow one from above, the MAO strategy\nsuggests that this is a ``signal to sell'', since the prices show a\nshort term tendency to fall below the long term trend captured by the\nslow moving average.  Similarly, a ``signal to buy'' occurs when the\nfast moving average crosses the slow one from below, since this can be\ninterpreted as the prices having a short time tendency to rise above\nthe long term trend.\n\nWe employ the MAO indicator in our model because it is very simple and\neasy to implement, it is representative of the pletora of technical\nanalysis tools and it is widely used in real life\\cite{LeBaron1992}.\n\nIn our model, we use a variety of MAO indicators that differ by the\nwindow sizes of the two averages which compose them. For each of these\nindicators there is a population of technical agents following its\nevolution over time and engaging in trading as a result of the signals\nthat the indicator generates. Further, when an indicator generates a\nsignal (either a buy o sell signal) each technical agent following it\nchooses a particular waiting time $t_{wait}$ before entering an order\nto the order book as suggested by the signal: if the indicator\ngenerated a buy signal, the agent will enter a buy market order,\notherwise it will enter a sell market order. This waiting time between\nthe moment in which the signal is generated and the moment in which an\nagent enters its order is meant to allow the price time series to move\nin the direction predicted by the indicator. If the agents were to\nimmediately enter their orders after they received a signal, they\nwould not take advantage of the rise or fall in prices that the trends\npoint to. The waiting time $t_{wait}$ of each technical agent is drawn\nfrom a uniform distribution in the interval $[0,t_{max}]$, and\nassigned to each agent from the beginning of the simulation.\n\nA consequence of the way in which the MAO indicator is constructed, is\nthat the technical agents should have perfectly alternating order\nflows, with a sell order following a previously entered buy order and\nvice-versa. This alternation arises from the fact that the MAO\nindicator generates signals when the two moving averages cross each\nother and for any of the two directions of crossing: the fast average\ncrossing the slow one from below or from above, the next direction\nwill be necessarily of the opposite kind.\n\nThere is, however, another mechanism which compels a technical agent\nto engage in trading, aside from following the technical indicator.\nThis mechanism is called \\textit{profit taking} and it basically\nconsists in selling the asset he owns when the price is sufficiently\nhigh with respect to the price at which the last unit was bought,\nirrespective of whether the MAO indicator generates a sell signal or\nnot, thus providing the agent with an immediate profit.  This is\nimplemented as follows, when a technical agent enters an order to the\nbook while following the indicator, that agent registers the price at\nwhich the order was executed in a variable called $P_{signal}$. If the\nprice of the asset $P_{t}$ deviates from $P_{signal}$ by more than a\nfactor $\\gamma$, the agent will proceed to enter a new sell order;\ni.e. if after following a buy signal and entering the corresponding\nbuy order to the order book the price of the asset is greater than\n$(1+\\gamma)P_{signal}$, then the agent will place a sell market order,\nsecuring in this way an immediate profit. Figure\n\\ref{fig:ProfitTaking} shows how profit taking is carried out in our\nmodel.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.8\\textwidth]{Imagenes/TeoriaModelo/Profit_Taking}\n\\caption{Profit taking mechanism: If after observing a signal to buy,\n  the prices rise enough (in our case this is defined as the moment at\n  which $\\left| 1-\\frac{P_{t}}{P_{signal}} \\right|$ exceeds a\n  parameter $\\gamma$), the technical agent will proceed to enter a\n  sell market order. This practice is commonly used by traders to\n  insure an immediate profit.}\n\\label{fig:ProfitTaking}\n\\end{figure}\n\nThe profit taking mechanism is introduced in our model because it is a\ncommon practice in real financial markets and, as we will see, it\nturns out to have a strong effect on returns statistics.\n\n\\subsubsection{Fundamental Agents}\nA fundamental analysis strategy is based on two basic premises: the\nfirst one being that every asset has an intrinsic ``fundamental\nprice'' $p_{f}$ which corresponds to the asset's \"true value\", and the second\none that in the short run, this fundamental price may be incorrectly\nestimated by the market participants but that in the long run, the\nmarket will correctly value the asset and its price will eventually\nreach the fundamental price $p_{f}$. An agent following a strategy of\nthis kind will therefore buy an asset when the price at which it is\nbeing traded is below his estimation of its fundamental price $p_{f}$\nand will sell the asset when its price is above $p_{f}$. In this way a\nperson following a fundamental strategy will take advantage of the\ndifferences between the prices at which the asset is traded over time\nand the fundamental price; until the asset finally reaches its\nfundamental price.\n\nEach fundamental agent in our model has an individually assigned\nfundamental price, reflecting the differences in the estimation of the\nasset's value. Their strategy then is basically to buy a unit of the\nasset when there are other agents willing to sell for a lower price\nthan his estimated $p_{f}$ and to sell a unit when there are agents\nwilling to buy at a higher price than his $p_{f}$. By doing this, a\nfundamental agent will buy the asset at lower prices and sell it at\nhigher prices than its fundamental price, expecting in principle, to\nobtain profits when the price of the asset on the market $P_{t}$\nreaches $p_{f}$.\n\nWhen a fundamental agent becomes active, there are three available\nactions that this agent can engage in : either to buy a unit of the\nasset, to sell it (even short sell) or to abstain from either.  The\ndecision of whether to buy, sell or abstain from participating will\ndepend on the position of the agent's fundamental price $p_{f}$\nrelative to the price of the nearest best order (best ask or best\nbid).\n\nIf $p_{f} > B_{sell}$, where $B_{sell}$ the price of the best ask, the\nagent will proceed to buy since there are agents willing to sell for a\nlower price than that which the agent considers to be the correct\nprice. Similarly if $p_{f} < B_{buy}$, where $B_{buy}$ is the price of\nthe best buy, the agent will proceed to sell since there are agents\nwilling to buy offering more than the correct price.  If neither of\nthese two conditions is fulfilled, i.e. if $B_{sell} > p_{f} >\nB_{buy}$ then there will be no competitive offers, since the lowest\nprice at which the agent could buy a unit of the asset is higher than\n$p_{f}$, and the highest price at which it could sell a unit is\nlower than $p_{f}$. Thus, when this condition arises the agent will\nabstain from participating in the market.\n\nWhen an agent decides to buy or sell, the decision to do it by\nentering a limit o a market order will depend on the distance between\n$p_{f}$ and the price of the nearest best order. Specifically, if the\nagent decides to buy, it will do so by emitting a market buy order\nwhen its fundamental price is above the price of the best sell offer\nby more than a certain threshold $\\chi_{market}$, i.e. when $p_{f} >\nB_{sell}(1 + \\chi_{market})$, and it will emit a limit buy order when\n$p_{f}$ is below this threshold. Similarly, when the agent decides to\nsell, it will do so by emitting a market sell order if its $p_{f}$ is\nbelow the best buy offer by more than the threshold $\\chi_{market}$,\ni.e. when $p_{f} < B_{sell}(1 - \\chi_{market})$, otherwise it will\nemit a limit sell order.  Just like every other parameter defining the\nbehavior of a fundamental agents, every agent is assigned an\nindividual threshold $\\chi_{market}$ from the beginning. The figure\n\\ref{fig:FundsOrderSelection} shows this decision making algorithm.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.8\\textwidth]{Imagenes/TeoriaModelo/Order_Type_Selection_Funds}\n\\caption{Order selection algorithm for fundamental agents. In (a) we\n  show the conditions that lead to a fundamental agent to introduce a\n  market order: if the fundamental price $p_{f}$ is higher by more\n  than a threshold $\\chi_{market}$ (specific to each trader) with\n  respect to the price of the nearest best order, the agent will\n  proceed to enter a market order. Otherwise, the agent will proceed\n  to enter a limit order (b). In the figure the orders would be\n  ``buy'' oreders as the agent's fundamental price lies above the best\n  ask.}\n\\label{fig:FundsOrderSelection}\n\\end{figure}\n\nOn the occasions in which a fundamental agent decides to enter a limit\norder, the actual price of the order is extracted from a shifted symmetric\nexponential distribution of the form:\n\\begin{displaymath}\n      f(x;\\lambda_{limit},\\mu_{spread}) = \\lambda_{limit}{}e^{- \\left| \\lambda_{limit}(x-\\mu_{spread}) \\right|}\n\\end{displaymath}\nwhere $\\mu_{spread}$ is the average price of the best orders:\n$\\mu_{spread} = \\frac{1}{2}(B_{sell} + B_{buy})$. By assigning the\nprices of limit orders in this way, they will have a greater tendency\nto cluster around $\\mu_{spread}$ which is a representative measure of\nthe central price at which the market participants are valuing the\nasset. This behavior is intended to reflect the situation in which the\nprices are not good enough to enter a market order, so the fundamental\nagents will proceed to bargain with limit orders at prices that will\nbe close to the central price in the market.\n\nIn real life, a great deal of the information about the financial\nhealth of a company used by agents following a fundamental strategy is\ntaken from financial statements and other sources of information\nconcerning the well being of said company. To include this feature of\nfundamental analysis in our model, we introduce a flow of news modeled\nas a sequence of IID random variables $\\zeta_{t}$ taken from a normal\ndistribution with mean $\\mu_{news}$ and variance $\\sigma_{news}$, and\nthe time intervals betwen succesive news taken from a Poisson\ndistribution. Here, $\\zeta_{t}$ represents the mean value by which the\nnews will change the fundamental prices of the asset, with the\nmagnitude and sign of $\\zeta_{t}$ corresponding directly to the nature\nof the news: a negative signal representing the notification of ``bad\nnews'' and a positive one the notification of ``good news''. When, in\nthe context of our model, news are issued at a given time $t$, every\nfundamental agent re-adjusts its fundamental price from $p_f(t)$ to\n$p_{f}(t) + \\Delta{}p_{f}(t)$ where $\\Delta{}p_{f}(t)$ is again\nextracted from a normal distribution with zero mean and variance\n$\\sigma_{\\Delta{}p_{f}}$ as illustrated in Figure\n\\ref{fig:NewsEfectsFunds}. By changing their prices in this way, the\nmajority of fundamental agents will change their prices accordingly\nwith the sign of $\\zeta_{t}$, however, depending on the magnitude of\nthe news, some agents may even extract a $\\Delta{}p_{f}$ with an\nopposite sign to $\\zeta_{t}$. This diversity of response to a news\nitem attempts to reflect the possibilty of diverse interpretations of\nthe information by the fundamental agents, even to the degree of\nchoosing a change of fundamental price with the opposite sign of the\nnews received. Of course, the probability of this diminishes\ndrastically as the magnitud of the news $\\zeta_{t}$ becomes larger.\nThe fundamental price of each agent is chosen from a uniform\ndistribution at the beginning of a simulation.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.4\\textwidth]{Imagenes/TeoriaModelo/News_Effects}\n\\caption{News and their effects on fundamental prices. We model news\n  as a sequence of IID Gaussian random variables. When a realization\n  of this sequence, representing news being issued, occurs, the\n  fundamental prices of each agent are adjusted from $p_{f}$ to $p_{f}\n  + \\Delta_{p_{f}}$ with $\\Delta_{p_{f}}$ extracted from another\n  normal distribution whose mean is equal to the value of the current\n  news. In this way when highly positive news arrive, the majority of\n  fundamental price changes will be positive; conversely, when highly\n  negative news arrive, most price changes will also be negative.}\n\\label{fig:NewsEfectsFunds}\n\\end{figure}\n\nFinally, although a fundamental agent bases its trading strategy in\nthe differences between its fundamental price and the prices at which\nthe market values the asset, if too large a difference is present, the\nagent will try to get closer to the central market price\n$\\mu_{spread}$. This feature is meant to capture the attention that a\nfundamental agent pays to the opinions of the whole population of\nagents, which constitutes a mild manner of ``herding behavior''. If\nthe valuation of the fundamental price that an agent has is too far\nfrom the price at which it is being traded, the agent will move its\nfundamental price closer to the central price $\\mu_{spread}$. This can\nbe interpreted as a precautionary move by the agent since such a big\ndifference between $p_{f}$ and $\\mu_{spread}$ could point to\ninformation that was not incorporated in the determination of his\nfundamental price, or that an ineffective incorporation of the\navailable information was made.\n\nTo determine when the difference between $p_{f}$ and $\\mu_{spread}$ is\n``too big'', each agent compares this difference with a threshold\n$\\chi_{opinion}$, if at the time a fundamental agent becomes active,\nsuch agent observes that\n\n\n", "index": 1, "text": "\\begin{equation*}\n\t\\chi_{opinion} < \\left| 1 - \\frac{p_{f}}{\\mu_{s_{spread}}} \\right| \n\\end{equation*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\chi_{opinion}&lt;\\left|1-\\frac{p_{f}}{\\mu_{s_{spread}}}\\right|\" display=\"block\"><mrow><msub><mi>χ</mi><mrow><mi>o</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>&lt;</mo><mrow><mo>|</mo><mrow><mn>1</mn><mo>-</mo><mfrac><msub><mi>p</mi><mi>f</mi></msub><msub><mi>μ</mi><msub><mi>s</mi><mrow><mi>s</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub></msub></mfrac></mrow><mo>|</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00229.tex", "nexttext": "\n\nBy doing this, the agent will get as close to $\\mu_{spread}$ as the\nmaximum tolerance ($\\chi_{opinion}$) between its opinion and the\nopinion of the population ($\\mu_{spread}$) allows.\n\n\\section{Results}\n\nIn this section we present the results obtained in various\nsimulations. Although these results correspond to a particular set of\nvalues for the parameters, reasonable changes in the values of these\nparameters generate the same qualitative properties in the statistics\nof the model.\n\nIt is of critical importance for the stability of the system to have a\nflow of limit orders (liquidity) capable of filling the gaps that are\ncreated when market orders enter the order book. To achieve this, the\nparameters that govern the flow of limit and market orders emitted by\nthe agents must not give rise to bursts of market orders with a volume\nso big that one side of the order book is emptied. It is in this sense\nthat we speak above of reasonable changes in the values of the\nparameters. Thus, for example, if we were to allow greater volumes of\nmarket orders to be placed within shorter time windows, say, by\nincluding a larger number of technical agents in a simulation, then,\nthe parameters that affect the input of limit orders must be changed\naccordingly, in such a way that the fundamental agents have enough\ntime to restore the liquidity consumed by the increased number of\nmarket orders.\n\nThe following results were obtained with a population of 1000\nfundamental agents and 1500 technical agents divided into two groups\nof 750 agents with technical indicators made of moving averages with\nwindow sizes of 4000 and 2000 time steps for one group and 2000 and\n1000 time steps for the other. The other parameter values used for\nthis run are shown in Table \\ref{tab:paramValues_1}.\n\n\\begin{table}[!htbp]\n\\centering\n\t\\begin{tabular}{ccc}\n\t\t\\hline\n\t\t\\cline{1-2}\n\t\t Parameter & Value \\\\\n\t\t \\hline\n\t     $P_{active}$ &  0.15\\\\\n         $p_{f}$ & [20.0, 25.0]\\\\\n         $\\chi_{market}$ & [0.005, 0.25]\\\\\n\t     $\\chi_{opinion}$ & [0.01, 0.1]\\\\\n         $\\sigma_{\\Delta_{p_{f}}}$ & 0.2\\\\\n\t\t $\\lambda_{limit}$ & 3\\\\\n         $\\mu_{news}$ & 0\\\\\t\n         $\\sigma_{news}$ & 0.1\\\\\t\n         $f_{news}$ & 100\\\\\t\n         $\\gamma$ & 0.01\\\\\t\n         $t_{wait}$ & [0, 50]\\\\\t\n\t\t\\hline\n\t\\end{tabular}\n    \\caption{Values of the parameters corresponding to the presented results.}\n    \\label{tab:paramValues_1}\n\\end{table}\n\nTime series corresponding to the prices and logarithmic returns are\nshown in figures \\ref{fig:PriceTimeSeries_FullModel} and\n\\ref{fig:ReturnsTimeSeries_FullModel} respectively, where we have defined the logarithmic returns as \n\n\\begin{displaymath}\n r(t) = \\log(P_t/P_{t-\\tau})\n\\end{displaymath}\n\nfor some lag $\\tau$. The blue bars in\nfigure \\ref{fig:ReturnsTimeSeries_FullModel} signal the time steps in\nwhich technical agents were active. The bursts of greater volatility\ncoincide with the activity of the technical agents while the times in\nwhich only fundamental agents were active (trading) present lower\nvolatility.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{Imagenes/ResultadosModeloCompleto/PriceSeries}\n\\caption{Representative time series of asset prices, determined as the\n  last price the asset at each time step (``closing price''). The data\n  was obtained from a full implementation of our model.}\n\\label{fig:PriceTimeSeries_FullModel}\n\\end{figure}\n\n\n\\begin{figure}[!htbp]\n    \\centering\n    \n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/ReturnsSeries}\n        \\caption{Returns corresponding to the simulation.}\n        \\label{fig:ReturnsTimeSeries_FullModel}\n    \\end{subfigure}\n\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/DatosEmpiricos/Returns_Clustering}\n        \\caption{Returns from Consol Energy Inc. Data obtained from QuantQuote\\cite{QuantQuote}.}\n        \\label{fig:ReturnsTimeSeries_Real}\n    \\end{subfigure}\n    \n    \n    \\caption{Returns time series for the simulation (a) and comparison\n      with empirical data from Consol Energy Inc (b). The blue shaded\n      regions show the times in which technical agents were active, as\n      can be seen, these times coincide with the periods with the\n      largest changes of price.}\\label{fig:VolatiulityClusterings}\n\\end{figure}\n\nIn figure \\ref{fig:RawReturnsACF_FullModel} we show the\nauto-correlation function of the returns, the blue line corresponds to\nthe returns calculated time step by time step. In the inset we show\nthe auto-correlation function for returns calculated every 50 steps,\nin both cases it can be seen that the auto-correlations is essentially\nzero for any value of the lag. It is interesting to note that the\nphenomenon know as ``bid-ask bounce'' can be observed in the returns\ngenerated by our simulations. This phenomenon consists in the presence\nof negative values of the auto-correlation function at very short lags\nand it is attributed to the fact that most transactions take place\nnear the best ask or best bid and tend to bounce between these two\nvalues\\cite{Cont2001}. Since in our model the fundamental agents\nintroduce their limit orders close to these two values, it is\nnatural that we observe such negative auto-correlations.\n\nIn figure \\ref{fig:VolatilityClusteringACF_FullModel} we present the\ncomparison between the auto-correlation of the returns (blue line) and\nthe auto-correlation of the absolute value of the returns (red\nline). Here we observe that the auto-correlation function of the\nabsolute returns remains positive over several a long time interval,\nand that it decays slowly to zero. Figure\n\\ref{fig:AutocorrFuncts_Real} illustrates the same auto-correlation\nfunctions for a representative company listed in the Standard \\& Poor's 500.\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{Imagenes/ResultadosModeloCompleto/AbsenceAutoCorrelation}\n\\caption{Auto-correlation functions of returns. There are essentially\n  no correlations for any value of the lag, except for a negative\n  correlation that lasts for a few steps at the beginning. This\n  phenomenon is also observed in real returns series and has been\n  called \\textit{bid-ask bounce}\\cite{Cont2001}. The reason behind this negative\n  correlation is the fact that most transactions occur near the best\n  ask or the best bid, and as such, the prices tend to \"bounce\"\n  between these two values. The main figure corresponds to the\n  autocorrelation function of the returns calculated every time step\n  and the inset figure to the returns calculated every 200 steps.}\n\\label{fig:RawReturnsACF_FullModel}\n\\end{figure}\n\n\\begin{figure}[!htbp]\n    \\centering\n    \n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/VolatilityClusteringACF}\n        \\caption{Direct (blue) and absolute (red) auto-correlation\n          functions of returns from our the simulation.}\n        \\label{fig:VolatilityClusteringACF_FullModel}\n    \\end{subfigure}\n\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/DatosEmpiricos/Returns_CorrelationsDecay}\n        \\caption{Corresponding auto-correlation functions from Airgas\n          Inc. Data obtained from QuantQuote\\cite{QuantQuote}.}\n        \\label{fig:AutocorrFuncts_Real}\n    \\end{subfigure}\n    \n    \n    \\caption{Returns auto-correlation function for the simulation (a)\n      and comparison with empirical data from Airgas Inc (b). While\n      the auto-correlation of the direct returns (blue lines) is zero, the\n      auto-correlation of the absolute value of the returns (red lines)\n      remains positive for a long period of time, and decays slowly to\n      zero.}\\label{fig:AutoCorrFuncts}\n\\end{figure}\n\nFigure \\ref{fig:ReturnsPDF_FullModel} shows the distribution function\nof returns in our model. This distribution shows heavier tails than a\nnormal distribution with the same mean and standard deviation and it\nis possible to observe that the left tail is heavier than the right\none. The distribution presents a kurtosis of $3.6$ and a skewness of\n$-0.16$ which is of the order of the mean skewness for the companies\ncomprising the Standard \\& Poor's 500 index since 1998 which we\nmeasured at $-0.33$ from data made publicly available by\nQuantQuote. For comparison, figure \\ref{fig:ReturnsPDF_Real} illustrates the\ndistribution function of returns for a representative company listed\nin the Standard \\& Poor's 500.\n\n\nFigure \\ref{fig:ReturnsCDF_FullModel} shows the cumulative\ncomplementary distribution of positive and negative returns,\nhighlighting the asymmetry between losses and gains. The tail of the\ndistribution of negative price changes is significantly heavier than\nthe distribution of positive changes a fact that is consistent with\nthe negative skewness displayed by the returns distribution.  Figure\n\\ref{fig:ReturnsCDF_Real} illustrates the corresponding distributions\nfor a representative company listed in the Standard \\& Poor's 500.\n\n\\begin{figure}[!htbp]\n    \\centering\n    ~ \n      \n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/ReturnsPDF}\n        \\caption{Returns PDF corresponding from the simulation.}\n        \\label{fig:ReturnsPDF_FullModel}\n    \\end{subfigure}\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/DatosEmpiricos/Returns_PDF}\n        \\caption{Returns PDF from United States Steel Corporation. Data obtained\n          from QuantQuote\\cite{QuantQuote}.}\n        \\label{fig:ReturnsPDF_Real}\n    \\end{subfigure}\n    \\caption{Returns PDF from the simulation (a) and comparison with\n      empirical data from  United States Steel Corporation, Inc. The tails of the\n      distribution (red line) are clearly heavier than those of a\n      normal distribution (blue line). }\\label{fig:ReturnsPDFs}\n\\end{figure}\n\n\n\\begin{figure}[!htbp]\n    \\centering\n    ~ \n      \n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/ReturnsCDFAssymetry}\n        \\caption{Returns CDF corresponding to the simulation.}\n        \\label{fig:ReturnsCDF_FullModel}\n    \\end{subfigure}\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/DatosEmpiricos/Returns_CCDF}\n        \\caption{Returns CDF from Anadarko Petroleum Corp. Data\n          obtained from QuantQuote\\cite{QuantQuote}.}\n        \\label{fig:ReturnsCDF_Real}\n    \\end{subfigure}\n    \\caption{Comparison of the positive and negative returns CDF from\n      the simulation (a) and from empirical data for Anadarko\n      Petroleum Corp (b). It can be seen that the left tail of the\n      distribution (red line), corresponding to the negative returns,\n      is heavier than the right tail (blue line), corresponding to the\n      positive returns. This is related to the negative skewness\n      observed in the distribution.}\n    \\label{fig:CCDFs}\n\\end{figure}\n\nIn figure \\ref{fig:VolatilitiesPDF_FullModel} we present the\ndistribution of volatilities measured as the average of the absolute\nvalue of returns $|r(t)|$ over a time window $T=n\\Delta{}t$, i.e.\n\\begin{displaymath}\n\tV_{T}(t) = \\frac{1}{n}\\sum\\limits_{t^{'}=t}^{t+n-1} \\left| r(t^{'}) \\right|\n\\end{displaymath}\nFor the present result we took values of $n=30$ and $\\Delta{}t=1$ time\nsteps. The distribution of volatilities is not well described by a\nlog-normal distribution, however, the central part of the distribution\nmay be approximated by one\\cite{Yanhui1999}. On the other hand, when we remove the\ntechnical agents from the simulation, the volatilities are remarkably\nwell described by a log-normal distribution as shown in Figure\n\\ref{fig:VolatilitiesPDF_IncompleteModel}, which corresponds to a run\nwith the same parameter values described in Table\n\\ref{tab:paramValues_1} without technical agents.\\\\  \n\n \\begin{figure}[!htbp]\n     \\centering\n     ~ \n       \n     \\begin{subfigure}[b]{0.7\\textwidth}\n         \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/VolatilitiesPDF}\n         \\caption{Volatilities PDF. It can be seen that, although the\n           distribution of returns is not well described by a\n           log-normal distribution: while the central region is\n           qualitatively similar to one, the right tail is considerably\n           heavier.}\n         \\label{fig:VolatilitiesPDF_FullModel}\n     \\end{subfigure}\n \n \n \n     \\begin{subfigure}[b]{0.7\\textwidth}\n         \\includegraphics[width=\\textwidth]{Imagenes/DatosEmpiricos/Volatilities_PDF}\n         \\caption{Volatility distribution of Exelon Corp. Data obtained\n           from QuantQuote\\cite{QuantQuote}.}\n         \\label{fig:VolatilitiesPDF_Real}\n     \\end{subfigure}\n     \\caption{Distribution of volatilities for a simulation with both\n       fundamental agents and technical agents (a) and comparison with\n       empirical data from the Standard \\& Poor's 500 (b). Data\n       obtained from Yahoo Finance.}\\label{fig:LogNormals}\n \\end{figure}\n \n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{Imagenes/ResultadosModeloIncompleto/VolatilitiesPDF_SinTecnicos}\n\\caption{Volatilities of a simulation without technical\nagents. When only fundamental agents are used in a\nsimulation, a log-normal distribution is a remarkably good\ndescription of the distribution of volatilities.}\n\\label{fig:VolatilitiesPDF_IncompleteModel}\n\\end{figure}\n\nThis similarity in the central part of the volatility distributions in\nthe scenarios with and without technical agents, along with a similar\nresult obtained by Schmitt et al\\cite{Thilo2012} with their model in which the\nagents place orders with exponentially distributed volumes, is of\ninterest since the flows of orders are very different in both cases\n(see figures \\ref{fig:OrdersFlow_Fundamentals} and\n\\ref{fig:OrdersFlow_Fundamentals}), yet, the majority of the\nvolatilities can be described by log-normal distributions. This\nresult may suggest that the order book mitigates in some sense, the\nvariations in the shape of the incoming order \"signal\", in such a way\nthat the variations in price (the volatilities) are not strongly\naffected by changes in the distribution of orders placed into the\nbook.\n\n\\begin{figure}[!htbp]\n    \\centering\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloIncompleto/Fundamentals_MarketOrders_Flow}\n        \\caption{Trading volumes for a simulation without technical\n          agents. The volume forms a steady flow with little\n          deviations from the mean volume.}\n        \\label{fig:OrdersFlow_Fundamentals}\n    \\end{subfigure}\n\n    \\begin{subfigure}[b]{0.7\\textwidth}\n        \\includegraphics[width=\\textwidth]{Imagenes/ResultadosModeloCompleto/MarketOrdersFlow}\n        \\caption{Trading volumes for a simulation with technical\n          agents. There are big fluctuations in volume, rising above\n          the \"base line\" created by the fundamental agents. These\n          fluctuations are a consequence of the activity of technical\n          agents.}\n        \\label{fig:OrdersFlow}\n    \\end{subfigure}\n    \\caption{Representative trading volumes for runs of the model\n      without technical agents (a) and with technical agents (b). As\n      can be seen, there are large fluctuations of the volume over\n      time when technical agents are included in a simulation. The\n      insets in each figure show the distribution of\n      flows.}\\label{fig:OrderFlows}\n    \n\\end{figure}\n\nIn Figure \\ref{fig:Asymmetry_Ensemble} we plot the values of the\naverage skewness of an ensemble of 50 simulations (for every point in\nthe plot) as a function of the parameter $\\gamma$. We analyze the\nbehavior of the skewness as a function of $\\gamma$ because, as\nexplained before, this parameter controls the minimum amount that a\ntechnical agent requires the price to rise above the price at which it\nbought the last unit of the asset before selling. That is, it controls\nhow often the population of technical agents will engage in profit\ntaking. This is relevant because in the framework of our model, we\npropose this behavior as the cause of the negative asymmetry between\nlosses and gains in the distribution of returns. This is because by\nengaging in profit taking, the population of technical agents creates\nlarge falls in the price of the asset and as a consequence it is more\nlikely to observe large negative returns than large positive returns,\nwhich will in turn make the return distribution negatively skewed.\n\n\\begin{figure}[!htbp]\n\n\\centering\n\\includegraphics[width=0.7\\textwidth]{Imagenes/Colectividades/Plot_Asymmetry}\n\\caption{Mean skewness of the distributions of returns as a function\n  of the profit taking threshold. As the profit taking threshold\n  parameter $\\gamma$ becomes smaller, thus allowing the technical\n  agents to engage incur in this practice more often, the mean\n  skewness of the distributions of returns becomes more negative. This\n  behavior points to a relation between the practice of profit taking\n  and the loss-gain asymmetry stylized fact.}\n\\label{fig:Asymmetry_Ensemble}\n\\end{figure}\n\n\\begin{figure}[!htbp]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{Imagenes/Colectividades/Plot_Kurtosis}\n\\caption{Mean kurtosis of the distributions of returns as a function\n  of the technical to fundamental agents ratio. As the proportion of\n  technical agents increases, so increases the mean kurtosis in the\n  ensemble of simulations. This result suggests that the the presence\n  of technical agents in the population is related to the stylized\n  facts involving deviations from normality.}\n\\label{fig:Kurtosis_Ensemble}\n\\end{figure}\n\nSimilarly, in Figure \\ref{fig:Kurtosis_Ensemble} we plot the average\nkurtosis of an ensemble of 50 simulations as a function of the\nfraction of technical agents in the population. The kurtosis shows a\nmonotonic increase with the number of technical agents, which strongly\nsuggests that they are responsible for the deviations from normal\nbehavior observed in the distribution of returns.\n\n\\clearpage\n\n\\section{Conclusions}\n\nIn this work we studied an agent based model of a single asset\nfinancial market which is capable of replicating several stylized\nfacts previously reported on the literature. As in the LM model\\cite{Lux1999},\nwe divided the population of agents into two groups according to the\ntype of trading strategy they use: fundamental agents and technical\nagents. Our aim was to create a model whose agents behaved as\nrealistically as in the LM model but with equally realistic market\nstructures such as the inclusion of trading via a limit order book and\nheterogeneity in the values of the parameters that control the\nagents. We find, in accordance with previous models, that when the\npopulation of agents include technical agents, the returns present\nvolatility clustering and a heavy tailed distribution. Further, we\nfound that essentially no autocorrelation of the returns was present\nfor any configuration of the populations. In addition to these main\nstylized facts, we find that when we allow the population of technical\nagents to incur in the practice of profit taking, the distribution of\nreturns displays negative skewness and an asymmetry between losses\nand gains appears. By varying the frequency with which\ntechnical agents incur in profit taking, we can generate return\ndistributions with varying degrees of separation in the tails. This\ndependence of the skewness over the frequency of profit taking\nsuggests that this practice may be one of the causes of the appearance\nof the asymmetry in real financial markets.\n\nRegarding the distribution of volatilities we find that only its\ncentral part is qualitatively similar to a lognormal distribution when\ntechnical agents are included in the population. If, on the other\nhand, we only include fundamental agents, the volatilities are\nremarkably well described by a lognormal distribution. The similarity\nof the volatility distributions in both scenarios, at least in the\ncentral part, suggests that its shape may not be strongly dependent on\nthe detailed properties of the flow of incoming orders, since this\nflow varies significantly when technical agents are inserted in the\npopulation as compared with a population comprised entirely of\nfundamental agents.\n\nWe accompany our results with empirical data from real financial\nseries chosen illustrate the various stylized facts reproduced by our\nmodel.\n\\ack\nR.M. acknowledges financial support from CONACyT. We thank\nStephanie Rend\\'on, Ana Contreras and Paulino Monroy for useful discussions.\n\n\\clearpage\n\\section*{References}\n\\bibliographystyle{unsrt}\n\\bibliography{References}\n\n", "itemtype": "equation", "pos": 32564, "prevtext": "\n\nThen the agent will adjust its price to get closer to $\\mu_{spread}$ in the following way:\n", "index": 3, "text": "\n\\[ p_f = \\left\\{\n\\begin{array}{ll}\n    \\mu_{spread}\\left(1+\\chi_{opinion } \\right),  & if  \\,\\, p_{f} \\geq\\mu_{spread} \\\\\n     \\mu_{spread}(1-\\chi_{opinion}), & if  \\,\\ p_{f} < \\mu_{spread}\n\\end{array} \n\\right. \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"p_{f}=\\left\\{\\begin{array}[]{ll}\\mu_{spread}\\left(1+\\chi_{opinion}\\right),&amp;if%&#10;\\,\\,p_{f}\\geq\\mu_{spread}\\\\&#10;\\mu_{spread}(1-\\chi_{opinion}),&amp;if\\,\\ p_{f}&lt;\\mu_{spread}\\end{array}\\right.\" display=\"block\"><mrow><msub><mi>p</mi><mi>f</mi></msub><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>μ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi>χ</mi><mrow><mi>o</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mo>)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>i</mi><mo>⁢</mo><mpadded width=\"+3.4pt\"><mi>f</mi></mpadded><mo>⁢</mo><msub><mi>p</mi><mi>f</mi></msub></mrow><mo>≥</mo><msub><mi>μ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msub><mi>μ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>χ</mi><mrow><mi>o</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mi>i</mi><mo>⁢</mo><mpadded width=\"+6.7pt\"><mi>f</mi></mpadded><mo>⁢</mo><msub><mi>p</mi><mi>f</mi></msub></mrow><mo>&lt;</mo><msub><mi>μ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>p</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi></mrow></msub></mrow></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}]