[{"file": "1601.05402.tex", "nexttext": "\nWe show this SHM in Figure~\\ref{f_galactic} as a black solid line, and is the same in all panels. The black dotted lines show the best fit Maxwellian to each simulation (using $v_0$ and $v_{esc}$ from Table 1). \n\nIn Figure~\\ref{f_galactic}, we also show (green solid line) the empirical velocity distribution from \\citet{Mao2013I}:\n", "itemtype": "equation", "pos": 18268, "prevtext": "\n\n\\title{Assessing Astrophysical Uncertainties in Direct Detection with Galaxy Simulations}\n\\author{Jonathan D. Sloane,\\altaffilmark{1} Matthew R. Buckley,\\altaffilmark{1} Alyson M. Brooks,\\altaffilmark{1} and Fabio Governato\\altaffilmark{2}}\n\\affiliation{$^1$Department of Physics and Astronomy, Rutgers University, Piscataway, NJ 08854, USA}\n\\affiliation{$^2$Astronomy Department, University of Washington, Box 351580, Seattle, WA 98195-1580}\n\n\\begin{abstract}\n    We study the local dark matter velocity distribution in four simulated Milky Way-mass galaxies, generated at high resolution with both dark matter and baryons. We find that the dark matter in the Solar neighborhood is influenced appreciably by the inclusion of baryons, increasing the speed of dark matter particles compared to dark matter-only simulations. The baryonic effects responsible for the transfer of energy to the dark matter component increase the amount of high velocity dark matter, resulting in velocity distributions which are more similar to the Maxwellian Standard Halo Model than predicted from dark matter-only simulations. Further, the velocity structures present in baryonic simulations possess a greater diversity than expected from dark matter-only simulation. We show the impact on the direct detection experiments LUX, DAMA/Libra, and CoGent using our simulated velocity distributions. Our results indicate that the Standard Halo Model overpredicts the amount of dark matter in the high velocity tail, and thus leads to overly optimistic direct detection bounds on models which are dependent on this region of phase space for an experimental signal. Our work further demonstrates that it is critical to transform simulated velocity distributions to the lab frame of reference, due to the fact that velocity structure in the Solar neighborhood appears when baryons are included.  This velocity structure is not present in dark matter-only simulations, and even when baryons are included its importance is not as apparent in the Galactic frame of reference.\n\\end{abstract}\n\n\\keywords{subject words here.}\n\n\\section{Introduction}\nDark matter is a key ingredient in understanding cosmology, galaxy formation and galaxy evolution.\nThe addition of non-baryonic dark matter is essential for a quantitative understanding of the Cosmic Microwave Background \\citep{Smoot1992}, large scale structure \\citep{Davis1985}, galaxy interactions \\citep{Clowe2006}, and galaxy kinematics \\citep{Rubin1980}.\nDark matter is also evidence of physics beyond the Standard Model of particle physics, as no known particle has the requisite properties to be dark matter. \nIf dark matter is a relic of thermal production in the early Universe, a confluence of scales makes a weakly interacting massive particle (WIMP) in the 10-1000 GeV mass range an attractive candidate ({\\it i.e.}, the WIMP ``Miracle''), but a WIMP is by no means the only possibility \\citep{Steigman1985}.\n\nProbing the new physics of dark matter can be done in many ways. For dark matter with WIMP-like interactions with Standard Model particles, these methods include collider searches, indirect detection, and direct detection. Direct detection experiments, the focus of this work, search for dark matter-nucleon interactions resulting in measurable nuclear recoils in a low-background target material. The interpretations of the experimental results in terms of dark matter-Standard Model interactions are subject to astrophysical uncertainties in the local dark matter density and velocity distributions. Such uncertainties need to be controlled to allow comparison between direct detection and other classes of dark matter experiments.\n\nThis paper examines the dark matter velocity distribution in the Solar neighborhood of high-resolution cosmological simulations of Milky Way-mass galaxies, in order to quantify the astrophysical uncertainties on direct detection results. We examine in detail the changes in the interpretation of results from LUX \\citep{FirstLUXResults}, CoGeNT \\citep{CoGeNT2013}, and DAMA/Libra \\citep{DAMALIBRA2010} due to different dark matter velocity distributions that can arise from a range of merger histories for Milky Way-mass galaxies.\n\nIt should be noted that our simulation of the dark matter local velocity is independent of the particle nature of dark matter (barring extremely large dark matter self-interactions), as long as the dark matter is cold. Thus, our results have potential implications in a number of search strategies for dark matter, not just direct detection searches for WIMP-like dark matter.  For example, the ADMX experiment \\citep{Duffy:2006aa,Asztalos:2009yp} searches for axion dark matter via axion-photon conversion in a strong magnetic field. The line shape for the expected signal depends on the assumption for the dark matter velocity distribution. A more accurate understanding of this distribution could allow for more powerful constraints from this experiment.\n\nReturning to direct detection, different  experiments of this type probe different portions of the velocity distribution due to different detector energy thresholds and different target nucleon masses. Heavier target nuclei are  sensitive only to higher impact velocities, assuming equal detector thresholds. Therefore, to convert the experimental results into a limit (or preferred region) on the dark matter-nucleon scattering cross section, some assumption of the dark matter velocity distribution must be made. Currently, all direct detection collaborations employ a Maxwell-Boltzmann velocity distribution (in the Galactic reference frame), known as the Standard Halo Model (SHM).\nThis is acknowledged as a convenient, but not realistic, benchmark using a distribution that dates to before simulations were capable of creating realistic galaxies.\n$N$-body simulations have shown significant deviations from Maxwell-Boltzmann \\citep{Kuhlen2010, Pillepich2014, Butsky2015}, and new fitting functions are still being proposed to  accommodate non-Maxwellian velocity distributions, {\\it e.g.}~\\citealt{Mao2013I}. However, these updated fitting functions are not based on simulations that include baryons (gas and stars).\n\nLarge suites of fully cosmological simulations are required to find new fitting functions. Such suites exist almost exclusively as dark matter-only simulations, due to the prohibitive computational expense required to run a suite with baryons.  The suites of simulations which result in large numbers of galaxies including baryonic effects are generally too low resolution to accurately simulate internal galaxy kinematics/dynamics. \n\nResolution is important in correctly modeling galaxy formation. High resolution simulations allow a more realistic prescription for star formation and feedback, which has been shown to influence the dark matter distribution through potential fluctuations due to rapid gas relocation \\citep{Mashchenko2008, Governato2010, Governato2012, Pontzen2012, Martizzi2013, Pontzen2014, DiCintio2014}.\nIt has recently become possible to simulate the evolution of a galaxy in a fully cosmological context, including baryonic effects, with  $\\lesssim$150 pc resolution. The simulations used in this work produce realistic rotation curves \\citep{Christensen2014}, match the stellar mass -- metallicity relationship \\citep{Brooks2007, Christensen2015}, \\citep{Brooks2011}, \nproduce gas outflows that create bulgeless disk galaxies with realistic angular momentum distributions \\citep{Brook2011, Brooks&Christensen2016}, reproduce observational trends in gas fraction, and match the the stellar mass to halo mass relation at z=0 \\citep{Munshi2013}. \n\n\nHowever, these simulations are time consuming (roughly 1 million CPU hours per Milky Way-mass simulation), so that simulating a large sample is computationally challenging.\nIn the absence of suites of high resolution galaxy simulations, in this paper we rely on a small number of galaxies that have been simulated with high resolution. As a consequence, our results do not have the same statistical strength as those from suites of large dark matter-only runs, but nevertheless demonstrate the breadth of behaviors that can be found in realistic simulated galaxies.\n\nWork by \\citealt{Pillepich2014} examined the difference between the Milky Way analogue Eris and ErisDark \\citep{Guedes2011} to determine how baryonic effects can change the dark matter velocity distribution for a single galaxy.\nWe complement and extend \\citealt{Pillepich2014} by presenting four Milky Way analogue galaxies at similar resolution \nto Eris but spanning a range of merger histories. \nThis work examines the local dark matter velocity distributions that originate in cosmological simulations with baryonic physics in order to assess the astrophysical uncertainties in direct detection searches for dark matter.\nAs this paper was being prepared, two papers \\citep{Bozorgnia:2016ogo,Kelso:2016qqj} performed similar analyses of the effect of baryonic physics on the dark matter velocity distribution in Milky Way-like galaxies. While we agree in some respects with their conclusions, most notably in finding an increase in the amount of high-velocity dark matter when baryons are included in the simulations, we disagree significantly on other important points, in particular the comparison with the Standard Halo Model. Whether this is due to the different implementation of baryonic physics, the higher resolution in our simulations, or an indication of the high variability of galaxies simulated with baryonic physics is yet to be determined, but the comparison of our work with the results of \\citealt{Bozorgnia:2016ogo} and \\citealt{Kelso:2016qqj} demonstrates the importance of accurate simulation of dark matter in the Milky Way.\n\n\nIn Section \\ref{Simulations} we describe the simulations used in more detail before moving to the effects on direct detection in Section \\ref{DirectDetection}.\nWe show the expected impact due to astrophysically reasonable local dark matter velocity distributions on three direct detection experiments: LUX (which currently places the strongest upper limits on dark matter direct detection), CoGeNT, and DAMA/Libra (both of which have anomalous results which have been claimed to be evidence of dark matter). The negative results from LUX place a great deal of pressure on a dark matter interpretation of the CoGeNT and DAMA/Libra signals. However, as these experiments are sensitive to very different regions of the dark matter velocity distribution it has been suggested that the addition of realistic baryonic physics to galaxy simulations could relax or even eliminate this tension. We conclude that using the SHM does result in overly optimistic constraints at low mass, but the weakening of the LUX constraints caused by our more accurate velocity distributions is not enough to alleviate the tension between the LUX null-results and the signals seen by DAMA/Libra and CoGeNT. Regardless, in order to accurately compare the constraints on dark matter parameters set by different classes of dark matter experiments, it is imperative that experimenters consider baryonic effects on the resulting dark matter velocity distribution within galaxies.\n\n\n\n\\section{Simulations}\\label{Simulations} \n\n\nAdvances in computational power as well as algorithmic and parallel implementation improvements have led to the ability to simulate galaxies in a fully cosmological context with force resolution only a few 100 pc or less \\citep[e.g.,][]{Brook2012, Aumer2013, FIRE2014, Christensen2015}. \nCold collisionless dark matter works very well in accounting for large scale structure, but on small scales where non-gravitational effects become important dark matter-only simulations do poorly in matching observed properties of galaxies \\citep[see][for a review]{Brooks2014}. \n To simulate the galaxies that reside in dark matter halos requires modeling the gas physics, for which we use the method of smooth particle hydrodynamics (SPH). SPH discretizes the gas into sample points which are used to approximate the fluid quantities. The galaxies in this work were simulated with the $N$-body + SPH code \\textsc{Gasoline} \\citep{Wadsley2004}.\n\nWe examine four galaxies, selected out of a simulation box of 50~Mpc on a side and resimulated using the `zoom-in' technique \\citep{Katz1993}. This allows us to focus resolution on the region of interest, $\\sim$1 Mpc centered on the galaxy, while still keeping the gravitational effects of large scale structure. Each galaxy has two versions run from the same initial conditions: a dark matter-only run and an $N$-body + SPH run. The cosmology used is: $\\Omega_M = 0.26,~\\Omega_\\Lambda = 0.74,~h=0.73,~\\sigma_8 = 0.77,~n=0.96$ \\citep{Spergel2007}. Star formation is modeled by tracing H$_2$ as in \\citealt{Christensen2012} using a Kroupa Initial Mass Function \\citep{Kroupa1993}. Stellar feedback uses the blastwave method as detailed in \\citealt{Stinson2006}, and includes metal line cooling as in \\citealt{Shen2010MetalLineCooling}. These galaxies were run with a spline gravitational softening equivalent to 174~pc in the high resolution region.  The mass of the dark matter particles in the dark matter-only runs is $1.8\\times10^5$ M$_\\odot$. The SPH galaxies have a dark matter particle mass that is lower by a factor of (1$ - f_b$), where $f_b$ is the cosmic baryon ratio, $\\Omega_b/\\Omega_m$, and is 0.175 for the adopted cosmology, i.e., $1.5\\times10^5$ M$_\\odot$. Gas particles begin with a mass of $2.7\\times10^4$ M$_\\odot$, and stars are born with $30\\%$ of the parent gas particle's mass.  \n\nIt has been shown that the inclusion of baryonic physics circularizes the galaxy's potential \\citep[e.g.,][]{Butsky2015, Bryan2013}, and leads to higher central concentrations \\citep{Oman2015}. Furthermore baryons aid in the destruction of substructure by increasing the central potential and therefore the ability to tidally disrupt accreted structures \\citep{Penarrubia2010,Brooks&Zolotov2014}. The disk also effectively shreds any substructure on an orbit through it \\citep{Ostriker1972, DOnghia2010}.\n\nOur four galaxies (designated h239, h258, h277 and h285) span a halo mass range of $0.7-0.9 \\times 10^{12} M_\\odot$. This is is on the lower half of the Milky Way-mass range $0.6 - 1.3 \\times 10^{12}M_{\\odot}$ \\citep{Kafle2012}. We used two additional galaxies at the upper end of the Milky Way-mass range (run at lower resolutions, with different implementation of the baryonic physics, and different cosmology), to verify that our results are independent of halo mass. We focus on the four high resolution galaxies to maximize the number of particles in the Solar neighborhood (see next section).\n\nEach galaxy has a qualitatively different merger history: h239 was continually bombarded with small galaxies, h258 had a $1:1$ major merger at $z\\sim1$, h277 had its last major merger at $z\\sim3$, and h285 underwent a five way merger at $z\\sim1.7$ followed by a $1:12$ mass ratio counter-rotational merger beginning at $z\\sim1.4$ and ending at $z\\sim0.8$. All end up as Milky Way-mass galaxies at the present day. \n\nWith its relatively quiescent merger history, h277 is thought to have the most similar merger history to the Milky Way \\citep[e.g.,][]{Ruchti2015}. It is important to note that h258 has a dark disk; this has been studied in lower resolution versions of this run  \\citep{Read2009} and is still present in the higher resolution simulation used here. The galaxy h285 has a counter-rotating component in the bulge, likely related to the counter rotating merger mentioned earlier that finishes at $z=0.8$. Table \\ref{SimTable} shows each galaxy's virial mass, the escape velocity from the Solar neighborhood, and the number of dark matter particles in the Solar neighborhood (defined in the next section).\n\n\n\n\n\n\\capstartfalse\n\\begin{deluxetable}{lcccc}\n\n\\tablecaption{Relevant Simulated Galaxy Properties} \n\\tablecolumns{4}\n\\tablewidth{\\linewidth}\n\\tablehead{\\colhead{Simulation} & \\colhead{$M_{\\text{halo}}~[10^{12} M_\\odot]$}\n   & \\colhead{$v_{\\text{esc}}$~[km/s]} & \\colhead{$v_0$~[km/s]} & \\colhead{$N_{\\rm dm}$}}\n\\startdata\nh239      & 0.91 & 471 & 204 & 5847 \\\\\t\nh239Dark  & 0.93 & 411 & 155 & 3424 \\\\\nh258      & 0.77 & 458 & 185 & 6482 \\\\\nh258Dark  & 0.82 & 403 & 152 & 2878 \\\\\nh277      & 0.68 & 462 & 190 & 7460 \\\\\nh277Dark  & 0.74 & 389 & 148 & 3327 \\\\\nh285      & 0.88 & 474 & 187 & 7115 \\\\\nh285Dark  & 0.73 & 378 & 135 & 2887 \n\\enddata\n\\label{SimTable}\n\\tablecomments{Details of the four simulated Milky Way-like galaxies considered in this paper: dark matter halo mass, escape velocity from the Solar neighborhood, best fit Maxwellian's peak velocity, and number of dark matter halo particles in the annulus defining the Solar region.  Each galaxy was simulated both with and without baryons -- the latter are designated ``Dark'' in the table.}\n\\end{deluxetable}\n\\capstarttrue\n\n\\subsection{Dark Matter Velocity Distributions}\n\nOnly the dark matter distribution at the Earth's neighborhood is relevant for direct detection, but the best cosmological galaxy simulations have resolution limits on the order of a hundred parsecs. The Sun's distance from the Galactic Center also has significant uncertainties, \\citep[e.g.,][]{Bovy2012} and so we must average over a resolved region to provide an expected averaged velocity distribution. We have chosen to average the velocity distribution over a cylindrical annulus in the plane of the disk. The height and width of the annulus are 1 kpc, and the central radius is 8 kpc.\nWe have oriented the annulus in the dark matter-only simulations to coincide with the annulus in the SPH simulations, centered on the minimum of the gravitational potential in each simulation. It is the high resolution of our simulations, allowing finer sampling with more particles, that enables us to look at such a relatively small region.\n\nFor both the dark matter-only and baryonic versions of the simulations, the local dark matter velocity distribution in the galactic reference frame (shown in Figure \\ref{f_galactic}) already displays clear differences from the Maxwellian distribution assumed by experiments. The Maxwellian often used is the SHM with $v_0=220$ km/s and $v_{\\rm esc}=544$ km/s:\n", "index": 1, "text": "\n\\[\nf(v) \\propto\n\\begin{cases}\n\tv^2 \\exp{\\left(-v/v_0\\right)^2}, & \\text{if } |v| \\in [0,v_{\\rm esc}] \\\\\n    0, & \\text{otherwise}\n\\end{cases}\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"f(v)\\propto\\begin{cases}v^{2}\\exp{\\left(-v/v_{0}\\right)^{2}},&amp;\\text{if }|v|\\in%&#10;[0,v_{\\rm esc}]\\\\&#10;0,&amp;\\text{otherwise}\\end{cases}\" display=\"block\"><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><msup><mi>v</mi><mn>2</mn></msup><mi>exp</mi><msup><mrow><mo>(</mo><mo>-</mo><mi>v</mi><mo>/</mo><msub><mi>v</mi><mn>0</mn></msub><mo>)</mo></mrow><mn>2</mn></msup><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if </mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>v</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>∈</mo><mrow><mo stretchy=\"false\">[</mo><mn>0</mn><mo>,</mo><msub><mi>v</mi><mi>esc</mi></msub><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mn>0</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise</mtext></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05402.tex", "nexttext": "\nwhere $v$ is the dark matter velocity, $v_{\\rm esc}$ is escape velocity from the region under consideration and $v_M$ and $p$ are parameters that are extracted from fits to simulations. We have adopted their best fit parameters for Milky Way-mass galaxies in the solid green line, which is the same in every panel.  The dashed green lines in each panel of Figure~\\ref{f_galactic} show the \\citet{Mao2013I} parameterization, but with parameters fit to our individual halos.  \n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2.\\columnwidth]{f_gal_3Panel_SPH_over_DMO.pdf}\n\\caption{Local dark matter velocity distribution in the Galactic reference frame. Left: Dark matter-only runs (red). Center: Baryonic runs (blue).  Each halo is compared to the SHM (solid black) and the best empirical fit from \\citealt{Mao2013I} (solid green). A fit to the individual halos using the Mao parameterization fit to the Milky Way Galaxy (green dashed line) and a Maxwellian (black dotted line) are also shown. Right: Ratio of SPH to dark matter-only $f(v)$ in the Galactic reference frame.}\n\n\\label{f_galactic}\n\\end{figure*}\n\nIt can be seen in Figure~\\ref{f_galactic} that there is less high velocity material in all of the dark matter-only and baryonic runs than in the SHM. We have checked that this is not due to the mass of the halos by comparing to the other two other simulated halos with higher halo masses, but run at lower resolution and with different baryonic physics.  Comparison with our lower-resolution, higher-mass simulations confirm there is no trend with halo mass, justifying our focus only on those runs with the highest resolution.  Additionally, this same effect was seen in the study by \\citet{Kuhlen2010}, where they examined halos on the more massive end of the Milky Way's allowed mass, demonstrating that this deficit is independent of mass.\n\nImportantly, the baryonic runs have more high velocity dark matter than the dark matter-only runs.  This is expected due to the increased potential in the disk because of the presence of baryons. Because of the added disk potential, the SHM is a better fit to the SPH simulations than the dark matter-only halos.\\footnote{In fact, \\citet{Butsky2015} suggested that a Gaussian is a better fit to the dark matter velocity distribution in runs with baryons.  While this also seems true in some of our galaxies, a Gaussian isn't always a good fit.  There is, however, always more high velocity material in the baryonic simulations than in the dark matter-only galaxies.}  That the SHM is a better fit in the baryonic simulations becomes more apparent in the Earth reference frame.  The dark matter velocity distribution in the Earth reference frame, shown in Figure \\ref{f_earth}, at the days of maximum and minimum flux, is built from the particle velocities in the Galactic reference frame with a Galilean boost to the Solar reference frame, azimuthally averaging the simulation data.\nThe transformation to the Earth frame is then carried out on a particle by particle basis (creating a different distribution for each day). The Sun-Earth velocities used in the transformation are as in \\citet{AnnualModulationGelminiGondolo2001} and \\citet{FreeseLisantiSavage2012}, with one exception: the local standard of rest was changed to make our analysis more consistent with the stellar kinematics of the simulated galaxies. Rather than use the relative speed of the Milky Way's local standard of rest, 235 km/s, we use the peak of the simulated local stellar velocity distribution, typically about 195 km/s (built from star particles in the same region from which the dark matter was selected).  We apply this value, derived in the baryonic run, to the corresponding dark matter-only run.  \n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2\\columnwidth]{f_earth_consistent_3Panel_SPH_over_DMO.pdf}\n\\caption{Velocity distributions in the Earth reference frame at days of highest and lowest flux. Left: Dark matter-only runs (red). Center: Baryonic runs (blue). In all cases, we compare the distributions to the SHM (black). \nThe fits to our individual halos (Mao parameterization, green dashed line; Maxwellian, black dotted line) are boosted from the Galactic rest frame shown in Figure~\\ref{f_galactic}.  They are not re-fitted in the Earth frame.  Right: Ratio of SPH to dark matter-only $f(v)$ in the Earth reference frame. The solid line is the ratio at the day of  maximum flux, and the dotted line is the ratio at the day of minimum flux.}\n\\label{f_earth} \n\\end{figure*}\n\nFor 3 of our 4 galaxies, the SHM does a better job fitting the SPH runs in the Earth reference frame than in the Galactic reference frame  (note that we shift the fit from the Galactic reference frame; we do not try a new fit in the Earth frame). There are two reasons why this may be the case.  First, as was already noted above, the presence of a baryonic disk adds more matter to the center of the halo and enhances the velocities.  This effect can already be seen in Figure \\ref{f_galactic}, where the SHM is a better description of the high velocity tail in the baryonic runs than in the dark matter-only versions.  In addition to the added disk potential, there is typically also structure in the dark matter velocity space of SPH simulations that is lacking in the dark matter-only simulations.  \n\nThe Galactic reference frame adopts the magnitude of the velocity of all of the dark matter particles in the Solar annulus that we defined.  The transformation of the SHM to the Solar reference frame assumes isotropy in velocity space, but the Earth reference frame accounts for directionality.  While our dark matter particle distributions are largely isotropic in the dark matter-only runs, our baryonic simulations instead consistently enhance the dark matter velocities in a preferred direction.   \nThere are several sources which add preferred direction to the dark matter velocities in the baryonic simulations.    \nInclusion of baryons has been found to leave a halo's total spin parameter relatively unchanged, but can affect the spin parameter of the inner halo by as much as 30-50\\% \\citep{Bryan2013, Bett2010}.  The halo spin is separate from a dark disk which can add further coherent structure. Some of the galaxies studied here have unambiguous dark matter co-rotation with the stellar disk, evidence of a dark disk.  One also shows enhanced counter-rotation with respect to the stellar disk. Finally, \\citet{Kuhlen2012} also used a dark matter-only simulation to show that debris flow can influence the velocity structure.  It remains to be examined whether the inclusion of baryons enhances this debris flow structure further.\n\nUsing these simulated velocity distributions, we now turn to the effect on direct detection searches for dark matter scattering with nucleons.\n\n\\section{Direct Detection}\\label{DirectDetection}\n\nDirect detection searches for dark matter have restricted the available WIMP parameter space considerably in the previous decade. As is usually done, we will examine the relation between nucleon cross section $\\sigma_N$ and the dark matter particle mass $m_\\chi$. The robustness of this restriction hinges on a good understanding of the systematic uncertainties, of which the astrophysical uncertainty is an important (and relatively unconstrained) part. In order to accurately compare results of collaborations using different targets and detectors, as well as comparing to the collider and indirect detection searches, these uncertainties need to be quantified. Below, we show the effect on exclusion limits of using dark matter velocity distributions from our simulations.\n\nThe rate of dark matter interactions is given by:\n\n", "itemtype": "equation", "pos": 18745, "prevtext": "\nWe show this SHM in Figure~\\ref{f_galactic} as a black solid line, and is the same in all panels. The black dotted lines show the best fit Maxwellian to each simulation (using $v_0$ and $v_{esc}$ from Table 1). \n\nIn Figure~\\ref{f_galactic}, we also show (green solid line) the empirical velocity distribution from \\citet{Mao2013I}:\n", "index": 3, "text": "\n\\[\nf(v) \\propto \n\\begin{cases}\n    \\exp \\left(-\\frac{|v|}{v_M} \\right) \\left( v_{\\rm esc}^2 - |v|^2\\right)^p, & \\text{if } |v| \\in [0,v_{\\rm esc}] \\\\\n    0, & \\text{otherwise}\n\\end{cases}\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"f(v)\\propto\\begin{cases}\\exp\\left(-\\frac{|v|}{v_{M}}\\right)\\left(v_{\\rm esc}^{%&#10;2}-|v|^{2}\\right)^{p},&amp;\\text{if }|v|\\in[0,v_{\\rm esc}]\\\\&#10;0,&amp;\\text{otherwise}\\end{cases}\" display=\"block\"><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∝</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mstyle displaystyle=\"false\"><mfrac><mrow><mo stretchy=\"false\">|</mo><mi>v</mi><mo stretchy=\"false\">|</mo></mrow><msub><mi>v</mi><mi>M</mi></msub></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msubsup><mi>v</mi><mi>esc</mi><mn>2</mn></msubsup><mo>-</mo><msup><mrow><mo stretchy=\"false\">|</mo><mi>v</mi><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mo>)</mo></mrow><mi>p</mi></msup></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if </mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mi>v</mi><mo stretchy=\"false\">|</mo></mrow></mrow><mo>∈</mo><mrow><mo stretchy=\"false\">[</mo><mn>0</mn><mo>,</mo><msub><mi>v</mi><mi>esc</mi></msub><mo stretchy=\"false\">]</mo></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mn>0</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise</mtext></mtd></mtr></mtable></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05402.tex", "nexttext": "\nwith $\\rho_0$ the local dark matter density, \n$v_{\\rm esc}$ the escape velocity from the Solar neighborhood, $v_{\\rm min} \\equiv \\sqrt{E_R m_T/(2 \\mu_{T\\chi}^2)}$ is the minimum velocity recoil a particular detector can measure. This is dependent on the nucleon recoil energy $E_R$, the nucleus target mass $m_T$, and the nucleus-dark matter reduced mass $\\mu_{T\\chi}$. \nIn addition to the local dark matter density, the rate of dark matter events is \nproportional to the integrated weighted velocity function \n$g(v_{\\rm min}) \\equiv \\int_{v_{\\rm min}}^\\infty \\frac{f(v)}{v} dv $. This quantity is plotted in Figure \\ref{g_earth} in the Earth rest frame for each of our considered distributions. As each experiment has a different $v_{\\rm min}$ to which it is sensitive, each experiment probes different regions of $g(v_{\\rm min})$. Thus, while the degree of agreement between different experiments can be quantified in a relatively astrophysics-independent manner \\citep{Fox2011,DelNobile2013}, one's confidence in the extracted limits on the more fundamental dark matter parameters which enter into $d\\sigma/dE_R$ is limited by the uncertainties in $f(v)$ and $g(v_{\\rm min})$. \n\nThere is some tension between anomalous positive results from several direct detection experiments, and the null results of other experiments which should be sensitive to the putative signals. \nThe strongest limits are set by the LUX Collaboration \\citep{FirstLUXResults}, with many other collaborations setting competitive and complimentary limits.\\footnote{As this paper was being completed, LUX released an updated analysis with a larger data set and improved analysis techniques for the low-mass dark matter region \\cite{Akerib:2015rjg}. To calculate the effect of our simulated velocity distributions on these new results would require knowledge of the detector response under the new analysis. This has not yet been made public. Therefore, we continue to use the LUX data from \\citep{FirstLUXResults} in this work. The trends we observe can be reasonably extrapolated to the newest LUX bounds.} Heavy WIMP dark matter ($m_\\chi \\gtrsim 100$ GeV) has much stronger exclusion bounds from LUX when compared to the bounds on light dark matter, ($m_\\chi \\sim10$ GeV). The CoGeNT Collaboration \\citep{CoGeNT2013} has seen events above their background expectation and the DAMA/Libra Collaboration \\citep{DAMALIBRA2010} has observed an exceptionally strong modulation, signal each of which can be interpreted as originating from dark matter collisions, though such conclusions are in extreme tension with the non-observation of any signal by LUX.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2\\columnwidth]{g_earth_consistentlinear_3Panel_SPH_over_DMO.pdf}\n\\caption{Plots of the weighted velocity distribution integral $g(v_{\\rm min})$ in the Earth reference frame at the days of highest and lowest flux. Left: dark matter-only simulations (red).  Center: Baryonic simulations (red). We show also the SHM (solid black) and best fit Maxwellian to individual halos (dotted black), and the empirical fits following the functional form in \\citet{Mao2013I} (dashed green). Right: Ratio of SPH to dark matter-only $g(v_{\\rm min})$ in the Earth reference frame. The solid line is the ratio at the day of  maximum flux, and the dotted line is the ratio at the day of minimum flux.}\n\\label{g_earth}\n\\end{figure*}\n\nThese collaborations, like all others, assume the SHM in their analyses. As we have seen, this does not agree with dark matter velocity distributions found in simulations. As these collaborations are sensitive to different portions of the dark matter velocity distribution due to different target materials and detector sensitivities, it is not immediately clear if the tension between the positive and negative results may be a result of a non-Maxwellian velocity distribution. This has been addressed in the literature \\citep{Fox2011,DelNobile2013} by changing to a different parameter space, $\\eta$ vs.~$v_\\text{min}$, that clearly shows which regions of velocity-space different experiments are sensitive to, assuming a particular dark matter mass. The $\\eta$ parameter, equivalent to $g(v_\\text{min})$ up to normalization factors, defined as:\n\n", "itemtype": "equation", "pos": 26646, "prevtext": "\nwhere $v$ is the dark matter velocity, $v_{\\rm esc}$ is escape velocity from the region under consideration and $v_M$ and $p$ are parameters that are extracted from fits to simulations. We have adopted their best fit parameters for Milky Way-mass galaxies in the solid green line, which is the same in every panel.  The dashed green lines in each panel of Figure~\\ref{f_galactic} show the \\citet{Mao2013I} parameterization, but with parameters fit to our individual halos.  \n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2.\\columnwidth]{f_gal_3Panel_SPH_over_DMO.pdf}\n\\caption{Local dark matter velocity distribution in the Galactic reference frame. Left: Dark matter-only runs (red). Center: Baryonic runs (blue).  Each halo is compared to the SHM (solid black) and the best empirical fit from \\citealt{Mao2013I} (solid green). A fit to the individual halos using the Mao parameterization fit to the Milky Way Galaxy (green dashed line) and a Maxwellian (black dotted line) are also shown. Right: Ratio of SPH to dark matter-only $f(v)$ in the Galactic reference frame.}\n\n\\label{f_galactic}\n\\end{figure*}\n\nIt can be seen in Figure~\\ref{f_galactic} that there is less high velocity material in all of the dark matter-only and baryonic runs than in the SHM. We have checked that this is not due to the mass of the halos by comparing to the other two other simulated halos with higher halo masses, but run at lower resolution and with different baryonic physics.  Comparison with our lower-resolution, higher-mass simulations confirm there is no trend with halo mass, justifying our focus only on those runs with the highest resolution.  Additionally, this same effect was seen in the study by \\citet{Kuhlen2010}, where they examined halos on the more massive end of the Milky Way's allowed mass, demonstrating that this deficit is independent of mass.\n\nImportantly, the baryonic runs have more high velocity dark matter than the dark matter-only runs.  This is expected due to the increased potential in the disk because of the presence of baryons. Because of the added disk potential, the SHM is a better fit to the SPH simulations than the dark matter-only halos.\\footnote{In fact, \\citet{Butsky2015} suggested that a Gaussian is a better fit to the dark matter velocity distribution in runs with baryons.  While this also seems true in some of our galaxies, a Gaussian isn't always a good fit.  There is, however, always more high velocity material in the baryonic simulations than in the dark matter-only galaxies.}  That the SHM is a better fit in the baryonic simulations becomes more apparent in the Earth reference frame.  The dark matter velocity distribution in the Earth reference frame, shown in Figure \\ref{f_earth}, at the days of maximum and minimum flux, is built from the particle velocities in the Galactic reference frame with a Galilean boost to the Solar reference frame, azimuthally averaging the simulation data.\nThe transformation to the Earth frame is then carried out on a particle by particle basis (creating a different distribution for each day). The Sun-Earth velocities used in the transformation are as in \\citet{AnnualModulationGelminiGondolo2001} and \\citet{FreeseLisantiSavage2012}, with one exception: the local standard of rest was changed to make our analysis more consistent with the stellar kinematics of the simulated galaxies. Rather than use the relative speed of the Milky Way's local standard of rest, 235 km/s, we use the peak of the simulated local stellar velocity distribution, typically about 195 km/s (built from star particles in the same region from which the dark matter was selected).  We apply this value, derived in the baryonic run, to the corresponding dark matter-only run.  \n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2\\columnwidth]{f_earth_consistent_3Panel_SPH_over_DMO.pdf}\n\\caption{Velocity distributions in the Earth reference frame at days of highest and lowest flux. Left: Dark matter-only runs (red). Center: Baryonic runs (blue). In all cases, we compare the distributions to the SHM (black). \nThe fits to our individual halos (Mao parameterization, green dashed line; Maxwellian, black dotted line) are boosted from the Galactic rest frame shown in Figure~\\ref{f_galactic}.  They are not re-fitted in the Earth frame.  Right: Ratio of SPH to dark matter-only $f(v)$ in the Earth reference frame. The solid line is the ratio at the day of  maximum flux, and the dotted line is the ratio at the day of minimum flux.}\n\\label{f_earth} \n\\end{figure*}\n\nFor 3 of our 4 galaxies, the SHM does a better job fitting the SPH runs in the Earth reference frame than in the Galactic reference frame  (note that we shift the fit from the Galactic reference frame; we do not try a new fit in the Earth frame). There are two reasons why this may be the case.  First, as was already noted above, the presence of a baryonic disk adds more matter to the center of the halo and enhances the velocities.  This effect can already be seen in Figure \\ref{f_galactic}, where the SHM is a better description of the high velocity tail in the baryonic runs than in the dark matter-only versions.  In addition to the added disk potential, there is typically also structure in the dark matter velocity space of SPH simulations that is lacking in the dark matter-only simulations.  \n\nThe Galactic reference frame adopts the magnitude of the velocity of all of the dark matter particles in the Solar annulus that we defined.  The transformation of the SHM to the Solar reference frame assumes isotropy in velocity space, but the Earth reference frame accounts for directionality.  While our dark matter particle distributions are largely isotropic in the dark matter-only runs, our baryonic simulations instead consistently enhance the dark matter velocities in a preferred direction.   \nThere are several sources which add preferred direction to the dark matter velocities in the baryonic simulations.    \nInclusion of baryons has been found to leave a halo's total spin parameter relatively unchanged, but can affect the spin parameter of the inner halo by as much as 30-50\\% \\citep{Bryan2013, Bett2010}.  The halo spin is separate from a dark disk which can add further coherent structure. Some of the galaxies studied here have unambiguous dark matter co-rotation with the stellar disk, evidence of a dark disk.  One also shows enhanced counter-rotation with respect to the stellar disk. Finally, \\citet{Kuhlen2012} also used a dark matter-only simulation to show that debris flow can influence the velocity structure.  It remains to be examined whether the inclusion of baryons enhances this debris flow structure further.\n\nUsing these simulated velocity distributions, we now turn to the effect on direct detection searches for dark matter scattering with nucleons.\n\n\\section{Direct Detection}\\label{DirectDetection}\n\nDirect detection searches for dark matter have restricted the available WIMP parameter space considerably in the previous decade. As is usually done, we will examine the relation between nucleon cross section $\\sigma_N$ and the dark matter particle mass $m_\\chi$. The robustness of this restriction hinges on a good understanding of the systematic uncertainties, of which the astrophysical uncertainty is an important (and relatively unconstrained) part. In order to accurately compare results of collaborations using different targets and detectors, as well as comparing to the collider and indirect detection searches, these uncertainties need to be quantified. Below, we show the effect on exclusion limits of using dark matter velocity distributions from our simulations.\n\nThe rate of dark matter interactions is given by:\n\n", "index": 5, "text": "\\begin{align}\\label{detectionRate}\n    \\frac{dR}{dE_R}(E_R) = \\frac{d\\sigma}{dE_R} \\frac{\\rho_0}{m_\\chi} \\int_{v_{\\rm min}}^{\\infty}\\frac{f(v)}{v} dv \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{dR}{dE_{R}}(E_{R})=\\frac{d\\sigma}{dE_{R}}\\frac{\\rho_{0}}{m_%&#10;{\\chi}}\\int_{v_{\\rm min}}^{\\infty}\\frac{f(v)}{v}dv\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>R</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>R</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>σ</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><msub><mi>E</mi><mi>R</mi></msub></mrow></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>ρ</mi><mn>0</mn></msub><msub><mi>m</mi><mi>χ</mi></msub></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>v</mi><mi>min</mi></msub><mi mathvariant=\"normal\">∞</mi></msubsup></mstyle><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>v</mi></mfrac></mstyle><mo>⁢</mo><mrow><mo>𝑑</mo><mi>v</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05402.tex", "nexttext": "\nis approximately independent of the detector response \\citep{Fox2011} and is therefore directly comparable across experiments, without relying on a particular assumption for $f(v)$. These studies find it is difficult (but perhaps not impossible) for the CoGeNT, DAMA/Libra, and LUX results to all be consistent with an arbitrary function $\\eta(v_{\\rm min})$.  As previously mentioned, while this technique allows for more direct comparison between direct detection experiments, it does not allow for extraction of the cross section $\\sigma$, which would allow for comparison between direct detection experiments and other types of dark matter searches ({\\it e.g.}~collider searches and indirect detection experiments). This motivates our efforts to determine $f(v)$ directly from simulation.\n\nThe interaction rate Eq.~\\eqref{detectionRate} depends on the local dark matter density only as an overall multiplicative factor. As such it effects each experiment in the same way.\nGiven that direct detection collaborations generally use $\\rho_0 \\sim 0.3 - 0.4$ GeV/cm$^3$ as the local dark matter density, this cannot contribute to positive signals in one experiment overlapping excluded parameter space in another.\nWork by \\citet{LisantiSpergel2012} has further shown that it is unlikely that the Sun is in a local overdensity of dark matter, and so using a canonical value of $\\rho_0\\sim 0.3-0.4$  GeV/cm$^3$ is indeed reasonable. Older sources generally use $\\rho_0\\sim 0.3$ GeV/cm$^3$, while newer use $\\rho_0\\sim 0.4$ GeV/cm$^3$ from \\citet{Pato2015}, but this change amounts to a simple rescaling of experimental results.\nHere, we adopt $0.4$ GeV/cm$^3$ to allow comparison with current literature. Our simulations all have $\\rho_0\\sim 0.3-0.4$  GeV/cm$^3$, despite the presence of a dark disk in some of our simulated galaxies. We leave the exploration of the role of the dark disk for future work, but, because our simulations yield a consistent dark matter density, the relevant astrophysical source of uncertainty is the dark matter velocity distribution.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=0.8\\textwidth]{Lux_Dama_Cogent.pdf}\n\\caption{Exclusion limits using various velocity distributions. Blue is from baryonic simulations, red from dark matter-only simulations, black is the SHM, and dotted is the LUX results from \\citet{FirstLUXResults}.}\n\\label{sigma_m_LUX}\n\\end{figure*}\n\nThe critical quantity to compare for the direct detection search is $g(v_{\\text{min}})$. In Figure \\ref{g_earth} we show $g(v_{\\text{min}})$ for the days of highest and lowest dark matter flux. It is clear that the baryonic runs and SHM have more similar $f(v)$ distributions than between the SHM and the dark matter-only runs. When compared to the baryonic simulations, the SHM overpredicts the fraction of high-velocity dark matter, and underpredicts the low-velocity. Thus, the SHM will set conservative exclusion limits at high dark matter masses (which correspond to small $v_{\\rm min}$), and overly optimistic bounds at low dark matter masses. However, for these masses the SHM would be a conservative choice for detection.\nThough the baryonic runs are more similar to the SHM than the dark matter-only simulations are, deviations from the SHM are still present. This is consistent with expectations from previous work by \\citet{Pillepich2014}.\n\nHaving introduced the connection between velocity distributions and the rate of events in direct detection experiments, we now calculate the experimental constraints on $m_\\chi$ vs.~$\\sigma$ one would obtain using our simulated distributions, rather than the SHM.\nOur LUX analysis is less complex than that done by the LUX Collaboration \\citep{FirstLUXResults} given our relative lack of knowledge about the background distributions. Instead we closely follow the procedure described in \\citet{GreshamZurek2014} which was applied to results from the Xenon100 experiment \\citep{XENON2012}. We use a maximum gap analysis as described in \\citet{Yellin2002}, varying which events from the \\citet{FirstLUXResults} dataset were included in our signal region to ensure our SHM limits agree with the experimental limits of \\citet{FirstLUXResults}, which were obtained using the full instrument information. This required including two events: the events at $\\sim 3$ and $19$ phe.\nOur CoGeNT analysis is a chi-squared fit to the data presented in \\citet{CoGeNT2013} using our velocity distributions and a Helm Form Factor \\citep{Duda2007}.\n\nOur DAMA/Libra analysis is a chi-squared fit to the data presented in \\citet{DAMALIBRA2010} using our velocity distributions and a Helm form factor.\nWe compare the annual modulation signal from the DAMA/Libra data to that inferred from our simulations. \nUnlike other experiments which seek to be ``zero-background,'' DAMA/Libra is sensitive to annual modulation in the rate of dark matter scattering, caused by the motion of the Earth into and out of the Galactic dark matter ``wind.'' As a result, the date when the Earth and Sun's combined motion is maximized is important for analyzing DAMA/Libra's data.\nWe have made a change to the day of peak flux used in favor of self consistency within the simulations, in addition to the change in the average stellar speed (as used in our LUX analysis). The peak days used for the simulation processing are not those of Earth in its rotation; this is because the simulated star population has a net direction after azimuthal averaging that is not purely tangential. This direction impacts the day of flux extrema by a few days for most of our simulated galaxies, and at most by a week.\n\n\n\nFigure \\ref{sigma_m_LUX} shows the effect of using our simulated velocity distributions on the DAMA/Libra and CoGeNT preferred $m_\\chi - \\sigma$ regions and the LUX $m_\\chi - \\sigma$ exclusion region. CoGeNT shows less scatter than DAMA/Libra as it is insensitive to the precise days of flux extrema. Importantly, the baryon simulations have a greater variation due to their more diverse velocity distributions. The precise origin of this diversity is left to a future paper, but the point we wish to emphasize in this work is that the large systematic shift indicated by the dark matter-only runs is not upheld by the baryonic runs. This is particularly true for CoGeNT and DAMA/Libra, but the baryonic simulations show a smaller shift even in the case of LUX.  \n\nNotably the strongest constraint on $\\sigma$ occurs at higher dark matter mass, as there is less high velocity dark matter in the baryonic simulations than one would expect from the SHM. We can also see that the tension between the claimed signal and LUX's exclusion region is not alleviated, though we see up to an order of magnitude change in exclusion limit due to using our simulated velocity distributions instead of the SHM.\n\n\\section{Conclusions}\nWe have compared the local velocity distribution in four high resolution cosmological simulations of Milky Way-analogue halos run both as dark matter-only and with baryons included. We find that the dark matter velocity distributions are influenced appreciably by the inclusions of baryons. We conclude that several important lessons can be drawn based on these results:\n\n\\begin{itemize}\n\\item{Due to the fact that they are less computationally expensive,  simulations have been used to generate a statistical sample of Milky Way-mass galaxies in order to derive a functional form for the dark matter velocity distribution in the Solar neighborhood.  However, neglecting the impact of baryons will lead to erroneous results. As anticipated by \\citet{Mao2013I}, the inclusion of baryons  leads to more high velocity dark matter in the Solar neighborhood. However, the shape of the velocity distribution function is also altered in ways not captured by functional forms fit to dark matter-only runs.  Ironically, we find that the inclusion of baryons leads to velocity distributions which bring direct detection experimental results closer to those extracted from the SHM than results obtained using dark matter-only simulations. \nIn order to quantify how the range of velocity distributions depends on merger history or other factors, or to define a functional form that is better suited to the results seen in baryonic simulations, a larger sample of simulations will be needed to provide statistics. } \n\n\n\\item{For the purpose of interpreting direct detection experiments, it is critical to examine simulated velocity distributions \\text{\\it transformed} to the lab frame. The baryonic simulations can have significant velocity substructure that not only is missing in the dark matter-only runs, but that is neglected when derived in the Galactic reference frame, even if baryonic simulations are used. The results in the Galactic frame retain only information on the magnitude, not the directionality, of the dark matter velocities. The velocity space structure is vital to the direct detection search, and when the velocity distribution is made in the Galactic reference frame, the vector information is lost prematurely. Given the particle data afforded by a simulation, one should transform the velocities into the lab frame and \\text{\\it then} fit to a velocity distribution. }\n\n\\item{Our velocity functions extracted from baryonic simulations do not resolve the tension between the claimed positive signals of DAMA/Libra and CoGeNT and the null results from LUX.  However, our simulations predict that the SHM is conservative for the exclusion of dark matter when the bound is  dominated by the detector sensitivity to low velocity dark matter. \nIf an experiment which is sensitive only to the high velocity tail of the dark matter distributions uses the SHM in its analysis, it would expect more dark matter interactions  than would be the case according to our simulations; in such an instance there could be a false rejection of the dark matter hypothesis. Mass ranges where experiments are dominated by scattering below about 200 km/s will suffer from the opposite issue; here any signal would be amplified by using the SHM. }\n\n\\end{itemize}\n\nIn our sample of four simulations, we found greater diversity in the details of the velocity distributions in our baryonic runs than in our equivalent dark matter-only simulations. This indicates that the range of possible velocity distributions in realistic galaxies may be large, and highlights the need for large suites of high-resolution galaxy simulations including baryons in order to search for trends in velocity distribution as a function of galaxy merger history. While we need to consider the effects of baryons on dark matter, we also need to carefully choose halos to match the Milky Way's history and environment to be able to make specific statements about our local dark matter environment. \n\nIt is again interesting to compare our results with the recent papers of \\citealt{Bozorgnia:2016ogo} and \\citealt{Kelso:2016qqj}. Though we compare a similar number of simulated galaxies with baryonic physics included, our galaxies have a deficit of high-velocity dark matter in the SPH simulations when compared to the SHM. This leads to our extrapolated direct detection limits being weaker than those predicted by the SHM. This is very different from the results of \\citealt{Bozorgnia:2016ogo,Kelso:2016qqj}, which find an increase in the high velocity distributions. It should be noted that the resolution of our simulations ($\\sim 170$~pc) is lower than that used in both \\citealt{Bozorgnia:2016ogo} and \\citealt{Kelso:2016qqj}; and this may be the ultimate source of the different results. In\\citealt{Governato2010} we explicitly shown that at resolutions worse than 2-300pc the energy transfer to the DM component from rapid gas outflows is drastically reduced, reducing any effect of 'baryonic physics' on the DM structure.\n\nHowever, it is as yet unclear whether this discrepancy is due to differences in the physics of the simulations, the resolution of the simulations, or simply an indication of the increased variability found in Milky Way-like galaxies when realistic baryonic physics is included in the simulations. If the latter, then the tension in the results of our three papers underlines the need for large suites of high resolution simulations with baryonic physics that accurately satisfies a larger number of observational constraints, in order to provide sufficient statistics for reliable extrapolation. In addition, if the tension is motivated by large variance within ``Milky Way-like'' galaxies, this would motivate efforts to find methods of relating the velocity structures found in simulations to observables in the Milky Way itself. This will be necessary if we are to more accurately determine the velocity distribution not of an average Milky Way-like galaxy, but of the specific galaxy in which we reside.\n\n\\acknowledgements\nResources supporting this work were provided by the NASA High-End Computing (HEC) Program through the NASA Advanced Supercomputing (NAS) Division at Ames Research Center.  We thank Tom Quinn and James Wadsley for use of the proprietary code {\\sc Gasoline}, and Charlotte Christensen and Fabio Governato for help in creating the simulations.\n\n\n\n\\clearpage\n\\newpage\n\\bibliographystyle{apj}\n\\bibliography{AstrophysicalUncertainties}\n\n\n\n", "itemtype": "equation", "pos": 31052, "prevtext": "\nwith $\\rho_0$ the local dark matter density, \n$v_{\\rm esc}$ the escape velocity from the Solar neighborhood, $v_{\\rm min} \\equiv \\sqrt{E_R m_T/(2 \\mu_{T\\chi}^2)}$ is the minimum velocity recoil a particular detector can measure. This is dependent on the nucleon recoil energy $E_R$, the nucleus target mass $m_T$, and the nucleus-dark matter reduced mass $\\mu_{T\\chi}$. \nIn addition to the local dark matter density, the rate of dark matter events is \nproportional to the integrated weighted velocity function \n$g(v_{\\rm min}) \\equiv \\int_{v_{\\rm min}}^\\infty \\frac{f(v)}{v} dv $. This quantity is plotted in Figure \\ref{g_earth} in the Earth rest frame for each of our considered distributions. As each experiment has a different $v_{\\rm min}$ to which it is sensitive, each experiment probes different regions of $g(v_{\\rm min})$. Thus, while the degree of agreement between different experiments can be quantified in a relatively astrophysics-independent manner \\citep{Fox2011,DelNobile2013}, one's confidence in the extracted limits on the more fundamental dark matter parameters which enter into $d\\sigma/dE_R$ is limited by the uncertainties in $f(v)$ and $g(v_{\\rm min})$. \n\nThere is some tension between anomalous positive results from several direct detection experiments, and the null results of other experiments which should be sensitive to the putative signals. \nThe strongest limits are set by the LUX Collaboration \\citep{FirstLUXResults}, with many other collaborations setting competitive and complimentary limits.\\footnote{As this paper was being completed, LUX released an updated analysis with a larger data set and improved analysis techniques for the low-mass dark matter region \\cite{Akerib:2015rjg}. To calculate the effect of our simulated velocity distributions on these new results would require knowledge of the detector response under the new analysis. This has not yet been made public. Therefore, we continue to use the LUX data from \\citep{FirstLUXResults} in this work. The trends we observe can be reasonably extrapolated to the newest LUX bounds.} Heavy WIMP dark matter ($m_\\chi \\gtrsim 100$ GeV) has much stronger exclusion bounds from LUX when compared to the bounds on light dark matter, ($m_\\chi \\sim10$ GeV). The CoGeNT Collaboration \\citep{CoGeNT2013} has seen events above their background expectation and the DAMA/Libra Collaboration \\citep{DAMALIBRA2010} has observed an exceptionally strong modulation, signal each of which can be interpreted as originating from dark matter collisions, though such conclusions are in extreme tension with the non-observation of any signal by LUX.\n\n\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=2\\columnwidth]{g_earth_consistentlinear_3Panel_SPH_over_DMO.pdf}\n\\caption{Plots of the weighted velocity distribution integral $g(v_{\\rm min})$ in the Earth reference frame at the days of highest and lowest flux. Left: dark matter-only simulations (red).  Center: Baryonic simulations (red). We show also the SHM (solid black) and best fit Maxwellian to individual halos (dotted black), and the empirical fits following the functional form in \\citet{Mao2013I} (dashed green). Right: Ratio of SPH to dark matter-only $g(v_{\\rm min})$ in the Earth reference frame. The solid line is the ratio at the day of  maximum flux, and the dotted line is the ratio at the day of minimum flux.}\n\\label{g_earth}\n\\end{figure*}\n\nThese collaborations, like all others, assume the SHM in their analyses. As we have seen, this does not agree with dark matter velocity distributions found in simulations. As these collaborations are sensitive to different portions of the dark matter velocity distribution due to different target materials and detector sensitivities, it is not immediately clear if the tension between the positive and negative results may be a result of a non-Maxwellian velocity distribution. This has been addressed in the literature \\citep{Fox2011,DelNobile2013} by changing to a different parameter space, $\\eta$ vs.~$v_\\text{min}$, that clearly shows which regions of velocity-space different experiments are sensitive to, assuming a particular dark matter mass. The $\\eta$ parameter, equivalent to $g(v_\\text{min})$ up to normalization factors, defined as:\n\n", "index": 7, "text": "\\begin{align}\n    \\eta(v_{\\rm min}) \\equiv \\frac{ \\rho_0 \\sigma }{m_\\chi} \\int_{v_{\\text{min}}} \\frac{f(v)}{v} dv\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\eta(v_{\\rm min})\\equiv\\frac{\\rho_{0}\\sigma}{m_{\\chi}}\\int_{v_{%&#10;\\text{min}}}\\frac{f(v)}{v}dv\" display=\"inline\"><mrow><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>v</mi><mi>min</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≡</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>ρ</mi><mn>0</mn></msub><mo>⁢</mo><mi>σ</mi></mrow><msub><mi>m</mi><mi>χ</mi></msub></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>v</mi><mtext>min</mtext></msub></msub></mstyle><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mi>v</mi></mfrac></mstyle><mo>⁢</mo><mrow><mo>𝑑</mo><mi>v</mi></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}]