[{"file": "1601.06476.tex", "nexttext": "\nand $\\mathbf{M}(i,j)=1$, otherwise. In this formulation, $l_{cnv}$ and $h_{cnv}$ are lower and upper bounds that may be chosen by the user. These bounds determine what is deemed to be a significant CNV change. In our tests, we set $l_{cnv}=-1$ and $h_{cnv}=3$, although other options are clearly possible. It is worth pointing out that more conservative CNV thresholds tend to decrease coverage, while more relaxed CNV assumptions tend to decrease mutual exclusivity.\nBased on the procedure above, we arrive at one ``mutation'' matrix $\\mathbf{M}$ which we use instead of the matrices $\\mathbf{A}$ and $\\mathbf{C}$. \n\nFinally, let $\\mathbf{Z}\\in\\mathbb{R}^{n_g\\times n_p}$ be the matrix corresponding to $z$-scores of gene expression data: here, $\\mathbf{Z}(i,j)$ denotes the $z$-score of the expression of gene $i$ in sample $j$. More precisely, if the raw expression of gene $i$ in sample $j$ equals $x_{ij}$, then $\\mathbf{Z}(i,j)=\\frac{x_{ij-\\mu_{i}}}{\\sigma_i}$; $\\mu_i$ denotes the average expression of gene $i$ and $\\sigma_i$ denotes its standard deviation. \n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity and Coverage (ME-CO)}\\label{sec:MEC}\n\nThe idea behind our approach is to impose the mutual exclusivity constraint through the weights ${w^-}_e$ and coverage constraint through the weights ${w^+}_e$s. \n\nFor each gene (i.e., vertex) $u$, let $\\mathcal{S}(u)$ denote the set of patients in which $u$ is mutated. Note that we use the matrix $\\mathbf{M}$ to determine if a mutation in the gene exists, either due to sequence alteration or CNV. \nThen, for any $u,v\\in V(G)$, the negative weights are chosen according to\n\n", "itemtype": "equation", "pos": 18182, "prevtext": "\n\n\\title{\\Large\\sffamily\\bfseries A new correlation clustering method for cancer mutation analysis}\n\n{\\normalsize\n\\author[1,2,$\\dagger$]{\\sffamily Jack P. Hou}\n\\author[3,$\\dagger$]{\\sffamily Amin Emad}\n\\author[3]{\\sffamily Gregory J. Puleo}\n\\author[1,4,*]{\\sffamily Jian Ma}\n\\author[3,*]{\\sffamily Olgica Milenkovic}\n\\affil[1]{\\small \\sffamily Department of Bioengineering and Carl R. Woese Institute for Genomic Biology, University of Illinois at Urbana-Champaign}\n\\affil[2]{\\small \\sffamily Medical Scholars Program, University of Illinois at Urbana-Champaign}\n\\affil[3]{\\small \\sffamily Department of Electrical and Computer Engineering and Coordinated Science Lab, University of Illinois at Urbana-Champaign}\n\\affil[4]{\\small \\sffamily Present Affiliation: School of Computer Science, Carnegie Mellon University}\n\\affil[$\\dagger$]{\\small \\sffamily These authors contributed equally.}\n\\affil[*]{\\small \\sffamily Corresponding authors:\n\\href{mailto:jianma@cs.cmu.edu}{jianma@cs.cmu.edu} (J.M.) and \\href{mailto:milenkov@illinois.edu}{milenkov@illinois.edu} (O.M.)}\n\n\\date{\\vspace{-5ex}}\n\n\\maketitle\n\n\\begin{abstract} \n\\noindent Cancer genomes exhibit a large number of different alterations that affect many genes in a diverse manner. \nIt is widely believed that these alterations follow combinatorial patterns that have a strong connection with the underlying molecular interaction networks and functional pathways. A better understanding of the generative mechanisms behind the mutation rules and their influence on gene communities is of great importance for the process of driver mutations discovery and for identification of network modules related to cancer development and progression.\nWe developed a new method for cancer mutation pattern analysis based on a constrained form of correlation clustering. Correlation clustering is an agnostic learning method that can be used for general community detection problems in which the number of communities or their structure is not known beforehand.\nThe resulting algorithm, named C$^3$, leverages mutual exclusivity of mutations, patient coverage, and driver network concentration principles; it accepts as its input a user determined combination of heterogeneous patient data, such as that available from TCGA (including mutation, copy number, and gene expression information), and creates a large number of clusters containing mutually exclusive mutated genes in a particular type of cancer.\nThe cluster sizes may be required to obey some useful soft size constraints, without impacting the computational complexity of the algorithm. To test C$^3$, we performed a detailed analysis on TCGA breast cancer and glioblastoma data and showed that our algorithm outperforms the state-of-the-art CoMEt method in terms of discovering mutually exclusive gene modules and identifying driver genes.\nOur C$^3$ method represents a unique tool for efficient and reliable identification of  mutation patterns and driver pathways in large-scale cancer genomics studies.\n\\end{abstract}\n\n\\section{Introduction}\n\nRapid advances in high-throughput sequencing technologies have provided unique opportunities for analyzing large numbers of cancer genomes. \nHowever, the complexity of genomic alterations in cancer remains a challenge that has to be overcome in order to fully characterize the functional roles of various mutations. \nCancer genomes often exhibit a large number of different mutations that affect genes in diverse manners. \nBut the vast majority of these mutations do not have significant impact on tumorigenesis~\\citep{hanahan2011}. \nA central question in cancer genomics is how to distinguish ``driver'' mutations, which contribute to tumorigenesis, from functionally neutral ``passenger'' mutations. \nSuch driver mutations (e.g., point mutations or copy number changes) are of critical importance in elucidating key biological pathways perturbed in cells that eventually lead to cancer.\n\nMany computational methods have been developed to facilitate the discovery of driver mutations~\\citep{carter2009,dees2012,lawrence2013,gonzalez2012,manolakos2014camodi}. \nDue to the high level of inter-tumor heterogeneity, two patients with the same cancer may have vastly different drivers and most cancer mutations occur in very low frequency in the patient population.\nTherefore, approaches relying on simple recurrence or frequency of mutations do not work well in practice. \nRecently, pathway-based and network-based models have been shown to be effective not only in determining common driver mutations and mutation patterns, but also in pinpointing the key biological pathways and subnetworks affected by driver mutations ~\\citep{pe2011,ng2012,bashashati2012,paull2013,hou2014}.\nSuch methods have a unique advantage in so far that in addition to mutation analysis, they take into account gene interactions as an added source of prior knowledge.\n\nIn parallel, a number of methods have been proposed to identify driver pathways, i.e., groups of genes that may interact together in combinatorial patterns to promote tumorigenesis. \nThe authors of~(\\citealp{Ciriello12}) described a method called MEMo, and subsequently used it to show that mutually exclusive modules based on known networks can aid in determining groups of genes that contribute to tumorigenesis.\nThese gene groups, or modules, are jointly highly recurrent, have similar pathway impact in terms of biological processes, and their corresponding mutations tend to be mutually exclusive, meaning that very often only one gene in each gene group is mutated at a given time in any given patient. This mutual exclusivity rule in cancer pathways is supported by the observations that, in general, one mutated gene suffices to perturb the function of its corresponding pathway. Multiple mutations would require significantly higher energy investments on the part of cancer cells, and are hence selected against. \nDendrix~\\citep{vandin2012} (and later Multi-Dendrix~\\citep{Leiserson2013}) was developed to identify driver pathways {\\it de novo} using mutual exclusivity and coverage (recurrence) principles, without relying on known network information that has the potential to improve the discovery process of new modules. \nMore recently, CoMEt~\\citep{Leiserson2015} was proposed to address an inherent bias in Dendrix and Multi-Dendrix that resulted in high frequency mutations being significantly more likely to be included in mutually exclusive modules. \n\nHowever, while Dendrix, Multi-Dendrix and CoMEt have the ability to identify mutually exclusive modules {\\it de novo}, there still have significant limitations. \nThese methods are typically very inefficient when it comes to applying them on large-scale datasets with large parameter setting.\nAlso, some of these methods are randomized in nature and no guarantees exist that multiple runs of the methods will produce compatible results. Furthermore, almost all methods are able to identify only a small number of modules with limited number of genes, as cluster sizes are critical algorithmic parameters from the perspective of computational tractability.\n\nTo overcome these and other shortcomings of existing methods, we introduce a novel method called Cancer Correlation Clustering (C$^3$) to directly tackle the problems of integrating diverse sources of evidence regarding driver pattern behavior and eliminating computational bottlenecks associated with large cluster sizes or cluster numbers. C$^3$ uses an optimization framework specifically developed for the driver discovery task, where data is converted to a simple set of optimization weights that do not require the algorithm to change upon incorporation of new data sources. In addition to this flexibility, C$^3$ has low computational cost, and it allows for adding relevant problem constraints while retaining good theoretical performance guarantees. \n\nThe paper is organized as follows. A basic introduction of the principles of correlation clustering is provided in Section~\\ref{sec:approach}. Section~\\ref{sec:methods} contains a description of the weight computation methods, the algorithmic clustering approach based on the computed weights, and the evaluation criteria used to compare C$^3$ and CoMEt. Section~\\ref{sec:results} contains the main results of our analysis, contrasting the performance of C$^3$ and CoMEt on breast cancer and glioblastoma data. A discussion of our findings and concluding remarks are given in Section~\\ref{sec:discussion}. A rigorous mathematical performance analysis of C$^3$ may be found in the Supplementary Materials.\n\n\\section{Approach} \\label{sec:approach}\nThe basic idea behind the C$^3$ approach is \\emph{correlation clustering}, an agnostic learning technique first proposed in~\\citep{Bansal2004}. In the most basic form of the clustering model, one is given a set of objects and, for all or some pairs of objects, one is also given an assessment as to whether the objects are ``similar'' or ``dissimilar''. This information is described using a complete graph with labeled edges: each object is represented by a vertex of the graph, and the assessments are represented by edges labeled with either a ``+'' symbol, for similar objects, or a ``-'' symbol, for dissimilar objects. The goal is to partition the objects into clusters so that the edges within clusters are mostly positive and the edges between clusters are mostly negative. Unlike in many other clustering models, such as k-means~\\citep{Hartigan1979}, the number of clusters is not fixed ahead of time and finding the optimal number of clusters is part of the problem. \n\nThe similarity assessments need not be mutually consistent: for\nexample, if the graph contains a triangle with two positive edges and one negative edge, then we must either group the endpoints of the negative\nedge together, erroneously putting a negative edge inside a cluster, resulting in a\n``negative error'' or else we must group them separately, forcing one\nof the positive edges to erroneously go between clusters, resulting in a ``positive error''. When a perfect clustering is not possible, we seek an\n\\emph{optimal} clustering: one that minimizes the total number of\n``errors.'' This form of correlation clustering is known to be NP-hard, but depending on the graph topology, various constant or logarithmic approximation guarantees exist.\n\nThe authors of~\\citep{Bansal2004} also proposed a weighted version\nof the correlation-clustering problem, where the edges of the graph receive \\emph{weights} between $-1$ and $1$ rather than simply\nreceiving $+$ or $-$ labels: an edge with weight $x$ incurs cost\n$\\frac{1+x}{2}$ if it is placed between clusters and cost\n$\\frac{1-x}{2}$ if it is placed within a cluster. A more general \nweighted formulation was introduced in~\\citep{Charikar2003, Charikar2005}, and this is the formulation we subsequently consider. In this model, each edge $e$ is assigned two nonnegative weights, ${w^+}_e$ and ${w^-}_e$. A clustering incurs cost\n${w^+}_e$ if $e$ is placed between clusters, and incurs cost ${w^-}_e$\nif $e$ is placed within a cluster. \n\nIf no restrictions are placed on the weights ${w^+}_e$ and ${w^-}_e$,\nthen it is possible to have edges with ${w^+}_e = {w^-}_e = 0$; these\nedges are effectively absent from the graph, so there is no loss of\ngenerality in assuming that the graph is a complete graph. In order to arrive at problems that have efficient constant approximation algorithms, one needs to \nplace certain restrictions on ${w^+}_e$ and ${w^-}_e$. The \\emph{probability constraints} give a natural restriction on the edge weights ${w^+}_e + {w^-}_e = 1$ for every edge $e$. Another widely studied restriction is the \\emph{triangle inequality} restriction, where one requires ${w^-}_{uw} \\leq\n{w^-}_{uv} + {w^-}_{vw}$ for all distinct vertices $u,v$ and $w$. \n\nThe analytic approach pursued in this work operates on the following model: genes which show sufficiently large mutation prevalence in cancer patients represent vertices of the complete graph to be clustered. \nNote that in this work we only use the top 5\\% of genes ordered by mutation frequency. This equates to 170 genes in glioblastoma (GBM) and 130 genes in breast cancer (BRCA). The weights ${w^+}_e$ and ${w^-}_e$ of an edge $e$ connecting two genes $g_1$ and $g_2$ are weighted sums of the mutual exclusivity and coverage strength, as well as an adequately chosen measure of network distance and expression similarity. \n\nMore precisely, the negative weights ${w^-}_e$ are chosen to be relatively small if the endpoint genes describing the edge are deemed to be mutually exclusive in cancer patients. A small negative weight encourages placing mutually exclusive genes \\emph{within the same cluster}. The positive weights jointly depend on the coverage, network distance and expression correlation of the endpoint genes: the larger the joint coverage, co-expression and inverse of the network distance of the endpoint genes, the more likely they will end up in the same cluster. Precise mathematical formulations of the weight functions will be provided in the next section. \n\nTo control the size of the resulting clusters so as discourage uninformative singleton and giant clusters, we developed two new correlation clustering algorithms that use cluster sizes as problem parameters that may be chosen by the users. These cluster size bounds also allow for more accurate comparison with other methods which operate with inherent cluster size constraints. Notice that unlike in the aforementioned known methods, the cluster sizes have no bearing on the complexity of our algorithm nor on their overall approximation quality.\n\nThe driver discovery approaches closest to C$^3$ are Multi-Dendrix~\\citep{Leiserson2013} and CoMEt~\\citep{Leiserson2015}. Multi-Dendrix is an integer linear programming clustering algorithm that ensures that the genes within a cluster have mutation patterns that satisfy mutual exclusivity and coverage: for any two genes in a cluster, the number of patients in which these genes are mutated at the same time is relatively small; in addition, a large portion of the patients should have at least one mutation in each cluster. \nCoMEt uses a statistical score of mutation exclusive that conditions upon the frequency of each alteration, alleviating the inherent bias caused by frequently mutated genes.\nCompared to Multi-Dendrix, C$^3$ uses a \\emph{weighted} linear programming relaxation instead of an integer linear program which significantly improves the versatility and running time of the algorithm. Furthermore, the weights allow for straightforward incorporation of heterogeneous sources of evidence into the clustering method and the algorithm itself remains unchanged with the addition of new data. This flexibility comes at the cost of C$^3$ providing only an approximate solution. Nevertheless, given the inherently approximate nature of weight selection and parametrization of both algorithms, this does not appear to be a significant shortcoming. Also, empirical evaluations suggest that the approximation algorithms produce results very close to the optimal solution. Another advantage is that if one needs to change the combinatorial conditions that the clusters satisfy, Multi-Dendrix cannot be easily adapted, and a whole new algorithm needs to be developed. On the other hand, our algorithms are very flexible and most combinatorial patterns can be easily incorporated in the same algorithm, by simply changing the weights assigned to the edges. \n\n\\section{Methods} \\label{sec:methods}\n\nBefore rigorously describing our algorithmic methods, we introduce some relevant notation and explain how to estimate appropriate clustering weights based on available data. \n\n\\subsection{Clustering Weights}\n\nLet $G(V,E)$ be a complete graph, where $V(G)$ denotes the set of vertices and $E(G)$ denotes the set of edges of the graph $G$, respectively. The symbol $e\\in E(G)$ or $e=uv$ with $u,v\\in V(G)$ is used to denote a generic edge. Each edge is assigned a positive weight ${w^+}_e$ and a negative weight ${w^-}_e$. Recall the interpretation of these weights: for two distinct vertices $u,v\\in V(G)$, ${w^+}_{uv}$ is the cost of placing $u$ and $v$ in different clusters; consequently, by making the positive weight of an edge large, one can discourage placing the corresponding two genes into different clusters. Similarly, ${w^-}_{uv}$ is the cost of placing $u$ and $v$ in the same cluster, and hence making this weight large discourages placing the corresponding two genes into the same cluster. In the rest of this section, we will explore different ways of defining the weights ${w^-}_{uv}$ and ${w^+}_{uv}$; in order to avoid confusion between the different definitions, each weight we define will include a parenthetical abbreviation, so that, for example, ${w^+}(\\text{c})_{uv}$ will refer to the positive weight of $uv$ defined according to the coverage criteria, while ${w^+}(\\text{c,n})_{uv}$ will refer to the positive weight of $uv$ according to the coverage and network criteria.\n\nThe weights are computed using four types of datasets: gene alteration data, gene copy number variation (CNV), network information (NI), and gene expression (GE) data. Let $n_p$ denote the number of samples (i.e., patient genomes available) and let $n_g$ denote the number of genes. Also, let $\\mathbf{A}\\in\\{0,1\\}^{n_g\\times n_p}$ denote the matrix containing alteration data: if gene $i$ is altered in sample $j$, we set $\\mathbf{A}(i,j)=1$; otherwise, we set $\\mathbf{A}(i,j)=0$. Also, let $\\mathbf{C}$ be an $n_g\\times n_p$ matrix representing the CNV data: we set $\\mathbf{C}(i,j)=0$ if there is no change in the copy number of gene $i$ in sample $j$; otherwise, we choose an integer value reflecting the deviation of the CNV number from its baseline value. Hence, the CNV matrix contains both positive and negative values corresponding to the copy number changes of the corresponding gene in each sample. \n\nTo combine the CNV with alteration, we referred to the following method. Using the matrices $\\mathbf{A}$ and $\\mathbf{C}$, we formed a new binary matrix $\\mathbf{M}\\in\\{0,1\\}^{n_g\\times n_p}$ such that\n\n", "index": 1, "text": "\\begin{align}\\label{eq:cnv1}\n\\mathbf{M}(i,j)=0\\hspace{10pt}\\textnormal{if}\\hspace{10pt}\\mathbf{A}(i,j)=0\\  \\  \\textnormal{AND}\\  \\  l_{cnv}<\\mathbf{C}(i,j)<h_{cnv},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathbf{M}(i,j)=0\\hskip 10.0pt\\textnormal{if}\\hskip 10.0pt\\mathbf%&#10;{A}(i,j)=0\\ \\ \\textnormal{AND}\\ \\ l_{cnv}&lt;\\mathbf{C}(i,j)&lt;h_{cnv},\" display=\"inline\"><mrow><mrow><mrow><mrow><mi>𝐌</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>0</mn><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>if</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><mrow><mi>𝐀</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>0</mn><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>AND</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><msub><mi>l</mi><mrow><mi>c</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>v</mi></mrow></msub><mo>&lt;</mo><mrow><mi>𝐂</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>&lt;</mo><msub><mi>h</mi><mrow><mi>c</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhere $a$ is a scaling parameter to be chosen by the user. The intuition behind the use of the factor $a$ is that if $a$ is large (e.g., empirically, a value of $a>3$ is deemed large), the mutual exclusivity is enforced strictly, while if $a$ is small, (e.g. $a<3$), the genes in each cluster may not be highly mutually exclusive. Also, note that $0\\leq\\frac{|\\mathcal{S}(u)\\cap\\mathcal{S}(v)|}{\\min(|\\mathcal{S}(u)|,|\\mathcal{S}(v)|)}\\leq 1$. \n\nTo capture the coverage property through the positive weights, observe that if two genes increase the coverage significantly, their positive weight should be large so that they are encouraged to be placed in the same cluster. To determine the positive weights, we first form the set $\\mathcal{D}=\\{D(u,v)\\},$ for all $u,v\\in V(G)$, where $D(u,v)=|\\mathcal{S}(u)\\  \\Delta\\  \\mathcal{S}(v)|$ and $\\Delta$ denotes the symmetric difference of two sets. A large value for the symmetric difference $D(u,v)$ suggests that the vertices $u$ and $v$ should be placed in the same cluster, since they increase the coverage of the cluster. \n\nGiven the set $\\mathcal{D}$, we define $T(J)$ to be the $J$th percentile of the values in $\\mathcal{D}$. In all our runs, we used the default value of $J=95$, although this choice may be governed by the user as well. The positive weights are chosen according to:\n\n", "itemtype": "equation", "pos": 20015, "prevtext": "\nand $\\mathbf{M}(i,j)=1$, otherwise. In this formulation, $l_{cnv}$ and $h_{cnv}$ are lower and upper bounds that may be chosen by the user. These bounds determine what is deemed to be a significant CNV change. In our tests, we set $l_{cnv}=-1$ and $h_{cnv}=3$, although other options are clearly possible. It is worth pointing out that more conservative CNV thresholds tend to decrease coverage, while more relaxed CNV assumptions tend to decrease mutual exclusivity.\nBased on the procedure above, we arrive at one ``mutation'' matrix $\\mathbf{M}$ which we use instead of the matrices $\\mathbf{A}$ and $\\mathbf{C}$. \n\nFinally, let $\\mathbf{Z}\\in\\mathbb{R}^{n_g\\times n_p}$ be the matrix corresponding to $z$-scores of gene expression data: here, $\\mathbf{Z}(i,j)$ denotes the $z$-score of the expression of gene $i$ in sample $j$. More precisely, if the raw expression of gene $i$ in sample $j$ equals $x_{ij}$, then $\\mathbf{Z}(i,j)=\\frac{x_{ij-\\mu_{i}}}{\\sigma_i}$; $\\mu_i$ denotes the average expression of gene $i$ and $\\sigma_i$ denotes its standard deviation. \n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity and Coverage (ME-CO)}\\label{sec:MEC}\n\nThe idea behind our approach is to impose the mutual exclusivity constraint through the weights ${w^-}_e$ and coverage constraint through the weights ${w^+}_e$s. \n\nFor each gene (i.e., vertex) $u$, let $\\mathcal{S}(u)$ denote the set of patients in which $u$ is mutated. Note that we use the matrix $\\mathbf{M}$ to determine if a mutation in the gene exists, either due to sequence alteration or CNV. \nThen, for any $u,v\\in V(G)$, the negative weights are chosen according to\n\n", "index": 3, "text": "\\begin{align}\n{w^-}(\\text{e})_{u,v}=a\\times\\frac{|\\mathcal{S}(u)\\cap\\mathcal{S}(v)|}{\\min(|\\mathcal{S}(u)|,|\\mathcal{S}(v)|)},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{-}}(\\text{e})_{u,v}=a\\times\\frac{|\\mathcal{S}(u)\\cap\\mathcal{%&#10;S}(v)|}{\\min(|\\mathcal{S}(u)|,|\\mathcal{S}(v)|)},\" display=\"inline\"><mrow><mrow><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>,</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mi>a</mi><mo>×</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">|</mo><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∩</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mrow><mi>min</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mo>,</mo><mrow><mo stretchy=\"false\">|</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nNote that by this definition, $0\\leq{w^+}(c)_e\\leq 1$ for any $e\\in E(G)$. \n\nIn order to ensure that the positive and negative weights meet the constraints imposed by our algorithm needed to ensure a constant approximation guarantee, we require that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c})_{uv}\\geq 1$. This leads to the additional constraints:\n\n\n", "itemtype": "equation", "pos": 21492, "prevtext": "\nwhere $a$ is a scaling parameter to be chosen by the user. The intuition behind the use of the factor $a$ is that if $a$ is large (e.g., empirically, a value of $a>3$ is deemed large), the mutual exclusivity is enforced strictly, while if $a$ is small, (e.g. $a<3$), the genes in each cluster may not be highly mutually exclusive. Also, note that $0\\leq\\frac{|\\mathcal{S}(u)\\cap\\mathcal{S}(v)|}{\\min(|\\mathcal{S}(u)|,|\\mathcal{S}(v)|)}\\leq 1$. \n\nTo capture the coverage property through the positive weights, observe that if two genes increase the coverage significantly, their positive weight should be large so that they are encouraged to be placed in the same cluster. To determine the positive weights, we first form the set $\\mathcal{D}=\\{D(u,v)\\},$ for all $u,v\\in V(G)$, where $D(u,v)=|\\mathcal{S}(u)\\  \\Delta\\  \\mathcal{S}(v)|$ and $\\Delta$ denotes the symmetric difference of two sets. A large value for the symmetric difference $D(u,v)$ suggests that the vertices $u$ and $v$ should be placed in the same cluster, since they increase the coverage of the cluster. \n\nGiven the set $\\mathcal{D}$, we define $T(J)$ to be the $J$th percentile of the values in $\\mathcal{D}$. In all our runs, we used the default value of $J=95$, although this choice may be governed by the user as well. The positive weights are chosen according to:\n\n", "index": 5, "text": "\\begin{align}\n{w^+}(\\text{c})_{uv} &=\\left\\{\n\\begin{array}{ll} \n1,&\\text{if}\\  \\  \\  \\  D(u,v)>T(J)\\\\\n\\frac{1}{T(J)} \\times D(u,v)&\\text{otherwise.}\n\\end{array}\n\\right.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{c})_{uv}\" display=\"inline\"><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left\\{\\begin{array}[]{ll}1,&amp;\\text{if}\\ \\ \\ \\ D(u,v)&gt;T(J)\\\\&#10;\\frac{1}{T(J)}\\times D(u,v)&amp;\\text{otherwise.}\\end{array}\\right.\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo separator=\"true\">  </mo><mrow><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>×</mo><mi>D</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise.</mtext></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n\n\n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity, Coverage, and Network Information (NI-ME-CO)}\\label{sec:MENC} The comprehensive results of pan-cancer studies reported in a number of recent papers~(\\citealp{Leiserson2013},~\\citealp{PortaPardo2015},~\\citealp{Leiserson2015}, ~\\citealp{GarciaAlonso2014}) have revealed the important connection between network topology and cancer driver distribution patterns. More precisely, the effect of deleterious mutations on the phenotype may be suppressed through a particular configuration of the corresponding protein complexes, and at the same time, the strength of the effect of a mutation may be emphasized through another configuration. As an example, most of the variants observed in healthy individuals seem to appear at the periphery of the interactome, and they do not seem to influence network connectivity. In contrast, cancer driver somatic mutations tend to occur in central, internal regions of the interactome and within highly co-integrated components. \nIt appears that no previous attempts were made to more precisely quantify the network distances between driver variants, which prompted us to perform the following analysis. We first computed the pairwise (shortest) network distances between genes in a large pathway comprising $8,726$ genes from~\\citet{Ciriello12} via an implementation of the standard Dijkstra algorithm~\\citep{skiena1990dijkstra}. In this test, we randomly selected $1,000$ pairs in order to reduce the computational burden of running Dijkstra's algorithm $O(8726^2)$ times. By using the most complete known driver list from the Cancer Gene Census (CGC)~\\citep{cgc}, we computed the same distances for driver genes, this time for all pairs of genes. The resulting distribution of shortest paths is depicted in Fig.~\\ref{fig:driverdistance}. One can clearly observe that the average shortest distance between drivers is significantly smaller than the average shortest distance between two randomly selected genes. A permutation test confirms this observation, and we calculated a $p$-value of less than $0.001$.\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{C3-fig1.pdf} \n\\caption{Histogram of shortest distances between randomly selected genes and driver genes in the network.}\n\\label{fig:driverdistance}\n\\end{figure}\n\nThese findings suggest that when determining potential driver mutations, one should make use of network distance and connectivity information. This may be accomplished in our approach by adjusting the positive weight of edges connecting two genes: if both endpoint genes were to be drivers, they should be sufficiently central to a given pathway, close to other drivers or to each other. \n\nFor this purpose, we consider an undirected graph corresponding to the gene network, denoted by $G'$; in this graph, which is assumed to be known a priori and which in this work was retrieved from the KEGG Database, each vertex corresponds to a gene. The graph is not complete, but rather relatively sparse, and each edge represents an interaction between genes. As before, we let $n_p$ and $n_g=|V(G)|=|V(G')|$ denote the total number of patients and the total number of genes in our dataset, respectively. For each vertex $u\\in V(G')$, we let $\\mathcal{N}(u)$ denote the set of neighbors of $u$ and let $\\mathcal{N}'(u)=\\mathcal{N}(u)\\cup\\{u\\}$. The first step in assigning the positive weights is to determine the set $\\mathcal{F}=\\{f(u,v)\\}$, where for any pair of vertices $u,v\\in V(G')$, \n\n", "itemtype": "equation", "pos": 22040, "prevtext": "\nNote that by this definition, $0\\leq{w^+}(c)_e\\leq 1$ for any $e\\in E(G)$. \n\nIn order to ensure that the positive and negative weights meet the constraints imposed by our algorithm needed to ensure a constant approximation guarantee, we require that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c})_{uv}\\geq 1$. This leads to the additional constraints:\n\n\n", "index": 7, "text": "\\begin{align}\n&\\text{if}\\  \\  \\  {w^+}(\\text{c})_{uv}+{w^-}(\\text{e})_{uv}<1,\\\\\\nonumber\n&\\text{set} \\;\\,  {w^-}(\\text{e})_{uv}=\\frac{{w^-}_{uv}}{{w^+}(\\text{c})_{uv}+{w^-}(\\text{e})_{uv}},\\;\\,\n\\text{and} \\;\\;\\; {w^+}(\\text{c})_{uv}=1-{w^-}(\\text{e})_{uv}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{if}\\ \\ \\ {w^{+}}(\\text{c})_{uv}+{w^{-}}(\\text{e})_{uv}&lt;1,\" display=\"inline\"><mrow><mrow><mrow><mtext>if</mtext><mo mathvariant=\"italic\" separator=\"true\">   </mo><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>&lt;</mo><mn>1</mn></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{set}\\;\\,{w^{-}}(\\text{e})_{uv}=\\frac{{w^{-}}_{uv}}{{w^{+}}(%&#10;\\text{c})_{uv}+{w^{-}}(\\text{e})_{uv}},\\;\\,\\text{and}\\;\\;\\;{w^{+}}(\\text{c})_{%&#10;uv}=1-{w^{-}}(\\text{e})_{uv}.\" display=\"inline\"><mrow><mrow><mrow><mrow><mpadded width=\"+4.5pt\"><mtext>set</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mfrac></mstyle></mrow><mo rspace=\"7pt\">,</mo><mrow><mrow><mpadded width=\"+8.4pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nNote that $0\\leq f(u,v)\\leq 1$ for all $u,v$.\nA large value of $f(u,v)$ suggests that the genes $u$ and $v$ are well connected and likely to be involved in the same pathway~\\cite{Ciriello12}, and that the corresponding genes should be clustered together. \n\nGiven the set $\\mathcal{F}$, we define $T'(J')$ to be the $J'$th percentile of the values in $\\mathcal{F}$. For any $u,v\\in V(G)$, the positive weights are then chosen according to the following formula:\n\n", "itemtype": "equation", "pos": 25847, "prevtext": "\n\n\n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity, Coverage, and Network Information (NI-ME-CO)}\\label{sec:MENC} The comprehensive results of pan-cancer studies reported in a number of recent papers~(\\citealp{Leiserson2013},~\\citealp{PortaPardo2015},~\\citealp{Leiserson2015}, ~\\citealp{GarciaAlonso2014}) have revealed the important connection between network topology and cancer driver distribution patterns. More precisely, the effect of deleterious mutations on the phenotype may be suppressed through a particular configuration of the corresponding protein complexes, and at the same time, the strength of the effect of a mutation may be emphasized through another configuration. As an example, most of the variants observed in healthy individuals seem to appear at the periphery of the interactome, and they do not seem to influence network connectivity. In contrast, cancer driver somatic mutations tend to occur in central, internal regions of the interactome and within highly co-integrated components. \nIt appears that no previous attempts were made to more precisely quantify the network distances between driver variants, which prompted us to perform the following analysis. We first computed the pairwise (shortest) network distances between genes in a large pathway comprising $8,726$ genes from~\\citet{Ciriello12} via an implementation of the standard Dijkstra algorithm~\\citep{skiena1990dijkstra}. In this test, we randomly selected $1,000$ pairs in order to reduce the computational burden of running Dijkstra's algorithm $O(8726^2)$ times. By using the most complete known driver list from the Cancer Gene Census (CGC)~\\citep{cgc}, we computed the same distances for driver genes, this time for all pairs of genes. The resulting distribution of shortest paths is depicted in Fig.~\\ref{fig:driverdistance}. One can clearly observe that the average shortest distance between drivers is significantly smaller than the average shortest distance between two randomly selected genes. A permutation test confirms this observation, and we calculated a $p$-value of less than $0.001$.\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{C3-fig1.pdf} \n\\caption{Histogram of shortest distances between randomly selected genes and driver genes in the network.}\n\\label{fig:driverdistance}\n\\end{figure}\n\nThese findings suggest that when determining potential driver mutations, one should make use of network distance and connectivity information. This may be accomplished in our approach by adjusting the positive weight of edges connecting two genes: if both endpoint genes were to be drivers, they should be sufficiently central to a given pathway, close to other drivers or to each other. \n\nFor this purpose, we consider an undirected graph corresponding to the gene network, denoted by $G'$; in this graph, which is assumed to be known a priori and which in this work was retrieved from the KEGG Database, each vertex corresponds to a gene. The graph is not complete, but rather relatively sparse, and each edge represents an interaction between genes. As before, we let $n_p$ and $n_g=|V(G)|=|V(G')|$ denote the total number of patients and the total number of genes in our dataset, respectively. For each vertex $u\\in V(G')$, we let $\\mathcal{N}(u)$ denote the set of neighbors of $u$ and let $\\mathcal{N}'(u)=\\mathcal{N}(u)\\cup\\{u\\}$. The first step in assigning the positive weights is to determine the set $\\mathcal{F}=\\{f(u,v)\\}$, where for any pair of vertices $u,v\\in V(G')$, \n\n", "index": 9, "text": "\\begin{align}\nf(u,v)=\\frac{|\\mathcal{N}'(u)\\cap\\mathcal{N}'(v)|}{|\\mathcal{N}'(u)\\cup\\mathcal{N}'(v)|}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle f(u,v)=\\frac{|\\mathcal{N}^{\\prime}(u)\\cap\\mathcal{N}^{\\prime}(v)%&#10;|}{|\\mathcal{N}^{\\prime}(u)\\cup\\mathcal{N}^{\\prime}(v)|}.\" display=\"inline\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">|</mo><mrow><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∩</mo><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mrow><mo stretchy=\"false\">|</mo><mrow><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>∪</mo><mrow><msup><mi class=\"ltx_font_mathcaligraphic\">𝒩</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">|</mo></mrow></mfrac></mstyle></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhere $w_1,w_2 \\geq 0$, $w_1+w_2=1$, and as before, the coverage weight equals\n\n", "itemtype": "equation", "pos": 26424, "prevtext": "\nNote that $0\\leq f(u,v)\\leq 1$ for all $u,v$.\nA large value of $f(u,v)$ suggests that the genes $u$ and $v$ are well connected and likely to be involved in the same pathway~\\cite{Ciriello12}, and that the corresponding genes should be clustered together. \n\nGiven the set $\\mathcal{F}$, we define $T'(J')$ to be the $J'$th percentile of the values in $\\mathcal{F}$. For any $u,v\\in V(G)$, the positive weights are then chosen according to the following formula:\n\n", "index": 11, "text": "\\begin{align}\\label{arithmetic_mean}\n{w^+}(\\text{c,n})_{uv} =w_1\\,{w^+}(\\text{c})_{uv}+w_2\\,{w^+}(\\text{n})_{uv},  \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{c,n})_{uv}=w_{1}\\,{w^{+}}(\\text{c})_{uv}+w_{2}\\,{w^%&#10;{+}}(\\text{n})_{uv},\" display=\"inline\"><mrow><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>1</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>2</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nand the network weight equals\n\n", "itemtype": "equation", "pos": 26631, "prevtext": "\nwhere $w_1,w_2 \\geq 0$, $w_1+w_2=1$, and as before, the coverage weight equals\n\n", "index": 13, "text": "\\begin{align}\n{w^+}(\\text{c})_{uv} &=\\left\\{\n\\begin{array}{ll} \n1,&\\text{if}\\  \\  \\  \\  D(u,v)>T(J)\\\\\n\\frac{1}{T(J)} \\times D(u,v)&\\text{otherwise,}\n\\end{array}\n\\right.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{c})_{uv}\" display=\"inline\"><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left\\{\\begin{array}[]{ll}1,&amp;\\text{if}\\ \\ \\ \\ D(u,v)&gt;T(J)\\\\&#10;\\frac{1}{T(J)}\\times D(u,v)&amp;\\text{otherwise,}\\end{array}\\right.\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo separator=\"true\">  </mo><mrow><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>×</mo><mi>D</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise,</mtext></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nAgain, in order to ensure that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c,n})_{uv}\\geq 1$, we add the additional constraints\n\n", "itemtype": "equation", "pos": 26842, "prevtext": "\nand the network weight equals\n\n", "index": 15, "text": "\\begin{align}\n{w^+}(\\text{n})_{uv} &=\\left\\{\n\\begin{array}{ll} \n1,&\\text{if}\\  \\  \\  \\  f(u,v)>T'(J')\\\\\n\\frac{1}{T'(J')} \\times f(u,v)&\\text{otherwise.}\n\\end{array}\n\\right.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{n})_{uv}\" display=\"inline\"><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left\\{\\begin{array}[]{ll}1,&amp;\\text{if}\\ \\ \\ \\ f(u,v)&gt;T^{\\prime}(%&#10;J^{\\prime})\\\\&#10;\\frac{1}{T^{\\prime}(J^{\\prime})}\\times f(u,v)&amp;\\text{otherwise.}\\end{array}\\right.\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo separator=\"true\">  </mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><msup><mi>T</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>J</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><msup><mi>T</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>J</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>×</mo><mi>f</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise.</mtext></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nThe weights $w_1,w_2$ may be chosen in such a way as to emphasize the importance of either coverage or network information. We suggest using $w_1=w_2=1/2$ in a coverage/network only test, although our analysis reveals that emphasizing one criterion over the other offers improved algorithm performance on some datasets.\n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity, Coverage, and Gene Expression Data (EX-ME-CO)}\\label{sec:EXMENC}\n\nSimilar to the case of network information, expression data may be incorporated through the positive weights, using the assumption that coexpressed genes may be involved in the same function or cancer pathway. Hence, highly coexpressed genes should be encouraged to cluster together.\n\nTo explain how to incorporate gene expression data into the clustering procedure, assume that $\\mathbf{z}(u)$ and $\\mathbf{z}(v)$ denote the vectors of time-evolving expression values corresponding to genes $u$ and $v$, respectively. The first step in assigning the positive weights is to determine the set $\\mathcal{G}=\\{g(u,v)\\}$, where for every pair of genes $u,v$, \n\n", "itemtype": "equation", "pos": 27168, "prevtext": "\nAgain, in order to ensure that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c,n})_{uv}\\geq 1$, we add the additional constraints\n\n", "index": 17, "text": "\\begin{align}\n&\\text{if}\\  \\  \\  \\  {w^+}(\\text{c,n})_{uv}+{w^-}(\\text{e})_{uv}<1,\\\\\\nonumber\n&\\text{set}\\,\\,  {w^-}(\\text{e})_{uv}=\\frac{{w^-}(\\text{e})_{uv}}{{w^+}(\\text{c,n})_{uv}+{w^-}(\\text{e})_{uv}},\\,\n\\text{and}\\;\\, {w^+}(\\text{c,n})_{uv}=1-{w^-}(\\text{e})_{uv}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{if}\\ \\ \\ \\ {w^{+}}(\\text{c,n})_{uv}+{w^{-}}(\\text{e})_{uv}&lt;1,\" display=\"inline\"><mrow><mrow><mrow><mtext>if</mtext><mo mathvariant=\"italic\" separator=\"true\">  </mo><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>&lt;</mo><mn>1</mn></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{set}\\,\\,{w^{-}}(\\text{e})_{uv}=\\frac{{w^{-}}(\\text{e})_{uv}%&#10;}{{w^{+}}(\\text{c,n})_{uv}+{w^{-}}(\\text{e})_{uv}},\\,\\text{and}\\;\\,{w^{+}}(%&#10;\\text{c,n})_{uv}=1-{w^{-}}(\\text{e})_{uv}.\" display=\"inline\"><mrow><mrow><mrow><mrow><mpadded width=\"+3.4pt\"><mtext>set</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mfrac></mstyle></mrow><mo rspace=\"4.2pt\">,</mo><mrow><mrow><mpadded width=\"+4.5pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nHere, $\\langle \\mathbf{a},\\mathbf{b} \\rangle$ denotes the classical inner product of the vectors $\\mathbf{a}$ and $\\mathbf{b}$, while $||\\mathbf{a}||$ stands for the $\\ell_2$ norm. A large value for $g(u,v)$ indicates that the expression vectors of $u$ and $v$ are highly correlated and hence should be clustered together. Also, note that $0\\leq g(u,v)\\leq 1$ for all $u$ and $v$. \n\nGiven the set $\\mathcal{G}$, we let $T''(J'')$ denote the $J''$th percentile of the values in $\\mathcal{G}$. For any $u,v\\in V(G)$, the positive weights are chosen according to the following formula:\n\n", "itemtype": "equation", "pos": 28568, "prevtext": "\nThe weights $w_1,w_2$ may be chosen in such a way as to emphasize the importance of either coverage or network information. We suggest using $w_1=w_2=1/2$ in a coverage/network only test, although our analysis reveals that emphasizing one criterion over the other offers improved algorithm performance on some datasets.\n\n\n\\subsubsection{Clustering Weights Determined Based on Mutual Exclusivity, Coverage, and Gene Expression Data (EX-ME-CO)}\\label{sec:EXMENC}\n\nSimilar to the case of network information, expression data may be incorporated through the positive weights, using the assumption that coexpressed genes may be involved in the same function or cancer pathway. Hence, highly coexpressed genes should be encouraged to cluster together.\n\nTo explain how to incorporate gene expression data into the clustering procedure, assume that $\\mathbf{z}(u)$ and $\\mathbf{z}(v)$ denote the vectors of time-evolving expression values corresponding to genes $u$ and $v$, respectively. The first step in assigning the positive weights is to determine the set $\\mathcal{G}=\\{g(u,v)\\}$, where for every pair of genes $u,v$, \n\n", "index": 19, "text": "\\begin{align}\ng(u,v)=\\frac{|\\langle\\mathbf{z}(u),\\mathbf{z}(v)\\rangle|}{||\\mathbf{z}(u)||\\  ||\\mathbf{z}(v)||}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle g(u,v)=\\frac{|\\langle\\mathbf{z}(u),\\mathbf{z}(v)\\rangle|}{||%&#10;\\mathbf{z}(u)||\\ ||\\mathbf{z}(v)||}.\" display=\"inline\"><mrow><mrow><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">|</mo><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi>𝐳</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mrow><mi>𝐳</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo stretchy=\"false\">|</mo></mrow><mrow><mrow><mo fence=\"true\">||</mo><mrow><mi>𝐳</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo fence=\"true\">||</mo></mrow><mo>⁢</mo><mrow><mo fence=\"true\">||</mo><mrow><mi>𝐳</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo fence=\"true\">||</mo></mrow></mrow></mfrac></mstyle></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhere $w_1,w_2 \\geq 0$, $w_1+w_2=1$, and\n\n", "itemtype": "equation", "pos": 29275, "prevtext": "\nHere, $\\langle \\mathbf{a},\\mathbf{b} \\rangle$ denotes the classical inner product of the vectors $\\mathbf{a}$ and $\\mathbf{b}$, while $||\\mathbf{a}||$ stands for the $\\ell_2$ norm. A large value for $g(u,v)$ indicates that the expression vectors of $u$ and $v$ are highly correlated and hence should be clustered together. Also, note that $0\\leq g(u,v)\\leq 1$ for all $u$ and $v$. \n\nGiven the set $\\mathcal{G}$, we let $T''(J'')$ denote the $J''$th percentile of the values in $\\mathcal{G}$. For any $u,v\\in V(G)$, the positive weights are chosen according to the following formula:\n\n", "index": 21, "text": "\\begin{align}\\label{arithmetic_mean}\n{w^+}(\\text{c,x})_{uv} =w_1\\,{w^+}(\\text{c})_{uv}+w_2\\,{w^+}(\\text{x})_{uv},  \n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{c,x})_{uv}=w_{1}\\,{w^{+}}(\\text{c})_{uv}+w_{2}\\,{w^%&#10;{+}}(\\text{x})_{uv},\" display=\"inline\"><mrow><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>1</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>2</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nand the network weight equals\n\n", "itemtype": "equation", "pos": 26631, "prevtext": "\nwhere $w_1,w_2 \\geq 0$, $w_1+w_2=1$, and as before, the coverage weight equals\n\n", "index": 13, "text": "\\begin{align}\n{w^+}(\\text{c})_{uv} &=\\left\\{\n\\begin{array}{ll} \n1,&\\text{if}\\  \\  \\  \\  D(u,v)>T(J)\\\\\n\\frac{1}{T(J)} \\times D(u,v)&\\text{otherwise,}\n\\end{array}\n\\right.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{c})_{uv}\" display=\"inline\"><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left\\{\\begin{array}[]{ll}1,&amp;\\text{if}\\ \\ \\ \\ D(u,v)&gt;T(J)\\\\&#10;\\frac{1}{T(J)}\\times D(u,v)&amp;\\text{otherwise,}\\end{array}\\right.\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo separator=\"true\">  </mo><mrow><mi>D</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>×</mo><mi>D</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise,</mtext></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nHence, all the conditions are satisfied for the weights, except possibly the third one. In order to make sure that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c,x})_{uv}\\geq 1$, we include an additional condition that \n\n", "itemtype": "equation", "pos": 29629, "prevtext": "\nand\n\n", "index": 25, "text": "\\begin{align}\n{w^+}(\\text{x})_{uv} &=\\left\\{\n\\begin{array}{ll} \n1,&\\text{if}\\  \\  \\  \\  g(u,v)>T''(J'')\\\\\n\\frac{1}{T''(J'')} \\times g(u,v)&\\text{otherwise.}\n\\end{array}\n\\right.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}(\\text{x})_{uv}\" display=\"inline\"><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\left\\{\\begin{array}[]{ll}1,&amp;\\text{if}\\ \\ \\ \\ g(u,v)&gt;T^{\\prime%&#10;\\prime}(J^{\\prime\\prime})\\\\&#10;\\frac{1}{T^{\\prime\\prime}(J^{\\prime\\prime})}\\times g(u,v)&amp;\\text{otherwise.}%&#10;\\end{array}\\right.\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mn>1</mn><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mtext>if</mtext><mo separator=\"true\">  </mo><mrow><mi>g</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>&gt;</mo><mrow><msup><mi>T</mi><mi>′′</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>J</mi><mi>′′</mi></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><msup><mi>T</mi><mi>′′</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>J</mi><mi>′′</mi></msup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mstyle><mo>×</mo><mi>g</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>u</mi><mo>,</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"left\"><mtext>otherwise.</mtext></mtd></mtr></mtable><mi/></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n\nNote that other combinations of datasets may be used, with appropriate changes in the weights. For example, incorporating coverage, network information as well as expression information into a positive weight may be accomplished by setting\n\n", "itemtype": "equation", "pos": 30050, "prevtext": "\nHence, all the conditions are satisfied for the weights, except possibly the third one. In order to make sure that for all $u,v\\in V(G)$, ${w^-}(\\text{e})_{uv}+{w^+}(\\text{c,x})_{uv}\\geq 1$, we include an additional condition that \n\n", "index": 27, "text": "\\begin{align}\n&\\text{if}\\;  {w^+}(\\text{c,x})_{uv}+{w^-}(\\text{e})_{uv}<1,\\\\\\nonumber\n&\\text{set}\\,{w^-}(\\text{e})_{uv}=\\frac{{w^-}(\\text{e})_{uv}}{{w^+}(\\text{c,x})_{uv}+{w^-}(\\text{e})_{uv}},\\,\n\\text{and}\\, {w^+}(\\text{c,x})_{uv}=1-{w^-}(\\text{e})_{uv}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{if}\\;{w^{+}}(\\text{c,x})_{uv}+{w^{-}}(\\text{e})_{uv}&lt;1,\" display=\"inline\"><mrow><mrow><mrow><mrow><mpadded width=\"+2.8pt\"><mtext>if</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow><mo>&lt;</mo><mn>1</mn></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex3.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\text{set}\\,{w^{-}}(\\text{e})_{uv}=\\frac{{w^{-}}(\\text{e})_{uv}}{%&#10;{w^{+}}(\\text{c,x})_{uv}+{w^{-}}(\\text{e})_{uv}},\\,\\text{and}\\,{w^{+}}(\\text{c%&#10;,x})_{uv}=1-{w^{-}}(\\text{e})_{uv}.\" display=\"inline\"><mrow><mrow><mrow><mrow><mpadded width=\"+1.7pt\"><mtext>set</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mfrac></mstyle></mrow><mo rspace=\"4.2pt\">,</mo><mrow><mrow><mpadded width=\"+1.7pt\"><mtext>and</mtext></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><msup><mi>w</mi><mo>-</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>e</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhere $w_1,w_2,w_3 \\geq 0$, $w_1+w_2+w_3=1$.\n\n\\subsection{Clustering Algorithms}\n\nThe bounded cluster size correlation clustering problem for driver gene inference may be formulated as follows. Let $K$ be a ``hard'' bound on the size of the driver clusters, and let the positive ${w^+}$ and negative weights ${w^-}$ be chosen according to a desired combination of datasets, as described in the previous section. The optimum clustering may be found by solving the integer linear program (ILP) below.\n\n\n", "itemtype": "equation", "pos": 30559, "prevtext": "\n\nNote that other combinations of datasets may be used, with appropriate changes in the weights. For example, incorporating coverage, network information as well as expression information into a positive weight may be accomplished by setting\n\n", "index": 29, "text": "\\begin{equation}\n{w^+}(\\text{c,n,x})_{uv}=w_1\\, {w^+}(\\text{c})_{uv}+w_2\\, {w^+}(\\text{n})_{uv}+w_3\\, {w^+}(\\text{x})_{uv},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"{w^{+}}(\\text{c,n,x})_{uv}=w_{1}\\,{w^{+}}(\\text{c})_{uv}+w_{2}\\,{w^{+}}(\\text{%&#10;n})_{uv}+w_{3}\\,{w^{+}}(\\text{x})_{uv},\" display=\"block\"><mrow><mrow><mrow><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c,n,x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>1</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>c</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>2</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>n</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mpadded width=\"+1.7pt\"><msub><mi>w</mi><mn>3</mn></msub></mpadded><mo>⁢</mo><msup><mi>w</mi><mo>+</mo></msup><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">(</mo><mtext>x</mtext><mo stretchy=\"false\">)</mo></mrow><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n\nIn this formulation, and for a fixed edge $e=uv$, $x_{uv}=1$ implies that $u$ and $v$ should belong to different clusters and $x_{uv}=0$ implies that the two vertices should belong to the same cluster. Note that the triangle inequality \\eqref{triangle1} ensures that if $u$ and $z$ are in the same cluster and $z$ and $v$ are in the same cluster, then $u$ and $v$ are also in the same cluster. Any clustering of the vertices can be described using the variables $x_e$. For a fixed clustering, the objective function is the cost associated with that clustering. \n\nSolving the ILP is NP-hard. We hence relax the problem by changing the integer constraint $x_{e} \\in \\{0,1\\}$ to an interval constraint $x_{e} \\in [0,1]$. This relaxation leads to a classical LP, the solution of which may be fractional. To obtain a valid clustering, the fractional solutions have to be subsequently \\emph{rounded} to produce integer solutions. Unfortunately, known rounding algorithms~(\\citealp{Puleo15}) for this problem tend to produce small clusters, often as small as single-vertex clusters. For our study, we hence slightly modify the LP by removing the cluster size constraint~(\\ref{int1}), which we move directly to the rounding procedure as described in Algorithm~\\ref{rounding}.   \n\n\\begin{algorithm}\n\\caption{}\n\\label{rounding}  \n\\begin{algorithmic}\n\\STATE\\textbf{Input:} $\\{x_e\\}_{e\\in E(G)}$, $\\alpha$ and $K$\n\\STATE{Let $S = V(G)$.}\n\\WHILE{$S \\neq \\emptyset$}\n\\STATE{Let the ``pivot vertex'' $u$ be an arbitrary element of $S$.}\n\\STATE{Let $T = \\{w \\in S-\\{u\\} {\\colon\\,} x_{uw} \\leq \\alpha\\}$.}\n\\IF{$\\sum_{w \\in T}x_{uw} \\geq \\alpha\\left\\lvert{{T}}\\right\\rvert/2$}\n\\STATE{Output the singleton cluster $\\{u\\}$.}\n\\STATE{Let $S = S-\\{u\\}$.}\n\\ELSIF{$|T|\\leq K$}\n\\STATE{Output the cluster $\\{u\\} \\cup T$.}\n\\STATE{Let $S = S - (\\{u\\} \\cup T)$.}\n\\ELSE\n\\STATE{Partition $T$ as $T = T'_0 \\cup T_1 \\cup \\cdots \\cup T_p$, where\n    $\\left\\lvert{{T'_0}}\\right\\rvert = K$ and each $\\left\\lvert{{T_i}}\\right\\rvert = K+1$ for $0<i< p$ and $\\left\\lvert{{T_p}}\\right\\rvert \\leq K+1$.}\n\\STATE{Let $T_0 = \\{u\\} \\cup T'_0$.}\n\\STATE{Output the clusters $T_0$, $T_1,T_2,\\dots,T_p$.}\n\\STATE{Let $S = S - (\\{u\\} \\cup T)$.}\n\\ENDIF\n\\ENDWHILE  \n\\end{algorithmic}\n\\end{algorithm}\n\nAlgorithm~\\ref{rounding} is closely based on the rounding algorithm described in ~\\citet{Charikar2003,Charikar2005}.\nThe idea behind the rounding algorithm is to pivot on one vertex, examine its closest neighbors, where closeness is governed by the value of the output variables $x_e$ of the LP, and partition large neighborhoods if needed to get clusters of size at most $K+1$. In the Appendix of the Supplementary Materials, we prove that the LP and Rounding Algorithm~\\ref{rounding} provides a $9$-approximation for the ILP problem, given that the parameter $\\alpha$ is set to $2/7$ and given that the weights obey the following constraints:\n\\begin{itemize}\n\\item ${w^+}_e \\leq 1$ for every edge $e$, and\n\\item ${w^+}_e + {w^-}_e \\geq 1$ for every edge $e$.\n\\end{itemize}\nThe above inequalities were addressed in the weight selection process through normalization, as described in the previous section.\n\n\\subsection{Evaluation methods}\\label{sec:evaluation}\n\nWe evaluated the performance of both C$^3$ and CoMEt in terms of their ability to detect \\emph{mutually exclusive, high-coverage, and biologically relevant gene clusters}. \nWe ran both methods using mutation and CNV data collected from TCGA, pertaining to breast cancer (BRCA)~\\citep{TCGA2012} and glioblastoma (GBM)~\\citep{GBM}. In addition to GBM and BRCA, we also considered kidney cancer (KIRC) and ovarian cancer (OV), but the available patient data appeared limited at this stage to allow for statistically significant and comprehensive results. \nWe accessed the TCGA provisional data using the cBioPortal platform~\\citep{cbioportal} on August 14, 2015. \nWe ran both methods using the same alteration dataset. \nWe evaluated both point mutations and indels, and for CNVs, we used the GISTIC thresholds~\\citep{Mermel2011} of -1 and 3 as our cut-offs. \nTo focus on mutations with high frequency, we only selected genes in the top $95$ percentile of alteration frequencies, thereby obtaining $130$ genes spanning $959$ patient samples in BRCA and $170$ genes spanning $291$ patient samples in GBM.\n\nTo test the effects of cluster sizes and the quality of our results, we ran both C$^3$ and CoMEt to find clusters of sizes upper bounded by $5$, $6$, $7$, $10$, and $15$.\nCoMEt is naturally designed to discover the ``most'' mutually exclusive gene sets. Due to the fact that correlation clustering will cluster all genes in a dataset, we only compared the top ten most mutually exclusive gene sets generated by C$^3$ with those of CoMEt.\n\nWe ran CoMEt with $1,000$ iterations each and $3$ initialization points to ensure both timely and consistent runs. \nFor C$^3$, we ran the C$^3$ clustering method for all combinations of weights $w_1,w_2,w_3 \\in \\{{0,0.25,0.5,0.75,1\\}}$ that satisfy $w_1+w_2+w_3=1$, but selected to report only results for the weight parameters $w_1=0.167$ (coverage), $w_2=0.333$ (network information) and $w_3=0.333$ (expression data). We observe that the choice of the weights may be completely governed by the user, and that the increase in one weight may produce better results in one performance category while reducing the performance in another category. Our choice of high weights for expression and network information was governed by the need to increase the ability of the C$^3$ algorithm to detect biologically significant clusters. Furthermore, the \\emph{patient coverage} criteria appears to be less relevant than \\emph{pathway coverage} and some other coverage properties that have not been explicitly investigated in the literature. \nWe used four statistical methods to assess the performance of the algorithms which reflect both the statistical and biological significance of the clusters found. \n\n\\textbf{Mutual Exclusivity.} To evaluate the degree of mutual exclusivity in a cluster, we performed a Fisher Exact Test~\\citep{fisher1922mathematical} for each pair of genes in the cluster. The Fisher Exact Test uses the hypergeometric distribution to calculate the probability of observing a $2 \\times 2$ contingency table of $n$ total samples, with $a$ samples that has an alteration in two genes (say, $g_i$ and $g_j$), $b$ samples with an alteration in gene $g_i$ only, and $c$ samples with an alteration in gene $g_j$ only. If $d$ is the number of samples with no alteration in either gene, then the probability of co-mutation is evaluated according to\n\n", "itemtype": "equation", "pos": 31198, "prevtext": "\nwhere $w_1,w_2,w_3 \\geq 0$, $w_1+w_2+w_3=1$.\n\n\\subsection{Clustering Algorithms}\n\nThe bounded cluster size correlation clustering problem for driver gene inference may be formulated as follows. Let $K$ be a ``hard'' bound on the size of the driver clusters, and let the positive ${w^+}$ and negative weights ${w^-}$ be chosen according to a desired combination of datasets, as described in the previous section. The optimum clustering may be found by solving the integer linear program (ILP) below.\n\n\n", "index": 31, "text": "\\begin{align}\\label{obj1}\n    & \\underset{x}{\\text{minimize}}\n    & & \\sum_{e \\in E(G)}({w^+}_e x_e + {w^-}_e (1-x_e)) \n    \\\\\\label{triangle1}\n    & \\text{subject to}\n    & & x_{uv} \\leq x_{uz} + x_{zv} \\;\\;\\; {\\text{(for all distinct $u,v,z \\in V(G)$)}} & \\\\\n    &&&  \\sum_{v \\neq u}(1 - x_{uv}) \\leq K \\;\\;\\; {\\text{(for all $u \\in V(G)$)}} & \\\\\\label{int1}\n    &&&  x_{e} \\in \\{0,1\\} \\;\\;\\; {\\text{(for all $e \\in E(G)$)}}. &\n  \\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\underset{x}{\\text{minimize}}\" display=\"inline\"><munder accentunder=\"true\"><mtext>minimize</mtext><mo>𝑥</mo></munder></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{e\\in E(G)}({w^{+}}_{e}x_{e}+{w^{-}}_{e}(1-x_{e}))\" display=\"inline\"><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>e</mi><mo>∈</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mi>e</mi><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mi>e</mi></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mi>e</mi><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mi>e</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle x_{uv}\\leq x_{uz}+x_{zv}\\;\\;\\;{\\text{(for all distinct $u,v,z\\in&#10;V%&#10;(G)$)}}\" display=\"inline\"><mrow><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub><mo>≤</mo><mrow><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>+</mo><mrow><mpadded width=\"+8.4pt\"><msub><mi>x</mi><mrow><mi>z</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mpadded><mo>⁢</mo><mrow><mtext>(for all distinct </mtext><mrow><mrow><mi>u</mi><mo>,</mo><mi>v</mi><mo>,</mo><mi>z</mi></mrow><mo>∈</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mtext>)</mtext></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{v\\neq u}(1-x_{uv})\\leq K\\;\\;\\;{\\text{(for all $u\\in V(G)$)}}\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>≠</mo><mi>u</mi></mrow></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≤</mo><mrow><mpadded width=\"+8.4pt\"><mi>K</mi></mpadded><mo>⁢</mo><mrow><mtext>(for all </mtext><mrow><mi>u</mi><mo>∈</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mtext>)</mtext></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle x_{e}\\in\\{0,1\\}\\;\\;\\;{\\text{(for all $e\\in E(G)$)}}.\" display=\"inline\"><mrow><mrow><msub><mi>x</mi><mi>e</mi></msub><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mn>0</mn><mo>,</mo><mn>1</mn><mo rspace=\"10.9pt\" stretchy=\"false\">}</mo></mrow><mo>⁢</mo><mrow><mtext>(for all </mtext><mrow><mi>e</mi><mo>∈</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mtext>)</mtext></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nWe evaluated the overall exclusivity of a cluster as the median value of each pairwise test for each pair of genes $g_i,g_j$ in the network. The pairwise Fisher's method has also been used by Mutex suite to establish mutual exclusivity~\\citep{Bahur2015}. However, because in our context the Fisher Exact Test is used as an evaluation rather than discovery tool, we used the median pairwise $p$-value rather than the maximum $p$-value to get a better sense of the overall exclusivity of genes in a cluster. It is also important to note that while CoMEt has an built-in method that generalizes the exclusivity test to $2^k$ contingency table for a cluster size $k$, the exponential size of their test set makes evaluation for large cluster sizes computationally impractical. An alternative test for overall mutual exclusivity is a permutation test, as implemented by MEMo, which compares the exclusivity of a gene set by sampling random gene sets and comparing the patients with multiple alterations.\n\n\\textbf{Coverage.} To compare and evaluate the overall coverage of a cluster found by C$^3$ or CoMEt, we calculated the proportion of patients with at least one alteration in a gene belonging to the given cluster.\n\n\\textbf{Network Clustering.} We also performed a pathway analysis for the potential drivers. As pointed out in the previous section, driver genes tend to be, on average, closer to each other in a pathway compared to randomly selected genes. Using this dogma, we calculated the average pairwise distance between each each pair of genes $g_i,g_j$ within a discovered cluster using Dijkstra's Algorithm. As before, our tests were performed on 8726 genes from~\\citep{Ciriello12}.\n\n\n\\textbf{Biological Significance.} In addition to testing the performance of the algorithm with respect to mutual exclusivity and coverage, we also investigated the biological significance of the C$^3$ and CoMEt methods from the perspective of gene discovery and pathway analysis. Although there is no overarching gold standard to determine biological significance, a commonly accepted metric employed by MEMo, Dendrix, Mutex, CoMEt and other similar tools is to count the number of known driver genes found within \\emph{the best clusters} according to the mutual exclusivity principle. These clusters usually contain several known driver genes. To determine the driver gene-based biological significance, we calculated the proportion of drivers found in the ten most mutually-exclusive C$^3$ and CoMEt clusters using a comprehensive, curated list of known drivers from the Cancer Gene Census~\\citep{cgc}.\n\nIt is important to point out that while the four benchmarks we define are a reliable way to test the performance of CoMEt and C$^3$, no perfect benchmark exists for detecting mutually exclusive and biologically significant genes clusters. As with many previous methods regarding this topic, the criteria are in a sense circular in that some of the same parameters that we maximize are the parameters that we use to evaluate the method. This is the reason why we use multiple benchmarks to evaluate the method.\n\n\\section{Results}\\label{sec:results}\nIn what follows, we demonstrate that C$^3$ outperforms CoMEt in almost all of the aforementioned benchmarking criteria. As a rule of thumb, C$^3$ can be made\nto outperform CoMEt \\emph{in any chosen single criteria or pairs of criteria} by adjusting the weights appropriately. This observation follows from that fact that the weights trade off the strengths of different modeling assumptions. We supplement our statistical analysis with a discussion of the biological relevance of our findings, and explore the role of the new potential drivers found by C$^3$ within their driver gene communities. In particular, we discuss the significance of large mutually exclusive clusters that cannot be recovered by other methods. Recall that we restrict our attention to the ten best performing clusters according to mutual exclusivity, as this approach was used in the original evaluation process of the CoMEt algorithm.\n\n\n\\begin{figure*}[!tpb]\n\\begin{center}\n\\includegraphics[width=1\\textwidth]{C3-fig2.pdf} \n\\end{center}\n\\caption{A comparative analysis of C$^3$ (Red) and CoMEt (Blue) based on four evaluation criteria. We used five cluster sizes ($5,6,7,10,$ and $15$) that index the x-axis in each benchmark test. \n\\textbf{(A)} depicts the results based on the driver gene evaluation criteria. The y-axis represents the proportion of drivers found by each method, contained within the best ten  clusters found. The purple line represents the expected value of drivers detected if clusters are randomly selected. \n\\textbf{(B)} shows the pairwise mutual exclusivity of each run. The y-axis represents the negative log transform of the mutual exclusive p-value such that larger values are more mutually exclusive than smaller ones. \nThe boxplots illustrate the distribution of exclusivity results concerning each of the top ten individual clusters for C$^3$ and CoMEt. \n\\textbf{(C)} shows the distribution of coverage, measured by proportion of samples with at least one alteration in a given cluster (the y-axis). The boxplot illustrates the distribution of coverage results for individual top ten cluster results. \n\\textbf{(D)} includes the network connectivity results of C$^3$ and CoMEt. The y-axis measures the average pairwise network distance between all genes in a cluster, and the distribution of each cluster is shown in the boxplot. The purple line represents the average pairwise distance of random clusters.}\n\\label{fig:comet}\n\\end{figure*}\n\n\n\n\\subsection{Performance evaluation}\\label{sec:Performance}\n\nThe results of our extensive comparison between C$^3$ and CoMEt, regarding mutual exclusivity, coverage, driver identification, and pathway-level evaluation, are shown in Fig.~\\ref{fig:comet}. Both algorithms were tested on the same server with a 256GB RAM memory. Both methods ran uninterruptedly when the cluster sizes were constrained to $k=5, 6, 7,$ and $10$. CoMet reported segfault memory errors for $k=15$, and for this case, only C$^3$ was benchmarked. \n\nTo assess the biological significance of the two methods in terms of their ability to cluster high-impact drivers from the CGC repository together, we compared the results of C$^3$ and CoMEt both to each other and to a ``baseline'' value equal to the average proportion of drivers in the ten most mutually-exclusive clusters found, in this case $0.067$, using uniform random sampling of genes (see Fig.~\\ref{fig:comet}A).\nIn BRCA, we found that C$^3$ detected a median driver proportion of $0.160$ and CoMEt detected a median driver proportion of $0.117$ in the top ten clusters. \nC$^3$ outperforms CoMEt for each cluster size. We also used a Mann-Whitney Rank Sum test~(\\citealp{rosner1999use}) to compare the overall performance of the algorithms with respect to mutual exclusivity, for all cluster sizes. \nWe chose a rank-sum test because it is unclear that the drivers are following a normal distribution due to the small amount of data available. \nThe results show that C$^3$ outperforms CoMEt ($p$-value of $0.0079$) in terms of amount of drivers in clusters. \nC$^3$ also outperforms CoMEt on GBM, with a median proportion of drivers per cluster equal to $0.170$, compared to a $0.12$ proportion of drivers per cluster found by CoMEt. \nThis finding holds for every cluster size, with a rank-sum test $p$-value of $0.0361$. \nBoth methods succeed in finding biologically significant drivers within clusters exhibiting high mutual exclusivity, and both methods significantly outperform the expected number of drivers per cluster in the random setting ($p$-value $1.594 \\times 10^{-5}$ and $p$-value $1.312\\times10^{-3}$ for C$^3$ and CoMEt, respectively). \n\nWe next tested the clusters found by each method based on their mutual exclusivity (see Fig.~\\ref{fig:comet}B). \nTo do so, we used the previously described pairwise Fisher's exact test to obtain a p-value for each of the top ten clusters of the two methods. \nFor better visualization, we performed a negative log transform on the $p$-values, and plotted the transformed $p$-value distribution. Hence, in this system, larger values indicate more mutually exclusivity. \nWe again used a Mann-Whitney rank-sum test to evaluate the performance of C$^3$ and CoMEt. \nFor BRCA, one can see that while both methods have significant median exclusivity values ($p = 7.541 \\times 10^{-6}$ for C$^3$ and $p = 3.337 \\times 10^{-4}$ for CoMEt), C$^3$ has an overall more significant p-values for each cluster size. The median $p$-value of C$^3$ for each cluster size is lower than its CoMEt counterpart except for the case $k=10$. \nHowever, C$^3$ does have superior performance overall with a rank-sum p-value of $p = 4.0202 \\times 10^{-4}$. \nFor GBM, the median exclusivity results are not as strong as for the BRCA set, for both the C$^3$ and CoMEt method. \nC$^3$ has a median $p$-value of $0.3795$ as opposed to CoMEt's $0.5022$. \nThe general drop in significance may be attributed to a lower confidence of the Fisher test due to a small number of samples available; recall that the GBM set involved 291 samples, compared to 959 BRCA samples. \nThis indicates that one should look at individual significant clusters to evaluate mutual exclusivity. Even for the reduced median p-value regime, C$^3$ outperforms CoMEt in significance, having lower median $p$-values for each cluster size. \nOverall, the C$^3$ $p$-values are consistently and significantly lower than those produced by CoMEt for mutual exclusivity (the rank-sum test $p$-value equals $0.04401$).\n\nThe results of the coverage tests are depicted in Fig.~\\ref{fig:comet}C. \nIn the coverage benchmark, CoMEt outperforms C$^3$ for GBM, but neither method outperforms the other BRCA. \nIn BRCA, both methods show comparable performance, with a median result for the fraction of samples covered equal to $0.5505$ for C$^3$, and $0.5662$ for CoMEt. This rather poor performance of both methods is observed for all values of $k$, with no $p$-value based on a Student T-test~\\citealp{zimmerman1987comparative} being less than $0.05$. The largest difference in coverage recorded for the two methods is present for $k=6$. \nIn conclusion, there appears to be no statistical difference between C$^3$ and CoMEt in terms of BRCA coverage percentage ($p$-value of $0.5127$).\nIn GBM, the median $p$-value for coverage difference is more pronounced. \nThe median coverage of C$^3$ is $0.632$ and the median coverage of CoMEt is $0.696$. \nCoMEt finds significantly higher-coverage clusters according to the Student T-test, with $p$-value $0.0345$, and the most pronounced coverage percentage differences exist for small values of $k$ ($0.3745$ vs. $0.6495$ for $k=5$ C$^3$ and CoMEt, respectively).\nIt is also important to note the wide distribution of coverage score values produced by C$^3$ for small $k$: the IQR (Interquartile range) value is roughly $0.35$ for $k=5$. \nThe most likely reason behind this result is that our test weights were chosen to boost the relevance of mutual-exclusivity and biological significance rather than coverage. Mutual exclusivity accounts for 100$\\%$ of the negative weights of edges, while coverage accounts for only 16.7$\\%$ of the positive weights. We justify this weight choice by the fact that it leads to multiple significant cluster discovery and by our belief that coverage is a less significant driver property compared to mutual exclusivity. We also emphasize that a potentially biologically more relevant coverage constraint should pertain to important pathway, rather than patient sample coverage.\n\nAs already mentioned in the previous sections, one advantage of C$^3$ is that the user can adjust the weights according to her/his own belief about the significance of patient coverage. \nFor example, by changing the averaging weights in our GBM run to $w_1=0.60$ (coverage), $w_2=0.20$ (network), and $w_3=0.20$ (expression), we obtain a coverage percentage of $0.7903$ for $k=5$. \nHowever, this excellent coverage comes at a cost of a less significant mutual exclusivity score (fractional value $0.4288$) and a lower proportion of detected drivers (fractional value $0.1267$). \nAs may be seen from the above example, C$^3$ is highly customizable and can be adapted to the user's specification to best reflect the scope and preferences of the analysis.\n\nThe last setting in which we analyzed C$^3$ and CoMEt uses the distances of drivers in the network as performance criteria (see Fig.~\\ref{fig:comet}D). \nHere, we calculated the average pairwise distance between all pairs of genes clustered together. We used the Student T-test to determine the statistical significance of this value. \nWe also compared the values for both algorithms based on $1000$ randomly selected genes by using a permutation test. \nFor BRCA, we found no significant performance difference between the two methods in terms of the average pairwise distance: $3.110$ for C$^3$ and $3.070$ for CoMEt, with a $p$-value of $0.9330$. \nIn GBM, C$^3$ showed a smaller average pairwise distance of $2.908$ compared to CoMEt's $3.097$. \nThis difference is statistically significant, with a $p$-value of $0.0379$. \nThe small average network distance results of C$^3$ for GBM, coupled with the low coverage, leads to the conclusion that C$^3$ favors niche, exclusive clusters in biologically relevant cancer pathways. Hence, the method may be useful for discovering specific molecular cancer subtypes.\nBoth methods had an average pairwise distance well below the permutation benchmark of $3.903$: the $p$-values of both C$^3$ and CoMEt were less than $2 \\times 10^{-16}$ for each cancer type.\n\nIn conclusion, from our detailed evaluation we conclude that although C$^3$ does not outperform CoMEt with respect to all four evaluation criteria, but only three of them, the C$^3$ performance indicates a strong overall propensity to select biologically more relevant and mutually exclusive clusters, and with a higher degree of flexibility compared to CoMEt. \n\n\\subsection{Discovering potential driver pathways}\\label{sec:Discovery}\n\nWe examine next the potential of the C$^3$ algorithm to detect clusters whose genes may be novel cancer driver candidates. \nWe focus our search on clusters that contain biologically significant driver genes and known biological network interactions, and exhibit high mutual exclusivity and coverage. \nWe also focused on the large cluster size regime, as results in this domain have not been previously reported in the literature.  \nTwo examples are shown in Fig.~\\ref{fig:brca} and Fig.~\\ref{fig:gbm}.\n\nIn BRCA, one candidate cluster with several potential novel driver genes is the cluster containing \\textit{PTEN, HUWE1, CNTNAP2, GRID2, CACNA1B, CYSLTR2, MYH1} depicted in Fig.~\\ref{fig:brca}. The genes in the candidate cluster are mutually exclusive ($\\text{$p$-value} = 0.0084$).\nThe genome landscape of this cluster is dominated primarily by mutations in \\textit{PTEN} and \\textit{HUWE1}, and secondarily by homozygous deletions in \\textit{PTEN} and \\textit{CYSLTR2}. \nThe most frequently altered gene in this set is a common driver gene \\textit{PTEN}, a tumor suppressor gene that negatively regulates the AKT/PKB apoptosis pathway~\\citep{stambolic1998negative}. \nThe remaining six genes in the cluster are potential driver candidates. \\textit{HUWE1} is a part of the Mule multidomain complex of the HECT domain family of E3 ubiquitin ligases responsible for apoptosis suppression, DNA damage repair, and transcriptional regulation~\\citep{inoue2013mule}. \n\\textit{CNTNAP2} is a neurexin protein with functions in cell-to-cell adhesion and epidermal growth factor and was found to be hypomethylated in breast cancer cell lines~\\citep{shann2008genome}. \nHypomethylation and the association with epidermal growth factors, coupled with a large number of amplifications in the alteration landscape of \\textit{CNTNAP2} suggest potential oncogenic functions of the gene. \n\\textit{GRID2} is an ionotropic glutamate receptor that is frequently deleted in lymphomas~\\citep{roy2011tumor}.\n\\textit{CACNA1B} codes for a N-type calcium channel which is responsible for calcium influx. Defects in the calcium influx channel can lead to alteration in the apoptosis, proliferation, migration and invasion pathways of breast cancer~\\citep{azimi2014calcium}.\n\\textit{CYSLTR2} is a proinflammatory cysteinyl leukotriene receptor that plays a role in cancer cell differentiation and is associated with breast cancer survival rates~\\citep{magnusson2011cysteinyl}. \nMYH1 is a myosin heavy chain protein that plays a role in cell signaling and pro-apotosis pathways.\n\n\nPerhaps more important than the propensity of each individual gene to be a driver is the collective interaction pattern of the seven genes in the cluster in a cancer pathway. \nFrom Fig.~\\ref{fig:brca}, it is clear that the each gene in the cluster interacts with each other in a tightly-connected community with no gene more than three nodes away when plotted in the network, using the cBioPortal visualization tool. \nThe seven genes in the cluster \\textit{PTEN, HUWE1, CNTNAP2, GRID2, CACNA1B, CYSLTR2, MYH1} are strong candidates to define a novel driver pathway. \nThis conclusion is reinforced by the presence of high impact common drivers (\\textit{TP53, MYC, AKT, and PIK3R1}) which define several important cancer pathways such as apoptosis, DNA repair, and cell cycle arrest~\\citep{vazquez2008genetics,stemke2008integrative}.\n\n\n\n\n\n\nWe also examined a cluster containing potential cancer drivers relevant for GBM.\nIn GBM, we found a cluster of size $10$ with four known drivers and many potential drivers. \nThe cluster includes \\textit{GLI1, WNT2, BRAF, PLCG1, FAS, CREBBP, BRCA2, GLI2, PIK3R5, VAMP3} (see Fig.~\\ref{fig:gbm}). \nThis large cluster has a $p$-value of $0.0901$ in terms of mutual exclusivity, which is actually low as compared to other GBM clusters. \nThe cluster also contains several important driver genes such as \\textit{WNT2, BRAF, BRCA2} and \\textit{CREBBP} which encompass pathways such as sonic hedgehog signaling, cell fate determination, cell growth and apoptosis, checkpoint activation, and DNA repair. \nAdditionally, six out of the ten members are within the same compact network community (\\textit{GLI1, PLCG1, FAS, CREBBP, BRCA2, PIK3R5}). \nOf these six genes, GLI1 and GLI2 are hedgehog signaling genes that are common and first isolated in glioblastoma. These genes are responsible for cell differentiation and stem cell self-renewal~\\citep{clement2007hedgehog}. \n\\textit{PLCG1} is involved in intracellular transduction of receptor-mediated tyrosine kinase activators, and it has been classified as a biomarker in GBM~\\citep{serao2011cell}.\n\\textit{FAS} is a cell surface receptor that mediates apoptosis. \\textit{FAS} is known as a histological hallmark of GBM, affecting both apoptosis and necrosis factors~\\citep{gratas1997fas}. \nFinally, \\textit{PIK3R5} is a subunit of phosphatidylinositol 3-kinases who together have important effects on cell growth, proliferation, differentiation, motility, survival and intracellular trafficking. \n\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{C3-fig3.pdf} \n\\caption{A cluster of potential driver genes inferred from BRCA. \n\\textbf{(A)} shows the alteration landscape of the cluster, with blue representing mutation events, red representing copy number deletions, and green representing copy number amplifications.\n\\textbf{(B)} represents a \\emph{known} subnetwork which contains 6 genes (out of 7) in \\textbf{(A)}. \nThe more intense the red, the higher the alteration frequency of the gene. \nNodes highlighted in black represent driver candidates identified by C$^3$ within a small subnetwork.\nEdges are depicted in black if there exists a direct interaction between two genes. \nGreen edges represent an interaction that undergoes a protein state change.\nPurple edges are other interactions.\n}\n\\label{fig:brca}\n\\end{figure}\n\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.6\\textwidth]{C3-fig4.pdf}\n\\caption{A cluster of potential driver genes inferred from GBM. \n\\textbf{(A)} shows the alteration landscape of the cluster, with blue representing mutation events, red representing copy number deletions, and green representing copy number amplifications. \n\\textbf{(B)} represents a \\emph{known} subnetwork which contains 6 genes (out of 10) in \\textbf{(A)}. \nThe more intense the red, the higher the alteration frequency of the gene. \nNodes highlighted in black represent driver candidates identified by C$^3$ within a small subnetwork.\nEdges are depicted in black if there exists a direct interaction between two genes. \nGreen edges represent an interaction that undergoes a protein state change.\nPurple edges are other interactions.\n}\n\\label{fig:gbm}\n\\end{figure}\n\n\n\n\n\n\n\n\\section{Discussion and Conclusion} \\label{sec:discussion}\n\nWe described a novel method, termed C$^3$, which has the potential to precisely and efficiently identify clusters of gene modules with mutually exclusive mutation patterns. The C$^3$ algorithm uses large-scale cancer genomics datasets which are pre-processed to yield parameters governing novel constrained correlation clustering techniques. The optimization criteria used in clustering include patterns of mutual exclusivity of mutations, patient sample coverage, and network driver concentration.\n\nThere are several major advancements of our method when compared to previously known approaches. Unlike methods that use randomized approaches without the guarantee that multiple runs of the methods on the same data will produce compatible results (such as CoMEt), C$^3$ is consistent. Also, C$^3$ has a complexity that does not depend on the chosen cluster sizes, and is hence much more appropriate for large cluster problems than other methods. Furthermore, it partitions the gene set and hence creates clusters covering all genes used in the analysis. This is to be contrasted with the results produced by other methods that tend to identify only a small number of modules with limited number of genes.\n\nNone of the previous methods were able to identify clusters utilizing different sources of information via a weighting mechanism. \nThis is important because it gives us flexibility to focus more on certain aspects based on the analysis. For example, we can focus more on mutual exclusivity instead of coverage to identify clusters specific to a group of samples which may facilitate the discovery of subtype-specific modules.\n\nBy addressing the above challenges, we believe our new method C$^3$ represents a unique tool to  efficiently and reliably identify mutation patterns and driver pathways in large-scale cancer genomics studies. \n\n\\section*{Acknowledgement}\nWe thank Mark Leiserson in Ben Raphael's lab at Brown University for assistance in running CoMEt.\n\n\\bibliography{document}\n\n\n\n\n\n\\newpage\n\\section*{Supplement -- Theoretical Performance Guarantees and Synthetic Data Evaluations}\n\nSuppose that we have a weighted correlation-clustering instance, where \neach edge $e$ incurs a cost ${w^-}_e$ if it is placed within a cluster and \nincurs a cost ${w^+}_e$ if it is placed between clusters. \nWe also assume that each cluster may\ncontain at most $K+1$ vertices, where $K$ is a fixed constant. If no\nconstraint on the size of the clusters is desired, one can simply set\n$K = \\left\\lvert{{V}}\\right\\rvert$.\n\nWe wish to find an approximation of the minimum-cost clustering. As already \nmentioned in the Approach Section, the C$^3$ method may not work for fully \ngeneral weights, and, due to the\nintegrality gap in the general case, no algorithm based on LP rounding\ncan work in the fully general weight case. We therefore require the following \nweight constraints:\n\\begin{itemize}\n\\item ${w^+}_e \\leq 1$ for every edge $e$, and\n\\item ${w^+}_e + {w^-}_e \\geq 1$ for every edge $e$.\n\\end{itemize}\nNote that these constraints are satisfied if the weights obey\nthe probability constraints ${w^+}_e + {w^-}_e = 1$ for all $e$, but they\nalso apply to much more general choices of weights, which is relevant for \nthe clustering problem at hand. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRecall that we adopted the convention that $x_{uu}=0$ for all $u$.We also observe that one can think\nof the quantity $x_{uv}$ as a ``distance'' between $u$ and $v$.\nBefore starting the analysis of our algorithm, we record an observation based on the triangle inequality:\n\\begin{observation}\\label{obs}\n  Let $x$ be a feasible LP solution, and let $wz$ be an edge.\n  For any vertex $u$, we have $x_{wz} \\geq x_{uz} - x_{uw}$ and\n  $1 - x_{wz} \\geq 1 - x_{uz} - x_{uw}$.\n\\end{observation}\n\nGiven any feasible solution $x$ to the linear program, we use the size-bounded clustering ${\\mathcal{C}}$ generated via Algorithm~\\ref{rounding}, which we express in terms of a parameter $\\alpha$ whose optimal value will be determined later in the proof. The idea behind the rounding is to use classical rounding to obtain a solution to the\nnon-size-bounded problem, and if overlarge clusters are produced, to partition them into small-sized clusters.\n\nThe standard rounding algorithm comes with a guarantee that ${\\operatorname{cost}}({\\mathcal{C}})\n\\leq 6{\\operatorname{cost}}(x)$.  Here, we cannot ask for such a guarantee: it is\npossible, for example, that ${\\operatorname{cost}}(x) = 0$ and ${\\operatorname{cost}}({\\mathcal{C}}) > 0$, if\nall input edges are positive but there are too many vertices to fit\ninto a single cluster. Instead, we prove our approximation ratio by\nbounding ${\\operatorname{cost}}({\\mathcal{C}})$ in terms of a different lower bound on the cost\nof an optimal size-bounded clustering.\n\nLet $C_1 = {\\operatorname{cost}}(x)$. Choose $Y {\\subseteq} E(G)$ to minimize $\\sum_{e \\in\n  Y}{w^+}_e$ subject to the constraint that each vertex $v$ has at most\n$K$ incident edges which do not lie in $Y$. Let $C_2 = \\sum_{e \\in\n  Y}{w^+}_e$. We think of $C_2$ as a lower bound on positive weight\nthat must be cut in order to produce a clustering with all clusters of\nsize at most $K+1$, since the edges contained within clusters\nform a subgraph of maximum degree at most $K$. Thus, the cost of an\noptimal size-bounded clustering is at least $\\max\\{C_1, C_2\\}$. In\nparticular, an optimal clustering costs at least $\\frac{7}{9}C_1 +\n\\frac{2}{9}C_2$. We will use the following lower bound on $C_2$:\n\\begin{definition}\n  For $v \\in V(G)$, the \\emph{excess weight at $v$}, written $e(v)$,\n  is defined by\n \n", "itemtype": "equation", "pos": 38250, "prevtext": "\n\nIn this formulation, and for a fixed edge $e=uv$, $x_{uv}=1$ implies that $u$ and $v$ should belong to different clusters and $x_{uv}=0$ implies that the two vertices should belong to the same cluster. Note that the triangle inequality \\eqref{triangle1} ensures that if $u$ and $z$ are in the same cluster and $z$ and $v$ are in the same cluster, then $u$ and $v$ are also in the same cluster. Any clustering of the vertices can be described using the variables $x_e$. For a fixed clustering, the objective function is the cost associated with that clustering. \n\nSolving the ILP is NP-hard. We hence relax the problem by changing the integer constraint $x_{e} \\in \\{0,1\\}$ to an interval constraint $x_{e} \\in [0,1]$. This relaxation leads to a classical LP, the solution of which may be fractional. To obtain a valid clustering, the fractional solutions have to be subsequently \\emph{rounded} to produce integer solutions. Unfortunately, known rounding algorithms~(\\citealp{Puleo15}) for this problem tend to produce small clusters, often as small as single-vertex clusters. For our study, we hence slightly modify the LP by removing the cluster size constraint~(\\ref{int1}), which we move directly to the rounding procedure as described in Algorithm~\\ref{rounding}.   \n\n\\begin{algorithm}\n\\caption{}\n\\label{rounding}  \n\\begin{algorithmic}\n\\STATE\\textbf{Input:} $\\{x_e\\}_{e\\in E(G)}$, $\\alpha$ and $K$\n\\STATE{Let $S = V(G)$.}\n\\WHILE{$S \\neq \\emptyset$}\n\\STATE{Let the ``pivot vertex'' $u$ be an arbitrary element of $S$.}\n\\STATE{Let $T = \\{w \\in S-\\{u\\} {\\colon\\,} x_{uw} \\leq \\alpha\\}$.}\n\\IF{$\\sum_{w \\in T}x_{uw} \\geq \\alpha\\left\\lvert{{T}}\\right\\rvert/2$}\n\\STATE{Output the singleton cluster $\\{u\\}$.}\n\\STATE{Let $S = S-\\{u\\}$.}\n\\ELSIF{$|T|\\leq K$}\n\\STATE{Output the cluster $\\{u\\} \\cup T$.}\n\\STATE{Let $S = S - (\\{u\\} \\cup T)$.}\n\\ELSE\n\\STATE{Partition $T$ as $T = T'_0 \\cup T_1 \\cup \\cdots \\cup T_p$, where\n    $\\left\\lvert{{T'_0}}\\right\\rvert = K$ and each $\\left\\lvert{{T_i}}\\right\\rvert = K+1$ for $0<i< p$ and $\\left\\lvert{{T_p}}\\right\\rvert \\leq K+1$.}\n\\STATE{Let $T_0 = \\{u\\} \\cup T'_0$.}\n\\STATE{Output the clusters $T_0$, $T_1,T_2,\\dots,T_p$.}\n\\STATE{Let $S = S - (\\{u\\} \\cup T)$.}\n\\ENDIF\n\\ENDWHILE  \n\\end{algorithmic}\n\\end{algorithm}\n\nAlgorithm~\\ref{rounding} is closely based on the rounding algorithm described in ~\\citet{Charikar2003,Charikar2005}.\nThe idea behind the rounding algorithm is to pivot on one vertex, examine its closest neighbors, where closeness is governed by the value of the output variables $x_e$ of the LP, and partition large neighborhoods if needed to get clusters of size at most $K+1$. In the Appendix of the Supplementary Materials, we prove that the LP and Rounding Algorithm~\\ref{rounding} provides a $9$-approximation for the ILP problem, given that the parameter $\\alpha$ is set to $2/7$ and given that the weights obey the following constraints:\n\\begin{itemize}\n\\item ${w^+}_e \\leq 1$ for every edge $e$, and\n\\item ${w^+}_e + {w^-}_e \\geq 1$ for every edge $e$.\n\\end{itemize}\nThe above inequalities were addressed in the weight selection process through normalization, as described in the previous section.\n\n\\subsection{Evaluation methods}\\label{sec:evaluation}\n\nWe evaluated the performance of both C$^3$ and CoMEt in terms of their ability to detect \\emph{mutually exclusive, high-coverage, and biologically relevant gene clusters}. \nWe ran both methods using mutation and CNV data collected from TCGA, pertaining to breast cancer (BRCA)~\\citep{TCGA2012} and glioblastoma (GBM)~\\citep{GBM}. In addition to GBM and BRCA, we also considered kidney cancer (KIRC) and ovarian cancer (OV), but the available patient data appeared limited at this stage to allow for statistically significant and comprehensive results. \nWe accessed the TCGA provisional data using the cBioPortal platform~\\citep{cbioportal} on August 14, 2015. \nWe ran both methods using the same alteration dataset. \nWe evaluated both point mutations and indels, and for CNVs, we used the GISTIC thresholds~\\citep{Mermel2011} of -1 and 3 as our cut-offs. \nTo focus on mutations with high frequency, we only selected genes in the top $95$ percentile of alteration frequencies, thereby obtaining $130$ genes spanning $959$ patient samples in BRCA and $170$ genes spanning $291$ patient samples in GBM.\n\nTo test the effects of cluster sizes and the quality of our results, we ran both C$^3$ and CoMEt to find clusters of sizes upper bounded by $5$, $6$, $7$, $10$, and $15$.\nCoMEt is naturally designed to discover the ``most'' mutually exclusive gene sets. Due to the fact that correlation clustering will cluster all genes in a dataset, we only compared the top ten most mutually exclusive gene sets generated by C$^3$ with those of CoMEt.\n\nWe ran CoMEt with $1,000$ iterations each and $3$ initialization points to ensure both timely and consistent runs. \nFor C$^3$, we ran the C$^3$ clustering method for all combinations of weights $w_1,w_2,w_3 \\in \\{{0,0.25,0.5,0.75,1\\}}$ that satisfy $w_1+w_2+w_3=1$, but selected to report only results for the weight parameters $w_1=0.167$ (coverage), $w_2=0.333$ (network information) and $w_3=0.333$ (expression data). We observe that the choice of the weights may be completely governed by the user, and that the increase in one weight may produce better results in one performance category while reducing the performance in another category. Our choice of high weights for expression and network information was governed by the need to increase the ability of the C$^3$ algorithm to detect biologically significant clusters. Furthermore, the \\emph{patient coverage} criteria appears to be less relevant than \\emph{pathway coverage} and some other coverage properties that have not been explicitly investigated in the literature. \nWe used four statistical methods to assess the performance of the algorithms which reflect both the statistical and biological significance of the clusters found. \n\n\\textbf{Mutual Exclusivity.} To evaluate the degree of mutual exclusivity in a cluster, we performed a Fisher Exact Test~\\citep{fisher1922mathematical} for each pair of genes in the cluster. The Fisher Exact Test uses the hypergeometric distribution to calculate the probability of observing a $2 \\times 2$ contingency table of $n$ total samples, with $a$ samples that has an alteration in two genes (say, $g_i$ and $g_j$), $b$ samples with an alteration in gene $g_i$ only, and $c$ samples with an alteration in gene $g_j$ only. If $d$ is the number of samples with no alteration in either gene, then the probability of co-mutation is evaluated according to\n\n", "index": 33, "text": "\\begin{equation}\n    P(g_i,g_j) = \\frac{ \\binom{a + b}{a} \\binom{c + d}{c}}\n    {\\binom{n}{a + c}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"P(g_{i},g_{j})=\\frac{\\binom{a+b}{a}\\binom{c+d}{c}}{\\binom{n}{a+c}}\" display=\"block\"><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>g</mi><mi>i</mi></msub><mo>,</mo><msub><mi>g</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mrow><mi>a</mi><mo>+</mo><mi>b</mi></mrow><mi>a</mi></mfrac><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mrow><mi>c</mi><mo>+</mo><mi>d</mi></mrow><mi>c</mi></mfrac><mo>)</mo></mrow></mrow><mrow><mo>(</mo><mfrac linethickness=\"0pt\"><mi>n</mi><mrow><mi>a</mi><mo>+</mo><mi>c</mi></mrow></mfrac><mo>)</mo></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n\\end{definition}\n\\begin{lemma}\\label{lem:c2bound}\n  $C_2 \\geq \\frac{1}{2}\\sum_{v \\in V(G)}e(v)$.\n\\end{lemma}\n\\begin{proof}\n  Choose $Y$ as described above. We have\n \n", "itemtype": "equation", "pos": 64885, "prevtext": "\nWe evaluated the overall exclusivity of a cluster as the median value of each pairwise test for each pair of genes $g_i,g_j$ in the network. The pairwise Fisher's method has also been used by Mutex suite to establish mutual exclusivity~\\citep{Bahur2015}. However, because in our context the Fisher Exact Test is used as an evaluation rather than discovery tool, we used the median pairwise $p$-value rather than the maximum $p$-value to get a better sense of the overall exclusivity of genes in a cluster. It is also important to note that while CoMEt has an built-in method that generalizes the exclusivity test to $2^k$ contingency table for a cluster size $k$, the exponential size of their test set makes evaluation for large cluster sizes computationally impractical. An alternative test for overall mutual exclusivity is a permutation test, as implemented by MEMo, which compares the exclusivity of a gene set by sampling random gene sets and comparing the patients with multiple alterations.\n\n\\textbf{Coverage.} To compare and evaluate the overall coverage of a cluster found by C$^3$ or CoMEt, we calculated the proportion of patients with at least one alteration in a gene belonging to the given cluster.\n\n\\textbf{Network Clustering.} We also performed a pathway analysis for the potential drivers. As pointed out in the previous section, driver genes tend to be, on average, closer to each other in a pathway compared to randomly selected genes. Using this dogma, we calculated the average pairwise distance between each each pair of genes $g_i,g_j$ within a discovered cluster using Dijkstra's Algorithm. As before, our tests were performed on 8726 genes from~\\citep{Ciriello12}.\n\n\n\\textbf{Biological Significance.} In addition to testing the performance of the algorithm with respect to mutual exclusivity and coverage, we also investigated the biological significance of the C$^3$ and CoMEt methods from the perspective of gene discovery and pathway analysis. Although there is no overarching gold standard to determine biological significance, a commonly accepted metric employed by MEMo, Dendrix, Mutex, CoMEt and other similar tools is to count the number of known driver genes found within \\emph{the best clusters} according to the mutual exclusivity principle. These clusters usually contain several known driver genes. To determine the driver gene-based biological significance, we calculated the proportion of drivers found in the ten most mutually-exclusive C$^3$ and CoMEt clusters using a comprehensive, curated list of known drivers from the Cancer Gene Census~\\citep{cgc}.\n\nIt is important to point out that while the four benchmarks we define are a reliable way to test the performance of CoMEt and C$^3$, no perfect benchmark exists for detecting mutually exclusive and biologically significant genes clusters. As with many previous methods regarding this topic, the criteria are in a sense circular in that some of the same parameters that we maximize are the parameters that we use to evaluate the method. This is the reason why we use multiple benchmarks to evaluate the method.\n\n\\section{Results}\\label{sec:results}\nIn what follows, we demonstrate that C$^3$ outperforms CoMEt in almost all of the aforementioned benchmarking criteria. As a rule of thumb, C$^3$ can be made\nto outperform CoMEt \\emph{in any chosen single criteria or pairs of criteria} by adjusting the weights appropriately. This observation follows from that fact that the weights trade off the strengths of different modeling assumptions. We supplement our statistical analysis with a discussion of the biological relevance of our findings, and explore the role of the new potential drivers found by C$^3$ within their driver gene communities. In particular, we discuss the significance of large mutually exclusive clusters that cannot be recovered by other methods. Recall that we restrict our attention to the ten best performing clusters according to mutual exclusivity, as this approach was used in the original evaluation process of the CoMEt algorithm.\n\n\n\\begin{figure*}[!tpb]\n\\begin{center}\n\\includegraphics[width=1\\textwidth]{C3-fig2.pdf} \n\\end{center}\n\\caption{A comparative analysis of C$^3$ (Red) and CoMEt (Blue) based on four evaluation criteria. We used five cluster sizes ($5,6,7,10,$ and $15$) that index the x-axis in each benchmark test. \n\\textbf{(A)} depicts the results based on the driver gene evaluation criteria. The y-axis represents the proportion of drivers found by each method, contained within the best ten  clusters found. The purple line represents the expected value of drivers detected if clusters are randomly selected. \n\\textbf{(B)} shows the pairwise mutual exclusivity of each run. The y-axis represents the negative log transform of the mutual exclusive p-value such that larger values are more mutually exclusive than smaller ones. \nThe boxplots illustrate the distribution of exclusivity results concerning each of the top ten individual clusters for C$^3$ and CoMEt. \n\\textbf{(C)} shows the distribution of coverage, measured by proportion of samples with at least one alteration in a given cluster (the y-axis). The boxplot illustrates the distribution of coverage results for individual top ten cluster results. \n\\textbf{(D)} includes the network connectivity results of C$^3$ and CoMEt. The y-axis measures the average pairwise network distance between all genes in a cluster, and the distribution of each cluster is shown in the boxplot. The purple line represents the average pairwise distance of random clusters.}\n\\label{fig:comet}\n\\end{figure*}\n\n\n\n\\subsection{Performance evaluation}\\label{sec:Performance}\n\nThe results of our extensive comparison between C$^3$ and CoMEt, regarding mutual exclusivity, coverage, driver identification, and pathway-level evaluation, are shown in Fig.~\\ref{fig:comet}. Both algorithms were tested on the same server with a 256GB RAM memory. Both methods ran uninterruptedly when the cluster sizes were constrained to $k=5, 6, 7,$ and $10$. CoMet reported segfault memory errors for $k=15$, and for this case, only C$^3$ was benchmarked. \n\nTo assess the biological significance of the two methods in terms of their ability to cluster high-impact drivers from the CGC repository together, we compared the results of C$^3$ and CoMEt both to each other and to a ``baseline'' value equal to the average proportion of drivers in the ten most mutually-exclusive clusters found, in this case $0.067$, using uniform random sampling of genes (see Fig.~\\ref{fig:comet}A).\nIn BRCA, we found that C$^3$ detected a median driver proportion of $0.160$ and CoMEt detected a median driver proportion of $0.117$ in the top ten clusters. \nC$^3$ outperforms CoMEt for each cluster size. We also used a Mann-Whitney Rank Sum test~(\\citealp{rosner1999use}) to compare the overall performance of the algorithms with respect to mutual exclusivity, for all cluster sizes. \nWe chose a rank-sum test because it is unclear that the drivers are following a normal distribution due to the small amount of data available. \nThe results show that C$^3$ outperforms CoMEt ($p$-value of $0.0079$) in terms of amount of drivers in clusters. \nC$^3$ also outperforms CoMEt on GBM, with a median proportion of drivers per cluster equal to $0.170$, compared to a $0.12$ proportion of drivers per cluster found by CoMEt. \nThis finding holds for every cluster size, with a rank-sum test $p$-value of $0.0361$. \nBoth methods succeed in finding biologically significant drivers within clusters exhibiting high mutual exclusivity, and both methods significantly outperform the expected number of drivers per cluster in the random setting ($p$-value $1.594 \\times 10^{-5}$ and $p$-value $1.312\\times10^{-3}$ for C$^3$ and CoMEt, respectively). \n\nWe next tested the clusters found by each method based on their mutual exclusivity (see Fig.~\\ref{fig:comet}B). \nTo do so, we used the previously described pairwise Fisher's exact test to obtain a p-value for each of the top ten clusters of the two methods. \nFor better visualization, we performed a negative log transform on the $p$-values, and plotted the transformed $p$-value distribution. Hence, in this system, larger values indicate more mutually exclusivity. \nWe again used a Mann-Whitney rank-sum test to evaluate the performance of C$^3$ and CoMEt. \nFor BRCA, one can see that while both methods have significant median exclusivity values ($p = 7.541 \\times 10^{-6}$ for C$^3$ and $p = 3.337 \\times 10^{-4}$ for CoMEt), C$^3$ has an overall more significant p-values for each cluster size. The median $p$-value of C$^3$ for each cluster size is lower than its CoMEt counterpart except for the case $k=10$. \nHowever, C$^3$ does have superior performance overall with a rank-sum p-value of $p = 4.0202 \\times 10^{-4}$. \nFor GBM, the median exclusivity results are not as strong as for the BRCA set, for both the C$^3$ and CoMEt method. \nC$^3$ has a median $p$-value of $0.3795$ as opposed to CoMEt's $0.5022$. \nThe general drop in significance may be attributed to a lower confidence of the Fisher test due to a small number of samples available; recall that the GBM set involved 291 samples, compared to 959 BRCA samples. \nThis indicates that one should look at individual significant clusters to evaluate mutual exclusivity. Even for the reduced median p-value regime, C$^3$ outperforms CoMEt in significance, having lower median $p$-values for each cluster size. \nOverall, the C$^3$ $p$-values are consistently and significantly lower than those produced by CoMEt for mutual exclusivity (the rank-sum test $p$-value equals $0.04401$).\n\nThe results of the coverage tests are depicted in Fig.~\\ref{fig:comet}C. \nIn the coverage benchmark, CoMEt outperforms C$^3$ for GBM, but neither method outperforms the other BRCA. \nIn BRCA, both methods show comparable performance, with a median result for the fraction of samples covered equal to $0.5505$ for C$^3$, and $0.5662$ for CoMEt. This rather poor performance of both methods is observed for all values of $k$, with no $p$-value based on a Student T-test~\\citealp{zimmerman1987comparative} being less than $0.05$. The largest difference in coverage recorded for the two methods is present for $k=6$. \nIn conclusion, there appears to be no statistical difference between C$^3$ and CoMEt in terms of BRCA coverage percentage ($p$-value of $0.5127$).\nIn GBM, the median $p$-value for coverage difference is more pronounced. \nThe median coverage of C$^3$ is $0.632$ and the median coverage of CoMEt is $0.696$. \nCoMEt finds significantly higher-coverage clusters according to the Student T-test, with $p$-value $0.0345$, and the most pronounced coverage percentage differences exist for small values of $k$ ($0.3745$ vs. $0.6495$ for $k=5$ C$^3$ and CoMEt, respectively).\nIt is also important to note the wide distribution of coverage score values produced by C$^3$ for small $k$: the IQR (Interquartile range) value is roughly $0.35$ for $k=5$. \nThe most likely reason behind this result is that our test weights were chosen to boost the relevance of mutual-exclusivity and biological significance rather than coverage. Mutual exclusivity accounts for 100$\\%$ of the negative weights of edges, while coverage accounts for only 16.7$\\%$ of the positive weights. We justify this weight choice by the fact that it leads to multiple significant cluster discovery and by our belief that coverage is a less significant driver property compared to mutual exclusivity. We also emphasize that a potentially biologically more relevant coverage constraint should pertain to important pathway, rather than patient sample coverage.\n\nAs already mentioned in the previous sections, one advantage of C$^3$ is that the user can adjust the weights according to her/his own belief about the significance of patient coverage. \nFor example, by changing the averaging weights in our GBM run to $w_1=0.60$ (coverage), $w_2=0.20$ (network), and $w_3=0.20$ (expression), we obtain a coverage percentage of $0.7903$ for $k=5$. \nHowever, this excellent coverage comes at a cost of a less significant mutual exclusivity score (fractional value $0.4288$) and a lower proportion of detected drivers (fractional value $0.1267$). \nAs may be seen from the above example, C$^3$ is highly customizable and can be adapted to the user's specification to best reflect the scope and preferences of the analysis.\n\nThe last setting in which we analyzed C$^3$ and CoMEt uses the distances of drivers in the network as performance criteria (see Fig.~\\ref{fig:comet}D). \nHere, we calculated the average pairwise distance between all pairs of genes clustered together. We used the Student T-test to determine the statistical significance of this value. \nWe also compared the values for both algorithms based on $1000$ randomly selected genes by using a permutation test. \nFor BRCA, we found no significant performance difference between the two methods in terms of the average pairwise distance: $3.110$ for C$^3$ and $3.070$ for CoMEt, with a $p$-value of $0.9330$. \nIn GBM, C$^3$ showed a smaller average pairwise distance of $2.908$ compared to CoMEt's $3.097$. \nThis difference is statistically significant, with a $p$-value of $0.0379$. \nThe small average network distance results of C$^3$ for GBM, coupled with the low coverage, leads to the conclusion that C$^3$ favors niche, exclusive clusters in biologically relevant cancer pathways. Hence, the method may be useful for discovering specific molecular cancer subtypes.\nBoth methods had an average pairwise distance well below the permutation benchmark of $3.903$: the $p$-values of both C$^3$ and CoMEt were less than $2 \\times 10^{-16}$ for each cancer type.\n\nIn conclusion, from our detailed evaluation we conclude that although C$^3$ does not outperform CoMEt with respect to all four evaluation criteria, but only three of them, the C$^3$ performance indicates a strong overall propensity to select biologically more relevant and mutually exclusive clusters, and with a higher degree of flexibility compared to CoMEt. \n\n\\subsection{Discovering potential driver pathways}\\label{sec:Discovery}\n\nWe examine next the potential of the C$^3$ algorithm to detect clusters whose genes may be novel cancer driver candidates. \nWe focus our search on clusters that contain biologically significant driver genes and known biological network interactions, and exhibit high mutual exclusivity and coverage. \nWe also focused on the large cluster size regime, as results in this domain have not been previously reported in the literature.  \nTwo examples are shown in Fig.~\\ref{fig:brca} and Fig.~\\ref{fig:gbm}.\n\nIn BRCA, one candidate cluster with several potential novel driver genes is the cluster containing \\textit{PTEN, HUWE1, CNTNAP2, GRID2, CACNA1B, CYSLTR2, MYH1} depicted in Fig.~\\ref{fig:brca}. The genes in the candidate cluster are mutually exclusive ($\\text{$p$-value} = 0.0084$).\nThe genome landscape of this cluster is dominated primarily by mutations in \\textit{PTEN} and \\textit{HUWE1}, and secondarily by homozygous deletions in \\textit{PTEN} and \\textit{CYSLTR2}. \nThe most frequently altered gene in this set is a common driver gene \\textit{PTEN}, a tumor suppressor gene that negatively regulates the AKT/PKB apoptosis pathway~\\citep{stambolic1998negative}. \nThe remaining six genes in the cluster are potential driver candidates. \\textit{HUWE1} is a part of the Mule multidomain complex of the HECT domain family of E3 ubiquitin ligases responsible for apoptosis suppression, DNA damage repair, and transcriptional regulation~\\citep{inoue2013mule}. \n\\textit{CNTNAP2} is a neurexin protein with functions in cell-to-cell adhesion and epidermal growth factor and was found to be hypomethylated in breast cancer cell lines~\\citep{shann2008genome}. \nHypomethylation and the association with epidermal growth factors, coupled with a large number of amplifications in the alteration landscape of \\textit{CNTNAP2} suggest potential oncogenic functions of the gene. \n\\textit{GRID2} is an ionotropic glutamate receptor that is frequently deleted in lymphomas~\\citep{roy2011tumor}.\n\\textit{CACNA1B} codes for a N-type calcium channel which is responsible for calcium influx. Defects in the calcium influx channel can lead to alteration in the apoptosis, proliferation, migration and invasion pathways of breast cancer~\\citep{azimi2014calcium}.\n\\textit{CYSLTR2} is a proinflammatory cysteinyl leukotriene receptor that plays a role in cancer cell differentiation and is associated with breast cancer survival rates~\\citep{magnusson2011cysteinyl}. \nMYH1 is a myosin heavy chain protein that plays a role in cell signaling and pro-apotosis pathways.\n\n\nPerhaps more important than the propensity of each individual gene to be a driver is the collective interaction pattern of the seven genes in the cluster in a cancer pathway. \nFrom Fig.~\\ref{fig:brca}, it is clear that the each gene in the cluster interacts with each other in a tightly-connected community with no gene more than three nodes away when plotted in the network, using the cBioPortal visualization tool. \nThe seven genes in the cluster \\textit{PTEN, HUWE1, CNTNAP2, GRID2, CACNA1B, CYSLTR2, MYH1} are strong candidates to define a novel driver pathway. \nThis conclusion is reinforced by the presence of high impact common drivers (\\textit{TP53, MYC, AKT, and PIK3R1}) which define several important cancer pathways such as apoptosis, DNA repair, and cell cycle arrest~\\citep{vazquez2008genetics,stemke2008integrative}.\n\n\n\n\n\n\nWe also examined a cluster containing potential cancer drivers relevant for GBM.\nIn GBM, we found a cluster of size $10$ with four known drivers and many potential drivers. \nThe cluster includes \\textit{GLI1, WNT2, BRAF, PLCG1, FAS, CREBBP, BRCA2, GLI2, PIK3R5, VAMP3} (see Fig.~\\ref{fig:gbm}). \nThis large cluster has a $p$-value of $0.0901$ in terms of mutual exclusivity, which is actually low as compared to other GBM clusters. \nThe cluster also contains several important driver genes such as \\textit{WNT2, BRAF, BRCA2} and \\textit{CREBBP} which encompass pathways such as sonic hedgehog signaling, cell fate determination, cell growth and apoptosis, checkpoint activation, and DNA repair. \nAdditionally, six out of the ten members are within the same compact network community (\\textit{GLI1, PLCG1, FAS, CREBBP, BRCA2, PIK3R5}). \nOf these six genes, GLI1 and GLI2 are hedgehog signaling genes that are common and first isolated in glioblastoma. These genes are responsible for cell differentiation and stem cell self-renewal~\\citep{clement2007hedgehog}. \n\\textit{PLCG1} is involved in intracellular transduction of receptor-mediated tyrosine kinase activators, and it has been classified as a biomarker in GBM~\\citep{serao2011cell}.\n\\textit{FAS} is a cell surface receptor that mediates apoptosis. \\textit{FAS} is known as a histological hallmark of GBM, affecting both apoptosis and necrosis factors~\\citep{gratas1997fas}. \nFinally, \\textit{PIK3R5} is a subunit of phosphatidylinositol 3-kinases who together have important effects on cell growth, proliferation, differentiation, motility, survival and intracellular trafficking. \n\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.7\\textwidth]{C3-fig3.pdf} \n\\caption{A cluster of potential driver genes inferred from BRCA. \n\\textbf{(A)} shows the alteration landscape of the cluster, with blue representing mutation events, red representing copy number deletions, and green representing copy number amplifications.\n\\textbf{(B)} represents a \\emph{known} subnetwork which contains 6 genes (out of 7) in \\textbf{(A)}. \nThe more intense the red, the higher the alteration frequency of the gene. \nNodes highlighted in black represent driver candidates identified by C$^3$ within a small subnetwork.\nEdges are depicted in black if there exists a direct interaction between two genes. \nGreen edges represent an interaction that undergoes a protein state change.\nPurple edges are other interactions.\n}\n\\label{fig:brca}\n\\end{figure}\n\n\n\\begin{figure}[!tpb]\n\\centering\n\\includegraphics[width=0.6\\textwidth]{C3-fig4.pdf}\n\\caption{A cluster of potential driver genes inferred from GBM. \n\\textbf{(A)} shows the alteration landscape of the cluster, with blue representing mutation events, red representing copy number deletions, and green representing copy number amplifications. \n\\textbf{(B)} represents a \\emph{known} subnetwork which contains 6 genes (out of 10) in \\textbf{(A)}. \nThe more intense the red, the higher the alteration frequency of the gene. \nNodes highlighted in black represent driver candidates identified by C$^3$ within a small subnetwork.\nEdges are depicted in black if there exists a direct interaction between two genes. \nGreen edges represent an interaction that undergoes a protein state change.\nPurple edges are other interactions.\n}\n\\label{fig:gbm}\n\\end{figure}\n\n\n\n\n\n\n\n\\section{Discussion and Conclusion} \\label{sec:discussion}\n\nWe described a novel method, termed C$^3$, which has the potential to precisely and efficiently identify clusters of gene modules with mutually exclusive mutation patterns. The C$^3$ algorithm uses large-scale cancer genomics datasets which are pre-processed to yield parameters governing novel constrained correlation clustering techniques. The optimization criteria used in clustering include patterns of mutual exclusivity of mutations, patient sample coverage, and network driver concentration.\n\nThere are several major advancements of our method when compared to previously known approaches. Unlike methods that use randomized approaches without the guarantee that multiple runs of the methods on the same data will produce compatible results (such as CoMEt), C$^3$ is consistent. Also, C$^3$ has a complexity that does not depend on the chosen cluster sizes, and is hence much more appropriate for large cluster problems than other methods. Furthermore, it partitions the gene set and hence creates clusters covering all genes used in the analysis. This is to be contrasted with the results produced by other methods that tend to identify only a small number of modules with limited number of genes.\n\nNone of the previous methods were able to identify clusters utilizing different sources of information via a weighting mechanism. \nThis is important because it gives us flexibility to focus more on certain aspects based on the analysis. For example, we can focus more on mutual exclusivity instead of coverage to identify clusters specific to a group of samples which may facilitate the discovery of subtype-specific modules.\n\nBy addressing the above challenges, we believe our new method C$^3$ represents a unique tool to  efficiently and reliably identify mutation patterns and driver pathways in large-scale cancer genomics studies. \n\n\\section*{Acknowledgement}\nWe thank Mark Leiserson in Ben Raphael's lab at Brown University for assistance in running CoMEt.\n\n\\bibliography{document}\n\n\n\n\n\n\\newpage\n\\section*{Supplement -- Theoretical Performance Guarantees and Synthetic Data Evaluations}\n\nSuppose that we have a weighted correlation-clustering instance, where \neach edge $e$ incurs a cost ${w^-}_e$ if it is placed within a cluster and \nincurs a cost ${w^+}_e$ if it is placed between clusters. \nWe also assume that each cluster may\ncontain at most $K+1$ vertices, where $K$ is a fixed constant. If no\nconstraint on the size of the clusters is desired, one can simply set\n$K = \\left\\lvert{{V}}\\right\\rvert$.\n\nWe wish to find an approximation of the minimum-cost clustering. As already \nmentioned in the Approach Section, the C$^3$ method may not work for fully \ngeneral weights, and, due to the\nintegrality gap in the general case, no algorithm based on LP rounding\ncan work in the fully general weight case. We therefore require the following \nweight constraints:\n\\begin{itemize}\n\\item ${w^+}_e \\leq 1$ for every edge $e$, and\n\\item ${w^+}_e + {w^-}_e \\geq 1$ for every edge $e$.\n\\end{itemize}\nNote that these constraints are satisfied if the weights obey\nthe probability constraints ${w^+}_e + {w^-}_e = 1$ for all $e$, but they\nalso apply to much more general choices of weights, which is relevant for \nthe clustering problem at hand. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRecall that we adopted the convention that $x_{uu}=0$ for all $u$.We also observe that one can think\nof the quantity $x_{uv}$ as a ``distance'' between $u$ and $v$.\nBefore starting the analysis of our algorithm, we record an observation based on the triangle inequality:\n\\begin{observation}\\label{obs}\n  Let $x$ be a feasible LP solution, and let $wz$ be an edge.\n  For any vertex $u$, we have $x_{wz} \\geq x_{uz} - x_{uw}$ and\n  $1 - x_{wz} \\geq 1 - x_{uz} - x_{uw}$.\n\\end{observation}\n\nGiven any feasible solution $x$ to the linear program, we use the size-bounded clustering ${\\mathcal{C}}$ generated via Algorithm~\\ref{rounding}, which we express in terms of a parameter $\\alpha$ whose optimal value will be determined later in the proof. The idea behind the rounding is to use classical rounding to obtain a solution to the\nnon-size-bounded problem, and if overlarge clusters are produced, to partition them into small-sized clusters.\n\nThe standard rounding algorithm comes with a guarantee that ${\\operatorname{cost}}({\\mathcal{C}})\n\\leq 6{\\operatorname{cost}}(x)$.  Here, we cannot ask for such a guarantee: it is\npossible, for example, that ${\\operatorname{cost}}(x) = 0$ and ${\\operatorname{cost}}({\\mathcal{C}}) > 0$, if\nall input edges are positive but there are too many vertices to fit\ninto a single cluster. Instead, we prove our approximation ratio by\nbounding ${\\operatorname{cost}}({\\mathcal{C}})$ in terms of a different lower bound on the cost\nof an optimal size-bounded clustering.\n\nLet $C_1 = {\\operatorname{cost}}(x)$. Choose $Y {\\subseteq} E(G)$ to minimize $\\sum_{e \\in\n  Y}{w^+}_e$ subject to the constraint that each vertex $v$ has at most\n$K$ incident edges which do not lie in $Y$. Let $C_2 = \\sum_{e \\in\n  Y}{w^+}_e$. We think of $C_2$ as a lower bound on positive weight\nthat must be cut in order to produce a clustering with all clusters of\nsize at most $K+1$, since the edges contained within clusters\nform a subgraph of maximum degree at most $K$. Thus, the cost of an\noptimal size-bounded clustering is at least $\\max\\{C_1, C_2\\}$. In\nparticular, an optimal clustering costs at least $\\frac{7}{9}C_1 +\n\\frac{2}{9}C_2$. We will use the following lower bound on $C_2$:\n\\begin{definition}\n  For $v \\in V(G)$, the \\emph{excess weight at $v$}, written $e(v)$,\n  is defined by\n \n", "index": 35, "text": "\\[ e(v) = \\min\\{\\sum_{z \\in S}{w^+}_{vz} {\\colon\\,} \\text{$S {\\subseteq} N(v)$ and $\\left\\lvert{{N(v) - S}}\\right\\rvert \\leq K$}\\}. \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex4.m1\" class=\"ltx_Math\" alttext=\"e(v)=\\min\\{\\sum_{z\\in S}{w^{+}}_{vz}{\\colon\\,}\\text{$S{\\subseteq}N(v)$ and $%&#10;\\left\\lvert{{N(v)-S}}\\right\\rvert\\leq K$}\\}.\" display=\"block\"><mrow><mrow><mrow><mi>e</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">{</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>∈</mo><mi>S</mi></mrow></munder><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo rspace=\"4.2pt\">:</mo><mrow><mrow><mi>S</mi><mo>⊆</mo><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mtext> and </mtext><mrow><mrow><mo fence=\"true\">|</mo><mrow><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mi>S</mi></mrow><mo fence=\"true\">|</mo></mrow><mo>≤</mo><mi>K</mi></mrow></mrow></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n  where the second equality follows from the fact that each edge of $Y$ is counted once at each of its endpoints.\n\\end{proof}\n\nWe use the ``charging'' idea in rounding, where one can make\n``charges'' both against the individual contribution of each edge, as\nwell as a global ``bank'' that will be paid for using $C_2$. \n\n{\\textbf{Case {{1}}:} \\textit{{A singleton cluster $\\{u\\}$ is output.}}} The total cluster\ncost when outputting a singleton cluster $\\{u\\}$ is $\\sum_{v \\in S-u}\n{w^+}_{uv}$, while the total LP cost accrued by edges incident to $u$\nis $\\sum_{v \\in S-u} {w^+}_{uv}x_{uv}$.\n\nIf the singleton $\\{u\\}$ is output, then we have\n", "itemtype": "equation", "pos": 65186, "prevtext": "\n\\end{definition}\n\\begin{lemma}\\label{lem:c2bound}\n  $C_2 \\geq \\frac{1}{2}\\sum_{v \\in V(G)}e(v)$.\n\\end{lemma}\n\\begin{proof}\n  Choose $Y$ as described above. We have\n \n", "index": 37, "text": "\\[ C_2 = \\sum_{e \\in Y}{w^+}_e = \\frac{1}{2}\\sum_{v \\in V(G)}\\sum_{vz \\in Y}{w^+}_{vz} \\geq \\frac{1}{2}\\sum_{v \\in V(G)}e(v), \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex5.m1\" class=\"ltx_Math\" alttext=\"C_{2}=\\sum_{e\\in Y}{w^{+}}_{e}=\\frac{1}{2}\\sum_{v\\in V(G)}\\sum_{vz\\in Y}{w^{+}%&#10;}_{vz}\\geq\\frac{1}{2}\\sum_{v\\in V(G)}e(v),\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mn>2</mn></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>e</mi><mo>∈</mo><mi>Y</mi></mrow></munder><mmultiscripts><mi>w</mi><none/><mo>+</mo><mi>e</mi><none/></mmultiscripts></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><mo>∈</mo><mi>Y</mi></mrow></munder><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow></mrow></mrow><mo>≥</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>G</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder><mrow><mi>e</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": " since\neither the average in step $3$ was ``too high'', or else $T$ was\nempty. Now for each $v \\in T$ we have $x_{uv} \\leq \\alpha$. For such\n$x_{uv}$ we have $1-x_{uv} \\geq x_{uv}$, since $\\alpha < 1/2$. This\nyields the following lower bound on the LP cost of $uv$:\n", "itemtype": "equation", "pos": -1, "prevtext": "\n  where the second equality follows from the fact that each edge of $Y$ is counted once at each of its endpoints.\n\\end{proof}\n\nWe use the ``charging'' idea in rounding, where one can make\n``charges'' both against the individual contribution of each edge, as\nwell as a global ``bank'' that will be paid for using $C_2$. \n\n{\\textbf{Case {{1}}:} \\textit{{A singleton cluster $\\{u\\}$ is output.}}} The total cluster\ncost when outputting a singleton cluster $\\{u\\}$ is $\\sum_{v \\in S-u}\n{w^+}_{uv}$, while the total LP cost accrued by edges incident to $u$\nis $\\sum_{v \\in S-u} {w^+}_{uv}x_{uv}$.\n\nIf the singleton $\\{u\\}$ is output, then we have\n", "index": 39, "text": "\n\\[ \\sum_{v \\in T}x_{uv} \\geq \\frac{\\alpha\\left\\lvert{{T}}\\right\\rvert}{2}, \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex6.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in T}x_{uv}\\geq\\frac{\\alpha\\left\\lvert{{T}}\\right\\rvert}{2},\" display=\"block\"><mrow><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mi>T</mi></mrow></munder><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>≥</mo><mfrac><mrow><mi>α</mi><mo>⁢</mo><mrow><mo fence=\"true\">|</mo><mi>T</mi><mo fence=\"true\">|</mo></mrow></mrow><mn>2</mn></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": " where the last inequality uses the\nbound ${w^+}_{uv} + {w^-}_{uv} \\geq 1$. Thus, each edge $uv$ has LP\ncost at least $x_{uv}$, and so the edges joining $u$ and $T$ have\ntotal LP cost at least $\\alpha\\left\\lvert{{T}}\\right\\rvert/2$. Each such edge $uv$ incurs\ncluster-cost ${w^+}_{uv}$, which is at most $1$.  Thus, charging\n$(2/\\alpha)x_{uv}$ to each edge $uv$ for $v \\in T$ gives enough charge to pay\nfor the cluster-cost of edges with $v \\in T$, while each edge is\ncharged at most $2/\\alpha$ times its LP cost.\n\nFor $v \\in S-(T \\cup \\{u\\})$, we have $x_{uv} > \\alpha$, so each edge\n$uv$ incurs LP cost at least $\\alpha {w^+}_{uv}$ and incurs cluster cost at\nmost ${w^+}_{uv}$. Thus, charging such each edge $(1/\\alpha){w^+}_{uv}x_{uv}$ pays\nfor the cluster cost of these edges.\n\n\\smallskip\n\n{\\textbf{Case {{2}}:} \\textit{{A nonsingleton cluster $\\{u\\} \\cup T$ is output.}}} We first\nconsider edges inside $\\{u\\} \\cup T$, then we consider edges joining\n$\\{u\\} \\cup T$ with $S - (\\{u\\} \\cup T)$. Finally, we consider edges joining\n$T_i$ with $T_j$ for $i \\neq j$.\n\n\\textbf{Edges within $\\{u\\} \\cup T$.} Suppose $vz$ is an edge contained in $\\{u\\}\n\\cup T$, so that $vz$ incurs cluster-cost ${w^-}_{vz}$ and LP-cost at\nleast ${w^-}_{vz}(1-x_{vz})$. By the definition of $T$, we have\n$x_{uv}, v_{uz} \\leq \\alpha$.  Hence, by Observation~\\ref{obs}, we have\n$1-x_{vz} \\geq 1 - x_{uv} - x_{vz} \\geq 1-2\\alpha$. Thus, charging $\\frac{1}{1-2\\alpha}{w^-}_{vz}(1-x_{vz})$\nto these edges pays for their cluster-cost.\n\n\\textbf{Edges joining $\\{u\\} \\cup T$ with $S - (\\{u\\} \\cup T)$.} Let\n$z$ be a vertex outside $\\{u\\} \\cup T$. A \\emph{cross-edge} for $z$\nis an edge from $z$ to $\\{u\\} \\cup T$. We show that the cross-edges\nfor $z$ have total cluster-cost that is at most $\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\}$\ntimes their total LP-cost.  Note that whenever $vz$ is a cross-edge,\nwe have $x_{uv} \\leq \\alpha$, by the definition of $T$. Each\ncross-edge incurs $vz$ cluster-cost ${w^+}_{vz}$ and LP-cost\n${w^+}_{vz}x_{vz} + {w^-}_{vz}(1-x_{vz})$.\n\nIf in fact $x_{uz} \\geq 1-\\alpha$, then Observation~\\ref{obs} yields\n$x_{vz} \\geq x_{uz} - x_{uv} \\geq 1-2\\alpha$ for every cross-edge $v$,\nyielding LP-cost at least $\\frac{1}{1-2\\alpha}{w^+}_{vz}$; thus, such\nedges have cluster-cost at most $\\frac{1}{1-2\\alpha}$ times their LP\ncost.\n\nIt remains to handle the case $x_{uz} \\in (\\alpha, 1-\\alpha)$. Here,\nwe seek a lower bound on the total LP-cost of the cross-edges for\n$z$. Note that the total cluster cost of these edges is $\\sum_{v \\in\n  \\{u\\} \\cup T}{w^+}_{vz}$, which is at most $\\left\\lvert{{T}}\\right\\rvert$ since each\n${w^+}_{vz} \\leq 1$.\n\nBy Observation~\\ref{obs}, we have $x_{vz} \\geq x_{uz}-x_{uv}$ and $1 - x_{vz} \\geq 1 - x_{uz} - x_{uv}$\nfor each edge $vz$. It follows that the total LP-weight of the cross-edges for $z$\nis at least\n", "itemtype": "equation", "pos": -1, "prevtext": " since\neither the average in step $3$ was ``too high'', or else $T$ was\nempty. Now for each $v \\in T$ we have $x_{uv} \\leq \\alpha$. For such\n$x_{uv}$ we have $1-x_{uv} \\geq x_{uv}$, since $\\alpha < 1/2$. This\nyields the following lower bound on the LP cost of $uv$:\n", "index": 41, "text": "\n\\[ {w^+}_{uv} x_{uv} + {w^-}_{uv} (1-x_{uv}) \\geq {w^+}_{uv} x_{uv} +\n{w^-}_{uv} x_{uv} \\geq x_{uv}, \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex7.m1\" class=\"ltx_Math\" alttext=\"{w^{+}}_{uv}x_{uv}+{w^{-}}_{uv}(1-x_{uv})\\geq{w^{+}}_{uv}x_{uv}+{w^{-}}_{uv}x_%&#10;{uv}\\geq x_{uv},\" display=\"block\"><mrow><mrow><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>≥</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow></mrow><mo>≥</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhich rearranges to\n", "itemtype": "equation", "pos": 69244, "prevtext": " where the last inequality uses the\nbound ${w^+}_{uv} + {w^-}_{uv} \\geq 1$. Thus, each edge $uv$ has LP\ncost at least $x_{uv}$, and so the edges joining $u$ and $T$ have\ntotal LP cost at least $\\alpha\\left\\lvert{{T}}\\right\\rvert/2$. Each such edge $uv$ incurs\ncluster-cost ${w^+}_{uv}$, which is at most $1$.  Thus, charging\n$(2/\\alpha)x_{uv}$ to each edge $uv$ for $v \\in T$ gives enough charge to pay\nfor the cluster-cost of edges with $v \\in T$, while each edge is\ncharged at most $2/\\alpha$ times its LP cost.\n\nFor $v \\in S-(T \\cup \\{u\\})$, we have $x_{uv} > \\alpha$, so each edge\n$uv$ incurs LP cost at least $\\alpha {w^+}_{uv}$ and incurs cluster cost at\nmost ${w^+}_{uv}$. Thus, charging such each edge $(1/\\alpha){w^+}_{uv}x_{uv}$ pays\nfor the cluster cost of these edges.\n\n\\smallskip\n\n{\\textbf{Case {{2}}:} \\textit{{A nonsingleton cluster $\\{u\\} \\cup T$ is output.}}} We first\nconsider edges inside $\\{u\\} \\cup T$, then we consider edges joining\n$\\{u\\} \\cup T$ with $S - (\\{u\\} \\cup T)$. Finally, we consider edges joining\n$T_i$ with $T_j$ for $i \\neq j$.\n\n\\textbf{Edges within $\\{u\\} \\cup T$.} Suppose $vz$ is an edge contained in $\\{u\\}\n\\cup T$, so that $vz$ incurs cluster-cost ${w^-}_{vz}$ and LP-cost at\nleast ${w^-}_{vz}(1-x_{vz})$. By the definition of $T$, we have\n$x_{uv}, v_{uz} \\leq \\alpha$.  Hence, by Observation~\\ref{obs}, we have\n$1-x_{vz} \\geq 1 - x_{uv} - x_{vz} \\geq 1-2\\alpha$. Thus, charging $\\frac{1}{1-2\\alpha}{w^-}_{vz}(1-x_{vz})$\nto these edges pays for their cluster-cost.\n\n\\textbf{Edges joining $\\{u\\} \\cup T$ with $S - (\\{u\\} \\cup T)$.} Let\n$z$ be a vertex outside $\\{u\\} \\cup T$. A \\emph{cross-edge} for $z$\nis an edge from $z$ to $\\{u\\} \\cup T$. We show that the cross-edges\nfor $z$ have total cluster-cost that is at most $\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\}$\ntimes their total LP-cost.  Note that whenever $vz$ is a cross-edge,\nwe have $x_{uv} \\leq \\alpha$, by the definition of $T$. Each\ncross-edge incurs $vz$ cluster-cost ${w^+}_{vz}$ and LP-cost\n${w^+}_{vz}x_{vz} + {w^-}_{vz}(1-x_{vz})$.\n\nIf in fact $x_{uz} \\geq 1-\\alpha$, then Observation~\\ref{obs} yields\n$x_{vz} \\geq x_{uz} - x_{uv} \\geq 1-2\\alpha$ for every cross-edge $v$,\nyielding LP-cost at least $\\frac{1}{1-2\\alpha}{w^+}_{vz}$; thus, such\nedges have cluster-cost at most $\\frac{1}{1-2\\alpha}$ times their LP\ncost.\n\nIt remains to handle the case $x_{uz} \\in (\\alpha, 1-\\alpha)$. Here,\nwe seek a lower bound on the total LP-cost of the cross-edges for\n$z$. Note that the total cluster cost of these edges is $\\sum_{v \\in\n  \\{u\\} \\cup T}{w^+}_{vz}$, which is at most $\\left\\lvert{{T}}\\right\\rvert$ since each\n${w^+}_{vz} \\leq 1$.\n\nBy Observation~\\ref{obs}, we have $x_{vz} \\geq x_{uz}-x_{uv}$ and $1 - x_{vz} \\geq 1 - x_{uz} - x_{uv}$\nfor each edge $vz$. It follows that the total LP-weight of the cross-edges for $z$\nis at least\n", "index": 43, "text": "\n\\[ \\sum_{v \\in \\{u\\}\\cup T}\\left[{w^+}_{vz}(x_{uz} - x_{uv}) + {w^-}_{vz}(1 - x_{uz} - x_{uv})\\right], \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex8.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in\\{u\\}\\cup T}\\left[{w^{+}}_{vz}(x_{uz}-x_{uv})+{w^{-}}_{vz}(1-x_{uz}-%&#10;x_{uv})\\right],\" display=\"block\"><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nUsing the bounds $\\sum_{v \\in \\{u\\} \\cup T}x_{uv} \\leq \\alpha(\\left\\lvert{{T}}\\right\\rvert + 1)/2$ and $x_{uv} \\leq \\alpha$ for $v \\in T$, we bound the subtracted sum as follows:\n\n", "itemtype": "equation", "pos": 69370, "prevtext": "\nwhich rearranges to\n", "index": 45, "text": "\n\\[ \\sum_{v \\in \\{u\\} \\cup T}\\left[{w^+}_{vz}x_{uz} + {w^-}_{vz}(1 - x_{uz})\\right] - \\sum_{v \\in \\{u\\}\\cup T}\\left[({w^+}_{vz} + {w^-}_{vz})x_{uv}\\right] \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex9.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in\\{u\\}\\cup T}\\left[{w^{+}}_{vz}x_{uz}+{w^{-}}_{vz}(1-x_{uz})\\right]-%&#10;\\sum_{v\\in\\{u\\}\\cup T}\\left[({w^{+}}_{vz}+{w^{-}}_{vz})x_{uv}\\right]\" display=\"block\"><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow><mo>-</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nNote that in the last inequality we rely on the fact that ${w^+}_{vz} + {w^-}_{vz} \\geq 1$.\nIt follows that the total LP cost is at least\n", "itemtype": "equation", "pos": 69707, "prevtext": "\nUsing the bounds $\\sum_{v \\in \\{u\\} \\cup T}x_{uv} \\leq \\alpha(\\left\\lvert{{T}}\\right\\rvert + 1)/2$ and $x_{uv} \\leq \\alpha$ for $v \\in T$, we bound the subtracted sum as follows:\n\n", "index": 47, "text": "\\begin{align*}\n  &\\sum_{v \\in \\{u\\} \\cup T} \\left[({w^+}_{vz} + {w^-}_{vz})x_{uv}\\right] =\\\\\n  & \\sum_{v \\in \\{u\\} \\cup T}x_{uv} + \\sum_{v \\in \\{u\\} \\cup T} \\left[({w^+}_{vz} + {w^-}_{vz} - 1)x_{uv}\\right] \\\\\n  &\\leq \\frac{\\alpha(\\left\\lvert{{T}}\\right\\rvert + 1)}{2} + \\sum_{v \\in \\{u\\} \\cup T} \\left[({w^+}_{vz} + {w^-}_{vz} - 1)x_{uv}\\right] \\\\\n  &= \\sum_{v \\in \\{u\\} \\cup T} \\left[({w^+}_{vz} + {w^-}_{vz} - 1)x_{uv} + \\frac{\\alpha}{2}\\right] \\\\\n  &\\leq \\sum_{v \\in \\{u\\} \\cup T} \\left[\\alpha({w^+}_{vz} + {w^-}_{vz}) - \\frac{\\alpha}{2}\\right].\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{v\\in\\{u\\}\\cup T}\\left[({w^{+}}_{vz}+{w^{-}}_{vz})x_{uv}%&#10;\\right]=\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><mrow><mo>[</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>]</mo></mrow></mrow><mo>=</mo><mi/></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{v\\in\\{u\\}\\cup T}x_{uv}+\\sum_{v\\in\\{u\\}\\cup T}\\left[({w^{+}}%&#10;_{vz}+{w^{-}}_{vz}-1)x_{uv}\\right]\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><mrow><mo>[</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>]</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\leq\\frac{\\alpha(\\left\\lvert{{T}}\\right\\rvert+1)}{2}+\\sum_{v\\in\\{%&#10;u\\}\\cup T}\\left[({w^{+}}_{vz}+{w^{-}}_{vz}-1)x_{uv}\\right]\" display=\"inline\"><mrow><mi/><mo>≤</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo fence=\"true\">|</mo><mi>T</mi><mo fence=\"true\">|</mo></mrow><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac></mstyle><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><mrow><mo>[</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex13.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum_{v\\in\\{u\\}\\cup T}\\left[({w^{+}}_{vz}+{w^{-}}_{vz}-1)x_{uv}+%&#10;\\frac{\\alpha}{2}\\right]\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><mrow><mo>[</mo><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow></msub></mrow><mo>+</mo><mstyle displaystyle=\"true\"><mfrac><mi>α</mi><mn>2</mn></mfrac></mstyle></mrow><mo>]</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex14.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\leq\\sum_{v\\in\\{u\\}\\cup T}\\left[\\alpha({w^{+}}_{vz}+{w^{-}}_{vz})%&#10;-\\frac{\\alpha}{2}\\right].\" display=\"inline\"><mrow><mrow><mi/><mo>≤</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder></mstyle><mrow><mo>[</mo><mrow><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mstyle displaystyle=\"true\"><mfrac><mi>α</mi><mn>2</mn></mfrac></mstyle></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\n a linear function in $x_{uz}$. We consider the behavior of this function on the interval $(\\alpha, 1-\\alpha)$.\n\nWhen $x_{uz} = \\alpha$, the lower bound simplifies to\n", "itemtype": "equation", "pos": 70406, "prevtext": "\nNote that in the last inequality we rely on the fact that ${w^+}_{vz} + {w^-}_{vz} \\geq 1$.\nIt follows that the total LP cost is at least\n", "index": 49, "text": "\n\\[ \\sum_{v \\in \\{u\\} \\cup T}\\left[{w^+}_{vz}x_{uz} + {w^-}_{vz}(1 - x_{uz}) - \\alpha({w^+}_{vz} + {w^-}_{vz}) + \\frac{\\alpha}{2}\\right].\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex15.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in\\{u\\}\\cup T}\\left[{w^{+}}_{vz}x_{uz}+{w^{-}}_{vz}(1-x_{uz})-\\alpha({%&#10;w^{+}}_{vz}+{w^{-}}_{vz})+\\frac{\\alpha}{2}\\right].\" display=\"block\"><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mrow><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow><mo>+</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>x</mi><mrow><mi>u</mi><mo>⁢</mo><mi>z</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mfrac><mi>α</mi><mn>2</mn></mfrac></mrow><mo>]</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhich is at least $\\alpha(\\left\\lvert{{T}}\\right\\rvert+1)/2$ since $\\alpha < 1/2$ implies $(1-\\alpha){w^-}_{vz} \\geq \\alpha{w^-}_{vz}$.\n\nWhen $x_{uz} = 1 - \\alpha$, the lower bound simplifies to\n", "itemtype": "equation", "pos": 70712, "prevtext": "\n a linear function in $x_{uz}$. We consider the behavior of this function on the interval $(\\alpha, 1-\\alpha)$.\n\nWhen $x_{uz} = \\alpha$, the lower bound simplifies to\n", "index": 51, "text": "\n\\[ \\sum_{v \\in \\{u\\} \\cup T}\\left[\\alpha {w^+}_{vz} + (1-\\alpha){w^-}_{vz} - \\alpha({w^+}_{vz} + {w^-}_{vz}) + \\frac{\\alpha}{2}\\right], \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex16.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in\\{u\\}\\cup T}\\left[\\alpha{w^{+}}_{vz}+(1-\\alpha){w^{-}}_{vz}-\\alpha({%&#10;w^{+}}_{vz}+{w^{-}}_{vz})+\\frac{\\alpha}{2}\\right],\" display=\"block\"><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mrow><mrow><mi>α</mi><mo>⁢</mo><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mfrac><mi>α</mi><mn>2</mn></mfrac></mrow><mo>]</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhich is again at least $\\alpha(\\left\\lvert{{T}}\\right\\rvert+1)/2$ since $(1-\\alpha){w^+}_{vz} \\geq \\alpha{w^+}_{vz}$.\n\nThus, when $x_{uz} \\in (\\alpha, 1-\\alpha)$, we conclude that the total\ncluster-cost of the cross-edges for $z$ is at most $2/\\alpha$ times\nthe total LP-cost of those edges. In all cases, charging\n$\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\} $ times the LP-cost of\nthe edges pays for their cluster-cost.\n\n\\textbf{Edges joining $T_i$ with $T_j$ for $i \\neq j$.}  These are the\ntrickiest edges to deal with. The problem is that these edges may have\nlow LP-cost and high cluster-cost, so we cannot \\emph{just} charge\nthese edges to pay for their cluster cost. Instead, we will charge\nedges inside the $T_i$, and we will charge against the bank.\n\nLet $v \\in T_i$. A \\emph{cross-edge} for $v$ is an edge\n$vw$ with $w \\in T_j$ for $j \\neq i$. Note that every edge joining\n$T_i, T_j$ with $i \\neq j$ has at least one endpoint that does not lie\nin $T_p$; as such, we will assume that $v \\notin T_p$.\n\nDefine quantities $A_v$ and $B_v$ as follows:\n\n", "itemtype": "equation", "pos": 71046, "prevtext": "\nwhich is at least $\\alpha(\\left\\lvert{{T}}\\right\\rvert+1)/2$ since $\\alpha < 1/2$ implies $(1-\\alpha){w^-}_{vz} \\geq \\alpha{w^-}_{vz}$.\n\nWhen $x_{uz} = 1 - \\alpha$, the lower bound simplifies to\n", "index": 53, "text": "\n\\[ \\sum_{v \\in \\{u\\} \\cup T}\\left[ (1-\\alpha){w^+}_{vz} + \\alpha{w^-}_{vz} - \\alpha({w^+}_{vz} + {w^-}_{vz}) + \\frac{\\alpha}{2}\\right], \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex17.m1\" class=\"ltx_Math\" alttext=\"\\sum_{v\\in\\{u\\}\\cup T}\\left[(1-\\alpha){w^{+}}_{vz}+\\alpha{w^{-}}_{vz}-\\alpha({%&#10;w^{+}}_{vz}+{w^{-}}_{vz})+\\frac{\\alpha}{2}\\right],\" display=\"block\"><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>v</mi><mo>∈</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>u</mi><mo stretchy=\"false\">}</mo></mrow><mo>∪</mo><mi>T</mi></mrow></mrow></munder><mrow><mo>[</mo><mrow><mrow><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mi>α</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo>+</mo><mrow><mi>α</mi><mo>⁢</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow></mrow><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo>+</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mfrac><mi>α</mi><mn>2</mn></mfrac></mrow><mo>]</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nSince $\\left\\lvert{{T_i}}\\right\\rvert = K+1$, we have\n\n", "itemtype": "equation", "pos": 72246, "prevtext": "\nwhich is again at least $\\alpha(\\left\\lvert{{T}}\\right\\rvert+1)/2$ since $(1-\\alpha){w^+}_{vz} \\geq \\alpha{w^+}_{vz}$.\n\nThus, when $x_{uz} \\in (\\alpha, 1-\\alpha)$, we conclude that the total\ncluster-cost of the cross-edges for $z$ is at most $2/\\alpha$ times\nthe total LP-cost of those edges. In all cases, charging\n$\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\} $ times the LP-cost of\nthe edges pays for their cluster-cost.\n\n\\textbf{Edges joining $T_i$ with $T_j$ for $i \\neq j$.}  These are the\ntrickiest edges to deal with. The problem is that these edges may have\nlow LP-cost and high cluster-cost, so we cannot \\emph{just} charge\nthese edges to pay for their cluster cost. Instead, we will charge\nedges inside the $T_i$, and we will charge against the bank.\n\nLet $v \\in T_i$. A \\emph{cross-edge} for $v$ is an edge\n$vw$ with $w \\in T_j$ for $j \\neq i$. Note that every edge joining\n$T_i, T_j$ with $i \\neq j$ has at least one endpoint that does not lie\nin $T_p$; as such, we will assume that $v \\notin T_p$.\n\nDefine quantities $A_v$ and $B_v$ as follows:\n\n", "index": 55, "text": "\\begin{align*}\n A_v &= \\sum\\{{w^+}_e {\\colon\\,} \\text{$e$ is a crossing edge for $v$}\\}, \\\\ \n B_v &= \\sum\\{{w^-}_{vz} {\\colon\\,} \\text{$z \\in T_i-v$}\\}.\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex18.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle A_{v}\" display=\"inline\"><msub><mi>A</mi><mi>v</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex18.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum\\{{w^{+}}_{e}{\\colon\\,}\\text{$e$ is a crossing edge for $v$}\\},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mo stretchy=\"false\">{</mo><mmultiscripts><mi>w</mi><none/><mo>+</mo><mi>e</mi><none/></mmultiscripts><mo rspace=\"4.2pt\">:</mo><mrow><mi>e</mi><mtext> is a crossing edge for </mtext><mi>v</mi></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mstyle></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex19.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle B_{v}\" display=\"inline\"><msub><mi>B</mi><mi>v</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex19.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\sum\\{{w^{-}}_{vz}{\\colon\\,}\\text{$z\\in T_{i}-v$}\\}.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mrow><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mo stretchy=\"false\">{</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts><mo rspace=\"4.2pt\">:</mo><mrow><mi>z</mi><mo>∈</mo><mrow><msub><mi>T</mi><mi>i</mi></msub><mo>-</mo><mi>v</mi></mrow></mrow><mo stretchy=\"false\">}</mo></mrow></mrow></mstyle></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": "\nwhere the second inequality follows from ${w^+}_{vz} + {w^-}_{vz} \\geq 1$ and the final equality follows from the fact that $\\left\\lvert{{T_i}}\\right\\rvert = K+1$ for $i < p$. On the other hand, since each ${w^+}_e \\leq 1$,\nwe have\n", "itemtype": "equation", "pos": 72466, "prevtext": "\nSince $\\left\\lvert{{T_i}}\\right\\rvert = K+1$, we have\n\n", "index": 57, "text": "\\begin{align*}\n\\sum_{z \\in N(v)}{w^+}_e \\geq A_v + \\sum_{z \\in T_i-v}{w^+}_{vz} &\\geq A_v + \\sum_{z \\in T_i-v}(1 - {w^-}_{vz})\\\\\n&= A_v + (K - B_v),\n\\end{align*}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex20.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\sum_{z\\in N(v)}{w^{+}}_{e}\\geq A_{v}+\\sum_{z\\in T_{i}-v}{w^{+}}_%&#10;{vz}\" display=\"inline\"><mrow><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>∈</mo><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder></mstyle><mmultiscripts><mi>w</mi><none/><mo>+</mo><mi>e</mi><none/></mmultiscripts></mrow><mo>≥</mo><mrow><msub><mi>A</mi><mi>v</mi></msub><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>∈</mo><mrow><msub><mi>T</mi><mi>i</mi></msub><mo>-</mo><mi>v</mi></mrow></mrow></munder></mstyle><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex20.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\geq A_{v}+\\sum_{z\\in T_{i}-v}(1-{w^{-}}_{vz})\" display=\"inline\"><mrow><mi/><mo>≥</mo><mrow><msub><mi>A</mi><mi>v</mi></msub><mo>+</mo><mrow><mstyle displaystyle=\"true\"><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>∈</mo><mrow><msub><mi>T</mi><mi>i</mi></msub><mo>-</mo><mi>v</mi></mrow></mrow></munder></mstyle><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mmultiscripts><mi>w</mi><none/><mo>-</mo><mrow><mi>v</mi><mo>⁢</mo><mi>z</mi></mrow><none/></mmultiscripts></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex21.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=A_{v}+(K-B_{v}),\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><msub><mi>A</mi><mi>v</mi></msub><mo>+</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>K</mi><mo>-</mo><msub><mi>B</mi><mi>v</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": " We charge the quantity $e(v)$ to the bank, and we charge\n${w^-}_{vz}$ to each edge $vz$ with $z \\in T_i$. This yields total\ncharge at least $A_v$, which is the total cluster-cost of the\ncross-edges for $v$.  Note that for each edge $vz$ charged this way,\nObservation~\\ref{obs} yields $1 - x_{vz} \\geq 1 - x_{uv} - x_{vz} \\geq\n1 - 2\\alpha$. Hence, $v$ charges the edge $vz$ at most\n$\\frac{1}{1-2\\alpha}$ times its LP-cost.  Observe that each edge in\n$T$ is only charged this way at its endpoints. (Furthermore, edges\nwhose endpoints lie in different $T_i, T_j$ with both $i,j < p$ are\nactually paid for twice.)\n\n\\smallskip\n\nIn total, we have paid for all the cluster-costs by making the following charges:\n\\begin{itemize}\n\\item Edges $vz$ within each cluster $T_i$ were charged at most\n  $\\frac{1}{1-2\\alpha}{w^-}_{vz}(1-x_{vz})$ to pay for themselves plus\n  at most $\\frac{2}{1-2\\alpha}$ to pay for edges joining $T_i$ to\n  $T_j$ for $i \\neq j$.  Thus, their total charge is at most\n  $\\frac{3}{1-2\\alpha}$ times their total LP cost.\n\\item Edges $vz$ for which $v \\in \\{u\\} \\cup T$ and $z \\in S - (\\{u\\} \\cup T)$ were charged at most $\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\}$ times\n  their LP cost.\n\\item The bank was charged $\\sum_{v \\in V}e(v)$. Thus, by\n  Lemma~\\ref{lem:c2bound}, the total charge to the bank is at\n  most $2C_2$.\n\\end{itemize}\nIt follows that the total cost is minimized when\n$\\frac{3}{1-2\\alpha} = \\frac{2}{\\alpha}$, which yields $\\alpha = 2/7$. For this choice of $\\alpha$,\nthe total charge is at most $7C_1 + 2C_2$, which is at most $9$ times the lower bound of $\\frac{7}{9}C_1 + \\frac{2}{9}C_2$.''\n\nGiven that the theoretical guarantees only establish approximation results, it is appropriate to compare the solution of the proposed relaxation with the solution of the original ILP on synthetic data. For this purpose, we created a simple graph comprising $35$ vertices grouped into five clusters of size $6$ and one cluster of size $5$: in order to ensure this cluster separation, we selected the weights as follows. For $u,v\\in V(G)$, we set\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere the second inequality follows from ${w^+}_{vz} + {w^-}_{vz} \\geq 1$ and the final equality follows from the fact that $\\left\\lvert{{T_i}}\\right\\rvert = K+1$ for $i < p$. On the other hand, since each ${w^+}_e \\leq 1$,\nwe have\n", "index": 59, "text": "\n\\[ e(v) \\geq \\left(\\sum_{z \\in N(v)}{w^+}_e\\right) - K \\geq A_v -\nB_v. \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex22.m1\" class=\"ltx_Math\" alttext=\"e(v)\\geq\\left(\\sum_{z\\in N(v)}{w^{+}}_{e}\\right)-K\\geq A_{v}-B_{v}.\" display=\"block\"><mrow><mrow><mrow><mi>e</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≥</mo><mrow><mrow><mo>(</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>z</mi><mo>∈</mo><mrow><mi>N</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>v</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></munder><mmultiscripts><mi>w</mi><none/><mo>+</mo><mi>e</mi><none/></mmultiscripts></mrow><mo>)</mo></mrow><mo>-</mo><mi>K</mi></mrow><mo>≥</mo><mrow><msub><mi>A</mi><mi>v</mi></msub><mo>-</mo><msub><mi>B</mi><mi>v</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": " \nand ${w^-}_{uv}=1-{w^+}{uv}$. We ran the ILP, the C$^3$ algorithm, and the clu for $\\gamma\\in\\{0.6,0.7,0.8,0.9,0.99\\}$; all three algorithms recovered the correct clusters without making errors. \nWe subsequently modified the clusters by randomly reversing the positive and negative weights of up to $20$ edges. All three algorithms recovered the correct clusters even in this scenario. \nSince large weight perturbations may change the clusters in a way that the ground truth becomes undetectable, for larger scale perturbation we decided to compare the solution of the C$^3$ algorithm to that of the ILP method. We again ran the ILP and C$^3$ algorithms on a graph with $35$ vertices, where the positive weights, ${w^+}_e$, were chosen randomly according to a multinomial distribution; we also considered a number of choices for the parameters of the distributions. The negative weights were chosen according to the formula ${w^-}_e=1-{w^+}_e$. For each set of weights, we compared the value of the objective function for the results obtained using the two algorithms. We observed that in all cases the value of objective functions, denoted by $f$, satisfied \n\n", "itemtype": "equation", "pos": -1, "prevtext": " We charge the quantity $e(v)$ to the bank, and we charge\n${w^-}_{vz}$ to each edge $vz$ with $z \\in T_i$. This yields total\ncharge at least $A_v$, which is the total cluster-cost of the\ncross-edges for $v$.  Note that for each edge $vz$ charged this way,\nObservation~\\ref{obs} yields $1 - x_{vz} \\geq 1 - x_{uv} - x_{vz} \\geq\n1 - 2\\alpha$. Hence, $v$ charges the edge $vz$ at most\n$\\frac{1}{1-2\\alpha}$ times its LP-cost.  Observe that each edge in\n$T$ is only charged this way at its endpoints. (Furthermore, edges\nwhose endpoints lie in different $T_i, T_j$ with both $i,j < p$ are\nactually paid for twice.)\n\n\\smallskip\n\nIn total, we have paid for all the cluster-costs by making the following charges:\n\\begin{itemize}\n\\item Edges $vz$ within each cluster $T_i$ were charged at most\n  $\\frac{1}{1-2\\alpha}{w^-}_{vz}(1-x_{vz})$ to pay for themselves plus\n  at most $\\frac{2}{1-2\\alpha}$ to pay for edges joining $T_i$ to\n  $T_j$ for $i \\neq j$.  Thus, their total charge is at most\n  $\\frac{3}{1-2\\alpha}$ times their total LP cost.\n\\item Edges $vz$ for which $v \\in \\{u\\} \\cup T$ and $z \\in S - (\\{u\\} \\cup T)$ were charged at most $\\max\\{\\frac{1}{1-2\\alpha}, \\frac{2}{\\alpha}\\}$ times\n  their LP cost.\n\\item The bank was charged $\\sum_{v \\in V}e(v)$. Thus, by\n  Lemma~\\ref{lem:c2bound}, the total charge to the bank is at\n  most $2C_2$.\n\\end{itemize}\nIt follows that the total cost is minimized when\n$\\frac{3}{1-2\\alpha} = \\frac{2}{\\alpha}$, which yields $\\alpha = 2/7$. For this choice of $\\alpha$,\nthe total charge is at most $7C_1 + 2C_2$, which is at most $9$ times the lower bound of $\\frac{7}{9}C_1 + \\frac{2}{9}C_2$.''\n\nGiven that the theoretical guarantees only establish approximation results, it is appropriate to compare the solution of the proposed relaxation with the solution of the original ILP on synthetic data. For this purpose, we created a simple graph comprising $35$ vertices grouped into five clusters of size $6$ and one cluster of size $5$: in order to ensure this cluster separation, we selected the weights as follows. For $u,v\\in V(G)$, we set\n\n", "index": 61, "text": "\\begin{align}\n{w^+}_{uv} &= \\gamma,\\  \\  \\  \\  \\text{if $u$ and $v$ are in the same cluster}\\\\\\nonumber\n{w^+}_{uv} &= 1-\\gamma,\\  \\  \\  \\  \\text{otherwise},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}_{uv}\" display=\"inline\"><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\gamma,\\ \\ \\ \\ \\text{if $u$ and $v$ are in the same cluster}\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mi>γ</mi><mo rspace=\"22.5pt\">,</mo><mrow><mtext>if </mtext><mi>u</mi><mtext> and </mtext><mi>v</mi><mtext> are in the same cluster</mtext></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex23.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{w^{+}}_{uv}\" display=\"inline\"><mmultiscripts><mi>w</mi><none/><mo>+</mo><mrow><mi>u</mi><mo>⁢</mo><mi>v</mi></mrow><none/></mmultiscripts></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex23.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=1-\\gamma,\\ \\ \\ \\ \\text{otherwise},\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mrow><mn>1</mn><mo>-</mo><mi>γ</mi></mrow><mo rspace=\"22.5pt\">,</mo><mtext>otherwise</mtext></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06476.tex", "nexttext": " \nwhich shows that in practice, the C$^3$ algorithm performed much better than suggested by the theoretical analysis. Furthermore, the clusters generated by the ILP and the C$^3$ algorithm showed more than $90\\%$ overlap in terms of participating nodes.\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nand ${w^-}_{uv}=1-{w^+}{uv}$. We ran the ILP, the C$^3$ algorithm, and the clu for $\\gamma\\in\\{0.6,0.7,0.8,0.9,0.99\\}$; all three algorithms recovered the correct clusters without making errors. \nWe subsequently modified the clusters by randomly reversing the positive and negative weights of up to $20$ edges. All three algorithms recovered the correct clusters even in this scenario. \nSince large weight perturbations may change the clusters in a way that the ground truth becomes undetectable, for larger scale perturbation we decided to compare the solution of the C$^3$ algorithm to that of the ILP method. We again ran the ILP and C$^3$ algorithms on a graph with $35$ vertices, where the positive weights, ${w^+}_e$, were chosen randomly according to a multinomial distribution; we also considered a number of choices for the parameters of the distributions. The negative weights were chosen according to the formula ${w^-}_e=1-{w^+}_e$. For each set of weights, we compared the value of the objective function for the results obtained using the two algorithms. We observed that in all cases the value of objective functions, denoted by $f$, satisfied \n\n", "index": 63, "text": "\\begin{align}\nf(\\text{ILP}) \\leq f(\\text{C$^3$})<2f(\\text{ILP}),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle f(\\text{ILP})\\leq f(\\text{C${}^{3}$})&lt;2f(\\text{ILP}),\" display=\"inline\"><mrow><mrow><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mtext>ILP</mtext><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≤</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mtext>C</mtext><msup><mi/><mn>3</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>&lt;</mo><mrow><mn>2</mn><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mtext>ILP</mtext><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]