[{"file": "1601.00200.tex", "nexttext": "\n\nwhere coefficient $\\varepsilon$ linearly depends inversely on the probe pulse width $\\Delta\\omega_3$ as $\\varepsilon=a \\Gamma /\\Delta\\omega_3 + b$ with $a=1.8$ and $b=0.38$. Threshold time delay for maximum enhancement (solid curve) and values obtained from Eq.(\\ref{AriTau}) (dots) are shown in Fig.~1. It is worth noting that although enhancement at positive probe delay has been briefly mentioned previously in our work~\\cite{AriPNAS} and also in~\\cite{Marrocco1,Roy2,Kliewer}, an explicit accurate formula Eq.(\\ref{AriTau}) is obtained here for the first time.\n\n\n\nNext, we compare the CSRS results to the experimental data obtained for pyridine in liquid-phase. From the view point of the obtained solutions Eq.(\\ref{AriSolutions}), an important deviation between the CSRS and CARS signals is either the subtraction or addition of the Raman detuning inside the argument of the Faddeeva function as $\\zeta_\\pm = [(\\delta_{aS,S} W_{123}^2/\\Delta\\omega_3^2 \\mp \\Delta + i \\Gamma/2)t_{FWM} - i \\tau/t_{FWM}]/\\sqrt{2}$ . Moreover, a sign difference in Eq.({\\ref{AriSolutions}}) suggests that the CSRS and CARS signal amplitudes are out of phase. \nComparison between CSRS and CARS has been studied, for instance, in~\\cite{Tehver, Carreira}. A slight deviation between simultaneously recorded CARS and CSRS signals has been also reported in~\\cite{Jiahua}, but otherwise, time-resolved CSRS and CARS are quite the same. \n\nFig.~2 illustrates one-to-one comparison between the experimental and theoretical data.\nThe experimental data, part of which has been previously reported in our work~\\cite{AriOL} were taken for pyridine in liquid-phase by using the Coherent Inc., Ti-sapphire amplified kilohertz laser system including the optical parametric amplifiers. The excitation pump and Stokes pulses were centered in the middle of a pair of pyridine molecular vibrational modes.These Raman modes are in-plane ring-bend $1030$ cm$^{-1}$ and ring-breathing $991$ cm$^{-1}$ separated by $39$ cm$^{-1}$ the corresponding beating period of $0.855$ ps and both the lines have similar spectral width ($\\approx 2.2$) cm$^{-1}$  and Raman cross-sections~\\cite{Kaiser1}.  Their dephasing lifetimes are about 2.55 ps with a slight deviation ($\\approx 20\\%$)~\\cite{Kaiser2}. Three different probe pulse widths: $300$ cm$^{-1}$ (in the top left), $60$ cm$^{-1}$ (in the middle left) and $15$ cm$^{-1}$ (in the bottom left) were selected. For the broadband probe, the two Raman lines are unresolved, thus exhibiting a beating in time-domain, whereas, for narrowband probe, these lines are well resolved. \n\n\n\\begin{figure}[htbp]\n\\centering\n\\fbox{\\includegraphics[width=\\linewidth]{AriFig2.pdf}}\n\\caption{(Color online) The experimental data (left column), theoretical sum spectral data (center column), and extracted CSRS data (right column). All data are normalized. The experimental data were taken with probe pulse widths $300$  cm$^{-1}$, $60$ cm$^{-1}$ and $15$ cm$^{-1}$. A separation of Raman lines of pyridine molecules is $39$ cm$^{-1}$  with a beating period of $0.855$ ps.}\n\\end{figure}\n\nThe normalized theoretical results obtained by Eq.(\\ref{AriSolutions}) with and without FWM  are shown in the next two columns. As mentioned previously, the width and duration of FWM change accordingly with probe pulse time duration as well as excitation spectral width (not shown here). \nIn the theory, the narrowband probe pulse width is increased by 1, 4, and 20 times to be consistent with our experimental data. It is chosen, in addition, that the two Raman line-widths differ by 20 $\\%$ and a ratio between the Raman line-width and separation is equal to the ratio of 2.2 and 39 cm$^{-1}$.\nThe theoretically inferred, clean CSRS results are depicted in the right column of Fig.~2, also for three different probe widths. Maxima of the FWM obviously remain at zero delay, though this is not the case for the CSRS for the narrowband probe. At the threshold time delay which is longer than the time duration of FWM, the FWM is drastically suppressed and, at the same time, the CSRS signal is enhanced. In the experiment, probe pulse shape is not strictly Gaussian, rather it is a sinc-square pulse in time- and frequency-domain. However, the theoretical results for the Gaussian probe pulse nicely fit the experimental data. This is expected for two main reasons.  First, in the experiment, a narrowband probe pulse was not ideally sinc-square shaped, rather it was a quasi-Gaussian pulse. Second, the central lobe of sinc function is the dominant part, thus it can be approximated with a Gaussian form. It is worth mentioning that a fine-tuning effect such as additional background subtraction at the optimal probe delay exactly on the first leading node of sinc function~\\cite{AriScience,AriOL,Prince,Hamaguchi} is, of course, not seen in the theory. \nHowever, the detailed understanding of the existence of CARS/CSRS enhancement, is indeed, the most crucial part, especially for molecules such as pyridine with long lasting molecular vibrations.\n\nIn conclusion, we obtained exact solutions in terms of the Faddeeva function for CARS/CSRS spectroscopy.\nWe showed that the time-resolved coherent Raman spectroscopic experiments can be quantitatively elucidated with all Gaussian input laser pulses.  This is a simple interpretative tool to unearth buried pure coherent Raman spectra within the non-resonant background contamination. The efficient enhancement of coherent Raman scattering at certain threshold time delay of probe pulse with a variable spectral width has been obtained. This phenomenon adds on to the previous understanding of robust and superior background-suppressed coherent anti-Stokes Raman spectroscopy.\n\nWe would like to thank M. Cicerone, C. Camp Jr, Y.J. Lee, M. Zhi, D. Pestov, V. Yakovlev and A. Sokolov for their fruitful discussions. \n\n\n\n\n\\begin{thebibliography}{100}\n\n\n\\bibitem{Terhune} P.D. Maker, and R.W. Terhune, \"Study of optical effects due to an induced polarization third order in the electric field strength\", Phys. Rev., {\\bf148}, 990 (1966) \n\n\n\\bibitem{AriScience} D. Pestov,  R.K. Murawski, G.O. Ariunbold, X. Wang, M. Zhi, A.V. Sokolov, V.A. Sautenkov, Yu.V. Rostovtsev, A. Dogariu, Yu Huang, and M.O. Scully,\"Optimizing the laser-pulse configuration for coherent Raman spectroscopy\", Science {\\bf 316}, 265-268 (2007).\n\\bibitem{AriPNAS} D. Pestov, X.Wang, G.O. Ariunbold, R.K. Murawski, V.A. Sautenkov, A. Dogariu, A.V. Sokolov, and M.O. Scully, \"Single-shot detection of bacterial endospores via coherent Raman spectroscopy\", PNAS, {\\bf 105}, 422-427 (2008).  \n\n\n\\bibitem{Duncan} M.D. Duncan, J. Reintjes, and T.J. Manuccia, \"Scanning coherent anti-Stokes microscope\", Opt Lett,{\\bf7}, 350-352 (1982).\n\\bibitem{Zumbush}\tA. Zumbusch, G.R. Holtom, and X.S. Xie, \"Three-dimensional vibrational imaging by coherent anti-Stokes Raman scattering\", Phys. Rev. Lett., {\\bf82}, 4142-4145 (1999).\n\\bibitem{Anil} S. Roy, J.R. Gord, and A.K. Patnaik, \"Recent advances in coherent anti-Stokes Raman scattering spectroscopy: Fundamental developments and applications in reacting flows\", Prog. Energ. Combust, {\\bf36},280-306 (2010).\n\n\n\\bibitem{Tolles}  W.M. Tolles, J.W. Nibler, J.R. McDonald, and A.B. Harvey, \"A review of the theory and application of coherent anti-Stokes Raman spectroscopy\", Appl. Spectrosc., {\\bf31}, 253-271 (1977).\n\\bibitem{Zheltikov}\tA. M. Zheltikov, \"Coherent anti-Stokes Raman scattering: from proof-of-the-principle experiments to femtosecond CARS and higher order wave-mixing generalizations\", J. Raman Spectrosc,{\\bf31}, 653-667 (2000).\n\\bibitem{Silberberg}\tY. Silberberg, \"Quantum coherent control for nonlinear spectroscopy and microscopy\", Annu. Rev. Phys. Chem., {\\bf60}, 277-292 (2009).\n\\bibitem{Mogilevsky}\tG. Mogilevsky, L.Borland, M.Brickhouse, and A.W. Fountain III, \"Raman spectroscopy for homeland security applications\", International J. Spec., {\\bf2012}, 808079 (2012).\n\\bibitem{Xie book} \tJi-X. Cheng, and X.S. Xie, {\\em Coherent Raman scattering microscopy}, (CRC press,2013).  \n\\bibitem{Camp}\tC.H. Camp Jr, and M. Cicerone, \"Chemically selective bioimaging with coherent Raman scattering\", Nat Photonics, {\\bf9}, 295-305 (2015).\n\\bibitem{Austin} L. A. Austin, and S. Osseiran, \"Raman technologies in cancer diagnostics\", Analyst, 2016 (2015).\n\\bibitem{Kraft1} C. Krafft, I.W. Schie, T. Meyer, and M. Schmidth, \"Developments in spontaneous and coherent Raman scattering microscopic imaging for biomedical applications\", Chem. Soc. Rev., 2016 (2015). \n\n\n\\bibitem{Scully}  M.O. Scully, G.W. Kattawar, R.P. Lucht, T.Opratrny, H.Pilloff, A.Rebane, A.V. Sokolov, and M.S. Zubairy, \"FAST CARS: Engineering a laser spectroscopic technique for rapid identification of bacterial spores\", PNAS, {\\bf99}, 10994-11001 (2002).\n\n\n\n\\bibitem{AriOL} D. Pestov, G.O. Ariunbold, X. Wang, R.K. Murawski, V.A. Sautenkov, A.V. Sokolov, and M.O. Scully, \"Coherent versus incoherent Raman scattering: Molecular coherence excitation and measurement\", Opt Lett, {\\bf32},1725-1727 (2007).\n\\bibitem{Hamaguchi} H. Kano, and H. Hamaguchi, \"Dispersion-compensated supercontinuum generation for ultrabroadband multiplex coherent anti-Stokes Raman scattering spectroscopy\", J. Raman Spectrosc., {\\bf37}, 411-415 (2006).\n\\bibitem{Prince} B.D. Prince, A. Chakraborty, B.M. Prince, H.U. Stauffer \"Development of simultaneous frequency-and time-resolved coherent anti-Stokes Raman scattering for ultrafast detection of molecular Raman spectra\", J. Chem. Phys., {\\bf125}, 44502 (2006). \n\\bibitem{Jiahua}\tJ. Peng, D. Pestov, M.O. Scully, and A.V. Sokolov, \"Simple setup for hybrid coherent Raman microspectroscopy\", J. Raman Spectrosc., {\\bf40}, 795-799 (2009).\n\\bibitem{Selm} R. Selm, M. Winterhalder, A. Zumbusch, G. Krauss, T. Hanke, A. Sell, and A. Leitenstorfer, \"Ultrabroadband background-free coherent anti-Stokes Raman scattering microscopy based on a compact Er:fiber laser system\", Opt Lett, {\\bf35}, 3282-3284 (2010). \n\\bibitem{Konorov}\tS.O. Konorov, M.W. Blades, and R.F. Turner, \"Lorentzian amplitude and phase pulse shaping for nonresonant background suppression and enhanced spectral resolution in coherent anti-Stokes Raman scattering spectroscopy and microscopy\", Appl Spectrosc, {\\bf64}, 767-774 (2010).\n\\bibitem{Marangoni} V. Kumar,R. Osellame, R. Ramponi, G. Cerullo, and M. Marangoni, \"Background-free broadband CARS spectroscopy from a 1 MHz ytterbium laser\", Opt Lett, {\\bf19}, 15143-15148 (2011).\n\\bibitem{Stauffer1}\tH. Stauffer, J.D. Miller, S. Roy, J.R. Gord, and T.R. Meyer, \"Communication: Hybrid femtosecond/picosecond rotational coherent anti-Stokes Raman scattering thermometry using a narrowband time-asymmetric probe pulse\", J Chem Phys, {\\bf136}, 111101 (2012). \n\\bibitem{Stauffer2} H. Stauffer, J.D. Miller, M.N. Slipchenko, T.R. Meyer, B.D. Prince, S. Roy, and J.R. Gord, \"Time-and frequency-dependent model of time-resolved coherent anti-Stokes Raman scattering (CARS) with a picosecond-duration probe pulse\", J.Chem. Phys., {\\bf140}, 024316 (2014).\n\n\n\n\n\\bibitem{Marc Lee}\tY.J. Lee, S.H. Parekh, Y.H. Kim, and M.T. Cicerone, \"Optimized continuum from a photonic crystal fiber for broadband time-resolved coherent anti-Stokes Raman scattering\", Opt. Express, {{\\bf18}}, 4371-4379 (2010).\n\n\n\n\n\\bibitem{Marrocco1}\tM. Marrocco, Time-domain coherent anti-Stokes Raman scattering in terms of the time-delayed Yuratich equation, Opt. Lett., {{\\bf39}}, 4831-4834 (2014).\n\\bibitem{Marrocco2}\tM.Marrocco, Closed-form solutions of coherent anti-Stokes Raman signals generated by means of time asymmetric probe pulses, J. Raman Spectrosc., {{\\bf46}}, 683-690 (2015).\n\n\n\\bibitem{Mukamel book}\tS. Mukamel, {{\\em Principal of nonlinear optical spectroscopy}}, (Oxford University Press, 1995).\n\\bibitem{He book}\tG. He, {{\\em Nonlinear optics and photonics}}, (Oxford University Press, 2015).\n\n\n\n\\bibitem{Carreira} L.A. Carreira, L.P. Goss, and T.B. Malloy, \"Comparison of the coherent anti-Stokes and coherent Stokes Raman line shapes of the $v_1$ line of $\\beta$-carotene near a one photon resonance\", J. Chem. Phys., {\\bf69}, 855 (1978).\n\\bibitem{Tehver} I. Tehver, H. Kaasik, and V. Hiznyakov, \"Excitation profiles of resonant coherent Raman scattering by impurity molecules\", J. Raman Spectrosc., {{\\bf42}}, 1958-1962 (2011). \n\n\n\n\\bibitem{Yuratich} M.A. Yuratich, \"Effects of laser linewidth on coherent anti-Stokes Raman spectroscopy\", Mol Phys, {\\bf38}, 625-655 (1979).\n\\bibitem{Dudovich}\tN. Dudovich, D. Oron, and Y. Silberberg, \"Single-pulse coherently controlled nonlinear Raman spectroscopy and microscopy\", Lett. Nat., {{\\bf418}}, 512-514 (2002).\n\\bibitem{Oron}\tD. Oron, N.Dudovich, and Y. Silberberg, \"Femtosecond phase-and-polarization control for background-free coherent anti-Stokes Raman scattering microscopy, Phys. Rev. Lett., {{\\bf90}}, 213902 (2003). \n\n\n\n\\bibitem{Faddeeva} V. N. Faddeeva, and N. N. Terent'ev, \"Tables of values of the function $w(z)=\\exp(-z^2)(1+2i/\\sqrt{\\pi}\\int_0^z\\exp(t^2)\\text{d}t)$ for complex argument\", Gosud. Izdat. Teh-Teor. Lit.,(1954).\n\\bibitem{Ali} M.R. Zaghloul, and  A.N. Ali, \"ACM Transactions on Mathematical Software\", {\\bf38}, 15 (2011).\n\\bibitem{Abrarov} S.M. Abrarov, and B.M. Quine, \"Accurate Approximations for the Complex error function with small imaginary argument\", J. Math. Res., {\\bf7}, 44-53(2015).\n\n\n\\bibitem{Marc Liu}\tY. Liu, Y.J. Lee, and M.T. Cicerone, \"Broadband CARS spectral phase retrieval using time-domain Kramers-Kronig transform\", Opt. Lett., {\\bf34}, 1363-1365 (2009).\n\\bibitem{Marc Camp}  C.H. Camp, Y.J. Lee, J.M. Heddleston, C.M. Hartshorn, A.R.H. Walker, J.N. Rich, J.D. Lathia, and M.T. Cicerone, \"High-speed coherent Raman fingerprint imaging of biological tissues\", Nat. Photonics, {{\\bf8}}, 627-634 (2014).\n\n\n\\bibitem{Roy2} S. Roy, P.S. Hsu, N. Jiang, J.R. Gord, W.D. Kulatilaka, H.U. Stauffer, and J.R. Gord, \"Direct measurements of collisionally broadened Raman linewidths of CO2 S-branch transitions.\", J. Chem. Phys. {\\bf 138}, 024201 (2013).\n\\bibitem{Kliewer} C.J. Kleiwer, A. Bohlin, E. Nordstr{$\\rm \\ddot{o}$}m, B.D. Patterson, P.E. Bengtsson, and T.B. Settersten, \"Time-domain measurements of S-branch N2?N2 Raman linewidths using picosecond pure rotational coherent anti-Stokes Raman spectroscopy\", Appl. Phys. B {\\bf 108}, 419 (2012).\n\n\n\\bibitem{Kaiser1}\tR. Leonhardt, W. Holzapfel, W. Zinth, and W. Kaiser, \"Terahertz beats of vibrational modes studied by femtosecond coherent Raman spectroscopy\", Revue Phys. Appl., {\\bf22}, 1735-1741 (1987). \n\\bibitem{Kaiser2} W. Zinth, and W. Kaiser, \"Ultrafast coherent Raman spectroscopy\", in proceedings of Lasers and Synergetics, R. Graham, A. Wunderlin ed. ( Springer-Verlag 1987). \n\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 11858, "prevtext": "\n\n\\title{Quantitative interpretation of time-resolved coherent anti-Stokes Raman spectroscopy with all Gaussian pulses}\n\n\\author{Gombojav O. Ariunbold}\n\\affiliation{Department of Physics and Astronomy, Mississippi State University, Starkville, MS 39762, USA}\n\n\\author{Narangerel Altangerel}\n\\affiliation{Department of Physics and Astronomy, Texas A${\\rm \\&}$M University, College Station, Texas 77843, USA}\n\n\\begin{abstract}\nCoherent Raman scattering spectroscopy is studied purposely, with the Gaussian ultrashort pulses as a hands-on elucidatory extraction tool of the clean coherent Raman resonant spectra from the overall measured data contaminated with the non-resonant four wave mixing background. The integral formulae for both the coherent anti-Stokes and Stokes Raman scattering are given in the semiclassical picture, and the closed-form solutions in terms of a complex error function are obtained. An analytic form of maximum enhancement of pure coherent Raman spectra at  threshold time delay depending on bandwidth of probe pulse is also obtained. The observed experimental data for pyridine in liquid-phase are quantitatively elucidated and the inferred time-resolved coherent Raman resonant results are reconstructed with a new insight.\n\\end{abstract}\n\n\n\n                          \n                          \n\n\\maketitle \n\n\n\n\nCoherent anti-Stokes Raman scattering is a powerful spectroscopic technique. Since its first demonstration~\\cite{Terhune}, recent significant developments of the detection of bacterial spores~\\cite{AriScience,AriPNAS}, coherent Raman microscopy for biological tissues~\\cite{Duncan,Zumbush}, gas-phase thermometry of reacting and non-reacting flows~\\cite{Anil} and many others (see, recent reviews~\\cite{Xie book,Camp,Austin,Kraft1, Mogilevsky, Silberberg, Zheltikov,Tolles}) have been the state-of-art success of this fascinating technique. Implementation of ultrafast laser pulses is particularly the key ingredient here~\\cite{Scully}. In the ultrafast coherent Raman scattering process, two pulses (pump and Stokes) resonantly excite molecular Raman vibrations in unison and a third pulse (probe) then scatters off from these coherently vibrating molecules. The scattered light in coherent anti-Stokes Raman scattering (CARS) is blue-shifted as opposed to the red-shifted light in coherent Stokes Raman scattering (CSRS). \nHowever, the overall measured spectral data are contaminated with the non-resonant four wave mixing background. Among various techniques to overcome this four wave mixing (FWM), CARS experiments with broadband (fs) pump and Stokes excitation pulses with a narrowband (ps) shaped and delayed probe pulse have been successfully demonstrated~\\cite{AriScience,AriPNAS, AriOL, Hamaguchi, Prince, Stauffer1, Stauffer2, Selm, Konorov, Marangoni, Jiahua}. Time-resolved CARS spectrogram data are a collection of spectra recorded at each probe pulse time delay (for instance, see~\\cite{AriScience,AriPNAS,AriOL}). \nBy delaying probe pulse with respect to the excitation pulses, one can reveal the rich time-resolved feature of the CARS process, in addition to background-suppressed CARS spectra selected at fixed optimal time delay within the spectrogram data. \nThe efficient FWM eliminations have been recently demonstrated with probe pulses shaped in time- and frequency-domain as in sinc-square~\\cite{AriScience,AriOL,AriPNAS,Prince,Stauffer1,Stauffer2}, square-sinc~\\cite{Selm}, exponential-Lorentzian~\\cite{Marangoni, Stauffer1, Stauffer2, Konorov} and Gaussian-Gaussian~\\cite{Jiahua} forms.\nParticularly, experiments on the impulsive CARS, where a common broadband excitation pulse that contains both pump and Stokes portions with degenerate center frequencies accompanied with a delayed narrowband probe pulse, have been reported in~\\cite{Selm, Marc Lee, Jiahua}, and\nits approximate closed-form solutions with all above-mentioned pulse shapes have been obtained in~\\cite{Marrocco1,Marrocco2}.  \n\nHowever, an accurate extraction of the clean coherent Raman spectra without FWM contamination for various pulse shapes in the entire time delay range still heavily depends on trusting numerical efforts, usually without proper interpretations of the actual ongoing processes. Therefore, a simple deductive tool with a sufficient quantitative interpretation for the time-resolved coherent Raman scattering experiments is on demand.\n\n\n\nIn this letter, we study the time-resolved CARS and CSRS with a Gaussian-Gaussian probe pulse and  obtain the exact closed-form solutions beyond impulsive excitation. The obtained simple solutions with Gaussian pulses can interpret the main features of coherent Raman spectroscopy without even performing rigorous simulations with other non-Gaussian sophisticated probe pulses. The present letter is organized as follows. First, a suitable theoretical description of CARS/CSRS signals is given.\nThen, the exact solutions for Gaussian pulses are derived. Finally, the time-resolved CSRS experimental data are explained, followed by a conclusion.\n\n\n\n\n\nLet us start with a theoretical description of the third-order nonlinear process.\nThe overall time-resolved signal\nis expressed as a sum of the FWM and CARS or CSRS signals as $| P^{(3)}(\\omega_{aS,S},\\tau)|^2=| P_{FWM}^{(3)}(\\omega_{aS,S},\\tau)+P_{CARS,CSRS}^{(3)}(\\omega_{aS,S},\\tau)|^2$ where the explicit integral form for the FWM signal is given by $P_{FWM}^{(3)}(\\omega_{aS,S},\\tau)  =\nc_0 \\int_{-\\infty}^\\infty d\\omega  { E}_{3}(\\delta_{aS,S}\\mp\\omega,\\tau) S_{aS,S}(\\omega)$ and for the CARS/CSRS it is obtained as\n\n\\begin{eqnarray} \\label{AriFormula}\n\nP^{(3)}_{CARS,CSRS}(\\omega_{aS,S},\\tau)  = \n\n\n c_{1,2} \\int_{-\\infty}^\\infty  \nd\\omega \\frac{{ E}_3(\\delta_{aS,S}\\mp\\omega,\\tau) }{\\Delta-\\omega \\mp i\\Gamma/2}\nS_{aS,S}(\\omega) \n\n\\end{eqnarray}\n\n\nHere $E_{1,2,3}$ are electric fields for pump, Stokes and probe ultrashort pulses with the corresponding center frequencies $\\omega^0_{1,2,3}$, whereas $\\omega_{aS,S}$ and $\\tau$ are the frequencies of the anti-Stokes and Stokes pulses and delay of the probe pulse.\n$S_{aS}(\\omega)  = \\int_{-\\infty}^\\infty d\\omega'{{ E}_1(\\omega'){E}_2^*(\\omega'-\\omega)}$\nand $S_{S}(\\omega)  = \\int_{-\\infty}^\\infty d\\omega'{{ E}_1(\\omega'+\\omega){E}_2^*(\\omega')}$ are the convolutions.  $c_{1,2}$ and $c_0$ are constant complex coefficients, and also an extra common term ${\\rm exp}( i\\omega_3^0\\tau)$ is omitted here. The other parameters are $\\Delta=\\Omega_R - (\\omega_1^0-\\omega_2^0)$ (Raman detuning with $\\Omega_R$ being Raman vibrational frequency), $\\omega_{aS,S}^0 = \\omega_3^0 \\pm \\Delta\\omega^0$ (center frequencies of anti-Stokes or Stokes signal) and $\\delta_{aS,S} = \\omega_{aS,S}-\\omega_{aS,S}^0$ (detunings for CARS or CSRS signal). A rigorous CARS/CSRS theory has been developed in~\\cite{He book, Mukamel book, Xie book, Tehver, Yuratich, Zheltikov, Carreira, Oron, Dudovich}. In derivation of Eq.(\\ref{AriFormula}), we assume that phase matching condition is satisfied and any propagation effect is not included here for the sake of simplicity without losing the essential ingredients of the coherent Raman processes. The above formula Eq.(\\ref{AriFormula}) is, indeed, in its most convenient form because the integration variables and their limits are carefully chosen here. The CARS formula has been derived in~\\cite{Marrocco1,Marrocco2} as time-delayed Yuratich equations~\\cite{Yuratich} for the first time to our knowledge, like the formula for the CSRS in the present letter. Multiple Raman resonances can be included simply as a sum of the multiple Lorentzians in Eq.(\\ref{AriFormula}) with the corresponding coefficients $c_{1,2}$.\n\n\n\n\nIn the following, we present the exact solutions for Gaussian pump, Stokes and probe pulses.\nWith this assumption, the complicated integral formula is straightforwardly evaluated to achieve closed-form solutions. The CARS/CSRS solutions of Eq.(\\ref{AriFormula}) are found to be\n\n\\begin{eqnarray}   \\label{AriSolutions}\n\n&&{P^{(3)}_{CARS,CSRS}(\\omega_{aS,S},\\tau)}=\n\\nonumber\\\\\n&&\\mp i c_{1,2}'\nW_{12} w(\\zeta_{\\pm})\n{\\rm e}^{-\\frac{\\tau^2}{2t_{FWM}^2}}\n{\\rm e}^{- 2ln2\\frac{\\delta_{aS,S}^2}{\\Delta\\omega_{123}^2}}\n {\\rm e}^{i\\delta_{aS,S}\\frac{\\Delta\\omega_3^2}{\\Delta\\omega_{123}^2}\\tau}\n\n\\end{eqnarray}\n\nwhere the FWM solution is obtained as $P_{FWM}^{(3)}(\\omega_{aS,S},\\tau) = c_0' W_{12} W_{123}$ $\n{\\rm exp} (-{\\tau^2}/{2t_{FWM}^2}) $ ${\\rm exp}(- 2ln2{\\delta_{aS,S}^2}/{\\Delta\\omega_{123}^2})$ $ {\\rm exp}(i\\delta_{aS,S}\\tau{\\Delta\\omega_3^2}/\\Delta\\omega_{123}^2)$.\nThe parameters here include $c_{0}'={\\pi c_{0} A_1A_2^*A_3}/{4ln2}$ and $c_{1,2}'={\\pi^{3/2} c _{1,2}A_1A_2^*A_3}/\\sqrt{8ln2}$ (modified constant coefficients with the input pulses amplitudes $A_{1,2,3}$), $\\Delta\\omega_{1,2,3}$ (spectral full width at half maxima (FWHM) of the input pulses) and the rest involves $W_{12}^2 = \\Delta\\omega_1^2 \\Delta\\omega_2^2 / (\\Delta\\omega_{1}^2 + \\Delta\\omega_2^2)$, $W_{123}^2 = (\\Delta\\omega_{1}^2 + \\Delta\\omega_2^2)  \\Delta\\omega_3^2/ (\\Delta\\omega_{1}^2 + \\Delta\\omega_2^2 + \\Delta\\omega_3^2)$. \n\nThe FWM solution is constructed from a product of Gaussian functions with the widest spectral width, $\\Delta\\omega_{FWM}=(\\Delta\\omega_{1}^2 + \\Delta\\omega_2^2 + \\Delta\\omega_3^2)^{1/2}$, and longest time duration, $t_{FWM}=\\sqrt{4ln2}/W_{123}$,\namong the input three pulses. In this case, the width of the pump/Stokes pulse is the widest, and probe pulse duration is the longest. This means that the FWM background can be efficiently removed when the probe pulse is delayed at a time longer than (or comparable to) its duration. \n\nThe CARS/CSRS solutions are written in terms of the Faddeeva function~\\cite{Faddeeva,Abrarov,Ali} $w(\\zeta_{\\pm})$ or the error function with a complex argument given as \n$\\zeta_\\pm = [(\\delta_{aS,S} W_{123}^2/\\Delta\\omega_3^2 \\mp \\Delta + i \\Gamma/2)t_{FWM} - i \\tau/t_{FWM}]/\\sqrt{2}$ \nwhere $\\Gamma$ is FWHM of a chosen Raman line.  A special solution of the impulsively excited CARS in the limit $W_{123} \\rightarrow \\Delta\\omega_3$ has been partially derived in~\\cite{Marrocco1,Marrocco2}.  This limited condition can be satisfied for the extreme broadband pump/Stokes and narrowband probe pulses. The extended  solution for the multiplex CARS covering multiple Raman resonances is simply a superposition of the Faddeeva functions as $\\sum_{j=1} c_{1,2,j}' w(\\zeta_{\\pm,j})$, where the $j$th term is defined as\n$\\zeta_{\\pm,j} = [(\\delta_{aS,S} W_{123}^2/\\Delta\\omega_3^2 \\mp \\Delta_j + i \\Gamma_j/2)t_{FWM} - i \\tau/t_{FWM}]/\\sqrt{2}$. \nThe FWM, CARS and sum spectra for a single Raman line are compared at zero and positive delay of the probe pulse. \nAt zero delay, in the sum spectra the FWM distorts pure CARS signal in the experiment. The extraction method based on Kramers-Kronig relation has been developed~\\cite{Marc Liu} and implemented, for instance, in~\\cite{Marc Camp}. It is trivial that as probe pulse is delayed, the CARS signal decreases, like FWM. \nHowever, it is unexpected and even seemingly counterintuitive that the CARS signal is enhanced, as probe pulse is delayed at a certain threshold time. An enhancement of the CARS/CSRS is one of the main results of the present letter. \n\n\n\\begin{figure}[htbp]\n\\centering\n\\fbox{\\includegraphics[width=\\linewidth]{AriFig1.pdf}}\n\\caption{(Color online) The three dimensional normalized CARS theoretical result with varying probe pulse width and delay. Its maximum enhancement as a function of the threshold delay (solid curve) is accurately pinned by an analytic formula Eq.(\\ref{AriTau}) (dots), escaping from zero delay (straight line).}\n\\end{figure}\n\nIn Fig.~1, this enhancement at a certain positive threshold time delay is studied as a function of probe pulse width. The effect is more obvious when the probe pulse width becomes narrower. A formula for the threshold time delay is found to be \n\n\n", "index": 1, "text": "\\begin{equation} \\label{AriTau}\n\\tau_{threshold} (\\Delta\\omega_3)= t_{FWM}\\left[ \\frac{1}{\\varepsilon(\\Delta\\omega_3,\\Gamma)}+ \\frac{\\Gamma t_{FWM}}{2}\\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\tau_{threshold}(\\Delta\\omega_{3})=t_{FWM}\\left[\\frac{1}{\\varepsilon(\\Delta%&#10;\\omega_{3},\\Gamma)}+\\frac{\\Gamma t_{FWM}}{2}\\right]\" display=\"block\"><mrow><mrow><msub><mi>τ</mi><mrow><mi>t</mi><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>h</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>d</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mn>3</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>t</mi><mrow><mi>F</mi><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>M</mi></mrow></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><mn>1</mn><mrow><mi>ε</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mn>3</mn></msub></mrow><mo>,</mo><mi mathvariant=\"normal\">Γ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>+</mo><mfrac><mrow><mi mathvariant=\"normal\">Γ</mi><mo>⁢</mo><msub><mi>t</mi><mrow><mi>F</mi><mo>⁢</mo><mi>W</mi><mo>⁢</mo><mi>M</mi></mrow></msub></mrow><mn>2</mn></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}]