[{"file": "1601.00104.tex", "nexttext": "\nwhere the elements $P^{A}(\\Gamma )$, $P^{B}(\\Delta ),..$ of the spectral\nmeasures of $\\hat{A},\\hat{B},...$\\ project onto subspaces $\\mathcal{M}\n_{\\Gamma }^{A},\\mathcal{M}_{\\Delta }^{B},...$ respectively of $\\mathcal{H}$.\nThis yields a joint probability distribution for the values of dynamical\nvariables $A,B,...$ on $s$ at $t_{1}$.\n\n\\qquad While nowhere explicitly mentioning measurement or preparation, this\nfamiliar account may seem implicitly to depend on these notions. Doesn't\nassignment of a particular state to a system at $t_{0}$\\ require knowledge\nof how this has been prepared? Don't Born probabilities refer only to the\noutcome of a joint measurement at $t_{1}$\\ of a compatible family of\ndynamical variables defined by the measurement context? And doesn't the\napplicability of the model at time $t_{1}$ presuppose that no measurement\noccurred between $t_{0}$ and $t_{1}$?\n\n\\qquad In fact one can say what warrants assignment of a quantum state and\nwhat circumstances license application of the Born rule without mentioning\npreparation or measurement. In each case it is simply the prevailing\nphysical conditions that supply the necessary warrant, whether or not anyone\nseeks to exploit these to prepare the system's state or make a measurement\non it. In the first case I call these backing conditions, since when they\nobtain they back assignment of a particular quantum state. In the second\ncase environmental conditions determine when and how the Born rule may\nlegitimately be applied to provide reliable advice about the values of\ncertain dynamical variables, in the form of what I call advice conditions.\n\n\\qquad I headed this paper with a quote from David Mermin in which he\ncharacterizes a quantum state of a system as a way of concisely summarizing\neverything we know that has happened to it.\\footnote{\nIn two earlier papers (Mermin [2002], Brun, T., Finkelstein, J. and Mermin,\nN.D. [2002]) he had raised and answered the question \"Whose knowledge?\".}\nThe knowledge of which he speaks is knowledge of backing conditions. Knowing\na state's backing conditions, one is justified in assigning that state: but\none would be \\textit{warranted} in assigning the state whether or not one\nknew these conditions, just as a test result may warrant a diagnosis whether\nor not the doctor knows about it. I'll give several examples of backing\nconditions later. For now it is important only that they may be stated in\npurely physical language, with no talk of observers or agents and their\nmeasuring or preparing activities. But nor does this statement involve talk\nof quantum states, operators or Hilbert space measures: such talk is\nconfined to the mathematical model being applied.\n\n\\qquad Advice conditions are stated in a more restricted physical language\nbecause of how they figure in the Born rule. When legitimately applied, that\nrule yields probabilities for what I'll call \\textit{magnitude claims}: \n\\textit{The value of dynamical variable }$M$ \\textit{on physical system }$s$\n\\textit{\\ lies in }$\\Delta $ is a canonical magnitude claim which I'll write\nas $M_{s}\\in \\Delta $. Magnitude claims are used to state advice\nconditions---so-called because they are the topic of the Born rule's\nprobabilistic advice. But that advice is necessarily selective. The Born\nrule yields joint probabilities only for magnitude claims corresponding to \n\\textit{commuting} projection operators, and Gleason's [1957] theorem and\nother results show that these typically cannot all be recovered as marginals\nof any underlying joint distribution.\n\n\\qquad Restrictions on use of the Born rule are needed to ensure its\nconsistent application to a system, but these arise naturally from the\nphysical circumstances in which that system finds itself. $\\Theta $\\\nprovides an adequate\\ quantum model of a system $s$\\ only while $s$ remains\nisolated from interaction with other quantum systems: If $s$ is subjected to\nsuch interactions, this can also be modeled by the unitary evolution of a\njoint quantum state in an expanded Hilbert space. In various models of\ndecoherence this extremely rapidly and essentially irreversibly results in\nthe delocalization of phase of the quantum state of $s$ and/or a system $\n\\alpha $ with which it interacts into the wider environment, thereby picking\nout a preferred \"pointer basis\" of orthogonal subspaces in their Hilbert\nspace(s).\n\n\\qquad The Born rule may be legitimately applied to $s$ only when such\ndecoherence has occurred, and then only to those privileged magnitude claims\ncorresponding to projection operators onto subspaces in the relevant pointer\nbasis.\\footnote{\nFor further details, see my [2012b].} Such decoherence is never perfect, and\nnor is a \"pointer basis\" precisely determined and perfectly constant. But\nthe advice provided by the Born rule concerning only magnitude claims\nprivileged by pointer bases in the same narrow neighborhood will be\nconsistent and typically prove reliable: the corresponding advice conditions\nwill typically obtain with relative frequencies closely corresponding to\ntheir Born rule probabilities.\n\n\\qquad You and I may know different things about what has happened to a\nquantum system. Should we then assign the system different quantum states?\nIf you have simply noticed something I missed, or I have forgotten something\nyou remember, then one of us has not made use of all the available\ninformation: our quantum state assignment should be based on all the\ninformation to which we have access. But the information to which an agent\nhas access depends on that agent's physical situation.\n\n\\qquad A single agent gains access to additional information merely with the\npassage of time, while spatially separated agents have access to different\ninformation just because they are in different places. It is not only\nspatiotemporal location that imposes physical limits on one's knowledge of\nwhat has happened to a system. Acquisition of observational knowledge\ndepends on the presence of physical channels capable of conveying that\nknowledge to the observer, which is why it is so hard to observe dark matter\nin distant galaxies. The upshot is that when an agent assigns a quantum\nstate the conditions backing that assignment are a function of the agent's\nphysical situation.\n\n\\qquad We often apply quantum theory not to the actual world but to some\nsimplified or otherwise modified variant of it---to a merely possible world.\nClearly the agent applying the model is not located in that merely possible\nworld. But even such applications are from the perspective of some merely\npossible agent in that world---the perspective of what I will call an \n\\textit{agent-situation}. All applications of quantum theory are from the\nperspective of a physically-characterized agent-situation. Applications to\nmerely possible worlds make it particularly clear that no agent need occupy\nsuch an agent-situation.\n\n\\qquad An agent-situation is characterized, in part, by a space-time region\nmarking the momentary location of a hypothetical agent. It is common to\nidealize the histories of observers by timelike curves in a relativistic\nspace-time---their world-lines. In this idealization the space-time location\nof an agent-situation would be a point $p$\\ on such a curve. Since no\nphysical processes can convey information faster than light, no agent at $p$\nwould have observational access to anything outside the past light cone of $p\n$. So the backing conditions for a quantum state assignment relative to $p$\nlie in (or on) the past light cone of $p$.\n\n\\qquad A quantum state assignment to a system relative to $p$ will be a\nfunction of everything in the past light cone of $p$ (though much of what\nhappens there will prove irrelevant). But it is important to notice that\nquantum state assignments relative to $p$,$q$ may differ: conditions\nobtaining in the past light cone of $p$ may back a different assignment than\nconditions obtaining in the past light cone of $q$. Since every quantum\nstate assignment is relative to an agent-situation it is misleading to speak\nof a system's being in a quantum state, as if this expressed a property of\nthat system rather than a relation\\ to the agent-situation from whose\nperspective it is assigned.\n\n\\section{Some applications}\n\nBefore moving on to its application to the phenomenon of quantum\nteleportation, I'll consider two illustrative examples of this account of\nquantum states as objective informational bridges---violation of Bell\ninequalities and delayed choice entanglement-swapping.\n\n\\qquad Quantum theory correctly predicts the violations of Bell inequalities\nthat have been observed in experiments involving space-like separated\nmeasurements of linear polarization on polarization-entangled photon pairs\n(EPR-Bohm pairs) (Weihs \\textit{et al}. [1998]). Bell [2004] used these\npredictions to argue that quantum theory is not a locally causal theory.\nMaudlin [2011] argued further that space-like (superluminal) influences must\nbe present in experiments verifying them: Price [1996], on the other hand,\nsuggested their results might be explained by retrocausal influences. One\nway for a measurement on one photon in an EPR-Bohm pair to influence the\nresult of a spacelike separated measurement on the other photon would be\nthrough \"collapsing its quantum state\"---just the kind of \"spooky\" action at\na distance Einstein rejected. Any such instantaneous collapse would threaten\nto reintroduce an absolute notion of simultaneity into a relativistic\nspace-time from which it had been successfully excised.\n\n\\qquad In fact quantum theory may be applied to explain EPR-Bohm\ncorrelations with no superluminal or retro- causation and no physical\nquantum state reduction.\\footnote{\nFor a fuller account see my [forthcoming].} The relativization of quantum\nstates to agent-situation is key to this explanation. An entangled state $\n\\Phi ^{+}=1/\\surd 2(\\left\\vert HH\\right\\rangle +\\left\\vert VV\\right\\rangle )$\nmay be correctly assigned to the pair relative to an agent-situation with\nlocation $p$\\ in the past light cone of either of the space-like separated\npolarization measurement events: its backing conditions (in the past light\ncone of $p$) include whatever physical conditions the experimenters used to\nprepare that state, such as parametric down-conversion of laser light by\npassage through a non-linear crystal.\n\n\\qquad Because of decoherence at the detectors, the Born rule is\nlegitimately applied to this state to yield an equal chance of either\noutcome of any linear polarization measurement at either detector, but\nchance $\\cos ^{2}\\angle ab$ that the two detectors will yield the same\noutcome for linear polarization measurements with respect to axes inclined\nat an angle $\\angle ab$ to one another. It is important to stress that these\nchances are \\textit{also} relative to agent-situation with location $p$. For\nanyone who accepts quantum theory, they give the objectively correct advice\nto one located at $p$ about how firmly to believe the corresponding\noutcome(s) will be recorded. Thus state $\\Phi ^{+}$ acts as an informational\nbridge between its backing conditions and its advice conditions by enabling\nanyone informed of its backing conditions to form reliable expectations\nconcerning it advice conditions.\n\n\\qquad Consider instead an agent situation with location $q$ in the future\nlight cone of recording event $\\mathbf{1}$ but not of recording event $\n\\mathbf{2}$. Relative to $q$, the correct quantum polarization state to\nassign to the distant photon in the past light cone of $\\mathbf{2}$ depends\non the outcome at $\\mathbf{1}$: suppose it is $V_{a}$, where linear\npolarization at $\\mathbf{1}$ was measured with respect to axis $a$. Then $\n\\left\\vert V_{a}\\right\\rangle $ is the correct quantum state to assign to\nthe distant photon, relative to agent situation with location $q$. This is\nnot because \"the\" quantum state of the pair has collapsed: the correct\nquantum state to assign relative to agent-situation with location $p$ is\nstill $\n\n\n{\\frac12}\n\n\\hat{1}$---the reduced state of $\\Phi ^{+}$. The correct state relative to\nagent situation with location $q$ is $\\left\\vert V_{a}\\right\\rangle $\nbecause the outcome at $\\mathbf{1}$ is in the past light cone of $q$, and so\ncounts as an additional accessible backing condition determining the\nassignment of a quantum state relative to $q$. Relative to agent situation\nwith location $q$ the chance of outcome $V_{b}$ at $\\mathbf{2}$ is $\\cos\n^{2}\\angle ab$, as follows from the legitimate application of the Born rule\nto state $\\left\\vert V_{a}\\right\\rangle $. Here it is state $\\left\\vert\nV_{a}\\right\\rangle $ that acts as an informational bridge between its\n(augmented) backing conditions and its advice conditions.\n\n\\qquad These applications of quantum theory explain the patterns of\ncorrelation that are taken to violate CHSH inequalities by showing that they\nwere to be expected and what they depend on. Both individual outcome events\nand the event of their joint occurrence depend causally on the physical\nconditions backing assignment of $\\Phi ^{+}$ since an agent could affect the\nchances of these events by modifying those backing conditions. But there is\nno causal dependence of one outcome event on the other, since no-one who\naccepts quantum theory can countenance the possibility of an agent's\nmodifying either outcome while keeping fixed both detectors' settings and\nthe conditions backing $\\Phi ^{+}$. Nor do the detector settings have any\nretrocausal influence on events acknowledged by quantum theory.\n\n\\qquad Now consider delayed-choice entanglement-swapping. Suppose two\nEPR-Bohm photon pairs $\\langle 1,2\\rangle $, $\\langle 3,4\\rangle $\\ are\nindependently prepared in conditions backing assignment of Bell states $\\Psi\n_{12}^{-},\\Psi _{34}^{-}$\n\n", "itemtype": "equation", "pos": 8857, "prevtext": "\n\n\\author{Richard Healey \\\\\n\nUniversity of Arizona}\n\\title{Quantum States as Objective Informational Bridges}\n\\date{February 1st, 2015}\n\\maketitle\n\n\\begin{abstract}\nA quantum state represents neither properties of a physical system nor\nanyone's knowledge of its properties. The important question is not what\nquantum states represent but\\ how they are used---as informational bridges.\nKnowing about some physical situations (its backing conditions), an agent\nmay assign a quantum state to form expectations about other possible\nphysical situations (its advice conditions). Quantum states are objective:\nonly expectations based on correct state assignments are generally reliable.\nIf a quantum state represents anything, it is the objective probabilistic\nrelations between its backing conditions and its advice conditions. This\npaper offers an account of quantum states and their function as\ninformational bridges, in quantum teleportation and elsewhere.\n\\end{abstract}\n\n\\newpage\n\n\\begin{quotation}\nthe quantum state of a Qbit or a collection of Qbits is not a property\ncarried by those Qbits, but a way of concisely summarizing everything we\nknow that has happened to them, to enable us to make statistical predictions\nabout the information we might then be able to extract from them. (N. David\nMermin [2007, p. 109])\n\\end{quotation}\n\n\\section{Introduction}\n\nIn his recent extended review article, Matt Leifer [2014] classifies the\npragmatist view of quantum theory sketched in my [2012a] as $\\psi $\n-epistemic rather than $\\psi $-ontic while acknowledging that the $\\psi $\n-ontology theorems he discusses do not apply to it. But as he draws the $\n\\psi $\\textit{-ontic/}$\\psi $\\textit{-epistemic} distinction in his\nintroduction, that pragmatist view counts as neither $\\psi $-epistemic nor $\n\\psi $-ontic. It does not view $\\left\\vert \\psi \\right\\rangle $\\ as\ndescribing some independently existing property of the system to which it is\nassigned, but nor does it take a quantum state to exist only in the minds\nand calculations of quantum theorists. This paper is intended to clarify my\n[2012a] view of the quantum state, and to show how $\\left\\vert \\psi\n\\right\\rangle $ refers to something that objectively exists in the world,\nindependently of any observer or agent, and would still exist if all\nintelligent beings were suddenly wiped out from the universe---which is how\nLeifer characterizes an \\textit{ontic} state.\n\n\\qquad A quantum state (given by a wave-function, vector or density\noperator) represents neither properties of a physical system to which it is\nassigned, nor anyone's knowledge of its properties. The important question\nis not what quantum states represent but\\ how they are used---as\ninformational bridges. Knowing about some physical situations (its backing\nconditions), an agent may assign a quantum state to form expectations about\ncertain other possible physical situations (its advice conditions). Quantum\nstates are objective: only expectations based on correct state assignments\nare generally reliable. But a quantum state represents neither its backing\nconditions nor its advice conditions.\n\n\\qquad Since its main function is to provide information on what advice\nconditions to expect given prevailing backing conditions, it may be said to\nrepresent probabilistic relations between backing conditions and advice\nconditions. These probabilistic relations are objective: they would exist in\na world without agents, as long as that world featured patterns of\nstatistical regularity that were sufficiently stable to be modeled by Born\nprobabilities of the values of physical magnitudes that specify what I have\ncalled advice conditions. We can use quantum theory successfully because (or\nat least in so far as) they \\textit{do} exist in our world.\n\n\\qquad As physically situated, and so epistemically limited, a user of\nquantum theory can assign quantum states on the basis of what that agent is\nin a position to know, in order to form reasonable expectations about what\nthat agent is not in a position to know. That is how quantum states function\nas informational bridges. A quantum state provides a sturdy informational\nbridge only if it would be the right state to assign for any agent in that\nphysical, and \\textit{therefore} epistemic, situation---only if it refers to\nthe \\textit{actual} probabilistic relations between its accessible backing\nconditions and inaccessible advice conditions.\n\n\\qquad Here is the structure of the rest of the paper. By distinguishing\nbetween quantum mathematical models and their physical applications section\n2 shows how a precise formulation of quantum theory may be given without\nusing terms like `measurement', `observation', `information' or `agent'. Any\naccount of how the theory is applied must mention agents who may apply it:\nagents are (potential) \\textit{users} of quantum models---they are not\nmentioned in those models. Any application of a quantum model is \\textit{\nperspectival}---it is from the perspective of a hypothetical, physically\nsituated, agent. So to say how a model of quantum theory is applied we need\na rough physical characterization of this situation as what I will call an \n\\textit{agent-situation}. Section 2 supplies this and clarifies the notions\nof backing conditions and advice conditions. A correct quantum state\nassignment is relative to an agent-situation because these conditions are a\nfunction of that situation. Section 3 shows the worth of these ideas in\nexplaining how quantum theory works in some applications that have been\nthought to raise problems of \"wave collapse\" and causal anomalies. Chris\nTimpson [2013] used his analysis of quantum information$_{t}$ as a sequence\nof quantum states to demystify the issue of information flow in quantum\nteleportation. But there is more to be said if a quantum state itself\nfunctions as an informational bridge: I say it in section 4. The paper\nconcludes by summarizing its main points and relating them to recent work in\nquantum foundations.\n\n\\section{Quantum states: Objective but relational}\n\nIn discussing quantum states we should start by distinguishing the state\nitself from any of its mathematical representatives, including $\\left\\vert\n\\Psi \\right\\rangle $ (or a wave-function representation such as $\\psi (\n\\mathbf{r}_{1},...,\\mathbf{r}_{n})$), $\\hat{\\rho}$, or (as in AQFT) $\\omega :\n\\mathcal{A}\\longrightarrow \n\n\n\\mathbb{C}\n\n$. As a mathematical object, none of these representatives of a quantum\nstate exists in the physical world: what is at issue is the nature and\nfunction of the quantum state such objects purport to represent. But that\nissue is best approached indirectly, by studying the role of a mathematical\nrepresentative of a quantum state in an application of a mathematical model\nof quantum theory of which it is one element.\n\n\\qquad Such models take different forms in different kinds of quantum\ntheory, but since the same issue arises for each I'll consider only models\nof non-relativistic quantum mechanics of the form $\\Theta \\mathcal{=}\n\\left\\langle \\mathcal{H},T,\\Psi ,\\mathcal{A},\\mu \\right\\rangle $. In an\napplication, the interval of real numbers $T$ will represent an interval of\ntime while $t\\in T$ represents a moment in that interval. Each operator in $\n\\mathcal{A}$ is linear: in an application a self-adjoint operator $\\hat{A}$\nwill correspond uniquely to a dynamical variable $A$. The self-adjoint\noperator $\\hat{H}$ corresponding to energy is associated with a family of\nunitary operators $\\hat{U}_{t}=\\exp i\\hat{H}t$ that define the possible\ntrajectories of $\\left\\vert \\Psi (t)\\right\\rangle $ (in the Schr\\\"{o}dinger\npicture). The measure $\\mu $ assigns, at each $t\\in T$, a number in the\ninterval [$0,1$] to each subspace $\\mathcal{K}$\\ of $\\mathcal{H}$ such that $\n\\mu (\\mathcal{H})=1$, $\\mu (\\mathcal{\\varnothing })=0$ and if $\\mathcal{K}\n_{i}\\perp $ $\\mathcal{K}_{j}$ for $i\\neq j$ then $\\mu (\\mathcal{L}\n)=\\tsum\\nolimits_{i}\\mu (\\mathcal{K}_{i})$, where $\\mathcal{L}=\\vee _{i}\n\\mathcal{K}_{i}$ is the span of the $\\mathcal{K}_{i}$. In an application \n\\textit{some} values of $\\mu $ may yield Born probabilities.\n\n\\qquad To apply a model of the form $\\Theta $ one first chooses the\ndimension of a Hilbert space $\\mathcal{H}$ in which to represent a quantum\nstate $\\Psi $ of a physical system $s$ over a period of time $T$ and a\nparticular $\\hat{H}$ on $\\mathcal{H}$: then one assigns a particular initial\nstate $\\left\\vert \\Psi (t_{0})\\right\\rangle $ to $s$. This picks out a\nunique trajectory $\\left\\vert \\Psi (t)\\right\\rangle $ and so a particular\nstate $\\left\\vert \\Psi (t_{1})\\right\\rangle $ at a later time $t_{1}\\in T$.\nNext one chooses a pairwise-commuting family $\\mathcal{F}=\\{\\hat{A},\\hat{B}\n,...\\}$\\ of self-adjoint operators on $\\mathcal{H}$\\ corresponding to\ndynamical variables $A,B,...$ respectively. One can now apply the Born rule\nin the form\n\n", "index": 1, "text": "\\begin{gather}\n\\Pr ([A\\in \\Gamma ]\\&[B\\in \\Delta ]\\&...)=\\left\\langle \\Psi\n(t_{1})|P^{A}(\\Gamma ).P^{B}(\\Delta )...|\\Psi (t_{1})\\right\\rangle \\\\\n=\\mu _{\\Psi (t_{1})}(\\mathcal{M}_{\\Gamma }^{A}\\wedge \\mathcal{M}_{\\Delta\n}^{B}\\wedge ...)  \\notag\n\\end{gather}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Pr([A\\in\\Gamma]\\&amp;[B\\in\\Delta]\\&amp;...)=\\left\\langle\\Psi(t_{1})|P^{A%&#10;}(\\Gamma).P^{B}(\\Delta)...|\\Psi(t_{1})\\right\\rangle\" display=\"block\"><mrow><mi>Pr</mi><mrow><mo stretchy=\"false\">(</mo><mrow><mo stretchy=\"false\">[</mo><mi>A</mi><mo>∈</mo><mi mathvariant=\"normal\">Γ</mi><mo stretchy=\"false\">]</mo></mrow><mo>&amp;</mo><mrow><mo stretchy=\"false\">[</mo><mi>B</mi><mo>∈</mo><mi mathvariant=\"normal\">Δ</mi><mo stretchy=\"false\">]</mo></mrow><mo>&amp;</mo><mi mathvariant=\"normal\">…</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><mo>⟨</mo><mi mathvariant=\"normal\">Ψ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">|</mo><msup><mi>P</mi><mi>A</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Γ</mi><mo stretchy=\"false\">)</mo></mrow><mo>.</mo><msup><mi>P</mi><mi>B</mi></msup><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Δ</mi><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">…</mi><mo stretchy=\"false\">|</mo><mi mathvariant=\"normal\">Ψ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>⟩</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\mu_{\\Psi(t_{1})}(\\mathcal{M}_{\\Gamma}^{A}\\wedge\\mathcal{M}_{%&#10;\\Delta}^{B}\\wedge...)\" display=\"block\"><mrow><mi/><mo>=</mo><mrow><msub><mi>μ</mi><mrow><mi mathvariant=\"normal\">Ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mi mathvariant=\"normal\">Γ</mi><mi>A</mi></msubsup><mo>∧</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">ℳ</mi><mi mathvariant=\"normal\">Δ</mi><mi>B</mi></msubsup><mo>∧</mo><mi mathvariant=\"normal\">…</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00104.tex", "nexttext": "\nFirst assume a Bell-state measurement is conducted on $\\langle 2,3\\rangle $,\nand the result noted. Conditional on a particular result, one of four\ndifferent entangled states may then be assigned to the pair $\\langle\n1,4\\rangle $. This is entanglement-swapping.\\footnote{\nBy adding a classical channel it may be used to teleport entanglement of a\nQbit.} The particular entangled state of $\\langle 1,4\\rangle $ may be\nverified by quantum tomography in the usual way, and violation of Bell\ninequalities demonstrated. Alternatively, assume the linear polarizations of\neach of $2,3$ are measured independently (instead of the Bell-state\nmeasurement). No matter what the outcomes of the measurements on $2,3$,\nmeasurements of linear polarization on $1,4$\\ will reveal no correlations:\nsince the states then assigned to $1,4$\\ are not entangled their joint\nprobability distribution will factorize.\n\n\\qquad So far I \\ have said nothing about when and where the measurements on \n$1,4$ occur, relative to those on $2,3$. In a standard case of\nentanglement-swapping, the Bell-state measurement $B_{23}$ on $2,3$ occurs\ntime-like earlier than each of the measurements $M_{1},M_{4}$ on $1,4$. But\nthe correlations between the outcomes of measurements $M_{1},M_{4}$\\\nconditional on a particular (joint) outcome of a Bell-state measurement $\nB_{23}$ do not depend on the space-time intervals $I(B_{23},M_{1})$, $\nI(B_{23},M_{4})$. If $B_{23}$ occurs timelike \\textit{later} than $\nM_{1},M_{4}$ then we have an apparent case of \"retrocausal entanglement\nswapping\". Since the choice of whether to perform $B_{23}$ or independent\npolarization measurements $M_{2},M_{3}$ may be made at random \\textit{after}\nphotons $1,4$ have been absorbed into their detectors, this has also been\ncalled delayed choice entanglement-swapping.\\footnote{\nBy Peres [2000]. This has been realized experimentally by Ma \\textit{et al. }\n[2013].}\n\n\\qquad Relative to an agent-situation located just in the overlap of the\nfuture light cones of their production events, the correct initial\npolarization state $\\Psi $\\ to assign to the photons is\n\n", "itemtype": "equation", "pos": 22858, "prevtext": "\nwhere the elements $P^{A}(\\Gamma )$, $P^{B}(\\Delta ),..$ of the spectral\nmeasures of $\\hat{A},\\hat{B},...$\\ project onto subspaces $\\mathcal{M}\n_{\\Gamma }^{A},\\mathcal{M}_{\\Delta }^{B},...$ respectively of $\\mathcal{H}$.\nThis yields a joint probability distribution for the values of dynamical\nvariables $A,B,...$ on $s$ at $t_{1}$.\n\n\\qquad While nowhere explicitly mentioning measurement or preparation, this\nfamiliar account may seem implicitly to depend on these notions. Doesn't\nassignment of a particular state to a system at $t_{0}$\\ require knowledge\nof how this has been prepared? Don't Born probabilities refer only to the\noutcome of a joint measurement at $t_{1}$\\ of a compatible family of\ndynamical variables defined by the measurement context? And doesn't the\napplicability of the model at time $t_{1}$ presuppose that no measurement\noccurred between $t_{0}$ and $t_{1}$?\n\n\\qquad In fact one can say what warrants assignment of a quantum state and\nwhat circumstances license application of the Born rule without mentioning\npreparation or measurement. In each case it is simply the prevailing\nphysical conditions that supply the necessary warrant, whether or not anyone\nseeks to exploit these to prepare the system's state or make a measurement\non it. In the first case I call these backing conditions, since when they\nobtain they back assignment of a particular quantum state. In the second\ncase environmental conditions determine when and how the Born rule may\nlegitimately be applied to provide reliable advice about the values of\ncertain dynamical variables, in the form of what I call advice conditions.\n\n\\qquad I headed this paper with a quote from David Mermin in which he\ncharacterizes a quantum state of a system as a way of concisely summarizing\neverything we know that has happened to it.\\footnote{\nIn two earlier papers (Mermin [2002], Brun, T., Finkelstein, J. and Mermin,\nN.D. [2002]) he had raised and answered the question \"Whose knowledge?\".}\nThe knowledge of which he speaks is knowledge of backing conditions. Knowing\na state's backing conditions, one is justified in assigning that state: but\none would be \\textit{warranted} in assigning the state whether or not one\nknew these conditions, just as a test result may warrant a diagnosis whether\nor not the doctor knows about it. I'll give several examples of backing\nconditions later. For now it is important only that they may be stated in\npurely physical language, with no talk of observers or agents and their\nmeasuring or preparing activities. But nor does this statement involve talk\nof quantum states, operators or Hilbert space measures: such talk is\nconfined to the mathematical model being applied.\n\n\\qquad Advice conditions are stated in a more restricted physical language\nbecause of how they figure in the Born rule. When legitimately applied, that\nrule yields probabilities for what I'll call \\textit{magnitude claims}: \n\\textit{The value of dynamical variable }$M$ \\textit{on physical system }$s$\n\\textit{\\ lies in }$\\Delta $ is a canonical magnitude claim which I'll write\nas $M_{s}\\in \\Delta $. Magnitude claims are used to state advice\nconditions---so-called because they are the topic of the Born rule's\nprobabilistic advice. But that advice is necessarily selective. The Born\nrule yields joint probabilities only for magnitude claims corresponding to \n\\textit{commuting} projection operators, and Gleason's [1957] theorem and\nother results show that these typically cannot all be recovered as marginals\nof any underlying joint distribution.\n\n\\qquad Restrictions on use of the Born rule are needed to ensure its\nconsistent application to a system, but these arise naturally from the\nphysical circumstances in which that system finds itself. $\\Theta $\\\nprovides an adequate\\ quantum model of a system $s$\\ only while $s$ remains\nisolated from interaction with other quantum systems: If $s$ is subjected to\nsuch interactions, this can also be modeled by the unitary evolution of a\njoint quantum state in an expanded Hilbert space. In various models of\ndecoherence this extremely rapidly and essentially irreversibly results in\nthe delocalization of phase of the quantum state of $s$ and/or a system $\n\\alpha $ with which it interacts into the wider environment, thereby picking\nout a preferred \"pointer basis\" of orthogonal subspaces in their Hilbert\nspace(s).\n\n\\qquad The Born rule may be legitimately applied to $s$ only when such\ndecoherence has occurred, and then only to those privileged magnitude claims\ncorresponding to projection operators onto subspaces in the relevant pointer\nbasis.\\footnote{\nFor further details, see my [2012b].} Such decoherence is never perfect, and\nnor is a \"pointer basis\" precisely determined and perfectly constant. But\nthe advice provided by the Born rule concerning only magnitude claims\nprivileged by pointer bases in the same narrow neighborhood will be\nconsistent and typically prove reliable: the corresponding advice conditions\nwill typically obtain with relative frequencies closely corresponding to\ntheir Born rule probabilities.\n\n\\qquad You and I may know different things about what has happened to a\nquantum system. Should we then assign the system different quantum states?\nIf you have simply noticed something I missed, or I have forgotten something\nyou remember, then one of us has not made use of all the available\ninformation: our quantum state assignment should be based on all the\ninformation to which we have access. But the information to which an agent\nhas access depends on that agent's physical situation.\n\n\\qquad A single agent gains access to additional information merely with the\npassage of time, while spatially separated agents have access to different\ninformation just because they are in different places. It is not only\nspatiotemporal location that imposes physical limits on one's knowledge of\nwhat has happened to a system. Acquisition of observational knowledge\ndepends on the presence of physical channels capable of conveying that\nknowledge to the observer, which is why it is so hard to observe dark matter\nin distant galaxies. The upshot is that when an agent assigns a quantum\nstate the conditions backing that assignment are a function of the agent's\nphysical situation.\n\n\\qquad We often apply quantum theory not to the actual world but to some\nsimplified or otherwise modified variant of it---to a merely possible world.\nClearly the agent applying the model is not located in that merely possible\nworld. But even such applications are from the perspective of some merely\npossible agent in that world---the perspective of what I will call an \n\\textit{agent-situation}. All applications of quantum theory are from the\nperspective of a physically-characterized agent-situation. Applications to\nmerely possible worlds make it particularly clear that no agent need occupy\nsuch an agent-situation.\n\n\\qquad An agent-situation is characterized, in part, by a space-time region\nmarking the momentary location of a hypothetical agent. It is common to\nidealize the histories of observers by timelike curves in a relativistic\nspace-time---their world-lines. In this idealization the space-time location\nof an agent-situation would be a point $p$\\ on such a curve. Since no\nphysical processes can convey information faster than light, no agent at $p$\nwould have observational access to anything outside the past light cone of $p\n$. So the backing conditions for a quantum state assignment relative to $p$\nlie in (or on) the past light cone of $p$.\n\n\\qquad A quantum state assignment to a system relative to $p$ will be a\nfunction of everything in the past light cone of $p$ (though much of what\nhappens there will prove irrelevant). But it is important to notice that\nquantum state assignments relative to $p$,$q$ may differ: conditions\nobtaining in the past light cone of $p$ may back a different assignment than\nconditions obtaining in the past light cone of $q$. Since every quantum\nstate assignment is relative to an agent-situation it is misleading to speak\nof a system's being in a quantum state, as if this expressed a property of\nthat system rather than a relation\\ to the agent-situation from whose\nperspective it is assigned.\n\n\\section{Some applications}\n\nBefore moving on to its application to the phenomenon of quantum\nteleportation, I'll consider two illustrative examples of this account of\nquantum states as objective informational bridges---violation of Bell\ninequalities and delayed choice entanglement-swapping.\n\n\\qquad Quantum theory correctly predicts the violations of Bell inequalities\nthat have been observed in experiments involving space-like separated\nmeasurements of linear polarization on polarization-entangled photon pairs\n(EPR-Bohm pairs) (Weihs \\textit{et al}. [1998]). Bell [2004] used these\npredictions to argue that quantum theory is not a locally causal theory.\nMaudlin [2011] argued further that space-like (superluminal) influences must\nbe present in experiments verifying them: Price [1996], on the other hand,\nsuggested their results might be explained by retrocausal influences. One\nway for a measurement on one photon in an EPR-Bohm pair to influence the\nresult of a spacelike separated measurement on the other photon would be\nthrough \"collapsing its quantum state\"---just the kind of \"spooky\" action at\na distance Einstein rejected. Any such instantaneous collapse would threaten\nto reintroduce an absolute notion of simultaneity into a relativistic\nspace-time from which it had been successfully excised.\n\n\\qquad In fact quantum theory may be applied to explain EPR-Bohm\ncorrelations with no superluminal or retro- causation and no physical\nquantum state reduction.\\footnote{\nFor a fuller account see my [forthcoming].} The relativization of quantum\nstates to agent-situation is key to this explanation. An entangled state $\n\\Phi ^{+}=1/\\surd 2(\\left\\vert HH\\right\\rangle +\\left\\vert VV\\right\\rangle )$\nmay be correctly assigned to the pair relative to an agent-situation with\nlocation $p$\\ in the past light cone of either of the space-like separated\npolarization measurement events: its backing conditions (in the past light\ncone of $p$) include whatever physical conditions the experimenters used to\nprepare that state, such as parametric down-conversion of laser light by\npassage through a non-linear crystal.\n\n\\qquad Because of decoherence at the detectors, the Born rule is\nlegitimately applied to this state to yield an equal chance of either\noutcome of any linear polarization measurement at either detector, but\nchance $\\cos ^{2}\\angle ab$ that the two detectors will yield the same\noutcome for linear polarization measurements with respect to axes inclined\nat an angle $\\angle ab$ to one another. It is important to stress that these\nchances are \\textit{also} relative to agent-situation with location $p$. For\nanyone who accepts quantum theory, they give the objectively correct advice\nto one located at $p$ about how firmly to believe the corresponding\noutcome(s) will be recorded. Thus state $\\Phi ^{+}$ acts as an informational\nbridge between its backing conditions and its advice conditions by enabling\nanyone informed of its backing conditions to form reliable expectations\nconcerning it advice conditions.\n\n\\qquad Consider instead an agent situation with location $q$ in the future\nlight cone of recording event $\\mathbf{1}$ but not of recording event $\n\\mathbf{2}$. Relative to $q$, the correct quantum polarization state to\nassign to the distant photon in the past light cone of $\\mathbf{2}$ depends\non the outcome at $\\mathbf{1}$: suppose it is $V_{a}$, where linear\npolarization at $\\mathbf{1}$ was measured with respect to axis $a$. Then $\n\\left\\vert V_{a}\\right\\rangle $ is the correct quantum state to assign to\nthe distant photon, relative to agent situation with location $q$. This is\nnot because \"the\" quantum state of the pair has collapsed: the correct\nquantum state to assign relative to agent-situation with location $p$ is\nstill $\n\n\n{\\frac12}\n\n\\hat{1}$---the reduced state of $\\Phi ^{+}$. The correct state relative to\nagent situation with location $q$ is $\\left\\vert V_{a}\\right\\rangle $\nbecause the outcome at $\\mathbf{1}$ is in the past light cone of $q$, and so\ncounts as an additional accessible backing condition determining the\nassignment of a quantum state relative to $q$. Relative to agent situation\nwith location $q$ the chance of outcome $V_{b}$ at $\\mathbf{2}$ is $\\cos\n^{2}\\angle ab$, as follows from the legitimate application of the Born rule\nto state $\\left\\vert V_{a}\\right\\rangle $. Here it is state $\\left\\vert\nV_{a}\\right\\rangle $ that acts as an informational bridge between its\n(augmented) backing conditions and its advice conditions.\n\n\\qquad These applications of quantum theory explain the patterns of\ncorrelation that are taken to violate CHSH inequalities by showing that they\nwere to be expected and what they depend on. Both individual outcome events\nand the event of their joint occurrence depend causally on the physical\nconditions backing assignment of $\\Phi ^{+}$ since an agent could affect the\nchances of these events by modifying those backing conditions. But there is\nno causal dependence of one outcome event on the other, since no-one who\naccepts quantum theory can countenance the possibility of an agent's\nmodifying either outcome while keeping fixed both detectors' settings and\nthe conditions backing $\\Phi ^{+}$. Nor do the detector settings have any\nretrocausal influence on events acknowledged by quantum theory.\n\n\\qquad Now consider delayed-choice entanglement-swapping. Suppose two\nEPR-Bohm photon pairs $\\langle 1,2\\rangle $, $\\langle 3,4\\rangle $\\ are\nindependently prepared in conditions backing assignment of Bell states $\\Psi\n_{12}^{-},\\Psi _{34}^{-}$\n\n", "index": 3, "text": "\\begin{equation}\n\\Psi ^{-}=1/\\surd 2(\\left\\vert HV\\right\\rangle -\\left\\vert VH\\right\\rangle ).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\Psi^{-}=1/\\surd 2(\\left|HV\\right\\rangle-\\left|VH\\right\\rangle).\" display=\"block\"><mrow><mrow><msup><mi mathvariant=\"normal\">Ψ</mi><mo>-</mo></msup><mo>=</mo><mrow><mrow><mn>1</mn><mo>/</mo><msqrt><mn>2</mn></msqrt></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo fence=\"true\">|</mo><mrow><mi>H</mi><mo>⁢</mo><mi>V</mi></mrow><mo>⟩</mo></mrow><mo>-</mo><mrow><mo fence=\"true\">|</mo><mrow><mi>V</mi><mo>⁢</mo><mi>H</mi></mrow><mo>⟩</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.00104.tex", "nexttext": "\nAnalysis of the actual experimental setup of Ma \\textit{et al.} [2013] shows\nthat cases (i) in which $B_{23}$ records one photon as detected to each side\nof the beam splitter (with the same polarization) have non-zero Born\nprobability only from the fourth term in (\\ref{4-fold entangled state}),\nwhile cases (ii) in which $B_{23}$ records both photons as detected to the\nsame side of the beam splitter (with opposite polarizations) have non zero\nBorn probability only from the third term in (\\ref{4-fold entangled state}).\nWhat \\ would be the correct state to assign to the remaining photons,\nrelative to an agent-situation located just in the future light cone of $\nB_{23}$? In case (i) the corresponding $\\langle 1,4\\rangle $ pair should be\nassigned the quantum state $\\Phi _{14}^{-}$, while in case (ii) the\ncorresponding pair should be assigned $\\Phi _{14}^{+}$. These would be the\ncorrect state assignments irrespective of the space-time intervals $\nI(B_{23},M_{1})$, $I(B_{23},M_{4})$.\n\n\\qquad A\\ recent paper (Egg [2013, p.1133]) rejects that conclusion as\nfollows (I have changed his notation to conform to mine):\n\n\\begin{quotation}\nThe Bell measurement on the $\\langle 2,3\\rangle $ pair allows us to sort the \n$\\langle 1,4\\rangle $ pairs\\ into four subensembles corresponding to the\nfour Bell states. Without delayed choice, this has physical significance,\nbecause each $\\langle 1,4\\rangle $ pair \\textit{really is} in such a state\nafter the $\\langle 2,3\\rangle $ measurement [$B_{23}$]. But if the $\\langle\n1,4\\rangle $ measurements [$M_{1},M_{4}$] precede [$B_{23}$], the $\\langle\n1,4\\rangle $ pair \\textit{never is in any of these states}. ... Therefore,\nfar from being committed\\ to any indeterminacy about entanglement (or any\nbackward-in-time influences) a realistic view of the quantum state yields a\nperfectly clear assessment of what happens in entanglement-swapping: If [$\nB_{23}$] occurs at a time the complete system is still in state $\\Psi $, it\nconfers entanglement on the $\\langle 1,4\\rangle $ pair, if it occurs at a\nlater time it does not.\n\\end{quotation}\n\n\\qquad In section 2 I warned against talk of a system's being in a quantum\nstate (as opposed to being assigned the correct quantum state relative to a\nparticular agent-situation). We can see how this leads to problems by\nreflecting on a case of entanglement-swapping in which the intervals $\nI(B_{23},M_{1})$, $I(B_{23},M_{4})$ are space-like. In this case the\ndistinction to which Egg appeals has no invariant significance: whether $\nM_{1}$ or $M_{4}$ precedes $B_{23}$ depends on an arbitrary choice of\nreference frame. Egg is not unaware of this problem: he admits (p.1130) that\nhis \"reality-of-states\" view should take \\textit{state reduction}\\\nseriously, so that the change of description on \"measurement\" corresponds to\na real physical change. His \"solution\" ( footnote 7, p.1130) is to appeal to\na definite (although undetectable) temporal ordering between any two\nevents---a preferred foliation of space-time such as that required by\nalternative theories including Bohmian mechanics.\n\n\\qquad But there is no physical process of state reduction, and no need to\nappeal to any undetectable space-time foliation to understand\nentanglement-swapping or violation of Bell inequalities. The reassignment of\na quantum state associated with relativizing it to a different\nagent-situation is not a physical process. It is typically required because\nadditional backing conditions are accessible from the second\nagent-situation. The discussion of EPR-Bohm correlations provided an\nexample: $\\left\\vert V_{a}\\right\\rangle $ is the correct quantum state to\nassign to the distant photon relative to agent-situation $q$ while the\ncorrect quantum state to assign relative to agent-situation with location $p$\nis $\n\n\n{\\frac12}\n\n\\hat{1}$: each of these quantum states is objective, but there is no\nquestion as to which quantum state the distant photon \"is in\".\n\n\\qquad When an entangled state is assigned to the pair $\\langle 1,4\\rangle $\nconditional on the outcome of $B_{23}$ this state functions as an objective\ninformational bridge in the usual way, irrespective of the space-time\nintervals $I(B_{23},M_{1})$, $I(B_{23},M_{4})$. What distinguishes the case\nin which $B_{23}$ occurs invariantly later than $M_{1},M_{4}$ is the fact\nthat \\textit{if appropriate physical channels were in place} the outcomes of \n$M_{1},M_{4}$ would be accessible from the space-time location of $B_{23}$.\nIn that case there would be no point in using the entangled state assigned\nto the pair $\\langle 1,4\\rangle $ as an informational bridge to form\nexpectations as to these outcomes, since knowledge as to what they were\nwould already be available at the space-time location of $B_{23}$.\n\n\\qquad This illustrates the important point that there is more to an\nagent-situation than its space-time location. A physical characterization of\nan agent situation located just in the future light cone of $B_{23}$\nspecifies either the presence or the absence of physical channels connecting\nthis location to the outcomes of $M_{1},M_{4}$: only if no such channels are\nin place is it necessary to assign an entangled state to $\\langle 1,4\\rangle \n$ conditional on the outcome of $B_{23}$, since only relative to that\nagent-situation does this state assignment provide the best available\ninformation concerning the outcomes of $M_{1},M_{4}$. In a case in which $\nB_{23}$ occurs invariantly earlier than $M_{1},M_{4}$, or space-like\nseparated from them, an entangled state must always be assigned to $\\langle\n1,4\\rangle $ relative to any agent-situation located just in the future\nlight cone of $B_{23}$ and backed by the outcome of $B_{23}$, because no\nphysical channels could give access to the outcomes of $M_{1},M_{4}$ from\nthat space-time location.\n\n\\qquad\n\n\\section{Information in quantum teleportation}\n\nChris Timpson devotes two chapters of his [2013] to a discussion of\ninformation flow in quantum teleportation. His conclusion is largely\ndeflationary\n\n\\begin{quote}\nwe have been able to replace the (needlessly) conceptually puzzling question\nof how the information$_{t}$ gets from Alice to Bob in teleportation, with\nthe simple, genuine question of what the physical processes involved in\nteleportation are. (p. 86)\n\\end{quote}\n\nHe had previously proposed a helpful analysis of the technical notion of\ninformation$_{t}$ after distinguishing this from our everyday, informal\nnotion. This locates quantum information$_{t}$ as a species of Shannon\ninformation:\n\n\\begin{quote}\npieces of quantum information$_{t}$ are certain \\textit{abstract}\nitems---sequences of quantum states (types)\n\nAs \\textit{abstracta}, pieces of quantum information$_{t}$ ... do not\nthemselves have a spatio-temporal location; it is their tokens (if any)\nwhich do. (p. 65)\n\\end{quote}\n\nA token of quantum information$_{t}$ is then a concrete instance of an\nabstract sequence of quantum states. The simplest example of a token of\nquantum information$_{t}$ is a single (physical) Qbit. Quantum teleportation\nis a physical process in which a Qbit associated with state $\\left\\vert \\chi\n\\right\\rangle $ is initially located only at $A$ and a Qbit associated with\nstate $\\left\\vert \\chi \\right\\rangle $ is finally located at $B$ while the\nQbit formerly located at $A$ is no longer associated with state $\\left\\vert\n\\chi \\right\\rangle $. In this way the abstract piece of quantum information$\n_{t}$ previously instantiated only at $A$ is now instantiated only at $B$.\n\n\\qquad Among the remarkable features of quantum teleportation is that it\nenables Alice to teleport an \\textit{unknown} quantum state to Bob. After\nits successful execution Alice and Bob both know that the state now\nassociated with Bob's Qbit is the same state formerly associated with\nAlice's, but neither Alice nor Bob need know what this state is. A\nteleported state may be unknown to Alice and Bob because neither of them\nknows what had happened to Alice's Qbit before she got hold of it.\n\n\\qquad One can accept Timpson's helpful analysis without saying anything\nabout the nature and function of quantum states. But suppose the quantum\nstate of a Qbit is a way of concisely summarizing everything we know that\nhas happened to it. If there is no-one but Alice and Bob, then the quantum\nstate they teleport may be a way of concisely summarizing knowledge that\nno-one knows---an unknown known! Clearly something has gone wrong. Not even\nDonald Rumsfeld countenances unknown knowns.\\footnote{\nAlthough the authors of a documentary film about him called it \\textit{The\nUnknown Known}, suggesting that he might have \\textit{been} one.} Correcting\nthe errors leading to this paradoxical conclusion will prove very helpful in\narriving at a clearer understanding of quantum states as objective\ninformational bridges.\n\n\\qquad One can think of quantum teleportation as bridging an informational\ngap by reproducing a token of quantum information$_{t}$ at a distant\nlocation. But the notion of information involved in calling a quantum state\nan informational bridge is not the technical notion (information$_{t}$)\nanalyzed by Timpson but the ordinary notion. A token of quantum information$\n_{t}$ is itself an informational bridge in this ordinary sense: it bridges\nthe gap between the state's backing conditions and its advice conditions. It\nis backing conditions in the past light cone of $p$ that determine the\nobjectively correct initial quantum state to assign to Alice's Qbit,\nrelative to $p$. What those backing conditions are depends both on the\nspace-time location of $p$ and on the presence of physical channels capable\nof giving access to them from $p$.\n\n\\qquad Consider Alice's situation at space-time location $A$ as she receives\nher Qbit to be teleported to Bob at $B$. Reliable teleportation requires a\n(classical) physical channel connecting $A$ to $B$. So whatever conditions $\nK $\\ back assignment of initial state $\\left\\vert \\chi \\right\\rangle $ to\nAlice's Qbit relative to an agent-situation with location $A$ apparently\nalso back assignment of initial state $\\left\\vert \\chi \\right\\rangle $ to\nAlice's Qbit relative to an agent-situation with location $B$. If no\nteleportation actually occurred, Bob would not have his own Qbit in state $\n\\left\\vert \\chi \\right\\rangle $ at $B$, but he would appear to be in as good\na position as Alice to assign state $\\left\\vert \\chi \\right\\rangle $ to\nAlice's Qbit at $A$.\n\n\\qquad How could Alice \\textit{not} know what state to assign to her Qbit at \n$A$? Perhaps Carol agreed to prepare this Qbit for Alice at $A$ by taking a\nQbit (they both agree to be) correctly assigned state $\\left\\vert\n0\\right\\rangle $ and subjecting it to a unitary transformation into state $\n\\left\\vert \\chi \\right\\rangle =a\\left\\vert 0\\right\\rangle +b\\left\\vert\n1\\right\\rangle $ without telling Alice what that transformation was.\nWhatever physical conditions $K^{\\prime }$ involved in implementing Carol's\nunitary transformation backing her assignment of $\\left\\vert \\chi\n\\right\\rangle $ occurred in the past light cone of $A$, but in the absence\nof physical channels capable of giving an agent at $A$ access to $K^{\\prime }\n$\\ those conditions would not back assignment of $\\left\\vert \\chi\n\\right\\rangle $ relative to Alice's agent-situation at $A$.\\footnote{\nBut doesn't Carol herself provide such a physical channel? Not if all traces\nof what she did have been erased from her brain and the rest of her body.}\nThen Alice at $A$ should not assign state $\\left\\vert \\chi \\right\\rangle $\nrelative to her agent-situation, while correctly maintaining that her Qbit\nshould be assigned \\textit{some} initial pure state, relative to a different\nagent-situation such as Carol's just after implementing her unitary\ntransformation.\n\n\\qquad In fact Bob at $B$ is in a similar position. The existence of the\nspecific physical channel required for reliable teleportation does not\nguarantee the existence of any other physical channel capable of giving\naccess at $B$\\ to conditions $K$ that back assignment of initial state $\n\\left\\vert \\chi \\right\\rangle $ to Alice's Qbit relative to her\nagent-situation at $A$. If those conditions are physically inaccessible from \n$B$ then they do not back assignment of initial state $\\left\\vert \\chi\n\\right\\rangle $ to Alice's Qbit relative to Bob's agent-situation at $B$. In\nthat case Bob at $B$ should not assign a state to Alice's Qbit, while\ncorrectly maintaining that her Qbit should be assigned \\textit{some} initial\npure state, relative to a different agent-situation such as Alice's or\nCarol's.\n\n\\qquad There is even a scenario in which initial pure state $\\left\\vert \\chi\n\\right\\rangle $ correctly assigned to Alice's Qbit by Carol (relative to her\nagent-situation just after preparing it) is unknown to Alice but \\textit{\nknown} to Bob. This would involve the presence of physical channels\nrendering the conditions $K^{\\prime }$\\ accessible from Bob's\nagent-situation at $B$ but the absence of physical channels rendering\nconditions $K^{\\prime }$\\ accessible from Alice's agent-situation at $A$. In\nthis scenario a quantum state unknown to Alice could be known to Bob whether\nor not it was teleported from Alice to Bob!\n\n\\qquad To sum up, conditions in the past light cone of an agent-situation $G$\n\\ may back assignment of a quantum state to a system relative to some other\nagent-situation $H$, without backing assignment of a quantum state relative\nto $G$. Alice and/or Bob may each be in such an agent-situation\\ in a case\nof quantum teleportation. That is how it can make sense to speak of\nteleporting an unknown quantum state: it makes sense when the state\ncorrectly assigned relative to Carol's agent-situation is unknown to Alice\nand/or Bob, at least one of whom is in an agent-situation relative to which\nno quantum state assignment is possible. Since an agent-situation need not\nbe occupied by any actual agent, Carol's presence is not required.\n\n\\section{Conclusion}\n\nA quantum state functions as an informational bridge between its backing\nconditions and its advice conditions. Since it is assigned from the\nperspective of a physically-characterized agent-situation, what quantum\nstate is assigned is relative to that agent-situation. But this does not\nmake quantum state assignments subjective or dependent on the epistemic\nstate of any agent. Quantum state assignments are objectively correct or\nincorrect: only correct state assignments are reliable informational\nbridges. What makes them reliable are the patterns of statistical\ncorrelation between their backing conditions and their advice conditions\nthat obtain in the physical world. There are objectively correct quantum\nstate assignments whether or not there are any agents capable of making\nthem. But it is physically situated, and so epistemically limited, agents\nwho naturally take the perspective of an agent-situation and so find it\nuseful to assign quantum states from that perspective.\n\n\\qquad Are quantum states\\ real? If they are, what do they represent? There\nare real patterns of statistical correlation in the physical world.\nCorrectly assigned quantum states reliably track these through legitimate\napplications of the Born rule. But the Born rule does not directly\\textit{\\\ndescribe} these patterns: the frequencies they display are not in exact\nconformity to that rule---the unexpected does happen. A quantum state is\nreal in so far as it specifies the real probabilistic relations between its\nbacking conditions and its advice conditions. Those probabilistic relations\nare objective. What they are depends on conditions in the physical world,\neven though probability statements do not directly describe those\nconditions. So a quantum state is not an element of physical reality (it is\nnot a beable): $\\left\\vert \\psi \\right\\rangle $ does not represent a\nphysical system or its properties. But it is real nonetheless. The world\ncontains quantum states just as it contains probabilities, physicists and\ntheir\\ journals. \\newpage\n\n\\begin{thebibliography}{99}\n\\bibitem{Bell} Bell, J.S. [2004]: \\textit{Speakable and Unspeakable in\nQuantum Mechanics}. Revised edition. Cambridge: Cambridge University Press.\n\n\\bibitem{Brun} Brun, T., Finkelstein, J. and Mermin, N.D. [2002]: \"How much\nstate assignments can differ\", \\textit{Physical Review} \\textit{A}, \\textbf{\n65} (2002), 032315.\n\n\\bibitem{Egg} Egg, M. [2013]: \"Delayed-choice experiments and the\nmetaphysics of entanglement\", \\textit{Foundations of Physics},\\textit{\\ }\n\\textbf{43}:1124--1135.\n\n\\bibitem{Gleason} Gleason, A.M. [1957]: \"Measures on the closed subspaces of\na Hilbert space\", \\textit{Journal of Mathematics and Mechanics}, \\textbf{6}:\n885-93.\n\n\\bibitem{Healey 1} Healey, R.A. [2012a]: \\textquotedblleft Quantum theory: a\npragmatist approach\\textquotedblright , \\textit{British Journal for the\nPhilosophy of Science}, \\textbf{63}: 729-71.\n\n\\bibitem{Healey 3} Healey, R.A. [2012b]: \"Quantum decoherence in a\npragmatist view\", \\textit{Foundations of Physics,} \\textbf{42}: 1534-55.\n\n\\bibitem{Healey 2} Healey, R.A. [forthcoming]: \"Locality, probability and\ncausality\", in \\textit{Quantum Nonlocality and Reality}, Mary Bell and Gao\nShan, eds. Cambridge: Cambridge University Press.\n\n\\bibitem{Leifer} Leifer, M. [2014]: \"Is the quantum state real?\", \\textit{\nQuanta}, \\textbf{3}: 67-155.\n\n\\bibitem{Ma} Ma, X-S. [2012]: \"Experimental delayed-choice entanglement\nswapping\", \\textit{Nature Physics}, \\textbf{8}: 480-485.\n\n\\bibitem{Maudlin} Maudlin, T. [2011]: \\textit{Quantum Non-Locality and\nRelativity}, 3rd edition. Chichester, West Sussex: Wiley-Blackwell.\n\n\\bibitem{Mermin 2} Mermin, N.D. [2002]: \"Whose knowledge?\", in R.A.\nBertlmann and A. Zeilinger eds. \\textit{Quantum [Un]Speakables}. Berlin:\nSpringer Verlag.\n\n\\bibitem{Mermin} Mermin, N.D. [2007]: \\textit{Quantum Computer Science}.\nCambridge: Cambridge University Press.\n\n\\bibitem{Peres} Peres, A. [2000]: \"Delayed-choice for entanglement\nswapping\", \\textit{Journal of Modern Optics}, \\textbf{47.}\n\n\\bibitem{Price} Price, H. [1996]: \\textit{Time's Arrow and Archimedes' Point}\n. Oxford: Oxford University Press.\n\n\\bibitem{Timpson} Timpson, C.G. [2013]: \\textit{Quantum Information Theory}.\nOxford: Clarendon Press.\n\n\\bibitem{Weihs} Weihs, G., Jennewein, T., Simon, C., Weinfurter, H., and\nZeilinger, A. [1998]: \"Violation of Bell's inequality under strict Einstein\nlocality conditions\", \\textit{Phyiscal Review Letters,} \\textbf{81}:\n5039-5043.\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 25070, "prevtext": "\nFirst assume a Bell-state measurement is conducted on $\\langle 2,3\\rangle $,\nand the result noted. Conditional on a particular result, one of four\ndifferent entangled states may then be assigned to the pair $\\langle\n1,4\\rangle $. This is entanglement-swapping.\\footnote{\nBy adding a classical channel it may be used to teleport entanglement of a\nQbit.} The particular entangled state of $\\langle 1,4\\rangle $ may be\nverified by quantum tomography in the usual way, and violation of Bell\ninequalities demonstrated. Alternatively, assume the linear polarizations of\neach of $2,3$ are measured independently (instead of the Bell-state\nmeasurement). No matter what the outcomes of the measurements on $2,3$,\nmeasurements of linear polarization on $1,4$\\ will reveal no correlations:\nsince the states then assigned to $1,4$\\ are not entangled their joint\nprobability distribution will factorize.\n\n\\qquad So far I \\ have said nothing about when and where the measurements on \n$1,4$ occur, relative to those on $2,3$. In a standard case of\nentanglement-swapping, the Bell-state measurement $B_{23}$ on $2,3$ occurs\ntime-like earlier than each of the measurements $M_{1},M_{4}$ on $1,4$. But\nthe correlations between the outcomes of measurements $M_{1},M_{4}$\\\nconditional on a particular (joint) outcome of a Bell-state measurement $\nB_{23}$ do not depend on the space-time intervals $I(B_{23},M_{1})$, $\nI(B_{23},M_{4})$. If $B_{23}$ occurs timelike \\textit{later} than $\nM_{1},M_{4}$ then we have an apparent case of \"retrocausal entanglement\nswapping\". Since the choice of whether to perform $B_{23}$ or independent\npolarization measurements $M_{2},M_{3}$ may be made at random \\textit{after}\nphotons $1,4$ have been absorbed into their detectors, this has also been\ncalled delayed choice entanglement-swapping.\\footnote{\nBy Peres [2000]. This has been realized experimentally by Ma \\textit{et al. }\n[2013].}\n\n\\qquad Relative to an agent-situation located just in the overlap of the\nfuture light cones of their production events, the correct initial\npolarization state $\\Psi $\\ to assign to the photons is\n\n", "index": 5, "text": "\\begin{equation}\n\\left\\vert \\Psi _{12}^{-}\\right\\rangle \\left\\vert \\Psi\n_{34}^{-}\\right\\rangle =1/2(\\left\\vert \\Psi _{14}^{+}\\right\\rangle\n\\left\\vert \\Psi _{23}^{+}\\right\\rangle -\\left\\vert \\Psi\n_{14}^{-}\\right\\rangle \\left\\vert \\Psi _{23}^{-}\\right\\rangle -\\left\\vert\n\\Phi _{14}^{+}\\right\\rangle \\left\\vert \\Phi _{23}^{+}\\right\\rangle\n+\\left\\vert \\Phi _{14}^{-}\\right\\rangle \\left\\vert \\Phi\n_{23}^{-}\\right\\rangle .  \\label{4-fold entangled state}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\left|\\Psi_{12}^{-}\\right\\rangle\\left|\\Psi_{34}^{-}\\right\\rangle=1/2(\\left|%&#10;\\Psi_{14}^{+}\\right\\rangle\\left|\\Psi_{23}^{+}\\right\\rangle-\\left|\\Psi_{14}^{-}%&#10;\\right\\rangle\\left|\\Psi_{23}^{-}\\right\\rangle-\\left|\\Phi_{14}^{+}\\right\\rangle%&#10;\\left|\\Phi_{23}^{+}\\right\\rangle+\\left|\\Phi_{14}^{-}\\right\\rangle\\left|\\Phi{}_%&#10;{23}^{-}\\right\\rangle.\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><mrow><mrow><mrow><mrow><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>12</mn><mo>-</mo></msubsup><mo>⟩</mo></mrow><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>34</mn><mo>-</mo></msubsup><mo>⟩</mo></mrow><mo>=</mo><mn>1</mn><mo>/</mo><mn>2</mn><mrow><mo stretchy=\"false\">(</mo><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>14</mn><mo>+</mo></msubsup><mo>⟩</mo></mrow><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>23</mn><mo>+</mo></msubsup><mo>⟩</mo></mrow><mo>-</mo><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>14</mn><mo>-</mo></msubsup><mo>⟩</mo></mrow><mo>|</mo><msubsup><mi mathvariant=\"normal\">Ψ</mi><mn>23</mn><mo>-</mo></msubsup><mo>⟩</mo></mrow><mo>-</mo><mo>|</mo><msubsup><mi mathvariant=\"normal\">Φ</mi><mn>14</mn><mo>+</mo></msubsup><mo>⟩</mo></mrow><mo>|</mo><msubsup><mi mathvariant=\"normal\">Φ</mi><mn>23</mn><mo>+</mo></msubsup><mo>⟩</mo></mrow><mo>+</mo><mo>|</mo><msubsup><mi mathvariant=\"normal\">Φ</mi><mn>14</mn><mo>-</mo></msubsup><mo>⟩</mo></mrow><mo>|</mo><mi mathvariant=\"normal\">Φ</mi><mmultiscripts><mo>⟩</mo><mprescripts/><mn>23</mn><mo>-</mo></mmultiscripts><mo>.</mo></mrow></math>", "type": "latex"}]