[{"file": "1601.05342.tex", "nexttext": "\nwhere the first term of the product contains the electronic and structural properties of a single wire, the second the intrawire \n(first term under square root) and the interwire interaction.\n$n$ is the electron density per unit length, $e$ the elementary charge, $m^\\star$ the effective mass. \n$\\epsilon$ is the dielectric function of Si as partially embedding medium.\n$\\text{K}_0$ are modified Bessel functions of zeroth order and second kind, $k_\\bot$ is the momentum normal to the wires, \nIf $a$ (the effective wire width) is set equal to $a_0$ (a constant for normalization), eq.\\,\\ref{eq2} corresponds to the original formula given in \nrefs.\\,\\cite{Li90,DasSarma96}, which, however, turns out not to describe our findings.\nThe ratio $a_0/a$ accounts both for differences \nin structural motifs and effective wire widths of a single wire, and is the only free parameter in eq.\\,\\ref{eq2}.  \nIn the array of square potentials the first term under the second square root accounts for \nthe self-interaction of a single wire, whereas the second term describes the interaction between \ndifferent wires at multiple distances of $d$. \n\\begin{figure}\n\t\\begin{center}\n\t\t \\includegraphics[width=0.8\\columnwidth]{Fig3.png}\n\t\t\\caption{\\label{FIG3}\n\t\t(color online)  Plasmon dispersion for Au quantum wires grown on Si(553) and on Si(775). Lines are \n\t\tfits according to eq.\\ref{eq2}. Dashed-dotted lines: first terms of eq.\\,\\ref{eq2} for both systems.\n\t\tDotted line: same for Si(557)-Au, fitted data from ref.\\,\\cite{Nagao06}.\n\t\t\n\t\t}\n\t\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n$n$ and $m^\\star$ for the present systems were directly derived from ARPES data \\cite{Crain04}, \ni.e. from the occupied band structure of the Au-modified surface states. We also use their surface band notation.\nThe systems investigated here are characterized by two \nsurface bands, an upper $S_1$ and lower $S_2$, crossing the Fermi level \\cite{Crain04,Barke09}. As we see a metallic behavior of the Si(775)-Au\nsystem, we assume its bands also to cross the Fermi level for a clean sample at room temperature.\nThe ratio $n/m^\\star$ for both bands is identical within error bars. This means that the plasmons of these bands are degenerate and\ncannot be separated experimentally. As a consequence, only a single dispersion curve is expected to be seen for both systems \nwith the electron density corresponding to a single band, in agreement with our findings. \n\nThe fits are shown in fig.\\,\\ref{FIG3} together with the data. \nAn explicit dependence of initial slope and shape of dispersion on structural motifs and on terrace widths is found, \nwhich is not described by existing 1D theories, as we will now demonstrate by concentrating on the first term in eq.\\,\\ref{eq2}. \n\nComparing first Si(553)-Au and Si(775)-Au, which both have the Au double chain, but have different terrace widths,\nthis first term of eq.\\,\\ref{eq2} differs by a factor of 1.4 (after correction for small differences of DOS), \nas indicated by the dashed-dotted lines in fig.\\ref{FIG3}, i.e., it scales with the inverse of the \nterrace width, $d$ ($21.3\\,\\text{\\AA} / 14.8\\,\\text{\\AA} = 1.43$).\n\nSi(775)-Au and  Si(557)-Au \\cite{Nagao06}, on the other hand, have the same terrace widths (within 10\\,\\%, 19.2 vs. 21.3\\,\\AA), \nbut double and single Au chains per terrace, respectively. As seen from ARPES data \\cite{Crain04},  \nthe 1D electron density of Si(775)-Au in the S2 band is {\\it higher} \nby 20\\,\\% than for Si(557)-Au, whereas the effective masses are virtually \nthe same. However, fitting the published data of ref.\\,\\cite{Nagao06} for Si(557)-Au to eq.\\,\\ref{eq2}, \nit turns out that its first term is a factor of 1.6 {\\it larger} for Si(557)-Au than that of Si(775)-Au. \nTaking the differences in $n$ and the $d$-dependence from above for the two systems, the effective width $a$, as suggested  in eq.\\,\\ref{eq2}, \nhas to be reduced effectively by roughly a factor of 2 for Si(557)-Au compared to Si(775)-Au. \nIn other words, not only the periodicity, given by the wire distances $d$, is influencing the dispersion directly, \nbut also the {\\em internal 2D distribution} of electron density within each wire plays an important role in the plasmon dispersion. \nSince for these narrow structures and the given k$_F$ from ARPES only the lowest subband of a quantum well is occupied, combined excitations\nsuch as intersubband plasmon excitations can be ruled out.\n\nThese findings can be summarized by\n\n", "itemtype": "equation", "pos": 14320, "prevtext": "\n\\title{Two-dimensional crossover and strong coupling of plasmon excitations in arrays of one-dimensional atomic wires}\n\n\\author{T. Lichtenstein$^1$}  \\author{J. Aulbach$^3$} \\author{J. Sch\\\"afer$^3$} \\author{R. Claessen$^3$}\n\\author{C. Tegenkamp$^{1,2}$}\n\\author{H. Pfn\\\"ur$^{1,2}$} \\email{pfnuer@fkp.uni-hannover.de}\n\n\\affiliation{$^1$ Institut f\\\"ur Festk\\\"orperphysik, Leibniz Universit\\\"at\nHannover, Appelstra\\ss e 2, 30167 Hannover, Germany}\n\n\\affiliation{$^2$ Laboratorium f\\\"ur Nano- und Quantenengineering (LNQE),\nLeibniz Universit\\\"at Hannover, Schneiderberg 39, 30167 Hannover, Germany}\n\n\\affiliation{$^3$ Physikalisches Institut and RCCM, Universit\\\"at W\\\"urzburg, Am Hubland, W\\\"urzburg, Germany}\n\n\\date{\\today}\n\n\\begin{abstract}\nThe collective electronic excitations of arrays of Au chains on regularly stepped Si(553) and Si(775) surfaces were\nstudied using electron loss spectroscopy with simultaneous high energy and momentum resolution (ELS-LEED) in \ncombination with low energy electron diffraction (SPA-LEED) and tunneling microscopy. \nBoth surfaces contain a double chain of gold atoms per terrace. \nAlthough one-dimensional metallicity and plasmon dispersion is observed only along the wires, \ntwo-dimensional effects are important, since plasmon dispersion explicitly\ndepends both on the structural motif of the wires and the terrace width.\nThe electron density on each terrace turns out to be modulated, as seen by tunneling spectroscopy (STS).\nThe effective wire width of  7.5\\,\\AA\\ for Si(553)-Au -- 10.2\\,\\AA\\ for Si(775)-Au -- ,\ndetermined from plasmon dispersion is in good agreement with STS data. \nClear evidence for coupling between wires is seen beyond nearest neighbor coupling. \n\\end{abstract}\n\\pacs{73.50.Jt, 68.43.-h, 75.23.Lp}\n\\maketitle\n\n\n\nPlasmons, i.e. the collective excitations of electrons, play an important role, e.g. in \nsensor technology \\cite{Schwarz14}, improvement of quantum efficiency in photovoltaic devices \\cite{Atwater10},\nand  even in cancer research \\cite{Oroczo14}.  Recently,  collective excitations of low-dimensional electron gases, \ncalled sheet plasmons, came into focus of research \\cite{Nagao10,Vattuone13}. \nThe wavelength of these sheet plasmons is typically three orders of magnitude  shorter \ncompared to photons of the same frequency.  Thus THz-plasmonics on the scale of a few nanometers becomes feasible. \n\nOne-dimensional (1D) metallic wires and their plasmonic excitations would be ideal for directed energy transport\non the nanoscale, since quasi-linear dispersion is predicted, at least in the long wavelength limit \\cite{Sarma85}, \nfor these 1D plasmons. Such dispersions have indeed been found for regular arrays of atomic wires on insulating \nsubstrates \\cite{Nagao07,Rugeramigabo10,Krieg13}. \nUnder certain conditions of coupling and mutual screening  \nlinearized plasmon dispersions, so-called acoustic surface plasmons, are obtained in 2D systems \\cite{Diaconescu07, Vattuone13}. \nMoreover, confinement effects in these metallic subunits on the surface lead to formation of intersubband \nexcitations \\cite{Rugeramigabo10,Krieg13,Smerieri14}. On the other hand, several fundamental aspects of these low-D plasmons \nsuch as many-body effects, electronic correlations and Coulomb screening \\cite{Lindhard54,Stern67,Singwi68} \nare still rather unexplored and lead to an unsatisfactory description of experimental results \n\\cite{Inaoka07,Nagao07,Rugeramigabo10}.\n\nGrowth of various metals in the submonolayer regime on semiconducting surfaces  provide a superb approach \nfor addressing such fundamental aspects for 1D and 2D systems. The adsorbate induced band structure is generally electronically \ndecoupled from the bulk bands of the host material. Au chains on regularly stepped Si(111) surfaces \nat various tilt angles towards the {$\\rm [\\bar{1} \\bar{1} 2]\\,$} direction are no exception and are particularly interesting systems because of intrinsic surface magnetism \n\\cite{Erwin10, Aulbach13}. \nDepending on coverage and vicinality, the widths of the Au-chains and their interwire \nspacing can be tuned, while their electronic band structures are still very similar. \n0.2\\,ML of Au on Si(557), e.g., result in growth of single atom Au-chains and a row of Si-adatoms \non each mini-terrace with an interwire spacing of 19.2\\,\\AA\\ \\cite{Crain04,Nagao06}. In contrast, Si(553) and Si(775)-Au \nhost double Au chains in the center of the terrace \\cite{Aulbach15,Krawiec10}. \nThe interwire spacing is 14.8\\,\\AA\\ for Si(553)  and 21.3\\,\\AA\\ for Si(775) \\cite{Crain04,Barke09,Erwin10}. For double Au chains, \nnominal coverages of 0.48\\,ML on Si(553) and of 0.32\\,ML on Si(775) result.  \nCommon to all these structures is a graphitic Si-honeycomb chain located at the step edges \\cite{Crain04,Barke09,Erwin10}.\n\n\n\nEach of these system is characterized by metallic bands that are well known from angular resolved photoemission (ARPES) measurements \\cite{Crain04}. \nThey only disperse along \nthe chain direction $k_\\parallel$, and have their minima at the zone boundary. Thus, also the (equilibrium) electron density available for plasmonic excitations is well known.\n\nIn fact, these systems form locally the narrowest possible 1D objects that can be realized, namely chains that are \none or two atoms wide. Therefore, we address here the question of local confinement both for the ground state\nclose to the Fermi level and for the collective excited plasmon state with emphasis on the plasmons. \nWe compare the collective excitations in Si(553)-Au and Si(775)-Au, since the same structural motif of the \ndouble gold chain is present in both systems, and make reference to the Si(557)-Au system with only a single gold chain. \nAlthough purely 1D dispersion along the chain direction is found, the lateral extension of the \ncharge distribution turns out to explicitly influence the slope of the measured plasmon dispersion curves. \nIn other words, this crossover into the second dimension is crucial for the quantitative interpretation of a 1D phenomenon, but\nis not described by existing theories. \nIn contrast, the plasmonic coupling between the wires in the ordered arrays, which is another aspect of dimensional crossover, \ncan be described  quantitatively by existing mesoscopic theories \\cite{Li90,DasSarma96}. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nAll experiments were performed in two different ultra-high vacuum chambers operating at a base pressure of $5 \\times 10^{-11}\\,\\text{mbar}$. \nOne system hosts a high resolution spot profile analysis low energy electron diffractometer \n(SPA-LEED) to investigate and control the sample quality, and a combination of an electron energy loss \nspectrometer with a LEED diffractometer providing high resolution both in energy and momentum \\cite{Claus92} in order to determine\nplasmon dispersion relations. The overall sample quality was checked by a SPA-LEED.\nThe vicinal Si-substrates ($\\rho \\approx 0.01\\,\\Omega\\text{cm}$, n-type) were annealed at \n$1250\\,^\\circ\\text{C}$ for a few seconds \nfollowed by rapid cool down. \nThe appropriate coverages of 0.48\\,ML for Si(553)-Au and 0.32\\,ML for Si(775)-Au were evaporated from a gold pearl on a tungsten \nfilament by direct current heating, or from a crucible at a substrate temperature of $630\\,^\\circ\\text{C}$ . \nThe coverage has been controlled and calibrated by quartz microbalances placed at the position of the samples \n\\cite{Sauerbrey59}. After Au-deposition and cooling room temperature the samples were quickly annealed to \n$930\\,^\\circ\\text{C}$ for $< 1$\\,s,  followed by instantaneous cooling to room temperature.\nThe loss measurements were carried out directly after this post-annealing step in order to avoid \nany influence of residual gas on surface and electronic structure. \nThe scanning tunneling microscopy (STM) measurements were performed at 77\\,K in the second chamber using a low temperature STM manufactured \nby Omicron. The overall sample quality here was checked with an optical LEED.\n\n\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.8\\columnwidth]{Fig1_alternative1.png}\n\t\t\\caption{\\label{FIG1}\n\t\t(color online) a) LEED patterns of the chain structures of Si(553)-Au and Si(775)-Au. \n\t\tb) STM image of the Si(775)-Au \n\t\tchain structure\t(tunneling conditions U= -1.25 V, I = 300 pA): $\\upalpha, \\upbeta, \\upgamma$ mark the Si terrace \n\t\tedge, a row of Si adatoms accompanied by Si restatoms, and a Au double chain with $\\times 2$ period doubling, respectively \\cite{Aulbach15}.\n\t\tSTM experiments were performed at 77\\,K, LEED at 300 K. Bright protrusion could be identified as an adatom defect \\cite{Aulbach15}.}\n\t\\end{center}\n\\end{figure}\n\nHere we demonstrate the close structural similarities between the Si(553)-Au and Si(775)-Au systems which complement and fit to \nthe very similar electronic structures mentioned above. The LEED patterns right after preparation are shown in fig.\\,\\ref{FIG1}a). \nThese patterns are characteristic for regularly stepped (553) and (775) surfaces. They consist of (111)-oriented \nterraces and steps of double atomic height ($d=3.14$\\,\\AA). From the spot splitting of 22\\,\\% SBZ (surface Brillouin zone) \nfor Si(553)-Au and 15.6\\,\\% SBZ for Si(775) we derive average terrace widths of $14.8\\,\\text{\\AA}$ \nfor the Si(553) and of $21.3\\,\\text{\\AA}$ for the Si(775) surface. Thus, the adsorption of 0.48\\,ML of Au on Si(553) -- \n0.32\\,ML on Si(775) -- leaves the periodic array of double steps with sharp spots and $\\times 2$ streaks unchanged, \nindicating high quality 1D order. This is in agreement with STM, exemplarily shown for the (775)-system in (fig.\\,\\ref{FIG1}c)).\nA narrow distribution of terrace widths can be concluded from $(k_{||},k_{\\perp})$-plots in LEED (not shown) and from STM.\n\nHigh resolution STM, shown in fig.\\,\\ref{FIG1}b) for the Si(775)-Au system, reveals details of the atomic arrangement (for an extended set \nof STM data on Si(553)-Au, see ref.\\,\\cite{Aulbach13}). \nEach terrace hosts three structural motifs. Their origin could be disentangled by a detailed analysis via STM and density functional \ntheory, which will be published elsewhere \\cite{Aulbach15}. However, we will list our results here: \nThe motif denoted by $\\alpha$ could be ascribed to the Si honeycomb chain at the\nstep edge. Chain $\\beta$ is formed by a Si adatom row accompanied by Si restatoms (i.e. unpassivated Si atoms).  \nMotif $\\gamma$, most important for this work, could be identified as a double Au-strand \\cite{Aulbach15}, \nsimilar to what was found in Si(553)-Au \\cite{Erwin10,Aulbach13,Krawiec10}.\n\nMost importantly, the chain structures show a $2a=7.7\\,\\text{\\AA}$ \nperiodicity along the wire direction. Correspondingly, LEED reveals modulated $\\times 2$\ndiffraction streaks. The streaks along the {$\\rm [\\bar{1} \\bar{1} 2]\\,$} direction are indicative for  only \nshort-range  correlation between the double periodicity along the chains on the different terraces.\nFor Si(553)-Au, only the Au chains show the $\\times 2$ periodicity. \nTherefore, the modulation and intensity of the $\\times 2$ diffractions streaks there are weaker.\n\n\n\n\n\n\n\n\\begin{figure}[tb]\n\t\\begin{center}\n\\includegraphics[width=.9\\columnwidth]{Fig2a.png}\n\t\t\\caption{\\label{FIG2}\n\t\t(color online) Electron energy loss spectra (primary energy 20\\,eV) of Au-chains grown on Si(553) \n\t\tas a function of $k$ parallel and normal to the wires, as indicated.}\n\t\\end{center}\n\\end{figure}\n\nOn these well ordered arrays of 1D atomic chains, angle resolved electron energy loss spectroscopy measurements \nwere performed. Fig.\\,\\ref{FIG2}a) shows sequences of loss spectra on semi-log scale as a function of \nincreasing $k_\\parallel$ for Si(553)-Au. A similar plot for the orthogonal direction is shown in \nfig.\\,\\ref{FIG2}b). Corresponding spectra for Si(775)-Au are shown in the supplement. \nClose to $k_\\parallel = 0$ the spectra are structureless, apart from a small \nnon dispersing feature that dies out quickly with increasing $k_\\parallel$.\nThe exponentially decaying loss intensity as a function of loss energy elastic peak, known as Drude tail, is the typical signature  \nof the continuum of low-energy excitations in metallic systems \\cite{Krieg15}. \nIt provides evidence that both systems are metallic, in agreement with \nfindings from ARPES for the Si(553)-Au \\cite{Crain04}, STM \\cite{Aulbach13}, and theory \\cite{Erwin10}.\nHowever, it is at variance with the ARPES data for the Si(775)-Au \\cite{Crain04} for reasons still to be explored.\n\nIn the direction along the wires, clear loss features are observed, which shift to \nhigher loss energies with increasing scattering angles, i.e. with  increasing $k_\\parallel$. \nIn the $k_\\bot$ direction, however, i.e. in the direction across the wires, no dispersing mode is seen (see fig.\\ref{FIG2}b)).\nThese findings are indicative for the existence of 1D plasmons.\n\n\n\n\nEach  spectrum was accurately fitted by parametrizing the elastically scattered peak, the actual \nplasmon loss and the Drude background and by applying the same fitting routine to all spectra. \nDetails about the fitting procedure can be found in the supplement and are also elaborated in the appendix of ref.\\,\\cite{Krieg15}. \n\n\n\n\n\n\n\nWe note that  special care has to be taken to eliminate water and hydrogen from the background gas.\nActivated by the electron beam, hydrogen causes disorder in the system increasing with time. \nThe result is (electronic) break-up of the Au chains, as evident from the appearance \nof losses at finite energy and small $k_\\parallel$ whose loss energies increase with \ntime. \n\n\nA similar trend was seen recently also for Ag/Si(557) \\cite{Krieg14,Krieg15}. \n\n\nThe  dispersion curves along the wires resulting from the loss maxima of fig.\\,\\ref{FIG2} are shown in fig.\\,\\ref{FIG3}. \nBoth systems seem to be essentially quasi-1D systems, and should be compared with existing 1D plasmon theory \\cite{Sarma85,Li90,Nagao07,Inaoka07}, therefore.\nCommon to all theoretical approaches is the use of a nearly free electron gas and various approximations for correlations, in the simplest case \nthe random phase approximation (RPA). \nWith this type of approach, a quantitative fit turned out to be possible with the model of coupled wires, sitting in a periodic array of square potentials at \ndistance $d$ \\cite{Li90,DasSarma96}. At small $k_\\parallel$, the dispersion is given by\n\n", "index": 1, "text": "\\begin{multline}\nE = \\hbar \\sqrt{\\frac{4 n e^2}{(1+ \\epsilon)\\epsilon_0 m^* a^2}} k_\\parallel a_0 \\times \\\\\n\\sqrt{\\text{K}_0({\\frac{k_\\parallel a}{2 \\sqrt{2}}) + 2 \\sum_{l=1}^L \\text{K}_0(k_\\parallel ld)\\cdot\\cos{(k_\\bot l d)}}} \\label{eq2}\n\\end{multline}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle E=\\hbar\\sqrt{\\frac{4ne^{2}}{(1+\\epsilon)\\epsilon_{0}m^{*}a^{2}}}%&#10;k_{\\parallel}a_{0}\\times\\\\&#10;\\displaystyle\\sqrt{\\text{K}_{0}({\\frac{k_{\\parallel}a}{2\\sqrt{2}})+2\\sum_{l=1}%&#10;^{L}\\text{K}_{0}(k_{\\parallel}ld)\\cdot\\cos{(k_{\\bot}ld)}}}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mi>E</mi><mo>=</mo><mi mathvariant=\"normal\">ℏ</mi><msqrt><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>n</mi><mo>⁢</mo><msup><mi>e</mi><mn>2</mn></msup></mrow><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>ϵ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ϵ</mi><mn>0</mn></msub><mo>⁢</mo><msup><mi>m</mi><mo>*</mo></msup><mo>⁢</mo><msup><mi>a</mi><mn>2</mn></msup></mrow></mfrac></msqrt><msub><mi>k</mi><mo>∥</mo></msub><msub><mi>a</mi><mn>0</mn></msub><mo>×</mo></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><msqrt><mrow><mrow><msub><mtext>K</mtext><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mfrac><mrow><msub><mi>k</mi><mo>∥</mo></msub><mo>⁢</mo><mi>a</mi></mrow><mrow><mn>2</mn><mo>⁢</mo><msqrt><mn>2</mn></msqrt></mrow></mfrac><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>l</mi><mo>=</mo><mn>1</mn></mrow><mi>L</mi></munderover><mrow><mrow><msub><mtext>K</mtext><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mo>∥</mo></msub><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>d</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mo>⊥</mo></msub><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>d</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow></msqrt></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.05342.tex", "nexttext": "\nwith $a = \\gamma\\cdot d$, where $\\gamma < 1$ is determined by the \ninternal lateral distribution of the electron density in each wire. \n{\\em This means that even in case of purely 1D plasmonic dispersion, there is a crossover to 2D, since \nthe width of a wire on the atomic scale and the internal electronic distribution within the very wire\nenter directly the slope of plasmonic dispersion, which cannot be treated as a correction to 1D properties.} \n  \nWith respect to coupling between the wires, we obtained the best fit when the sum in eq.\\,\\ref{eq2} under the \nsquare root is truncated after the second term ($L=2$), an indication of a finite range of interaction. \nThis result may not be quantative, since the model of eq.\\,\\ref{eq2} neglects damping and dephasing between wires. \nOn the other hand, this analysis clearly demonstrates  that the array of 1D plasmons is coupled.\n\n\\begin{figure}[tb]\n\t\\begin{center}\n\t\t\\includegraphics[width=0.7\\columnwidth]{Fig4_alternative1.png}\n\t\t\\caption{\\label{STM} a) Combined image of tunneling microscopy and spectroscopy of Au on Si(553). \n\t\tBottom: topography image (U= 0.1\\,V, 50\\,pA) with Si edge (bright) and period doubled Au chains, very similar \n\t\tto Si(775)-Au (see fig.\\,\\ref{FIG1}). Top: dI/dU map of the same sample area recorded with the Lock-In \n\t\ttechnique ($U_{mod} = 10$\\,mV) displayed close to $E_F$ (U$_{dc} = +6.4$\\,meV) .\nThe density of states (DOS) is significantly enhanced at the Au chain position. \n  b) Line scan through the dI/dU map from above normal to the steps \n\t\tindicated by the white dashed line, fit is given by the red curve.}  \n\\end{center}\n\\end{figure}\n\nOur plasmon analysis suggests an internal modulation of the relevant electron density within each terrace. \nAlthough this electronic modulation may not be exactly the same in the collectively excited state, \nsuch a modulation is indeed seen in tunneling spectroscopy (STS) close to the Fermi level, using the Si(553)-Au system as a test\nsystem.  This corroborates our suggestions from above. \nThe combination of STM and STS (fig.\\,\\ref{STM}) not only shows the modulation, it demonstrates that the highest density of states (DOS)\nis indeed located at the gold chains. The FWHM of this modulation (see fig.\\,\\ref{STM}b)) is $6.5\\pm0.5$\\,\\AA, i.e. it is close to the geometric \nwidth of a double gold chain on a Si(111) terrace. Although the amplitude of this modulation is only around 10\\,\\%, \nit clearly demonstrates that also for the plasmon excitation this electronic density modulation must be relevant. If the plasmon of the lowest \nsubband is also confined to the gold double-chain, a comparable width is expected. \nIndeed, using eq.\\,\\ref{eq2} and setting $a_0$ to the separation of atomic rows on the Si(111) terraces of 3.32\\,\\AA,\nbest fits of the measured dispersion curves are obtained \nwith values of $a=7.5$\\,\\AA\\ for Si(553)-Au, 10.2\\,\\AA\\ for Si(775)-Au and 5.9\\,\\AA\\ for Si(557)-Au. The latter value\nwas obtained by neglecting coupling between wires in the fit. These values suggest that confinement of quasi-1D plasmons  \nis related, but not simply determined by the geometric width of the electronic ground state, and that both the \nstructural motif and the terrace width play a crucial role.  \n\t\t\n\n\n\n\n\nSummarizing, we investigated plasmonic excitations in the narrowest quasi-1D systems experimentally possible, i.e. in  \narrays of atomic metallic wires formed by single and double Au chains in vicinal Si(111) surface at various step \ndensities. While only a 1D dispersing plasmon mode along the wires was found, the slope of the dispersion explicitly \ndepends on the charge distribution within each mini-terrace and on distance between wires, even for identical 1D ratios\n$n/m^\\star$, thus superimposing 2D properties onto the 1D dispersion. While these findings require extensions of 1D plasmon theory, \nthis dimensional crossover leads to new possiblities for tuning 1D plasmon dispersions. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\\vspace{1ex}\n{\\bf Acknowledgement} Financial support by the Deutsche Forschungsgemeinschaft through FOR1700 is gratefully acknowledged.\\\\\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem{Schwarz14} B. Schwarz, P. Reininger, D. Ristani$\\rm \\acute{c}$,  H. Detz, A. M. Andrews, W. Schrenk, G. Strasser, Nat. Comm. {\\bf 5}, 2013.\n\\bibitem{Atwater10} H.A. Atwater and A. Polman, Nat. Mat. {\\bf 9}, 2015 (2010).\n\\bibitem{Oroczo14} Ciceron Ayala-Orozco et.al. Nano {\\bf 8}, 6372 (2014).\n\\bibitem{Nagao10} T. Nagao, G. Han, C. V. Hoang, J.-S. Wi, A. Pucci, D. Weber, F. Neubrech, V.M. Silkin, D. Enders, O. Saito M. Rana, Sci. Technol. Adv. Mater. {\\bf 11}, 054506 (2010).\n\\bibitem{Vattuone13} L. Vattuone, M. Smerieri, T. Langer, C. Tegenkamp, H. Pfn\\\"ur, V. M. Silkin, E. V. Chulkov, P. M. Echenique, M. Rocca, Phys. Rev. Lett.  {\\bf 110}, 127405 (2013).\n\\bibitem{Sarma85} S. Das Sarma, Wu-yan Lai, Phys. Rev. B {\\bf 32}, 1401 (1985).\n\\bibitem{Nagao07} T. Nagao, S. Y. Agumina, T. Inaoka, T. Sakurai,  D. Jeon, J. phys. Soc. Jap. {\\bf 76}, 107714 (2007).\n\\bibitem{Rugeramigabo10} E.P. Rugeramigabo, C. Tegenkamp, H. Pfn\\\"ur, T. Inaoka, T. Nagao,  Phys. Rev. B {\\bf 81}, 165407 (2010).\n\\bibitem{Krieg13} U. Krieg, C. Brand, C. Tegenkamp, H. Pfn\\\"ur , Journal of Physics: Condensed Matter {\\bf 25}, 014013 (2013).\n\\bibitem{Diaconescu07} Diaconescu et.al. , Nature {\\bf 448}, 57 (2007).\n\\bibitem{Smerieri14} M. Smerieri, L. Vattuone, L. Savio, T. Langer, C. Tegenkamp, H. Pfn\\\"ur, V.M. Silkin, M. Rocca, Phys. Rev. Lett. {\\bf 113}, 186804 (2014).\n\\bibitem{Lindhard54} J. Lindhard, Kgl. Danske Videnskab. Selskab, Mat. Fys. Medd. {\\bf 28}, No 8 (1954).\n\\bibitem{Stern67} F. Stern, Phys. Rev. Lett. {\\bf18}, 546 (1967).\n\\bibitem{Singwi68} K. Singwi, M. Tosi, R. Land, A Sj\\\"olander, Phys. Rev. {\\bf 176}, 589â\u0080\u0093599 (1968).\n\\bibitem{Inaoka07} T. Inaoka and T. Nagao, Material Transactions, {\\bf 48}, 718 (2007).\n\\bibitem{Erwin10} S.C Erwin and F.J. Himpsel, Nat. Comm. {\\bf 1}, 58 (2010).\n\\bibitem{Aulbach13} J. Aulbach, J. Sch\\\"afer, S.C. Erwin, S. Meyer, C. Loho, J. Settelein, R. Claessen, Phys. Rev. Lett. {\\bf 111}, 137203 (2013).\n\\bibitem{Aulbach15} J. Aulbach, S. Erwin, R. Claessen,  J. Sch\\\"afer, in preparation.\n\\bibitem{Crain04} J.N. Crain, J.L. McChesney, Fan Zheng, M.C. Gallagher, P.C. Snijders, M. Bissen, C. Gundelach, S.C. Erwin, and F.J. Himpsel,  \nPhys. Rev. B{\\bf 69}, 125401 (2004).\n\\bibitem{Nagao06} T. Nagao, S. Yaginuma, T. Inaoka, T. Sakurai, Phys. Rev. Lett. {\\bf 97}, 116802 (2006).\n\\bibitem{Krawiec10} M. Krawiec, Phys. Rev. B {\\bf 81}, 115436 (2010).\n\\bibitem{Barke09} I. Barke, F. Zheng, T. K. R\\\"ugheimer, and F. J. Himpsel, Phys. Rev. Lett. {\\bf 97},  226405 (2006).\n\\bibitem{Li90} Q. Li, S. Das Sarma, Phys. Rev. B {\\bf 41}, 10268 (1990).\n\\bibitem{DasSarma96} S. Das Sarma and E.H. Hwang, Phys. Rev. B {\\bf 54}, 1936 (1996).\n\\bibitem{Claus92} H. Claus,  A. B\\\"{u}ssensch\\\"{u}tt, M. Henzler,  Rev. Sci. Instrum. {\\bf 63}, 2195 (1992).\n\\bibitem{Sauerbrey59} G. Sauerbrey, Zeitschrift f\\\"{u}r Phys. {\\bf 155}, 206 (1959).\n\\bibitem{Krieg15} U. Krieg, T. Lichtenstein, C. Brand, C. Tegenkamp, H. Pfn\\\"ur, New J. Phys., {\\bf  17}, 043062 (2015).\n\\bibitem{Krieg14} U. Krieg, Yu Zhang, C. Tegenkamp, H. Pfn\\\"ur, New J. Phys. {\\bf 16}, 043007 (2014).\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n", "itemtype": "equation", "pos": 19018, "prevtext": "\nwhere the first term of the product contains the electronic and structural properties of a single wire, the second the intrawire \n(first term under square root) and the interwire interaction.\n$n$ is the electron density per unit length, $e$ the elementary charge, $m^\\star$ the effective mass. \n$\\epsilon$ is the dielectric function of Si as partially embedding medium.\n$\\text{K}_0$ are modified Bessel functions of zeroth order and second kind, $k_\\bot$ is the momentum normal to the wires, \nIf $a$ (the effective wire width) is set equal to $a_0$ (a constant for normalization), eq.\\,\\ref{eq2} corresponds to the original formula given in \nrefs.\\,\\cite{Li90,DasSarma96}, which, however, turns out not to describe our findings.\nThe ratio $a_0/a$ accounts both for differences \nin structural motifs and effective wire widths of a single wire, and is the only free parameter in eq.\\,\\ref{eq2}.  \nIn the array of square potentials the first term under the second square root accounts for \nthe self-interaction of a single wire, whereas the second term describes the interaction between \ndifferent wires at multiple distances of $d$. \n\\begin{figure}\n\t\\begin{center}\n\t\t \\includegraphics[width=0.8\\columnwidth]{Fig3.png}\n\t\t\\caption{\\label{FIG3}\n\t\t(color online)  Plasmon dispersion for Au quantum wires grown on Si(553) and on Si(775). Lines are \n\t\tfits according to eq.\\ref{eq2}. Dashed-dotted lines: first terms of eq.\\,\\ref{eq2} for both systems.\n\t\tDotted line: same for Si(557)-Au, fitted data from ref.\\,\\cite{Nagao06}.\n\t\t\n\t\t}\n\t\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n$n$ and $m^\\star$ for the present systems were directly derived from ARPES data \\cite{Crain04}, \ni.e. from the occupied band structure of the Au-modified surface states. We also use their surface band notation.\nThe systems investigated here are characterized by two \nsurface bands, an upper $S_1$ and lower $S_2$, crossing the Fermi level \\cite{Crain04,Barke09}. As we see a metallic behavior of the Si(775)-Au\nsystem, we assume its bands also to cross the Fermi level for a clean sample at room temperature.\nThe ratio $n/m^\\star$ for both bands is identical within error bars. This means that the plasmons of these bands are degenerate and\ncannot be separated experimentally. As a consequence, only a single dispersion curve is expected to be seen for both systems \nwith the electron density corresponding to a single band, in agreement with our findings. \n\nThe fits are shown in fig.\\,\\ref{FIG3} together with the data. \nAn explicit dependence of initial slope and shape of dispersion on structural motifs and on terrace widths is found, \nwhich is not described by existing 1D theories, as we will now demonstrate by concentrating on the first term in eq.\\,\\ref{eq2}. \n\nComparing first Si(553)-Au and Si(775)-Au, which both have the Au double chain, but have different terrace widths,\nthis first term of eq.\\,\\ref{eq2} differs by a factor of 1.4 (after correction for small differences of DOS), \nas indicated by the dashed-dotted lines in fig.\\ref{FIG3}, i.e., it scales with the inverse of the \nterrace width, $d$ ($21.3\\,\\text{\\AA} / 14.8\\,\\text{\\AA} = 1.43$).\n\nSi(775)-Au and  Si(557)-Au \\cite{Nagao06}, on the other hand, have the same terrace widths (within 10\\,\\%, 19.2 vs. 21.3\\,\\AA), \nbut double and single Au chains per terrace, respectively. As seen from ARPES data \\cite{Crain04},  \nthe 1D electron density of Si(775)-Au in the S2 band is {\\it higher} \nby 20\\,\\% than for Si(557)-Au, whereas the effective masses are virtually \nthe same. However, fitting the published data of ref.\\,\\cite{Nagao06} for Si(557)-Au to eq.\\,\\ref{eq2}, \nit turns out that its first term is a factor of 1.6 {\\it larger} for Si(557)-Au than that of Si(775)-Au. \nTaking the differences in $n$ and the $d$-dependence from above for the two systems, the effective width $a$, as suggested  in eq.\\,\\ref{eq2}, \nhas to be reduced effectively by roughly a factor of 2 for Si(557)-Au compared to Si(775)-Au. \nIn other words, not only the periodicity, given by the wire distances $d$, is influencing the dispersion directly, \nbut also the {\\em internal 2D distribution} of electron density within each wire plays an important role in the plasmon dispersion. \nSince for these narrow structures and the given k$_F$ from ARPES only the lowest subband of a quantum well is occupied, combined excitations\nsuch as intersubband plasmon excitations can be ruled out.\n\nThese findings can be summarized by\n\n", "index": 3, "text": "$$\\omega_p \\propto \\sqrt{\\frac{n\\cdot a_0^2}{m^\\star\\cdot a^2}}$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\omega_{p}\\propto\\sqrt{\\frac{n\\cdot a_{0}^{2}}{m^{\\star}\\cdot a^{2}}}\" display=\"block\"><mrow><msub><mi>ω</mi><mi>p</mi></msub><mo>∝</mo><msqrt><mfrac><mrow><mi>n</mi><mo>⋅</mo><msubsup><mi>a</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mrow><msup><mi>m</mi><mo>⋆</mo></msup><mo>⋅</mo><msup><mi>a</mi><mn>2</mn></msup></mrow></mfrac></msqrt></mrow></math>", "type": "latex"}]