[{"file": "1601.04890.tex", "nexttext": "\nwhere $X$ is a gender, and $Y$ is a n-gram.\nThe value of $P(X)$ can be estimated from the proportions of biographies about men and women, and the other probabilities can be estimated from n-gram frequencies.\nPMI is zero if $X$ is independent of $Y$, it is greater than 0 if $X$ is positively associated with $Y$, and it is smaller than 0 if $X$ negatively associated with $Y$.\nNote that we excluded words that appear in biographies from one gender only, because those words cannot be compared in a meaningful way with words that occur in both genders. A PMI of zero of a word appearing in one gender only does not allow to differentiate between independence ({\\emph{e.\\,g.}}, a word that is used consciously only for one gender) and exclusiveness ({\\emph{e.\\,g.}}, a gender-specific name).\nFinally, we compare the proportion of topics that are present in the top 200 n-grams that we associated with men and women using chi-square tests. In the absence of topical asymmetries, one would expect to observe only minor differences in the proportions of topics for men and women.\n\n\n\\smallskip\n\\textbf{Linguistic Bias:}\n\nTo measure linguistic bias, we use a lexicon-based approach and syntactic\nannotations to detect abstract and subjective language as proposed in\n\\cite{Otterbacher2015}. The level of abstraction of language can be detected\nthrough the syntactic class of terms used in a text, where adjectives are the\nmost abstract class, as for example comparing ``is violent'' with ``hurt the\nvictims'' \\cite{Gorham2006}. \n\nTo test the existence of linguistic biases in Wikipedia, we quantify the\ntendency of expressing positive and negative aspects of biographies with\nadjectives, as a measure of the degree of abstraction of positive and negative\ncontent. {\nWe quantify the tendency to use abstract language in each evaluative class as\nthe ratio of adjectives among positive and negative words. To do so, we detect positive and negative evaluative terms taken from the\n\\emph{Subjectivity Lexicon} \\cite{Wilson2005}. For each evaluative term that we find in the lexicon we check if it is an adjective or not based on Parts-Of-Speech tags \\cite{Bird2009}. \n\n\n\nAfter processing the text, we count for each biography the amounts of positive\n$W_{+}$ and negative $W_{-}$ words, and from those the amount of positive\nadjectives $A_{+}$ and of negative adjectives $A_{-}$. We combine these\ncounts into ratios of abstract positivity and negativity computed as\n$r_{+}=A_{+}/W_{+}$ and $r_{-}=A_{-}/W_{-}$. This way, we quantify the\ntendency to generalize positive and negative aspects of the biographies, with\nthe purpose of testing if this generalization depends on the gender of the\nperson being described.\n\nThe presence of gender stereotypes and sexism as well as the Linguistic Intergroup Bias (LIB) theory suggests that abstract terms would be more likely to be used to describe positive\naspects in the biographies of men than in biographies of women. \nSimilarly, abstract language would be more likely to describe negative aspects in the biographies of\nwomen in comparison to biographies of men. }\n\nWe test this hypothesis first\nthrough a chi-square test on the aggregated ratios of adjectives over positive\nand negative words in all biographies of each gender. To test if the bias\nappears at the biography level, we focus on biographies with at least 250\nwords and one evaluative term, testing if the measured $r_{+}$ and $r_{-}$\ndepends on gender { while controlling for professions and the century in which a person was born.}\n\n\n\n\\subsubsection{Structural Properties}\nStructural properties impact how visible and reachable articles about notable men and women are, since users and algorithms rely on this information when navigating  \nWikipedia or when assessing the relevance of content within a certain context, among other contexts. For instance, search result rankings are often informed by centrality measures such as PageRank. Furthermore, search results show meta-data when the query is related to notable personalities ({\\emph{e.\\,g.}}, Google Knowledge Graph \\cite{singhal2012introducing}). \nThese examples show that gender inequalities that manifest in the structure of Wikipedia may have many implications since they impact the information consumption process. \n \n\\smallskip\n\\textbf{Meta-data:}\nTo provide structured meta-data, DBpedia processes content from the infoboxes in Wikipedia articles.\nThe infoboxes are tables with specific attributes that depend on the main activity associated with the person portrayed in the article. For instance, anyone has attributes like date/place of birth, but philosophers have ``Main Ideas'' in their attributes, and soccer players have ``Current Team'' as an attribute.\nTo explore asymmetries between attribute distributions according to gender, we first identify all meta-data attributes present in the dataset. Then, for each attribute we count the number of biographies that contain it. Finally, we compare the relative proportions of attribute presence between genders using chi-square tests, considering the male proportion as baseline, and discuss which differences go beyond what can be explained by differences across professional areas. \n\n\\smallskip\n\\textbf{Hyperlink Network:}\nWe build a network of biographies using the hyperlink structure between Wikipedia articles about people in the English language editions. Concretely, we use the structured link between the canonical URLs of each article provided by DBpedia where redirects are resolved. \nOn this network we perform two different analyses: firstly, we explore to what extent the connectivity between people is influenced by gender, and secondly, we investigate the relation between the centrality of people in the network and their gender. \n\nWe first estimate the proportion of links from gender \\textit{g1} to gender \\textit{g2} $(\\frac{P(to=g_2 | from=g_1)}{P(to=g_1)}$. These proportions will be tested against the observed proportions of each gender in the dataset using a chi-square test.\nSecond, we compute the PageRank of articles about people. PageRank is a widely used measure of node centrality that is based on network connectivity \\cite{brin1998anatomy,Fortunato08internetmath}. \nTo explore potential asymmetries in network centrality, we sort the list of biographies according to their PageRank values in descending order. \nWe estimate the fraction of biographies that are about women at different ranks $k$.\nIn the absence of any kinds of inequality, whether endogenous or exogenous to Wikipedia, one would expect the fraction of women to be around the overall proportion of women biographies, irrespective of $k$. \n\nTo discern whether the observed asymmetries {with respect to } gender go beyond what we would expect to observe by chance, we compare our empirical results from the previous two analysis with the results obtained from baseline graphs that are constructed as follows:\n\\begin{itemize}\n \\item \\textit{Random}. \nWe shuffle the edges in the original network. \nFor each edge (u,v), we select two random nodes (i,j) and replace (u,v) with (i,j). The resulting network is a random graph with neither the heterogeneous degree distribution nor the clustered structure that the Wikipedia graph reveals \\cite{zlatic2006wikipedias}.\n \\item \\textit{Degree Sequence}. \nWe generate a graph that preserves both in-degree and out-degree sequences (and therefore both distributions) by shuffling the structure of the original network. \nFor a random pair of edges ((u,v), (i,j)) rewire to ((u,j), (i,v)). \nWe repeat this shuffling as many times as there are edges. Note that although the in- and out-degree of each node are unchanged, the degree correlations and the clustering are lost.\n \\item \\textit{Small World}. \nWe generate an undirected small world graph using the model by Watts and Strogatz \n\\cite{watts1998collective}. \nThis model interpolates a random graph and a lattice in a way that preserves two  properties of small world networks: average path length and clustering coefficient. After building the graph, we randomly assign a gender to each node, maintaining the proportions from the observed network. \n\\end{itemize}\n\n\n\\subsection{Tools}\n\nWe provide implementations of our methods, as well as data-gathering tools, in a public repository available at \\url{https://github.com/clauwag/WikipediaGenderInequality}.\n\n\n\n\\section{Results}\n\nIn this section we present the results of our empirical study about gender inequalities in Wikipedia.\n\n\\subsection{Inequalities in Global Notability Thresholds}\nWe test our hypothesis that women who made it into Wikipedia will be more notable than men if the Wikipedia entry point functions as a glass ceiling that makes it more difficult for women to join. \nWe measure notability using the number of language editions in which a person is depicted as internal proxy measure and Google trend search volume as external proxy measure.\n\nNote that we filtered biographies that did not have a birth date in their meta-data, as well as those with birth date previous to year 0, and those with birth date greater than year 2015. \nConsequently, in this analysis we consider $N = 590,741$ biographies (with 14.7\\% women). \nBeside examining all biographies at once, we split the dataset in two parts (people born before 1900 and afterward) since the presence of women and their access to resources has changed drastically over time.\nThat means, we consider biographies of people born before the year 1900 ($N_b = 134,306$, with 7.8\\% women) and biographies of people born after it ($N_a = 456,435$, with 16.8\\% women).\n\n\n\\subsubsection{Number of Language Editions}\nWe explored the ratio between men and women as a function of the number of language editions in which they are depicted. \nIf the Wikipedia entry indeed functions as a glass ceiling, we expect to see a larger gender gap for ``local heroes'' than for ``superstars'', because less female local heroes will be able to overcome the glass ceiling. Therefore, on average, women in Wikipedia should also be more notable than their male counterparts since less notable women are simply not depicted.\nOn the contrary, less notable men are present, which decreases their average notability.\n\n\\begin{figure}[tp]\n\\centering\n \\begin{tabular}{c}\n\n\\includegraphics[width=0.95\\linewidth]{img/numedition_gender_ratio_palette.png}\n\\end{tabular}\n\\caption{\\textbf{Men-Women Ratio:} \nRatio of men to women that show up in N language editions before 1900 (Left) and in/after 1900 (Right). \nIn and after 1900 the gap between the number of men and women is larger for people with low or medium level of global notability than for the global superstars. The empirical observed gender gap for people with low and medium notability goes beyond what we would expect by randomly reshuffling the gender of people.}\n\\label{fig:numlang_ratio}\n\\end{figure}\n\nFigure \\ref{fig:numlang_ratio} shows that the gap between men and women is indeed larger for people with low or medium level of global notability than for the ``global superstars''. \nOne can see that the empirical observed gender gap for people with low and medium notability goes beyond what we would expect by randomly reshuffling the gender of people 1000 times. One potential explanation for this is that the entry barrier into Wikipedia is higher for women than for men, since the gap between those with medium and low levels of notability is greater than the gap between highly notable women and men.\nOne needs to note that people can also create articles about themselves in Wikipedia and \nmen are potentially more likely to create an article about themselves because they are on average more self-absorbed than women \\cite{Grijalva2015}.\n{Another potential explanation is that more information about low- or medium-notable men  is available online than it is for low- or medium-notable women. Since Wikipedia editors rely on secondary information sources they certainly also reflect the bias that exist in other media.}\n\n\\begin{table}[tb]\n\\centering\n\\scriptsize\n\\caption{\\textbf{Interest via Number of Language Editions}: Results of three negative binomial regression models that use the number of language editions in which an article about a person shows up as dependent variable and gender as independent variable, while controlling for profession and birth century. In the full dataset and the subset of people born after 1900, women are slightly more notable than men since the coefficient is significantly positive even when controlling for other variables such as professions and age. $^{***}: p < 0.001$}\n\\input{table_edition_count_regression}\n\\label{table:edition_count_regression}\n\\end{table}\n \nTo further quantify the glass-ceiling effect while controlling for other factors that may potentially explain our results ({\\emph{e.\\,g.}}, profession and age), we use a negative binomial regression model and explore the effect of gender on the number of language editions in which a person shows up.\nWe performed three different regressions: one for people born before 1900 ($N_b$), one for people born in or after 1900 ($N_a$), and one for the entire dataset ($N$). \nThe coefficients that are reported in Table \\ref{table:edition_count_regression} can be  interpreted as follows: if all other factors in the corresponding model were held constant, an increase of one unit in the factor ({\\emph{e.\\,g.}}, from male to female, from Person to Scientist, etc.) would increase the logarithm of the number of editions by the fitted coefficient $\\beta$. The Incidence Rate Ratio (IRR) of each factor is obtained by exponentiating its coefficient. \n\nIf we look at the regression from the full dataset (see last column in Table \\ref{table:edition_count_regression}), we observe that being female makes a biography increase its edition count by an IRR of $1.13$, having all other parameters fixed. This effect is significant ($p < 0.001$), indicating that women who are depicted in Wikipedia are slightly more notable than their male counterparts. \nWe also observe interesting differences for professions. For example, being a \\textit{Philosopher} has the strongest positive effect on being of global importance ($IRR = 4.70$, $p < 0.001$), while being a \\textit{Journalist} has the strongest negative effect on global importance ($IRR = 0.37$, $p < 0.001$). This indicates that people with certain professions are more likely to be globally recognized if they contributed something, while others are more likely to be locally recognized. \n{ While we do observe interesting differences for professions, further analysis is necessary to answer the questions if the professional differences in terms of notability are confounded by the average birth decade of people with that profession. For instance, one needs to note that a quarter of the top-100 list of historical figures are philosophers \\cite{whosbigger}, while journalists are more likely to belong to the people who became famous in recent years.}\n\nFurther, the model indicates that the decade a person was born in is negatively associated with notability ($IRR = 0.99$, $p < 0.001$). That means, the more historic a person is, the more notable (s)he is from a global perspective. This is expected: people from older centuries appear on  Wikipedia because their ideas and actions have transcended in time (through secondary sources). Conversely, famous people from nowadays can be notable in terms of availability of secondary sources, but not necessarily because their ideas will remain valuable in time. \n{ Interestingly, we find that the birth decade factor has a different effect when we look at people pre-1900 and post-1900. \nFor people born before 1900, as with the global dataset, being historic is associated with notability ($IRR_b = 0.98$, $p < 0.001$). \nIf we only look at people born in or after 1900 we see that Wikipedia developed a ``recency bias'' ($IRR = 1.01$, $p  = 0.008$). \nThat means, for people born in or after 1900 the birth year is positively associated with notability. Consequently, people in this group are slightly more notable if they have been born more recently. \nOne potential explanation for this is that nowadays younger people may benefit from the larger availability of digital information about them or generated by them, which makes them more likely to be found and recognized by Wikipedians.}\n\n\\begin{figure}[tp]\n\\centering\n \\begin{tabular}{c}\n\n\\includegraphics[width=0.95\\linewidth]{img/gender_time_histogram.png}\n\\end{tabular}\n\\caption{\\textbf{Distribution of Biographies in Time:} The number of men and women in Wikipedia that are born in a certain year. One can see that the number of people that make it to Wikipedia increases with their birth year. Also the fraction of notable women increases.}\n\\label{fig:time_histogram}\n\\end{figure}\n\n\\begin{figure}[tp]\n\\centering\n \\begin{tabular}{c}\n\n\\includegraphics[width=0.95\\linewidth]{img/numedition_gender_boxplot.png}\n\\end{tabular}\n\\caption{\\textbf{Notability Per Birth Year:} \nThe mean number of language editions in which men and women are covered as a function of their birth year. \nOne can see that the global importance is decreasing with birth years which indicates that less historic people are also covered by Wikipedia if they are only of local importance. This can in part be explained by the availability of information about this people, but also by the collective generation process where the editors of each language edition describe their own local heroes. One can see that among the people born after 1600 women are slightly more notable than men, while before 1600 it is the other way around.}\n\\label{fig:numlang_birth}\n\\end{figure}\n\nWe also find that being female has small but significant effects on being of global importance ({\\emph{i.\\,e.}}, being depicted in many language editions) in both datasets (pre- and post-1900), although the effect is positive in post-1900 and negative in pre-1900.\nThat means, that for people who are born before 1900 and made it into Wikipedia, being a female decreases the chances of notability, which is aligned with the historical exclusion of women.\nConversely, for people depicted in Wikipedia who are born in or after 1900, being female increases the chances of notability.\n{ We assume that for people born before 1900 Wikipedia does not function as a glass ceiling, because firstly fewer notable women existed due to imbalanced access to resources (see Figure \\ref{fig:time_histogram}), and  secondly a clear relation exists between being historic and being of global importance in Wikipedia (see Figure \\ref{fig:numlang_birth})}.  \n\n \n\\begin{table}[tb]\n\\centering\n\\scriptsize\n\\caption{\\textbf{Interest via Google Trend Data:} Linear regression results where the number of regions or number of months with a search volume above the threshold were used as independent variable and gender is used as dependent variable. We use a random sample of 5245 people born after 1900 and before 2000 to fit the model. One can see that women inside Wikipedia are on average of interest to people from more different geographic regions than men. The difference in the number of months in which men and women expose a global search volume above google's threshold is not significant.  $^{***}: p < 0.001, ^{*}: p < 0.05$}\n\\label{table:gtrend_regression_ols}\n\\input{table_gtrend_regression_ols}\n\\end{table}\n \n\\subsubsection{Google Search Trends}\n\nWe compare the external notability proxy ({\\emph{i.\\,e.}}, the spatial and temporal search interest) of a random sample of men and women that made it into Wikipedia and were born in or after 1900. Table \\ref{table:gtrend_regression_ols} shows that women inside Wikipedia are indeed slightly more of interest to the world according to the relative search volume statistics of Google. Both coefficients are positive. \nHowever, only the coefficient for the number of months with volume above the threshold ($IRR = 1.08$) is significant.\nThe mean number of regions which reveal a search volume above the threshold for women is $1.93$, while it is $1.51$ for men. The median is 0 for both, men and women.\nThe mean number of months during which we observe a global search volume above the threshold is $32$ for women, while it is $30$ for men. The median number of months for women is $1$ and $0$ for men.\n\n{\nDue to difficulties of collecting large amount of Google trend data, we could not control for profession and birth year, but we focus on a random sample of men and women born in 1900 or later . \nOne needs to note that women who are depicted in Wikipedia tend to be born in recent years (see Figure \\ref{fig:time_histogram}) and people born in recent years may potentially have received more attention on Google between 2004 and 2015.\nTo address this confounding factor we plan to collect more data for different sub-samples of people who share the same profession and are born in the same year. \n\n}\n\n\n\n\\subsection{Topical and Linguistic Asymmetries}\nLanguage is one of the primary media through which stereotypes are conveyed. In the following we explore differences in the words and word-sequences that are frequently used when writing about men or women to uncover topical and linguistic biases.\n\n\\subsubsection{Topical Bias}\n\n{ Following the notability analysis, to consider time as confounding factor we consider two groups of biographies -- those with birth date previous to 1900, and those with birth date from 1900 onwards.\nWe estimated PMI of each word and bi-gram in our vocabulary for each gender. Since PMI overweights words with very small frequencies, we considered only n-grams that appear in at least 1\\% of men or women's biography overviews. The following details the findings in each dataset:\n\n\\begin{itemize}\n \\item Pre-1900: the three most associated words to females are \\textit{her husband}, \\textit{women's}, and \\textit{actress}. The three most associated to males are \\textit{served}, \\textit{elected}, and \\textit{politician}.\n \\item 1900--onwards: the three most associated words to females are \\textit{actress}, \\textit{women's}, and \\textit{female}. The three most associated to males are \\textit{played}, \\textit{league}, and \\textit{football}.\n\\end{itemize}\n\n\\begin{table}[tb]\n\\centering\n\\scriptsize\n\\caption{\\textbf{Topical Bias:} Proportion of the top 200 most associated words (PMI) to each gender that fall into a given category, separated by pre- and post- birth dates of biographies. \nOne can see that women tend to have more words related to family, gender and relationships than men. \n{ However, only pre-1900 the distribution is significantly different ($\\chi^2 = 14.33$, $p < 0.01$). On the post-1900 dataset the chi-square test is not significant ($\\chi^2 = 5.43$, $p = 0.14$)}.\n\n}\n\\begin{tabular}{lcccc}\n\\toprule\n0 -- 1900 & Family & Gender & Relationship & Other  \\\\                       \n\\midrule\nMen & 0.5 & 1.5 & 0 & 98 \\\\\nWomen & 5.0 & 7 & 3 & 85 \\\\\n\\midrule\n1900 -- Present & Family & Gender & Relationship & Other  \\\\                       \n\\midrule\nMen & 0.5 & 2.5 & 0 & 97 \\\\\nWomen & 3 & 4.5 & 2 & 90.5 \\\\\n\\bottomrule\n\\end{tabular}\n\\label{table:lexical_categories}\n\\end{table}\n\n\\begin{figure}[tp]\n\\centering\n \\begin{tabular}{c}\n        \\includegraphics[width=0.9\\linewidth]{img/epj_pmi_wordclouds.png}\n        \\end{tabular}\n        \\caption{\\textbf{Topical Bias:} Word clouds for articles about women (top) and men (bottom), separated by time: biographies with birth date before 1900 are on the left, and after (including) 1900, on the right. Font size is proportional to PMI with each gender. The color depicts the four categories (\\textit{gender} --orange--, \\textit{family} --green--, \\textit{relationship} --violet--, and \\textit{other} --blue--). One can see that beside professional and topical areas, words that fall into the category gender, relationship and family are more dominant in articles about women born before 1900. Gender-specific differences are much less pronounced in articles about people born in or after 1900.}\n\\label{fig:wordclouds}\n\\end{figure}\n\nFigure~\\ref{fig:wordclouds} shows the n-grams that are strongly associated with each gender (note that spaces in bi-grams are replaced with an underscore). \nOne can see the bi-grams that are strongly associated with women born before 1900 relate frequently to certain categories such as gender, family and relationships. Words associated with men mainly relate to other categories ({\\emph{e.\\,g.}}, politics and sports). \nTable \\ref{table:lexical_categories} shows the proportion of the top 200 n-grams that fall into each category, for both genders in both periods. \nOne can see that the categories \\textit{gender}, \\textit{relationship} and {family} are more prominent for women than men. \nHowever, the distributions of those categories is different in the two periods under consideration. Only in pre-1900 the distribution of categories is significantly different between genders according to a chi-square test ($\\chi^2 = 14.33$, $p < 0.01$). Note that in \\cite{graells2015first} we have shown that the differences are significant if time is not considered. Also, in previous work we have shown that this result is similar in five other language editions without including time restrictions~\\cite{wagner2015s}. \n\n}\n\n\n\\begin{table}[tb]\n\\scriptsize\n\\caption{\\textbf{Linguistic Bias:} Comparison of the ratios of abstract terms among positive and negative terms for men and women. Slightly more abstract terms\nare used for positive aspects in men's biographies, while slightly more abstract terms are used for\nnegative aspects in women's biographies. $^{***}: p < 0.001$, $^{**}: p < 0.01$}\n\\centering\n\\input{table_LIB_Ratios}\n\\label{table:lib-ratios}\n\\end{table}\n\n\\subsubsection{Linguistic Bias}\n\n\nTable \\ref{table:lib-ratios} shows the ratios of abstract terms among positive\nand negative terms when aggregating all the text in the summaries of the\nbiographies of men and women separately. One-tailed chi-square tests suggest\nthat linguistic biases appear on the predicted directions: more abstract terms\nfor positive aspects of men's biographies, and more abstract terms for\nnegative aspects of women's biographies. It must be noted that effect sizes,\ncomputed as Cohen's $w$, are very small, in line with the typically small\neffects of other studies in psycholinguistics.\nWhen measuring relative changes, we find that adjectives are almost 9\\% more likely to be used to\ndescribe positive aspects of men's biographies, while 1.62\\% more likely to\ndescribe negative aspects in women's biographies.\n\n\\begin{table}\n\\scriptsize\n\\caption{\\textbf{Linguistic Bias}: Regression results for the ratio of abstract words among positive and negative words as a function of gender,\nprofession, and birth century. Women's biographies tend to contain more abstract terms for negativity and less abstract terms for positivity. \n$^{***}: p < 0.001$, $^{**}: p < 0.01$, $^*: p < 0.05$}\n\\begin{center}\n\\input{table_lib_regression}\n\\label{table:lib-regression}\n\\end{center}\n\\end{table}\n\nWe apply linear regression in two models, one with $r_{+}$ as dependent\nvariable and another one with $r_{-}$, expressed as a linear combination of\ngender (woman $=1$), class, and century of birth. We focus on all biographies\nwith valid birth dates and at least 250 words in their summary. \nOur results indicate that women's biographies tend to\nhave less abstract terms for positive aspects and more abstract terms for\nnegative aspects, as predicted by the LIB (see Table \\ref{table:lib-regression}). This effect is robust to the\ninclusion of control variables like profession and century of birth. In\naddition, we repeated the analysis using a logit transformation of $r_{-}$ and\n$r_{+}$, as well as with beta regression, finding the same results.\n\n\n\\subsection{Structural Inequalities}\nThe structural information in Wikipedia serves many purposes, from providing input data to search engines, to feeding knowledge databases. Thus, inequalities in structure have an influence that goes beyond Wikipedia, regardless of being a reflection of society or history, or being inherent to Wikipedia contributors.\n\n\\begin{table}[tb]\n \\scriptsize\n \\caption{\\textbf{Meta-data Asymmetries: } Proportion of men and women who have the specified attributes in their infoboxes. Proportions were tested with a chi-square test, with effect size estimated using Cohen's $w$.  \n $^{***}: p < 0.001$, $^{**}: p < 0.01$, $^*: p < 0.05$}\n\\centering\n \\input{table_dbpedia_metadata_all_short}\n\\label{table:biography-meta-data}\n\\end{table}\n\n\\subsubsection{Meta-data}\nIn total, the DBpedia dataset contains 340 attributes extracted from infobox templates. Of those attributes, 33 display statistically significant differences. Only 14 of them are present in at least 1\\% of the male or female biographies.\n{ These attributes are shown in Table \\ref{table:biography-meta-data}.\nLikewise the previous sections, we have estimated the significance of their differences for people born before 1900 and those born in 1900 and onwards. An analysis of the entire dataset without considering time is presented in our previous work \\cite{graells2015first}.}\n\nDue to the number of available attributes, the portion of biographies that contains each of them is small. Thus, instead of considering p-value correction, we discuss the statistically significant gender differences manifested in meta-data, to qualitatively assess whether they have significance in our context:\n\n\n\\begin{itemize}\n\\item Attributes \\textit{activeYearsEndDate}, \\textit{activeYearsStartYear}, \\textit{careerStation}, \\textit{numberOfMatches}, \\textit{position}, \\textit{team}, and \\textit{years} are more frequently used to describe men.\nAll these attributes are related to sports, and thus, these differences can be explained by the prominence of men in sports-related DBpedia classes ({\\emph{e.\\,g.}}, \\textit{Athlete}, \\textit{SportsManager} and \\textit{Coach} \\cite{graells2015first}).\nNote that differences in \\textit{activeYearsStartYear} are significant at the entire dataset level only, and differences in \\textit{activeYearsEndDate} are significant before the 20th century only. The other attributes are mostly significantly different in recent times.\n\n\\item Attributes \\textit{deathDate}, \\textit{deathYear} are more frequently used within men born before 1900. One potential explanation is that the life of women was less well documented  than the life of men in the past and therefore it is more likely that the death date or birth date is unknown for women.\n\n\\item Attribute \\textit{birthName} is more frequently used for women in recent times. \nIts value refer mostly to the original name of artists, and women have considerable presence in this class \\cite{graells2015first}. \nAlso, even though it depends on the cultural context, a possible explanation is that, in some cultures, married women change their surnames to those of their husbands.\n\n\\item Attributes \\textit{occupation} and \\textit{title} are more frequently used to describe women in recent times, and seem to serve the same purpose but through different mechanisms. On one hand, \\textit{title} is a text description of a person's occupation (the most common values found are \\textit{Actor} and \\textit{Actress}). On the other hand, \\textit{occupation} is a DBpedia resource URI ({\\emph{e.\\,g.}}, \\url{http://dbpedia.org/resource/Actress}). \nThese attributes are present in the infoboxes of art-related biographies. Conversely, the infoboxes of sport-related biographies do not contain these attributes because their templates are different and contain other attributes (like the aforementioned \\textit{careerStation} and \\textit{position}). Thus, athletes (which are mostly men) do not contain such attributes.\n\n\\item { The \\textit{homepage} attribute is more frequently used for women in recent times. Our manual inspection showed that biographies from the Artist class tend to have home pages which explains why the attribute is used more frequently for women.}\n\n\\item The \\textit{spouse} attribute is more frequently used for women in recent times. \nThis attribute indicates whether the portrayed person was married or not, and with whom. \nIn some cases, it contains the resource URI of the spouse, while in other cases, it contains the name ({\\emph{i.\\,e.}}, when the spouse does not have a Wikipedia article), or the resource URI of the article of \\textit{``divorced status.''}\nThis difference is consistent with our results about topical gender difference, where relationship related terms show a stronger association with women than with men.\n\\end{itemize}\n\nNote that all differences found have large effect sizes (Cohen's $w > 0.5$).  \n\n\n\n\\subsubsection{Network Structure}\nWe constructed the empirical network from the inter-article links between 893,380 biographical articles in the English Wikipedia.\n{ After removing 192,674 singleton nodes (of which 15.34\\% were female), the resulting graph has 700,706 nodes (of which 15.6\\% is female) and 4,153,978 edges.}\nAll baseline graphs have the same number of nodes $n = $ 700,706 and approximately the same mean degree $k \\approx 4$ as the empirical network.\nThe small world baseline has a parameter $\\beta = 0.34$ representing the probability of rewiring each edge. Its value was set using the Brent root finding method in such a way as to recover the clustering coefficient of the original network.\n\n\\begin{figure}[tp]\n\\centering\n\\includegraphics[width=\\linewidth]{img/pagerank_difference.png}\n\\caption{\\textbf{Top-30 biographies sorted by Page Rank}. One can see that women are slightly less central than men and also centrality of women decreases faster with decreasing rank than the centrality of men.}\n\\label{fig:gender_pagerank}\n\\end{figure}\n\nFigure \\ref{fig:gender_pagerank} shows the top-30 men and women according to their PageRank. \nOne can see that top-ranked women are slightly less central than men, and also centrality of women decreases faster with decreasing rank than the PageRank of men.\nThe top-ranked biographies are similar to those found in previous work~\\cite{aragon2012biographical,whosbigger}.\n\n\\begin{table}[tb]\n\\scriptsize\n\\caption{\\textbf{Hyperlink Network Asymmetries:} Comparison of the empirical network and the null models. \\textit{M} refers to men and \\textit{W} to women. Number of nodes in all networks are 109,529 (0 -- 1899) and 323,762 (1900 -- Present). One can see that in both empirical networks the articles about women link more to other women than we would expect from the null models.}\n\\centering\n\\input{table_network_results_short}\n\\label{table:biography-network-properties}\n\\end{table}\n\n{ Beside the full hyperlink network, we created 2 sub-networks: one only contains people born before 1900 and the other one only contains people born in 1900 or afterward.\n For each empirical network, we created several null models and compared the proportion of links within and across genders using a chi-square test.\nTable \\ref{table:biography-network-properties} indicates that in both\nempirical observed Wikipedia graph women link more to other women than we would expect by chance. }  \n\nA possible explanation for this asymmetry are the reported interests of female editors who frequently edit biographies about women in Wikipedia \\cite{wikisurvey}.\n\n\\begin{figure}[tp]\n\\centering\n\n\\includegraphics[width=\\linewidth]{img/network_results_splitted.png}\n\\caption{\n\n\\textbf{Women fraction in top $k$ biographies sorted by PageRank.} \n\nOne can see that the relative fraction of women in the top $k$ biographies in the three baseline networks converges faster to the expected fraction than in the empirical observed network (OBS) where nodes are ranked by Page Rank and Indegree. This indicates, that the empirical observed topology of the hyperlink network puts women (especially women born in 1900 or afterward) in an disadvantage when it comes to ranking algorithms. \n}\n\\label{fig:ccdf-pagerank}\n\\end{figure}\n\n\nThe PageRank decay can be analyzed in terms of how women are present in the sorted top scores. Figure \\ref{fig:ccdf-pagerank} displays the relative fraction of women (x-axis) of all subsets of top-$n$ (y-axis) biographies sorted by PageRank and In-degree.\n\nOne can see that the relative fraction of women in the top $k$ biographies are below the expected fraction of around 15\\% which is the overall proportion of women biographies in the English Wikipedia.\nThe relative fraction of women in the top $k$ biographies in the three baseline networks converges faster to the expected fraction than in the empirical observed network (OBS) where nodes are ranked by Page Rank and Indegree. \nThis indicates, that the empirical observed topology of the hyperlink network puts women in an disadvantage when it comes to ranking algorithms. \nThe disadvantage is especially visible for women born in 1900 or afterward.\nHowever, in both networks ({\\emph{i.\\,e.}}, the one only connecting people born before 1900 and the one connecting people born in 1900 or afterward) we see that the fraction of women in the top 100 and top 1000 biographies is lower than expected. \nThis implies an asymmetry that cannot only be explained by heterogeneities in the structure of the network since our baseline graphs preserve certain characteristics of the empirical network ({\\emph{e.\\,g.}}, number of nodes, edges, degree distribution of nodes)\n\n\n\n\n\n\\section{Discussion}\nIn previous work we found that notable women and men (from three different reference lists) have equal probability of being represented in Wikipedia \\cite{wagner2015s}.\nThough this result is encouraging one needs to notice that also external reference lists may be biased. \nFor example, if women that show up in these reference lists are more notable than their male counterparts, then equality in coverage does not indicate the absence of a gender bias. \nHowever, assessing the notability of people is a difficult task. In this work we propose to use Wikipedia edits in different language editions and search engines like Google to approximate the public interest in a person at different times in different regions. Wikipedia view statistics could be used to extend our internal proxy measure of notability in the future.\n\n\nOur results of the comparison of the global notability of men and women that made it into Wikipedia reveal that women are slightly more notable than men, even if we control for confounding factors such as professions ({\\emph{e.\\,g.}}, Philosopher have a high global notability and most of them are men) and year of birth (note that historic people are more notable and until recently our history was dominated by men). \nFurther, the men-to-women ratio is still lower for low levels of notability than for high levels.\nThis indicates the existence of a subtle glass ceiling effect that makes it more difficult for women to be depicted in Wikipedia than for men.\n{At least three plausible explanations exist that describe why the glass ceiling effect may be present in Wikipedia:  (1) the narrow diversity of editors may foster the glass ceiling effect since it is well known that individuals generally favor people from their ingroup over people from their out-group \\cite{Brown1995,Tajfel1971}; (2) men are potentially more likely to create an article about themselves since previous research suggests that men are on average more self-absorbed than women \\cite{Grijalva2015}; (3) the external materials on which Wikipedia editors rely may introduce this bias, since the life of women or certain ethnic minorities may simply be less well documented and less visible on the Web.\nWe leave the question of identifying what causes this effect for future research.}\n\nOne way to mitigate the glass-ceiling effect is by relaxing notability guidelines for women, in order to include women who are locally notable, and for whom secondary sources might be hard to find.\nWe acknowledge that this is not easy, because relaxing notability guidelines can open the door for original research, which is not allowed in Wikipedia. \nHowever, a well-defined affirmative strategy would allow to grow the proportion of women in Wikipedia, make women easier to find, mitigate the glass-ceiling effect, as well as the several asymmetries found. \n\nThe topical and  linguistic asymmetries that we found highlight that editors need to pay attention to the ways women are portrayed in Wikipedia. \nCritics may rightly say that by relying on secondary sources, Wikipedia just reflects the biases found in them.\nHowever, editors are expected to write in their own words ``while substantially retaining the meaning of the source material''\\footnote{\\url{https://en.wikipedia.org/wiki/Wikipedia:No_original_research}} and thus, the differences found in terms of language are caused explicitly by them.\n\nFinally, even though the structural inequalities that we found suggest that though editors (especially those who edit articles about women) do a great job in interlinking articles about women, the visibility of women is still lower than expected when link-based ranking algorithms such as Page Rank are applied. Since the majority of biographies are about men and men tend to link more to men than to women (see Figure 6 in \\cite{eom2014} for preliminary comparison of ranking algorithms),\nwe argue that future research should focus on developing search and ranking algorithms that account for potential discrimination of minority groups due to homophily ({\\emph{i.\\,e.}}, the tendency of nodes to link to similar nodes).\n\nFurthermore, Wikipedia should provide tools to help editors, for instance, by considering already existing manuals of gender-neutral language \\cite{apa_manual}, or by indicating missing links between articles ({\\emph{e.\\,g.}}, if an article about a woman links to the article about her husband, the husband should also link back). \nInternal Wikipedia discussions that started after we published our preliminary studies on gender inequalities in the content of Wikipedia \\cite{wagner2015s,graells2015first} suggest such actions\\footnote{\\url{https://en.wikipedia.org/wiki/Wikipedia:Writing_about_women}}. However they are not yet internal policies.\n\n\n\n\n\n\n \n\\section{Related Work}\n\\textbf{Gender Inequalities in Traditional Media:} Feminists often claim that news is not simply mostly about men, but overwhelmingly seen through the eyes of men.\nIn \\cite{Ross2011} the authors analyze longitudinal data from the GMMP (Global Media Monitoring Project) which spans over 15 years. The authors conclude that the role of women as a producer and subject of news has seen a steady improvement, but the relative visibility of women compared to men has stuck at 1:3 which means that the world's new agencies still consider the life of men three time more worthy to write about as those of women.\nGender inequalities also manifest in films that are used for education purposes,\nas revealed by the application of the Bechdel test to teaching content\n\\cite{Scheiner-Fisher2012}. \n\n\n\\textbf{Gender Inequalities in Wikipedia:}\nOur work is not the first one which recognizes the importance of understanding gender biases in Wikipedia \\cite{reagle2011gender,eom2014,callahan2011cultural,aragon2012biographical,wagner2015s,graells2015first}.\n\n\nReagle and Lauren \\cite{reagle2011gender} compare the  coverage and article length of thousands of biographical subjects from six reference sources ({\\emph{e.\\,g.}}, The Atlantic's 100 most influential figures in American history, TIME Magazine's list of\n2008's most influential people) in the English-language Wikipedia and the online Encyclopedia Britannica. \nThe authors do not find gender-specific differences in the coverage and article length in Wikipedia, but Wikipediaâ\u0080\u0099s missing articles are disproportionately female relative to those of Britannica. \nWagner \\textit{et al.}~\\cite{wagner2015s} also analyzed the coverage of notable people in Wikipedia based on three external reference lists (Pantheon \\cite{Pantheon}, Freebase \\cite{Schich2014} and Human Accomplishment \\cite{Murray2003}) and find that no significant difference exist in the proportional coverage of men and women in six different language edition of Wikipedia.\n\n\n\nIn \\cite{bamman2014unsupervised} the authors present a method to learn biographical structures from text and observe that in the English Wikipedia biographies of women disproportionately focus on marriage and divorce compared to those of men, which is in line with our findings on the lexical dimension.\nSimilar results are found by Graells-Garrido \\textit{et al.}~\\cite{graells2015first} where the most important n-grams and LIWC categories of men and women are compared. \nIn \\cite{wagner2015s} the authors show that similar topical biases are present in six different language editions (German, English, French, Italian, Spanish and Russian).\n\n\nRecent research shows that most important historical figures across Wikipedia language\neditions are born in Western countries after the 17th century, and are male \\cite{eom2014}. On average only 5.2 female historic figures are observed among the top 100 persons.\nThe authors use different link-based ranking algorithms and focus on the top 100 figures in each language edition.\nTheir results clearly show that very few women are among the top 100 figures in all language editions, but since the authors do not use any external reference lists it remains unclear how many women we would expect to see among the top 100 figures.\n\nIn terms of network structure, we built a biography network \\cite{aragon2012biographical} in which we estimated PageRank, a measure of node centrality based on network connectivity~\\cite{brin1998anatomy,Fortunato08internetmath}. \nIn similar contexts, PageRank has been used to provide an approximation of historical importance \\cite{aragon2012biographical,whosbigger} and to study the bias leading to the gender gap~\\cite{whosbigger}.\n\n\nPrevious research has also explored gender inequalities in the editor community of Wikipedia and potential reasons for it (cf. \\cite{lam2011wp,Collier2012,hill2013wikipedia}).\nAlso among Wikipedians, the importance of this issue has been acknowledge for example through the initiation of the ``Countering Systemic Bias'' WikiProject\\footnote{\\url{http://en.wikipedia.org/wiki/Wikipedia:WikiProject_Countering_systemic_bias}} in 2004.\n\nThough previous work already suggests that gender bias manifests on a topical and structural level in Wikipedia, this work goes beyond previous work by (i) providing an in-depth analysis of the content and structure of the English Wikipedia, (ii) analyzing external and internal signals of global notability of men and women that are depicted in Wikipedia and (iii) exploring to what extent linguistic biases manifest in the content of Wikipedia.\n\n\n\n\n\n\n\n\n\\section{Conclusions}\nIn this work we studied various aspects of gender bias in the content of Wikipedia biographies. This is an important issue since the usage of Wikipedia is growing, and with that, its importance as a central knowledge repository that is used around the globe ({\\emph{e.\\,g.}}, for educational purposes).\n\nOur empirical results uncover significant gender differences on various levels that cannot only be attributed to the fact that Wikipedia is mirroring the off-line world and its biases.\nFor instance, the lexical and linguistic differences must be attributed to Wikipedia editors, since they are expected to use their own words.\nWe believe that the differences in the notability of men and women that are present in Wikipedia can in part be explained by how the life of men and women is documented in our society. For instance, Gillian Thomas points out that in history women were relegated to matters of ``social and purely feminine affairs'' and as subjects, women were often little more than addenda to male biographies ({\\emph{e.\\,g.}}, Marie Curie as the wife of Pierre Curie) \\cite{Thomas1992}.\nSince Wikipedia editors do rely on this biased information for informing their decisions ({\\emph{e.\\,g.}}, who is notable enough to be depicted in Wikipedia? What are the most important facts about this person?), it is not surprising that the content they produce reflects these pre-existing biases.\nHowever, it is also well known from social psychology that human-beings generally favor people of their ingroup over people of their out-group \\cite{Brown1995,Tajfel1971} and our results show that Wikipedia editors reveal a linguistic ingroup-outgroup bias \\cite{Maass1989}. \n\n{ To what extent this bias also impacts the selection (or article creation) process of notable people remains however unclear. Interestingly, we find that women that are depicted in Wikipedia tend to be more notable than men from a global perspective which can be seen as an indication of gender-specific entry barriers.}\n\nWe want to point out that our empirical results are limited to the English Wikipedia, which is biased towards western cultures \\cite{hecht2009measuring}.\nHowever, in previous work \\cite{wagner2015s} we found that similar structural, topical and coverage biases exist across six different language editions. \nWe leave a more detailed exploration of gender bias across all language editions for future work.\nOur methods can be applied in other contexts given an ad-hoc manual coding of associated keywords to each gender.\n\nIn summary, the contributions of this work are twofold: (i) we presented a computational method for assessing gender bias in Wikipedia \\emph{along multiple dimensions} and (ii) we applied this method to the English Wikipedia and shared empirical insights on observed gender inequalities. \nThe methods presented in this work can be used to assess, monitor and evaluate these issues in Wikipedia on an ongoing basis. \nWe translate our findings into some potential actions for the Wikipedia editor community to reduce gender biases in the future. We hope our work contributes to increasing awareness about gender biases on-line, and in particular to raising attention to the different levels in which these biases can manifest themselves.\nWe propose that Wikipedia may wish to consider revising its guidelines, both to account for the non-find-ability of women and to encourage a less biased use of language. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section*{Competing interests}\nThe authors declare that they have no competing interests.\n\n\\section*{Author's contributions}\nAll three authors contributed to the research design and writing of the paper.\nClaudia Wagner was mainly responsible for the internal and external notability study and the topical analysis.\nEduardo Graells-Garrido was mainly responsible for the network analysis and topical analysis. \nDavid Garcia was taking care of the linguistic bias exploration. \n\n\\section*{Acknowledgments}\nWe want to thank Mounia Lalmas, Markus Strohmaier and Filippo Menczer for their valuable input to this research.\n\n\n\\printbibliography\n\n\n", "itemtype": "equation", "pos": 19962, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract} \n\nContributing to the writing of history has never been as easy as it is today thanks to Wikipedia, a community-created encyclopedia that aims to document the world's knowledge from a neutral point of view.\nThough everyone can participate it is well known that the editor community has a narrow diversity, with a majority of white male editors.\nWhile this participatory \\emph{gender gap} has been studied extensively in the literature, this work sets out to \\emph{assess potential gender inequalities in Wikipedia articles} along different dimensions: notability, topical focus, linguistic bias, structural properties and meta-data presentation. \n\nWe find that \n(i) women in Wikipedia are more notable than men which we interpret as the outcome of a subtle glass ceiling effect;\n(ii) family-, gender- and relationship-related topics are more present in biographies about women; (iii) linguistic biases manifest in Wikipedia since abstract terms tend to be used to describe positive aspects in the biographies of men and negative aspects in the biographies of women; \nand (iv) there are structural differences in terms of meta-data and hyperlinks, which have consequences for information-seeking activities.\nWhile some differences are expected, due to historical and social contexts, other differences are attributable to Wikipedia editors. The implications of such differences are discussed, specially having Wikipedia contribution policies in mind.\nWe hope that our work contributes to increase awareness about, first, gender issues in the content of Wikipedia, and second, the different levels on which gender biases can manifest on the Web.  \n\n{\\smallskip\\noindent{\\bf {Keywords}.}}\nWikipedia;\nGender Inequality;\nHistorical Relevance;\nLexical Bias;\nLinguistic Bias;\nNetwork Structure.\n\n\\end{abstract}\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\nWikipedia aims to provide a platform to freely share the sum of all human knowledge. It represents an influential source of information on the Web, containing encyclopedic information about notable people from different countries, epochs and disciplines.\n\nIt is also a community-created effort driven by a self-selected set of editors.  \nIn theory, by following its guidelines about verifiability, notability, and neutral point of view, Wikipedia should be an unbiased source of knowledge. In practice, the community of Wikipedians is not diverse, but predominately white and male \\cite{lam2011wp,Collier2012,hill2013wikipedia}, and women are not being treated as equals in the community \\cite{lam2011wp}. \nIn our previous work we showed that gender asymmetries exist in Wikipedia's content \\cite{wagner2015s,graells2015first}. This work extends our previous work and provides an in-depth analysis of who makes it into Wikipedia and how these people are presented. \n\n\\textbf{Objectives:} \nThis work sets out to \\emph{assess potential gender inequalities in Wikipedia articles} along different dimensions. Concretely, we aim to address the following research questions:\n(i) Are men and women who are depicted in Wikipedia equally notable - {\\emph{i.\\,e.}}, do Wikipedians use the same thresholds for women and men when deciding who should be depicted on Wikipedia? \n(ii) Are any topical aspects overrepresented in articles about men or women?\n(iii) Does linguistic bias manifest in Wikipedia? \n(iv) Do articles about men and women have similar structural properties ({\\emph{e.\\,g.}}, similar meta-data, and network properties in the hyperlink network)? \n\n\\textbf{Approach:} \nWe understand gender inequality as the \\emph{systematic asymmetry} \\cite{beukeboom2014mechanisms} in the way that one gender is treated and presented over the other one.\nTo assess the extent to which Wikipedia suffers from potential gender bias, we compare biographies about men and women in Wikipedia on the following dimensions: external and internal global notability, topical and linguistic presentation, structural position, and meta-data presentation.\n\n\\textbf{Contributions \\& Findings:} \nOur results show that:\n\\begin{itemize}\n\\item Women inside Wikipedia are on average slightly more notable from an internal and external perspective than their male counterparts. Particularly, the gap between the number of men and women is larger for ``local heroes'' (people who are only depicted in few language editions) than for ``superstars'' (people who are depicted in almost all language editions). This can be seen as evidence for a subtle \\emph{glass ceiling effect} assuming that Wikipedia's entry barriers may function as a glass ceiling. Notice that if we sample from above the glass ceiling we expect to see fewer women than men, larger gender gaps for ``local heroes'' than for ``superstars'' and higher average notability of women.   \n\\item There are differences in the topical focus of biographical content, where gender-, family- and relationship-related topics are more dominant in the stand-alone overviews of biographies about women in the English Wikipedia.\n\\item Linguistic bias becomes evident when looking at the abstractness and positivity of language. Abstract terms tend to be used to describe positive aspects in biographies of men, and negative aspects in biographies of women. \n\\item There are structural differences in terms of meta-data and hyperlinks which have consequences for information-seeking activities.\n\\end{itemize}\nThe contributions of this work are twofold: (i) we present a computational method for assessing gender bias in Wikipedia \\emph{along multiple dimensions} and (ii) we apply this method to the English Wikipedia and share empirical insights on the observed gender inequalities. \nThe methods presented in this work can be used to assess, monitor and evaluate these issues in Wikipedia on an ongoing basis. \nWe translate our findings into some potential actions for the Wikipedia editor community to reduce the gender bias in the future. \n \n\n\n\n\\section{Methods \\& Materials}\n\\subsection{Dataset}\n\\label{sec:dataset}\n\nTo study gender bias in Wikipedia, we consider the following data sources:\n\n\\begin{enumerate}\n \\item The DBpedia 2014 dataset \\cite{dbpediaswj}.\\footnote{\\url{http://oldwiki.dbpedia.org/Downloads2014}}\n \\item Inferred gender for Wikipedia biographies by \\cite{bamman2014unsupervised}.\\footnote{\\url{http://www.ark.cs.cmu.edu/bio/}}\n\\end{enumerate}\n\nDBpedia \\cite{dbpediaswj} is a structured version of Wikipedia that provides: meta-data for articles, normalized article \\emph{Uniform Resource Identifiers} (URIs) that allow to interlink articles about the same entity in different language editions, normalized links between articles (taking care of redirections), and a categorization of articles into a shallow ontology, which includes a \\emph{Person} category.\nThis information is available for 125 Wikipedia editions. \n\nTo obtain gender meta-data for biographies in the English Wikipedia edition we match article URIs with the dataset by Bamman and Smith \\cite{bamman2014unsupervised} which contains inferred gender for biographies based on the number of grammatically gendered words ({\\emph{e.\\,g.}}, \\emph{he}, \\emph{she}, \\emph{him}, \\emph{her}, etc.). \nNote that only \\textit{male} and \\textit{female} gender are considered in this dataset. \nThe gender meta-data in other language editions are obtained from Wikidata by exploiting the links between DBpedia and Wikidata.\nWikidata reports more genders ({\\emph{e.\\,g.}}, \\textit{transgender male} and \\textit{transgender female}) as \\cite{bamman2014unsupervised}. However, those genders have a very small presence, and thus we only focus on \\textit{male} and \\textit{female}.\n\n\\begin{table}[tb]\n\\centering\n\\scriptsize\n\\caption{\\textbf{The largest 20 language editions of Wikipedia}: The number of biographies, proportion of biographies about women and the biography overlap with the English edition are depicted. One can see that the fraction of women on average around 17\\% and the average overlap with English is 97\\%.}\n\\input{table_dataset}\n\\label{table:dataset}\n\\end{table}\n\nTable \\ref{table:dataset} shows the biography statistics of the 20 largest Wikipedia editions in terms of entities available with meta-data in DBpedia.\nThe English edition contains the largest number of biographies with gender information (893,380), while the Basque edition (eu) contains the lowest number of biographies (3,449).\nIn terms of representation of women, 15.5\\% of biographies in the English edition are about women. The smallest fraction of women can be found in the German edition (13.2\\%), while the maximum fraction is found in the Korean edition (22.6\\%).\nSince the English language edition has the largest number of articles covering personalities from multiple editions and all language editions share in average 97\\% of people with the English language editions, we focus in our study on the English edition.\n\n{ We split this dataset in Pre-1900 and Post-1900. The Pre-1900 sample contains all people born before 1900, while the Post-1900 sample consists of people born in 1900 or after.}\n\n\\subsection{Approach}\n\\label{sec:approach}\nTo assess the extent to which gender bias manifests in Wikipedia, we compare Wikipedia articles about men and women on the following dimensions: \n\n\\begin{enumerate}\n \\item Global notability of people according to external and internal proxy measures.\n \\item Topical focus and linguistic bias of biography articles.\n \\item Structural properties of articles, including meta-data and network-theoretic position of people in Wikipedia's article link network.\n\\end{enumerate}\n\n\n\\subsubsection{Global Notability}\nFirst, we aim to explore how difficult it is for men and women to make it into Wikipedia. \nDo Wikipedians use the same notability threshold for men and women when deciding who should be depicted in Wikipedia? Or does the so called \\emph{glass-ceiling effect} make it more difficult for women to be recognized for their achievements? \nRecall that the glass-ceiling effect refers to the situation in which women cannot reach higher positions because an ``invisible barrier'' ({\\emph{i.\\,e.}}, gender bias) prevents them from doing so. \nWe hypothesize that if the entry point of Wikipedia functions as a glass-ceiling, women inside Wikipedia will be more notable than their male counterparts, and the men-to-women ratio will be lower for low levels of notability than for high levels of notability, because less female ``local heroes'' will be able to overcome the glass ceiling. That means, within the group of ``local heroes'' ({\\emph{i.\\,e.}}, people that are not famous in the whole world and show low or medium levels of notability) we expect to see a lower relative amount of women than in the group of ``superstars'' ({\\emph{i.\\,e.}}, people who are famous in the whole world), if we sample from above the glass-ceiling.\nTo address the question if such as glass-ceiling effect exists in Wikipedia we study the population of men and women who are depicted in Wikipedia and analyze their global notability from an \\emph{internal and external perspective}. \n\n{ \n\nAssessing the notability of people is a difficult task. However, Wikipedia and search engines like Google allow approximating the interest in different people over time from different locations. We want to point out that the proxy measures which we use for assessing the notability of people may also be biased since they reflect what Google users or Wikipedia editors are interested in and that is influenced by many factors. \nHowever, while the two signals which we explore are noisy, they are both clearly related to the public interest and therefore allow comparing the public interest in men and women.\nWhile our analysis allows quantifying the existence of a glass-ceiling, it does not allow assessing its origin. It could be that Wikipedians unconsciously apply different thresholds for men and women or that Wikipedia only reflects the glass ceiling of our society and other media which only document the life of women who have higher capacities and abilities than men in similar positions.\n\n\n}\nConcretely, we use the following external and internal proxy measures:\n\n\\smallskip\n\\textbf{Number of Language Editions:} The number of language editions that have created an article about a person is used as internal proxy measure for the global notability of a person. The idea is that people who only show up in few language editions are less relevant from a global perspective than those who show up in more language editions. \nThe DBpedia dataset provides a mapping for articles between different language editions which enables to count in how many editions a biography appears. \nIn particular, we consider the biographies that appear at least in one of the top-20 languages of DBpedia, and count how often they show up in all other language editions. \n\nTo explore whether the number of editions is influenced by gender, we fit a \\textit{Negative Binomial} regression model. The number of editions in which a person is depicted is used as dependent variable, while gender is used as independent variable. We include the profession of a person (obtained through the DBpedia ontology classes) as well as the decade in which the person was born (obtained from the DBpedia date of birth meta-data) as control variables.\nWe use the Negative Binomial (NB) model since we are considering over-dispersed count data.\n\n\\smallskip\n\\textbf{Google Search Volume:} The Google trend\\footnote{\\url{https://www.google.com/trends/}} data measure the interest of Google users between 2004 and 2015. Google trend data serve as external proxy for how much public interest in and information need about a person exists in different countries and at different points in time.\n\n\nFor a random sample of around 5000 people born after 1900 and before 2000 we collected Google trend data using the full name of the person as input.\nThis will of course introduce random noise since several people may share the same name. However, a similar level of noise can be expected for men and women.\nWe count the number of countries and the number of months between January 2004 and October 2015 (from a world-wide perspective) that reveal a relative search volume (which is defined as ($100/max(x_i) * x_i/T_i$) where $x_i$ is the total search volume for region $x$ at time $i$ and $T_i$ is the total search volume at time $i$) above a threshold.\nThe threshold is relative to the total searches of the region and time range it represents, to avoid that regions with the most search volume would always exceed the threshold and rank highest.\nTo explore whether the number of countries and number of months for which we observe search volume above the threshold is influenced by gender, we fit two linear regression models that both use gender as independent variable.\nWe also used a negative binomial regression model and obtained similar results but a loss of power.\n\n\n\\subsubsection{Topical and Linguistic Bias}\nAfter the investigation of potential differences in entry-barriers, we focus on the lexical presentation of those who made it into Wikipedia. \nIt is well known that language use is reportedly different when speaking about different genders \\cite{lakoff1972language}.\nFor example, the \\emph{Finkbeiner test} \\cite{finkbeinertest} suggests that articles about women often emphasize the fact that she is a woman, mention her husband and his job, her kids and childcare arrangements, how she nurtures her underlings, how she was taken aback by the competitiveness in her field, and how she is such a role model for other women.\nThe historian Gillian Thomas, who investigated the role of women in Britannica, states in her book \\cite{Thomas1992} that \nas contributors, women were relegated to matters of ``social and purely feminine affairs'' and as subjects, women were often little more than\naddenda to male biographies ({\\emph{e.\\,g.}}, Marie Curie as the wife of Pierre Curie).\n\nBeside topical bias, previous research also suggests that linguistic biases may manifest when people describe other people that are part of their in- or out-group~\\cite{Otterbacher2015}.\nLinguistic bias are systematic asymmetries in language patterns as a function of the social group of the persons described, and are often subtle and therefore unnoticed.\nThe Linguistic Intergroup Bias (LIB) theory \\cite{Maass1989} suggests that for members of our in-group, we tend to describe positive actions and attributes using more abstract language, and their\nundesirable behaviors and attributes more concretely ({\\emph{i.\\,e.}}, we generalize their success but not their failures). \n{ Note that verbs are usually used to make more concrete statements ({\\emph{e.\\,g.}}, he failed in this play), while adjectives are often used in abstract statement ({\\emph{e.\\,g.}}, he is a bad actor).}\n\nConversely, when an out-group individual does or is something desirable, we tend to describe him or her with more concrete language ({\\emph{i.\\,e.}}, we do not generalize their success), whereas his or her undesirable attributes are encoded more abstractly ({\\emph{i.\\,e.}}, we generalize them).\nMaass~\\textit{et al.} point out that LIB may serve as a device that signals to others both our status\nwith respect to an in- or out-group, as well as our expectations for their behavior and attributes \\cite{Maass1989}.\n{ Our expectations are of course not only determined by our group-membership but also by the society in which we live. For example, in some situations or domains not only men but also women may expect other women to be inferior to men. }\n\nWhile it is well known that topical and linguistic biases exist, it is unknown to what extent these biases manifest in Wikipedia.\nTo answer these question we compare the overview of biographies about men and women in the English Wikipedia. The overview of an article (also known as lead section) is the first section of an article. According to Wikipedia, it ``should stand on its own as a concise overview of the article's topic. It should define the topic, establish context, explain why the topic is notable, and summarize the most important points.''\\footnote{\\url{https://en.wikipedia.org/wiki/Wikipedia:Manual_of_Style/Lead_section}} \nWe focus on the lead section for two reasons. On one hand, the first part of the article is potentially read by most people who look at the article. On the other hand, Wikipedia editors need to focus on what they consider most important about the person, and biases may drive this selection process.\n\n\\smallskip\n\\textbf{Topical Bias:}\nTo unveil topical biases that manifest in Wikipedia content, we analyze the following three topics that could be over-represented in articles about women according to what Gillian Thomas observed in the Britannica and what the Finkbeiner test suggests:\n\\begin{itemize}\n\\item The \\emph{gender} topic contains words that emphasize that someone is a man or woman ({\\emph{i.\\,e.}}, man, women, mrs, mrs, lady, gentleman) as well as sexual identity ({\\emph{e.\\,g.}}, gay, lesbian).\n\\item The \\emph{relationship} topic consists of words about romantic relationships ({\\emph{e.\\,g.}}, married, divorced, couple, husband, wife).\n\\item The \\emph{family} topic aggregates words about family relations ({\\emph{e.\\,g.}}, kids, children, mother, grandmother).\n\\end{itemize}\n\nTo associate words with these topics (plus an unrelated category, \\textit{other}), we follow an open vocabulary approach \\cite{schwartz2013personality}. \nBecause we want to include concepts that may be comprised of more than one word, we consider n-grams with $n$ up to two.\nWe do so by associating the top-200 n-grams of each gender with one of the four topics (gender, relationship, family or other). \nTo rank the n-grams for men and women we use \\textit{Pointwise Mutual Information} \\cite{church1990word}. PMI measures the relationship between the joint appearance of two outcomes (X and Y) and their independent appearances. It is defined as:\n", "index": 1, "text": "\n\\[\n\\mbox{PMI}(X, Y) = \\log \\frac{P(X, Y)}{P(X) P(Y)}\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\mbox{PMI}(X,Y)=\\log\\frac{P(X,Y)}{P(X)P(Y)}\" display=\"block\"><mrow><mrow><mtext>PMI</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo>,</mo><mi>Y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>log</mi><mo>⁡</mo><mfrac><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo>,</mo><mi>Y</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>Y</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}]