[{"file": "1601.07105.tex", "nexttext": "\nwhere $B$ is the magnetic field intensity and $d_{loop}$ is the distance between the footpoints\non the photosphere and thus the diameter of the semicircumference.\nThe diameter of the magnetic flux tube, $2 B_r$, is set to the \nspatial resolution of the simulation, i.e. $50$ km.\n\n\\subsection{Exploring the Magnetic Emergence Rate Parameter}\n\nWe mainly focus our analysis on the exploration of the magnetic emergence rate parameter.\nNew measures of the emerging magnetic couples have shown that the previous\nvalues known in the literature were underestimated at least by\nan order of magnitude \\cite{gonzalez2009, gonzalez2012}.\nAs we continue increasing spatial resolution and magnetic sensitivity, \nthe small magnetic field contribution becomes very important \nin the emergence process of magnetic flux tubes.\nWe have investigated the relation between the simulated flare events \nand the emergence process, trying to estimate the energy released for \nthe observed emergence rate and understand if it is sufficient to \nexplain the coronal heating.\n\nSix simulations are computed, with the same dynamical advection parameters,\nand increasing magnetic emergence rate, from $7.8 \\cdot 10^{11} \\; \\mathrm{Mx} \\; \\mathrm{s}^{-1} \\; \\mathrm{Mm}^{-2}$\nto $2.6 \\cdot 10^{13} \\; \\mathrm{Mx} \\; \\mathrm{s}^{-1} \\; \\mathrm{Mm}^{-2}$, doubling the magnetic emergence rate\nfrom one simulation run to the other. The aim is to find out the\nrelation between magnetic emergence rate and the probability distribution of the energy released by the \nsynthetic nanoflares.\n\nThe domain is a square matrix with a $256$ pixels side. The total intensity of the downflows\nis set to $1000$.\nThe spatial scale is set by the $\\sigma = 10$ parameter,\nthus having $20 \\; \\mathrm{pixels} = 1 \\; \\mathrm{Mm}$. The temporal scale is set by the parameter \n$\\tau = 10$ (simulation time unit), interpreted as the typical coherence time of a granule ($10$ minutes).\nThe six runs have a goal to simulate $600$ minutes.\n\n\\section{Results}\n\nWe obtain from each simulation a synthetic nanoflare time sequence and\nperform a statistical analysis on the released magnetic energy\nprobability distribution function (PDF).\nPDFs are well described by a power law and the fit is obtained using the\nmethod described in \\cite{powerlaw}. \\\\\nAs it is clear from Fig. \\ref{fig3} the index reaches a stable value for a sufficiently high emergence\nrate of the order of $\\sim 0.7 \\; \\mathrm{Mx} \\; \\mathrm{s}^{-1} \\;\\mathrm{Mm}^{-2}$.\\\\\nAs evident from Fig. \\ref{fig3}, the simulation runs relative to the lowest magnetic emergence rate\nhave larger error bars for their power law index.\nThis is an effect of the poorer statistics of flare events in these three runs, due to the lower\nemergence rate, which gives noisier PDFs.\nIndeed, the probability to have a reconnection event is a function of the density of the loops,\nwhich is not set by any conservation rules, but reaches a steady value non-trivially\ndetermined by the magnetic emergence rate parameter.\nAlthough the power law index values show an increasing trend as a function of the magnetic emergence rate,\ntaking into account the associated error bars, we can state that all six simulation runs have a\npower law index compatible with $\\alpha_E \\simeq 2.4$ (see Fig. \\ref{fig3}).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure*}[t]\n\\begin{center}\n\\includegraphics[scale=.4]{f5.eps}\n\\end{center}\n\\caption{Left: Power law index of the energy probability distribution for synthetic nanoflares\nas a function of the magnetic flux emergence rate.\nRight: example of the power law fit for the nanoflare energy PDF in the case of\nthe highest magnetic emergence rate.\\label{fig3}}\n\\end{figure*}\n\nWe use the synthetic nanoflare statistics\nto understand if it is compatible with a plausible mechanism to \nheat the solar corona. We find that the computed power law index \nis compatible with the theoretical formulation by Parker,\nwhich requires $\\alpha > 2$,\nfor a  nanoflare energy distribution able to sustain a stable hot corona \n\\cite{parker1988,vekstein2000,aschwanden2000}.\n\nThe computed power law index $\\alpha \\simeq 2.4$ is also compatible\nwith the index obtained from observations.\nSolar flares show a similar behavior with a power law\nindex reported $1.5 < \\alpha < 2.6$ \\cite{charbonneau2001} and evaluated\nin a reduced range $2.1 < \\alpha < 2.6$ using geometrical assumptions\n\\cite{mcintosh2001}. Thus our model has $\\alpha$ in\nthe range reported by the observers, although our energy range \nis between $2 \\cdot 10^{20} \\; \\mathrm{erg} \\; \\div \\; 3 \\cdot 10^{24} \\; \\mathrm{erg}$,\nwhile the observed energy range is extended at most to the\nmicroflare range (see for example the reported power law index\n$2.3 < \\alpha < 2.6$\nfor the flare in the range\n$ 10^{25} \\; erg \\; \\div \\; 3 \\cdot 10^{26} \\; erg$ from UV observations\n\\cite{krucker1998}).\n\n\\section{Summary}\n\nThe simulation performed in our study combines a model able to mimic the\ncorrect spatial and temporal scales of granulation and mesogranulation \nwith a simplified description of the reconnection events between\nmagnetic coronal loops.\\\\ \nThe model is able to reproduce the observed dynamical properties of\nsmall scale magnetic elements and produce a synthetic nanoflare time sequence\nover $600$ minutes, on a computational domain equivalent to a square\nwith a $12.8$ Mm side of the solar phostosphere.\\\\\nWe have explored the magnetic emergence rate parameter of the simulation,\nintroducing a new observational constraint.\nThe nanoflare PDF is well fitted by a power law with an index compatible with\n$\\alpha \\simeq 2.4$, which is in agreement with flare observations and compatible with\nthe requirement stated by Parker ($\\alpha > 2$) for a nanoflare heated solar corona.\n\n\\vspace{10 mm}\n\n\\begin{thebibliography}{}\n\n \\bibitem{demoortel2015} De Moortel I \\& Browning P 2015 {\\itshape Philosophical Transactions A} {\\bfseries 373} 40269 \n \\bibitem{peter2015} Peter H 2015 {\\itshape Philosophical Transactions A} {\\bfseries 373} 50055 \n \\bibitem{hughes2003} Hughes D Paczuski M Dendy R~O Helander P \\& McClements K~G 2003 {\\itshape Physical Review Letters} {\\bfseries 90} 131101 \n \\bibitem{charbonneau2001} Charbonneau P McIntosh S~W Liu H-L \\& Bogdan T~J 2001 {\\itshape Solar Physics} {\\bfseries 203} 321 \n \\bibitem{rast1998} Rast M~P 1998 {\\itshape Journal of Fluid Mechanics} {\\bfseries 369} 125 \n \\bibitem{rast2003} Rast M~P 2003 {\\itshape The Astrophysical Journal} {\\bfseries 597} 1200\n \\bibitem{bart2006} Viticchi{\\'e} B Del Moro D \\& Berrilli F 2006 {\\itshape The Astrophysical Journal} {\\bfseries 652} 1734 \n \\bibitem{delmoro2004} Del Moro D 2004 {\\itshape Astronomy \\& Astrophysics} {\\bfseries 428} 1007 \n \\bibitem{berrilli2004} Berrilli F Del Moro D Consolini G {\\itshape et al} 2004 {\\itshape Solar Physics} {\\bfseries 221} 33 \n \\bibitem{berrilli2005} Berrilli F Del Moro D Russo S Consolini G \\& Straus T 2005 {\\itshape The Astrophysical Journal} {\\bfseries 632} 677 \n \\bibitem{giannattasio2013} Giannattasio F Del Moro D Berrilli F {\\itshape et al} 2013 {\\itshape The Astrophysical Journal Letters} {\\bfseries 770} LL36\n \\bibitem{gonzalez2009} Mart{\\'{\\i}}nez Gonz{\\'a}lez M~J \\& Bellot Rubio L~R 2009 {\\itshape The Astrophysical Journal} {\\bfseries700} 1391 \n \\bibitem{gonzalez2012} Mart{\\'{\\i}}nez Gonz{\\'a}lez M~J {\\itshape et al} 2012 {\\itshape The Astrophysical Journal} {\\bfseries755} 175 \n \\bibitem{powerlaw} Alstott J Bullmore E \\& Plenz D 2014 {\\itshape PLoS ONE} {\\bfseries 9} 85777 \n \\bibitem{parker1988} Parker E~N 1988 {\\itshape The Astrophysical Journal} {\\bfseries 330} 474 \n \\bibitem{vekstein2000} Vekstein G \\& Katsukawa Y 2000 {\\itshape The Astrophysical Journal} {\\bfseries 541} 1096\n \\bibitem{aschwanden2000} Aschwanden M~J Tarbell T~D Nightingale R~W {\\itshape et al} 2000 {\\itshape The Astrophysical Journal} {\\bfseries 535} 1047 \n \\bibitem{mcintosh2001} McIntosh S~W \\& Charbonneau P 2001 {\\itshape The Astrophysical Journal Letters} {\\bfseries 563} L165 \n \\bibitem{krucker1998} Krucker S \\& Benz A~O 1998 {\\itshape The Astrophysical Journal Letters} {\\bfseries 501} L213 \n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 14365, "prevtext": "\n\n\\title{N-body model of magnetic flux tubes reconnecting in the solar atmosphere}\n\n\\author{L Giovannelli$^1$, F Berrilli$^1$, D Del Moro$^1$, S Scardigli$^1$, G Consolini$^2$,\nM Stangalini$^3$, F Giannattasio$^2$, A Caroli$^1$, F Pucci$^1$, V Penza$^1$}\n\\address{$^1$Universit\\`a di Roma ``Tor Vergata'', Via della Ricerca Scientifica, I-00133 Roma, Italy}\n\\address{$^2$INAF - IAPS, Via del Fosso del Cavaliere 100, I-00133 Roma, Italy}\n\\address{$^3$INAF - OAR, Via Frascati 33, I-00040 Monte Porzio Catone (RM), Italy}\n\n\\begin{abstract}\nThe investigation of dynamics of the small scale magnetic field on the Sun photosphere is necessary to understand the physical processes occurring in the higher layers of solar atmosphere due to the magnetic coupling between the photosphere and the corona.\nWe present a simulation able to address these phenomena investigating the statistics of magnetic loops reconnections.\nThe simulation is based on N-body model approach and is divided in two computational layers. \nWe simplify the convection problem, interpreting the larger convective scale, mesogranulation, as the result of the collective interaction of convective downflow of granular scale.\nThe N-body advection model is the base to generate a synthetic time series of nanoflares produced by interacting magnetic loops.\nThe reconnection of magnetic field lines is the result of the advection of the magnetic footpoints following the velocity field generated by the interacting downflows. \nThe model gives a quantitative idea of how much energy is expected to be released by the reconfiguration of magnetic loops in the quiet Sun.\n\\end{abstract}\n\n\\section{Introduction}\n\nOne of the main goals in solar physics remains the detailed explanation of\nhow the plasma in the higher layers of the Sun has a stable temperature of\nthe order of $10^6$ K. Although several possible non-thermal mechanisms\nhave been proved to be able to transport energy from the photosphere,\na detailed explanation of the conversion from magnetic energy to thermal and particle energy\nis still in need of an answer. Besides, a quantitatively and statistically strong observative evidence \nof these mechanisms is still lacking \\cite{demoortel2015}. \nMagnetic reconnection events are considered to be one of the main energy source for the heating of\nthe outer layers of the solar atmosphere (chromosphere and corona).\nAlthough both the numerical implementation of the magnetohydrodynamics (MHD) theory and the computational power have evolved\nrapidly in the last years \\cite{peter2015},\nit remains prohibitive to compute full MHD 3D simulations\non large temporal and spatial scales and within an environment containing multiple evolving magnetic flux tubes.\nIn order to simulate a computational box with the side of more than $10$ Mm on time scales of several hours,\nwe propose a simulation which starts from simplified numerical models able to\nmimic the behavior of the magnetic loops in the solar atmosphere\nwithout needing to solve time consuming MHD equations.\nAlthough not solving the proper physical equations of the system, this class of models can provide \na synthetic, but realistic, time series of magnetic energy release due to the reconfigurations of magnetic loops.\n\n\\subsection{Simplified Reconnection Model}\n\nIn a simplified reconnection model presented in 2006 \\cite{hughes2003},\nmultiple loops evolve in space and time in a 3D domain, hereafter Hughes Multiple Loops model (HML).\n\nMagnetic loops are represented by semicircumferences on a plane perpendicular to the photospheric plane, and their footpoints, of equal intensity magnetic field and opposite polarity, are anchored on the photosphere.\nThe footpoints move in a random walk,\nrepresenting the motion of magnetic field advected by the plasma flows.\nThe magnetic energy stored in the loop is proportional to its length and increases as the two footpoints\nincrease their distance.\nNew magnetic loops are injected in the system in order to simulate the magnetic emergence process.\nReconnection can occur in the HML model when either two loops collide in 3D space, or two footpoints\nannihilate. Reconnection is only allowed if it shortens the combined length of the two colliding loops,\nthus resulting in a release of energy. The model also takes into consideration cascade events in which\none reconnection triggers others.\n\nThe resulting probability distribution of energy released during reconnections events is well described by\na power law with a slope $\\alpha_E = 3.0\\pm 0.2$.\nThis value is slightly high compared to the slope obtained by observational data in the UV band of low energy flares\n$\\alpha_E = 1.5 \\div 2.6$ \\cite{charbonneau2001}.\nAnother difference compared to the flare observations is the absence of any temporal correlation in the waiting time\namong reconnection events, maybe due to the random nature of the motion of magnetic footpoints.\n\nIn order to improve this point and account for the correct spatial and temporal correlations of the\nprocess underneath the magnetic footpoints motion we implemented a model similar to the HML.\nThe new model had to include a simplified advection model able to provide a more realistic motion\nof the footpoints.   \n\n\n\\subsection{N-body Advection Model}\n\nA fluidodynamical simulation \\cite{rast1998} has proved that\nthe profile of the vertical and horizontal velocity fields originated by a downflow is well\napproximated by an exponential law. The N-body Advection (NA) model \\cite{rast2003} starts from this\nresult, representing a downflow as a point generating an attractive\nvelocity field profile: $ v = V e^{-\\frac{d}{\\sigma}} $\nat a distance $d$.\nEvery downflow is a sink in the plasma and is the source of an attractive velocity\nfield directed to the downflow, attracting all the other downflows. All downflows\nare advectively transported according to the horizontal velocity field generated\nby all the others downflows.\n\nNew downflows are added in random positions on the domain;\nthe intensity of the downflow at $d=0$, $V$,\nis assigned from a normal distribution where $\\sigma = 1$ and \n$\\mu =1$, values are normalized to $1$ km/s.\nThe domain of the simulation is square with periodic boundary conditions (toroidal geometry).\nThe $V$ parameter has an exponential decay over time, characterized by a constant\ndecay $\\tau$, which is related to the coherence time of granules.\nIf the intensity at zero distance $V$ goes below the value of $0.0001$ km/s, then the downflow is removed, \nrepresenting an evanescent downflow.\nThe spatial scale of the simulation is obtained interpreting $2 \\sigma$, the\ntypical influence scale of a downflow, as the granular scale.\nThe NA model then performs a check on the distance between the downflows, if it finds $d_{ij}<1$ the \ntwo downflows are merged. The new value for the $V$ parameter is the sum of the old ones: \n$V_k = V_i + V_j$.\nMass conservation is imposed forcing the conservation of the total flow $F = \\sum_i V_i$\nat every time step, adding downflows randomly distributed on the domain.\nThe space-time scales are set for the smaller granular-scales and they spontaneously\nself-organize in the mesogranular scale,\nconstituted by more stable and intense downflows. The size of the mesogranular\nscale is set by the proper values in the $\\sigma-F$ parameter space \\cite{bart2006}.\nOnce the right spatial scale for menogranulation is set,\nthe NA model reproduce the observed temporal\nscale for the mesogranular convective structures \\cite{delmoro2004,berrilli2004,berrilli2005}.\nThus it is possible to use a solar NA model to impose the correct spatial and temporal behavior\nto the magnetic footpoints of an HML-like model. \n\n\n\\section{PASTA Model}\n\n\n\n\nA model combining the NA and HML models together was proposed \\cite{bart2006},\nintroducing two main changes with respect to the HML model:\n\n\\begin{itemize}\n \\item the advective velocity field generated by the collective interaction of\nthe downflows is used to move the passive magnetic footpoints with the correct space and time scales.\n \\item the periodic boundary conditions of the NA model were extended to the HML model in order\nto be able to produce loops with typical scales larger than the computational box.\n\\end{itemize}\nThe model is able to reproduce the power law distribution for the flare released energy\nover three decades ($10^{23} \\div 10^{26}$ erg) with an index $\\alpha_E = 2.4 \\pm 0.1$,\nto be consistent with the observations.\nFurthermore a waiting time distribution is found, which is also in agreement with the observations,\nfollowing an exponential law with $\\alpha =4.3\\pm0.3$.\n\nTo further implement the model and calibrate the energetic output of the synthetic nanoflares,\nother observational parameters have to be included in the simulation. \n\\begin{figure*}[t]\n\\begin{center}\n\\includegraphics[scale=.60]{f1.eps}\n\\end{center}\n\\caption{3D representation of the PASTA simulation with an emergence\nrate of $6.5~\\cdot~10^{12} \\;\\mathrm{Mx} \\;\\mathrm{s}^{-1} \\; \\mathrm{Mm}^{-2}$. Yellow to red \ncircles: downflows of increasing intensity. Grey circles: magnetic \nfootpoints of positive (darker) and negative (lighter) polarity.\nIn both cases the circle radius is related to the intensity of the \ndownflow or the magnetic field. \nBlue semicircumferences: magnetic loops.\\label{fig1}}\n\\end{figure*}\nWe hereby present a new model, the Photospheric Advection Simulation at Tor vergata university ph.d. school of Astronomy\n(PASTA), which derives directly from \\cite{bart2006}.\nWe have rewritten completely the code in python, optimizing the mathematical routines\nand adding three main features:\n\n\\begin{itemize}\n \\item We have considered a distribution of intensity of the magnetic field. Within a magnetic loop\nthe two footpoints have the same strength and opposite polarity,\nbut the field intensity can vary from one loop to the other.\nThe intensity of the magnetic field is extracted from\nthe measured distribution of an exceptional 25 hours long dataset\nof the HINODE SOT instrument \\cite{giannattasio2013}.  \n \\item Since the intensity of the magnetic field in two interacting loops is not the same,\nwe have introduced a new set of rules in case of interaction, described later in detail.\n \\item The energy of the magnetic loop depends now on the length of the loop and on the intensity of the magnetic field.\n\\end{itemize}\n\n\\subsection{PASTA code description}\n\nIn our model, multiple loops evolve in space and time in a\n3D domain as in \\cite{hughes2003}.\nThe spatial resolution is set to $1$ pixel $= 50$ km.\nThe footpoints move accordingly to the velocity field generated\nby the N-body model as in \\cite{rast2003}, representing the motion of\nmagnetic field passively advected by the plasma.\n\nNew loops are added at a fixed rate.\nWhen a new loop is added, the position of the \nfirst footpoint is random, the second footpoint of the same loop is put at distance \n$d_B$ in direction $\\phi_B$. $d_B$ is extracted from a truncated normal distribution. \nThe two linked footpoints have the same intensity for the magnetic field, but opposite polarity.\nMagnetic footpoints are passively advected by the downflows, following the same \nspatial exponential law, and so behaving like corks.\n\nIn Fig. \\ref{fig1} we show one step of the simulation\nwith the 3D loops connecting the magnetic footpoints and the underneath velocity field. \n\nWe check for interaction events between footpoints, ruled by the interaction\ndistance set to the spatial resolution of the simulation, $1$ pixel, i.e. $50 km$:\n\n\\begin{itemize}\n \\item CANCELLATION. If two footpoints of the same loop have a distance \nless than $3$ pixels, or a magnetic flux less than $10$ G the loop is canceled.\n\n \\item AGGREGATION. If two footpoints of equal polarity have a distance less \nthan $1$  pixel, the two footpoints are moved together in the same position, an average \nof the former ones. The footpoints are not merged, they remain distinct \nin order to prevent an arbitrary rule in case of reconnection from \na footpoint with different loops departing from it. In this way we have the \npossibility to simulate a multiple loop footpoint avoiding ambiguity. \n\nThe footpoints share the same position evolving together.\n\n \\item ANNIHILATION. If two footpoints of different polarities of two different \nloops have a distance less than $10$ pixels, i.e. the granulation convective scale,\nthere is an annihilation event. \nThese two footpoints are canceled\nand a new loop is defined between the remaining other ones. \nWe call loop A the loop with the more intense magnetic field and loop \nB the other. Loop A will interact with loop B as having a magnetic field with the \nsame intensity of loop B. Loop A is schematized as made up of two loops, loop A', \nwith the same intensity of loop B, and loop A'', with the remaining magnetic flux. \nIn case of annihilation or reconnection events, only the A' and B loop interact, \nwhile the A'' loop remains untouched. At the end in case of an annihilation we will \na have a C new loop and the A'' loop.\n\n \\item RECONNECTION. If two loops, represented on the photosphere plane as segments, \nhave an intersection on the periodic domain, named the X point, we measure the \ndistance between the two points in the two loops corresponding to the X point. \nIf this distance is less than $1$ pixel we perform a reconnection event, where we create two \nnew loops connecting the positive footpoint of the first old loop with the negative \nfootpoint of the second old loop and vice versa. The reconnection is performed \nonly if the initial energy is greater than the final one; \nthis guarantees a positive release of magnetic energy. \nThis latter event is recorded as a synthetic nanoflare.\n\\end{itemize}\n\nMultiple events at fixed time are \nallowed if a reconfigured loop has the possibility to reconnect with another loop \nafter a first reconnection. In this way a flare resulting from a cascade event\nof simultaneous reconnections is recorded. The possibility of one loop to cut other loops \nwhile reconfiguring, and in this way reconnecting with them, is not taken into \nconsideration for simplicity.\nWe do not impose the conservation of the number of loops in the system, although the \ndatasets show a steady number of loops during the simulation.\\\\\nThe energy of a loop is defined integrating the energy density $B^2/8\\pi$\nover the volume of the magnetic loop:\n\n\n", "index": 1, "text": "\\begin{equation}\n E \\mathrm{[erg]} = \\frac{\\pi}{16} \\; d_{loop}\\;(B \\cdot B_r )^2\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"E\\mathrm{[erg]}=\\frac{\\pi}{16}\\;d_{loop}\\;(B\\cdot B_{r})^{2}\" display=\"block\"><mrow><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mi>erg</mi><mo stretchy=\"false\">]</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+2.8pt\"><mfrac><mi>π</mi><mn>16</mn></mfrac></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><msub><mi>d</mi><mrow><mi>l</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mpadded><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>B</mi><mo>⋅</mo><msub><mi>B</mi><mi>r</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></math>", "type": "latex"}]