[{"file": "1601.04761.tex", "nexttext": "\n\n\\noindent where $ \\tilde{ \\beta }$ is the noise pixel parameter defined in Section 2.2.2 of the IRAC handbook and is proportional to the width of the PSF, and $a_0$ and $a_1$ are scale and shift factors \\citep{mig05, cha08, knu12, tod13, oro14, nik15}. We test a range of $a_0$ values between 0.6 to 1.2 in increments of 0.05 while setting $a_1 = 0$, and a range of $a_1$ values from -0.8 to 0.4 pixels in increments of 0.1 while setting $a_0 = 1$. For each aperture, we remove outliers with a running median filter of 50 points and a threshold distance of 3 times the standard deviation of the fifty points, and repeat the filtering until no further points are removed. This resulted in the removal of 0.40\\% and 0.39\\% of the unbinned data for the chosen apertures at 3.6 and 4.5~$\\mu$m, respectively. We also trim the first hour of data for the 3.6 micron observations, as it shows a ramp in sensitivity. The duration and strength of this ramp varies from observation to observation, but is typically strongest in the 3.6~$\\mu$m bandpass \\citep[e.g.][]{knu12, lew13, zel15, kam15}. We see no evidence for a corresponding ramp in our 4.5~$\\mu$m photometry, and therefore do not trim any data in this channel.\n\nFor each aperture we determine the best-fit instrumental and transit model by fitting to the binned time series, where we determine the optimal bin size using the same approach as our aperture optimization. We then use these model coefficients to calculate the corresponding best-fit model for the unbinned light curve. We find that binning the data prior to our fit results in a slight increase in the RMS of the unbinned residuals, while at the same time reducing the time-correlated or red noise component on longer time scales. Since the latter noise dominates our uncertainties for the transit parameters, solutions that minimize red noise are on the whole preferable (see Deming et al. 2015 and Kammer et al. 2015 for a more in-depth discussion of this approach). With this approach we choose a time-variable aperture with a scale factor of 0.7 in the 3.6~$\\mu$m channel, and a fixed aperture with a radius of 2.2 pixels in the 4.5~$\\mu$m channel. The chosen apertures show negligible red noise (Fig.~\\ref{rootN}).\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.3]{beta_ch1_ch2.pdf}\n\\caption{RMS vs. bin size for the two \\textit{Spitzer} IRAC channels. The minimal deviation from $N^{-0.5}$ shows that our final photometry for both bandpasses has a negligible amount of red noise.\\label{rootN}}\n\\end{center}\n\\end{figure}\n\n\\subsection{Ground-Based Photometry}\n\nWe acquired a total of 377 nightly photometric observations of WASP-39 during \nthe four observing seasons 2011-12 through 2014-15 to monitor for stellar \nactivity. The observations were obtained with the Tennessee State University \nCelestron 14-inch (C14) automated imaging telescope (AIT) at Fairborn \nObservatory \\citep[see, e.g.,][]{h1999,ehf2003}. The AIT detector is an SBIG \nSTL-1001E CCD camera, and the observations were made in the Cousins R \npassband. Differential magnitudes were computed against the mean brightness \nof five constant comparison stars in the same field. More details of our data \nacquisition, reduction procedures, and analysis techniques can be found in \n\\citet{sing15}, which describes a similar analysis of the planetary-host \nstar WASP-31.\n\nOur photometric observations are plotted in Figure~\\ref{activity}. We removed a scatter of \n$\\sim$0.001~mag in the seasonal means by normalizing the four seasons to \nhave the same mean. The normalized data set shown in the top panel scatters \nabout the mean with a standard deviation of 0.00496~mag, which is close to \nthe C14 measurement precision. A frequency spectrum over the range of 0.01 \nto 0.99 cycles/day, corresponding to a period range of 1 to 100 days, is \nshown in the bottom panel of the figure. No periodic brightness variations \nresulting from rotational modulation in the visibility of active regions and \nstarspots can be seen above the noise level in the frequency spectrum. In \nparticular, there is no brightness variability at the planetary orbital \nfrequency, marked by an arrow in the frequency spectrum and corresponding to \nthe orbital period of 4.055259 days determined by \\citet{fae11}. A \nleast-squares sine fit on the orbital period gives a semi-amplitude of only \n$0.00050\\pm0.00033$ mag. The lack of rotational modulation is consistent with \nWASP-39 being an old, late G-type dwarf. The lack of any brightness \nvariability on the radial velocity period gives further confirmation that\nthe radial velocity variations are due to a planetary companion.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.38]{stellar_activity.pdf}\n\\caption{$Top$: Four years of normalized Cousins R-band photometry of WASP-39 from the C14 automated imaging telescope at Fairborn Observatory. The observations scatter about their mean magnitude with a standard deviation of 0.00496 mag, approximately equal to C14's measurement error for a single observation. The vertical dotted lines correspond to the times of HST and Spitzer transit observations. $Bottom$: Frequency spectrum of the R-band photometry covering a period-search range of 1 to 100 days. No rotational modulation of starspots can be seen above the noise, consistent with WASP-39 being an old, late G-type dwarf. The orbital frequency is marked by an arrow and shows the absence of brightness variability on the orbital period. A least-squares sine fit gives a semi-amplitude of only $0.00050\\pm0.00033$ mag.\\label{activity}}\n\\end{center}\n\\end{figure}\n\n\\section{Analysis}\n\nWe calculate transit light curves using the BATMAN package of \\citet{kre15}. We calculate the wavelength-dependent four-parameter nonlinear limb-darkening coefficients for each bandpass using an ATLAS stellar model with an effective temperature of 5500~K and log(g) of 4.5, which is the closest match to the WASP-39 stellar parameters reported by \\citet{fae11}. The orbital period is obtained from \\citet{fae11} and is also held fixed. The shape of the transit light curve then depends on four physical parameters that are fitted simultaneously for each observation: $T_c$ (transit center time), $i$ (inclination), $a/R_*$, and $R_p/R_*$, where $a$ is the semi-major orbital distance, $R_p$ is the radius of the planet, and $R_*$ is the radius of the star. Photometric time series are modeled by instrument systematics and transit light curves as described in the following sub-sections.\n\n\\subsection{White-Light Curves}\n\nFor the STIS observations, we first construct a white-light curve by summing the spectra across all wavelengths. We then use these white-light curves to fit for wavelength-independent parameters (e.g. $T_c$, $i$, and $a/R_*$). As in previous studies \\citep[e.g.][]{hui13, v-m13, sing13, nik14, nik15, sing15}, we find that the STIS sensitivity variations are adequately described by a linear function in time across all \\textit{HST} orbits (two parameters), and a fourth-order polynomial in time phased to each \\textit{HST} orbit (four parameters), totaling six instrumental systematic parameters per STIS observation. We test a range from 2nd order to 6th order polynomials for the orbital-phased systematics, and found that fourth order optimized the BIC. Consistent with previous work, we see possible evidence for differing systematics in the first \\textit{HST} orbit of each observation, which is thought to be caused by thermal relaxation after a new pointing \\citep{v-m13}. We therefore exclude the first orbit of each observation in our analysis. For the \\textit{Spitzer} IRAC light curves we utilize the pixel-level decorrelation technique \\citep{dem15} with a grid of nine pixels centered on the position of the star. This results in a total of 10 free parameters for each \\textit{Spitzer} light curve, including nine pixel weighting coefficients and a constant term.\n\nAs a result of gaps in time coverage due to \\textit{HST}'s low-earth orbit, we find that the STIS observations alone do not provide strong constraints on the planet's orbital inclination and $a/R_*$. Fortunately, our \\textit{Spitzer} observations span the entire transit with no gaps and are obtained at longer wavelengths where the effects of stellar limb-darkening are minimal. We therefore perform a simultaneous fit with STIS white light curves and Spitzer 3.6 and 4.5~$\\mu$m light curves, in which inclination and $a/R_*$ are common for all observations, but $T_c$, $R_p/R_*$, and instrumental noise parameters are unique for each transit observation, resulting in a total of 50 free parameters to model 290 photometric points in the global fit. The instrumental parameters are fit simultaneously with the transit parameters. We report a common $R_p/R_*$ value for the two STIS G430L observations, which is valid assuming negligible contributions from stellar variability, consistent with the results of the stellar activity monitoring described earlier. \n\nWe determine the best-fit model parameters in the global fit using an MCMC analysis, implemented using the EMCEE python routine from \\citet{dfm13}. The reported results are the means of the MCMC posterior distributions and are shown in Table~\\ref{results}. Uncertainties are determined by marginalizing over the MCMC chain to find the posterior probability distribution for each parameter and using this to calculate the corresponding 68\\% confidence interval. Photometric uncertainties are set to the calculated RMS of the residuals in the best-fit solution for each individual transit observation.\n\n\\begin{figure*}\n\\includegraphics[scale=0.49]{stis_whitelight_raw_fits_res.pdf}\n\\caption{\\textit{HST} STIS raw (top) and corrected (middle) white-light curves, where we have divided out the best-fit instrumental noise model for each visit. Open circles in the top panel show the model points. The bottom panel shows the residuals after removing both the instrumental model and transit light curves. Error bars are the standard deviation of these residuals. Dashed lines show one standard deviation.\\label{stis}}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.5]{spitzer_whitelight_raw_fits_res.pdf}\n\\caption{\\textit{Spitzer} IRAC 3.6- and 4.5-$\\mu$m lightcurves for raw (top) and corrected (middle) white-light curves, where we have binned the data in time to three-minute intervals and divided out the best-fit instrumental noise model for each visit. Open circles in the top panel show the model points. The bottom panel shows the residuals after removing both the instrumental model and transit light curves. Error bars are the standard deviation of these residuals. Dashed lines show one standard deviation.\\label{spitzer}}\n\\end{center}\n\\end{figure*}\n\n\\subsection{Spectral Light Curves}\n\nThe transmission spectrum is obtained by grouping the STIS spectra into 35 bins with wavelength ranges shown in Table~\\ref{results}; each bin yields a unique spectral light curve (Fig.~\\ref{binned13}, \\ref{binned14}, \\ref{binned23}). We select the wavelength range of the spectral bins to optimally balance resolution and S/N, and to distinguish sodium and potassium features. We calculate four parameter nonlinear limb-darkening parameters unique to each bandpass. We fit the spectral light curves with the transit model with $R_p/R_*$ as a free parameter, but fix the wavelength-independent parameters $T_c$, inclination, and $a/R_*$ to the values obtained from the global white-light curve fit. We assume a common value for $R_p/R_*$ in each bandpass for the two observations with the G430L grism and fit both observations simultaneously. \n\nWe multipy the transit signal by an instrumental noise model, which we test as both a parametric model and common mode model as in previous work \\citep{sing13, nik14, nik15, sing15}. The parametric model is the same as for the white light curves described earlier, with a unique fit for each wavelength bin. In the common mode method, the instrumental noise model consists of the common mode residuals scaled by a normalization factor and a linear function in time. The common mode residuals are obtained by removing the transit signal and linear sensitivity function from the raw photometry. All orbits show similar systematics due to the breathing effect, and we therefore use the orbit-phased average for each individual orbit. Both instrumental noise models give very similar results for the transmission spectrum. However, the parametric model favors an unreasonably low value in the noisy shortest wavelength bin in the G430L grism. We therefore choose the common mode model for this grism, which favors a more reasonable value. Furthermore, the residuals in the G750L grism display a wavelength dependence such that the common mode residuals do not well describe the wavelength-dependent systematics. We therefore choose the four-parameter parametric model for this grism, with a unique solution for each wavelength bin. The results reported in Table~\\ref{results} are the means of the MCMC posterior distributions.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_13_raw_fits_res.pdf}\n\\caption{\\textit{HST} STIS G430L spectral light curves for the observations on UT 2013 Feb 8, raw (left) and corrected (middle) where we have divided out the best-fit instrumental noise model for each visit. Color corresponds to wavelength, with the shortest wavelengths plotted in purple and the longest wavelengths plotted in light green. Light curves are offset vertically by multiples of 0.01. Open circles in the left panel show the model points. The right panel shows the residuals after removing both the instrumental model and transit light curves. Dashed lines show one standard deviation. \\label{binned13}}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_14_raw_fits_res.pdf}\n\\caption{Same description as in Fig.~\\ref{binned13}, for observations on UT 2013 Feb 12.\\label{binned14}}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_23_raw_fits_res.pdf}\n\\caption{Same description as in Fig.~\\ref{binned13}, \\ref{binned14} for observations with the G750L grism on UT 2013 Mar 17.\\label{binned23}}\n\\end{center}\n\\end{figure*}\n\n\\begin{table*}\n\\begin{center}\n\\caption{Transit Parameters from Global Fit.\\label{param}}\n\\begin{tabular}{lllll}\n\\tableline\n\\tableline\n\\\\\nInstrument & Date & Wavelength ($\\textrm{\\AA}$) & Parameter & Value\\\\\n\\tableline\n\\\\\nSTIS G430L & 2013 Feb 8, 12 & 2896 - 5706 & Planet radius ($R_p / R_*$) & 0.14463 $\\pm$ 0.00069 \\\\\nSTIS G430L & 2013 Feb 8 & 2896 - 5706 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456332.45857^{+0.00033}_{-0.00034}$ \\\\\nSTIS G430L & 2013 Feb 12 & 2896 - 5706 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456336.51323 ^{+0.00017}_{-0.00031}$ \\\\\n\\\\\nSTIS G750L & 2013 Mar 17 & 5259 - 10251 & Planet radius ($R_p / R_*$) & 0.14452 $\\pm$ 0.00059 \\\\\nSTIS G750L & 2013 Mar 17 & 5259 - 10251 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456368.95549 ^{+0.00024}_{-0.00041}$ \\\\\n\\\\\nIRAC 3.6-$\\mu$m & 2013 Apr 18 & 31618 - 39284 & Planet radius ($R_p / R_*$) & 0.14513 $\\pm$ 0.00148 \\\\\nIRAC 3.6-$\\mu$m & 2013 Apr 18 & 31618 - 39284 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456401.39696 ^{+0.00056}_{-0.00053}$ \\\\\n\\\\\nIRAC 4.5-$\\mu$m & 2013 Oct 10 & 39735 - 50198 & Planet radius ($R_p / R_*$) & 0.14591 $\\pm$ 0.00096 \\\\\nIRAC 4.5-$\\mu$m & 2013 Oct 10 & 39735 - 50198 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456575.77450 ^{+0.00029}_{-0.00026}$ \\\\\n\\\\\nCombined & & & Semi-major axis ($a / R_*$) & 11.55 $\\pm$ 0.13 \\\\\nCombined & & & Orbital inclination ($^{\\circ}$) & 87.93 $\\pm$ 0.14 \\\\\n\\tableline\\tableline\n\\end{tabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table}\n\\begin{center}\n\\caption{STIS Transmission Spectrum Results.\\label{results}}\n\\begin{tabular}{cc}\n\\tableline\\tableline\n\\\\\nWavelength ($\\textrm{\\AA}$) & $R_p/R_*$\\\\\n\\tableline\n\\\\\n\\sidehead{STIS G430L}\n2900 - 3700 & 0.14429 $\\pm$ 0.00230\\\\\n3700 - 3950 & 0.14408 $\\pm$ 0.00143\\\\\n3950 - 4113 & 0.14467 $\\pm$ 0.00089\\\\\n4113 - 4250 & 0.14500 $\\pm$ 0.00088\\\\\n4250 - 4400 & 0.14653 $\\pm$ 0.00087\\\\\n4400 - 4500 & 0.14491 $\\pm$ 0.00093\\\\\n4500 - 4600 & 0.14396 $\\pm$ 0.00085\\\\\n4600 - 4700 & 0.14376 $\\pm$ 0.00073\\\\\n4700 - 4800 & 0.14447 $\\pm$ 0.00086\\\\\n4800 - 4900 & 0.14461 $\\pm$ 0.00076\\\\\n4900 - 5000 & 0.14381 $\\pm$ 0.00081\\\\\n5000 - 5100 & 0.14301 $\\pm$ 0.00081\\\\\n5100 - 5200 & 0.14361 $\\pm$ 0.00089\\\\\n5200 - 5300 & 0.14541 $\\pm$ 0.00077\\\\\n5300 - 5400 & 0.14330 $\\pm$ 0.00081\\\\\n5400 - 5500 & 0.14309 $\\pm$ 0.00122\\\\\n5500 - 5600 & 0.14437 $\\pm$ 0.00098\\\\\n5600 - 5700 & 0.14558 $\\pm$ 0.00083\\\\\n\\sidehead{STIS G750L}\n5500 - 5650 & 0.14381 $\\pm$ 0.00115\\\\\n5650 - 5880 & 0.14550 $\\pm$ 0.00126\\\\\n5880 - 5910 & 0.14890 $\\pm$ 0.00282\\\\\n5910 - 6060 & 0.14496 $\\pm$ 0.00109\\\\\n6060 - 6300 & 0.14531 $\\pm$ 0.00111\\\\\n6300 - 6450 & 0.14491 $\\pm$ 0.00091\\\\\n6450 - 6600 & 0.14520 $\\pm$ 0.00121\\\\\n6600 - 6800 & 0.14315 $\\pm$ 0.00091\\\\\n6800 - 7100 & 0.14301 $\\pm$ 0.00092\\\\\n7100 - 7650 & 0.14423 $\\pm$ 0.00057\\\\\n7650 - 7710 & 0.14532 $\\pm$ 0.00283\\\\\n7710 - 8100 & 0.14604 $\\pm$ 0.00109\\\\\n8100 - 8500 & 0.14451 $\\pm$ 0.00200\\\\\n8500 - 9000 & 0.14425 $\\pm$ 0.00122\\\\\n9000 - 10250 & 0.14179 $\\pm$ 0.00161\\\\\n\\tableline\n\\tableline\n\\\\\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\n\\subsection{White-Light Transit Parameters and Updated Orbital Ephemeris}\n\nFrom the global fit combining STIS and Spitzer observations, we find common values for inclination and semi-major axis of $i=87.93\\pm 0.14$ and $a/R_*=11.55\\pm 0.13$, in agreement with the values reported by \\citet{fae11} and \\citet{ric15}. The transit times calculated from our combined fit (Table~\\ref{param}) and the result from \\citet{fae11} and \\citet{ric15} are fit as a function of period $P$ and epoch $E$,\n\n\n", "itemtype": "equation", "pos": 12103, "prevtext": "\n\\bibliographystyle{plainnat}\n\n\\submitted{Submitted to The Astrophysical Journal}\n\n\\title{\n\\textit{HST} hot-Jupiter transmission spectral survey: \\\\Clear skies for cool Saturn WASP-39\\lowercase{b}\n}\n~\\\\\n\\author{\nPatrick D. Fischer\\altaffilmark{1}, \nHeather A. Knutson\\altaffilmark{1}, \nDavid K. Sing\\altaffilmark{2}, \nGregory W. Henry\\altaffilmark{3},\nMichael W. Williamson\\altaffilmark{3},\nJonathan J. Fortney\\altaffilmark{4}, \nAdam S. Burrows\\altaffilmark{5},\nTiffany Kataria\\altaffilmark{2},\nNikolay Nikolov\\altaffilmark{2},\nAdam P. Showman\\altaffilmark{6},\nGilda E. Ballester\\altaffilmark{6},\nJean-Michel D\\'esert\\altaffilmark{7}, \nSuzanne Aigrain\\altaffilmark{8},\nDrake Deming\\altaffilmark{9},\nAlain Lecavelier des Etangs\\altaffilmark{10},\nAlfred Vidal-Madjar\\altaffilmark{10}\n}\n\n\\affil{\\altaffilmark{1}Division of Geological and Planetary Sciences, California Institute of Technology, Pasadena, CA 91125, USA}\n\\affil{\\altaffilmark{2}Astrophysics Group, School of Physics, University of Exeter, Stocker Road, Exeter, EX4 4QL, UK}\n\\affil{\\altaffilmark{3}Center of Excellence in Information Systems, Tennessee State University, Nashville, TN 37209, USA}\n\\affil{\\altaffilmark{4}Department of Astronomy and Astrophysics, University of California Santa Cruz, CA 95064, USA}\n\\affil{\\altaffilmark{5}Department of Astrophysical Sciences, Peyton Hall, Princeton University, Princeton, NJ 08544, USA}\n\\affil{\\altaffilmark{6}Lunar and Planetary Laboratory, University of Arizona, Tucson, AZ 85721, USA}\n\\affil{\\altaffilmark{7}CASA, Department of Astrophysical and Planetary Sciences, University of Colorado, 389-UCB, Boulder, CO 80309, USA}\n\\affil{\\altaffilmark{8}Department of Physics, University of Oxford, Denys Wilkinson Building, Keble Road, Oxford OX1 3RH, UK}\n\\affil{\\altaffilmark{9}Department of Astronomy, University of Maryland, College Park, MD 20742, USA}\n\\affil{\\altaffilmark{10}CNRS, Institut dAstrophysique de Paris, UMR 7095, 98bis boulevard Arago, F-75014 Paris, France}\n\n\\begin{abstract}\n\nWe present \\textit{HST} STIS optical transmission spectroscopy of the cool (approximately 1116~K) Saturn-mass exoplanet WASP-39b from 0.29-1.025 $\\mu$m, along with complementary transit observations from \\textit{Spitzer} IRAC at 3.6 and 4.5 $\\mu$m. The low density and large atmospheric pressure scale height of WASP-39b make it particularly amenable to atmospheric characterization using this technique. We detect a Rayleigh scattering slope as well as sodium and potassium absorption features; this is the first exoplanet in which both alkali features are clearly detected with the extended wings predicted by cloud-free atmosphere models. The full transmission spectrum is well matched by a clear, H$_2$-dominated atmosphere or one containing a weak contribution from haze, in good agreement with the preliminary reduction of these data presented in \\citet{sing16}. WASP-39b is predicted to have a pressure-temperature profile comparable to that of HD~189733b and WASP-6b, making it one of the coolest transiting gas giants observed in our \\textit{HST} STIS survey. Despite this similarity, WASP-39b appears to be largely cloud-free while the transmission spectra of HD~189733b and WASP-6b both indicate the presence of high altitude clouds or hazes. These observations further emphasize the surprising diversity of cloudy and cloud-free gas giant planets in short-period orbits and the corresponding challenges associated with developing predictive cloud models for these atmospheres.\n\n\\end{abstract}\n\n\\keywords{planetary systems --- planets and satellites: atmospheres --- stars: individual (WASP-39) --- techniques: spectroscopic}\n\n\\section{Introduction}\n\nOver the past twenty years, ongoing radial velocity and transit surveys have detected more than 200 short-period gas giant planets transiting bright, nearby stars. This population of planets, which are often referred to as hot Jupiters, has provided an unprecedented opportunity to study the properties of hydrogen-dominated atmospheres at temperatures more akin to cool stars than solar system gas giants \\citep{sea10, hen15}. Despite more than a decade of study, many aspects of hot Jupiter atmospheres remain poorly understood, as demonstrated by the detection of clouds and hazes in a subset of these atmospheres. \n\nWe can determine the presence or absence of clouds in hot Jupiter atmospheres via several complementary techniques. Observations of the secondary eclipse, when the planet passes behind the star, can be used to constrain the planet's visible-light albedo and detect the signatures of reflective cloud layers in the upper atmosphere \\citep[e.g.][]{hen13, eva13, she14, ang14}. These observations indicate that there are two classes of hot Jupiters, consisting of planets with relatively low ($<$0.1) and somewhat higher (0.3-0.4) albedos in the optical Kepler bandpass. \n\nAlthough a high albedo can indicate the presence of clouds, some planets may have relatively tenuous and/or low-albedo cloud layers. By measuring the wavelength-dependent transit depth or transmission spectrum of these planets as they pass in front of their host stars, we can detect the presence of trace clouds and hazes located near the planet's day-night terminator. During the transit light from the star travels along a slant optical path through the upper part of the planet's atmosphere, where even relatively small amounts of haze or cloud particles can result in a significant scattering opacity \\citep[e.g.][]{for03, for05, pon08}. For cloud-free hot Jupiters, sodium and potassium are predicted to produce strong absorption at optical wavelengths, while water is the strongest absorber in the near-infrared \\citep[e.g.][]{sea00, hub01, sud03}. However in many of the systems observed, the predicted absorption features from Na, K, and water are either attenuated or entirely absent and the transmission spectrum displays a strong slope across the optical wavelengths \\citep[e.g.][]{lec08, pon08, sing11, hui12, pon13, dem13, line13, man13, knu14, mcc14, nik14, nik15, sing13, sing15, sing16}.\n\nIt has been suggested that the high-altitude clouds or hazes responsible for these attenuated absorption features may be produced via photochemistry at the top of the atmosphere \\citep{zah09} or by condensation within the atmosphere \\citep[e.g.][]{for05, lec08,mor13, wak15}. However, the mechanisms that drive cloud formation in hot Jupiter atmospheres are not fully understood, and may involve horizontal or vertical transport of materials from the planet's night side and deeper atmosphere in addition to the atmospheric metallicity, surface gravity, and local pressure and temperature. For photochemically produced hazes formation rates might additionally depend on the stellar spectral type and activity level, which controls the incident UV flux at the top of the atmosphere \\citep{zah09, knu10}. As discussed in \\citet{sing16}, the current set of transmission spectroscopy observations appear to be poorly matched by the predictions of simple forward models, suggesting that our knowledge of the factors that contribute to or suppress cloud formation in these atmospheres is incomplete.\n\nIn this study we present observations from an ongoing survey of optical transmission spectra of hot Jupiters obtained with the Space Telescope Imaging Spectrograph (STIS) instrument on the \\textit{Hubble Space Telescope} (\\textit{HST}). The goal of this survey is to build up a large sample of hot Jupiters with well-characterized transmission spectra in order to develop a better empirical understanding of the relevant factors that determine the presence or absence of clouds in these atmospheres \\citep{hui12, wak13, nik14, nik15, sing13, sing15,sing16}. Here we examine in detail the transmission spectrum of the hot Jupiter WASP-39b originally presented in \\citet{sing16}. WASP-39b \\citep{fae11} is relatively cool with an equilibrium temperature of 1116~K, and approximately Saturn-mass (0.28~{M$_\\textrm{\\scriptsize J}$}) with an inflated radius of 1.27~R$_\\textrm{\\scriptsize J}$, making it one of the lowest density gas giant planets currently known (0.14~$\\rho_\\textrm{\\scriptsize J}$), and thus particularly favorable for atmospheric characterization via transmission spectroscopy. It orbits at 0.049 AU around a relatively quiet G8 star with an effective temperature of 5400~K and [Fe/H]=-0.12$\\pm$0.10. Recent secondary eclipse observations may indicate a relatively high atmospheric metallicity corresponding to the relatively low mass for this system \\citep{kam15}. In the following sections we present STIS transit observations of this planet spanning wavelengths between 290-1025~nm as well as 3.6 and 4.5~$\\mu$m photometry obtained with the \\textit{Spitzer Space Telescope}, comprising a high signal-to-noise near-UV to infrared transmission spectrum. \n\n\\section{Observations}\n\n\\subsection{\\textit{HST} STIS}\n\nObservations of WASP-39b in transmission were obtained with \\textit{HST} Space Telescope Imaging Spectrograph (STIS) as part of \\textit{HST} program GO-12473 (P.I. Sing). Two transits of WASP-39b were observed in the G430L grating (290-570~nm) on UT 2013 Feb 8 and 12, and one transit with the G750L grating (550-1020~nm) on UT 2013 Mar 17. These observations span 11 orbital periods of WASP-39b, approximately 45 Earth days. Each observation consists of five \\textit{HST} orbits spanning 6.8~hours with 3~hours of integration time on target, which was sufficient to sample each 2.8~hour transit light curve and the baseline stellar flux before and after transit. Each observation consisted of 43 spectra with integration times of 277~s, of which 13 are in transit, four during ingress and nine near transit center.\n\nWe reduce these data using the same methods as described in previous papers from this program \\citep{hui13,sing13,nik14,nik15,sing15}. Raw images were bias-, dark-, and flat-corrected with the latest version of the CALSTIS pipeline. Bad pixels flagged by CALSTIS and cosmic rays were corrected with the same routines as in \\citet{nik14}. G750L spectra were fringe-corrected using a fringe flat frame obtained at the end of the observations. The wavelength solution was taken from the x1d files from CALSTIS. Spectra were extracted from the images using a fixed aperture in the cross-dispersion direction. We test a range of aperture widths between 1 and 30 pixels for each STIS observation and choose the one that minimizes the RMS of the residuals in the resulting white-light curves; this yielded optimal widths of 8, 10, and 9 pixels for the three observations respectively. Extracted spectra were used to calculate the white-light and spectral photometric time series. \n\n\\subsection{\\textit{Spitzer} IRAC}\n\nWASP-39b was observed in transit with Spitzer IRAC 3.6 and 4.5~$\\mu$m channels on UT 2013 Apr 18 and UT 2013 Oct 10 respectively as part of program 90092 (P.I. D\\'esert). These observations utilized the peak-up pointing mode, which places the star in the center of the targeted pixel, and included an initial 30 minute observation prior to the start of the science observation in order to allow for settling of the telescope at its new position. Science observations begin two hours before ingress and end 30 minutes after egress, capturing the entire transit and stellar baseline flux before and after transit. Each transit observation contains 8,960 subarray exposures with effective integration times of 1.92~s and total duration of 302~minutes. Data were reduced using the same methods described in \\citet{knu12}, \\citet{lew13}, and \\citet{kam15}, including extraction of BJD$_\\textrm{\\scriptsize UTC}$ mid-exposure times for each image, sky background subtraction, flux-weighted centroiding to determine the position of the star in each image, and flux extraction using either a fixed or time-varying circular aperture. Flux was converted from MJy Sr$^{-1}$ to electron counts using the integration time and information in the FITS header. \n\nIn each band, we test a fixed aperture of width 2.0 to 5.0 pixels in increments of 0.1 pixels, and time variable aperture with radius given by: \n\n\n", "index": 1, "text": "\\begin{equation}\nradius = a_0 \\times \\sqrt{ \\tilde{ \\beta } } + a_1\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"radius=a_{0}\\times\\sqrt{\\tilde{\\beta}}+a_{1}\" display=\"block\"><mrow><mrow><mi>r</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>s</mi></mrow><mo>=</mo><mrow><mrow><msub><mi>a</mi><mn>0</mn></msub><mo>×</mo><msqrt><mover accent=\"true\"><mi>β</mi><mo stretchy=\"false\">~</mo></mover></msqrt></mrow><mo>+</mo><msub><mi>a</mi><mn>1</mn></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04761.tex", "nexttext": "\n\n\\noindent where the initial transit epoch $T(0)$ is chosen to remain consistent with previous work (Fig.~\\ref{oc}). We convert all transit times to BJD$_\\textrm{\\scriptsize TDB}$ following \\citet{eas10}. We find an initial transit epoch $2455342.9696\\pm~0.00014$~BJD$_\\textrm{\\scriptsize TDB}$ and period $4.05528047\\pm~7.0\\times~10^{-7}$~days. \\citet{ric15} previously reported a period of $4.0552947\\pm~9.65\\times~10^{-7}$, which disagreed with the value found by \\citet{fae11} of $4.055259\\pm~8\\times~10^{-6}$ at the 4.4$\\sigma$ level. Our best-fit period is intermediate between these values. We differ from the value reported by \\citet{fae11} at the 2.7$\\sigma$ level, and from the value in \\citet{ric15} by 12$\\sigma$. Although transit timing variations might explain these discrepant results, we find no evidence for timing variations in the transits analyzed here, and the previous studies do not report individual transit times.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.4]{OminusC.pdf}\n\\caption{Observed - computed times of transit center for this work (open circles), \\citet{ric15}, and \\citet{fae11} (filled circles, nearly overlapping). Dotted lines show the 1$\\sigma$ uncertainty. All times have been converted to BJD$_\\textrm{\\scriptsize TDB}$ following \\citet{eas10}.\\label{oc}}\n\\end{center}\n\\end{figure}\n\n\\subsection{Transmission Spectrum Models}\n\nWe find that the transmission spectrum is well-matched by clear-atmosphere models including broad line absorption wings from both Na and K. Although weak contributions from hazes or clouds are also consistent, additional sources of opacity are not required to describe the observed transmission spectrum. \n\nFirst, we use the Rayleigh slope shortward of 520~nm to empirically measure the temperature of the planet's atmosphere at the day-night terminator. This slope is determined by:\n\n\n", "itemtype": "equation", "pos": 30040, "prevtext": "\n\n\\noindent where $ \\tilde{ \\beta }$ is the noise pixel parameter defined in Section 2.2.2 of the IRAC handbook and is proportional to the width of the PSF, and $a_0$ and $a_1$ are scale and shift factors \\citep{mig05, cha08, knu12, tod13, oro14, nik15}. We test a range of $a_0$ values between 0.6 to 1.2 in increments of 0.05 while setting $a_1 = 0$, and a range of $a_1$ values from -0.8 to 0.4 pixels in increments of 0.1 while setting $a_0 = 1$. For each aperture, we remove outliers with a running median filter of 50 points and a threshold distance of 3 times the standard deviation of the fifty points, and repeat the filtering until no further points are removed. This resulted in the removal of 0.40\\% and 0.39\\% of the unbinned data for the chosen apertures at 3.6 and 4.5~$\\mu$m, respectively. We also trim the first hour of data for the 3.6 micron observations, as it shows a ramp in sensitivity. The duration and strength of this ramp varies from observation to observation, but is typically strongest in the 3.6~$\\mu$m bandpass \\citep[e.g.][]{knu12, lew13, zel15, kam15}. We see no evidence for a corresponding ramp in our 4.5~$\\mu$m photometry, and therefore do not trim any data in this channel.\n\nFor each aperture we determine the best-fit instrumental and transit model by fitting to the binned time series, where we determine the optimal bin size using the same approach as our aperture optimization. We then use these model coefficients to calculate the corresponding best-fit model for the unbinned light curve. We find that binning the data prior to our fit results in a slight increase in the RMS of the unbinned residuals, while at the same time reducing the time-correlated or red noise component on longer time scales. Since the latter noise dominates our uncertainties for the transit parameters, solutions that minimize red noise are on the whole preferable (see Deming et al. 2015 and Kammer et al. 2015 for a more in-depth discussion of this approach). With this approach we choose a time-variable aperture with a scale factor of 0.7 in the 3.6~$\\mu$m channel, and a fixed aperture with a radius of 2.2 pixels in the 4.5~$\\mu$m channel. The chosen apertures show negligible red noise (Fig.~\\ref{rootN}).\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.3]{beta_ch1_ch2.pdf}\n\\caption{RMS vs. bin size for the two \\textit{Spitzer} IRAC channels. The minimal deviation from $N^{-0.5}$ shows that our final photometry for both bandpasses has a negligible amount of red noise.\\label{rootN}}\n\\end{center}\n\\end{figure}\n\n\\subsection{Ground-Based Photometry}\n\nWe acquired a total of 377 nightly photometric observations of WASP-39 during \nthe four observing seasons 2011-12 through 2014-15 to monitor for stellar \nactivity. The observations were obtained with the Tennessee State University \nCelestron 14-inch (C14) automated imaging telescope (AIT) at Fairborn \nObservatory \\citep[see, e.g.,][]{h1999,ehf2003}. The AIT detector is an SBIG \nSTL-1001E CCD camera, and the observations were made in the Cousins R \npassband. Differential magnitudes were computed against the mean brightness \nof five constant comparison stars in the same field. More details of our data \nacquisition, reduction procedures, and analysis techniques can be found in \n\\citet{sing15}, which describes a similar analysis of the planetary-host \nstar WASP-31.\n\nOur photometric observations are plotted in Figure~\\ref{activity}. We removed a scatter of \n$\\sim$0.001~mag in the seasonal means by normalizing the four seasons to \nhave the same mean. The normalized data set shown in the top panel scatters \nabout the mean with a standard deviation of 0.00496~mag, which is close to \nthe C14 measurement precision. A frequency spectrum over the range of 0.01 \nto 0.99 cycles/day, corresponding to a period range of 1 to 100 days, is \nshown in the bottom panel of the figure. No periodic brightness variations \nresulting from rotational modulation in the visibility of active regions and \nstarspots can be seen above the noise level in the frequency spectrum. In \nparticular, there is no brightness variability at the planetary orbital \nfrequency, marked by an arrow in the frequency spectrum and corresponding to \nthe orbital period of 4.055259 days determined by \\citet{fae11}. A \nleast-squares sine fit on the orbital period gives a semi-amplitude of only \n$0.00050\\pm0.00033$ mag. The lack of rotational modulation is consistent with \nWASP-39 being an old, late G-type dwarf. The lack of any brightness \nvariability on the radial velocity period gives further confirmation that\nthe radial velocity variations are due to a planetary companion.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.38]{stellar_activity.pdf}\n\\caption{$Top$: Four years of normalized Cousins R-band photometry of WASP-39 from the C14 automated imaging telescope at Fairborn Observatory. The observations scatter about their mean magnitude with a standard deviation of 0.00496 mag, approximately equal to C14's measurement error for a single observation. The vertical dotted lines correspond to the times of HST and Spitzer transit observations. $Bottom$: Frequency spectrum of the R-band photometry covering a period-search range of 1 to 100 days. No rotational modulation of starspots can be seen above the noise, consistent with WASP-39 being an old, late G-type dwarf. The orbital frequency is marked by an arrow and shows the absence of brightness variability on the orbital period. A least-squares sine fit gives a semi-amplitude of only $0.00050\\pm0.00033$ mag.\\label{activity}}\n\\end{center}\n\\end{figure}\n\n\\section{Analysis}\n\nWe calculate transit light curves using the BATMAN package of \\citet{kre15}. We calculate the wavelength-dependent four-parameter nonlinear limb-darkening coefficients for each bandpass using an ATLAS stellar model with an effective temperature of 5500~K and log(g) of 4.5, which is the closest match to the WASP-39 stellar parameters reported by \\citet{fae11}. The orbital period is obtained from \\citet{fae11} and is also held fixed. The shape of the transit light curve then depends on four physical parameters that are fitted simultaneously for each observation: $T_c$ (transit center time), $i$ (inclination), $a/R_*$, and $R_p/R_*$, where $a$ is the semi-major orbital distance, $R_p$ is the radius of the planet, and $R_*$ is the radius of the star. Photometric time series are modeled by instrument systematics and transit light curves as described in the following sub-sections.\n\n\\subsection{White-Light Curves}\n\nFor the STIS observations, we first construct a white-light curve by summing the spectra across all wavelengths. We then use these white-light curves to fit for wavelength-independent parameters (e.g. $T_c$, $i$, and $a/R_*$). As in previous studies \\citep[e.g.][]{hui13, v-m13, sing13, nik14, nik15, sing15}, we find that the STIS sensitivity variations are adequately described by a linear function in time across all \\textit{HST} orbits (two parameters), and a fourth-order polynomial in time phased to each \\textit{HST} orbit (four parameters), totaling six instrumental systematic parameters per STIS observation. We test a range from 2nd order to 6th order polynomials for the orbital-phased systematics, and found that fourth order optimized the BIC. Consistent with previous work, we see possible evidence for differing systematics in the first \\textit{HST} orbit of each observation, which is thought to be caused by thermal relaxation after a new pointing \\citep{v-m13}. We therefore exclude the first orbit of each observation in our analysis. For the \\textit{Spitzer} IRAC light curves we utilize the pixel-level decorrelation technique \\citep{dem15} with a grid of nine pixels centered on the position of the star. This results in a total of 10 free parameters for each \\textit{Spitzer} light curve, including nine pixel weighting coefficients and a constant term.\n\nAs a result of gaps in time coverage due to \\textit{HST}'s low-earth orbit, we find that the STIS observations alone do not provide strong constraints on the planet's orbital inclination and $a/R_*$. Fortunately, our \\textit{Spitzer} observations span the entire transit with no gaps and are obtained at longer wavelengths where the effects of stellar limb-darkening are minimal. We therefore perform a simultaneous fit with STIS white light curves and Spitzer 3.6 and 4.5~$\\mu$m light curves, in which inclination and $a/R_*$ are common for all observations, but $T_c$, $R_p/R_*$, and instrumental noise parameters are unique for each transit observation, resulting in a total of 50 free parameters to model 290 photometric points in the global fit. The instrumental parameters are fit simultaneously with the transit parameters. We report a common $R_p/R_*$ value for the two STIS G430L observations, which is valid assuming negligible contributions from stellar variability, consistent with the results of the stellar activity monitoring described earlier. \n\nWe determine the best-fit model parameters in the global fit using an MCMC analysis, implemented using the EMCEE python routine from \\citet{dfm13}. The reported results are the means of the MCMC posterior distributions and are shown in Table~\\ref{results}. Uncertainties are determined by marginalizing over the MCMC chain to find the posterior probability distribution for each parameter and using this to calculate the corresponding 68\\% confidence interval. Photometric uncertainties are set to the calculated RMS of the residuals in the best-fit solution for each individual transit observation.\n\n\\begin{figure*}\n\\includegraphics[scale=0.49]{stis_whitelight_raw_fits_res.pdf}\n\\caption{\\textit{HST} STIS raw (top) and corrected (middle) white-light curves, where we have divided out the best-fit instrumental noise model for each visit. Open circles in the top panel show the model points. The bottom panel shows the residuals after removing both the instrumental model and transit light curves. Error bars are the standard deviation of these residuals. Dashed lines show one standard deviation.\\label{stis}}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.5]{spitzer_whitelight_raw_fits_res.pdf}\n\\caption{\\textit{Spitzer} IRAC 3.6- and 4.5-$\\mu$m lightcurves for raw (top) and corrected (middle) white-light curves, where we have binned the data in time to three-minute intervals and divided out the best-fit instrumental noise model for each visit. Open circles in the top panel show the model points. The bottom panel shows the residuals after removing both the instrumental model and transit light curves. Error bars are the standard deviation of these residuals. Dashed lines show one standard deviation.\\label{spitzer}}\n\\end{center}\n\\end{figure*}\n\n\\subsection{Spectral Light Curves}\n\nThe transmission spectrum is obtained by grouping the STIS spectra into 35 bins with wavelength ranges shown in Table~\\ref{results}; each bin yields a unique spectral light curve (Fig.~\\ref{binned13}, \\ref{binned14}, \\ref{binned23}). We select the wavelength range of the spectral bins to optimally balance resolution and S/N, and to distinguish sodium and potassium features. We calculate four parameter nonlinear limb-darkening parameters unique to each bandpass. We fit the spectral light curves with the transit model with $R_p/R_*$ as a free parameter, but fix the wavelength-independent parameters $T_c$, inclination, and $a/R_*$ to the values obtained from the global white-light curve fit. We assume a common value for $R_p/R_*$ in each bandpass for the two observations with the G430L grism and fit both observations simultaneously. \n\nWe multipy the transit signal by an instrumental noise model, which we test as both a parametric model and common mode model as in previous work \\citep{sing13, nik14, nik15, sing15}. The parametric model is the same as for the white light curves described earlier, with a unique fit for each wavelength bin. In the common mode method, the instrumental noise model consists of the common mode residuals scaled by a normalization factor and a linear function in time. The common mode residuals are obtained by removing the transit signal and linear sensitivity function from the raw photometry. All orbits show similar systematics due to the breathing effect, and we therefore use the orbit-phased average for each individual orbit. Both instrumental noise models give very similar results for the transmission spectrum. However, the parametric model favors an unreasonably low value in the noisy shortest wavelength bin in the G430L grism. We therefore choose the common mode model for this grism, which favors a more reasonable value. Furthermore, the residuals in the G750L grism display a wavelength dependence such that the common mode residuals do not well describe the wavelength-dependent systematics. We therefore choose the four-parameter parametric model for this grism, with a unique solution for each wavelength bin. The results reported in Table~\\ref{results} are the means of the MCMC posterior distributions.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_13_raw_fits_res.pdf}\n\\caption{\\textit{HST} STIS G430L spectral light curves for the observations on UT 2013 Feb 8, raw (left) and corrected (middle) where we have divided out the best-fit instrumental noise model for each visit. Color corresponds to wavelength, with the shortest wavelengths plotted in purple and the longest wavelengths plotted in light green. Light curves are offset vertically by multiples of 0.01. Open circles in the left panel show the model points. The right panel shows the residuals after removing both the instrumental model and transit light curves. Dashed lines show one standard deviation. \\label{binned13}}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_14_raw_fits_res.pdf}\n\\caption{Same description as in Fig.~\\ref{binned13}, for observations on UT 2013 Feb 12.\\label{binned14}}\n\\end{center}\n\\end{figure*}\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.51]{binned_23_raw_fits_res.pdf}\n\\caption{Same description as in Fig.~\\ref{binned13}, \\ref{binned14} for observations with the G750L grism on UT 2013 Mar 17.\\label{binned23}}\n\\end{center}\n\\end{figure*}\n\n\\begin{table*}\n\\begin{center}\n\\caption{Transit Parameters from Global Fit.\\label{param}}\n\\begin{tabular}{lllll}\n\\tableline\n\\tableline\n\\\\\nInstrument & Date & Wavelength ($\\textrm{\\AA}$) & Parameter & Value\\\\\n\\tableline\n\\\\\nSTIS G430L & 2013 Feb 8, 12 & 2896 - 5706 & Planet radius ($R_p / R_*$) & 0.14463 $\\pm$ 0.00069 \\\\\nSTIS G430L & 2013 Feb 8 & 2896 - 5706 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456332.45857^{+0.00033}_{-0.00034}$ \\\\\nSTIS G430L & 2013 Feb 12 & 2896 - 5706 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456336.51323 ^{+0.00017}_{-0.00031}$ \\\\\n\\\\\nSTIS G750L & 2013 Mar 17 & 5259 - 10251 & Planet radius ($R_p / R_*$) & 0.14452 $\\pm$ 0.00059 \\\\\nSTIS G750L & 2013 Mar 17 & 5259 - 10251 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456368.95549 ^{+0.00024}_{-0.00041}$ \\\\\n\\\\\nIRAC 3.6-$\\mu$m & 2013 Apr 18 & 31618 - 39284 & Planet radius ($R_p / R_*$) & 0.14513 $\\pm$ 0.00148 \\\\\nIRAC 3.6-$\\mu$m & 2013 Apr 18 & 31618 - 39284 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456401.39696 ^{+0.00056}_{-0.00053}$ \\\\\n\\\\\nIRAC 4.5-$\\mu$m & 2013 Oct 10 & 39735 - 50198 & Planet radius ($R_p / R_*$) & 0.14591 $\\pm$ 0.00096 \\\\\nIRAC 4.5-$\\mu$m & 2013 Oct 10 & 39735 - 50198 & Transit center BJD$_\\textrm{\\scriptsize TDB}$ (days) & $2456575.77450 ^{+0.00029}_{-0.00026}$ \\\\\n\\\\\nCombined & & & Semi-major axis ($a / R_*$) & 11.55 $\\pm$ 0.13 \\\\\nCombined & & & Orbital inclination ($^{\\circ}$) & 87.93 $\\pm$ 0.14 \\\\\n\\tableline\\tableline\n\\end{tabular}\n\\end{center}\n\\end{table*}\n\n\\begin{table}\n\\begin{center}\n\\caption{STIS Transmission Spectrum Results.\\label{results}}\n\\begin{tabular}{cc}\n\\tableline\\tableline\n\\\\\nWavelength ($\\textrm{\\AA}$) & $R_p/R_*$\\\\\n\\tableline\n\\\\\n\\sidehead{STIS G430L}\n2900 - 3700 & 0.14429 $\\pm$ 0.00230\\\\\n3700 - 3950 & 0.14408 $\\pm$ 0.00143\\\\\n3950 - 4113 & 0.14467 $\\pm$ 0.00089\\\\\n4113 - 4250 & 0.14500 $\\pm$ 0.00088\\\\\n4250 - 4400 & 0.14653 $\\pm$ 0.00087\\\\\n4400 - 4500 & 0.14491 $\\pm$ 0.00093\\\\\n4500 - 4600 & 0.14396 $\\pm$ 0.00085\\\\\n4600 - 4700 & 0.14376 $\\pm$ 0.00073\\\\\n4700 - 4800 & 0.14447 $\\pm$ 0.00086\\\\\n4800 - 4900 & 0.14461 $\\pm$ 0.00076\\\\\n4900 - 5000 & 0.14381 $\\pm$ 0.00081\\\\\n5000 - 5100 & 0.14301 $\\pm$ 0.00081\\\\\n5100 - 5200 & 0.14361 $\\pm$ 0.00089\\\\\n5200 - 5300 & 0.14541 $\\pm$ 0.00077\\\\\n5300 - 5400 & 0.14330 $\\pm$ 0.00081\\\\\n5400 - 5500 & 0.14309 $\\pm$ 0.00122\\\\\n5500 - 5600 & 0.14437 $\\pm$ 0.00098\\\\\n5600 - 5700 & 0.14558 $\\pm$ 0.00083\\\\\n\\sidehead{STIS G750L}\n5500 - 5650 & 0.14381 $\\pm$ 0.00115\\\\\n5650 - 5880 & 0.14550 $\\pm$ 0.00126\\\\\n5880 - 5910 & 0.14890 $\\pm$ 0.00282\\\\\n5910 - 6060 & 0.14496 $\\pm$ 0.00109\\\\\n6060 - 6300 & 0.14531 $\\pm$ 0.00111\\\\\n6300 - 6450 & 0.14491 $\\pm$ 0.00091\\\\\n6450 - 6600 & 0.14520 $\\pm$ 0.00121\\\\\n6600 - 6800 & 0.14315 $\\pm$ 0.00091\\\\\n6800 - 7100 & 0.14301 $\\pm$ 0.00092\\\\\n7100 - 7650 & 0.14423 $\\pm$ 0.00057\\\\\n7650 - 7710 & 0.14532 $\\pm$ 0.00283\\\\\n7710 - 8100 & 0.14604 $\\pm$ 0.00109\\\\\n8100 - 8500 & 0.14451 $\\pm$ 0.00200\\\\\n8500 - 9000 & 0.14425 $\\pm$ 0.00122\\\\\n9000 - 10250 & 0.14179 $\\pm$ 0.00161\\\\\n\\tableline\n\\tableline\n\\\\\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\n\\subsection{White-Light Transit Parameters and Updated Orbital Ephemeris}\n\nFrom the global fit combining STIS and Spitzer observations, we find common values for inclination and semi-major axis of $i=87.93\\pm 0.14$ and $a/R_*=11.55\\pm 0.13$, in agreement with the values reported by \\citet{fae11} and \\citet{ric15}. The transit times calculated from our combined fit (Table~\\ref{param}) and the result from \\citet{fae11} and \\citet{ric15} are fit as a function of period $P$ and epoch $E$,\n\n\n", "index": 3, "text": "\\begin{equation}\nT(E) = T(0) + E \\times P\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"T(E)=T(0)+E\\times P\" display=\"block\"><mrow><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>E</mi><mo>×</mo><mi>P</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04761.tex", "nexttext": "\n\n\\noindent \\citep{lec08} where $\\mu$ is the mean molecular mass, $g$ is the surface gravity, $k$ is the Boltzman constant, $T$ is temperature, and $\\alpha$ is the index that defines the wavelength-dependence of the scattering cross-section, $\\sigma/\\sigma_0=(\\lambda/\\lambda_0)^\\alpha$. We set $\\alpha$ equal to -4 for Rayleigh scattering and fix the surface gravity to the value reported in \\citet{fae11}. Using this expression we find a best-fit terminator temperature of 940$\\pm$470~K, in good agreement with the predicted zero-albedo equilibrium temperature $T_{eq} = 1116^{+33}_{-32}$ \\citep{fae11}.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.29]{fortney_fits.pdf}\n\\caption{Measured transmission spectrum and forward models scaled to WASP-39b for Clear solar metallicity (cyan), Solar metallicity with weak haze (orange), and Clear sub-solar (0.1$\\times$) metallicity (blue). Squares show the model binned to the data wavelengths. Each model is consistent with the transmission spectrum to within the uncertainties.\\label{fortneymodels}}\n\\end{center}\n\\end{figure*}\n\nFigure~\\ref{fortneymodels} shows the measured transmission spectrum with several atmosphere models overplotted for comparison, and Table~\\ref{fits} gives the corresponding $\\chi^2$ and Bayesian Information Criterion (BIC) values for each model. We compare the observed transmission over the entire STIS (290-1025~nm) and IRAC (3.6, 4.5~$\\mu$m) wavelength range (Fig.~\\ref{fortneymodels}) with a forward model for a clear, solar metallicity atmosphere from \\citet{for10} with a temperature of 1000~K. We scale this model to match the measured surface gravity and radius of WASP-39b and fit for a vertical offset as the only free parameter. We also consider models with either a sub-solar (0.1$\\times$) metallicity (new run of the Fortney et al. 2010 model), or a solar metallicity with weak haze characterized by enhanced (10$\\times$) Rayleigh scattering. The measured spectrum is well matched by a clear atmosphere of solar metallicity (cyan), which gives $\\chi^2=35.8$ with 34 degrees of freedom. A sub-solar metallicity model with no additional scatterers is shown in blue; this model gives a slightly better match with $\\chi^2=28.0$ for 34 degrees of freedom. A weak haze model with 10$\\times$ Rayleigh scattering is also consistent with the measurements; it gives $\\chi^2=41.8$ with 34 degrees of freedom. Strong hazes such as those seen in HD~189733b or WASP-6b \\citep{pon13, nik15} are ruled out, with 100$\\times$ and 1000$\\times$ enhanced Rayleigh models producing poor fits with $\\chi^2$ values of 80.3 and 130 with 34 degrees of freedom, respectively. These models show a degeneracy between the effects of depleted abundances and enhanced scattering. We note that the physical basis for sub-solar metallicities is questionable for hotter planets with less condensation at depth, however the sub-solar metallicity model provides the best fit among these models and is therefore considered here.\n\nWe test the significance of the Na and K detections using an analytical fit in the optical from \\citet{sing15}, in which we remove either the Na or K absorption line and calculate the corresponding change in $\\chi^2$ (Fig.~\\ref{analyticalmodels}). The optical transmission spectrum is calculated using the expression:\n\n\n", "itemtype": "equation", "pos": 31962, "prevtext": "\n\n\\noindent where the initial transit epoch $T(0)$ is chosen to remain consistent with previous work (Fig.~\\ref{oc}). We convert all transit times to BJD$_\\textrm{\\scriptsize TDB}$ following \\citet{eas10}. We find an initial transit epoch $2455342.9696\\pm~0.00014$~BJD$_\\textrm{\\scriptsize TDB}$ and period $4.05528047\\pm~7.0\\times~10^{-7}$~days. \\citet{ric15} previously reported a period of $4.0552947\\pm~9.65\\times~10^{-7}$, which disagreed with the value found by \\citet{fae11} of $4.055259\\pm~8\\times~10^{-6}$ at the 4.4$\\sigma$ level. Our best-fit period is intermediate between these values. We differ from the value reported by \\citet{fae11} at the 2.7$\\sigma$ level, and from the value in \\citet{ric15} by 12$\\sigma$. Although transit timing variations might explain these discrepant results, we find no evidence for timing variations in the transits analyzed here, and the previous studies do not report individual transit times.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.4]{OminusC.pdf}\n\\caption{Observed - computed times of transit center for this work (open circles), \\citet{ric15}, and \\citet{fae11} (filled circles, nearly overlapping). Dotted lines show the 1$\\sigma$ uncertainty. All times have been converted to BJD$_\\textrm{\\scriptsize TDB}$ following \\citet{eas10}.\\label{oc}}\n\\end{center}\n\\end{figure}\n\n\\subsection{Transmission Spectrum Models}\n\nWe find that the transmission spectrum is well-matched by clear-atmosphere models including broad line absorption wings from both Na and K. Although weak contributions from hazes or clouds are also consistent, additional sources of opacity are not required to describe the observed transmission spectrum. \n\nFirst, we use the Rayleigh slope shortward of 520~nm to empirically measure the temperature of the planet's atmosphere at the day-night terminator. This slope is determined by:\n\n\n", "index": 5, "text": "\\begin{equation}\n\\alpha T = \\frac{\\mu g}{k} \\frac{d(R_p/R_*)}{d~ln(\\lambda)}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\alpha T=\\frac{\\mu g}{k}\\frac{d(R_{p}/R_{*})}{d~{}ln(\\lambda)}\" display=\"block\"><mrow><mrow><mi>α</mi><mo>⁢</mo><mi>T</mi></mrow><mo>=</mo><mrow><mfrac><mrow><mi>μ</mi><mo>⁢</mo><mi>g</mi></mrow><mi>k</mi></mfrac><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mi>p</mi></msub><mo>/</mo><msub><mi>R</mi><mo>*</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mpadded width=\"+3.3pt\"><mi>d</mi></mpadded><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.04761.tex", "nexttext": "\n\n\\noindent \\citep{lec08} where $z(\\lambda)$ is the transmission altitude, $\\epsilon_{abs}$ is the abundance of dominating absorbing species, $P_{ref}$ is the pressure at the reference altitude, $\\sigma(\\lambda)$ is the absorption cross-section, and $H = kT/\\mu g$ is the atmosphere scale height. \n\nThe complete model is made by joining the analytical model at optical wavelengths ($\\lambda<$~885~nm) with the \\citet{for10} sub-solar metallicity model at IR wavelengths ($\\lambda\\geq$~885~nm). The fit includes four free parameters: Na abundance, K abundance, vertical offset $z_0$ in the optical, and vertical offset $z_0$ in the IR. When both Na and K are included  (Fig.~\\ref{analyticalmodels}, blue line), this yields $\\chi^2=33.4$ with four fitted parameters and 31 degrees of freedom, with ln$(\\epsilon_\\textrm{\\scriptsize Na})=-15.6\\pm0.6$ (0.1$\\times$ solar), ln($\\epsilon_\\textrm{\\scriptsize K})=-17.6\\pm0.5$ (0.2$\\times$ solar), in reference to the solar abundance values from \\citet{asp09}. When either the Na or K abundance is set to 0, the $\\chi^2$ increases to 47.4 or 57.7 respectively for 3 fitted parameters and 32 degrees of freedom (Fig.~\\ref{analyticalmodels}, green and red lines). Using a nested likelihood test, this results in a detection significance of 3.7$\\sigma$ for Na and 4.9$\\sigma$ for K. Although we conclude that both species are clearly present in this planet's transmission spectrum, we note that their abundances can increase by an order of magnitude depending on whether or not we allow for the possibility of a weak haze at the shortest wavelengths.\n\nThe Na/K abundance ratio is not dependent on P$_\\textrm{\\scriptsize ref}$ \\citep{sing15}, and can be accurately measured independent of whether the atmosphere is clear or contains a weak haze.  We find a Na to K abundance ratio of [Na/K]=0.45$\\pm$0.31 $\\times$ solar, which is slightly sub-solar.  \n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[scale=0.32]{analytical_fits.pdf}\n\\caption{Comparison of analytical models with no Na (green) or no K (red) to the measured transmission spectrum (black filled circles). We also plot the 0.1$\\times$ solar metallicity model (blue) for comparison. The top spectra have been offset vertically by 0.01 $R_p / R_*$.\\label{analyticalmodels}}\n\\end{center}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\caption{Model fit statistics.\\label{fits}}\n\\begin{tabular}{lccc}\n\\tableline\\tableline\n\\\\\nModel & $N$, d.o.f. & $\\chi^2$ & BIC\\\\\n\\tableline\n\\\\\n0.1$\\times$ solar metallicity, clear & 35, 34 & 28.0 & 31.6\\\\\nsolar metallicity, clear & 35, 34 & 35.8 & 39.4\\\\\nsolar metallicity, 10$\\times$ scattering & 35, 34 & 41.8 & 45.4\\\\\nsolar metallicity, 100$\\times$ scattering & 35, 34 & 80.3 & 83.9\\\\\nsolar metallicity, 1000$\\times$ scattering & 35, 34 & 130 & 134\\\\ \n\\\\\n\\tableline\n\\\\\nanalytical, 0.1$\\times$ solar metallicity & 35, 31 & 33.4 & 47.6\\\\\n~~without Na & 35, 32 & 47.4 & 61.6\\\\\n~~without K & 35, 32 & 57.7 & 71.9\\\\\n\\tableline\\tableline\n\\\\\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\n\\section{Discussion}\n\nWASP-39b is among the coolest gas giant planets with a measured optical transmission spectrum. If we compare it to other gas giants with comparable STIS observations, we find that its temperature-pressure profile is most similar to WASP-6b and HD~189733b at the pressures probed in transmission \\citep{sing16}. However, the measured transmission spectra of these systems are quite different. The transmission spectrum of HD~189733b displays a steep scattering slope across the optical and into the infrared, with evidence for narrow-line abosorption in the Na and K line cores and a muted 1.5~$\\mu$m H$_2$O feature \\citep[e.g.][]{hui12, pon13, mcc14}. WASP-6b displays a shallow scattering slope extending to 5~$\\mu$m, with tentative evidence for narrow-line absorption from Na and K in the line cores \\citep{nik15}. The transmission spectra of WASP-6b and HD~189733b are best matched by scenarios including high-altitude hazes, while WASP-39b has a shallow optical scattering slope and is well-matched by haze-free models. WASP-39b also appears to possess broad line absorption wings for both Na and K that are absent in the transmission spectra of the other two planets. The differences between these systems are difficult to explain using conventional condensate cloud models, which predict that clouds will form whenever the planet's pressure-temperature profile crosses the condensation curve for a given refractory species \\citep{mor13, sing16}.\n\n\\begin{table*}\n\\begin{center}\n\\caption{Comparison of cooler gas giant systems from \\textit{\\scriptsize HST} survey.\\label{comparison}}\n\\begin{tabular}{lcccccl}\n\\tableline\\tableline\n\\\\\nSystem & {T$_\\textrm{\\scriptsize eq}$}~(K) & Mass ({M$_\\textrm{\\scriptsize J}$}) & $g$~(cm~s$^{-2}$) & {log(\\ensuremath{R'_{\\mbox{\\scriptsize HK}}})} \\tablenotemark{a} & Clear? & References\\tablenotemark{b}\\\\\n\\tableline\n\\\\\nHD~189733b & 1201 & 1.14 & 2140 & -4.501 & no & \\citet{pon13,mcc14}\\\\\nWASP-39b & 1116 & 0.28 & 407 & -4.994 & yes & \\citet{fae11}; this work\\\\\nWASP-6b & 1145 & 0.50 & 871 & -4.741 & no & \\citet{gil09, nik15}\\\\\nHAT-P-12b & 963 & 0.21 & 562 & -5.104 & no & \\citet{har09, line13}\\\\\n\\tableline\\tableline\n\\end{tabular}\n\\tablenotetext{a}{Values are calculated as described in \\citet{isa10, knu10}}\n\\tablenotetext{b}{In addition to \\citet{sing16}}\n\\end{center}\n\\end{table*}\n\nIt is possible that the different cloud properties of these three planets can be understood through variations in their planet and stellar parameters. We explore possible physical understanding through trends with several model-independent parameters (Table~\\ref{comparison}) for these three systems and HAT-P-12b, the only cooler system in the \\textit{HST} survey. For example, higher metallicity would lead to higher concentrations and partial pressures of possible condensate species. Although we do not currently have direct measurements of the atmospheric metallicities of these three planets, we can extrapolate assuming an inverse correlation between mass and metallicity as seen for the solar system gas giants \\citep[e.g.][]{wong04,fletcher09,karkoschka11,sromovsky11} and WASP-43b \\citep{kre14}. This is supported by current mass and radius measurements for extrasolar planets, which suggest an inverse relationship between mass and bulk metallicity \\citep{mil11, tho15}.  Surface gravity is also proportional to mass, and lower surface gravity should correspond to lower settling rates and correspondingly longer lifetimes for condensates at high altitudes. \n\nIf metallicity or surface gravity is the dominant factor in the formation of high altitude clouds, we would expect less massive planets to have thicker hazes than their more massive counterparts. WASP-39b is the least massive and therefore the most likely to be metal-rich according to this empirical scaling relation, and yet has the clearest atmosphere in transmission. For these three planets, the relative amount of haze appears to increase with increasing planet mass. However, this trend fails to predict the transmission spectrum observed for HAT-P-12b, which is slightly less massive and cooler than WASP-39b and yet appears to possess a thick cloud or haze layer.\n\nThe variations in cloud properties could also be attributed to differences in vertical mixing. In this scenario condensate clouds might form at the same pressure in all three atmospheres but could have very different vertical distributions depending on the relative efficiency of vertical mixing versus settling rates in the upper atmosphere. For example, \\citet{par13} used a general circulation model to study advection and settling of cloud particles on hot Jupiter HD~209458b and found that particles smaller than a few microns can easily be lofted vertically across many scale heights. The degree of vertical mixing will generally increase as temperature or incident flux increases \\citep[e.g.][]{sho10}. If variations in vertical mixing are the dominant factor in controlling the presence of high altitude condensates, we might expect their presence to correlate with temperature. WASP-39b is the cooler than HD~189733b and WASP-6b and clear, consistent with this hypothesis. However this trend does not extend to slightly lower temperatures, as HAT-P-12b is cooler and hosts a thick cloud or haze layer.\n\nCold traps at depth in the atmosphere might also provide a means to remove condensate cloud particles from the upper atmosphere \\citep{spi09}. At these high pressures the vertical mixing rates are likely to be orders of magnitude smaller than in the upper atmosphere, making it difficult to efficiently transport particles upward and depleting the upper atmosphere of the condensate species in question. If this deep cold trap was stronger on WASP-39b than on WASP-6b or HD~189733b, it would provide a natural means to suppress the formation of condensate clouds in WASP-39b's upper atmosphere; this could be explored with planet-specific thermal evolution models \\citep[e.g.][]{for08,liu08}.\n\nWe also consider that the temperature is expected to vary widely from equator to pole and across terminators \\citep[e.g.][]{sho08,sho09,sho15,hen15,kat15}. In this scenario, differences in atmospheric circulation patterns between the three planets might contribute to the presence or absence of localized cloud layers near the day-night terminator \\cite[e.g.][]{par13,web15}. Visible-light phase curve observations of hot Jupiters in the Kepler field indicate that a subset of hot Jupiters do indeed possess spatially inhomogenous cloud layers \\citep{demo13, hu15}, providing additional support for this hypothesis, but it is difficult to determine the degree to which circulation patterns in the atmospheres of these three planets might differ without either phase curve observations or planet-specific circulation models.\n\nFor planets at these relatively low temperatures, photochemical hazes \\citep{zah09, mor13} could provide a viable alternative to the standard condensate cloud models. Equally important, hydrocarbons form from methane and therefore should only form in atmospheres cool enough for this molecule to exist in the upper atmosphere. For these photochemically derived hazes, we would expect a positive correlation between the presence of haze and the incident UV flux received from the host star. These three host stars are similar in temperature and spectral type, so any variations in their UV flux is likely due to varying activity levels as measured by their {log(\\ensuremath{R'_{\\mbox{\\scriptsize HK}}})} values \\citep{knu10}. According to this index HD~189733 is the most active, WASP-6 is moderately active, and WASP-39 is quiet. This trend appears promising at first glance, as the strength of the observed hazes in these three planets increases with increasing stellar activity. However, this trend is again broken at slightly lower temperatures; HAT-P-12 is cool enough to have abundant atmospheric methane and has a hazy atmosphere, yet orbits a relatively quiet star ({T$_\\textrm{\\scriptsize eff}$}~=4500~K, {log(\\ensuremath{R'_{\\mbox{\\scriptsize HK}}})}~=-5.104). This discrepancy could potentially be resolved if the clouds observed in HAT-P-12b's atmosphere had a different composition (for instance, condensates rather than a photochemical haze) than those observed in the atmospheres of HD~189733b and WASP-6b.\n\n\\section{Conclusions}\n\nIn this study we analyze three spectroscopic transits of WASP-39b observed with the STIS instrument on \\textit{HST} (290-1025~nm) and combine these observations with 3.6 and 4.5~$\\mu$m IRAC transit photometry from the \\textit{Spitzer Space Telescope}. We find that the resulting transmission spectrum is well-matched by models with a Rayleigh scattering slope and Na and K absorption in the optical, in good agreement with the preliminary analysis of these data presented in \\citet{sing16}. This is the first system in which the broad wings of both lines are clearly detected. The transmission spectrum is well matched by a clear, H$_2$-dominated atmosphere with either a solar metallicity or sub-solar (0.1$\\times$) metallicity, or a solar metallicity model with a weak haze layer. These models predict that this planet should have strong water absorption features in its infrared transmission spectrum; this will be tested by upcoming observations with the WFC3 instrument on \\textit{HST}.\n\nWASP-39b is currently one of the coolest gas giant planets with a complete optical transmission spectrum from \\textit{HST} STIS observations. At the altitudes probed in transmission, WASP-39b is very similar in pressure and temperature to HD~189733b and WASP-6b. Interestingly, the latter systems both seem to require a high-altitude haze or cloud layer in order to match their observed transmission spectra. This suggests that the three-dimensional temperature structure must be carefully considered when interpreting and predicting cloud properties. Other factors that may contribute to the presence or absence of high-altitude clouds and hazes include metallicity, surface gravity, vertical mixing, and stellar activity. However, estimates of these parameters based on currently available measurements such as planet mass, temperature, and stellar activity level do not appear to provide a satisfactory explanation for the apparent absence of clouds in WASP-39b's atmosphere as compared to other similar planets. The formation of high-altitude clouds and hazes may also be influenced by the atmospheric circulation patterns and thermal evolution histories of these planets, making them difficult to predict using the relatively simple 1D models described here. The lack of a correlation between the transmission spectra of HD 189733b, WASP-6b, and WASP-39b, as well as the overall diversity of the hot Jupiter transmission spectra obtained to date, suggests that the presence or absence of clouds in these atmospheres most likely results from a combination of multiple parameters and further emphasizes the value of large surveys for developing a better understanding of the processes that drive cloud formation.\n\n\\acknowledgments\n\nThis work is based on observations with the NASA/ESA \\textit{HST}, obtained at the Space Telescope Science Institute (STScI) operated by AURA, Inc. This work is also based in part on observations made with the \\textit{Spitzer Space Telescope}, which is operated by the Jet Propulsion Laboratory, California Institute of Technology under a contract with NASA. The research leading to these results has received funding from the European Research Council under the European Union's Seventh Framework Program (FP7/2007-2013) / ERC grant agreement no. 336792. Support for this work was provided by NASA through grants under the HST-GO-12473 program from the STScI. G.W.H. and M.H.W. acknowledge long-term support from Tennessee State University and the State of Tennessee through its Centers of Excellence program.\n\n\\begin{thebibliography}{1}\n\n\\bibitem[Angerhausen et al.(2014)]{ang14} Angerhausen, D., DeLarme, E., \\& Morse, J. A. 2014, arXiv:1404.4348v3\n\n\\bibitem[Asplund et al.(2009)]{asp09} Asplund, M., Grevesse, N., Sauval, A. J., \\& Scott, P. 2009, Annual Review of Astronomy and Astrophysics, 47, 481\n\n\\bibitem[Charbonneau et al.(2008)]{cha08} Charbonneau, D., Knutson, H. A., Barman, et al. 2008, \\apj, 686, 1341\n\n\\bibitem[Deming et al.(2013)]{dem13} Deming, D., Wilkins, A., McCullough, P. et al. 2013, \\apj, 774, 95\n\n\\bibitem[Deming et al.(2015)]{dem15} Deming, D., Knutson, H. A., Kammer, J., et al. 2015, arXiv:1411.7404v2\n\n\\bibitem[Demory et al.(2013)]{demo13} Demory, B.-O., de Wit, J., Lewis, N., et al. 2013, \\apjl, 776, L25\n\n\\bibitem[Eastman et al.(2010)]{eas10} Eastman, J., Siverd, R., Gaudi, B. S. 2010, \\pasp, 122, 935\n\n\\bibitem[Eaton et al.(2003)]{ehf2003} Eaton, J. A., Henry, G. W., \\& Fekel, F. C. 2003, in The Future of Small Telescopes in the New Millennium, Volume II - The Telescopes We Use, ed. T. D. Oswalt (Dordrecht:  Kluwer), 189\n\n\\bibitem[Evans et al.(2013)]{eva13} Evans, T., Pont, F., Sing, D. K., et al. 2013, \\apjl, 772, L16\n\n\\bibitem[Faedi et al.(2011)]{fae11} Faedi, F., Barros, S. C. C., Anderson, D. R., et al. 2011, \\aap, 531, A40\n\n\\bibitem[{Fletcher {et~al.}(2009)}]{fletcher09} Fletcher, L. N. {et~al.} 2009, Icarus, 199, 351\n\n\\bibitem[Foreman-Mackey et al.(2013)]{dfm13} Foreman-Mackey, D., Hogg, D. W., Lang, D., \\& Goodman, J. 2013, \\pasp, 125, 306\n\n\\bibitem[Fortney et al.(2003)]{for03} Fortney, J. J., Sudarsky, D., Hubeny, I., et al. 2003, \\apj, 589, 615\n\n\\bibitem[Fortney et al.(2005)]{for05} Fortney, J. J. 2005, \\mnras, 364, 649\n\n\\bibitem[Fortney et al.(2008)]{for08} Fortney, J. J., Marley, M. S., Saumon, D., \\& Lodders, K. 2008, \\apj, 683, 1104\n\n\\bibitem[Fortney et al.(2010)]{for10} Fortney, J. J., Shabram, M., Showman, A. P. et al. 2010, \\apj, 709, 1396\n\n\\bibitem[Gillon et al.(2009)]{gil09} Gillon, M., Anderson, D. R., Triaud, A. H. M. J., et al. 2009, \\aap, 501, 785\n\n\\bibitem[Hartman et al.(2009)]{har09} Hartman, J. D., Bakos, G. \\`A., Torres, G. et al. 2009, \\apj, 706, 785\n\n\\bibitem[Heng \\& Demory(2013)]{hen13} Heng, K. \\& Demory, B.-O. 2013, \\apj, 777, 100\n\n\\bibitem[Heng \\& Showman(2015)]{hen15} Heng, K. \\& Showman, A. P. 2015, Annual Review of Earth and Planetary Sciences, 43, 509\n\n\\bibitem[Henry(1999)]{h1999} Henry, G. W. 1999, \\pasp, 111, 845\n\n\\bibitem[Hu \\& Shporer(2015)]{hu15} Hu, R., \\& Shporer, A. 2015, IAU General Assembly, 22, 48719\n\n\\bibitem[Hubbard et al.(2001)]{hub01} Hubbard, W. B., Fortney, J. J., Lunine, J. I., et al. 2001, 560, 413\n\n\\bibitem[Huitson et al.(2012)]{hui12} Huitson, C. M., Sing, D. K., Vidal-Madjar, A., et al. 2012, \\mnras, 422, 2477\n\n\\bibitem[Huitson et al.(2013)]{hui13} Huitson, C. M., Sing, D. K., Pont, F., et al 2013, \\mnras, 434, 3252\n\n\\bibitem[Isaacson \\& Fischer(2010)]{isa10} Isaacson, H., \\& Fischer, D. 2010, \\apj, 725, 875\n\n\\bibitem[Kammer et al.(2015)]{kam15} Kammer, J. A., Knutson, H. A., Line, M. R., et al. 2015, \\apj, 810, 118\n\n\\bibitem[{Karkoschka \\& Tomasko(2011)}]{karkoschka11} Karkoschka, E. \\& Tomasko, M. G. 2011, Icarus, 211, 780\n\n\\bibitem[Kataria et al.(in prep)]{kat15} Kataria, T., Sing, D. K., Lewis, N. K., et al. 2016, \\apj, submitted\n\n\\bibitem[Knutson et al.(2010)]{knu10} Knutson, H. A., Howard, A. W., \\& Isaacson, H. 2010, \\apj, 720, 1569\n\n\\bibitem[Knutson et al.(2012)]{knu12} Knutson, H. A., Lewis, N., Fortney, J. J. 2012, \\apj, 754, 22\n\n\\bibitem[Knutson et al.(2014)]{knu14} Knutson, H. A., Dragomir, D., Kreidberg, L, et al. 2014, \\apj, 794, 155\n\n\\bibitem[Kreidberg et al.(2014)]{kre14} Kreidberg, L, Bean, J. L., D\\'esert, J.-M., et al. 2014, \\apjl, 793, L27\n\n\\bibitem[Kreidberg (2015)]{kre15} Kreidberg, L. 2015, arXiv:1507.08285v3\n\n\\bibitem[Lecavelier des Etangs et al.(2008)]{lec08} Lecavelier des Etangs, A., Pont, F., Vidal-Madjar, A., \\& Sing, D. 2008, \\aap, 481, L83\n\n\\bibitem[Lewis et al.(2013)]{lew13} Lewis, N. K., Knutson, A. H., Showman, A. P., et al. 2013, \\apj, 766, 95\n\n\\bibitem[Line et al.(2013)]{line13} Line, M. R., Knutson, H. A., Deming, D., Wilkins, A., \\& D\\'esert, J.-M. 2013, \\apj, 778, 183\n\n\\bibitem[Liu et al.(2008)]{liu08} Liu, X., Burrows, A., \\& Ibgui, L. 2008, \\apj, 687, 1191\n\n\\bibitem[Mandell et al.(2013)]{man13} Mandell, A. M., Haynes, K., Sinukoff, E., et al. 2013 \\apj, 779, 128\n\n\\bibitem[McCullough et al.(2014)]{mcc14} McCullough, P. R., Crouzet, N., Deming, D., \\& Madhusudhan, N. 2014, \\apj, 791, 55\n\n\\bibitem[Mighell(2005)]{mig05} Mighell, K. J., 2005, \\mnras, 361, 861\n\n\\bibitem[{Miller \\& Fortney(2011)}]{mil11} Miller, N. \\& Fortney, J. J. 2011, ApJ, 736, L29\n\n\\bibitem[Morley et al.(2013)]{mor13} Morley, C. V., Fortney, J. J., Kempton, E. M.-R., et al. 2013, \\apj, 775, 33\n\n\\bibitem[Nikolov et al.(2014)]{nik14} Nikolov, N., Sing, D. K., Pont, F., et al. 2014, \\mnras, 437, 46\n\n\\bibitem[Nikolov et al.(2015)]{nik15} Nikolov, N., Sing, D. K., Burrows, A. S., et al. 2015, \\mnras, 447, 463\n\n\\bibitem[O'Rourke et al.(2014)]{oro14} O'Rourke, J. G., Knutson, H. A., Zhao, M., et al. 2014, \\apj, 781, 109 \n\n\\bibitem[Parmentier et al.(2013)]{par13} Parmentier, V., Showman, A. P., \\& Lian, Y. 2013, \\aap, 558, A91\n\n\\bibitem[Pont et al.(2008)]{pon08} Pont, F., Knutson, H. A., Gilliland, R. L., Moutou, C., \\& Charbonneau, D. 2008, \\mnras, 385, 109\n\n\\bibitem[Pont et al.(2013)]{pon13} Pont, F., Sing, D. K., Gibson, N. P. et al. 2013, \\mnras, 432, 2917\n\n\\bibitem[Ricci et al.(2015)]{ric15} Ricci, D., Ram\\'on-Fox, F. G., Ayala-Loera, C., et al. 2015, \\pasp, 127, 143\n\n\\bibitem[Seager \\& Deming(2010)]{sea10} Seager, S., \\& Deming, D. 2010, Annual Review of Astronomy \\& Astrophysics, 48, 631 \n\n\\bibitem[Seager \\& Sasselov(2000)]{sea00} Seager, S., \\& Sasselov, D. D. 2000, \\apj, 537, 916\n\n\\bibitem[Sheets \\& Deming(2014)]{she14} Sheets, H. A., \\& Deming, D. 2014, \\apj, 794, 133\n\n\\bibitem[Showman et al.(2008)]{sho08} Showman, A. P. et al. 2008, \\apj, 682, 559\n\n\\bibitem[Showman et al.(2009)]{sho09} Showman, A. P. et al. 2009, \\apj, 699, 564\n\n\\bibitem[Showman et al.(2010)]{sho10} Showman, A. P., Cho, J. Y-K., \\& Menou, K. 2010, in Exoplanets, ed. S. Seager, (Tucson, AZ: Univ. Arizona Press), 283\n\n\\bibitem[Showman et al.(2015)]{sho15} Showman, A. P., Lewis, N. K., \\& Fortney, J. J. 2015, \\apj, 801, 95\n\n\\bibitem[Sing et al.(2011)]{sing11} Sing, D. K., Pont, F., Aigrain, S. et al. 2011, \\mnras, 416, 1443\n\n\\bibitem[Sing et al.(2013)]{sing13} Sing, D. K., Lecavelier des Etangs, A., Fortney, J. J., et al. 2013, \\mnras, 436, 2956\n\n\\bibitem[Sing et al.(2015)]{sing15} Sing, D. K., Wakeford, H. R., Showman, A. P., et al. 2015, \\mnras, 446, 2428\n\n\\bibitem[Sing et al.(2016)]{sing16} Sing, D. K., Fortney, J. J., Nikolov, N., et al. 2016, \\nat, 529, 59\n\n\\bibitem[Spiegel et al.(2009)]{spi09} Spiegel, D. S., Silverio, K., \\& Burrows, A. 2009, \\apj, 699, 1487\n\n\\bibitem[{Sromovsky {et~al.}(2011)}]{sromovsky11} Sromovsky, L. A. {et~al.} 2011, Icarus, 132, 205\n\n\\bibitem[Sudarsky et al.(2003)]{sud03} Sudarsky, D., Burrows, A., \\& Hubeny, I. 2003, \\apj, 588, 1121\n\n\\bibitem[Thorngren et al.(2015)]{tho15} Thorngren, D. P., Fortney, J. J., \\& Lopez, E. D. 2015, arXiv:1511.07854\n\n\\bibitem[Todorov et al.(2013)]{tod13} Todorov, K. O., Deming, D., Knutson, H. A., et al. 2013, \\apj, 770, 102\n\n\\bibitem[Vidal-Madjar et al.(2013)]{v-m13} Vidal-Madjar, A., Huitson, C. M., Bourrier, V., et al. 2013, \\aap, 560, A54\n\n\\bibitem[Wakeford et al.(2013)]{wak13} Wakeford, H. R., Sing, D. K., Deming, D. et al. 2013, \\mnras, 435, 3481\n\n\\bibitem[Wakeford \\& Sing(2015)]{wak15} Wakeford, H. R. \\& Sing, D. K. 2015, \\aap, 573, A122\n\n\\bibitem[Webber et al.(2015)]{web15} Webber, M. W., Lewis, N. K., Marley, M., et al. 2015, \\apj, 804, 94\n\n\\bibitem[{Wong {et~al.}(2004)}]{wong04} Wong, M. H., {et~al.} 2004, Icarus, 171, 153\n\n\\bibitem[Zahnle et al.(2009)]{zah09} Zahnle, K., Marley, M. S., \\& Fortney, J. J. 2009, arXiv:0911.0728\n\n\\bibitem[Zellem et al.(2015)]{zel15} Zellem, R. T., Griffith, C. A., Pearson, K. A., et al. 2015, \\apj, 810, 11\n\n\\end{thebibliography}\n\n\\clearpage\n\n\\bibliography{mybib}\n\n", "itemtype": "equation", "pos": 35362, "prevtext": "\n\n\\noindent \\citep{lec08} where $\\mu$ is the mean molecular mass, $g$ is the surface gravity, $k$ is the Boltzman constant, $T$ is temperature, and $\\alpha$ is the index that defines the wavelength-dependence of the scattering cross-section, $\\sigma/\\sigma_0=(\\lambda/\\lambda_0)^\\alpha$. We set $\\alpha$ equal to -4 for Rayleigh scattering and fix the surface gravity to the value reported in \\citet{fae11}. Using this expression we find a best-fit terminator temperature of 940$\\pm$470~K, in good agreement with the predicted zero-albedo equilibrium temperature $T_{eq} = 1116^{+33}_{-32}$ \\citep{fae11}.\n\n\\begin{figure*}\n\\begin{center}\n\\includegraphics[scale=0.29]{fortney_fits.pdf}\n\\caption{Measured transmission spectrum and forward models scaled to WASP-39b for Clear solar metallicity (cyan), Solar metallicity with weak haze (orange), and Clear sub-solar (0.1$\\times$) metallicity (blue). Squares show the model binned to the data wavelengths. Each model is consistent with the transmission spectrum to within the uncertainties.\\label{fortneymodels}}\n\\end{center}\n\\end{figure*}\n\nFigure~\\ref{fortneymodels} shows the measured transmission spectrum with several atmosphere models overplotted for comparison, and Table~\\ref{fits} gives the corresponding $\\chi^2$ and Bayesian Information Criterion (BIC) values for each model. We compare the observed transmission over the entire STIS (290-1025~nm) and IRAC (3.6, 4.5~$\\mu$m) wavelength range (Fig.~\\ref{fortneymodels}) with a forward model for a clear, solar metallicity atmosphere from \\citet{for10} with a temperature of 1000~K. We scale this model to match the measured surface gravity and radius of WASP-39b and fit for a vertical offset as the only free parameter. We also consider models with either a sub-solar (0.1$\\times$) metallicity (new run of the Fortney et al. 2010 model), or a solar metallicity with weak haze characterized by enhanced (10$\\times$) Rayleigh scattering. The measured spectrum is well matched by a clear atmosphere of solar metallicity (cyan), which gives $\\chi^2=35.8$ with 34 degrees of freedom. A sub-solar metallicity model with no additional scatterers is shown in blue; this model gives a slightly better match with $\\chi^2=28.0$ for 34 degrees of freedom. A weak haze model with 10$\\times$ Rayleigh scattering is also consistent with the measurements; it gives $\\chi^2=41.8$ with 34 degrees of freedom. Strong hazes such as those seen in HD~189733b or WASP-6b \\citep{pon13, nik15} are ruled out, with 100$\\times$ and 1000$\\times$ enhanced Rayleigh models producing poor fits with $\\chi^2$ values of 80.3 and 130 with 34 degrees of freedom, respectively. These models show a degeneracy between the effects of depleted abundances and enhanced scattering. We note that the physical basis for sub-solar metallicities is questionable for hotter planets with less condensation at depth, however the sub-solar metallicity model provides the best fit among these models and is therefore considered here.\n\nWe test the significance of the Na and K detections using an analytical fit in the optical from \\citet{sing15}, in which we remove either the Na or K absorption line and calculate the corresponding change in $\\chi^2$ (Fig.~\\ref{analyticalmodels}). The optical transmission spectrum is calculated using the expression:\n\n\n", "index": 7, "text": "\\begin{equation}\nz(\\lambda) = H~ln\\left( \\frac{\\epsilon_{abs}P_{ref}\\sigma({\\lambda})}{\\tau_{eq}}\\sqrt{\\frac{2\\pi R_p}{kT\\mu g}}\\right)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"z(\\lambda)=H~{}ln\\left(\\frac{\\epsilon_{abs}P_{ref}\\sigma({\\lambda})}{\\tau_{eq}%&#10;}\\sqrt{\\frac{2\\pi R_{p}}{kT\\mu g}}\\right)\" display=\"block\"><mrow><mrow><mi>z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><mi>H</mi></mpadded><mo>⁢</mo><mi>l</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mrow><msub><mi>ϵ</mi><mrow><mi>a</mi><mo>⁢</mo><mi>b</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>⁢</mo><msub><mi>P</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>τ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>q</mi></mrow></msub></mfrac><mo>⁢</mo><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>R</mi><mi>p</mi></msub></mrow><mrow><mi>k</mi><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><mi>g</mi></mrow></mfrac></msqrt></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}]