[{"file": "1601.01935.tex", "nexttext": "\nwhere all parameters $a_i, b_i, \\ldots$ are positive. Table 1 describes the parameters and variables of model (\\ref{LV}) and Figure 1 is a schematic representation of the LV network of rodents. The arrows represent the direction of the interactions and the nodes are the populations of the species.\n\\begin{figure}[h]\n\t\t\\centerline{\\includegraphics[width=1.\\textwidth]{T1.pdf}}\n\t\t\\label{fig:T1}\n\\end{figure}\n\nUsing Matlab the annual competitive LV models were fitted to the long-term abundance data of five Kansas rodent species (see Table 1 for the list of the species). The assumption of annual variations is justified by the analyzing the time series of the abundance data, which indicates the presence of annual cycles in all five species \\cite{BradySlade2004, Reed08}. \n\n\\section{Results and Future Work}\n The goodness of fit of the annual competitive LV models is summarized in Table 2, which indicates that the annual LV models are superior to the Sum of Sine Models. Similarly, they outperform various regression models. By analyzing the time series of the estimated parameter values, the level of annually intraspecific competition is measured. Nevertheless, the competition assumption of may impose several restrictions on the parameter estimates and the main outcomes. This assumption is relaxed to include all possible modes of population interactions. The  95\\% confidence intervals of the estimated parameter values are obtained though the local sensitivity analysis, which are available  \\href{http://b.web.umkc.edu/baniyaghoubm/UMRBAppendixA.xls}{here}. \n \\begin{figure}[h]\n\t\t\\centerline{\\includegraphics[width=1.\\textwidth]{T2.pdf}}\n\t\t\\label{fig:T2}\n\\end{figure} \n  \nOwing to the increasing computational power and the flexibility of LV models, the present project is the first step towards developing a methodology that uses less detailed (but available) data to measure the long-term changes in population interactions. The methodology developed in this study is not limited to the rodent species and it can be employed to unpack the evolution of various wildlife social networks.\\\\\n\\indent Model (\\ref{LV}) can be extended to a reaction-diffusion model with nonlocality and delay \\cite{Bani15, Bani142}. Using the grid data 1973-2003 \\cite{Reed08}, the extended model can be used to investigate both spatial and temporal evolution of wildlife social networks. The extended model is validated using the pseudo-independent data set (data collected from 2007-2014 from the same grid but not included in the above analyses). This will constitute the further development of a methodology to analyze the spatio-temporal evolution of population interactions in various wildlife communities, and develop a framework to study the possible impacts of climate change on the evolution of wildlife social networks.  \n\n\n\n\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem{AllesinaLevine2011} Allesina, S., Levine, JM. 2011. A competitive network theory of species diversity. Proceedings of the National Academy of Sciences U.S.A., 108, 5638e5642.\n\\bibitem{Bani15}Bani-Yaghoub, M., Yao, G., Fujiwara, M., Amundsen, DE. 2015. Understanding the interplay between density dependent birth function and maturation time delay using a reaction-diffusion population model Ecological Complexity 21, 14-26. \n\n\\bibitem{Bani142}Bani-Yaghoub, M., Amundsen DE., 2014. Oscillatory traveling waves for a population diffusion model with two age classes and nonlocality induced by maturation delay Computational and Applied Mathematics, 1-16\n\\bibitem{Bascompte2009} Bascompte, J., 2009. Disentangling the Web of Life.  Science 325 (5939), 416-419.  \n\\bibitem{BowlesChoiHopfensitz2003} Bowles, S., Choi, J.-K. \\& Hopfensitz, A. 2003. The co-evolution of individual behaviors and social institutions. Journal of Theoretical Biology, 223, 135â\u0080\u0093147.\n\\bibitem{BradySlade2004} Brady MJ., Slade, NA,. 2004. Long-term dynamics of a grassland rodent community. Journal of Mammalogy 85: 552-561.\n\\bibitem{Bronstein2009} Bronstein, JL. 2009. The evolution of facilitation and mutualism Journal of Ecology 97, 1160â\u0080\u00931170\n\n\n\n\n\\bibitem{Krause2009} Krause, J., Lusseau, D., James, R., 2009. Animal social networks: an introduction. Behav. Ecol. and Sociobiol. 63 (7): 967â\u0080\u0093973\n\n\n\n\\bibitem{Geijzendorffer2011} Geijzendorffer, IR., van der Werf, W., Bianchi, F.J.J.A. and Schulte, R.P.O.  2011. Sustained dynamic transience in a Lotkaâ\u0080\u0093Volterra competition model system for grassland species.  Ecological Modelling 222: 2817-2824.\n\n\n\n\\bibitem{Reed08} Reed, AW., Slade, NA. 2008. Density-dependent recruitment in grassland small mammals. Journal of Animal Ecology 77:57-65.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibitem{WolfBrodieMoore1999} Wolf, JB., Brodie, E.D., Moore, A.J. 1999. Interacting phenotypes and the evolutionary process. II. Selection resulting from social interactions. The American Naturalist, 153, 254â\u0080\u0093266.\n\n\\bibitem{Wu2012} Wu, L., Liu, S., Wang, Y.  2012. Grey Lotkaâ\u0080\u0093Volterra model and its application Technological  Forecasting \\& Social Change 79 1720â\u0080\u00931730\n\n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 3035, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract}\\noindent\nAlthough social network analysis is a promising tool to study the structure and dynamics of wildlife communities, the current methods require costly and detailed network data, which often are not available over long time periods (e.g. decades). The present work aims to resolve this issue by developing a new methodology that requires much less detailed data and it relies on well-established Lotka-Volterra models. Using the long-term abundance data (1973-2003) of northeastern Kansas rodents,  the changes in the magnitude and direction of interactions (e.g., changes from cooperative behavior to competitive behavior or changes in the magnitude of competition) are quantified.\n\\end{abstract}\n\n\\begin{keywords}\n Wildlife Community, Lotka-Volterra Modeling, Social Network Analysis\n\\end{keywords}\n\n\n\n\n\\section{Introduction}\n\nMeasuring the long-term changes in population interactions can provide valuable information about the ecology and evolution of wildlife communities. These measures can explain, for example, the coexistence of superior and inferior species in a network of competitors \\cite{AllesinaLevine2011}, evolution of competitive interactions \\cite{BowlesChoiHopfensitz2003, WolfBrodieMoore1999} and co-evolution of cooperative interactions \\cite{Bronstein2009}.  The social network analysis has been frequently used to unpack complex network relationships and to measure the strength links of population interactions \\cite{Bascompte2009, Krause2009}. Despite being a promising tool, the network analysis often requires fully detailed data (e.g., GPS data, radio-tracking and captureâ\u0080\u0093markâ\u0080\u0093recapture data), which is not available for long periods of time (e.g., decades).  Lack of long-term detailed data is a major issue to measure population interactions via network analysis.  A potential solution to this problem is the use of Lotka-Volterra (LV) models, which require much less detailed data (e.g.,  the abundance data of interacting species) to specify the wildlife networks and detect the variations. This approach has the potential to elucidate the presence, magnitude, and variability of competition and other modes of interactions such as facilitation and commensalism.  Recent studies \\cite{Geijzendorffer2011, Wu2012} have used empirical data to estimate and monitor the temporal variations in the parameter values of LV models.  Nevertheless, these studies employ indirect linear methods, which can significantly impact the accuracy of model fitting. For instance, the gray LV modeling approach proposed in \\cite{Wu2012} relies on a linear programming technique for parameter estimation and model selection. The present work develops a new methodology that will detect and characterize the temporal cycles of population interactions by direct LV model selection and specification. \n\\section{Method}\nThe description of data is available in \\cite{BradySlade2004, Reed08}. The competitive LV model of five rodent species residing in northeastern Kansas is given by  \n\n", "index": 1, "text": "\\begin{equation} \\label{LV}\n\\displaystyle \\frac{dy_i(t)}{dt} = y_i(t)(a_i-b_iy_1(t)-c_iy_2(t)-d_iy_3(t)-e_iy_4(t)-f_iy_5(t)),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\frac{dy_{i}(t)}{dt}=y_{i}(t)(a_{i}-b_{i}y_{1}(t)-c_{i}y_{2}(t)-d%&#10;_{i}y_{3}(t)-e_{i}y_{4}(t)-f_{i}y_{5}(t)),\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>y</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><msub><mi>y</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>a</mi><mi>i</mi></msub><mo>-</mo><mrow><msub><mi>b</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mn>2</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>d</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mn>3</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>e</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mn>4</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>y</mi><mn>5</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]