[{"file": "1601.03344.tex", "nexttext": "\n\\noindent\nwhere $R_c$ is the radius of curvature of the upper mirror and $L \\ll R_c$ is assumed. $R_c$ was determined by fitting a circular segment to the profile of the optical cavity, as measured by optical profilometry (ZYGO MetroPro). The 100 $\\mu$m buckled-dome cavity has a peak height of $\\delta$ = 2.67 $\\mu$m, a total cavity length of $L$ = 3.26 $\\mu$m, and a radius of curvature of $R_c$ = 210 $\\pm$ 15  $\\mu$m. Eq.~\\ref{eqn_2} then produces a mode waist of $w_0 \\approx$ 2.55 $\\mu$m, implying that $V_m \\approx$ 35$\\lambda^3$. This matches well with COMSOL simulations that yield a mode volume of 35.7$\\lambda^3$. Similar values have been reported for other visible-wavelength optical cavities. \\cite{Vahala2003,Muller2010,Dolan2010,Greuter2014} \n\n\\begin{figure}[b]\n\t\\includegraphics[width=8.5cm]{Figure3.pdf}\n\t\\caption{(a) Fits of the experimental resonance peaks for the fundamental mode of a 100 $\\mu$m diameter dome, at temperatures from 292 K (blue, 776.4 nm) to 310 K (red, 780.6 nm) in 1 K increments. (b) The variation of the fundamental resonance wavelength with temperature. Orange circles are experimental data points, and the grey line is a linear fit yielding a thermal tunability of $\\Delta \\lambda/\\Delta T$ = 0.2346 $\\pm$ 0.0007 nm/K.}\n\t\\label{fig_4}\n\\end{figure}\n\nFor a Fabry-P\\'erot device to be considered viable for cQED applications, it should allow for practical tuning and stabilization of the resonance conditions. We have previously reported thermal tuning of the buckled-dome microcavities. \\cite{Bitarafan2015b} Here samples were attached to a copper heat sink in a vacuum chamber at $\\sim$5 mTorr, and the temperature was regulated by a proportional-integral-derivative controller. Transmission spectroscopy was performed in one degree intervals, as seen in Figure 3. The peak wavelength of the fundamental mode was tracked as a function of temperature, revealing a temperature dependence of $\\Delta \\lambda/\\Delta T$ = 0.2346 $\\pm$ 0.0007 nm/K. This tunability is vital because the stochastic nature of the buckling process produces cavities of varying resonance frequencies that must be drawn into resonance with the desired atomic transition. By heating the chip of microcavities, thermal expansion increases the cavity length sufficiently to align the optical resonance with the desired $^{87}$Rb transition at 308 K. The cavity wavelength could then, in principal, be locked to an atomic transition.  One drawback of the current method of tuning is the inability to tune individual cavities, however integrating heater electrodes\\cite{Zalalutdinov2003} or electrostatic actuation\\cite{Derntl2014} would allow for individually addressable on-chip microcavities.\n\nAnother requirement of a cQED device is that it should have open-access for injection of atoms into the cavity. The buckling self-assembly process inherently produces closed cavities, but can be modified or supplemented to provide open-access. One strategy is to couple the microcavities to hollow channels by patterning narrow strips of fluorocarbon that buckle along with the domes and intersect the microcavity.  A representative, $60$ $\\mu$m wide, channel is shown in Figure 4a. This channel has a peak height of 2.7 $\\mu$m, providing access for atomic gas injection. Previous work has demonstrated that mirror spacings as narrow as 110 nm were sufficient for atom injection,  \\cite{Hood2001} and recent work has demonstrated vapor cells with critical dimensions as narrow as 30 nm. \\cite{Whittaker2015} In addition, since these hollow channels are formed by two Bragg reflectors, they can also act as optical waveguides, possibly useful for atom trapping. \n\\cite{Melnyk2015}  A second strategy for open access is to use focused ion beam (FIB) milling to remove small portions of the top Bragg reflector. Figure 4c shows an example of an access hole milled into a buckled-dome cavity.  \n\nWe found that the properties of the fundamental microcavity resonance were retained in the case of intersecting waveguides (see Figure 4b) likely because the optical mode-waist is small compared to the dome diameter. Thus, modifications of the dome periphery has minimal impact on the central part of the dome where the fundamental mode resides. However, we found that FIB milling resulted in microcavities with optical resonances that exhibit non-linear behavior (see Figure 4d), even at low input powers. This may be a result of the conductive carbon layer applied in order to avoid charging, or parasitic gallium implantation, during the FIB milling process.\n\n\\begin{figure}[t]\n\t\\includegraphics[width=7.5cm]{Figure4.pdf}\n\t\\caption{(a) Microscope image of a buckled-dome microcavity with a base diameter of 200 $\\mu$m intersected by a 60 $\\mu$m hollow channel. Inset is a 3D cartoon illustrating how the channel intersects the dome, to provide open access to the interior of the optical cavity. (b) Transmission spectra of the fundamental optical mode of dome cavity shown in (a). (c) SEM image of a 30 $\\mu$m x 5 $\\mu$m hole cut through the top mirror of a dome cavity via FIB milling. The open cavity is visible through the hole, as well as the distinct layers of the Bragg reflector. The cavity is outlined to improve visibility. (d) Transmission spectra and (e) image of the fundamental mode of the cavity shown in (c).  }\n\t\\label{fig_5}\n\\end{figure}\n\nFinally we consider some pertinent parameters for cQED applications: the atom-cavity coupling rate $g_0$, and the cavity decay rate $\\kappa$. For a cavity with resonance frequency $\\omega$, and a single atom located at the maxima of the cavity field, $g_0$ is defined as\n\n", "itemtype": "equation", "pos": 9415, "prevtext": "\n\n\n\\title{Tunable open-access microcavities for on-chip cQED}\n\n\\author{C.A. Potts}\n\\affiliation{ECE Department, University of Alberta, T6G 2V4, Edmonton, AB, Canada}\n\\affiliation{Department of Physics, University of Alberta, T6G 2E1 Edmonton, AB, Canada}\n\\author{A. Melnyk}\n\\affiliation{ECE Department, University of Alberta, T6G 2V4, Edmonton, AB, Canada}\n\\author{H. Ramp}\n\\affiliation{Department of Physics, University of Alberta, T6G 2E1 Edmonton, AB, Canada}\n\\author{M.H. Bitarafan}\n\\affiliation{ECE Department, University of Alberta, T6G 2V4, Edmonton, AB, Canada}\n\\author{D. Vick}\n\\affiliation{National Institute for Nanotechnology, T6G 2M9, Edmonton, AB, Canada}\n\\author{L.J. LeBlanc}\n\\affiliation{Department of Physics, University of Alberta, T6G 2E1 Edmonton, AB, Canada}\n\\affiliation{Canadian Institute for Advanced Research, Toronto, M5G 1Z8 Canada}\n\\author{J.P Davis}\n\\email[]{jdavis@ualberta.ca}\n\\affiliation{Department of Physics, University of Alberta, T6G 2E1 Edmonton, AB, Canada}\n\\author{R.G. DeCorby}\n\\email[]{rdecorby@ualberta.ca}\n\\affiliation{ECE Department, University of Alberta, T6G 2V4, Edmonton, AB, Canada}\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\nWe report on the development of on-chip microcavities and show their potential as a platform for cavity quantum electrodynamics experiments. Microcavity arrays were formed by the controlled buckling of SiO$_2$/Ta$_2$O$_5$ Bragg mirrors, and exhibit a reflectance-limited finesse of 3500 and mode volumes as small as 35$\\lambda^3$.   We show that the cavity resonance can be thermally tuned into alignment with the D2 transition of $^{87}$Rb, and outline two methods for providing atom access to the cavity.  Owing to their small mode volume and high finesse, these cavities exhibit single-atom cooperativities as high as $C_1 = 65$. A unique feature of the buckled-dome architecture is that the strong-coupling parameter $g_0/\\kappa$ is nearly independent of the cavity size. Furthermore, strong coupling should be achievable with only modest improvements in mirror reflectance, suggesting that these monolithic devices could provide a robust and scalable solution to the engineering of light-matter interfaces.\n\\end{abstract}\n\n\\maketitle\nThe implementation of a distributed quantum network could enable a global quantum communication system,\\cite{Kimble2008,VanEnk1997} distributed quantum computation,\\cite{Cirac1997} distribution of quantum entanglement,\\cite{Duan2001} and may even provide a global time standard by embedding atomic clocks at quantum nodes.\\cite{Komar2014}  To realize these objectives, coherent control of individual quantum states, and their interactions, is required.  Since photons - the prototypical distributed qubit - exhibit no interactions with themselves in vacuum, \\cite{Chang2014} matter systems must act as intermediaries to perform quantum-state operations, \\cite{Reiserer2014} serve as quantum memories,\\cite{Lvovsky2009} and interface with quantum processors.\\cite{Petrosyan2009}\n\nNumerous systems have been investigated as quantum light-matter interfaces including phonons in optomechanical devices, \\cite{Palomaki2013,Bochmann2013} rare-earth-ion doped crystals,\\cite{Zhong2015,Saglamyurek2015} nitrogen vacancies in diamond,\\cite{Faraon2011,Li2014,Burkard2014} quantum dots,\\cite{Press2008,Greve2012} and alkali gases such as rubidium \\cite{Wilk2007,Petrosyan2009} and cesium. \\cite{Duan2003} Of particular interest are single alkali-atoms trapped within high-finesse optical cavities, in the context of cavity quantum electrodynamics (cQED). \\cite{Walther2006,Mabuchi2002}  Within the past decade, single atoms trapped in cavities have been used to store quantum information, \\cite{Specht2011,Nolleke2013,Kalb2015} produce on-demand single photons, \\cite{McKeever2004,Mucke2013} perform quantum gate operations, \\cite{Reiserer2013,Reiserer2014} and to implement an elementary quantum network. \\cite{Ritter2012} These works place single-atom quantum systems as a leading candidate for use in large-scale quantum networks.  \n\nAs a result, there is a strong interest in the integration of alkali atoms into robust, scalable, packaged optical cavities.\\cite{Biedermann2010,Derntl2014}  Furthermore, it is desirable for these optical cavities to have small mode volumes and be tunable to atomic transitions.\\cite{Trupke2007,Greuter2014,Flatten2015}  Here we report the development of `buckled-dome' Fabry-P\\'{e}rot microcavities designed for cQED applications, specifically on-chip coupling between single photons and single rubidium atoms.  These cavities produce high single-atom cooperativities, can be easily tuned to atomic transitions, and can facilitate open-access for incorporation of atoms.\n\n\\begin{figure}[b]\n\t\\includegraphics[width=8.5cm]{Figure1.pdf}\n\t\\caption{(a) Microscope image of a buckled-dome microcavity with base diameter of 100 $\\mu$m. White-light interference rings demonstrate the high degree of cylindrical symmetry attained through the self-assembly process. (b) Cross-section of a finite element model of a 100 $\\mu$m diameter microcavity (horizontal and vertical axes different scales) showing alternating SiO$_2$ (grey) and Ta$_2$O$_5$ (white) layers of the Bragg reflectors and a simulated optical mode.}\n\t\\label{fig_1}\n\\end{figure}\n\nThe buckled-dome microcavities were fabricated via a monolithic self-assembly procedure. \\cite{Epp2010,Allen2011} First, a distributed Bragg reflector (10.5 periods SiO$_2$/Ta$_2$O$_5$, starting and ending with Ta$_2$O$_5$) was deposited on a fused silica substrate by reactive magnetron sputtering. Microcavities were defined by the lithographic patterning of a thin ($\\sim$15 nm) low-adhesion fluorocarbon layer, followed by the deposition of a second Bragg reflector identical to the initial reflector. Films with low loss and high compressive stress ($\\sim$200 MPa) were realized by using high target power (200 W), elevated substrate temperature ($150\\,^{\\circ}$C), and low chamber pressure (4 mTorr). \\cite{Hoffman1994} Optical constants for single films were measured using an ellipsometer. The refractive indices of SiO$_2$ and Ta$_2$O$_5$ were estimated to be 1.49 and 2.14 respectively, at a wavelength of 780 nm. At the same wavelength, extinction coefficients less than 10$^{-6}$ were estimated for both materials. The layer thicknesses were chosen such that all layers are nominally one quarter wavelength thick ($\\lambda_0$/$4n$) at the D2 transition of $^{87}$Rb ($\\lambda_0$ = 780.24 nm).\\cite{Steck2003} Using a transfer matrix formalism,\\cite{Hecht1987}  and the optical constants extracted from measurements on single films, a peak reflectance of $ 0.9991$ is predicted for the Bragg mirrors, corresponding to a reflection-limited cavity finesse of $\\mathcal{F}$ = 3500.\n\nFollowing the deposition of the top mirror, the samples were heated (400$\\,^\\circ$C) to induce a loss of adhesion between the two mirrors in the region of the fluorocarbon layer. The built-in compressive stress drives the release of the top mirror, forming a dome-like buckle. The height and exact morphology is dependent on the dome diameter.\\cite{Allen2011,Bitarafan2015}  In this work microcavities with base diameters of 100 $\\mu$m to 300 $\\mu$m, Figure 1, and peak heights of $\\delta = 2.5$ $\\mu$m to 10 $\\mu$m were studied. We describe in detail the 100 $\\mu$m diameter cavities, and show select results for larger devices.  \n\n\\begin{figure}\n\t\\includegraphics[width=8.5cm]{Figure2.pdf}\n\t\\caption{Transmission spectrum for a 100 $\\mu$m diameter buckled-dome microcavity, with an optical cavity height of 2.67 $\\mu$m.  The inset shows the fundamental mode resonance in greater detail, with a Lorentzian fit showing a full-width at half-maximum of 27 pm, corresponding to $\\kappa = 2\\pi \\times 6.7$ GHz, and an image of the fundamental mode.}\n\t\\label{fig_2}\n\\end{figure}\n\nOptical resonances were examined by performing transmission spectroscopy using a fiber-coupled tunable diode laser (New Focus Velocity TLB6712), focused onto the microcavity using an objective lens ($50\\times$ Mitutoyo Plan APO). Transmitted light was captured using a second objective lens ($100\\times$ Mitutoyo Plan APO SL) and focused onto a photodiode (ThorLabs DET36A).  A typical wavelength sweep is shown in Figure 2, revealing resonances associated with the fundamental TEM$_{00}$ mode (at 777.80 nm) and three higher-order transverse modes. A digital camera was used to verify the profiles of these Laguerre-Gaussian modes. The fundamental mode was fit to a Lorentzian, revealing linewidths of $\\kappa = 2\\pi \\times 2.7$ GHz for 300 $\\mu$m diameter cavities and $\\kappa = 2\\pi \\times 6.7$ GHz for 100 $\\mu$m diameter cavities. Using the relation \\cite{Hunger2010} $\\kappa = \\pi c/2L\\mathcal{F}$, an estimate of the finesse may be made, where the effective cavity length is $L = \\delta + 2d_p$, the geometric cavity length is $\\delta$, and the penetration depth into the mirrors \\cite{Hood2001}  is $d_p \\approx (\\lambda_0/2)(n_H-n_L)^{-1}$. For the case shown in Figure 2, this yields a finesse of $\\mathcal{F} = 3560$, in good agreement with the predicted value.\n\nThe volume of the fundamental Gaussian mode of a Fabry-P\\'erot cavity can be approximated as \\cite{Hunger2010} $V_m = (\\pi/4)w_0^2L$,  where $w_0$ is the mode waist (radius).  In the paraxial approximation for a half-symmetric Fabry-P\\'erot cavity, the mode waist can be approximated as \\cite{Hunger2010}\n\n", "index": 1, "text": "\\begin{equation}\nw_0 \\approx \\sqrt{\\frac{\\lambda}{\\pi}}(R_c \\times L)^{1/4},\n\\label{eqn_2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"w_{0}\\approx\\sqrt{\\frac{\\lambda}{\\pi}}(R_{c}\\times L)^{1/4},\" display=\"block\"><mrow><mrow><msub><mi>w</mi><mn>0</mn></msub><mo>≈</mo><mrow><msqrt><mfrac><mi>λ</mi><mi>π</mi></mfrac></msqrt><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mi>c</mi></msub><mo>×</mo><mi>L</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>4</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03344.tex", "nexttext": "\n\\noindent\nwhere $\\gamma$ is the half-width at half-maximum linewidth of the excited state of the atom ($\\gamma = 2\\pi \\times 3.0$ MHz for $^{87}$Rb), and $V_m$ is the optical mode volume. To maximize $g_0$, the mode volume must be minimized. A mode volume of 35$\\lambda^3$ results in a coherent atom-cavity coupling rate of $g_0 = 2\\pi \\times 1.12$ GHz, greater than the most optimistic predictions for macroscopic Fabry-P\\'erot cavities, \\cite{Hood2001} and among the highest reported to date in the literature. \\cite{Hunger2010}\n\n\\begin{figure}[t]\n\t\\includegraphics[width=8.0cm]{Figure5.pdf}\n\t\\caption{(a) Strong coupling parameter, $g_0/\\kappa$, as a function of dome diameter. Fit (grey dashed line) derived using cavity finesse and optical profilometry measurements of dome height and radius of curvature. Deviations from the predicted zero-slope behavior are a result of the divergence from the elastic buckling model, producing a non-linear dependence between the radius of curvature and the dome diameter. \\cite{Bitarafan2015} (b) Experimental cooperativity as a function of dome diameter.  Fit as described in (a). Error bars, from the statistical uncertainty in $\\kappa$ and measurement uncertainty in $R_c$, are smaller than the symbol size.}\n\t\\label{fig_3}\n\\end{figure}\n\nDespite the high atom-cavity coupling rate, a more relevant figure of merit for cQED applications is the strong coupling parameter $g_0/\\kappa$. \\cite{Hood1998} The cavities described here exhibit $g_0/\\kappa \\leq 0.17$ placing them in the weakly coupled regime of cQED, which as outlined below could reasonably be improved.  Nonetheless, it is informative to consider the dependence of this ratio on the diameter of the buckled-dome cavity. From above it can be seen that\n\n", "itemtype": "equation", "pos": 15149, "prevtext": "\n\\noindent\nwhere $R_c$ is the radius of curvature of the upper mirror and $L \\ll R_c$ is assumed. $R_c$ was determined by fitting a circular segment to the profile of the optical cavity, as measured by optical profilometry (ZYGO MetroPro). The 100 $\\mu$m buckled-dome cavity has a peak height of $\\delta$ = 2.67 $\\mu$m, a total cavity length of $L$ = 3.26 $\\mu$m, and a radius of curvature of $R_c$ = 210 $\\pm$ 15  $\\mu$m. Eq.~\\ref{eqn_2} then produces a mode waist of $w_0 \\approx$ 2.55 $\\mu$m, implying that $V_m \\approx$ 35$\\lambda^3$. This matches well with COMSOL simulations that yield a mode volume of 35.7$\\lambda^3$. Similar values have been reported for other visible-wavelength optical cavities. \\cite{Vahala2003,Muller2010,Dolan2010,Greuter2014} \n\n\\begin{figure}[b]\n\t\\includegraphics[width=8.5cm]{Figure3.pdf}\n\t\\caption{(a) Fits of the experimental resonance peaks for the fundamental mode of a 100 $\\mu$m diameter dome, at temperatures from 292 K (blue, 776.4 nm) to 310 K (red, 780.6 nm) in 1 K increments. (b) The variation of the fundamental resonance wavelength with temperature. Orange circles are experimental data points, and the grey line is a linear fit yielding a thermal tunability of $\\Delta \\lambda/\\Delta T$ = 0.2346 $\\pm$ 0.0007 nm/K.}\n\t\\label{fig_4}\n\\end{figure}\n\nFor a Fabry-P\\'erot device to be considered viable for cQED applications, it should allow for practical tuning and stabilization of the resonance conditions. We have previously reported thermal tuning of the buckled-dome microcavities. \\cite{Bitarafan2015b} Here samples were attached to a copper heat sink in a vacuum chamber at $\\sim$5 mTorr, and the temperature was regulated by a proportional-integral-derivative controller. Transmission spectroscopy was performed in one degree intervals, as seen in Figure 3. The peak wavelength of the fundamental mode was tracked as a function of temperature, revealing a temperature dependence of $\\Delta \\lambda/\\Delta T$ = 0.2346 $\\pm$ 0.0007 nm/K. This tunability is vital because the stochastic nature of the buckling process produces cavities of varying resonance frequencies that must be drawn into resonance with the desired atomic transition. By heating the chip of microcavities, thermal expansion increases the cavity length sufficiently to align the optical resonance with the desired $^{87}$Rb transition at 308 K. The cavity wavelength could then, in principal, be locked to an atomic transition.  One drawback of the current method of tuning is the inability to tune individual cavities, however integrating heater electrodes\\cite{Zalalutdinov2003} or electrostatic actuation\\cite{Derntl2014} would allow for individually addressable on-chip microcavities.\n\nAnother requirement of a cQED device is that it should have open-access for injection of atoms into the cavity. The buckling self-assembly process inherently produces closed cavities, but can be modified or supplemented to provide open-access. One strategy is to couple the microcavities to hollow channels by patterning narrow strips of fluorocarbon that buckle along with the domes and intersect the microcavity.  A representative, $60$ $\\mu$m wide, channel is shown in Figure 4a. This channel has a peak height of 2.7 $\\mu$m, providing access for atomic gas injection. Previous work has demonstrated that mirror spacings as narrow as 110 nm were sufficient for atom injection,  \\cite{Hood2001} and recent work has demonstrated vapor cells with critical dimensions as narrow as 30 nm. \\cite{Whittaker2015} In addition, since these hollow channels are formed by two Bragg reflectors, they can also act as optical waveguides, possibly useful for atom trapping. \n\\cite{Melnyk2015}  A second strategy for open access is to use focused ion beam (FIB) milling to remove small portions of the top Bragg reflector. Figure 4c shows an example of an access hole milled into a buckled-dome cavity.  \n\nWe found that the properties of the fundamental microcavity resonance were retained in the case of intersecting waveguides (see Figure 4b) likely because the optical mode-waist is small compared to the dome diameter. Thus, modifications of the dome periphery has minimal impact on the central part of the dome where the fundamental mode resides. However, we found that FIB milling resulted in microcavities with optical resonances that exhibit non-linear behavior (see Figure 4d), even at low input powers. This may be a result of the conductive carbon layer applied in order to avoid charging, or parasitic gallium implantation, during the FIB milling process.\n\n\\begin{figure}[t]\n\t\\includegraphics[width=7.5cm]{Figure4.pdf}\n\t\\caption{(a) Microscope image of a buckled-dome microcavity with a base diameter of 200 $\\mu$m intersected by a 60 $\\mu$m hollow channel. Inset is a 3D cartoon illustrating how the channel intersects the dome, to provide open access to the interior of the optical cavity. (b) Transmission spectra of the fundamental optical mode of dome cavity shown in (a). (c) SEM image of a 30 $\\mu$m x 5 $\\mu$m hole cut through the top mirror of a dome cavity via FIB milling. The open cavity is visible through the hole, as well as the distinct layers of the Bragg reflector. The cavity is outlined to improve visibility. (d) Transmission spectra and (e) image of the fundamental mode of the cavity shown in (c).  }\n\t\\label{fig_5}\n\\end{figure}\n\nFinally we consider some pertinent parameters for cQED applications: the atom-cavity coupling rate $g_0$, and the cavity decay rate $\\kappa$. For a cavity with resonance frequency $\\omega$, and a single atom located at the maxima of the cavity field, $g_0$ is defined as\n\n", "index": 3, "text": "\\begin{equation}\ng_0 = \\sqrt{\\frac{3\\lambda^2c\\gamma}{4\\pi V_m}},\n\\label{eqn_1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"g_{0}=\\sqrt{\\frac{3\\lambda^{2}c\\gamma}{4\\pi V_{m}}},\" display=\"block\"><mrow><mrow><msub><mi>g</mi><mn>0</mn></msub><mo>=</mo><msqrt><mfrac><mrow><mn>3</mn><mo>⁢</mo><msup><mi>λ</mi><mn>2</mn></msup><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>γ</mi></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>V</mi><mi>m</mi></msub></mrow></mfrac></msqrt></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03344.tex", "nexttext": "\n\\noindent\nwhere $V_m \\propto R_c^{1/2}L^{3/2}$. Furthermore, it has been shown previously,\\cite{Allen2011} that based on elastic buckling mechanics $L \\propto D$, and to first order $R_c \\propto D$ (where $D$ is the buckled-dome diameter). Thus, Eq.~\\ref{eqn_3} predicts  ${g_0}/{\\kappa} \\propto {D}/{\\sqrt{D^2}}$.  That is, to first order the strong coupling parameter is independent of the buckled-dome diameter.  Experimentally we observe a slight increase in the strong coupling parameter with \\textit{decreasing} dome diameter, as shown in Figure 5a. This behavior is in contrast to the typical trend of an improving strong coupling parameter with \\textit{increasing} cavity length. \\cite{Hunger2010} \n\nThe ability to maintain a constant strong coupling parameter while decreasing the mode volume is important for another key figure of merit of cQED, $C_1$, known as the single-atom cooperativity, which we define following Law \\textit{et al.}\\cite{Law1997} as\n\n", "itemtype": "equation", "pos": 17000, "prevtext": "\n\\noindent\nwhere $\\gamma$ is the half-width at half-maximum linewidth of the excited state of the atom ($\\gamma = 2\\pi \\times 3.0$ MHz for $^{87}$Rb), and $V_m$ is the optical mode volume. To maximize $g_0$, the mode volume must be minimized. A mode volume of 35$\\lambda^3$ results in a coherent atom-cavity coupling rate of $g_0 = 2\\pi \\times 1.12$ GHz, greater than the most optimistic predictions for macroscopic Fabry-P\\'erot cavities, \\cite{Hood2001} and among the highest reported to date in the literature. \\cite{Hunger2010}\n\n\\begin{figure}[t]\n\t\\includegraphics[width=8.0cm]{Figure5.pdf}\n\t\\caption{(a) Strong coupling parameter, $g_0/\\kappa$, as a function of dome diameter. Fit (grey dashed line) derived using cavity finesse and optical profilometry measurements of dome height and radius of curvature. Deviations from the predicted zero-slope behavior are a result of the divergence from the elastic buckling model, producing a non-linear dependence between the radius of curvature and the dome diameter. \\cite{Bitarafan2015} (b) Experimental cooperativity as a function of dome diameter.  Fit as described in (a). Error bars, from the statistical uncertainty in $\\kappa$ and measurement uncertainty in $R_c$, are smaller than the symbol size.}\n\t\\label{fig_3}\n\\end{figure}\n\nDespite the high atom-cavity coupling rate, a more relevant figure of merit for cQED applications is the strong coupling parameter $g_0/\\kappa$. \\cite{Hood1998} The cavities described here exhibit $g_0/\\kappa \\leq 0.17$ placing them in the weakly coupled regime of cQED, which as outlined below could reasonably be improved.  Nonetheless, it is informative to consider the dependence of this ratio on the diameter of the buckled-dome cavity. From above it can be seen that\n\n", "index": 5, "text": "\\begin{equation}\n\\frac{g_0}{\\kappa} \\propto   \\frac{L}{\\sqrt{V_m}},\n\\label{eqn_3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\frac{g_{0}}{\\kappa}\\propto\\frac{L}{\\sqrt{V_{m}}},\" display=\"block\"><mrow><mrow><mfrac><msub><mi>g</mi><mn>0</mn></msub><mi>κ</mi></mfrac><mo>∝</mo><mfrac><mi>L</mi><msqrt><msub><mi>V</mi><mi>m</mi></msub></msqrt></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03344.tex", "nexttext": "\n\\noindent\n$C_1$ is of particular interest for single-photon sources as it defines the Purcell factor; the probability of a spontaneously emitted photon entering the cavity mode is given by $2C_1/(2C_1+1)$. It should be noted that both $\\kappa$ and $\\gamma$ are defined as the half-width at half-maximum. Given the parameters of the buckled-dome cavities, Eq.~\\ref{eqn_4} produces $C_1 = 65$ (Figure 5b).  For comparison, cooperativities as high as $C_1 = 290$ and $51$ have been reported for fiber-based cavities\\cite{Colombe2007} and macroscopic cavities, \\cite{Sauer2004} respectively.  \n\nIn conclusion, we have developed on-chip Fabry-P\\'erot microcavities specifically for cQED applications using alkali atoms, with tunable resonance frequencies and open-access for atom inclusion. Despite only moderate atom-photon coupling ($g_0/\\kappa = 0.17$), high single-atom cooperativity ($C_1 = 65$) provides strong motivation for further investigation and optimization. The results presented in this letter were obtained with ten-period Bragg reflectors, producing reflection limited finesse cavities with $\\mathcal{F} = 3560$. Increasing the number of periods would increase reflectance, and macroscopic cavities using the same materials have reported finesses as high as $\\mathcal{F}$ = 480,000. \\cite{Hood2001} In order to achieve strong coupling ($g_0/\\kappa \\geq 1$) with our buckled-dome Fabry-P\\'erot cavities, a finesse of $\\mathcal{F} \\geq$ 21,000 would be required. This is modest compared to finesse requirements predicted for other optical cavity architectures. \\cite{Ritter2012,Hunger2010,Mabuchi1999} Furthermore, improvement of the finesse to this level would have the benefit of increasing $C_1$ as high as 420, making it among the highest cooperativity architectures available.  \n\nWe are grateful for the support of Alberta Innovates Technology Futures (Strategic Chair \\& iCiNano); the University of Alberta Faculty of Science; Natural Sciences and Engineering Research Council, Canada (RGPIN 401918 \\& EQPEG 458523); the Canada Foundation for Innovation; and the Alfred P. Sloan Foundation. LJL acknowledges that this research was undertaken, in part, thanks to funding from the Canada Research Chairs program.\n\n\\begin{thebibliography}{99}\n\n\\bibitem{Kimble2008}\nH.J. Kimble, {Nature} \\textbf{453}, 1023 (2008).\n\n\\bibitem{VanEnk1997}\nS.J. Van Enk, J.I. Cirac, P. Zoller, H.J. Kimble and H. Mabuchi, {J. Mod. Opt.} \\textbf{44}, 1727 (1997).\n\n\\bibitem{Cirac1997}\nJ.I. Cirac, P. Zoller, H.J. Kimble and H. Mabuchi, {Phys. Rev. Lett.} \\textbf{78}, 3221 (1997).\n\n\\bibitem{Duan2001}\nL.M. Duan, M.D. Lukin, J.I. Cirac and P. Zoller, {Nature} \\textbf{414}, 413 (2001).\n\n\\bibitem{Komar2014}\nP. K\\'om\\'ar, E.M. Kessler, M. Bishof, L. Jiang, A.S. S\\o rensen, J. Ye and M.D. Lukin, {Nat. Phys.} \\textbf{10}, 582 (2014).\n\n\n\n\n\n\\bibitem{Chang2014}\nD.E. Chang, V. Vuleti\\'c and M.D. Lukin, {Nat. Photon.} \\textbf{8}, 685 (2014).\n\n\\bibitem{Reiserer2014}\nA. Reiserer, N. Kalb, G. Rempe and S. Ritter, {Nature} \\textbf{508}, 237 (2014).\n\n\\bibitem{Lvovsky2009}\nA.I. Lvovsky, B.C. Sanders and W. Tittel, {Nat. Photon.} \\textbf{3}, 706 (2009).\n\n\\bibitem{Petrosyan2009}\nD. Petrosyan, G. Bensky, G. Kurizki, I. Mazets, J. Majer and J. Schmiedmayer, {Phys. Rev. A} \\textbf{79}, 040304 (2009).\n\n\\bibitem{Bochmann2013}\nJ. Bochmann, A.Vainsencher, D.D. Awschalom and A.N. Cleland, {Nat. Phys.} \\textbf{9}, 712 (2013).\n\n\\bibitem{Palomaki2013}\nT.A. Palomaki, J.D. Teufel, R.W. Simmonds and K.W. Lehnert, {Science} \\textbf{342}, 710 (2013).\n\n\\bibitem{Zhong2015}\nT. Zhong, J.M. Kindem, E. Miyazono and A. Faraon, {Nat. Commun.} \\textbf{6}, 8206 (2015).\n\n\\bibitem{Saglamyurek2015}\nE. Saglamyurek, J. Jin, V.B. Verma, M.D. Shaw, F. Marsili, S.W. Nam, D. Oblak and W. Tittel, {Nat. Photon.} \\textbf{9}, 83 (2015).\n\n\\bibitem{Faraon2011}\nA. Faraon, P.E. Barclay, C. Santori, K.C. Fu and R.G. Beausoleil, {Nat. Photon.} \\textbf{5}, 301 (2011).\n\n\\bibitem{Li2014}\nL. Li,\tT. Schr\\\"oder, E.H. Chen, M. Walsh, I. Bayn, J. Goldstein, O. Gaathon, M.E. Trusheim, M. Lu, J. Mower, M. Cotlet, M.L. Markham, D.J. Twitchen and D. Englund, {Nat. Commun.} \\textbf{6}, 6173 (2014).\n\n\\bibitem{Burkard2014}\nG. Burkard and D.D. Awschalom, arXiv:1402.6351\n\n\\bibitem{Press2008}\nD. Press, T.D. Ladd, B. Zhang and Y. Yamamoto, {Nature} \\textbf{456}, 218 (2008).\n\n\\bibitem{Greve2012}\nK. De Greve, L. Yu, P.L. McMahon, J.S. Pelc, C.M. Natarajan, N.Y. Kim, E. Abe, S. Maier,\tC. Schneider,\tM. Kamp, S. H\\\"ofling, R.H. Hadfield, A. Forchel, M.M. Fejer and Y. Yamamoto, {Nature} \\textbf{491}, 421 (2012).\n\n\\bibitem{Wilk2007}\nT. Wilk, S.C. Webster, A. Kuhn and G. Rempe, {Science} \\textbf{317}, 5837 (2007).\n\n\\bibitem{Duan2003}\nL.M. Duan, A. Kuzmich and H. J. Kimble, {Phys. Rev. A} \\textbf{67}, 032305 (2003).\n\n\\bibitem{Walther2006}\nH. Walther, B.T.H. Varcoe, B. Englert and T. Becker, {Reports on Progress in Physics} \\textbf{69}, 5 (2006).\n\n\\bibitem{Mabuchi2002}\nH. Mabuchi and A.C. Doherty, {Science} \\textbf{298}, 5597 (2002).\n\n\\bibitem{Specht2011}\nH.P. Specht, C. N\\\"olleke, A. Reiserer, M. Uphoff, E. Figueroa, S. Ritter and G. Rempe, {Nature} \\textbf{473}, 190 (2011).\n\n\\bibitem{Nolleke2013}\nC. N\\\"olleke, A. Neuzner, A. Reiserer, C. Hahn, G. Rempe and S. Ritter, {Phys. Rev. Lett.} \\textbf{110}, 140403 (2013).\n\n\\bibitem{Kalb2015}\nN. Kalb, A. Reiserer, S. Ritter and G. Rempe, {Phys. Rev. Lett.} \\textbf{114}, 220501 (2015).\n\n\\bibitem{McKeever2004}\nJ. McKeever, A. Boca, A.D. Boozer, R. Miller, J.R. Buck, A. Kuzmich and H.J. Kimble, {Science} \\textbf{303}, 5666 (2004).\n\n\\bibitem{Mucke2013}\nM. M\\\"ucke, J. Bochmann, C. Hahn, A. Neuzner, C. N\\\"olleke, A. Reiserer, G. Rempe and S. Ritter, {Phys. Rev. A} \\textbf{87}, 063805 (2013).\n\n\\bibitem{Reiserer2013}\nA. Reiserer, S. Ritter and G. Rempe, {Science} \\textbf{342}, 6164 (2013).\n\n\\bibitem{Ritter2012}\nS. Ritter, C. N\\\"olleke, C. Hahn, A. Reiserer, A. Neuzner, M. Uphoff, M. M\\\"ucke, E. Figueroa, J. Bochmann and G. Rempe, Nature \\textbf{484}, 195 (2012).\n\n\\bibitem{Biedermann2010}\nG.W. Biedermann, F.M. Benito, K.M. Fortier, D.L. Stick, T. K. Loyd, P.D.D. Schwindt, C.Y. Nakakura, R.L. Jarecki Jr. and M.G. Blain, Appl. Phys. Lett. \\textbf{97}, 181110 (2010).\n\n\\bibitem{Derntl2014}\nC. Derntl, M. Schneider, J. Schalko, A. Bittner, J. Schmiedmayer, U. Schmid and M. Trupke, Optics Express \\textbf{22}, 18 (2014).\n\n\\bibitem{Trupke2007}\nM. Trupke, J. Goldwin, B. Darqui\\'e, G. Dutier, S. Eriksson, J. Ashmore and E. A. Hinds, Phys. Rev. Lett., \\textbf{99}, 063601 (2007).\n\n\\bibitem{Greuter2014}\nL. Greuter, S. Starosielec, D. Najer, A. Ludwig, L. Duempelmann, D. Rohner and R.J. Warburton, Appl. Phys. Lett. \\textbf{105}, 121105 (2014).\n\n\\bibitem{Flatten2015}\nL.C. Flatten, A.A.P. Trichet and J.M. Smith, Laser \\& Photon. Rev., 1Ð7 (2015).\n\n\\bibitem{Epp2010}\nE. Epp, N. Ponnampalam, W. Newman, B. Drobot, J.N. McMullin, A.F. Meldrum and R.G. DeCorby, Optics Express \\textbf{18}, 24 (2010).\n\n\\bibitem{Allen2011}\nT.W. Allen, J. Silverstone, N. Ponnampalam, T. Olsen, A. Meldrum and R.G. DeCorby, Optics Express \\textbf{19}, 20 (2011).\n\n\\bibitem{Hoffman1994}\nD.W. Hoffman, Journal of Vacuum Science and Technology A \\textbf{12}, 953 (1994).\n\n\\bibitem{Steck2003} \nD.A. Steck, {Rubidium 87 D Line Data} (2003).\n\n\\bibitem{Hecht1987}\nE. Hecht, Optics (Addison-Wesley Publishing, Reading, MA, 1987), pp. 373-375.\n\n\\bibitem{Bitarafan2015}\nM.H. Bitarafan, H. Ramp, T.W. Allen, C. Potts, X. Rojas, A.J.R. MacDonald, J.P. Davis and R.G. DeCorby, JOSA B \\textbf{32}, 6 (2015).\n\n\\bibitem{Hunger2010}\nD. Hunger, T. Steinmetz, Y. Colombe, C. Deutsch, T.W. H\\\"ansch and J. Reichel, New Journal of Physics \\textbf{12}, 065038 (2010).\n\n\\bibitem{Hood2001}\nC.J. Hood, H.J. Kimble and J. Ye, Physical Review A \\textbf{64}, 033804 (2001).\n\n\\bibitem{Vahala2003}\nK.J. Vahala, Nature \\textbf{424}, 839 (2003).\n\n\\bibitem{Muller2010}\nA. Muller, E.B. Flagg, J.R. Lawall and G.S. Solomon, Optics Lett. \\textbf{35}, 2293 (2010).\n\n\\bibitem{Dolan2010}\nP.R. Dolan, G.M. Hughes, F. Grazioso, B.R. Patton and J.M. Smith, Optics Lett. \\textbf{35}, 21 (2010).\n\n\\bibitem{Bitarafan2015b}\nM.H. Bitarafan, H. Ramp, C. Potts, T.W. Allen, J.P. Davis and R.G. DeCorby, Optics Lett. \\textbf{40}, 5375 (2015).\n\n\\bibitem{Zalalutdinov2003}\nM. Zalalutdinov, K.L. Aubin, R.B. Reichenbach, A.T. Zehnder, B. Houston, J.M. Parpia and Harold G. Craighead, Appl. Phys. Lett. \\textbf{83}, 3815 (2003).\n\n\\bibitem{Whittaker2015}\nK.A. Whittaker, J. Keaveney, I.G. Hughes, A. Sargsyan, D. Sarkisyan and C.S. Adams, Phys. Rev. A \\textbf{92} 052706 (2015).\n\n\\bibitem{Melnyk2015}\nA. Melnyk, C.A.Potts, T.W.Allen and R.G DeCorby, submitted (2015).\n\n\\bibitem{Hood1998}\nC.J. Hood, M.S. Chapman, T.W. Lynn and H.J. Kimble, {Phys. Rev. Lett.}, \\textbf{80}, 4157 (1998).\n\n\\bibitem{Law1997}\nC.K. Law and H.J. Kimble. J. Mod. Opt. \\textbf{44}, 2067 (1997).\n\n\\bibitem{Colombe2007} \nY. Colombe, T. Steinmetz, G. Dubois, F. Linke, D. Hunger and J. Reichel, Nature \\textbf{450}, 272 (2007).\n\n\\bibitem{Sauer2004}\nJ.A. Sauer, K.M. Fortier, M.S. Chang, C.D. Hamley, and M.S. Chapman, {Phys. Rev. A}, \\textbf{69}, 051804 (2004).\n\n\\bibitem{Mabuchi1999}\nH. Mabuchi, J. Ye, and H.J. Kimble, {Applied Physics B} \\textbf{68}, 6 (1999).\n\n\n\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 18063, "prevtext": "\n\\noindent\nwhere $V_m \\propto R_c^{1/2}L^{3/2}$. Furthermore, it has been shown previously,\\cite{Allen2011} that based on elastic buckling mechanics $L \\propto D$, and to first order $R_c \\propto D$ (where $D$ is the buckled-dome diameter). Thus, Eq.~\\ref{eqn_3} predicts  ${g_0}/{\\kappa} \\propto {D}/{\\sqrt{D^2}}$.  That is, to first order the strong coupling parameter is independent of the buckled-dome diameter.  Experimentally we observe a slight increase in the strong coupling parameter with \\textit{decreasing} dome diameter, as shown in Figure 5a. This behavior is in contrast to the typical trend of an improving strong coupling parameter with \\textit{increasing} cavity length. \\cite{Hunger2010} \n\nThe ability to maintain a constant strong coupling parameter while decreasing the mode volume is important for another key figure of merit of cQED, $C_1$, known as the single-atom cooperativity, which we define following Law \\textit{et al.}\\cite{Law1997} as\n\n", "index": 7, "text": "\\begin{equation}\nC_1 = \\frac{g_0^2}{\\kappa\\gamma}.\n\\label{eqn_4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"C_{1}=\\frac{g_{0}^{2}}{\\kappa\\gamma}.\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mn>1</mn></msub><mo>=</mo><mfrac><msubsup><mi>g</mi><mn>0</mn><mn>2</mn></msubsup><mrow><mi>κ</mi><mo>⁢</mo><mi>γ</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]