[{"file": "1601.05681.tex", "nexttext": "\nHere, $\\Delta = \\gamma \\left( \\mu_0 H_0 - \\mu_0 H_\\mathrm{res} \\right)$ is the spin-cavity detuning with $H_\\mathrm{res}$ statisfying the spin resonance condition for a given cavtiy frequency $\\omega_\\mathrm{c}$. \n\nIn ferromagnetic films, additional magnetic modes, so-called perpendicular standing spin waves modes, appear due to magnetic boundary conditions. For the condition where the magnetization is pinned at least at one surface of the film (and in the absence of any anisotropies or magnetic gradients) the magnon spectrum can easily be calculated\\cite{Kittel2005}. The difference of the resonance field of the $n$\\textsuperscript{th}-mode from the fundamental mode $H^n_\\mathrm{res}-H^1_\\mathrm{res}$ is proportional to $n^2$. \\citet{Cao2015} also calculated the expected coupling strength for different modes and found that the coupling decreases with increasing mode number as ${\\ensuremath{g_\\mathrm{eff}}} \\propto 1/n$. This can be understood when considering the microwave mode profiles and the fact that the spatial mode profile of the microwave field $H_1^0$ in a cavity is typically homogeneous and in phase throughout the thickness of the (thin film) sample. Therefore only every second mode can be excited and the effective magnetization to which the microwave can couple to is reduced to $\\frac M n$.\n\\subsection{Spin pumping and strong coupling}\nSpin pumping in ferromagnet/normal metal bilayers in the weak coupling regime is well understood\\cite{Tserkovnyak2002,Czeschka2011a,Mosendz2010}: An additional mechanism which damps the magnetization precession becomes available by spin pumping, as the precessing magnetisation is driving a spin current into the adjacent normal metal.\\cite{Tserkovnyak2002} In electrically detected spin pumping, this spin current is then converted into a charge current via the inverse spin Hall effect (ISHE). For electrical open circuit conditions, one thus obtains a voltage which scales as\\cite{Mosendz2010,Czeschka2011a} $V_\\mathrm{SP} \\propto g^{\\uparrow\\downarrow}\\lambda_\\mathrm{SD}\\tanh{\\frac{t_\\mathrm{N}}{2\\lambda_\\mathrm{SD}}}\\sin^2{\\theta}$. It, thus, contains information on the spin mixing conductance $g^{\\uparrow\\downarrow}$, the spin diffusion length $\\lambda_\\mathrm{SD}$, the magnetization precession cone angle $\\theta$ and depends on the thickness of the normal metal layer $t_\\mathrm{N}$. The maximal precession cone angle $\\theta$ and thus the maximal expected spin pumping voltage depends on the microwave power but also on the coupling strength between cavity and spin system. For strong coupling, the cone angle is expected to be reduced as compared to the weak coupling case due to the hybridized nature of the excitation at its maximal intensity.\n\nThe other contributions in the equation for $V_\\mathrm{SP}$ are material constants: The spin mixing conductance ${\\ensuremath{g^{\\uparrow\\downarrow}}}$ describes the the transparency of the ferromagnet/normal metal interface und limits the spin pumping efficiency generally; the spin diffusion length $\\lambda_\\mathrm{SD}$ in conjunction with the normal metal thickness $t_\\mathrm{N}$ accounts for a spin  accumulation in the normal metal and reduces the spin pumping efficiency if $t_\\mathrm{N} \\lessapprox \\lambda_\\mathrm{SD}$.\n\n\n\\section{Experimental details}\n\\label{sec:exp}\n\\begin{figure}\n\\includegraphics[width=0.4\\textwidth]{images/block}\n\\caption{ Block diagram of the experimental setup and sample mounting. \\textbf{(Inset)} Schematic of the coupling scheme illustrating cavity decay due to intrinsic losses viz. losses to the feedline $\\kappa_\\mathrm{c} = \\kappa_\\mathrm{i} + \\kappa_\\mathrm{e}$, spin system decay consisting of intrinsic damping and spin pumping damping $\\gamma_\\mathrm{i}= \\gamma_\\mathrm{s} + \\gamma_\\mathrm{sp}$ as well the collective coupling rate $g_\\mathrm{eff}$}\n\\label{fig:setup}\n\\end{figure}\n\n\\subsection{Sample preparation}\nIn our experiments we used YIG/Pt heterostructures grown by liquid phase epitaxy on (111)-oriented Gadolinum Gallium Garnet (GGG) substrates. The YIG film thickness was \\SI{2.8}{\\micro\\meter}. In order to produce a high quality interface between YIG and Pt, and thus a large spin mixing conductance  $g^{\\uparrow\\downarrow}$, we followed the work of \\citet{Jungfleisch2013} and first treated the YIG surface by piranha etching for 5~minutes in ambient conditions. Thereafter, the sample was annealed at \\SI{500}{\\celsius} for 40~minutes in an oxygen atmosphere of \\SI{25}{\\micro\\bar}. Under high vacuum, it was then transferred into an Electron Beam Evaporation (EVAP) chamber where \\SI{5}{\\nano\\meter} Pt was deposited. The exact Pt thickness was determined using X-Ray reflectometry.  However, we note that for our analysis the Pt layer thickness is of minor importance as it was consistently larger than the spin diffusion length $\\lambda_\\textrm{SD}$ of Pt such that the Pt layer simply serves as a perfect spin sink.\n\nIn order to achieve collective strong coupling between magnons and cavity photons, the number of magnetic moments must be sufficiently high. Therefore, we diced the sample into several pieces of different lateral dimensions. Magnetic resonance experiments in the strong coupling regime showed that the $\\sqrt{N}$ scaling of the coupling strength discussed in Section~\\ref{sec:theory} is indeed obeyed upon comparing samples with different volume and thus different total magnetic moment. In the following, we will focus on a sample with lateral dimensions \\SI{2x3}{\\milli\\meter} which, with the effective spin density $\\rho_\\textrm{S} = 2.1 \\times 10^{22}\\,\\frac{\\mu_\\mathrm{B}}{\\mathrm{cm}^3}$ of iron atoms in YIG\\cite{Gilleo1958}, contains on the order of $4\\times10^{17}$ spins. \nFinally, the sample was mounted on a PCB sample carrier and wire bonded as depicted in the inset of {Fig.~\\ref{fig:{setup}}}. The carrier itself was mounted on a sample rod which allowed the sample to be accurately positioned in the electrical field node of a Bruker Flexline MD5 dielectric ring cavity in an Oxford Instruments CF935 gas flow cryostat. Shielded DC cabling allowed for the measurement of the ISHE voltage. The detailed design blueprints of the sample rod and chip carrier can be retrieved online\\footnote{The designs of the sample holder are published under the CERN Open Hardware License \\texttt{http://hannes.maier-flaig.de/flexline-sample-rod}}.\n\n\\subsection{Experimental setup}\n\nThe Bruker cavity exhibits a TE$_{011}$ mode with an electric field node at the sample position. Its quality factor $Q = \\omega / \\Delta \\omega_\\mathrm{c}^\\mathrm{FWHM}$ ($\\Delta \\omega_\\mathrm{c}^\\mathrm{FWHM}$ being the full width half maximum line width of the cavity) is dominated by the dissipative losses in the dielectric and its finite electrical resistance ($\\kappa_\\mathrm{i}$) as well as radiation back into the cavity feed line ($\\kappa_\\mathrm{c}$). By changing the cavity's coupling ratio to the feed line, unloaded coupled quality factors $Q_\\mathrm{c}$ from 0 to 8000 can be achieved. This allows tuning in and out of the strong coupling regime easily. Using the gas flow cryostat, different temperatures can be stabilized. All the following experiments have, however, been performed at room temperature.\n\nTo measure ferromagnetic resonance (FMR) the cavity was connected to the port of an Agilent N5242A vector network analyzer (VNA). The driving power of $15$~dBm excites at maximum on the order of $N_\\mathrm{Ph} = 1.3\\times10^{14}$ photons in the cavity which is considerably smaller than the number of spins in the sample ($4\\times10^{17}$). In this case, the  theory presented in Sec.~\\ref{sec:theory}\\  is well justified\\cite{Chiorescu2010}. The frequency dependent cavity reflection $S_{11}$ was measured while sweeping the external field $\\mu_0 H$ that is created by a water cooled electromagnet. The IF bandwidth was chosen to be \\SI{100}{\\hertz} which leads to a frequency sweep time of approximately \\SI 2 \\second\\ for each magnetic field step. A calibration of the microwave leads up to the resonator's SMA connector was performed. The calibration did not include the feed line inside the resonator mount, which gave rise to a background signal in the reflection parameter. However, by utilizing the full complex S-parameter for the background subtraction with the inverse mapping technique outlined by \\citet{Petersan1998} and a subsequent Lorentzian fit to the magnitude, a reliable measurement of $Q$ is still possible, even for a completely uncalibrated setup. We note that even though standing waves in the mirowave feed line will not appear in the calibrated reflection measurement they will still change the total power in the cavity and therefore may complicate the electrically detected DC spin pumping signal. Uncalibrated measurements did not show sharp feed line resonances in the frequency range studied here but only smooth oscillations with an amplitude of less than \\SI{1}{\\decibel} and there was no correlation in the DC signal resolved. In order to fit the data and as it improves clarity, we only discuss calibrated measurements in the following.\n\nThe DC voltage from the sample was measured along the cavity axis and thus perpendicular to the external magnetic field and the sample normal. It was amplified with a differential voltage amplifier model 560 from Stanford Research Systems. The amplifier was operated in its low noise (4~nV/$\\sqrt{\\textrm{Hz}}$) mode and set to a gain of $2\\times 10^4$. The analog high-pass filter of the amplifier was disabled, however, a low-pass filter with a 6dB roll-off at \\SI{1}{kHz} was employed. Limiting the bandwidth of the amplifier by filtering is required in order to achieve a good signal-to-noise ratio. Care has, however, to be taken as the lineshape may be quickly distorted by inappropriate settings and thus the signature of spin pumping might be masked. High-pass filtering can easily lead to a dispersive like contribution to the signal, whereas low-pass filtering will give rise to asymmetric line shapes depending on the ratio of IF bandwidth and low-pass frequency. We made sure that no such distortions contribute to the presented measurements. The amplified voltage signal was finally recorded using the auxiliary input of the VNA simultaneously with the cavity reflection $S_{11}$.\n\n\\section{Results and discussion}\n\\label{sec:discuss}\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{images/posneg.pdf}\n\\caption{\\textbf{(a)} Reflection parameter $S_{11}$ recorded while sweeping the magnetic field. Strong coupling of the collective spin excitations is indicated by a clear anticrossing, spin wave modes to the low field side of the main resonance are visible. Black numbers indicated the spin wave mode number. \\textbf{(b)} Simultaneously recorded DC voltage. Fundamental and spin wave modes are visible where  the latter couple less strongly and thus pump spin current more efficiently. Insets: Detail of n=5 spin wave mode including the dispersion relation of the strong coupling between the fundamental FMR mode and the cavity as solid red line and the anti-crossing of this hybrid and the spin wave mode (\\#5) as white lines. }\n\\label{fig:posneg}\n\\end{figure}\n\nWe first focus on the case of the so-called critical coupling of the feed line to the cavity in which most FMR experiments are conducted. In this case, the internal loss rate of the cavity equals the loss rate to the feed line and the quality factor is $Q_\\mathrm{c} = Q_\\textrm{internal}/2$.\nNote that inserting a sample and holder into the cavity will reduce the cavity $Q$ by an amount which depends on the sample and holder details such as conductivity and dielectric losses. Based on our measured loaded $Q_\\mathrm{c}=706$, the cavity decay rate is calculated to be $\\kappa_\\mathrm c / 2 \\pi = \\frac{\\omega_\\mathrm{r}}{2\\pi} /2Q_\\mathrm{c} = \\SI{6.8}{\\mega\\hertz}$.\n\nStrong coupling of the magnon and cavity system manifests itself in a characteristic anti-crossing of the (magnetic field independent) cavity resonance frequency and the magnon dispersion that is (approximately) linear in magnetic field. This anti-crossing corresponding to two distinct peaks in a line cut at the resonance field, are immediately visible in the reflection spectrum in {Fig.~\\ref{fig:{posneg}}}. The minimal splitting gives the collective coupling strength $g_\\textrm{eff}/2\\pi = \\SI{31.8}{\\mega\\hertz}$ of the fundamental mode to the cavity. Taking into account the number of spins in the sample, the single spin coupling rate is on the order of $g_0/2\\pi=\\SI{0.1}{Hz}$ which is in agreement with experiments on paramagnetic systems\\cite{Abe2011}.\n\nIn our setup, even the coupling of higher order spin wave modes to the cavity can be resolved. We number the spin waves as noted in {Fig.~\\ref{fig:{posneg}}} taking into account that with an uniform driving  field only odd modes can be excited. Analysis of the resonance position of the spin wave modes reveals that $H^n_\\mathrm{res}-H^1_\\mathrm{res}$ in our sample is proportional to $n$ rather than $n^2$. This indicates a non-square like potential well.  Similarly, complicated mode splittings have been reported in literature\\cite{Goennenwein2003}. The lowest order spin wave mode that can be easily observed in our setup is shown in the inset of {Fig.~\\ref{fig:{posneg}}}~(a) in detail. It exhibits the largest effective coupling (\\SI{3}{\\mega\\hertz}) of all spin wave modes. The red and white lines in Fig.~\\ref{fig:posneg}~(a) correspond to the harmonic-oscillator model ({Eqn.~\\ref{eqn:{HO}}}) for the fundamental mode and the lowest order spin wave mode, respectively. As the spin wave couples to an already hybridized sytem, we superimposed the dispersion $\\omega_c = \\omega_r \\left( B \\right)$ of the hybridized system of fundamental mode and unperturbed cavity as the \"cavity\" mode in the modelling of the spin wave mode couplings.\n\nIn order to quantify the coupling strength of the higher order modes which only interact weakly with the hybridized cavity--fundamental FMR mode, we follow the approach of \\citet{Herskind2009}. For each field, we fit a Lorentzian to the magnitude of the cavity absorption. From this fit we extract the resonance frequency $\\omega_c$ and the half width half maximum of the absorption  $\\Delta \\omega$ which, in\nthe weakly coupled spin waves reads as\\cite{Herskind2009}\n", "itemtype": "equation", "pos": 10782, "prevtext": "\n\n\\title{Spin pumping in strongly coupled magnon-photon systems}\n\n\\author{H. Maier-Flaig$^{1,2 }$\\footnote{Electronic address: hannes.maier-flaig@wmi.badw.de}, M. Harder$^{3}$, R. Gross$^{1,2,4}$,  H. Huebl$^{1,2,4}$, S. T. B. Goennenwein$^{1,2,4}$}\n\n\\affiliation{$^{1}$ Walther-Mei\\ss ner-Institut, Bayerische Akademie der Wissenschaften, 85748 Garching, Germany}\n\\affiliation{$^{2}$ Physik-Department, Technische Universit\\\"{a}t M\\\"{u}nchen, 85748 Garching, Germany}\n\\affiliation{$^{3}$ Department of Physics and Astronomy, University of Manitoba, Winnipeg, Canada R3T 2N2}\n\\affiliation{$^{4}$ Nanosystems Initiative Munich, Schellingstra\\ss e 4, D-80799 M\\\"{u}nchen, Germany}\n\n\\date{\\today}\n\n\\begin{abstract}\n\nWe experimentally investigate magnon-polaritons, arising in ferrimagnetic resonance experiments in a microwave cavity with a tuneable quality factor. To his end, we simultaneously measure the electrically detected spin pumping signal and microwave reflection (the ferrimagnetic resonance signal) of a yttrium iron garnet (YIG) / platinum (Pt) bilayer in the microwave cavity.  The coupling strength of the fundamental magnetic resonance mode and the cavity is determined from the microwave reflection data. All features of the magnetic resonance spectra  predicted by first principle calculations and an input-output formalism agree with our experimental observations. By changing the decay rate of the cavity at constant magnon-photon coupling rate, we experimentally tune in and out of the strong coupling regime and successfully model the corresponding change of the spin pumping signal.  Furthermore, we observe the coupling and spin pumping of several spin wave modes and provide a quantitative analysis of their coupling rates to the cavity.\n\n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle\n\n\\section{Introduction}\nMotivated by the vision of hybrid quantum information systems combining the fast manipulation rates of superconducting qubits and the long coherence times of spin ensembles, strong spin-photon coupling is a major goal of quantum information memory applications.  Coherent information exchange between microwave cavity photons and a spin ensemble was initially demonstrated for paramagnetic systems \\cite{Schuster2010,Kubo2010,Zollitsch2015}, but only recently has this concept been transferred to magnetically ordered systems, where coupling rates of hundreds of megahertz can be achieved.\\cite{Soykal2010,Huebl2013,Tabuchi2014,Zhang2014}  Utilizing the flexibility of exchange coupled magnetically ordered systems, more complex architectures involving multiple magnetic elements have already been developed\\cite{Zhang2015,Lambert2015}. Additionally, magnetically ordered systems allow to study classical strong coupling physics even at room temperatures.\\cite{Huebl2013,Tabuchi2014,Zhang2014,Zhang2015,Lambert2015,Yao2015}\n\nMoreover, a key advantage of magnetically ordered systems over their paramagnetic counterparts -- which has yet to be fully explored -- is the ability to probe magnetic excitations electrically through spin pumping and the inverse spin Hall effect. Spin pumping, in general, relies on ferromagnet-normal metal (FM/NM) heterostructures and has been demonstrated for a wide variety of material combinations\\cite{Czeschka2011a}. Under resonant absorption of microwaves, the precessing magnetisation in the ferromagnet sources a spin current into the normal metal, where it is converted into a charge current via the inverse spin Hall effect. This spin Hall charge current is then  detected. In ferromagnetic insulator (FMI)-based FMI/NM heterostructures, charge current signals from the rectification of the microwave electric field are very small\\cite{Iguchi2014}, leading to a dominant spin pumping/spin Hall signal.  This has led to much research on FMI/NM heterostructures, of which the Yttrium Iron Garnet (YIG)/Platinum(Pt) bilayers we use are a prime example. Spin pumping is a well understood effect for weak photon-magnon coupling \\cite{Tserkovnyak2002,Czeschka2011a}, i.e. for situations where the decay rates of the cavity and the magnetic system are larger than the photon-magnon coupling strength. However, the large spin density of YIG and the resulting large effective coupling strength allows one to reach the strong coupling regime also in typical spin pumping experiments. The experimental observation\\cite{Bai2015} and theoretical treatment   \\cite{Cao2015,Lotze2015} of spin pumping in a strongly coupled magnon-photon system has only recently been performed. These results suggest that combining spin pumping and strong magnon-photon coupling may enable the transmission and electrical read out of quantum states in ferromagnets using a hybrid architecture. Experiments directly linking spin pumping in the weak and strong coupling regime are, however, still missing. Such experiments are one important step towards understanding the functional principle and key requirements for such a hybrid architecture.\n\nIn this paper, we present a systematic study of the magnon-photon coupling in magnetic resonance experiments in a YIG/Pt bilayer mounted in a commercially available EPR cavity. We measure both the microwave reflection spectra and the electrically detected spin pumping signal in the system.  The tuneable cavity quality allows us to systematically move in and out of the strong coupling regime. Measurements with high magnetic field and frequency resolution allow us to clearly observe the coupling of spin wave modes with the hybridized cavity--fundamental FMR mode. We explore a different approach as recently used by \\citet{Zhang2014}: In our setup, instead of tuning the cavity frequency we tune its decay rate while the effective magnon-photon coupling rate and the magnon decay rate stay constant. We thus achieve a transition from the strongly coupled regime where the decay rates of spin and cavity system are both considerably smaller than the effective coupling rate, to the weakly coupled regime where the cavity decay rate is much higher than the magnon-photon coupling rate. This regime is also called the regime of magnetically induced transparency (MIT)\\cite{Zhang2014}.\n\nThis paper is organized as follows: In Sec. \\ref{sec:theory} we review the general theory of the coupled magnon-photon system and the main features of spin pumping in the case of strong coupling.  In Sec. \\ref{sec:exp} we describe the experimental details of recording the microwave reflection of the system as a function of frequency and applied magnetic field while simultaneously recording the DC spin pumping voltage across the Pt.  Finally in Sec. \\ref{sec:discuss} we present our observation of strong coupling between the cavity mode and both the fundamental magnetic resonance and standing spin wave modes.  We also demonstrate the transition from strong to weak coupling by tuning the cavity line width and discuss the difference in the experimental spin pumping signature in both the strong and weak regimes.\n\n\\section{Theory}\n\\label{sec:theory}\n\\subsection{Photon-Magnon Dispersion}\nConventionally, ferromagnetic resonance (FMR) is modeled in terms of the Landau-Lifshitz-Gilbert (LLG) equation which describes the dynamics of a magnetic moment in the presence of a magnetic field.  In a static magnetic field $H_0$, the magnetic moment will precess with the Larmor frequency $\\omega_\\mathrm{s}$. In detail, $\\omega_\\mathrm{s}$ depends on the static field strength and on its orientation due to anisotropy\\cite{Brandlmaier2008}. This precessional motion can be resonantly excited by a time varying microwave magnetic field $H_1$ with a frequency close to $\\omega_\\mathrm{s}$. To observe spin pumping in FM/NM heterostuctures, the field $H_0$ should be applied perpendicular to the surface normal (i.e. in the interface plane)\\cite{Heinrich2003, Tserkovnyak2002,Mosendz2010,Czeschka2011a}. In this case, the FMR dispersion (in the absence of crystalline magnetic anisotropy) is $\\omega_s =  \\gamma \\mu_0 \\sqrt{ H_0 \\left( H_0 + M_\\mathrm{s}\\right) }$\\cite{Kittel2005}. Here, $M_\\mathrm{s}$ is the material specific saturation magnetization, $\\gamma$ is the material specific gyromagnetic ratio and $\\mu_0$ is the vacuum permeability. In the limit $H_0 \\gg M_\\mathrm{s}$   the resonance frequency is thus linear in magnetic field. Contrary to the spin resonance frequency ${\\ensuremath{\\omega_\\mathrm{s}}}$, the resonance frequency ${\\ensuremath{\\omega_\\mathrm{c}}}$ of a macroscopic cavity is determined by geometrical and dielectric parameters only and therefore does not depend on the magnetic field.  However, since the magnonic and the photonic mode interact in resonance, we expect modifications to the pure FMR and pure cavity dispersions. To be specific, we will observe an anticrossing of the FMR and the cavity dispersion for a sufficiently strong magnon-photon coupling.\n\nTo describe the coupling between the cavity mode and the spin excitation the quantum mechanical Tavis-Cummings model \\cite{Tavis1968,Fink2009} and classical first principles\\cite{Cao2015} approaches using the input-output formalism\\cite{Huebl2013} have successfully been used. For the dipolar interaction assumed in the models, the single spin-single photon coupling strength $g_0$ is proportional to the vacuum microwave magnetic field $H_1^0$ and the dipole moment $m$ of the spin. In the scope of the Tavis-Cummings model, it has been shown that the collective coupling strength ${\\ensuremath{g_\\mathrm{eff}}}$ to an ensemble of spins is proportional to the square root of the number of polarized spins for the coupling to the vaccum microwave magnetic field. In a classical theory, \\citet{Cao2015} derived that this $\\sqrt{N}$ behaviour prevails also for the magnon-photon coupling in magnetically ordered systems. Here, the total magnetization and thus the filling factor of the ferromagnetic material in the cavity, can be used as a measure for the total number of spins. \n\nThe characteristic fingerprint of strong coupling is the formation of an observable anti-crossing of the cavity and the spin dispersion relation close to resonance. Note, that the presence of stong coupling and the accompanied visible anti-crossing of the dispersion relations requires that the effective coupling {\\ensuremath{g_\\mathrm{eff}}}\\ exceeds the loss rates of the spins ($\\gamma_\\mathrm{s}$) and the cavity ($\\kappa_\\mathrm{i}+\\kappa_\\mathrm{e}$). Experimentally, we tune the spin resonance frequency ${\\ensuremath{\\omega_\\mathrm{s}}}$ across the cavity resonance frequency ${\\ensuremath{\\omega_\\mathrm{c}}}$ via an externally applied static magnetic field. The coupled system can most simply be modelled in the vicinity of the resonance frequency using two coupled harmonic oscillators, where the resonance frequency is\\cite{Huebl2013}:\n\n", "index": 1, "text": "\\begin{equation}\n  \\label{eqn:HO}\n  \\omega_\\pm = \\omega_\\mathrm{c} + \\frac \\Delta 2 \\pm \\frac 1 2 \\sqrt{\\Delta^2 + 4 g_\\mathrm{eff}^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\omega_{\\pm}=\\omega_{\\mathrm{c}}+\\frac{\\Delta}{2}\\pm\\frac{1}{2}\\sqrt{\\Delta^{2%&#10;}+4g_{\\mathrm{eff}}^{2}}\" display=\"block\"><mrow><msub><mi>ω</mi><mo>±</mo></msub><mo>=</mo><mrow><mrow><msub><mi>ω</mi><mi mathvariant=\"normal\">c</mi></msub><mo>+</mo><mfrac><mi mathvariant=\"normal\">Δ</mi><mn>2</mn></mfrac></mrow><mo>±</mo><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><msqrt><mrow><msup><mi mathvariant=\"normal\">Δ</mi><mn>2</mn></msup><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msubsup><mi>g</mi><mi>eff</mi><mn>2</mn></msubsup></mrow></mrow></msqrt></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05681.tex", "nexttext": "\n\nThe coupling of the spin waves to the already hybridized cavity resonance decreases with the order of the mode. This can be understood by taking into account that the effective magnetization to which the homogeneous microwave field can couple decreases with increasing mode number. The extracted values, $g_{n=7,9,11,13} = \\left[3.65, 2.49, 1.64, 1.16\\right] \\SI{}{\\mega\\hertz}$, match accurately with the expected $\\frac 1 n$ dependence of the coupling strength\\cite{Cao2015}.\n\nWe attribute the pronounced feature that is seen to the right of the anti-crossing to an unidentified spin wave mode. A similar feature was found in other experiments\\citep{Bai2015}  and has been interpreted in the same manner. In our data, we can clearly distinguish between the fundamental mode and this additional mode -- simply by remembering that the relative intensity and coupling strength is expected to be higher for the fundamental mode. Possible origins for the additional mode are an inhomogeneous sample or a gradient in the magnetic properties across the film thickness\\cite{Hoekstra1977}. This would be consistent with the unusual spin wave mode splitting. Lastly, we note that the recorded signal in the reflection parameter is completely symmetric upon magnetic field reversal.\n\nThe simultaneously recorded DC voltage is shown in {Fig.~\\ref{fig:{posneg}}}~(b). Contrary to the reflection parameter, the voltage signal reverses sign on reversing $\\mu_0 H_0$. The lineshape that we record for all modes is completely symmetric as far as they can be clearly distinguished from each other. We thus conclude that we observe a signal purely caused by spin pumping and not by any rectifying effect. In a FMI/NM bilayer ($\\rho_\\mathrm{YIG} \\geq \\SI{10}{\\giga\\ohm\\meter}$) \\cite{Tucciarone1984} rectification can only arize from a change of the spin Hall magnetoresistance (SMR) in the normal metal. According to model calculations \\cite{Iguchi2014} this effect is negligible for the system we investigate because of the small magnitude of the SMR effect ($< 0.1 $\\%). This notion is further corroborated by the fact that the change in lineshape expected for rectification type signals is not visible in our data. Apart from the spin wave modes which are clearly resolved in the DC voltage signal, we can also clearly see the electrically detected spin pumping voltage originating from the hybridized system of cavity and fundamental FMR mode (the main anti-crossing). The hybridized cavity eigenmodes can, however, pump spin current into the normal metal only very inefficiently and thus the DC voltage we observe is very low.\n\n\\begin{figure*}\n\\includegraphics{images/coupling}\n\\caption{Increasing the coupling of the cavity to the feed line (from left to right) increases the cavity loss rate $\\kappa_\\mathrm{c}$ and thus line width $\\Delta \\omega/2\\pi$. This enables experimental control of the transition between strong and weak coupling.  The line cuts at positive field (intense colors) and negative field (pale colors) again confirm the symmetry, $V(-H_0) = -V(H_0)$ and $S_{11}(-H_0) = S_{11}(H_0)$ and also show the merging of the two dispersion curves during the strong/weak transition.}\n\\label{fig:coupling}\n\\end{figure*}\n\nThe upper panels of {Fig.~\\ref{fig:{coupling}}} show the change in cavity reflection as we gradually increase the coupling of the cavity to the feed line and thus increase the cavity decay rate.  Starting from the critically coupled case (internal cavity losses are equal to losses into the feedline) in the left panel to a highly overcoupled cavity (losses into the cavity feed line dominate the cavity's decay rate) in the right panel, we clearly see an increase in the cavity linewidth up to the point were the unperturbed cavity is no longer recognizable. Correspondingly, the cavity decay rate increases from left to right and, in turn, the microwave magnetic field strength $H_1$ in the cavity decreases. \nFor the already weakly coupled spin wave modes the spin pumping voltage decreases with decreasing microwave magnetic field strength $H_1$ resp. available microwave power(indicated by the higher $S_{11}$ parameter) in the cavity.\nThe DC spin pumping voltage amplitude corresponding to the fundamental mode (lower panels of {Fig.~\\ref{fig:{coupling}}}) does, however, not decrease for lower $Q$-factors but stays approximately constant. Considering that the absorbed power of the cavity-spin system stays approximately constant when changing the cavity decay rate as can easily be seen in the line cuts in the upper panels of {Fig.~\\ref{fig:{coupling}}} this behaviour can also be understood.\n\nThe best measure of the true magnon spectrum and line widths of the spin system can be extracted from the highly overcoupled case (right panels of {Fig.~\\ref{fig:{coupling}}} and {Fig.~\\ref{fig:{linecuts}}}). There, the magnon-photon coupling is negligible compared to the cavity loss rate and therefore, the magnon-cavity mode hybridization does not distort the line shape. A mode that strongly couples with the cavity, on the contrary, can vanish completely in the fixed-frequency spectrum. We finally note that we observe the described anti-crossing due to the magnon-photon coupling and thus the distortion of the lines in a fixed-frequency experiment (with the cavity tuned to high Q, as usually done in cavity-based FMR experiments) already for sample volumes as small as $V=2\\times 10^{-3}\\SI{} {\\cubic\\milli\\meter}$ in the case of YIG ($M_\\mathrm{S} = \\SI{140}{\\kilo\\ampere\\per\\meter}$). These sample volumes are easily achieved for LPE grown samples and we note that in most cavity FMR experiments\\cite{Kajiwara2010} the effects of the coupling need to be taken into account in order to yield accurate results especially when automatic frequency control is employed.\n\\begin{figure}\n\\includegraphics{images/source/resonator-frequency-lineplot.pdf}\n\\caption{Line cuts of (a) reflection parameter and (b) DC voltage at the resonator frequency ${\\ensuremath{\\omega_\\mathrm{c}}}\\left( H_0 = 0 \\right)$. In the strongly coupled magnon-photon case (green lines), the fundamental mode vanishes as opposed to the weakly coupled case where the magnon spectrum is accurately reproduced}\n\\label{fig:linecuts}\n\\end{figure}\n\n\\section{Conclusions}\nIn summary, we presented systematic measurements of spin pumping in different regimes of the magnon-photon coupling strength. For the fundamental mode of a YIG/Pt bilayer, strong coupling with an effective coupling strength of $g_{\\rm eff}/2\\pi = \\SI{31.8}{\\mega\\hertz}$ has been achieved at room temperature in a standard EPR cavity. The characteristics of the coupled magnon-photon system fit well to the established theory and are consistent with recent results. Simultaneously, we recorded the electrically detected spin pumping signal of the fundamental mode. We were able to tune the system from the strong to the weak coupling regime by changing the cavity's decay rate. The evolution of the spin pumping signal of the fundamental mode has been analyzed qualitatively and follows the predictions of \\citet{Lotze2015}: In the strongly coupled magnon-photon system the spin pumping efficiency is reduced as the precession cone angle is smaller than in the weakly coupled case.  Additionally, we were able to observe coupling and electrically detected spin pumping of several spin wave modes with distinctly different coupling strengths and observe for the first time their $1/n$ dependence predicted by \\citet{Cao2015}. Furthermore, we directly demonstrated the implications of strong coupling on fixed-frequency FMR experiments. We conclude that small sample volumes or an highly overcoupled cavity are mandatory for a qualitatively and quantitatively correct evaluation of the magnon spectrum.\n\n\n\\section*{\\uppercase{ Acknowledgements}}\nWe thank Christoph Zollitsch and Johannes Lotze for many valuable discussions and Michaela Lammel for assistance in the sample preparation. M. Harder acknowledges support from the NSERC MSFSS program. We gratefully acknowledge funding via the priority programme Spin Caloric Transport (spinCAT) of Deutsche Forschungsgemeinschaft (Project GO 944/4), SFB 631 C3 and the priority programm SPP 1601 (HU 1896/2-1).\n\n\\bibliography{references}\n\n\n", "itemtype": "equation", "pos": 25258, "prevtext": "\nHere, $\\Delta = \\gamma \\left( \\mu_0 H_0 - \\mu_0 H_\\mathrm{res} \\right)$ is the spin-cavity detuning with $H_\\mathrm{res}$ statisfying the spin resonance condition for a given cavtiy frequency $\\omega_\\mathrm{c}$. \n\nIn ferromagnetic films, additional magnetic modes, so-called perpendicular standing spin waves modes, appear due to magnetic boundary conditions. For the condition where the magnetization is pinned at least at one surface of the film (and in the absence of any anisotropies or magnetic gradients) the magnon spectrum can easily be calculated\\cite{Kittel2005}. The difference of the resonance field of the $n$\\textsuperscript{th}-mode from the fundamental mode $H^n_\\mathrm{res}-H^1_\\mathrm{res}$ is proportional to $n^2$. \\citet{Cao2015} also calculated the expected coupling strength for different modes and found that the coupling decreases with increasing mode number as ${\\ensuremath{g_\\mathrm{eff}}} \\propto 1/n$. This can be understood when considering the microwave mode profiles and the fact that the spatial mode profile of the microwave field $H_1^0$ in a cavity is typically homogeneous and in phase throughout the thickness of the (thin film) sample. Therefore only every second mode can be excited and the effective magnetization to which the microwave can couple to is reduced to $\\frac M n$.\n\\subsection{Spin pumping and strong coupling}\nSpin pumping in ferromagnet/normal metal bilayers in the weak coupling regime is well understood\\cite{Tserkovnyak2002,Czeschka2011a,Mosendz2010}: An additional mechanism which damps the magnetization precession becomes available by spin pumping, as the precessing magnetisation is driving a spin current into the adjacent normal metal.\\cite{Tserkovnyak2002} In electrically detected spin pumping, this spin current is then converted into a charge current via the inverse spin Hall effect (ISHE). For electrical open circuit conditions, one thus obtains a voltage which scales as\\cite{Mosendz2010,Czeschka2011a} $V_\\mathrm{SP} \\propto g^{\\uparrow\\downarrow}\\lambda_\\mathrm{SD}\\tanh{\\frac{t_\\mathrm{N}}{2\\lambda_\\mathrm{SD}}}\\sin^2{\\theta}$. It, thus, contains information on the spin mixing conductance $g^{\\uparrow\\downarrow}$, the spin diffusion length $\\lambda_\\mathrm{SD}$, the magnetization precession cone angle $\\theta$ and depends on the thickness of the normal metal layer $t_\\mathrm{N}$. The maximal precession cone angle $\\theta$ and thus the maximal expected spin pumping voltage depends on the microwave power but also on the coupling strength between cavity and spin system. For strong coupling, the cone angle is expected to be reduced as compared to the weak coupling case due to the hybridized nature of the excitation at its maximal intensity.\n\nThe other contributions in the equation for $V_\\mathrm{SP}$ are material constants: The spin mixing conductance ${\\ensuremath{g^{\\uparrow\\downarrow}}}$ describes the the transparency of the ferromagnet/normal metal interface und limits the spin pumping efficiency generally; the spin diffusion length $\\lambda_\\mathrm{SD}$ in conjunction with the normal metal thickness $t_\\mathrm{N}$ accounts for a spin  accumulation in the normal metal and reduces the spin pumping efficiency if $t_\\mathrm{N} \\lessapprox \\lambda_\\mathrm{SD}$.\n\n\n\\section{Experimental details}\n\\label{sec:exp}\n\\begin{figure}\n\\includegraphics[width=0.4\\textwidth]{images/block}\n\\caption{ Block diagram of the experimental setup and sample mounting. \\textbf{(Inset)} Schematic of the coupling scheme illustrating cavity decay due to intrinsic losses viz. losses to the feedline $\\kappa_\\mathrm{c} = \\kappa_\\mathrm{i} + \\kappa_\\mathrm{e}$, spin system decay consisting of intrinsic damping and spin pumping damping $\\gamma_\\mathrm{i}= \\gamma_\\mathrm{s} + \\gamma_\\mathrm{sp}$ as well the collective coupling rate $g_\\mathrm{eff}$}\n\\label{fig:setup}\n\\end{figure}\n\n\\subsection{Sample preparation}\nIn our experiments we used YIG/Pt heterostructures grown by liquid phase epitaxy on (111)-oriented Gadolinum Gallium Garnet (GGG) substrates. The YIG film thickness was \\SI{2.8}{\\micro\\meter}. In order to produce a high quality interface between YIG and Pt, and thus a large spin mixing conductance  $g^{\\uparrow\\downarrow}$, we followed the work of \\citet{Jungfleisch2013} and first treated the YIG surface by piranha etching for 5~minutes in ambient conditions. Thereafter, the sample was annealed at \\SI{500}{\\celsius} for 40~minutes in an oxygen atmosphere of \\SI{25}{\\micro\\bar}. Under high vacuum, it was then transferred into an Electron Beam Evaporation (EVAP) chamber where \\SI{5}{\\nano\\meter} Pt was deposited. The exact Pt thickness was determined using X-Ray reflectometry.  However, we note that for our analysis the Pt layer thickness is of minor importance as it was consistently larger than the spin diffusion length $\\lambda_\\textrm{SD}$ of Pt such that the Pt layer simply serves as a perfect spin sink.\n\nIn order to achieve collective strong coupling between magnons and cavity photons, the number of magnetic moments must be sufficiently high. Therefore, we diced the sample into several pieces of different lateral dimensions. Magnetic resonance experiments in the strong coupling regime showed that the $\\sqrt{N}$ scaling of the coupling strength discussed in Section~\\ref{sec:theory} is indeed obeyed upon comparing samples with different volume and thus different total magnetic moment. In the following, we will focus on a sample with lateral dimensions \\SI{2x3}{\\milli\\meter} which, with the effective spin density $\\rho_\\textrm{S} = 2.1 \\times 10^{22}\\,\\frac{\\mu_\\mathrm{B}}{\\mathrm{cm}^3}$ of iron atoms in YIG\\cite{Gilleo1958}, contains on the order of $4\\times10^{17}$ spins. \nFinally, the sample was mounted on a PCB sample carrier and wire bonded as depicted in the inset of {Fig.~\\ref{fig:{setup}}}. The carrier itself was mounted on a sample rod which allowed the sample to be accurately positioned in the electrical field node of a Bruker Flexline MD5 dielectric ring cavity in an Oxford Instruments CF935 gas flow cryostat. Shielded DC cabling allowed for the measurement of the ISHE voltage. The detailed design blueprints of the sample rod and chip carrier can be retrieved online\\footnote{The designs of the sample holder are published under the CERN Open Hardware License \\texttt{http://hannes.maier-flaig.de/flexline-sample-rod}}.\n\n\\subsection{Experimental setup}\n\nThe Bruker cavity exhibits a TE$_{011}$ mode with an electric field node at the sample position. Its quality factor $Q = \\omega / \\Delta \\omega_\\mathrm{c}^\\mathrm{FWHM}$ ($\\Delta \\omega_\\mathrm{c}^\\mathrm{FWHM}$ being the full width half maximum line width of the cavity) is dominated by the dissipative losses in the dielectric and its finite electrical resistance ($\\kappa_\\mathrm{i}$) as well as radiation back into the cavity feed line ($\\kappa_\\mathrm{c}$). By changing the cavity's coupling ratio to the feed line, unloaded coupled quality factors $Q_\\mathrm{c}$ from 0 to 8000 can be achieved. This allows tuning in and out of the strong coupling regime easily. Using the gas flow cryostat, different temperatures can be stabilized. All the following experiments have, however, been performed at room temperature.\n\nTo measure ferromagnetic resonance (FMR) the cavity was connected to the port of an Agilent N5242A vector network analyzer (VNA). The driving power of $15$~dBm excites at maximum on the order of $N_\\mathrm{Ph} = 1.3\\times10^{14}$ photons in the cavity which is considerably smaller than the number of spins in the sample ($4\\times10^{17}$). In this case, the  theory presented in Sec.~\\ref{sec:theory}\\  is well justified\\cite{Chiorescu2010}. The frequency dependent cavity reflection $S_{11}$ was measured while sweeping the external field $\\mu_0 H$ that is created by a water cooled electromagnet. The IF bandwidth was chosen to be \\SI{100}{\\hertz} which leads to a frequency sweep time of approximately \\SI 2 \\second\\ for each magnetic field step. A calibration of the microwave leads up to the resonator's SMA connector was performed. The calibration did not include the feed line inside the resonator mount, which gave rise to a background signal in the reflection parameter. However, by utilizing the full complex S-parameter for the background subtraction with the inverse mapping technique outlined by \\citet{Petersan1998} and a subsequent Lorentzian fit to the magnitude, a reliable measurement of $Q$ is still possible, even for a completely uncalibrated setup. We note that even though standing waves in the mirowave feed line will not appear in the calibrated reflection measurement they will still change the total power in the cavity and therefore may complicate the electrically detected DC spin pumping signal. Uncalibrated measurements did not show sharp feed line resonances in the frequency range studied here but only smooth oscillations with an amplitude of less than \\SI{1}{\\decibel} and there was no correlation in the DC signal resolved. In order to fit the data and as it improves clarity, we only discuss calibrated measurements in the following.\n\nThe DC voltage from the sample was measured along the cavity axis and thus perpendicular to the external magnetic field and the sample normal. It was amplified with a differential voltage amplifier model 560 from Stanford Research Systems. The amplifier was operated in its low noise (4~nV/$\\sqrt{\\textrm{Hz}}$) mode and set to a gain of $2\\times 10^4$. The analog high-pass filter of the amplifier was disabled, however, a low-pass filter with a 6dB roll-off at \\SI{1}{kHz} was employed. Limiting the bandwidth of the amplifier by filtering is required in order to achieve a good signal-to-noise ratio. Care has, however, to be taken as the lineshape may be quickly distorted by inappropriate settings and thus the signature of spin pumping might be masked. High-pass filtering can easily lead to a dispersive like contribution to the signal, whereas low-pass filtering will give rise to asymmetric line shapes depending on the ratio of IF bandwidth and low-pass frequency. We made sure that no such distortions contribute to the presented measurements. The amplified voltage signal was finally recorded using the auxiliary input of the VNA simultaneously with the cavity reflection $S_{11}$.\n\n\\section{Results and discussion}\n\\label{sec:discuss}\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{images/posneg.pdf}\n\\caption{\\textbf{(a)} Reflection parameter $S_{11}$ recorded while sweeping the magnetic field. Strong coupling of the collective spin excitations is indicated by a clear anticrossing, spin wave modes to the low field side of the main resonance are visible. Black numbers indicated the spin wave mode number. \\textbf{(b)} Simultaneously recorded DC voltage. Fundamental and spin wave modes are visible where  the latter couple less strongly and thus pump spin current more efficiently. Insets: Detail of n=5 spin wave mode including the dispersion relation of the strong coupling between the fundamental FMR mode and the cavity as solid red line and the anti-crossing of this hybrid and the spin wave mode (\\#5) as white lines. }\n\\label{fig:posneg}\n\\end{figure}\n\nWe first focus on the case of the so-called critical coupling of the feed line to the cavity in which most FMR experiments are conducted. In this case, the internal loss rate of the cavity equals the loss rate to the feed line and the quality factor is $Q_\\mathrm{c} = Q_\\textrm{internal}/2$.\nNote that inserting a sample and holder into the cavity will reduce the cavity $Q$ by an amount which depends on the sample and holder details such as conductivity and dielectric losses. Based on our measured loaded $Q_\\mathrm{c}=706$, the cavity decay rate is calculated to be $\\kappa_\\mathrm c / 2 \\pi = \\frac{\\omega_\\mathrm{r}}{2\\pi} /2Q_\\mathrm{c} = \\SI{6.8}{\\mega\\hertz}$.\n\nStrong coupling of the magnon and cavity system manifests itself in a characteristic anti-crossing of the (magnetic field independent) cavity resonance frequency and the magnon dispersion that is (approximately) linear in magnetic field. This anti-crossing corresponding to two distinct peaks in a line cut at the resonance field, are immediately visible in the reflection spectrum in {Fig.~\\ref{fig:{posneg}}}. The minimal splitting gives the collective coupling strength $g_\\textrm{eff}/2\\pi = \\SI{31.8}{\\mega\\hertz}$ of the fundamental mode to the cavity. Taking into account the number of spins in the sample, the single spin coupling rate is on the order of $g_0/2\\pi=\\SI{0.1}{Hz}$ which is in agreement with experiments on paramagnetic systems\\cite{Abe2011}.\n\nIn our setup, even the coupling of higher order spin wave modes to the cavity can be resolved. We number the spin waves as noted in {Fig.~\\ref{fig:{posneg}}} taking into account that with an uniform driving  field only odd modes can be excited. Analysis of the resonance position of the spin wave modes reveals that $H^n_\\mathrm{res}-H^1_\\mathrm{res}$ in our sample is proportional to $n$ rather than $n^2$. This indicates a non-square like potential well.  Similarly, complicated mode splittings have been reported in literature\\cite{Goennenwein2003}. The lowest order spin wave mode that can be easily observed in our setup is shown in the inset of {Fig.~\\ref{fig:{posneg}}}~(a) in detail. It exhibits the largest effective coupling (\\SI{3}{\\mega\\hertz}) of all spin wave modes. The red and white lines in Fig.~\\ref{fig:posneg}~(a) correspond to the harmonic-oscillator model ({Eqn.~\\ref{eqn:{HO}}}) for the fundamental mode and the lowest order spin wave mode, respectively. As the spin wave couples to an already hybridized sytem, we superimposed the dispersion $\\omega_c = \\omega_r \\left( B \\right)$ of the hybridized system of fundamental mode and unperturbed cavity as the \"cavity\" mode in the modelling of the spin wave mode couplings.\n\nIn order to quantify the coupling strength of the higher order modes which only interact weakly with the hybridized cavity--fundamental FMR mode, we follow the approach of \\citet{Herskind2009}. For each field, we fit a Lorentzian to the magnitude of the cavity absorption. From this fit we extract the resonance frequency $\\omega_c$ and the half width half maximum of the absorption  $\\Delta \\omega$ which, in\nthe weakly coupled spin waves reads as\\cite{Herskind2009}\n", "index": 3, "text": "\n\\[\n\\Delta \\omega = \\Delta \\omega_c + g_\\mathrm{eff} \\gamma_s / \\left( \\gamma_s ^2 + \\Delta ^2 \\right).\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\Delta\\omega=\\Delta\\omega_{c}+g_{\\mathrm{eff}}\\gamma_{s}/\\left(\\gamma_{s}^{2}+%&#10;\\Delta^{2}\\right).\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>ω</mi></mrow><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ω</mi><mi>c</mi></msub></mrow><mo>+</mo><mrow><mrow><msub><mi>g</mi><mi>eff</mi></msub><mo>⁢</mo><msub><mi>γ</mi><mi>s</mi></msub></mrow><mo>/</mo><mrow><mo>(</mo><mrow><msubsup><mi>γ</mi><mi>s</mi><mn>2</mn></msubsup><mo>+</mo><msup><mi mathvariant=\"normal\">Δ</mi><mn>2</mn></msup></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]