[{"file": "1601.05688.tex", "nexttext": "\nThey can all be written in terms of the elementary operators,\n\\begin{eqnarray}\n  \\widehat{K_\\varphi^2}(x_j)&=&\n\\frac{\\widehat{\\sin\\left(\\rho K_\\varphi(x_j)\\right)}}{\\rho}\n\\hat{E}^\\varphi(x_j)\n\\frac{\\widehat{\\sin\\left(\\rho K_\\varphi(x_j)\\right)}}{\\rho}\n\\hat{E}^\\varphi(x_j)^{-1},\\nonumber\\\\\n\\widehat{[K_\\varphi/E^\\varphi]}(x_j)&=& \n\\frac{\\widehat{\\sin\\left(\\rho K_\\varphi(x_j)\\right)}}{\\rho}\n{\\widehat{\\cos\\left(\\rho K_\\varphi(x_j)\\right)}}\n\\hat{E}^\\varphi(x_j)^{-1},\\nonumber\\\\\n\\widehat{[1/E^\\varphi]^{2}}(x_j) &=&\n{\\widehat{\\cos\\left(\\rho K_\\varphi(x_j)\\right)}}\n\\hat{E}^\\varphi(x_j)^{-1}\n{\\widehat{\\cos\\left(\\rho K_\\varphi(x_j)\\right)}}\n\\hat{E}^\\varphi(x_j)^{-1},\\nonumber\\\\\n\\hat{a}_j&=&\n\\frac{\\eta}{2}\\left(\\hat{E}^x(x_j)-\\hat{E}^x(x_{j-1})\\right),\\quad\n\\hat{b}_n=\\sqrt{|\\hat{E}^x(x_j)|},\\nonumber\n\\end{eqnarray}\nwhere as usual we have polymerized the $K_\\varphi$ variable but also\nintroduced a holonomy correction in $E^\\varphi$ such that the change\nis equivalent to a canonical transformation at the classical\nlevel. There one has that $\\{K_\\varphi(x),E^\\varphi(y)\\}=\\delta(x-y)$\nand also that\n$\n  \\left\\{\\frac{\\sin\\left(\\rho K_\\varphi(x)\\right)}{\\rho},\n  {\\cos\\left(\\rho K_\\varphi(y)\\right)}^{-1} E^\\varphi(y)\\right\\}=\\delta(x-y).\n$\nSo we replace $K_\\varphi$ by the sines and $E^\\varphi$ by itself times\nthe inverse cosine in all expression, that is the canonical\ntransformation. This polymerization preserves the constraint algebra\nand leads to the original classical theory when $\\rho\\to\n0$. Interestingly it can also be extended to matter fields, like\nscalar fields and it preserves the constraint algebra.  In a rather\nlengthy but straightforward calculation it can be shown that for the\ncase of the shell the constraint has an Abelian commutator algebra\nwith itself also at the quantum level.\n\nUnlike the static vacuum case, we do not at the moment know how to\nfind in closed form the space of physical states associated with the\nconstraints we defined. However, with the constraints represented by well defined\noperators, we can recognize the quantum observables of the model\n$\\widehat{O(z(x))}$, $\\widehat{M}$, $\\widehat{\\tau}$, \n$\\widehat{F p}$ and $\\widehat{V}$ ($z(x)$ is\na function of the radial variable that takes values in the interval\n$[-1,1]$ that enters the definition of $\\hat{E}^x$, we give more\ndetails below, for additional details see \\cite{sphericaljavi}).  The\nformer is present in the vacuum theory already and corresponds to the\ndiffeomorphism invariant content of $\\hat{E}^x$, or in other words\nthat diffeomorphisms in one dimension cannot change the order of the\nvertices of the spin network. The middle ones are the ADM mass and its\ncanonically conjugate momentum, the time at infinity. \nThe two latter ones are associated with\nthe shell. They have the commutator, $ \\left[\\hat{m},\\hat{V}\\right]\n= i\\hbar.$ In terms of them we would like to express dynamical\nvariables of the problem as parameterized Dirac observables (evolving\nconstants of the motion) and study the physics in the quantum regime.\nIt should be emphasized that we do not have at the moment an explicit\nself adjoint implementation of the observables associated with the\nshell. We will assume one exists and, given their algebra, we can \ncharacterize the eigenstates of the complete set of observables and\ndefine parameterized Dirac observables based on them.\n\n\n\n\n\n\n\nFollowing similar steps to the ones we carried out in the vacuum case\n\\cite{hawking} leads to explicit expressions for the components of the\nmetric as functions of the Dirac observables and classical\n(functional) parameters\n$K_\\varphi$ and $z(x)$. We are interested in studying the whole\nspace-time so we choose the horizon penetrating Eddington--Finkelstein\ncoordinates \\cite{louko}. For that purpose we consider that $E^x$ is time-independent, what fixes $N^x=0$, and\n\na relationship between $K_\\varphi$\nand $E^x$ \n\ngiven by \n\\begin{eqnarray}\n  K_\\varphi &=&\n\\frac{R_S\\left[\\Theta\\left(x\\right)-\\Theta\\left(-x\\right)\\right]}{\\sqrt{|E^x|}\\sqrt{1+\\frac{R_S}{\\sqrt{|E^x|}}}},\n\n\n\n\n\n\n\n\\end{eqnarray}\nwhere \n\\begin{eqnarray}\nR_S &=& 2M + 2m\\Big[\\Theta\\left(x\\right) \\Theta\\left(\\sqrt{|E^x|}+(t-V)\\right) \\nonumber\\\\\n&&+ \\Theta\\left(-x\\right) \\Theta\\left(\\sqrt{|E^x|}-(t-V)\\right)\\Big].\n\\end{eqnarray}\nWe will concentrate from now on in the case\nwithout a pre-existing black hole, i.e. $M=0$.  The expression for\n\n$K_\\varphi$ \nreduces to ordinary Eddington--Finkelstein\noutside the shell in $x>0$ and satisfies\n\n$\\dot{K}_\\varphi=\\left\\{K_\\varphi,H_T\\right\\}$. Besides, one can check \nthat $N=1/2$ and\n\\begin{eqnarray}\n  E^\\varphi &=&\\frac{\\left(E^x\\right)'}{2}\\sqrt{1+\\frac{R_S}{\\sqrt{|E^x|}}}.\n\\end{eqnarray}\n\n\nThese\nexpressions take values for $x<0$ that allow to extend the\nparameterized observables to the region beyond the singularity. Since\ngenerically we will be interested in considering superpositions of\nstates of different eigenvalues of $\\hat{m}$ in order to approximate\nsemiclassical space-times, it is convenient to promote the above\nexpression to a quantum identity so it automatically adjusts to\neach state.  This gauge choice extends the kind of gauge fixings up to\nnow considered where $K_\\varphi$ was a c-number. We now consider a\nchoice that also depends on the observables. The conservation of the\ngauge fixing ensures the consistency of the choice.  The resulting\nexpressions for the metric are (for reasons of space we give only one\ncomponent, the others are similar in nature),\n\\begin{eqnarray}\ng_{tx}&=&-\\frac{R_S}{2}\\frac{\\left(E^x\\right)'}{|E^x|}\\left[\\Theta\\left(x\\right)-\\Theta\\left(-x\\right)\\right].\n\n\n\n\n\n\n\n\n\n\n\n\\end{eqnarray}\n\n\n\n\nAll the relevant quantities can be \nreadily turned into well defined quantum operators. The operator\nassociated with $\\hat{E}^x$ is\n\\begin{eqnarray}\n{\\hat{E}^x(x_j) }\n|g,\\vec{k},\\vec{\\mu},r\\rangle &=& \\widehat{O(z(x_j))}|g,\\vec{k},\\vec{\\mu},r\\rangle\\nonumber\\\\&\\equiv&\n\\ell_{\\rm Pl}^2 k_{{\\rm Int}(z(x_j)v)}\n|g,\\vec{k},\\vec{\\mu},r\\rangle, \n\\end{eqnarray}\nwhere ${\\rm Int}$ refers to the integer part and $z(x)$ is an\narbitrary function taking values in $[-1,1]$ whose choice determines\nthe radial coordinate chosen, $n=2v+1$ is the number of vertices of\nthe spin network considered (we work in a finite domain of length $L$\nto avoid dealing with asymptotic issues involving spin nets). We\nrecall that $x_j$ is the radial coordinate of the $j$-th point in the\nspin network. So the Dirac observables are specified in terms of two\nparameters, one of them functional, $z(x)$ and $t$. Notice that the\nresulting metric is time-dependent. To understand this time dependence\nwe recall that in Eddington--Finkelstein coordinates time is related\nto the position of the shell by $t+x_r=V$ with $x_r$ the radius of\nthe shell, $E^x(r)=x_r^2$, and $V$ constant along the shell. The resulting picture of\nthe geometry is that of an ingoing shell that forms a black hole\ntraversing its event horizon, going towards $x=0$ and continuing\nbeyond to the region of $x<0$ as we observed in the case of test\nshells \\cite{testshell}. \n\nThe above physical description of the metric is qualitative, based on looking at the\nclassical expressions of the metric as Dirac observables. Let us\ndiscuss how this vision can be implemented in detail in the quantum\ntheory. \n\n\nWe will consider a situation with \n\nstates $\\vert \\vec{k}, m\\rangle$ which are eigenstates of $\\hat{O}$ and $\\hat{m}$,\nconstituting a basis,\nand form a wavepacket centered in $m_0, V_0$ of width $\\sigma_m$.  We\nproceed to construct a semiclassical solution based on a spin network\nwith $n$ vertices, $i=-v\\ldots v$. Although there are infinitely many\npossible choices for the position of the vertices we will choose a\nsimple one that leads to a good semiclassical behavior. We will place\nthe vertices of the spin network at radial positions $x_i=(i+1)\\Delta$\nand $\\Delta$ a spacing bounded below by the quantization of areas\n$\\Delta> \\ell_{\\rm Planck}^2/(2x_r)$. We have for $i\\ge0$ that $x_i\\in\n[\\Delta, L]$ with $L=\\Delta (v+1)$. Also,  $z(x)= x/L$ and\n$k_i={\\rm Int}(x_i^2/\\ell_{\\rm Planck}^2)$. In addition $\n\\left(E^x_i\\right)' =\\ell_{\\rm Planck}^2 \\frac{\\left(\n    k_i-k_{i-1}\\right)}{\\Delta} \\sim \\left(2i+1\\right)\\Delta.  $ On\nthe other hand, for $i<0$ we have that $k_i=-{\\rm\n  Int}(i^2\\Delta^2/\\ell_{\\rm Planck}^2)$ and $\\left(E^x_0\\right)'\n=\\ell_{\\rm Planck}^2 \\left(k_0-k_{-1}\\right)/\\Delta = 2\\Delta$ and it is\nnon-vanishing $i$'s where $k_i$, i.e. $E^x$, changes sign at $x=0$. \nThe allowed spin networks need to exclude the value $k_0=0$ in order to \nensure that the description is singularity free. The fact that both \nthe Hamiltonian constraint and the observables are independent of \n$K_x$ (conjugate to $E^x$) ensures that this condition is a consistent \nrestriction on the physical Hilbert space. Notice that $K_x$ is only present in \nthe diffeomorphism constraint that does not change the sequence of \nvalues $\\vec k$. With these\nassumptions the result of the quantum construction is essentially a\ndiscretization of the above classical expressions of the metric on a\nlattice determined by a given spin network. They are extremely well\napproximated by their classical counterparts in regions away from where\nthe classical singularity used to be. Close to it, such expressions\nare sensitive to the lattice chosen. However, to have good\nsemiclassical behavior in the regions far away from the singularity,\nit is best to consider superpositions of spin networks with different\nvalues of $\\vec{k}$ and $m$. This will imply that there are states \nproviding a description of the region close\n\nto where the singularity was where there will be large fluctuations of the\nmetric and therefore the singularity is replaced by a highly quantum but \nregular region that is not well approximated by a semiclassical space-time.\n\nBecause we are not including fields, and therefore Hawking radiation,\none ends up with a black hole that resembles the eternal black hole we\ndiscussed in the past \\cite{spherical}, with an interior region (which can \nbe viewed as a ``baby universe'') beyond where the singularity was that is\ndisconnected from the exterior. In a more realistic approximation\ninvolving Hawking radiation, the black hole will evaporate. Presumably\nin that case the region where the shell emerges will coincide with the\nexterior of the black hole. It is likely that we could approximate\nlarge portions of such space-time with the results of this paper,\nincluding the emergence of a shell from the highly quantum region that\nhas been conjectured in scenarios such as that of\n\\cite{asbo,rovelli,gapu,garay}. We cannot however provide a precise picture, in\nparticular, the time in which the shell emerges cannot be computed in\nthis approach, so generically for the outgoing shell one would have\n$-x_r+t+t_0=V$ with $t_0$ a constant.\n\nSummarizing, we have provided a detailed model for quantum collapse of\nmatter and formation of a black hole in a quantum geometry. It\nprovides insights into possible scenarios of black hole formation and\nevaporation.\n\nThis work was supported in part by Grant No. NSF-PHY-1305000, ANII\nFCE-1-2014-1-103974, funds of the Hearne Institute for Theoretical\nPhysics, CCT-LSU, and Pedeciba. J.O also acknowledges the projects\nMICINN/MINECO FIS2011-30145-C03-02 and FIS2014-54800-C2-2-P (Spain).\n\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem{spherical}\n  R.~Gambini and J.~Pullin,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 21, 211301 (2013)\n  [arXiv:1302.5265 [gr-qc]].\n\n\\bibitem{electrovac}\n  R.~Gambini, E.~M.~Capurro and J.~Pullin,\n  \n  Phys.\\ Rev.\\ D {\\bf 91}, no. 8, 084006 (2015)\n  [arXiv:1412.6055 [gr-qc]].\n\n\n\\bibitem{testshell}\n  R.~Gambini and J.~Pullin,\n  \n  Class.\\ Quant.\\ Grav.\\  {\\bf 32}, no. 3, 035003 (2015)\n  [arXiv:1408.4635 [gr-qc]].\n\n\\bibitem{mg}\nN. Barrios, R. Gambini, J. Pullin, Proceedings of the 14th Marcel\nGrossmann Meeting,  arXiv:1512.04766 [gr-qc]. \n\n\\bibitem{louko}\n  J.~Louko, B.~F.~Whiting and J.~L.~Friedman,\n  \n  Phys.\\ Rev.\\ D {\\bf 57}, 2279 (1998)\n  [gr-qc/9708012].\n\n\n\\bibitem{kuchar}\n  K.~V.~Kuchar,\n  \n  Phys.\\ Rev.\\ D {\\bf 50}, 3961 (1994)\n  [gr-qc/9403003].\n\n\\bibitem{sphericaljavi}\n  R.~Gambini, J.~Olmedo and J.~Pullin,\n  \n  Class.\\ Quant.\\ Grav.\\  {\\bf 31}, 095009 (2014)\n  [arXiv:1310.5996 [gr-qc]].\n\n\\bibitem{hawking}\n  R.~Gambini and J.~Pullin,\n  \n  Class.\\ Quant.\\ Grav.\\  {\\bf 31}, 115003 (2014)\n  [arXiv:1312.3595 [gr-qc]].\n\n\n\\bibitem{asbo}\n  A.~Ashtekar and M.~Bojowald,\n  \n  Class.\\ Quant.\\ Grav.\\  {\\bf 22}, 3349 (2005)\n  [gr-qc/0504029].\n\\bibitem{rovelli}\n  A.~Barrau, C.~Rovelli and F.~Vidotto,\n  \n  Phys.\\ Rev.\\ D {\\bf 90}, no. 12, 127503 (2014)\n  [arXiv:1409.4031 [gr-qc]].\n\\bibitem{gapu}\n  R.~Gambini and J.~Pullin,\n  \n  PoS FFP {\\bf 14}, 038 (2015)\n  [arXiv:1408.3050 [gr-qc]].\n\\bibitem{garay}\n  C.~Barcel\\'o, R.~Carballo-Rubio and L.~J.~Garay,\n  \n  arXiv:1511.00633 [gr-qc].\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 10912, "prevtext": "\n\n\n\n\\title{Quantum self-gravitating collapsing matter in a quantum geometry}\n\n\n\n\\author{Miguel Campiglia$^{1}$, Rodolfo Gambini$^{1}$, Javier\n  Olmedo$^{2}$, \nJorge Pullin$^{2}$}\n\\affiliation {\n1. Instituto de F\\'{\\i}sica, Facultad de Ciencias, \nIgu\\'a 4225, esq. Mataojo, 11400 Montevideo, Uruguay. \\\\\n2. Department of Physics and Astronomy, Louisiana State University,\nBaton Rouge, LA 70803-4001}\n\n\n\\begin{abstract}\n  The problem of how space-time responds to gravitating quantum matter\n  in full quantum gravity has been one of the main questions that any\n  program of quantization of gravity should address.  Here we analyze\n  this issue by considering the quantization of a collapsing null\n  shell coupled to spherically symmetric loop quantum gravity. We show that the\n  constraint algebra of canonical gravity is Abelian both classically\n  and when quantized using loop quantum gravity techniques. The\n  Hamiltonian constraint is well defined and suitable Dirac\n  observables characterizing the problem were identified at the\n  quantum level. We can write the metric as a parameterized\n  Dirac observable at the quantum level and study the physics of the\n  collapsing shell and black hole formation. We show how the\n  singularity inside the black hole is eliminated by loop quantum\n  gravity and how the shell can traverse it. The construction is\n  compatible with a scenario in which the shell tunnels into a baby\n  universe inside the black hole or one in which it could emerge through a\n  white hole.\\end{abstract}\n\\maketitle\n\n\n\nThere has been recent progress in loop quantum gravity with spherical\nsymmetry. The key ingredient is the realization that through suitable\ncombinations and rescalings the constraint algebra can be made a Lie\nalgebra, both at a classical level and when quantized using loop\nquantum gravity techniques \\cite{spherical}. In vacuum the theory can\nbe solved in closed form including finding the space of physical\nstates annihilated by the constraints and suitable self-adjoint Dirac\nobservables characterizing the physics. The singularity that is\npresent inside black holes in the classical theory is replaced in the\nquantum theory with a region with large curvatures, large fluctuations\nof the curvature and high sensitivity to Planck scale microstructure,\nso it cannot be well approximated by a semiclassical geometry. The\ntheory is well defined there and eventually one reaches a region\ninside the black hole where space-time is again semiclassical. This\nanalysis has also been generalized to the electrovac case\n\\cite{electrovac}. Test (non-backreacting) shells were also studied in\nthis framework \\cite{testshell}. In this letter we would like to\nanalyze the case of a self-gravitating shell. This is significant\nsince it is the first full quantum treatment of a midisuperspace model\nincluding quantum matter in loop quantum gravity. It would also\nprovide a model for the emergence of a shell from a white hole, as\nconjectured in several heuristic scenarios. It could also provide the\nstarting point for studying the backreaction of Hawking radiation on a\nblack hole, which cannot be properly studied with the previously\nexisting solutions, which were time independent \\cite{mg}.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn a previous paper \\cite{testshell} we studied the motion of\nquantized null shells in a fixed quantum geometry background. In this\nwork we would like to consider the full backreaction of the shells on\nthe quantum geometry. We start from the Hamiltonian considered in\nour previous manuscript. The context is spherically symmetric gravity\nwritten in terms of Ashtekar variables. There are two pairs of\ncanonical variables $E^\\varphi$, ${K}_\\varphi$ and $E^x$, $K_x$, that\nare related to the traditional canonical variables in spherical\nsymmetry $ds^2=\\Lambda^2 dx^2+R^2 d\\Omega^2$ by\n$\\Lambda=E^\\varphi/\\sqrt{|E^x|}$, $P_\\Lambda= -\\sqrt{|E^x|}K_\\varphi$,\n$R=\\sqrt{|E^x|}$ and $P_R=-2\\sqrt{|E^x|} K_x -E^\\varphi\nK_\\varphi/\\sqrt{|E^x|}$ where $P_\\Lambda, P_R$ are the momenta\ncanonically conjugate to $\\Lambda$ and $R$ respectively, $x$ is the\nradial coordinate and $d\\Omega^2=d\\theta^2+\\sin^2\\theta\nd\\varphi^2$. We will take the Immirzi parameter and Newton's constant\nto be unity.  \n\nThe total Hamiltonian (after a rescaling and an integration by parts) \nis given by\n\\begin{eqnarray}\nH_T &=&\\int dx \\bigg[ -N'\n  \\bigg(-\\sqrt{\\vert\n      E^x\\vert}\\left(1+K_\\varphi^2\\right)\\nonumber\\\\\n&&+\\frac{\\left[\\left(E^x\\right)'\\right]^2\\sqrt{\\vert E^x\\vert}}{4\n          \\left(E^\\varphi\\right)^2}\n+ \nF(r)p\\, \\Theta(x-r)+2M\\bigg)\\nonumber\\\\\n&& \n+ N^x \\left[-\n(E^x)' K_x +E^\\varphi K_\\varphi' - p\\,\n\\delta\\left(x-r\\right)\\right]\\bigg]\\nonumber\\\\\n&&+N_-M + \\frac{N_+}{2} \\left[F(r)p+M\\right], \n\\end{eqnarray}\nwith $\\Theta$ the Heaviside function, $r$ the position of the shell\nand $p$ its canonical momentum.  Following Louko et al. \\cite{louko}\nwe took the coordinates $x,r$ to have the $(-\\infty,\\ldots,\\infty)$\nrange and assumed that the variables have the usual fall-offs in\nasymptotic radial coordinates. We are including the usual boundary term\nat spatial infinity with $N_+$ the lapse there $N_-$ the lapse at the\nother end of the manifold extended beyond where the singularity in the\nclassical theory used to be and, as we will see, is removed by loop\nquantum gravity like in the static case \\cite{spherical}. We are\nallowing the possibility of a pre-existing black hole of mass\n$M$. Also, $ F(r) = \\sqrt{|E^x|} \\left(\\eta\n  \\left(E^x\\right)'\\left(E^\\varphi\\right)^{-2} + 2 K_\\varphi\n  \\left(E^\\varphi\\right)^{-1} \\right)\\vert_{x=r}.$ $N$ is a rescaled\nlapse, $N=N_{\\rm orig} E^\\varphi/\\left(E^x\\right)'$ with $N_{\\rm\n  orig}$ the original unrescaled lapse and the shift is also changed\n$N^x = N^x_{\\rm orig} + 2 N_{\\rm orig}\nK_\\varphi\\sqrt{|E^x|}/\\left(E^x\\right)'$ with prime denoting derivative\nwith respect to the radial coordinate $x$. The parameter $\\eta=\\pm 1$\nis the sign of the momentum, depending on it one will have shells that\nare either outgoing or ingoing if one is outside the black hole.\n\n\n\n\n\n\n\n\n\n\n\nNotice that $m\\equiv F(r)p/2$ is a Dirac observable, which can be verified by\ndirect calculation of its Poisson brackets with the constraints. Also,\ntaking into account the falloff of the gravitational variables at\nspatial infinity the constraint indicates that the ADM mass of the\nspace-time is $M+m$ (if there is no pre-existing black hole in the\nspace time and all the mass is provided by the shell we have\n$M=0$). The lapse at infinity $N_+$ may be written as usual\n\\cite{kuchar} in terms of the proper time at infinity $\\tau$ as\n$N_+=\\dot{\\tau}$. It can also be verified that the Hamiltonian for\ngravity coupled to a shell has an Abelian algebra with itself. One can\nalso check that the Poisson brackets with the diffeomorphism\nconstraint are the usual ones.\n\nThere also exists a Dirac observable, \n$\n  V \\equiv -\\int_r^\\infty dy \\left[-2 F^{-1}(y) +\\eta\\left(1+2\n      (M+m)/y\\right)\\right] +\\tau -\\eta\\left[r+2 (M+m) \\ln(r/(2(M+m)))\\right],\n$\nand it can be checked that it has vanishing Poisson brackets with all\nthe constraints and is canonically conjugate to $m$. The observable\n$V$ is associated with\nthe Eddington--Finkelstein coordinate $v$ of an observer at\nscri\nfrom which the shell is incoming or exiting.\n\n\nFor the quantization, we choose the same Hilbert space as in the test\nshell case, which is a direct product of the Hilbert space of vacuum\nspherically symmetric gravity and $L^2$ functions for the shell. As in\nprevious papers for the gravitational part we consider linear\ncombinations of products of cylindrical functions of the form,\n\\begin{eqnarray} T_{g,\\vec{k},\\vec{\\mu}}(K_x,K_\\varphi) &=&\\prod_{e_j\\in\ng} \\exp\\left(\\frac{i}{2} k_{j} \\int_{e_j} dx\\,K_x(x)\\right)\\nonumber\\\\\n&&\\times \\prod_{x_j\\in g} \\exp\\left(\\frac{i}{2} \\mu_{j} K_\\varphi(x_j) \\right),\n\\end{eqnarray} where the label $k_j\\in\\mathbb{Z}$ is the valence\nassociated with the edge $e_j$, and $\\mu_j\\in\\mathbb{R}$ the valence\nassociated with the vertex $x_j$ (usually called ``coloring'').\n\nWe adopt a representation for the point holonomies as quasi-periodic\nfunctions (for an alternative choice see \\cite{sphericaljavi}), so\nthat the labels $\\mu_j$ belong to a countable subset of the real line\nwith equally displaced points. We take $\\mu_j=2\\rho\n(l_j+\\delta_j)$ with $l_j$ an integer, $\\delta_j$ between $0$ and\n$1$ and $\\rho$ is the polymerization parameter. The kinematical\nHilbert space associated with a given graph $g$ is, \n$ {\\cal H}^g_{\\rm kin}={\\cal H}_{\\rm kin}^M\\otimes{\\cal\nH}_{\\rm kin}^{\\rm sh}\\otimes \\left[\\bigotimes_{j=1}^n\\ell^2_j\\otimes\n\\ell_{\\delta_j}^2\\right],$\nwhere $\\ell_{j}^2$ and $\\ell_{\\delta_j}^2$ denote the space of square\nsummable functions of $k_j$ and $\\mu_j$, respectively, ${\\cal H}_{\\rm\n  kin}^M$ is the Hilbert space of square summable functions of the\nADM mass and ${\\cal H}_{\\rm kin}^{\\rm sh}$ is the Hilbert space associated\nwith the shell variables, square integrable functions of $r$.\n\n\nThe full Hilbert space is equipped with the inner product\n$ \\langle\ng,\\vec{k},\\vec{\\mu},M,r |g',\\vec{k}',\\vec{\\mu}',M',r'\n\\rangle=\\delta(M-M')\\delta(r,r')\\delta_{\\vec{k},\\vec{k}'}\\delta_{\\vec{\\mu},\\vec{\\mu}'}\\delta_{g,g'},\n$ where $\\delta_{g,g'}$ is equal to the unit if $g = g'$\nor zero otherwise, and similarly for $\\vec{k}$ and $\\vec{\\mu}$.\n\n\nOn this space we have several well defined basic operators. The mass\nand triads act multiplicatively and the operators associated with the\nconnection variables are holonomies in the case of $K_x$ and point\nholonomies in the case of $K_\\varphi$. Explicit expressions are given\nin \\cite{sphericaljavi}.\n\nWe write the Hamiltonian constraint as,\n$\n  \\tilde{H}(x) = H_g(x)+ F(r)p\\, \\Theta(x-r).\n$\nThe operator $\\hat{E}^\\varphi$ only acts at the vertices as the point\nholonomies for $K_\\varphi$ only have support there. This leads us to\nconsider a Hamiltonian constraint that only acts at the vertices, just\nlike in the full theory, \n\\begin{eqnarray}\n\\hat{H}(x_j)  &:=&   \\mathbf{H}^{\\rm g}_j + \\frac{1}{2} (\\boldsymbol{\\theta}_j \\; \\widehat{F(r)p}  + \\widehat{F(r)p} \\;  \\boldsymbol{\\theta}_j)\\nonumber\\\\\n&  =&   \\mathbf{H}^{\\rm g}_j + \\frac{1}{2} \\sum_i \\mathbf{F}_i (\\boldsymbol{\\theta}_j \\mathbf{X}_i + \\mathbf{X}_i \\boldsymbol{\\theta}_j),\n\\end{eqnarray}\nwhere $\\boldsymbol{\\theta}_j$ and $\\mathbf{X}_j$ are\noperators acting on the wavefunction of the shell and defined as,\n\\begin{eqnarray}\n\\boldsymbol{\\theta}_j \\psi(r) & :=&\n\n  \\int_0^{\\epsilon_j} d \\epsilon \\theta(x_j+\\epsilon-r)  \\; \\psi(r), \\\\\n\\boldsymbol{\\delta}_j \\psi(r)  &:=& \n\n\\int_0^{\\epsilon_j} d \\epsilon \\delta(x_j+\\epsilon-r) \\;  \\psi(r), \\\\\n\\mathbf{X}_j  & :=& \\frac{1}{2}( \\boldsymbol{\\delta}_j  \\hat{p} +\n\\hat{p} \\boldsymbol{\\delta}_j), \\quad\n\\hat{p} \\psi (r)  := -i \\partial_r \\psi(r), \n\\end{eqnarray}\nand $\\epsilon_j$ is the spacing of the vertices\n$\\epsilon_j=x_{j+1}-x_j$. The gravitational and shell parts \nof the Hamiltonian\nare, \n\n", "index": 1, "text": "\\begin{align}\n  \\mathbf{H}^{\\rm g}_j &= \\widehat{H_{\\rm g}(x_j)}=\n\\hat{b}_j \\left(-1-\\widehat{K_\\varphi^2}(x_j)+{\\hat{a}_j^2 \\widehat{[1/E^\\varphi]^{2}}(x_j)\n        }+2\\hat M\\right),\\\\\n\\mathbf{F}_j&=  \\widehat{F(x_j)}=2\\, \\hat{b}_j\\left(\\hat{a}_j\n  \\widehat{[1/E^\\varphi]^{2}}(x_j) + \n\\widehat{[K_\\varphi/E^\\varphi]}(x_j)\\right).\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathbf{H}^{\\rm g}_{j}\" display=\"inline\"><msubsup><mi>𝐇</mi><mi>j</mi><mi mathvariant=\"normal\">g</mi></msubsup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\widehat{H_{\\rm g}(x_{j})}=\\hat{b}_{j}\\left(-1-\\widehat{K_{%&#10;\\varphi}^{2}}(x_{j})+{\\hat{a}_{j}^{2}\\widehat{[1/E^{\\varphi}]^{2}}(x_{j})}+2%&#10;\\hat{M}\\right),\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mover accent=\"true\"><mrow><msub><mi>H</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>^</mo></mover><mo>=</mo><mrow><msub><mover accent=\"true\"><mi>b</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mrow><mo>-</mo><mn>1</mn></mrow><mo>-</mo><mrow><mover accent=\"true\"><msubsup><mi>K</mi><mi>φ</mi><mn>2</mn></msubsup><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><msubsup><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi><mn>2</mn></msubsup><mo>⁢</mo><mover accent=\"true\"><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>/</mo><msup><mi>E</mi><mi>φ</mi></msup></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mover accent=\"true\"><mi>M</mi><mo stretchy=\"false\">^</mo></mover></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\mathbf{F}_{j}\" display=\"inline\"><msub><mi>𝐅</mi><mi>j</mi></msub></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\widehat{F(x_{j})}=2\\,\\hat{b}_{j}\\left(\\hat{a}_{j}\\widehat{[1/E^%&#10;{\\varphi}]^{2}}(x_{j})+\\widehat{[K_{\\varphi}/E^{\\varphi}]}(x_{j})\\right).\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mover accent=\"true\"><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>^</mo></mover><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mn>2</mn></mpadded><mo>⁢</mo><msub><mover accent=\"true\"><mi>b</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">^</mo></mover><mi>j</mi></msub><mo>⁢</mo><mover accent=\"true\"><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>/</mo><msup><mi>E</mi><mi>φ</mi></msup></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mover accent=\"true\"><mrow><mo stretchy=\"false\">[</mo><mrow><msub><mi>K</mi><mi>φ</mi></msub><mo>/</mo><msup><mi>E</mi><mi>φ</mi></msup></mrow><mo stretchy=\"false\">]</mo></mrow><mo>^</mo></mover><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>x</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]