[{"file": "1601.06484.tex", "nexttext": "\n\nTo date, no neutrino signal has been detected in searches for muon neutrinos from GRBs in multiple years of data from AMANDA, the partially-instrumented IceCube, and the completed IceCube detector\\citep{amandacscd2007,ic22paper,grbic40paper,ic59nature,grb4year}, nor in four years of data by the ANTARES collaboration \\citep{ANTARESGRBcscd,ANTARESGRB2013,ANTARESGRB2013b}.  High energy $\\nu_{\\mu}$ charged-current interactions produce high energy muons that manifest as extended Cherenkov light patterns in the South Pole glacial ice, referred to as ``tracks\"; and Southern Hemisphere bursts were often excluded from searches for this signal in order to remove the dominant cosmic-ray-induced muon background.  Adding the low-background ``shower\" channel from interactions other than charged-current $\\nu_{\\mu}$ gives enhanced sensitivity to such bursts, improving the sensitivity of the overall correlation analysis.\n\nThis paper is ordered as follows.  In Section \\ref{sec:promptgrbnuspec}, we describe the neutrino spectra predicted by the different fireball models on which we place limits.  In Section \\ref{sec:detector}, we describe the IceCube detector and data acquisition system.  We discuss the simulation and reconstruction of events in IceCube in Section \\ref{sec:simandreco}.  We detail the event selection techniques and likelihood analysis in Sections \\ref{sec:eventselect} and \\ref{sec:llh}.  Finally, in Section \\ref{sec:results} we present the results of this all-sky three-flavor shower search in combination with those from the $\\nu_{\\mu}$ track searches, and conclude in Section \\ref{sec:outlook}.\n\n\\section{Prompt GRB Neutrino Predictions}\n\\label{sec:promptgrbnuspec}\n\nIn this search for GRB neutrinos, we examine data during the time of gamma-ray emission reported by any satellite for each burst.  We do not consider possible precursor \\citep{razzaque2003} or afterglow \\citep{wb2000,murase2006,burrows2007} neutrino emission far outside of this prompt window.  In Section \\ref{sec:results} we place limits on two classes of GRB prompt neutrino flux predictions: models normalized to the observed UHECR flux \\citep{katz2009energy} and models normalized to the observed gamma-ray flux for each burst.\n\nThe cosmic-ray-normalized models \\citep{wb1997,waxman2003,probation2011} assume protons emitted by GRBs are the dominant sources of the highest energy cosmic rays observed, and with these models we place limits on this assumption.  The neutrino spectral break and normalization also depends on the bulk Lorentz boost factor $\\Gamma$ and gamma-ray break energy in the GRB fireball.  Typical values required for pion production lead to the emission of $\\sim 100$ TeV neutrinos.  In Section \\ref{sec:results}, we place limits on the expected neutrino flux at different break energies.\n\nThe gamma-ray-normalized models \\citep{winter2012,zhang2012} do not relate the observed cosmic ray flux to neutrinos produced in GRB fireballs, and with these models we place limits on internal fireball parameters.  We consider three types of gamma-ray-spectrum-normalized fireball models, calculated on a burst-by-burst basis, that differ in their neutrino emission sites.  The internal shock model relates the neutrino production radius to the variability time scale of the gamma-ray light curves \\citep{wb1997,winter2012,zhang2012}.  The photospheric model places the radius at the photosphere through combinations of processes such as internal shocks, magnetic reconnection, and neutron-proton collisions \\citep{rees2005,murase2008photo,zhang2011}.  The internal collision-induced magnetic reconnection and turbulence (ICMART) model favors a neutrino production radius $\\sim 10$ times larger than the standard internal shock model due to a Poynting-flux-dominated outflow that remains undissipated until internal shocks destroy the ordered magnetic fields \\citep{zhang2011,zhang2012}.  These models assert that gamma-ray emission and proton acceleration occur at the same radius.  This equivalence is not necessarily true for scenarios other than the single-zone internal shock model \\citep{multipleis2015}, but allows the predicted neutrino flux to scale linearly with the proton-to-electron energy ratio in the fireball.  Additionally, the models addressed in this work do not account for a possible enhancement to the high energy neutrino flux due to acceleration of secondary particles \\citep{klein2013muon,winter2014muon}.\n\nWe calculate the per-GRB predictions normalized to the measured gamma-ray spectra numerically with a wrapper of the Monte-Carlo generator SOPHIA \\citep{sophia}, taking into account the full particle production chain and synchrotron losses in inelastic $p\\gamma$ interactions.  For these calculations, we parametrize the reported gamma-ray spectrum of each GRB as a broken power-law approximation of the Band function \\citep{band1993,zhang2012}.  We retrieve GRB parameters from the circulars published by satellite detectors on the Gamma-ray Coordinates Network\\footnote{\\url{http://gcn.gsfc.nasa.gov}} and the Fermi GBM database \\citep{fermicat,fermispec}.  We compile the relevant temporal, spatial, and spectral parameters used in this analysis on our GRBweb database, presented on a publicly-available website\\footnote{\\url{http://grbweb.icecube.wisc.edu}} \\citep{grbwebicrc}.  The prompt photon emission time ($T_{100}$) is defined by the most inclusive start and end times ($T_1$ and $T_2$) reported by any satellite.  We use the most precise localization available.  Following the same prescription of our previous model limit calculations \\citep{grbic40paper,ic59nature,grb4year}, if the fluence is unmeasured, we use an average value of $10^{-5}$ erg cm$^{-2}$; if the gamma-ray break energy is unmeasured, we use 200~keV for $T_{100} > 2$~s bursts and 1000~keV for $T_{100} \\leq 2$~s bursts; and if the redshift is unmeasured, we use 2.15 for $T_{100} > 2$~s bursts and 0.5 for $T_{100} \\leq 2$~s bursts.\n\nThe neutrino flux predictions depend on several unmeasured quantities; we use variability time scale 0.01 s and isotropic luminosity $10^{52}$ erg cm$^{-2}$ for long bursts and variability time scale 0.001 s and isotropic luminosity $10^{51}$ erg cm$^{-2}$ for short bursts, which are consistent with the literature \\citep{baerwald2014,winter2012,zhang2012}.  If the redshift is known for a particular burst, we calculate the approximate isotropic luminosity from the redshift, photon fluence, and $T_{100}$ \\citep{winter2012}.\n\nFigure \\ref{grbspectra} illustrates neutrino spectra from the three models with benchmark fireball parameters.  These benchmark parameters are bulk Lorentz boost factor $\\Gamma = 300$ and proton-to-electron energy ratio, or baryonic loading, $f_p = 10$.  These spectra are presented as per-flavor quasi-diffuse fluxes, in which we divide the total fluence from all GRBs in the sample by the full sky $4\\pi$ steradians and one year in seconds, and scale the total number of bursts to a predicted average 667 observable bursts per year, which has been used in our previous IceCube publications \\citep{ic22paper,grbic40paper,ic59nature,grb4year}.  The actual number of bursts observed by satellite detectors in each year is less than the predicted average because of detector field of view limitations and obstruction by the sun, earth, and moon.  For all GRBs we assume that neutrino oscillations over cosmic baselines result in equal fluxes for all flavors.\n\n\\begin{figure}[tbp]\n \\plotone{fig1.pdf}\n \\caption{Per-flavor quasi-diffuse all-sky flux predictions, calculated with the $\\gamma$ spectra of all GRBs included in this three-year search, for three different models of fireball neutrino production.  These fluxes assume $\\Gamma=300$, $f_p=10$, full flavor mixing at earth, and 667 observable GRBs per year.  These models differ in the radius at which $p\\gamma$ interactions occur.  The solid segments indicate the central 90\\% energies of neutrinos that could be detected by IceCube. \n \\label{grbspectra}}\n\\end{figure}\n\n\\section{The IceCube Detector}\n\\label{sec:detector}\n\nThe IceCube detector \\citep{icfirstyear} consists of 5160 digital optical modules (DOMs) instrumented over 1 km$^3$ of clear glacial ice 1450~m to 2450~m below the surface at the geographic South Pole.  IceCube is the largest neutrino detector in operation.  Each DOM incorporates a 10~in. diameter photomultiplier tube (PMT) \\citep{pmtpaper}.  Signal and power connections between the DOMs and the computer farm at the surface are provided by 86 vertical in-ice cables or ``strings\" that each connect 60 DOMs spaced uniformly.  Adjacent strings are separated by about 125 m.  The DeepCore array \\citep{dcdesignperf} is made up of a more densely spaced subset of strings that are located in the clearest ice at depths below 2100 m and contain higher quantum efficiency PMTs.\n\nSensor deployment began during the 2004-2005 austral summer. Physics data collection began in 2006 with the 9-string configuration and continued with partial detector configurations through completion of the 86 strings in December 2010.  We conducted the analysis presented in this paper using data taken from May 2010 through May 2013, with one year using the 79-string configuration and two years using the completed detector.\n\nThe DOM PMTs detect the Cherenkov radiation of relativistic charged particles produced in deep inelastic neutrino-nucleon scattering in or near the detector volume.  Data acquisition \\citep{daqpaper} begins once the output current exceeds the threshold of $1/4$ of the mean peak current of the pulse amplified from a single photo-electron.  If another such ``hit\" is recorded in a neighboring or next-to-neighboring DOM within 1 $\\mu$s, the full waveform information is recorded.  DOMs with hits failing this local coincidence condition report a short summary of their recorded waveform for inclusion in data records.  The digitized waveforms are sent to the computers at the surface, where they are assembled into ``events\" by a software trigger \\citep{daqpaper,kelley2014trigger}.  The relative timing resolution of photons within an event is about 2~ns \\citep{icfirstyear}.  Data are sent daily from the detector to computers in the Northern Hemisphere via satellite.\n\nThere are two main interaction topologies that can manifest in hit DOMs during an event: a thin track or a near-spherical shower.  Track-like light emission is generated by muons created either through cosmic ray interactions in the atmosphere or $\\nu_{\\mu}$ interacting in the ice.  Shower-like light emission, which is the signal of this analysis, is generated by electromagnetic cascades from charged current interactions of $\\nu_e$ and $\\nu_{\\tau}$ and hadronic cascades from neutral current interactions of $\\nu_e$, $\\nu_{\\tau}$, and $\\nu_{\\mu}$ in the ice.\n\nElectromagnetic cascades of photons, electrons, and positrons develop through radiative processes, such as bremsstrahlung and pair production.  Once the energy of each particle in the cascade is below the critical energy, non-radiative processes, such as ionization and Compton scattering dominate and the shower stops growing.  Hadronic cascades result from showers of baryons and mesons produced by deep inelastic scattering interactions of all neutrino types.  Interactions of $\\bar{\\nu}_e$ with electrons via the Glashow resonance at 6.3~PeV would also produce cascade signal for this analysis; however, this resonance has not yet been observed.\n\n\\section{Simulated Data and Reconstruction}\n\\label{sec:simandreco}\n\nWe use Monte Carlo simulations of neutrinos interacting in the IceCube detector for the signal hypothesis in our event selection and optimization for this search.  Neutrinos are simulated with the \\texttt{NEUTRINO-GENERATOR} program, a port of the \\texttt{ANIS} code \\citep{nugen2005}.  We use \\texttt{NEUTRINO-GENERATOR} to distribute neutrinos with a power-law spectrum uniformly over the entire sky and then we propagate them through the earth and ice.  The simulated neutrino-nucleon interactions take cross sections from CTEQ5 \\citep{cteq5}.  The Earth's density profile is modeled with the Preliminary Reference Earth Model \\citep{prem1981}.  The propagation code takes into account absorption, scattering, and neutral-current regeneration.\n\nAlthough we use data outside of GRB gamma-ray emission time windows for our background, simulated neutrinos and muons generated in cosmic ray air showers are useful checks to characterize our background and estimate the signal purity of our final data sample.  We apply the Honda et al. spectrum \\citep{honda2006} for the atmospheric neutrino background.  We use the  \\texttt{CORSIKA} simulation package \\citep{heck1998} to simulate cosmic ray air showers.  Muons are traced through the ice and bedrock incorporating continuous and stochastic energy losses \\citep{mmc}.  The PMT detection of Cherenkov light from muon tracks and showers is simulated using ice and dust layer properties determined in detailed studies and simulations \\citep{photonics} \\citep{ice}.  Finally, we simulate the DOM triggering and signal from all interactions.  We process these signals in the same way as described in Section \\ref{sec:detector}.\n\nWe use the geometric pattern, timing, and amount of recorded photons in an interaction to reconstruct and identify the incident particle.  We run simple analytic reconstructions automatically in data filters at the Pole and more complex reconstructions on the reduced data in the North.  These reconstructions provide powerful discriminating features that we employ in our event selection methods, described in the next section.\n\nOne of the analytic calculations used to identify shower-like events is the ``tensor-of-inertia\" algorithm of \\cite{amandareco} that determines an interaction vertex by calculating a ``center of mass,\" where the mass terms correspond to the number of photoelectrons recorded by each DOM.  The eigenvector along the longest principle axis provides a reasonable guess for the incident particle trajectory.  Using the rigid body analogy, a spherical shower should provide nearly even tensor-of-inertia eigenvalues, while an elongated track should have one eigenvalue much smaller than the other two.\n\nA second analytic calculation is the ``line-fit\" algorithm of \\cite{amandareco} that ignores the geometry of the Cherenkov cone and the optical properties of the medium and assumes light travels along a one-dimensional path at some constant velocity through the detector.  This algorithm determines a best-fit track, but provides a good indicator for spherical showers, which exhibit slower best-fit velocities than tracks.  We recalculate this fit during the final level of event selection using an improved version of the algorithm that discards photons due to uncorrelated noise \\citep{improvedlf}.\n\nWe also perform fast reconstructions based on an analytic likelihood function.  In general, we determine the set of parameters $\\textbf{a}=\\left\\{a_1,a_2,...,a_m\\right\\}$ of an event that maximizes the likelihood function\n\n\n", "itemtype": "equation", "pos": 17947, "prevtext": "\n\n\n\n\n\n\n\\author{\nIceCube Collaboration:\nM.~G.~Aartsen\\altaffilmark{1},\nK.~Abraham\\altaffilmark{2},\nM.~Ackermann\\altaffilmark{3},\nJ.~Adams\\altaffilmark{4},\nJ.~A.~Aguilar\\altaffilmark{5},\nM.~Ahlers\\altaffilmark{6},\nM.~Ahrens\\altaffilmark{7},\nD.~Altmann\\altaffilmark{8},\nT.~Anderson\\altaffilmark{9},\nI.~Ansseau\\altaffilmark{5},\nG.~Anton\\altaffilmark{8},\nM.~Archinger\\altaffilmark{10},\nC.~Arguelles\\altaffilmark{11},\nT.~C.~Arlen\\altaffilmark{9},\nJ.~Auffenberg\\altaffilmark{12},\nX.~Bai\\altaffilmark{13},\nS.~W.~Barwick\\altaffilmark{14},\nV.~Baum\\altaffilmark{10},\nR.~Bay\\altaffilmark{15},\nJ.~J.~Beatty\\altaffilmark{16,17},\nJ.~Becker~Tjus\\altaffilmark{18},\nK.-H.~Becker\\altaffilmark{19},\nE.~Beiser\\altaffilmark{6},\nS.~BenZvi\\altaffilmark{20},\nP.~Berghaus\\altaffilmark{3},\nD.~Berley\\altaffilmark{21},\nE.~Bernardini\\altaffilmark{3},\nA.~Bernhard\\altaffilmark{2},\nD.~Z.~Besson\\altaffilmark{22},\nG.~Binder\\altaffilmark{23,15},\nD.~Bindig\\altaffilmark{19},\nM.~Bissok\\altaffilmark{12},\nE.~Blaufuss\\altaffilmark{21},\nJ.~Blumenthal\\altaffilmark{12},\nD.~J.~Boersma\\altaffilmark{24},\nC.~Bohm\\altaffilmark{7},\nM.~B\\\"orner\\altaffilmark{25},\nF.~Bos\\altaffilmark{18},\nD.~Bose\\altaffilmark{26},\nS.~B\\\"oser\\altaffilmark{10},\nO.~Botner\\altaffilmark{24},\nJ.~Braun\\altaffilmark{6},\nL.~Brayeur\\altaffilmark{27},\nH.-P.~Bretz\\altaffilmark{3},\nN.~Buzinsky\\altaffilmark{28},\nJ.~Casey\\altaffilmark{29},\nM.~Casier\\altaffilmark{27},\nE.~Cheung\\altaffilmark{21},\nD.~Chirkin\\altaffilmark{6},\nA.~Christov\\altaffilmark{30},\nK.~Clark\\altaffilmark{31},\nL.~Classen\\altaffilmark{8},\nS.~Coenders\\altaffilmark{2},\nG.~H.~Collin\\altaffilmark{11},\nJ.~M.~Conrad\\altaffilmark{11},\nD.~F.~Cowen\\altaffilmark{9,32},\nA.~H.~Cruz~Silva\\altaffilmark{3},\nJ.~Daughhetee\\altaffilmark{29},\nJ.~C.~Davis\\altaffilmark{16},\nM.~Day\\altaffilmark{6},\nJ.~P.~A.~M.~de~Andr\\'e\\altaffilmark{33},\nC.~De~Clercq\\altaffilmark{27},\nE.~del~Pino~Rosendo\\altaffilmark{10},\nH.~Dembinski\\altaffilmark{34},\nS.~De~Ridder\\altaffilmark{35},\nP.~Desiati\\altaffilmark{6},\nK.~D.~de~Vries\\altaffilmark{27},\nG.~de~Wasseige\\altaffilmark{27},\nM.~de~With\\altaffilmark{36},\nT.~DeYoung\\altaffilmark{33},\nJ.~C.~D{\\'\\i}az-V\\'elez\\altaffilmark{6},\nV.~di~Lorenzo\\altaffilmark{10},\nH.~Dujmovic\\altaffilmark{26},\nJ.~P.~Dumm\\altaffilmark{7},\nM.~Dunkman\\altaffilmark{9},\nB.~Eberhardt\\altaffilmark{10},\nT.~Ehrhardt\\altaffilmark{10},\nB.~Eichmann\\altaffilmark{18},\nS.~Euler\\altaffilmark{24},\nP.~A.~Evenson\\altaffilmark{34},\nS.~Fahey\\altaffilmark{6},\nA.~R.~Fazely\\altaffilmark{37},\nJ.~Feintzeig\\altaffilmark{6},\nJ.~Felde\\altaffilmark{21},\nK.~Filimonov\\altaffilmark{15},\nC.~Finley\\altaffilmark{7},\nS.~Flis\\altaffilmark{7},\nC.-C.~F\\\"osig\\altaffilmark{10},\nT.~Fuchs\\altaffilmark{25},\nT.~K.~Gaisser\\altaffilmark{34},\nR.~Gaior\\altaffilmark{38},\nJ.~Gallagher\\altaffilmark{39},\nL.~Gerhardt\\altaffilmark{23,15},\nK.~Ghorbani\\altaffilmark{6},\nD.~Gier\\altaffilmark{12},\nL.~Gladstone\\altaffilmark{6},\nM.~Glagla\\altaffilmark{12},\nT.~Gl\\\"usenkamp\\altaffilmark{3},\nA.~Goldschmidt\\altaffilmark{23},\nG.~Golup\\altaffilmark{27},\nJ.~G.~Gonzalez\\altaffilmark{34},\nD.~G\\'ora\\altaffilmark{3},\nD.~Grant\\altaffilmark{28},\nZ.~Griffith\\altaffilmark{6},\nC.~Ha\\altaffilmark{23,15},\nC.~Haack\\altaffilmark{12},\nA.~Haj~Ismail\\altaffilmark{35},\nA.~Hallgren\\altaffilmark{24},\nF.~Halzen\\altaffilmark{6},\nE.~Hansen\\altaffilmark{40},\nB.~Hansmann\\altaffilmark{12},\nT.~Hansmann\\altaffilmark{12},\nK.~Hanson\\altaffilmark{6},\nD.~Hebecker\\altaffilmark{36},\nD.~Heereman\\altaffilmark{5},\nK.~Helbing\\altaffilmark{19},\nR.~Hellauer\\altaffilmark{21},\nS.~Hickford\\altaffilmark{19},\nJ.~Hignight\\altaffilmark{33},\nG.~C.~Hill\\altaffilmark{1},\nK.~D.~Hoffman\\altaffilmark{21},\nR.~Hoffmann\\altaffilmark{19},\nK.~Holzapfel\\altaffilmark{2},\nA.~Homeier\\altaffilmark{41},\nK.~Hoshina\\altaffilmark{6,51},\nF.~Huang\\altaffilmark{9},\nM.~Huber\\altaffilmark{2},\nW.~Huelsnitz\\altaffilmark{21},\nP.~O.~Hulth\\altaffilmark{7},\nK.~Hultqvist\\altaffilmark{7},\nS.~In\\altaffilmark{26},\nA.~Ishihara\\altaffilmark{38},\nE.~Jacobi\\altaffilmark{3},\nG.~S.~Japaridze\\altaffilmark{42},\nM.~Jeong\\altaffilmark{26},\nK.~Jero\\altaffilmark{6},\nB.~J.~P.~Jones\\altaffilmark{11},\nM.~Jurkovic\\altaffilmark{2},\nA.~Kappes\\altaffilmark{8},\nT.~Karg\\altaffilmark{3},\nA.~Karle\\altaffilmark{6},\nU.~Katz\\altaffilmark{8},\nM.~Kauer\\altaffilmark{6,43},\nA.~Keivani\\altaffilmark{9},\nJ.~L.~Kelley\\altaffilmark{6},\nJ.~Kemp\\altaffilmark{12},\nA.~Kheirandish\\altaffilmark{6},\nM.~Kim\\altaffilmark{26},\nT.~Kintscher\\altaffilmark{3},\nJ.~Kiryluk\\altaffilmark{44},\nS.~R.~Klein\\altaffilmark{23,15},\nG.~Kohnen\\altaffilmark{45},\nR.~Koirala\\altaffilmark{34},\nH.~Kolanoski\\altaffilmark{36},\nR.~Konietz\\altaffilmark{12},\nL.~K\\\"opke\\altaffilmark{10},\nC.~Kopper\\altaffilmark{28},\nS.~Kopper\\altaffilmark{19},\nD.~J.~Koskinen\\altaffilmark{40},\nM.~Kowalski\\altaffilmark{36,3},\nK.~Krings\\altaffilmark{2},\nG.~Kroll\\altaffilmark{10},\nM.~Kroll\\altaffilmark{18},\nG.~Kr\\\"uckl\\altaffilmark{10},\nJ.~Kunnen\\altaffilmark{27},\nS.~Kunwar\\altaffilmark{3},\nN.~Kurahashi\\altaffilmark{46},\nT.~Kuwabara\\altaffilmark{38},\nM.~Labare\\altaffilmark{35},\nJ.~L.~Lanfranchi\\altaffilmark{9},\nM.~J.~Larson\\altaffilmark{40},\nD.~Lennarz\\altaffilmark{33},\nM.~Lesiak-Bzdak\\altaffilmark{44},\nM.~Leuermann\\altaffilmark{12},\nJ.~Leuner\\altaffilmark{12},\nL.~Lu\\altaffilmark{38},\nJ.~L\\\"unemann\\altaffilmark{27},\nJ.~Madsen\\altaffilmark{47},\nG.~Maggi\\altaffilmark{27},\nK.~B.~M.~Mahn\\altaffilmark{33},\nM.~Mandelartz\\altaffilmark{18},\nR.~Maruyama\\altaffilmark{43},\nK.~Mase\\altaffilmark{38},\nH.~S.~Matis\\altaffilmark{23},\nR.~Maunu\\altaffilmark{21},\nF.~McNally\\altaffilmark{6},\nK.~Meagher\\altaffilmark{5},\nM.~Medici\\altaffilmark{40},\nM.~Meier\\altaffilmark{25},\nA.~Meli\\altaffilmark{35},\nT.~Menne\\altaffilmark{25},\nG.~Merino\\altaffilmark{6},\nT.~Meures\\altaffilmark{5},\nS.~Miarecki\\altaffilmark{23,15},\nE.~Middell\\altaffilmark{3},\nL.~Mohrmann\\altaffilmark{3},\nT.~Montaruli\\altaffilmark{30},\nR.~Morse\\altaffilmark{6},\nR.~Nahnhauer\\altaffilmark{3},\nU.~Naumann\\altaffilmark{19},\nG.~Neer\\altaffilmark{33},\nH.~Niederhausen\\altaffilmark{44},\nS.~C.~Nowicki\\altaffilmark{28},\nD.~R.~Nygren\\altaffilmark{23},\nA.~Obertacke~Pollmann\\altaffilmark{19},\nA.~Olivas\\altaffilmark{21},\nA.~Omairat\\altaffilmark{19},\nA.~O'Murchadha\\altaffilmark{5},\nT.~Palczewski\\altaffilmark{48},\nH.~Pandya\\altaffilmark{34},\nD.~V.~Pankova\\altaffilmark{9},\nL.~Paul\\altaffilmark{12},\nJ.~A.~Pepper\\altaffilmark{48},\nC.~P\\'erez~de~los~Heros\\altaffilmark{24},\nC.~Pfendner\\altaffilmark{16},\nD.~Pieloth\\altaffilmark{25},\nE.~Pinat\\altaffilmark{5},\nJ.~Posselt\\altaffilmark{19},\nP.~B.~Price\\altaffilmark{15},\nG.~T.~Przybylski\\altaffilmark{23},\nM.~Quinnan\\altaffilmark{9},\nC.~Raab\\altaffilmark{5},\nL.~R\\\"adel\\altaffilmark{12},\nM.~Rameez\\altaffilmark{30},\nK.~Rawlins\\altaffilmark{49},\nR.~Reimann\\altaffilmark{12},\nM.~Relich\\altaffilmark{38},\nE.~Resconi\\altaffilmark{2},\nW.~Rhode\\altaffilmark{25},\nM.~Richman\\altaffilmark{46},\nS.~Richter\\altaffilmark{6},\nB.~Riedel\\altaffilmark{28},\nS.~Robertson\\altaffilmark{1},\nM.~Rongen\\altaffilmark{12},\nC.~Rott\\altaffilmark{26},\nT.~Ruhe\\altaffilmark{25},\nD.~Ryckbosch\\altaffilmark{35},\nL.~Sabbatini\\altaffilmark{6},\nH.-G.~Sander\\altaffilmark{10},\nA.~Sandrock\\altaffilmark{25},\nJ.~Sandroos\\altaffilmark{10},\nS.~Sarkar\\altaffilmark{40,50},\nK.~Schatto\\altaffilmark{10},\nM.~Schimp\\altaffilmark{12},\nP.~Schlunder\\altaffilmark{25},\nT.~Schmidt\\altaffilmark{21},\nS.~Schoenen\\altaffilmark{12},\nS.~Sch\\\"oneberg\\altaffilmark{18},\nA.~Sch\\\"onwald\\altaffilmark{3},\nL.~Schumacher\\altaffilmark{12},\nD.~Seckel\\altaffilmark{34},\nS.~Seunarine\\altaffilmark{47},\nD.~Soldin\\altaffilmark{19},\nM.~Song\\altaffilmark{21},\nG.~M.~Spiczak\\altaffilmark{47},\nC.~Spiering\\altaffilmark{3},\nM.~Stahlberg\\altaffilmark{12},\nM.~Stamatikos\\altaffilmark{16,52},\nT.~Stanev\\altaffilmark{34},\nA.~Stasik\\altaffilmark{3},\nA.~Steuer\\altaffilmark{10},\nT.~Stezelberger\\altaffilmark{23},\nR.~G.~Stokstad\\altaffilmark{23},\nA.~St\\\"o{\\ss}l\\altaffilmark{3},\nR.~Str\\\"om\\altaffilmark{24},\nN.~L.~Strotjohann\\altaffilmark{3},\nG.~W.~Sullivan\\altaffilmark{21},\nM.~Sutherland\\altaffilmark{16},\nH.~Taavola\\altaffilmark{24},\nI.~Taboada\\altaffilmark{29},\nJ.~Tatar\\altaffilmark{23,15},\nS.~Ter-Antonyan\\altaffilmark{37},\nA.~Terliuk\\altaffilmark{3},\nG.~Te{\\v{s}}i\\'c\\altaffilmark{9},\nS.~Tilav\\altaffilmark{34},\nP.~A.~Toale\\altaffilmark{48},\nM.~N.~Tobin\\altaffilmark{6},\nS.~Toscano\\altaffilmark{27},\nD.~Tosi\\altaffilmark{6},\nM.~Tselengidou\\altaffilmark{8},\nA.~Turcati\\altaffilmark{2},\nE.~Unger\\altaffilmark{24},\nM.~Usner\\altaffilmark{3},\nS.~Vallecorsa\\altaffilmark{30},\nJ.~Vandenbroucke\\altaffilmark{6},\nN.~van~Eijndhoven\\altaffilmark{27},\nS.~Vanheule\\altaffilmark{35},\nJ.~van~Santen\\altaffilmark{3},\nJ.~Veenkamp\\altaffilmark{2},\nM.~Vehring\\altaffilmark{12},\nM.~Voge\\altaffilmark{41},\nM.~Vraeghe\\altaffilmark{35},\nC.~Walck\\altaffilmark{7},\nA.~Wallace\\altaffilmark{1},\nM.~Wallraff\\altaffilmark{12},\nN.~Wandkowsky\\altaffilmark{6},\nCh.~Weaver\\altaffilmark{28},\nC.~Wendt\\altaffilmark{6},\nS.~Westerhoff\\altaffilmark{6},\nB.~J.~Whelan\\altaffilmark{1},\nK.~Wiebe\\altaffilmark{10},\nC.~H.~Wiebusch\\altaffilmark{12},\nL.~Wille\\altaffilmark{6},\nD.~R.~Williams\\altaffilmark{48},\nL.~Wills\\altaffilmark{46},\nH.~Wissing\\altaffilmark{21},\nM.~Wolf\\altaffilmark{7},\nT.~R.~Wood\\altaffilmark{28},\nK.~Woschnagg\\altaffilmark{15},\nD.~L.~Xu\\altaffilmark{6},\nX.~W.~Xu\\altaffilmark{37},\nY.~Xu\\altaffilmark{44},\nJ.~P.~Yanez\\altaffilmark{3},\nG.~Yodh\\altaffilmark{14},\nS.~Yoshida\\altaffilmark{38},\nand M.~Zoll\\altaffilmark{7}\n}\n\\altaffiltext{1}{Department of Physics, University of Adelaide, Adelaide, 5005, Australia}\n\\altaffiltext{2}{Technische Universit\\\"at M\\\"unchen, D-85748 Garching, Germany}\n\\altaffiltext{3}{DESY, D-15735 Zeuthen, Germany}\n\\altaffiltext{4}{Dept.~of Physics and Astronomy, University of Canterbury, Private Bag 4800, Christchurch, New Zealand}\n\\altaffiltext{5}{Universit\\'e Libre de Bruxelles, Science Faculty CP230, B-1050 Brussels, Belgium}\n\\altaffiltext{6}{Dept.~of Physics and Wisconsin IceCube Particle Astrophysics Center, University of Wisconsin, Madison, WI 53706, USA}\n\\altaffiltext{7}{Oskar Klein Centre and Dept.~of Physics, Stockholm University, SE-10691 Stockholm, Sweden}\n\\altaffiltext{8}{Erlangen Centre for Astroparticle Physics, Friedrich-Alexander-Universit\\\"at Erlangen-N\\\"urnberg, D-91058 Erlangen, Germany}\n\\altaffiltext{9}{Dept.~of Physics, Pennsylvania State University, University Park, PA 16802, USA}\n\\altaffiltext{10}{Institute of Physics, University of Mainz, Staudinger Weg 7, D-55099 Mainz, Germany}\n\\altaffiltext{11}{Dept.~of Physics, Massachusetts Institute of Technology, Cambridge, MA 02139, USA}\n\\altaffiltext{12}{III. Physikalisches Institut, RWTH Aachen University, D-52056 Aachen, Germany}\n\\altaffiltext{13}{Physics Department, South Dakota School of Mines and Technology, Rapid City, SD 57701, USA}\n\\altaffiltext{14}{Dept.~of Physics and Astronomy, University of California, Irvine, CA 92697, USA}\n\\altaffiltext{15}{Dept.~of Physics, University of California, Berkeley, CA 94720, USA}\n\\altaffiltext{16}{Dept.~of Physics and Center for Cosmology and Astro-Particle Physics, Ohio State University, Columbus, OH 43210, USA}\n\\altaffiltext{17}{Dept.~of Astronomy, Ohio State University, Columbus, OH 43210, USA}\n\\altaffiltext{18}{Fakult\\\"at f\\\"ur Physik \\& Astronomie, Ruhr-Universit\\\"at Bochum, D-44780 Bochum, Germany}\n\\altaffiltext{19}{Dept.~of Physics, University of Wuppertal, D-42119 Wuppertal, Germany}\n\\altaffiltext{20}{Dept.~of Physics and Astronomy, University of Rochester, Rochester, NY 14627, USA}\n\\altaffiltext{21}{Dept.~of Physics, University of Maryland, College Park, MD 20742, USA}\n\\altaffiltext{22}{Dept.~of Physics and Astronomy, University of Kansas, Lawrence, KS 66045, USA}\n\\altaffiltext{23}{Lawrence Berkeley National Laboratory, Berkeley, CA 94720, USA}\n\\altaffiltext{24}{Dept.~of Physics and Astronomy, Uppsala University, Box 516, S-75120 Uppsala, Sweden}\n\\altaffiltext{25}{Dept.~of Physics, TU Dortmund University, D-44221 Dortmund, Germany}\n\\altaffiltext{26}{Dept.~of Physics, Sungkyunkwan University, Suwon 440-746, Korea}\n\\altaffiltext{27}{Vrije Universiteit Brussel, Dienst ELEM, B-1050 Brussels, Belgium}\n\\altaffiltext{28}{Dept.~of Physics, University of Alberta, Edmonton, Alberta, Canada T6G 2E1}\n\\altaffiltext{29}{School of Physics and Center for Relativistic Astrophysics, Georgia Institute of Technology, Atlanta, GA 30332, USA}\n\\altaffiltext{30}{D\\'epartement de physique nucl\\'eaire et corpusculaire, Universit\\'e de Gen\\`eve, CH-1211 Gen\\`eve, Switzerland}\n\\altaffiltext{31}{Dept.~of Physics, University of Toronto, Toronto, Ontario, Canada, M5S 1A7}\n\\altaffiltext{32}{Dept.~of Astronomy and Astrophysics, Pennsylvania State University, University Park, PA 16802, USA}\n\\altaffiltext{33}{Dept.~of Physics and Astronomy, Michigan State University, East Lansing, MI 48824, USA}\n\\altaffiltext{34}{Bartol Research Institute and Dept.~of Physics and Astronomy, University of Delaware, Newark, DE 19716, USA}\n\\altaffiltext{35}{Dept.~of Physics and Astronomy, University of Gent, B-9000 Gent, Belgium}\n\\altaffiltext{36}{Institut f\\\"ur Physik, Humboldt-Universit\\\"at zu Berlin, D-12489 Berlin, Germany}\n\\altaffiltext{37}{Dept.~of Physics, Southern University, Baton Rouge, LA 70813, USA}\n\\altaffiltext{38}{Dept.~of Physics, Chiba University, Chiba 263-8522, Japan}\n\\altaffiltext{39}{Dept.~of Astronomy, University of Wisconsin, Madison, WI 53706, USA}\n\\altaffiltext{40}{Niels Bohr Institute, University of Copenhagen, DK-2100 Copenhagen, Denmark}\n\\altaffiltext{41}{Physikalisches Institut, Universit\\\"at Bonn, Nussallee 12, D-53115 Bonn, Germany}\n\\altaffiltext{42}{CTSPS, Clark-Atlanta University, Atlanta, GA 30314, USA}\n\\altaffiltext{43}{Dept.~of Physics, Yale University, New Haven, CT 06520, USA}\n\\altaffiltext{44}{Dept.~of Physics and Astronomy, Stony Brook University, Stony Brook, NY 11794-3800, USA}\n\\altaffiltext{45}{Universit\\'e de Mons, 7000 Mons, Belgium}\n\\altaffiltext{46}{Dept.~of Physics, Drexel University, 3141 Chestnut Street, Philadelphia, PA 19104, USA}\n\\altaffiltext{47}{Dept.~of Physics, University of Wisconsin, River Falls, WI 54022, USA}\n\\altaffiltext{48}{Dept.~of Physics and Astronomy, University of Alabama, Tuscaloosa, AL 35487, USA}\n\\altaffiltext{49}{Dept.~of Physics and Astronomy, University of Alaska Anchorage, 3211 Providence Dr., Anchorage, AK 99508, USA}\n\\altaffiltext{50}{Dept.~of Physics, University of Oxford, 1 Keble Road, Oxford OX1 3NP, UK}\n\\altaffiltext{51}{Earthquake Research Institute, University of Tokyo, Bunkyo, Tokyo 113-0032, Japan}\n\\altaffiltext{52}{NASA Goddard Space Flight Center, Greenbelt, MD 20771, USA}\n\n\\title{An All-Sky Search for Three Flavors of Neutrinos from Gamma-Ray Bursts with the IceCube Neutrino Observatory}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{abstract}\nWe present the results and methodology of a search for neutrinos produced in the decay of charged pions created in interactions between protons and gamma-rays during the prompt emission of 807 gamma-ray bursts (GRBs) over the entire sky.  This three-year search is the first in IceCube for shower-like Cherenkov light patterns from electron, muon, and tau neutrinos correlated with GRBs.  We detect five low-significance events correlated with five GRBs.  These events are consistent with the background expectation from atmospheric muons and neutrinos.  The results of this search in combination with those of IceCube's four years of searches for track-like Cherenkov light patterns from muon neutrinos correlated with Northern-Hemisphere GRBs produce limits that tightly constrain current models of neutrino and ultra high energy cosmic ray production in GRB fireballs.\n\\end{abstract}\n\n\n\n\n\n\n\\keywords{gamma-ray bursts: general, methods: data analysis, neutrinos, telescopes}\n\n\n\n\n\n\n\n\n\n\\section{Introduction}\n\nUltra high energy cosmic rays (UHECRs), defined by energy greater than $10^{18}$ eV, have been observed for decades \\citep{zatsepin1966,hires2008,auger2010}, but their sources remain unknown.  Gamma-ray bursts are among the most plausible candidates for these particles' origins.  If this hypothesis is true, neutrinos would also be produced in $p\\gamma$ interactions at these sources.  While the charged cosmic rays are deflected by galactic and intergalactic magnetic fields, neutrinos travel unimpeded through the universe and disclose their source directions.  Detection of high energy neutrinos correlated with gamma-ray photons from a GRB would provide evidence of hadronic interaction in these powerful phenomena and confirm their role in UHECR production.\n\nGRBs are the brightest electromagnetic explosions in the universe and are observed by dedicated spacecraft detectors at an average rate of about one per day \\citep{meszaros2006,fermicat}.  GRB locations are distributed isotropically at cosmic distances.  Their prompt gamma-ray emissions exhibit diverse light curves and durations, lasting from milliseconds to hours.  The origins of these extremely energetic phenomena remain unknown, but their spectra have been studied extensively over a wide range of energies \\citep{fermispec, fermilatcat2013, swiftbatcat2011}.  The \\textit{Fermi} detector covers seven decades of energy in gamma-rays with its two instruments and has observed photons with source-frame-corrected energies above 10 GeV early in the prompt phase of some bursts \\citep{fermiicrc2015}.  These measurements support efficient particle acceleration in GRBs.\n\nThe prevailing phenomenology that successfully describes GRB observations is that of a relativistically expanding fireball of electrons, photons, and protons \\citep{piran,meszaros2006,fox2006}.  The initially opaque fireball plasma expands by radiation pressure until it becomes optically thin and emits the observed gamma-rays.  During this expansion, kinetic energy is dissipated through internal shock fronts that accelerate electrons and protons via the Fermi mechanism to the observed gamma-ray and UHECR energies \\citep{waxman1995,vietri1997}.  These high energy protons will interact with gamma-rays radiated by electrons and create neutrinos, for example through the delta-resonance:\n\n\n", "index": 1, "text": "\\begin{equation}\np + \\gamma \\rightarrow \\Delta^{+} \\rightarrow \\pi^{+} + n \\rightarrow e^{+} + \\nu_{e} + \\bar{\\nu}_{\\mu} + \\nu_{\\mu} + n\n\\label{deltares}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"p+\\gamma\\rightarrow\\Delta^{+}\\rightarrow\\pi^{+}+n\\rightarrow e^{+}+\\nu_{e}+%&#10;\\bar{\\nu}_{\\mu}+\\nu_{\\mu}+n\" display=\"block\"><mrow><mrow><mi>p</mi><mo>+</mo><mi>γ</mi></mrow><mo>→</mo><msup><mi mathvariant=\"normal\">Δ</mi><mo>+</mo></msup><mo>→</mo><mrow><msup><mi>π</mi><mo>+</mo></msup><mo>+</mo><mi>n</mi></mrow><mo>→</mo><mrow><msup><mi>e</mi><mo>+</mo></msup><mo>+</mo><msub><mi>ν</mi><mi>e</mi></msub><mo>+</mo><msub><mover accent=\"true\"><mi>ν</mi><mo stretchy=\"false\">¯</mo></mover><mi>μ</mi></msub><mo>+</mo><msub><mi>ν</mi><mi>μ</mi></msub><mo>+</mo><mi>n</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\ngiven sets of observables $\\overrightarrow{\\textbf{x}}=\\left\\{\\textbf{x}_1,\\textbf{x}_2,...,\\textbf{x}_N\\right\\}$ from N DOMs.  We minimize the negative logarithm of $\\mathcal{L}$ with respect to $\\textbf{a}$.  In these online likelihood reconstructions, the $\\overrightarrow{\\textbf{x}}$ are parametrized in terms of the difference between the recorded photon hit times and the expectation without scattering or absorption \\citep{amandareco}.\n\nFor a cascade hypothesis, which can be considered point-like because of the relatively small maximum shower range on the scale of IceCube instrumentation \\citep{ereco2014}, the time residual depends on the location and time of the interaction vertex $\\textbf{a} = \\left\\{t,x,y,z\\right\\}$.  This minimization is seeded by the above center of mass vertex calculation and the earliest vertex time for which at least 4 DOMs record hits with time residuals within [0, 200] ns.  For an infinite track hypothesis, the time residual depends on the distance from an arbitrary point on the track and the direction of the track $\\textbf{a} = \\left\\{x,y,z,\\theta,\\phi\\right\\}$.  This minimization is seeded by the above line-fit track.  Both of these cascade and track hypothesis maximum likelihoods provide useful best-fit quantities for the event selection described in Section \\ref{sec:eventselect}.\n\nThe more computationally expensive likelihood-based reconstruction that we use on the reduced data takes advantage of detailed in-ice photon propagation models \\citep{photospline,photonics} and DOM waveform information.  The detection of light follows a Poisson distribution and thus the likelihood function we maximize is\n\n\n", "itemtype": "equation", "pos": 33169, "prevtext": "\n\nTo date, no neutrino signal has been detected in searches for muon neutrinos from GRBs in multiple years of data from AMANDA, the partially-instrumented IceCube, and the completed IceCube detector\\citep{amandacscd2007,ic22paper,grbic40paper,ic59nature,grb4year}, nor in four years of data by the ANTARES collaboration \\citep{ANTARESGRBcscd,ANTARESGRB2013,ANTARESGRB2013b}.  High energy $\\nu_{\\mu}$ charged-current interactions produce high energy muons that manifest as extended Cherenkov light patterns in the South Pole glacial ice, referred to as ``tracks\"; and Southern Hemisphere bursts were often excluded from searches for this signal in order to remove the dominant cosmic-ray-induced muon background.  Adding the low-background ``shower\" channel from interactions other than charged-current $\\nu_{\\mu}$ gives enhanced sensitivity to such bursts, improving the sensitivity of the overall correlation analysis.\n\nThis paper is ordered as follows.  In Section \\ref{sec:promptgrbnuspec}, we describe the neutrino spectra predicted by the different fireball models on which we place limits.  In Section \\ref{sec:detector}, we describe the IceCube detector and data acquisition system.  We discuss the simulation and reconstruction of events in IceCube in Section \\ref{sec:simandreco}.  We detail the event selection techniques and likelihood analysis in Sections \\ref{sec:eventselect} and \\ref{sec:llh}.  Finally, in Section \\ref{sec:results} we present the results of this all-sky three-flavor shower search in combination with those from the $\\nu_{\\mu}$ track searches, and conclude in Section \\ref{sec:outlook}.\n\n\\section{Prompt GRB Neutrino Predictions}\n\\label{sec:promptgrbnuspec}\n\nIn this search for GRB neutrinos, we examine data during the time of gamma-ray emission reported by any satellite for each burst.  We do not consider possible precursor \\citep{razzaque2003} or afterglow \\citep{wb2000,murase2006,burrows2007} neutrino emission far outside of this prompt window.  In Section \\ref{sec:results} we place limits on two classes of GRB prompt neutrino flux predictions: models normalized to the observed UHECR flux \\citep{katz2009energy} and models normalized to the observed gamma-ray flux for each burst.\n\nThe cosmic-ray-normalized models \\citep{wb1997,waxman2003,probation2011} assume protons emitted by GRBs are the dominant sources of the highest energy cosmic rays observed, and with these models we place limits on this assumption.  The neutrino spectral break and normalization also depends on the bulk Lorentz boost factor $\\Gamma$ and gamma-ray break energy in the GRB fireball.  Typical values required for pion production lead to the emission of $\\sim 100$ TeV neutrinos.  In Section \\ref{sec:results}, we place limits on the expected neutrino flux at different break energies.\n\nThe gamma-ray-normalized models \\citep{winter2012,zhang2012} do not relate the observed cosmic ray flux to neutrinos produced in GRB fireballs, and with these models we place limits on internal fireball parameters.  We consider three types of gamma-ray-spectrum-normalized fireball models, calculated on a burst-by-burst basis, that differ in their neutrino emission sites.  The internal shock model relates the neutrino production radius to the variability time scale of the gamma-ray light curves \\citep{wb1997,winter2012,zhang2012}.  The photospheric model places the radius at the photosphere through combinations of processes such as internal shocks, magnetic reconnection, and neutron-proton collisions \\citep{rees2005,murase2008photo,zhang2011}.  The internal collision-induced magnetic reconnection and turbulence (ICMART) model favors a neutrino production radius $\\sim 10$ times larger than the standard internal shock model due to a Poynting-flux-dominated outflow that remains undissipated until internal shocks destroy the ordered magnetic fields \\citep{zhang2011,zhang2012}.  These models assert that gamma-ray emission and proton acceleration occur at the same radius.  This equivalence is not necessarily true for scenarios other than the single-zone internal shock model \\citep{multipleis2015}, but allows the predicted neutrino flux to scale linearly with the proton-to-electron energy ratio in the fireball.  Additionally, the models addressed in this work do not account for a possible enhancement to the high energy neutrino flux due to acceleration of secondary particles \\citep{klein2013muon,winter2014muon}.\n\nWe calculate the per-GRB predictions normalized to the measured gamma-ray spectra numerically with a wrapper of the Monte-Carlo generator SOPHIA \\citep{sophia}, taking into account the full particle production chain and synchrotron losses in inelastic $p\\gamma$ interactions.  For these calculations, we parametrize the reported gamma-ray spectrum of each GRB as a broken power-law approximation of the Band function \\citep{band1993,zhang2012}.  We retrieve GRB parameters from the circulars published by satellite detectors on the Gamma-ray Coordinates Network\\footnote{\\url{http://gcn.gsfc.nasa.gov}} and the Fermi GBM database \\citep{fermicat,fermispec}.  We compile the relevant temporal, spatial, and spectral parameters used in this analysis on our GRBweb database, presented on a publicly-available website\\footnote{\\url{http://grbweb.icecube.wisc.edu}} \\citep{grbwebicrc}.  The prompt photon emission time ($T_{100}$) is defined by the most inclusive start and end times ($T_1$ and $T_2$) reported by any satellite.  We use the most precise localization available.  Following the same prescription of our previous model limit calculations \\citep{grbic40paper,ic59nature,grb4year}, if the fluence is unmeasured, we use an average value of $10^{-5}$ erg cm$^{-2}$; if the gamma-ray break energy is unmeasured, we use 200~keV for $T_{100} > 2$~s bursts and 1000~keV for $T_{100} \\leq 2$~s bursts; and if the redshift is unmeasured, we use 2.15 for $T_{100} > 2$~s bursts and 0.5 for $T_{100} \\leq 2$~s bursts.\n\nThe neutrino flux predictions depend on several unmeasured quantities; we use variability time scale 0.01 s and isotropic luminosity $10^{52}$ erg cm$^{-2}$ for long bursts and variability time scale 0.001 s and isotropic luminosity $10^{51}$ erg cm$^{-2}$ for short bursts, which are consistent with the literature \\citep{baerwald2014,winter2012,zhang2012}.  If the redshift is known for a particular burst, we calculate the approximate isotropic luminosity from the redshift, photon fluence, and $T_{100}$ \\citep{winter2012}.\n\nFigure \\ref{grbspectra} illustrates neutrino spectra from the three models with benchmark fireball parameters.  These benchmark parameters are bulk Lorentz boost factor $\\Gamma = 300$ and proton-to-electron energy ratio, or baryonic loading, $f_p = 10$.  These spectra are presented as per-flavor quasi-diffuse fluxes, in which we divide the total fluence from all GRBs in the sample by the full sky $4\\pi$ steradians and one year in seconds, and scale the total number of bursts to a predicted average 667 observable bursts per year, which has been used in our previous IceCube publications \\citep{ic22paper,grbic40paper,ic59nature,grb4year}.  The actual number of bursts observed by satellite detectors in each year is less than the predicted average because of detector field of view limitations and obstruction by the sun, earth, and moon.  For all GRBs we assume that neutrino oscillations over cosmic baselines result in equal fluxes for all flavors.\n\n\\begin{figure}[tbp]\n \\plotone{fig1.pdf}\n \\caption{Per-flavor quasi-diffuse all-sky flux predictions, calculated with the $\\gamma$ spectra of all GRBs included in this three-year search, for three different models of fireball neutrino production.  These fluxes assume $\\Gamma=300$, $f_p=10$, full flavor mixing at earth, and 667 observable GRBs per year.  These models differ in the radius at which $p\\gamma$ interactions occur.  The solid segments indicate the central 90\\% energies of neutrinos that could be detected by IceCube. \n \\label{grbspectra}}\n\\end{figure}\n\n\\section{The IceCube Detector}\n\\label{sec:detector}\n\nThe IceCube detector \\citep{icfirstyear} consists of 5160 digital optical modules (DOMs) instrumented over 1 km$^3$ of clear glacial ice 1450~m to 2450~m below the surface at the geographic South Pole.  IceCube is the largest neutrino detector in operation.  Each DOM incorporates a 10~in. diameter photomultiplier tube (PMT) \\citep{pmtpaper}.  Signal and power connections between the DOMs and the computer farm at the surface are provided by 86 vertical in-ice cables or ``strings\" that each connect 60 DOMs spaced uniformly.  Adjacent strings are separated by about 125 m.  The DeepCore array \\citep{dcdesignperf} is made up of a more densely spaced subset of strings that are located in the clearest ice at depths below 2100 m and contain higher quantum efficiency PMTs.\n\nSensor deployment began during the 2004-2005 austral summer. Physics data collection began in 2006 with the 9-string configuration and continued with partial detector configurations through completion of the 86 strings in December 2010.  We conducted the analysis presented in this paper using data taken from May 2010 through May 2013, with one year using the 79-string configuration and two years using the completed detector.\n\nThe DOM PMTs detect the Cherenkov radiation of relativistic charged particles produced in deep inelastic neutrino-nucleon scattering in or near the detector volume.  Data acquisition \\citep{daqpaper} begins once the output current exceeds the threshold of $1/4$ of the mean peak current of the pulse amplified from a single photo-electron.  If another such ``hit\" is recorded in a neighboring or next-to-neighboring DOM within 1 $\\mu$s, the full waveform information is recorded.  DOMs with hits failing this local coincidence condition report a short summary of their recorded waveform for inclusion in data records.  The digitized waveforms are sent to the computers at the surface, where they are assembled into ``events\" by a software trigger \\citep{daqpaper,kelley2014trigger}.  The relative timing resolution of photons within an event is about 2~ns \\citep{icfirstyear}.  Data are sent daily from the detector to computers in the Northern Hemisphere via satellite.\n\nThere are two main interaction topologies that can manifest in hit DOMs during an event: a thin track or a near-spherical shower.  Track-like light emission is generated by muons created either through cosmic ray interactions in the atmosphere or $\\nu_{\\mu}$ interacting in the ice.  Shower-like light emission, which is the signal of this analysis, is generated by electromagnetic cascades from charged current interactions of $\\nu_e$ and $\\nu_{\\tau}$ and hadronic cascades from neutral current interactions of $\\nu_e$, $\\nu_{\\tau}$, and $\\nu_{\\mu}$ in the ice.\n\nElectromagnetic cascades of photons, electrons, and positrons develop through radiative processes, such as bremsstrahlung and pair production.  Once the energy of each particle in the cascade is below the critical energy, non-radiative processes, such as ionization and Compton scattering dominate and the shower stops growing.  Hadronic cascades result from showers of baryons and mesons produced by deep inelastic scattering interactions of all neutrino types.  Interactions of $\\bar{\\nu}_e$ with electrons via the Glashow resonance at 6.3~PeV would also produce cascade signal for this analysis; however, this resonance has not yet been observed.\n\n\\section{Simulated Data and Reconstruction}\n\\label{sec:simandreco}\n\nWe use Monte Carlo simulations of neutrinos interacting in the IceCube detector for the signal hypothesis in our event selection and optimization for this search.  Neutrinos are simulated with the \\texttt{NEUTRINO-GENERATOR} program, a port of the \\texttt{ANIS} code \\citep{nugen2005}.  We use \\texttt{NEUTRINO-GENERATOR} to distribute neutrinos with a power-law spectrum uniformly over the entire sky and then we propagate them through the earth and ice.  The simulated neutrino-nucleon interactions take cross sections from CTEQ5 \\citep{cteq5}.  The Earth's density profile is modeled with the Preliminary Reference Earth Model \\citep{prem1981}.  The propagation code takes into account absorption, scattering, and neutral-current regeneration.\n\nAlthough we use data outside of GRB gamma-ray emission time windows for our background, simulated neutrinos and muons generated in cosmic ray air showers are useful checks to characterize our background and estimate the signal purity of our final data sample.  We apply the Honda et al. spectrum \\citep{honda2006} for the atmospheric neutrino background.  We use the  \\texttt{CORSIKA} simulation package \\citep{heck1998} to simulate cosmic ray air showers.  Muons are traced through the ice and bedrock incorporating continuous and stochastic energy losses \\citep{mmc}.  The PMT detection of Cherenkov light from muon tracks and showers is simulated using ice and dust layer properties determined in detailed studies and simulations \\citep{photonics} \\citep{ice}.  Finally, we simulate the DOM triggering and signal from all interactions.  We process these signals in the same way as described in Section \\ref{sec:detector}.\n\nWe use the geometric pattern, timing, and amount of recorded photons in an interaction to reconstruct and identify the incident particle.  We run simple analytic reconstructions automatically in data filters at the Pole and more complex reconstructions on the reduced data in the North.  These reconstructions provide powerful discriminating features that we employ in our event selection methods, described in the next section.\n\nOne of the analytic calculations used to identify shower-like events is the ``tensor-of-inertia\" algorithm of \\cite{amandareco} that determines an interaction vertex by calculating a ``center of mass,\" where the mass terms correspond to the number of photoelectrons recorded by each DOM.  The eigenvector along the longest principle axis provides a reasonable guess for the incident particle trajectory.  Using the rigid body analogy, a spherical shower should provide nearly even tensor-of-inertia eigenvalues, while an elongated track should have one eigenvalue much smaller than the other two.\n\nA second analytic calculation is the ``line-fit\" algorithm of \\cite{amandareco} that ignores the geometry of the Cherenkov cone and the optical properties of the medium and assumes light travels along a one-dimensional path at some constant velocity through the detector.  This algorithm determines a best-fit track, but provides a good indicator for spherical showers, which exhibit slower best-fit velocities than tracks.  We recalculate this fit during the final level of event selection using an improved version of the algorithm that discards photons due to uncorrelated noise \\citep{improvedlf}.\n\nWe also perform fast reconstructions based on an analytic likelihood function.  In general, we determine the set of parameters $\\textbf{a}=\\left\\{a_1,a_2,...,a_m\\right\\}$ of an event that maximizes the likelihood function\n\n\n", "index": 3, "text": "\\begin{equation}\n\\mathcal{L}(\\overrightarrow{\\textbf{x}} \\vert \\textbf{a}) = \n\\prod_{i=1}^{N} p(\\textbf{x}_i \\vert \\textbf{a})\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}(\\overrightarrow{\\textbf{x}}|\\textbf{a})=\\prod_{i=1}^{N}p(\\textbf{x%&#10;}_{i}|\\textbf{a})\\par&#10;\" display=\"block\"><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mtext>𝐱</mtext><mo>→</mo></mover><mo stretchy=\"false\">|</mo><mtext>𝐚</mtext><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mi>p</mi><mrow><mo stretchy=\"false\">(</mo><msub><mtext>𝐱</mtext><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mtext>𝐚</mtext><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nfor the observed and expected number of photoelectrons $k$ and $\\lambda$ in each DOM from a neutrino traveling in direction $(\\theta$,$\\phi)$ and depositing energy $E$ at time $t$ and vertex $(x,y,z)$ \\citep{ereco2014}.  This likelihood in general considers multiple light sources, e.g. for stochastic muon losses along a path through the detector.  Because we define our signal to be neutrino-induced showers, it is sufficient to use a point-like hypothesis.  Due to the linear relationship between Cherenkov light emission and deposited energy in $\\nu_e$ charged-current interactions, we estimate the electromagnetic-equivalent energy of an event by comparing to a template electromagnetic cascade of 1 GeV \\citep{ereco2014}.  By using Cherenkov light source-dependent spline-fit tables of photon amplitudes and time delays, we minimize \\citep{minuit} the negative log-likelihood and extract the best-fit parameters of the particle that produced the shower.\n\nWe iterate this minimization several times and achieve improved angular reconstruction from the best-fit energy and modeled ice structure.  The reconstruction is seeded by the tensor-of-inertia direction, online likelihood vertex, and best-fit energy from a simple isotropic shower and coarsely-binned propagation model expectation in Equation \\ref{mpodllh}.  We use this reconstruction's best-fit direction and energy for each event in our likelihood analysis.  We estimate a lower bound on the error in the reconstructed directions with the Cramer-Rao relation \\citep{cramer,rao} between the covariance of each fit parameter and the inverted Fisher information matrix.  Figure \\ref{angres-eres} shows the angular and energy resolutions using this reconstruction at the final event selection of this cascade search.  The reconstructed energy for neutral current interactions is less than the primary neutrino energy because of the dissipation to outlets without Cherenkov emission.\n\n\n\\begin{figure}\n \\plotthree{fig2a.pdf}{fig2b.pdf}{fig2c.pdf}\n \\caption{Left: Cumulative point spread function per neutrino flavor at final cascade event selection. Middle: Energy resolution per neutrino flavor for charged-current interactions at final event selection. Right: Energy resolution per neutrino flavor for neutral-current interactions at final event selection.\n \\label{angres-eres}}\n\\end{figure}\n\n\\section{Event Selection}\n\\label{sec:eventselect}\n\nOur signal in this search is one or more high energy neutrino-induced showers coincident in space and time with one or more GRBs.  Before we analyze the likelihood that an event is a GRB-emitted neutrino, we must reduce the triggered data that is dominated by nearly 3 kHz of cosmic ray air shower muons to a much smaller selection of possible signal.  Our event selection is optimized on a general $E^{-2}$ spectrum of diffuse astrophysical simulated $\\nu_e$ for signal and off-time data for background; we choose ``off-time\" as data not within two hours of any reported GRB $\\gamma$ emission in order to ensure blindness to potential signal. We use the reconstructions detailed in Section \\ref{sec:simandreco} to remove the background and realize our final sample.\n\nSearches for neutrino-induced showers from astrophysical and atmospheric sources have been conducted previously in IceCube \\citep{firstcascade,ic40cascade,hese2014,mese2015}.  The predominant difference between these and the search presented in this paper is that we assume neutrinos come from known transient sources.  The previous shower-like event selections assume a diffuse signal or constantly emitting sources and, as a result, require much more stringent background reduction that leads to data rates nearly a factor of 100 smaller than what is needed in this search.  Cascade containment constraints in the detector were imposed to reach these low backgrounds, which are achieved in this search by the effective cuts in time and space around each GRB in the unbinned likelihood analysis presented in Section \\ref{sec:llh}.\n\nThe first class of background to remove is track-like events generated by muons losing their energy through continuous ionization processes.  These muon tracks are relatively easily separated from our shower-like neutrino signal by use of a filter run online at the detector site.  During the 79-string configuration, we use the tensor-of-inertia eigenvalue ratio and line-fit absolute speed to choose spherical events.  The online cascade filter for the first two years of the 86-string configuration imposes a zenith-dependent selection to allow more events with energies below 10 TeV.  We use the reduced log-likelihood calculated in the fast cascade likelihood reconstruction to remove a large fraction of the muons that are misreconstructed as upgoing.  The down-going region requires more restrictive reduced log-likelihood values in combination with the same online 79-string event selection from above.\n\nUpon transmission via satellite from the South Pole, these $\\sim 30$~Hz filtered data of spherically shaped events must be further reduced to have optimal performance with the BDT forest algorithm described below.  The background at this rate is still dominated by atmospheric muons that lose their energy through bremsstrahlung, photonuclear interactions, and pair production.  These stochastic energy loss mechanisms create nearly spherical hit patterns that are difficult to differentiate from our signal when the muon track is at the edge or outside of the detector and therefore not observed.  We derive variables from the more CPU-intensive reconstructions run offline to separate these muons from neutrino-induced showers at this selection level, called level 3 in this text, and for eventual machine-learning input.\n\nEven though the background muons in the online filter event selection are shower-like in topology, we exploit the Cherenkov light hit patterns of the minimally ionizing muon track when possible to differentiate from showers produced by neutrinos.  We perform this further separation of signal from muon background first by using the fast track hypothesis and cascade hypothesis analytic likelihood function reconstructions, described in Section \\ref{sec:simandreco}.  Our first level 3 selection is on events for which the ratio of the track likelihood to the cascade likelihood heavily favors the cascade hypothesis.  Two other background muon features that we take advantage of are their down-going directions and typically lower energies.  We thus parametrize the track likelihood reconstructed zenith in terms of reconstructed energy and remove low energy down-going events from our sample.  Lastly at this rate, we choose events based on the fraction of hit DOMs that are inside of a sphere centered on the reconstructed vertex with a radius determined by the mean hit distance.  We optimize the radius and fraction filled of the sphere for reconstructed vertices inside and outside of the instrumented volume and use both volume regions for this neutrino search.\n\nOur final event selection employs a machine learning algorithm to optimize the separation of signal and background over a space of many features.  The algorithm we use is a boosted decision tree forest (BDT) \\citep{freundbdt1997} that also has been used in Northern Hemisphere $\\nu_{\\mu}$ track GRB coincidence searches in IceCube \\citep{ic59nature,grb4year}.  We built a collection of variables, many of which were influenced by past neutrino-induced shower searches conducted in IceCube \\citep{firstcascade,ic40cascade}, to train the BDT to discriminate between signal and background events.  During this training, the algorithm determines the variable value that best separates signal and background at each node of each tree.  Each successive tree increases, or ``boosts,\" the weights of incorrectly classified events from the prior tree, allowing more ambiguous events to be classified correctly.  The trees and forest grow until certain stopping criteria are reached.  The signal/background $(+1/-1)$ score of each event that we use in our final selection is a weighted average of its scores over all trees, where this weight is related to the boost factor of each tree.  For each of the three year-long detector configurations of this search, we train a separate BDT with configuration-specific signal simulation and background data.\n\nOur BDT discrimination variables take advantage of topological and energetic differences between astrophysical neutrino and atmospheric muon spectra.  Figures \\ref{vars-level3} and \\ref{vars-final} show the distributions for simulated astrophysical neutrinos, atmospheric neutrinos, atmospheric muons, and data for three of the most powerful variables used by the BDT after the level 3 and final level, respectively.  Some deviations in variable values between measured and simulated data are visible in Figures \\ref{vars-level3} and \\ref{vars-final}, and are attributed to limitations of simulation in reproducing all observed events.  These deviations do not affect the analysis because the background is determined from measured data.\n\nFigure \\ref{bdtdist} shows the distributions of simulation and data with respect to BDT score.  The vertical dashed line corresponds to our optimized final event selection described in the next section.  The atmospheric and astrophysical $\\nu_{\\mu}$ in these plots is already preselected to be shower-like and has minimal overlap with the track search.  Background is reduced by a factor of $6 \\times 10^{-6}$ from online filter level to the BDT-based final selection.  Figure \\ref{effs} shows the $\\nu_e$ signal efficiency at this final level with respect to the online filter rate as a function of energy.  The slight decrease in efficiency for the highest energy signal is due to events for which the computationally expensive reconstruction, described at the end of Section \\ref{sec:simandreco} and used in the likelihood analysis, fails to converge.  These simulated neutrinos interact outside of the detector, account for about 1\\% of the $E^{-2}$ signal, and are discarded prior to the BDT selection.\n\nOne of the most effective BDT variables is the same ratio of the track likelihood to the cascade likelihood used in level 3.  The high energy background muons that passed in spite of the selection at level 3 are distinguished from signal with the BDT algorithm.  The large likelihood ratios, seen in Figures \\ref{vars-level3} and \\ref{vars-final}, are due to the highest energy signal events with the most hit DOMs.  Another potent variable is the total amount of Cherenkov light imparted in the DOMs divided by the tensor-of-inertia derived elongation of an event.  The numerator separates lower energy background atmospheric muons from higher energy astrophysical signal neutrinos, while the denominator separates elongated background atmospheric muons from spherical neutrino-induced showers.  As shown in Figure \\ref{vars-level3}, the ratio of these two observables effectively separates the lower energy atmospheric neutrino background from our signal as well.  A third useful variable is the reduced negative log-likelihood value from the analytic cascade hypothesis reconstruction.  \n\n\\begin{figure}\n  \\plotthree{fig3a.pdf}{fig3b.pdf}{fig3c.pdf}\n \\caption{Distributions for three of the most powerful signal/background discrimination variables used by the BDT forest, shown after the level 3 event selection.  $E^{-2}$ $\\nu_e$ (red solid line) was used for signal and data (black dots) was used for background in the BDT forest training.  $\\frac{dN}{dE}$ is defined in Figure \\ref{bdtdist}. \n \\label{vars-level3}}\n\\end{figure}\n\n\\begin{figure}\n  \\plotthree{fig4a.pdf}{fig4b.pdf}{fig4c.pdf}\n \\caption{Distributions for three of the most powerful signal/background discrimination variables used by the BDT forest, shown after the final event selection.  $E^{-2}$ $\\nu_e$ (red solid line) was used for signal and data (black dots) was used for background in the BDT forest training.  $\\frac{dN}{dE}$ is defined in Figure \\ref{bdtdist}. \n \\label{vars-final}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig5.pdf}\n \\caption{Distribution of data, simulated muon background, simulated atmospheric neutrino background, simulated $\\mathrm{E}^{-2}$ neutrino signal (where $\\frac{dN}{dE}=10^{-8}\\mathrm{GeV}^{-1}\\mathrm{cm}^{-2}\\mathrm{s}^{-1}\\mathrm{sr}^{-1}(\\frac{E}{\\mathrm{GeV}})^{-2}$) with respect to BDT score.  The vertical dashed line represents the final event selection of $> 0.525$.\n \\label{bdtdist}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig6.pdf}\n \\caption{Signal efficiency relative to online filter level as a function of neutrino energy.  Signal is $E^{-2}$ $\\nu_e$ simulation. Averaged over the three search years, the online filter level data rate is 30 Hz and is reduced to $1.6 \\times 10^{-4}$ Hz at the final analysis level.\n \\label{effs}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig7.pdf}\n \\caption{Effective areas for the full-sky shower-like and Northern Hemisphere track-like GRB-coincident event searches with the 79-string detector.  79- and 86-string detector effective areas are similar.\n \\label{aeff}}\n\\end{figure}\n\n\nCompared to the event samples of IceCube's searches for $\\nu_{\\mu}$-induced tracks from Northern Hemisphere GRBs, our backgrounds in this all-sky all-flavor cascade search require an event selection to a 10 times lower data rate of 0.16~mHz averaged over the three search years.  The differences between neutrino-induced showers and muon-induced stochastic energy loss showers are less apparent than the differences between neutrino-induced tracks and detector-edge and coincident muon-induced tracks incorrectly reconstructed as upgoing.  In the Northern Hemisphere track searches, most of these muons are able to be identified and removed, leaving only atmospheric neutrinos.  As a result, the atmospheric neutrino purity with respect to muons of this all-sky all-flavor search is $\\sim$40\\%, and is significantly less than the $\\sim$90\\% purity of the Northern Hemisphere track searches.  Nevertheless, we achieve similar sensitivity to the track search through our acceptance of $\\nu_e$, $\\nu_{\\tau}$, and $\\nu_{\\mu}$ signal from GRBs over the entire sky.  Figure \\ref{aeff} compares the effective areas for the two different GRB neutrino searches.\n\n\\section{Unbinned Likelihood Analysis}\n\\label{sec:llh}\n\nOnce we have selected a sample of events that resemble high energy neutrino-induced electromagnetic or hadronic showers, we must calculate the likelihood that these events are neutrino signal from observed GRBs.  We use a likelihood function that incorporates the probabilities that an event is a signal neutrino from a GRB or a background atmospheric neutrino or muon.  We calculate these background-like and signal-like probabilities from individually normalized probability distribution functions (PDFs) in time, space, and energy:\n\n", "itemtype": "equation", "pos": 34973, "prevtext": "\ngiven sets of observables $\\overrightarrow{\\textbf{x}}=\\left\\{\\textbf{x}_1,\\textbf{x}_2,...,\\textbf{x}_N\\right\\}$ from N DOMs.  We minimize the negative logarithm of $\\mathcal{L}$ with respect to $\\textbf{a}$.  In these online likelihood reconstructions, the $\\overrightarrow{\\textbf{x}}$ are parametrized in terms of the difference between the recorded photon hit times and the expectation without scattering or absorption \\citep{amandareco}.\n\nFor a cascade hypothesis, which can be considered point-like because of the relatively small maximum shower range on the scale of IceCube instrumentation \\citep{ereco2014}, the time residual depends on the location and time of the interaction vertex $\\textbf{a} = \\left\\{t,x,y,z\\right\\}$.  This minimization is seeded by the above center of mass vertex calculation and the earliest vertex time for which at least 4 DOMs record hits with time residuals within [0, 200] ns.  For an infinite track hypothesis, the time residual depends on the distance from an arbitrary point on the track and the direction of the track $\\textbf{a} = \\left\\{x,y,z,\\theta,\\phi\\right\\}$.  This minimization is seeded by the above line-fit track.  Both of these cascade and track hypothesis maximum likelihoods provide useful best-fit quantities for the event selection described in Section \\ref{sec:eventselect}.\n\nThe more computationally expensive likelihood-based reconstruction that we use on the reduced data takes advantage of detailed in-ice photon propagation models \\citep{photospline,photonics} and DOM waveform information.  The detection of light follows a Poisson distribution and thus the likelihood function we maximize is\n\n\n", "index": 5, "text": "\\begin{equation}\n\\mathcal{L}(k \\vert E,t,x,y,z,\\theta,\\phi) = \\prod_{i=1}^{N_{DOM}} \\frac{\\lambda_{i}^{k_i}}{k_{i}!} {\\mathrm{e}}^{-\\lambda_i}\n\\label{mpodllh}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}(k|E,t,x,y,z,\\theta,\\phi)=\\prod_{i=1}^{N_{DOM}}\\frac{\\lambda_{i}^{k%&#10;_{i}}}{k_{i}!}{\\mathrm{e}}^{-\\lambda_{i}}\" display=\"block\"><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">|</mo><mi>E</mi><mo>,</mo><mi>t</mi><mo>,</mo><mi>x</mi><mo>,</mo><mi>y</mi><mo>,</mo><mi>z</mi><mo>,</mo><mi>θ</mi><mo>,</mo><mi>ϕ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mrow><mi>D</mi><mo>⁢</mo><mi>O</mi><mo>⁢</mo><mi>M</mi></mrow></msub></munderover><mfrac><msubsup><mi>λ</mi><mi>i</mi><msub><mi>k</mi><mi>i</mi></msub></msubsup><mrow><msub><mi>k</mi><mi>i</mi></msub><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mfrac><msup><mi mathvariant=\"normal\">e</mi><mrow><mo>-</mo><msub><mi>λ</mi><mi>i</mi></msub></mrow></msup></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\n", "itemtype": "equation", "pos": 50048, "prevtext": "\nfor the observed and expected number of photoelectrons $k$ and $\\lambda$ in each DOM from a neutrino traveling in direction $(\\theta$,$\\phi)$ and depositing energy $E$ at time $t$ and vertex $(x,y,z)$ \\citep{ereco2014}.  This likelihood in general considers multiple light sources, e.g. for stochastic muon losses along a path through the detector.  Because we define our signal to be neutrino-induced showers, it is sufficient to use a point-like hypothesis.  Due to the linear relationship between Cherenkov light emission and deposited energy in $\\nu_e$ charged-current interactions, we estimate the electromagnetic-equivalent energy of an event by comparing to a template electromagnetic cascade of 1 GeV \\citep{ereco2014}.  By using Cherenkov light source-dependent spline-fit tables of photon amplitudes and time delays, we minimize \\citep{minuit} the negative log-likelihood and extract the best-fit parameters of the particle that produced the shower.\n\nWe iterate this minimization several times and achieve improved angular reconstruction from the best-fit energy and modeled ice structure.  The reconstruction is seeded by the tensor-of-inertia direction, online likelihood vertex, and best-fit energy from a simple isotropic shower and coarsely-binned propagation model expectation in Equation \\ref{mpodllh}.  We use this reconstruction's best-fit direction and energy for each event in our likelihood analysis.  We estimate a lower bound on the error in the reconstructed directions with the Cramer-Rao relation \\citep{cramer,rao} between the covariance of each fit parameter and the inverted Fisher information matrix.  Figure \\ref{angres-eres} shows the angular and energy resolutions using this reconstruction at the final event selection of this cascade search.  The reconstructed energy for neutral current interactions is less than the primary neutrino energy because of the dissipation to outlets without Cherenkov emission.\n\n\n\\begin{figure}\n \\plotthree{fig2a.pdf}{fig2b.pdf}{fig2c.pdf}\n \\caption{Left: Cumulative point spread function per neutrino flavor at final cascade event selection. Middle: Energy resolution per neutrino flavor for charged-current interactions at final event selection. Right: Energy resolution per neutrino flavor for neutral-current interactions at final event selection.\n \\label{angres-eres}}\n\\end{figure}\n\n\\section{Event Selection}\n\\label{sec:eventselect}\n\nOur signal in this search is one or more high energy neutrino-induced showers coincident in space and time with one or more GRBs.  Before we analyze the likelihood that an event is a GRB-emitted neutrino, we must reduce the triggered data that is dominated by nearly 3 kHz of cosmic ray air shower muons to a much smaller selection of possible signal.  Our event selection is optimized on a general $E^{-2}$ spectrum of diffuse astrophysical simulated $\\nu_e$ for signal and off-time data for background; we choose ``off-time\" as data not within two hours of any reported GRB $\\gamma$ emission in order to ensure blindness to potential signal. We use the reconstructions detailed in Section \\ref{sec:simandreco} to remove the background and realize our final sample.\n\nSearches for neutrino-induced showers from astrophysical and atmospheric sources have been conducted previously in IceCube \\citep{firstcascade,ic40cascade,hese2014,mese2015}.  The predominant difference between these and the search presented in this paper is that we assume neutrinos come from known transient sources.  The previous shower-like event selections assume a diffuse signal or constantly emitting sources and, as a result, require much more stringent background reduction that leads to data rates nearly a factor of 100 smaller than what is needed in this search.  Cascade containment constraints in the detector were imposed to reach these low backgrounds, which are achieved in this search by the effective cuts in time and space around each GRB in the unbinned likelihood analysis presented in Section \\ref{sec:llh}.\n\nThe first class of background to remove is track-like events generated by muons losing their energy through continuous ionization processes.  These muon tracks are relatively easily separated from our shower-like neutrino signal by use of a filter run online at the detector site.  During the 79-string configuration, we use the tensor-of-inertia eigenvalue ratio and line-fit absolute speed to choose spherical events.  The online cascade filter for the first two years of the 86-string configuration imposes a zenith-dependent selection to allow more events with energies below 10 TeV.  We use the reduced log-likelihood calculated in the fast cascade likelihood reconstruction to remove a large fraction of the muons that are misreconstructed as upgoing.  The down-going region requires more restrictive reduced log-likelihood values in combination with the same online 79-string event selection from above.\n\nUpon transmission via satellite from the South Pole, these $\\sim 30$~Hz filtered data of spherically shaped events must be further reduced to have optimal performance with the BDT forest algorithm described below.  The background at this rate is still dominated by atmospheric muons that lose their energy through bremsstrahlung, photonuclear interactions, and pair production.  These stochastic energy loss mechanisms create nearly spherical hit patterns that are difficult to differentiate from our signal when the muon track is at the edge or outside of the detector and therefore not observed.  We derive variables from the more CPU-intensive reconstructions run offline to separate these muons from neutrino-induced showers at this selection level, called level 3 in this text, and for eventual machine-learning input.\n\nEven though the background muons in the online filter event selection are shower-like in topology, we exploit the Cherenkov light hit patterns of the minimally ionizing muon track when possible to differentiate from showers produced by neutrinos.  We perform this further separation of signal from muon background first by using the fast track hypothesis and cascade hypothesis analytic likelihood function reconstructions, described in Section \\ref{sec:simandreco}.  Our first level 3 selection is on events for which the ratio of the track likelihood to the cascade likelihood heavily favors the cascade hypothesis.  Two other background muon features that we take advantage of are their down-going directions and typically lower energies.  We thus parametrize the track likelihood reconstructed zenith in terms of reconstructed energy and remove low energy down-going events from our sample.  Lastly at this rate, we choose events based on the fraction of hit DOMs that are inside of a sphere centered on the reconstructed vertex with a radius determined by the mean hit distance.  We optimize the radius and fraction filled of the sphere for reconstructed vertices inside and outside of the instrumented volume and use both volume regions for this neutrino search.\n\nOur final event selection employs a machine learning algorithm to optimize the separation of signal and background over a space of many features.  The algorithm we use is a boosted decision tree forest (BDT) \\citep{freundbdt1997} that also has been used in Northern Hemisphere $\\nu_{\\mu}$ track GRB coincidence searches in IceCube \\citep{ic59nature,grb4year}.  We built a collection of variables, many of which were influenced by past neutrino-induced shower searches conducted in IceCube \\citep{firstcascade,ic40cascade}, to train the BDT to discriminate between signal and background events.  During this training, the algorithm determines the variable value that best separates signal and background at each node of each tree.  Each successive tree increases, or ``boosts,\" the weights of incorrectly classified events from the prior tree, allowing more ambiguous events to be classified correctly.  The trees and forest grow until certain stopping criteria are reached.  The signal/background $(+1/-1)$ score of each event that we use in our final selection is a weighted average of its scores over all trees, where this weight is related to the boost factor of each tree.  For each of the three year-long detector configurations of this search, we train a separate BDT with configuration-specific signal simulation and background data.\n\nOur BDT discrimination variables take advantage of topological and energetic differences between astrophysical neutrino and atmospheric muon spectra.  Figures \\ref{vars-level3} and \\ref{vars-final} show the distributions for simulated astrophysical neutrinos, atmospheric neutrinos, atmospheric muons, and data for three of the most powerful variables used by the BDT after the level 3 and final level, respectively.  Some deviations in variable values between measured and simulated data are visible in Figures \\ref{vars-level3} and \\ref{vars-final}, and are attributed to limitations of simulation in reproducing all observed events.  These deviations do not affect the analysis because the background is determined from measured data.\n\nFigure \\ref{bdtdist} shows the distributions of simulation and data with respect to BDT score.  The vertical dashed line corresponds to our optimized final event selection described in the next section.  The atmospheric and astrophysical $\\nu_{\\mu}$ in these plots is already preselected to be shower-like and has minimal overlap with the track search.  Background is reduced by a factor of $6 \\times 10^{-6}$ from online filter level to the BDT-based final selection.  Figure \\ref{effs} shows the $\\nu_e$ signal efficiency at this final level with respect to the online filter rate as a function of energy.  The slight decrease in efficiency for the highest energy signal is due to events for which the computationally expensive reconstruction, described at the end of Section \\ref{sec:simandreco} and used in the likelihood analysis, fails to converge.  These simulated neutrinos interact outside of the detector, account for about 1\\% of the $E^{-2}$ signal, and are discarded prior to the BDT selection.\n\nOne of the most effective BDT variables is the same ratio of the track likelihood to the cascade likelihood used in level 3.  The high energy background muons that passed in spite of the selection at level 3 are distinguished from signal with the BDT algorithm.  The large likelihood ratios, seen in Figures \\ref{vars-level3} and \\ref{vars-final}, are due to the highest energy signal events with the most hit DOMs.  Another potent variable is the total amount of Cherenkov light imparted in the DOMs divided by the tensor-of-inertia derived elongation of an event.  The numerator separates lower energy background atmospheric muons from higher energy astrophysical signal neutrinos, while the denominator separates elongated background atmospheric muons from spherical neutrino-induced showers.  As shown in Figure \\ref{vars-level3}, the ratio of these two observables effectively separates the lower energy atmospheric neutrino background from our signal as well.  A third useful variable is the reduced negative log-likelihood value from the analytic cascade hypothesis reconstruction.  \n\n\\begin{figure}\n  \\plotthree{fig3a.pdf}{fig3b.pdf}{fig3c.pdf}\n \\caption{Distributions for three of the most powerful signal/background discrimination variables used by the BDT forest, shown after the level 3 event selection.  $E^{-2}$ $\\nu_e$ (red solid line) was used for signal and data (black dots) was used for background in the BDT forest training.  $\\frac{dN}{dE}$ is defined in Figure \\ref{bdtdist}. \n \\label{vars-level3}}\n\\end{figure}\n\n\\begin{figure}\n  \\plotthree{fig4a.pdf}{fig4b.pdf}{fig4c.pdf}\n \\caption{Distributions for three of the most powerful signal/background discrimination variables used by the BDT forest, shown after the final event selection.  $E^{-2}$ $\\nu_e$ (red solid line) was used for signal and data (black dots) was used for background in the BDT forest training.  $\\frac{dN}{dE}$ is defined in Figure \\ref{bdtdist}. \n \\label{vars-final}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig5.pdf}\n \\caption{Distribution of data, simulated muon background, simulated atmospheric neutrino background, simulated $\\mathrm{E}^{-2}$ neutrino signal (where $\\frac{dN}{dE}=10^{-8}\\mathrm{GeV}^{-1}\\mathrm{cm}^{-2}\\mathrm{s}^{-1}\\mathrm{sr}^{-1}(\\frac{E}{\\mathrm{GeV}})^{-2}$) with respect to BDT score.  The vertical dashed line represents the final event selection of $> 0.525$.\n \\label{bdtdist}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig6.pdf}\n \\caption{Signal efficiency relative to online filter level as a function of neutrino energy.  Signal is $E^{-2}$ $\\nu_e$ simulation. Averaged over the three search years, the online filter level data rate is 30 Hz and is reduced to $1.6 \\times 10^{-4}$ Hz at the final analysis level.\n \\label{effs}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig7.pdf}\n \\caption{Effective areas for the full-sky shower-like and Northern Hemisphere track-like GRB-coincident event searches with the 79-string detector.  79- and 86-string detector effective areas are similar.\n \\label{aeff}}\n\\end{figure}\n\n\nCompared to the event samples of IceCube's searches for $\\nu_{\\mu}$-induced tracks from Northern Hemisphere GRBs, our backgrounds in this all-sky all-flavor cascade search require an event selection to a 10 times lower data rate of 0.16~mHz averaged over the three search years.  The differences between neutrino-induced showers and muon-induced stochastic energy loss showers are less apparent than the differences between neutrino-induced tracks and detector-edge and coincident muon-induced tracks incorrectly reconstructed as upgoing.  In the Northern Hemisphere track searches, most of these muons are able to be identified and removed, leaving only atmospheric neutrinos.  As a result, the atmospheric neutrino purity with respect to muons of this all-sky all-flavor search is $\\sim$40\\%, and is significantly less than the $\\sim$90\\% purity of the Northern Hemisphere track searches.  Nevertheless, we achieve similar sensitivity to the track search through our acceptance of $\\nu_e$, $\\nu_{\\tau}$, and $\\nu_{\\mu}$ signal from GRBs over the entire sky.  Figure \\ref{aeff} compares the effective areas for the two different GRB neutrino searches.\n\n\\section{Unbinned Likelihood Analysis}\n\\label{sec:llh}\n\nOnce we have selected a sample of events that resemble high energy neutrino-induced electromagnetic or hadronic showers, we must calculate the likelihood that these events are neutrino signal from observed GRBs.  We use a likelihood function that incorporates the probabilities that an event is a signal neutrino from a GRB or a background atmospheric neutrino or muon.  We calculate these background-like and signal-like probabilities from individually normalized probability distribution functions (PDFs) in time, space, and energy:\n\n", "index": 7, "text": "\n\\[\n\\mathcal{S}(\\overrightarrow{x_i}) = P^{\\mathrm{Time}}_{\\mathrm{s}}(t_i) \\times P^{\\mathrm{Space}}_{\\mathrm{s}}(\\overrightarrow{r_i}) \\times P^{\\mathrm{Energy}}_{\\mathrm{s}}(E_i)\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{S}(\\overrightarrow{x_{i}})=P^{\\mathrm{Time}}_{\\mathrm{s}}(t_{i})%&#10;\\times P^{\\mathrm{Space}}_{\\mathrm{s}}(\\overrightarrow{r_{i}})\\times P^{%&#10;\\mathrm{Energy}}_{\\mathrm{s}}(E_{i})\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mrow><msubsup><mi>P</mi><mi mathvariant=\"normal\">s</mi><mi>Time</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><msubsup><mi>P</mi><mi mathvariant=\"normal\">s</mi><mi>Space</mi></msubsup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>r</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><msubsup><mi>P</mi><mi mathvariant=\"normal\">s</mi><mi>Energy</mi></msubsup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nwhere S and B are the probabilities that an event $i$ with properties $\\overrightarrow{x}_i$ is signal and background, respectively.\n\nThe signal time PDF is flat during the gamma-ray emission duration ($T_{100}$ defined in Section \\ref{sec:promptgrbnuspec}) and has Gaussian tails before $T_1$ and after $T_2$.  The width of these Gaussian tails $\\sigma_{\\mathrm{t}}$ equals the duration of measured gamma-ray emission up to 30 s and down to 2 s to account for possible small shifts in the neutrino emission time with respect to that of the photons.  We accept events out to $T_{100}\\pm4 \\sigma_{\\mathrm{t}}$ for each GRB time window.  The background time PDF is flat throughout the total period of acceptance for each GRB.  Examples of the signal / background time PDF ratios for events during GRBs with different measured durations are shown in Figure \\ref{timepdf}.\n\n\\begin{figure}[tbp]\n \\plotone{fig8.pdf}\n \\caption{Signal / background time PDF ratios for events during example GRBs with different measured $T_{100}$ values.\n \\label{timepdf}}\n\\end{figure}\n\nThe signal space PDF is the first-order non-elliptical term in the Kent distribution \\citep{kent}:\n\n\n", "itemtype": "equation", "pos": 50232, "prevtext": "\n", "index": 9, "text": "\n\\[\n\\mathcal{B}(\\overrightarrow{x_i}) = P^{\\mathrm{Time}}_{\\mathrm{b}}(t_i)  \\times P^{\\mathrm{Space}}_{\\mathrm{b}}(\\overrightarrow{r_i}) \\times P^{\\mathrm{Energy}}_{\\mathrm{b}}(E_i)\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{B}(\\overrightarrow{x_{i}})=P^{\\mathrm{Time}}_{\\mathrm{b}}(t_{i})%&#10;\\times P^{\\mathrm{Space}}_{\\mathrm{b}}(\\overrightarrow{r_{i}})\\times P^{%&#10;\\mathrm{Energy}}_{\\mathrm{b}}(E_{i})\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mrow><mrow><msubsup><mi>P</mi><mi mathvariant=\"normal\">b</mi><mi>Time</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><msubsup><mi>P</mi><mi mathvariant=\"normal\">b</mi><mi>Space</mi></msubsup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>r</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><msubsup><mi>P</mi><mi mathvariant=\"normal\">b</mi><mi>Energy</mi></msubsup></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>E</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nfor which the concentration parameter $\\kappa=\\frac{1}{\\sigma^2_{\\mathrm{GRB}}+\\sigma^2_{i}}$ is the reciprocal of the uncertainty in the GRB's localization and the Cramer-Rao uncertainty in the event's reconstructed direction, $\\hat{r}_i$ is the reconstructed direction of the event, and $\\hat{r}_{\\mathrm{GRB}}$ is the most precise GRB localization available.  We use this spherical analogue of the planar Gaussian distribution because of the large uncertainties in our reconstructed cascade event directions.  The background space PDF is a spline fit to the distribution of reconstructed $\\cos(\\theta_{\\mathrm{zenith}})$ of all final analysis level off-time data events.  Small variance in the background reconstructed azimuth distribution has negligible impact on this analysis, and so our background space PDF only varies with zenith.  Examples of the signal space PDFs for events and correlated GRBs with different directional uncertainties are shown with the background space PDF in Figure \\ref{spacepdf}.\n\n\\begin{figure}[tbp]\n  \\plottwo{fig9a.pdf}{fig9b.pdf}\n \\caption{Left: Signal space PDFs for three example events and correlated GRBs. Right: Background space PDF, calculated from a spline fit to the zenith distribution of data events at final analysis level.  The 79- and 86-string detectors show azimuthal symmetry.\n \\label{spacepdf}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig10.pdf}\n \\caption{Left vertical axis: Reconstructed energy distributions of data (dot markers) and $\\mathrm{E}^{-2}$ $\\nu_e$ signal (red line) at final analysis level.  Right vertical axis: Signal / background energy PDF distribution (black line) calculated from a spline fit to the ratio of the two energy distributions.\n \\label{energypdf}}\n\\end{figure}\n\nThe signal and background energy PDFs are the reconstructed energy distributions of $E^{-2}$ $\\nu_e$ simulation and off-time data, respectively.  We fit a spline to the ratio of these two PDFs.  We find few background events in our final sample that have reconstructed energies above 1 PeV, and so we conservatively assume a constant ratio of signal and background energy PDFs at energies above 1 PeV.  The signal and background energy PDFs and their spline-fit ratio are shown in Figure \\ref{energypdf}.\n\nIn order to choose our optimal final selection on BDT score and characterize the significance of the result, we construct a test statistic in the form of a maximum likelihood function.  This function incorporates probabilities that observed events are signal and background as well as provides an estimator for the number of observed signal events.  The likelihood function combines the above signal and background PDFs with the Poisson probability $P_N$ of observing $N$ events, given that the expected total number of signal + background events is $n_{\\mathrm{s}}+n_{\\mathrm{b}}$:\n\n\n", "itemtype": "equation", "pos": 51579, "prevtext": "\nwhere S and B are the probabilities that an event $i$ with properties $\\overrightarrow{x}_i$ is signal and background, respectively.\n\nThe signal time PDF is flat during the gamma-ray emission duration ($T_{100}$ defined in Section \\ref{sec:promptgrbnuspec}) and has Gaussian tails before $T_1$ and after $T_2$.  The width of these Gaussian tails $\\sigma_{\\mathrm{t}}$ equals the duration of measured gamma-ray emission up to 30 s and down to 2 s to account for possible small shifts in the neutrino emission time with respect to that of the photons.  We accept events out to $T_{100}\\pm4 \\sigma_{\\mathrm{t}}$ for each GRB time window.  The background time PDF is flat throughout the total period of acceptance for each GRB.  Examples of the signal / background time PDF ratios for events during GRBs with different measured durations are shown in Figure \\ref{timepdf}.\n\n\\begin{figure}[tbp]\n \\plotone{fig8.pdf}\n \\caption{Signal / background time PDF ratios for events during example GRBs with different measured $T_{100}$ values.\n \\label{timepdf}}\n\\end{figure}\n\nThe signal space PDF is the first-order non-elliptical term in the Kent distribution \\citep{kent}:\n\n\n", "index": 11, "text": "\\begin{equation}\nP^{\\mathrm{Space}}_{\\mathrm{s}}(\\overrightarrow{r_i}) = \\frac{\\kappa}{4\\pi\\sinh(\\kappa)} {\\mathrm{e}}^{\\kappa(\\hat{r}_i \\cdot \\hat{r}_{\\mathrm{GRB}})}\n\\label{kent}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"P^{\\mathrm{Space}}_{\\mathrm{s}}(\\overrightarrow{r_{i}})=\\frac{\\kappa}{4\\pi%&#10;\\sinh(\\kappa)}{\\mathrm{e}}^{\\kappa(\\hat{r}_{i}\\cdot\\hat{r}_{\\mathrm{GRB}})}\" display=\"block\"><mrow><mrow><msubsup><mi>P</mi><mi mathvariant=\"normal\">s</mi><mi>Space</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>r</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mi>κ</mi><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mrow><mi>sinh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>κ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac><mo>⁢</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mi>κ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">^</mo></mover><mi>i</mi></msub><mo>⋅</mo><msub><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">^</mo></mover><mi>GRB</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nwhere\n\n", "itemtype": "equation", "pos": 54617, "prevtext": "\nfor which the concentration parameter $\\kappa=\\frac{1}{\\sigma^2_{\\mathrm{GRB}}+\\sigma^2_{i}}$ is the reciprocal of the uncertainty in the GRB's localization and the Cramer-Rao uncertainty in the event's reconstructed direction, $\\hat{r}_i$ is the reconstructed direction of the event, and $\\hat{r}_{\\mathrm{GRB}}$ is the most precise GRB localization available.  We use this spherical analogue of the planar Gaussian distribution because of the large uncertainties in our reconstructed cascade event directions.  The background space PDF is a spline fit to the distribution of reconstructed $\\cos(\\theta_{\\mathrm{zenith}})$ of all final analysis level off-time data events.  Small variance in the background reconstructed azimuth distribution has negligible impact on this analysis, and so our background space PDF only varies with zenith.  Examples of the signal space PDFs for events and correlated GRBs with different directional uncertainties are shown with the background space PDF in Figure \\ref{spacepdf}.\n\n\\begin{figure}[tbp]\n  \\plottwo{fig9a.pdf}{fig9b.pdf}\n \\caption{Left: Signal space PDFs for three example events and correlated GRBs. Right: Background space PDF, calculated from a spline fit to the zenith distribution of data events at final analysis level.  The 79- and 86-string detectors show azimuthal symmetry.\n \\label{spacepdf}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n \\plotone{fig10.pdf}\n \\caption{Left vertical axis: Reconstructed energy distributions of data (dot markers) and $\\mathrm{E}^{-2}$ $\\nu_e$ signal (red line) at final analysis level.  Right vertical axis: Signal / background energy PDF distribution (black line) calculated from a spline fit to the ratio of the two energy distributions.\n \\label{energypdf}}\n\\end{figure}\n\nThe signal and background energy PDFs are the reconstructed energy distributions of $E^{-2}$ $\\nu_e$ simulation and off-time data, respectively.  We fit a spline to the ratio of these two PDFs.  We find few background events in our final sample that have reconstructed energies above 1 PeV, and so we conservatively assume a constant ratio of signal and background energy PDFs at energies above 1 PeV.  The signal and background energy PDFs and their spline-fit ratio are shown in Figure \\ref{energypdf}.\n\nIn order to choose our optimal final selection on BDT score and characterize the significance of the result, we construct a test statistic in the form of a maximum likelihood function.  This function incorporates probabilities that observed events are signal and background as well as provides an estimator for the number of observed signal events.  The likelihood function combines the above signal and background PDFs with the Poisson probability $P_N$ of observing $N$ events, given that the expected total number of signal + background events is $n_{\\mathrm{s}}+n_{\\mathrm{b}}$:\n\n\n", "index": 13, "text": "\\begin{equation}\n\\mathcal{L}(\\left\\{\\overrightarrow{x_i}\\right\\};n_{\\mathrm{s}}+n_{\\mathrm{b}}) = P_{N} \\prod_{i=1}^{N}(p_{\\mathrm{s}}\\mathcal{S}(\\overrightarrow{x_i}) + p_{\\mathrm{b}}\\mathcal{B}(\\overrightarrow{x_i}))\n\\label{totallh}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{L}(\\left\\{\\overrightarrow{x_{i}}\\right\\};n_{\\mathrm{s}}+n_{\\mathrm{b}%&#10;})=P_{N}\\prod_{i=1}^{N}(p_{\\mathrm{s}}\\mathcal{S}(\\overrightarrow{x_{i}})+p_{%&#10;\\mathrm{b}}\\mathcal{B}(\\overrightarrow{x_{i}}))\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>{</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo>}</mo></mrow><mo>;</mo><mrow><msub><mi>n</mi><mi mathvariant=\"normal\">s</mi></msub><mo>+</mo><msub><mi>n</mi><mi mathvariant=\"normal\">b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>P</mi><mi>N</mi></msub><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mrow><mi>i</mi><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>p</mi><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>p</mi><mi mathvariant=\"normal\">b</mi></msub><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nand $p_{\\mathrm{s}}=\\frac{n_{\\mathrm{s}}}{n_{\\mathrm{s}}+n_{\\mathrm{b}}}$ and $p_{\\mathrm{b}}=\\frac{n_{\\mathrm{b}}}{n_{\\mathrm{s}}+n_{\\mathrm{b}}}$ are the probabilities of observing a signal and background event.\n\nWe do not know \\textit{a priori} the total number of events we will observe.  Therefore, we estimate $n_b$ from the background data rate multiplied by the total search time window $\\sum_{i}^{N_{\\mathrm{GRBs}}} (T_{100, i} + 8\\sigma_{\\mathrm{t},i})$ in which we accept events; and this expectation is denoted by $\\langle n_{\\mathrm{b}} \\rangle$.  We estimate $n_{\\mathrm{s}}$ from the value $\\hat{n}_{\\mathrm{s}}$ that maximizes $\\mathcal{L}$.  Additionally, we simplify the likelihood function by dividing by its background-only hypothesis and taking the logarithm of this ratio without loss of generality.  Finally, our test statistic $T$ is the maximized value of this ratio at $\\hat{n}_{\\mathrm{s}}$:\n\n\n", "itemtype": "equation", "pos": 54873, "prevtext": "\nwhere\n\n", "index": 15, "text": "\\begin{equation}\nP_{N} = \\frac{(n_{\\mathrm{s}}+n_{\\mathrm{b}})^N {\\mathrm{e}}^{-(n_{\\mathrm{s}}+n_{\\mathrm{b}})}}{N!}\n\\label{poissonlh}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"P_{N}=\\frac{(n_{\\mathrm{s}}+n_{\\mathrm{b}})^{N}{\\mathrm{e}}^{-(n_{\\mathrm{s}}+%&#10;n_{\\mathrm{b}})}}{N!}\" display=\"block\"><mrow><msub><mi>P</mi><mi>N</mi></msub><mo>=</mo><mfrac><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi mathvariant=\"normal\">s</mi></msub><mo>+</mo><msub><mi>n</mi><mi mathvariant=\"normal\">b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mi>N</mi></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mi mathvariant=\"normal\">s</mi></msub><mo>+</mo><msub><mi>n</mi><mi mathvariant=\"normal\">b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msup></mrow><mrow><mi>N</mi><mo lspace=\"0pt\" rspace=\"3.5pt\">!</mo></mrow></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nWe extend to multiple detector configurations (79~strings, first year of 86 strings, second year of 86 strings, etc.) and search channels (cascades, tracks) by adding maximized test statistics for each configuration and channel:\n\n\n", "itemtype": "equation", "pos": 55944, "prevtext": "\nand $p_{\\mathrm{s}}=\\frac{n_{\\mathrm{s}}}{n_{\\mathrm{s}}+n_{\\mathrm{b}}}$ and $p_{\\mathrm{b}}=\\frac{n_{\\mathrm{b}}}{n_{\\mathrm{s}}+n_{\\mathrm{b}}}$ are the probabilities of observing a signal and background event.\n\nWe do not know \\textit{a priori} the total number of events we will observe.  Therefore, we estimate $n_b$ from the background data rate multiplied by the total search time window $\\sum_{i}^{N_{\\mathrm{GRBs}}} (T_{100, i} + 8\\sigma_{\\mathrm{t},i})$ in which we accept events; and this expectation is denoted by $\\langle n_{\\mathrm{b}} \\rangle$.  We estimate $n_{\\mathrm{s}}$ from the value $\\hat{n}_{\\mathrm{s}}$ that maximizes $\\mathcal{L}$.  Additionally, we simplify the likelihood function by dividing by its background-only hypothesis and taking the logarithm of this ratio without loss of generality.  Finally, our test statistic $T$ is the maximized value of this ratio at $\\hat{n}_{\\mathrm{s}}$:\n\n\n", "index": 17, "text": "\\begin{equation} \\label{teststat}\nT = -\\hat{n}_{\\mathrm{s}} + \\sum_{i=0}^N\\ln{\\left[\\frac{\\hat{n}_{\\mathrm{s}} \\mathcal{S}(\\overrightarrow{x_i})}{\\langle n_{\\mathrm{b}} \\rangle \\mathcal{B}(\\overrightarrow{x_i})} + 1\\right]}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"T=-\\hat{n}_{\\mathrm{s}}+\\sum_{i=0}^{N}\\ln{\\left[\\frac{\\hat{n}_{\\mathrm{s}}%&#10;\\mathcal{S}(\\overrightarrow{x_{i}})}{\\langle n_{\\mathrm{b}}\\rangle\\mathcal{B}(%&#10;\\overrightarrow{x_{i}})}+1\\right]}\" display=\"block\"><mrow><mi>T</mi><mo>=</mo><mrow><mrow><mo>-</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">s</mi></msub></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>0</mn></mrow><mi>N</mi></munderover><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mfrac><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">s</mi></msub><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>n</mi><mi mathvariant=\"normal\">b</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>+</mo><mn>1</mn></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nwhere c represents each combination of search channel and detector configuration.\n\nTo set discovery significance thresholds, we first perform $10^8$  pseudo-search trials using only background data for a range of BDT score $> s$ cuts.  Each background sample has its own $\\langle n_{\\mathrm{b}} \\rangle_{\\mathrm{cut}}$, with lower values for cuts on higher BDT scores.  In each background-only trial, for each GRB, we choose a pseudo-random number of observed events within our $T_{100} \\pm 4\\sigma_{\\mathrm{t}}$ search time window about the gamma-ray emission from a Poisson distribution with expectation determined by the background data rate and time window.  If the number of events is 0, then $T$ receives no contribution from the search window about that GRB.  If the number of events is greater than 0, then we construct each event using the following steps: (1) choose a random time PDF value; (2) choose a random azimuth within 0 to $2\\pi$; (3) choose a reconstructed energy by sampling from the background distribution; (4) choose a reconstructed zenith by sampling from the background distribution of events with similar energy; (5) choose an estimated error in reconstructed direction by sampling from the background distribution of events with similar energy and zenith.  Finally, with the signal and background PDF values for every event, we calculate the test statistic for each trial.  We obtain a distribution like that shown in Figure \\ref{tsd} for each possible selection on BDT score.\n\nWe choose our optimal final selection on BDT score by injecting simulated neutrino signal along with background data and performing $10^4$ pseudo-search trials for a range of BDT score $> s$ cuts.  The background events are selected for each GRB the same as above for the background-only trials.  The simulated signal events within an $11^{\\circ}$ circle about each GRB contribute to the likelihood with a probability proportional to their simulated weight.  Signal is increasingly weighted until a defined discovery or limit-setting threshold is reached.  These discovery and limit-setting potentials per cut on BDT score are shown in Figure~\\ref{llhoptimization} for a general $E^{-2}$ spectrum and the Figure~\\ref{grbspectra} benchmark internal shock fireball spectrum.  The final selection, BDT score $> 0.525$, was optimized to set the best possible upper limit while suffering little loss in discovery potential.  This optimization was performed for each search year's event selection.\n\n\\begin{figure}[tbp]\n \\plotone{fig11.pdf}\n \\caption{Test statistic distribution for $10^8$ randomized background-only pseudo-searches at final analysis level.  The vertical lines represent test statistic values for a $3\\sigma$, $4\\sigma$, and $5\\sigma$ discovery.\n \\label{tsd}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n  \\plottwo{fig12a.pdf}{fig12b.pdf}\n \\caption{Limit setting and discovery potentials per cut on BDT score for a single year's search.  Horizontal axis corresponds to a BDT score $> s$ cut.  The final event selection was optimized for limit setting while suffering little loss in discovery potential.  The vertical dashed line represents our final event selection of BDT score $> 0.525$.  Left: The vertical axis corresponds to the $E^{-2}$ spectrum signal weight needed in order to reach the given threshold.  Right: Vertical axis corresponds to the multiplying factor $\\mu$ on the benchmark internal shock fireball model neutrino flux shown in Figure \\ref{grbspectra} in order to reach the given threshold.\n \\label{llhoptimization}}\n\\end{figure}\n\n\n\\section{Results}\n\\label{sec:results}\n\n\\begin{table*}\n\\begin{center}\n\t\\begin{tabular}{ccccc} \\toprule\n\t   & Time & Angular Uncertainty & Angular Separation & Fluence/Energy \\\\ \\midrule\n\t GRB101213A & $T_{100} = 202$ s & $0.0005^{\\circ}$ & & $7.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 1 & $T_1 + 109$ s & $32.0^{\\circ}$ & $23^{\\circ}$ & 11 TeV \\\\ \\midrule\n\t GRB110101B & $T_{100} = 235$ s & $16.5^{\\circ}$ & & $6.6 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 2 & $T_1 + 141$ s & $118^{\\circ}$ & $112^{\\circ}$ & 34 TeV \\\\ \\midrule\n\t GRB110521B & $T_{100} = 6.14$ s & $1.31^{\\circ}$ & & $3.6 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 3 & $T_1 + 0.26$ s & $16.5^{\\circ}$ & $34.6^{\\circ}$ & 3.4 TeV \\\\ \\midrule\n\t GRB111212A & $T_{100} = 68.5$ s & $0.0004^{\\circ}$ & & $1.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 4 & $T_1 + 11.7$ s & $44.8^{\\circ}$ & $120.2^{\\circ}$ & 30.6 TeV \\\\ \\midrule\n\t GRB120114A & $T_{100} = 43.3$ s & $0.04^{\\circ}$ & & $2.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 5 & $T_1 + 57.2$ s & $7.9^{\\circ}$ & $17.7^{\\circ}$ & 3.8 TeV \\\\ \\midrule\n\t GRB100718A$^a$ & $T_{100} = 39$ s & $10.2^{\\circ}$ & & $2.5 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t $\\nu_{\\mu}$ Track Event$^a$ & $T_1 + 15$ s & $16^{\\circ}$ & $1.3^{\\circ}$ & $\\gtrsim$ 10 TeV \\\\\n\t \\bottomrule\n\t\\end{tabular}\n     \\caption{GRB and event properties for the three-year cascade and four-year track search coincidences.\\newline$^a$ Corresponds to the $\\nu_{\\mu}$ track search coincidence discussed in \\cite{grb4year}.\n     \\label{tab:results}}\n\\end{center}\n\\end{table*}\n\nIn three years of data, five cascade neutrino candidate events are correlated with five GRBs.  These coincidences yield a combined P-value of 0.32, derived from the total test statistic value with respect to the background-only distribution.  The Northern Hemisphere track searches in four years of data resulted in a single neutrino candidate event correlated with prompt GRB emission and a combined P-value of 0.46 \\citep{grb4year}.  Considering the atmospheric neutrino purity of each search, discussed in section \\ref{sec:eventselect}, the track event is almost certainly a $\\nu_{\\mu}$ while the cascade events could be high energy atmospheric muons.\n\nTable \\ref{tab:results} shows the time, space, and energy data for these events and GRBs.  Events 1, 2, and 4 occurred on the edge or corner of the detector.  Events 3 and 5 occurred within the instrumented volume.  The large directional uncertainties of the second and fourth events are due to the location of their interactions at the corner and edge of the instrumented volume, with relatively few DOMs able to record the Cherenkov light.  The reconstructed energy of the muon neutrino track coincidence discussed in \\cite{grb4year} is an approximate lower bound on the neutrino energy because the interaction could have taken place well outside of IceCube and consequently, the muon could have lost significant energy before reaching the detector.\n\nThe benchmark internal shock, photospheric, and ICMART fireball model spectra plotted in Figure \\ref{grbspectra} yield expectations of 1.5, 2.5, and 0.07 neutrinos, respectively, for this three-year all-flavor cascade analysis.  As discussed at the end of Section 5, this search achieves nearly the same sensitivity as the Northern Hemisphere track search.  Thus, the combined four years of track searches and three years of shower searches yield total benchmark model expectations of 3.3, 5.4, and 0.1 neutrinos.  The all-flavor shower search has an average $\\langle n_{\\mathrm{b}} \\rangle$ of 11 events per year.  This expectation is concentrated at lower energies than the expected signal and is weighted by the time, space, and energy PDFs accordingly in our unbinned likelihood.  The expected background during just the $T_{100}$ of each GRB is 3.5 events per year.  An observation of three 1 PeV neutrinos correlated with three GRBs, with the same temporal and spatial properties as our observed Event 1 and its respective GRB in Table \\ref{tab:results}, would yield a $T$ value over 12 and a $5\\sigma$ discovery based on the background-only distribution in Figure \\ref{tsd}.\n\nConsidering the low significance of the events correlated with GRBs, we set 90\\% CL Neyman upper limits \\citep{neyman1937} on models normalized to the observed flux of UHECRs as well as models normalized to the observed gamma-ray fluence of each GRB.  We calculate these limits by combining the three-year cascade search results and four-year Northern Hemisphere track search results using the multiple configuration and channel test statistic given in Equation \\ref{teststatcomb}.  Simulated neutrinos are weighted to a certain spectrum and normalization and injected over background in the pseudo-searches.  The exclusion confidence level (CL) is the fraction of pseudo-search trials that yield $T \\geq T_{\\mathrm{observed}}$.\n\nFigure \\ref{topdownlimits} shows exclusion contours for double broken power law spectra of the form\n\n\n", "itemtype": "equation", "pos": 56413, "prevtext": "\nWe extend to multiple detector configurations (79~strings, first year of 86 strings, second year of 86 strings, etc.) and search channels (cascades, tracks) by adding maximized test statistics for each configuration and channel:\n\n\n", "index": 19, "text": "\\begin{equation}\nT = \\sum_{\\mathrm{c}}\\left\\{-(\\hat{n}_{\\mathrm{s}})_{\\mathrm{c}} + \\sum_{i=0}^{N_{\\mathrm{c}}}\\ln{\\left[\\frac{(\\hat{n}_{\\mathrm{s}})_{\\mathrm{c}} \\mathcal{S}_{\\mathrm{c}}(\\overrightarrow{x_i})}{\\langle n_{\\mathrm{b}} \\rangle_{\\mathrm{c}} \\mathcal{B}_{\\mathrm{c}}(\\overrightarrow{x_i})} + 1\\right]}\\right\\}\n\\label{teststatcomb}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"T=\\sum_{\\mathrm{c}}\\left\\{-(\\hat{n}_{\\mathrm{s}})_{\\mathrm{c}}+\\sum_{i=0}^{N_{%&#10;\\mathrm{c}}}\\ln{\\left[\\frac{(\\hat{n}_{\\mathrm{s}})_{\\mathrm{c}}\\mathcal{S}_{%&#10;\\mathrm{c}}(\\overrightarrow{x_{i}})}{\\langle n_{\\mathrm{b}}\\rangle_{\\mathrm{c}%&#10;}\\mathcal{B}_{\\mathrm{c}}(\\overrightarrow{x_{i}})}+1\\right]}\\right\\}\" display=\"block\"><mrow><mi>T</mi><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi mathvariant=\"normal\">c</mi></munder><mrow><mo>{</mo><mrow><mrow><mo>-</mo><msub><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">c</mi></msub></mrow><mo>+</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mn>0</mn></mrow><msub><mi>N</mi><mi mathvariant=\"normal\">c</mi></msub></munderover><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mfrac><mrow><msub><mrow><mo stretchy=\"false\">(</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">^</mo></mover><mi mathvariant=\"normal\">s</mi></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">c</mi></msub><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">𝒮</mi><mi mathvariant=\"normal\">c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>n</mi><mi mathvariant=\"normal\">b</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mi mathvariant=\"normal\">c</mi></msub><mo>⁢</mo><msub><mi class=\"ltx_font_mathcaligraphic\">ℬ</mi><mi mathvariant=\"normal\">c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><msub><mi>x</mi><mi>i</mi></msub><mo>→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>+</mo><mn>1</mn></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>}</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06484.tex", "nexttext": "\nat different first break energies $\\epsilon_b$ and normalizations $\\epsilon_b^2 \\phi_0$.  Our combined limits largely rule out cosmic ray escape via neutron production \\citep{probation2011}.  Mechanisms allowing for cosmic ray escape via protons \\citep{wb1997} are disfavored as well.  The \\cite{wb1997} model has been updated to account for more recent measurements of the UHECR flux \\citep{katz2009energy} and typical gamma break energy \\citep{goldstein2012}.\n\nFigure \\ref{bottomuplimits} shows exclusion contours in the baryonic loading - bulk Lorentz factor parameter space for the internal shock, photospheric, and ICMART per-burst gamma-ray-normalized fireball models.  The benchmark model spectra from Figure \\ref{grbspectra} are indicated by the intersection of the vertical and horizontal dashed lines.  Systematic uncertainties in the ice model, DOM photon detection efficiency, and lepton propagation in the earth and ice are added in quadrature to a total effect of $\\sim11\\%$ for each model limit.  The addition of the all-sky cascade search over three years of data and GRBs improves the Northern Hemisphere track search limits by about 50\\%.\n\n\\begin{figure}[tbp]\n \\plotone{fig13.pdf}\n \\caption{Exclusion contours, calculated from the combined three-year all-sky $\\nu_{e}$ $\\nu_{\\tau}$ $\\nu_{\\mu}$ shower-like event search and four-year Northern Hemisphere $\\nu_{\\mu}$ track-like event search results, of a per-flavor double broken power law GRB neutrino flux of a given flux normalization $\\phi_b$ at first break energy $\\epsilon_b$.\n \\label{topdownlimits}}\n\\end{figure}\n\n\\begin{figure}\n  \\plotthree{fig14a.pdf}{fig14b.pdf}{fig14c.pdf}\n \\caption{Exclusion contours, calculated from the combined three-year all-sky $\\nu_{e}$ $\\nu_{\\tau}$ $\\nu_{\\mu}$ shower-like event search and four-year Northern Hemisphere $\\nu_{\\mu}$ track-like event search results, in $f_p$ and $\\Gamma$ GRB parameter space, for three different models of fireball neutrino production. These models differ in the radius at which $p\\gamma$ interactions occur.  The vertical and horizontal dashed lines indicate the benchmark parameters used for Figure \\ref{grbspectra} and the right panel of Figure \\ref{llhoptimization}.  Left: Internal Shock.  Middle: Photospheric.  Right: ICMART.\n \\label{bottomuplimits}}\n\\end{figure}\n\n\\section{Conclusions and Outlook}\n\\label{sec:outlook}\n\nWe have performed a search for neutrinos of all flavors emitted by 807 GRBs during three years of IceCube data.  This search exhibits similar sensitivity to that of previously published searches for muon neutrinos emitted by 506 Northern Hemisphere GRBs during four years of IceCube data.  Over both search channels, we found five events that are correlated with GRBs but also consistent with background.  Our limits placed on neutrino emission models normalized to the observed UHECR flux are the strongest constraints thus far on the hypothesis that GRBs are the dominant sources of this flux.  Additionally, our limits placed on the latest neutrino emission models normalized to the observed gamma-ray fluence from each GRB constrain parts of the parameters space relevant for the production of UHECR protons.  Models that are still allowed require increasingly lower neutrino production efficiencies through large bulk Lorentz boost factors, low baryonic loading, or large dissipation radii.\n\nAs shown in \\cite{baerwald2014}, constraints on parameters involved in fireball neutrino production via internal shock collisions can be connected to the requirement that GRBs are the sources of the observed UHECRs in a self-consistent way, assuming a pure proton composition.  Cosmic ray escape from GRB fireballs through neutron production is strongly constrained by our limits.  Nevertheless, \\cite{baerwald2014} show that the unexcluded parameter space in Figure \\ref{bottomuplimits} allows for efficient diffusive proton escape, assuming a galactic-to-extragalactic source transition at the ankle of the cosmic ray spectrum.  Although the allowed parameter space of this model is plausible, the average burst likely exhibits $\\Gamma$ and $f_p$ values that are largely excluded for neutrino production.  Nevertheless, we have only considered single-zone neutrino and cosmic ray emission models of GRBs in this work, and models of multiple emission regions predict a neutrino flux below our current sensitivity~\\citep{multipleis2015}.\n\nOur acceptance of possible prompt neutrino signal can increase further through the addition of searches for $\\nu_{\\mu}$-induced tracks correlated with Southern Hemisphere GRBs that occurred during the 79-string and completed detector configurations.  Moreoever, the next-generation \\textit{IceCube-Gen2} detector will significantly improve the sensitivity to transient sources \\citep{icecubegen2, AhlersHalzenicecubegen2}.  The continued pursuit of all neutrino flavors from observed GRBs over the entire sky will either reveal a flux that is still lower than our current sensitivity or increasingly disfavor these phenomena as sources of the highest energy cosmic rays.\n\n\\acknowledgments\n\nWe acknowledge the support from the following agencies:\nU.S. National Science Foundation-Office of Polar Programs,\nU.S. National Science Foundation-Physics Division,\nUniversity of Wisconsin Alumni Research Foundation,\nthe Grid Laboratory Of Wisconsin (GLOW) grid infrastructure at the University of Wisconsin - Madison, the Open Science Grid (OSG) grid infrastructure;\nU.S. Department of Energy, and National Energy Research Scientific Computing Center,\nthe Louisiana Optical Network Initiative (LONI) grid computing resources;\nNatural Sciences and Engineering Research Council of Canada,\nWestGrid and Compute/Calcul Canada;\nSwedish Research Council,\nSwedish Polar Research Secretariat,\nSwedish National Infrastructure for Computing (SNIC),\nand Knut and Alice Wallenberg Foundation, Sweden;\nGerman Ministry for Education and Research (BMBF),\nDeutsche Forschungsgemeinschaft (DFG),\nHelmholtz Alliance for Astroparticle Physics (HAP),\nResearch Department of Plasmas with Complex Interactions (Bochum), Germany;\nFund for Scientific Research (FNRS-FWO),\nFWO Odysseus programme,\nFlanders Institute to encourage scientific and technological research in industry (IWT),\nBelgian Federal Science Policy Office (Belspo);\nUniversity of Oxford, United Kingdom;\nMarsden Fund, New Zealand;\nAustralian Research Council;\nJapan Society for Promotion of Science (JSPS);\nthe Swiss National Science Foundation (SNSF), Switzerland;\nNational Research Foundation of Korea (NRF);\nDanish National Research Foundation, Denmark (DNRF)\n\n\n\n\\bibliographystyle{apj}\n\\bibliography{bibdatabase}\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 65293, "prevtext": "\nwhere c represents each combination of search channel and detector configuration.\n\nTo set discovery significance thresholds, we first perform $10^8$  pseudo-search trials using only background data for a range of BDT score $> s$ cuts.  Each background sample has its own $\\langle n_{\\mathrm{b}} \\rangle_{\\mathrm{cut}}$, with lower values for cuts on higher BDT scores.  In each background-only trial, for each GRB, we choose a pseudo-random number of observed events within our $T_{100} \\pm 4\\sigma_{\\mathrm{t}}$ search time window about the gamma-ray emission from a Poisson distribution with expectation determined by the background data rate and time window.  If the number of events is 0, then $T$ receives no contribution from the search window about that GRB.  If the number of events is greater than 0, then we construct each event using the following steps: (1) choose a random time PDF value; (2) choose a random azimuth within 0 to $2\\pi$; (3) choose a reconstructed energy by sampling from the background distribution; (4) choose a reconstructed zenith by sampling from the background distribution of events with similar energy; (5) choose an estimated error in reconstructed direction by sampling from the background distribution of events with similar energy and zenith.  Finally, with the signal and background PDF values for every event, we calculate the test statistic for each trial.  We obtain a distribution like that shown in Figure \\ref{tsd} for each possible selection on BDT score.\n\nWe choose our optimal final selection on BDT score by injecting simulated neutrino signal along with background data and performing $10^4$ pseudo-search trials for a range of BDT score $> s$ cuts.  The background events are selected for each GRB the same as above for the background-only trials.  The simulated signal events within an $11^{\\circ}$ circle about each GRB contribute to the likelihood with a probability proportional to their simulated weight.  Signal is increasingly weighted until a defined discovery or limit-setting threshold is reached.  These discovery and limit-setting potentials per cut on BDT score are shown in Figure~\\ref{llhoptimization} for a general $E^{-2}$ spectrum and the Figure~\\ref{grbspectra} benchmark internal shock fireball spectrum.  The final selection, BDT score $> 0.525$, was optimized to set the best possible upper limit while suffering little loss in discovery potential.  This optimization was performed for each search year's event selection.\n\n\\begin{figure}[tbp]\n \\plotone{fig11.pdf}\n \\caption{Test statistic distribution for $10^8$ randomized background-only pseudo-searches at final analysis level.  The vertical lines represent test statistic values for a $3\\sigma$, $4\\sigma$, and $5\\sigma$ discovery.\n \\label{tsd}}\n\\end{figure}\n\n\\begin{figure}[tbp]\n  \\plottwo{fig12a.pdf}{fig12b.pdf}\n \\caption{Limit setting and discovery potentials per cut on BDT score for a single year's search.  Horizontal axis corresponds to a BDT score $> s$ cut.  The final event selection was optimized for limit setting while suffering little loss in discovery potential.  The vertical dashed line represents our final event selection of BDT score $> 0.525$.  Left: The vertical axis corresponds to the $E^{-2}$ spectrum signal weight needed in order to reach the given threshold.  Right: Vertical axis corresponds to the multiplying factor $\\mu$ on the benchmark internal shock fireball model neutrino flux shown in Figure \\ref{grbspectra} in order to reach the given threshold.\n \\label{llhoptimization}}\n\\end{figure}\n\n\n\\section{Results}\n\\label{sec:results}\n\n\\begin{table*}\n\\begin{center}\n\t\\begin{tabular}{ccccc} \\toprule\n\t   & Time & Angular Uncertainty & Angular Separation & Fluence/Energy \\\\ \\midrule\n\t GRB101213A & $T_{100} = 202$ s & $0.0005^{\\circ}$ & & $7.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 1 & $T_1 + 109$ s & $32.0^{\\circ}$ & $23^{\\circ}$ & 11 TeV \\\\ \\midrule\n\t GRB110101B & $T_{100} = 235$ s & $16.5^{\\circ}$ & & $6.6 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 2 & $T_1 + 141$ s & $118^{\\circ}$ & $112^{\\circ}$ & 34 TeV \\\\ \\midrule\n\t GRB110521B & $T_{100} = 6.14$ s & $1.31^{\\circ}$ & & $3.6 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 3 & $T_1 + 0.26$ s & $16.5^{\\circ}$ & $34.6^{\\circ}$ & 3.4 TeV \\\\ \\midrule\n\t GRB111212A & $T_{100} = 68.5$ s & $0.0004^{\\circ}$ & & $1.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 4 & $T_1 + 11.7$ s & $44.8^{\\circ}$ & $120.2^{\\circ}$ & 30.6 TeV \\\\ \\midrule\n\t GRB120114A & $T_{100} = 43.3$ s & $0.04^{\\circ}$ & & $2.4 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t Event 5 & $T_1 + 57.2$ s & $7.9^{\\circ}$ & $17.7^{\\circ}$ & 3.8 TeV \\\\ \\midrule\n\t GRB100718A$^a$ & $T_{100} = 39$ s & $10.2^{\\circ}$ & & $2.5 \\times 10^{-6}$ erg cm$^{-2}$ \\\\\n\t $\\nu_{\\mu}$ Track Event$^a$ & $T_1 + 15$ s & $16^{\\circ}$ & $1.3^{\\circ}$ & $\\gtrsim$ 10 TeV \\\\\n\t \\bottomrule\n\t\\end{tabular}\n     \\caption{GRB and event properties for the three-year cascade and four-year track search coincidences.\\newline$^a$ Corresponds to the $\\nu_{\\mu}$ track search coincidence discussed in \\cite{grb4year}.\n     \\label{tab:results}}\n\\end{center}\n\\end{table*}\n\nIn three years of data, five cascade neutrino candidate events are correlated with five GRBs.  These coincidences yield a combined P-value of 0.32, derived from the total test statistic value with respect to the background-only distribution.  The Northern Hemisphere track searches in four years of data resulted in a single neutrino candidate event correlated with prompt GRB emission and a combined P-value of 0.46 \\citep{grb4year}.  Considering the atmospheric neutrino purity of each search, discussed in section \\ref{sec:eventselect}, the track event is almost certainly a $\\nu_{\\mu}$ while the cascade events could be high energy atmospheric muons.\n\nTable \\ref{tab:results} shows the time, space, and energy data for these events and GRBs.  Events 1, 2, and 4 occurred on the edge or corner of the detector.  Events 3 and 5 occurred within the instrumented volume.  The large directional uncertainties of the second and fourth events are due to the location of their interactions at the corner and edge of the instrumented volume, with relatively few DOMs able to record the Cherenkov light.  The reconstructed energy of the muon neutrino track coincidence discussed in \\cite{grb4year} is an approximate lower bound on the neutrino energy because the interaction could have taken place well outside of IceCube and consequently, the muon could have lost significant energy before reaching the detector.\n\nThe benchmark internal shock, photospheric, and ICMART fireball model spectra plotted in Figure \\ref{grbspectra} yield expectations of 1.5, 2.5, and 0.07 neutrinos, respectively, for this three-year all-flavor cascade analysis.  As discussed at the end of Section 5, this search achieves nearly the same sensitivity as the Northern Hemisphere track search.  Thus, the combined four years of track searches and three years of shower searches yield total benchmark model expectations of 3.3, 5.4, and 0.1 neutrinos.  The all-flavor shower search has an average $\\langle n_{\\mathrm{b}} \\rangle$ of 11 events per year.  This expectation is concentrated at lower energies than the expected signal and is weighted by the time, space, and energy PDFs accordingly in our unbinned likelihood.  The expected background during just the $T_{100}$ of each GRB is 3.5 events per year.  An observation of three 1 PeV neutrinos correlated with three GRBs, with the same temporal and spatial properties as our observed Event 1 and its respective GRB in Table \\ref{tab:results}, would yield a $T$ value over 12 and a $5\\sigma$ discovery based on the background-only distribution in Figure \\ref{tsd}.\n\nConsidering the low significance of the events correlated with GRBs, we set 90\\% CL Neyman upper limits \\citep{neyman1937} on models normalized to the observed flux of UHECRs as well as models normalized to the observed gamma-ray fluence of each GRB.  We calculate these limits by combining the three-year cascade search results and four-year Northern Hemisphere track search results using the multiple configuration and channel test statistic given in Equation \\ref{teststatcomb}.  Simulated neutrinos are weighted to a certain spectrum and normalization and injected over background in the pseudo-searches.  The exclusion confidence level (CL) is the fraction of pseudo-search trials that yield $T \\geq T_{\\mathrm{observed}}$.\n\nFigure \\ref{topdownlimits} shows exclusion contours for double broken power law spectra of the form\n\n\n", "index": 21, "text": "\\begin{equation}\n\\begin{aligned}\n\\Phi_{\\nu}(E) = \\phi_0 \\times \\left\\{\n\t\\begin{array}{ll}\n\tE^{-1} \\epsilon_b^{-1}, & E < \\epsilon_b \\\\\n\tE^{-2}, & \\epsilon_b \\leq E < 10\\epsilon_b \\\\\n\tE^{-4} (10\\epsilon_b)^2, & 10\\epsilon_b \\leq E\n\t\\end{array}\n\\right.\n\\end{aligned}\n\\label{doublebrokenplaw}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9X.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\Phi_{\\nu}(E)=\\phi_{0}\\times\\left\\{\\begin{array}[]{ll}E^{-1}%&#10;\\epsilon_{b}^{-1},&amp;E&lt;\\epsilon_{b}\\\\&#10;E^{-2},&amp;\\epsilon_{b}\\leq E&lt;10\\epsilon_{b}\\\\&#10;E^{-4}(10\\epsilon_{b})^{2},&amp;10\\epsilon_{b}\\leq E\\end{array}\\right.\" display=\"inline\"><mrow><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>ϕ</mi><mn>0</mn></msub><mo>×</mo><mrow><mo>{</mo><mtable columnspacing=\"5pt\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"left\"><mrow><mrow><msup><mi>E</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msubsup><mi>ϵ</mi><mi>b</mi><mrow><mo>-</mo><mn>1</mn></mrow></msubsup></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mi>E</mi><mo>&lt;</mo><msub><mi>ϵ</mi><mi>b</mi></msub></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><msup><mi>E</mi><mrow><mo>-</mo><mn>2</mn></mrow></msup><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><msub><mi>ϵ</mi><mi>b</mi></msub><mo>≤</mo><mi>E</mi><mo>&lt;</mo><mrow><mn>10</mn><mo>⁢</mo><msub><mi>ϵ</mi><mi>b</mi></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"left\"><mrow><mrow><msup><mi>E</mi><mrow><mo>-</mo><mn>4</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>10</mn><mo>⁢</mo><msub><mi>ϵ</mi><mi>b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo>,</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><mrow><mn>10</mn><mo>⁢</mo><msub><mi>ϵ</mi><mi>b</mi></msub></mrow><mo>≤</mo><mi>E</mi></mrow></mtd></mtr></mtable><mi/></mrow></mrow></mrow></math>", "type": "latex"}]