[{"file": "1601.01631.tex", "nexttext": "\nWe start from the full set of {788677}\\ galaxy spectra from SDSS-DR7 having\nredshift smaller than 0.25 \\citep{2010ApJ...714..487S}. The classification\nrenders 17 types or classes. The two of them showing the largest [OIII]$\\lambda$4363, \nwhich include  24200 objects, are re-classified to obtain 12 subclasses. \nSome of these subclasses collect noisy spectrum, and those are discarded \nso that k-means acts as a noise filter. Four of the subclasses show particularly intense  \n[OIII]$\\lambda$4363, as depicted in Fig.~\\ref{classes}. (Note that, even in these cases, \nthe flux of  [OIII]$\\lambda$4363 is much smaller than the fluxes of  [OIII]$\\lambda$4959,  \n[OIII]$\\lambda$5007\n-- \nthe spectra in  Fig.~\\ref{classes} have [OIII]$\\lambda$5007 some fifty times \nlarger than [OIII]$\\lambda$4363.)  \nClasses \\#8 and \\#11 in Fig.~\\ref{classes} are discarded because \nthe mean spectrum of the class appears in the region of \nActive Galactic Nuclei (AGNs)  of the BPT diagram \n\\citep{1981PASP...93....5B,2012ApJ...756..163S}.  Therefore,  their high excitation is \nproduced by hard AGN radiation, rather than by lack of efficient coolants  \nin a stellar-radiation excited HII region. \nThe AGN nature of the discarded classes is corroborated by the large\nwidth of their emission lines (cf. AGN classes, \\#8 and \\#11, with \nstar-forming classes  \\#4 and \\#6), a property also \ncharacteristic of AGNs. After the classification and trimming, we are\nleft with {1281}\\ \nbursting XMP candidates.  \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{template.eps}\n\\caption{Template of four spectral classes where the emission line \n[OIII]$\\lambda$4363 (marked with arrows)  is particularly intense compared to   \n[OIII]$\\lambda$4959 and  [OIII]$\\lambda$5007. They were found by applying \ntwo nested k-means classifications to \nthe {788677}\\ galaxies with spectra in SDSS-DR7 having redshift $< 0.25$.\nTwo of the classes ( \\#8 and \\#11) are AGNs, as proven by their position \non the BTP diagram and the fact that the emission lines are particularly\nbroad.\n\nThe spectra, with the continua removed, have been \nnormalized to the peak intensity of  [OIII]$\\lambda$4363. \nWavelengths are given in \\AA . The \nlabel on top of each panel represent the class number and \nthe number of galaxies in the class.\n}\n\\label{classes}\n\\end{figure}\n\n\n\nWe have compared these {1281}\\ candidates with the 32~XMPs\nselected in {Paper~I}\\ after classifying the spectral region around\nH$\\alpha$. Most of them, 29  out of the 32, are included in our list of candidates. \nConsidering that the two procedures are completely independent,\nand the randomness inherent to the k-means procedure, \nthe agreement is very reasonable. Recall that k-means is a powerful tool able to classify\nvery large data sets in high-dimensional spaces. However,  among\nits drawbacks, k-means does not provide a single classification for\na single database. Each particular run depends on a random \ninitialization, thus, the classification is not unique \n\\citep[e.g.,][Sect.~2]{2010ApJ...714..487S}.\n\nNothing ensures that the {1281}\\ candidates are true XMPs. \nThey have been picked up as objects where  [OIII]$\\lambda$4363 is \nparticularly intense, using as reference the rest of galaxies in the \nspectroscopic database of SDSS-DR7.\n\n\nIn order to show whether or not they are XMPs, we have \ncomputed the metallicity for every one of them \nto mark as XMP only those objects of truly low metallicity.\n(The details are  given in the next Sect.~\\ref{confirmation}.)\nOne may think of this second step as a way to clean \nfrom pollutants the systematic but otherwise rough XMP selection carried out by \nk-means on the SDSS-DR7 database. \n\n\n\n\n\\section{Metallicities of the XMP candidates}\\label{confirmation}\n\n\\subsection{Determination of emission line fluxes}\\label{fluxes}\n\nWe use the SDSS-DR7 spectra \nof the {1281}\\ candidates to \ndetermine their metallicities. As usual, the procedure requires correcting the emission \nline fluxes for reddening, which is determined from the relative fluxes of the observed Balmer lines\n\\citep[e.g.,][]{2008MNRAS.383..209H,2012EAS....54....3S}. However,\n\nBalmer emission is usually depressed due to the presence of absorption lines of stellar origin. \nTherefore, prior to the measurement of the emission lines, we perform a stellar fitting to the \ncontinuum of the spectra. We use {\\sc starlight} \\citep{2005MNRAS.358..363C}\nto model the spectral energy distribution (SED) of the underlying stellar population.\n{\\sc Starlight} fits the observed continuum as a linear combination of single stellar \npopulation  (SSP)\nspectra of various ages and metallicities.  We chose the SSP spectra \nfrom \\citet{2003MNRAS.344.1000B}, including four metallicities \n$Z = 0.0001, 0.0004, 0.004,$ and 0.008\n\\citep[1\\%, 3\\%, 30\\% and 60\\% $Z_\\odot$, respectively;][]{2009ARA&A..47..481A}.\nReddening of the stellar SED was included assuming the extinction to follow  \n\\citet{1989ApJ...345..245C} with $R_{V}$ = 3.1.\nThe stellar continuum thus obtained is subtracted out of the observed \nspectrum to produce a pure emission line spectrum. The latter is employed to determine\nline fluxes.\n\nWe used the package\n{\\sc shifu}\\footnote{SHerpa IFU line fitting package, \\citet{garciabenito+15}.} \nto obtain the flux of the emission \nlines. The package contains a suite of routines to easily analyze emission or absorption lines \nin IFU data (both in cube and RSS format). Individual spectra, such as those \nemployed in our particular case, can be provided \nas a list of files (RSS). The core of the code uses CIAO's Sherpa package \n\\citep{2001SPIE.4477...76F,2007ASPC..376..543D}. Several custom algorithms are implemented in order\nto cope with general and ill-defined cases. A sigma-clipping is independently applied to the \nstellar continuum model, and then this is parsed to the composite line plus continuum model. \nAlthough the fitting is \nperformed in the residual spectra, we allow for the modeling of the continuum to take into account small \ndeviations in the stellar continnum residuals. A first order polynomial has been chosen for the continuum, \nwhile single gaussians have been selected for the lines. \nThe continuum is evaluated in the  original spectra when used\nto determine equivalent widths.\n\n\n\\subsection{Method to measure metal abundance}\\label{hcm}\n\nMetal abundances are computed with \nthe code HII-CHI-mistry\\footnote{{\\tt http://www.iaa.es/$\\sim$epm/HII-CHI-mistry.html}}\n  \\citep[hereafter HCM][]{2014MNRAS.441.2663P},\nwhich calculates the total oxygen abundance O/H, the nitrogen-to-oxygen ratio N/O,\nand the ionization parameter U. \nNormalized to H$\\beta$ and corrected for extinction, the  fluxes of the emission lines\n[OII]$\\lambda$3727, [OIII]$\\lambda\\lambda$4363,5007, [NII]$\\lambda$6584, and\n[SII]$\\lambda\\lambda$6716,6731 are compared with the predictions of a large grid of \n{\\sc cloudy} \\citep{2013RMxAA..49..137F} photoionization models.\nThe HCM assumes a spherically symmetric constant-density distribution \nof gas ionized by {\\sc popstar} \\citep{2009MNRAS.398..451M}\n1\\,Myr-old stellar clusters with the same metallicity of the gas, \nand covering a wide range of values in O/H, N/O, and log U.\nIn particular, the grid includes very low values of the gas metallicity,\ndown to 12+log(O/H)=6.9 equivalent to 1/60 of the oxygen \nabundance in the solar composition \\citep{2009ARA&A..47..481A}.   \nThe main advantage of this method is that it leads to a derivation\nof the chemical abundances consistent with the direct\nmethod even in the absence of one or more of the input emission lines\n\\citep{2014MNRAS.441.2663P}.\nSince the direct method does not depend on modeling \n\\citep[e.g.,][]{1974agn..book.....O,2012EAS....54....3S}, it means that the \nmetallicities provided by HCM are almost insensitive to the \nmodel assumptions.\n\nGiven a set of observed line ratios, HCM assigns a $\\chi^2$ to each \none of the models, computed as the sum of \nthe square differences between the observed and \nthe model line ratios.  The $1/\\chi^2$-weighted \naverage of the abundance in the models\nyields the chemical abundance tagged to  the observed line ratios.\nErrors are derived as the $1/\\chi^2$-weighted standard \ndeviation of the parameters in the models. When the \ntemperature-sensitive line [OIII]$\\lambda$4363 is available, \nHCM uses the whole grid of models to provide values of O/H and \nN/O  that are consistent with the direct method, even in the \nabsence of [OII]$\\lambda$3727. Thus the use of HCM results \nespecially appropriate to search for XMPs in SDSS since \n[OII]$\\lambda$3727 is sometimes outside the observed \nspectral region for nearby objects.  \n\nThe error bars estimated by HCM quantify the internal precision of the \nmethod, i.e., they give the range of models that is consistent with the \nobserved line fluxes. The observational errors enter into \nthe abundance error estimate indirectly, since the observed \nfluxes must have enough signal to be considered for analysis.\n\n\n\n\n\n\n\n\\subsection{List of XMPs}\\label{list_of_xmp}\n\nThe automated procedure described in Sect.~\\ref{fluxes} provides the fluxes used by \nHCM (Sect.~\\ref{hcm}) to infer the oxygen abundance of the {1281}\\ candidates\n (Sect.~\\ref{kmeanssearch}). \nWe consider only line fluxes with a signal-to-noise ratio larger than three,\nincluding the weak [OIII]$\\lambda$4363. The scatter plot 12+log(O/H) vs \nlog(N/O) for the full sample is shown in Fig.~\\ref{distribution}a. Assuming that the solar composition \ncorresponds to 12+log(O/H)$_\\odot\\simeq 8.69$~\\citep{2009ARA&A..47..481A}, \nXMPs are defined as those candidates having\\footnote{Different authors \nuse slightly different thresholds, e.g., \\citet{2000A&ARv..10....1K} and \n\\citet{2011ApJ...743...77M} use \n$12+\\log({\\rm O/H}) \\le\\ 7.65$, \\citet{2009A&A...505...63G} use\n$\\leq 7.60$,  while we use exactly one tenth of the solar metallicity quoted in the \nreview paper by \\citet{2009ARA&A..47..481A}.\\label{thresholds_note}}\n\n", "itemtype": "equation", "pos": 14935, "prevtext": "\n\n   \\title{\nSearch for Extremely Metal-poor Galaxies in the Sloan Digital Sky Survey (II): \\\\\nhigh electron temperature objects\n}\n\n   \\author{\n                J.~S\\'anchez~Almeida\\altaffilmark{1,2},\n                E. P\\'erez-Montero\\altaffilmark{3},\n                A. B. Morales-Luis\\altaffilmark{1,2},\n        \tC.~Mu\\~noz-Tu\\~n\\'on\\altaffilmark{1,2}, \n                R. Garc\\'\\i a-Benito\\altaffilmark{3},\n                                 \n                S. E. Nuza\\altaffilmark{4},\n                and\n                F.~S. Kitaura\\altaffilmark{4},\n                \n                \n          }\n\n\\altaffiltext{1}{Instituto de Astrof\\'\\i sica de Canarias, E-38205 La Laguna,\nTenerife, Spain}\n\\altaffiltext{2}{Departamento de Astrof\\'\\i sica, Universidad de La Laguna,\nTenerife, Spain}\n\\altaffiltext{3}{Instituto de Astrof\\'\\i sica de Andaluc\\'\\i a,  CSIC, PO box 3004, \nE-18080 Granada, Spain}\n\\altaffiltext{4}{Leibniz-Institut f\\\"ur Astrophysik Potsdam (AIP), An der Sternwarte 16, D-14482 Potsdam, Germany}\n\n\\email{jos@iac.es}\n\n\n\\begin{abstract}\nExtremely metal-poor (XMP) galaxies are defined to have gas-phase metallicity smaller \nthan a tenth of the solar value ($12+\\log[{\\rm O/H}] < 7.69$). \nThey are uncommon, chemically and possibly dynamically \nprimitive, with physical conditions characteristic of \nearlier phases of the  Universe. We search for new \nXMPs in the Sloan Digital Sky Survey (SDSS) in a work that complements Paper I. \nThis time high electron temperature objects are selected; \nsince metals are a main coolant of the gas, \nmetal-poor objects contain high-temperature gas. Using the algorithm \nk-means, we classify {788677}\\ spectra to select {1281}\\ galaxies \nhaving particularly intense [OIII]$\\lambda$4363\nwith respect to [OIII]$\\lambda$5007, which is a proxy for high \nelectron temperature.  The metallicity of these candidates was computed using a hybrid technique consistent\nwith the direct method, rendering {196}\\ XMPs.  \nA less restrictive noise constraint provides\n a larger set with {332}\\ candidates. Both lists are provided in electronic format.\nThe selected XMP sample have mean stellar mass around $10^8\\,{\\rm M}_\\odot$,\nwith dust-mass $\\sim 10^3{\\rm M}_\\odot$ for typical star-forming regions.\nIn agreement with previous findings, XMPs show a tendency to be\ntadpole-like or cometary. Their underlying stellar continuum corresponds to a \nfairly young stellar population ($< 1\\,{\\rm Gyr}$), although young and aged stellar \npopulations co-exists at the low-metallicity starbursts.\nAbout 10\\,\\%\\ of the XMPs shows large N/O. Based on their location in constrained \ncosmological numerical  simulations, XMPs have a strong tendency to appear in voids \nand to avoid galaxy clusters. The puzzling 2\\,\\%-solar low-metallicity \nthreshold exhibited  by XMPs remains.\n\n\\end{abstract}\n\n\n\n\n   \\keywords{\n     galaxies: abundances --\n     galaxies: dwarf --\n     galaxies: evolution --\n     galaxies: formation --\n     galaxies: peculiar\n               }\n\\slugcomment{2nd version submitted to ApJ}\n\n\\shorttitle{Extremely metal poor galaxies of high electron temperature}\n\n\n\n\n\n\n\n\n\\section{Introduction}\\label{introduction}\n\nExtremely metal-poor (XMP) galaxies are defined to have a gas-phase metallicity \nten times smaller than the sun \\citep[e.g.,][]{2000A&ARv..10....1K}. \nEven though the exact threshold is arbitrary,\nthis definition selects chemical unevolved galaxies thus providing a gateway to study \nphysical processes in conditions characteristic of the early \nUniverse, which are now unusual. XMPs have been used to determine\nthe primordial He abundance produced during  the \nbig bang \\citep{2010IAUS..268...91P,2010JCAP...04..029S},\nto study the star-formation in conditions of low metallicity \n\\citep{2014Natur.514..335S,Filho+15b}, \nto infer the formation of dust in the early Universe \\citep{2014Natur.505..186F}, \nto analyze properties of a primitive inter-stellar medium \\citep{2007ApJ...665.1115I}, \nor to constrain the properties of the first stars \\citep{2005ApJS..161..240T,2015ApJ...801L..28K}.\nXMP galaxies are not primeval, but galaxies with an\nunderlying evolved stellar population \n\\citep[e.g.,][]{2007ApJ...667L.151A,2008ApJ...675..194C,2010MNRAS.404.2037P,\n2013AJ....146..144A} that look young because they  \nmay have recently accreted metal-poor gas \n\\citep{2001A&A...374..800O,2010MNRAS.406.1238E,2013ApJ...767...74S,2014ApJ...783...45S,2015ApJ...810L..15S}, \nsimilar to the cold-flows predicted by the numerical simulations \nof galaxy formation \n\\citep{2009Natur.457..451D,2010MNRAS.402.1536S,2014A&ARv..22...71S,2014MNRAS.441.2593N}.\nThen the gas \nforming stars in XMPs would trace the cosmic web in their immediate \nsurrounding, providing a method to study and to characterize \nthis elusive component of the cosmic web. \n\n\n\n\n\n\n\n\nGiven the general interest and the potential of XMPs as astronomical \ntools, there have been many attempts to look for new candidates, i.e., to \nenlarge the list of XMPs, but also to find the least metallic object   in the local Universe. \nHowever, despite the unquestionable success in finding new objects, \nthe club of  XMPs is still quite exclusive. The review \npaper by \\citet{2000A&ARv..10....1K} contains only 31 targets,\n\\citet{2003ApJ...593L..73K} add 8 new targets from the early data \nrelease of SDSS, the search in SDSS-DR6 by\n\\citet{2009A&A...505...63G} yields 44, \nand the systematic \nbibliographic search for all XMPs in the literature carried out \nby\n\\citet[][hereinafter {Paper~I}]{paperi} \n\nrenders 140.\n({Paper~I}\\ includes targets found by\n\\citeauthor{2004ApJS..153..429K}~\\citeyear{2004ApJS..153..429K},\n\\citeauthor{2004A&A...415...87I}~\\citeyear{2004A&A...415...87I},\n\\citeauthor{2006A&A...448..955I}~\\citeyear{2006A&A...448..955I},\nand\n\\citeauthor{2007ApJ...665.1115I}~\\citeyear{2007ApJ...665.1115I}.)\n\nNew local metal-poor objects have been discovered since the \npublication of {Paper~I}\\\n\\citep[e.g.,][]{2012A&A...546A.122I,2013AJ....146....3S,2015MNRAS.448.2687J,2015A&A...579A..11G},\nbut the situation has not changed in essence. \nMoreover, even though the number of members of the \nclub has increased since the discovery \nof  IZw18 45 years ago \n\\citep{1970ApJ...162L.155S,1972ApJ...173...25S},\nits low metallicity has not been superseded; the present record-breaking object\nSBS 0335-052W \\citep{2009A&A...503...61I}\nhas a metallicity close to that of IZw18 and around 2\\,\\%\\ of the \nsolar value. The existence of such a lower limit for the metallicity of \nthe XMPs has challenged interpretation for decades\n\\citep[e.g.,][]{2011EAS....48...95K}.   \n\n \n\nThe low number of observed XMPs poses a problem since XMPs are\nexpected to be the most common galaxies in the local \nuniverse. Because of the luminosity-metallicity relationship \n\\citep[e.g.,][]{1989ApJ...347..875S,2006ApJ...647..970L},  all galaxies fainter \nthan absolute magnitude ${\\rm M}_B\\simeq -12.5$ are  expected to be XMPs\n\\citep[][]{2012ApJ...754...98B}. \nThe extrapolation of the observed galaxy luminosity function to the faint end \nimplies that these ultra-faint XMPs should be the most numerous galaxies in the \nlocal universe \\citep[e.g.,][]{2005ApJ...631..208B,2015MNRAS.451.1540L}.\nThe reason why these objects are not detected in large quantities\nseems to be an observational bias, associated with the fact that they \nare both faint and of low surface brightness. Only when they undergo  a \nstarburst phase, brightness and surface density increase to make them\ndetectable in typical magnitude-limited optical surveys \n\\citep[see][and references therein]{2013AJ....146....3S,2015MNRAS.448.2687J}.\n\nIn order to explain the supposed lack of XMPs, \\citet[][]{2013AJ....146....3S} proposed \nthe existence of two  classes of XMPs: \n(1)  the faint, low surface brightness, {\\em quiescent} XMPs, \nvery numerous but usually undetected,  \nand (2) the {\\em bursting} XMPs, going \nthrough a transit starburst  which allow them \nto appear in optical surveys like the Sloan Digital Sky Survey \nanalyzed here \\citep[][]{2002AJ....123..485S}. \nUnless otherwise explicitly stated, \nthis paper refers to the latter, even though we often call them XMPs for simplicity.\nWe will mention the class of quiescent XMPs in connection with the \nnumber density estimate in Sect.~\\ref{number_density}.\n\n\nWith a few exceptions, the observed\nXMPs are bursting XMPs, \nthat makes them blue and compact when the \nstar-forming region is large with respect to the size of the galaxy\n\\citep[][]{2000A&ARv..10....1K}.\nThus bursting XMPs tend to be blue compact dwarf (BCD) galaxies.\nTheir optical spectrum is characterized by intense emission lines \n\\citep[e.g.,][]{1991A&AS...91..285T}. Many of these XMPs\nhave cometary or tadpole morphology \n\\citep[][{Paper~I}]{2008A&A...491..113P}. \nXMP galaxies are gas rich, with\na typical gas-mass to stellar-mass ratio in excess of 10 \n\\citep{2013A&A...558A..18F}.\nThey tend to be in relative isolation, although some of them\nshow loose companions. They prefer \nlow density environments identified as voids and sheets \nin cosmological numerical simulations \\citep{2015ApJ...802...82F}.\n\n\n\nOne of the difficulties to enlarge the sample of XMPs is related to the determination\nof their chemical abundances, which critically depends on the available optical emission \nlines.  The most accurate method relies on measuring electron temperatures,\nand uses weak and near-UV emission lines often unavailable. \nIn addition, tailored data-mining techniques are required to identify them \nsince XMPs appear as rare objects in very large surveys.\nHere we report a new systematic search for XMP galaxies in the \nSloan Digital Sky Survey \\citep[SDSS-DR7;][]{2009ApJS..182..543A}\nthat overcomes the two aforementioned difficulties.\n\nThe philosophy remains very much like in {Paper~I} . We carry out an automated \nclassification of the SDSS spectra using k-means\n\\citep[e.g.,][]{2010ApJ...714..487S,2014A&A...565A..53O} \nin a range of wavelengths \nparticularly sensitive to metallicity. One or a few\nclasses have spectra characteristics of low-metallicity galaxies. \nThen we measure individually \nthe metallicity of the objects in these classes, so as to confirm\nor discard these XMP candidates  as true members of the XMP \nparty. \nThe difference between {Paper~I}~ and the present work is in the \nwavelength region chosen to classify the spectra. In {Paper~I}~ we used the region \naround H$\\alpha$, where the two [NII] lines tend to \ndisappear when the metallicity goes to zero\n\\citep[e.g.,][]{2004MNRAS.348L..59P,2012ApJ...756..163S}.\nHowever, even objects with significant [NII] can be\nXMP \\citep{2014ApJ...797...81M}, \nbecause depending on the evolutionary state and\nchemical history galaxies may have enhanced N/O, thus presenting \nlarge [NII] for a given O \\citep[e.g.,][]{2009MNRAS.398..949P}.\nHere we use the region between the lines [OIII]$\\lambda$4363 and\n[OIII]$\\lambda$5007\nwhich is known to depend  on the temperature of the \nHII region producing the emission-line spectrum. Since \nmetals are a main coolant agent of the gas \n\\citep[e.g.,][]{1979MNRAS.189...95P}, metal-poor objects \nare also high-temperature objects, yielding a relationship between \nelectron temperature and metallicity.\nThis approach is similar to the one already used by\n\\citet{2015ApJ...805...45L}, except that they employ it to \nsearch for galaxies at a redshift around  0.8, so that the \nwavelength region \nof [OIII] is observed in the near IR.\n\n\nThe paper is organized as follows. First, we describe the\nautomated search for XMP candidates using k-means (Sect.~\\ref{kmeanssearch}).\nIt leads to {1281}\\ candidates. Then,  we use the SDSS spectra of the candidates \nto measure their integrated  metallicity, which narrows down the list  to {196}\\ XMPs \n(Sect.~\\ref{confirmation}). Emission line fluxes and abundances\nare calculated in Sects.~\\ref{fluxes} and \\ref{hcm}, respectively. \n\nThe final  list  with {196}\\ XMPs is worked out in Sect.~\\ref{list_of_xmp}\n (Table~\\ref{main_list}),  where we also include a second list (Table~\\ref{candidates}) \nwith {332}\\ potential XMPs selected under less restrictive noise constraints. \nThe global properties of the XMPs are analyzed in Sect.~\\ref{properties},\nexplicitly,  stellar mass (Sect.~\\ref{masses}),\nreddening and  dust mass (Sect.~\\ref{reddening}),  \nabsolute magnitude and color (Sect.~\\ref{cmd}),\nnumber density  (Sect.~\\ref{number_density}),\nmetallicity threshold (Sect.~\\ref{threshold}),\nmorphology (Sect.~\\ref{morphology}),\nunderlying stellar population  (Sect.~\\ref{agess}),\nand large scale environment (Sect.~\\ref{environment}).\n\nThe results are summarized and discussed in Sect.~\\ref{discussion}.  \nThe number of false positives and false negatives in Table~\\ref{main_list}\nis estimated  in Appendix~\\ref{appendix}.   \n\n\n\n\n\n\\section{Search for XMP candidates classifying the spectrum around\n[OIII]$\\lambda$4363}\\label{kmeanssearch}\n\n\nThe ratio between the emission of [OIII]$\\lambda$4363 and the pair \n[OIII]$\\lambda\\lambda$4959,5007 strongly depends on the metallicity of the \nemitting gas. The reason is well known and rather straight-forward.  \nSince metals are a main coolant of the gas \\citep[e.g.,][]{1979MNRAS.189...95P}, \nmetal-poor gas is also high-temperature gas. The ratio  [OIII]$\\lambda$4363 to \n[OIII]$\\lambda\\lambda$4959,5007 is used to measure  [OIII] electron temperature in \nHII regions \\citep[e.g.,][]{2008MNRAS.383..209H}, therefore it is also a good proxy \nfor metallicity. The three [OIII] lines are excited by collisions with free electrons, \nand their decay through photon emission renders the observed lines. \nThe excitation potential of the upper level of  [OIII]$\\lambda$4363 ($^1{\\rm S}_0$; $5.35$\\,eV) \nis significantly higher than the upper level shared by [OIII]$\\lambda$4959 \nand [OIII]$\\lambda$5007 ($^1{\\rm D}_2$; $2.51$\\,eV), so that [OIII]$\\lambda$4363 increases \nrelative to the other two lines as the temperature increases, that is to say, as the \nmetallicity of the gas decreases. The relative fluxes change by more than\none order of magnitude when the electron temperature changes in the range \nof the typical temperatures in HII regions, say, \nbetween 5 and 25 kK \\citep[e.g.,][]{1974agn..book.....O}. \n\n\n\nWe take advantage of this sensitivity of the spectrum on metallicity \nto search for XMP candidates. \nUsing the automatic classification algorithm k-means\n\\citep[][]{2010ApJ...714..487S,2014A&A...565A..53O},\nwe classify the full SDSS-DR7 spectral database according to the\nshape of the spectrum of the galaxies in the spectral region of\ninterest, from 4200 to 5200\\,\\AA , which contains \n[OIII]$\\lambda$4363, [OIII]$\\lambda$4959,  and [OIII]$\\lambda$5007.\nAs in {Paper~I} , the signal to be classified, $S(\\lambda)$, is the observed spectrum \nin rest-frame wavelength, $I(\\lambda)$, after removing the continuum intensity, \n$I_c(\\lambda)$, and after the subsequent  normalization to the emission at the reference  \nwavelength  (4363\\,\\AA\\ in this case), explicitly,\n\n", "index": 1, "text": "\\begin{equation}\nS(\\lambda)={{I(\\lambda)-I_c(\\lambda)}\\over{I(4363\\,{\\rm \\AA})-I_c(4363\\,{\\rm \\AA})}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S(\\lambda)={{I(\\lambda)-I_{c}(\\lambda)}\\over{I(4363\\,{\\rm\\AA})-I_{c}(4363\\,{%&#10;\\rm\\AA})}}.\" display=\"block\"><mrow><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>I</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mrow><mrow><mi>I</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mpadded width=\"+1.7pt\"><mn>4363</mn></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Å</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>I</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mpadded width=\"+1.7pt\"><mn>4363</mn></mpadded><mo>⁢</mo><mi mathvariant=\"normal\">Å</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\n\n\nThere are {196}\\ galaxies fulfilling this requirement, \nwhich are the\nbursting XMP galaxies \npresented in this work. \n{11}\\ of them have duplicated spectra in SDSS-DR7. \nWe have chosen for analysis the spectrum yielding the smallest error in  \nmetallicity. The XMP galaxies\n\nare represented as red squares with \nerror bars in Fig.~\\ref{distribution}a. The distribution of metallicities of the candidates is\ngiven in Fig.~\\ref{distribution}b. The histogram is fairly continuous at the border between \nXMPs and the rest, which proves the 1/10 solar metallicity threshold to be rather arbitrary.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{distribution2.eps}\n\\caption{\n(a) Scatter plot N/O vs O/H  for the XMPs found in our search \n(red squares with error bars), and for the candidates that turned out not to be XMPs \n(blue symbols with error bars).\n(b) Distribution of the O abundance for the XMPs (thick red line) and\nthe failed candidates (thin blue line). It is rather smooth at the transition\nabundance (7.69, equivalent to a tenth of the solar value). \n(c) Distribution of N/O for the XMPs (thick red line) and the rest (thin blue line).\n}\n\\label{distribution}\n\\end{figure*}  \n\nThe list of XMPs is given in Table~\\ref{main_list}, which includes coordinates \nas well as the main physical properties provided by HCM. \nWhen [NII]$\\lambda$6584 is too weak for the noise level, \nN/O cannot be derived,  and it appears as -9.99 in the Table. \nThe distributions of N/O for the XMPs and the rest of the sample \nare given in Fig.~\\ref{distribution}c. They look qualitatively similar. \n\n\nWe carried out several sanity checks. First, we estimated the number of false positives \nand false negatives due to observational errors. False positives are galaxies in the \nXMP list which have true oxygen abundance above the threshold. False negatives are\ntrue XMP galaxies that have been discarded from the selection. Using a Bayesian approach, \nwe work out in Appendix~\\ref{appendix} the expected number of false positives and \nfalse negatives. Even though the typical error of the individual abundance estimates \nis rather small ($\\simeq 0.17$\\,dex for the galaxies in Table~\\ref{main_list}), \nwe expect a significant number of false positives and false negatives. Assuming the\ntrue distribution of metallicities to be given by the histogram in \nFig.~\\ref{distribution}b, we expect 82 false positives and 46 false negatives\n(Eq.~[\\ref{false3}]). If the true distribution is uniform, then \nthe number of both false positives and false negatives is around 55 \n(Eq.~[\\ref{false4}]).  \n\nPartly to offer the possibility of recovering false negatives in the future, \nwe include a 2nd list with {\\em candidate} XMPs  in Table~\\ref{candidates}.\nTable~\\ref{main_list} is based on lines with measured fluxes exceeding \nthree times the noise. If this threshold is lowered, and lines with \nfluxes at two-sigma are also considered, then the number of galaxies \nfulfilling the condition in Eq.~(\\ref{solar_metal})\nincreases to  {332} , and those are the objects included in \nTable~\\ref{candidates}. The reason why the number increases when lowering \nnoise limit can be pinned down to the weakness of [OIII]$\\lambda$4363,\nwhich tends to be excluded from the metallicity estimate when\nthe noise limit is too restrictive. When it is considered in the metallicity \nestimate,  HCM tends to lower the oxygen abundance estimate due to \narguments given in  Sect.~\\ref{kmeanssearch}\n\n\nAs a second test, we compared the metallicity provided by HCM \nwith the metallicity obtained with the direct method \\citep[e.g.,][]{2008MNRAS.383..209H} \nwhen [OII]$\\lambda$3727 was available\n\\footnote{The wavelength 3727\\,\\AA\\ is out of the range \nof the original SDSS spectrograph, so that a minimum redshift\naround 0.03 is needed for line to appear in a SDSS spectrum.\n}. \nThese abundances, based on the direct method, are also included in Table~\\ref{main_list}. \nThe scatter plot direct-method metallicity vs HCM metallicity is shown in \nFig.~\\ref{metal_vs_metal}. As expected, the two techniques agree quite well\nwith a dispersion of only 0.04\\,dex, which is smaller than the intrinsic\nerror of both methods. On top of this agreement, there is a tendency for  \nHCM to overestimate the direct-method metallicity at low metallicities. \nSince this bias occurs below the threshold metallicity to  \nbe XMP (Eq.~[\\ref{solar_metal}]), \nboth  methods would yield the same list of XMPs if we had access to \n[OII]$\\lambda$3727.  \nMoreover, the systematic differences between the abundances\nobtained from HCM and the direct method are small compared\nwith their error bars,  so that such differences barely \naffect other results and conclusions of the paper.\nFor example, adding an extra 0.06~dex error to the \ntypical $\\sim 0.17~$dex error bar increases the\nnumber of false positives worked out in Appendix~\\ref{appendix}, but\nonly from 82 to 86. \n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{comp_oh_hcm-dm_sn3.eps}\n\\caption{Scatter plot direct-method metallicity vs HCM metallicity for \nthe galaxies having [OII]$\\lambda$3727 within the observed spectral \nrange. Both measurements agree quite well, with a small difference at \nmetallicities below the XMP threshold which consequently \ndoes not affect  the selection of XMPs.\nThe solid line  corresponds to the  one-to-one relationship.\n}\n\\label{metal_vs_metal}\n\\end{figure}\n\n\n\nAs a final test, we represented our targets in the [OIII]$\\lambda$5007/H$\\beta$ vs \n[NII]$\\lambda$6583/H$\\alpha$ plane commonly used to separate starbursts from AGNs \n\\citep[the so-called BPT diagram, after][]{1981PASP...93....5B}; see Fig.~\\ref{bpt_diagram}. \nNone of them are AGNs, and only two  reside in the composite-spectrum region \nnext to the divide worked out by\n\n\\citet{2003MNRAS.346.1055K}.\nThey may be starbursts of high N/O \\citep{2009MNRAS.398..949P}, or HII regions\nwhere the excitation may have contribution from shocks, evolved stars,  \nor even AGNs. The two objects with composite-spectrum \nare number 51 and number 151 in Table~\\ref{main_list}, and their\nidentification as XMP galaxies must be taken with caution. \n\\begin{figure}\n\n\\includegraphics[width=0.45\\textwidth]{create_bpt.eps}\n\\caption{\nScatter plot [OIII]$\\lambda$5007/H$\\beta$ vs \n[NII]$\\lambda$6583/H$\\alpha$ for the galaxies in Table~\\ref{main_list}.\nThis plane is commonly used to separate starbursts from \nAGNs  \\citep[the so-called BPT diagram, after][]{1981PASP...93....5B}. Most\nobjects  reside below the solid line by \\citet{2003MNRAS.346.1055K}, \ncorresponding to excitation  by stars.\nOnly two objects are close to this border and they may have composite spectra.\nThe shaded region shows the area used by \\citet{2012A&A...546A.122I} \nto search for XMPs in SDSS-DR7. The colored points correspond to  \nobjects also found in {Paper~I}\\ (red) and in \\citet[][blue]{2012A&A...546A.122I}.\nContrarily to our targets, these previous searches pick up emitters \nconcentrated on the  leftmost region of the BPT diagram, \ncorresponding to [NII]$\\lambda$6583$\\ll $H$\\alpha$.\n\n\n\n\n\n}\n\\label{bpt_diagram}\n\\end{figure}\n\n\n\nMost of the {196}\\ galaxies in Table~\\ref{main_list} seem to be new \nmembers of the XMP class. Table~2 of {Paper~I}\\ compiles\nall XMPs in the literature up to the date of publication in mid 2011. \nIt contains 129 objects, 21 of which coincide with objects in Table~\\ref{main_list}. \n{Paper~I}\\ also carries out a systematic search for XMPs in SDSS-DR7, \nfinding 32 such objects. 17 of these 32 targets coincide with targets \nselected in our study, and so are included in Table~\\ref{main_list}.  In addition,\nthere is a  recent major search for XMPs by \\citet{2012A&A...546A.122I}, \nwhich contains 41 targets.  Among them, 7 are in Table~\\ref{main_list}. \nConsidering all the objects in these three lists, and discarding coincidences,  \nonly 31 among the {196}\\ galaxies in Table~\\ref{main_list} seem to be \nknown.  Known and unknown targets are pointed out in one of the columns of\nTable~\\ref{main_list}, which used the following code to indicate matches:  \n(1) Table~1 in {Paper~I} , (2) Table 2 in {Paper~I} , (3) Tables 1 \\&\\ 2 in {Paper~I} , \n(4) \\citet{2012A&A...546A.122I}, (5) Table 1  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I},\n(6) Table 2  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I},\n(7) Table 1 \\&\\ 2 in {Paper~I} , \\&\\ \\citet{2012A&A...546A.122I}, and finally,  \n(0) no match.\n\nPart of the difference with previous searches is related to the abundance \nthreshold (Eq.~[\\ref{solar_metal}]). Our criterion is slightly \nless restrictive than others (see footnote number~\\ref{thresholds_note}) therefore,\nby construction, the highest metallicity targets in Table~\\ref{main_list}  are\ndiscarded in other compilations. For example, \n43 and 88 objects have $12+\\log({\\rm O/H}) > 7.65$ and $> 7.60$, respectively. \nIn addition to this fact, however, we employ a novel selection procedure \nwhich influences the results.    \nFigure~\\ref{bpt_diagram}  provides the clue for understanding the main \ndifference between our search and previous ones. \nPrevious searches are focused on objects having small \n[NII]$\\lambda$6583 compared with H$\\alpha$ ({Paper~I} ) \nor with H$\\beta$ \\citep[e.g.,][]{2007ApJ...665.1115I,2012A&A...546A.122I},\nwhereas our technique selects objects that cover a significant part\nof the BPT plane. XMP galaxies of relatively large [NII]$\\lambda$6583/H$\\alpha$\nare know to exist due to, e.g., having particularly large N/O or displaying\nparticularly low ionization  \\citep[e.g.,][]{2014ApJ...797...81M}. \nOur approach is sensitive to those XMPs, as it is  evidenced in Fig.~\\ref{bpt_diagram}, \nwhich shows with colored symbols the objects in common with the searches in {Paper~I}\\ and \n\\citet{2012A&A...546A.122I}.\nThe region explored by \\citep{2012A&A...546A.122I} is also indicated in the \nfigure.\\footnote{The constraints in \\citet{2012A&A...546A.122I} are  \n[OIII]$\\lambda$4959/H$\\beta\\lesssim 1$ and \n[NII]$\\lambda$6583/H$\\beta\\lesssim 0.1$. \nHowever, atomic properties set  [OIII]$\\lambda$5007/[OIII]$\\lambda$4959$\\simeq 2.98$ \n\\citep[e.g.,][]{2000MNRAS.312..813S} and H$\\alpha$/H$\\beta\\simeq 2.86$ \n\\citep[e.g.,][case B recombination]{1989agna.book.....O}, \nwhich brings the constraints in the line ratios used for our BPT diagram to \n[OIII]$\\lambda$5007/H$\\beta\\lesssim 2.98$ and \n[NII]$\\lambda$6583/H$\\alpha\\lesssim 0.035$. This is the region highlighted in Fig.~\\ref{bpt_diagram}.\n}\n\n\nThe histogram of metallicities in Fig.~\\ref{distribution}a drops at  \n$12+\\log({\\rm O/H}) \\le 7.50$, so that only 28 of the \nXMPs in Table~\\ref{main_list} have oxygen abundance smaller than this \nthreshold. (The lowest metallicity limit is discussed in Sect.~\\ref{threshold}.)\nThose objects  are particularly rare, here and in previous works \n\\citep[e.g., {Paper~I} ;][]{2012A&A...546A.122I,2015A&A...579A..11G},\nhowever, this part of Table~\\ref{main_list}\nis the one that contains more targets in common with previous \nsearches. Actually, 36\\,\\%\\ of our XMPs with $12+\\log({\\rm O/H}) \\le 7.50$ \nare already known, whereas the 31 known objects in \nTable~\\ref{main_list} represent only 16\\% of the full list of \n{196}\\ targets.\n\n\n\n\n\n\\begin{deluxetable*}{cccccccc}\n\\tabletypesize{\\scriptsize}\n\n\\tablewidth{0pt}\n\\tablecaption{Extremely metal poor galaxies selected in this study\\tablenotemark{a}}\n\\tablehead{\n\\colhead{Index\\tablenotemark{b}}&\n\\colhead{Name\\tablenotemark{c}}&\n\\colhead{12+log(O/H)\\tablenotemark{d}}&\n\\colhead{log(N/O)\\tablenotemark{d}}&\n\\colhead{logU\\tablenotemark{e}}&\n\\colhead{CH$\\beta$\\tablenotemark{f}}&\n\\colhead{Match\\tablenotemark{g}}&\n\\colhead{12+log(O/H)$_{\\rm DM}$\\tablenotemark{h}}\n}\n\\startdata\n\n  1&J$001637.4+003828.8$&7.66$\\pm$0.18&-1.60$\\pm$0.14&-2.65$\\pm$0.12&0.00$\\pm$0.04&0&7.59$\\pm$0.19\\\\\n  2&J$001922.9-002450.5$&7.57$\\pm$0.19&-1.11$\\pm$0.23&-2.54$\\pm$0.16&0.27$\\pm$0.03&0&7.47$\\pm$0.18\\\\\n  3&J$002114.8-085809.5$&7.56$\\pm$0.23&-1.14$\\pm$0.28&-2.65$\\pm$0.19&0.62$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n  4&J$002916.8-010021.2$&7.61$\\pm$0.16&-1.35$\\pm$0.15&-2.04$\\pm$0.33&0.17$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n  5&J$003630.4+005234.7$&7.58$\\pm$0.12&-9.99$\\pm$0.00&-1.88$\\pm$0.25&0.01$\\pm$0.03&1&7.39$\\pm$0.08\\\\\n  6&J$003741.1+003320.1$&7.68$\\pm$0.12&-1.52$\\pm$0.13&-1.89$\\pm$0.27&0.00$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  7&J$004224.8+003315.7$&7.63$\\pm$0.16&-1.51$\\pm$0.14&-2.55$\\pm$0.18&0.07$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  8&J$005249.8-084133.9$&7.63$\\pm$0.15&-1.48$\\pm$0.15&-2.66$\\pm$0.21&0.23$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  9&J$011914.3-093546.2$&7.60$\\pm$0.14&-1.55$\\pm$0.12&-1.92$\\pm$0.27&0.15$\\pm$0.02&2&9.99$\\pm$0.00\\\\\n 10&J$013352.6+134209.4$&7.46$\\pm$0.14&-9.99$\\pm$0.00&-1.79$\\pm$0.23&0.26$\\pm$0.03&2&9.99$\\pm$0.00\\\\\n 11&J$015759.7+011138.6$&7.56$\\pm$0.29&-1.22$\\pm$0.20&-2.65$\\pm$0.13&0.11$\\pm$0.05&0&9.99$\\pm$0.00\\\\\n 12&J$022107.2-002507.3$&7.60$\\pm$0.20&-1.41$\\pm$0.16&-2.53$\\pm$0.19&0.15$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n 13&J$022237.8+002908.0$&7.67$\\pm$0.15&-1.56$\\pm$0.13&-2.54$\\pm$0.17&0.28$\\pm$0.05&0&9.99$\\pm$0.00\\\\\n 14&J$022607.0+000017.7$&7.64$\\pm$0.20&-1.39$\\pm$0.17&-2.56$\\pm$0.17&0.04$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n 15&J$024223.6-005817.3$&7.66$\\pm$0.12&-1.29$\\pm$0.16&-1.78$\\pm$0.19&0.21$\\pm$0.02&0&7.54$\\pm$0.17\\\\\n 16&J$024429.0+000741.4$&7.55$\\pm$0.12&-1.01$\\pm$0.00&-1.64$\\pm$0.18&0.00$\\pm$0.06&0&9.99$\\pm$0.00\\\\\n 17&J$024636.4+001654.9$&7.60$\\pm$0.20&-1.42$\\pm$0.16&-2.53$\\pm$0.19&0.30$\\pm$1.27&0&9.99$\\pm$0.00\\\\\n 18&J$025818.9+004348.7$&7.60$\\pm$0.24&-1.41$\\pm$0.18&-2.53$\\pm$0.18&0.26$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n 19&J$030149.0-005257.4$&7.58$\\pm$0.12&-9.99$\\pm$0.00&-1.86$\\pm$0.24&0.29$\\pm$0.04&2&9.99$\\pm$0.00\\\\\n 20&J$031137.9-003332.0$&7.58$\\pm$0.13&-9.99$\\pm$0.00&-2.38$\\pm$0.20&0.19$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n\n\n\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots\n\\enddata\n\\tablenotetext{a}{The full table with all the {196}\\ entries is given only in electronic format.}\n\\tablenotetext{b}{Sorted according to growing RA.}\n\\tablenotetext{c}{RA and DEC in J2000 coordinates.}\n\\tablenotetext{d}{Using HCM; see Sect.~\\ref{hcm}.}\n\\tablenotetext{e}{Ionization parameter \\citep[e.g.,][]{2012EAS....54....3S}.}\n\\tablenotetext{f}{Extinction coefficient in H$\\beta$.}\n\\tablenotetext{g}{Galaxy also in: (1) Table 1 in {Paper~I} ; (2) Table 2 in {Paper~I} ; (3) Tables 1 \\&\\ 2 in {Paper~I} ; \n(4) \\citet{2012A&A...546A.122I}; (5) Table 1  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I};\n(6) Table 2  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I};\n(7) Table 1 \\&\\ 2 in {Paper~I} , \\&\\ \\citet{2012A&A...546A.122I}; (0) no match.}\n\\tablenotetext{h}{Using the direct method (Sect.~\\ref{list_of_xmp}). 9.99 means no measurement available}\n\\label{main_list}\n\\end{deluxetable*}\n\n\n\n\n\\begin{deluxetable*}{cccccc}\n\\tabletypesize{\\scriptsize}\n\n\\tablewidth{0pt}\n\\tablecaption{Candidate XMP galaxies\\tablenotemark{a}}\n\\tablehead{\n\\colhead{Index\\tablenotemark{b}}&\n\\colhead{Name\\tablenotemark{c}}&\n\\colhead{12+log(O/H)\\tablenotemark{d}}&\n\\colhead{log(N/O)\\tablenotemark{d}}&\n\\colhead{logU\\tablenotemark{e}}&\n\\colhead{CH$\\beta$\\tablenotemark{f}}\n}\n\\startdata\n\n 1&J$000009.0+011423.8$&7.67$\\pm$0.18&-1.44$\\pm$0.15&-2.58$\\pm$0.13&0.29$\\pm$0.06\\\\\n  2&J$001432.7+002919.9$&7.60$\\pm$0.24&-1.37$\\pm$0.22&-2.63$\\pm$0.12&0.09$\\pm$0.03\\\\\n  3&J$001637.4+003828.8$&7.66$\\pm$0.18&-1.60$\\pm$0.14&-2.65$\\pm$0.12&0.00$\\pm$0.04\\\\\n  4&J$001922.9-002450.5$&7.57$\\pm$0.19&-1.11$\\pm$0.23&-2.54$\\pm$0.16&0.27$\\pm$0.03\\\\\n  5&J$002114.8-085809.5$&7.56$\\pm$0.23&-1.14$\\pm$0.28&-2.65$\\pm$0.19&0.62$\\pm$0.01\\\\\n  6&J$002535.1+003456.1$&7.61$\\pm$0.18&-1.27$\\pm$0.24&-2.68$\\pm$0.21&0.15$\\pm$0.04\\\\\n  7&J$002916.8-010021.2$&7.61$\\pm$0.16&-1.35$\\pm$0.15&-2.04$\\pm$0.33&0.17$\\pm$0.02\\\\\n  8&J$003145.3-110656.8$&7.61$\\pm$0.17&-1.56$\\pm$0.12&-2.24$\\pm$0.33&0.13$\\pm$0.18\\\\\n  9&J$003630.4+005234.7$&7.59$\\pm$0.12&-1.51$\\pm$0.14&-1.89$\\pm$0.25&0.01$\\pm$0.03\\\\\n 10&J$003741.1+003320.1$&7.68$\\pm$0.12&-1.52$\\pm$0.13&-1.89$\\pm$0.27&0.00$\\pm$0.03\\\\\n 11&J$004224.8+003315.7$&7.63$\\pm$0.16&-1.51$\\pm$0.14&-2.55$\\pm$0.18&0.07$\\pm$0.03\\\\\n 12&J$004521.9-093700.1$&7.52$\\pm$0.21&-1.44$\\pm$0.13&-1.92$\\pm$0.43&0.09$\\pm$0.03\\\\\n 13&J$004614.4+000635.9$&7.55$\\pm$0.20&-1.28$\\pm$0.25&-2.50$\\pm$0.19&0.25$\\pm$0.03\\\\\n 14&J$005249.8-084133.9$&7.63$\\pm$0.15&-1.48$\\pm$0.15&-2.66$\\pm$0.21&0.23$\\pm$0.03\\\\\n 15&J$010408.4-004010.3$&7.60$\\pm$0.15&-1.38$\\pm$0.16&-2.38$\\pm$0.17&0.21$\\pm$0.12\\\\\n 16&J$010413.3+001529.0$&7.56$\\pm$0.21&-1.20$\\pm$0.22&-2.65$\\pm$0.13&0.16$\\pm$0.04\\\\\n 17&J$010414.6-005040.1$&7.31$\\pm$0.34&-1.38$\\pm$0.22&-1.71$\\pm$0.32&0.20$\\pm$0.04\\\\\n 18&J$011144.5+010929.8$&7.55$\\pm$0.22&-1.44$\\pm$0.23&-2.41$\\pm$0.24&0.09$\\pm$0.23\\\\\n 19&J$011340.5+005239.2$&7.04$\\pm$0.26&-9.99$\\pm$0.00&-1.55$\\pm$0.10&0.00$\\pm$0.01\\\\\n 20&J$011914.3-093546.2$&7.60$\\pm$0.14&-1.55$\\pm$0.12&-1.92$\\pm$0.27&0.15$\\pm$0.02\\\\\n\n\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots\n\\enddata\n\\tablenotetext{a}{The full table with the {332}\\ candidates is given\nonly in electronic format.}\n\\tablenotetext{b}{Sorted according to growing RA.}\n\\tablenotetext{c}{RA and DEC in J2000 coordinates.}\n\\tablenotetext{d}{Using HCM; see Sect.~\\ref{hcm}.}\n\\tablenotetext{e}{Ionization parameter \\citep[e.g.,][]{2012EAS....54....3S}.}\n\\tablenotetext{f}{Extinction coefficient in H$\\beta$.}\n\\label{candidates}\n\\end{deluxetable*}\n\n\n\n\n\n\n \n\n\n\n\\section{Properties of the XMPs }\\label{properties}\n\n\n\n\n\\subsection{Reddening and dust mass}\\label{reddening}\n\n\nDust is made out of metals and so metal-poor objects are also \nexpected to be dust-poor \n\\citep[][]{2013MNRAS.436.2747K,2014Natur.505..186F}. \nHowever, \nthe type of  bursting XMPs selected here are going through \na starburst phase where SNe go off continuously creating \ndust that may potentially obscure the light from the \nstarburst\n\\citep[e.g.,][]{2013ApJ...778..159T}.\nConsequently, one expects small but non-zero amounts of extinction in \nXMPs. This is actually the case in our XMP sample.\n\n\n\nAs a by-product of the metallicity estimate, we have to measure the\nextinction coefficient that renders the observed Balmer decrement (Sect.~\\ref{fluxes}).\nWe follow the procedure described by \\citet{2008MNRAS.383..209H},\nwhere the shape of the extinction law is taken to be the Milky-Way \nextinction law by \\citet{1989ApJ...345..245C}. \n\nUsing the usual parametrization, the extinction \ncoefficient at H$\\beta$, c(H$\\beta$), is defined\nto be \n\n", "itemtype": "equation", "pos": 24975, "prevtext": "\nWe start from the full set of {788677}\\ galaxy spectra from SDSS-DR7 having\nredshift smaller than 0.25 \\citep{2010ApJ...714..487S}. The classification\nrenders 17 types or classes. The two of them showing the largest [OIII]$\\lambda$4363, \nwhich include  24200 objects, are re-classified to obtain 12 subclasses. \nSome of these subclasses collect noisy spectrum, and those are discarded \nso that k-means acts as a noise filter. Four of the subclasses show particularly intense  \n[OIII]$\\lambda$4363, as depicted in Fig.~\\ref{classes}. (Note that, even in these cases, \nthe flux of  [OIII]$\\lambda$4363 is much smaller than the fluxes of  [OIII]$\\lambda$4959,  \n[OIII]$\\lambda$5007\n-- \nthe spectra in  Fig.~\\ref{classes} have [OIII]$\\lambda$5007 some fifty times \nlarger than [OIII]$\\lambda$4363.)  \nClasses \\#8 and \\#11 in Fig.~\\ref{classes} are discarded because \nthe mean spectrum of the class appears in the region of \nActive Galactic Nuclei (AGNs)  of the BPT diagram \n\\citep{1981PASP...93....5B,2012ApJ...756..163S}.  Therefore,  their high excitation is \nproduced by hard AGN radiation, rather than by lack of efficient coolants  \nin a stellar-radiation excited HII region. \nThe AGN nature of the discarded classes is corroborated by the large\nwidth of their emission lines (cf. AGN classes, \\#8 and \\#11, with \nstar-forming classes  \\#4 and \\#6), a property also \ncharacteristic of AGNs. After the classification and trimming, we are\nleft with {1281}\\ \nbursting XMP candidates.  \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{template.eps}\n\\caption{Template of four spectral classes where the emission line \n[OIII]$\\lambda$4363 (marked with arrows)  is particularly intense compared to   \n[OIII]$\\lambda$4959 and  [OIII]$\\lambda$5007. They were found by applying \ntwo nested k-means classifications to \nthe {788677}\\ galaxies with spectra in SDSS-DR7 having redshift $< 0.25$.\nTwo of the classes ( \\#8 and \\#11) are AGNs, as proven by their position \non the BTP diagram and the fact that the emission lines are particularly\nbroad.\n\nThe spectra, with the continua removed, have been \nnormalized to the peak intensity of  [OIII]$\\lambda$4363. \nWavelengths are given in \\AA . The \nlabel on top of each panel represent the class number and \nthe number of galaxies in the class.\n}\n\\label{classes}\n\\end{figure}\n\n\n\nWe have compared these {1281}\\ candidates with the 32~XMPs\nselected in {Paper~I}\\ after classifying the spectral region around\nH$\\alpha$. Most of them, 29  out of the 32, are included in our list of candidates. \nConsidering that the two procedures are completely independent,\nand the randomness inherent to the k-means procedure, \nthe agreement is very reasonable. Recall that k-means is a powerful tool able to classify\nvery large data sets in high-dimensional spaces. However,  among\nits drawbacks, k-means does not provide a single classification for\na single database. Each particular run depends on a random \ninitialization, thus, the classification is not unique \n\\citep[e.g.,][Sect.~2]{2010ApJ...714..487S}.\n\nNothing ensures that the {1281}\\ candidates are true XMPs. \nThey have been picked up as objects where  [OIII]$\\lambda$4363 is \nparticularly intense, using as reference the rest of galaxies in the \nspectroscopic database of SDSS-DR7.\n\n\nIn order to show whether or not they are XMPs, we have \ncomputed the metallicity for every one of them \nto mark as XMP only those objects of truly low metallicity.\n(The details are  given in the next Sect.~\\ref{confirmation}.)\nOne may think of this second step as a way to clean \nfrom pollutants the systematic but otherwise rough XMP selection carried out by \nk-means on the SDSS-DR7 database. \n\n\n\n\n\\section{Metallicities of the XMP candidates}\\label{confirmation}\n\n\\subsection{Determination of emission line fluxes}\\label{fluxes}\n\nWe use the SDSS-DR7 spectra \nof the {1281}\\ candidates to \ndetermine their metallicities. As usual, the procedure requires correcting the emission \nline fluxes for reddening, which is determined from the relative fluxes of the observed Balmer lines\n\\citep[e.g.,][]{2008MNRAS.383..209H,2012EAS....54....3S}. However,\n\nBalmer emission is usually depressed due to the presence of absorption lines of stellar origin. \nTherefore, prior to the measurement of the emission lines, we perform a stellar fitting to the \ncontinuum of the spectra. We use {\\sc starlight} \\citep{2005MNRAS.358..363C}\nto model the spectral energy distribution (SED) of the underlying stellar population.\n{\\sc Starlight} fits the observed continuum as a linear combination of single stellar \npopulation  (SSP)\nspectra of various ages and metallicities.  We chose the SSP spectra \nfrom \\citet{2003MNRAS.344.1000B}, including four metallicities \n$Z = 0.0001, 0.0004, 0.004,$ and 0.008\n\\citep[1\\%, 3\\%, 30\\% and 60\\% $Z_\\odot$, respectively;][]{2009ARA&A..47..481A}.\nReddening of the stellar SED was included assuming the extinction to follow  \n\\citet{1989ApJ...345..245C} with $R_{V}$ = 3.1.\nThe stellar continuum thus obtained is subtracted out of the observed \nspectrum to produce a pure emission line spectrum. The latter is employed to determine\nline fluxes.\n\nWe used the package\n{\\sc shifu}\\footnote{SHerpa IFU line fitting package, \\citet{garciabenito+15}.} \nto obtain the flux of the emission \nlines. The package contains a suite of routines to easily analyze emission or absorption lines \nin IFU data (both in cube and RSS format). Individual spectra, such as those \nemployed in our particular case, can be provided \nas a list of files (RSS). The core of the code uses CIAO's Sherpa package \n\\citep{2001SPIE.4477...76F,2007ASPC..376..543D}. Several custom algorithms are implemented in order\nto cope with general and ill-defined cases. A sigma-clipping is independently applied to the \nstellar continuum model, and then this is parsed to the composite line plus continuum model. \nAlthough the fitting is \nperformed in the residual spectra, we allow for the modeling of the continuum to take into account small \ndeviations in the stellar continnum residuals. A first order polynomial has been chosen for the continuum, \nwhile single gaussians have been selected for the lines. \nThe continuum is evaluated in the  original spectra when used\nto determine equivalent widths.\n\n\n\\subsection{Method to measure metal abundance}\\label{hcm}\n\nMetal abundances are computed with \nthe code HII-CHI-mistry\\footnote{{\\tt http://www.iaa.es/$\\sim$epm/HII-CHI-mistry.html}}\n  \\citep[hereafter HCM][]{2014MNRAS.441.2663P},\nwhich calculates the total oxygen abundance O/H, the nitrogen-to-oxygen ratio N/O,\nand the ionization parameter U. \nNormalized to H$\\beta$ and corrected for extinction, the  fluxes of the emission lines\n[OII]$\\lambda$3727, [OIII]$\\lambda\\lambda$4363,5007, [NII]$\\lambda$6584, and\n[SII]$\\lambda\\lambda$6716,6731 are compared with the predictions of a large grid of \n{\\sc cloudy} \\citep{2013RMxAA..49..137F} photoionization models.\nThe HCM assumes a spherically symmetric constant-density distribution \nof gas ionized by {\\sc popstar} \\citep{2009MNRAS.398..451M}\n1\\,Myr-old stellar clusters with the same metallicity of the gas, \nand covering a wide range of values in O/H, N/O, and log U.\nIn particular, the grid includes very low values of the gas metallicity,\ndown to 12+log(O/H)=6.9 equivalent to 1/60 of the oxygen \nabundance in the solar composition \\citep{2009ARA&A..47..481A}.   \nThe main advantage of this method is that it leads to a derivation\nof the chemical abundances consistent with the direct\nmethod even in the absence of one or more of the input emission lines\n\\citep{2014MNRAS.441.2663P}.\nSince the direct method does not depend on modeling \n\\citep[e.g.,][]{1974agn..book.....O,2012EAS....54....3S}, it means that the \nmetallicities provided by HCM are almost insensitive to the \nmodel assumptions.\n\nGiven a set of observed line ratios, HCM assigns a $\\chi^2$ to each \none of the models, computed as the sum of \nthe square differences between the observed and \nthe model line ratios.  The $1/\\chi^2$-weighted \naverage of the abundance in the models\nyields the chemical abundance tagged to  the observed line ratios.\nErrors are derived as the $1/\\chi^2$-weighted standard \ndeviation of the parameters in the models. When the \ntemperature-sensitive line [OIII]$\\lambda$4363 is available, \nHCM uses the whole grid of models to provide values of O/H and \nN/O  that are consistent with the direct method, even in the \nabsence of [OII]$\\lambda$3727. Thus the use of HCM results \nespecially appropriate to search for XMPs in SDSS since \n[OII]$\\lambda$3727 is sometimes outside the observed \nspectral region for nearby objects.  \n\nThe error bars estimated by HCM quantify the internal precision of the \nmethod, i.e., they give the range of models that is consistent with the \nobserved line fluxes. The observational errors enter into \nthe abundance error estimate indirectly, since the observed \nfluxes must have enough signal to be considered for analysis.\n\n\n\n\n\n\n\n\\subsection{List of XMPs}\\label{list_of_xmp}\n\nThe automated procedure described in Sect.~\\ref{fluxes} provides the fluxes used by \nHCM (Sect.~\\ref{hcm}) to infer the oxygen abundance of the {1281}\\ candidates\n (Sect.~\\ref{kmeanssearch}). \nWe consider only line fluxes with a signal-to-noise ratio larger than three,\nincluding the weak [OIII]$\\lambda$4363. The scatter plot 12+log(O/H) vs \nlog(N/O) for the full sample is shown in Fig.~\\ref{distribution}a. Assuming that the solar composition \ncorresponds to 12+log(O/H)$_\\odot\\simeq 8.69$~\\citep{2009ARA&A..47..481A}, \nXMPs are defined as those candidates having\\footnote{Different authors \nuse slightly different thresholds, e.g., \\citet{2000A&ARv..10....1K} and \n\\citet{2011ApJ...743...77M} use \n$12+\\log({\\rm O/H}) \\le\\ 7.65$, \\citet{2009A&A...505...63G} use\n$\\leq 7.60$,  while we use exactly one tenth of the solar metallicity quoted in the \nreview paper by \\citet{2009ARA&A..47..481A}.\\label{thresholds_note}}\n\n", "index": 3, "text": "\\begin{equation}\n12+\\log({\\rm O/H})\\le 7.69. \n\\label{solar_metal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"12+\\log({\\rm O/H})\\leq 7.69.\" display=\"block\"><mrow><mrow><mrow><mn>12</mn><mo>+</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">O</mi><mo>/</mo><mi mathvariant=\"normal\">H</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>≤</mo><mn>7.69</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwhere the symbols $F$ and $F_0$ stand for the reddened and original\nfluxes in H$\\beta$, respectively.  Therefore, the extinction coefficient \nis proportional to the  optical depth along the line-of-sight $\\varpi$\n\\citep[e.g.,][]{1974agn..book.....O},\n\\begin{displaymath}\n{\\rm c(H\\beta)}=\\varpi\\,\\log e,\n\\end{displaymath}\nwith \n\n", "itemtype": "equation", "pos": 43273, "prevtext": "\n\n\nThere are {196}\\ galaxies fulfilling this requirement, \nwhich are the\nbursting XMP galaxies \npresented in this work. \n{11}\\ of them have duplicated spectra in SDSS-DR7. \nWe have chosen for analysis the spectrum yielding the smallest error in  \nmetallicity. The XMP galaxies\n\nare represented as red squares with \nerror bars in Fig.~\\ref{distribution}a. The distribution of metallicities of the candidates is\ngiven in Fig.~\\ref{distribution}b. The histogram is fairly continuous at the border between \nXMPs and the rest, which proves the 1/10 solar metallicity threshold to be rather arbitrary.\n\n\\begin{figure*}\n\\includegraphics[width=\\textwidth]{distribution2.eps}\n\\caption{\n(a) Scatter plot N/O vs O/H  for the XMPs found in our search \n(red squares with error bars), and for the candidates that turned out not to be XMPs \n(blue symbols with error bars).\n(b) Distribution of the O abundance for the XMPs (thick red line) and\nthe failed candidates (thin blue line). It is rather smooth at the transition\nabundance (7.69, equivalent to a tenth of the solar value). \n(c) Distribution of N/O for the XMPs (thick red line) and the rest (thin blue line).\n}\n\\label{distribution}\n\\end{figure*}  \n\nThe list of XMPs is given in Table~\\ref{main_list}, which includes coordinates \nas well as the main physical properties provided by HCM. \nWhen [NII]$\\lambda$6584 is too weak for the noise level, \nN/O cannot be derived,  and it appears as -9.99 in the Table. \nThe distributions of N/O for the XMPs and the rest of the sample \nare given in Fig.~\\ref{distribution}c. They look qualitatively similar. \n\n\nWe carried out several sanity checks. First, we estimated the number of false positives \nand false negatives due to observational errors. False positives are galaxies in the \nXMP list which have true oxygen abundance above the threshold. False negatives are\ntrue XMP galaxies that have been discarded from the selection. Using a Bayesian approach, \nwe work out in Appendix~\\ref{appendix} the expected number of false positives and \nfalse negatives. Even though the typical error of the individual abundance estimates \nis rather small ($\\simeq 0.17$\\,dex for the galaxies in Table~\\ref{main_list}), \nwe expect a significant number of false positives and false negatives. Assuming the\ntrue distribution of metallicities to be given by the histogram in \nFig.~\\ref{distribution}b, we expect 82 false positives and 46 false negatives\n(Eq.~[\\ref{false3}]). If the true distribution is uniform, then \nthe number of both false positives and false negatives is around 55 \n(Eq.~[\\ref{false4}]).  \n\nPartly to offer the possibility of recovering false negatives in the future, \nwe include a 2nd list with {\\em candidate} XMPs  in Table~\\ref{candidates}.\nTable~\\ref{main_list} is based on lines with measured fluxes exceeding \nthree times the noise. If this threshold is lowered, and lines with \nfluxes at two-sigma are also considered, then the number of galaxies \nfulfilling the condition in Eq.~(\\ref{solar_metal})\nincreases to  {332} , and those are the objects included in \nTable~\\ref{candidates}. The reason why the number increases when lowering \nnoise limit can be pinned down to the weakness of [OIII]$\\lambda$4363,\nwhich tends to be excluded from the metallicity estimate when\nthe noise limit is too restrictive. When it is considered in the metallicity \nestimate,  HCM tends to lower the oxygen abundance estimate due to \narguments given in  Sect.~\\ref{kmeanssearch}\n\n\nAs a second test, we compared the metallicity provided by HCM \nwith the metallicity obtained with the direct method \\citep[e.g.,][]{2008MNRAS.383..209H} \nwhen [OII]$\\lambda$3727 was available\n\\footnote{The wavelength 3727\\,\\AA\\ is out of the range \nof the original SDSS spectrograph, so that a minimum redshift\naround 0.03 is needed for line to appear in a SDSS spectrum.\n}. \nThese abundances, based on the direct method, are also included in Table~\\ref{main_list}. \nThe scatter plot direct-method metallicity vs HCM metallicity is shown in \nFig.~\\ref{metal_vs_metal}. As expected, the two techniques agree quite well\nwith a dispersion of only 0.04\\,dex, which is smaller than the intrinsic\nerror of both methods. On top of this agreement, there is a tendency for  \nHCM to overestimate the direct-method metallicity at low metallicities. \nSince this bias occurs below the threshold metallicity to  \nbe XMP (Eq.~[\\ref{solar_metal}]), \nboth  methods would yield the same list of XMPs if we had access to \n[OII]$\\lambda$3727.  \nMoreover, the systematic differences between the abundances\nobtained from HCM and the direct method are small compared\nwith their error bars,  so that such differences barely \naffect other results and conclusions of the paper.\nFor example, adding an extra 0.06~dex error to the \ntypical $\\sim 0.17~$dex error bar increases the\nnumber of false positives worked out in Appendix~\\ref{appendix}, but\nonly from 82 to 86. \n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{comp_oh_hcm-dm_sn3.eps}\n\\caption{Scatter plot direct-method metallicity vs HCM metallicity for \nthe galaxies having [OII]$\\lambda$3727 within the observed spectral \nrange. Both measurements agree quite well, with a small difference at \nmetallicities below the XMP threshold which consequently \ndoes not affect  the selection of XMPs.\nThe solid line  corresponds to the  one-to-one relationship.\n}\n\\label{metal_vs_metal}\n\\end{figure}\n\n\n\nAs a final test, we represented our targets in the [OIII]$\\lambda$5007/H$\\beta$ vs \n[NII]$\\lambda$6583/H$\\alpha$ plane commonly used to separate starbursts from AGNs \n\\citep[the so-called BPT diagram, after][]{1981PASP...93....5B}; see Fig.~\\ref{bpt_diagram}. \nNone of them are AGNs, and only two  reside in the composite-spectrum region \nnext to the divide worked out by\n\n\\citet{2003MNRAS.346.1055K}.\nThey may be starbursts of high N/O \\citep{2009MNRAS.398..949P}, or HII regions\nwhere the excitation may have contribution from shocks, evolved stars,  \nor even AGNs. The two objects with composite-spectrum \nare number 51 and number 151 in Table~\\ref{main_list}, and their\nidentification as XMP galaxies must be taken with caution. \n\\begin{figure}\n\n\\includegraphics[width=0.45\\textwidth]{create_bpt.eps}\n\\caption{\nScatter plot [OIII]$\\lambda$5007/H$\\beta$ vs \n[NII]$\\lambda$6583/H$\\alpha$ for the galaxies in Table~\\ref{main_list}.\nThis plane is commonly used to separate starbursts from \nAGNs  \\citep[the so-called BPT diagram, after][]{1981PASP...93....5B}. Most\nobjects  reside below the solid line by \\citet{2003MNRAS.346.1055K}, \ncorresponding to excitation  by stars.\nOnly two objects are close to this border and they may have composite spectra.\nThe shaded region shows the area used by \\citet{2012A&A...546A.122I} \nto search for XMPs in SDSS-DR7. The colored points correspond to  \nobjects also found in {Paper~I}\\ (red) and in \\citet[][blue]{2012A&A...546A.122I}.\nContrarily to our targets, these previous searches pick up emitters \nconcentrated on the  leftmost region of the BPT diagram, \ncorresponding to [NII]$\\lambda$6583$\\ll $H$\\alpha$.\n\n\n\n\n\n}\n\\label{bpt_diagram}\n\\end{figure}\n\n\n\nMost of the {196}\\ galaxies in Table~\\ref{main_list} seem to be new \nmembers of the XMP class. Table~2 of {Paper~I}\\ compiles\nall XMPs in the literature up to the date of publication in mid 2011. \nIt contains 129 objects, 21 of which coincide with objects in Table~\\ref{main_list}. \n{Paper~I}\\ also carries out a systematic search for XMPs in SDSS-DR7, \nfinding 32 such objects. 17 of these 32 targets coincide with targets \nselected in our study, and so are included in Table~\\ref{main_list}.  In addition,\nthere is a  recent major search for XMPs by \\citet{2012A&A...546A.122I}, \nwhich contains 41 targets.  Among them, 7 are in Table~\\ref{main_list}. \nConsidering all the objects in these three lists, and discarding coincidences,  \nonly 31 among the {196}\\ galaxies in Table~\\ref{main_list} seem to be \nknown.  Known and unknown targets are pointed out in one of the columns of\nTable~\\ref{main_list}, which used the following code to indicate matches:  \n(1) Table~1 in {Paper~I} , (2) Table 2 in {Paper~I} , (3) Tables 1 \\&\\ 2 in {Paper~I} , \n(4) \\citet{2012A&A...546A.122I}, (5) Table 1  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I},\n(6) Table 2  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I},\n(7) Table 1 \\&\\ 2 in {Paper~I} , \\&\\ \\citet{2012A&A...546A.122I}, and finally,  \n(0) no match.\n\nPart of the difference with previous searches is related to the abundance \nthreshold (Eq.~[\\ref{solar_metal}]). Our criterion is slightly \nless restrictive than others (see footnote number~\\ref{thresholds_note}) therefore,\nby construction, the highest metallicity targets in Table~\\ref{main_list}  are\ndiscarded in other compilations. For example, \n43 and 88 objects have $12+\\log({\\rm O/H}) > 7.65$ and $> 7.60$, respectively. \nIn addition to this fact, however, we employ a novel selection procedure \nwhich influences the results.    \nFigure~\\ref{bpt_diagram}  provides the clue for understanding the main \ndifference between our search and previous ones. \nPrevious searches are focused on objects having small \n[NII]$\\lambda$6583 compared with H$\\alpha$ ({Paper~I} ) \nor with H$\\beta$ \\citep[e.g.,][]{2007ApJ...665.1115I,2012A&A...546A.122I},\nwhereas our technique selects objects that cover a significant part\nof the BPT plane. XMP galaxies of relatively large [NII]$\\lambda$6583/H$\\alpha$\nare know to exist due to, e.g., having particularly large N/O or displaying\nparticularly low ionization  \\citep[e.g.,][]{2014ApJ...797...81M}. \nOur approach is sensitive to those XMPs, as it is  evidenced in Fig.~\\ref{bpt_diagram}, \nwhich shows with colored symbols the objects in common with the searches in {Paper~I}\\ and \n\\citet{2012A&A...546A.122I}.\nThe region explored by \\citep{2012A&A...546A.122I} is also indicated in the \nfigure.\\footnote{The constraints in \\citet{2012A&A...546A.122I} are  \n[OIII]$\\lambda$4959/H$\\beta\\lesssim 1$ and \n[NII]$\\lambda$6583/H$\\beta\\lesssim 0.1$. \nHowever, atomic properties set  [OIII]$\\lambda$5007/[OIII]$\\lambda$4959$\\simeq 2.98$ \n\\citep[e.g.,][]{2000MNRAS.312..813S} and H$\\alpha$/H$\\beta\\simeq 2.86$ \n\\citep[e.g.,][case B recombination]{1989agna.book.....O}, \nwhich brings the constraints in the line ratios used for our BPT diagram to \n[OIII]$\\lambda$5007/H$\\beta\\lesssim 2.98$ and \n[NII]$\\lambda$6583/H$\\alpha\\lesssim 0.035$. This is the region highlighted in Fig.~\\ref{bpt_diagram}.\n}\n\n\nThe histogram of metallicities in Fig.~\\ref{distribution}a drops at  \n$12+\\log({\\rm O/H}) \\le 7.50$, so that only 28 of the \nXMPs in Table~\\ref{main_list} have oxygen abundance smaller than this \nthreshold. (The lowest metallicity limit is discussed in Sect.~\\ref{threshold}.)\nThose objects  are particularly rare, here and in previous works \n\\citep[e.g., {Paper~I} ;][]{2012A&A...546A.122I,2015A&A...579A..11G},\nhowever, this part of Table~\\ref{main_list}\nis the one that contains more targets in common with previous \nsearches. Actually, 36\\,\\%\\ of our XMPs with $12+\\log({\\rm O/H}) \\le 7.50$ \nare already known, whereas the 31 known objects in \nTable~\\ref{main_list} represent only 16\\% of the full list of \n{196}\\ targets.\n\n\n\n\n\n\\begin{deluxetable*}{cccccccc}\n\\tabletypesize{\\scriptsize}\n\n\\tablewidth{0pt}\n\\tablecaption{Extremely metal poor galaxies selected in this study\\tablenotemark{a}}\n\\tablehead{\n\\colhead{Index\\tablenotemark{b}}&\n\\colhead{Name\\tablenotemark{c}}&\n\\colhead{12+log(O/H)\\tablenotemark{d}}&\n\\colhead{log(N/O)\\tablenotemark{d}}&\n\\colhead{logU\\tablenotemark{e}}&\n\\colhead{CH$\\beta$\\tablenotemark{f}}&\n\\colhead{Match\\tablenotemark{g}}&\n\\colhead{12+log(O/H)$_{\\rm DM}$\\tablenotemark{h}}\n}\n\\startdata\n\n  1&J$001637.4+003828.8$&7.66$\\pm$0.18&-1.60$\\pm$0.14&-2.65$\\pm$0.12&0.00$\\pm$0.04&0&7.59$\\pm$0.19\\\\\n  2&J$001922.9-002450.5$&7.57$\\pm$0.19&-1.11$\\pm$0.23&-2.54$\\pm$0.16&0.27$\\pm$0.03&0&7.47$\\pm$0.18\\\\\n  3&J$002114.8-085809.5$&7.56$\\pm$0.23&-1.14$\\pm$0.28&-2.65$\\pm$0.19&0.62$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n  4&J$002916.8-010021.2$&7.61$\\pm$0.16&-1.35$\\pm$0.15&-2.04$\\pm$0.33&0.17$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n  5&J$003630.4+005234.7$&7.58$\\pm$0.12&-9.99$\\pm$0.00&-1.88$\\pm$0.25&0.01$\\pm$0.03&1&7.39$\\pm$0.08\\\\\n  6&J$003741.1+003320.1$&7.68$\\pm$0.12&-1.52$\\pm$0.13&-1.89$\\pm$0.27&0.00$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  7&J$004224.8+003315.7$&7.63$\\pm$0.16&-1.51$\\pm$0.14&-2.55$\\pm$0.18&0.07$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  8&J$005249.8-084133.9$&7.63$\\pm$0.15&-1.48$\\pm$0.15&-2.66$\\pm$0.21&0.23$\\pm$0.03&0&9.99$\\pm$0.00\\\\\n  9&J$011914.3-093546.2$&7.60$\\pm$0.14&-1.55$\\pm$0.12&-1.92$\\pm$0.27&0.15$\\pm$0.02&2&9.99$\\pm$0.00\\\\\n 10&J$013352.6+134209.4$&7.46$\\pm$0.14&-9.99$\\pm$0.00&-1.79$\\pm$0.23&0.26$\\pm$0.03&2&9.99$\\pm$0.00\\\\\n 11&J$015759.7+011138.6$&7.56$\\pm$0.29&-1.22$\\pm$0.20&-2.65$\\pm$0.13&0.11$\\pm$0.05&0&9.99$\\pm$0.00\\\\\n 12&J$022107.2-002507.3$&7.60$\\pm$0.20&-1.41$\\pm$0.16&-2.53$\\pm$0.19&0.15$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n 13&J$022237.8+002908.0$&7.67$\\pm$0.15&-1.56$\\pm$0.13&-2.54$\\pm$0.17&0.28$\\pm$0.05&0&9.99$\\pm$0.00\\\\\n 14&J$022607.0+000017.7$&7.64$\\pm$0.20&-1.39$\\pm$0.17&-2.56$\\pm$0.17&0.04$\\pm$0.02&0&9.99$\\pm$0.00\\\\\n 15&J$024223.6-005817.3$&7.66$\\pm$0.12&-1.29$\\pm$0.16&-1.78$\\pm$0.19&0.21$\\pm$0.02&0&7.54$\\pm$0.17\\\\\n 16&J$024429.0+000741.4$&7.55$\\pm$0.12&-1.01$\\pm$0.00&-1.64$\\pm$0.18&0.00$\\pm$0.06&0&9.99$\\pm$0.00\\\\\n 17&J$024636.4+001654.9$&7.60$\\pm$0.20&-1.42$\\pm$0.16&-2.53$\\pm$0.19&0.30$\\pm$1.27&0&9.99$\\pm$0.00\\\\\n 18&J$025818.9+004348.7$&7.60$\\pm$0.24&-1.41$\\pm$0.18&-2.53$\\pm$0.18&0.26$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n 19&J$030149.0-005257.4$&7.58$\\pm$0.12&-9.99$\\pm$0.00&-1.86$\\pm$0.24&0.29$\\pm$0.04&2&9.99$\\pm$0.00\\\\\n 20&J$031137.9-003332.0$&7.58$\\pm$0.13&-9.99$\\pm$0.00&-2.38$\\pm$0.20&0.19$\\pm$0.01&0&9.99$\\pm$0.00\\\\\n\n\n\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots\n\\enddata\n\\tablenotetext{a}{The full table with all the {196}\\ entries is given only in electronic format.}\n\\tablenotetext{b}{Sorted according to growing RA.}\n\\tablenotetext{c}{RA and DEC in J2000 coordinates.}\n\\tablenotetext{d}{Using HCM; see Sect.~\\ref{hcm}.}\n\\tablenotetext{e}{Ionization parameter \\citep[e.g.,][]{2012EAS....54....3S}.}\n\\tablenotetext{f}{Extinction coefficient in H$\\beta$.}\n\\tablenotetext{g}{Galaxy also in: (1) Table 1 in {Paper~I} ; (2) Table 2 in {Paper~I} ; (3) Tables 1 \\&\\ 2 in {Paper~I} ; \n(4) \\citet{2012A&A...546A.122I}; (5) Table 1  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I};\n(6) Table 2  in {Paper~I}\\  \\&\\ \\citet{2012A&A...546A.122I};\n(7) Table 1 \\&\\ 2 in {Paper~I} , \\&\\ \\citet{2012A&A...546A.122I}; (0) no match.}\n\\tablenotetext{h}{Using the direct method (Sect.~\\ref{list_of_xmp}). 9.99 means no measurement available}\n\\label{main_list}\n\\end{deluxetable*}\n\n\n\n\n\\begin{deluxetable*}{cccccc}\n\\tabletypesize{\\scriptsize}\n\n\\tablewidth{0pt}\n\\tablecaption{Candidate XMP galaxies\\tablenotemark{a}}\n\\tablehead{\n\\colhead{Index\\tablenotemark{b}}&\n\\colhead{Name\\tablenotemark{c}}&\n\\colhead{12+log(O/H)\\tablenotemark{d}}&\n\\colhead{log(N/O)\\tablenotemark{d}}&\n\\colhead{logU\\tablenotemark{e}}&\n\\colhead{CH$\\beta$\\tablenotemark{f}}\n}\n\\startdata\n\n 1&J$000009.0+011423.8$&7.67$\\pm$0.18&-1.44$\\pm$0.15&-2.58$\\pm$0.13&0.29$\\pm$0.06\\\\\n  2&J$001432.7+002919.9$&7.60$\\pm$0.24&-1.37$\\pm$0.22&-2.63$\\pm$0.12&0.09$\\pm$0.03\\\\\n  3&J$001637.4+003828.8$&7.66$\\pm$0.18&-1.60$\\pm$0.14&-2.65$\\pm$0.12&0.00$\\pm$0.04\\\\\n  4&J$001922.9-002450.5$&7.57$\\pm$0.19&-1.11$\\pm$0.23&-2.54$\\pm$0.16&0.27$\\pm$0.03\\\\\n  5&J$002114.8-085809.5$&7.56$\\pm$0.23&-1.14$\\pm$0.28&-2.65$\\pm$0.19&0.62$\\pm$0.01\\\\\n  6&J$002535.1+003456.1$&7.61$\\pm$0.18&-1.27$\\pm$0.24&-2.68$\\pm$0.21&0.15$\\pm$0.04\\\\\n  7&J$002916.8-010021.2$&7.61$\\pm$0.16&-1.35$\\pm$0.15&-2.04$\\pm$0.33&0.17$\\pm$0.02\\\\\n  8&J$003145.3-110656.8$&7.61$\\pm$0.17&-1.56$\\pm$0.12&-2.24$\\pm$0.33&0.13$\\pm$0.18\\\\\n  9&J$003630.4+005234.7$&7.59$\\pm$0.12&-1.51$\\pm$0.14&-1.89$\\pm$0.25&0.01$\\pm$0.03\\\\\n 10&J$003741.1+003320.1$&7.68$\\pm$0.12&-1.52$\\pm$0.13&-1.89$\\pm$0.27&0.00$\\pm$0.03\\\\\n 11&J$004224.8+003315.7$&7.63$\\pm$0.16&-1.51$\\pm$0.14&-2.55$\\pm$0.18&0.07$\\pm$0.03\\\\\n 12&J$004521.9-093700.1$&7.52$\\pm$0.21&-1.44$\\pm$0.13&-1.92$\\pm$0.43&0.09$\\pm$0.03\\\\\n 13&J$004614.4+000635.9$&7.55$\\pm$0.20&-1.28$\\pm$0.25&-2.50$\\pm$0.19&0.25$\\pm$0.03\\\\\n 14&J$005249.8-084133.9$&7.63$\\pm$0.15&-1.48$\\pm$0.15&-2.66$\\pm$0.21&0.23$\\pm$0.03\\\\\n 15&J$010408.4-004010.3$&7.60$\\pm$0.15&-1.38$\\pm$0.16&-2.38$\\pm$0.17&0.21$\\pm$0.12\\\\\n 16&J$010413.3+001529.0$&7.56$\\pm$0.21&-1.20$\\pm$0.22&-2.65$\\pm$0.13&0.16$\\pm$0.04\\\\\n 17&J$010414.6-005040.1$&7.31$\\pm$0.34&-1.38$\\pm$0.22&-1.71$\\pm$0.32&0.20$\\pm$0.04\\\\\n 18&J$011144.5+010929.8$&7.55$\\pm$0.22&-1.44$\\pm$0.23&-2.41$\\pm$0.24&0.09$\\pm$0.23\\\\\n 19&J$011340.5+005239.2$&7.04$\\pm$0.26&-9.99$\\pm$0.00&-1.55$\\pm$0.10&0.00$\\pm$0.01\\\\\n 20&J$011914.3-093546.2$&7.60$\\pm$0.14&-1.55$\\pm$0.12&-1.92$\\pm$0.27&0.15$\\pm$0.02\\\\\n\n\\vdots&\\vdots&\\vdots&\\vdots&\\vdots&\\vdots\n\\enddata\n\\tablenotetext{a}{The full table with the {332}\\ candidates is given\nonly in electronic format.}\n\\tablenotetext{b}{Sorted according to growing RA.}\n\\tablenotetext{c}{RA and DEC in J2000 coordinates.}\n\\tablenotetext{d}{Using HCM; see Sect.~\\ref{hcm}.}\n\\tablenotetext{e}{Ionization parameter \\citep[e.g.,][]{2012EAS....54....3S}.}\n\\tablenotetext{f}{Extinction coefficient in H$\\beta$.}\n\\label{candidates}\n\\end{deluxetable*}\n\n\n\n\n\n\n \n\n\n\n\\section{Properties of the XMPs }\\label{properties}\n\n\n\n\n\\subsection{Reddening and dust mass}\\label{reddening}\n\n\nDust is made out of metals and so metal-poor objects are also \nexpected to be dust-poor \n\\citep[][]{2013MNRAS.436.2747K,2014Natur.505..186F}. \nHowever, \nthe type of  bursting XMPs selected here are going through \na starburst phase where SNe go off continuously creating \ndust that may potentially obscure the light from the \nstarburst\n\\citep[e.g.,][]{2013ApJ...778..159T}.\nConsequently, one expects small but non-zero amounts of extinction in \nXMPs. This is actually the case in our XMP sample.\n\n\n\nAs a by-product of the metallicity estimate, we have to measure the\nextinction coefficient that renders the observed Balmer decrement (Sect.~\\ref{fluxes}).\nWe follow the procedure described by \\citet{2008MNRAS.383..209H},\nwhere the shape of the extinction law is taken to be the Milky-Way \nextinction law by \\citet{1989ApJ...345..245C}. \n\nUsing the usual parametrization, the extinction \ncoefficient at H$\\beta$, c(H$\\beta$), is defined\nto be \n\n", "index": 5, "text": "\\begin{equation}\n{\\rm c(H}\\beta)=-\\log(F/F_0),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\rm c(H}\\beta)=-\\log(F/F_{0}),\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">H</mi><mo>⁢</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>F</mi><mo>/</mo><msub><mi>F</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nThe integral goes along the line-of-sight from the observer \nto the source of light at $l_0$. The symbols  $\\rho_D$ and \n$\\kappa_D$  stand for the dust density and the cross \nsection per unit mass of  dust, respectively.\nDefining the density-weighted mean cross section $\\langle\\kappa_D\\rangle$, \n\n", "itemtype": "equation", "pos": 43662, "prevtext": "\nwhere the symbols $F$ and $F_0$ stand for the reddened and original\nfluxes in H$\\beta$, respectively.  Therefore, the extinction coefficient \nis proportional to the  optical depth along the line-of-sight $\\varpi$\n\\citep[e.g.,][]{1974agn..book.....O},\n\\begin{displaymath}\n{\\rm c(H\\beta)}=\\varpi\\,\\log e,\n\\end{displaymath}\nwith \n\n", "index": 7, "text": "\\begin{equation}\n\\varpi=\\int_0^{l_0}\\kappa_D\\,\\rho_D\\,dl.\n\\label{def_tau}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\varpi=\\int_{0}^{l_{0}}\\kappa_{D}\\,\\rho_{D}\\,dl.\" display=\"block\"><mrow><mrow><mi>ϖ</mi><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><msub><mi>l</mi><mn>0</mn></msub></msubsup><mrow><mpadded width=\"+1.7pt\"><msub><mi>κ</mi><mi>D</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>ρ</mi><mi>D</mi></msub></mpadded><mo>⁢</mo><mrow><mo>𝑑</mo><mi>l</mi></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nthen the dust-mass column density, \n\\begin{displaymath}\n\\Sigma_D=\\int_0^{l_0}\\rho_D\\,dl,\n\\end{displaymath}\ncan be inferred from the extinction coefficient as \n\n", "itemtype": "equation", "pos": 44048, "prevtext": "\nThe integral goes along the line-of-sight from the observer \nto the source of light at $l_0$. The symbols  $\\rho_D$ and \n$\\kappa_D$  stand for the dust density and the cross \nsection per unit mass of  dust, respectively.\nDefining the density-weighted mean cross section $\\langle\\kappa_D\\rangle$, \n\n", "index": 9, "text": "\\begin{equation}\n\\langle\\kappa_D\\rangle=\\int_0^{l_0}\\kappa_D\\,\\rho_D\\,dl\\Big/\\int_0^{l_0}\\rho_D\\,dl,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\langle\\kappa_{D}\\rangle=\\int_{0}^{l_{0}}\\kappa_{D}\\,\\rho_{D}\\,dl\\Big{/}\\int_{%&#10;0}^{l_{0}}\\rho_{D}\\,dl,\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>κ</mi><mi>D</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><msub><mi>l</mi><mn>0</mn></msub></msubsup><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>κ</mi><mi>D</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi>ρ</mi><mi>D</mi></msub></mpadded><mo>⁢</mo><mrow><mo>𝑑</mo><mi>l</mi></mrow></mrow><mo mathsize=\"160%\" stretchy=\"false\">/</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><msub><mi>l</mi><mn>0</mn></msub></msubsup><mrow><mpadded width=\"+1.7pt\"><msub><mi>ρ</mi><mi>D</mi></msub></mpadded><mo>⁢</mo><mrow><mo>𝑑</mo><mi>l</mi></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": " \n\n\n\nFigures~\\ref{extinction}a and \\ref{extinction}b show scatter plots of \nextinction  versus metallicity and N/O, respectively.\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{extinction_xmp.eps}\n\\includegraphics[width=0.5\\textwidth]{extinction_xmp2.eps}\n\\caption{\n(a) Extinction coefficient at the wavelength of H$\\beta$ versus \noxygen abundance. The symbols show individual XMP\ngalaxies whereas the solid line and the shaded region correspond \nto the  mean and the standard deviation of the distribution of points.\nThere is no clear trend.\nThe second ordinate axis portrays the dust column density \nneeded to produce the observed reddening (see text for \ndetails). \n\n(b) \nExtinction coefficient at H$\\beta$  versus \nnitrogen over oxygen. The symbols show individual galaxies \nwhereas the solid line and the shaded region correspond to the \nmean and the standard deviation of the distribution of points.\nThere is a trend, so that the reddening increases \nwith increasing N/O.\n}\n\\label{extinction}\n\\end{figure}\n\nWe find no clear relationship between extinction and metallicity \n(Fig.~\\ref{extinction}a). However,  there is a hint of correlation\nbetween extinction and log(N/O), so that the larger the\nratio between nitrogen and oxygen the larger the reddening\n (Fig.~\\ref{extinction}b). The scatter of the possible relationship \nis large; the extinction coefficient increases \nonly a factor of three over the full range of N/O,\nand this increase is similar to the dispersion\nof the individual galaxies in the scatter plot (Fig.~\\ref{extinction}b).\n\nThe ordinate axes on the right of Figs.~\\ref{extinction}a \nand \\ref{extinction}b quantify the dust-mass column density responsible \nfor the observed extinction. We have used Eq.~(\\ref{dust_mass}) with a \ncross-section per unit mass $\\langle\\kappa_D\\rangle=10^4\\,{\\rm cm^2\\,g^{-1}}$,\nwhich is representative of this quantity at H$\\beta$  \n\\citep[e.g.,][Table~4]{2003ARA&A..41..241D}.\nFor the typical size of the giant HII regions \nin these objects, of the order of 150\\,pc \\citep[e.g.,][]{2013ApJ...767...74S,2015ApJ...810L..15S}, \nthe mass in dust corresponding to the observed surface density\nspans from 2$\\times 10^2$ to 2$\\times 10^4$\\,${\\rm M_\\odot}$.\nFor reference, the dust mass of the prototypical XMP IZw\\,18,\nas inferred from modeling IR dust emission, is between 450 and 1800\\,${\\rm M_\\odot}$\n\\citep{2014Natur.505..186F}. \nIZw18 is included in Table~\\ref{main_list}, and \nits spectrum shows no extinction with an uncertainty of 0.07, which sets  an\nupper limit of  1.5$\\times 10^3$\\,${\\rm M_\\odot}$ consistent with the value \ninferred from dust emission by \\citeauthor{2014Natur.505..186F}\n\nThe distribution of extinction coefficients for the XMPs in Table~\\ref{main_list}\nhas  a mean and a standard deviation given by \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nthen the dust-mass column density, \n\\begin{displaymath}\n\\Sigma_D=\\int_0^{l_0}\\rho_D\\,dl,\n\\end{displaymath}\ncan be inferred from the extinction coefficient as \n\n", "index": 11, "text": "\\begin{equation}\n\n\\Sigma_D={\\rm c(H\\beta)}/\\big[\\langle\\kappa_D\\rangle\\log e\\big].\n\\label{dust_mass}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;\\Sigma_{D}={\\rm c(H\\beta)}/\\big{[}\\langle\\kappa_{D}\\rangle\\log e\\big{]}.\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Σ</mi><mi>D</mi></msub><mo>=</mo><mrow><mrow><mi mathvariant=\"normal\">c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">H</mi><mo>⁢</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">[</mo><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>κ</mi><mi>D</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mi>e</mi></mrow></mrow><mo maxsize=\"120%\" minsize=\"120%\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nUsing Eq.~(\\ref{dust_mass}), this extinction corresponds to a dust mass\ncolumn density of, \n\n", "itemtype": "equation", "pos": 47224, "prevtext": " \n\n\n\nFigures~\\ref{extinction}a and \\ref{extinction}b show scatter plots of \nextinction  versus metallicity and N/O, respectively.\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{extinction_xmp.eps}\n\\includegraphics[width=0.5\\textwidth]{extinction_xmp2.eps}\n\\caption{\n(a) Extinction coefficient at the wavelength of H$\\beta$ versus \noxygen abundance. The symbols show individual XMP\ngalaxies whereas the solid line and the shaded region correspond \nto the  mean and the standard deviation of the distribution of points.\nThere is no clear trend.\nThe second ordinate axis portrays the dust column density \nneeded to produce the observed reddening (see text for \ndetails). \n\n(b) \nExtinction coefficient at H$\\beta$  versus \nnitrogen over oxygen. The symbols show individual galaxies \nwhereas the solid line and the shaded region correspond to the \nmean and the standard deviation of the distribution of points.\nThere is a trend, so that the reddening increases \nwith increasing N/O.\n}\n\\label{extinction}\n\\end{figure}\n\nWe find no clear relationship between extinction and metallicity \n(Fig.~\\ref{extinction}a). However,  there is a hint of correlation\nbetween extinction and log(N/O), so that the larger the\nratio between nitrogen and oxygen the larger the reddening\n (Fig.~\\ref{extinction}b). The scatter of the possible relationship \nis large; the extinction coefficient increases \nonly a factor of three over the full range of N/O,\nand this increase is similar to the dispersion\nof the individual galaxies in the scatter plot (Fig.~\\ref{extinction}b).\n\nThe ordinate axes on the right of Figs.~\\ref{extinction}a \nand \\ref{extinction}b quantify the dust-mass column density responsible \nfor the observed extinction. We have used Eq.~(\\ref{dust_mass}) with a \ncross-section per unit mass $\\langle\\kappa_D\\rangle=10^4\\,{\\rm cm^2\\,g^{-1}}$,\nwhich is representative of this quantity at H$\\beta$  \n\\citep[e.g.,][Table~4]{2003ARA&A..41..241D}.\nFor the typical size of the giant HII regions \nin these objects, of the order of 150\\,pc \\citep[e.g.,][]{2013ApJ...767...74S,2015ApJ...810L..15S}, \nthe mass in dust corresponding to the observed surface density\nspans from 2$\\times 10^2$ to 2$\\times 10^4$\\,${\\rm M_\\odot}$.\nFor reference, the dust mass of the prototypical XMP IZw\\,18,\nas inferred from modeling IR dust emission, is between 450 and 1800\\,${\\rm M_\\odot}$\n\\citep{2014Natur.505..186F}. \nIZw18 is included in Table~\\ref{main_list}, and \nits spectrum shows no extinction with an uncertainty of 0.07, which sets  an\nupper limit of  1.5$\\times 10^3$\\,${\\rm M_\\odot}$ consistent with the value \ninferred from dust emission by \\citeauthor{2014Natur.505..186F}\n\nThe distribution of extinction coefficients for the XMPs in Table~\\ref{main_list}\nhas  a mean and a standard deviation given by \n\n", "index": 13, "text": "\\begin{equation}\n\\mu_{\\rm c(H\\beta)}\\pm \\sigma_{\\rm c(H\\beta)}=0.17\\pm 0.14.\n\\label{extinction_mean}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\mu_{\\rm c(H\\beta)}\\pm\\sigma_{\\rm c(H\\beta)}=0.17\\pm 0.14.\" display=\"block\"><mrow><mrow><mrow><msub><mi>μ</mi><mrow><mi mathvariant=\"normal\">c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">H</mi><mo>⁢</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msub><mo>±</mo><msub><mi>σ</mi><mrow><mi mathvariant=\"normal\">c</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">H</mi><mo>⁢</mo><mi>β</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></msub></mrow><mo>=</mo><mrow><mn>0.17</mn><mo>±</mo><mn>0.14</mn></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\n\n\n\n\n\n\\subsection{Stellar masses}\\label{masses}\n\n\nStellar masses are usually estimated  from photometry via models that provide the\n light-to-mass ratio (M/L) given the observed colors of a galaxy \n\\citep[e.g.,][]{2001ApJ...550..212B}.  This procedure is particularly uncertain for  \nbursting XMP galaxies,\n with spectra having intense emission lines that are hard to capture by the model\nused for M/L. However,  stellar mass is one of the central parameters characterizing \ngalaxies, therefore, even with the above  caveat in mind, we have analyzed \nphotometry-based stellar  masses of the XMP galaxies.\nWe use those from the  Max-Planck-Institute for Astrophysics -- Johns Hopkins University\n(MPA-JHU)\\footnote{{\\tt http://www.mpa-garching.mpg.de/SDSS/DR7/}}\ncharacterization of the SDSS-DR7 galaxy spectral data \n\\citep[][]{2004MNRAS.351.1151B,2007ApJS..173..267S}.\nBroad-band galaxy-integrated magnitudes from the SDSS-DR7 \ndatabase are  compared with a grid of theoretical \ngalaxy spectra \\citep{2003MNRAS.344.1000B} spanning a large range \nin star-formation histories \\citep{,2007ApJS..173..267S}. \nFrom the difference between observed and theoretical magnitudes,\n a likelihood distribution for the mass of each \ngalaxy is estimated. We use the median and the dispersion of this\n distribution in our analysis.\n\n\n\nThe observed stellar masses have a mean and a standard deviation of\n\n", "itemtype": "equation", "pos": 47432, "prevtext": "\nUsing Eq.~(\\ref{dust_mass}), this extinction corresponds to a dust mass\ncolumn density of, \n\n", "index": 15, "text": "\\begin{equation}\n\\mu_{\\Sigma_D}\\pm \\sigma_{\\Sigma_D}=(0.19\\pm 0.15)\\, {\\rm M_\\odot\\,pc^{-2}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\mu_{\\Sigma_{D}}\\pm\\sigma_{\\Sigma_{D}}=(0.19\\pm 0.15)\\,{\\rm M_{\\odot}\\,pc^{-2}}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>μ</mi><msub><mi mathvariant=\"normal\">Σ</mi><mi>D</mi></msub></msub><mo>±</mo><msub><mi>σ</mi><msub><mi mathvariant=\"normal\">Σ</mi><mi>D</mi></msub></msub></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>0.19</mn><mo>±</mo><mn>0.15</mn></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mpadded><mo>⁢</mo><msup><mi>pc</mi><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwhere the masses have been expressed in solar masses. \nThe XMPs are generally dwarfs, but there is a \nlarge spread in their possible masses -- \n${\\rm \\log(M_\\star/M_\\odot)}$ spans from 6 to 10.\nThis can be appreciated in Fig.~\\ref{masmetal}, which shows\nthe scatter plot metallicity vs stellar mass.\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal4.eps}\n\\caption{\nMetallicity vs stellar-mass scatter plot for the XMPs \nin Table~\\ref{main_list} (the symbols with error bars). \nAlthough XMPs tend to be low-mass, there is a large spread in stellar \nmasses.\n\nWhen galaxies are chosen independently of metallicity, their\nstellar masses and metallicities are related\n--  the solid line represents the mean correlation \nobserved and  parameterized by \\citet[][]{2013ApJ...765..140A}.\nThere is no relationship in the case of the XMPs.}\n\\label{masmetal}f\n\\end{figure}\nWe find no clear trend for the metallicity to vary with stellar mass.\nThis is forced by the selection criteria imposed on the XMPs.\nIn a randomly chosen set of galaxies, stellar masses and metallicities \nare correlated \\citep[e.g.,][]{2004ApJ...613..898T}. \nSuch relationship, as updated by  \\citet[][]{2013ApJ...765..140A},\nis included in Fig.~\\ref{masmetal}. \nBy construction, XMPs are restricted to have low metallicity and therefore \ncannot follow the general trend dictated by the red solid line in Fig.~\\ref{masmetal}.  \nHowever, hints of the underlying mass-metallicity relationship remains in the \nXMP sample, because\nthe lowest abundances are associated with galaxies in the low-mass part\nof the mass distribution (Fig.~\\ref{masmetal}). \n\nFigure~\\ref{masmetal2} shows the scatter plot N/O vs stellar mass.\nThere is a clear trend for N/O to increase with increasing stellar mass \nfor $\\log({\\rm M}_\\star/{\\rm M}_\\odot) > 8.5$, which\nis consistent with the relationship found in \nlocal galaxies \\citep[e.g.,][]{2009MNRAS.398..949P,2013A&A...549A..25P}.   \nIn addition, some low-mass XMPs do show large N/O. The combination of low metallicity \nand high N/O can be understood if these galaxies suffered a major metal-poor gas \naccretion event that dropped O/H keeping N/O unchanged (see Sect.~\\ref{discussion} for more details).\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal2.eps}\n\\caption{\nScatter plot N/O vs stellar mass for the XMP galaxies in Table~\\ref{main_list}\n(symbols with error bars).  There is a clear tendency for N/O to increase\nwith increasing stellar mass when $\\log({\\rm M}_\\star/{\\rm M}_\\odot) > 8.5$.\n}\n\\label{masmetal2}\n\\end{figure}\n\nWe also find a correlation between reddening and stellar mass (Fig.~\\ref{masmetal3}).\nIt reflects the correlation between N/O and reddening (Fig.~\\ref{extinction}b), \ngiven the fact that N/O increases with increasing stellar mass (Fig.~\\ref{masmetal2}). \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal3.eps}\n\\caption{\nScatter plot reddening coefficient  vs stellar mass for the XMP galaxies in Table~\\ref{main_list}\n(symbols with error bars).  There is a tendency for the reddening to increase\nwith increasing stellar mass, however, the spread of reddening for a given stellar mass is large.   \nThe straight line has been included to guide the eye. \n}\n\\label{masmetal3}\n\\end{figure}\nWe note that none of the large N/O targets have $12+\\log({\\rm O/H}) > 7.5$ (Fig.~\\ref{distribution}a).\n\n\n\n\n\n\n\\subsection{Magnitudes and colors}\\label{cmd}\n\nFigure~\\ref{cmd_fig} shows the color magnitude diagram in the color filters $g$ and $r$.\nWe use Petrosian magnitudes of the integrated galaxias as provided by SDSS.\nThe figure includes the color threshold to be a blue compact dwarf galaxy as\ndefined by \\citet{2003ApJS..147...29G}\n\\citep[and transformed from U and B to $g$ and $r$ by][]{2008ApJ...685..194S}.\nMost XMPs lie below the threshold and thus look blue in broad-band colors.\nHowever, a significant part of them are not dwarf, with absolute magnitude \nin excess of $M_g\\simeq -18$. The fact that some of them are  not dwarfs is also inferred \nfrom the distribution of masses in Fig.~\\ref{masmetal}, which contains \ngalaxies having masses  larger than $10^9\\, {\\rm M}_\\odot$.  These high-mass XMPs often correspond to the most\ndistant objects, with redshifts above 0.05 and distances larger than 220 Mpc. \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal5.eps}\n\\caption{\nColor magnitude diagram of the XMPs.\nThe dotted line shows the color threshold to be a blue compact dwarf galaxy \naccording to \\citet{2003ApJS..147...29G}.\nMost XMPs are bluer than this threshold, however, many of them \nare not dwarfs; often $M_g\\leq -18$.  \n}\n\\label{cmd_fig}\n\\end{figure}\n\n\n\n\n\n\\subsection{Number density of XMPs in the local Universe}\\label{number_density}\n\n\nThe SDSS spectroscopic legacy sample  was designed\nas a  magnitude-limited survey. Therefore, \nit is relatively simple to correct for the luminosity~bias \n(i.e., the Malmquist~bias) and so, to compute  \nthe volume density of particular objects. In {Paper~I}\\  we carried out\nan estimate of the number density of XMPs in the local Universe.\nSince the number of XMPs has increased substantially from {Paper~I}, \nsuch an estimate has become obsolete, and is updated here. \n\nWe employ the so-called $V_{max}$ approximation by \n\\citet{1968ApJ...151..393S} used to, e.g., determine luminosity \nfunctions of galaxies \\citep[][]{2000ApJS..129....1T}. The number density\nof galaxies with the property $X$, $n(X)$, is just\n\n", "itemtype": "equation", "pos": 48927, "prevtext": "\n\n\n\n\n\n\\subsection{Stellar masses}\\label{masses}\n\n\nStellar masses are usually estimated  from photometry via models that provide the\n light-to-mass ratio (M/L) given the observed colors of a galaxy \n\\citep[e.g.,][]{2001ApJ...550..212B}.  This procedure is particularly uncertain for  \nbursting XMP galaxies,\n with spectra having intense emission lines that are hard to capture by the model\nused for M/L. However,  stellar mass is one of the central parameters characterizing \ngalaxies, therefore, even with the above  caveat in mind, we have analyzed \nphotometry-based stellar  masses of the XMP galaxies.\nWe use those from the  Max-Planck-Institute for Astrophysics -- Johns Hopkins University\n(MPA-JHU)\\footnote{{\\tt http://www.mpa-garching.mpg.de/SDSS/DR7/}}\ncharacterization of the SDSS-DR7 galaxy spectral data \n\\citep[][]{2004MNRAS.351.1151B,2007ApJS..173..267S}.\nBroad-band galaxy-integrated magnitudes from the SDSS-DR7 \ndatabase are  compared with a grid of theoretical \ngalaxy spectra \\citep{2003MNRAS.344.1000B} spanning a large range \nin star-formation histories \\citep{,2007ApJS..173..267S}. \nFrom the difference between observed and theoretical magnitudes,\n a likelihood distribution for the mass of each \ngalaxy is estimated. We use the median and the dispersion of this\n distribution in our analysis.\n\n\n\nThe observed stellar masses have a mean and a standard deviation of\n\n", "index": 17, "text": "\\begin{equation}\n\\mu_{\\rm \\log M_\\star}\\pm \\sigma_{\\rm \\log M_\\star}=8.0\\pm 1.1, \n\\label{mean_mass}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\mu_{\\rm\\log M_{\\star}}\\pm\\sigma_{\\rm\\log M_{\\star}}=8.0\\pm 1.1,\" display=\"block\"><mrow><mrow><mrow><msub><mi>μ</mi><mrow><mi>log</mi><mo>⁡</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⋆</mo></msub></mrow></msub><mo>±</mo><msub><mi>σ</mi><mrow><mi>log</mi><mo>⁡</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⋆</mo></msub></mrow></msub></mrow><mo>=</mo><mrow><mn>8.0</mn><mo>±</mo><mn>1.1</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwhere the sum includes all galaxies in the sample\nwith property $X$, and $V_i$ represents the maximum volume in \nwhich the $i$-th galaxy of the sample could be observed. \nIn a magnitude-limited sample, so that all galaxies brighter than the \napparent magnitude $m_{lim}$ are included,\n\n", "itemtype": "equation", "pos": 54479, "prevtext": "\nwhere the masses have been expressed in solar masses. \nThe XMPs are generally dwarfs, but there is a \nlarge spread in their possible masses -- \n${\\rm \\log(M_\\star/M_\\odot)}$ spans from 6 to 10.\nThis can be appreciated in Fig.~\\ref{masmetal}, which shows\nthe scatter plot metallicity vs stellar mass.\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal4.eps}\n\\caption{\nMetallicity vs stellar-mass scatter plot for the XMPs \nin Table~\\ref{main_list} (the symbols with error bars). \nAlthough XMPs tend to be low-mass, there is a large spread in stellar \nmasses.\n\nWhen galaxies are chosen independently of metallicity, their\nstellar masses and metallicities are related\n--  the solid line represents the mean correlation \nobserved and  parameterized by \\citet[][]{2013ApJ...765..140A}.\nThere is no relationship in the case of the XMPs.}\n\\label{masmetal}f\n\\end{figure}\nWe find no clear trend for the metallicity to vary with stellar mass.\nThis is forced by the selection criteria imposed on the XMPs.\nIn a randomly chosen set of galaxies, stellar masses and metallicities \nare correlated \\citep[e.g.,][]{2004ApJ...613..898T}. \nSuch relationship, as updated by  \\citet[][]{2013ApJ...765..140A},\nis included in Fig.~\\ref{masmetal}. \nBy construction, XMPs are restricted to have low metallicity and therefore \ncannot follow the general trend dictated by the red solid line in Fig.~\\ref{masmetal}.  \nHowever, hints of the underlying mass-metallicity relationship remains in the \nXMP sample, because\nthe lowest abundances are associated with galaxies in the low-mass part\nof the mass distribution (Fig.~\\ref{masmetal}). \n\nFigure~\\ref{masmetal2} shows the scatter plot N/O vs stellar mass.\nThere is a clear trend for N/O to increase with increasing stellar mass \nfor $\\log({\\rm M}_\\star/{\\rm M}_\\odot) > 8.5$, which\nis consistent with the relationship found in \nlocal galaxies \\citep[e.g.,][]{2009MNRAS.398..949P,2013A&A...549A..25P}.   \nIn addition, some low-mass XMPs do show large N/O. The combination of low metallicity \nand high N/O can be understood if these galaxies suffered a major metal-poor gas \naccretion event that dropped O/H keeping N/O unchanged (see Sect.~\\ref{discussion} for more details).\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal2.eps}\n\\caption{\nScatter plot N/O vs stellar mass for the XMP galaxies in Table~\\ref{main_list}\n(symbols with error bars).  There is a clear tendency for N/O to increase\nwith increasing stellar mass when $\\log({\\rm M}_\\star/{\\rm M}_\\odot) > 8.5$.\n}\n\\label{masmetal2}\n\\end{figure}\n\nWe also find a correlation between reddening and stellar mass (Fig.~\\ref{masmetal3}).\nIt reflects the correlation between N/O and reddening (Fig.~\\ref{extinction}b), \ngiven the fact that N/O increases with increasing stellar mass (Fig.~\\ref{masmetal2}). \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal3.eps}\n\\caption{\nScatter plot reddening coefficient  vs stellar mass for the XMP galaxies in Table~\\ref{main_list}\n(symbols with error bars).  There is a tendency for the reddening to increase\nwith increasing stellar mass, however, the spread of reddening for a given stellar mass is large.   \nThe straight line has been included to guide the eye. \n}\n\\label{masmetal3}\n\\end{figure}\nWe note that none of the large N/O targets have $12+\\log({\\rm O/H}) > 7.5$ (Fig.~\\ref{distribution}a).\n\n\n\n\n\n\n\\subsection{Magnitudes and colors}\\label{cmd}\n\nFigure~\\ref{cmd_fig} shows the color magnitude diagram in the color filters $g$ and $r$.\nWe use Petrosian magnitudes of the integrated galaxias as provided by SDSS.\nThe figure includes the color threshold to be a blue compact dwarf galaxy as\ndefined by \\citet{2003ApJS..147...29G}\n\\citep[and transformed from U and B to $g$ and $r$ by][]{2008ApJ...685..194S}.\nMost XMPs lie below the threshold and thus look blue in broad-band colors.\nHowever, a significant part of them are not dwarf, with absolute magnitude \nin excess of $M_g\\simeq -18$. The fact that some of them are  not dwarfs is also inferred \nfrom the distribution of masses in Fig.~\\ref{masmetal}, which contains \ngalaxies having masses  larger than $10^9\\, {\\rm M}_\\odot$.  These high-mass XMPs often correspond to the most\ndistant objects, with redshifts above 0.05 and distances larger than 220 Mpc. \n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{masmetal5.eps}\n\\caption{\nColor magnitude diagram of the XMPs.\nThe dotted line shows the color threshold to be a blue compact dwarf galaxy \naccording to \\citet{2003ApJS..147...29G}.\nMost XMPs are bluer than this threshold, however, many of them \nare not dwarfs; often $M_g\\leq -18$.  \n}\n\\label{cmd_fig}\n\\end{figure}\n\n\n\n\n\n\\subsection{Number density of XMPs in the local Universe}\\label{number_density}\n\n\nThe SDSS spectroscopic legacy sample  was designed\nas a  magnitude-limited survey. Therefore, \nit is relatively simple to correct for the luminosity~bias \n(i.e., the Malmquist~bias) and so, to compute  \nthe volume density of particular objects. In {Paper~I}\\  we carried out\nan estimate of the number density of XMPs in the local Universe.\nSince the number of XMPs has increased substantially from {Paper~I}, \nsuch an estimate has become obsolete, and is updated here. \n\nWe employ the so-called $V_{max}$ approximation by \n\\citet{1968ApJ...151..393S} used to, e.g., determine luminosity \nfunctions of galaxies \\citep[][]{2000ApJS..129....1T}. The number density\nof galaxies with the property $X$, $n(X)$, is just\n\n", "index": 19, "text": "\\begin{equation}\nn(X)=\\sum_i{1\\over {V_i}},\n\\label{pi_eq}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"n(X)=\\sum_{i}{1\\over{V_{i}}},\" display=\"block\"><mrow><mrow><mrow><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mfrac><mn>1</mn><msub><mi>V</mi><mi>i</mi></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwith $\\Omega$ the solid angle covered by the survey, and \n$d_i$ the maximum distance at which the $i-$th galaxy can\nbe observed,\n\n", "itemtype": "equation", "pos": 54837, "prevtext": "\nwhere the sum includes all galaxies in the sample\nwith property $X$, and $V_i$ represents the maximum volume in \nwhich the $i$-th galaxy of the sample could be observed. \nIn a magnitude-limited sample, so that all galaxies brighter than the \napparent magnitude $m_{lim}$ are included,\n\n", "index": 21, "text": "\\begin{equation}\nV_i={{d_i^3}\\over{3}}\\Omega,\n\\label{pi_eq7}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"V_{i}={{d_{i}^{3}}\\over{3}}\\Omega,\" display=\"block\"><mrow><mrow><msub><mi>V</mi><mi>i</mi></msub><mo>=</mo><mrow><mfrac><msubsup><mi>d</mi><mi>i</mi><mn>3</mn></msubsup><mn>3</mn></mfrac><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nThe maximum distance depends on the absolute magnitude of the galaxy,\nwhich can we written in terms of the distance to the \ngalaxy, $l_i$, and the apparent magnitude, $m_i$, as it has been done for  \nEq.~(\\ref{pi_eq8}). \n\nA few caveats are in order before applying \nEq.~(\\ref{pi_eq}) to the dataset. \nSDSS is not truly magnitude limited for a number of reasons.\nSome bright galaxies are not observed in crowded field due to\nfiber collision \\citep[see][]{2002AJ....123..485S}. Low surface brightness galaxies \ntend to be missed even if they have significant integrated magnitudes\n \\citep[e.g.,][]{2005ApJ...631..208B,2015MNRAS.448.2687J}. \nThe actual galaxy catalog sample also contain objects coming from\ncomplementary  SDSS searches, which often are fainter than the \nmagnitude limit of the main survey. \nThe first problem is of no relevance since most observed \nXMP galaxies are isolated \\citep[][]{2015ApJ...802...82F}.\n\nThe second problem is likely more serious since very faint galaxies\ntend to have low surface brightness as well \\citep{1999ASPC..170..169S}.\nQuiescent\nXMP galaxies like Leo P \\citep{2013AJ....146....3S} or KJ~78 \n\\citep{2015MNRAS.448.2687J} show a surface brightness around \n24~mag\\,arsec$^{-2}$, and objects like them would hardly \nappear in our selection since SDSS is almost blind at this low surface \nbrightness \\citep{2005ApJ...631..208B}. As it is discussed in the introduction \nof the paper, \n\n\nwe bypass the problem dividing  XMPs into quiescent and \nbursting. Our search in SDSS is sensitive to the bursting XMPs \nonly, and so are the properties derived here. This also holds for the  number density to \nbe inferred assuming a magnitude limited sample. \n\n\n\n\n\nThe third caveat, namely the existence of XMPs from complementary \nsearches, is also  \nan issue since a significant part of our XMPs \nbelong to these additional catalogs. We solve this problem by applying \nEq.~(\\ref{pi_eq8}) only to those XMPs with $m_i < m_{lim}$. Using\n$m_{lim}=17.8$ in the filter $r$, then Eqs.~(\\ref{pi_eq}), (\\ref{pi_eq7}), \nand (\\ref{pi_eq8}) render\n\n", "itemtype": "equation", "pos": 55042, "prevtext": "\nwith $\\Omega$ the solid angle covered by the survey, and \n$d_i$ the maximum distance at which the $i-$th galaxy can\nbe observed,\n\n", "index": 23, "text": "\\begin{equation}\n\\log(d_{i}/l_i)= {{1}\\over{5}}(m_{lim}-m_i).\n\\label{pi_eq8}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\log(d_{i}/l_{i})={{1}\\over{5}}(m_{lim}-m_{i}).\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>d</mi><mi>i</mi></msub><mo>/</mo><msub><mi>l</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mn>5</mn></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mrow><mi>l</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>-</mo><msub><mi>m</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwith the error bar considering only the poissonian error associated\nwith the process of galaxy counting.\n\nThe density in equation~(\\ref{actual_density}) is larger than the density obtained \nfrom the sample in {Paper~I}, which is consistent with \nthe fact that the present work contains almost ten times more targets.\nIn terms of the total number of galaxies, XMPs represent some 2\\,\\% of\nall galaxies in a given local volume. The number density of galaxies \nin the local universe, $\\sim 0.17\\,{\\rm Mpc^{-3}}$, has been taken from the \nnormalization of the total $r$-band luminosity function of SDSS galaxies\n by \\citet{2005ApJ...631..208B},\nwhich includes galaxies brighter than absolute magnitude -12.\nEven with a significant increase\nwith respect to the previous estimate in {Paper~I}, XMP galaxies are still \nrare.  \n\n\n\n\n\n\n\n\\subsection{Low-metallicity threshold}\\label{threshold}\n\nOne of the puzzling properties of XMP galaxies is the existence \nof a threshold for the lowest metallicity. This threshold is also present\nin the XMPs revealed here. Figures~\\ref{distribution}a and \\ref{distribution}b \nshow that \n\n", "itemtype": "equation", "pos": 57200, "prevtext": "\nThe maximum distance depends on the absolute magnitude of the galaxy,\nwhich can we written in terms of the distance to the \ngalaxy, $l_i$, and the apparent magnitude, $m_i$, as it has been done for  \nEq.~(\\ref{pi_eq8}). \n\nA few caveats are in order before applying \nEq.~(\\ref{pi_eq}) to the dataset. \nSDSS is not truly magnitude limited for a number of reasons.\nSome bright galaxies are not observed in crowded field due to\nfiber collision \\citep[see][]{2002AJ....123..485S}. Low surface brightness galaxies \ntend to be missed even if they have significant integrated magnitudes\n \\citep[e.g.,][]{2005ApJ...631..208B,2015MNRAS.448.2687J}. \nThe actual galaxy catalog sample also contain objects coming from\ncomplementary  SDSS searches, which often are fainter than the \nmagnitude limit of the main survey. \nThe first problem is of no relevance since most observed \nXMP galaxies are isolated \\citep[][]{2015ApJ...802...82F}.\n\nThe second problem is likely more serious since very faint galaxies\ntend to have low surface brightness as well \\citep{1999ASPC..170..169S}.\nQuiescent\nXMP galaxies like Leo P \\citep{2013AJ....146....3S} or KJ~78 \n\\citep{2015MNRAS.448.2687J} show a surface brightness around \n24~mag\\,arsec$^{-2}$, and objects like them would hardly \nappear in our selection since SDSS is almost blind at this low surface \nbrightness \\citep{2005ApJ...631..208B}. As it is discussed in the introduction \nof the paper, \n\n\nwe bypass the problem dividing  XMPs into quiescent and \nbursting. Our search in SDSS is sensitive to the bursting XMPs \nonly, and so are the properties derived here. This also holds for the  number density to \nbe inferred assuming a magnitude limited sample. \n\n\n\n\n\nThe third caveat, namely the existence of XMPs from complementary \nsearches, is also  \nan issue since a significant part of our XMPs \nbelong to these additional catalogs. We solve this problem by applying \nEq.~(\\ref{pi_eq8}) only to those XMPs with $m_i < m_{lim}$. Using\n$m_{lim}=17.8$ in the filter $r$, then Eqs.~(\\ref{pi_eq}), (\\ref{pi_eq7}), \nand (\\ref{pi_eq8}) render\n\n", "index": 25, "text": "\\begin{equation}\nn\\big({\\rm O/H} \\leq {1\\over {10}}\\,{\\rm O/H}_\\odot)= \n(3.4\\pm 0.9)\\,\\times 10^{-3}\\,{\\rm Mpc^{-3}},\n\\label{actual_density}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"n\\big{(}{\\rm O/H}\\leq{1\\over{10}}\\,{\\rm O/H}_{\\odot})=(3.4\\pm 0.9)\\,\\times 10^%&#10;{-3}\\,{\\rm Mpc^{-3}},\" display=\"block\"><mrow><mi>n</mi><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mi mathvariant=\"normal\">O</mi><mo>/</mo><mi mathvariant=\"normal\">H</mi><mo>≤</mo><mpadded width=\"+1.7pt\"><mfrac><mn>1</mn><mn>10</mn></mfrac></mpadded><mi mathvariant=\"normal\">O</mi><mo>/</mo><msub><mi mathvariant=\"normal\">H</mi><mo>⊙</mo></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><mo stretchy=\"false\">(</mo><mn>3.4</mn><mo>±</mo><mn>0.9</mn><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>×</mo><mpadded width=\"+1.7pt\"><msup><mn>10</mn><mrow><mo>-</mo><mn>3</mn></mrow></msup></mpadded><msup><mi>Mpc</mi><mrow><mo>-</mo><mn>3</mn></mrow></msup><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwhich approximately corresponds to 1/40 times the oxygen abundance in the \nsolar composition. This value is similar to, although slightly higher than,  \nthe record-breaking  low-abundance galaxy SBS0335-052W \n\\citep[$12+\\log({\\rm O/H})\\simeq 7.0$, corresponding to 1/50th of the solar \ncomposition;][]{2009A&A...503...61I}.\n\n\nThe reason why such a threshold exists is still a riddle.\nThe metallicity of the gas produced during the Big Bang is virtually \nmetal-free, and population III stars contaminate the inter-galactic \nmedium with a metallicity lower than $10^{-4}$ times the solar metallicity\n\\citep[e.g.,][]{2004ARA&A..42...79B}.\nOne can envisage that some of the galaxies formed from this \npristine gas have been so dull forming stars that they still \nretain part of the original gas. Why none of these {\npristine galaxies is producing stars at present? \nSeveral explanations have been offered in the literature, going from  \nthe self-enrichment of the HII region used for measuring, to  \ntechnical difficulties for metallicity determinations below the threshold\n\\citep[see][]{2011EAS....48...95K}.\nOne additional possibility is offered by the cosmic-web gas-accretion scenario,\nwhere the starbursts in XMPs are triggered by gas recently accreted \nfrom the cosmic web \\citep[see ][and references therein]{2014A&ARv..22...71S}. \nNumerical simulations predict the cosmic web gas to accumulate metals from the \nmetal-enriched outflows of dwarf galaxies. These metals add up along the Hubble time \nso that at redshift zero the cosmic-web metallicity is predicted to have a value close\nto the observed threshold \\citep[e.g.,][]{2012MNRAS.420..829O}. \nShould this explanation were correct, then the observational lower limit is tracing the \nmetal content of the cosmic web at present.\n\n\n\n\\subsection{Morphology}\\label{morphology}\n\n\\citet{2008A&A...491..113P}, {Paper~I} , and later \\citet{2013A&A...558A..18F}  pointed\nout that bursting XMPs \ntend to be cometary or tadpole-like. Such association between \nmetallicity and morphology is notable since metallicity is a property  dictated \nby the spectrum and, therefore, it implies that the spectrum conditions \nthe morphology of the galaxy. \n\nIn order to check whether the new sample of XMPs maintains this \npreference for the cometary shape, we repeated the eyeball classification\ncarried out by  \\citet{2013A&A...558A..18F}, which was based on the\nscheme presented in {Paper~I} . The galaxies may be (1) {\\em symmetric}\nif they present a centrally concentrated emission with no obvious \nstructure in the outskirts,  (2) {\\em cometary}  for a head-tail structure with \nan identifiable knot at the head, (3) {\\em 2-knot}  for a structure with two knots,\nand (4) {\\em multi-knot} for a diffuse structure with multiple star-formation knots,\nincluding irregular galaxies. \nFigure~\\ref{classes_mph} illustrates these classes with two examples of \neach galaxy morphology.\n\\begin{figure*}\n\n\n\\includegraphics[clip,width=4.3cm]{come1.eps}\\hspace{0.12cm}\n\\includegraphics[clip,width=4.3cm]{single2.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{multi1.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{two1.eps}\\\\\n\\vspace{-2.mm}\\\\\n\\includegraphics[clip,width=4.3cm]{come2.eps}\\hspace{0.05cm}\n\\includegraphics[clip,width=4.3cm]{single1.eps}\\hspace{0.08cm}\n\\includegraphics[clip,width=4.3cm]{multi2.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{two2.eps}\\\\\n\\caption{Examples of the various morphological types found \namong the XMPs; from left to right cometary, symmetric, multi-knot, and \ntwo-knot (see main text for details). The bar on top of each image \ngives an angular scale on the sky. The image on the top-left panel also \npoints out north and east, which are common to all \nimages. Galaxy images are from SDSS-DR12. The two-knot example on \nthe upper row corresponds to IZw18.}\n\\label{classes_mph}\n\\end{figure*}\nWe use color images from SDSS for the visual inspection, and \nthe result of the classification turns out to be,\n\n", "itemtype": "equation", "pos": 58470, "prevtext": "\nwith the error bar considering only the poissonian error associated\nwith the process of galaxy counting.\n\nThe density in equation~(\\ref{actual_density}) is larger than the density obtained \nfrom the sample in {Paper~I}, which is consistent with \nthe fact that the present work contains almost ten times more targets.\nIn terms of the total number of galaxies, XMPs represent some 2\\,\\% of\nall galaxies in a given local volume. The number density of galaxies \nin the local universe, $\\sim 0.17\\,{\\rm Mpc^{-3}}$, has been taken from the \nnormalization of the total $r$-band luminosity function of SDSS galaxies\n by \\citet{2005ApJ...631..208B},\nwhich includes galaxies brighter than absolute magnitude -12.\nEven with a significant increase\nwith respect to the previous estimate in {Paper~I}, XMP galaxies are still \nrare.  \n\n\n\n\n\n\n\n\\subsection{Low-metallicity threshold}\\label{threshold}\n\nOne of the puzzling properties of XMP galaxies is the existence \nof a threshold for the lowest metallicity. This threshold is also present\nin the XMPs revealed here. Figures~\\ref{distribution}a and \\ref{distribution}b \nshow that \n\n", "index": 27, "text": "\\begin{equation}\n12+\\log({\\rm O/H}) \\gtrsim 7.1,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"12+\\log({\\rm O/H})\\gtrsim 7.1,\" display=\"block\"><mrow><mrow><mn>12</mn><mo>+</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">O</mi><mo>/</mo><mi mathvariant=\"normal\">H</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\gtrsim</mtext></merror><mo>⁢</mo><mn>7.1</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nIn agreement with previous estimates, cometary happens to be the dominant shape.\nAsymmetric shapes (i.e., cometary plus 2-knot plus multi-knot) represent 71\\,\\% of the\nsample. These results are in quantitative agreement with {Paper~I} , where 75\\% of the targets \nare asymmetric, and with \\citet{2013A&A...558A..18F}, where \ncometary, multi-knot and 2-knot represented 52\\,\\% , 16\\%, and 10\\% of the XMP sample, \nrespectively.\nPerhaps the main difference is a slight excess of symmetric targets in the present\nsample, which we attribute to insufficient spatial resolution since our targets \nhave larger redshifts than the other samples (Sect.~\\ref{cmd}), thus complicating\nthe detection of sub-structure. In addition, this time we include a 5th class\nto the classification ({\\em others} in Eq.~[\\ref{morpho}]) to collect objects that \ndo not fit in the main categories easily (e.g., mergers, or elongated galaxies\nwithout an identifiable knot).\nIn addition, two of the objects are HII regions in the outskirts \nof large spirals (\\#\\,20 and 59).  \n\nWe note that a significant part of the symmetric objects looks\nlike the {\\em green peas} first described by \n\\citet{2009MNRAS.399.1191C}. One example is shown in Fig.~\\ref{classes_mph} --\nthe blue symmetric galaxy J1423+22.\nDepending on the redshift, green-pea like galaxies may look green, pink or blue in SDSS\nimages \\citep{2013RMxAC..42..111S}. The identification of green peas with\nmetal-poor galaxies was carried out by  \n\\citet{2010ApJ...715L.128A,2012ApJ...749..185A},\nand their rounded morphology seems to be associated \nwith limitations in spatial resolution rather than being\nintrinsic \\citep[e.g.,][]{2014A&A...568L...8A}.\nThe finding of green peas in our sample is encouraging since \nit naturally connects local XMPs to those expected at higher \nredshifts, which will appear in surveys deeper than SDSS-DR7 \n(e.g., eBOSS\\footnote{eBOSS stands for extended baryon oscillation spectroscopic survey,\nand a description can be found in {\\tt http://www.sdss.org/surveys/eboss/}.\n} within SDSS IV).\n\n\n\n\n\\subsection{Underlying stellar populations}\\label{agess}\n\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{ages.eps}\n\\caption{\nMass-weighted stellar age vs light-weighted stellar age for the \nXMPs, both derived using {\\sc starlight} (Sect.~\\ref{fluxes}). \nThe light-weighted mean is biased toward the younger \nstellar populations, whereas the mass-weighted mean is not.\nThe vertical dashed line shows a  light-weighted stellar age of 1 Gyr.\nNote that most XMPs are to the left of this threshold and thus\npresent a stellar spectrum typical of young stellar populations.\nThe horizontal dashed line shows a  mass-weighted stellar age of \n1 Gyr. Most XMPs are above this line implying that, despite their \nseemingly young spectrum, XMPs also contain aged stellar \npopulations -- often 10\\,Gyr old.\nThe ages in the axes are given in Gyr, and \nthe slanted solid line corresponds to the one-to-one \nrelationship.\n}\n\\label{ages}\n\\end{figure}\nIn order to decontaminate the emission-line fluxes from stellar \nabsorption,  we fitted a composite stellar spectrum to the observed \ncontinuum (Sect.~\\ref{fluxes}). As byproduct of this exercise, \nwe have information on the stellar populations co-existing with the \ngas responsible for the emission line spectrum. The stellar-population \ndecomposition is not free from uncertainties and degeneracies,\nhowever, it suffices to provide a general view of the stellar\nproperties \\citep[e.g.,][]{2005MNRAS.358..363C,2014A&A...561A.130C}.  \n\nWe find that the underlying stellar populations are generally young, \nalthough in almost all cases there are also old stellar components\ncontributing to the observed spectrum. This can be appreciated in \nFig.~\\ref{ages}, which shows the mass-weighted stellar age\nversus the light-weighted stellar age for the set of XMPs. \nThe light-weighted mean is strongly biased toward young \nstars, and we find that most light-weighted ages are younger than \n1\\,Gyr (i.e., they are to the left of the vertical dashed line in \nFig.~\\ref{ages}). The \nmass-weighted mean,\nhowever, does not suffer from this bias, and most XMPs have \nmass-weighted ages significantly larger than 1\\,Gyr (i.e., they\nare above the horizontal  dashed line in Fig.~\\ref{ages}). In other words,\nmost XMPs seem to have been forming stars not only at present\nbut also during the last Gyr. On top of this recent star-formation, most\nof them contain old stars, often as old as 10\\,Gyr or so.  \nThe fact that the class of XMP galaxies contains evolved stellar \npopulations is by no means unknown (see Sect.~\\ref{introduction}). \nTheir large difference between mass-weighted age and \nlight-weighted age is common to most local star-forming \ngalaxies  \\citep[e.g.,][]{2010MNRAS.404.2037P,2012ApJ...756..163S}.\n\n\n\n\n\\subsection{Large scale environment}\\label{environment}\n\n\nAs it was done by \\citet{2015ApJ...802...82F} for the XMPs in {Paper~I} ,\nwe have explored the large scale environment of the new list of \nbursting XMPs\nusing constrained N-body cosmological numerical simulations of\nthe local universe \\citep{2014MNRAS.445..988N}.  \nThe cosmological parameters provide a statistical description of the \nUniverse. The constrained simulation that we use \nselects a particular realization of the current cosmological model \nthat reproduces the spatial distribution of galaxies in the local universe as observed  by \n2MRS\\footnote{The 2MASS Redshift Survey (2MRS) is the spectroscopic follow-up \nof the two micron all sky survey 2MASS which provides a 3D distribution \nof local galaxies -- RA, DEC and redshift.} \n\\citep[][]{2012ApJS..199...26H}. \nThe method is based on a self-consistent Bayesian machine-learning\nalgorithm, and it provides a description of the local cosmic web\ndark matter with a resolution around 2~Mpc in a box of 180~Mpc$\\,h^{-1}$ side\n\\citep{2012MNRAS.427L..35K, 2013MNRAS.435.2065H, 2013MNRAS.429L..84K}.\nThis simulation, tuned to replicate the local distribution of galaxies,\ntell us whether the gravitational field at each point forces the matter to collapse \nin three directions (knot), in two directions (filament), in one direction (sheet),\nor if the matter is expanding in all three directions (void). This classification,\nbased on the local gravitational potential, correlates very \nwell with the local dark-matter overdensity, which increases from voids to knots.\n\nThe tendency of a particular type of galaxy to prefer one of the four \nenvironments is quantified in terms of the excess probability ratio $\\eta(\\tau,\\epsilon)$,\ndefined as the ratio between the probability that a galaxy of type $\\tau$ \nappears in environment $\\epsilon$, and the probability of having \nany type of galaxy in this environment. The excess probability \nfor the XMPs is shown in Fig.~\\ref{constrained}. For reference,\nthe figure also includes the excess probability for ellipticals (E),\nlenticulars (SO), spirals (Sp) and irregulars (Irr) as worked out \nfrom 2MRS galaxies by \\citet{2014MNRAS.445..988N}.\nClearly, XMPs have a strong tendency to appear in voids and \nto avoid knots. This tendency is more clear in XMPs than in \nany of the other galaxy types.\n\n\\begin{figure*}\n\n\n\n\n\\includegraphics[width=0.5\\textwidth]{Knots_XMP2s.eps}\n\\includegraphics[width=0.5\\textwidth]{Filaments_XMP2s.eps}\\\\\n\\includegraphics[width=0.5\\textwidth]{Sheets_XMP2s.eps}\n\\includegraphics[width=0.5\\textwidth]{Voids_XMP2s.eps}\n\n\\caption{Excess probability ratio for the XMPs.  E, S0, Sp, and Irr galaxies\nare also included for reference (see main text for details). \nThe four panels correspond to the four types of environments: \nvoids, sheets,  filaments, and knots. XMPs have a strong tendency to appear in voids and \nto avoid knots.}\n\\label{constrained}\n\\end{figure*}\nThese results are very similar to those found by \\citet{2015ApJ...802...82F}\nfor the XMPs in  {Paper~I} . \n\n\n\n\n\n\\section{Discussion and conclusions}\\label{discussion}\n\nDue to their astrophysical interest and rareness (Sect.~\\ref{introduction}), we have \ncarried  out a  systematic search for XMP galaxies in SDSS-DR7. \nStarting from all \ngalaxies with spectra having redshift smaller than 0.25,\nwe end up with a list of only {196}\\ XMPs (Table~\\ref{main_list}). \nWe select galaxies having [OIII]$\\lambda$4363 particularly intense\nwith respect to [OIII]$\\lambda$4959 and [OIII]$\\lambda$5007.\nAs it is explained in Sect.~\\ref{kmeanssearch}, this implies having \na high temperature gas and, since metals are efficient coolants, it is\nthe fingerprint of low-metallicity gas.  A first automated search was carried \nout using k-means to classify all galaxy spectra according to \nthe shape  in the region that contains  [OIII]$\\lambda$4363\nand [OIII]$\\lambda\\lambda$4959,5007. The  {1281}\\ objects \nin the classes of high [OIII]$\\lambda$4363 underwent\na closer scrutiny by\ncomputing their O abundance using the method by \n\\citet[][Sect.~\\ref{hcm}]{2014MNRAS.441.2663P}, which is a model-based \napproach consistent with the direct method. Those with abundance \nsmaller than one tenth of the solar value ended up in the \nfinal list (Table~\\ref{main_list}). The existence of \nuncertainty in the metallicity determination, typically 0.17\\,dex, implies that some of the\nXMPs are false positives, and some of the discarded  targets are\nfalse negatives (Appendix~\\ref{appendix}). \nWe offer a second list with {332}\\ XMP \ncandidates (Table~\\ref{candidates}), selected under less restrictive \nnoise conditions, which contains objects that upon refinement of \nthe metallicity estimate may turn out to be XMPs. The search in the\npresent paper is complementary to the one carried out in {Paper~I}\\ , \nwhere k-means is used in the spectral region around H$\\alpha$, \nwhere the metal-poor signpost is the weakening of \n[NII]$\\lambda$6549 and [NII]$\\lambda$6583 with respect to H$\\alpha$. \nFrom the {196}\\ galaxies in Table~\\ref{main_list}, only \n31 are known as inferred\nby comparison with the compilation carried out in {Paper~I} , and with \nthe new targets in \\citet{2012A&A...546A.122I}. The remaining 165 \nobjects seem to be new members of the XMP class.\nAmong the unknown members, 18 have  $12+\\log({\\rm O/H}) \\le 7.50$.\n\nAs part of the procedure to measure O/H, we also determine\nthe ratio N/O (Sect.~\\ref{hcm}). Closed-box stellar evolution over long\ntimescales  \npredicts $\\log({\\rm N/O})$ to be of the order -1.5 \nat low metallicity, and when $12+\\log({\\rm O/H}) > 8$ it increases \nlinearly with increasing metallicity reaching $\\simeq -1.0$ \nat solar metallicity \\citep[e.g.,][]{1999PASP..111..919H,2005A&A...434..531K}.\nMost XMPs have N/O consistent with the value expected at low metallicity, however, \na number  of them shows $\\log({\\rm N/O})\\simeq -1.0$ or even larger \n(Figs.~\\ref{distribution}a  and \\ref{masmetal2}).  Metal-poor \ngalaxies with $\\log({\\rm N/O})\\simeq -1.0$ are not very common, but \nexamples do exist in the literature. For instance, the so-called \n {\\em green-pea} galaxies have high N/O despite their low metallicity\n\\citep[][; we have  several such green peas among our XMP galaxies --  \nsee Sect.~\\ref{morphology}]{2010ApJ...715L.128A,2012ApJ...754L..22A}. \nMoreover, some of the classical XMPs\nalso show enhanced N/O \\citep{2014ApJ...797...81M}.\nXMPs with large N/O do not appear in {Paper~I} ,\nsince we selected galaxies having weak N lines and so\nour search was biased toward XMPs of low N/O . \nA simple interpretation for having both large N/O and low O/H is the \naccretion of significant amounts of metal-poor gas onto \ngalaxies having solar metallicity inter-stellar medium \n\\citep[ISM; e.g.,][and references therein]{2010ApJ...715L.128A}. \nThe mixing of metal-poor gas with pre-existing metal-rich gas \ndrops down the metallicity (i.e., increases H in O/H), but it does \nnot modify the original N/O, which remains as for a metal-rich ISM.\nSome 10\\,\\%\\ of the XMPs have $\\log({\\rm N/O}) \\geq -1.2$,\nrepresenting objects where the accretion of metal-poor gas\nis arguably part of their star-formation history.\nNote that accretion will remain unnoticed when the pre-existing \nISM presents low N/O.\n\nInterpreting N/O as a tracer of previous star-formation episodes\nis consistent with the trend we observe for the reddening to increase with \nincreasing N/O (Fig.~\\ref{extinction}b). The correlation\nnaturally arises if part of the dust responsible for extinction was\nproduced together with the N and O in previous star formation \nepisodes.\n\nWe quantify the global properties of the XMPs.\n\nThey have a mean stellar mass around $10^8\\,{\\rm M}_\\odot$,\nbut with very large scatter going from  $10^6\\,{\\rm M}_\\odot$ to  \n$10^{10}\\,{\\rm M}_\\odot$, therefore some of them are fairly massive  \n(Sect.~\\ref{masses}).\n\nWe find that both N/O and extinction increase with increasing \nstellar mass, so that the contribution of evolved stellar populations to\nthe metal content and dust is more important in massive galaxies.  \n\nFrom the reddening of the emission line spectrum we infer\nthe dust-mass column density to be around 0.2\\,${\\rm M_\\odot\\, pc^{-2}}$,\nwhich renders a very moderate extinction coefficient (Sect.~\\ref{reddening}).\nFor typical star-forming region size, the dust mass is between \n200 and 20,000 ${\\rm M}_\\odot$. \n\nWe analyze the morphology of the XMPs, finding results in the line \nof previous studies showing a strong tendency for the XMPs to be\ntadpole-like or cometary \n(\\citeauthor{2008A&A...491..113P}~\\citeyear{2008A&A...491..113P};\n{Paper~I} ;\n\\citeauthor{2013A&A...558A..18F}~\\citeyear{2013A&A...558A..18F}).\nExplicitly, 71\\,\\%\\ are cometary or knotted, and only 23\\,\\%\\ of them\nare symmetric  (see Sect.~\\ref{morphology}).\n\nAs a by-product of the procedure to determine gas phase metallicity,\nwe fit the observed continuum spectrum as a superposition of \nsingle stellar populations of varied ages and metallicities. According to such \ndecomposition, the XMPs are characterized by a fairly young stellar \nspectrum ($< 1\\,{\\rm Gyr}$), although young and aged stellar populations \nco-exists at the low-metallicity starbursts (Sect.~\\ref{agess}).\n\n\nSince the parent sample used to select the XMPs is \nlimited in apparent magnitude, it is relatively simple to\nestimate the number density of XMPs in the local Universe.\nWe worked it out in Sect.~\\ref{number_density}, finding some $3.4\\times 10^{-3}$\nXMPs per cubic Mpc (Eq.~[\\ref{actual_density}]).\nThis density is significantly larger than the density \nobtained from the sample in {Paper~I}, and it represents some 2\\,\\% of\nall galaxies in a volume. \n\nWe also work out the large-scale environment of the XMPs using \nconstrained cosmological numerical simulations (Sect.~\\ref{environment}).\nXMPs have a strong tendency to appear in voids and to avoid cluster \nenvironments.\n\nOne of the most intriguing properties of XMPs is the existence of a\nlower limit metallicity, of the order of  2\\,\\%\\ the solar metallicity.\nThe limit remains in our list (Sect.~\\ref{threshold}),\ndespite the fact that the sample is significantly larger than previous\none, and that we have systematically search the full SDSS \nspectroscopic sample. One of the ways out is, once again, \nthe infall of inter-galactic gas feeding the star-formation process.  \nThe inter-galactic gas\ncollects metals ejected from galaxies along the Hubble \ntime, which yields a small but non-zero metallicity expected to be \naround the value of the observed threshold \n\\citep[][and references therein]{2014A&ARv..22...71S}.    \n\nA caveat to keep in mind is that any search for XMPs based \non optical surveys, such as the one we present, \noverlooks faint low surface brightness galaxies. \nWe are sensitive to star-bursting XMPs (see Sect.~\\ref{introduction}).\nAs pointed out \nby, e.g., \\citeauthor{2013AJ....146....3S}~(\\citeyear{2013AJ....146....3S}; see also \nSect.~\\ref{introduction}),\nmost XMPs may be low surface brightness quiescent XMPs,\nso that to identify them\none would have to resort to blind HI surveys like the  \nArecibo Legacy Fast ALFA Survey \\citep[ALFALFA;][]{2011AJ....142..170H}\nthat led to the discovery of Leo~P \\citep{2013AJ....146...15G}.\n\n\n\\acknowledgements\n\nThanks are due to \n\nAmanda del Olmo for pinpointing repetitions in the original list of objects, \n\nto Andr\\'es Asensio-Ramos for assistance with the estimate of false positives and \nnegatives,\n\nto Mercedes Filho for enlightening discussions and suggestions on various \naspects of the work, \n\nto Steffen He{\\ss} for help with the simulations used in Sect.~\\ref{environment},\n\nand \nto Ricardo Amor\\'\\i n and Jos\\'e V\\'\\i lchez for a critical reading of the original manuscript.\n\n\nThanks are also due to an anonymous referee for pointing out the \nneed to explicitly mention the existence of \nbursting and quiescent XMPs, \nand to Evan Skillman for fruitful discussions on the issue.\n\n\n\n\n\nThis work has been partly funded by the Spanish Ministry of Economy and \nCompetitiveness, project {\\em Estallidos} AYA2013--47742--C4--2--P.\n\nRGB acknowledges support from the \nSpanish Ministerio de Ciencia e InnovacioÌ\u0081n under grant AYA2010-15081.\n\nSEN acknowledges support by the Deutsche Forschungsgemeinschaft under the grant NU 332/2-1.\n\nFunding for SDSS, SDSS-II, and  SDSS-III has been provided by the Alfred P. Sloan Foundation, \nthe Participating Institutions, the National Science Foundation, \nand the U.S. Department of Energy Office of Science.\n\nThe {\\sc starlight}  project is supported by the Brazilian agencies \nCNPq, CAPES and FAPESP and by the France-Brazil CAPES/Cofecub\nprogram.\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{aa}\n\\begin{thebibliography}{106}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Abazajian} {et~al.}(2009){Abazajian}, {Adelman-McCarthy},\n  {Ag{\\\"u}eros}, {Allam}, {Allende Prieto}, {An}, {Anderson}, {Anderson},\n  {Annis}, {Bahcall}, \\& et~al.}]{2009ApJS..182..543A}\n{Abazajian}, K.~N., {Adelman-McCarthy}, J.~K., {Ag{\\\"u}eros}, M.~A., {et~al.}\n  2009, \\apjs, 182, 543\n\n\\bibitem[{{Aloisi} {et~al.}(2007){Aloisi}, {Clementini}, {Tosi}, {Annibali},\n  {Contreras}, {Fiorentino}, {Mack}, {Marconi}, {Musella}, {Saha}, {Sirianni},\n  \\& {van der Marel}}]{2007ApJ...667L.151A}\n{Aloisi}, A., {Clementini}, G., {Tosi}, M., {et~al.} 2007, \\apjl, 667, L151\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2012{\\natexlab{a}}){Amor{\\'{\\i}}n},\n  {P{\\'e}rez-Montero}, {V{\\'{\\i}}lchez}, \\& {Papaderos}}]{2012ApJ...749..185A}\n{Amor{\\'{\\i}}n}, R., {P{\\'e}rez-Montero}, E., {V{\\'{\\i}}lchez}, J.~M., \\&\n  {Papaderos}, P. 2012{\\natexlab{a}}, \\apj, 749, 185\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2014){Amor{\\'{\\i}}n}, {Sommariva},\n  {Castellano}, {Grazian}, {Tasca}, {Fontana}, {Pentericci}, {Cassata},\n  {Garilli}, {Le Brun}, {Le F{\\`e}vre}, {Maccagni}, {Thomas}, {Vanzella},\n  {Zamorani}, {Zucca}, {Bardelli}, {Capak}, {Cassar{\\'a}}, {Cimatti}, {Cuby},\n  {Cucciati}, {de la Torre}, {Durkalec}, {Giavalisco}, {Hathi}, {Ilbert},\n  {Lemaux}, {Moreau}, {Paltani}, {Ribeiro}, {Salvato}, {Schaerer}, {Scodeggio},\n  {Talia}, {Taniguchi}, {Tresse}, {Vergani}, {Wang}, {Charlot}, {Contini},\n  {Fotopoulou}, {L{\\'o}pez-Sanjuan}, {Mellier}, \\&\n  {Scoville}}]{2014A&A...568L...8A}\n{Amor{\\'{\\i}}n}, R., {Sommariva}, V., {Castellano}, M., {et~al.} 2014, \\aap,\n  568, L8\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2012{\\natexlab{b}}){Amor{\\'{\\i}}n},\n  {V{\\'{\\i}}lchez}, {H{\\\"a}gele}, {Firpo}, {P{\\'e}rez-Montero}, \\&\n  {Papaderos}}]{2012ApJ...754L..22A}\n{Amor{\\'{\\i}}n}, R., {V{\\'{\\i}}lchez}, J.~M., {H{\\\"a}gele}, G.~F., {et~al.}\n  2012{\\natexlab{b}}, \\apjl, 754, L22\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2010){Amor{\\'{\\i}}n}, {P{\\'e}rez-Montero},\n  \\& {V{\\'{\\i}}lchez}}]{2010ApJ...715L.128A}\n{Amor{\\'{\\i}}n}, R.~O., {P{\\'e}rez-Montero}, E., \\& {V{\\'{\\i}}lchez}, J.~M.\n  2010, \\apjl, 715, L128\n\n\\bibitem[{{Andrews} \\& {Martini}(2013)}]{2013ApJ...765..140A}\n{Andrews}, B.~H. \\& {Martini}, P. 2013, \\apj, 765, 140\n\n\\bibitem[{{Annibali} {et~al.}(2013){Annibali}, {Cignoni}, {Tosi}, {van der\n  Marel}, {Aloisi}, {Clementini}, {Contreras Ramos}, {Fiorentino}, {Marconi},\n  \\& {Musella}}]{2013AJ....146..144A}\n{Annibali}, F., {Cignoni}, M., {Tosi}, M., {et~al.} 2013, \\aj, 146, 144\n\n\\bibitem[{{Asplund} {et~al.}(2009){Asplund}, {Grevesse}, {Sauval}, \\&\n  {Scott}}]{2009ARA&A..47..481A}\n{Asplund}, M., {Grevesse}, N., {Sauval}, A.~J., \\& {Scott}, P. 2009, \\araa, 47,\n  481\n\n\\bibitem[{{Baldwin} {et~al.}(1981){Baldwin}, {Phillips}, \\&\n  {Terlevich}}]{1981PASP...93....5B}\n{Baldwin}, J.~A., {Phillips}, M.~M., \\& {Terlevich}, R. 1981, \\pasp, 93, 5\n\n\\bibitem[{{Bell} \\& {de Jong}(2001)}]{2001ApJ...550..212B}\n{Bell}, E.~F. \\& {de Jong}, R.~S. 2001, \\apj, 550, 212\n\n\\bibitem[{{Berg} {et~al.}(2012){Berg}, {Skillman}, {Marble}, {van Zee},\n  {Engelbracht}, {Lee}, {Kennicutt}, {Calzetti}, {Dale}, \\&\n  {Johnson}}]{2012ApJ...754...98B}\n{Berg}, D.~A., {Skillman}, E.~D., {Marble}, A.~R., {et~al.} 2012, \\apj, 754, 98\n\n\\bibitem[{{Blanton} {et~al.}(2005){Blanton}, {Lupton}, {Schlegel}, {Strauss},\n  {Brinkmann}, {Fukugita}, \\& {Loveday}}]{2005ApJ...631..208B}\n{Blanton}, M.~R., {Lupton}, R.~H., {Schlegel}, D.~J., {et~al.} 2005, \\apj, 631,\n  208\n\n\\bibitem[{{Brinchmann} {et~al.}(2004){Brinchmann}, {Charlot}, {White},\n  {Tremonti}, {Kauffmann}, {Heckman}, \\& {Brinkmann}}]{2004MNRAS.351.1151B}\n{Brinchmann}, J., {Charlot}, S., {White}, S.~D.~M., {et~al.} 2004, \\mnras, 351,\n  1151\n\n\\bibitem[{{Bromm} \\& {Larson}(2004)}]{2004ARA&A..42...79B}\n{Bromm}, V. \\& {Larson}, R.~B. 2004, \\araa, 42, 79\n\n\\bibitem[{{Bruzual} \\& {Charlot}(2003)}]{2003MNRAS.344.1000B}\n{Bruzual}, G. \\& {Charlot}, S. 2003, \\mnras, 344, 1000\n\n\\bibitem[{{Cardamone} {et~al.}(2009){Cardamone}, {Schawinski}, {Sarzi},\n  {Bamford}, {Bennert}, {Urry}, {Lintott}, {Keel}, {Parejko}, {Nichol},\n  {Thomas}, {Andreescu}, {Murray}, {Raddick}, {Slosar}, {Szalay}, \\&\n  {Vandenberg}}]{2009MNRAS.399.1191C}\n{Cardamone}, C., {Schawinski}, K., {Sarzi}, M., {et~al.} 2009, \\mnras, 399,\n  1191\n\n\\bibitem[{{Cardelli} {et~al.}(1989){Cardelli}, {Clayton}, \\&\n  {Mathis}}]{1989ApJ...345..245C}\n{Cardelli}, J.~A., {Clayton}, G.~C., \\& {Mathis}, J.~S. 1989, \\apj, 345, 245\n\n\\bibitem[{{Cid Fernandes} {et~al.}(2014){Cid Fernandes}, {Gonz{\\'a}lez\n  Delgado}, {Garc{\\'{\\i}}a Benito}, {P{\\'e}rez}, {de Amorim}, {S{\\'a}nchez},\n  {Husemann}, {Falc{\\'o}n Barroso}, {L{\\'o}pez-Fern{\\'a}ndez},\n  {S{\\'a}nchez-Bl{\\'a}zquez}, {Vale Asari}, {Vazdekis}, {Walcher}, \\&\n  {Mast}}]{2014A&A...561A.130C}\n{Cid Fernandes}, R., {Gonz{\\'a}lez Delgado}, R.~M., {Garc{\\'{\\i}}a Benito}, R.,\n  {et~al.} 2014, \\aap, 561, A130\n\n\\bibitem[{{Cid Fernandes} {et~al.}(2005){Cid Fernandes}, {Mateus}, {Sodr{\\'e}},\n  {Stasi{\\'n}ska}, \\& {Gomes}}]{2005MNRAS.358..363C}\n{Cid Fernandes}, R., {Mateus}, A., {Sodr{\\'e}}, L., {Stasi{\\'n}ska}, G., \\&\n  {Gomes}, J.~M. 2005, \\mnras, 358, 363\n\n\\bibitem[{{Corbin} {et~al.}(2008){Corbin}, {Kim}, {Jansen}, {Windhorst}, \\&\n  {Cid Fernandes}}]{2008ApJ...675..194C}\n{Corbin}, M.~R., {Kim}, H., {Jansen}, R.~A., {Windhorst}, R.~A., \\& {Cid\n  Fernandes}, R. 2008, \\apj, 675, 194\n\n\\bibitem[{{Dekel} {et~al.}(2009){Dekel}, {Birnboim}, {Engel}, {Freundlich},\n  {Goerdt}, {Mumcuoglu}, {Neistein}, {Pichon}, {Teyssier}, \\&\n  {Zinger}}]{2009Natur.457..451D}\n{Dekel}, A., {Birnboim}, Y., {Engel}, G., {et~al.} 2009, \\nat, 457, 451\n\n\\bibitem[{{Doe} {et~al.}(2007){Doe}, {Nguyen}, {Stawarz}, {Refsdal},\n  {Siemiginowska}, {Burke}, {Evans}, {Evans}, {McDowell}, {Houck}, \\&\n  {Nowak}}]{2007ASPC..376..543D}\n{Doe}, S., {Nguyen}, D., {Stawarz}, C., {et~al.} 2007, in Astronomical Society\n  of the Pacific Conference Series, Vol. 376, Astronomical Data Analysis\n  Software and Systems XVI, ed. R.~A. {Shaw}, F.~{Hill}, \\& D.~J. {Bell}, 543\n\n\\bibitem[{{Draine}(2003)}]{2003ARA&A..41..241D}\n{Draine}, B.~T. 2003, \\araa, 41, 241\n\n\\bibitem[{{Ekta} \\& {Chengalur}(2010)}]{2010MNRAS.406.1238E}\n{Ekta}, B. \\& {Chengalur}, J.~N. 2010, \\mnras, 406, 1238\n\n\\bibitem[{{Ferland} {et~al.}(2013){Ferland}, {Porter}, {van Hoof}, {Williams},\n  {Abel}, {Lykins}, {Shaw}, {Henney}, \\& {Stancil}}]{2013RMxAA..49..137F}\n{Ferland}, G.~J., {Porter}, R.~L., {van Hoof}, P.~A.~M., {et~al.} 2013, {RMxAA},\n  49, 137\n\n\\bibitem[{{Filho} {et~al.}(2015){Filho}, {S{\\'a}nchez Almeida},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Nuza}, {Kitaura}, \\&\n  {He{\\ss}}}]{2015ApJ...802...82F}\n{Filho}, M.~E., {S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  {et~al.} 2015, \\apj, 802, 82\n\n\\bibitem[{{Filho} {et~al.}(2013){Filho}, {Winkel}, {S{\\'a}nchez Almeida},\n  {Aguerri}, {Amor{\\'{\\i}}n}, {Ascasibar}, {Elmegreen}, {Elmegreen}, {Gomes},\n  {Humphrey}, {Lagos}, {Morales-Luis}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Papaderos},\n  \\& {V{\\'{\\i}}lchez}}]{2013A&A...558A..18F}\n{Filho}, M.~E., {Winkel}, B., {S{\\'a}nchez Almeida}, J., {et~al.} 2013, \\aap,\n  558, A18\n\n\\bibitem[{{Filho}(2015b)}]{Filho+15b}\n{Filho}, M. e.~a. 2015b, in preparation\n\n\\bibitem[{{Fisher} {et~al.}(2014){Fisher}, {Bolatto}, {Herrera-Camus},\n  {Draine}, {Donaldson}, {Walter}, {Sandstrom}, {Leroy}, {Cannon}, \\&\n  {Gordon}}]{2014Natur.505..186F}\n{Fisher}, D.~B., {Bolatto}, A.~D., {Herrera-Camus}, R., {et~al.} 2014, \\nat,\n  505, 186\n\n\\bibitem[{{Freeman} {et~al.}(2001){Freeman}, {Doe}, \\&\n  {Siemiginowska}}]{2001SPIE.4477...76F}\n{Freeman}, P., {Doe}, S., \\& {Siemiginowska}, A. 2001, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 4477,\n  Astronomical Data Analysis, ed. J.-L. {Starck} \\& F.~D. {Murtagh}, 76--87\n\n\\bibitem[{{Garc\\'\\i a-Benito} \\& {et al.}(2015)}]{garciabenito+15}\n{Garc\\'\\i a-Benito}, M. \\& {et al.} 2015, in preparation\n\n\\bibitem[{{Gil de Paz} {et~al.}(2003){Gil de Paz}, {Madore}, \\&\n  {Pevunova}}]{2003ApJS..147...29G}\n{Gil de Paz}, A., {Madore}, B.~F., \\& {Pevunova}, O. 2003, \\apjs, 147, 29\n\n\\bibitem[{{Giovanelli} {et~al.}(2013){Giovanelli}, {Haynes}, {Adams}, {Cannon},\n  {Rhode}, {Salzer}, {Skillman}, {Bernstein-Cooper}, \\&\n  {McQuinn}}]{2013AJ....146...15G}\n{Giovanelli}, R., {Haynes}, M.~P., {Adams}, E.~A.~K., {et~al.} 2013, \\aj, 146,\n  15\n\n\\bibitem[{{Guseva} {et~al.}(2015){Guseva}, {Izotov}, {Fricke}, \\&\n  {Henkel}}]{2015A&A...579A..11G}\n{Guseva}, N.~G., {Izotov}, Y.~I., {Fricke}, K.~J., \\& {Henkel}, C. 2015, \\aap,\n  579, A11\n\n\\bibitem[{{Guseva} {et~al.}(2009){Guseva}, {Papaderos}, {Meyer}, {Izotov}, \\&\n  {Fricke}}]{2009A&A...505...63G}\n{Guseva}, N.~G., {Papaderos}, P., {Meyer}, H.~T., {Izotov}, Y.~I., \\& {Fricke},\n  K.~J. 2009, \\aap, 505, 63\n\n\\bibitem[{{H{\\\"a}gele} {et~al.}(2008){H{\\\"a}gele}, {D{\\'{\\i}}az}, {Terlevich},\n  {Terlevich}, {P{\\'e}rez-Montero}, \\& {Cardaci}}]{2008MNRAS.383..209H}\n{H{\\\"a}gele}, G.~F., {D{\\'{\\i}}az}, {\\'A}.~I., {Terlevich}, E., {et~al.} 2008,\n  \\mnras, 383, 209\n\n\\bibitem[{{Haynes} {et~al.}(2011){Haynes}, {Giovanelli}, {Martin}, {Hess},\n  {Saintonge}, {Adams}, {Hallenbeck}, {Hoffman}, {Huang}, {Kent}, {Koopmann},\n  {Papastergis}, {Stierwalt}, {Balonek}, {Craig}, {Higdon}, {Kornreich},\n  {Miller}, {O'Donoghue}, {Olowin}, {Rosenberg}, {Spekkens}, {Troischt}, \\&\n  {Wilcots}}]{2011AJ....142..170H}\n{Haynes}, M.~P., {Giovanelli}, R., {Martin}, A.~M., {et~al.} 2011, \\aj, 142,\n  170\n\n\\bibitem[{{Henry} \\& {Worthey}(1999)}]{1999PASP..111..919H}\n{Henry}, R.~B.~C. \\& {Worthey}, G. 1999, \\pasp, 111, 919\n\n\\bibitem[{{He{\\ss}} {et~al.}(2013){He{\\ss}}, {Kitaura}, \\&\n  {Gottl{\\\"o}ber}}]{2013MNRAS.435.2065H}\n{He{\\ss}}, S., {Kitaura}, F.-S., \\& {Gottl{\\\"o}ber}, S. 2013, \\mnras, 435, 2065\n\n\\bibitem[{{Huchra} {et~al.}(2012){Huchra}, {Macri}, {Masters}, {Jarrett},\n  {Berlind}, {Calkins}, {Crook}, {Cutri}, {Erdo{\\v g}du}, {Falco}, {George},\n  {Hutcheson}, {Lahav}, {Mader}, {Mink}, {Martimbeau}, {Schneider},\n  {Skrutskie}, {Tokarz}, \\& {Westover}}]{2012ApJS..199...26H}\n{Huchra}, J.~P., {Macri}, L.~M., {Masters}, K.~L., {et~al.} 2012, \\apjs, 199,\n  26\n\n\\bibitem[{{Izotov} {et~al.}(2009){Izotov}, {Guseva}, {Fricke}, \\&\n  {Papaderos}}]{2009A&A...503...61I}\n{Izotov}, Y.~I., {Guseva}, N.~G., {Fricke}, K.~J., \\& {Papaderos}, P. 2009,\n  \\aap, 503, 61\n\n\\bibitem[{{Izotov} {et~al.}(2004){Izotov}, {Stasi{\\'n}ska}, {Guseva}, \\&\n  {Thuan}}]{2004A&A...415...87I}\n{Izotov}, Y.~I., {Stasi{\\'n}ska}, G., {Guseva}, N.~G., \\& {Thuan}, T.~X. 2004,\n  \\aap, 415, 87\n\n\\bibitem[{{Izotov} {et~al.}(2006){Izotov}, {Stasi{\\'n}ska}, {Meynet}, {Guseva},\n  \\& {Thuan}}]{2006A&A...448..955I}\n{Izotov}, Y.~I., {Stasi{\\'n}ska}, G., {Meynet}, G., {Guseva}, N.~G., \\&\n  {Thuan}, T.~X. 2006, \\aap, 448, 955\n\n\\bibitem[{{Izotov} \\& {Thuan}(2007)}]{2007ApJ...665.1115I}\n{Izotov}, Y.~I. \\& {Thuan}, T.~X. 2007, \\apj, 665, 1115\n\n\\bibitem[{{Izotov} {et~al.}(2012){Izotov}, {Thuan}, \\&\n  {Guseva}}]{2012A&A...546A.122I}\n{Izotov}, Y.~I., {Thuan}, T.~X., \\& {Guseva}, N.~G. 2012, \\aap, 546, A122\n\n\\bibitem[{{James} {et~al.}(2015){James}, {Koposov}, {Stark}, {Belokurov},\n  {Pettini}, \\& {Olszewski}}]{2015MNRAS.448.2687J}\n{James}, B.~L., {Koposov}, S., {Stark}, D.~P., {et~al.} 2015, \\mnras, 448, 2687\n\n\\bibitem[{{Kauffmann} {et~al.}(2003){Kauffmann}, {Heckman}, {Tremonti},\n  {Brinchmann}, {Charlot}, {White}, {Ridgway}, {Brinkmann}, {Fukugita}, {Hall},\n  {Ivezi{\\'c}}, {Richards}, \\& {Schneider}}]{2003MNRAS.346.1055K}\n{Kauffmann}, G., {Heckman}, T.~M., {Tremonti}, C., {et~al.} 2003, \\mnras, 346,\n  1055\n\n\\bibitem[{{Kehrig} {et~al.}(2015){Kehrig}, {V{\\'{\\i}}lchez},\n  {P{\\'e}rez-Montero}, {Iglesias-P{\\'a}ramo}, {Brinchmann}, {Kunth}, {Durret},\n  \\& {Bayo}}]{2015ApJ...801L..28K}\n{Kehrig}, C., {V{\\'{\\i}}lchez}, J.~M., {P{\\'e}rez-Montero}, E., {et~al.} 2015,\n  \\apjl, 801, L28\n\n\\bibitem[{{Kitaura}(2013)}]{2013MNRAS.429L..84K}\n{Kitaura}, F.-S. 2013, \\mnras, 429, L84\n\n\\bibitem[{{Kitaura} {et~al.}(2012){Kitaura}, {Erdo{\\v g}du}, {Nuza},\n  {Khalatyan}, {Angulo}, {Hoffman}, \\& {Gottl{\\\"o}ber}}]{2012MNRAS.427L..35K}\n{Kitaura}, F.-S., {Erdo{\\v g}du}, P., {Nuza}, S.~E., {et~al.} 2012, \\mnras,\n  427, L35\n\n\\bibitem[{{Kniazev} {et~al.}(2003){Kniazev}, {Grebel}, {Hao}, {Strauss},\n  {Brinkmann}, \\& {Fukugita}}]{2003ApJ...593L..73K}\n{Kniazev}, A.~Y., {Grebel}, E.~K., {Hao}, L., {et~al.} 2003, \\apjl, 593, L73\n\n\\bibitem[{{Kniazev} {et~al.}(2004){Kniazev}, {Pustilnik}, {Grebel}, {Lee}, \\&\n  {Pramskij}}]{2004ApJS..153..429K}\n{Kniazev}, A.~Y., {Pustilnik}, S.~A., {Grebel}, E.~K., {Lee}, H., \\&\n  {Pramskij}, A.~G. 2004, \\apjs, 153, 429\n\n\\bibitem[{{K{\\\"o}ppen} \\& {Hensler}(2005)}]{2005A&A...434..531K}\n{K{\\\"o}ppen}, J. \\& {Hensler}, G. 2005, \\aap, 434, 531\n\n\\bibitem[{{Krumholz}(2013)}]{2013MNRAS.436.2747K}\n{Krumholz}, M.~R. 2013, \\mnras, 436, 2747\n\n\\bibitem[{{Kunth} \\& {Lebouteiller}(2011)}]{2011EAS....48...95K}\n{Kunth}, D. \\& {Lebouteiller}, V. 2011, in EAS Publications Series, Vol.~48,\n  EAS Publications Series, ed. M.~{Koleva}, P.~{Prugniel}, \\& I.~{Vauglin},\n  95--96\n\n\\bibitem[{{Kunth} \\& {{\\\"O}stlin}(2000)}]{2000A&ARv..10....1K}\n{Kunth}, D. \\& {{\\\"O}stlin}, G. 2000, \\aapr, 10, 1\n\n\\bibitem[{{Lee} {et~al.}(2006){Lee}, {Skillman}, {Cannon}, {Jackson}, {Gehrz},\n  {Polomski}, \\& {Woodward}}]{2006ApJ...647..970L}\n{Lee}, H., {Skillman}, E.~D., {Cannon}, J.~M., {et~al.} 2006, \\apj, 647, 970\n\n\\bibitem[{{Loveday} {et~al.}(2015){Loveday}, {Norberg}, {Baldry},\n  {Bland-Hawthorn}, {Brough}, {Brown}, {Driver}, {Kelvin}, \\&\n  {Phillipps}}]{2015MNRAS.451.1540L}\n{Loveday}, J., {Norberg}, P., {Baldry}, I.~K., {et~al.} 2015, \\mnras, 451, 1540\n\n\\bibitem[{{Ly} {et~al.}(2015){Ly}, {Rigby}, {Cooper}, \\&\n  {Yan}}]{2015ApJ...805...45L}\n{Ly}, C., {Rigby}, J.~R., {Cooper}, M., \\& {Yan}, R. 2015, \\apj, 805, 45\n\n\\bibitem[{{Martin}(1971)}]{martin71}\n{Martin}, B.~R. 1971, {Statistics for Physicists} (London: Academic Press Inc)\n\n\\bibitem[{{Moll{\\'a}} {et~al.}(2009){Moll{\\'a}}, {Garc{\\'{\\i}}a-Vargas}, \\&\n  {Bressan}}]{2009MNRAS.398..451M}\n{Moll{\\'a}}, M., {Garc{\\'{\\i}}a-Vargas}, M.~L., \\& {Bressan}, A. 2009, \\mnras,\n  398, 451\n\n\\bibitem[{{Morales-Luis} {et~al.}(2014){Morales-Luis}, {P{\\'e}rez-Montero},\n  {S{\\'a}nchez Almeida}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2014ApJ...797...81M}\n{Morales-Luis}, A.~B., {P{\\'e}rez-Montero}, E., {S{\\'a}nchez Almeida}, J., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2014, \\apj, 797, 81\n\n\\bibitem[{{Morales-Luis} {et~al.}(2011{\\natexlab{a}}){Morales-Luis},\n  {S{\\'a}nchez Almeida}, {Aguerri}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{paperi}\n{Morales-Luis}, A.~B., {S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2011{\\natexlab{a}}, \\apj, 743, 77, {\\bf Paper\n  I}\n\n\\bibitem[{{Morales-Luis} {et~al.}(2011{\\natexlab{b}}){Morales-Luis},\n  {S{\\'a}nchez Almeida}, {Aguerri}, \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2011ApJ...743...77M}\n{Morales-Luis}, A.~B., {S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2011{\\natexlab{b}}, \\apj, 743, 77\n\n\\bibitem[{{Nuza} {et~al.}(2014{\\natexlab{a}}){Nuza}, {Kitaura}, {He{\\ss}},\n  {Libeskind}, \\& {M{\\\"u}ller}}]{2014MNRAS.445..988N}\n{Nuza}, S.~E., {Kitaura}, F.-S., {He{\\ss}}, S., {Libeskind}, N.~I., \\&\n  {M{\\\"u}ller}, V. 2014{\\natexlab{a}}, \\mnras, 445, 988\n\n\\bibitem[{{Nuza} {et~al.}(2014{\\natexlab{b}}){Nuza}, {Parisi}, {Scannapieco},\n  {Richter}, {Gottl{\\\"o}ber}, \\& {Steinmetz}}]{2014MNRAS.441.2593N}\n{Nuza}, S.~E., {Parisi}, F., {Scannapieco}, C., {et~al.} 2014{\\natexlab{b}},\n  \\mnras, 441, 2593\n\n\\bibitem[{{Oppenheimer} {et~al.}(2012){Oppenheimer}, {Dav{\\'e}}, {Katz},\n  {Kollmeier}, \\& {Weinberg}}]{2012MNRAS.420..829O}\n{Oppenheimer}, B.~D., {Dav{\\'e}}, R., {Katz}, N., {Kollmeier}, J.~A., \\&\n  {Weinberg}, D.~H. 2012, \\mnras, 420, 829\n\n\\bibitem[{{Ordov{\\'a}s-Pascual} \\& {S{\\'a}nchez\n  Almeida}(2014)}]{2014A&A...565A..53O}\n{Ordov{\\'a}s-Pascual}, I. \\& {S{\\'a}nchez Almeida}, J. 2014, \\aap, 565, A53\n\n\\bibitem[{{Osterbrock}(1974)}]{1974agn..book.....O}\n{Osterbrock}, D.~E. 1974, {Astrophysics of gaseous nebulae}\n\n\\bibitem[{{Osterbrock}(1989)}]{1989agna.book.....O}\n{Osterbrock}, D.~E. 1989, {Astrophysics of gaseous nebulae and active galactic\n  nuclei}\n\n\\bibitem[{{{\\\"O}stlin} {et~al.}(2001){{\\\"O}stlin}, {Amram}, {Bergvall},\n  {Masegosa}, {Boulesteix}, \\& {M{\\'a}rquez}}]{2001A&A...374..800O}\n{{\\\"O}stlin}, G., {Amram}, P., {Bergvall}, N., {et~al.} 2001, \\aap, 374, 800\n\n\\bibitem[{{Pagel} {et~al.}(1979){Pagel}, {Edmunds}, {Blackwell}, {Chun}, \\&\n  {Smith}}]{1979MNRAS.189...95P}\n{Pagel}, B.~E.~J., {Edmunds}, M.~G., {Blackwell}, D.~E., {Chun}, M.~S., \\&\n  {Smith}, G. 1979, \\mnras, 189, 95\n\n\\bibitem[{{Papaderos} {et~al.}(2008){Papaderos}, {Guseva}, {Izotov}, \\&\n  {Fricke}}]{2008A&A...491..113P}\n{Papaderos}, P., {Guseva}, N.~G., {Izotov}, Y.~I., \\& {Fricke}, K.~J. 2008,\n  \\aap, 491, 113\n\n\\bibitem[{{Peimbert} {et~al.}(2010){Peimbert}, {Peimbert}, {Carigi}, \\&\n  {Luridiana}}]{2010IAUS..268...91P}\n{Peimbert}, M., {Peimbert}, A., {Carigi}, L., \\& {Luridiana}, V. 2010, in IAU\n  Symposium, Vol. 268, IAU Symposium, ed. C.~{Charbonnel}, M.~{Tosi},\n  F.~{Primas}, \\& C.~{Chiappini}, 91--100\n\n\\bibitem[{{P{\\'e}rez-Montero}(2014)}]{2014MNRAS.441.2663P}\n{P{\\'e}rez-Montero}, E. 2014, \\mnras, 441, 2663\n\n\\bibitem[{{P{\\'e}rez-Montero} \\& {Contini}(2009)}]{2009MNRAS.398..949P}\n{P{\\'e}rez-Montero}, E. \\& {Contini}, T. 2009, \\mnras, 398, 949\n\n\\bibitem[{{P{\\'e}rez-Montero} {et~al.}(2013){P{\\'e}rez-Montero}, {Contini},\n  {Lamareille}, {Maier}, {Carollo}, {Kneib}, {Le F{\\`e}vre}, {Lilly},\n  {Mainieri}, {Renzini}, {Scodeggio}, {Zamorani}, {Bardelli}, {Bolzonella},\n  {Bongiorno}, {Caputi}, {Cucciati}, {de la Torre}, {de Ravel}, {Franzetti},\n  {Garilli}, {Iovino}, {Kampczyk}, {Knobel}, {Kova{\\v c}}, {Le Borgne}, {Le\n  Brun}, {Mignoli}, {Pell{\\`o}}, {Peng}, {Presotto}, {Ricciardelli},\n  {Silverman}, {Tanaka}, {Tasca}, {Tresse}, {Vergani}, \\&\n  {Zucca}}]{2013A&A...549A..25P}\n{P{\\'e}rez-Montero}, E., {Contini}, T., {Lamareille}, F., {et~al.} 2013, \\aap,\n  549, A25\n\n\\bibitem[{{P{\\'e}rez-Montero} {et~al.}(2010){P{\\'e}rez-Montero},\n  {Garc{\\'{\\i}}a-Benito}, {H{\\\"a}gele}, \\& {D{\\'{\\i}}az}}]{2010MNRAS.404.2037P}\n{P{\\'e}rez-Montero}, E., {Garc{\\'{\\i}}a-Benito}, R., {H{\\\"a}gele}, G.~F., \\&\n  {D{\\'{\\i}}az}, {\\'A}.~I. 2010, \\mnras, 404, 2037\n\n\\bibitem[{{Pettini} \\& {Pagel}(2004)}]{2004MNRAS.348L..59P}\n{Pettini}, M. \\& {Pagel}, B.~E.~J. 2004, \\mnras, 348, L59\n\n\\bibitem[{{Salim} {et~al.}(2007){Salim}, {Rich}, {Charlot}, {Brinchmann},\n  {Johnson}, {Schiminovich}, {Seibert}, {Mallery}, {Heckman}, {Forster},\n  {Friedman}, {Martin}, {Morrissey}, {Neff}, {Small}, {Wyder}, {Bianchi},\n  {Donas}, {Lee}, {Madore}, {Milliard}, {Szalay}, {Welsh}, \\&\n  {Yi}}]{2007ApJS..173..267S}\n{Salim}, S., {Rich}, R.~M., {Charlot}, S., {et~al.} 2007, \\apjs, 173, 267\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2013{\\natexlab{a}}){S{\\'a}nchez\n  Almeida}, {Aguerri}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2013RMxAC..42..111S}\n{S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n},\n  C. 2013{\\natexlab{a}}, in Revista Mexicana de Astronomia y Astrofisica\n  Conference Series, Vol.~42, Revista Mexicana de Astronomia y Astrofisica\n  Conference Series, 111--111\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2010){S{\\'a}nchez Almeida}, {Aguerri},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, \\& {de Vicente}}]{2010ApJ...714..487S}\n{S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  \\& {de Vicente}, A. 2010, \\apj, 714, 487\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2014{\\natexlab{a}}){S{\\'a}nchez\n  Almeida}, {Elmegreen}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, \\&\n  {Elmegreen}}]{2014A&ARv..22...71S}\n{S{\\'a}nchez Almeida}, J., {Elmegreen}, B.~G., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  \\& {Elmegreen}, D.~M. 2014{\\natexlab{a}}, \\aapr, 22, 71\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2015){S{\\'a}nchez Almeida},\n  {Elmegreen}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen}, {P{\\'e}rez-Montero},\n  {Amor{\\'{\\i}}n}, {Filho}, {Ascasibar}, {Papaderos}, \\&\n  {V{\\'{\\i}}lchez}}]{2015ApJ...810L..15S}\n{S{\\'a}nchez Almeida}, J., {Elmegreen}, B.~G., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  {et~al.} 2015, \\apjl, 810, L15\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2014{\\natexlab{b}}){S{\\'a}nchez\n  Almeida}, {Morales-Luis}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen},\n  {Elmegreen}, \\& {M{\\'e}ndez-Abreu}}]{2014ApJ...783...45S}\n{S{\\'a}nchez Almeida}, J., {Morales-Luis}, A.~B., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n},\n  C., {et~al.} 2014{\\natexlab{b}}, \\apj, 783, 45\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2008){S{\\'a}nchez Almeida},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Amor{\\'{\\i}}n}, {Aguerri}, {S{\\'a}nchez-Janssen},\n  \\& {Tenorio-Tagle}}]{2008ApJ...685..194S}\n{S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C., {Amor{\\'{\\i}}n}, R.,\n  {et~al.} 2008, \\apj, 685, 194\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2013{\\natexlab{b}}){S{\\'a}nchez\n  Almeida}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen}, {Elmegreen}, \\&\n  {M{\\'e}ndez-Abreu}}]{2013ApJ...767...74S}\n{S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C., {Elmegreen}, D.~M.,\n  {Elmegreen}, B.~G., \\& {M{\\'e}ndez-Abreu}, J. 2013{\\natexlab{b}}, \\apj, 767,\n  74\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2012){S{\\'a}nchez Almeida},\n  {Terlevich}, {Terlevich}, {Cid Fernandes}, \\&\n  {Morales-Luis}}]{2012ApJ...756..163S}\n{S{\\'a}nchez Almeida}, J., {Terlevich}, R., {Terlevich}, E., {Cid Fernandes},\n  R., \\& {Morales-Luis}, A.~B. 2012, \\apj, 756, 163\n\n\\bibitem[{{Sargent} \\& {Searle}(1970)}]{1970ApJ...162L.155S}\n{Sargent}, W.~L.~W. \\& {Searle}, L. 1970, \\apjl, 162, L155\n\n\\bibitem[{{Schaye} {et~al.}(2010){Schaye}, {Dalla Vecchia}, {Booth}, {Wiersma},\n  {Theuns}, {Haas}, {Bertone}, {Duffy}, {McCarthy}, \\& {van de\n  Voort}}]{2010MNRAS.402.1536S}\n{Schaye}, J., {Dalla Vecchia}, C., {Booth}, C.~M., {et~al.} 2010, \\mnras, 402,\n  1536\n\n\\bibitem[{{Schmidt}(1968)}]{1968ApJ...151..393S}\n{Schmidt}, M. 1968, \\apj, 151, 393\n\n\\bibitem[{{Searle} \\& {Sargent}(1972)}]{1972ApJ...173...25S}\n{Searle}, L. \\& {Sargent}, W.~L.~W. 1972, \\apj, 173, 25\n\n\\bibitem[{{Shi} {et~al.}(2014){Shi}, {Armus}, {Helou}, {Stierwalt}, {Gao},\n  {Wang}, {Zhang}, \\& {Gu}}]{2014Natur.514..335S}\n{Shi}, Y., {Armus}, L., {Helou}, G., {et~al.} 2014, \\nat, 514, 335\n\n\\bibitem[{{Skillman}(1999)}]{1999ASPC..170..169S}\n{Skillman}, E.~D. 1999, in Astronomical Society of the Pacific Conference\n  Series, Vol. 170, The Low Surface Brightness Universe, ed. J.~I. {Davies},\n  C.~{Impey}, \\& S.~{Phillips}, 169\n\n\\bibitem[{{Skillman} {et~al.}(1989){Skillman}, {Kennicutt}, \\&\n  {Hodge}}]{1989ApJ...347..875S}\n{Skillman}, E.~D., {Kennicutt}, R.~C., \\& {Hodge}, P.~W. 1989, \\apj, 347, 875\n\n\\bibitem[{{Skillman} {et~al.}(2013){Skillman}, {Salzer}, {Berg}, {Pogge},\n  {Haurberg}, {Cannon}, {Aver}, {Olive}, {Giovanelli}, {Haynes}, {Adams},\n  {McQuinn}, \\& {Rhode}}]{2013AJ....146....3S}\n{Skillman}, E.~D., {Salzer}, J.~J., {Berg}, D.~A., {et~al.} 2013, \\aj, 146, 3\n\n\\bibitem[{{Stasi{\\'n}ska} {et~al.}(2012){Stasi{\\'n}ska}, {Prantzos}, {Meynet},\n  {Sim{\\'o}n-D{\\'{\\i}}az}, {Chiappini}, {Dessauges-Zavadsky}, {Charbonnel},\n  {Ludwig}, {Mendoza}, {Grevesse}, {Arnould}, {Barbuy}, {Lebreton},\n  {Decourchelle}, {Hill}, {Ferrando}, {H{\\'e}brard}, {Durret}, {Katsuma}, \\&\n  {Zeippen}}]{2012EAS....54....3S}\n{Stasi{\\'n}ska}, G., {Prantzos}, N., {Meynet}, G., {et~al.} 2012, in EAS\n  Publications Series, Vol.~54, EAS Publications Series, ed.\n  G.~{Stasi{\\'n}ska}, N.~{Prantzos}, G.~{Meynet}, S.~{Sim{\\'o}n-D{\\'{\\i}}az},\n  C.~{Chiappini}, M.~{Dessauges-Zavadsky}, C.~{Charbonnel}, H.-G. {Ludwig},\n  C.~{Mendoza}, N.~{Grevesse}, M.~{Arnould}, B.~{Barbuy}, Y.~{Lebreton},\n  A.~{Decourchelle}, V.~{Hill}, P.~{Ferrando}, G.~{H{\\'e}brard}, F.~{Durret},\n  M.~{Katsuma}, \\& C.~J. {Zeippen}, 3--63\n\n\\bibitem[{{Steigman}(2010)}]{2010JCAP...04..029S}\n{Steigman}, G. 2010, {JCAP}, 4, 29\n\n\\bibitem[{{Storey} \\& {Zeippen}(2000)}]{2000MNRAS.312..813S}\n{Storey}, P.~J. \\& {Zeippen}, C.~J. 2000, \\mnras, 312, 813\n\n\\bibitem[{{Stoughton} {et~al.}(2002){Stoughton}, {Lupton}, {Bernardi},\n  {Blanton}, {Burles}, {Castander}, {Connolly}, {Eisenstein}, {Frieman},\n  {Hennessy}, {Hindsley}, {Ivezi{\\'c}}, {Kent}, {Kunszt}, {Lee}, {Meiksin},\n  {Munn}, {Newberg}, {Nichol}, {Nicinski}, {Pier}, {Richards}, {Richmond},\n  {Schlegel}, {Smith}, {Strauss}, {SubbaRao}, {Szalay}, {Thakar}, {Tucker},\n  {Vanden Berk}, {Yanny}, {Adelman}, {Anderson}, {Anderson}, {Annis},\n  {Bahcall}, {Bakken}, {Bartelmann}, {Bastian}, {Bauer}, {Berman},\n  {B{\\\"o}hringer}, {Boroski}, {Bracker}, {Briegel}, {Briggs}, {Brinkmann},\n  {Brunner}, {Carey}, {Carr}, {Chen}, {Christian}, {Colestock}, {Crocker},\n  {Csabai}, {Czarapata}, {Dalcanton}, {Davidsen}, {Davis}, {Dehnen},\n  {Dodelson}, {Doi}, {Dombeck}, {Donahue}, {Ellman}, {Elms}, {Evans}, {Eyer},\n  {Fan}, {Federwitz}, {Friedman}, {Fukugita}, {Gal}, {Gillespie}, {Glazebrook},\n  {Gray}, {Grebel}, {Greenawalt}, {Greene}, {Gunn}, {de Haas}, {Haiman},\n  {Haldeman}, {Hall}, {Hamabe}, {Hansen}, {Harris}, {Harris}, {Harvanek},\n  {Hawley}, {Hayes}, {Heckman}, {Helmi}, {Henden}, {Hogan}, {Hogg}, {Holmgren},\n  {Holtzman}, {Huang}, {Hull}, {Ichikawa}, {Ichikawa}, {Johnston}, {Kauffmann},\n  {Kim}, {Kimball}, {Kinney}, {Klaene}, {Kleinman}, {Klypin}, {Knapp},\n  {Korienek}, {Krolik}, {Kron}, {Krzesi{\\'n}ski}, {Lamb}, {Leger},\n  {Limmongkol}, {Lindenmeyer}, {Long}, {Loomis}, {Loveday}, {MacKinnon},\n  {Mannery}, {Mantsch}, {Margon}, {McGehee}, {McKay}, {McLean}, {Menou},\n  {Merelli}, {Mo}, {Monet}, {Nakamura}, {Narayanan}, {Nash}, {Neilsen},\n  {Newman}, {Nitta}, {Odenkirchen}, {Okada}, {Okamura}, {Ostriker}, {Owen},\n  {Pauls}, {Peoples}, {Peterson}, {Petravick}, {Pope}, {Pordes}, {Postman},\n  {Prosapio}, {Quinn}, {Rechenmacher}, {Rivetta}, {Rix}, {Rockosi}, {Rosner},\n  {Ruthmansdorfer}, {Sandford}, {Schneider}, {Scranton}, {Sekiguchi}, {Sergey},\n  {Sheth}, {Shimasaku}, {Smee}, {Snedden}, {Stebbins}, {Stubbs}, {Szapudi},\n  {Szkody}, {Szokoly}, {Tabachnik}, {Tsvetanov}, {Uomoto}, {Vogeley}, {Voges},\n  {Waddell}, {Walterbos}, {Wang}, {Watanabe}, {Weinberg}, {White}, {White},\n  {Wilhite}, {Wolfe}, {Yasuda}, {York}, {Zehavi}, \\&\n  {Zheng}}]{2002AJ....123..485S}\n{Stoughton}, C., {Lupton}, R.~H., {Bernardi}, M., {et~al.} 2002, \\aj, 123, 485\n\n\\bibitem[{{Takeuchi} {et~al.}(2000){Takeuchi}, {Yoshikawa}, \\&\n  {Ishii}}]{2000ApJS..129....1T}\n{Takeuchi}, T.~T., {Yoshikawa}, K., \\& {Ishii}, T.~T. 2000, \\apjs, 129, 1\n\n\\bibitem[{{Tenorio-Tagle} {et~al.}(2013){Tenorio-Tagle}, {Silich},\n  {Mart{\\'{\\i}}nez-Gonz{\\'a}lez}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Palou{\\v s}}, \\&\n  {W{\\\"u}nsch}}]{2013ApJ...778..159T}\n{Tenorio-Tagle}, G., {Silich}, S., {Mart{\\'{\\i}}nez-Gonz{\\'a}lez}, S., {et~al.}\n  2013, \\apj, 778, 159\n\n\\bibitem[{{Terlevich} {et~al.}(1991){Terlevich}, {Melnick}, {Masegosa},\n  {Moles}, \\& {Copetti}}]{1991A&AS...91..285T}\n{Terlevich}, R., {Melnick}, J., {Masegosa}, J., {Moles}, M., \\& {Copetti},\n  M.~V.~F. 1991, \\aaps, 91, 285\n\n\\bibitem[{{Thuan} \\& {Izotov}(2005)}]{2005ApJS..161..240T}\n{Thuan}, T.~X. \\& {Izotov}, Y.~I. 2005, \\apjs, 161, 240\n\n\\bibitem[{{Tremonti} {et~al.}(2004){Tremonti}, {Heckman}, {Kauffmann},\n  {Brinchmann}, {Charlot}, {White}, {Seibert}, {Peng}, {Schlegel}, {Uomoto},\n  {Fukugita}, \\& {Brinkmann}}]{2004ApJ...613..898T}\n{Tremonti}, C.~A., {Heckman}, T.~M., {Kauffmann}, G., {et~al.} 2004, \\apj, 613,\n  898\n\n\\end{thebibliography}\n\n\n\n\\appendix\n\\section{Number of false positives and negatives}\\label{appendix}\nFor the sake of compactness, we will use the symbol $X_i$ to denote the value of \n12+log(O/H) in the i-th XMP galaxy.\nBy definition, $X_i < X_0$, with $X_0$ the threshold to be XMP.\nBayes's theorem \\citep[e.g.,][]{martin71}\nprovides the probability that the true metallicity is $X$ given that\nwe have observed $X_i$,  \n\n", "itemtype": "equation", "pos": 62528, "prevtext": "\nwhich approximately corresponds to 1/40 times the oxygen abundance in the \nsolar composition. This value is similar to, although slightly higher than,  \nthe record-breaking  low-abundance galaxy SBS0335-052W \n\\citep[$12+\\log({\\rm O/H})\\simeq 7.0$, corresponding to 1/50th of the solar \ncomposition;][]{2009A&A...503...61I}.\n\n\nThe reason why such a threshold exists is still a riddle.\nThe metallicity of the gas produced during the Big Bang is virtually \nmetal-free, and population III stars contaminate the inter-galactic \nmedium with a metallicity lower than $10^{-4}$ times the solar metallicity\n\\citep[e.g.,][]{2004ARA&A..42...79B}.\nOne can envisage that some of the galaxies formed from this \npristine gas have been so dull forming stars that they still \nretain part of the original gas. Why none of these {\npristine galaxies is producing stars at present? \nSeveral explanations have been offered in the literature, going from  \nthe self-enrichment of the HII region used for measuring, to  \ntechnical difficulties for metallicity determinations below the threshold\n\\citep[see][]{2011EAS....48...95K}.\nOne additional possibility is offered by the cosmic-web gas-accretion scenario,\nwhere the starbursts in XMPs are triggered by gas recently accreted \nfrom the cosmic web \\citep[see ][and references therein]{2014A&ARv..22...71S}. \nNumerical simulations predict the cosmic web gas to accumulate metals from the \nmetal-enriched outflows of dwarf galaxies. These metals add up along the Hubble time \nso that at redshift zero the cosmic-web metallicity is predicted to have a value close\nto the observed threshold \\citep[e.g.,][]{2012MNRAS.420..829O}. \nShould this explanation were correct, then the observational lower limit is tracing the \nmetal content of the cosmic web at present.\n\n\n\n\\subsection{Morphology}\\label{morphology}\n\n\\citet{2008A&A...491..113P}, {Paper~I} , and later \\citet{2013A&A...558A..18F}  pointed\nout that bursting XMPs \ntend to be cometary or tadpole-like. Such association between \nmetallicity and morphology is notable since metallicity is a property  dictated \nby the spectrum and, therefore, it implies that the spectrum conditions \nthe morphology of the galaxy. \n\nIn order to check whether the new sample of XMPs maintains this \npreference for the cometary shape, we repeated the eyeball classification\ncarried out by  \\citet{2013A&A...558A..18F}, which was based on the\nscheme presented in {Paper~I} . The galaxies may be (1) {\\em symmetric}\nif they present a centrally concentrated emission with no obvious \nstructure in the outskirts,  (2) {\\em cometary}  for a head-tail structure with \nan identifiable knot at the head, (3) {\\em 2-knot}  for a structure with two knots,\nand (4) {\\em multi-knot} for a diffuse structure with multiple star-formation knots,\nincluding irregular galaxies. \nFigure~\\ref{classes_mph} illustrates these classes with two examples of \neach galaxy morphology.\n\\begin{figure*}\n\n\n\\includegraphics[clip,width=4.3cm]{come1.eps}\\hspace{0.12cm}\n\\includegraphics[clip,width=4.3cm]{single2.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{multi1.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{two1.eps}\\\\\n\\vspace{-2.mm}\\\\\n\\includegraphics[clip,width=4.3cm]{come2.eps}\\hspace{0.05cm}\n\\includegraphics[clip,width=4.3cm]{single1.eps}\\hspace{0.08cm}\n\\includegraphics[clip,width=4.3cm]{multi2.eps}\\hspace{0.10cm}\n\\includegraphics[clip,width=4.3cm]{two2.eps}\\\\\n\\caption{Examples of the various morphological types found \namong the XMPs; from left to right cometary, symmetric, multi-knot, and \ntwo-knot (see main text for details). The bar on top of each image \ngives an angular scale on the sky. The image on the top-left panel also \npoints out north and east, which are common to all \nimages. Galaxy images are from SDSS-DR12. The two-knot example on \nthe upper row corresponds to IZw18.}\n\\label{classes_mph}\n\\end{figure*}\nWe use color images from SDSS for the visual inspection, and \nthe result of the classification turns out to be,\n\n", "index": 29, "text": "\\begin{equation}\n\\begin{tabular}{lr}\nCometary&57\\,\\%,\\\\\nSymmetric&23\\,\\%,\\\\\nMulti-knot&10\\,\\%,\\\\\n2-knot&4\\,\\%,\\\\\nothers&6\\,\\%.\n\\end{tabular}\n\\label{morpho}\n\\end{equation}\n", "mathml": "", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwhere $P(X_i|X)$ stands for the probability of measuring $X_i$ when the true metallicity is \n$X$, $H(X)$ represents the probability the galaxy has a true metallicity $X$, and\n$P(X_i)$ corresponds to the probability that the measured metallicity of the galaxy\nis $X_i$ considering all possible values of the true metallicity, i.e.,\n\n", "itemtype": "equation", "pos": 107696, "prevtext": "\nIn agreement with previous estimates, cometary happens to be the dominant shape.\nAsymmetric shapes (i.e., cometary plus 2-knot plus multi-knot) represent 71\\,\\% of the\nsample. These results are in quantitative agreement with {Paper~I} , where 75\\% of the targets \nare asymmetric, and with \\citet{2013A&A...558A..18F}, where \ncometary, multi-knot and 2-knot represented 52\\,\\% , 16\\%, and 10\\% of the XMP sample, \nrespectively.\nPerhaps the main difference is a slight excess of symmetric targets in the present\nsample, which we attribute to insufficient spatial resolution since our targets \nhave larger redshifts than the other samples (Sect.~\\ref{cmd}), thus complicating\nthe detection of sub-structure. In addition, this time we include a 5th class\nto the classification ({\\em others} in Eq.~[\\ref{morpho}]) to collect objects that \ndo not fit in the main categories easily (e.g., mergers, or elongated galaxies\nwithout an identifiable knot).\nIn addition, two of the objects are HII regions in the outskirts \nof large spirals (\\#\\,20 and 59).  \n\nWe note that a significant part of the symmetric objects looks\nlike the {\\em green peas} first described by \n\\citet{2009MNRAS.399.1191C}. One example is shown in Fig.~\\ref{classes_mph} --\nthe blue symmetric galaxy J1423+22.\nDepending on the redshift, green-pea like galaxies may look green, pink or blue in SDSS\nimages \\citep{2013RMxAC..42..111S}. The identification of green peas with\nmetal-poor galaxies was carried out by  \n\\citet{2010ApJ...715L.128A,2012ApJ...749..185A},\nand their rounded morphology seems to be associated \nwith limitations in spatial resolution rather than being\nintrinsic \\citep[e.g.,][]{2014A&A...568L...8A}.\nThe finding of green peas in our sample is encouraging since \nit naturally connects local XMPs to those expected at higher \nredshifts, which will appear in surveys deeper than SDSS-DR7 \n(e.g., eBOSS\\footnote{eBOSS stands for extended baryon oscillation spectroscopic survey,\nand a description can be found in {\\tt http://www.sdss.org/surveys/eboss/}.\n} within SDSS IV).\n\n\n\n\n\\subsection{Underlying stellar populations}\\label{agess}\n\n\n\\begin{figure}\n\\includegraphics[width=0.5\\textwidth]{ages.eps}\n\\caption{\nMass-weighted stellar age vs light-weighted stellar age for the \nXMPs, both derived using {\\sc starlight} (Sect.~\\ref{fluxes}). \nThe light-weighted mean is biased toward the younger \nstellar populations, whereas the mass-weighted mean is not.\nThe vertical dashed line shows a  light-weighted stellar age of 1 Gyr.\nNote that most XMPs are to the left of this threshold and thus\npresent a stellar spectrum typical of young stellar populations.\nThe horizontal dashed line shows a  mass-weighted stellar age of \n1 Gyr. Most XMPs are above this line implying that, despite their \nseemingly young spectrum, XMPs also contain aged stellar \npopulations -- often 10\\,Gyr old.\nThe ages in the axes are given in Gyr, and \nthe slanted solid line corresponds to the one-to-one \nrelationship.\n}\n\\label{ages}\n\\end{figure}\nIn order to decontaminate the emission-line fluxes from stellar \nabsorption,  we fitted a composite stellar spectrum to the observed \ncontinuum (Sect.~\\ref{fluxes}). As byproduct of this exercise, \nwe have information on the stellar populations co-existing with the \ngas responsible for the emission line spectrum. The stellar-population \ndecomposition is not free from uncertainties and degeneracies,\nhowever, it suffices to provide a general view of the stellar\nproperties \\citep[e.g.,][]{2005MNRAS.358..363C,2014A&A...561A.130C}.  \n\nWe find that the underlying stellar populations are generally young, \nalthough in almost all cases there are also old stellar components\ncontributing to the observed spectrum. This can be appreciated in \nFig.~\\ref{ages}, which shows the mass-weighted stellar age\nversus the light-weighted stellar age for the set of XMPs. \nThe light-weighted mean is strongly biased toward young \nstars, and we find that most light-weighted ages are younger than \n1\\,Gyr (i.e., they are to the left of the vertical dashed line in \nFig.~\\ref{ages}). The \nmass-weighted mean,\nhowever, does not suffer from this bias, and most XMPs have \nmass-weighted ages significantly larger than 1\\,Gyr (i.e., they\nare above the horizontal  dashed line in Fig.~\\ref{ages}). In other words,\nmost XMPs seem to have been forming stars not only at present\nbut also during the last Gyr. On top of this recent star-formation, most\nof them contain old stars, often as old as 10\\,Gyr or so.  \nThe fact that the class of XMP galaxies contains evolved stellar \npopulations is by no means unknown (see Sect.~\\ref{introduction}). \nTheir large difference between mass-weighted age and \nlight-weighted age is common to most local star-forming \ngalaxies  \\citep[e.g.,][]{2010MNRAS.404.2037P,2012ApJ...756..163S}.\n\n\n\n\n\\subsection{Large scale environment}\\label{environment}\n\n\nAs it was done by \\citet{2015ApJ...802...82F} for the XMPs in {Paper~I} ,\nwe have explored the large scale environment of the new list of \nbursting XMPs\nusing constrained N-body cosmological numerical simulations of\nthe local universe \\citep{2014MNRAS.445..988N}.  \nThe cosmological parameters provide a statistical description of the \nUniverse. The constrained simulation that we use \nselects a particular realization of the current cosmological model \nthat reproduces the spatial distribution of galaxies in the local universe as observed  by \n2MRS\\footnote{The 2MASS Redshift Survey (2MRS) is the spectroscopic follow-up \nof the two micron all sky survey 2MASS which provides a 3D distribution \nof local galaxies -- RA, DEC and redshift.} \n\\citep[][]{2012ApJS..199...26H}. \nThe method is based on a self-consistent Bayesian machine-learning\nalgorithm, and it provides a description of the local cosmic web\ndark matter with a resolution around 2~Mpc in a box of 180~Mpc$\\,h^{-1}$ side\n\\citep{2012MNRAS.427L..35K, 2013MNRAS.435.2065H, 2013MNRAS.429L..84K}.\nThis simulation, tuned to replicate the local distribution of galaxies,\ntell us whether the gravitational field at each point forces the matter to collapse \nin three directions (knot), in two directions (filament), in one direction (sheet),\nor if the matter is expanding in all three directions (void). This classification,\nbased on the local gravitational potential, correlates very \nwell with the local dark-matter overdensity, which increases from voids to knots.\n\nThe tendency of a particular type of galaxy to prefer one of the four \nenvironments is quantified in terms of the excess probability ratio $\\eta(\\tau,\\epsilon)$,\ndefined as the ratio between the probability that a galaxy of type $\\tau$ \nappears in environment $\\epsilon$, and the probability of having \nany type of galaxy in this environment. The excess probability \nfor the XMPs is shown in Fig.~\\ref{constrained}. For reference,\nthe figure also includes the excess probability for ellipticals (E),\nlenticulars (SO), spirals (Sp) and irregulars (Irr) as worked out \nfrom 2MRS galaxies by \\citet{2014MNRAS.445..988N}.\nClearly, XMPs have a strong tendency to appear in voids and \nto avoid knots. This tendency is more clear in XMPs than in \nany of the other galaxy types.\n\n\\begin{figure*}\n\n\n\n\n\\includegraphics[width=0.5\\textwidth]{Knots_XMP2s.eps}\n\\includegraphics[width=0.5\\textwidth]{Filaments_XMP2s.eps}\\\\\n\\includegraphics[width=0.5\\textwidth]{Sheets_XMP2s.eps}\n\\includegraphics[width=0.5\\textwidth]{Voids_XMP2s.eps}\n\n\\caption{Excess probability ratio for the XMPs.  E, S0, Sp, and Irr galaxies\nare also included for reference (see main text for details). \nThe four panels correspond to the four types of environments: \nvoids, sheets,  filaments, and knots. XMPs have a strong tendency to appear in voids and \nto avoid knots.}\n\\label{constrained}\n\\end{figure*}\nThese results are very similar to those found by \\citet{2015ApJ...802...82F}\nfor the XMPs in  {Paper~I} . \n\n\n\n\n\n\\section{Discussion and conclusions}\\label{discussion}\n\nDue to their astrophysical interest and rareness (Sect.~\\ref{introduction}), we have \ncarried  out a  systematic search for XMP galaxies in SDSS-DR7. \nStarting from all \ngalaxies with spectra having redshift smaller than 0.25,\nwe end up with a list of only {196}\\ XMPs (Table~\\ref{main_list}). \nWe select galaxies having [OIII]$\\lambda$4363 particularly intense\nwith respect to [OIII]$\\lambda$4959 and [OIII]$\\lambda$5007.\nAs it is explained in Sect.~\\ref{kmeanssearch}, this implies having \na high temperature gas and, since metals are efficient coolants, it is\nthe fingerprint of low-metallicity gas.  A first automated search was carried \nout using k-means to classify all galaxy spectra according to \nthe shape  in the region that contains  [OIII]$\\lambda$4363\nand [OIII]$\\lambda\\lambda$4959,5007. The  {1281}\\ objects \nin the classes of high [OIII]$\\lambda$4363 underwent\na closer scrutiny by\ncomputing their O abundance using the method by \n\\citet[][Sect.~\\ref{hcm}]{2014MNRAS.441.2663P}, which is a model-based \napproach consistent with the direct method. Those with abundance \nsmaller than one tenth of the solar value ended up in the \nfinal list (Table~\\ref{main_list}). The existence of \nuncertainty in the metallicity determination, typically 0.17\\,dex, implies that some of the\nXMPs are false positives, and some of the discarded  targets are\nfalse negatives (Appendix~\\ref{appendix}). \nWe offer a second list with {332}\\ XMP \ncandidates (Table~\\ref{candidates}), selected under less restrictive \nnoise conditions, which contains objects that upon refinement of \nthe metallicity estimate may turn out to be XMPs. The search in the\npresent paper is complementary to the one carried out in {Paper~I}\\ , \nwhere k-means is used in the spectral region around H$\\alpha$, \nwhere the metal-poor signpost is the weakening of \n[NII]$\\lambda$6549 and [NII]$\\lambda$6583 with respect to H$\\alpha$. \nFrom the {196}\\ galaxies in Table~\\ref{main_list}, only \n31 are known as inferred\nby comparison with the compilation carried out in {Paper~I} , and with \nthe new targets in \\citet{2012A&A...546A.122I}. The remaining 165 \nobjects seem to be new members of the XMP class.\nAmong the unknown members, 18 have  $12+\\log({\\rm O/H}) \\le 7.50$.\n\nAs part of the procedure to measure O/H, we also determine\nthe ratio N/O (Sect.~\\ref{hcm}). Closed-box stellar evolution over long\ntimescales  \npredicts $\\log({\\rm N/O})$ to be of the order -1.5 \nat low metallicity, and when $12+\\log({\\rm O/H}) > 8$ it increases \nlinearly with increasing metallicity reaching $\\simeq -1.0$ \nat solar metallicity \\citep[e.g.,][]{1999PASP..111..919H,2005A&A...434..531K}.\nMost XMPs have N/O consistent with the value expected at low metallicity, however, \na number  of them shows $\\log({\\rm N/O})\\simeq -1.0$ or even larger \n(Figs.~\\ref{distribution}a  and \\ref{masmetal2}).  Metal-poor \ngalaxies with $\\log({\\rm N/O})\\simeq -1.0$ are not very common, but \nexamples do exist in the literature. For instance, the so-called \n {\\em green-pea} galaxies have high N/O despite their low metallicity\n\\citep[][; we have  several such green peas among our XMP galaxies --  \nsee Sect.~\\ref{morphology}]{2010ApJ...715L.128A,2012ApJ...754L..22A}. \nMoreover, some of the classical XMPs\nalso show enhanced N/O \\citep{2014ApJ...797...81M}.\nXMPs with large N/O do not appear in {Paper~I} ,\nsince we selected galaxies having weak N lines and so\nour search was biased toward XMPs of low N/O . \nA simple interpretation for having both large N/O and low O/H is the \naccretion of significant amounts of metal-poor gas onto \ngalaxies having solar metallicity inter-stellar medium \n\\citep[ISM; e.g.,][and references therein]{2010ApJ...715L.128A}. \nThe mixing of metal-poor gas with pre-existing metal-rich gas \ndrops down the metallicity (i.e., increases H in O/H), but it does \nnot modify the original N/O, which remains as for a metal-rich ISM.\nSome 10\\,\\%\\ of the XMPs have $\\log({\\rm N/O}) \\geq -1.2$,\nrepresenting objects where the accretion of metal-poor gas\nis arguably part of their star-formation history.\nNote that accretion will remain unnoticed when the pre-existing \nISM presents low N/O.\n\nInterpreting N/O as a tracer of previous star-formation episodes\nis consistent with the trend we observe for the reddening to increase with \nincreasing N/O (Fig.~\\ref{extinction}b). The correlation\nnaturally arises if part of the dust responsible for extinction was\nproduced together with the N and O in previous star formation \nepisodes.\n\nWe quantify the global properties of the XMPs.\n\nThey have a mean stellar mass around $10^8\\,{\\rm M}_\\odot$,\nbut with very large scatter going from  $10^6\\,{\\rm M}_\\odot$ to  \n$10^{10}\\,{\\rm M}_\\odot$, therefore some of them are fairly massive  \n(Sect.~\\ref{masses}).\n\nWe find that both N/O and extinction increase with increasing \nstellar mass, so that the contribution of evolved stellar populations to\nthe metal content and dust is more important in massive galaxies.  \n\nFrom the reddening of the emission line spectrum we infer\nthe dust-mass column density to be around 0.2\\,${\\rm M_\\odot\\, pc^{-2}}$,\nwhich renders a very moderate extinction coefficient (Sect.~\\ref{reddening}).\nFor typical star-forming region size, the dust mass is between \n200 and 20,000 ${\\rm M}_\\odot$. \n\nWe analyze the morphology of the XMPs, finding results in the line \nof previous studies showing a strong tendency for the XMPs to be\ntadpole-like or cometary \n(\\citeauthor{2008A&A...491..113P}~\\citeyear{2008A&A...491..113P};\n{Paper~I} ;\n\\citeauthor{2013A&A...558A..18F}~\\citeyear{2013A&A...558A..18F}).\nExplicitly, 71\\,\\%\\ are cometary or knotted, and only 23\\,\\%\\ of them\nare symmetric  (see Sect.~\\ref{morphology}).\n\nAs a by-product of the procedure to determine gas phase metallicity,\nwe fit the observed continuum spectrum as a superposition of \nsingle stellar populations of varied ages and metallicities. According to such \ndecomposition, the XMPs are characterized by a fairly young stellar \nspectrum ($< 1\\,{\\rm Gyr}$), although young and aged stellar populations \nco-exists at the low-metallicity starbursts (Sect.~\\ref{agess}).\n\n\nSince the parent sample used to select the XMPs is \nlimited in apparent magnitude, it is relatively simple to\nestimate the number density of XMPs in the local Universe.\nWe worked it out in Sect.~\\ref{number_density}, finding some $3.4\\times 10^{-3}$\nXMPs per cubic Mpc (Eq.~[\\ref{actual_density}]).\nThis density is significantly larger than the density \nobtained from the sample in {Paper~I}, and it represents some 2\\,\\% of\nall galaxies in a volume. \n\nWe also work out the large-scale environment of the XMPs using \nconstrained cosmological numerical simulations (Sect.~\\ref{environment}).\nXMPs have a strong tendency to appear in voids and to avoid cluster \nenvironments.\n\nOne of the most intriguing properties of XMPs is the existence of a\nlower limit metallicity, of the order of  2\\,\\%\\ the solar metallicity.\nThe limit remains in our list (Sect.~\\ref{threshold}),\ndespite the fact that the sample is significantly larger than previous\none, and that we have systematically search the full SDSS \nspectroscopic sample. One of the ways out is, once again, \nthe infall of inter-galactic gas feeding the star-formation process.  \nThe inter-galactic gas\ncollects metals ejected from galaxies along the Hubble \ntime, which yields a small but non-zero metallicity expected to be \naround the value of the observed threshold \n\\citep[][and references therein]{2014A&ARv..22...71S}.    \n\nA caveat to keep in mind is that any search for XMPs based \non optical surveys, such as the one we present, \noverlooks faint low surface brightness galaxies. \nWe are sensitive to star-bursting XMPs (see Sect.~\\ref{introduction}).\nAs pointed out \nby, e.g., \\citeauthor{2013AJ....146....3S}~(\\citeyear{2013AJ....146....3S}; see also \nSect.~\\ref{introduction}),\nmost XMPs may be low surface brightness quiescent XMPs,\nso that to identify them\none would have to resort to blind HI surveys like the  \nArecibo Legacy Fast ALFA Survey \\citep[ALFALFA;][]{2011AJ....142..170H}\nthat led to the discovery of Leo~P \\citep{2013AJ....146...15G}.\n\n\n\\acknowledgements\n\nThanks are due to \n\nAmanda del Olmo for pinpointing repetitions in the original list of objects, \n\nto Andr\\'es Asensio-Ramos for assistance with the estimate of false positives and \nnegatives,\n\nto Mercedes Filho for enlightening discussions and suggestions on various \naspects of the work, \n\nto Steffen He{\\ss} for help with the simulations used in Sect.~\\ref{environment},\n\nand \nto Ricardo Amor\\'\\i n and Jos\\'e V\\'\\i lchez for a critical reading of the original manuscript.\n\n\nThanks are also due to an anonymous referee for pointing out the \nneed to explicitly mention the existence of \nbursting and quiescent XMPs, \nand to Evan Skillman for fruitful discussions on the issue.\n\n\n\n\n\nThis work has been partly funded by the Spanish Ministry of Economy and \nCompetitiveness, project {\\em Estallidos} AYA2013--47742--C4--2--P.\n\nRGB acknowledges support from the \nSpanish Ministerio de Ciencia e InnovacioÌ\u0081n under grant AYA2010-15081.\n\nSEN acknowledges support by the Deutsche Forschungsgemeinschaft under the grant NU 332/2-1.\n\nFunding for SDSS, SDSS-II, and  SDSS-III has been provided by the Alfred P. Sloan Foundation, \nthe Participating Institutions, the National Science Foundation, \nand the U.S. Department of Energy Office of Science.\n\nThe {\\sc starlight}  project is supported by the Brazilian agencies \nCNPq, CAPES and FAPESP and by the France-Brazil CAPES/Cofecub\nprogram.\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bibliographystyle{aa}\n\\begin{thebibliography}{106}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Abazajian} {et~al.}(2009){Abazajian}, {Adelman-McCarthy},\n  {Ag{\\\"u}eros}, {Allam}, {Allende Prieto}, {An}, {Anderson}, {Anderson},\n  {Annis}, {Bahcall}, \\& et~al.}]{2009ApJS..182..543A}\n{Abazajian}, K.~N., {Adelman-McCarthy}, J.~K., {Ag{\\\"u}eros}, M.~A., {et~al.}\n  2009, \\apjs, 182, 543\n\n\\bibitem[{{Aloisi} {et~al.}(2007){Aloisi}, {Clementini}, {Tosi}, {Annibali},\n  {Contreras}, {Fiorentino}, {Mack}, {Marconi}, {Musella}, {Saha}, {Sirianni},\n  \\& {van der Marel}}]{2007ApJ...667L.151A}\n{Aloisi}, A., {Clementini}, G., {Tosi}, M., {et~al.} 2007, \\apjl, 667, L151\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2012{\\natexlab{a}}){Amor{\\'{\\i}}n},\n  {P{\\'e}rez-Montero}, {V{\\'{\\i}}lchez}, \\& {Papaderos}}]{2012ApJ...749..185A}\n{Amor{\\'{\\i}}n}, R., {P{\\'e}rez-Montero}, E., {V{\\'{\\i}}lchez}, J.~M., \\&\n  {Papaderos}, P. 2012{\\natexlab{a}}, \\apj, 749, 185\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2014){Amor{\\'{\\i}}n}, {Sommariva},\n  {Castellano}, {Grazian}, {Tasca}, {Fontana}, {Pentericci}, {Cassata},\n  {Garilli}, {Le Brun}, {Le F{\\`e}vre}, {Maccagni}, {Thomas}, {Vanzella},\n  {Zamorani}, {Zucca}, {Bardelli}, {Capak}, {Cassar{\\'a}}, {Cimatti}, {Cuby},\n  {Cucciati}, {de la Torre}, {Durkalec}, {Giavalisco}, {Hathi}, {Ilbert},\n  {Lemaux}, {Moreau}, {Paltani}, {Ribeiro}, {Salvato}, {Schaerer}, {Scodeggio},\n  {Talia}, {Taniguchi}, {Tresse}, {Vergani}, {Wang}, {Charlot}, {Contini},\n  {Fotopoulou}, {L{\\'o}pez-Sanjuan}, {Mellier}, \\&\n  {Scoville}}]{2014A&A...568L...8A}\n{Amor{\\'{\\i}}n}, R., {Sommariva}, V., {Castellano}, M., {et~al.} 2014, \\aap,\n  568, L8\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2012{\\natexlab{b}}){Amor{\\'{\\i}}n},\n  {V{\\'{\\i}}lchez}, {H{\\\"a}gele}, {Firpo}, {P{\\'e}rez-Montero}, \\&\n  {Papaderos}}]{2012ApJ...754L..22A}\n{Amor{\\'{\\i}}n}, R., {V{\\'{\\i}}lchez}, J.~M., {H{\\\"a}gele}, G.~F., {et~al.}\n  2012{\\natexlab{b}}, \\apjl, 754, L22\n\n\\bibitem[{{Amor{\\'{\\i}}n} {et~al.}(2010){Amor{\\'{\\i}}n}, {P{\\'e}rez-Montero},\n  \\& {V{\\'{\\i}}lchez}}]{2010ApJ...715L.128A}\n{Amor{\\'{\\i}}n}, R.~O., {P{\\'e}rez-Montero}, E., \\& {V{\\'{\\i}}lchez}, J.~M.\n  2010, \\apjl, 715, L128\n\n\\bibitem[{{Andrews} \\& {Martini}(2013)}]{2013ApJ...765..140A}\n{Andrews}, B.~H. \\& {Martini}, P. 2013, \\apj, 765, 140\n\n\\bibitem[{{Annibali} {et~al.}(2013){Annibali}, {Cignoni}, {Tosi}, {van der\n  Marel}, {Aloisi}, {Clementini}, {Contreras Ramos}, {Fiorentino}, {Marconi},\n  \\& {Musella}}]{2013AJ....146..144A}\n{Annibali}, F., {Cignoni}, M., {Tosi}, M., {et~al.} 2013, \\aj, 146, 144\n\n\\bibitem[{{Asplund} {et~al.}(2009){Asplund}, {Grevesse}, {Sauval}, \\&\n  {Scott}}]{2009ARA&A..47..481A}\n{Asplund}, M., {Grevesse}, N., {Sauval}, A.~J., \\& {Scott}, P. 2009, \\araa, 47,\n  481\n\n\\bibitem[{{Baldwin} {et~al.}(1981){Baldwin}, {Phillips}, \\&\n  {Terlevich}}]{1981PASP...93....5B}\n{Baldwin}, J.~A., {Phillips}, M.~M., \\& {Terlevich}, R. 1981, \\pasp, 93, 5\n\n\\bibitem[{{Bell} \\& {de Jong}(2001)}]{2001ApJ...550..212B}\n{Bell}, E.~F. \\& {de Jong}, R.~S. 2001, \\apj, 550, 212\n\n\\bibitem[{{Berg} {et~al.}(2012){Berg}, {Skillman}, {Marble}, {van Zee},\n  {Engelbracht}, {Lee}, {Kennicutt}, {Calzetti}, {Dale}, \\&\n  {Johnson}}]{2012ApJ...754...98B}\n{Berg}, D.~A., {Skillman}, E.~D., {Marble}, A.~R., {et~al.} 2012, \\apj, 754, 98\n\n\\bibitem[{{Blanton} {et~al.}(2005){Blanton}, {Lupton}, {Schlegel}, {Strauss},\n  {Brinkmann}, {Fukugita}, \\& {Loveday}}]{2005ApJ...631..208B}\n{Blanton}, M.~R., {Lupton}, R.~H., {Schlegel}, D.~J., {et~al.} 2005, \\apj, 631,\n  208\n\n\\bibitem[{{Brinchmann} {et~al.}(2004){Brinchmann}, {Charlot}, {White},\n  {Tremonti}, {Kauffmann}, {Heckman}, \\& {Brinkmann}}]{2004MNRAS.351.1151B}\n{Brinchmann}, J., {Charlot}, S., {White}, S.~D.~M., {et~al.} 2004, \\mnras, 351,\n  1151\n\n\\bibitem[{{Bromm} \\& {Larson}(2004)}]{2004ARA&A..42...79B}\n{Bromm}, V. \\& {Larson}, R.~B. 2004, \\araa, 42, 79\n\n\\bibitem[{{Bruzual} \\& {Charlot}(2003)}]{2003MNRAS.344.1000B}\n{Bruzual}, G. \\& {Charlot}, S. 2003, \\mnras, 344, 1000\n\n\\bibitem[{{Cardamone} {et~al.}(2009){Cardamone}, {Schawinski}, {Sarzi},\n  {Bamford}, {Bennert}, {Urry}, {Lintott}, {Keel}, {Parejko}, {Nichol},\n  {Thomas}, {Andreescu}, {Murray}, {Raddick}, {Slosar}, {Szalay}, \\&\n  {Vandenberg}}]{2009MNRAS.399.1191C}\n{Cardamone}, C., {Schawinski}, K., {Sarzi}, M., {et~al.} 2009, \\mnras, 399,\n  1191\n\n\\bibitem[{{Cardelli} {et~al.}(1989){Cardelli}, {Clayton}, \\&\n  {Mathis}}]{1989ApJ...345..245C}\n{Cardelli}, J.~A., {Clayton}, G.~C., \\& {Mathis}, J.~S. 1989, \\apj, 345, 245\n\n\\bibitem[{{Cid Fernandes} {et~al.}(2014){Cid Fernandes}, {Gonz{\\'a}lez\n  Delgado}, {Garc{\\'{\\i}}a Benito}, {P{\\'e}rez}, {de Amorim}, {S{\\'a}nchez},\n  {Husemann}, {Falc{\\'o}n Barroso}, {L{\\'o}pez-Fern{\\'a}ndez},\n  {S{\\'a}nchez-Bl{\\'a}zquez}, {Vale Asari}, {Vazdekis}, {Walcher}, \\&\n  {Mast}}]{2014A&A...561A.130C}\n{Cid Fernandes}, R., {Gonz{\\'a}lez Delgado}, R.~M., {Garc{\\'{\\i}}a Benito}, R.,\n  {et~al.} 2014, \\aap, 561, A130\n\n\\bibitem[{{Cid Fernandes} {et~al.}(2005){Cid Fernandes}, {Mateus}, {Sodr{\\'e}},\n  {Stasi{\\'n}ska}, \\& {Gomes}}]{2005MNRAS.358..363C}\n{Cid Fernandes}, R., {Mateus}, A., {Sodr{\\'e}}, L., {Stasi{\\'n}ska}, G., \\&\n  {Gomes}, J.~M. 2005, \\mnras, 358, 363\n\n\\bibitem[{{Corbin} {et~al.}(2008){Corbin}, {Kim}, {Jansen}, {Windhorst}, \\&\n  {Cid Fernandes}}]{2008ApJ...675..194C}\n{Corbin}, M.~R., {Kim}, H., {Jansen}, R.~A., {Windhorst}, R.~A., \\& {Cid\n  Fernandes}, R. 2008, \\apj, 675, 194\n\n\\bibitem[{{Dekel} {et~al.}(2009){Dekel}, {Birnboim}, {Engel}, {Freundlich},\n  {Goerdt}, {Mumcuoglu}, {Neistein}, {Pichon}, {Teyssier}, \\&\n  {Zinger}}]{2009Natur.457..451D}\n{Dekel}, A., {Birnboim}, Y., {Engel}, G., {et~al.} 2009, \\nat, 457, 451\n\n\\bibitem[{{Doe} {et~al.}(2007){Doe}, {Nguyen}, {Stawarz}, {Refsdal},\n  {Siemiginowska}, {Burke}, {Evans}, {Evans}, {McDowell}, {Houck}, \\&\n  {Nowak}}]{2007ASPC..376..543D}\n{Doe}, S., {Nguyen}, D., {Stawarz}, C., {et~al.} 2007, in Astronomical Society\n  of the Pacific Conference Series, Vol. 376, Astronomical Data Analysis\n  Software and Systems XVI, ed. R.~A. {Shaw}, F.~{Hill}, \\& D.~J. {Bell}, 543\n\n\\bibitem[{{Draine}(2003)}]{2003ARA&A..41..241D}\n{Draine}, B.~T. 2003, \\araa, 41, 241\n\n\\bibitem[{{Ekta} \\& {Chengalur}(2010)}]{2010MNRAS.406.1238E}\n{Ekta}, B. \\& {Chengalur}, J.~N. 2010, \\mnras, 406, 1238\n\n\\bibitem[{{Ferland} {et~al.}(2013){Ferland}, {Porter}, {van Hoof}, {Williams},\n  {Abel}, {Lykins}, {Shaw}, {Henney}, \\& {Stancil}}]{2013RMxAA..49..137F}\n{Ferland}, G.~J., {Porter}, R.~L., {van Hoof}, P.~A.~M., {et~al.} 2013, {RMxAA},\n  49, 137\n\n\\bibitem[{{Filho} {et~al.}(2015){Filho}, {S{\\'a}nchez Almeida},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Nuza}, {Kitaura}, \\&\n  {He{\\ss}}}]{2015ApJ...802...82F}\n{Filho}, M.~E., {S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  {et~al.} 2015, \\apj, 802, 82\n\n\\bibitem[{{Filho} {et~al.}(2013){Filho}, {Winkel}, {S{\\'a}nchez Almeida},\n  {Aguerri}, {Amor{\\'{\\i}}n}, {Ascasibar}, {Elmegreen}, {Elmegreen}, {Gomes},\n  {Humphrey}, {Lagos}, {Morales-Luis}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Papaderos},\n  \\& {V{\\'{\\i}}lchez}}]{2013A&A...558A..18F}\n{Filho}, M.~E., {Winkel}, B., {S{\\'a}nchez Almeida}, J., {et~al.} 2013, \\aap,\n  558, A18\n\n\\bibitem[{{Filho}(2015b)}]{Filho+15b}\n{Filho}, M. e.~a. 2015b, in preparation\n\n\\bibitem[{{Fisher} {et~al.}(2014){Fisher}, {Bolatto}, {Herrera-Camus},\n  {Draine}, {Donaldson}, {Walter}, {Sandstrom}, {Leroy}, {Cannon}, \\&\n  {Gordon}}]{2014Natur.505..186F}\n{Fisher}, D.~B., {Bolatto}, A.~D., {Herrera-Camus}, R., {et~al.} 2014, \\nat,\n  505, 186\n\n\\bibitem[{{Freeman} {et~al.}(2001){Freeman}, {Doe}, \\&\n  {Siemiginowska}}]{2001SPIE.4477...76F}\n{Freeman}, P., {Doe}, S., \\& {Siemiginowska}, A. 2001, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 4477,\n  Astronomical Data Analysis, ed. J.-L. {Starck} \\& F.~D. {Murtagh}, 76--87\n\n\\bibitem[{{Garc\\'\\i a-Benito} \\& {et al.}(2015)}]{garciabenito+15}\n{Garc\\'\\i a-Benito}, M. \\& {et al.} 2015, in preparation\n\n\\bibitem[{{Gil de Paz} {et~al.}(2003){Gil de Paz}, {Madore}, \\&\n  {Pevunova}}]{2003ApJS..147...29G}\n{Gil de Paz}, A., {Madore}, B.~F., \\& {Pevunova}, O. 2003, \\apjs, 147, 29\n\n\\bibitem[{{Giovanelli} {et~al.}(2013){Giovanelli}, {Haynes}, {Adams}, {Cannon},\n  {Rhode}, {Salzer}, {Skillman}, {Bernstein-Cooper}, \\&\n  {McQuinn}}]{2013AJ....146...15G}\n{Giovanelli}, R., {Haynes}, M.~P., {Adams}, E.~A.~K., {et~al.} 2013, \\aj, 146,\n  15\n\n\\bibitem[{{Guseva} {et~al.}(2015){Guseva}, {Izotov}, {Fricke}, \\&\n  {Henkel}}]{2015A&A...579A..11G}\n{Guseva}, N.~G., {Izotov}, Y.~I., {Fricke}, K.~J., \\& {Henkel}, C. 2015, \\aap,\n  579, A11\n\n\\bibitem[{{Guseva} {et~al.}(2009){Guseva}, {Papaderos}, {Meyer}, {Izotov}, \\&\n  {Fricke}}]{2009A&A...505...63G}\n{Guseva}, N.~G., {Papaderos}, P., {Meyer}, H.~T., {Izotov}, Y.~I., \\& {Fricke},\n  K.~J. 2009, \\aap, 505, 63\n\n\\bibitem[{{H{\\\"a}gele} {et~al.}(2008){H{\\\"a}gele}, {D{\\'{\\i}}az}, {Terlevich},\n  {Terlevich}, {P{\\'e}rez-Montero}, \\& {Cardaci}}]{2008MNRAS.383..209H}\n{H{\\\"a}gele}, G.~F., {D{\\'{\\i}}az}, {\\'A}.~I., {Terlevich}, E., {et~al.} 2008,\n  \\mnras, 383, 209\n\n\\bibitem[{{Haynes} {et~al.}(2011){Haynes}, {Giovanelli}, {Martin}, {Hess},\n  {Saintonge}, {Adams}, {Hallenbeck}, {Hoffman}, {Huang}, {Kent}, {Koopmann},\n  {Papastergis}, {Stierwalt}, {Balonek}, {Craig}, {Higdon}, {Kornreich},\n  {Miller}, {O'Donoghue}, {Olowin}, {Rosenberg}, {Spekkens}, {Troischt}, \\&\n  {Wilcots}}]{2011AJ....142..170H}\n{Haynes}, M.~P., {Giovanelli}, R., {Martin}, A.~M., {et~al.} 2011, \\aj, 142,\n  170\n\n\\bibitem[{{Henry} \\& {Worthey}(1999)}]{1999PASP..111..919H}\n{Henry}, R.~B.~C. \\& {Worthey}, G. 1999, \\pasp, 111, 919\n\n\\bibitem[{{He{\\ss}} {et~al.}(2013){He{\\ss}}, {Kitaura}, \\&\n  {Gottl{\\\"o}ber}}]{2013MNRAS.435.2065H}\n{He{\\ss}}, S., {Kitaura}, F.-S., \\& {Gottl{\\\"o}ber}, S. 2013, \\mnras, 435, 2065\n\n\\bibitem[{{Huchra} {et~al.}(2012){Huchra}, {Macri}, {Masters}, {Jarrett},\n  {Berlind}, {Calkins}, {Crook}, {Cutri}, {Erdo{\\v g}du}, {Falco}, {George},\n  {Hutcheson}, {Lahav}, {Mader}, {Mink}, {Martimbeau}, {Schneider},\n  {Skrutskie}, {Tokarz}, \\& {Westover}}]{2012ApJS..199...26H}\n{Huchra}, J.~P., {Macri}, L.~M., {Masters}, K.~L., {et~al.} 2012, \\apjs, 199,\n  26\n\n\\bibitem[{{Izotov} {et~al.}(2009){Izotov}, {Guseva}, {Fricke}, \\&\n  {Papaderos}}]{2009A&A...503...61I}\n{Izotov}, Y.~I., {Guseva}, N.~G., {Fricke}, K.~J., \\& {Papaderos}, P. 2009,\n  \\aap, 503, 61\n\n\\bibitem[{{Izotov} {et~al.}(2004){Izotov}, {Stasi{\\'n}ska}, {Guseva}, \\&\n  {Thuan}}]{2004A&A...415...87I}\n{Izotov}, Y.~I., {Stasi{\\'n}ska}, G., {Guseva}, N.~G., \\& {Thuan}, T.~X. 2004,\n  \\aap, 415, 87\n\n\\bibitem[{{Izotov} {et~al.}(2006){Izotov}, {Stasi{\\'n}ska}, {Meynet}, {Guseva},\n  \\& {Thuan}}]{2006A&A...448..955I}\n{Izotov}, Y.~I., {Stasi{\\'n}ska}, G., {Meynet}, G., {Guseva}, N.~G., \\&\n  {Thuan}, T.~X. 2006, \\aap, 448, 955\n\n\\bibitem[{{Izotov} \\& {Thuan}(2007)}]{2007ApJ...665.1115I}\n{Izotov}, Y.~I. \\& {Thuan}, T.~X. 2007, \\apj, 665, 1115\n\n\\bibitem[{{Izotov} {et~al.}(2012){Izotov}, {Thuan}, \\&\n  {Guseva}}]{2012A&A...546A.122I}\n{Izotov}, Y.~I., {Thuan}, T.~X., \\& {Guseva}, N.~G. 2012, \\aap, 546, A122\n\n\\bibitem[{{James} {et~al.}(2015){James}, {Koposov}, {Stark}, {Belokurov},\n  {Pettini}, \\& {Olszewski}}]{2015MNRAS.448.2687J}\n{James}, B.~L., {Koposov}, S., {Stark}, D.~P., {et~al.} 2015, \\mnras, 448, 2687\n\n\\bibitem[{{Kauffmann} {et~al.}(2003){Kauffmann}, {Heckman}, {Tremonti},\n  {Brinchmann}, {Charlot}, {White}, {Ridgway}, {Brinkmann}, {Fukugita}, {Hall},\n  {Ivezi{\\'c}}, {Richards}, \\& {Schneider}}]{2003MNRAS.346.1055K}\n{Kauffmann}, G., {Heckman}, T.~M., {Tremonti}, C., {et~al.} 2003, \\mnras, 346,\n  1055\n\n\\bibitem[{{Kehrig} {et~al.}(2015){Kehrig}, {V{\\'{\\i}}lchez},\n  {P{\\'e}rez-Montero}, {Iglesias-P{\\'a}ramo}, {Brinchmann}, {Kunth}, {Durret},\n  \\& {Bayo}}]{2015ApJ...801L..28K}\n{Kehrig}, C., {V{\\'{\\i}}lchez}, J.~M., {P{\\'e}rez-Montero}, E., {et~al.} 2015,\n  \\apjl, 801, L28\n\n\\bibitem[{{Kitaura}(2013)}]{2013MNRAS.429L..84K}\n{Kitaura}, F.-S. 2013, \\mnras, 429, L84\n\n\\bibitem[{{Kitaura} {et~al.}(2012){Kitaura}, {Erdo{\\v g}du}, {Nuza},\n  {Khalatyan}, {Angulo}, {Hoffman}, \\& {Gottl{\\\"o}ber}}]{2012MNRAS.427L..35K}\n{Kitaura}, F.-S., {Erdo{\\v g}du}, P., {Nuza}, S.~E., {et~al.} 2012, \\mnras,\n  427, L35\n\n\\bibitem[{{Kniazev} {et~al.}(2003){Kniazev}, {Grebel}, {Hao}, {Strauss},\n  {Brinkmann}, \\& {Fukugita}}]{2003ApJ...593L..73K}\n{Kniazev}, A.~Y., {Grebel}, E.~K., {Hao}, L., {et~al.} 2003, \\apjl, 593, L73\n\n\\bibitem[{{Kniazev} {et~al.}(2004){Kniazev}, {Pustilnik}, {Grebel}, {Lee}, \\&\n  {Pramskij}}]{2004ApJS..153..429K}\n{Kniazev}, A.~Y., {Pustilnik}, S.~A., {Grebel}, E.~K., {Lee}, H., \\&\n  {Pramskij}, A.~G. 2004, \\apjs, 153, 429\n\n\\bibitem[{{K{\\\"o}ppen} \\& {Hensler}(2005)}]{2005A&A...434..531K}\n{K{\\\"o}ppen}, J. \\& {Hensler}, G. 2005, \\aap, 434, 531\n\n\\bibitem[{{Krumholz}(2013)}]{2013MNRAS.436.2747K}\n{Krumholz}, M.~R. 2013, \\mnras, 436, 2747\n\n\\bibitem[{{Kunth} \\& {Lebouteiller}(2011)}]{2011EAS....48...95K}\n{Kunth}, D. \\& {Lebouteiller}, V. 2011, in EAS Publications Series, Vol.~48,\n  EAS Publications Series, ed. M.~{Koleva}, P.~{Prugniel}, \\& I.~{Vauglin},\n  95--96\n\n\\bibitem[{{Kunth} \\& {{\\\"O}stlin}(2000)}]{2000A&ARv..10....1K}\n{Kunth}, D. \\& {{\\\"O}stlin}, G. 2000, \\aapr, 10, 1\n\n\\bibitem[{{Lee} {et~al.}(2006){Lee}, {Skillman}, {Cannon}, {Jackson}, {Gehrz},\n  {Polomski}, \\& {Woodward}}]{2006ApJ...647..970L}\n{Lee}, H., {Skillman}, E.~D., {Cannon}, J.~M., {et~al.} 2006, \\apj, 647, 970\n\n\\bibitem[{{Loveday} {et~al.}(2015){Loveday}, {Norberg}, {Baldry},\n  {Bland-Hawthorn}, {Brough}, {Brown}, {Driver}, {Kelvin}, \\&\n  {Phillipps}}]{2015MNRAS.451.1540L}\n{Loveday}, J., {Norberg}, P., {Baldry}, I.~K., {et~al.} 2015, \\mnras, 451, 1540\n\n\\bibitem[{{Ly} {et~al.}(2015){Ly}, {Rigby}, {Cooper}, \\&\n  {Yan}}]{2015ApJ...805...45L}\n{Ly}, C., {Rigby}, J.~R., {Cooper}, M., \\& {Yan}, R. 2015, \\apj, 805, 45\n\n\\bibitem[{{Martin}(1971)}]{martin71}\n{Martin}, B.~R. 1971, {Statistics for Physicists} (London: Academic Press Inc)\n\n\\bibitem[{{Moll{\\'a}} {et~al.}(2009){Moll{\\'a}}, {Garc{\\'{\\i}}a-Vargas}, \\&\n  {Bressan}}]{2009MNRAS.398..451M}\n{Moll{\\'a}}, M., {Garc{\\'{\\i}}a-Vargas}, M.~L., \\& {Bressan}, A. 2009, \\mnras,\n  398, 451\n\n\\bibitem[{{Morales-Luis} {et~al.}(2014){Morales-Luis}, {P{\\'e}rez-Montero},\n  {S{\\'a}nchez Almeida}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2014ApJ...797...81M}\n{Morales-Luis}, A.~B., {P{\\'e}rez-Montero}, E., {S{\\'a}nchez Almeida}, J., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2014, \\apj, 797, 81\n\n\\bibitem[{{Morales-Luis} {et~al.}(2011{\\natexlab{a}}){Morales-Luis},\n  {S{\\'a}nchez Almeida}, {Aguerri}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{paperi}\n{Morales-Luis}, A.~B., {S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2011{\\natexlab{a}}, \\apj, 743, 77, {\\bf Paper\n  I}\n\n\\bibitem[{{Morales-Luis} {et~al.}(2011{\\natexlab{b}}){Morales-Luis},\n  {S{\\'a}nchez Almeida}, {Aguerri}, \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2011ApJ...743...77M}\n{Morales-Luis}, A.~B., {S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\&\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C. 2011{\\natexlab{b}}, \\apj, 743, 77\n\n\\bibitem[{{Nuza} {et~al.}(2014{\\natexlab{a}}){Nuza}, {Kitaura}, {He{\\ss}},\n  {Libeskind}, \\& {M{\\\"u}ller}}]{2014MNRAS.445..988N}\n{Nuza}, S.~E., {Kitaura}, F.-S., {He{\\ss}}, S., {Libeskind}, N.~I., \\&\n  {M{\\\"u}ller}, V. 2014{\\natexlab{a}}, \\mnras, 445, 988\n\n\\bibitem[{{Nuza} {et~al.}(2014{\\natexlab{b}}){Nuza}, {Parisi}, {Scannapieco},\n  {Richter}, {Gottl{\\\"o}ber}, \\& {Steinmetz}}]{2014MNRAS.441.2593N}\n{Nuza}, S.~E., {Parisi}, F., {Scannapieco}, C., {et~al.} 2014{\\natexlab{b}},\n  \\mnras, 441, 2593\n\n\\bibitem[{{Oppenheimer} {et~al.}(2012){Oppenheimer}, {Dav{\\'e}}, {Katz},\n  {Kollmeier}, \\& {Weinberg}}]{2012MNRAS.420..829O}\n{Oppenheimer}, B.~D., {Dav{\\'e}}, R., {Katz}, N., {Kollmeier}, J.~A., \\&\n  {Weinberg}, D.~H. 2012, \\mnras, 420, 829\n\n\\bibitem[{{Ordov{\\'a}s-Pascual} \\& {S{\\'a}nchez\n  Almeida}(2014)}]{2014A&A...565A..53O}\n{Ordov{\\'a}s-Pascual}, I. \\& {S{\\'a}nchez Almeida}, J. 2014, \\aap, 565, A53\n\n\\bibitem[{{Osterbrock}(1974)}]{1974agn..book.....O}\n{Osterbrock}, D.~E. 1974, {Astrophysics of gaseous nebulae}\n\n\\bibitem[{{Osterbrock}(1989)}]{1989agna.book.....O}\n{Osterbrock}, D.~E. 1989, {Astrophysics of gaseous nebulae and active galactic\n  nuclei}\n\n\\bibitem[{{{\\\"O}stlin} {et~al.}(2001){{\\\"O}stlin}, {Amram}, {Bergvall},\n  {Masegosa}, {Boulesteix}, \\& {M{\\'a}rquez}}]{2001A&A...374..800O}\n{{\\\"O}stlin}, G., {Amram}, P., {Bergvall}, N., {et~al.} 2001, \\aap, 374, 800\n\n\\bibitem[{{Pagel} {et~al.}(1979){Pagel}, {Edmunds}, {Blackwell}, {Chun}, \\&\n  {Smith}}]{1979MNRAS.189...95P}\n{Pagel}, B.~E.~J., {Edmunds}, M.~G., {Blackwell}, D.~E., {Chun}, M.~S., \\&\n  {Smith}, G. 1979, \\mnras, 189, 95\n\n\\bibitem[{{Papaderos} {et~al.}(2008){Papaderos}, {Guseva}, {Izotov}, \\&\n  {Fricke}}]{2008A&A...491..113P}\n{Papaderos}, P., {Guseva}, N.~G., {Izotov}, Y.~I., \\& {Fricke}, K.~J. 2008,\n  \\aap, 491, 113\n\n\\bibitem[{{Peimbert} {et~al.}(2010){Peimbert}, {Peimbert}, {Carigi}, \\&\n  {Luridiana}}]{2010IAUS..268...91P}\n{Peimbert}, M., {Peimbert}, A., {Carigi}, L., \\& {Luridiana}, V. 2010, in IAU\n  Symposium, Vol. 268, IAU Symposium, ed. C.~{Charbonnel}, M.~{Tosi},\n  F.~{Primas}, \\& C.~{Chiappini}, 91--100\n\n\\bibitem[{{P{\\'e}rez-Montero}(2014)}]{2014MNRAS.441.2663P}\n{P{\\'e}rez-Montero}, E. 2014, \\mnras, 441, 2663\n\n\\bibitem[{{P{\\'e}rez-Montero} \\& {Contini}(2009)}]{2009MNRAS.398..949P}\n{P{\\'e}rez-Montero}, E. \\& {Contini}, T. 2009, \\mnras, 398, 949\n\n\\bibitem[{{P{\\'e}rez-Montero} {et~al.}(2013){P{\\'e}rez-Montero}, {Contini},\n  {Lamareille}, {Maier}, {Carollo}, {Kneib}, {Le F{\\`e}vre}, {Lilly},\n  {Mainieri}, {Renzini}, {Scodeggio}, {Zamorani}, {Bardelli}, {Bolzonella},\n  {Bongiorno}, {Caputi}, {Cucciati}, {de la Torre}, {de Ravel}, {Franzetti},\n  {Garilli}, {Iovino}, {Kampczyk}, {Knobel}, {Kova{\\v c}}, {Le Borgne}, {Le\n  Brun}, {Mignoli}, {Pell{\\`o}}, {Peng}, {Presotto}, {Ricciardelli},\n  {Silverman}, {Tanaka}, {Tasca}, {Tresse}, {Vergani}, \\&\n  {Zucca}}]{2013A&A...549A..25P}\n{P{\\'e}rez-Montero}, E., {Contini}, T., {Lamareille}, F., {et~al.} 2013, \\aap,\n  549, A25\n\n\\bibitem[{{P{\\'e}rez-Montero} {et~al.}(2010){P{\\'e}rez-Montero},\n  {Garc{\\'{\\i}}a-Benito}, {H{\\\"a}gele}, \\& {D{\\'{\\i}}az}}]{2010MNRAS.404.2037P}\n{P{\\'e}rez-Montero}, E., {Garc{\\'{\\i}}a-Benito}, R., {H{\\\"a}gele}, G.~F., \\&\n  {D{\\'{\\i}}az}, {\\'A}.~I. 2010, \\mnras, 404, 2037\n\n\\bibitem[{{Pettini} \\& {Pagel}(2004)}]{2004MNRAS.348L..59P}\n{Pettini}, M. \\& {Pagel}, B.~E.~J. 2004, \\mnras, 348, L59\n\n\\bibitem[{{Salim} {et~al.}(2007){Salim}, {Rich}, {Charlot}, {Brinchmann},\n  {Johnson}, {Schiminovich}, {Seibert}, {Mallery}, {Heckman}, {Forster},\n  {Friedman}, {Martin}, {Morrissey}, {Neff}, {Small}, {Wyder}, {Bianchi},\n  {Donas}, {Lee}, {Madore}, {Milliard}, {Szalay}, {Welsh}, \\&\n  {Yi}}]{2007ApJS..173..267S}\n{Salim}, S., {Rich}, R.~M., {Charlot}, S., {et~al.} 2007, \\apjs, 173, 267\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2013{\\natexlab{a}}){S{\\'a}nchez\n  Almeida}, {Aguerri}, \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}}]{2013RMxAC..42..111S}\n{S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., \\& {Mu{\\~n}oz-Tu{\\~n}{\\'o}n},\n  C. 2013{\\natexlab{a}}, in Revista Mexicana de Astronomia y Astrofisica\n  Conference Series, Vol.~42, Revista Mexicana de Astronomia y Astrofisica\n  Conference Series, 111--111\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2010){S{\\'a}nchez Almeida}, {Aguerri},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, \\& {de Vicente}}]{2010ApJ...714..487S}\n{S{\\'a}nchez Almeida}, J., {Aguerri}, J.~A.~L., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  \\& {de Vicente}, A. 2010, \\apj, 714, 487\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2014{\\natexlab{a}}){S{\\'a}nchez\n  Almeida}, {Elmegreen}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, \\&\n  {Elmegreen}}]{2014A&ARv..22...71S}\n{S{\\'a}nchez Almeida}, J., {Elmegreen}, B.~G., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  \\& {Elmegreen}, D.~M. 2014{\\natexlab{a}}, \\aapr, 22, 71\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2015){S{\\'a}nchez Almeida},\n  {Elmegreen}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen}, {P{\\'e}rez-Montero},\n  {Amor{\\'{\\i}}n}, {Filho}, {Ascasibar}, {Papaderos}, \\&\n  {V{\\'{\\i}}lchez}}]{2015ApJ...810L..15S}\n{S{\\'a}nchez Almeida}, J., {Elmegreen}, B.~G., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C.,\n  {et~al.} 2015, \\apjl, 810, L15\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2014{\\natexlab{b}}){S{\\'a}nchez\n  Almeida}, {Morales-Luis}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen},\n  {Elmegreen}, \\& {M{\\'e}ndez-Abreu}}]{2014ApJ...783...45S}\n{S{\\'a}nchez Almeida}, J., {Morales-Luis}, A.~B., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n},\n  C., {et~al.} 2014{\\natexlab{b}}, \\apj, 783, 45\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2008){S{\\'a}nchez Almeida},\n  {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Amor{\\'{\\i}}n}, {Aguerri}, {S{\\'a}nchez-Janssen},\n  \\& {Tenorio-Tagle}}]{2008ApJ...685..194S}\n{S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C., {Amor{\\'{\\i}}n}, R.,\n  {et~al.} 2008, \\apj, 685, 194\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2013{\\natexlab{b}}){S{\\'a}nchez\n  Almeida}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Elmegreen}, {Elmegreen}, \\&\n  {M{\\'e}ndez-Abreu}}]{2013ApJ...767...74S}\n{S{\\'a}nchez Almeida}, J., {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, C., {Elmegreen}, D.~M.,\n  {Elmegreen}, B.~G., \\& {M{\\'e}ndez-Abreu}, J. 2013{\\natexlab{b}}, \\apj, 767,\n  74\n\n\\bibitem[{{S{\\'a}nchez Almeida} {et~al.}(2012){S{\\'a}nchez Almeida},\n  {Terlevich}, {Terlevich}, {Cid Fernandes}, \\&\n  {Morales-Luis}}]{2012ApJ...756..163S}\n{S{\\'a}nchez Almeida}, J., {Terlevich}, R., {Terlevich}, E., {Cid Fernandes},\n  R., \\& {Morales-Luis}, A.~B. 2012, \\apj, 756, 163\n\n\\bibitem[{{Sargent} \\& {Searle}(1970)}]{1970ApJ...162L.155S}\n{Sargent}, W.~L.~W. \\& {Searle}, L. 1970, \\apjl, 162, L155\n\n\\bibitem[{{Schaye} {et~al.}(2010){Schaye}, {Dalla Vecchia}, {Booth}, {Wiersma},\n  {Theuns}, {Haas}, {Bertone}, {Duffy}, {McCarthy}, \\& {van de\n  Voort}}]{2010MNRAS.402.1536S}\n{Schaye}, J., {Dalla Vecchia}, C., {Booth}, C.~M., {et~al.} 2010, \\mnras, 402,\n  1536\n\n\\bibitem[{{Schmidt}(1968)}]{1968ApJ...151..393S}\n{Schmidt}, M. 1968, \\apj, 151, 393\n\n\\bibitem[{{Searle} \\& {Sargent}(1972)}]{1972ApJ...173...25S}\n{Searle}, L. \\& {Sargent}, W.~L.~W. 1972, \\apj, 173, 25\n\n\\bibitem[{{Shi} {et~al.}(2014){Shi}, {Armus}, {Helou}, {Stierwalt}, {Gao},\n  {Wang}, {Zhang}, \\& {Gu}}]{2014Natur.514..335S}\n{Shi}, Y., {Armus}, L., {Helou}, G., {et~al.} 2014, \\nat, 514, 335\n\n\\bibitem[{{Skillman}(1999)}]{1999ASPC..170..169S}\n{Skillman}, E.~D. 1999, in Astronomical Society of the Pacific Conference\n  Series, Vol. 170, The Low Surface Brightness Universe, ed. J.~I. {Davies},\n  C.~{Impey}, \\& S.~{Phillips}, 169\n\n\\bibitem[{{Skillman} {et~al.}(1989){Skillman}, {Kennicutt}, \\&\n  {Hodge}}]{1989ApJ...347..875S}\n{Skillman}, E.~D., {Kennicutt}, R.~C., \\& {Hodge}, P.~W. 1989, \\apj, 347, 875\n\n\\bibitem[{{Skillman} {et~al.}(2013){Skillman}, {Salzer}, {Berg}, {Pogge},\n  {Haurberg}, {Cannon}, {Aver}, {Olive}, {Giovanelli}, {Haynes}, {Adams},\n  {McQuinn}, \\& {Rhode}}]{2013AJ....146....3S}\n{Skillman}, E.~D., {Salzer}, J.~J., {Berg}, D.~A., {et~al.} 2013, \\aj, 146, 3\n\n\\bibitem[{{Stasi{\\'n}ska} {et~al.}(2012){Stasi{\\'n}ska}, {Prantzos}, {Meynet},\n  {Sim{\\'o}n-D{\\'{\\i}}az}, {Chiappini}, {Dessauges-Zavadsky}, {Charbonnel},\n  {Ludwig}, {Mendoza}, {Grevesse}, {Arnould}, {Barbuy}, {Lebreton},\n  {Decourchelle}, {Hill}, {Ferrando}, {H{\\'e}brard}, {Durret}, {Katsuma}, \\&\n  {Zeippen}}]{2012EAS....54....3S}\n{Stasi{\\'n}ska}, G., {Prantzos}, N., {Meynet}, G., {et~al.} 2012, in EAS\n  Publications Series, Vol.~54, EAS Publications Series, ed.\n  G.~{Stasi{\\'n}ska}, N.~{Prantzos}, G.~{Meynet}, S.~{Sim{\\'o}n-D{\\'{\\i}}az},\n  C.~{Chiappini}, M.~{Dessauges-Zavadsky}, C.~{Charbonnel}, H.-G. {Ludwig},\n  C.~{Mendoza}, N.~{Grevesse}, M.~{Arnould}, B.~{Barbuy}, Y.~{Lebreton},\n  A.~{Decourchelle}, V.~{Hill}, P.~{Ferrando}, G.~{H{\\'e}brard}, F.~{Durret},\n  M.~{Katsuma}, \\& C.~J. {Zeippen}, 3--63\n\n\\bibitem[{{Steigman}(2010)}]{2010JCAP...04..029S}\n{Steigman}, G. 2010, {JCAP}, 4, 29\n\n\\bibitem[{{Storey} \\& {Zeippen}(2000)}]{2000MNRAS.312..813S}\n{Storey}, P.~J. \\& {Zeippen}, C.~J. 2000, \\mnras, 312, 813\n\n\\bibitem[{{Stoughton} {et~al.}(2002){Stoughton}, {Lupton}, {Bernardi},\n  {Blanton}, {Burles}, {Castander}, {Connolly}, {Eisenstein}, {Frieman},\n  {Hennessy}, {Hindsley}, {Ivezi{\\'c}}, {Kent}, {Kunszt}, {Lee}, {Meiksin},\n  {Munn}, {Newberg}, {Nichol}, {Nicinski}, {Pier}, {Richards}, {Richmond},\n  {Schlegel}, {Smith}, {Strauss}, {SubbaRao}, {Szalay}, {Thakar}, {Tucker},\n  {Vanden Berk}, {Yanny}, {Adelman}, {Anderson}, {Anderson}, {Annis},\n  {Bahcall}, {Bakken}, {Bartelmann}, {Bastian}, {Bauer}, {Berman},\n  {B{\\\"o}hringer}, {Boroski}, {Bracker}, {Briegel}, {Briggs}, {Brinkmann},\n  {Brunner}, {Carey}, {Carr}, {Chen}, {Christian}, {Colestock}, {Crocker},\n  {Csabai}, {Czarapata}, {Dalcanton}, {Davidsen}, {Davis}, {Dehnen},\n  {Dodelson}, {Doi}, {Dombeck}, {Donahue}, {Ellman}, {Elms}, {Evans}, {Eyer},\n  {Fan}, {Federwitz}, {Friedman}, {Fukugita}, {Gal}, {Gillespie}, {Glazebrook},\n  {Gray}, {Grebel}, {Greenawalt}, {Greene}, {Gunn}, {de Haas}, {Haiman},\n  {Haldeman}, {Hall}, {Hamabe}, {Hansen}, {Harris}, {Harris}, {Harvanek},\n  {Hawley}, {Hayes}, {Heckman}, {Helmi}, {Henden}, {Hogan}, {Hogg}, {Holmgren},\n  {Holtzman}, {Huang}, {Hull}, {Ichikawa}, {Ichikawa}, {Johnston}, {Kauffmann},\n  {Kim}, {Kimball}, {Kinney}, {Klaene}, {Kleinman}, {Klypin}, {Knapp},\n  {Korienek}, {Krolik}, {Kron}, {Krzesi{\\'n}ski}, {Lamb}, {Leger},\n  {Limmongkol}, {Lindenmeyer}, {Long}, {Loomis}, {Loveday}, {MacKinnon},\n  {Mannery}, {Mantsch}, {Margon}, {McGehee}, {McKay}, {McLean}, {Menou},\n  {Merelli}, {Mo}, {Monet}, {Nakamura}, {Narayanan}, {Nash}, {Neilsen},\n  {Newman}, {Nitta}, {Odenkirchen}, {Okada}, {Okamura}, {Ostriker}, {Owen},\n  {Pauls}, {Peoples}, {Peterson}, {Petravick}, {Pope}, {Pordes}, {Postman},\n  {Prosapio}, {Quinn}, {Rechenmacher}, {Rivetta}, {Rix}, {Rockosi}, {Rosner},\n  {Ruthmansdorfer}, {Sandford}, {Schneider}, {Scranton}, {Sekiguchi}, {Sergey},\n  {Sheth}, {Shimasaku}, {Smee}, {Snedden}, {Stebbins}, {Stubbs}, {Szapudi},\n  {Szkody}, {Szokoly}, {Tabachnik}, {Tsvetanov}, {Uomoto}, {Vogeley}, {Voges},\n  {Waddell}, {Walterbos}, {Wang}, {Watanabe}, {Weinberg}, {White}, {White},\n  {Wilhite}, {Wolfe}, {Yasuda}, {York}, {Zehavi}, \\&\n  {Zheng}}]{2002AJ....123..485S}\n{Stoughton}, C., {Lupton}, R.~H., {Bernardi}, M., {et~al.} 2002, \\aj, 123, 485\n\n\\bibitem[{{Takeuchi} {et~al.}(2000){Takeuchi}, {Yoshikawa}, \\&\n  {Ishii}}]{2000ApJS..129....1T}\n{Takeuchi}, T.~T., {Yoshikawa}, K., \\& {Ishii}, T.~T. 2000, \\apjs, 129, 1\n\n\\bibitem[{{Tenorio-Tagle} {et~al.}(2013){Tenorio-Tagle}, {Silich},\n  {Mart{\\'{\\i}}nez-Gonz{\\'a}lez}, {Mu{\\~n}oz-Tu{\\~n}{\\'o}n}, {Palou{\\v s}}, \\&\n  {W{\\\"u}nsch}}]{2013ApJ...778..159T}\n{Tenorio-Tagle}, G., {Silich}, S., {Mart{\\'{\\i}}nez-Gonz{\\'a}lez}, S., {et~al.}\n  2013, \\apj, 778, 159\n\n\\bibitem[{{Terlevich} {et~al.}(1991){Terlevich}, {Melnick}, {Masegosa},\n  {Moles}, \\& {Copetti}}]{1991A&AS...91..285T}\n{Terlevich}, R., {Melnick}, J., {Masegosa}, J., {Moles}, M., \\& {Copetti},\n  M.~V.~F. 1991, \\aaps, 91, 285\n\n\\bibitem[{{Thuan} \\& {Izotov}(2005)}]{2005ApJS..161..240T}\n{Thuan}, T.~X. \\& {Izotov}, Y.~I. 2005, \\apjs, 161, 240\n\n\\bibitem[{{Tremonti} {et~al.}(2004){Tremonti}, {Heckman}, {Kauffmann},\n  {Brinchmann}, {Charlot}, {White}, {Seibert}, {Peng}, {Schlegel}, {Uomoto},\n  {Fukugita}, \\& {Brinkmann}}]{2004ApJ...613..898T}\n{Tremonti}, C.~A., {Heckman}, T.~M., {Kauffmann}, G., {et~al.} 2004, \\apj, 613,\n  898\n\n\\end{thebibliography}\n\n\n\n\\appendix\n\\section{Number of false positives and negatives}\\label{appendix}\nFor the sake of compactness, we will use the symbol $X_i$ to denote the value of \n12+log(O/H) in the i-th XMP galaxy.\nBy definition, $X_i < X_0$, with $X_0$ the threshold to be XMP.\nBayes's theorem \\citep[e.g.,][]{martin71}\nprovides the probability that the true metallicity is $X$ given that\nwe have observed $X_i$,  \n\n", "index": 31, "text": "\\begin{equation}\nP(X| X_i)=P(X_i|X)\\, H(X)/P(X_i),\n\\label{false1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"P(X|X_{i})=P(X_{i}|X)\\,H(X)/P(X_{i}),\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">|</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "  \n\nIf $X$ is larger than the threshold metallicity $X_0$,\nEq.~(\\ref{false1}) provides the probability that the galaxy gives a false positive \nif its true metallicity is $X$. Since the true metallicity yielding false positives\ncan be any value larger than the threshold, the total probability of a false positive \n$P(X \\geq X_0|X_i)$ is just the sum over all possibilities, i.e.,\nan integral of  Eq.~(\\ref{false1}) for all $X \\geq X_0$, namely, \n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $P(X_i|X)$ stands for the probability of measuring $X_i$ when the true metallicity is \n$X$, $H(X)$ represents the probability the galaxy has a true metallicity $X$, and\n$P(X_i)$ corresponds to the probability that the measured metallicity of the galaxy\nis $X_i$ considering all possible values of the true metallicity, i.e.,\n\n", "index": 33, "text": "\\begin{equation}\nP(X_i)=\\int_{-\\infty}^\\infty P(X_i|X)\\,H(X)\\,dX.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"P(X_{i})=\\int_{-\\infty}^{\\infty}P(X_{i}|X)\\,H(X)\\,dX.\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi mathvariant=\"normal\">∞</mi></mrow><mi mathvariant=\"normal\">∞</mi></msubsup><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>X</mi><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nAssuming the distribution of observational errors to be Gaussian, the probability of \nmeasuring $X_i$ when the true metallicity is $X$ turns out to be,\n\n", "itemtype": "equation", "pos": 108634, "prevtext": "  \n\nIf $X$ is larger than the threshold metallicity $X_0$,\nEq.~(\\ref{false1}) provides the probability that the galaxy gives a false positive \nif its true metallicity is $X$. Since the true metallicity yielding false positives\ncan be any value larger than the threshold, the total probability of a false positive \n$P(X \\geq X_0|X_i)$ is just the sum over all possibilities, i.e.,\nan integral of  Eq.~(\\ref{false1}) for all $X \\geq X_0$, namely, \n\n", "index": 35, "text": "\\begin{equation}\nP(X \\geq X_0 | X_i)=\\int_{X_0}^\\infty P(X_i|X)\\,H(X)\\,dX\\Big/\\int_{-\\infty}^\\infty P(X_i|X)\\,H(X)\\,dX.\n\\label{false2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"P(X\\geq X_{0}|X_{i})=\\int_{X_{0}}^{\\infty}P(X_{i}|X)\\,H(X)\\,dX\\Big{/}\\int_{-%&#10;\\infty}^{\\infty}P(X_{i}|X)\\,H(X)\\,dX.\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo>≥</mo><msub><mi>X</mi><mn>0</mn></msub><mo stretchy=\"false\">|</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi>X</mi><mn>0</mn></msub><mi mathvariant=\"normal\">∞</mi></msubsup><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>X</mi><mo mathsize=\"160%\" stretchy=\"false\">/</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi mathvariant=\"normal\">∞</mi></mrow><mi mathvariant=\"normal\">∞</mi></msubsup><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>X</mi><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwith $\\sigma_i$ the error, i.e., the square root of the variance of the distribution of errors. \n\nEquation~(\\ref{false2}) quantifies the probability that a single galaxy gives a false positive,\ni.e., it gives the number of false positives per galaxy. When we consider the full \nset, then the total number of false positives $N_{\\rm false+}$ is the sum of the number \nof false positives for all XMP galaxies, \ni.e.,\n\n", "itemtype": "equation", "pos": 108936, "prevtext": "\nAssuming the distribution of observational errors to be Gaussian, the probability of \nmeasuring $X_i$ when the true metallicity is $X$ turns out to be,\n\n", "index": 37, "text": "\\begin{equation}\nP(X_i|X)=\\exp\\big\\{-{{1}\\over{2}}[(X_i-X)/\\sigma_i]^2\\big\\}/\\sqrt{2\\pi}\\sigma_i,\n\\label{false3a}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"P(X_{i}|X)=\\exp\\big{\\{}-{{1}\\over{2}}[(X_{i}-X)/\\sigma_{i}]^{2}\\big{\\}}/\\sqrt{%&#10;2\\pi}\\sigma_{i},\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mi>exp</mi><mrow><mo maxsize=\"120%\" minsize=\"120%\">{</mo><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>i</mi></msub><mo>-</mo><mi>X</mi><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><msub><mi>σ</mi><mi>i</mi></msub><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><mo maxsize=\"120%\" minsize=\"120%\">}</mo></mrow><mo>/</mo><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><msub><mi>σ</mi><mi>i</mi></msub><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\n\nBy definition, false negatives are true XMPs than end up having  $X_i > X_0$.\nThe number of false negatives, $N_{\\rm false-}$,  can be \nworked out in a way similar to the derivation of $N_{\\rm false+}$. This time the sum \nis over all non-XMP galaxies,\n\n", "itemtype": "equation", "pos": 109480, "prevtext": "\nwith $\\sigma_i$ the error, i.e., the square root of the variance of the distribution of errors. \n\nEquation~(\\ref{false2}) quantifies the probability that a single galaxy gives a false positive,\ni.e., it gives the number of false positives per galaxy. When we consider the full \nset, then the total number of false positives $N_{\\rm false+}$ is the sum of the number \nof false positives for all XMP galaxies, \ni.e.,\n\n", "index": 39, "text": "\\begin{equation}\nN_{\\rm false+}=\\sum_{i}^{\\forall\\, {\\rm XMP}}\\,P(X \\geq X_0 | X_i).\n\\label{false4a}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm false+}=\\sum_{i}^{\\forall\\,{\\rm XMP}}\\,P(X\\geq X_{0}|X_{i}).\" display=\"block\"><mrow><msub><mi>N</mi><mrow><mi>false</mi><mo>+</mo></mrow></msub><mo>=</mo><mpadded width=\"+1.7pt\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><mrow><mo rspace=\"4.2pt\">∀</mo><mi>XMP</mi></mrow></munderover></mpadded><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo>≥</mo><msub><mi>X</mi><mn>0</mn></msub><mo stretchy=\"false\">|</mo><msub><mi>X</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\nwith \n\n", "itemtype": "equation", "pos": 109849, "prevtext": "\n\nBy definition, false negatives are true XMPs than end up having  $X_i > X_0$.\nThe number of false negatives, $N_{\\rm false-}$,  can be \nworked out in a way similar to the derivation of $N_{\\rm false+}$. This time the sum \nis over all non-XMP galaxies,\n\n", "index": 41, "text": "\\begin{equation}\nN_{\\rm false-}=\\sum_j^{\\forall\\,{\\rm non-XMP}}\\,P(X < X_0 | X_j),\n\\label{false5}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm false-}=\\sum_{j}^{\\forall\\,{\\rm non-XMP}}\\,P(X&lt;X_{0}|X_{j}),\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>false</mi><mo>-</mo></mrow></msub><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi><mrow><mrow><mo rspace=\"4.2pt\">∀</mo><mi>non</mi></mrow><mo>-</mo><mi>XMP</mi></mrow></munderover></mpadded><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>X</mi><mo>⁢</mo><mrow><mo>&lt;</mo><msub><mi>X</mi><mn>0</mn></msub><mo fence=\"true\" stretchy=\"false\">|</mo></mrow><mo>⁢</mo><msub><mi>X</mi><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\ngiving the probability of being XMP even though the measured metallicity $X_j$ is larger than\nthe threshold $X_0$. \n\nAssuming that the probability density function of possible oxygen abundances $H(X)$\nis given by the observed histogram of abundances in  Fig.~\\ref{distribution}b, and \nusing the metallicities and their errors derived in Sect.~\\ref{list_of_xmp}, \nEqs.~(\\ref{false2}), (\\ref{false3a}), (\\ref{false4a}), (\\ref{false5}), and (\\ref{false6}) yield,\n\n", "itemtype": "equation", "pos": 109968, "prevtext": "\nwith \n\n", "index": 43, "text": "\\begin{equation}\nP(X < X_0 | X_j)=\\int^{X_0}_{-\\infty} P(X_j|X)\\,H(X)\\,dX\\Big/\\int_{-\\infty}^\\infty P(X_j|X)\\,H(X)\\,dX,\n\\label{false6}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"P(X&lt;X_{0}|X_{j})=\\int^{X_{0}}_{-\\infty}P(X_{j}|X)\\,H(X)\\,dX\\Big{/}\\int_{-%&#10;\\infty}^{\\infty}P(X_{j}|X)\\,H(X)\\,dX,\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo>&lt;</mo><msub><mi>X</mi><mn>0</mn></msub><mo stretchy=\"false\">|</mo><msub><mi>X</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi mathvariant=\"normal\">∞</mi></mrow><msub><mi>X</mi><mn>0</mn></msub></msubsup><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>X</mi><mo mathsize=\"160%\" stretchy=\"false\">/</mo><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mo>-</mo><mi mathvariant=\"normal\">∞</mi></mrow><mi mathvariant=\"normal\">∞</mi></msubsup><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>X</mi><mi>j</mi></msub><mo stretchy=\"false\">|</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>H</mi><mrow><mo stretchy=\"false\">(</mo><mi>X</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mi>d</mi><mi>X</mi><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\n\\begin{displaymath}\nN_{\\rm false-}\\simeq 46.\n\\end{displaymath}\nIf we assume a uniform distribution of abundances in the interval $7 \\leq 12+\\log({\\rm O/H}) \\leq 8.5$, then  \n\n", "itemtype": "equation", "pos": 110578, "prevtext": "\ngiving the probability of being XMP even though the measured metallicity $X_j$ is larger than\nthe threshold $X_0$. \n\nAssuming that the probability density function of possible oxygen abundances $H(X)$\nis given by the observed histogram of abundances in  Fig.~\\ref{distribution}b, and \nusing the metallicities and their errors derived in Sect.~\\ref{list_of_xmp}, \nEqs.~(\\ref{false2}), (\\ref{false3a}), (\\ref{false4a}), (\\ref{false5}), and (\\ref{false6}) yield,\n\n", "index": 45, "text": "\\begin{equation}\nN_{\\rm false+}\\simeq 82,\n\\label{false3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm false+}\\simeq 82,\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>false</mi><mo>+</mo></mrow></msub><mo>≃</mo><mn>82</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01631.tex", "nexttext": "\n\n\n\n", "itemtype": "equation", "pos": 110824, "prevtext": "\n\\begin{displaymath}\nN_{\\rm false-}\\simeq 46.\n\\end{displaymath}\nIf we assume a uniform distribution of abundances in the interval $7 \\leq 12+\\log({\\rm O/H}) \\leq 8.5$, then  \n\n", "index": 47, "text": "\\begin{equation}\nN_{\\rm false+}\\simeq N_{\\rm false-} \\simeq 55.\n\\label{false4}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"N_{\\rm false+}\\simeq N_{\\rm false-}\\simeq 55.\" display=\"block\"><mrow><mrow><msub><mi>N</mi><mrow><mi>false</mi><mo>+</mo></mrow></msub><mo>≃</mo><msub><mi>N</mi><mrow><mi>false</mi><mo>-</mo></mrow></msub><mo>≃</mo><mn>55</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}]