[{"file": "1601.05234.tex", "nexttext": "\nFitting this formula convolved with the IRF to the data presented in\n\\ref{figs2} (a) yields $T_1=641 \\pm 64$.\n\nPower dependent linewidth measurements of the exciton which are shown in Fig.\\,\n\\ref{figs2}\\,(b) yield the $T_2$ time. The power dependence of the linewidth of\na TLS is given by \n", "itemtype": "equation", "pos": 25274, "prevtext": "\n\\textasciitilde \n\n\\title{Photon-Statistics Excitation Spectroscopy of a Single Two Level System}\n\n\\author{Max Strau\\ss} \n\\email{max.strauss@physik.tu-berlin.de}\n\\affiliation{Institut f\\\"ur Festk\\\"orperphysik, Quantum Devices Group, Technische Universit\\\"at Berlin,\nHardenbergstra{\\ss}e 36, EW 5-3, 10623 Berlin, Germany}\n\\author{Marlon Placke}\n\\affiliation{Institut f\\\"ur Festk\\\"orperphysik, Quantum Devices Group, Technische Universit\\\"at Berlin,\nHardenbergstra{\\ss}e 36, EW 5-3, 10623 Berlin, Germany}\n\\author{S\\\"oren Kreinberg}\n\\affiliation{Institut f\\\"ur Festk\\\"orperphysik, Quantum Devices Group, Technische Universit\\\"at Berlin,\nHardenbergstra{\\ss}e 36, EW 5-3, 10623 Berlin, Germany}\n\\author{Christian Schneider}\n\\affiliation{Technische Physik, Physikalisches Institut, Wilhelm Conrad\nR\\\"ontgen Center for Complex Material Systems, Universit\\\"at W\\\"urzburg, 97074\nW\\\"urzburg, Germany}\n\\author{Martin Kamp}\n\\affiliation{Technische Physik, Physikalisches Institut, Wilhelm Conrad\nR\\\"ontgen Center for Complex Material Systems, Universit\\\"at W\\\"urzburg, 97074\nW\\\"urzburg, Germany}\n\\author{Sven H\\\"ofling}\n\\affiliation{Technische Physik, Physikalisches Institut, Wilhelm Conrad\nR\\\"ontgen Center for Complex Material Systems, Universit\\\"at W\\\"urzburg, 97074\nW\\\"urzburg, Germany}\n\\affiliation{SUPA, School of Physics and Astronomy, Univeristy of St. Andrews,\nSt. Andrews KY16 9SS, United Kingdom}\n\n\\author{Janik Wolters}\n\\affiliation{Institut f\\\"ur Festk\\\"orperphysik, Quantum Devices Group,\nTechnische Universit\\\"at Berlin, Hardenbergstra{\\ss}e 36, EW 5-3, 10623 Berlin, Germany}\n\\affiliation{Present address: Department of Physics, University of Basel,\nKlingelbergstra{\\ss}e 82, CH-4056 Basel, Switzerland}\n\\author{Stephan Reitzenstein }\n\\affiliation{Institut f\\\"ur Festk\\\"orperphysik, Quantum Devices Group, Technische Universit\\\"at Berlin,\nHardenbergstra{\\ss}e 36, EW 5-3, 10623 Berlin, Germany}\n\n\\begin{abstract}\nWe investigate the influence of the photon statistics on the excitation dynamics of a single\ntwo level system. A single semiconductor quantum dot represents the two level\nsystem and is resonantly excited either with coherent laser light, or excited\nwith chaotic light, with photon statistics corresponding to that of thermal\nradiation. Experimentally, we observe a reduced absorption cross-section under\nchaotic excitation in the steady-state. In the transient regime, the Rabi\noscillations observable under coherent excitation disappear under chaotic\nexcitation. Likewise, in the emission spectrum the well-known Mollow triplet,\nwhich we observe under coherent drive, \ndisappears under chaotic excitation. Our observations are fully consistent\nwith theoretical predictions based on the semi-classical Bloch equation\napproach. They represent a landmark in the resonant excitation of the quantum\nmechanical two level system.\n\\end{abstract}\n\n\\maketitle  \n\nThe fermionic two level system (TLS) is the prototype of a quantum system. \nAs a realization of the quantum bit it finds a plethora of applications in\nquantum information\nprocessing\\,\\cite{Devoret2013a,0953-8984-18-21-S08,Nielsen2010}.\nHence it is not surprising that two level systems under coherent excitation, e.g. under excitation \nwith laser light or microwaves, are vastly studied and constitute a principal\ntopic in any textbook on quantum physics.\nToday, the interaction of individual TLSs with coherent radiation or even single photons is routinely studied \nin many experiments with single atoms and ions in the gas phase, defect centers in wide band-gap materials\nor semiconductor quantum dots\\,\\cite{Leibfried2003,Meyer2015,Wolters2013a}.\nThese experiments form the basis of many exciting applications in quantum technology.\nInterestingly, until now the influence of the excitation statistics on TLSs\nhas not been experimentally explored, neither in atomic nor in solid state\nsystems.\nThe underlying physics of this open question is of great interest from a fundamental point of\nview and is also motivated by the fact that coherent excitation conditions are rather artificial as virtually all\n radiation occurring in nature, e.g.  black-body radiation or bremsstrahlung, is\nof chaotic nature.\\\\\nIn this letter we set out to experimentally investigate\nthe resonant excitation of single semiconductor quantum dots in\nthe so far unexplored regime of resonant driving with chaotic light. \nIn our comprehensive studies we compare fluorescence intensity, emission spectra \nand dynamics of a two level system represented by a semiconductor quantum\ndot (QD) under excitation with coherent and chaotic light.\nIn the steady-state, we find a reduced absorption cross-section under chaotic\nexcitation.\n\n\nIn addition, in the emission spectrum the well-known Mollow triplet present\nunder coherent drive of the TLS disappears under chaotic excitation, and likewise no signatures of Rabi oscillations\n are observed in the time domain.\nAt the same time, the non-classical character of the photon emission of the TLS\nis preserved under chaotic excitation, as shown in second order auto-correlation measurements.\nAll of these experimental findings are in excellent agreement with a\nquantum mechanical description of the experimental condition.\n\nCoherent light exhibits a Poissonian photon number distribution, where the\nprobability $p_{\\textrm{pd}}(n)$ to observe a certain photon number $n$ is given\nby\n\\begin{eqnarray}\np_{\\textrm{pd}}(n)&=&\\frac{{\\langle{{\\hat n}}\\rangle}^{n}\\exp(-{\\langle{{\\hat n}}\\rangle})}{n!},\n\\end{eqnarray}\nwhere the mean photon number is ${\\langle{{\\hat n}}\\rangle}={\\langle{{\\hat a^{\\dag}\\hat a}}\\rangle}$,\nwith the conventional creation (annihilation) operator $\\hat a^{\\dag}$ ($\\hat a$). \nThe standard deviation of the photon number is given by $\\Delta\nn=\\sqrt{{\\langle{{\\hat n}}\\rangle}}$ and for\n large ${\\langle{{\\hat n}}\\rangle}$ the intensity fluctuations become negligible.\nAssuming stationarity, the second order auto-correlation function   \n\\begin{eqnarray}\ng^{(2)}(\\tau)&=&\\frac{{\\langle{{:\\hat n(0)\\hat n(\\tau):}}\\rangle}}{{\\langle{{\\hat n(0)}}\\rangle}^{2}},\n\\end{eqnarray}\nwith $:...:$ indicating normal ordering, is constant $g^{(2)}(\\tau)=1$.\nConventional laser radiation well above the laser threshold is a very accurate\nrealization of such coherent light.\n\\begin{figure}[htbp]\n\\center  \n\\includegraphics[width=0.5\\textwidth]{Aufbau_skizze.eps}  \n\\caption{(Color online) (a) Sketch of the implemented Martienssen lamp.\n(b) Sketch of experimental setup: Polarization filtering\nused to distinguish resonant fluorescence (RF) from light source (LS).  \n Akronyms used in sketch: \nEOM \\textit{electro optical modulator},\n\nLP \\textit{linear polariser},\nMO \\textit{microscope objective}\nPBS \\textit{polarising beam splitter}\n\nSPCM \\textit{single photon counting module}   \n(c) Measured $g^{(2)}(\\tau)$-function of the chaotic light source.\nThe red, solid line is a fit of\n$f(\\tau)=~1~+~A~\\textrm{exp}(-\\pi(\\frac{\\tau}{\\tau_{\\textrm{corr}})^2})$ to\nthe data giving a correlation time of 0.9\\,$\\mu$s. (d) Simplified picture of\nexperiment illustrating different photon statistics involved in the experiment.}\n\\label{fig:aufbau}\n\\end{figure} \n  \nIn contrast, chaotic light follows the Bose-Einstein statistics and the\nprobability $p_{\\textrm{ch}}(n)$ to observe a certain photon number $n$ is given\nby\n\\begin{eqnarray}\np_{\\textrm{ch}}(n)&=&\\frac{{\\langle{{\\hat n}}\\rangle}^{n}}{(1+{\\langle{{\\hat n}}\\rangle})^{n+1}}.\\label{eq:chaotic_distribution}\n\\end{eqnarray}\nThe  fluctuations of the photon number are given by $\\Delta\nn=\\sqrt{{\\langle{{\\hat n}}\\rangle}+{\\langle{{\\hat n}}\\rangle}^{2}}$. For large \n${\\langle{{\\hat n}}\\rangle}$ the fluctuations of the photon number are on the order of the average photon number ${\\langle{{\\hat n}}\\rangle}$. Assuming stationarity, the Fourier transform of the spectrum\n$g^{(1)}(\\tau)={\\langle{{\\hat a^{\\dag}(0)\\hat a(\\tau)}}\\rangle}/{\\langle{{\\hat n}}\\rangle}$ of a\nchaotic light field determines its second order auto-correlation function:\n\\begin{eqnarray}\ng^{(2)}(\\tau)&=&1+|g^{(1)}(\\tau)|^{2}.\n\\end{eqnarray}\n\nObviously  $g^{(2)}(0) = 2$, i.e. chaotic light shows photon bunching leading to considerable effects\n in non-linear spectroscopy, e.g. an enhanced two-photon\n absorption probability\\,\\cite{Carmele2009,Kazimierczuk2015,Boitier2009}.\nIdeal black-body radiation, or emission from an infinite number of independent emitters are natural sources \nof chaotic light\\,\\cite{Loudon2001}. \nHowever, as these sources have limited spectral brightness and \\'etendue, their\nuse in nonlinear spectroscopy is very restricted.\nTo circumvent these limitations, we implement a chaotic light source with a\nGaussian spectrum, also known as Martienssen \nlamp\\,\\cite{Martienssen1964,Arecchi1965, Martienssen1966}, by reflecting a\nfocused laser beam on a circular diffuser (1500\\,Grit) moving with a constant\nvelocity of $v \\approx  10$\\,m/s at a radius of 10\\,mm (see Fig.\\,1\\,(a)).\nThe diffuse reflection on the multitude of moving scatterers introduces Doppler\nbroadening of the spectrum and chaotic intensity fluctuations.\nFig.\\,1\\,(c) shows the measured second-order autocorrelation function of the\nused source, exhibiting a second-order correlation time of $\\tau^{(2)}_{\\textrm{corr}} =\n(901.8 \\pm 0.9)$\\,ns according to a Gaussian fit (red trace) of the correlation function. \nFurthermore, the $g^{(2)}(0)$ value of 2.05 shows that the source produces light\nwith almost perfect thermal statistics at an emission linewidth of 1.1 MHz,\nwhere the slight deviations can be attributed to mechanical instabilities of the setup leading to an increased\nbunching. \n\nAs TLS we use single self assembled InGaAs quantum dots grown by molecular beam\nepitaxy (MBE) embedded in a planar low-Q distributed Bragg reflector (DBR)\ncavity consisting of 24 lower and 5 upper mirror pairs. The presence of\nnaturally occurring, micron sized photonic defects on the sample enhances the\nbrightness of the photon flux\\,\\cite{Maier2014}.\nThe sample is mounted inside a helium flow cryostat and kept at a constant\ntemperature of 5.5\\,K.  \nFor experiments with coherent excitation light, we use a commercial continuous wave\n(cw) external cavity diode laser, while simultaneously a low\npower, non-resonant He-Ne laser ($<$\\,0.1\\,nW, 637\\,nm) is used to stabilize \nthe quantum dot fluorescence\\,\\cite{Nguyen2012}.\nDirectly reflected light is filtered by a combination of polarization and\nspatial filtering prior to detection, while photons scattered by the QD are\ndetected by a single photon counting module (SPCM) (cf. Fig.\\,1\\,(b)).\n\n\nFor simulating the coherent excitation experiments, we follow the\nsemi-classical Bloch equation approach\\,\\cite{Allen1975}.\nThis is well justified, as for laser powers $P$ on the order of a\nfew nW, the average photon numbers of the excitation ${\\langle{{\\hat n}}\\rangle}$ are large\nand the relative photon number fluctuations $\\delta  n= \\Delta n/{\\langle{{\\hat n}}\\rangle}$ vanish.\nIn this limit, the Rabi frequency $\\Omega \\sim \\sqrt{{\\langle{{\\hat n}}\\rangle}}$ is fix, i.e. not subject to quantum fluctuations. \nIn this regime the resonance fluorescence intensity is directly\nproportional to the average exciton population\n${\\langle{{\\rho_{\\textrm{X}}(t)}}\\rangle}_{\\textrm{pd}}$. \n\n\\begin{figure}[htbp]  \n\\center\n\\includegraphics[width=0.5\\textwidth]{Saett.eps} \n\\caption{(Color online) Blue (Black) dots: Saturation behaviour of\nTLS under coherent (chaotic) excitation. The dashed lines represent simulations\nof the respective experimental conditions. The inset shows the laser scan\nacross resonance at an intensity of 0.1 S. Two excitonic transitions are visible with a\nfinestructure splitting of 9.1\\,GHz (37.6\\,$\\mu$eV). \nThe excitation power is\nrescaled in units of the dimensionless saturation parameter\n$S=I/I_{\\textrm{sat}}=\\Omega^2 T_1 T_2$.}\n\\label{fig:saett} \n\\end{figure}\n\nIn the steady state one finds\n\\begin{eqnarray}\n {\\langle{{\\rho_{\\textrm{X}}}}\\rangle}_{\\textrm{pd}}&=&\\frac{1}{2}\\frac{\\Omega^{2}\nT_{1}/T_{2}}{\\Delta\\omega^{2}+1/T_{2}^{2} +\\Omega^{2}\nT_{1}/T_{2}},\\label{eq:saturation_curve}\n\\end{eqnarray}\n\n\nwith $\\Delta\\omega$ being the laser detuning with respect to exact resonance,\n$T_{1}$ the exciton lifetime in the QD and $T_{2}$ the\ncoherence time of the exciton\\,\\cite{Flagg2009}.\n\nFor chaotic light with a correlation time much longer than the coherence time of\nthe TLS ($T_2 \\leq 1$\\,ns), the TLS's response can be calculated by\naveraging the excited state population\n${\\langle{{\\rho_{\\textrm{X}}(t)}}\\rangle}_{\\textrm{pd}}$ over the photon number\ndistribution given in Eq.\n\\ref{eq:chaotic_distribution}:\n\\begin{eqnarray}\n{\\langle{{\\rho_{\\textrm{X}}}}\\rangle}_{\\textrm{ch}}&=&\\sum_{n}p_{\\textrm{ch}}(n){\\langle{{\\rho_{\\textrm{X}}(n)}}\\rangle}_{\\textrm{pd}}\\nonumber\\\\\n&\\approx&\\int_{0}^{\\infty}\\mathrm d \\Omega^{2}\n\\frac{{\\langle{{\\rho_{\\textrm{X}}}}\\rangle}_{\\textrm{pd}}}{\\bar{\\Omega}^{2}} \\exp \\left(-\n\\Omega^{2}/\\bar{\\Omega}^{2}\\right),\n\\label{eq:chaotic_exciton} \\end{eqnarray}\nwhere  $\\bar{\\Omega}$ is the Rabi frequency corresponding to a coherent light field with the\nsame average intensity. \nThe integral in Eq.\\,\\ref{eq:chaotic_exciton} can\nbe solved analytically\\,\\cite{Georges1979} and it turns out that excitation of a\nTLS with chaotic light is always less effective than excitation with coherent light.\nThis can be intuitively understood, as only one photon is absorbed to generate\nan exciton and the remaining bunched photons cannot be absorbed by the TLS. The\ntheoretical prediction of Eq.\\,\\ref{eq:chaotic_exciton} is in good agreement\nwith the measurement shown in Fig.\\,2.\n\n\n\\begin{figure}[htbp] \n\\center\n\\includegraphics[width=0.5\\textwidth]{Rabi.eps} \n\\caption{(Color online) Time trace (dots) of light scattered by a single QD upon\nresonant excitation by 2\\,ns square pulses (rescaled: filled curves). Upper\npanel:\n Excitation by coherent light shows Rabi oscillations of the exciton for three\n different average Rabi frequencies $\\bar{\\Omega}~$(approximately 5.2, 6.6 and\n 7.2\\,GHz, respectively). Lower panel:\nExcitation by chaotic light by pulses of the same intensity creates no\noscillations.\nThe solid line represent simulations based on the optical Bloch equations as\ndescribed in the main text.}\n\\label{fig:Rabi}\n\\end{figure}\n\n\nIn the transient regime, the well-known Rabi oscillations are the most prominent\nfeature of two level systems interacting with a coherent field.\nWhile quantum fluctuations of a coherent field can in principle lead to marked deviations from the classical light field, \ne.g. the collapse and subsequent revival of Rabi\noscillations\\,\\cite{Rempe1987,Mukamel2015a}, their influence on our experiments\nis negligible. \nFor chaotic light, this regime has been studied theoretically and it has\nbeen predicted that Rabi oscillations should be suppressed by the fluctuations\npresent in chaotic fields\\,\\cite{Knight1982}.\nTo experimentally verify these predictions, we use an electro-optical modulator\n(EOM) to temporally shape the emission of the cw light source into square pulses\nwith a length of 2\\,ns and a repetition rate of 10\\,MHz.\nThe arrival times of photons scattered by the QD are recorded and histogrammed\nover an integration time of a few minutes.\n\nThe measurements under coherent resonant excitation of the TLS are depicted in\nthe upper panel in Fig.\\,3. They show clear Rabi oscillations being damped by\nradiative and pure dephasing present in the solid state system\\,\\cite{Ramsay2010,Kuhlmann2015}. \nThis result is in excellent agreement with the numerical solutions of the\nsemi-classical Bloch equations, where $T_2=(325\\pm5)$\\,ps and\n$T_1=(641\\pm 62)$\\,ps were determined from independent linewidth and\n$g^{(2)}(\\tau)$ measurements, respectively.\nIn stark contrast, the time resolved fluorescence signal upon chaotic\nexcitation bears no signatures of coherence generated in the TLS. This is a direct\n consequence of the pronounced intensity fluctuations of the chaotic field.\n\n\n\n\\begin{figure}[htbp]\n\\center \n\\includegraphics[width=0.5\\textwidth]{Mollow.eps}  \n\\caption{(Color online) Emission spectrum of the strongly driven QD for three\ndifferent average Rabi frequencies. The panel (a) on the left displays the\nresults obtained for coherent excitation. The T-line of the Mollow triplett is clearly visible.\nInset: Complete emission spectrum highlighting displayed part of Mollow triplet.\nFor chaotic excitation, shown in panel (b), no sidepeaks are discernible.\nThe dashed lines represent simulations corresponding to the experimental\nconditions.}\n\\label{fig:Mollow}\n\\end{figure}  \n\nBesides Rabi oscillations, the iconic Mollow triplet is a further\nhallmark of resonance fluorescence using coherent excitation.\n It consists of one central peak\n(at frequency $\\nu _0$) and two symmetrically shifted satellite peaks (at $\\nu\n_0 \\pm \\Omega $). It is a consequence of the interaction of a two level system\nwith an intense coherent light field and can be handily interpreted in\nthe framework of dressed states as was first proposed by Cohen-Tannoudji et al.\\,\\cite{Cohen-Tannoudji1977}.\nHowever, this picture only holds in the the case of ${\\langle{{\\hat n}}\\rangle} \\gg\n{\\langle{{\\Delta \\hat{n}}}\\rangle} \\gg 1$, which is true for a coherent state but not\nfor chaotic light where ${\\langle{{\\hat n}}\\rangle} = {\\langle{{\\Delta \\hat{n}}}\\rangle}$. \nThus, for the chaotic case, it has been predicted that the two satellite peaks\nshould disappear\\,\\cite{Avan1977,Georges1979}.\n\n\n\nTo experimentally observe the satellite peaks which \nare purely part of the incoherently scattered fraction of the total fluorescence\nat high excitation power we use a scanning Fabry-Perot resonator with a free\nspectra range of 26.4\\,GHz (109.4\\,$\\mu eV$) and a resolution of 175.4\\,MHz\n(725.4\\,neV).\nPlotted in Fig.\\,4\\,(a) is the  right wing of the Mollow triplet (T-line) under\nstrict resonant excitation for three different average Rabi frequencies.\nThe satellite peak is clearly visible under coherent excitation.\nThe experimental data is in good agreement with the predicted power spectrum\nincluding pure dephasing \\cite{Matthiesen2012}.\nExcitation induced dephasing which leads to a broadening of the Mollow\nsidepeaks at high excitation power \\cite{Ulrich2011}, is not included in the\ntheory and therefore likely to cause the deviations between theory and experiment at higher\nRabi frequencies.\n\nIn contrast, under chaotic excitation (Fig.\\,4\\,(b)) the Mollow triplet cannot\nbe observed under otherwise identical excitation conditions.\nThis is again a direct consequence of the large intensity fluctuations present\nin the chaotic light field and can be quantitatively explained\nby averaging the power dependent spectra over the  photon number distribution given in Eq. (3).\n\\begin{figure}[htbp]\n\\center\n\\includegraphics[width=0.45\\textwidth]{g2.eps} \n\\caption{(Color online) $g^{(2)}(\\tau)$-measurement of the emitted radiation.\nThe excitonic transition is driven at a Rabi frequency of\n$\\Omega\\approx0.34$\\,GHz (0.6\\,S). (a) Measurement using the laser as light\nsource (solid line). The dashed line shows a convolution of the\nsolution for a two-level system with the detector response and provides very\ngood agreement with the experimental data. (b) Measurement using the Martienssen\nlamp as light source. \nIn both measurements pronounced anti-bunching is visible at $\\tau=0$.}\n\\label{fig:g2}\n\\end{figure}\nWhile the previous experiments have shown that the interaction of a TLS with a\nlight field differs significantly depending on the photon statistics inherent in\nthe exciting light field, it is also very interesting to explore its influence\non the emission statistics of the TLS.\n\nFor this purpose, a Hanbury-Brown\nand Twiss setup consisting of a fiber-based 50:50 beam splitter and two\nSPCMs (timing resolution 531\\,ps) is used to measure the second-order\nautocorrelation function.\nIn Fig.\\,5\\,(a), the measured $g^{(2)}(\\tau)$, normalized to the average\ncount rate during the experiment under coherent excitation is\nshown. Superimposed onto the antibunching dip at $\\tau=0$, as is expected for a single TLS, pronounced bunching is observed for larger $\\tau$.\nThis is typical for resonance fluorescence experiments on QDs and is attributed\nto blinking of the QD\\,\\cite{Ulhaq2012}.   \nIn Fig.\\,5\\,(b) the same measurement is shown for chaotic excitation. Here, the\nantibunching is visible with an increased bunching compared to the coherent case.\nThus, as intuitively expected, the\nnon-classical nature of the emitted radiation is unaffected by the photon\nstatistics of the exciting light field.\nIn this regard, it is also noteworthy that without careful renormalisation of\nthe autocorrelation data no direct difference between the two types\nof excitation would be observable.\n \nIn conclusion, our experiments show that the response of a quantum mechanical two level system is very sensitive\nto the photon statistics of the exciting light field. While differences are already visible\nin the saturation behavior of the TLS, the more striking differences occur in\nthe transient regime, where Rabi oscillations are suppressed under chaotic\nexcitation.\nFurthermore, the emission spectrum under strong excitation depends dramatically\non the higher order correlation functions of the exciting light field. Thus, the\niconic Mollow triplet disappears under chaotic excitation.\nWith its nonlinear nature, the fermionic TLS is an ideal probe for the fluctuations present in the light field.\nFuture experiments will be directed towards exploring the regime of short correlation times in the excitation field,\nbeing on the order of or even shorter than the coherence time of the TLS. Also,\nextending photon-statistics excitation spectroscopy to non-classical light\nsources will be highly interesting.\n\nWe thank M. A\\ss mann and A. Carmele for stimulating discussions. \nThe research leading to these results has received funding from from the\nEuropean Research Council under the European Union's Seventh Framework ERC Grant Agreement\nNo. 615613 and from the German Research Foundation via the project RE2974/5-1.\n\n\n\n\n\n\n\n\\section{\\underline{Supplemental material:} Photon-Statistics\nExcitation Spectroscopy of a Single Two Level System}\n\\setcounter{figure}{0}\n\\section{Emission spectrum}\nThe emission spectra shown in the main text were recorded using a\ncustom-built closed-loop scanning Fabry-Perot cavity (FPI) with a spectral\nresolution of 175\\,MHz. The instrument response function (IRF)\nof the FPI is displayed in Fig.\\,\\ref{figs1}.\n\nFor the analysis of the experimental\nresults, a convolution of the analytical solution for the Mollow triplet with\nthe IRF was fitted to the data obtained under coherent excitation.\n\n\\begin{figure}[htbp] \n\\center\n\\includegraphics[width=0.5\\textwidth]{IRFs_SI.eps} \n\\caption{(Color online) Instrument response functions for FPI (a) and\nintensity autocorrelation (b) measurements. (a) Response of the FPI to the cw-\ndiode laser ($\\Delta \\omega \\approx 100$\\,kHz) is shown fitted with a Lorentzian\nyielding a FWHM of 175\\,MHz.\n(b) Response of the intensity autocorrelation measurement (black dots) yielding\na $\\Delta \\tau_{IRF}= 351$\\,ps as extracted from a Gaussian fit to the data. }\n\\label{figs1}\n\\end{figure}\n\\section{Rabi oscillations}\nThe square pulses used for this experiment were generated using an\nfiber-based EOM which was voltage modulated using an\narbitrary wave form generator (AWG) with a bandwidth of 5 GHz. The photons scattered by \nthe QD were recorded using a Silicon-based avalanche photo diode and\ntime-correlated single photon counting (TCSPC) electronics affording a temporal\nresolution of 40 ps.\n\\begin{figure}[htbp] \n\\center\n\\includegraphics[width=0.5\\textwidth]{tzeit_SI.eps} \n\\caption{(Color online) Measurements performed for determining $T_{1}$ and\n$T_{2}$. (a) Intensity autocorrelation measurement of photons emitted by the QD.\nA fit of Eq. \\ref{eqn:g2} convolved with the IRF to the data yields\n$T_1=641$\\,ps.\n(b) Dependence of the linewidth of the TLS on the excitation power (black dots). The solid line represents a fit of Eq.\n\\ref{eqn:pdlw} to the data giving $T_2=325$\\,ps. }\n\\label{figs2}\n\\end{figure}\nThe AWG supplied a trigger signal to the TCSPC electronics while the measurement\nwas stopped by the detection of a photon. The measurement was simulated using the standard\nsemi-classical Bloch equations where $\\rho_{11}=1-\\rho_{00}$\n($\\rho_{01}=\\rho_{10}^{*}$) represent the diagonal (off-diagonal) elements of\nthe density matrix of the TLS:\n\\begin{eqnarray}\n\\rho_{11}(t)=i \\frac{\\Omega_R(t)}{t} (\\rho_{10}-\\rho_{01})-\\frac{1}{T_1}\\rho_{11}(t)\\\\\n\\rho_{01}(t)=(i(\\Delta\\omega)-\\frac{1}{T2})\\rho_{01}(t)-i\\frac{\\Omega_R(t)(\\rho_{11}-\\rho_{00})}{2})\n\\label{eq:BGen}\n\\end{eqnarray}\nHere, $\\Delta \\omega =\\omega_l-\\omega_0$ denotes the detuning between laser and\nexciton transition which is zero for all experiments conducted in this study and\n$\\Omega_R(t)$ the time dependent Rabi frequency.\nThe system properties, i.e. the dephasing time $T_2$ and population decay time\n$T_1$, are determined independently from the experiments shown in Fig.\n\\ref{figs2} as follows. A $g^{(2)}(\\tau)$-measurement of the photons emitted\nby the TLS driven at a low Rabi frequency allows to extract the population decay\ntime $T_1$. In this limiting case, the second-order autocorrelation function is\ngiven by\n\n", "index": 1, "text": "\\begin{equation}\ng^{(2)}(\\tau)=1-\\textrm{exp}(-\\frac{|\\tau|}{T_1})~.\n\\label{eqn:g2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"g^{(2)}(\\tau)=1-\\textrm{exp}(-\\frac{|\\tau|}{T_{1}})~{}.\" display=\"block\"><mrow><mrow><mrow><msup><mi>g</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>τ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>1</mn><mo>-</mo><mrow><mtext>exp</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mfrac><mrow><mo stretchy=\"false\">|</mo><mi>τ</mi><mo stretchy=\"false\">|</mo></mrow><msub><mi>T</mi><mn>1</mn></msub></mfrac></mrow><mo rspace=\"5.8pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05234.tex", "nexttext": "\nFor low intensities, i.e. $\\Omega^2 \\rightarrow 0$, this expression tends\ntowards $\\Delta \\omega = \\frac{2}{T_2}.$\n\\section{$g^{(2)}(\\tau)$-measurement}  \nThe autocorrelation measurements were performed using a Hanbury-Brown and Twiss\nsetup with an overall timing resolution of 351\\,ps (cf. Fig.\\,\\ref{figs1}\\,(b)).\nThe resonance fluorescence of the quantum dots studied in this sample all\nexhibit bunching on the time scale of several 100\\,ns as is illustrated by the\nmeasurement in Fig.\\,\\ref{figs3}.\n\\begin{figure}[htbp]\n\\center\n\\includegraphics[width=0.5\\textwidth]{g2_SI.eps} \n\\caption{(Color online) Intensity autocorrelation measurement showing pronounced\nbunching on long timescales. A bidirectional exponential is fit to the data\n(dashed line) giving a time constant $\\tau=405$\\,ns. Inset:\nAntibunching is observed on a ns timescale where the onset of Rabi oscillations\nare visible.\n}\n\\label{figs3}\n\\end{figure}\n\\bibliography{QTS_TLS.bib}\n\n", "itemtype": "equation", "pos": 25662, "prevtext": "\nFitting this formula convolved with the IRF to the data presented in\n\\ref{figs2} (a) yields $T_1=641 \\pm 64$.\n\nPower dependent linewidth measurements of the exciton which are shown in Fig.\\,\n\\ref{figs2}\\,(b) yield the $T_2$ time. The power dependence of the linewidth of\na TLS is given by \n", "index": 3, "text": "\\begin{equation}\\Delta \\omega = \\frac{2}{T_2}\\sqrt{1+\\Omega ^2 T_1\nT_2} \\label{eqn:pdlw}~. \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\Delta\\omega=\\frac{2}{T_{2}}\\sqrt{1+\\Omega^{2}T_{1}T_{2}}~{}.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>ω</mi></mrow><mo>=</mo><mrow><mfrac><mn>2</mn><msub><mi>T</mi><mn>2</mn></msub></mfrac><mo>⁢</mo><mpadded width=\"+3.3pt\"><msqrt><mrow><mn>1</mn><mo>+</mo><mrow><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>T</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>T</mi><mn>2</mn></msub></mrow></mrow></msqrt></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]