[{"file": "1601.01346.tex", "nexttext": "\nwhich sums the interactions between H and O atoms ($i$) of the water model and \nC atoms ($j$) in the CNT (or graphene) model. Here $\\epsilon_{ij}$ represents \nthe respective attractive well depth and $\\sigma_{ij}$ is the root of the pair potential, i.e. the \npoint where attractive and repulsive part of the LJ potential cancel. Note that our \nLJ potentials are also used to implicitly model the CNT polarization by the water dipole moment; \nhence no partial charges are involved throughout the present work. As will be shown in detail below, \nthe $\\sigma$ parameters are very close to the sums at the respective van der Waals radii and none or \nonly minor adjustments are necessary. In contrast, optimal values for the $\\epsilon$ parameters are \nunder debate in the literature \\citep{Perez-Hernandez2013}. Hence, we scanned the range of those \nparameters manually, striving for good agreement with the current CCSD(T) results. \nAn automated fitting procedure yielding also statistics of the deviations such as, \ne.g. in Ref. \\citep{ruangpornvisuti1987interaction}, is not employed here because of the very small \nnumber of parameters (see Sec. \\uppercase\\expandafter{\\romannumeral3} for details) and because of \nthe relatively small data sets obtained from the quantum chemical calculations.\n\n\\section{Results and Discussion}\nTo quantify the curvature effect, we calculate the adsorption energies of a water molecule inside \nand outside of armchair $(n,n)$ CNT fragments ($n$=4, 5, 6, 7, 8, 10). The position of the center \nof mass of the water molecule which respect to the longitudinal axis of the $(n,n)$ CNT is labelled \nwith \\textit{x}. Negative values correspond to the $\\wedge$--configuration outside CNTs and \n$\\vee$--configuration inside CNTs, while positive values for $\\wedge$--configuration inside CNTs and \n$\\vee$--configuration outside CNTs, as shown in Fig.~1(a) from left to right.\n\nOur DF-LCCSD(T) results are compiled in Tab. \\uppercase\\expandafter{\\romannumeral1}. \nIt is immediately seen that the adsorption energies of water inside CNTs are much stronger than \nthose for water outside CNTs, because in the former case the attractive dispersive forces from the \nall sides of the nanotube contribute to the interaction energy add up \\citep{BeateShulai}. In the \nlater case, however, the water molecule essentially only interacts with one side of the CNT.\nWhen the water molecule adsorbed outside $(n,n)$ CNTs (see Fig~2(a) and (d) for $n$=5,  Fig.~2(e) \nand (h) for  $n$=6, Tab.~\\uppercase\\expandafter{\\romannumeral1}  for all cases), the DF--LCCSD(T) \nadsorption energy of the $\\wedge$--configuration is always lower than the one of the \n$\\vee$--configuration. For the smallest armchair CNT (4,4) investigated, a DF--LCCSD(T) adsorption \nenergy of $\\vee$--configuration of water outside is -99 meV, while -136 meV for the \n$\\wedge$--configuration (not shown in Fig. 2). The adsorption energy curves for a water molecule \noutside $(6,6)$ CNT are very similar to those for water outside $(4,4)$ and $(5,5)$ CNTs and show \nnearly no curvature effects. Note that the adsorption energies of water outside $(n,n)$ CNTs , see \nTab.~\\uppercase\\expandafter{\\romannumeral1} also for larger CNTs, are close to the results of a \nwater molecule adsorbed on a graphene surface, including the energy differences between $\\wedge$-- \nand $\\vee$--configurations which are -123 and -108 meV, respectively \\citep{Voloshina2011b}.\n\nNext, we will discuss three typical cases of a water molecule inside CNTs. First, water inside \n$(4,4)$ CNT shows purely repulsive interactions indicating that water molecules do not permeate \nspontaneously, since a $(4,4)$ CNT has a too small tube radius, $R$=2.65 \\AA{}, to accommodate water \nmolecules inside. Second, for $n$=5 the energy curves have only one minimum for water inside CNT \ncorresponding to a $\\vee$--configuration, as shown in Fig.~2(b). Therefore, this is the narrowest \narmchair CNT to adsorb water molecules inside. The third typical case is $n$=6. As shown in Fig.~2(f) \nand 2(g), two  minimum energy structures are predicted inside a (6,6) CNT by our DF--LCCSD(T) \ncalculations. Also for larger diameter CNTs we find two minima at the DF--LCCSD(T) level of theory, \nin all cases with the $\\vee$--configuration slightly more stable than the $\\wedge$--configuration. \nAn important result is that the investigated CNTs display an obvious curvature effect on water \nadsorbed inside them as listed in Tab.~\\uppercase\\expandafter{\\romannumeral1}. The adsorption energy \ndecreases quickly with decreasing wall curvature (increasing CNT radius $R$) from $n$=5 to 10 \napproaching the graphene limit, $1/R\\rightarrow 0$ (see open symbols in Fig.~\\ref{fig:Limit}). While \nthe adsorption energy of water inside a (5,5) CNT is nearly four times as large as the outside case, \nfor the (10,10) CNT the energies of water inside and outside become close to each other. A change in \nthe order of the stabilities of $\\vee$-- and $\\wedge$--configuration has to occur for large diameter \nCNTs, because for the adsorption on graphene the $\\wedge$--configuration is more stable.\n\nAs also shown in Tab.~\\uppercase\\expandafter{\\romannumeral1}, the stable configurations predicted by \nusing MP2 are the same as the DF--LCCSD(T) for a water molecule adsorbed inside CNTs. The MP2 \ncalculations also reproduce the same tendencies of the adsorption curves but with a little higher \nenergies than the DF--LCCSD(T) results. However, the VASP results for PBE--D2 and PBE--D3 are \ndifferent for inside and outside cases. For the outside cases, PBE--D3 method gives a better \ndescription of dispersion correlation than PBE--D2. For the inside case, where the DF--LCCSD(T) \ncalculations report two pronounced minima for $n\\ge6$ and the $\\vee$--configuration as the more \nstable one, both PBE--D2 and PBE--D3 predict only the $\\wedge$--configuration as the stable one.\n\nAnother goal of the present work is to use the DF--LCCSD(T) results to parametrize force fields for \nthe interaction of a single water molecule with graphene as well with CNTs \n(inside and outside). First, we consider our previous LJ model for the CO and CH\ninteraction between oxygen and hydrogen atoms in the water molecule and all of the carbon atoms, \nobtained by fitting to CCSD(T) calculations for the water--graphene interaction only \n\\cite{Voloshina2011b, Perez-Hernandez2013}, shown in the first row (\\#~1) of Tab.~\\ref{tab:FF}. As \ncan be seen from the blue curves in Fig.~\\ref{fig:HO}, this model cannot reproduce our DF--LCCSD(T) \nresults for the CNTs. In general, the interaction strength is weaker than predicted by DF--LCCSD(T), \nespecially for water outside the CNTs. \nUpon considerably increasing the attractive well depth \n$\\epsilon_\\mathrm{CH}$ \nbetween carbon and hydrogen and slightly readjusting the two $\\sigma$ parameters, (row \\#~2 in \nTab.~\\ref{tab:FF} \nand red curves in Fig.~\\ref{fig:HO}), the potential energy curves for water adsorbed outside CNTs are \nreproduced satisfactorily. \nHowever, the curves for water inside CNTs are considerably more attractive than the DF--CCSD(T) \nresults, especially when hydrogen is pointing towards the CNT wall ($\\wedge$--configuration). Hence, \nthe energetic ordering of $\\vee$-- and $\\wedge$--configurations is exchanged, as was also found for \nparameter set \\#~1. Our Fig.~\\ref{fig:HO} shows also results for water--graphene systems, where (A), \n(B) and (C) are labelling configurations where the water molecule is on top of an atom, on a bond \nsite or a ring center site, respectively. For case (A), set \\#~2 describes the adsorption energy \nbetter than set \\#~1; conversely, for case (B) and (C), parameter set \\#~1 is superior.\n\nTo solve the problem of the energetic ordering of $\\vee$-- and $\\wedge$--configurations for water \ninside CNTs, we suggest a modified LJ model for the water--carbon interaction where the oxygen \ninteraction site is replaced by two \nneutral dummy particles (labelled as X in Tab. \\uppercase\\expandafter{\\romannumeral2}) representing the \npolarizability of the lone pair electrons of water, using the same positions as in the TIP5P force \nfield \\cite{Mahoney2000}. The model with the lone pair dummies stabilizes the $\\vee$--configuration \ninside the CNTs due to a better description of the polarizability of the oxygen atom,  since the main \ncontribution to the binding is the induced dipole--dipole interaction of the water molecule with the \n$\\pi$--electron density of the CNTs \\cite{BeateShulai}, and therefore the description of the \npolarizability of the oxygen atom was improved in the LJ model.  It can be seen in Fig.~\\ref{fig:HD} \nthat the new model describes the potential energy curves much better, especially for the \n$\\vee$--configuration of water inside ($n,n$) CNTs. Two sets of parameters obtained \nby manually scanning the $\\epsilon$ and $\\sigma$ parameters for the CH and CX interaction are \nlisted as \\#~3 and \\#~4 in Tab.~\\ref{tab:FF} and shown as blue and red curves, respectively, in \nFig.~\\ref{fig:HD}. These two sets of LJ parameters have different advantages and disadvantages in \ndescribing the potential energy in the different cases. Parameter set \\#~3 describes the potential \nenergy inside CNTs everywhere very well and the $\\vee$--configuration (but not the \n$\\wedge$--configuration) for water outside CNTs. In contrast, parameter set \\#~4 describes the \npotential energy outside CNTs everywhere very well and also the $\\vee$--configuration (but not the \n$\\wedge$--configuration) for water inside CNTs. Note that, within the restrictions of the simple LJ \nmodel, it was not possible to find one set of parameters describing the four minima for each of the \nCNTs equally well. Hence, in practical MD simulations, one of these two sets of parameters can be \nchosen, depending on the different confinement conditions of water molecules. In describing the \nwater--graphene adsorption energy, parameter set \\#~4 is better than parameter \\#~3 for sites (A) \nand vice versa for sites (B) and (C).\n\nThe resulting LJ models can be used to predict also the interaction of water with CNTs of much \nlarger radius which are currently out of reach for high level quantum chemistry. Calculated data for \nparameter sets \\#~3 and \\#~4 for armchair CNTs ($n,n$) with $n$=12, 14, 16, 18, 22, 30, 34, 38, 42 \nare also included as full symbols in Fig.~\\ref{fig:Limit}. Parameter set \\#~3 reasonably reproduces \nthe magnitude of the water--graphene interaction for the inside adsorption minima, but the order of \nthe $\\wedge$-- and $\\vee$--configuration is wrong in the limit, $1/R\\rightarrow 0$. Using parameter \nset \\#~4 for the extrapolation to the graphene limit, the $\\wedge$--configuration is stabilized \nagainst the $\\vee$--configuration, but too strong, so the magnitude of the adsorption energy is \noverestimated. However, set \\#~4 can reproduce the transition from the most stable \n$\\vee$--configuration inside small CNTs to the most stable $\\wedge$--configuration for larger CNTs \nand graphene leading to a crossing of the corresponding curves. Parameter set \\#~4 predicts a radius \nof about 10 \\AA{} which corresponds to a (14,14) CNT for the crossing. For larger radii the \n$\\wedge$--configuration is also the most stable one inside the CNTs.\n\n\\section{Summary and conclusions}\nThe physisorption properties of a water molecule interacting with $(n,n)$ CNTs with $n$=4, 5, 6, 7, \n8, 10 are investigated by performing DF--LCCSD(T) calculations. Our main result is that the \nphysisorption properties of water molecule outside and inside carbon nanotube display a different \ncurvature dependence of the adsorption energies. For the outside case, there is only little effect \nof the curvature, however, for the inside case, the magnitude of the adsorption energy is decreasing \nwith decreasing CNT curvature of CNT wall, tending toward the graphene results. By fitting LJ \nparameters to our high quality DF--LCCSD(T) quantum chemistry results, we were able to derive simple \nbut reliable models for carbon sheets of different curvature. In particular, by adding dummy \nparticles mimicking the polarizability of the oxygen atom we improved the quality of atom--centered \nLJ models. This model reproduces all DF--LCCSD(T) results for water inside and outside CNTs of \ndifferent curvature by two sets of LJ parameters. Each of them can reproduces three out of four \nminima of the effective potential curves reasonably well. These LJ models are used to calculate the \nwater adsorption energies of larger CNTs, approaching the graphene limit, thus bridging the gap \nbetween CNTs of increasing radius and flat graphene sheets.\nFinally, we mention that, in agreement with our previous findings for water interacting with graphene \n\\citep{Perez-Hernandez2013, Voloshina2011b}, the overall carbon--water interaction strength obtained \nfrom fitting to the current DF--LCCSD(T) results for water interaction with CNTs is considerably \nstronger than assumed in most of the previous classical MD simulations \\citep{Alexiadis2008d, \nalexiadis2008molecular}, with the exception of the work presented in Refs. \\citep{Kaukonen2012} \nand \\citep{jz2012319}. Hence, the present work suggests that the CNTs may be less hydrophobic than \ncommonly anticipated.\n\n\\section{Acknowledgements}\nWe appreciate financial support from the Focus Area Nanoscale of the Free University of Berlin. \nThe computer facility of the Free University of Berlin (ZEDAT) is acknowledged for computer time.  \nShujuan Li is grateful to the Chinese Scholarship Council for financial support. Helpful discussions \nwith Dr. Krista Grace Steenbergen, Udbhav Ojha, Matthias Berg and Dr. Carsten M\\\"uller are acknowledged.\n\n\\bibliographystyle{rsc}\n\\bibliography{bib}\n\\newpage\n\n\n\n\\begin{table*}[t]\\renewcommand{\\arraystretch}{1.1} \n\\caption{\\label{tab:table1} Adsorption energies (in meV) of a water molecule outside  and inside \n$(n,n)$ CNT with $n$=5, 6, 7, 8, 10 for $\\wedge$--configurations and $\\vee$--configurations for \nvarious quantum chemistry methods. The values in parentheses are minimum energy positions (in \\AA{}) \nalong $x$ axis as shown in Fig. 1(a). The PBE--D2/D3 are from periodic calculations using VASP \n\\citep{Perdew1996, Grimme2006, Grimme2010, Kresse1996, Kresse1996a}.}\n\\begin{ruledtabular}\n\\begin{tabular}{lll ccccc}\n\\multicolumn{2}{c}{Configurations}              &Methods     &(5,5)      &(6,6)      &(7,7)      &(8,8)      &(10,10)    \\\\ \n\\hline\n\\multirow{8}*{Outside} &\\multirow{4}*{$\\wedge$} &DF--LCCSD(T) &-126(-6.6) &-128(-7.3) &-128(-7.9) &-127(-8.7) &-124(-10.1)  \\\\\n                       &                        &MP2         &-117(-6.6) &-117(-7.3) &-118(-8.0) &-115(-8.7) &-110(-10.1)  \\\\\n                       &                        &PBE--D2      &-130(-6.4) &-131(-7.1) &-133(-7.8) &-134(-8.5) &-136(-9.9)  \\\\\n                       &                        &PBE--D3      &-124(-6.6) &-124(-7.3) &-127(-8.0) &-128(-8.7) &-131(-10.1)  \\\\\n\\cline{2-8}                            \n                       &\\multirow{4}*{ $\\vee$}  &DF--LCCSD(T) &-103(6.1)  &-103(6.8)  &-104(7.5)  &-101(8.2)   &-96(9.6)   \\\\\n                       &                        &MP2         &-86(6.1)   &-87(6.9)   &-88(7.6)   &-85(8.3)    &-79(9.6)   \\\\\n                       &                        &PBE--D2      &-82(6.3)   &-81(7.0)   &-83(7.7)   &-82(8.4)    &-84(9.8)   \\\\\n                       &                        &PBE--D3      &-88(6.4)   &-89(7.1)   &-91(7.8)   &-91(8.5)    &-93(9.9)   \\\\\n\\cline{1-8}\n\\multirow{8}*{ Inside} &\\multirow{4}*{$\\wedge$} &DF--LCCSD(T) &-404(0.0)  &-262(0.5)  &-199(1.4) &-171(2.1) &-145(3.5)  \\\\      \n                       &                        &MP2         &           &-235(0.5)  &-176(1.3) &-150(2.1) &-134(3.5)  \\\\\n                       &                        &PBE--D2      &-357(0.0)  &-282(0.8)  &-237(1.5) &-213(2.3) &-190(3.7)  \\\\\n                       &                        &PBE--D3      &           &-312(0.5)  &-249(1.3) &-219(2.1) &-192(3.5)  \\\\\n\\cline{2-8}\n                       &\\multirow{4}*{$\\vee$}   &DF--LCCSD(T) &           &-279(-0.9) &-214(-1.7) &-182(-2.5)  &-148(-3.9)  \\\\\n                       &                        &MP2         &-364(-0.1) &-257(-0.9) &-197(-1.7) &-166(-2.4)  &-143(-3.9)  \\\\\n                       &                        &PBE--D2      &           &           &-167(-1.5) &-144(-2.3)  &-121(-3.8)  \\\\\n                       &                        &PBE--D3      &-378(-0.1) &           &-202(-1.5) &-169(-2.3)  &-142(-3.7)  \\\\        \n\\end{tabular}\n\\end{ruledtabular}\n\\end{table*}\n\\newpage\n\n\\begin{table}\n\\begin{tabular}{c c c c c c c}\n\\hline\\hline\n $\\#$      &$\\epsilon_\\mathrm{CO}$ & $\\epsilon_\\mathrm{CH}$    &$\\epsilon_\\mathrm{CX}$ & $\\sigma_\\mathrm{CO}$  &$\\sigma_\\mathrm{CH}$    &$\\sigma_\\mathrm{CX}$ \\\\\n\\hline\n1  &5.182    &2.591    &             & 3.16             &2.73               & \\\\\n\\hline\n2  &5.182    &4.457    &             & 3.00             &2.80               & \\\\\n\\hline\n3  &         &3.835    &3.6274       &                  &2.85               &2.60 \\\\\n\\hline\n4  &         &6.633    &2.178        &                  &2.75               &2.65 \\\\\n\\hline\\hline\n\\end{tabular}\n\\caption{LJ potential parameters for water--carbon interaction, see Eq. (\\ref{eq:LJ}), where \n$\\epsilon$ represents the attractive well depth (in meV) \nand $\\sigma$ is the distance at which the pair potential is zero (in \\AA{}). Subscripts C, O, H and \nX are for carbon, oxygen, hydrogen and dummy particles \nof water respectively (no partial charges involved). Row \\#~1: previous fit to CCSD(T) calculations \nof graphene--water from Ref. \\cite{Perez-Hernandez2013}. \\#~2--4: fit to the present DF--LCCSD(T) \ncalculations of ($n,n$) CNT--water for $n=5, 6, 7, 8, 10$.}\n\\label{tab:FF}\n\\end{table}\n\\newpage\n\n\\clearpage\n\\begin{figure}[!htp] \n\\includegraphics[width=10cm]{Fig1.eps}\n\\caption{\\label{str} Adsorption structures of a water molecule inside and outside a (6,6) CNT \nfragment. (a) top view for $\\vee$--configuration outside, $\\wedge$--configuration inside, \n$\\vee$--configuration inside and $\\wedge$--configuration outside CNT (from left to right) and (b) \nside view.}\n\\end{figure}\n\\newpage\n\n\\begin{figure}[t] \n\\includegraphics[width=\\textwidth]{Fig2.eps}\n\\caption{\\label{55} Adsorption energies of water inside and outside CNTs for different methods as a \nfunction of the position $x$. (a) $\\wedge$ outside, (b) $\\vee$ inside, (c) $\\wedge$ inside and (d) \n$\\vee$ outside (5,5) CNT. (e)$\\sim$(h) same for (6,6) CNT. The PBE--D2/D3 are from periodic \ncalculations using VASP \\citep{Perdew1996, Grimme2006, Grimme2010, Kresse1996, Kresse1996a}.}\n\\end{figure}\n\\newpage\n\n\\begin{figure}\n\\centering           \n\\includegraphics[width=10cm]{Fig3.eps}\n\\caption {Curvature dependence of the four minima of the effective potential energy curves of water \ninside and outside CNTs. Open symbols: DF--LCCSD(T) results for CNTs, (see also Tab. \n\\uppercase\\expandafter{\\romannumeral1}) and CCSD(T) results for graphene, $1/R\\rightarrow 0$, from \nRef. \\cite{Voloshina2011b}. Full symbols with curves: LJ model with parameter set \\#~3 (upper part) \nand \\#~4 (lower part), also Tab. \\uppercase\\expandafter{\\romannumeral2}}\n\\label{fig:Limit}\n\\end{figure}\n\\newpage\n\n\\begin{figure}\n\\centering           \n\\includegraphics[width=\\textwidth]{Fig4.eps}\n\\caption{Scan of the potential energy of a water molecule traversing various CNTs and graphene. \nForce fields \\#~1 from previous work \\cite{Perez-Hernandez2013} (blue) and \\#~2 (red) with \ninteraction sites for water O and H, for parameters see Tab.~\\ref{tab:FF}. Black points represent \nDF--LCCSD(T) results of the present work for CNTs and CCSD(T) results of previous work \n\\cite{Voloshina2011b} for graphene.}\n\\label{fig:HO}\n\\end{figure}\n\\newpage\n\n\\begin{figure}\n\\centering           \n\\includegraphics[width=\\textwidth]{Fig5.eps}\n\\caption {Same as Fig. \\ref{fig:HO} but for a modified LJ model with additional dummy particles \nrepresenting the lone pairs of the water molecule. Force fields \\#~3 (blue) and \\#~4 (red), for \nparameters see Tab.~\\ref{tab:FF}.}\n\\label{fig:HD}\n\\end{figure}\n\n", "itemtype": "equation", "pos": 12236, "prevtext": "\n\\title {Curvature-dependent adsorption of water inside and outside armchair carbon nanotubes}\n\\author{Shulai Lei}\n\\affiliation{Institut f\\\"ur Chemie und Biochemie, Freie Universit\\\"{a}t Berlin, Takustra{\\ss}e 3, \nD-14195 Berlin, Germany}\n\\author{Shujuan Li}\n\\affiliation{ Institut f\\\"ur Mathematik, Freie Universit\\\"{a}t Berlin, Arnimallee 6, D-14195 \nBerlin, Germany}\n\\author{Burkhard Schmidt}\n\\affiliation{ Institut f\\\"ur Mathematik, Freie Universit\\\"{a}t Berlin, Arnimallee 6, D-14195 \nBerlin, Germany}\n\\author{Beate Paulus}\n\\affiliation{Institut f\\\"ur Chemie und Biochemie, Freie Universit\\\"{a}t Berlin, Takustra{\\ss}e 3,\nD-14195 Berlin, Germany}\n\\begin{abstract}\nThe curvature dependence of the physisorption properties of a water molecule inside and outside an \narmchair carbon nanotube (CNTs) is investigated by an incremental density--fitting local coupled \ncluster treatment with single and double excitations and perturbative triples (DF--LCCSD(T)) study. \nOur results show that a water molecule outside and inside $(n,n)$ CNTs ($n$=4, 5, 6, 7, 8, 10) is \nstabilized by electron correlation. The adsorption energy of water inside CNTs decreases quickly \nwith the decrease of curvature (increase of radius) and the configuration with the oxygen pointing \ntowards the CNT wall is the most stable one. However, when the water molecule is adsorbed outside \nthe CNT, the adsorption energy varies only slightly with the curvature and the configuration with \nhydrogens pointing towards the CNT wall is the most stable one. We also use the DF--LCCSD(T) results \nto parametrize Lennard--Jones (LJ) force fields for the interaction of water both with the inner and \nouter sides of CNTs and with graphene representing the zero curvature limit. It is not possible to \nreproduce all DF--LCCSD(T) results for water inside and outside CNTs of different curvature by a \nsingle set of LJ parameters, but two sets have to be used instead. Each of the two resulting sets \ncan reproduce three out of four minima of the effective potential curves reasonably well. These LJ \nmodels are then used to calculate the water adsorption energies of larger CNTs, approaching the \ngraphene limit, thus bridging the gap between CNTs of increasing radius and flat graphene sheets.\n\\end{abstract}\n\n\\maketitle\n\n\\section{Introduction}\nIn recent years, the study of water confined inside low--diameter carbon nanotubes (CNTs) has \nattracted a lot of attention because of many exotic properties that differ from those of the bulk \nphases \\citep{Marti2001, Marti2001b, Marti2001a, Wu2011, jp4025206, ja5041539}. Being confined in \ntubes with diameters not much larger than the size of the water molecules themselves, the topology \nof their hydrogen--bonding networks is dominated by unique structures such as water wires, different \nhelix--like or prism--like ice nanotubes, both single-- or multi--walled \\citep{Gordillo2000, \ntasis2006chemistry, alexiadis2008molecular}. Consequently, there is also a variety of different \nphase transitions of water inside small CNTs not seen in bulk water, and in some cases it was \npredicted that ice nanotubes can even exist at room temperature \\citep{kyakuno2011confined, \nTakaiwa2008}. Moreover, spontaneous electric polarization was found to occur in some ice nanotubes \nconfined inside CNTs \\cite{Luo2008, Li2015, nakamura2011ferroelectric}. Also the transport of water \nis strongly effected by the confinement in nanotubes. In particular, the greatly enhanced \nflow--rates are assigned to the smoothness of the CNT interior walls \\citep{falk2010molecular}. It \nis expected that these properties may give rise to applications of CNTs for, e.g., biomedical \ndevices and efficient molecular separation \\citep{Ohba2014, Kou2014}.\n\nAs long as microscopic experiments concerning the structure and dynamics of water confined in small \nCNTs are still very scarce, most of the work in the fields mentioned above is based on molecular \nsimulations. Because of the large number of particles typically involved in molecular dynamics (MD) \nsimulations of water in CNTs, practically all previous work was based on empirical force fields. In \nparticular, Lennard--Jones (LJ) potentials are widely used to model the non--bonded carbon--water \ninteractions and are available in most of the molecular dynamics software packages, providing an \nefficient way to simulate systems even with millions of atoms. However, there are large \ndiscrepancies in the values of the empirical LJ parameters used in previous studies of structure and \ndynamics of water confined in CNTs, see e.g. Tab.~\\uppercase\\expandafter{\\romannumeral1}  in Ref. \n\\cite{alexiadis2008molecular}. But already in one of the first simulation studies of water \nconduction in CNTs, it has been noticed that small changes in modelling the nanotube--water \ninteraction can induce large differences in the water occupancy \\cite{Hummer2001} and water filling \nkinetics and thermodynamics \\citep{Waghe2002, Vaitheeswaran2004, Sriraman2005, Waghe2012}. Also \nstructure and dynamics of ice nanotubes confined inside CNTs were found to depend sensitively on the \nparameters of LJ potentials \\citep{Perez-Hernandez2013, Li2015}. Hence, it is a major challenge to \nobtain quantitatively correct values for those parameters. With the recent advances in computational \nresources, paralleled by progress in the developments of methods and algorithms, high--level quantum \nchemical methods have become available, even for rather complex systems, such as the ones of \ninterest here. Recently, the interaction of water with graphene has become a benchmark system for \nhigh--level quantum chemistry methods \\cite{Cabaleiro-Lago2009, Jenness2009, Jenness2010, Rubes2009, \nRubes2010}. In fact, incremental CCSD(T) results for water adsorbed on graphene \n\\citep{Voloshina2011b} are used to reparametrize LJ interaction models for MD simulations \n\\citep{Perez-Hernandez2013} of water confined inside CNTs. There an overall water--carbon \ninteraction strength has been found, which is significantly stronger than in most previous \nsimulations \\cite{Koga2000a, Hummer2001, Koga2001, Berezhkovskii2002, Noon2002, Mashl2003, \nKolesnikov2004, Wang2004, Bai2006, Alexiadis2008d, Kofinger2008, Luo2008, Takaiwa2008}. Moreover, \nthe results for the water--carbon interaction showed a rather strong anisotropy with respect to the \nwater orientation, which was not considered in most of the previous work either, for an exception \nsee Ref. \\cite{Kaukonen2012}.\n\nThe present work aims at accounting for the effect of the curvature of CNT walls on the interaction \nwith water which has an important impact, e.g., on the transport properties \\cite{falk2010molecular, \nLiu2005a}. However, to the best of our knowledge, until recently there have been no high level \n\\textit{ab initio} results for the interaction of water with CNT systems but only density functional \ntheory (DFT) results \\cite{Kaukonen2012,rajarajeswari2011effect}. Hence, we lately started to \ninvestigate these systems at a highly accurate quantum--chemistry level, namely an incremental \ndensity-fitting local coupled cluster treatment with single and double excitations and perturbative \ntriples (DF--LCCSD(T)) \\cite{BeateShulai}, investigating the curvature dependent adsorption \nproperties of a water molecule inside and outside $(n,n)$ CNT ($n$=4, 5, 6, 7, 8, 10) fragments. In \norder to save computational effort and to be able to treat even larger systems, the focus of this \nwork is on a comparison of the computationally very demanding DF--LCCSD(T) method with different, \nless expensive methods: a) the computationally cheaper dispersion corrected DFT variants which are, \nhowever, not systematically improvable as the CCSD(T) method, and b) even cheaper LJ force fields \nfor classical molecular dynamics simulations for larger CNTs, thus bridging the gap between CNTs of \nincreasing radius and flat graphene sheets.\n\n\\section{Model and computational details }\nIn order to explore the adsorption interaction between CNTs and water, the system is modelled by a \nsingle water molecule inside or outside $(n,n)$ CNT fragments ($n$= 4, 5, 6, 7, 8, 10), where the \nends are saturated by 4$n$ hydrogen atoms. The length of the CNT \nfragment (defined as distance between the two outer carbon rings perpendicular to the tube axis) in \nour simulation is  7.37 \\AA{} in all cases, which results in 14$n$ carbon atoms for our $(n,n)$ CNT \nfragments. Based on the most stable configuration of water on a graphene surface \n\\citep{Voloshina2011b}, throughout this work we keep the water molecule to be located above the \ncenter site of a carbon ring and the two hydrogen atoms of the water molecule pointing towards C--C \nbonds along the axial direction of CNTs. In each case, two configurations are investigated, as \ndisplayed in Fig.~1. One of them is termed  $\\wedge$--configuration, in which the two hydrogen atoms \nare closer to the wall of CNT than the oxygen atom. The other configuration is termed \n$\\vee$--configuration, in which the oxygen atom is closer to the wall of CNT. Due to \nthe high computational costs of the quantum chemistry methods discussed below, scans of water \norientation angles are beyond our computational means. For the water molecule, the O--H bond \nlengths are set to be 0.958 \\AA{} and the H--O--H angle is set to be 104.45$^\\circ$. For armchair \nCNTs, the C--C distances are set to the experimental value of 1.421 \\AA{}.  The dangling bonds of \nCNTs are saturated with hydrogen atoms with C--H distances set to 1.084 \\AA{}.\n\nHighly accurate quantum--chemical CCSD(T) results using MOLPRO software \\citep{MOLPRO_brief} are \nobtained using the method of increments \\citep{stoll1992correlation}. In order to reduce the \ncomputational effort with only a negligible effect on the accuracy for large systems, the \nDF--LCCSD(T) method are used \\citep{werner2011efficient}. The basis sets of the polarized \ncorrelation-consistent valence-double-$\\zeta$ basis (cc--pVDZ) for C and H of CNTs and the \naug--cc--pVTZ basis \\citep{Dunning1989} for the O and H atom of water molecule are used for \nHartree--Fock (HF) calculations and the corresponding basis for density--fitting for the local \ncorrelation treatments. A basis set test performed for water on graphene \\citep{Voloshina2011b} \nshows that the used basis set is sufficiently accurate for the adsorption energy.\n\nFor comparison we also employ dispersion corrected density functional methods which are less \ntime--consuming than CCSD(T) calculation. The PBE--D2/D3 calculations \\citep{Perdew1996, Grimme2006, \nGrimme2010} are performed by using MOLPRO software \\citep{MOLPRO_brief}  for the finite fragments \nand with projector augmented wave pseudopotentials as implemented in the Vienna ab--initio \nsimulation package (VASP) \\citep{Kresse1996a, Kresse1996} for a periodic set--up. In the projector \naugmented wave method, the plane--wave kinetic energy cutoff is set to 400 eV. The Brillouin--zone \nintegration is sampled with a  single $k$--point. The CNT systems are modelled by using a \n(1$\\times$1$\\times$5) supercell to insure that the distance between a water molecule and its \nperiodic image is more than 12 \\AA{} to avoid notable interaction between them.  A comparison of \nthe finite fragment PBE--D3 calculations (with the finite basis set (MOLPRO)) with the periodic \nmodelling (with the plane-wave basis (VASP)) of the water inside and outside the CNT  yields very \ngood agreement, providing that the cluster model of the CNTs is sufficiently larger. The shape of \nthe potential energy curves and the positions of the minima agree very well, only the depth of all \nminima is deeper by about 20 meV in the plane-wave basis treatment.\n\n\nBoth for larger CNTs or for an increasing number of water molecules, even the computational effort \nof DFT calculations will be exceedingly high, at least for long--time molecular dynamics simulations. \nAs an alternative, we aim here at obtaining reliable force field parameters by fitting effective \nwater--CNT and water--graphene potentials to DF--LCCSD(T) results. To this end, we use the \napproximation of pairwise additive LJ potential energy functions which are often used to model \nnon--bonded interactions:\n\n", "index": 1, "text": "\\begin{equation}\nV(r_{ij})=4\\sum_{i \\in {\\rm H}_2{\\rm O} \\atop j \\in {\\rm CNT}}\\epsilon_{ij} \n\\left[\\left(\\frac{\\sigma_{ij}}{r_{ij}}\\right)^{12}-\\left(\\frac{\\sigma_{ij}}{r_{ij}}\\right)^6\\right], \n\\label{eq:LJ}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"V(r_{ij})=4\\sum_{i\\in{\\rm H}_{2}{\\rm O}\\atop j\\in{\\rm CNT}}\\epsilon_{ij}\\left[%&#10;\\left(\\frac{\\sigma_{ij}}{r_{ij}}\\right)^{12}-\\left(\\frac{\\sigma_{ij}}{r_{ij}}%&#10;\\right)^{6}\\right],\" display=\"block\"><mrow><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>r</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mn>4</mn><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mfrac linethickness=\"0pt\"><mrow><mi>i</mi><mo>∈</mo><mrow><msub><mi mathvariant=\"normal\">H</mi><mn>2</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">O</mi></mrow></mrow><mrow><mi>j</mi><mo>∈</mo><mi>CNT</mi></mrow></mfrac></munder><mrow><msub><mi>ϵ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo>[</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><msub><mi>r</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mfrac><mo>)</mo></mrow><mn>12</mn></msup><mo>-</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>σ</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><msub><mi>r</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mfrac><mo>)</mo></mrow><mn>6</mn></msup></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]