[{"file": "1601.06745.tex", "nexttext": "\n\\end{subequations}\nwhere $\\epsilon(\\vec{r})$ is the local relative permittivity, $\\vec{E}^{(0)}(\\vec{r})$ is the unperturbed cavity field amplitude, and $\\int_{{\\mathrm{{beam(disk)}}}}$ indicates an integral over the volume occupied by the beam (disk).  The simplified expression in {Eq.~\\ref{{eq:G}}}b replaces $\\epsilon$ with an index of refraction $n$ and parameterizes each integral in terms of the intensity-weighted volume of the beam (disk), $V_{\\mathrm{{beam(disk)}}}\\equiv\\int_{\\mathrm{{beam(disk)}}}{|E_0|^2 d^3r}/|E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam(disk))}}}|^2$, where $E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam(disk))}}}$ is the maximum of the unperturbed field within the beam (disk).  \n\nTo gain physical insight into {Eq.~\\ref{{eq:G}}}, we consider the configuration shown in {Fig.~\\ref{{fig:design_sketch}}}.  Here the beam is placed above the disk, so that it samples the vertical evanescence of a WGM.  For simplicity, the transverse dimensions of the beam are assumed to be much smaller than that of the evanescent field; that is, $w\\ll \\sqrt{A_{\\mathrm{{WGM}}}}$ and $t \\ll x_{\\mathrm{{ev}}}$, where $A_{\\mathrm{{WGM}}}$ is the effective cross-sectional area of the WGM and $x_{\\mathrm{{ev}}}$ is the exponential decay length of the evanescent field.  In this case $V_{\\mathrm{{beam}}}$ can be approximated as $twl_{\\mathrm{{eff}}}$, where $l_{\\mathrm{{eff}}}<l$ is the intensity-weighted ``sampling length'' of the beam.  Likewise $V_{\\mathrm{{disk}}}$ can be parameterized as $V_{\\mathrm{{disk}}}\\approx2\\pi r_{\\mathrm{{d}}} A_{\\mathrm{{WGM}}}$, where $r_{\\mathrm{{d}}}$ is the physical disk radius.  Assuming the form $|E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam)}}}|/|E_{\\mathrm{{max}}}^{\\mathrm{{(0,disk)}}}| = \\xi e^{-\\frac{x+t/2}{x_{\\mathrm{{ev}}}}}$, neglecting the weak position dependence of $V_{\\mathrm{{beam}}}$, and assuming the effective mass of a point probe, $m=\\rho t w l/2$, the vacuum optomechanical coupling rate can be approximated as\n\n", "itemtype": "equation", "pos": 28038, "prevtext": "\n\n\\title{Near-field integration of a SiN nanobeam and a SiO$_2$ microcavity\\\\for Heisenberg-limited displacement sensing}\n\n\\author{R. Schilling, H. Sch{\\\"u}tz, A. Ghadimi, V. Sudhir, D. J. Wilson, and T. J. Kippenberg}\n\n\n\\affiliation{Institute of Condensed Matter Physics, \\'{E}cole Polytechnique F\\'{e}d\\'{e}rale Lausanne, CH-1015 Lausanne, Switzerland}\n\n\n\\date{\\today}\n\n\\begin{abstract}\n\t\nPlacing a nanomechanical object in the evanescent near-field of a high-$Q$ optical microcavity gives access to strong gradient forces and quantum-noise-limited displacement readout, offering an attractive platform for precision sensing technology and basic quantum optics research. Robustly implementing this platform is challenging, however, as it requires separating optically smooth surfaces by $\\lesssim\\lambda/10$. Here we describe a fully-integrated evanescent opto-nanomechanical transducer based on a high-stress Si$_3$N$_4$ nanobeam monolithically suspended above a SiO$_2$ microdisk cavity. Employing a novel vertical integration technique based on planarized sacrificial layers, we achieve beam-disk gaps as little as 25 nm while maintaining mechanical $Q\\times f>10^{12}$ Hz and intrinsic optical $Q\\sim10^7$. The combined low loss, small gap, and parallel-plane geometry result in exceptionally efficient transduction, characterizing by radio-frequency flexural modes with vacuum optomechanical coupling rates of 100 kHz, single-photon cooperativities in excess of unity, and zero-point frequency (displacement) noise amplitudes of 10 kHz (fm)/$\\surd$Hz. In conjunction with the high power handling capacity of SiO$_2$ and low extraneous substrate noise, the transducer operates particularly well as a sensor. Deploying it in a 4 K cryostat, we recently demonstrated a displacement imprecision 40 dB below that at the standard quantum limit (SQL) with an imprecision-back-action product $<5\\cdot\\hbar$. In this report we provide a comprehensive description of device design, fabrication, and characterization, with an emphasis on extending Heisenberg-limited readout to room temperature. Towards this end, we describe a room temperature experiment in which a displacement imprecision 30 dB below that at the SQL and an imprecision-back-action product $<75\\cdot\\hbar$ is achieved. Our results impact the outlook for measurement-based quantum control of nanomechanical oscillators and offer perspective on the engineering of functionally-integrated (``hybrid\") optomechanical systems.\n\n\\end{abstract}\n\n\\maketitle\n\n\n\n\\tableofcontents\n\n\\small{\n\n\\section{Introduction}\\label{sec:introduction}\n\n\\begin{figure}[br!]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=.99\\linewidth]{figure_1_new_B.pdf}\n\t\\caption{\\label{fig:device_intro} False-colored scanning electron micrograph of the device: a high-stress Si$_3$N$_4$ (red) nanomechanical beam integrated into the evanescent mode volume of a SiO$_2$ (blue) microdisk.  Disk and beam are integrated on a Si (gray) microchip.  Subpanel b (c) highlights the lateral (vertical) positioning of the beam.}\n\t\\vspace{-10pt}\n\\end{figure}\n  \nNanomechanical oscillators \\cite{ekinci2005nanoelectromechanical} are sensitive to weak forces and exhibit large zero-point fluctuations, making them an attractive platform for both precision sensing technology \\cite{cleland1998nanometre,mamin2001sub,jensen2008atomic} and basic quantum science \\cite{schwab2005putting}.  Much effort has been devoted to the development of nanomechanical transducers in the electrical domain, including single-electron transistors \\cite{lahaye_approaching_2004}, atomic point contacts \\cite{flowers2007intrinsic}, and superconducting microwave cavities \\cite{regal_measuring_2008}. Though very successful in recent years \\cite{teufel_circuit_2011}, these techniques are practically limited by the need for cryogenic operation. A comparatively powerful approach is to parametrically couple a nanomechanical oscillator to an optical cavity.  The field of a laser-driven cavity can be quantum-noise-limited at room temperature, and as such represents a practically ideal form of mechanical transducer, with read out enabled by standard interferometric techniques and actuation provided by radiation pressure.  Moreover, the finite build-up time of the cavity field allows it to do work on the mechanical element, enabling low-noise optical cooling and amplification \\cite{kippenberg2008cavity}.  Investigation of these effects has led to two paradigmatic goals in the contemporary field of cavity optomechanics \\cite{aspelmeyer_cavity_2015}: cooling of a solid-state mechanical oscillator to its ground state and, concomitantly, read-out of its zero-point motion with the minimal disturbance allowed by the Heisenberg uncertainty principle (due to radiation pressure shot noise (RPSN) \\cite{caves_quantum-mechanical_1980}). The first challenge has been met by  several cryogenic optomechanical \\cite{chan_laser_2011,verhagen2012quantum} and electromechanical systems \\cite{teufel_sideband_2011} (via resolved-sideband cooling \\cite{wilson2007theory}).  The latter, corresponding to a measurement at the standard quantum limit (SQL) \\cite{braginsky1995quantum}, remains outstanding; however, readout noise far below the zero-point displacement has been reported \\cite{wilson2015measurement,krause2015optical}, as well as RPSN dominating the thermal force \\cite{purdy_observation_2013,teufel2016overwhelming}. Reaching the SQL ultimately requires a `Heisenberg-limited' displacement sensor for which the product of the read out noise and the total force noise is the minimum allowed by the uncertainty principle.  This regime has been approached to within an order of magnitude by several cryogenic systems \\cite{teufel_sideband_2011,wilson2015measurement}; it also forms the basis for measurement-based quantum feedback protocols such as ground-state cooling \\cite{wilson2015measurement,courty_quantum_2001} and squeezing \\cite{szorkovszky2011mechanical} of an oscillator.\n\nEfficient cavity optomechanical transduction involves co-localization of optical and mechanical modes with high $Q/{\\mathrm{{(mode\\,volume)}}}$ and high optical power handling capacity.  Moreover, it is desirable that the cavity support a mechanism for efficient input/output coupling.  A diverse zoo ({Fig.~\\ref{{fig:C0_survey}}}) of micro- and nanoscale cavity optomechanical systems (COMS) has risen to meet these challenges, ranging from cantilevers \\cite{kleckner_sub-kelvin_2006} and membranes \\cite{thompson_strong_2008} coupled to Fabry-P\\'{e}rot cavities to mechanically-compliant whispering-gallery-mode (WGM) microcavities \\cite{schliesser_high-sensitivity_2008} and photonic crystals \\cite{eichenfield_optomechanical_2009}. They generally employ two types of radiation pressure force coupling: traditional scattering-type coupling, in which the cavity field exchanges energy with the mechanical element via momentum transfer, and gradient force coupling \\cite{van_thourhout_optomechanical_2010}, in which energy is exchanged via induced-dipole coupling to a field gradient.  The net effect is a parametric coupling $G=\\partial\\omega_{\\mathrm{{c}}}/\\partial x$ between the cavity resonance frequency $\\omega_{\\mathrm{{c}}}$ and the mechanical degree of freedom $x$, which expresses the force applied per intracavity photon, $\\hbar\\cdot G$ \\cite{aspelmeyer_cavity_2015}. \n\nA particularly promising platform for optomechanical transduction involves placing a (dielectric) mechanical substrate next to the surface of a WGM microcavity, so that it samples its evanescent field. Since the evanescent decay length is $\\sim\\lambda/10$, this topology offers the opportunity for strong gradient force coupling to \\emph{nanoscale} mechanical devices. It also has the virtue of naturally accommodating optical and mechanical substrates of dissimilar material and geometry, enabling separate optimization of $Q/{\\mathrm{{(mode\\,volume)}}}$. Moreover, WGMs can be input/output coupled with high ideality using tapered optical fibers \\cite{spillane_ideality_2003}, making them well-suited to interferometric displacement sensing. Recent work has focused on coupling of nano-beams \\cite{anetsberger_near-field_2009}, -cantilevers \\cite{doolin2014multidimensional}, and -membranes \\cite{anetsberger_near-field_2009,cole2015evanescent} to the evanescence of WGM micro-toroids \\cite{anetsberger_near-field_2009}, -spheres \\cite{neuhaus2012versatile,cole2015evanescent}, and -disks \\cite{gavartin_hybrid_2012,doolin2014multidimensional}, with mechanical materials ranging from (ultra low loss) high-stress Si$_3$N$_4$ \\cite{anetsberger_near-field_2009} to (ultra low mass) single-layer graphene \\cite{cole2015evanescent}, typically using SiO$_2$ as the optical material. Gradient force coupling as high as $G\\sim2\\pi\\cdot100$ MHz/nm has been achieved \\cite{anetsberger_near-field_2009}.  Combined with the high power handling capacity of SiO$_2$ and low extraneous displacement noise (typically thermo-refractive noise (TRN) in the cavity substrate \\cite{anetsberger_measuring_2010}), optimized systems have achieved room temperature displacement imprecisions as low as $10^{-16}\\,{\\mathrm{{m}}}/\\sqrt{{\\mathrm{{Hz}}}}$, sufficient to in principle resolve the zero-point motion in one report \\cite{anetsberger_measuring_2010}. \n\nDespite these advances, the full potential of evanescent cavity optomechanics has been inhibited by the difficulty of positioning the nanomechanical element within $\\lambda/10\\sim 100$ nm of the cavity substrate. Early systems made use of nanopositioning stages and suffered from vibrational stability \\cite{anetsberger_near-field_2009}.  Gavartin \\emph{et. al.} \\cite{gavartin_hybrid_2012} addressed this challenge by integrating a Si$_3$N$_4$ nanobeam and a SiO$_2$ microdisk on a chip; however, due to fabrication constraints, the beam-disk separation was limited to 250 nm and the optical $Q$ was reduced by a factor of $10$.  \n\nIn this work, we discuss a novel method to monolithically integrate a high-stress Si$_3$N$_4$ thin film resonator and a SiO$_2$ microdisk cavity \\emph{within the evanescent near-field}, without deteriorating the intrinsic $Q$ of either element.  The critical ingredient is a chemical mechanical polishing technique that allows integration of optically flat surfaces with sub-100 nm spacing, separated by a sacrificial film.  This procedure is used to carefully isolate Si$_3$N$_4$ and SiO$_2$ layers during wafer processing, allowing high-yield and deterministic fabrication of devices in which a nanobeam is monolithically suspended as little as 25 nm above a SiO$_2$ microdisk --- $\\sim3\\times$ smaller than the evanescent decay length of its WGMs --- while maintaining mechanical and optical mode qualities in excess of $10^5$ and $10^6$, respectively.  The process is compatible with e-beam lithography, thus we are able to locally pattern the beam with sub-10 nm imprecision (opening the door to stress engineering \\cite{norte2015mechanical}) and laterally position it with sub-100 nm imprecision across a full 4\" Si wafer.  \n\n\\begin{figure}[br!]\n\t\\vspace{-10pt}\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_2.pdf}\n\t\\caption{\\label{fig:fab_flow} Survey of single-photon cooperativity $\\mathcal{C}_0=4g_0^2/\\kappa\\Gamma_{\\mathrm{{m}}}$ for various cavity optomechanical systems \\cite{safavi-naeini_squeezed_2013,krause2015optical,purdy_strong_2013,leijssen2015strong,wollman2015quantum,palomaki2013coherent,wu2014dissipative,matsumoto2015mg}, adapted with permission from \\cite{aspelmeyer_cavity_2015}.  Non-italicized references are cited in \\cite{aspelmeyer_cavity_2015}.  Blue and red points correspond to cryogenic (typically $T<10$ K) and room temperature experiments, respectively.  Diagonal lines indicate the condition for $\\mathcal{C}_0 = n_{\\mathrm{{th}}}\\approx  k_{\\mathrm{{B}}}T/\\hbar\\Omega_{\\mathrm{{m}}}$, for various $T$.  The reported result is highlighted with crosshairs.}\\label{fig:C0_survey}\n\t\\vspace{-5pt}\n\\end{figure}\n\nA typical device is shown in {Fig.~\\ref{{fig:device_intro}}}, corresponding to a $60\\times1\\times0.06\\,\\mu{\\mathrm{{m}}}^3$ beam positioned 25 nm above a 0.65-$\\mu$m-thick, 30-$\\mu$m-diameter microdisk. By carefully varying the dimensions of the beam, the disk, and their lateral offset with respect to this nominal geometry, we achieve optomechanical coupling rates ($G$) in excess of $2\\pi\\cdot 1$ GHz/nm while maintaining cavity decay rates ($\\kappa$) as low as $2\\pi\\cdot100$ MHz and radio frequency ($\\Omega_{\\mathrm{{m}}}=2\\pi\\cdot(1-10)$ MHz) flexural beam modes with damping rates ($\\Gamma_{\\mathrm{{m}}}$) as low as $2\\pi\\cdot 10$ Hz.  In conjunction with the small mass ($m\\sim 10$ pg) and large zero-point displacement ($x_{\\mathrm{{zp}}}\\equiv \\sqrt{\\hbar/2m\\Omega_{\\mathrm{{m}}}}\\sim 10$ fm) of the beam modes, the combined low-loss, small gap and parallel-plane geometry result in a vacuum optomechanical coupling rates ($g_0\\equiv G\\cdot x_{\\mathrm{{zp}}}$) as high as $2\\pi\\cdot 100$ kHz and room temperature single-photon cooperativities as high as $\\mathcal{C}_0\\equiv 4g_0^2/\\kappa\\Gamma_{\\mathrm{{m}}}=2$.  The latter is notably a factor of $10^5$ times larger than in \\cite{gavartin_hybrid_2012} and on par with the state-of-the-art for both room temperature and cryogenic COMS ({Fig.~\\ref{{fig:C0_survey}}}).  \n\nIn conjunction with high $\\mathcal{C}_0$, several features of the system make it well-suited for quantum-limited operation.  First, SiO$_2$ microcavities with the reported dimensions and internal loss readily support intracavity photon numbers of $n_{\\mathrm{{c}}}\\sim 10^6$.  This enables quantum cooperativities ($C_0 n_{\\mathrm{{c}}}/n_{\\mathrm{{th}}}$) approaching unity --- a basic requirement for performing a Heisenberg-limited displacement measurement --- for a room temperature thermal occupation of $n_{\\mathrm{{th}}}\\approx k_{\\mathrm{{B}}}T/\\hbar\\Omega_{\\mathrm{{m}}}\\sim 10^6$, corresponding to $\\Omega_{\\mathrm{{m}}}\\sim2\\pi\\cdot5$ MHz. Another striking feature is the exceptionally large magnitude of the cavity frequency noise produced by zero-point motion of the mechanical oscillator, $S_\\omega^{zp}(\\Omega_{\\mathrm{{m}}})\\equiv 4g_0^2/\\Gamma_{\\mathrm{{m}}}\\sim 10\\,{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}}$.  This magnitude is many orders of magnitude larger than typical extraneous sources of noise due to laser frequency fluctuations or TRN \\cite{anetsberger_measuring_2010}.  Taking advantage of these strengths, recent deployment of the device in a 4 K Helium cryostat enabled interferometric measurements with a read-out noise 43 dB below $S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})$ (corresponding to an imprecision 40 dB below that necessary to reach the SQL) and with an imprecision-back-action product of $5\\cdot\\hbar$, allowing active feedback cooling to near the motional ground state \\cite{wilson2015measurement}.  Below, we demonstrate a measurement with an imprecision 30 dB below that at the SQL and an imprecision-back-action product of $75\\cdot\\hbar$, using a moderate input power of 10 $\\mu$W.  Remarkably, the imprecision due to microdisk TRN \\cite{anetsberger_measuring_2010} can be $20$ dB lower. \n\n\n\\begin{figure}[bl!]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_3.pdf}\n\t\\caption{$Q$-factor (red) and $Q\\times{\\mathrm{{frequency}}}$ product (blue) of the first eleven, odd-ordered, out-of-plane flexural modes of a nanobeam with dimensions $\\{l,w,t\\}=\\{60,0.6,0.05\\}\\;\\mu{\\mathrm{{m}}}$.  Solid red curve is a fit to the $Q$-dilution model in \\cite{villanueva2014evidence}, implying a limiting contribution from surface-related intrinsic loss. }\\label{fig:design_qf}\n\t\\vspace{0pt}\n\\end{figure}\n\nIn the following sections we carefully detail the design, fabrication, and characterization of the device, and provide a demonstration of low noise displacement measurement.  {Sec.~\\ref{{sec:design}}} gives an overview of nanobeam and microdisk resonators and describes a numerical model used to predict their gradient-force optomechanical coupling.  Notably, we find that $G$ can be improved by an order of magnitude by carefully positioning the beam above the disk.  \n{Sec.~\\ref{{sec:fab}}} describes the fabrication method, particularly the use of planarized (by CMP) sacrificial layers and e-beam lithography, which enable precise engineering of the vertical and horizontal beam-disk separation, respectively. {Sec.~\\ref{{sec:char}}} describes characterization of the device using thermomechanical noise measurements and the optical spring effect. In {Sec.~\\ref{{sec:disp}}}, we discuss an experiment in which the microdisk is embedded into fiber-based homodyne interferometer, enabling displacement read-out with an imprecision 33 dB below $S^{\\mathrm{{zp}}}_\\omega(\\Omega_{\\mathrm{{m}}})$ for the fundamental beam mode. Finally, in {Sec.~\\ref{{sec:conclusion}}}, we remark on the feasibility of Heisenberg-limited position measurements and functionalized applications which take advantage of the heterogeneous integration method.\n\n\n\\section{Device design}\\label{sec:design}\n\n\\subsection{Nanomechanical beam}\\label{sec:nanobeam}\n\n\n\nThe mechanical resonator we study is a doubly-clamped beam released from a high-stress Si$_3$N$_4$ thin film \\cite{verbridge_high_2006}.  Stressed ``nanobeams\" are attractive for their string-like flexural modes, which possess exceptionally high $Q/m$ ratios \\cite{imboden2014dissipation}.  Beams with of the dimensions studied --- $\\{{\\mathrm{{length}}}\\,(l),{\\mathrm{{width}}}\\,(w), {\\mathrm{{thickness}}}\\,(t)\\} \\sim  \\{100, 1, 0.1\\}\\;\\mu{\\mathrm{{m}}}$ --- possess effective masses $m\\sim 10$ pg, fundamental frequencies $\\Omega_{\\mathrm{{m}}}\\sim 2\\pi\\cdot10$ MHz and room temperature quality factors $Q_{\\mathrm{{m}}}> 10^5$ \n\\cite{verbridge_high_2006}.  Significantly, $Q_{\\mathrm{{m}}}$ is well in excess of the ``universal\" value of $10^3-10^4$ observed for bulk amorphous glass resonators at temperatures above $T\\gtrsim 1$ K \\cite{pohl2002low}. It is also higher than for typical unstressed, single-crystal nanobeams due to surface loss \\cite{villanueva2014evidence}. This exceptional behavior is known to derive from a combination of large impedance mismatch from the anchoring body \\cite{rieger2014energy} (suppressing extrinsic loss) and stress-related ``dilution\" of intrinsic loss \\cite{gonzalez1994brownian,unterreithmeier2010damping,villanueva2014evidence}.  From the standpoint of quantum-limited measurement, an important consequence of their high $Q/m$ is that high-stress nanobeams exhibit large zero-point fluctuations.  Expressed as a single-sided spectral density evaluated at the mechanical frequency, the above parameters correspond to a peak zero-point displacement noise density of $S_x^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})= 2\\hbar Q_{\\mathrm{{m}}}/m\\Omega_m^2\\sim 10\\;{\\mathrm{{fm}}}/\\sqrt{{\\mathrm{{Hz}}}}$.  This value occurs in a radio frequency window, 1-10 MHz, where low noise electronics and laser sources are available; as such, nanobeams were the first solid state mechanical resonators to be read out electrically (using a metal beam) \\cite{teufel_nanomechanical_2009} and optically \\cite{anetsberger_measuring_2010} with an imprecision lower than $S_x^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})$. \n\nMeasurements of $Q_{\\mathrm{{m}}}$ for a typical disk-integrated beam with dimensions $\\{l,w,t\\}=$ $\\{60,0.6, 0.06\\}$ $\\mu{\\mathrm{{m}}}$ are shown in Fig. \\ref{fig:design_qf}.  Despite the complexity of the fabrication procedure ({Sec.~\\ref{{sec:fab}}}), flexural modes exhibit $Q_{\\mathrm{{m}}}\\cdot\\Omega_{\\mathrm{{m}}}/2\\pi$ as high as $4\\cdot 10^{12}$ Hz, on par with the state-of-the-art for high-stress Si$_3$N$_4$ nanobeams of similar dimensions \\cite{verbridge2008size,villanueva2014evidence}.  The near-linear eigenfrequency spectrum, $\\Omega_{\\mathrm{{m}}}^{(n)}\\approx 2\\pi n\\cdot4.3\\;{\\mathrm{{MHz}}}$, is consistent with a tensile stress of $\\mathcal{T}\\approx (\\rho l\\Omega_m^{(0)}/\\pi)^2\\approx 0.8$ MPa assuming a density of $\\rho=2700 \\;{\\mathrm{{kg/m}}}^3$ \\cite{verbridge_high_2006}.  The mechanical-Q spectrum, $Q_{\\mathrm{{m}}}^{(n)}\\approx3.6\\cdot10^5/(1+0.023\\cdot n^2)$, is consistent with the intrinsic loss model of \\cite{unterreithmeier2010damping,villanueva2014evidence}.  The dashed line in {Fig.~\\ref{{fig:design_qf}}} is a fit to this model: $Q_{\\mathrm{{m}}}^{(n)}=Q_{\\mathrm{{int}}}/(\\lambda+n^2\\pi^2\\lambda^2)$, where $\\lambda^2 = Et^2/(12\\mathcal{T}l^2)$, $E$ is the elastic modulus of the film, and $Q_{\\mathrm{{int}}}$ is the intrinsic quality factor of the film when unstressed.  The inferred value of $Q_{\\mathrm{{int}}}\\approx 6700$ (using $E=200$ GPa), is roughly an order of magnitude lower than that for bulk Si$_3$N$_4$.  Interpreted as surface loss, however, the inferred coefficient of $Q_{\\mathrm{{int}}}/t \\approx 1.1\\cdot10^{5}\\;\\mu{\\mathrm{{m}}}^{-1}$ is within a factor of two of the typical value for LPCVD SiN thin films \\cite{villanueva2014evidence}.  Operating in a $^3$He cryostat at 0.5 K, we have recently observed $Q_{\\mathrm{{int}}}>10^4$ \\cite{ghadimi__2014}.\n\n\n\n\nIn addition to its favorable mechanical properties when stressed, Si$_3$N$_4$ is an attractive optical material.  It has a relatively large index of refraction, $n\\approx 2$, and, owing to its $\\sim 3$ eV bandgap, respectably low optical absorption at near infrared wavelengths, characterized by an imaginary index of $n_{\\mathrm{{im}}}\\sim 10^{-5}-10^{-6}$ \\cite{zwickl_high_2008}. \n \n\\subsection{Optical microdisk}\\label{sec:microdisk}\n\n\\begin{figure}[t]\n\t\\centering\n\t\\vspace{-0pt}\n\t\\includegraphics[width=1\\linewidth]{figure_4.pdf}\n\t\\caption{WGM intrinsic quality factor $Q_{\\mathrm{{o}}}$ as a function of disk radius $r_{\\mathrm{{d}}}$ for stand-alone SiO$_2$ microdisks of thickness $t_{\\mathrm{{d}}}\\approx 700\\,{\\mathrm{{nm}}}$. TE and TM modes are not distinguished.  Blue (red) points correspond to disks prepared with photolithography (e-beam lithography), which produce wedge angles of $\\theta \\approx 30(11)^\\circ$.   Horizontal lines represent constant cavity linewidth, $\\kappa = 2\\pi c/(\\lambda Q_o)$, with $\\lambda = 780$ nm.  Blue (red) dashed line is a guide-to-the-eye for $Q\\propto r_{\\mathrm{{d}}}$, corresponding to a fixed finesse of $\\mathcal{F}=0.6\\;(1.2)\\cdot10^5$. A SEM of a wedged microdisk is shown above; blue (gray) indicates SiO$_2$ (Si).}\n\t\\label{fig:design_kappa}\n\t\\vspace{-10pt}\n\\end{figure}\n\n\nThe optical resonator we employ is a SiO$_2$ microdisk supporting WGMs along its periphery. SiO$_2$ microdisks possess several advantages for evanescent sensing. The first advantage is that SiO$_2$ exhibits a wide transparency window and a large power handling capacity, enabling large intracavity photon numbers ($n_{\\mathrm{{c}}}$). The practically achievable $n_{\\mathrm{{c}}}$ is typically limited by Kerr and Raman nonlinearity. At visible and telecommuncation wavelengths, other effects such as multi-photon absorption do not play a significant role in SiO$_2$, in contrast to Si and other semiconductors.  A second advantage is that standard lithographic techniques, in conjunction with wet-etching, can produce SiO$_2$ microdisks with exceptionally high $Q$ (recently exceeding $10^8$ in the telecommunication band \\cite{lee_chemically_2012}). This feature is related to the wedged rim of the disk, which supports WGMs that are spatially isolated from the surface, and thereby from surface scattering/absorption loss. A third advantage is that microdisk WGMs can be evanescently coupled to tapered optical fibers with high ideality \\cite{spillane_ideality_2003}. This feature is critical for sensing applications, in which optical loss produces elevated shot-noise imprecision \\cite{schliesser_high-sensitivity_2008}.  \n\n\\begin{figure*}[ht!]\n\t\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_5.pdf}\n\t\\caption{(a) Geometry of the nanobeam-microdisk system: $x$, $y$ represent the vertical (out-of-plane) and lateral (in-plane) position of the beam, respectively, with respect to the inner rim of the disk (thickness $t_{\\mathrm{{d}}}$, radius $r_{\\mathrm{{d}}}$). (b) Simulated optomechanical coupling versus beam position for device dimensions $\\{t, w, l,x,r_{\\mathrm{{d}}},t_{\\mathrm{{d}}}\\}= \\{0.06, 0.4, 60,0.025,14.2,0.65\\}\\;\\mu{\\mathrm{{m}}}$.  The intensity profile of a TM-like WGM (computed using FEM) is shown in the background.  Solid and dashed white lines denote the disk surface and the boundary within which the beam touches the disk surface, for the coordinate system defined in (a). Contours indicate lines of constant $g_0$ for the 4.3 MHz fundamental out-of-plane mode. (c) Measured and simulated $g_0$ versus $y$.  Black and blue data are for fundamental out-of-plane and in-plane vibrational modes, respectively (see {Sec.~\\ref{{sec:char_lateral}}}). Black lines correspond to numerical solutions to {Eq.~\\ref{{eq:G}}} with a vertical offset of $x=25$ nm.  Gray shading shows the solution space for $x=20-30$ nm.}\\label{fig:design_sketch}\n\\vspace{-5pt}\n\\end{figure*}\n\nMicrodisk resonators were in this case studied at $\\lambda\\approx700-800$ nm (outside of the telecommunications window), to allow for smaller optical mode volumes. As discussed in {Sec.~\\ref{{sec:g0model}}}, reducing the disk radius ($r_{\\mathrm{{d}}}$) and thickness ($t_{\\mathrm{{d}}}\\sim\\lambda/n$) results in smaller mode volumes with fractionally larger evanescent components, thereby increasing the optomechanical coupling strength.  \n{Fig.~\\ref{{fig:design_kappa}}} shows measurements (see {Sec.~\\ref{{sec:exp}}} for details) of optical $Q$ versus disk radius ($r_{\\mathrm{{d}}}$) for microdisk samples of thickness $t_{\\mathrm{{d}}}=0.7\\;\\mu{\\mathrm{{m}}}$ . Two sets of devices are considered. The first set was prepared with photolithography, the second with electron-beam lithography.  The sets differ by their corresponding wedge angle, which is 30 (11) degrees for wet (e-beam) lithography.  For both disk preparation methods, intrinsic $Q>10^6$ was measured for radii as low as $10\\;\\mu{\\mathrm{{m}}}$,  corresponding to loss rates of $\\kappa\\sim2\\pi\\cdot100$ MHz.  For shallower wedge angles, $Q$ as high as $4\\cdot10^7$ ($\\kappa\\sim2\\pi\\cdot10$MHz) was obtained --- notably exceeding (for the same $r_{\\mathrm{{d}}}$) those measured at telecom wavelengths, where scattering losses are significantly lower \\cite{kippenberg_demonstration_2006,lee_chemically_2012}.  Numerical simulations \\cite{oxborrow2007simulate} reveal that radiation contributes negligibly to the measured loss. Dotted blue (red) lines in {Fig.~\\ref{{fig:design_kappa}}} are guide-to-the-eye models for $Q\\propto r_{\\mathrm{{d}}}$, consistent with loss due to surface absorption/scattering \\cite{borselli2005beyond}, and corresponding to a fixed finesse of $\\mathcal{F}\\equiv \\Delta\\omega_{\\mathrm{{FSR}}}/\\kappa\\approx c/(r_{\\mathrm{{d}}}\\kappa)=0.6\\;(1.2)\\cdot10^5$.  \nAs discussed in {Sec.~\\ref{{sec:char_lateral}}}, the intrinsic microdisk $Q$ is ultimately reduced by loss introduced by the nanobeam, for beam-disk separations of less than 100 nm.\n\n\\subsection{Evanescent optomechanical coupling}\\label{sec:g0model}\n\nOptomechanical coupling is achieved by placing the nanobeam near the surface of the microdisk, so that its mid-section occupies the evanescent volume of one of the microdisk WGMs.  When the WGM is excited, the beam experiences a gradient force, $F_{\\mathrm{{opt}}}$.  The magnitude of this force, and likewise the optomechanical coupling factor $G=\\partial\\omega_{\\mathrm{{c}}}/\\partial x$, can be derived by computing the work done on the WGM, $-\\delta U_{\\mathrm{{cav}}}$, by a small displacement of the beam, $\\delta x$: that is, $F_{\\mathrm{{opt}}} = -\\partial U_{\\mathrm{{cav}}}/\\partial x \\approx -G U_{\\mathrm{{cav}}}/\\omega_{\\mathrm{{c}}}$, where $U_{\\mathrm{{cav}}}$ is the potential energy stored in the cavity field \\cite{povinelli2005evanescent,van_thourhout_optomechanical_2010}.\nTo first order, it can be shown that \\cite{anetsberger_near-field_2009}\n\\begin{subequations}\\label{eq:G}\n\n", "index": 1, "text": "\\begin{align}\nG&\\approx \n\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{2}\\frac{\\partial}{\\partial x}\\left(\\frac{\\int_{{\\mathrm{{beam}}}}(\\epsilon(\\vec{r})-1)|\\vec {E}^{(0)}(\\vec{r})|^2 d^3r}{\\int_{\\mathrm{{disk}}} \\epsilon(\\vec{r})|\\vec {E}^{(0)}(\\vec{r})| ^2 d^3r}\\right)\n\\\\ &\\approx\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{2}\\frac{\\partial}{\\partial x}\\left( \\frac{n_{\\mathrm{{SiN}}}^2-1}{n_{{\\mathrm{{SiO}}}_{2}}}\\frac{|E_{\\mathrm{{max}}}^{{\\mathrm{{(0,beam)}}}}|^2}{|E_{\\mathrm{{max}}}^{{\\mathrm{{(0,disk)}}}}|^2}\\frac{V_{\\mathrm{{beam}}}}{V_{\\mathrm{{disk}}}}\\right)\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle G\" display=\"inline\"><mi>G</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\approx\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{2}\\frac{\\partial}{%&#10;\\partial x}\\left(\\frac{\\int_{{\\mathrm{{beam}}}}(\\epsilon(\\vec{r})-1)|\\vec{E}^{%&#10;(0)}(\\vec{r})|^{2}d^{3}r}{\\int_{\\mathrm{{disk}}}\\epsilon(\\vec{r})|\\vec{E}^{(0)%&#10;}(\\vec{r})|^{2}d^{3}r}\\right)\" display=\"inline\"><mrow><mi/><mo>≈</mo><mrow><mstyle displaystyle=\"true\"><mfrac><msubsup><mi>ω</mi><mi mathvariant=\"normal\">c</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>beam</mi></msub><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msup><mover accent=\"true\"><mi>E</mi><mo stretchy=\"false\">→</mo></mover><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>r</mi></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>disk</mi></msub><mrow><mi>ϵ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msup><mover accent=\"true\"><mi>E</mi><mo stretchy=\"false\">→</mo></mover><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>r</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>r</mi></mrow></mrow></mfrac></mstyle><mo>)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\approx\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{2}\\frac{\\partial}{%&#10;\\partial x}\\left(\\frac{n_{\\mathrm{{SiN}}}^{2}-1}{n_{{\\mathrm{{SiO}}}_{2}}}%&#10;\\frac{|E_{\\mathrm{{max}}}^{{\\mathrm{{(0,beam)}}}}|^{2}}{|E_{\\mathrm{{max}}}^{{%&#10;\\mathrm{{(0,disk)}}}}|^{2}}\\frac{V_{\\mathrm{{beam}}}}{V_{\\mathrm{{disk}}}}\\right)\" display=\"inline\"><mrow><mi/><mo>≈</mo><mrow><mstyle displaystyle=\"true\"><mfrac><msubsup><mi>ω</mi><mi mathvariant=\"normal\">c</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>x</mi></mrow></mfrac></mstyle><mo>⁢</mo><mrow><mo>(</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msubsup><mi>n</mi><mi>SiN</mi><mn>2</mn></msubsup><mo>-</mo><mn>1</mn></mrow><msub><mi>n</mi><msub><mi>SiO</mi><mn>2</mn></msub></msub></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msup><mrow><mo stretchy=\"false\">|</mo><msubsup><mi>E</mi><mi>max</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo>,</mo><mi>beam</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><msup><mrow><mo stretchy=\"false\">|</mo><msubsup><mi>E</mi><mi>max</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo>,</mo><mi>disk</mi><mo stretchy=\"false\">)</mo></mrow></msubsup><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><msub><mi>V</mi><mi>beam</mi></msub><msub><mi>V</mi><mi>disk</mi></msub></mfrac></mstyle></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06745.tex", "nexttext": " \nwhere $\\rho$ is the mass density of the beam. In practice $x_{\\mathrm{{ev}}},A_{\\mathrm{{WGM}}},$ and $\\xi$ must be determined numerically for a wedged microdisk.  An estimate can be made, however, by assuming the mode shape of a microtoroid WGM with a minor radius of $t_{\\mathrm{{d}}}/2$ \\cite{anetsberger_near-field_2009}. In this case, using $n_{{\\mathrm{{SiO}}}_2}\\approx 1.4$, one has $x_{\\mathrm{{ev}}}\\approx \\lambda/(2\\pi\\sqrt{n_{{\\mathrm{{Si0}}}_2}^2-1})\\approx \\lambda/12$, $A_{\\mathrm{{WGM}}}\\approx 0.15 r_{\\mathrm{{d}}}^{7/12}t_{\\mathrm{{d}}}^{1/4} \\lambda^{7/6}$ and $\\xi\\approx1.1(\\lambda/r_d)^{1/3}$ \\cite{anetsberger2010novel}.  Using these formulas, the device geometry $\\{t, w, l,x,r_{\\mathrm{{d}}},t_{\\mathrm{{d}}}\\}= \\{0.06, 0.4, 60,0.025,14.2,0.65\\}\\;\\mu{\\mathrm{{m}}}$, and assuming $\\lambda = 780$ nm, $n_{{\\mathrm{{SiN}}}}=2.0$, $\\rho = 2700$ kg/m$^3$, $\\Omega_{\\mathrm{{m}}}=2\\pi\\cdot 4.3$ MHz, and $l_{\\mathrm{{eff}}}=10\\;\\mu$m (see {Sec.~\\ref{{sec:char_harmonics}}}), {Eq.~\\ref{{eq:Gapprox}}} predicts that $G\\approx 2\\pi\\cdot 1.0$ GHz/nm, $x_{\\mathrm{{zp}}} \\approx 33 $ fm, and $g_0= 2\\pi\\cdot 33$ kHz.  As shown in {Fig.~\\ref{{fig:design_sketch}}}d, this estimate agrees well with numerically and experimentally determined values.  Notably, {Eq.~\\ref{{eq:Gapprox}}} implies that to achieve large $g_0$, it is necessary to reduce the vertical gap to $x<x_{\\mathrm{{ev}}}\\approx 100$ nm, and to maximize $l_{\\mathrm{{eff}}}$ by laterally positioning the beam \\emph{above} the disk.\n\nA numerical model for $g_0(x,y)$ is shown in {Fig.~\\ref{{fig:design_sketch}}}b.  Intrinsic WGM mode shapes, $\\vec{E}^{0)}(\\vec{r})$, were computed using an axially-symmetric finite element model (COMSOL FEM axial symmetric package \\cite{oxborrow2007simulate}). The energy stored in the WGM,  $U_{\\mathrm{{cav}}}^{(0)}\\approx\\tfrac{1}{2}\\int_{{\\mathrm{{disk}}}}\\epsilon(\\vec{r})|\\vec {E}^{(0)}(\\vec{r})|^2 d^3r$, and the energy shift due to the beam, $\\Delta U_{\\mathrm{{cav}}}(x,y)\\approx\\tfrac{1}{4}\\int_{{\\mathrm{{beam}}}}(\\epsilon(\\vec{r})-1)|\\vec {E}^{(0)}(\\vec{r})|^2 d^3r$, were computed by numerical integration in Matlab.  Differentiating the 2D energy landscape gives $G(x,y)=\\omega_{\\mathrm{{c}}}\\tfrac{\\partial}{\\partial x}(\\Delta U_{\\mathrm{{cav}}}(x,y)/U_{\\mathrm{{cav}}}^{(0)})$ for out-plane-motion. \n{Fig.~\\ref{{fig:design_sketch}}}b shows $g_0(x,y)=G(x,y)\\cdot x_{\\mathrm{{zp}}}$ for a beam and disk with the dimensions given above, for a TM-like WGM mode.  \nContours indicate that the optimal position of the beam is above and inside the inner rim of the disk, and that the magnitude of $g_0$ scales exponentially with vertical displacement from the disk surface, with a decay length of $\\sim 100$ nm.  A horizontal cut through the contours for $x = 25$ nm is shown in {Fig.~\\ref{{fig:design_sketch}}}c.  Upper and lower curves show models for fundamental in-plane (IP) and out-of-plane (OP) flexural modes. Significantly, maximizing $g_0^{\\mathrm{{(OP)}}}$ also minimizes $g_0^{\\mathrm{{(IP)}}}$; this opens a wide spectral window, $\\Delta\\Omega\\sim\\Omega_{\\mathrm{{m}}}$, for measurement of the out-of-plane mode.  Experimental measurements (see {Sec.~\\ref{{sec:TNS}}}) of $g_0(25\\;{\\mathrm{{nm}}},y)$ are also shown in {Fig.~\\ref{{fig:design_sketch}}}c .  The model agrees well with experiment assuming a vertical offset of $25\\pm5$ nm.\n\n\n\n\n\\section{Device fabrication}\\label{sec:fab}\n\n\\begin{figure}[t!]\n\t\\vspace{-0pt}\n\t\\centering\n\t\\includegraphics[scale=0.41]{figure_6.png}\n\t\\caption{\\label{fig:fab_flow}Fabrication process flow: blue, red, green, and (light) gray indicate SiO$_2$, Si$_3$N$_4$, Al$_2$O$_3$, and (poly-)Si, respectively.}\n\t\\vspace{-10pt}\n\\end{figure}\n\nThe fabrication process is outlined in {Fig.~\\ref{{fig:fab_flow}}}.  Four key elements of the process, detailed in the following subsections, are: (A) fabrication of the SiO$_2$ microdisk, (B) formation of a planarized sacrificial layer using chemical mechanical polishing (CMP), (C) fabrication of the Si$_3$N$_4$ nanobeam, and (D) release of the sacrificial layer. Of particular importance is the sacrificial layer, which allows the mechanical (Si$_3$N$_4$) and optical (SiO$_2$) elements to be designed independently while maintaining the high optical quality and achieving a vertical beam-disk separation of less than 100 nm. Also important is the use of e-beam lithography to pattern the Si$_3$N$_4$, as this enables fine tuning of the lateral beam position. \n\n\n\n\\subsection{Microdisk fabrication}\\label{sec:fab_microdisk}\n\n\n\\begin{figure}[b!]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=.99\\linewidth]{figure_7.png}\n\t\\caption{\\label{fig:fab_disk_offset} Defining the vertical gap between the disk and the nanobeam: (a) Top view of patterned SiO$_2$ prior to selective etch of the microdisk. Photoresist protects the sacrificial structures, while a window is exposed around the microdisk. (b) Top view after selective etch of the microdisk and removal of the photoresist. The altered color of the microdisk indicates thinning.}\n\t\\vspace{-0pt}\n\\end{figure}\n\nThe process begins with an undoped, float-zone (FZ) Si wafer, on which a 750 nm film of SiO$_2$ is grown by dry oxidation.  Three structures are patterned into the SiO$_2$ film: the microdisk, rectangular pads that later serve as a support for the nanobeam and a reference plane for CMP polishing, and markers that are later used for e-beam alignment. As illustrated in {Fig.~\\ref{{fig:fab_disk_offset}}}, the SiO$_2$ pattern is processed in two stages.  In the first stage all structures are defined.  In the second stage the microdisk is etched preferentially, recessing it from the pads and defining the vertical gap between disk and the beam.\n\nDetails of the SiO$_2$ patterning process are as follows:  The first mask, containing all structures, is exposed in $1.1\\; \\mu{\\mathrm{{m}}}$ of Microchemicals AZ 1512 photoresist using a Karl S\\\"{u}ss MA 150 mask aligner and a\nbroadband Hg lamp. A subsequent reflow step is used to smooth the pattern boundaries and minimize standing wave patterns. \nAfterwards, the pattern is transfered to SiO$_2$ by etching in a room-temperature bath of BHF. The photoresist is then stripped and a second mask is applied. The second mask covers all structures on the wafer except for the microdisk, leaving it exposed for etching ({Fig.~\\ref{{fig:fab_disk_offset}}}a). \nThe microdisk is preferentially etched in BHF until it is 10-100 nm thinner than the surrounding pads (later defining the beam-disk gap). The result, after the photoresist is stripped, is shown in {Fig.~\\ref{{fig:fab_disk_offset}}}b. Note that the microdisk reflects a different color than the surrounding pads due to its reduced thickness.  Also seen in {Fig.~\\ref{{fig:fab_disk_offset}}} is a matrix of sacrificial pads surrounding the disk.  This matrix extends across the entire wafer and is only broken where microdisks or alignment marks (not shown) are placed. As discussed in {Sec.~\\ref{{sec:fab_sacrificial}}}, a uniform matrix of pads is necessary to achieve a flat surface when performing CMP the sacrificial layer.\n\n\nThe final result of microdisk fabrication is illustrated in {Fig.~\\ref{{fig:fab_flow}}}b. Blue indicates (in profile) the patterned SiO$_2$ film, with the microdisk in the center and nanobeam support pads on either side. Not shown are sacrificial pillars and alignment marks. In the next processing step, all structures are buried in a sacrificial material, onto which a Si$_3$N$_4$ film will be grown. \n\n\\subsection{Planarized sacrificial layer}\\label{sec:fab_sacrificial}\n\n\nAfter patterning, the SiO$_2$ film is covered with a layer of sacrificial material.  The sacrificial layer is used as a substrate for deposition and patterning of the Si$_3$N$_4$ film, meanwhile protecting the underlying microdisk.  A crucial consideration is the thickness and flatness of the sacrifical layer, which is initially uneven because of its conformity to the underlying SiO$_2$ pattern. To thin and planarize the sacrificial layer, a delicate chemical-mechanical polishing (CMP) procedure is followed.\n\nPoly-Si is chosen as the sacrificial material because it can be isotropically etched with high selectivity to SiO$_2$ and Si$_3$N$_4$, is well-suited to CMP, can withstand the high temperatures required for LPCVD Si$_3$N$_4$ ($>800\\,^{\\circ}{\\mathrm{{C}}}$), and can be used to undercut the nanobeam and the microdisk in a single step.  A 1.5 $\\mu$m thick layer is deposited by LPCVD at $600\\,^{\\circ}{\\mathrm{{C}}}$ using silane and disilane as reactants. In addition, immediately before poly-Si deposition, a 5 nm aluminum oxide (Al$_2$O$_3$) film is deposited atop the SiO$_2$ using atomic layer deposition.  This film later serves as an etch-stop to protect the microdisk when releasing the Si$_3$N$_4$ nanobeam. (Al$_2$O$_3$ etches over $100\\times$ slower than Si$_3$N$_4$ in flourine-based RIE used, and thus a few nanometers is sufficient to protect the microdisk.)\n\nA profile of the per-polished sacrificial layer is sketched in {Fig.~\\ref{{fig:fab_flow}}}c.  The Al$_2$O$_3$ etch-stop film is indicated by green. \nImmediately above the etch-stop is the layer of poly-Si (gray).  Because of the underlying SiO$_2$ structures, the surface of the poly-Si is uneven.   This surface is planarized by CMP before Si$_3$N$_4$ is deposited.   \n\nCMP involves pressing the wafer against a rotating polishing pad in the presence of an abrasive and corrosive chemical slurry. Abrasion is provided by SiO$_2$ particles 30-50 nm in diameter. \nThe slurry PH is adjusted to achieve the desired polishing rate. In practice the polishing rate is also a function of applied force, rotation speed, and wafer topography. Areas of the wafer where features are sparse experience a higher pressure and thus a higher polishing rate than areas where features are dense. In order to reduce the poly-Si thickness to less than 100 nm over the entire 100 mm wafer, a uniform polishing rate is critical. This is the reason for patterning a matrix of sacrificial pads ({Fig.~\\ref{{fig:fab_disk_offset}}}). \n\nThe objective of the CMP process is to remove poly-Si until the pads are exposed, while maintaining a thin layer above the recessed microdisk ({Fig.~\\ref{{fig:fab_flow}}}d). This procedure is complicated by the fact that the polishing rate varies across the wafer and, more importantly, that the polishing rate above the microdisk is faster than the rate above the adjacent nanobeam support pads.  The latter results in a poly-Si layer which is thinner above the microdisk than at the nanobeam supports. To reduce this ``dishing'' effect, the support pads are brought as close the microdisk as possible (limited to $7\\;\\mu{\\mathrm{{m}}}$ by photolithography and BHF biasing). To further reduce dishing, a two step polishing technique is used. First a slurry designed to etch poly-Si is used to remove the bulk of the material, leaving approximately 100 nm above the pads. The remaining material is removed with a slurry designed to etch SiO$_2$ faster than poly-Si.  When the surface of the SiO$_2$ pads is reached, the dishing effect begins to reverse, resulting in an overall flat surface.\n\nThe gap between the microdisk and nanobeam is not determined by the thickness of the sacrificial layer, but rather by the predefined difference in thickness between the microdisk and the pads ({Fig.~\\ref{{fig:fab_flow}}}b). During the final steps of CMP, however, the support pads are etched.  The final gap is therefore smaller than originally defined by thinning of the microdisk. In order to precisely tune the gap, the thickness of the clamping pads is iteratively measured by reflectometry until a desired value is reached. The sample is then ready for Si$_3$N$_4$ deposition. \n\n\n\\subsection{Nanobeam fabrication}\\label{sec:fab_mechanical}\n\nTo form the nanobeam, a 50-100 nm film of high-stress Si$_3$N$_4$ is deposited onto the planarized poly-Si layer. LPCVD is performed at $800\\,^{\\circ}\\mathrm{C}$ using dichlorosilane and ammonia, producing a nearly stoichiometric Si$_3$N$_4$. High stoichiometry is important for reducing absorption caused by hydrogen and oxygen impurities \\cite{zwickl_high_2008}. Moreover, the stress (800 MPa) resulting from high temperature deposition is important for achieving high mechanical quality factors \\cite{verbridge_high_2006}.\n\n\nTo maximize optomechanical coupling, it is necessary to fine tune the lateral beam-disk separation with $100$ nm precision ({Fig.~\\ref{{fig:design_sketch}}}c). \nThis is accomplished using e-beam lithography to define the beams, in conjunction with the alignment markers defined during SiO$_2$ patterning. Importantly, after Si$_3$N$_4$ deposition, the markers are buried under Si$_3$N$_4$ and poly-Si, and cannot be seen by the electron-beam.  A series of etch steps are used to locally uncover the markers; in addition, to improve contrast, the exposed markers are used as a hard mask to etch $2\\;\\mu{\\mathrm{{m}}}$ into the underlying Si, using a highly selective flourine-based etch. The resulting high-contrast markers permit alignment of the Si$_3$N$_4$ mask with sub-100 nm precision.\n\nThe nanobeams, support pads, and sample labels are patterned in a 180 nm-thick hydrogen silsesquioxane (HSQ) negative photoresist. \nTo reduce writing time, the pattern is separated into two parts, one containing the nanobeams and one containing the pads and labels. The former is written with a high resolution of 5 nm, while the latter is written with a 50 nm resolution. Proximity effect correction is used to ensure a high fidelity pattern. \nThe e-beam pattern is transferred to Si$_3$N$_4$ using an SF$_6$ RIE etch. The resulting structure is shown in {Fig.~\\ref{{fig:fab_sample_pattern}}}a. \n\n\\begin{figure}[b]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=.99\\linewidth]{figure_8.png}\n\t\\caption{\\label{fig:fab_sample_pattern} Defining the nanobeam and the \"mesa\". (a) Top view of sample after etching of Si$_3$N$_4$ (pink and purple). Surrounding SiO$_2$ structures, including microdisk, appear green. (b) Image of the ``mesa\" photomask.}\n\t\\vspace{-0pt}\n\\end{figure}\n\n\\subsection{Structural release}\\label{sec:fab_release}\n\n\\subsubsection{Mesa and sample chip}\nBefore the nanobeam and microdisk are released, they are elevated from the surrounding wafer on a rectangular ``mesa''. This later enables alignment of a straight tapered optical fiber to the microdisk \\cite{riviere_evanescent_2013}.  Figure \\ref{fig:fab_sample_pattern}b shows the mesa defined in a $5\\;\\mu{\\mathrm{{m}}}$ mask of Microchemicals AZ 9260 photoresist. Flourine-based RIE is used to remove the surrounding poly-Si.  The underlying sacrificial SiO$_2$ pads are removed by a subsequent BHF etch, exposing the Si substrate. To create the elevated mesa, exposed Si is recessed an additional $50\\;\\mu{\\mathrm{{m}}}$ by DRIE. \n\nAfter releasing the mesa, the sample chips are defined.  To define the sample chips, the wafer is coated with a protective photoresist layer and partially diced ($300\\;\\mu{\\mathrm{{m}}}$ deep) with a high precision Si dicing saw. Partial dicing is important as it leaves the wafer intact, enabling further processing using wafer-scale equipment. After partial dicing the photoresist is stripped, so that final release steps can be carried out. \n\n\\subsubsection{Nanobeam and microdisk}\n\nTo release the nanobeam and undercut the microdisk, the partially diced wafer is immersed in $40\\%$ KOH at $45\\,^{\\circ}\\mathrm{C}$, selectively removing poly-Si but also etching Si. The etch time is fine-tuned with two opposing criteria in mind: (1) to ensure that the microdisk is undercut sufficiently far from its rim to avoid optical losses and (2) to ensure that Si underneath the nanobeam clamping point is not etched away.  After KOH etching, the wafer is rinsed in water and any remaining potassium is neutralized in a bath of hydrochloric acid.  Organic cleaning is then performed using an exothermic mixture of three parts sulfuric acid to one part 30\\% hydrogen peroxide (a ``piranha etch''). After rinsing again, the wafer is transfered directly to the ethanol bath of a critical point drying (CPD) machine. \n\nAfter CPD, the wafer is broken into sample chips along the partially diced lines, concluding the fabrication process.\n\n\n\n\\section{Device characterization}\\label{sec:char}\n\n\\begin{figure*}[ht!]\n\t\\centering\n\t\\includegraphics[width=0.95\\linewidth]{figure_9.pdf}\n\t\\caption{(a) Overview of the experimental apparatus, described in  {Sec.~\\ref{{sec:exp}}}. (b) Representative optical Q measurement.  WGM loss rates ($\\kappa$) and mode splitting ($\\gamma$)  are inferred from the cavity transmission profile (red), generated by sweeping the diode laser frequency while monitoring the transmitted power.  The sweep is calibrated by simultaneously monitoring transmission through a fiber loop cavity (blue). (c) Representative thermomechanical noise measurement.  $\\Omega_{\\mathrm{{m}}},\\Gamma_{\\mathrm{{th}}}$, and $g_0$ are inferred from the center frequency, linewidth, and area beneath the thermal noise peak (pink), respectively.  The latter is calibrated by normalizing to the area beneath a FM tone (blue).}\\label{fig:char_experimentalsetup} \n\\end{figure*}\n\n\n\\subsection{Experimental setup}\\label{sec:exp}\n\nSamples are characterized using the experimental setup shown in {Fig.~\\ref{{fig:char_experimentalsetup}}}. Light from a $765-785$ nm tunable diode laser (New Focus Velocity 6312) is coupled into the microdisk using a tapered optical fiber (780 HP) \\cite{spillane_ideality_2003}.  The forward-scattered (``transmitted\") field is monitored using one of two techniques: direct detection with an avalanche photodiode (Thorlabs APD110) and balanced homodyne detection with a pair of fast Si photodiodes (FEMTO HCA-S-100).  DC- and AC-filtered photosignals are split between an oscilloscope (Tektronix DPO4034) and a spectrum analyzer (Tektronix RSA5106A).  To calibrate laser-cavity detuning, a fraction of the input field is simultaneously passed through a $20$-cm-long (FSR $\\sim350$ MHz) fiber loop cavity.  Optical decay rates are inferred from measurements of transmitted power versus laser detuning ({Fig.~\\ref{{fig:char_experimentalsetup}}}b).  Mechanical properties, including the optomechanical coupling rates, are inferred from measurements of thermomechanical cavity frequency noise \\cite{gorodetsky_determination_2010} ({Fig.~\\ref{{fig:char_experimentalsetup}}}c).  To calibrate this noise, the input field is frequency modulated using an electro-optic modulator (EOSpace).  Residual amplitude modulation --- an important source of calibration error --- is actively suppressed by stabilizing the phase of an out-of-loop heterodyne beat \\cite{zhang2014reduction}.  To eliminate gas damping of the nanobeam, the sample chip and the fiber coupling setup (based on an Attocube stack) are embedded in a vacuum chamber operating at $<10^{-5}$ mbar.\n\n\n\n\n\n\n\\subsection{Thermal noise measurement}\\label{sec:TNS}\n\nMechanical mode frequencies $\\Omega_{\\mathrm{{m}}}$, damping rates  $\\Gamma_{\\mathrm{{m}}}$, and optomechanical coupling rates $g_0$, were determined by analyzing the cavity resonance frequency noise produced by thermal motion of the nanobeam. An in-depth description of this method is given in \\cite{gorodetsky_determination_2010}.  Important details are recounted below for clarity.\n\nThermal motion of the nanobeam $x(t)$ is written onto the cavity resonance frequency $\\omega_c(t)$ via their optomechanical coupling, $G=d\\omega_c/dx$. To measure $\\omega_c(t)$, we monitor the power of the transmitted field while operating at a fixed detuning of $|\\Delta|\\approx \\kappa/2$.  Referred to the output voltage ($V$) of the photodetector transimpedance amplifier, the uncalibrated noise spectrum \ncan be expressed as $S_V(\\Omega)=|G_{V\\omega}(\\Omega)|^2 S_\\omega(\\Omega)$, where $G_{V\\omega}(\\Omega)$ is the measurement transfer function and $S_\\omega(\\Omega)$ is the apparent cavity frequency noise. $G_{V\\omega}(\\Omega)$ is calibrated by applying a phase modulation tone of known depth ($\\beta_{\\mathrm{{cal}}}$) and frequency ($\\Omega_{\\mathrm{{cal}}}$) to the input, resulting in a narrow spectral peak with area $|G_{V\\omega}(\\Omega_{\\mathrm{{cal}}})|^2\\beta_{\\mathrm{{cal}}}^2\\Omega_{\\mathrm{{cal}}}^2/2$ \\cite{gorodetsky_determination_2010}.\n\nA representative measurement is shown in  {Fig.~\\ref{{fig:char_experimentalsetup}}}c. Red, blue, and black components correspond to thermal noise, $S_\\omega^{\\mathrm{{th}}}(\\Omega)$, the calibration tone, $S_\\omega^{\\mathrm{{cal}}}(\\Omega)$, and measurement imprecision, $S_\\omega^{\\mathrm{{imp}}}(\\Omega)$, respectively.  The full signal can be modeled as\n\\begin{subequations}\\label{eq:Somega}\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\end{subequations}\nwhere $\\epsilon(\\vec{r})$ is the local relative permittivity, $\\vec{E}^{(0)}(\\vec{r})$ is the unperturbed cavity field amplitude, and $\\int_{{\\mathrm{{beam(disk)}}}}$ indicates an integral over the volume occupied by the beam (disk).  The simplified expression in {Eq.~\\ref{{eq:G}}}b replaces $\\epsilon$ with an index of refraction $n$ and parameterizes each integral in terms of the intensity-weighted volume of the beam (disk), $V_{\\mathrm{{beam(disk)}}}\\equiv\\int_{\\mathrm{{beam(disk)}}}{|E_0|^2 d^3r}/|E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam(disk))}}}|^2$, where $E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam(disk))}}}$ is the maximum of the unperturbed field within the beam (disk).  \n\nTo gain physical insight into {Eq.~\\ref{{eq:G}}}, we consider the configuration shown in {Fig.~\\ref{{fig:design_sketch}}}.  Here the beam is placed above the disk, so that it samples the vertical evanescence of a WGM.  For simplicity, the transverse dimensions of the beam are assumed to be much smaller than that of the evanescent field; that is, $w\\ll \\sqrt{A_{\\mathrm{{WGM}}}}$ and $t \\ll x_{\\mathrm{{ev}}}$, where $A_{\\mathrm{{WGM}}}$ is the effective cross-sectional area of the WGM and $x_{\\mathrm{{ev}}}$ is the exponential decay length of the evanescent field.  In this case $V_{\\mathrm{{beam}}}$ can be approximated as $twl_{\\mathrm{{eff}}}$, where $l_{\\mathrm{{eff}}}<l$ is the intensity-weighted ``sampling length'' of the beam.  Likewise $V_{\\mathrm{{disk}}}$ can be parameterized as $V_{\\mathrm{{disk}}}\\approx2\\pi r_{\\mathrm{{d}}} A_{\\mathrm{{WGM}}}$, where $r_{\\mathrm{{d}}}$ is the physical disk radius.  Assuming the form $|E_{\\mathrm{{max}}}^{\\mathrm{{(0,beam)}}}|/|E_{\\mathrm{{max}}}^{\\mathrm{{(0,disk)}}}| = \\xi e^{-\\frac{x+t/2}{x_{\\mathrm{{ev}}}}}$, neglecting the weak position dependence of $V_{\\mathrm{{beam}}}$, and assuming the effective mass of a point probe, $m=\\rho t w l/2$, the vacuum optomechanical coupling rate can be approximated as\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:Gapprox}\ng_0\\approx \\frac{1}{2}\n\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{x_{\\mathrm{{ev}}}}\\frac{n_{\\mathrm{{SiN}}}^2-1}{n_{{\\mathrm{{SiO}}}_{2}}}\\frac{twl_{\\mathrm{{eff}}}}{2\\pi r_{\\mathrm{{d}}} A_{\\mathrm{{WGM}}}}\\xi e^{-\\frac{x+t/2}{x_{\\mathrm{{ev}}}}}\\cdot\\sqrt{\\frac{\\hbar}{\\rho twl\\Omega_{\\mathrm{{m}}}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"g_{0}\\approx\\frac{1}{2}\\frac{\\omega_{\\mathrm{{c}}}^{(0)}}{x_{\\mathrm{{ev}}}}%&#10;\\frac{n_{\\mathrm{{SiN}}}^{2}-1}{n_{{\\mathrm{{SiO}}}_{2}}}\\frac{twl_{\\mathrm{{%&#10;eff}}}}{2\\pi r_{\\mathrm{{d}}}A_{\\mathrm{{WGM}}}}\\xi e^{-\\frac{x+t/2}{x_{%&#10;\\mathrm{{ev}}}}}\\cdot\\sqrt{\\frac{\\hbar}{\\rho twl\\Omega_{\\mathrm{{m}}}}}\" display=\"block\"><mrow><msub><mi>g</mi><mn>0</mn></msub><mo>≈</mo><mrow><mrow><mfrac><mn>1</mn><mn>2</mn></mfrac><mo>⁢</mo><mfrac><msubsup><mi>ω</mi><mi mathvariant=\"normal\">c</mi><mrow><mo stretchy=\"false\">(</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><msub><mi>x</mi><mi>ev</mi></msub></mfrac><mo>⁢</mo><mfrac><mrow><msubsup><mi>n</mi><mi>SiN</mi><mn>2</mn></msubsup><mo>-</mo><mn>1</mn></mrow><msub><mi>n</mi><msub><mi>SiO</mi><mn>2</mn></msub></msub></mfrac><mo>⁢</mo><mfrac><mrow><mi>t</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><msub><mi>l</mi><mi>eff</mi></msub></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>r</mi><mi mathvariant=\"normal\">d</mi></msub><mo>⁢</mo><msub><mi>A</mi><mi>WGM</mi></msub></mrow></mfrac><mo>⁢</mo><mi>ξ</mi><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mfrac><mrow><mi>x</mi><mo>+</mo><mrow><mi>t</mi><mo>/</mo><mn>2</mn></mrow></mrow><msub><mi>x</mi><mi>ev</mi></msub></mfrac></mrow></msup></mrow><mo>⋅</mo><msqrt><mfrac><mi mathvariant=\"normal\">ℏ</mi><mrow><mi>ρ</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>l</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub></mrow></mfrac></msqrt></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06745.tex", "nexttext": "\n\\end{subequations}\nwhere  $\\mathcal{L}(\\Omega)=4\\Gamma_{\\mathrm{{m}}}/(\\Gamma_{\\mathrm{{m}}}^2+4\\Omega^2)$ is a normalized Lorentzian (characterizing the mechanical susceptibility) and $\\mathcal{G}(\\Omega)=e^{-\\Omega^2/(2B^2)}/\\sqrt{2\\pi B^2}$ is a normalized Gaussian (characterizing the window function of the spectrum analyzer, which is assumed to have a resolution bandwidth $B\\ll\\Gamma_{\\mathrm{{m}}}$).  To calibrate the vertical axis in {Fig.~\\ref{{fig:char_experimentalsetup}}}c, it is assumed that $|G_{V\\omega}(\\Omega_{\\mathrm{{m}}})|\\approx |G_{V\\omega}(\\Omega_{\\mathrm{{cal}}})|$.  \nFitting the calibrated spectrum \nto {Eq.~\\ref{{eq:Somega}}} gives $\\Omega_{\\mathrm{{m}}}$, $\\Gamma_{\\mathrm{{m}}}$, and $g_0$.  The last inference requires knowledge of $n_{\\mathrm{{th}}}$.  By using input powers low enough to neglect photothermal/radiation pressure damping ($\\sim 10$ nW), we assume that $n_{\\mathrm{{th}}}\\approx k_{\\mathrm{{B}}}\\cdot 295\\;{\\mathrm{{K}}}/(\\hbar\\Omega_{\\mathrm{{m}}})$. \n\n\\subsection{Optical spring effect}\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_10.pdf}\n\t\\caption{Optical spring measurement.  (a) Thermal noise spectrum of the fundamental beam mode as a function of laser detuning.  Blue and red spectra indicated blue ($\\Delta>0$) and red ($\\Delta<0$) detuning, respectively.  Lighter shades indicate smaller detuning.  Blue spectra are vertically offset.  (b) Plot of optical spring shift, $\\Delta\\Omega_{\\mathrm{{m}}}$, versus normalized detuning, $\\Delta/\\kappa$.  Dashed black lines are a fit to {Eq.~\\ref{{eq:opticalspring}}} using $g_0$ as a free parameter.}\n\t\\label{fig:spring}\n\t\\vspace{-10pt}\n\\end{figure}\n\nAs a cross-check of the thermal noise measurement, $g_0$ was independently estimated from the optical spring effect \\cite{aspelmeyer_cavity_2015}.  In the experimentally relevant bad cavity limit ($\\Omega_{\\mathrm{{m}}}\\ll \\kappa$), the mechanical frequency shift produced by a radiation pressure optical spring is\n\n", "itemtype": "equation", "pos": 51637, "prevtext": " \nwhere $\\rho$ is the mass density of the beam. In practice $x_{\\mathrm{{ev}}},A_{\\mathrm{{WGM}}},$ and $\\xi$ must be determined numerically for a wedged microdisk.  An estimate can be made, however, by assuming the mode shape of a microtoroid WGM with a minor radius of $t_{\\mathrm{{d}}}/2$ \\cite{anetsberger_near-field_2009}. In this case, using $n_{{\\mathrm{{SiO}}}_2}\\approx 1.4$, one has $x_{\\mathrm{{ev}}}\\approx \\lambda/(2\\pi\\sqrt{n_{{\\mathrm{{Si0}}}_2}^2-1})\\approx \\lambda/12$, $A_{\\mathrm{{WGM}}}\\approx 0.15 r_{\\mathrm{{d}}}^{7/12}t_{\\mathrm{{d}}}^{1/4} \\lambda^{7/6}$ and $\\xi\\approx1.1(\\lambda/r_d)^{1/3}$ \\cite{anetsberger2010novel}.  Using these formulas, the device geometry $\\{t, w, l,x,r_{\\mathrm{{d}}},t_{\\mathrm{{d}}}\\}= \\{0.06, 0.4, 60,0.025,14.2,0.65\\}\\;\\mu{\\mathrm{{m}}}$, and assuming $\\lambda = 780$ nm, $n_{{\\mathrm{{SiN}}}}=2.0$, $\\rho = 2700$ kg/m$^3$, $\\Omega_{\\mathrm{{m}}}=2\\pi\\cdot 4.3$ MHz, and $l_{\\mathrm{{eff}}}=10\\;\\mu$m (see {Sec.~\\ref{{sec:char_harmonics}}}), {Eq.~\\ref{{eq:Gapprox}}} predicts that $G\\approx 2\\pi\\cdot 1.0$ GHz/nm, $x_{\\mathrm{{zp}}} \\approx 33 $ fm, and $g_0= 2\\pi\\cdot 33$ kHz.  As shown in {Fig.~\\ref{{fig:design_sketch}}}d, this estimate agrees well with numerically and experimentally determined values.  Notably, {Eq.~\\ref{{eq:Gapprox}}} implies that to achieve large $g_0$, it is necessary to reduce the vertical gap to $x<x_{\\mathrm{{ev}}}\\approx 100$ nm, and to maximize $l_{\\mathrm{{eff}}}$ by laterally positioning the beam \\emph{above} the disk.\n\nA numerical model for $g_0(x,y)$ is shown in {Fig.~\\ref{{fig:design_sketch}}}b.  Intrinsic WGM mode shapes, $\\vec{E}^{0)}(\\vec{r})$, were computed using an axially-symmetric finite element model (COMSOL FEM axial symmetric package \\cite{oxborrow2007simulate}). The energy stored in the WGM,  $U_{\\mathrm{{cav}}}^{(0)}\\approx\\tfrac{1}{2}\\int_{{\\mathrm{{disk}}}}\\epsilon(\\vec{r})|\\vec {E}^{(0)}(\\vec{r})|^2 d^3r$, and the energy shift due to the beam, $\\Delta U_{\\mathrm{{cav}}}(x,y)\\approx\\tfrac{1}{4}\\int_{{\\mathrm{{beam}}}}(\\epsilon(\\vec{r})-1)|\\vec {E}^{(0)}(\\vec{r})|^2 d^3r$, were computed by numerical integration in Matlab.  Differentiating the 2D energy landscape gives $G(x,y)=\\omega_{\\mathrm{{c}}}\\tfrac{\\partial}{\\partial x}(\\Delta U_{\\mathrm{{cav}}}(x,y)/U_{\\mathrm{{cav}}}^{(0)})$ for out-plane-motion. \n{Fig.~\\ref{{fig:design_sketch}}}b shows $g_0(x,y)=G(x,y)\\cdot x_{\\mathrm{{zp}}}$ for a beam and disk with the dimensions given above, for a TM-like WGM mode.  \nContours indicate that the optimal position of the beam is above and inside the inner rim of the disk, and that the magnitude of $g_0$ scales exponentially with vertical displacement from the disk surface, with a decay length of $\\sim 100$ nm.  A horizontal cut through the contours for $x = 25$ nm is shown in {Fig.~\\ref{{fig:design_sketch}}}c.  Upper and lower curves show models for fundamental in-plane (IP) and out-of-plane (OP) flexural modes. Significantly, maximizing $g_0^{\\mathrm{{(OP)}}}$ also minimizes $g_0^{\\mathrm{{(IP)}}}$; this opens a wide spectral window, $\\Delta\\Omega\\sim\\Omega_{\\mathrm{{m}}}$, for measurement of the out-of-plane mode.  Experimental measurements (see {Sec.~\\ref{{sec:TNS}}}) of $g_0(25\\;{\\mathrm{{nm}}},y)$ are also shown in {Fig.~\\ref{{fig:design_sketch}}}c .  The model agrees well with experiment assuming a vertical offset of $25\\pm5$ nm.\n\n\n\n\n\\section{Device fabrication}\\label{sec:fab}\n\n\\begin{figure}[t!]\n\t\\vspace{-0pt}\n\t\\centering\n\t\\includegraphics[scale=0.41]{figure_6.png}\n\t\\caption{\\label{fig:fab_flow}Fabrication process flow: blue, red, green, and (light) gray indicate SiO$_2$, Si$_3$N$_4$, Al$_2$O$_3$, and (poly-)Si, respectively.}\n\t\\vspace{-10pt}\n\\end{figure}\n\nThe fabrication process is outlined in {Fig.~\\ref{{fig:fab_flow}}}.  Four key elements of the process, detailed in the following subsections, are: (A) fabrication of the SiO$_2$ microdisk, (B) formation of a planarized sacrificial layer using chemical mechanical polishing (CMP), (C) fabrication of the Si$_3$N$_4$ nanobeam, and (D) release of the sacrificial layer. Of particular importance is the sacrificial layer, which allows the mechanical (Si$_3$N$_4$) and optical (SiO$_2$) elements to be designed independently while maintaining the high optical quality and achieving a vertical beam-disk separation of less than 100 nm. Also important is the use of e-beam lithography to pattern the Si$_3$N$_4$, as this enables fine tuning of the lateral beam position. \n\n\n\n\\subsection{Microdisk fabrication}\\label{sec:fab_microdisk}\n\n\n\\begin{figure}[b!]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=.99\\linewidth]{figure_7.png}\n\t\\caption{\\label{fig:fab_disk_offset} Defining the vertical gap between the disk and the nanobeam: (a) Top view of patterned SiO$_2$ prior to selective etch of the microdisk. Photoresist protects the sacrificial structures, while a window is exposed around the microdisk. (b) Top view after selective etch of the microdisk and removal of the photoresist. The altered color of the microdisk indicates thinning.}\n\t\\vspace{-0pt}\n\\end{figure}\n\nThe process begins with an undoped, float-zone (FZ) Si wafer, on which a 750 nm film of SiO$_2$ is grown by dry oxidation.  Three structures are patterned into the SiO$_2$ film: the microdisk, rectangular pads that later serve as a support for the nanobeam and a reference plane for CMP polishing, and markers that are later used for e-beam alignment. As illustrated in {Fig.~\\ref{{fig:fab_disk_offset}}}, the SiO$_2$ pattern is processed in two stages.  In the first stage all structures are defined.  In the second stage the microdisk is etched preferentially, recessing it from the pads and defining the vertical gap between disk and the beam.\n\nDetails of the SiO$_2$ patterning process are as follows:  The first mask, containing all structures, is exposed in $1.1\\; \\mu{\\mathrm{{m}}}$ of Microchemicals AZ 1512 photoresist using a Karl S\\\"{u}ss MA 150 mask aligner and a\nbroadband Hg lamp. A subsequent reflow step is used to smooth the pattern boundaries and minimize standing wave patterns. \nAfterwards, the pattern is transfered to SiO$_2$ by etching in a room-temperature bath of BHF. The photoresist is then stripped and a second mask is applied. The second mask covers all structures on the wafer except for the microdisk, leaving it exposed for etching ({Fig.~\\ref{{fig:fab_disk_offset}}}a). \nThe microdisk is preferentially etched in BHF until it is 10-100 nm thinner than the surrounding pads (later defining the beam-disk gap). The result, after the photoresist is stripped, is shown in {Fig.~\\ref{{fig:fab_disk_offset}}}b. Note that the microdisk reflects a different color than the surrounding pads due to its reduced thickness.  Also seen in {Fig.~\\ref{{fig:fab_disk_offset}}} is a matrix of sacrificial pads surrounding the disk.  This matrix extends across the entire wafer and is only broken where microdisks or alignment marks (not shown) are placed. As discussed in {Sec.~\\ref{{sec:fab_sacrificial}}}, a uniform matrix of pads is necessary to achieve a flat surface when performing CMP the sacrificial layer.\n\n\nThe final result of microdisk fabrication is illustrated in {Fig.~\\ref{{fig:fab_flow}}}b. Blue indicates (in profile) the patterned SiO$_2$ film, with the microdisk in the center and nanobeam support pads on either side. Not shown are sacrificial pillars and alignment marks. In the next processing step, all structures are buried in a sacrificial material, onto which a Si$_3$N$_4$ film will be grown. \n\n\\subsection{Planarized sacrificial layer}\\label{sec:fab_sacrificial}\n\n\nAfter patterning, the SiO$_2$ film is covered with a layer of sacrificial material.  The sacrificial layer is used as a substrate for deposition and patterning of the Si$_3$N$_4$ film, meanwhile protecting the underlying microdisk.  A crucial consideration is the thickness and flatness of the sacrifical layer, which is initially uneven because of its conformity to the underlying SiO$_2$ pattern. To thin and planarize the sacrificial layer, a delicate chemical-mechanical polishing (CMP) procedure is followed.\n\nPoly-Si is chosen as the sacrificial material because it can be isotropically etched with high selectivity to SiO$_2$ and Si$_3$N$_4$, is well-suited to CMP, can withstand the high temperatures required for LPCVD Si$_3$N$_4$ ($>800\\,^{\\circ}{\\mathrm{{C}}}$), and can be used to undercut the nanobeam and the microdisk in a single step.  A 1.5 $\\mu$m thick layer is deposited by LPCVD at $600\\,^{\\circ}{\\mathrm{{C}}}$ using silane and disilane as reactants. In addition, immediately before poly-Si deposition, a 5 nm aluminum oxide (Al$_2$O$_3$) film is deposited atop the SiO$_2$ using atomic layer deposition.  This film later serves as an etch-stop to protect the microdisk when releasing the Si$_3$N$_4$ nanobeam. (Al$_2$O$_3$ etches over $100\\times$ slower than Si$_3$N$_4$ in flourine-based RIE used, and thus a few nanometers is sufficient to protect the microdisk.)\n\nA profile of the per-polished sacrificial layer is sketched in {Fig.~\\ref{{fig:fab_flow}}}c.  The Al$_2$O$_3$ etch-stop film is indicated by green. \nImmediately above the etch-stop is the layer of poly-Si (gray).  Because of the underlying SiO$_2$ structures, the surface of the poly-Si is uneven.   This surface is planarized by CMP before Si$_3$N$_4$ is deposited.   \n\nCMP involves pressing the wafer against a rotating polishing pad in the presence of an abrasive and corrosive chemical slurry. Abrasion is provided by SiO$_2$ particles 30-50 nm in diameter. \nThe slurry PH is adjusted to achieve the desired polishing rate. In practice the polishing rate is also a function of applied force, rotation speed, and wafer topography. Areas of the wafer where features are sparse experience a higher pressure and thus a higher polishing rate than areas where features are dense. In order to reduce the poly-Si thickness to less than 100 nm over the entire 100 mm wafer, a uniform polishing rate is critical. This is the reason for patterning a matrix of sacrificial pads ({Fig.~\\ref{{fig:fab_disk_offset}}}). \n\nThe objective of the CMP process is to remove poly-Si until the pads are exposed, while maintaining a thin layer above the recessed microdisk ({Fig.~\\ref{{fig:fab_flow}}}d). This procedure is complicated by the fact that the polishing rate varies across the wafer and, more importantly, that the polishing rate above the microdisk is faster than the rate above the adjacent nanobeam support pads.  The latter results in a poly-Si layer which is thinner above the microdisk than at the nanobeam supports. To reduce this ``dishing'' effect, the support pads are brought as close the microdisk as possible (limited to $7\\;\\mu{\\mathrm{{m}}}$ by photolithography and BHF biasing). To further reduce dishing, a two step polishing technique is used. First a slurry designed to etch poly-Si is used to remove the bulk of the material, leaving approximately 100 nm above the pads. The remaining material is removed with a slurry designed to etch SiO$_2$ faster than poly-Si.  When the surface of the SiO$_2$ pads is reached, the dishing effect begins to reverse, resulting in an overall flat surface.\n\nThe gap between the microdisk and nanobeam is not determined by the thickness of the sacrificial layer, but rather by the predefined difference in thickness between the microdisk and the pads ({Fig.~\\ref{{fig:fab_flow}}}b). During the final steps of CMP, however, the support pads are etched.  The final gap is therefore smaller than originally defined by thinning of the microdisk. In order to precisely tune the gap, the thickness of the clamping pads is iteratively measured by reflectometry until a desired value is reached. The sample is then ready for Si$_3$N$_4$ deposition. \n\n\n\\subsection{Nanobeam fabrication}\\label{sec:fab_mechanical}\n\nTo form the nanobeam, a 50-100 nm film of high-stress Si$_3$N$_4$ is deposited onto the planarized poly-Si layer. LPCVD is performed at $800\\,^{\\circ}\\mathrm{C}$ using dichlorosilane and ammonia, producing a nearly stoichiometric Si$_3$N$_4$. High stoichiometry is important for reducing absorption caused by hydrogen and oxygen impurities \\cite{zwickl_high_2008}. Moreover, the stress (800 MPa) resulting from high temperature deposition is important for achieving high mechanical quality factors \\cite{verbridge_high_2006}.\n\n\nTo maximize optomechanical coupling, it is necessary to fine tune the lateral beam-disk separation with $100$ nm precision ({Fig.~\\ref{{fig:design_sketch}}}c). \nThis is accomplished using e-beam lithography to define the beams, in conjunction with the alignment markers defined during SiO$_2$ patterning. Importantly, after Si$_3$N$_4$ deposition, the markers are buried under Si$_3$N$_4$ and poly-Si, and cannot be seen by the electron-beam.  A series of etch steps are used to locally uncover the markers; in addition, to improve contrast, the exposed markers are used as a hard mask to etch $2\\;\\mu{\\mathrm{{m}}}$ into the underlying Si, using a highly selective flourine-based etch. The resulting high-contrast markers permit alignment of the Si$_3$N$_4$ mask with sub-100 nm precision.\n\nThe nanobeams, support pads, and sample labels are patterned in a 180 nm-thick hydrogen silsesquioxane (HSQ) negative photoresist. \nTo reduce writing time, the pattern is separated into two parts, one containing the nanobeams and one containing the pads and labels. The former is written with a high resolution of 5 nm, while the latter is written with a 50 nm resolution. Proximity effect correction is used to ensure a high fidelity pattern. \nThe e-beam pattern is transferred to Si$_3$N$_4$ using an SF$_6$ RIE etch. The resulting structure is shown in {Fig.~\\ref{{fig:fab_sample_pattern}}}a. \n\n\\begin{figure}[b]\n\t\\vspace{-5pt}\n\t\\centering\n\t\\includegraphics[width=.99\\linewidth]{figure_8.png}\n\t\\caption{\\label{fig:fab_sample_pattern} Defining the nanobeam and the \"mesa\". (a) Top view of sample after etching of Si$_3$N$_4$ (pink and purple). Surrounding SiO$_2$ structures, including microdisk, appear green. (b) Image of the ``mesa\" photomask.}\n\t\\vspace{-0pt}\n\\end{figure}\n\n\\subsection{Structural release}\\label{sec:fab_release}\n\n\\subsubsection{Mesa and sample chip}\nBefore the nanobeam and microdisk are released, they are elevated from the surrounding wafer on a rectangular ``mesa''. This later enables alignment of a straight tapered optical fiber to the microdisk \\cite{riviere_evanescent_2013}.  Figure \\ref{fig:fab_sample_pattern}b shows the mesa defined in a $5\\;\\mu{\\mathrm{{m}}}$ mask of Microchemicals AZ 9260 photoresist. Flourine-based RIE is used to remove the surrounding poly-Si.  The underlying sacrificial SiO$_2$ pads are removed by a subsequent BHF etch, exposing the Si substrate. To create the elevated mesa, exposed Si is recessed an additional $50\\;\\mu{\\mathrm{{m}}}$ by DRIE. \n\nAfter releasing the mesa, the sample chips are defined.  To define the sample chips, the wafer is coated with a protective photoresist layer and partially diced ($300\\;\\mu{\\mathrm{{m}}}$ deep) with a high precision Si dicing saw. Partial dicing is important as it leaves the wafer intact, enabling further processing using wafer-scale equipment. After partial dicing the photoresist is stripped, so that final release steps can be carried out. \n\n\\subsubsection{Nanobeam and microdisk}\n\nTo release the nanobeam and undercut the microdisk, the partially diced wafer is immersed in $40\\%$ KOH at $45\\,^{\\circ}\\mathrm{C}$, selectively removing poly-Si but also etching Si. The etch time is fine-tuned with two opposing criteria in mind: (1) to ensure that the microdisk is undercut sufficiently far from its rim to avoid optical losses and (2) to ensure that Si underneath the nanobeam clamping point is not etched away.  After KOH etching, the wafer is rinsed in water and any remaining potassium is neutralized in a bath of hydrochloric acid.  Organic cleaning is then performed using an exothermic mixture of three parts sulfuric acid to one part 30\\% hydrogen peroxide (a ``piranha etch''). After rinsing again, the wafer is transfered directly to the ethanol bath of a critical point drying (CPD) machine. \n\nAfter CPD, the wafer is broken into sample chips along the partially diced lines, concluding the fabrication process.\n\n\n\n\\section{Device characterization}\\label{sec:char}\n\n\\begin{figure*}[ht!]\n\t\\centering\n\t\\includegraphics[width=0.95\\linewidth]{figure_9.pdf}\n\t\\caption{(a) Overview of the experimental apparatus, described in  {Sec.~\\ref{{sec:exp}}}. (b) Representative optical Q measurement.  WGM loss rates ($\\kappa$) and mode splitting ($\\gamma$)  are inferred from the cavity transmission profile (red), generated by sweeping the diode laser frequency while monitoring the transmitted power.  The sweep is calibrated by simultaneously monitoring transmission through a fiber loop cavity (blue). (c) Representative thermomechanical noise measurement.  $\\Omega_{\\mathrm{{m}}},\\Gamma_{\\mathrm{{th}}}$, and $g_0$ are inferred from the center frequency, linewidth, and area beneath the thermal noise peak (pink), respectively.  The latter is calibrated by normalizing to the area beneath a FM tone (blue).}\\label{fig:char_experimentalsetup} \n\\end{figure*}\n\n\n\\subsection{Experimental setup}\\label{sec:exp}\n\nSamples are characterized using the experimental setup shown in {Fig.~\\ref{{fig:char_experimentalsetup}}}. Light from a $765-785$ nm tunable diode laser (New Focus Velocity 6312) is coupled into the microdisk using a tapered optical fiber (780 HP) \\cite{spillane_ideality_2003}.  The forward-scattered (``transmitted\") field is monitored using one of two techniques: direct detection with an avalanche photodiode (Thorlabs APD110) and balanced homodyne detection with a pair of fast Si photodiodes (FEMTO HCA-S-100).  DC- and AC-filtered photosignals are split between an oscilloscope (Tektronix DPO4034) and a spectrum analyzer (Tektronix RSA5106A).  To calibrate laser-cavity detuning, a fraction of the input field is simultaneously passed through a $20$-cm-long (FSR $\\sim350$ MHz) fiber loop cavity.  Optical decay rates are inferred from measurements of transmitted power versus laser detuning ({Fig.~\\ref{{fig:char_experimentalsetup}}}b).  Mechanical properties, including the optomechanical coupling rates, are inferred from measurements of thermomechanical cavity frequency noise \\cite{gorodetsky_determination_2010} ({Fig.~\\ref{{fig:char_experimentalsetup}}}c).  To calibrate this noise, the input field is frequency modulated using an electro-optic modulator (EOSpace).  Residual amplitude modulation --- an important source of calibration error --- is actively suppressed by stabilizing the phase of an out-of-loop heterodyne beat \\cite{zhang2014reduction}.  To eliminate gas damping of the nanobeam, the sample chip and the fiber coupling setup (based on an Attocube stack) are embedded in a vacuum chamber operating at $<10^{-5}$ mbar.\n\n\n\n\n\n\n\\subsection{Thermal noise measurement}\\label{sec:TNS}\n\nMechanical mode frequencies $\\Omega_{\\mathrm{{m}}}$, damping rates  $\\Gamma_{\\mathrm{{m}}}$, and optomechanical coupling rates $g_0$, were determined by analyzing the cavity resonance frequency noise produced by thermal motion of the nanobeam. An in-depth description of this method is given in \\cite{gorodetsky_determination_2010}.  Important details are recounted below for clarity.\n\nThermal motion of the nanobeam $x(t)$ is written onto the cavity resonance frequency $\\omega_c(t)$ via their optomechanical coupling, $G=d\\omega_c/dx$. To measure $\\omega_c(t)$, we monitor the power of the transmitted field while operating at a fixed detuning of $|\\Delta|\\approx \\kappa/2$.  Referred to the output voltage ($V$) of the photodetector transimpedance amplifier, the uncalibrated noise spectrum \ncan be expressed as $S_V(\\Omega)=|G_{V\\omega}(\\Omega)|^2 S_\\omega(\\Omega)$, where $G_{V\\omega}(\\Omega)$ is the measurement transfer function and $S_\\omega(\\Omega)$ is the apparent cavity frequency noise. $G_{V\\omega}(\\Omega)$ is calibrated by applying a phase modulation tone of known depth ($\\beta_{\\mathrm{{cal}}}$) and frequency ($\\Omega_{\\mathrm{{cal}}}$) to the input, resulting in a narrow spectral peak with area $|G_{V\\omega}(\\Omega_{\\mathrm{{cal}}})|^2\\beta_{\\mathrm{{cal}}}^2\\Omega_{\\mathrm{{cal}}}^2/2$ \\cite{gorodetsky_determination_2010}.\n\nA representative measurement is shown in  {Fig.~\\ref{{fig:char_experimentalsetup}}}c. Red, blue, and black components correspond to thermal noise, $S_\\omega^{\\mathrm{{th}}}(\\Omega)$, the calibration tone, $S_\\omega^{\\mathrm{{cal}}}(\\Omega)$, and measurement imprecision, $S_\\omega^{\\mathrm{{imp}}}(\\Omega)$, respectively.  The full signal can be modeled as\n\\begin{subequations}\\label{eq:Somega}\n\n", "index": 5, "text": "\\begin{align}\nS_{\\omega}(\\Omega)&=S^{\\mathrm{{th}}}_{\\omega}(\\Omega) + S^{\\mathrm{{cal}}}_{\\omega}(\\Omega) + S_{\\omega}^{\\mathrm{{imp}}}(\\Omega) \\\\ &\\approx 2g_0^2n_{\\mathrm{{th}}}\\cdot \\mathcal{L}(\\Omega-\\Omega_{\\mathrm{{m}}})\\\\&\\;\\;\\;\\;+\\frac{\\beta_{\\mathrm{{cal}}}^2\\Omega_{\\mathrm{{cal}}}^2}{2}\\cdot \\mathcal{G}(\\Omega-\\Omega_{\\mathrm{{cal}}})+S_{\\omega}^{\\mathrm{{imp}}}(\\Omega),\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle S_{\\omega}(\\Omega)\" display=\"inline\"><mrow><msub><mi>S</mi><mi>ω</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=S^{\\mathrm{{th}}}_{\\omega}(\\Omega)+S^{\\mathrm{{cal}}}_{\\omega}(%&#10;\\Omega)+S_{\\omega}^{\\mathrm{{imp}}}(\\Omega)\" display=\"inline\"><mrow><mi/><mo>=</mo><mrow><mrow><msubsup><mi>S</mi><mi>ω</mi><mi>th</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msubsup><mi>S</mi><mi>ω</mi><mi>cal</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msubsup><mi>S</mi><mi>ω</mi><mi>imp</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\approx 2g_{0}^{2}n_{\\mathrm{{th}}}\\cdot\\mathcal{L}(\\Omega-\\Omega%&#10;_{\\mathrm{{m}}})\" display=\"inline\"><mrow><mi/><mo>≈</mo><mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>g</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>n</mi><mi>th</mi></msub></mrow><mo>⋅</mo><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\;\\;\\;\\;+\\frac{\\beta_{\\mathrm{{cal}}}^{2}\\Omega_{\\mathrm{{cal}}}^%&#10;{2}}{2}\\cdot\\mathcal{G}(\\Omega-\\Omega_{\\mathrm{{cal}}})+S_{\\omega}^{\\mathrm{{%&#10;imp}}}(\\Omega),\" display=\"inline\"><mrow><mrow><mpadded width=\"+8.4pt\"><mi mathvariant=\"normal\"> </mi></mpadded><mo>+</mo><mrow><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><msubsup><mi>β</mi><mi>cal</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Ω</mi><mi>cal</mi><mn>2</mn></msubsup></mrow><mn>2</mn></mfrac></mstyle><mo>⋅</mo><mi class=\"ltx_font_mathcaligraphic\">𝒢</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>-</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>cal</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msubsup><mi>S</mi><mi>ω</mi><mi>imp</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06745.tex", "nexttext": "\nwhere $\\Delta$ is the laser-cavity detuning, $n_{\\mathrm{{c}}}(\\Delta)= (4P/(\\hbar\\omega_{\\mathrm{{0}}}\\kappa))(\\kappa_{\\mathrm{{ex}}}/\\kappa)/(1+4(\\Delta/\\kappa)^2)$ is the intracavity photon number, and $P$ is the power injected into the cavity.  (We note that radiation pressure damping also occurs for a detuned input field; however, in the devices studied, for which $\\Omega_{\\mathrm{{m}}}/\\kappa\\sim 0.01$, this effect was found to be overwhelmed by photothermal damping \\cite{metzger2004cavity}.) \n\nA measurement of the optical spring effect is shown in {Fig.~\\ref{{fig:spring}}}, corresponding to the sample also characterized in {Fig.~\\ref{{fig:char_experimentalsetup}}}c.  The injected powers used --- $P = 60,120$ nW --- were chosen to avoid instabilities due to photothermal/radiation pressure damping.  The cavity was critically coupled ($\\kappa_{\\mathrm{{ex}}}\\approx\\kappa/2\\approx 2\\pi\\cdot 550$ MHz) and laser detuning was estimated from the mean transmitted power.  Overlaid models correspond to {Eq.~\\ref{{eq:opticalspring}}} with the value $g_0= 2\\pi\\cdot 60$ kHz, inferred from a least-squared fit to the low power measurement.  This value is within 10$\\%$ of that inferred from thermal noise in {Fig.~\\ref{{fig:char_experimentalsetup}}}c.\n\n\\begin{figure*}[t!]\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_11.pdf}\n\t\\caption{(a) Measured vacuum optomechanical coupling rate ($g_0$) and cooperativity ($\\mathcal{C}_0$, assuming $\\Gamma_{\\mathrm{{m}}}=2\\pi\\cdot15$ Hz) versus lateral beam position ($y$) for TM (solid circles) and TE (open circles) cavity modes. (b) Corresponding intrinsic cavity decay rate ($\\kappa_0$). (c)  Measured $g_0$ versus beam width ($w$) for two disk thicknesses ($t_{\\mathrm{{d}}}$). (d) Measured $g_0$ versus mode frequency, $\\Omega_{\\mathrm{{m}}}^{(n)}\\approx n\\Omega_{\\mathrm{{m}}}^{(0)}$.  Red dots correspond to odd harmonics ($n = 1,3,5...$).  Solid and dashed lines are model curves (Eq. \\ref{eq:g0vsn}b) for a sampling length of $l_{\\mathrm{{eff}}}=9.6$ and $l_{\\mathrm{{eff}}} = 0$, respectively}\n\t\\label{fig:char_lateral}\n\t\\vspace{0pt}\n\\end{figure*}\n\n\n\n\n\\subsection{$g_0$ and $\\mathcal{C}_0$ versus lateral beam position}\\label{sec:char_lateral}\n\nAs discussed in {Sec.~\\ref{{sec:g0model}}}, $g_0$ depends sensitively on the lateral positioning of the nanobeam, and assumes a maximum (minimum) value for out-of-plane (in-plane) flexural modes when centered above the WGM.  This behavior was studied by sweeping the lateral position of the beam using an appropriate e-beam mask ({Sec.~\\ref{{sec:fab_mechanical}}}). Measurements of $g_0$ versus lateral beam position are shown in {Fig.~\\ref{{fig:char_lateral}}}a.  (In-plane modes exhibit typically $10\\times$ lower $g_0$, and were not considered.) for beam and disk dimensions of $\\{l,w,t\\}=\\{60,0.4,0.06\\}\\;\\mu$m and $\\{r,t_{\\mathrm{{d}}},\\theta\\}=\\{15\\,\\mu{\\mathrm{{m}}},0.60\\,\\mu{\\mathrm{{m}}},30\\,{\\mathrm{{deg.}}}\\}$, respectively, and for a vertical gap of 25 nm.  In agreement with numerical modeling (dashed line), $g_0$ assumes a maximum of $2\\pi\\cdot 40$ kHz as the outer edge of the beam eclipses the rim of the disk.  \n\nAlso shown in {Fig.~\\ref{{fig:char_lateral}}}b are measurements of $\\kappa$ versus lateral beam position ($y$).  When the beam is displaced far from the disk, $\\kappa$ converges to the intrinsic value of $\\sim 2\\pi\\cdot 100$ MHz observed in {Fig.~\\ref{{fig:design_kappa}}}, suggesting that CMP did not significantly affect microdisk surface quality. As the beam is brought within 100 nm of the disk, $\\kappa$ is observed to increase sharply.  The observed exponential dependence $\\kappa$ on $y$ is independent of mode polarization and similar to the scaling observed in \\cite{anetsberger_measuring_2010} with a beam coupled to a microtoroid. \nThe absolute magnitude of the loss is also inconsistent with bulk Si$_3$N$_4$ optical absorption --- specifically, accounting for the relatively small fraction of energy stored in the beam, the observed loss would require an imaginary index of $\\sim10^{-4}$, which is 1-2 orders of magnitude larger than conventionally observed for Si$_3$N$_4$ at NIR wavelengths \\cite{zwickl_high_2008,wilson2009cavity}. We thus conjecture that this loss is due to scattering from and/or waveguide coupling into the beam.\n\nCombining measurements of $g_0$ and $\\kappa$ with typical room temperature mechanical damping rate of $\\Gamma_{\\mathrm{{m}}}=2\\pi\\cdot 15$ Hz (we observed no change in $\\Gamma_{\\mathrm{{m}}}$ for small beam-disk seperation, suggesting that squeeze-film gas damping \\cite{verbridge2008size} was not a factor), the single-photon cooperativity is observed to approach $\\mathcal{C}_0\\sim1$. \nThis value is limited by the unfavorable scaling of $g_0^2/\\kappa$ as $g_0$ begins to saturate.  Despite this limitation, the inferred $\\mathcal{C}_0$ represents a nearly 50 dB increase over our prior chip-scale implementation \\cite{gavartin_hybrid_2012}, owing to the combined 100-fold increase of $g_0$ and 10-fold reduction in $\\kappa$.  Increase $g_0$ is due to the precise vertical and lateral positioning of the beam afforded by CMP and e-beam processing.  Reduced $\\kappa$ is due to greater isolation of the disk during beam patterning, making use of the poly-Si sacrificial layer.  {Fig.~\\ref{{fig:char_lateral}}}b suggests that $\\kappa$ is ultimately dominated by beam-induced scattering/absorption loss, rather than deterioration of intrinsic disk loss ({Fig.~\\ref{{fig:design_kappa}}}), implying that an additional 10-fold reduction in $\\kappa$ may yet be realized with appropriate beam shaping/positioning.\n\n\n\n\n\\subsection{$g_0$ and $\\mathcal{C}_0$ versus beam width and disk thickness}\\label{sec:char_overlap}\n\nWider beams ($w\\sim \\lambda$) and thinner disks $(t_{\\mathrm{{d}}}<\\lambda)$ were fabricated in an attempt to increase $g_0$ and $\\mathcal{C}_0$ (see {Eq.~\\ref{{eq:Gapprox}}}).  Measurements of $\\{g_0,\\mathcal{C}_0\\}$ vs $w$ for two microdisk thicknesses, $t_{\\mathrm{{d}}}\\approx0.43\\;{\\mathrm{{and}}}\\;0.63\\;\\mu{\\mathrm{{m}}}$, are shown in {Fig.~\\ref{{fig:char_lateral}}}. Fixed dimensions of the nanobeam and microdisk are $\\{t,l\\}\\approx \\{0.06,60\\}\\;\\mu{\\mathrm{{m}}}$ and $\\{r_{\\mathrm{{d}}},\\theta\\}\\approx\\{15\\;\\mu{\\mathrm{{m}}},30\\;{\\mathrm{{deg.}}}\\}$, respectively.  The lateral beam position was chosen to maximize $g_0$ for the $0.4\\;\\mu{\\mathrm{{m}}}$-wide beam (see {Fig.~\\ref{{fig:char_lateral}}}). For the TE optical modes studied,  a roughly 2$\\times$ increase in $g_0$ was observed for the $30\\%$ thinner disk.  In both cases, $g_0$ scaled roughly linearly for widths $w\\in[0.4,1]\\;\\mu$m.  $\\mathcal{C}_0$ also increased with $w$, roughly in proportion to $g_0^2$, for both $t_{\\mathrm{{d}}}$.  This is due to the fact that $\\kappa$ (not shown) was roughly independent of $w$ for both disk thicknesses and a factor of four larger for the thinner disk.  The highest optomechanical coupling rate we have measured, $g_0\\approx2\\pi\\cdot 150$ kHz, was for a 1 $\\mu$m-wide beam coupled to a $0.43\\;\\mu{\\mathrm{{{m}}}}$-thick disk.  The highest cooperativities observed, $\\mathcal{C}_0 > 2.5$, were for 1 $\\mu$m-wide beams coupled to disks of both thicknesses.\n\n\n\n\\subsection{$g_0$ versus mechanical mode order}\\label{sec:char_harmonics}\n\n$g_0$ was also studied for higher order mechanical modes. As shown in {Fig.~\\ref{{fig:char_lateral}}}d\n, $g_0$ decreases as the vibrational node spacing approaches the dimensions of the effective sampling length $l_{\\mathrm{{eff}}}$.  In this case the model in {Sec.~\\ref{{sec:g0model}}} --- which assumes rigid displacement of a beam with effective mass $m=\\rho t w l/2$ --- breaks down.  A simple extension of the model is shown as a red line in {Fig.~\\ref{{fig:char_lateral}}}d. Here $m$ is computed with respect to optical-intensity-weighted displacement of the mechanical mode:  \n\\begin{subequations}\\label{eq:g0vsn}\n\t\n", "itemtype": "equation", "pos": 54031, "prevtext": "\n\\end{subequations}\nwhere  $\\mathcal{L}(\\Omega)=4\\Gamma_{\\mathrm{{m}}}/(\\Gamma_{\\mathrm{{m}}}^2+4\\Omega^2)$ is a normalized Lorentzian (characterizing the mechanical susceptibility) and $\\mathcal{G}(\\Omega)=e^{-\\Omega^2/(2B^2)}/\\sqrt{2\\pi B^2}$ is a normalized Gaussian (characterizing the window function of the spectrum analyzer, which is assumed to have a resolution bandwidth $B\\ll\\Gamma_{\\mathrm{{m}}}$).  To calibrate the vertical axis in {Fig.~\\ref{{fig:char_experimentalsetup}}}c, it is assumed that $|G_{V\\omega}(\\Omega_{\\mathrm{{m}}})|\\approx |G_{V\\omega}(\\Omega_{\\mathrm{{cal}}})|$.  \nFitting the calibrated spectrum \nto {Eq.~\\ref{{eq:Somega}}} gives $\\Omega_{\\mathrm{{m}}}$, $\\Gamma_{\\mathrm{{m}}}$, and $g_0$.  The last inference requires knowledge of $n_{\\mathrm{{th}}}$.  By using input powers low enough to neglect photothermal/radiation pressure damping ($\\sim 10$ nW), we assume that $n_{\\mathrm{{th}}}\\approx k_{\\mathrm{{B}}}\\cdot 295\\;{\\mathrm{{K}}}/(\\hbar\\Omega_{\\mathrm{{m}}})$. \n\n\\subsection{Optical spring effect}\n\n\\begin{figure}[t]\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_10.pdf}\n\t\\caption{Optical spring measurement.  (a) Thermal noise spectrum of the fundamental beam mode as a function of laser detuning.  Blue and red spectra indicated blue ($\\Delta>0$) and red ($\\Delta<0$) detuning, respectively.  Lighter shades indicate smaller detuning.  Blue spectra are vertically offset.  (b) Plot of optical spring shift, $\\Delta\\Omega_{\\mathrm{{m}}}$, versus normalized detuning, $\\Delta/\\kappa$.  Dashed black lines are a fit to {Eq.~\\ref{{eq:opticalspring}}} using $g_0$ as a free parameter.}\n\t\\label{fig:spring}\n\t\\vspace{-10pt}\n\\end{figure}\n\nAs a cross-check of the thermal noise measurement, $g_0$ was independently estimated from the optical spring effect \\cite{aspelmeyer_cavity_2015}.  In the experimentally relevant bad cavity limit ($\\Omega_{\\mathrm{{m}}}\\ll \\kappa$), the mechanical frequency shift produced by a radiation pressure optical spring is\n\n", "index": 7, "text": "\\begin{equation}\n\\Delta \\Omega_{\\mathrm{{m}}}(\\Delta)\\approx \\frac{8g_0^2}{\\kappa}\\cdot n_{\\mathrm{{c}}}(\\Delta)\\cdot \\frac{\\Delta/\\kappa}{1+4(\\Delta/\\kappa)^2}\n\\label{eq:opticalspring}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Delta\\Omega_{\\mathrm{{m}}}(\\Delta)\\approx\\frac{8g_{0}^{2}}{\\kappa}\\cdot n_{%&#10;\\mathrm{{c}}}(\\Delta)\\cdot\\frac{\\Delta/\\kappa}{1+4(\\Delta/\\kappa)^{2}}\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Δ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≈</mo><mrow><mrow><mrow><mfrac><mrow><mn>8</mn><mo>⁢</mo><msubsup><mi>g</mi><mn>0</mn><mn>2</mn></msubsup></mrow><mi>κ</mi></mfrac><mo>⋅</mo><msub><mi>n</mi><mi mathvariant=\"normal\">c</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Δ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mfrac><mrow><mi mathvariant=\"normal\">Δ</mi><mo>/</mo><mi>κ</mi></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>/</mo><mi>κ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06745.tex", "nexttext": "\n\\end{subequations}\nwhere $\\vec{u}(x,y,z) \\approx{\\mathrm{{sin}}}(n\\pi x/l)\\hat{z}$ is the displacement profile of the $n^{\\mathrm{{th}}}$-order out-of-plane flexural mode. The latter expression is appropriate when the transverse dimensions of the beam are much smaller than that of the WGM, and assumes that the intensity distribution sampled by the beam is uniform along the beam axis with an effective sampling length $l_{\\mathrm{{eff}}}$.  Using $\\Omega_{\\mathrm{{m}}}\\propto n$ gives $g_0^{(n)}/g_0^{(0)}\\approx \\lvert{\\mathrm{{sinc}}}\\left(\\frac{n \\pi}{2}\\frac{l_{\\mathrm{{eff}}}}{l}\\right)\\rvert/\\sqrt{n}$ for odd $n$ and 0 for even $n$.  The model shown in {Fig.~\\ref{{fig:char_lateral}}}d agrees quantitatively with experiment assuming an effective length of $l_{\\mathrm{{eff}}}=9.6\\;\\mu$m as the only free parameter.  A simple route to increasing $g_0$ would be to remove mass from the beam outside of the effective sampling length (see {Fig.~\\ref{{fig:outlook}}}).\n\n\\section{Displacement sensitivity}\\label{sec:disp}\n\n\nAs an illustration of device performance, we use the microdisk to perform a cavity-enhanced interferometric measurement of the beam's displacement. For this purpose, the fiber taper and microdisk are embedded in one arm of a length- and power-balanced homodyne interferometer ({Fig.~\\ref{{fig:char_experimentalsetup}}}).  The cavity is driven on resonance using the Pound-Drever-Hall technique.  A piezoelectric mirror is use to stabilize the interferometer path length difference so that the homodyne photocurrent is proportional to the phase of the transmitted cavity field.\n\n\\begin{figure*}[th!]\n\t\\centering\n\t\\includegraphics[width=1.0\\linewidth]{figure_12.pdf}\n\t\\caption{(a) Nanobeam displacement noise, measured by balanced homodyne detection of the microdisk output field, for various input powers.  Noise spectra are expressed in units relative to the cavity frequency noise produced by one phonon of fundamental out-of-plane vibration, $2S_\\omega^{zp}(\\Omega_{\\mathrm{{m}}})=(2\\pi\\cdot9.8\\,{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, where $\\Omega_{\\mathrm{{m}}}=2\\pi\\cdot4.4$ MHz. For large power, the fundamental noise peak is shifted and broadened by optical spring softening and damping, respectively.  The peak at 5 MHz is due to thermal motion of the fundamental in-plane mode.  The gray curve is a model for the intrinsic thermal motion of the fundamental mode ({Eq.~\\ref{{eq:Saulson}}}). (b) Measured phonon equivalent displacement, $n_{\\mathrm{{tot}}} = S_\\omega(\\Omega_{\\mathrm{{m}}})/2S_\\omega(\\Omega_{\\mathrm{{m}}})^{\\mathrm{{zp}}}$, displacement imprecision, $n_{\\mathrm{{imp}}}$, and their geometric mean versus intracavity photon number.  Dashed lines denote ideal values for $n_{\\mathrm{{tot}}}=n_{\\mathrm{{th}}}+n_{\\mathrm{{ba}}}+n_{\\mathrm{{imp}}}$ (orange), $n_{\\mathrm{{ba}}}=\\mathcal{C}_0n_{\\mathrm{{c}}}$ (red), and $n_{\\mathrm{{imp}}}=1/16\\mathcal{C}_0n_{\\mathrm{{c}}}$ (blue), using $n_{\\mathrm{{th}}}\\approx1.4\\cdot10^6$ and $\\mathcal{C}_0=0.8$. Green arrow  indicates proximity to the uncertainty  limit, $4\\sqrt{n_{\\mathrm{{imp}}}n_{\\mathrm{{tot}}}}\\ge 1$.}\\label{fig:disp}\n\t\\vspace{-0pt}\n\\end{figure*}\n\nDisplacement noise spectra are shown in {Fig.~\\ref{{fig:disp}}} for a $\\{l,w,t\\}=\\{60,0.4,0.06\\}\\;\\mu$m beam with optomechanical parameters $\\{\\Omega_{\\mathrm{{m}}},\\,\\Gamma_{\\mathrm{{m}}},\\,\\kappa,\\, g_0,\\,\\mathcal{C}_0\\}\\approx\\{2\\pi\\cdot4.4\\,{\\mathrm{{MHz}}},\\,2\\pi\\cdot12\\,{\\mathrm{{Hz}}},\\,2\\pi\\cdot350\\,{\\mathrm{{MHz}}},\\,2\\pi\\cdot30\\,{\\mathrm{{kHz}}},\\,0.8\\}$.  (Here $\\kappa$ corresponds to the critically-coupled cavity linewidth and other parameters correspond to the fundamental out-of-plane mechanical mode.)  For the measurements shown, the cavity was critically coupled and the power of the input field was swept from $0.1-30\\;\\mu$W. The homodyne photocurrent noise spectrum is plotted in units relative to the signal produced by a phonon of displacement $2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx(2\\pi\\cdot9.8\\,{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$ (equivalent to $2S_x^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx(2\\pi\\cdot8.8\\,{\\mathrm{{fm}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$ assuming $x_{\\mathrm{{zp}}}=25$ fm).  In these units, the magnitude of the fundamental thermal noise peak (neglecting photothermal or dynamical back-action) is equal to the effective thermal occupation $n_{\\mathrm{{tot}}} = n_{\\mathrm{{th}}}+n_{\\mathrm{{ba}}}+n_{\\mathrm{{imp}}}$, where $n_{\\mathrm{{th}}} \\approx k_{\\mathrm{{B}}}T/\\hbar\\Omega_{\\mathrm{{m}}}\\approx 1.4\\cdot 10^6$ is the ambient bath occupation, $n_{\\mathrm{{ba}}}$ is the effective thermal bath occupation associated with classical and quantum measurement back-action, and $n_{\\mathrm{{imp}}}\\equiv S_\\omega^{\\mathrm{{imp}}}(\\Omega_{\\mathrm{{m}}})/2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})$ is the apparent thermal occupation associated with the measurement imprecision, $S_\\omega^{\\mathrm{{imp}}}$.  The noise spectra are calibrated by bootstrapping a low power measurement to $S_\\omega(\\Omega_{\\mathrm{{m}}})/(2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx 2 n_{\\mathrm{{th}}}$. For larger optical powers, dynamic spring/damping forces modify the peak. At the highest optical powers, the displacement imprecision in the vicinity of $\\Omega_{\\mathrm{{m}}}$ is estimated (from the saddle at 2.5 MHz) to be $n_{\\mathrm{{imp}}}\\approx 2.5\\cdot10^{-4}$, while the shot-noise equivalent displacement is  $n^{\\mathrm{{(shot)}}}_{\\mathrm{{imp}}}\\approx 1.0\\cdot10^{-4}$.  These correspond to imprecisions 30 and 34 dB below that at the SQL ($n_{\\mathrm{{imp}}}=0.25$), respectively.  The absolute magnitude of the extraneous imprecision, $2S^{\\mathrm{{zp}}}_\\omega(\\Omega_{\\mathrm{{m}}})\\cdot(n_{\\mathrm{{imp}}}-n_{\\mathrm{{imp}}}^{\\mathrm{{(shot)}}})\\approx (2\\pi\\cdot 120\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, is consistent with a mixture of ECDL noise ($\\sim30\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$ \\cite{wilson2015measurement}), TRN ($\\sim10\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$ \\cite{anetsberger_near-field_2009}), and off-resonant thermal noise ($\\sim70\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$). The latter is estimated using the `structural damping' model of Saulson \\cite{saulson1990thermal},\n\n", "itemtype": "equation", "pos": 62118, "prevtext": "\nwhere $\\Delta$ is the laser-cavity detuning, $n_{\\mathrm{{c}}}(\\Delta)= (4P/(\\hbar\\omega_{\\mathrm{{0}}}\\kappa))(\\kappa_{\\mathrm{{ex}}}/\\kappa)/(1+4(\\Delta/\\kappa)^2)$ is the intracavity photon number, and $P$ is the power injected into the cavity.  (We note that radiation pressure damping also occurs for a detuned input field; however, in the devices studied, for which $\\Omega_{\\mathrm{{m}}}/\\kappa\\sim 0.01$, this effect was found to be overwhelmed by photothermal damping \\cite{metzger2004cavity}.) \n\nA measurement of the optical spring effect is shown in {Fig.~\\ref{{fig:spring}}}, corresponding to the sample also characterized in {Fig.~\\ref{{fig:char_experimentalsetup}}}c.  The injected powers used --- $P = 60,120$ nW --- were chosen to avoid instabilities due to photothermal/radiation pressure damping.  The cavity was critically coupled ($\\kappa_{\\mathrm{{ex}}}\\approx\\kappa/2\\approx 2\\pi\\cdot 550$ MHz) and laser detuning was estimated from the mean transmitted power.  Overlaid models correspond to {Eq.~\\ref{{eq:opticalspring}}} with the value $g_0= 2\\pi\\cdot 60$ kHz, inferred from a least-squared fit to the low power measurement.  This value is within 10$\\%$ of that inferred from thermal noise in {Fig.~\\ref{{fig:char_experimentalsetup}}}c.\n\n\\begin{figure*}[t!]\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_11.pdf}\n\t\\caption{(a) Measured vacuum optomechanical coupling rate ($g_0$) and cooperativity ($\\mathcal{C}_0$, assuming $\\Gamma_{\\mathrm{{m}}}=2\\pi\\cdot15$ Hz) versus lateral beam position ($y$) for TM (solid circles) and TE (open circles) cavity modes. (b) Corresponding intrinsic cavity decay rate ($\\kappa_0$). (c)  Measured $g_0$ versus beam width ($w$) for two disk thicknesses ($t_{\\mathrm{{d}}}$). (d) Measured $g_0$ versus mode frequency, $\\Omega_{\\mathrm{{m}}}^{(n)}\\approx n\\Omega_{\\mathrm{{m}}}^{(0)}$.  Red dots correspond to odd harmonics ($n = 1,3,5...$).  Solid and dashed lines are model curves (Eq. \\ref{eq:g0vsn}b) for a sampling length of $l_{\\mathrm{{eff}}}=9.6$ and $l_{\\mathrm{{eff}}} = 0$, respectively}\n\t\\label{fig:char_lateral}\n\t\\vspace{0pt}\n\\end{figure*}\n\n\n\n\n\\subsection{$g_0$ and $\\mathcal{C}_0$ versus lateral beam position}\\label{sec:char_lateral}\n\nAs discussed in {Sec.~\\ref{{sec:g0model}}}, $g_0$ depends sensitively on the lateral positioning of the nanobeam, and assumes a maximum (minimum) value for out-of-plane (in-plane) flexural modes when centered above the WGM.  This behavior was studied by sweeping the lateral position of the beam using an appropriate e-beam mask ({Sec.~\\ref{{sec:fab_mechanical}}}). Measurements of $g_0$ versus lateral beam position are shown in {Fig.~\\ref{{fig:char_lateral}}}a.  (In-plane modes exhibit typically $10\\times$ lower $g_0$, and were not considered.) for beam and disk dimensions of $\\{l,w,t\\}=\\{60,0.4,0.06\\}\\;\\mu$m and $\\{r,t_{\\mathrm{{d}}},\\theta\\}=\\{15\\,\\mu{\\mathrm{{m}}},0.60\\,\\mu{\\mathrm{{m}}},30\\,{\\mathrm{{deg.}}}\\}$, respectively, and for a vertical gap of 25 nm.  In agreement with numerical modeling (dashed line), $g_0$ assumes a maximum of $2\\pi\\cdot 40$ kHz as the outer edge of the beam eclipses the rim of the disk.  \n\nAlso shown in {Fig.~\\ref{{fig:char_lateral}}}b are measurements of $\\kappa$ versus lateral beam position ($y$).  When the beam is displaced far from the disk, $\\kappa$ converges to the intrinsic value of $\\sim 2\\pi\\cdot 100$ MHz observed in {Fig.~\\ref{{fig:design_kappa}}}, suggesting that CMP did not significantly affect microdisk surface quality. As the beam is brought within 100 nm of the disk, $\\kappa$ is observed to increase sharply.  The observed exponential dependence $\\kappa$ on $y$ is independent of mode polarization and similar to the scaling observed in \\cite{anetsberger_measuring_2010} with a beam coupled to a microtoroid. \nThe absolute magnitude of the loss is also inconsistent with bulk Si$_3$N$_4$ optical absorption --- specifically, accounting for the relatively small fraction of energy stored in the beam, the observed loss would require an imaginary index of $\\sim10^{-4}$, which is 1-2 orders of magnitude larger than conventionally observed for Si$_3$N$_4$ at NIR wavelengths \\cite{zwickl_high_2008,wilson2009cavity}. We thus conjecture that this loss is due to scattering from and/or waveguide coupling into the beam.\n\nCombining measurements of $g_0$ and $\\kappa$ with typical room temperature mechanical damping rate of $\\Gamma_{\\mathrm{{m}}}=2\\pi\\cdot 15$ Hz (we observed no change in $\\Gamma_{\\mathrm{{m}}}$ for small beam-disk seperation, suggesting that squeeze-film gas damping \\cite{verbridge2008size} was not a factor), the single-photon cooperativity is observed to approach $\\mathcal{C}_0\\sim1$. \nThis value is limited by the unfavorable scaling of $g_0^2/\\kappa$ as $g_0$ begins to saturate.  Despite this limitation, the inferred $\\mathcal{C}_0$ represents a nearly 50 dB increase over our prior chip-scale implementation \\cite{gavartin_hybrid_2012}, owing to the combined 100-fold increase of $g_0$ and 10-fold reduction in $\\kappa$.  Increase $g_0$ is due to the precise vertical and lateral positioning of the beam afforded by CMP and e-beam processing.  Reduced $\\kappa$ is due to greater isolation of the disk during beam patterning, making use of the poly-Si sacrificial layer.  {Fig.~\\ref{{fig:char_lateral}}}b suggests that $\\kappa$ is ultimately dominated by beam-induced scattering/absorption loss, rather than deterioration of intrinsic disk loss ({Fig.~\\ref{{fig:design_kappa}}}), implying that an additional 10-fold reduction in $\\kappa$ may yet be realized with appropriate beam shaping/positioning.\n\n\n\n\n\\subsection{$g_0$ and $\\mathcal{C}_0$ versus beam width and disk thickness}\\label{sec:char_overlap}\n\nWider beams ($w\\sim \\lambda$) and thinner disks $(t_{\\mathrm{{d}}}<\\lambda)$ were fabricated in an attempt to increase $g_0$ and $\\mathcal{C}_0$ (see {Eq.~\\ref{{eq:Gapprox}}}).  Measurements of $\\{g_0,\\mathcal{C}_0\\}$ vs $w$ for two microdisk thicknesses, $t_{\\mathrm{{d}}}\\approx0.43\\;{\\mathrm{{and}}}\\;0.63\\;\\mu{\\mathrm{{m}}}$, are shown in {Fig.~\\ref{{fig:char_lateral}}}. Fixed dimensions of the nanobeam and microdisk are $\\{t,l\\}\\approx \\{0.06,60\\}\\;\\mu{\\mathrm{{m}}}$ and $\\{r_{\\mathrm{{d}}},\\theta\\}\\approx\\{15\\;\\mu{\\mathrm{{m}}},30\\;{\\mathrm{{deg.}}}\\}$, respectively.  The lateral beam position was chosen to maximize $g_0$ for the $0.4\\;\\mu{\\mathrm{{m}}}$-wide beam (see {Fig.~\\ref{{fig:char_lateral}}}). For the TE optical modes studied,  a roughly 2$\\times$ increase in $g_0$ was observed for the $30\\%$ thinner disk.  In both cases, $g_0$ scaled roughly linearly for widths $w\\in[0.4,1]\\;\\mu$m.  $\\mathcal{C}_0$ also increased with $w$, roughly in proportion to $g_0^2$, for both $t_{\\mathrm{{d}}}$.  This is due to the fact that $\\kappa$ (not shown) was roughly independent of $w$ for both disk thicknesses and a factor of four larger for the thinner disk.  The highest optomechanical coupling rate we have measured, $g_0\\approx2\\pi\\cdot 150$ kHz, was for a 1 $\\mu$m-wide beam coupled to a $0.43\\;\\mu{\\mathrm{{{m}}}}$-thick disk.  The highest cooperativities observed, $\\mathcal{C}_0 > 2.5$, were for 1 $\\mu$m-wide beams coupled to disks of both thicknesses.\n\n\n\n\\subsection{$g_0$ versus mechanical mode order}\\label{sec:char_harmonics}\n\n$g_0$ was also studied for higher order mechanical modes. As shown in {Fig.~\\ref{{fig:char_lateral}}}d\n, $g_0$ decreases as the vibrational node spacing approaches the dimensions of the effective sampling length $l_{\\mathrm{{eff}}}$.  In this case the model in {Sec.~\\ref{{sec:g0model}}} --- which assumes rigid displacement of a beam with effective mass $m=\\rho t w l/2$ --- breaks down.  A simple extension of the model is shown as a red line in {Fig.~\\ref{{fig:char_lateral}}}d. Here $m$ is computed with respect to optical-intensity-weighted displacement of the mechanical mode:  \n\\begin{subequations}\\label{eq:g0vsn}\n\t\n", "index": 9, "text": "\\begin{align}\nm &= \\frac{\\int_{\\mathrm{{beam}}}\\rho |u(r)|^2 d^3 r}{\\lvert\\int_{\\mathrm{{beam}}} |E(r)|^2 u(r) d^3 r/\\int_{\\mathrm{{beam}}} |E(r)|^2 d^3 r\\rvert^2}\\\\ & \\approx \\frac{\\rho t w l}{1-(-1)^n}\\frac{1}{{\\mathrm{{sinc}}}^2\\left(\\frac{n\\pi}{2}\\frac{l_{\\mathrm{{eff}}}}{l}\\right)}\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle m\" display=\"inline\"><mi>m</mi></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{\\int_{\\mathrm{{beam}}}\\rho|u(r)|^{2}d^{3}r}{\\lvert\\int_{%&#10;\\mathrm{{beam}}}|E(r)|^{2}u(r)d^{3}r/\\int_{\\mathrm{{beam}}}|E(r)|^{2}d^{3}r%&#10;\\rvert^{2}}\" display=\"inline\"><mrow><mi/><mo>=</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>beam</mi></msub><mrow><mi>ρ</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>r</mi></mrow></mrow><msup><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>beam</mi></msub><mrow><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>r</mi></mrow><mo>/</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>beam</mi></msub><mrow><msup><mrow><mo stretchy=\"false\">|</mo><mrow><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>r</mi></mrow></mrow></mrow></mrow><mo fence=\"true\" stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mfrac></mstyle></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle\\approx\\frac{\\rho twl}{1-(-1)^{n}}\\frac{1}{{\\mathrm{{sinc}}}^{2}%&#10;\\left(\\frac{n\\pi}{2}\\frac{l_{\\mathrm{{eff}}}}{l}\\right)}\" display=\"inline\"><mrow><mi/><mo>≈</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mi>ρ</mi><mo>⁢</mo><mi>t</mi><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>l</mi></mrow><mrow><mn>1</mn><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mi>n</mi></msup></mrow></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mrow><msup><mi>sinc</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><mfrac><mrow><mi>n</mi><mo>⁢</mo><mi>π</mi></mrow><mn>2</mn></mfrac><mo>⁢</mo><mfrac><msub><mi>l</mi><mi>eff</mi></msub><mi>l</mi></mfrac></mrow><mo>)</mo></mrow></mrow></mfrac></mstyle></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06745.tex", "nexttext": "\nshown in gray in {Fig.~\\ref{{fig:disp}}}, for $Q_{\\mathrm{{m}}} = \\Omega_{\\mathrm{{m}}}/\\Gamma_{\\mathrm{{m}}} = 3.7\\cdot 10^5$.  \n\nThe total efficiency of the measurement is estimated by comparing the power dependence of the imprecision ($n_{\\mathrm{{imp}}}$), the effective thermal bath occupation ($n_{\\mathrm{{tot}}}$), and their geometric mean $\\sqrt{n_{\\mathrm{{imp}}}n_{\\mathrm{{tot}}}}$ to the ideal values $1/(16\\mathcal{C}_0 n_{\\mathrm{{c}}})$, $\\mathcal{C}_0 n_{\\mathrm{{c}}}$, and $1/4$, respectively, where the last case represents the Heisenberg uncertainty limit \\cite{wilson2015measurement}. As shown on the right hand side of {Fig.~\\ref{{fig:disp}}}, the imprecision is a factor of 40 larger than ideal, due to a combination of cavity loss ($50\\%$), taper loss ($\\sim10\\%$), homodyne detector loss/misalignment, and optical mode splitting \\cite{wilson2015measurement}.  The effective thermal bath occupation is inferred by fitting to the off-resonant tail of the fundamental noise peak (to avoid the systematic error due to optical damping).  From these fits we infer a heating of $C_{\\mathrm{{0}}}^{\\mathrm{{ext}}}\\equiv (n_{\\mathrm{{tot}}}-n_{\\mathrm{{th}}})/n_{\\mathrm{{c}}}=1.6$, two times larger than expected due to quantum measurement back-action. The imprecision-back-action product is constrained, at high powers, to $4\\sqrt{n_{\\mathrm{{imp}}}n_{\\mathrm{{tot}}}}\\approx75$, due to the saturation of the measurement imprecision.  To the best of our knowledge, this represents the closest approach to the uncertainty limit for a room temperature mechanical oscillator.\n\n\n\n\n\n\\section{Summary and outlook}\\label{sec:conclusion}\n \nWe have presented a method to heterogeneously integrate a high-stress, Si$_3$N$_4$ nanobeam within the evanescent near-field of a SiO$_2$ microdisk. Building on earlier strategies \\cite{anetsberger_near-field_2009,gavartin_hybrid_2012}, the principle advance is a novel vertical integration technique which preserves the high $Q/$(mode volume) ratio of each resonator while enabling the beam and the disk to be separated by as little as 25 nm --- significantly smaller than the evanescent decay length of the microdisk's WGMs.  Samples of various dimensions were fabricated and characterized.  Simultaneously low mechanical loss, $\\Gamma_{\\mathrm{{m}}}=2\\pi\\cdot(10-100)\\;{\\mathrm{{Hz}}}$, low optical loss, $\\kappa=2\\pi\\cdot(100-1000)\\;{\\mathrm{{MHz}}}$, and large optomechanical coupling rates, $g_0 = 2\\pi\\cdot (10-100)\\;{\\mathrm{{kHz}}}$, were measured, corresponding to room temperature single-photon cooperativities as high as $\\mathcal{C}_0 \\equiv 4g_0^2/{\\Gamma_{\\mathrm{{m}}}\\kappa} = 2$.  \n\nThe reported system holds particular promise as a quantum-limited displacement sensor, owing to the large vacuum displacement of the nanobeam \nand the high power handling capacity of the microdisk.  For a typical device, possessing $\\{\\Omega_{\\mathrm{{m}}},\\Gamma_{\\mathrm{{m}}},\\kappa_0, g_0\\}\\approx 2\\pi\\cdot\\{4.5\\;{\\mathrm{{MHz}}},15\\;{\\mathrm{{Hz}}}, 500\\;{\\mathrm{{MHz}}},50\\;{\\mathrm{{kHz}}}\\}$, the resonant vacuum displacement noise, $S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}}) = 4g_0^2/\\Gamma_{\\mathrm{{m}}} \\approx (2\\pi\\cdot 26\\;{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, is orders of magnitude larger than major sources of imprecision --- such as laser frequency and thermorefractive noise  \\cite{anetsberger_measuring_2010} --- and commensurate with shot noise for an ultra-low intracavity photon number of $n_{\\mathrm{{c}}}=1/(16 \\mathcal{C}_0)= 0.05$ \\cite{wilson2015measurement}.  Operating a similar device at 4 K with $n_{\\mathrm{{c}}}\\sim 10^5$ (corresponding to $P\\sim 100\\;\\mu{\\mathrm{{W}}}$ when critically coupled to the fiber waveguide), we were able to achieve a displacement imprecision $n_{\\mathrm{{th}}}$ times (43 dB) below $S_\\omega^{\\mathrm{{zp}}}$, while maintaining an imprecision-back-action product within a factor of 5 of the uncertainty limit \\cite{wilson2015measurement}. This regime of `efficient' measurement --- characterized by the ability to resolve a phonon-equivalent displacement in the thermal decoherence time --- enabled us to feedback cool the mechanical mode to near its ground state \\cite{wilson2015measurement}, and might be extended to other quantum control tasks, such as squeezed-state preparation \\cite{szorkovszky2011mechanical}.\n\n\\begin{figure}[tr!]\n\t\\centering\n\t\\includegraphics[width=1\\linewidth]{figure_13.pdf}\n\t\\caption{Variation on a theme: suspending the nanobeam from tethers enables higer $g_0$ by reducing mass without changing optomechanical mode overlap.  Here the central beam coincides with the effective sampling length of the optical mode.}\n\t\\label{fig:outlook}\n\t\\vspace{-10pt}\n\\end{figure}\n\nAn intriguing question is whether the reported device may be used to realize Heisenberg-limited displacement measurements at room temperature.  For the radio frequency oscillators under study ($n_{\\mathrm{{th}}}\\sim10^6$), the main challenges are (1) pumping the cavity with $n_{\\mathrm{{c}}}=n_{\\mathrm{{th}}}/C_{0}\\sim 10^6$ photons in order to achieve the necessary measurement strength (characterized by a phonon-equivalent radiation pressure shot noise of $n_{\\mathrm{{ba}}}=\\mathcal{C}_0 n_{\\mathrm{{c}}}>n_{\\mathrm{{th}}}$), (2) reducing extraneous sources of measurement imprecision to $S_\\omega^{\\mathrm{{zp}}}/n_{\\mathrm{{th}}} < (2\\pi\\cdot 10\\;{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, and (3) reducing extraneous heating to below $n_{\\mathrm{{ba}}}$.  Because of the (blue-stable) thermal self-locking effect in room temperature SiO$_2$ microcavities \\cite{arcizet2009cryogenic}, the first requirement \nis expected to be limited by parametric radiation pressure instabilities, requiring active feedback damping.  (Taking a different approach, cross-correlation techniques may be employed to detect radiation pressure shot noise at the 1$\\%$ level \\cite{verlot2009scheme}, significantly relaxing associated demands on input power and active stabilization.)  For microdisks with dimensions studied here, the second requirement is expected to be limited by thermorefractive noise at the level of $S^{\\mathrm{{trn}}}_\\omega\\sim (2\\pi\\cdot10\\;{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$ \\cite{anetsberger_measuring_2010}, an impressive 60 dB lower than $S_\\omega^{\\mathrm{{zp}}}$.  Reaching $S^{\\mathrm{{trn}}}_\\omega<S_\\omega^{\\mathrm{{zp}}}/n_{\\mathrm{{th}}}$ would require a moderate increase in $g_0^2\\cdot Q_{\\mathrm{{m}}}$ (for instance, by using lower-mass, ``tethered\" beams \\cite{krause2015optical}; see {Fig.~\\ref{{fig:outlook}}}).  The third requirement depends on the details of the nanoscale heat transfer process.  At 4 K, we have observed photothermal heating consistent with an extraneous cooperativity of $\\mathcal{C}_0^{\\mathrm{{ext}}}\\equiv n_{\\mathrm{{ba}}}^{\\mathrm{{ext}}}/n_{\\mathrm{{c}}} \\sim 1$ \\cite{wilson2015measurement}; we anticipate this heating to reduce to tenable levels ($\\mathcal{C}_0^{\\mathrm{{ext}}}<\\mathcal{C}_0$) at room temperature, provided that the underlying process is related to the temperature-dependent thermal conductivity of amorphous glass \\cite{pohl2002low}.  Preliminary room temperature measurements, discussed in {Sec.~\\ref{{sec:disp}}}, suggest that $\\mathcal{C}_0^{\\mathrm{{ext}}}\\sim\\mathcal{C}_0$ can be met for a moderate $\\mathcal{C}_0\\sim 0.8$. \n\nIn addition to high cooperativity, the evanescent sensing platform and reported fabrication method have as a compelling feature the ability to incorporate new materials and/or planar geometries above a high-Q microdisk with nanometric precision.  This capability opens the door to a variety of ``hybrid\" sensing applications.  For example, the system may be electrically functionalized by vertically integrating  the beam into a parallel plate capacitor, or into the gradient field between two closely spaced electrodes \\cite{unterreithmeier2009universal,okamoto2015strongly}.  This interface --- which need not compromise the mechanical quality of the beam \\cite{yu2012control} --- can form the basic building block of a high-efficiency electro-optic converter, with applications such as precision radio wave sensing \\cite{bagci2014optical}.  Pushed to a different extreme, two dimensional materials such as graphene or MoS$_2$ may be integrated with a microdisk by using the SiN film as a sacrificial substrate \\cite{schmid2014single}.  Another intriguing possibility, in conjunction with the preparation of low entropy mechanical states using measurement-based feedback, is to functionalize the beam with a two-level system, such as an NV center embedded in a diamond nanocrystal \\cite{arcizet2011single}. Nanobeams integrated with microdisks may also serve as a platform for remotely-coupled ``atom-optomechanics\" \\cite{hammerer2009establishing,jockel2014sympathetic}, taking advantage of the low oscillator mass, high cavity finesse, and recent developments in fiber-based atom traps \\cite{vetsch2010optical}.   Finally, we note that the ability to perform broadband, thermal-noise-limited measurements of high-$Q$ nanomechanical oscillators may help shed light on the microscopic origin of intrinsic damping \\cite{groblacher_observation_2015}.\n\\\\\n\\begin{center}\n\\textbf{ACKNOWLEDGMENTS}\n\\end{center}\n\n\nWe acknowledge fabrication advice from E. Gavartin in early stages of the project. All samples were fabricated at the CMi (Center of MicroNanotechnology) at EPFL. Research was funded by an ERC Advanced Grant (QuREM), by the DARPA/MTO ORCHID program, the Marie Curie Initial Training Network `Cavity Quantum Optomechanics' (cQOM), the Swiss National Science Foundation and through support from the NCCR of Quantum Engineering (QSIT). D.J.W. acknowledges support from the European Commission through a Marie SkÅ\u0082odowska-Curie Fellowship (IIF project 331985).\n\t\n\t\n\t\n\n}\n\n\\bibliographystyle{apsrev4-1}\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 68689, "prevtext": "\n\\end{subequations}\nwhere $\\vec{u}(x,y,z) \\approx{\\mathrm{{sin}}}(n\\pi x/l)\\hat{z}$ is the displacement profile of the $n^{\\mathrm{{th}}}$-order out-of-plane flexural mode. The latter expression is appropriate when the transverse dimensions of the beam are much smaller than that of the WGM, and assumes that the intensity distribution sampled by the beam is uniform along the beam axis with an effective sampling length $l_{\\mathrm{{eff}}}$.  Using $\\Omega_{\\mathrm{{m}}}\\propto n$ gives $g_0^{(n)}/g_0^{(0)}\\approx \\lvert{\\mathrm{{sinc}}}\\left(\\frac{n \\pi}{2}\\frac{l_{\\mathrm{{eff}}}}{l}\\right)\\rvert/\\sqrt{n}$ for odd $n$ and 0 for even $n$.  The model shown in {Fig.~\\ref{{fig:char_lateral}}}d agrees quantitatively with experiment assuming an effective length of $l_{\\mathrm{{eff}}}=9.6\\;\\mu$m as the only free parameter.  A simple route to increasing $g_0$ would be to remove mass from the beam outside of the effective sampling length (see {Fig.~\\ref{{fig:outlook}}}).\n\n\\section{Displacement sensitivity}\\label{sec:disp}\n\n\nAs an illustration of device performance, we use the microdisk to perform a cavity-enhanced interferometric measurement of the beam's displacement. For this purpose, the fiber taper and microdisk are embedded in one arm of a length- and power-balanced homodyne interferometer ({Fig.~\\ref{{fig:char_experimentalsetup}}}).  The cavity is driven on resonance using the Pound-Drever-Hall technique.  A piezoelectric mirror is use to stabilize the interferometer path length difference so that the homodyne photocurrent is proportional to the phase of the transmitted cavity field.\n\n\\begin{figure*}[th!]\n\t\\centering\n\t\\includegraphics[width=1.0\\linewidth]{figure_12.pdf}\n\t\\caption{(a) Nanobeam displacement noise, measured by balanced homodyne detection of the microdisk output field, for various input powers.  Noise spectra are expressed in units relative to the cavity frequency noise produced by one phonon of fundamental out-of-plane vibration, $2S_\\omega^{zp}(\\Omega_{\\mathrm{{m}}})=(2\\pi\\cdot9.8\\,{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, where $\\Omega_{\\mathrm{{m}}}=2\\pi\\cdot4.4$ MHz. For large power, the fundamental noise peak is shifted and broadened by optical spring softening and damping, respectively.  The peak at 5 MHz is due to thermal motion of the fundamental in-plane mode.  The gray curve is a model for the intrinsic thermal motion of the fundamental mode ({Eq.~\\ref{{eq:Saulson}}}). (b) Measured phonon equivalent displacement, $n_{\\mathrm{{tot}}} = S_\\omega(\\Omega_{\\mathrm{{m}}})/2S_\\omega(\\Omega_{\\mathrm{{m}}})^{\\mathrm{{zp}}}$, displacement imprecision, $n_{\\mathrm{{imp}}}$, and their geometric mean versus intracavity photon number.  Dashed lines denote ideal values for $n_{\\mathrm{{tot}}}=n_{\\mathrm{{th}}}+n_{\\mathrm{{ba}}}+n_{\\mathrm{{imp}}}$ (orange), $n_{\\mathrm{{ba}}}=\\mathcal{C}_0n_{\\mathrm{{c}}}$ (red), and $n_{\\mathrm{{imp}}}=1/16\\mathcal{C}_0n_{\\mathrm{{c}}}$ (blue), using $n_{\\mathrm{{th}}}\\approx1.4\\cdot10^6$ and $\\mathcal{C}_0=0.8$. Green arrow  indicates proximity to the uncertainty  limit, $4\\sqrt{n_{\\mathrm{{imp}}}n_{\\mathrm{{tot}}}}\\ge 1$.}\\label{fig:disp}\n\t\\vspace{-0pt}\n\\end{figure*}\n\nDisplacement noise spectra are shown in {Fig.~\\ref{{fig:disp}}} for a $\\{l,w,t\\}=\\{60,0.4,0.06\\}\\;\\mu$m beam with optomechanical parameters $\\{\\Omega_{\\mathrm{{m}}},\\,\\Gamma_{\\mathrm{{m}}},\\,\\kappa,\\, g_0,\\,\\mathcal{C}_0\\}\\approx\\{2\\pi\\cdot4.4\\,{\\mathrm{{MHz}}},\\,2\\pi\\cdot12\\,{\\mathrm{{Hz}}},\\,2\\pi\\cdot350\\,{\\mathrm{{MHz}}},\\,2\\pi\\cdot30\\,{\\mathrm{{kHz}}},\\,0.8\\}$.  (Here $\\kappa$ corresponds to the critically-coupled cavity linewidth and other parameters correspond to the fundamental out-of-plane mechanical mode.)  For the measurements shown, the cavity was critically coupled and the power of the input field was swept from $0.1-30\\;\\mu$W. The homodyne photocurrent noise spectrum is plotted in units relative to the signal produced by a phonon of displacement $2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx(2\\pi\\cdot9.8\\,{\\mathrm{{kHz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$ (equivalent to $2S_x^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx(2\\pi\\cdot8.8\\,{\\mathrm{{fm}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$ assuming $x_{\\mathrm{{zp}}}=25$ fm).  In these units, the magnitude of the fundamental thermal noise peak (neglecting photothermal or dynamical back-action) is equal to the effective thermal occupation $n_{\\mathrm{{tot}}} = n_{\\mathrm{{th}}}+n_{\\mathrm{{ba}}}+n_{\\mathrm{{imp}}}$, where $n_{\\mathrm{{th}}} \\approx k_{\\mathrm{{B}}}T/\\hbar\\Omega_{\\mathrm{{m}}}\\approx 1.4\\cdot 10^6$ is the ambient bath occupation, $n_{\\mathrm{{ba}}}$ is the effective thermal bath occupation associated with classical and quantum measurement back-action, and $n_{\\mathrm{{imp}}}\\equiv S_\\omega^{\\mathrm{{imp}}}(\\Omega_{\\mathrm{{m}}})/2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})$ is the apparent thermal occupation associated with the measurement imprecision, $S_\\omega^{\\mathrm{{imp}}}$.  The noise spectra are calibrated by bootstrapping a low power measurement to $S_\\omega(\\Omega_{\\mathrm{{m}}})/(2S_\\omega^{\\mathrm{{zp}}}(\\Omega_{\\mathrm{{m}}})\\approx 2 n_{\\mathrm{{th}}}$. For larger optical powers, dynamic spring/damping forces modify the peak. At the highest optical powers, the displacement imprecision in the vicinity of $\\Omega_{\\mathrm{{m}}}$ is estimated (from the saddle at 2.5 MHz) to be $n_{\\mathrm{{imp}}}\\approx 2.5\\cdot10^{-4}$, while the shot-noise equivalent displacement is  $n^{\\mathrm{{(shot)}}}_{\\mathrm{{imp}}}\\approx 1.0\\cdot10^{-4}$.  These correspond to imprecisions 30 and 34 dB below that at the SQL ($n_{\\mathrm{{imp}}}=0.25$), respectively.  The absolute magnitude of the extraneous imprecision, $2S^{\\mathrm{{zp}}}_\\omega(\\Omega_{\\mathrm{{m}}})\\cdot(n_{\\mathrm{{imp}}}-n_{\\mathrm{{imp}}}^{\\mathrm{{(shot)}}})\\approx (2\\pi\\cdot 120\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}})^2$, is consistent with a mixture of ECDL noise ($\\sim30\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$ \\cite{wilson2015measurement}), TRN ($\\sim10\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$ \\cite{anetsberger_near-field_2009}), and off-resonant thermal noise ($\\sim70\\,{\\mathrm{{Hz}}}/\\sqrt{{\\mathrm{{Hz}}}}$). The latter is estimated using the `structural damping' model of Saulson \\cite{saulson1990thermal},\n\n", "index": 11, "text": "\\begin{equation}\\label{eq:Saulson}\n\\frac{S_\\omega(\\Omega)}{2S^{\\mathrm{{zp}}}_\\omega(\\Omega_{\\mathrm{{m}}})} \\approx n_{\\mathrm{{th}}}\\frac{\\Omega_{\\mathrm{{m}}}}{\\Omega}\\frac{\\Gamma_{\\mathrm{{m}}}^2\\Omega_{\\mathrm{{m}}}^2}{(\\Omega^2-\\Omega_{\\mathrm{{m}}}^2)^2+\\Gamma_{\\mathrm{{m}}}^2\\Omega_{\\mathrm{{m}}}^2}\\lesssim \\frac{7n_{\\mathrm{{th}}}}{Q_{\\mathrm{{m}}}^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\frac{S_{\\omega}(\\Omega)}{2S^{\\mathrm{{zp}}}_{\\omega}(\\Omega_{\\mathrm{{m}}})}%&#10;\\approx n_{\\mathrm{{th}}}\\frac{\\Omega_{\\mathrm{{m}}}}{\\Omega}\\frac{\\Gamma_{%&#10;\\mathrm{{m}}}^{2}\\Omega_{\\mathrm{{m}}}^{2}}{(\\Omega^{2}-\\Omega_{\\mathrm{{m}}}^%&#10;{2})^{2}+\\Gamma_{\\mathrm{{m}}}^{2}\\Omega_{\\mathrm{{m}}}^{2}}\\lesssim\\frac{7n_{%&#10;\\mathrm{{th}}}}{Q_{\\mathrm{{m}}}^{2}},\" display=\"block\"><mrow><mrow><mfrac><mrow><msub><mi>S</mi><mi>ω</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">Ω</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>S</mi><mi>ω</mi><mi>zp</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>≈</mo><mrow><msub><mi>n</mi><mi>th</mi></msub><mo>⁢</mo><mfrac><msub><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi></msub><mi mathvariant=\"normal\">Ω</mi></mfrac><mo>⁢</mo><mfrac><mrow><msubsup><mi mathvariant=\"normal\">Γ</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup></mrow><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup><mo>-</mo><msubsup><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><mrow><msubsup><mi mathvariant=\"normal\">Γ</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Ω</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup></mrow></mrow></mfrac></mrow><mo>≲</mo><mfrac><mrow><mn>7</mn><mo>⁢</mo><msub><mi>n</mi><mi>th</mi></msub></mrow><msubsup><mi>Q</mi><mi mathvariant=\"normal\">m</mi><mn>2</mn></msubsup></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}]