[{"file": "1601.07356.tex", "nexttext": "\nwhere $\\eta$ denotes conformal time and $u_i$ is the (spatial) velocity of the source. The Einstein convention is used with $i$ running over the spatial indices $1,2,3$. The vector $n^{\\mu}$ is the propagation direction unit $4$-vector, {\\em i.e.} $n^{\\mu} \\propto k^{\\mu}+\\frac{k^{\\nu}u_{\\nu}}{c^2}u^{\\mu}$. It is sufficient to use the background version of $n^{\\mu}$ and in that case $n^{i}$ is the unit vector pointing in the direction from the source to the observer. \n\\newline\\indent\nIn the expression for the Doppler convergence given above, a term due to the peculiar motion of the observer has been omitted. This is justified by noting that the observer velocity can be estimated by measuring the CMB dipole and hence has no consequences when interpreting real observations. Note also that in equation (\\ref{eq:Doppler}), the scale factor etc. are evaluated at the spacetime position corresponding to the {\\em observed} redshift $z_{\\text{obs}}$, not a background redshift computed with the background metric. \n\\newline\\indent\nWhen mock redshift-distance data points have been obtained as described above, they are fitted to the expression for the luminosity distance in an FLRW universe,\n\n", "itemtype": "equation", "pos": 10006, "prevtext": "\n\n\n\n\\title{The local value of $H_0$ in an inhomogeneous universe}\n\n\\author[a]{I. Odderskov,}\n\\author[a]{S. M. Koksbang,}\n\\author[a]{S. Hannestad,}\n\n\n\n\n\\affiliation[a]{Department of Physics and Astronomy \\\\ University of Aarhus, Ny Munkegade, Aarhus C, Denmark}\n\n\n\\emailAdd{isho07@phys.au.dk, koksbang@phys.au.dk, sth@phys.au.dk}\n\n\\date{\\today}\n\n\\abstract{\nThe effects of local inhomogeneities on low redshift $H_0$ determinations are studied by estimating the redshift-distance relation of mock sources in N-body simulations. The results are compared to those obtained using the standard approach based on Hubble's law. The comparison shows a clear tendency for the standard approach to yield lower values of $H_0$ than the approach based on the scheme using light rays. The difference is, however, small. More precisely, it is found that the overall effect of inhomogeneities on the determination of $H_0$ is a small increase in the local estimates of about $0.3\\%$ compared to the results obtained with Hubble's law, when based on a typical distribution of supernovae in the redshift range $0.01 < z < 0.1$.\n\\newline\\indent\nThe overall conclusion of the study is a verification of the results that have earlier been obtained by using Hubble's law: The effects of inhomogeneities on local $H_0$ estimates are not significant enough to make it plausible that differences in high- and low-redshift estimates of $H_0$ are due to small inhomogeneities within the setting of standard cosmology.\n}\n\\maketitle\n\n\\section{Introduction}\nOverall, the $\\Lambda$CDM model is consistent with observations at a remarkable level considering the model's simplicity compared to the real, inhomogeneous universe. However, some observational inconsistencies do exist when observations are interpreted within the Friedmann-Lemaitre-Robertson-Walker (FLRW) regime. One such inconsistency is differences in the Hubble constant $H_0$ when determined by different types of observations. In particular, CMB and BAO observations, pertaining to the large scale universe, yield smaller values of $H_0$ than local observations such as those based on supernova redshift-distance relations \\cite{Planck,Carnegie,Riess}. As pointed out in {\\em e.g.} \\cite{Efstathiou}, the different $H_0$ estimates are not actually inconsistent and might for instance simply be due to systematic effects not properly accounted for. Nevertheless, the tension between the different values of $H_0$ is conspicuous and deserves to be studied further.\n\\newline\\indent  \nObservations are primarily interpreted using FLRW predictions. The Universe is, however, not an FLRW universe at an exact level and the spatial inhomogeneities and anisotropies of the real universe may affect especially low-redshift observations and their interpretation. Inhomogeneities may in principle also affect large-scale observations such as those of the CMB. The general expectation is that this is not the case though -- an expectation supported by the studies in {\\em e.g.} \\cite{CMB_distance, lensing_bias, MikkoSyksy_CMB} (see however also\\footnote{Note that it is also in \\cite{Durrer_CMB} concluded that an inhomogeneous spacetime can have significant effects on $H_0$ estimates based on CMB observations. The conclusion is however based on an erroneous analysis which is later corrected by the same authors in \\cite{CMB_distance}.}\n \\cite{Bolejko_CMB}). This implies that the tension between the different $H_0$ estimates may be a result of small scale inhomogeneities primarily affecting the low-redshift estimates while the large scale estimates of $H_0$ can be considered yielding the global value. In order to investigate whether or not this is the case, quantitative theoretical considerations regarding low-redshift estimates of $H_0$ are needed. Several different types of studies of effects of inhomogeneities have been conducted, mostly either based on perturbation theory ({\\em e.g.} \\cite{umeh, ido2, ido3, VT, Bonvin, Clarkson}) or swiss-cheese and onion models ({\\em e.g.} \\cite{velocity_point, H0_inhomo, tardis, light_cone, marra,bolejko_cmb,Szybka, lensing_effects, dallas_cheese, Kottler_cheese, onion}). The results from such studies are not always consistent with each other and are hence not conclusive at this point, although there is a tendency for the studies to indicate a negligible effect of inhomogeneities on observations after averaging over many observed sources (unless there is significant backreaction \\cite{lightprop_Syksy, lightprop_Syksy2, tardis}). However, studies of effects of inhomogeneities only seldom focus on low-redshift $H_0$ determinations. One of the few studies focused on low-redshift $H_0$ estimates was presented in \\cite{Durrer_H0} where it was shown that spatial inhomogeneities may affect $H_0$ estimates at an observationally significant level. In contrast to this, studies based on Newtonian N-body simulations indicate that local inhomogeneities do not significantly affect local $H_0$ estimates and thus that local inhomogeneities cannot explain the tension between local and global determinations of $H_0$ \\cite{Wojtak:2013,Turner, Io}. A crucial point with the studies based on Newtonian N-body simulations is that they are usually based on Hubble's law. Real astrophysical observations are based on light rays that have traveled through the inhomogeneous universe to reach us. These light rays are affected by inhomogeneities in terms of {\\em e.g.} the actual null-paths, their redshift, and their ray-bundle magnification. In the study presented here, such effects are taken into account when computing redshift-distance relations in Newtonian N-body simulations. The resulting redshift-distance data points are fitted to the background FLRW relation with $H_0$ as the fitting parameter. If the discrepancy between the different types of $H_0$ determinations is due to one type (CMB + BAO) probing the global value while the other (low-redshift) studies yield a local value affected by inhomogeneities, then the best-fit $H_0$ value obtained here should be larger than the N-body background value of $H_0$.\n\n\n\n\n\n\n\n\\section{Method for computing redshift-distance relations in N-body simulations at low redshift}\\label{subsec:doppler}\nIn order to study the effects of inhomogeneities on the local measurement of $H_0$, mock observations are constructed by computing redshift-distance data points using results from an N-body simulation. The formalism for computing redshift-distance data points is introduced below while practical aspects regarding the N-body simulation are described in section \\ref{sec:scheme}.\n\\newline\\newline\nA recipe for going between Newtonian N-body simulations and a relativistic spacetime corresponding to the first order perturbed FLRW metric in the Newtonian gauge was given in \\cite{recipe}. By using N-body data based on exact, inhomogeneous solutions to Einstein's equations, it was in \\cite{Sofie, Sofie2} shown that the recipe leads to a very precise reproduction of redshift-distance relations in an inhomogeneous universe as long as the anisotropy of the individual structures is low. The particular procedure for computing redshift-distance relations studied in \\cite{Sofie2} will be used here. The study in \\cite{Sofie2} only included mildly non-linear structures, but in relation to the study presented here, a similar precision of the method has been confirmed for density fractions in the range $0.05\\lesssim \\frac{\\rho}{\\rho_{bg}} \\lesssim 10$, where $\\rho_{bg}$ is the density of the assumed ``background\". (The precision of the method for inhomogeneities outside this range has not been studied.) The procedure is therefore expected to yield fairly accurate estimates of redshift-distance relations including effects of inhomogeneities.\n\\newline\\indent\nThe procedure is only summarized below, and the reader is referred to {\\em e.g.} \\cite{recipe, Sofie2} or the other references cited in this section for elaborations.\n\\newline\\newline\nThe observed redshift of a light ray with tangent vector $k^{\\alpha}$ is computed following the standard definition $z_{\\text{obs}}+1 = \\frac{(k^{\\alpha}u_{\\alpha})_e}{(k^{\\alpha}u_{\\alpha})_0}$. The subscripts $0$ and $e$ indicate evaluation at the spacetime position of observation and emission respectively such that {\\em e.g.} $\\left( u^{\\alpha}\\right)|_0$ is the observer velocity and $\\left( u^{\\alpha}\\right)|_e$ is the velocity of the source. The velocity field is given by $u^{\\mu} = \\frac{c}{V}(1,v^i)$, where $v^i$ are the velocity components obtained from the N-body simulation and the normalization factor $ V \\approx \\sqrt{c^2 - a^2(v_r^2+ v_{\\theta}^2r^2 + v_{\\phi}^2r^2\\sin^2(\\theta))}$ is computed according to the findings of \\cite{Sofie2}.\n\\newline\\indent\nThe effects of inhomogeneities on the angular diameter distance can be described by the convergence $\\kappa$ such that the angular diameter distance along light rays in the N-body simulation is given by $D_A\\approx D_{A, bg}(1-\\kappa)$. $D_{A,bg}$ denotes the angular diameter distance at $z = z_{\\text{obs}}$ according to the FLRW background of the N-body simulation. Once the angular diameter distance is known, the corresponding luminosity distance can be computed using the distance duality relation $D_L = (1+z_{obs})^2 D_A$.\n\\newline\\newline\nAt linear level, the convergence is divided into several different contributions including the (integrated) Sachs-Wolfe contributions, a gravitational contribution and a Doppler contribution. In general, the two dominant contributions are the gravitational convergence and the Doppler convergence. As shown in \\cite{bright_side, bright_side2, Sofie2}, the gravitational contribution to the convergence is, however, irrelevant at low redshifts. Hence, for the purpose of the current study, the angular diameter distance can be computed as $D_A \\approx D_{A,bg}(1-\\kappa_v)$, where $\\kappa_v$ denotes the Doppler convergence. The Doppler convergence can be computed by (see {\\em e.g.} \\cite{Bonvin_doppler}):\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:Doppler}\n\\begin{split}\n\\kappa_vc =   \\left(1-\\frac{1}{a_{,t}(\\eta_0-\\eta)} \\right) n^iu_i, \\\\\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle\\kappa_{v}c=\\left(1-\\frac{1}{a_{,t}(\\eta_{0}-\\eta)}%&#10;\\right)n^{i}u_{i},\\\\&#10;\\end{split}\" display=\"block\"><mtable displaystyle=\"true\"><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><msub><mi>κ</mi><mi>v</mi></msub><mo>⁢</mo><mi>c</mi></mrow><mo>=</mo><mrow><mrow><mo>(</mo><mrow><mn>1</mn><mo>-</mo><mfrac><mn>1</mn><mrow><msub><mi>a</mi><mrow><mo>,</mo><mi>t</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>η</mi><mn>0</mn></msub><mo>-</mo><mi>η</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><msup><mi>n</mi><mi>i</mi></msup><mo>⁢</mo><msub><mi>u</mi><mi>i</mi></msub></mrow></mrow><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.07356.tex", "nexttext": "\nWhen fitting, $H_0$ is used as fitting parameter while $\\Omega_{m,0}$ and $\\Omega_{\\Lambda,0}$ are fixed to the values used in the N-body simulation.\n\\newline\\newline\nBefore moving on, it should be noted that the Doppler convergence occurs because of the difference between the observed redshift and the redshift obtained from background computations (see {\\em e.g.} \\cite{bright_side, bright_side2, Bonvin, Bonvin_doppler, xtra_doppler}). The effects of inhomogeneities studied here are therefore effects of peculiar velocities. The peculiar velocities are gravitationally induced by an inhomogeneous energy density and the effects of the peculiar velocities are thus effects of having a spacetime that deviates from the exactly spatially homogeneous and isotropic FLRW spacetimes. This fact will in the following be emphasized by referring to an ``inhomogeneous velocity field\" instead of ``peculiar velocities\".\n\\newline\\indent\nNote lastly, that the effects of an inhomogeneous velocity field on {\\em e.g.} local $H_0$ estimates was also studied in \\cite{Kaiser}, where it was argued that the effects can actually be understood without invoking general relativity.\n\n\n\n\n\\section{Mock observations}\\label{sec:scheme}\nThis section serves to introduce the construction of the mock observations used for the study. The (mock) observations are based on a Newtonian N-body simulation with cosmological parameters in agreement with the 2013 results from the Planck collaboration \\cite{Planck}, {\\em i.e.} the cosmological parameters are set according to $\\left( \\Omega_b,\\Omega_{\\text{CDM}}\\right) = (0.048,0.26)$ and ($h,\\sigma_8) = (0.68,0.84)$. The simulation is performed using a modified version of the GADGET-2 code \\cite{Springel:2005}, with initial conditions generated using a code written by J. Brandbyge \\cite{Brandbyge} based on transfer functions computed using CAMB\\footnote{http://camb.info/} \\cite{camb}. The simulation is run in a box of side length $\\SI{512}{Mpc/h}$, containing $512^3$ dark matter particles. The simulation is initiated at a redshift of $z=50$ and run until present time. \n\\newline\\indent\nBox size, simulation resolution and source distribution on the sky will not be varied here as it was in \\cite{Io} shown that such variations have only small effects on the results.\n\\newline\\newline\nVelocities and positions of sources as well as positions of observers are obtained by identifying these with halos, which are found using the halo-finder ROCKSTAR \\cite{Behroozi:2011}.\n\\newline\\indent\nAs seen in equation (\\ref{eq:Doppler}), the velocity fields of the sources are highly important for computing the Doppler convergence. It was demonstrated in \\cite{velocity_point} that the effects of inhomogeneities on observations will depend on the smoothing scales used to obtain {\\em e.g.} the velocity field from the discrete N-body data. This issue is here overcome by estimating source velocities as the velocities of bound structures, i.e. halos, in the simulation. Assuming that galaxies follow the motion of their dark matter host halos, this procedure corresponds to probing the velocity field in the same manner as is done in real observations.\n\n\n\n\n\\subsection{Redshift distribution of sources}\nThe redshift distribution of the sources affects the study; the further away the sources are, the less impact the peculiar velocities have. To understand the significance of the sources' redshift distribution, two different redshift distribution schemes are used. In one of the schemes, the sources are distributed according to the redshift distribution of the 155 supernovae of the CfA3+OLD sample \\cite{Jha:2007,Hicken:2009}.\nThe other scheme selects the 155 sources according to a mass weighted distribution, in which each halo in the distance range $\\SI{30}{Mpc/h}<r< \\SI{256}{Mpc/h}$ is selected with a probability proportional to its mass\\footnote{This distribution scheme builds on the assumption that the probability of a type Ia supernova occurring in a given halo is proportional to the halo mass. However, as seen in figure \\ref{fig:redshiftdistributions}, the scheme leads to a redshift distribution which is significantly different than the distribution of the CfA3+OLD sample.}. This distribution has the advantage that it is growing as a function of distance (due to the increasing volume of shells). Using this distribution scheme thereby provides a check that the $H_0$ estimates converge to the true value at large distances. Note also that it is this second scheme that was used in \\cite{Io}.\n\\newline\\indent\nThe difference between the two types of distributions is illustrated in figure \\ref{fig:redshiftdistributions}. The figure also shows an example of the differences in $H_0$ estimates based on observations following the two schemes.\n\n\n\\begin{figure}\n\\centering\n\\subfigure{\\hspace*{0.1cm}  \n\t\\includegraphics{redshiftdistribution_standard.pdf}\n}\n\\subfigure{\n\t\\includegraphics{redshiftdistribution_observed_halos_mass_weighted.pdf}\n}\n\t\n\\subfigure{\\hspace*{-0.4cm}\n\t\\includegraphics{example_Nbody_fit_standard.pdf}\n}\n\\subfigure{\n\t\\includegraphics{example_Nbody_fit_observed_halos_mass_weighted.pdf}\n}\n\n\\caption{\\textbf{Top}: Distribution of observations as a function of distance. Left: 'Typical' distribution used in estimates of $H_0$ in the local universe, chosen to correspond to the redshift distribution of the 155 SNe of the\nCfA3+OLD sample \\cite{Jha:2007,Hicken:2009}. Right: Mass weighted distribution. \\textbf{Bottom:} Example of fitting mock observations to equation (\\ref{eq:dLz}) to obtain $H_0$, given in terms of the dimensionless Hubble parameter $h=H_0/(\\SI{100}{km/s/Mpc})$, for the two different redshift distributions.}\n\\label{fig:redshiftdistributions}\n\\end{figure}\n\n\\subsection{Observers}\\label{subsec:peebles_henvisning}\nIn order to take cosmic variance into account\\footnote{The term ``cosmic variance\" is here used to mean the uncertainty in observations due to our ability to only observe the Universe from a single spacetime position.}, each set of mock observations are based on a group of observers instead of a single observer. The observer positions are still important for the study as the local environment may bias observations at low and intermediate redshifts. For instance, placing the observers in massive halos amounts to placing them in infall regions and will thus lead to a bias of peculiar source velocities, and hence redshifts, in the direction towards the observer which will again lead to a smaller $H_0$ estimate. This is predicted by gravitational instability theory \\cite[Chapter~5]{Peebles}, and can in principle be corrected for by subtracting the peculiar motion induced by the local density field when analyzing real observational data (see {\\em e.g.} \\cite{Neill}). Such a correction was for instance made in \\cite{Riess}.\n\\newline\\indent\nIn order to study the effects of the local environment of the observers, two different sets of observers are used. The first set consists of observers residing in subhalos of mass $10^{12}-10^{13} M_\\odot/h$ in a host halo in the mass range $5\\cdot 10^{14}-5\\cdot 10^{15} M_\\odot/h$. This approximately corresponds to our position in the Local Group galaxy cluster, a member of the Virgo Super Cluster. The second set of observers are placed at random positions throughout the simulation volume. As underdense regions take up the larger part of the volume, these observers will tend to be positioned in underdense regions.\n\\newline\\indent\nWhen observers are placed in halos, their peculiar velocities are taken to be those of the host halos. When they are placed at random positions, they are assumed to be at rest with respect to the background. The observer velocities enter into the computations of the observed redshift and so using these two different methods for estimating observer velocities may affect the results. This has been tested not to be the case though; setting the observer velocities to zero in the case where the observers are placed in halos is insignificant for the results.\n\n\n\\subsection{Lightcone snapshots} \\label{subsec:lightcone}\nThe velocity in equation (\\ref{eq:Doppler}) is the comoving velocity of the source at the time of emission. The mock observations are carried out in the halo catalog at $z=0$. However, comoving source positions change over time due to the sources' peculiar velocities (which also change over time). Since the study made here is based on low-redshift observations with $z\\lesssim 0.1$, this cosmic evolution should not affect the results at a significant level. To test this assessment, two types of halo catalogs are made. One is based on a regular GADGET-2 snapshot at $z = 0$, while the other type is based on lightcone snapshots\\footnote{The lightcone snapshots are created by using a plug-in to GADGET-2 written by Troels HaugbÃ¸lle. The same plug-in was used in \\cite{Io}.} (one for each observer). ROCKSTAR's lightcone functionality can be used for identifying structures in such a snapshot. In the resulting halo catalog, the positions and velocities are stored as they were at the time of emission.\n\n\n\\subsection{Summary}\\label{subsec:mock_observations}\nIn figure \\ref{fig:Illustration_of_observations}, an example of the observations performed by a single observer is shown. As seen, the observers view the full sky. See {\\em e.g.} \\cite{Io} for the effects of using smaller sky coverage.\n\n\\begin{figure}\n\\centering\n\\includegraphics{Illustration_of_observations}\n\\caption{Example of the observations carried out by one of the observers (indicated by the green star). The observed halos are colored red, and their total physical velocities relative to the observer are shown with red arrows. The division of redshift bins is illustrated with green circles -- only every 5th division is shown.}\n\\label{fig:Illustration_of_observations}\n\\end{figure}\n\nFollowing the various schemes discussed above, a number of different analyses have been performed. These are summarized in \ntable \\ref{tab:analyses}.\n\\newline\\indent\nSince the lightcone snapshots are very time consuming to use, only a single analysis is made with these. That analysis is denoted Dlc and is the analysis which best resembles real observations. \n\n  \n\\begin{center}\n\\begin{table}\n\\center \n\\begin{tabular}{clcccc}\n\\hline\\hline\n Figure & Analysis name & Observer positions & SN-distribution & Fit & Lightcone\\\\\n\\hline \n\n\n  & Dref & Subhalos         & Typical       & Full   & No\\\\\n\\ref{fig:Nbody_observations1} & Href & Subhalos         & Typical       & Linear & No\\\\\n\n&&&& \\\\\n  & Dlc  & Subhalos         & Typical       & Full   & Yes \\\\\n  & Dmw  & Subhalos         & Mass Weighted & Full   & No\\\\\n\\ref{fig:Nbody_observations2} & Drp  & Random Positions & Typical       & Full   & No\\\\\n  & Hrp  & Random Positions & Typical       & Linear & No\\\\\n  & Hmw  & Subhalos         & Mass Weighted & Linear & No\\\\ \n\\hline\n\\end{tabular}\\caption{Overview of analyses included in the study. The analysis names are given such that analyses with $H_0$ estimates based on Hubble's law (\"linear\" fit) start with an \"H\" while those with $H_0$ estimates based on computing $D_L$ using the Doppler convergence and fitting to the full $D_{L,\\Lambda\\text{CDM}}$ expression (\"full\" fit) start with a \"D\". The last part of the name denotes how each analysis deviates from the reference (\"ref\") analysis, respectively by using lightcone snapshots (\"lc\"), using  a mass weighted selection of SNe (\"mw\"), and placing the observers at random positions instead of in halos (\"rp\").}\n\\label{tab:analyses}\n\\end{table}\n\\end{center}\n\n\n\\FloatBarrier\n\n\\section{Results and discussion}\n\nFigures \\ref{fig:Nbody_observations1} and \\ref{fig:Nbody_observations2} show how the local estimates of $H_0$ are distributed among the observers in the different analyses. Specifically, the deviation in the local Hubble constant from the true value, $(H_{0,loc}-H_0)/H_0$, is shown as a function of the distance $r_{max}$ to the most distant bin included in the estimate of $H_{0,loc}$. The sources are distributed in bins according to their comoving distances from the observer, which are related to the redshifts of the FLRW background via $r = \\frac{c}{H_0}\\int_0^z \\frac{dz'}{\\sqrt{\\Omega_{m,0}(1+z')^3+\\Omega_{\\Lambda,0}}}$.\nThe mean value of the deviation is shown with a solid line, and the 68.3\\%, 95.4\\% and 99.7\\% confidence intervals are indicated with either shaded areas or dashed lines. \n\\newline\\newline\n\n\\begin{figure}[t]\n\\centering\n\n\\subfigure\n\t{\n\t\\includegraphics{Dref_VS_Href.pdf}\n\t}\n\n\\caption{Deviations between $H_0$ of the N-body background and the local values $H_{0,loc}$ of $H_0$ obtained using the analyses Dref and Href described in table \\ref{tab:analyses}. Shadings and dashed lines indicate 68.3\\%, 95.4\\% and 99.7\\% confidence intervals while solid lines indicate mean values. The results are shown as a function of the maximum distance $r_{\\max}$ between the observer and observed objects included in the $H_0$ estimates. The gray area indicates the observed value and uncertainty of $H_0$ found in \\cite{Riess}.} \n\\label{fig:Nbody_observations1}\n\\end{figure}\n\nThe results are shown using different combinations of choices for the observer positions, redshift distribution of supernovae, and fitting method. An overview of the different combinations that have been studied is given in table \\ref{tab:analyses} where a naming scheme for the analyses is also introduced. Analysis Dlc is the analysis which is closest to actual observations; it uses observers placed in subhalos with a typical supernova distribution in a lightcone snapshot and obtains $H_0$ by a fit to the FLRW redshift-distance relation as explained in section \\ref{sec:scheme}. In figure \\ref{fig:Nbody_observations2}, analysis Dlc is compared to analysis Dref which differs from Dlc only in that it is based on a regular GADGET-2 snapshot. As seen, the difference between using the two types of snapshots is negligible.\n\\newline\\indent\nFigure \\ref{fig:Nbody_observations1} compares analysis Dref to analysis Href. Analysis Href differs from analysis Dref in that $H_0$ has been obtained using Hubble's law. The comparison shows that the mean $H_0$ estimate is smaller when Hubble's law is used instead of the recipe based on the Doppler convergence as described in section \\ref{subsec:doppler}. The difference is quite small, ranging from 1.9\\% in the innermost bin to 0.3\\% in the outermost bin. A similar result is seen in figure \\ref{fig:Nbody_observations2}, {\\em i.e.} the analyses based on Hubble's law consistently yield a $H_0$ estimate that is slightly smaller than the estimate of the corresponding analysis based on the Doppler convergence computations described in section \\ref{subsec:doppler}.\n\\newline\\newline\n\n\\begin{figure}[t]\n\\centering\n\n\\subfigure\n\t{\n\t\\includegraphics{Dref_VS_Dlc.pdf}\n\t\\includegraphics{Dref_VS_Dmw.pdf}\n\t}\t\n\n\\subfigure\n\t{\n\t\\includegraphics{Drp_VS_Hrp.pdf}\n\t\\includegraphics{Dmw_VS_Hmw.pdf}\n\t}\n\\caption{Deviations between $H_0$ of the N-body background and the local values of $H_0$ obtained using the analyses listed in table \\ref{tab:analyses} as indicated in the figure legends. Shadings and dashed lines indicate 68.3\\%, 95.4\\% and 99.7\\% confidence intervals while solid lines indicate mean values. The results are shown as a function of the maximum distance $r_{max}$ between the observer and observed objects.\n}\n\\label{fig:Nbody_observations2}\n\\end{figure}\n\nFigure \\ref{fig:Nbody_observations2} illustrates the importance of using realistic source and observer distributions. In particular, the figure shows that by changing the observer positions to be random, the $H_0$ estimates grow. This is because underdense regions take up more of the simulation volume and hence will be favored when using random observer positions. The result can thus be considered a type of Hubble-bubble effect (see {\\em e.g.} \\cite{bubble1,bubble2, bubble4, bubble5, bubble6, bubble8, bubble9}). This type of Hubble-bubble result is particularly interesting since there in fact are some indications that we may be living in an underdense region of the Universe \\cite{local_structure1, local_structure2, local_structure3}.\n\\newline\\indent\nThe figure also shows that the distribution of sources has impact on especially the uncertainty of the $H_0$ estimates. Specifically, the spread in the results is much less when higher-redshift sources are favored in the observations. This is consistent with peculiar motions being less important at larger distances.\n\\newline\\newline\nLastly, it is noted that the results presented here yield mean $H_0$ estimates that are {\\em lower} than the $H_0$ value of the N-body background. The only exception to this result is the analyses with random observer positions discussed above. Within the standard cosmological scheme studied here, the effect of peculiar velocity fields thus seems to be to {\\em reduce} the local value of $H_0$ compared to the global value. Hence, inhomogeneities cannot provide a solution to the tension of different types of $H_0$ estimates. In fact, the results show that inhomogeneities will in principle increase the tension. As mentioned in section \\ref{subsec:peebles_henvisning}, to the extent that the shift in the mean estimate of $H_0$ compared to the global value is a result of the local environment at the observer position, this can be corrected for when interpreting real observations.\n\n\n\n\n\n\\FloatBarrier\n\n\n\\section{Summary}\nN-body simulations were used to study low-redshift determinations of $H_0$ in an inhomogeneous universe. In particular, it was studied whether or not an inhomogeneous velocity field leads to a local $H_0$ value different from the global value, the latter corresponding to that of the N-body background and which is what one expects to measure using high-redshift observations such as those based on the CMB. The $H_0$ values were obtained by approximating light paths according to the background model and computing the angular diameter distance of objects by using the Doppler convergence to take effects of inhomogeneities into account. Inhomogeneities were also taken into account when computing source redshifts. This procedure differs from that used in earlier work of this kind, where $H_0$ determinations have been estimated by using the linear relation known as Hubble's law. The results obtained with the method introduced here consistently lead to a mean $H_0$ value which is higher than that obtained by simply using Hubble's law. The difference is, however, very small.\n\\newline\\indent\nThe $H_0$ estimates were found to be slightly lower than the background value except in a single of the studied cases: When the observers are placed at random positions in the simulation box, the resulting mean $H_0$ estimate is slightly above that of the N-body background. This result is similar to the Hubble-bubble effect.\n\\newline\\indent\nAs source distances and numbers are increased, all the $H_0$ estimates converge towards the value of $H_0$ of the N-body background.\n\\newline\\newline\nThe results summarized above indicate that the tension between high- and low-redshift determinations of $H_0$ cannot be alleviated by taking inhomogeneities into account -- at least not without straying from standard cosmology.\n\n\n\n\\section{Acknowledgments}\nWe thank the anonymous referee for suggestions that have significantly improved the presentation of the work.\n\\newline\\indent\nParts of the numerical work for this project have been done using computer resources from the Center for Scientific Computing Aarhus.\n\n\n\n\n\\begin{thebibliography}{99}\n\n\n\\bibitem{Planck} Planck Collaboration: Planck 2013 results. I. Overview of products and scientific results, A\\&A 571, A1 (2014), arXiv:1303.5062v2 [astro-ph.CO]\n\n\\bibitem{Carnegie} Wendy L. Freedman et al.: Carnegie Hubble Program: A Mid-Infrared Calibration of the Hubble Constant, 2012, ApJ, 758, 24\n\\bibitem{Riess} Adam G. Riess {\\em et al.}: A 3\\% Solution: Determination of the Hubble Constant with the Hubble Space Telescope and Wide Field Camera 3, ApJ,730,119, 2011, arXiv:1103.2976v1 [astro-ph.CO]\n\n\n\\bibitem{Efstathiou} George Efstathiou: $H_0$ Revisited, MNRAS 440, 1138â\u0080\u00931152 (2014),  arXiv:1311.3461v2 [astro-ph.CO]\n\n\n\n\\bibitem{CMB_distance} Camille Bonvin, Chris Clarkson, Ruth Durrer, Roy Maartens, Obinna Umeh: Do we care about the distance to the CMB? Clarifying the impact of second-order lensing, arXiv:1503.07831v1\n\\bibitem{lensing_bias} Nick Kaiser, John A. Peacock: On the Bias of the Distance-Redshift Relation from Gravitational Lensing, arXiv:1503.08506 [astro-ph.CO]\n\\bibitem{MikkoSyksy_CMB} Mikko Lavinto, Syksy Rasanen: CMB seen through random Swiss Cheese, JCAP10(2015)057, arXiv:1507.06590v3 [astro-ph.CO] \n\n\\bibitem{Bolejko_CMB} Krzysztof Bolejko: The effect of inhomogeneities on the distance to the last scattering surface and the accuracy of the CMB analysis, JCAP 02(2011)025, arXiv:1101.3338v1 \n\\bibitem{Durrer_CMB} Chris Clarkson, Obinna Umeh, Roy Maartens, Ruth Durrer: What is the distance to the CMB?, JCAP 1411 (2014) 11, 036, arXiv:1405.7860v3 [astro-ph.CO]\n\n\n\n\n\n\n\n\\bibitem{umeh} Obinna Umeh, Chris Clarkson, Roy Maartens: Nonlinear relativistic corrections to cosmological distances, redshift and gravitational lensing magnification. I - Key results, Class. Quantum Grav. 31 202001, arXiv:1207.2109v3 [astro-ph.CO]\n\\bibitem{ido2} Ido Ben-Dayan, Giovanni Marozzi, Fabien Nugier, Gabriele Veneziano: The second-order luminosity-redshift relation in a generic inhomogeneous cosmology,  JCAP 1211 (2012) 045, arXiv:1209.4326v2 [astro-ph.CO]\n\\bibitem{ido3} I. Ben-Dayan, M. Gasperini, G. Marozzi, F. Nugier, G. Veneziano: Average and dispersion of the luminosity-redshift relation in the concordance model, 10.1088/1475-7516/2013/06/002, arXiv:1302.0740v3 [astro-ph.CO]\n\\bibitem{VT} Enea Di Dio, Ruth Durrer: Vector and Tensor Contributions to the Luminosity Distance, Phys. Rev. D 86, 023510 (2012), arXiv:1205.3366v3 [astro-ph.CO]\n\\bibitem{Bonvin} Camille Bonvin, Ruth Durrer, M. Alice Gasparini: Fluctuations of the luminosity distance, Phys.Rev.D73:023523,2006, arXiv:astro-ph/0511183v5\n\\bibitem{Clarkson} Chris Clarkson, Kishore Ananda, Julien Larena: The influence of structure formation on the cosmic expansion, Phys.Rev.D80:083525,2009, Phys.Rev.D80:083525,2009\n\n\n\n\\bibitem{H0_inhomo} Pierre Fleury, Helene Dupuy, Jean-Philippe Uzan: Can all cosmological observations be accurately interpreted with a unique geometry?, Phys. Rev. Lett. 111, 091302 (2013), arXiv:1304.7791v2 [astro-ph.CO]\n\\bibitem{velocity_point} Timothy Clifton, Joe Zuntz: Hubble Diagram Dispersion From Large-Scale Structure, Mon. Not. R. Astron. Soc. 400 (2009) 2185, arXiv:0902.0726v2 [astro-ph.CO]\n\n\\bibitem{tardis}Mikko Lavinto, Syksy Rasanen, Sebastian J. Szybka: Average expansion rate and light propagation in a cosmological Tardis spacetime, JCAP12(2013)051, arXiv:1308.6731v2 [astro-ph.CO]\n\\bibitem{light_cone} Valerio Marra, Edward W. Kolb, Sabino Matarrese: Light-cone averages in a swiss-cheese universe, Phys.Rev.D77:023003,2008, arXiv:0710.5505v2 [astro-ph]\n\\bibitem{marra} Valerio Marra, Edward W. Kolb, Sabino Matarrese, Antonio Riotto: On cosmological observables in a swiss-cheese universe, Phys.Rev.D76:123004, 2007, arXiv:0708.3622v3 [astro-ph]\n\\bibitem{bolejko_cmb} Krzysztof Bolejko: The Szekeres Swiss Cheese model and the CMB observations, Gen.Rel.Grav.41:1737-1755, 2009, arXiv:0804.1846v2 [astro-ph]\n\\bibitem{Szybka} Sebastian J. Szybka: On light propagation in Swiss-Cheese cosmologies, Phys.Rev.D84:044011, 2011, arXiv:1012.5239v2 [astro-ph.CO]\n\\bibitem{lensing_effects} Sima Ghassemi, Salomeh Khoeini Moghaddam, Reza Mansouri: Lensing effects in inhomogeneous cosmological models, Phys.Rev.D79:102002, 2009, arXiv:0901.0340v1 [astro-ph.CO]\n\\bibitem{dallas_cheese} Austin Peel, M. A. Troxel, Mustapha Ishak: Effect of inhomogeneities on high precision measurements of cosmological distances, Phys. Rev. D 90, 123536 (2014), arXiv:1408.4390v2 [astro-ph.CO]\n\\bibitem{Kottler_cheese} Pierre Fleury, HÃ©lÃ¨ne Dupuy, Jean-Philippe Uzan: Interpretation of the Hubble diagram in a nonhomogeneous universe, Physical Review D 87, 123526 (2013), arXiv:1302.5308v2 [astro-ph.CO]\n\\bibitem{onion} Nikolai Meures, Marco Bruni: Redshift and distances in a $\\Lambda$CDM cosmology with non-linear inhomogeneities, 2012, MNRAS 419, 3, 1937, arXiv:1107.4433v2 [astro-ph.CO]\n\n\n\n\n\\bibitem{lightprop_Syksy} Syksy Rasanen: Light propagation in statistically homogeneous and isotropic universes with general matter content, JCAP 1003:018,2010, arXiv:0912.3370v2 [astro-ph.CO]\n\\bibitem{lightprop_Syksy2} Syksy Rasanen: Light propagation in statistically homogeneous and isotropic dust universes, JCAP 0902:011,2009, \n\n\n\\bibitem{Durrer_H0} Ido Ben-Dayan, Ruth Durrer, Giovanni Marozzi, Dominik J. Schwarz: The value of $H_0$ in the inhomogeneous Universe,  Phys. Rev. Lett. 112, 221301 (2014) , arXiv:1401.7973v3 [astro-ph.CO]\n\n\n\\bibitem{Wojtak:2013} R.~Wojtak, A.~Knebe, W.~A.~Watson, I.~T.~Iliev, S.~HeÃ\u009f, D.~Rapetti, G.~Yepes and S.~GottlÃ¶ber: Cosmic variance of the local Hubble flow in large-scale cosmological simulations, Mon.\\ Not.\\ Roy.\\ Astron.\\ Soc.\\  {\\bf 438} (2014) 2,  1805, arXiv:1312.0276v2 [astro-ph.CO]\n\\bibitem{Turner} Xiangdong Shi, Michael S. Turner: Expectations for the Difference Between Local and Global Measurements of the Hubble Constant, Astrophys.J. 493 (1998) 519, arXiv:astro-ph/9707101v2 \n\\bibitem{Io} Io Odderskov, Steen Hannestad, Troels HaugbÃ¸lle: On the local variation of the Hubble constant, JCAP10(2014)028, arXiv:1407.7364v2 [astro-ph.CO]\n\n\n\\bibitem{recipe} Stephen R. Green and Robert M. Wald: Newtonian and Relativistic Cosmologies,  Phys.Rev.D85:063512, (2012)\n\\bibitem{Sofie} S. M. Koksbang, S. Hannestad: Methods for studying the accuracy of light propagation in N-body simulations, Phys. Rev. D 91, 043508 (2015), arXiv:1501.01413v2 [astro-ph.CO]\n\\bibitem{Sofie2} S. M. Koksbang, S. Hannestad: Studying the precision of ray tracing techniques with Szekeres models, arXiv:1506.09127v1 [astro-ph.CO]\n\\newline\nSee also S. M. Koksbang, S. Hannestad: Erratum: Studying the precision of ray tracing techniques with Szekeres models [Phys. Rev. D 92, 023532 (2015)], Phys. Rev. D 92, 069904 (2015)\n\n\n\n\\bibitem{bright_side} Krzysztof Bolejko, Chris Clarkson, Roy Maartens, David Bacon, Nikolai Meures, Emma Beynon: Anti-lensing: the bright side of voids, Phys. Rev. Lett. 110, 021302 (2013), arXiv:1209.3142v3 [astro-ph.CO]\n\\bibitem{bright_side2} David J. Bacon, Sambatra Andrianomena, Chris Clarkson, Krzysztof Bolejko, Roy Maartens: Cosmology with Doppler Lensing,  MNRAS 443 (2014) 1900-1915 , arXiv:1401.3694v2 [astro-ph.CO]\n\n\n\n\\bibitem{Bonvin_doppler} Camille Bonvin: Effect of Peculiar Motion in Weak Lensing, Phys.Rev.D78:123530, 2008,arXiv:0810.0180v3 [astro-ph]\n\\bibitem{xtra_doppler} Lam Hui, Patrick B. Greene: Correlated Fluctuations in Luminosity Distance and the (Surprising) Importance of Peculiar Motion in Supernova Surveys, Phys.\\ Rev.\\ D {\\bf 73} (2006) 123526, [astro-ph/0512159].\n\n\n\n\n\n\n\\bibitem{Kaiser} N.~Kaiser and M.~J.~Hudson: Kinematic Bias in Cosmological Distance Measurement, Mon.\\ Not.\\ Roy.\\ Astron.\\ Soc.\\  {\\bf 454} (2015) 1,  280  [arXiv:1502.01762 [astro-ph.CO]].\n\n\n\n\\bibitem{Springel:2005} V.~Springel: The Cosmological simulation code GADGET-2, Mon.\\ Not.\\ Roy.\\ Astron.\\ Soc.\\  {\\bf 364} (2005) 1105 [astro-ph/0505010].\n\\bibitem{Brandbyge} J. Brandbyge: Quantitative Cosmology - Massive Neutrinoes in non-linear Structure Formation, PhD. thesis, Aarhus University, Denmark, 2010\n\\bibitem{camb} A.~Lewis and S.~Bridle: Cosmological parameters from CMB and other data: A Monte Carlo approach, Phys.\\ Rev.\\ D {\\bf 66} (2002) 103511, [astro-ph/0205436]\n\\bibitem{Behroozi:2011} Behroozi, P.~S., Wechsler, R.~H., Wu, H.-Y.: The ROCKSTAR Phase-space Temporal Halo Finder and the Velocity Offsets of Cluster Cores, [arxiv:1110.4372]\n\n\n\\bibitem{Hicken:2009} M. Hicken, P. Challis, S. Jha, R. P. Kirsher, T. Matheson et al: CfA3: 185 Type Ia Supernova Light Curves from the CfA,\nAstrophys. \\ J.\\ {\\bf 700} (2009), arXiv:astro-ph/0901.4787 \n\\bibitem{Jha:2007} S.~Jha, A.~G.~Riess and R.~P.~Kirshner: Improved Distances to Type Ia Supernovae with Multicolor Light Curve Shapes: MLCS2k2,\nAstrophys.\\ J.\\  {\\bf 659} (2007) 122, [astro-ph/0612666]\n\n\n\n\\bibitem{Peebles} Phillip James Edwin Peebles: Principles of Physical Cosmology,  Princeton University Press (1993)\n\\bibitem{Neill} SNLS collaboration, James D. Neill, Michael J. Hudson, and Alex Conley: The Peculiar Velocities of Local Type Ia Supernovae and their Impact on Cosmology, Astrophys.\\ J.\\  {\\bf 661} (2007) L123, [arxiv:0704.1654]\n\n\n\n\\bibitem{bubble1} Valerio Marra, Luca Amendola, Ignacy Sawicki, Wessel Valkenburg: Cosmic variance and the measurement of the local Hubble parameter, Phys. Rev. Lett. 110, 241305 (2013), arXiv:1303.3121v4\n\\bibitem{bubble2} Y. Suto, T. Suginohara, Y. Inagaki: Limits on the global Hubble constant and the age of the universe,  Prog.Theor.Phys. 93 (1995) 839-844, arXiv:astro-ph/9412090v1\n\n\\bibitem{bubble4} Idit Zehavi, Adam G. Riess, Robert P. Kirshner, Avishai Dekel: A Local Hubble Bubble from Type Ia Supernovae?, Astrophys.J. 503 (1998) 483, arXiv:astro-ph/9802252v2\n\n\\bibitem{bubble5} R. Giovanelli, Daniel Dale, Martha Haynes, Eduardo Hardy, Luis Campusano: No Hubble Bubble in the Local Universe, ApJ 525 25 (1999), arXiv:astro-ph/9906362v1 \n\n\\bibitem{bubble6} Xiangdong Shi, Lawrence M. Widrow, L. Jonathan Dursi: Measuring Hubble's Constant in our Inhomogeneous Universe, arXiv:astro-ph/9506120v1\n\\bibitem{bubble8} Kiyotomo Ichiki, Chul-Moon Yoo, Masamune Oguri: Relationship between the CMB, SZ Cluster Counts, and Local Hubble Parameter Measurements in a Simple Void Model, arXiv:1509.04342v2 [astro-ph.CO]\n\\bibitem{bubble9} Saurabh Jha, Adam G. Riess, Robert P. Kirshner: Improved Distances to Type Ia Supernovae with Multicolor Light Curve Shapes: MLCS2k2, Astrophys.J.659:122-148,2007, arXiv:astro-ph/0612666v1\n\n\n\n\\bibitem{local_structure1} R. C. Keenan, A. J. Barger and L. L. Cowie: Evidence for a $\\sim$  300 megaparsec scale under-density in the local galaxy distribution, 2013, ApJ, 775, 62\n\\bibitem{local_structure2} R. C. Keenan, A. J. Barger, L. L. Cowie, W.-H. Wang, I. Wold, and L. Trouille: Testing for a large local void by investigating the near-infrared galaxy luminosity function, 2012, ApJ, 754, 131\n\\bibitem{local_structure3} R. C. Keenan, L. Trouille, A. J. Barger, L. L. Cowie, and W.-H. Wang: An extremely deep, wide-field near-infrared survey: bright galaxy counts and local large scale structure, 2010, ApJS, 186, 94\n\n\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 11350, "prevtext": "\nwhere $\\eta$ denotes conformal time and $u_i$ is the (spatial) velocity of the source. The Einstein convention is used with $i$ running over the spatial indices $1,2,3$. The vector $n^{\\mu}$ is the propagation direction unit $4$-vector, {\\em i.e.} $n^{\\mu} \\propto k^{\\mu}+\\frac{k^{\\nu}u_{\\nu}}{c^2}u^{\\mu}$. It is sufficient to use the background version of $n^{\\mu}$ and in that case $n^{i}$ is the unit vector pointing in the direction from the source to the observer. \n\\newline\\indent\nIn the expression for the Doppler convergence given above, a term due to the peculiar motion of the observer has been omitted. This is justified by noting that the observer velocity can be estimated by measuring the CMB dipole and hence has no consequences when interpreting real observations. Note also that in equation (\\ref{eq:Doppler}), the scale factor etc. are evaluated at the spacetime position corresponding to the {\\em observed} redshift $z_{\\text{obs}}$, not a background redshift computed with the background metric. \n\\newline\\indent\nWhen mock redshift-distance data points have been obtained as described above, they are fitted to the expression for the luminosity distance in an FLRW universe,\n\n", "index": 3, "text": "\\begin{align}\\label{eq:dLz}\nD_L(z) &= \\frac{(1+z)c}{H_0}\\int_0^z \\frac{dz'}{\\sqrt{\\Omega_{m,0}(1+z')^3+\\Omega_{\\Lambda,0}}}.\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle D_{L}(z)\" display=\"inline\"><mrow><msub><mi>D</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=\\frac{(1+z)c}{H_{0}}\\int_{0}^{z}\\frac{dz^{\\prime}}{\\sqrt{\\Omega_%&#10;{m,0}(1+z^{\\prime})^{3}+\\Omega_{\\Lambda,0}}}.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>c</mi></mrow><msub><mi>H</mi><mn>0</mn></msub></mfrac></mstyle><mo>⁢</mo><mrow><mstyle displaystyle=\"true\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>z</mi></msubsup></mstyle><mstyle displaystyle=\"true\"><mfrac><mrow><mi>d</mi><mo>⁢</mo><msup><mi>z</mi><mo>′</mo></msup></mrow><msqrt><mrow><mrow><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi>m</mi><mo>,</mo><mn>0</mn></mrow></msub><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msup><mi>z</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mrow><mo>+</mo><msub><mi mathvariant=\"normal\">Ω</mi><mrow><mi mathvariant=\"normal\">Λ</mi><mo>,</mo><mn>0</mn></mrow></msub></mrow></msqrt></mfrac></mstyle></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]