[{"file": "1601.04058.tex", "nexttext": "\n  where the local fields $h_i$ are drawn from a box distribution of width $2h$, and $h$ signifies\n  the disorder strength.\n\n  This model has been studied intensively in the context of many body localization, a dynamical\n  quantum phase transition occurring in high energy eigenstates at a critical disorder strength\n  $h_c$, which has been shown to depend on the energy density (with respect to the bandwidth)\n  $\\epsilon=(E-E_\\text{min})/(E_\\text{max}-E_\\text{min})$ of the eigenstate\n  \\cite{pal_many-body_2010,vosk_theory_2014,mondragon-shem_many-body_2015,luca_ergodicity_2013,luitz_many-body_2015} (with the eigenenergy\n  $E$, groundstate energy $E_\\text{min}$ and antigroundstate energy $E_\\text{max}$ of the sample).\n\n  The transition manifests itself in the most striking difference of eigenstates in the two phases,\n  thermalizing in the extended phase and breaking ETH in the localized phase. Here, we will study\n  the validity of the ETH in the extended phase in detail, focussing on the scaling of deviations\n  from ETH and the probability distributions of local operators at fixed energy.\n\n  As explained in a previous work\\cite{luitz_many-body_2015}, we calculate eigenstates corresponding\n  to eigenenergies closest to a target energy density $\\sigma$ for a large number of disorder\n  configurations and different disorder strengths as well as system sizes using a parallelized\n  version of the shift invert technique. Typically, we calculate the $\\gtrsim 50$ eigenpairs, whose\n  energy density $\\epsilon$  is closest to the target energy density $\\sigma$. We will restrict most\n  of the discussion in this work to the center of the band ($\\epsilon=0.5$) unless stated\n  differently. Our results are based on at least $10^3$ disorder realizations per system size and\n  value of the disorder strength, except for $L=22$, where we could only afford to perfom\n  calculations for $\\gtrsim 100$ realizations.\n\n  For the study of the ETH, it is crucial to compare eigenstate expectation values of the same\n  operator in two eigenstates whose corresponding eigenenergies are closest to each other. We shall\n  therefore call eigenstates with neighboring eigenenergies \\emph{adjacent eigenstates}.\n\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{local_mag.pdf}\n\\caption{Disorder averaged difference of local magnetizations as a function of disorder strength in\nthe middle (left) and upper part (right) of the spectrum. For weak disorder, eigenstates thermalize\nand the local magnetization of adjacent states becomes identical in the thermodynamic limit, thus\nyielding a smooth function of energy. Here, the mobility edge for the many body localization\ntransition is also visible as the region, in which adjacent states yield very different results --\nthe MBL phase -- is much larger in the upper part of the spectrum at energy density $\\epsilon =\n0.8$.}\n    \\label{fig:localmag}\n\\end{figure}\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{diff_scaling.pdf}\n    \\caption{Finite size scaling of the disorder averaged difference of local magnetizations\n        ${\\langle\\,{n}\\,|} S_z^i {|{n}\\rangle}$ of adjacent eigenstates as a function of the dimension of the\n        Hilbert space $\\text{dim}(\\mathcal{H})$. The inset displays the (discrete) logarithmic\n    derivative, yielding the exponent of the power law in the thermodynamic limit, which slowly\n    approaches $0.5$. The data presented here includes only states from the middle of the spectrum ($\\epsilon=0.5$).} \n    \\label{fig:diff_scaling}\n\\end{figure}\n\\section{Local magnetization}\n\nLet us consider the simplest local operator to check the validity of the ETH: the local\nmagnetization $\\hat{S}_i^z$ on site $i$ of the system. The qualitative behavior of this quantity as\na function of energy at intermediate disorder strength ($h=1.0$) is already clear from Fig.\n\\ref{fig:obsvsenergy}, where we show single eigenstate expectation values of $S_5^z$ at their\ncorresponding energy density $\\epsilon$ for different system sizes. Note that the disorder\nconfiguration of smaller system sizes is obtained as a subset of the larger sizes for comparability.\nIn the middle of the spectrum, the data corresponds to $\\gtrsim 50$ eigenstates obtained by a\nshift-invert technique, while for the largest system size $L=24$, we use a deflation technique for\n$\\lesssim2000$ states at the extreme ends of the spectrum, which successfully works down to\n$\\epsilon=0.85$. \n\nIn Fig. \\ref{fig:obsvsenergy} the variance of ${\\langle\\,{n}\\,|}{\\hat{S}_i^z}{|{n}\\rangle}$ for eigenstates\n${|{n}\\rangle}$ at virtually the same energy decreases with system size for a wide range of the spectrum. It should be\nnoted that the energy window in which the $\\gtrsim 50$ eigenstates closest to the target energy lie\ndecreases with system size, clearly visible by inspecting for example the $L=12$ and $L=16$ data.\nHowever, comparing data for adjacent targets suggests that the decreasing variance of the local\nmagnetization is not an artefact of the decreasing energy window size but rather a generic feature,\nleading to a well defined scaling of the variances in Fig. \\ref{fig:diff_scaling}.\n\nAt very high energy density, this is no longer true and the variance of this local observable over different\neigenstates remains very large, thus breaking ETH. This is fully consistent with the many body\nmobility edge mapped in Ref. \\onlinecite{luitz_many-body_2015}. Nevertheless, one should remain cautious\nwith this observation as for the present disorder strength $h=1.0$ the mobility edge lies close to\nthe boundary of the spectrum where finite size effects are expected to be large. Similarly, one\nexpects a mobility edge at the low end of the spectrum, which is even more difficult to resolve due\nto stronger finite size effects, nevertheless the variance of ${\\langle\\,{n}\\,|}\\hat{S}_5^z{|{n}\\rangle}$ does not\nseem to decrease between the two largest system sizes around $\\epsilon\\approx0.1$.\n\nIn order to study the decreasing variance of the local magnetization more rigorously, we calculate\nthe disorder average of the difference of $\\hat{S}_i^z$ between an eigenstate ${|{n}\\rangle}$ and the\nadjacent eigenstate ${|{n+1}\\rangle}$. This quantity is a measure for the variance of\nthe distribution of eigenstate expectation values of $\\hat{S}_i^z$ over eigenstates within the\nmicrocanonical energy window around the target energy and over disorder realizations. It is obvious\nthat the difference of local operators in adjacent eigenstates has to vanish if the quantity is to\nbecome a smooth function of energy in the thermodynamic limit. In Fig. \\ref{fig:localmag}, we show\nthe disorder averaged difference of local magnetizations of adjacent eigenstates as a function of\ndisorder strength for different system sizes. The signature of ETH is very clear as at weak disorder\nstrength these differences scale to zero with increasing system size, whereas the breakdown of ETH\nin the MBL phase is signalled by a constant average difference for all system sizes. The position of\nthe critical point that can be estimated from the point at which the ETH is no longer valid depends\non the energy density and is fully consistent with a mobility edge\\cite{luitz_many-body_2015,bera_many-body_2015,mondragon-shem_many-body_2015}.\n\nPreviously, it has been established that the variance of eigenstate to eigenstate fluctuations\nof local operators in generic ETH systems decreases exponentially with system size as the square\nroot\\cite{ikeda_eigenstate_2011,beugeling_finite-size_2014} of the dimension of the Hilbert space\n$\\text{dim}(\\mathcal{H})$. We verify this exponential law in Fig. \\ref{fig:diff_scaling} by plotting\nthe average difference of adjacent eigenstate magnetizations $|\\Delta_m| = | {\\langle\\,{n}\\,|} S_i^z {|{n}\\rangle} -\n{\\langle\\,{n+1}\\,|} S_i^z {|{n+1}\\rangle}|$ as a function of the dimension of the Hilbert space\n$\\text{dim}(\\mathcal{H})$ on a log-log scale. Our results are approximately linear and the\ncorresponding exponent can be estimated by the (discrete) logarithmic derivative shown in the inset.\nWe find exponents which are close to $-\\frac 1 2$ for the largest system sizes, in agreement with the\nexpectation of the square root behavior. The quality of the result is unfortunately not sufficient\nto back speculations if the deviations from an exponent of $-\\frac 1 2$ are mere finite size effects\nor may have a deeper origin in the tails of the distributions to be discussed in Sec.\n\\ref{sec:rare}.\n\n\\section{Generic few body operators}\n\n  We have focussed on a specific local operator in the previous section: the local magnetization.\n  This immediately leads to the question, whether different operators will also lead to a smooth\n  function of energy and what condition these operators have to fulfill. In particular, we would\n  like to investigate how ``local'' operators really have to be in order to fulfill ETH.\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{generic_ops_vs_ell.pdf}\n    \\caption{Disorder averaged Frobenius norm of the difference of reduced density matrices of a\n    subsystem of size $\\ell$ as a function of subsystem size.}\n    \\label{fig:generic}\n\\end{figure}\n  All possible operators of a given support $\\ell$ in two adjacent eigenstates ${|{n}\\rangle}$ and\n  ${|{n+1}\\rangle}$ may be compared most efficiently by comparing the reduced density\n  matrices\\cite{alba_eigenstate_2015,garrison_does_2015}\n  \n", "itemtype": "equation", "pos": 8568, "prevtext": "\n\\title{Long tail distributions near the many body localization transition} \n\\author{David J. Luitz}\n\\affiliation{Institute for Condensed Matter Theory and Department of Physics, University of Illinois at Urbana-Champaign, Urbana, IL 61801, USA}\n\\affiliation{Laboratoire de Physique Th\\'eorique, Universit\\'e de Toulouse, CNRS, UPS, France } \n\\email{dluitz@illinois.edu}\n\\date{\\today}\n\n\\begin{abstract} \n\n    The random field $S=\\frac 1 2$ Heisenberg chain exhibits a dynamical many body localization\n    transition at a critical disorder strength, which depends on the energy density. At weak\n    disorder, the eigenstate thermalization hypothesis (ETH) is fulfilled on average, making local\n    observables smooth functions of energy, whose eigenstate-to-eigenstate fluctuations decrease\n    exponentially with system size.\n\n    We demonstrate the validity of ETH in the thermal phase as well as its breakdown in the\n    localized phase and show that rare states exist which do not strictly follow ETH, \n    becoming more frequent closer to the transition. \n    Similarly, the probability distribution of the entanglement entropy at\n    intermediate disorder develops long tails all the way down to zero entanglement. We propose that\n    these low entanglement tails stem from localized regions at the subsystem boundaries which were\n    recently discussed as a possible mechanism for subdiffusive transport in the ergodic phase.\n\\end{abstract} \\pacs{75.10.Pq,03.65.Ud,71.30.+h}\n\n\\maketitle\n\n\n\\section{Introduction}\n\n\nThe eigenstate thermalization hypothesis\n(ETH)\\cite{deutsch_quantum_1991,srednicki_chaos_1994,dalessio_quantum_2015} is a mechanism for the\nthermalization of closed quantum systems that has been numerically verified in generic systems\n\\cite{rigol_thermalization_2008,beugeling_finite-size_2014,steinigeweg_eigenstate_2013} and is also\nargued to be valid for typical states of integrable systems, where the approach to the thermodynamic\nlimit is dramatically slower\\cite{alba_eigenstate_2015}.  If it is fulfilled, it ensures that the\ninfinite time limit of local observables of any initial state will be equal to the canonical\nexpectation value at a temperature that is fixed by the energy of the initial state, implying that\neigenstates whose energies are close to each other have very similar properties and local operators\nyield identical results in the thermodynamic limit. Consequently, for very large systems, local\nobservables vary smoothly with energy and microcanonical averages are well defined, corresponding to\nthe canonical expectation values. In systems of finite size, local observables from eigenstates in a\nmicrocanonical energy window are distributed according to a normal distribution with a variance that\ndecreases as the square root of the dimension of the Hilbert\nspace\\cite{ikeda_eigenstate_2011,rigol_alternatives_2012,beugeling_finite-size_2014,ikeda_how_2015},\ndue to the exponentially growing density of states with system size.\n\n\\begin{figure}[t]\n    \\centering\n    \\includegraphics{observable_vs_energy}\n    \\vspace{-0.8cm}\n    \\caption{Local magnetization for site 5 in the chain as a function of energy. Here, we have\n        generated one disorder configuration at $h=1.0$ for the largest system size $L_\\text{max} =\n        24$, smaller systems are cut out of this configuration for comparable results. The spread of the\n    results in the middle of the spectrum reduces significantly with system size, thus leading to a\n    \\emph{smooth function of energy} in the thermodynamic limit. Clearly, at the high end of the\nspectrum, this is no longer true and the variance of the local magnetization does not reduce with\nsystem size. This is a signal for \\emph{many body localization}, which is expected at $\\epsilon\n\\gtrsim 0.9$ at $h=1$ in accord with Ref. \\onlinecite{luitz_many-body_2015} and thus shows the\n\\emph{many body mobility edge}}\n    \\label{fig:obsvsenergy}\n\\end{figure}\n\n\nThis behavior is in stark contrast with many body localized (MBL) systems, where ETH breaks down and\neigenstate expectation values of local operators in a very small energy window have a large \n(not decreasing with system size) variance. \nAs a result, MBL systems do not thermalize and cannot act as their own heat\nbath, which is the case if ETH is true. This can be seen in the area law behavior of the\nentanglement entropy of eigenstates at arbitrary energy, which does not match the thermodynamic\nvolume law scaling that is necessary for ETH eigenstates.\n\nSystems with a many body localization (MBL) transition from a thermal to a localized phase therefore\nradically change their behavior at the critical point, where the validity of ETH breaks down,\nleading to the characteristic behavior of eigenstates in the ETH (MBL) phase, which have volume\n(area) law\nentanglement\\cite{bauer_area_2013,kjall_many-body_2014,grover_certain_2014,luitz_many-body_2015,bar_lev_absence_2015,vosk_theory_2015,chen_many-body_2015},\na vanishing (constant) variance of adjacent eigenstate expectation values of local operators with\nsystem size\\cite{pal_many-body_2010} and Wigner-Dyson (Poisson) level spacing\nstatistics\\cite{georgeot_integrability_1998,pal_many-body_2010,luitz_many-body_2015}. Even more\ninterestingly, the position of the critical point depends on energy, forming a mobility edge\n\\cite{mondragon-shem_many-body_2015,luitz_many-body_2015,bera_many-body_2015,laumann_many-body_2014,serbyn_criterion_2015},\nbelow which eigenstates are localized, while states at higher energy still fulfill the ETH.\n\nThe above discussion suggests that the ETH phase is in fact homogeneous up to the critical point and\ncan be perfectly described by random matrix ensembles\\footnote{Except for the region very close to\nthe clean limit at $h=0$, where the system becomes integrable.}. Recent studies found, however, that\nthis can not be entirely true, as transport seems to be\nsubdiffusive\\cite{bar_lev_absence_2015,vosk_theory_2014,agarwal_anomalous_2014,lerose_coexistence_2015,luitz_extended_2015,lerose_coexistence_2015}\nin a large region of the ETH phase, with transport exponents that vary continuously with disorder\nstrength. In fact, renormalization group studies\\cite{vosk_theory_2015,potter_universal_2015}\ndemonstrate that the anomalous transport is created by rare insulating regions which act as\nbottlenecks for the transport and lead to Griffiths\nphysics\\cite{griffiths_nonanalytic_1969,vojta_quantum_2010}. It is argued, however, that the\nsubdiffusive region is still thermalizing.\n\nWhile a large part of the present numerical work on MBL has been devoted to single eigenstate\nproperties, the signature of subdiffusion is most obvious in the dynamical properties, for instance\nthe time evolution of observables after a quench. Furthermore, the observation of the growth of\nthe entanglement entropy with time, when starting from a product state shows the intriguing property\nof a logarithmic\ngrowth\\cite{chiara_entanglement_2006,znidaric_many-body_2008,bardarson_unbounded_2012,luitz_extended_2015}\nin the MBL phase, being now clearly understood in terms of the effective l-bit\nHamiltonian\\cite{serbyn_local_2013,huse_phenomenology_2014,imbrie_many-body_2014,nandkishore_many-body_2015}\nthrough exponentially decaying interaction terms with distance. In the ETH phase, one observes a\npower law growth of the entanglement entropy with time, where the exponent varies continuously with\ndisorder strength\\cite{luitz_extended_2015,vosk_theory_2015,potter_universal_2015}, in agreement\nwith the picture of transport bottlenecks.\n\nThis article presents a detailed analysis of the domain of validity of the ETH and the probability\ndistributions of the entanglement entropy as well as of eigenstate fluctuations of the local\nmagnetization. Our data is consistent the picture of the Griffiths phase at weak disorder, leading to\nsubdiffusive transport and slow entanglement dynamics, while ETH is still valid on average. We find\nthat the probability distributions of eigenstate-to-eigenstate fluctuations of local observables\nshow pronounced tails, deviating strongly from the normal distribution, at intermediate disorder\nstrength. At the same time, the probability distribution of the entanglement entropy shows low entanglement tails\nthat we argue to be connected to bottlenecks of transport, which can be observed in the spatial\nentanglement structure.\n\n\\section{Model and Method}\n\n  In this work, we focus on the zero magnetization sector of the periodic quantum Heisenberg chain\n  subject to a random magnetic field, given by the Hamiltonian\n  \n", "index": 1, "text": "\\begin{equation}\n      H=\\sum_{i} {\\boldsymbol{{S}}}_i \\cdot {\\boldsymbol{{S}}}_{i+1} + h_i S_i^z, \\quad h_{i} \\in [-h,h],\n      \\label{eq:hamiltonian}\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H=\\sum_{i}{\\boldsymbol{{S}}}_{i}\\cdot{\\boldsymbol{{S}}}_{i+1}+h_{i}S_{i}^{z},%&#10;\\quad h_{i}\\in[-h,h],\" display=\"block\"><mrow><mrow><mrow><mi>H</mi><mo>=</mo><mrow><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi></munder><mrow><msub><mi>𝑺</mi><mi>i</mi></msub><mo>⋅</mo><msub><mi>𝑺</mi><mrow><mi>i</mi><mo>+</mo><mn>1</mn></mrow></msub></mrow></mrow><mo>+</mo><mrow><msub><mi>h</mi><mi>i</mi></msub><mo>⁢</mo><msubsup><mi>S</mi><mi>i</mi><mi>z</mi></msubsup></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msub><mi>h</mi><mi>i</mi></msub><mo>∈</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mi>h</mi></mrow><mo>,</mo><mi>h</mi><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.04058.tex", "nexttext": "\n  where degrees of freedom corresponding to the \\emph{complement} of the subsystem $A_\\ell$ are\n  traced out. The expectation values in state ${|{n}\\rangle}$ of all operators involving only degrees of\n  freedom on $A_\\ell$ are fully determined by $\\rho_\\ell^n$ and therefore if ETH requires them to\n  become a smooth function of energy, the corresponding reduced density matrices of adjacent\n  eigenstates have to become \\emph{equal} in the thermodynamic limit at least for ``small''\n  subsystem sizes. In Fig. \\ref{fig:generic}, we show the Frobenius norm $\\| \\rho_\\ell^n -\n  \\rho_\\ell^{n+1} \\|_F = \\sqrt{ {\\mathrm{Tr}}\\left[( \\rho_\\ell^n - \\rho_\\ell^{n+1})^\\dagger ( \\rho_\\ell^n -\n  \\rho_\\ell^{n+1})\\right]}$ of the difference of the reduced density matrices of adjacent eigenstates from\n  the center of the spectrum ($\\epsilon=0.5$), with the \\emph{same} subsystem of size $\\ell$ as a\n  function of $\\ell$ (up to $\\ell=L/2$) and observe that the reduced density\n  matrices become indeed \\emph{equal} in the thermodynamic limit for astonishingly large subsystem\n  sizes at weak disorder. This is quantitatively verified in Fig. \\ref{fig:generic_scaling}, where\n  we show the average reduced density matrix difference norm $\\| \\rho_\\ell^n - \\rho_\\ell^{n+1} \\|_F$ as a\n  function of the dimension of the Hilbert space for different disorder strengths and $\\ell=2$\n  (left) together with $\\ell=6$ (right). As for the fluctuations of the local magnetization, the\n  difference norm scales to zero as a power law with an exponent close to $-\\frac 1 2$ (the inverse\n  square root law is indicated by the slope of the black line).\n  For intermediate disorder strengths the absolute value of the difference norm is\n  larger but still decreases with system size, in agreement with the expectation that closer to the\n  critical point systems with a fixed size $L$ suffer from larger finite size effects due to a\n  larger correlation length. \n\n  \\begin{figure}[h]\n      \\centering\n      \\includegraphics{generic_ops_scaling.pdf}\n      \\caption{Disorder averaged norm of the difference of the reduced density matrices for adjacent\n      eigenstates as a function of the dimension of the Hilbert space for two different subsystem\n  sizes $\\ell$ and different disorder strengths. The difference of the reduced density matrices\n  decays as a power law in the dimension of the Hilbert space in the same way as the difference of\n  local magnetizations in Fig. \\ref{fig:diff_scaling}. The black line corresponds to\n  $~\\text{dim}(\\mathcal{H})^{-\\frac 1 2}$ for comparison and the exponent $-0.5$ is in good\n  agreement with the results at weak disorder. In the MBL phase, the difference norm is constant\n  with system size as expected.}\n      \\label{fig:generic_scaling}\n  \\end{figure}\n\n  We conclude that expectation values of operators with a support smaller than half of the system\n  size may lead to smooth functions of energy in the ETH phase. Close to a subsystem size of\n  $\\ell=L/2$, we observe an increase of the difference norm with subsystem size, however we find the\n  difference norm to be still smaller than the $L/2$ difference norm of the previous size.\n\n\n\\section{Probability distributions}\n\\label{sec:rare}\n\nUp to here, we have focussed on the behavior of disorder averages and concluded that in the ergodic\nphase of the random field Heisenberg chain ETH is valid \\emph{on average}. Let us now consider the\napproach to the thermodynamic limit in more detail and discuss the full probability distributions\nof the local magnetization difference $\\Delta_{n,n+1} S_i^z$ of adjacent eigenstates as well as the\nentanglement entropy, showing that rare states exist which do not obey ETH in the sense that their\nfluctuations of local operators deviate from the normal\ndistribution\\cite{beugeling_finite-size_2014} and that their\nweight will become more important with growing disorder strength. It is interesting to note that the\npresence of these non-ETH states coincides with the region of intermediate disorder of the phase\ndiagram in which subdiffusive transport is observed. At the same time, we find that the probability\ndistribution of the entanglement entropy exhibits low entanglement tails. The proposed mechanism for\nthe explanation of subdiffusion relies on the argument that rare Griffiths region of localized spins\nexist, which act as bottlenecks for transport\\cite{vosk_theory_2015,potter_universal_2015}. We\nexpect that these localized regions lead to lower entanglement entropies if the entanglement cut\nlies within them and the observed low entanglement tails of the distribution are consistent with\nthis scenario.\n\n\\subsection{Probability distributions of eigenstate to eigenstate fluctuations}\n\nLet us first focus on the probability distribution of the differences of local magnetizations\n$\\Delta_{n,n+1} S_i^z = |{\\langle\\,{n}\\,|} S_i^z {|{n}\\rangle} - {\\langle\\,{n+1}\\,|} S_i^z {|{n+1}\\rangle}|$ of adjacent eigenstates in the center of the spectrum ($\\epsilon=0.5$) for different disorder strengths. The argument in\nRef. \\onlinecite{beugeling_finite-size_2014} that eigenstate expectation values of local operators\nare effectively governed by the central limit theorem in generic ETH systems implies that one\nexpects that the differences of the local magnetization in adjacent eigenstates are distributed\naccording to a normal distribution with exponentially decreasing variance with system size and zero\nmean. This is in fact verified to high accuracy at very weak disorder strength. For example in the\ntop left panel of  Fig.  \\ref{fig:mag_diff_histo_size} for $h=0.4$ we show the histogram of\n$\\Delta_{n,n+1} S_i^z$ for different system sizes and states in the center of the spectrum\n($\\epsilon=0.5$) together with best fits of the normal distribution, which seem to match perfectly\nwith the numerical data.\n\nHowever, starting at relatively small disorder strengths, deviations from the normal distribution\nemerge, as the distribution develops tails that are significantly heavier than those of the gaussian\ndistribution.\n\n  \\begin{figure}[h]\n      \\centering\n      \\includegraphics{mag_diff_overview.pdf}\n      \\caption{Probability density of the difference $\\Delta_{n,n+1} S_i^z$ of the local magnetization $S_z^i$ of two\n      eigenstates with adjacent energies for different disorder strenghts. The histograms are\n  obtained from the central ($\\epsilon=0.5$) 50 eigenstates of $10^3$ disorder realizations and\n  and contain the results for each site $i$ on which the local magnetization is compared.\n  Even at very weak disorder, the distribution is already leptokurtic, showing heavier tails than\n  the normal distribution. In the limit of very strong disorder, the distribution is dominated by\n  the bimodal distribution of the local magnetization itself, which leads to the three dominant\n  differences $-1, 0, 1$ stemming from random configurations of $S_z^i = -0.5, 0.5$ in the MBL\n  phase.\n  }\n      \\label{fig:mag_diff_histo}\n  \\end{figure}\n\n  \\begin{figure}[h]\n      \\centering\n      \\includegraphics{mag_diff_size.pdf}\n      \\caption{Probability density of the difference $\\Delta_{n,n+1} S_i^z$ of the local\n  magnetization $S_z^i$ of two eigenstates with adjacent energies for different system sizes and\n  disorder strengths. For weak disorder, the reduction of the variance with system size is evident,\n  however the distributions deviate increasingly from a gaussian distribution with growing disorder.\n  In the MBL phase, the distributions become independent of system size, only governed by the\n  localization length, which creates the nonzero weight between the three peaks of the distribution.}\n      \\label{fig:mag_diff_histo_size}\n  \\end{figure}\n\n  \\begin{figure}[h]\n      \\centering\n      \\includegraphics{mag_diff_size_tail}\n      \\caption{Probability density of the difference $\\Delta_{n,n+1}S_i^z$ of the local\n  magnetization $S_i^z$ of two eigenstates with adjacent energies, normalized by the standard\n  deviation $\\sigma$ to compare the shape of the distributions for different system sizes. For\n  $h=0.8$, the weight of the tails seems to decrease with system size and approach the gaussian\n  distribution. This is no longer true for stronger disorder and the weight of the tails increases\n  strongly starting from $h\\gtrsim 1.6$, accompanied by a growing kurtosis with system size\n  in the same regime, making the distributions strongly leptokurtic. The kurtosis is\n  defined by the fourth central moment divided by the squared variance, yielding a value of 3 for the gaussian\n  distribution and larger values if the distribution has heavier tails, {\\textit{i.e.} } if it is leptokurtic.}\n      \\label{fig:mag_diff_tail}\n  \\end{figure}\n\n  While for weak disorder, the deviations from the gaussian distribution seem to shrink, as seen {\\textit{e.g.} } in Fig.\n  \\ref{fig:mag_diff_tail} for $h=0.8$, where we normalize the histograms by the standard deviation\n  $\\sigma$ to compare the shapes, this is no longer true at intermediate disorder, where the\n  deviations from the gaussian distribution increase.\n  In fact, for disorder strengths $h\\gtrsim1.6$, the weight of the\n  tails actually grows with system size, pointing clearly to an effect that survives in the\n  thermodynamic limit. This is most prominent in Fig. \\ref{fig:mag_diff_tail} for $h=2.0$ and\n  $h=2.4$, where it seems that for the largest sizes we divide by a \\emph{too large standard\n  deviation}, thus deforming the shape of the central peak, which narrows with system size, while the\n  tails increase. This means that the variance is in fact larger than one would expect and is\n  therefore influenced by the tails of the distribution, hinting for an effect that survives in the\n  thermodynamic limit. On a more speculative note, this could be related to a slower scaling of the\n  variances of the distribution to the thermodynamic limit as discussed in Figs.\n  \\ref{fig:diff_scaling} and \\ref{fig:generic_scaling}, modifying the exponent.\n\n\n  Interestingly, the distribution in the MBL phase at strong disorder becomes trimodal, indicating\n  that local magnetizations of adjacent eigenstates are close to ${\\langle\\,{n}\\,|} S_i^z {|{n}\\rangle} = \\pm \\frac\n  1 2$ and \\emph{completely independent}, thus suggesting a binomial distribution at strong disorder\n  \\footnote{This is more apparent for larger subsystem magnetizations, where the distribution has a\n      larger number of peaks.}, dressed by slight deviations caused by the finite support of the l-bits in terms of the\n  localization length. As the localization length seems to be smaller than our system sizes already\n  at $h=4.0$, we observe a distribution virtually independent of $L$ in Fig.\n  \\ref{fig:mag_diff_histo_size}.\n\n\n\\subsection{Probability distributions of the entanglement entropy}\n\n  One of the most studied quantities for the MBL transition is certainly the entanglement entropy,\n  which is known to change its mean behavior from a thermal volume law in the ETH phase to an area law in\n  the MBL phase. However, the probability distributions of the entanglement entropy have received\n  less attention until recently\\cite{vosk_theory_2015,baygan_many-body_2015-1,lim_nature_2015}, possibly due to the daunting requirement for\n  the number of disorder realizations to obtain a satisfactory resolution of the histogram. Here, we\n  show results for the probability distribution of the von Neumann entanglement entropy\n  $S_\\text{E}=-{\\mathrm{Tr}}_A\\left[ ({\\mathrm{Tr}}_B {|{n}\\rangle}{\\langle\\,{n}\\,|}) \\ln ({\\mathrm{Tr}}_B {|{n}\\rangle}{\\langle\\,{n}\\,|})\\right]$, where the\n  subsystem $A$ represents half of the chain and $B$ is the complement of $A$. Averaging over\n  approximately $>10^3$ disorder realizations, $~50$ eigenstates per realization from the center of\n  the spectrum ($\\epsilon=0.5$) and over \\emph{all cuts} with subsystem size $L/2$, we can generate\n  histograms from roughly $10^6$ samples of the entanglement entropy.\n  \n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{entanglement_histogram_overview}\n    \\caption{ Probability density of the entanglement entropy $S_E$ of states in the middle of the\n        spectrum ($\\epsilon=0.5$) for different disorder strengths. We use the bipartition $L_A=L_B$\n        for the periodic $L=20$ chain. The evolution from the volume law behavior at weak disorder\n        to the area law at strong disorder is clearly visible. At very weak disorder, the\n        distribution is close to gaussian and develops exponential tails at intermediate disorder.\n        They correspond to rare regions with low entanglement, responsible for slow (subdiffusive)\n        transport.\n        }\n    \\label{fig:ee_histo}\n\\end{figure}\n    The resulting histograms for different disorder strengths are shown in Fig.\n    \\ref{fig:ee_histo}. For very weak disorder, the distribution is close to a normal distribution\n    and the mode (position of the maximum) of the distribution increases slightly with increasing disorder, possibly due to\n    the proximity to the integrable point at $h=0$, where additional integrals of motion restrict\n    the degrees of freedom of eigenstates in the Hilbert space.\n\n    At weak to intermediate disorder strengths, the mode of the\n    distribution is virtually unchanged but a long tail develops, reaching to extremely low values\n    of entanglement. This corresponds to positions of the subsystem cut, where the two subsystems\n    are virtually decoupled, leading to a product state of two smaller system eigenstates and a weak\n    link between them. The weight of these very low entanglement cuts increases dramatically when\n    approaching the transition, leading to a flat distribution with maximal variance around $h=3$.\n    This distribution corresponds to the observed maximal variance of the entanglement entropy in\n    the proximity of the critical point\\cite{kjall_many-body_2014,luitz_many-body_2015,chen_many-body_2015}.\n\n    In the MBL phase, the mode of the distribution shifts to a very low (constant) value, creating\n    the area (constant) law of the mean and develops a resonance at $S_\\text{E} \\approx \\ln 2$, before showing a\n    long exponential decay with arbitrarily strong entanglement. These results suggest that the\n    environment of the transition in both ETH and MBL phases is governed by rare event effects,\n    although their importance in the MBL phase is not clear as they may not be dominating the\n    overall physics. The regime close to the critical point, dominated by Griffiths effects has also\n    recently been studied using a matrix product state based method to access larger system sizes in\n    Ref. \\onlinecite{lim_nature_2015} together with exact diagonalization and the exponential tail\n    of the distribution was also observed as well as the broad histogram at $h=3$.\n\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{entanglement_histogram_size.pdf}\n    \\caption{Probability density of the entanglement entropy $S_E$ of states in the middle of the\n    spectrum for different system sizes at disorder strenghts a) $h=1$, b) $h=2$, c) $h=3$ and\nd) $h=4$.}\n    \\label{fig:ee_histo_L}\n\\end{figure}\n\n\n    Here, we try to connect the presence of low entanglement entropies, to the observed subdiffusive\n    transport regime\\cite{lim_nature_2015,vosk_theory_2015,potter_universal_2015,agarwal_anomalous_2015,luitz_extended_2015}\n    at intermediate disorder. The proposed mechanism for subdiffusion is via rare nearly localized\n    regions, who act a bottlenecks for transport and the entanglement growth in time. If such\n    regions exist, one would naturally expect that the entanglement entropy of the corresponding\n    eigenstates will be low if the cut between the subsystems lies in such a rare region.\n    In fact, one should note that one single localized region will only reduce the entanglement entropy by less\n    than a factor of two, as it reduces entanglement only over one boundary of the subsystem down to\n    the typical constant MBL entanglement entropy. As the total system has periodic boundaries, the\n    second half of the entanglement entropy can still stem from the other subsystem boundary.\n    Together with this argument, we conclude that we find the expected low entanglement entropies in the\n    regime in which transport is subdiffusive and that our results are consistent with this\n    scenario. In the next section, we will discuss this in further detail.\n\n\nLet us briefly discuss the\ndependence on system size of the distributions of the entanglement entropy, shown in Fig.\n\\ref{fig:ee_histo_L}. At weak disorder strength ($h=1.0$), we observe a clear volume law and the\nimportance of the low entanglement tail seems to decrease with growing system size, approaching more\nand more a normal distribution, although all the\ndata for $L=22$ should be treated with care due to a number of samples that is by an order of\nmagnitude smaller than for the other system sizes. At $h=2$ it is clear that the tail of\nthe distribution extends all the way down to very low entanglement. On some very rare occasions, we\nobserve nearly zero entanglement, which can only occur if the eigenstate is close to a product state\nor in other words if \\emph{two} localized regions fall exactly on the cut between the subsystems.\n\nInterestingly, at $h=3$, before the estimated location of the critical point at $h\\approx3.7$, the\ndistribution seems to become flat, bounded by the maximal entanglement entropy, \nwhich is the reason for the observed maximum of the variance of entanglement entropy close to the critical\npoint\\cite{kjall_many-body_2014,luitz_many-body_2015,chen_many-body_2015}, here the weight of low\nentanglement states becomes very large and the behavior is dominated by rare region effects as\ndiscussed in Ref. \\onlinecite{lim_nature_2015}. The dependence on system size suggests, however,\nthat for even larger systems the mode of the distribution can still shift to the thermal value,\nleaving a large weight at low entanglement entropies.\n\nIn the MBL phase ($h=4$), the mode of the distribution is at a low (constant with system size) value, however the tail of the\ndistribution grows with system size, reaching possibly up to the maximal entanglement entropy given by $L/2 \\ln 2$.\n\n\n\\subsection{Weak links}\n\nLet us finally consider the spatial entanglement structure of the central eigenstates\n($\\epsilon=0.5$) in a typical disorder realization of length $L=22$ at intermediate disorder\nstrength $h=2.0$.\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{entanglement_profile.pdf}\n    \\caption{Top panel: Spatial variation of the entanglement entropy $S_E$ for the central 63 eigenstates\n        of one disorder realization $h=2$ in the periodic $L=22$ chain (The disorder configuration ${h_i}$ as a\n    function of the site index $i$ is shown in the bottom panel.) as a function of the position of\nthe cut between subsystem $A$ and $B$. The subsystem size is $\\ell=L/2$. Center panel: Same data as\nin the top panel as line graph. Depending on the cut position, the entanglement entropy varies and\nis found to be particularly low for some cuts, corresponding to a weaker link between the\nsubsystems.  }\n    \\label{fig:entanglement_profile}\n\\end{figure}\n\nWe show in the top panel of Fig. \\ref{fig:entanglement_profile} for the central 63 eigenstates the\nentanglement entropy as a function of the cut position for all 22 possible cut positions (of which\nthe second half is naturally equivalent to the first half). This representation reveals an\nintriguing feature: all states show a minimal entanglement entropy if the system is cut between \nspins 1 and 2 (the second cut is between spins 12 and 13), while the\nentanglement entropy is larger for other cut positions. Although in this sample the drop in the\nentanglement entropy is not very large, it is interesting to observe that the spatial structure is\n\\emph{identical} in all eigenstates in the energy window. This means that the entanglement across one of the\nboundaries of the subsystem is slightly smaller for all eigenstates and could be caused by a weak\nlink, possibly leading to slightly slower transport. One would expect that such a weak link is caused by a field\nconfiguration that localizes spins through large fields and the corresponding configuration in the\nlower panel of Fig. \\ref{fig:entanglement_profile} suggests that this may be caused by the large\nfield $h_i$ on spin 12 and to a lesser extent on spin 2, in fact, a comparison of many samples leads\nto the hypothesis that a large change in the field configuration may lead to a weak link.\n\nIn Fig. \\ref{fig:entanglement_profile2}, we present a sample at $h=3$, $L=18$, where the effect is\nmuch more severe: Here, the entanglement entropy is reduced roughly by a factor of 2 for most states\nif the cut lies between spins 2 and 3 and spins 11 and 12, compared to other cuts. Again, the\nspatial correlation between all states is visible and maximal field changes on both boundaries of the\nsubsystem at spins 2 and 11 may be responsible for the weak link.\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{entanglement_profile2.pdf}\n    \\caption{Top panel: Spatial variation of the entanglement entropy $S_E$ for the central 67 eigenstates\n        of one disorder realization $h=3$ in the periodic $L=18$ chain (The disorder configuration ${h_i}$ as a\n    function of the site index $i$ is shown in the bottom panel.) as a function of the position of\nthe cut between subsystem $A$ and $B$. The subsystem size is $\\ell=L/2$. Center panel: Same data as\nin the top panel as line graph. Depending on the cut position, the entanglement entropy varies and\nis found to be particularly low for some cuts, corresponding to a weaker link between the\nsubsystems. }\n    \\label{fig:entanglement_profile2}\n\\end{figure}\n\nLet us also mention that the correlation of the entanglement profile in all eigenstates has also\nbeen observed in Ref. \\onlinecite{bera_local_2015} by the nearest neighbor concurrence as a measure of\nentanglement. Our results show that the low entanglement tails in the distribution of the\nentanglement entropy in the ETH phase are not simply caused by low entanglement states (which do\nalso exist) but are at least partly created by a spatial variation of the entanglement entropy as a\nfunction of the positions of the subsystem boundaries. The effect is the strongest if at least two localized\nregions are present at a distance that corresponds to the subsystem length.\n\n\\section{Conclusion}\n\n  We have studied in detail the validity of the eigenstate thermalization hypothesis in the random\n  field Heisenberg chain and find that while typical states in the ergodic phase obey ETH, there are\n  rare states with local expectation values far from the ETH mean, \n  leading to tails of the fluctuation distributions that are significantly heavier than those of the\n  normal distribution.\n \n  A comparison of distributions for different system sizes shows that the ETH violating tails can\n  survive in the thermodynamic limit, as at intermediate disorder strength the weight of the tails\n  can even increase with system size. This coincides with the region of the phase diagram that\n  has been reported to be dominated by Griffiths\n  effects\\cite{agarwal_anomalous_2015,vosk_theory_2015,potter_universal_2015,luitz_extended_2015,laumann_many-body_2014,lim_nature_2015}\n  close to the MBL transition.\n\n  Similar rare event tails are also observed in the distribution of the entanglement entropy, which\n  become dominant close to the critical point, creating the large variance of the entanglement\n  entropy that has been reported\n  previously\\cite{kjall_many-body_2014,luitz_many-body_2015,chen_many-body_2015}. We argue that at\n  least a part of the weight of the tails of the distribution is caused by the spatial entanglement\n  structure, showing typical disorder realizations that have a large intrinsic variance of the\n  entanglement entropy, when changing the position of the cut between the subsystems. This\n  observation is in agreement with the proposed mechanism for subdiffusive transport, which relies\n  on rare localized regions that act as weak links.\n  \n  While it is consistent with other studies that low entanglement regions in the ergodic phase may\n  be the cause of the anomalous transport properties at intermediate disorder, it remains an open\n  question if the MBL phase has pathological properties close to the transition due to rare high\n  entanglement regions. The presently accessible system sizes also leave the question of the shape\n  of the distribution at the critical point unanswered. \n  On a final note, we mention that close to the transition, the observed high\n  entanglement tails in the MBL phase might be problematic for matrix product state based\n  methods\\cite{yu_finding_2015,khemani_obtaining_2015,lim_nature_2015,kennes_entanglement_2015},\n  requiring larger bond dimensions.\n\n\\begin{acknowledgments}\n    It is a great pleasure to thank Fabien Alet and Nicolas Laflorencie for many fruitful\n    collaborations and their critical comments on the manuscript. \n    The author is grateful to Jens Bardarson, Bryan Clark, Hitesh Changlani, Eduardo Fradkin, Markus\n    Heyl, Cecile Monthus, Lode Pollet and Frank Pollmann for helpful discussions and to Luiz Santos\n    for his critical reading of the article as well as for many discussions.\n    This work was supported in part by the Gordon and Betty Moore Foundation's EPiQS Initiative\n    through Grant No. GBMF4305 at the University of Illinois and the French ANR program\n    ANR-11-IS04-005-01.\n    The code is based on the PETSc~\\cite{petsc-web-page,petsc-user-ref,petsc-efficient}, \n    SLEPc~\\cite{hernandez_slepc:_2005} and MUMPS\\cite{MUMPS1,MUMPS2} libraries and calculations were performed using HPC\n    resources from CALMIP (grant 2015-P0677).\n    This research is part of the Blue Waters sustained-petascale computing project, which is\n    supported by the National Science Foundation (awards OCI-0725070 and ACI-1238993) and the state\n    of Illinois. Blue Waters is a joint effort of the University of Illinois at Urbana-Champaign and\n    its National Center for Supercomputing Applications.\n\\end{acknowledgments}\n\n  \n\n\n\n\n\\bibliography{eth,mbl_eth}\n\n", "itemtype": "equation", "pos": 18144, "prevtext": "\n  where the local fields $h_i$ are drawn from a box distribution of width $2h$, and $h$ signifies\n  the disorder strength.\n\n  This model has been studied intensively in the context of many body localization, a dynamical\n  quantum phase transition occurring in high energy eigenstates at a critical disorder strength\n  $h_c$, which has been shown to depend on the energy density (with respect to the bandwidth)\n  $\\epsilon=(E-E_\\text{min})/(E_\\text{max}-E_\\text{min})$ of the eigenstate\n  \\cite{pal_many-body_2010,vosk_theory_2014,mondragon-shem_many-body_2015,luca_ergodicity_2013,luitz_many-body_2015} (with the eigenenergy\n  $E$, groundstate energy $E_\\text{min}$ and antigroundstate energy $E_\\text{max}$ of the sample).\n\n  The transition manifests itself in the most striking difference of eigenstates in the two phases,\n  thermalizing in the extended phase and breaking ETH in the localized phase. Here, we will study\n  the validity of the ETH in the extended phase in detail, focussing on the scaling of deviations\n  from ETH and the probability distributions of local operators at fixed energy.\n\n  As explained in a previous work\\cite{luitz_many-body_2015}, we calculate eigenstates corresponding\n  to eigenenergies closest to a target energy density $\\sigma$ for a large number of disorder\n  configurations and different disorder strengths as well as system sizes using a parallelized\n  version of the shift invert technique. Typically, we calculate the $\\gtrsim 50$ eigenpairs, whose\n  energy density $\\epsilon$  is closest to the target energy density $\\sigma$. We will restrict most\n  of the discussion in this work to the center of the band ($\\epsilon=0.5$) unless stated\n  differently. Our results are based on at least $10^3$ disorder realizations per system size and\n  value of the disorder strength, except for $L=22$, where we could only afford to perfom\n  calculations for $\\gtrsim 100$ realizations.\n\n  For the study of the ETH, it is crucial to compare eigenstate expectation values of the same\n  operator in two eigenstates whose corresponding eigenenergies are closest to each other. We shall\n  therefore call eigenstates with neighboring eigenenergies \\emph{adjacent eigenstates}.\n\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{local_mag.pdf}\n\\caption{Disorder averaged difference of local magnetizations as a function of disorder strength in\nthe middle (left) and upper part (right) of the spectrum. For weak disorder, eigenstates thermalize\nand the local magnetization of adjacent states becomes identical in the thermodynamic limit, thus\nyielding a smooth function of energy. Here, the mobility edge for the many body localization\ntransition is also visible as the region, in which adjacent states yield very different results --\nthe MBL phase -- is much larger in the upper part of the spectrum at energy density $\\epsilon =\n0.8$.}\n    \\label{fig:localmag}\n\\end{figure}\n\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{diff_scaling.pdf}\n    \\caption{Finite size scaling of the disorder averaged difference of local magnetizations\n        ${\\langle\\,{n}\\,|} S_z^i {|{n}\\rangle}$ of adjacent eigenstates as a function of the dimension of the\n        Hilbert space $\\text{dim}(\\mathcal{H})$. The inset displays the (discrete) logarithmic\n    derivative, yielding the exponent of the power law in the thermodynamic limit, which slowly\n    approaches $0.5$. The data presented here includes only states from the middle of the spectrum ($\\epsilon=0.5$).} \n    \\label{fig:diff_scaling}\n\\end{figure}\n\\section{Local magnetization}\n\nLet us consider the simplest local operator to check the validity of the ETH: the local\nmagnetization $\\hat{S}_i^z$ on site $i$ of the system. The qualitative behavior of this quantity as\na function of energy at intermediate disorder strength ($h=1.0$) is already clear from Fig.\n\\ref{fig:obsvsenergy}, where we show single eigenstate expectation values of $S_5^z$ at their\ncorresponding energy density $\\epsilon$ for different system sizes. Note that the disorder\nconfiguration of smaller system sizes is obtained as a subset of the larger sizes for comparability.\nIn the middle of the spectrum, the data corresponds to $\\gtrsim 50$ eigenstates obtained by a\nshift-invert technique, while for the largest system size $L=24$, we use a deflation technique for\n$\\lesssim2000$ states at the extreme ends of the spectrum, which successfully works down to\n$\\epsilon=0.85$. \n\nIn Fig. \\ref{fig:obsvsenergy} the variance of ${\\langle\\,{n}\\,|}{\\hat{S}_i^z}{|{n}\\rangle}$ for eigenstates\n${|{n}\\rangle}$ at virtually the same energy decreases with system size for a wide range of the spectrum. It should be\nnoted that the energy window in which the $\\gtrsim 50$ eigenstates closest to the target energy lie\ndecreases with system size, clearly visible by inspecting for example the $L=12$ and $L=16$ data.\nHowever, comparing data for adjacent targets suggests that the decreasing variance of the local\nmagnetization is not an artefact of the decreasing energy window size but rather a generic feature,\nleading to a well defined scaling of the variances in Fig. \\ref{fig:diff_scaling}.\n\nAt very high energy density, this is no longer true and the variance of this local observable over different\neigenstates remains very large, thus breaking ETH. This is fully consistent with the many body\nmobility edge mapped in Ref. \\onlinecite{luitz_many-body_2015}. Nevertheless, one should remain cautious\nwith this observation as for the present disorder strength $h=1.0$ the mobility edge lies close to\nthe boundary of the spectrum where finite size effects are expected to be large. Similarly, one\nexpects a mobility edge at the low end of the spectrum, which is even more difficult to resolve due\nto stronger finite size effects, nevertheless the variance of ${\\langle\\,{n}\\,|}\\hat{S}_5^z{|{n}\\rangle}$ does not\nseem to decrease between the two largest system sizes around $\\epsilon\\approx0.1$.\n\nIn order to study the decreasing variance of the local magnetization more rigorously, we calculate\nthe disorder average of the difference of $\\hat{S}_i^z$ between an eigenstate ${|{n}\\rangle}$ and the\nadjacent eigenstate ${|{n+1}\\rangle}$. This quantity is a measure for the variance of\nthe distribution of eigenstate expectation values of $\\hat{S}_i^z$ over eigenstates within the\nmicrocanonical energy window around the target energy and over disorder realizations. It is obvious\nthat the difference of local operators in adjacent eigenstates has to vanish if the quantity is to\nbecome a smooth function of energy in the thermodynamic limit. In Fig. \\ref{fig:localmag}, we show\nthe disorder averaged difference of local magnetizations of adjacent eigenstates as a function of\ndisorder strength for different system sizes. The signature of ETH is very clear as at weak disorder\nstrength these differences scale to zero with increasing system size, whereas the breakdown of ETH\nin the MBL phase is signalled by a constant average difference for all system sizes. The position of\nthe critical point that can be estimated from the point at which the ETH is no longer valid depends\non the energy density and is fully consistent with a mobility edge\\cite{luitz_many-body_2015,bera_many-body_2015,mondragon-shem_many-body_2015}.\n\nPreviously, it has been established that the variance of eigenstate to eigenstate fluctuations\nof local operators in generic ETH systems decreases exponentially with system size as the square\nroot\\cite{ikeda_eigenstate_2011,beugeling_finite-size_2014} of the dimension of the Hilbert space\n$\\text{dim}(\\mathcal{H})$. We verify this exponential law in Fig. \\ref{fig:diff_scaling} by plotting\nthe average difference of adjacent eigenstate magnetizations $|\\Delta_m| = | {\\langle\\,{n}\\,|} S_i^z {|{n}\\rangle} -\n{\\langle\\,{n+1}\\,|} S_i^z {|{n+1}\\rangle}|$ as a function of the dimension of the Hilbert space\n$\\text{dim}(\\mathcal{H})$ on a log-log scale. Our results are approximately linear and the\ncorresponding exponent can be estimated by the (discrete) logarithmic derivative shown in the inset.\nWe find exponents which are close to $-\\frac 1 2$ for the largest system sizes, in agreement with the\nexpectation of the square root behavior. The quality of the result is unfortunately not sufficient\nto back speculations if the deviations from an exponent of $-\\frac 1 2$ are mere finite size effects\nor may have a deeper origin in the tails of the distributions to be discussed in Sec.\n\\ref{sec:rare}.\n\n\\section{Generic few body operators}\n\n  We have focussed on a specific local operator in the previous section: the local magnetization.\n  This immediately leads to the question, whether different operators will also lead to a smooth\n  function of energy and what condition these operators have to fulfill. In particular, we would\n  like to investigate how ``local'' operators really have to be in order to fulfill ETH.\n\\begin{figure}[h]\n    \\centering\n    \\includegraphics{generic_ops_vs_ell.pdf}\n    \\caption{Disorder averaged Frobenius norm of the difference of reduced density matrices of a\n    subsystem of size $\\ell$ as a function of subsystem size.}\n    \\label{fig:generic}\n\\end{figure}\n  All possible operators of a given support $\\ell$ in two adjacent eigenstates ${|{n}\\rangle}$ and\n  ${|{n+1}\\rangle}$ may be compared most efficiently by comparing the reduced density\n  matrices\\cite{alba_eigenstate_2015,garrison_does_2015}\n  \n", "index": 3, "text": "\\begin{equation}\n      \\rho_\\ell^n = {\\mathrm{Tr}}_{\\overline{A_\\ell}} {|{n}\\rangle}{\\langle\\,{n}\\,|},\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\rho_{\\ell}^{n}={\\mathrm{Tr}}_{\\overline{A_{\\ell}}}{|{n}\\rangle}{\\langle\\,{n}%&#10;\\,|},\" display=\"block\"><mrow><mrow><msubsup><mi>ρ</mi><mi mathvariant=\"normal\">ℓ</mi><mi>n</mi></msubsup><mo>=</mo><mrow><msub><mi>Tr</mi><mover accent=\"true\"><msub><mi>A</mi><mi mathvariant=\"normal\">ℓ</mi></msub><mo>¯</mo></mover></msub><mo>⁢</mo><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>n</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>⁢</mo><mrow><mo rspace=\"4.2pt\" stretchy=\"false\">⟨</mo><mpadded width=\"+1.7pt\"><mi>n</mi></mpadded><mo fence=\"true\" stretchy=\"false\">|</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]