[{"file": "1601.06492.tex", "nexttext": "\nThus, at time $t=0$ (no dissolution), $h_d(0)=-\\delta_f$ and for dissolution times $t>0$,  $|h_{d}(t)|>\\delta_f$ because of the enhanced dissolution rate of the densified zone (colored zone) that was generated during the indentation process.\nSince the dissolution rate is constant over time for A, its position, from  the initial point A$_0$ at the free surface ($z=0$), at dissolution time $t$, is known {\\em via} $z_{A} = V_0\\times t$ ($V_0 < 0$).\nTherefore, the position of point B with respect to that of the initial free surface ($z=0$) is expressed as:\n\n", "itemtype": "equation", "pos": 14056, "prevtext": "\n\n\n\n\n\\begin{frontmatter}\n\\title{A chemical dissolution technique for challenging existing constitutive models of the densification process beneath an indentation imprint in amorphous silica}\n\\author[Rennes]{J.-P. Guin}\n\\author[Rennes,Lorient,Sydney]{V. Keryvin\\corref{cor1}} \n\\author[Rennes,Annecy]{L. Charleux}\n\\author[Rennes]{K. Han}\n\\author[Rennes]{J.-C. Sangleb\\oe uf}\n\\author[Sydney]{M. Ferry} \n\\address[Rennes]{Univ. Rennes 1, UMR CNRS 6251, IPR, F-35042 Rennes, France}\n\\address[Lorient]{Univ. Bretagne-Sud, EA 4250, LIMATB, F-56321 Lorient, France}\n\\address[Annecy]{Univ. Savoie Mont Blanc, EA 4114, SYMME, F-74000 Annecy, France}\n\\address[Sydney]{School of Materials Science and Engineering, The University of New South Wales, Sydney, NSW 2052, Australia}\n\\cortext[cor1]{Corresponding author: vincent.keryvin@univ-ubs.fr}\n\n\n\n\n\n\\begin{abstract}\n\n The  region of permanent densification beneath a Berkovich indentation imprint in silica glass is investigated using a novel chemical dissolution technique.\n The use of the similitude regime in sharp indentation testing allows one to record reliable data with a good spatial resolution that makes it possible to deal with low loads (typically below 10 mN) and crack-free imprints.\n The densified zone dissolves much quicker than the non densified regions.\n The analysis of the results, along the vertical axis, indicates that the densification zone is rather homogeneous with a steep transition to the non densified zone.\n The size of the densification zone, with respect to the initial free surface, is estimated to be around 1.9 the maximum penetration depth of the instrumented indentation test.\n These findings are compared with former experimental data and critically compared with the results of numerical simulations from selected constitutive equations and other numerical techniques from the literature. \n These comparisons highlight some advantages and disadvantages of existing modelings and thus call for further advanced progress on that matter.\n They nevertheless favor mostly the contribution of the densification process with respect to the plastic flow (volume conservative process) in creating a permanent imprint.\n \n \n\\end{abstract}\n\n\n\n\\begin{keyword}\n Non-metallic glasses (silicates); Pressure dependent plasticity; Constitutive modeling; Densification; Nanoindentation.\n\\end{keyword}\n\\end{frontmatter}\n\n\n\n\\setcounter{footnote}{0}\n\\section{Introduction}\nThe highest strength value measured for pristine silica glass fibres is $\\sim$ 10 GPa at room temperature \\cite{Proctor1967}, but the extreme sensitivity of silicate glasses to surface damage is often reported to be the reason for low strength values of few tens of MPa in manufactured structural glass parts \\cite{EN572}.\nAlthough the negative impact of surface damage on the durability of silica glass has been studied for quite a long time \\cite{Grenet1889}, a complete understanding of this effect is far from being realised. \nAn efficient way to scientifically study surface damage in glass is to create controlled sharp contact conditions between a pyramidal indenter having a well-defined geometry and a prepared glass surface. \nUnder such contact conditions, oxide glasses accommodate deformation both by elastic and permanent deformation mechanisms among which one can distinguish a volume conservative one, shear flow, and a non volume conservative one, densification (i.e. permanent density increase, $\\Delta\\rho^p$) \\cite{Ernsberger1968,Peter1970,Hagan1980b,Yoshida2005,Rouxel2010,Yoshida2010}. \nThe respective contributions of the two mechanisms to the overall strain depends strongly on the pressure and shear state as well as on the chemical composition of silicate glasses \\cite{Kurkjian1995a}.\nFrom purely hydrostatic compression tests it was shown that silica glass (respectively window glass) exhibits a threshold value of $\\sim$ 10 GPa (resp. $\\sim$ 8 GPa) below which no permanent densification is observed \\cite{Bridgman1953,Roy1960,Christiansen1962,Mackenzie1963,Ji2006}.\nAbove this threshold, the value of the permanent densification ratio (ratio $\\Delta\\rho^p$ to $\\rho_0$ the initial mass density) increases monotonically with applied pressure up to a saturation value of $\\sim$ 21\\% (resp. $\\sim$ 6 \\%) at a pressure of 25 GPa \\cite{Rouxel2008, Rouxel2008a}.\nMicro Raman spectroscopy \\cite{Rouxel2008a,Perriot2006,Hehlen2010,Kassir-Bodon2012,Deschamps2013a} and more recently Brillouin spectroscopy \\cite{Tran2012} where successfully used to either characterize permanently densified samples and their associated structural modifications or map out the size, shape and intensity of the densification ratio around and underneath residual indentation imprints \\cite{Yoshida2005,Perriot2006}. \nAlthough these spectroscopic techniques generate invaluable information regarding structural changes, they suffer from a relatively low spatial resolution, which is of the order of a micrometer at best \\cite{Kassir-Bodon2012,Tran2012}.\nThus, to map out densification contrast under indentation imprints with sufficient spatial resolution, researchers resorted to increasing the size of the processed zone by the use of high indentation loads of at least 20 N \\cite{Perriot2006,Kassir-Bodon2012,Tran2012} for silica glass or soda-lime-silica glass.\nHowever, as shown in Ref.  \\cite{Kassir-Bodon2012}, this level of loading results in massive fracturing of the zone underneath a Vickers indentation \\cite{Hagan1979,Rouxel2001}. \nCrack nucleation and propagation are energy dissipative processes, such that a non negligible part of the energy involved in the indentation test goes into fracture events; this may affect the size, shape and nature of the densified area developed during indentation. \nCracking events must therefore be limited as much as possible using such methods as nano-indentation at loads below 50 mN \\cite{Charleux2014b}. \n\nAn alternative technique to Raman or Brillouin spectroscopies, which relies on the increase in the rate of  dissolution of silicate glasses with the level of densification, was recently developed by Niu {\\em et al.}\\ \\cite{Niu2012}. \nBy coupling hydrolysis with atomic force microscopy (AFM) measurements, it was shown that nanometer-sized changes in the shape of the residual imprint is possible.\nIt was demonstrated that the increase in dissolution rate is intimately linked to the underlying structural changes induced by densification \\cite{Hehlen2010,Deschamps2011}. \nHence, the first aim of this paper is to extend this technique to give sound and quantitative information on the densification zone underneath an indentation imprint in amorphous silica, making use of the geometrical self similarity of the sharp indentation test \\cite{Cheng2004}.\nWe will focus on two main questions. \nFirstly, what is the size of the densification zone? \nSecondly, what is the nature of the densification zone, {\\em i.e.} is it rather homogeneous or heterogeneous?\nThese questions are addressed in Sections 2 and 3.\n\nThese new quantitative experimental results will allow us to discuss the present state modeling of the permanent deformation process in silica glass.\nIndeed, a robust constitutive model of brittle materials like silicate glasses is far from being straightforward. \nUnlike metallic alloys, where simple uniaxial testing in tension provides invaluable information, glasses fracture at stresses below their yield strength due to the existence of surface defects.\nHence, it is necessay to carry out constrained tests such as hydrostatic compression or indentation to circumvent these issues.\nThe pressure-induced densification process has been recently described \\cite{Keryvin2014b} and it was shown that one must take into account a number of mechanisms to correctly match the experimental data, namely a threshold for densification, an increase in pressure upon densification, a saturation of densification and an increase in elastic moduli upon densification.\nSince heterogeneous and multi-axial stress fields develop underneath the indenter, it is necessary to use numerical procedures to simulate the indentation test.\nRecently, numerical simulations of the indentation process were reported in the literature using constitutive equations and Finite-Element Modelling (FEM) \\cite{Xin2000,Kermouche2008,Keryvin2014a,Gadelrab2012}, Discrete Element Modelling (DEM) \\cite{Jebahi2013} or Molecular Dynamics (MD) simulations \\cite{Kilymis2013a,Yuan2014}.\nThe second aim of this paper is to use the experimental results generated by the dissolution technique to test the validity of the constitutive models \\cite{Xin2000,Kermouche2008,Keryvin2014a}.\nThis is addressed in Sections 4 and 5.\n\n\n\\section{Experimental methods}\n\n\n\\subsection{Material and indentation procedures}\n\\label{sec:mat}\nA commercial silica glass (SiO$_{\\text{2}}$ 99.6 mol \\%, Spectrosil\\textsuperscript{TM}) from Saint Gobain company (France) was used in this study. \nThe glass surface was polished with cerium oxide, and subsequently annealed for 2 h at the glass transition temperature (T$_g$, 1100{\\degr C}). \nThe mass density of the glass after annealing was $\\rho_0$=2.2 g/cm$^3$.\nOne pristine (indentation free) sample of the glass was retained for the dissolution rate measurements in its relaxed state.\n\nInstrumented indentation tests were carried out with a nano-indenter testing device (TI950, Hysitron, USA) at ambient conditions (23{\\degr C}\\ and 55\\% relative humidity). \nThe indenter tip is a modified Berkovich diamond pyramid.\nBoth AFM imaging and a standard indenter tip calibration method on a fused quartz standard sample \\cite{Oliver2004} lead to an indenter tip radius value of about 260 nm.\nAnother way to qualify the bluntness of the tip is to calculate a truncated length \\cite{Loubet1984}.\nThe mechanical response of the indentation test is the force $P$ vs. the displacement $\\delta$ (counted positively).\nThe truncated tip defect length, $\\Delta \\delta$, is obtained by plotting $\\sqrt{P}$ vs. $\\delta$ for the fused quartz reference sample during the loading stage (increasing $P$).\nThis curve should be linear with its origin at (0,0) for a perfect tip (self similarity of sharp indentation, see {\\em e.g.} \\cite{Cheng2004}).\nThis is not the case for shallow depths below $\\sim$ 50 nm, so $\\Delta \\delta$ was calculated by taking the intercept of a linear fit of this curve for high values of $\\delta$, as seen in Figure \\ref{fig:disp}.\n$\\Delta \\delta$ is found to be $\\sim$  20 nm.\n\nNano-indentation tests were carried out using a commercial apparatus (Hysitron, TI950) on a dedicated sample, with a '10-10-10' loading sequence: 10 s to reach the maximum load $P_m$, 10 s of holding time, and 10 s to unload the sample's surface. \nThey were load-controlled and the $P_m$ values ranged from 250 $\\mu$N to 10 mN.\nThe maximum and residual displacements are referred to as $\\delta_m$ and $\\delta_f$, respectively.\nDue to the high reproducibility of the nano-indentation test on the glass surface, five indents per chosen maximum load were performed.\nAll imprints, as imaged by AFM, were free of corner cracks.\n\n\n\\subsection{Chemical dissolution technique}\n\n\nEach indented glass sample was immersed in a Teflon\\textsuperscript{TM} container filled with 50 mL of a 0.1 N NaOH solution heated to 80{\\degr C}. \nThe temperature was kept at $\\pm$ 0.5{\\degr C} in a thermally regulated furnace. \nThe prepared solution was divided into two separate containers for the indented and indent-free samples, respectively. \nThe latter was used to compute the dissolution rate V$_0$ by the weight loss method. \nThose conditions allowed one to avoid saturation conditions throughout dissolution, as confirmed from the linear trend of the weight mass loss of the sample versus dissolution time \\cite{Niu2012}. \nThe indented samples immersed in the alkaline solution were taken out periodically (every half to one hour) and rinsed consecutively with deionized water and ethanol prior to carrying out AFM. \nAFM measurements made it possible to record the three-dimensional geometry of the imprint after each dissolution stage.\nImages were captured with the tapping mode of the AFM (Bruker, Nanoscope V, USA) equipped with silicon tips (TAP 300 Al) which apical angle is 70\\textdegree\\ and the tip radii are no larger than 10 nm.\nDue to both a smaller tip radius and a sharper apical angle, when compared to that of the indenter, the geometry of the imprint was not altered by the finite size and geometry of the AFM probe tip. \nPrior to carrying out any measurements, the AFM was calibrated with several grids: a 10 $\\mu$m pitch of 200 nm deep squared holes and a 3 $\\mu$m pitch of (23$\\pm$1) nm deep engraved features (TGZ1).\nMoreover, to limit the effect of typical AFM artifacts on the measurements such as thermal drift and piezo creep, thermal equilibrium of the system was established (about 2 h) before capturing an image.\nThe size of the scanned area was large enough so that a sufficient area unaffected by the indentation process exists and may be used as a reference surface (i.e., set to zero tilt and zero offset).\nFor each loading condition, the topography of three to five indentation imprints were recorded by AFM as a function of dissolution time. \nFollowing the technique described in Ref. \\cite{Niu2012}, we focus on the evolution of the depth of the  residual indentation imprint as a function of dissolution time. \nFor a clearer understanding of the process, a schematic is given in Figure \\ref{fig:schema}. \nThe sample is shown in Fig. \\ref{fig:schema} (a) after indentation with a residual imprint of depth equal to $\\delta_f$. \nTwo points of interest are labelled A$_0$ and B$_0$, respectively, and their relative height is monitored by AFM ($z_{A_0} - z_{B_0}$ = $\\delta_f$). \nAs shown in Fig. \\ref{fig:schema} (b,c), throughout the dissolution process, A$_0$ and B$_0$ move to A ($z_{A}$) and B ($z_{B}$), respectively, with the residual indentation imprint depth at dissolution time $t$ being expressed as (and further referred to as the dissolution depth):\n\n \n", "index": 1, "text": "\\begin{equation}\n h_{d}(t) = (z_{B} - z_{A})\n \\label{eq:depth}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"h_{d}(t)=(z_{B}-z_{A})\" display=\"block\"><mrow><mrow><msub><mi>h</mi><mi>d</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>z</mi><mi>B</mi></msub><mo>-</mo><msub><mi>z</mi><mi>A</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\nThe first term is evaluated by determining $V_0$ with the loss weight method on the pristine (indent-free) sample and the second term is measured by AFM {\\em via} Eq. \\eqref{eq:depth}.\n\n\n\\subsection{Dimensional analysis of the dissolution process}\n\n\\label{sec:similitude}\n\nDimensional analysis \\cite{Buckingham1915} has been used by Cheng \\textit{et al.} \\cite{Cheng2004} to establish key relationships between material properties, indenter geometry and load \\textit{vs.} displacement curves produced by sharp indentation. \nIn this part, we extend this approach to the dissolution of the residual imprint in order to establish a similitude rule between two tests carried out on the same sample with different loads.\n\nFirst, several assumptions are required. \nThe indenter is a perfect pyramid or a cone so that its geometry only relies on a set of angles $[\\psi]$.\nThe indenter's constitutive material is homogeneous, isotropic and elastic so that its behavior depends only on its Young's modulus $E_{i}$ and its Poisson's ratio $\\nu_{i}$.\nThe sample is an homogeneous, time independent material for which the elastic behavior is described by the Young's modulus $E_{s}$ and Poisson's ratio $\\nu_{s}$. \nIts inelastic behavior is controlled by a set of yield strengths [$\\sigma_y$] (corresponding to pure shear, uniaxial tension, hydrostatic compression\\ldots) and a set of dimensionless additional parameters $[\\alpha]$ that controls the additional mechanisms such as hardening-like events.\nThe local dissolution rate of the sample's material is $V_0$ in its pristine state and $V$ after densification. \nThe ratio $V/V_0$ is a dimensionless function which is assumed to depend only on a set of dimensionless parameters $[\\beta]$ (such as the densification state\\ldots).\n\nThen, dimensional analysis \\cite{Cheng2004} allows us to establish  a linear relationship between $h_d$ and $P_m^{1/2}$, by introducing a dimensionless function $\\phi$ of dimensionless arguments:\n\n\n", "itemtype": "equation", "pos": 14693, "prevtext": "\nThus, at time $t=0$ (no dissolution), $h_d(0)=-\\delta_f$ and for dissolution times $t>0$,  $|h_{d}(t)|>\\delta_f$ because of the enhanced dissolution rate of the densified zone (colored zone) that was generated during the indentation process.\nSince the dissolution rate is constant over time for A, its position, from  the initial point A$_0$ at the free surface ($z=0$), at dissolution time $t$, is known {\\em via} $z_{A} = V_0\\times t$ ($V_0 < 0$).\nTherefore, the position of point B with respect to that of the initial free surface ($z=0$) is expressed as:\n\n", "index": 3, "text": "\\begin{equation}\n p\\,(t) = V_0\\, t + h_{d}(t) \n \\label{eq:diss}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"p\\,(t)=V_{0}\\,t+h_{d}(t)\" display=\"block\"><mrow><mrow><mpadded width=\"+1.7pt\"><mi>p</mi></mpadded><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+1.7pt\"><msub><mi>V</mi><mn>0</mn></msub></mpadded><mo>⁢</mo><mi>t</mi></mrow><mo>+</mo><mrow><msub><mi>h</mi><mi>d</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\n\n\nWe now compare two imprints: a first one performed at the highest maximum force $P_{m,1}$  considered as the reference and a second one made at a lower maximum force $P_{m,2}$. \nAccording to Eq. \\eqref{eq:dim_an}, the depths of the corresponding residual imprints during the dissolution process are indeed different but verify:\n\n\n\n", "itemtype": "equation", "pos": 16740, "prevtext": "\nThe first term is evaluated by determining $V_0$ with the loss weight method on the pristine (indent-free) sample and the second term is measured by AFM {\\em via} Eq. \\eqref{eq:depth}.\n\n\n\\subsection{Dimensional analysis of the dissolution process}\n\n\\label{sec:similitude}\n\nDimensional analysis \\cite{Buckingham1915} has been used by Cheng \\textit{et al.} \\cite{Cheng2004} to establish key relationships between material properties, indenter geometry and load \\textit{vs.} displacement curves produced by sharp indentation. \nIn this part, we extend this approach to the dissolution of the residual imprint in order to establish a similitude rule between two tests carried out on the same sample with different loads.\n\nFirst, several assumptions are required. \nThe indenter is a perfect pyramid or a cone so that its geometry only relies on a set of angles $[\\psi]$.\nThe indenter's constitutive material is homogeneous, isotropic and elastic so that its behavior depends only on its Young's modulus $E_{i}$ and its Poisson's ratio $\\nu_{i}$.\nThe sample is an homogeneous, time independent material for which the elastic behavior is described by the Young's modulus $E_{s}$ and Poisson's ratio $\\nu_{s}$. \nIts inelastic behavior is controlled by a set of yield strengths [$\\sigma_y$] (corresponding to pure shear, uniaxial tension, hydrostatic compression\\ldots) and a set of dimensionless additional parameters $[\\alpha]$ that controls the additional mechanisms such as hardening-like events.\nThe local dissolution rate of the sample's material is $V_0$ in its pristine state and $V$ after densification. \nThe ratio $V/V_0$ is a dimensionless function which is assumed to depend only on a set of dimensionless parameters $[\\beta]$ (such as the densification state\\ldots).\n\nThen, dimensional analysis \\cite{Cheng2004} allows us to establish  a linear relationship between $h_d$ and $P_m^{1/2}$, by introducing a dimensionless function $\\phi$ of dimensionless arguments:\n\n\n", "index": 5, "text": "\\begin{equation}\n h_d (t) = \\sqrt{\\dfrac{P_{m}}{E_{s}}} \\phi\\left(\\dfrac{E_{s} V_0^2t^2}{P_{m}}, \\dfrac{E_{s}}{E_{i}} , \\dfrac{[\\sigma_y]}{E_{s}} ,\\nu_{i}, \\nu_{s}, [\\alpha], [\\beta], [\\psi]\\right)\n \\label{eq:dim_an}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"h_{d}(t)=\\sqrt{\\dfrac{P_{m}}{E_{s}}}\\phi\\left(\\dfrac{E_{s}V_{0}^{2}t^{2}}{P_{m%&#10;}},\\dfrac{E_{s}}{E_{i}},\\dfrac{[\\sigma_{y}]}{E_{s}},\\nu_{i},\\nu_{s},[\\alpha],[%&#10;\\beta],[\\psi]\\right)\" display=\"block\"><mrow><mrow><msub><mi>h</mi><mi>d</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msqrt><mfrac><msub><mi>P</mi><mi>m</mi></msub><msub><mi>E</mi><mi>s</mi></msub></mfrac></msqrt><mo>⁢</mo><mi>ϕ</mi><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><msub><mi>E</mi><mi>s</mi></msub><mo>⁢</mo><msubsup><mi>V</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msup><mi>t</mi><mn>2</mn></msup></mrow><msub><mi>P</mi><mi>m</mi></msub></mfrac><mo>,</mo><mfrac><msub><mi>E</mi><mi>s</mi></msub><msub><mi>E</mi><mi>i</mi></msub></mfrac><mo>,</mo><mfrac><mrow><mo stretchy=\"false\">[</mo><msub><mi>σ</mi><mi>y</mi></msub><mo stretchy=\"false\">]</mo></mrow><msub><mi>E</mi><mi>s</mi></msub></mfrac><mo>,</mo><msub><mi>ν</mi><mi>i</mi></msub><mo>,</mo><msub><mi>ν</mi><mi>s</mi></msub><mo>,</mo><mrow><mo stretchy=\"false\">[</mo><mi>α</mi><mo stretchy=\"false\">]</mo></mrow><mo>,</mo><mrow><mo stretchy=\"false\">[</mo><mi>β</mi><mo stretchy=\"false\">]</mo></mrow><mo>,</mo><mrow><mo stretchy=\"false\">[</mo><mi>ψ</mi><mo stretchy=\"false\">]</mo></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\n\n\\noindent For a given value of $t_1$, we now consider a specific value of $t_2$:\n\n\n", "itemtype": "equation", "pos": 17304, "prevtext": "\n\n\nWe now compare two imprints: a first one performed at the highest maximum force $P_{m,1}$  considered as the reference and a second one made at a lower maximum force $P_{m,2}$. \nAccording to Eq. \\eqref{eq:dim_an}, the depths of the corresponding residual imprints during the dissolution process are indeed different but verify:\n\n\n\n", "index": 7, "text": "\\begin{equation}\n \n \\frac{h_{d,2}(t_2)}{h_{d,1}(t_1)}=\\sqrt \\frac{P_{m,2}}{P_{m,1}} \\dfrac{\\phi\\left(\\dfrac{E_{s} V_0^2t_2^2}{P_{m,2}}, \\ldots \\right) }{\\phi\\left(\\dfrac{E_{s} V_0^2t_1^2}{P_{m,1}}, \\ldots\\right)}\n \\label{eq:dim_an_1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\par&#10;\\frac{h_{d,2}(t_{2})}{h_{d,1}(t_{1})}=\\sqrt{\\frac{P_{m,2}}{P_{m,1}}}%&#10;\\dfrac{\\phi\\left(\\dfrac{E_{s}V_{0}^{2}t_{2}^{2}}{P_{m,2}},\\ldots\\right)}{\\phi%&#10;\\left(\\dfrac{E_{s}V_{0}^{2}t_{1}^{2}}{P_{m,1}},\\ldots\\right)}\" display=\"block\"><mrow><mfrac><mrow><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo>=</mo><mrow><msqrt><mfrac><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub></mfrac></msqrt><mo>⁢</mo><mfrac><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>E</mi><mi>s</mi></msub><mo>⁢</mo><msubsup><mi>V</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>t</mi><mn>2</mn><mn>2</mn></msubsup></mrow><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub></mfrac></mstyle><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>)</mo></mrow></mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo>(</mo><mstyle displaystyle=\"true\"><mfrac><mrow><msub><mi>E</mi><mi>s</mi></msub><mo>⁢</mo><msubsup><mi>V</mi><mn>0</mn><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>t</mi><mn>1</mn><mn>2</mn></msubsup></mrow><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub></mfrac></mstyle><mo>,</mo><mi mathvariant=\"normal\">…</mi><mo>)</mo></mrow></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\n\n\\noindent As a consequence:\n\n\n", "itemtype": "equation", "pos": 17636, "prevtext": "\n\n\\noindent For a given value of $t_1$, we now consider a specific value of $t_2$:\n\n\n", "index": 9, "text": "\\begin{equation}\nt_2 = t_1\\sqrt \\frac{P_{m,2}}{P_{m,1}}\n\\label{eq:dim_an_2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"t_{2}=t_{1}\\sqrt{\\frac{P_{m,2}}{P_{m,1}}}\" display=\"block\"><mrow><msub><mi>t</mi><mn>2</mn></msub><mo>=</mo><mrow><msub><mi>t</mi><mn>1</mn></msub><mo>⁢</mo><msqrt><mfrac><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub></mfrac></msqrt></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\n\nTherefore, we define an equivalent dissolution time, $t^*$, and an equivalent dissolution depth, $h_d^*$, to retrieve the information of the reference test \"1\" thanks to the information of the other test \"2\".\nThey are thus calculated as:\n\n\n\n \n\n", "itemtype": "equation", "pos": 17757, "prevtext": "\n\n\\noindent As a consequence:\n\n\n", "index": 11, "text": "\\begin{equation}\n \n h_{d,2}(t_2) = \\sqrt \\frac{P_{m,2}}{P_{m,1}} \\,  h_{d,1}(t_1)\n \\label{eq:dim_an_3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\par&#10; h_{d,2}(t_{2})=\\sqrt{\\frac{P_{m,2}}{P_{m,1}}}\\,h_{d,1}(t_{1})\" display=\"block\"><mrow><mrow><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>2</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>2</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><msqrt><mfrac><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub></mfrac></msqrt></mpadded><mo>⁢</mo><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.06492.tex", "nexttext": "\nAs a consequence, one can rescale data for different maximum forces ($P_{m,2}$) w.r.t. a reference force ($P_{m,1}$), using an equivalent dissolution time and an equivalent dissolution depth, as found in  Eq. \\eqref{eq:dim_an_4}, {\\em i.e.} by multiplying the raw time and depth experimental data by the rescaling factor $\\sqrt \\frac{P_{m,1}}{P_{m,2}}$. \nIt makes it possible to extract complementary data from multiple indentation-dissolution tests and increase drastically the precision of the method. \nHowever, this similitude rule relies on the fact that the indentation tests are performed in the self similar regime. \nThis is possible only because the indenter is assumed to be a perfect pyramid which has no intrinsic length scale. \nIn order to apply this rule experimentally, one has to deal with the defects of the tip of the indenter.\nIt is shown in \\cite{Loubet1984} that if the test is performed at high enough penetration depths $\\delta$ w.r.t. the truncated length $\\Delta \\delta$, the self similar regime exists and the only impact of the tip defect is a shift of the penetration by $\\Delta \\delta$. \nFigure \\ref{fig:disp} shows that the experimental value of $\\Delta \\delta$ is $\\sim 20$ nm. \nHence, all penetration depths reported hereafter are shifted by $\\Delta \\delta$ to remove (at least partially for very low loads, as discussed in the next Section) the effect of truncated length. \n\n\n\\section{Experimental results}\n\n\\label{sec:xpres}\n\nThe weight loss method on the pristine glass sample (indent-free) gives a dissolution rate of V$_0 = (-48 \\pm 2)$ nm/h.\nFigure \\ref{fig:dissolution} reports, for indentation maximum loads $P_m$ ranging from 0.25 mN to 10 mN, the evolution of dissolution depths ($h_d$) as a function of dissolution time.\nRegardless of $P_m$, the curves exhibit similar behavior.\nIn the first zone, referred hereafter as Region I, the depth of the residual imprint (its absolute value) increases with dissolution time.\nIt means that, in this region, the dissolution is faster than that of the free surface far from the imprint.\nFor longer dissolution times, a second zone referred herafter as Region II, is characterized by a plateau, for which the imprint depth remains constant. \nIt was shown in Ref. \\cite{Niu2012} that the boundary between Region I and II is directly linked to the transition between the densified zone and the non-densified material and may be used later as a good estimate for computing the thickness of the glass affected by the permanent deformation under a residual indentation imprint.\nFor experimental reasons the same dissolution step was used for all the loads.\nUnfortunately, this choice has a strong impact on the fitting of Region I as a lack of data points is noticeable at low loads (see Fig. \\ref{fig:dissolution}).\n\nTo circumvent this problem we use the similitude principle described in Section \\ref{sec:similitude}.\nWe therefore rescale both axes of Fig. \\ref{fig:dissolution}, using Eq. \\eqref{eq:dim_an_4}, taking the maximum load $P_m$ = 10 mN as a reference.\nFigure \\ref{fig:pgs} presents these results.\nIt is clear that, in most cases, the data points collapse into a single curve presenting the two regions defined previously. \nHowever, there are two notable exceptions at low loads of 0.25 and 0.5 mN.\nThis is not surprising since, as highlighted in Figure \\ref{fig:disp}, for low loads (and hence low displacements), we are not in the similitude regime.\nShifting data by $\\Delta\\delta\\sim$ 20 nm  solves only partially this situation (see Fig. \\ref{fig:disp}).\nThis situation disappears as the displacement increases. In other words, the higher the displacement induced by the indentation and/or the higher the dissolution depth, the closer we are to this similitude regime.\nIt is illustrated in Figure \\ref{fig:dissolution} that, for high dissolution times (rescaled w.r.t. to the 10 mN reference load), the data from the indentations performed at 0.25 and 0.5 mN will follow the trend of the other loads.\nNevertheless, we have removed these two data sets from our further analysis.\n\nRegion I was fitted by a least squares linear regression.\nThis indicates that, in this region, the increase in dissolution rate is rather homogeneous and is found to be $\\Delta\\,V$ = 16.7 $\\pm$ 0.9 nm/h.\nRegion II was fitted by a plateau value of $h^*_D = -$257 $\\pm$ 5 nm.\nThese fits are superimposed on the data in Figure \\ref{fig:pgs} together with confidence intervals (within one standard deviation) shaded for clarity.\nSuch a plot allows us to calculate the intercept between the confidence intervals of Region I and Region II to get a confidence interval of the dissolution time required to reach the plateau, i.e. $t_D^*=5.9\\substack{+0.8\\\\-0.7}$ h.\n\nThese extended results makes us assume that the densification zone (Region I) is rather homogeneous followed by a steep transition to the non-densified zone. Hence, we can estimate the depth of the indentation depth corresponding to the plateau of Region II.\nIndeed, knowing the dissolution rate of the free surface (point $A$ in Fig. \\ref{fig:schema}) we can estimate the depth dissolved at time $t_D^*$ to be $\\delta^*_D \\sim -$282 nm.\nBy adding the dissolution depth plateau value, $h^*_D$, we find, according to Eq. \\eqref{eq:depth}, that the position of the boundary of the densified zone along the vertical axis lies at $p^*_D  \\sim -$539 nm.\nWith respect to $\\delta_m$ it gives $\\sim$ -1.88.\nAll these data are reported in Table \\ref{tab:results}.\n\n\n\n\n\n\\section{Numerical calculations}\n\nThe experimental data reported in section 3 will be used to compare with numerical simulations of the indentation process for some selected constitutive equations.\n\n\n\\subsection{Constitutive equations}\n\n\nWe have selected three different constitutive equations used over the past 15 years for describing the indentation process in silica glass.\nWe describe briefly their salient features with the aid of Figure \\ref{fig:models} and the classical notations of modern continuum mechanics.\nAll models\\footnote{We leave the Reader with Refs. \\cite{Xin2000,Kermouche2008,Keryvin2014a,Keryvin2014b} for the details of the models as well as the values of the materials parameters.} are rate-independent and use a yield criterion and a flow rule.\nThe former is plotted in the equivalent shear ($\\tau_{\\textsf{eq}}=\\sqrt{\\frac{1}{2}\\, \\text{tr}\\, ({\\oalign{${s}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}\\cdot{\\oalign{${s}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}})}$, ${\\oalign{${s}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}$ is the deviatoric part of the Cauchy stress tensor) - pressure (P) plane.\nThe latter (the direction of the plastic strain rate ${\\oalign{${\\dot{\\epsilon}}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}^p$) is superimposed in the equivalent isochoric shear plastic strain rate ($\\dot{\\gamma}^p_{\\textsf{eq}} =  \\sqrt{2\\, \\text{tr}\\, (\\dot{{\\oalign{${\\gamma}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}^p}\\cdot \\dot{{\\oalign{${\\gamma}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}^p})}$) vs densification rate ($\\dot{\\xi}^p = -\\text{tr}\\, {\\oalign{${\\dot{\\epsilon}}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}^p$) plane. \nFor all models, in pure hydrostatic conditions ($\\tau_{\\textsf{eq}}=0$), densification occurs at a given pressure P$_0$.\nThe first model (see Fig. \\ref{fig:models} (a)) is that of Lambropoulos {\\em et al.}\\ \\cite{Lambropoulos1996}; the yield criterion is linear and ressembles that of Drucker-Prager used for soils and sometimes metallic glasses but with an opposite contribution of pressure \\cite{Keryvin2008,Keryvin2008c}.\nThe flow rule is associated (normality rule w.r.t. the yield surface) so that both densification ($\\xi^p$) and shear flow ($\\gamma^p_{\\textsf{eq}}$) develop at the same magnitudes whatever the stress state ($\\tau_{\\textsf{eq}}$, P).\nThe second model (see Fig. \\ref{fig:models} (b)) is that of Kermouche {\\em et al.}\\ \\cite{Kermouche2008}; the yield criterion is elliptic for positive pressures (red line) and is modified by the increase in pressure upon densification (blue line). \nThe flow rule is associated so that both densification ($\\xi^p$) and shear ($\\gamma^p_{\\textsf{eq}}$) develop depending on the stress state, with extremes being at P=0 where only plastic shear develops and $\\tau_{\\textsf{eq}}=0$ where only densification develops.\nThe third model (see Fig. \\ref{fig:models} (c)) is a slight modification of a recent model proposed in Ref. \\cite{Keryvin2014a}. \nIt is a sequential model, where the plastic flow is non associated (the direction of ${\\oalign{${\\dot{\\epsilon}}$\\crcr\\hidewidth$\\scriptscriptstyle\\sim$\\hidewidth}}^p$ is not normal to the yield surface).  \nThe initial linear yield surface is represented in red. \nIt is modified by the increase in pressure upon densification up to the saturation in densification (represented in blue). \nIn between these two yield surfaces, only pure densification develops.\nAfter saturation, the behaviour is again elastic till reaching the green yield locus, corresponding to a von Mises material, therefore developing only shear (isochoric) plastic strains.\n\nThe different constitutive equations have been implemented in the FEM software Abaqus\\textsuperscript{TM} (Simulia, France) using a UMAT subroutine.\nThese implementations have been tested and validated with the material parameters and the exact simulation conditions described in Refs \\cite{Keryvin2014b,Xin2000,Kermouche2008,Keryvin2014a}.\nThe only new material parameter is for the shear yield strength, \\textsf{k}, for the third model.\nThe material and geometrical non linearities are taken into account using a finite strain framework.\n\n\n\\subsection{Finite element analyses}\n\n\nFEM simulations of the indentation process were performed using a two-dimensional axisymmetric model with a sample and an indenter.\nThe sample is decomposed into a core zone, underneath the indenter tip, where the mesh is fine, and a shell zone where the mesh is coarse.\nThe core zone is itself decomposed into a square zone with 32x32 square elements and a outer zone with quadrangle elements (32 again along the axis $z=0$). \nThe shell zone is decomposed into a transition zone and a outer zone, both with quadrangle elements.\n\n\nAll elements are linear. \nThe dimensions of the mesh are chosen to minimize the effect of the far-field boundary conditions. \nThis is made by using a sufficient number of outer elements in the shell zone. \nThe typical ratio of the maximum contact radius and the sample size is about $2\\times10^3$.\nThe indenter is considered as a perfect cone exhibiting an half-angle $\\Psi = 70.29^o$ to match the theoretical projected area function of the modified Berkovich indenter. \nIts mesh is the same as that of the sample with a geometrical transformation accounting for the geometry of the indenter.\nThe indenter material is assumed to be isotropic, linear elastic (Poisson's ratio of 0.07 and Young's modulus of 1100 GPa). \nThe contact between the indenter and the sample's surface is strict (Signorini conditions) and taken as frictionless. \nThe contact zone will take place along the square elements of the core zone.\nThe boundary conditions consist of a null radial displacement along the vertical axis for both the sample and the indenter and a null displacement on the outer nodes of the sample.\nThe displacement of the indenter, $\\delta$ (taken as positive), is controlled and the force on the indenter, $P$, is recorded. \nThe experimental maximum displacement of the 10 mN experiment is used.\nThe problem is solved using the commercial software ABAQUS\\textsuperscript{TM} (version 6.10). \nThe pre- and post-processing tasks were made with Abapy \\cite{Charleux2015}.\n\n\n\\section{Numerical results}\n\n\nThe force-displacement curves $P$--$\\delta$ for the three models are shown in Figure \\ref{fig:Ph} along with the experimental results.\nThe latter have been shifted to the right by $\\Delta \\delta$ = 20 nm, the truncated length, to account for the blunted indenter (see Section \\ref{sec:mat}).\nIn other words, it gives the mechanical response of the experimental data had the indenter been perfect (for depths greater than 2-3 $\\Delta \\delta$).\nOverall, the numerical results of all models show very close agreement with the experimental data, although the model of Lambropoulos {\\em et al.}\\ does not match exactly the experimental curve.\nThis is in contrast with the results from Ref. \\cite{Xin2000} and is explained by the 20 nm shift of the data.\nFor the model of Kermouche {\\em et al.}, there is a close match with the experimental data and it does not suffer from the 20 nm shift since, in their work, high indentation loads ($\\delta_m$ = 2 $\\mu$m) were used for parameter identification so that this shift does not play a crucial role (for the first model, $\\delta_m$ = 500 nm).\nFor the final model, the fit to the data is also is very close. It was made for a shear yield strength (see Fig. \\ref{fig:models}) \\textsf{k}= 6.5 GPa to approximatively match the curve, and we did not try to make the comparison more precise.\n\nThe densification field underneath the indentation imprint, after unloading, is shown for all models in Figures \\ref{fig:Print-Lamb} to \\ref{fig:Print-Kery}.\nThe densification levels are presented with a non linear scale from 0 (no densification) to 21.6\\% (saturation in densification).\nTwo colors (blue and light brown) indicate no densification or values above the saturation level, respectively.\nThe latter can be due to the model that does not account for saturation (Fig. \\ref{fig:Print-Lamb} and \\ref{fig:Print-Kerm}), extrapolation from integration points to nodes or heavily distorted elements.\nIn the following, we take the isovalue of 0.1 \\% in densification as the boundary of the densification zone.\nThe model of Lambropoulos {\\em et al.}\\ describes a densification zone that extends up to $\\sim$ 0.9 $\\delta_m$.\nIt is not an homogeneous zone since the model does not account for saturation in densification.\nThe extrapolated values at nodes, heavily distorted elements underneath the indenter tip gave unrealistic maximum densification values of more than 100\\%.\nThe model of Kermouche {\\em et al.}\\ describes a densification zone that extends up to $\\sim$ 2.1 $\\delta_m$. \nInside this zone the densification is not homogeneous and  there is a smooth gradient from underneath the indenter tip to the non-densified zone.\nWhile this model does not account for the saturation in densification, it has a negligible impact on the densification fields (only two elements have densification values above the experimental value).\nIn contrast, the sequential model reveals the existence of a very homogeneous densified zone (due to extrapolation at nodes the maximum densification value is found to be 21.68\\%, slightly above than the maximum densification ratio of 21.6\\%.)\nMoreover, there is a sharp transition from the fully densified to non-densified zones at $\\sim$ 1.6-1.8 $\\delta_m$ along the vertical axis.\nThese ratios for all models are presented in Table \\ref{tab:ratios} along with experimental results from both the literature and the present study. \n\n\n\n \\section{Discussion}\n\n\\label{sec:discussion}\n\nThe three selected constitutive models are shown to reproduce accurately the mechanical response of the indentation test, {\\em i.e.} the force--displacement curve, although there are significant differences between models.\nIn other words, matching the experimental $P$-$\\delta$ is necessary but not sufficient.\nThis known fact has led researchers to compare their simulation results with enlarged experimental databases in silica glass.\nIn particular, Perriot {\\em et al.}\\ \\cite{Perriot2006}  used Raman micro-spectrometry ($P_m$ = 20 N, $\\delta_m$ =14.5 $\\mu$m, 5 $\\mu$m mapping-spacing) to determine a size of the densified zone of $\\sim$1.65 w.r.t. to $\\delta_m$ (isoline at 2\\% densification), which is very consistent with the present results (see Table \\ref{tab:ratios}).\nIt is pertinent to note that only 4-5 measurement points were reported close to and along the $z$-axis in the densified zone. Hence, it is difficult to make definitive conclusions about both the homogeneity of the densified zone and the transition between the densified  and the non-densified zones ($\\sim$ 1 in terms of $\\delta_m$ was reported) for comparing with our experimental results.\n\n\nThe model of Lambropoulos {\\em et al.}\\ \\cite{Lambropoulos1996} clearly does not reproduce the experimental observations underneath the imprint in terms of the size of the densification zone.\nThe model of Kermouche {\\em et al.}\\ \\cite{Kermouche2008} predicts a much larger densification zone size compared with our experimental results, and the actual densification zone of the model shows smooth gradients in permanent volume changes.\nIt is worth noting that we have also tested this model with a modification taking into account the salient features of pressure-induced densification \\cite{Keryvin2014b}.\nWhile slightly modifying the $P$-$\\delta$ curve it also predicts a densification zone with smooth gradients but with a larger size ($\\sim$ 2.3 $\\delta_m$).\nThe last model (referred to as sequential) predicts a very homogeneous densification zone with a sharp transition between $\\sim$ 1.6-1.8 $\\delta_m$.\n\nAs seen in Fig. \\ref{fig:models} c, the sequential model favors mostly the contribution of the densification process as the principal cause for the indentation imprint in silica glass.\nThis in total agreement with previous indentation studies indicating that silica glass deforms mostly (if not only) by densification, whereas silicate glasses deform by both densification and shear flow \\cite{Ernsberger1968,Peter1970,Kurkjian1995a,Yoshida2005} for indenters like Vickers or Berkovich.\nThe sequential model can also account for recent experimental results on micro-pillars where a compressive yield strength of $\\sim$ 7 GPa was extracted \\cite{Lacroix2012}. \nIndeed, the model predicts $\\sim$ 8 GPa.\n\n\nOther numerical methods have also been recently used to simulate the indentation process in silica glass.\nA DEM study accounting for the sole pressure-induced densification was reported \\cite{Jebahi2013}.\nIt describes a huge densification zone ($\\sim$ 10 $\\delta_m$) with very smooth densification gradients) and clearly requires the consideration of shear into the permanent deformation mechanisms, as pointed out by the authors.\nMD simulations have also been carried out \\cite{Kilymis2013a,Yuan2014} employing different modifications of the BKS pair potential, as well as different indenter geometries.\nFor the former (3D Vickers indentation), it is rather difficult, from the data presented, to conclude on a homogeneous densification zone and on its size.\nMeanwhile, the authors state that the process zone is smaller than 80 \\AA\\ ($\\delta_m\\sim 32$ \\AA) giving a boundary smaller than a ratio of  2.5.\nFor the latter, 2D indentation simulations were carried out with very sharp wedges (60\\textdegree and 90\\textdegree). \nThe densification zone looks very homogeneous with a sharp transition between this zone and the non-densified one.\nDue to the huge difference in tip geometry, one cannot compare the densification zone with the experimental results described in this paper.\n\nFor pressure levels lower than 25 GPa, the permanent deformation mechanisms seem to have been correctly assessed \\cite{Keryvin2014b} under pure hydrostatic conditions, but the critical role of shear is far from being elucidated in other situations.\nFrom the different models presented in this paper (see Fig. \\ref{fig:models}), it is obvious that the interplay between the driving forces (shear, pressure) and the dissipative mechanisms (isochoric plastic strains and densification) can be described very differently.\nThere is therefore a strong need of experimental evidence for loading paths (in the shear-pressure plane) for discriminating among models.\nThe recent work on micro-pillars \\cite{Lacroix2012} is a good example, but the now classical instrumented indentation technique is still heavily employed.\nIndeed, the multi-axial and heterogeneous stress fields underneath the indenter tip generate different loading paths, which provides a wealth of information.\nThe development of this chemical dissolution technique is therefore a major contributor for increasing the experimental database to discriminate among models, whether they are constitutive equations, DEM or MD simulations \\cite{Mantisi2012}.\n\n\n\n\n\n\\section{Concluding remarks}\n\nA chemical dissolution technique was employed to investigate the densification process underneath an indentation imprint in silica glass.\nIt relies on an higher dissolution rate for densified areas w.r.t. non densified ones.\nThis technique allows one to extract high spatial resolution information, even for low-loads indentation tests carried out to avoid the onset of spurious cracking events, in contrast to micro-spectroscopy techniques including Raman and Brillouin.\nTaking into account the self similarity of the sharp indentation process made it possible to considerably extend the soundness of preliminary results \\cite{Niu2012}.\nIt is found that the densification zone is very homogeneous (in terms of densification levels) along the vertical axis and extends up to $\\sim$ 1.9 the maximum indentation depth with steep densification gradients between this zone and the non-densified one.\n\nThese new experimental data have been used for discussing the results of existing numerical simulations of the indentation process in silica glass, including Molecular Dynamics, Discrete Element Modeling and Finite Element Modeling.\nIn particular, selected constitutive equations for silica glass from the literature have been used and the results of numerical simulations show some of their positive aspects as well as some shortcomings.\nNevertheless, a constitutive model able to correctly address the experimental findings of this paper, favors the densification process as the main one responsible for the creation of an imprint under Vickers or Berkovich indentation tests, in agreement with many previous experimental studies.\n\nFurther developments including the reconstruction of the densified zone in three dimensions, and particularly the transition region, are currently under progress to pave the way for advanced modeling of the mechanical response of amorphous silica to surface damage, as well as of silicate glasses.\n\n\n\n\n\n\n\n\n\\section*{Acknowledgements}\nVK would like to thank financial support from University of South-Brittany (CRCT) and University of New South-Wales for a sabbatical leave, as well as discussions with Dr. P. Pilvin. JPG would like to thank the ANR for supporting a part of this work through the grant ANR-07-JCJC-037 as well as the Ministry of higher education for the PhD grant of KH.\n\n\n\n\\section*{References}\n\n\\bibliographystyle{ActaMatNew}\n\\bibliography{./Publi_AM_2015}\n\n\n\n\n\n\n\n\n\\clearpage\n\\begin{table} [ht]\n \\centering\n \\begin{tabular}{ccccccc} \n  \\hhline{=======}\n  \\ \\\\\n  $\\delta_f^*$ [nm] &\n  $\\delta_m^*$ [nm] &\n  $t^*_D$ [h]  &\n  $h^*_D$ [nm]  &\n  $V_0\\times t_D^*$ [nm]  &\n  $p^*_D$ [nm]  &\n  $|p^*_D|/\\delta^*_m$ [-] \\\\\n  \\ \\\\\n  \\hline\n  \\ \\\\\n  $151 \\pm3$ & $286 \\pm 2$ & $5.9 \\substack{+0.8\\\\-0.7} $ & $-257 \\pm 5 $ & $-282\\substack{+51\\\\-42} $ & $-539\\substack{+56\\\\-47}$ &$1.88 \\substack{+0.22\\\\-0.15} $\\\\\n  \\ \\\\\n  \\hhline{=======}\n \\end{tabular}\n \\caption {Experimental parameters for indentation and dissolution processes. $\\delta_f$ and $\\delta_m$ are the residual and maximum indentation displacements respectively. $t_D$ is the time required to dissolve the densification zone underneath the imprint. $h_D$ is the size of the densification zone w.r.t. the dissolved surface and $\\delta_f$. $V_0 \\times t_D$ is the depth dissolved at the free surface far from the imprint. $p_d$ is the depth of the densification zone boundary w.r.t. the initial free surface prior to indentation. The superscript $^*$ stands for data obtained with 10 mN used as the reference load. For another load, $P_m$, any parameter (except the last ratio) can be found by applying the re-scaling factor $\\sqrt{\\frac{P\\, \\text{[mN]}} {10\\, \\text{mN}} } $}\n \\label{tab:results}\n\\end{table}\n\n\n\\clearpage\n\n\\begin{sidewaystable} \n \\centering\n \\begin{tabular}{cccccc} \n  \\hhline{======}\n  \\ \\\\\n   & \\multicolumn{2}{c}{Experiments} &  \\multicolumn{3}{c}{Numerical simulations (this study)}\\\\\n   & Raman \\cite{Perriot2006} & This study & Lambropoulos {\\em et al.} & Kermouche {\\em et al.} & Sequential model \\\\\n  \\ \\\\\n  \\hline\n  \\ \\\\\n  $|p^*_D|/\\delta^*_m$ [-] & $\\sim$1.65 & $\\sim$1.88 & $\\sim$ 0.9 & $\\sim$ 2.1 & $\\sim$ 1.8 \\\\\n  \\ \\\\\n  \\hhline{======}\n \\end{tabular}\n \\caption {Comparison between experiments and numerical simulations in terms of the ratio $|p^*_D|/\\delta^*_m$, depth of the densified zone boundary along the vertical axis to the maximum displacement at full load during the indentation process. The Raman value corresponds to the 2\\% isoline in densification and therefore is an underestimation for $p^*_D$.}\n \\label{tab:ratios}\n\\end{sidewaystable}\n\n\n\n\n\n\n\n\\clearpage\n\\begin {figure}[ht]\n\t\\centering\n\t\t\\includegraphics[width=\\textwidth]{Ph_C.pdf}\n\t\\caption{Evolution of the square root of the force versus the indentation depth during the loading stage of a 10 mN indentation test on the silica glass. A linear fit for depths higher than 200 nm (for which we are in the similitude regime) is extrapolated down to the x-axis to give the tip defect in terms of a truncated length $\\Delta\\delta $ $\\sim$ 20 nm. The positions of the lower loads tested are also indicated for discussing the effect of the imperfect tip in Section \\ref{sec:xpres}.}\n\t\\label{fig:disp}\n\\end{figure}\n\n\n\\clearpage\n\\begin {figure}[ht]\n \\centering\n  \\includegraphics[width=\\textwidth]{dissolution_schema_v2.pdf}\n  \\caption{Schematic of the dissolution process. The pristine sample exhibits a flat surface. The dissolution rate is homogeneous and its value is noted $V_0$ and associated with the blue color. \\textbf{(a)} A sharp indentation test is performed on the surface leaving a residual imprint with a depth $\\delta_f$. The dissolution rate is locally increased in the densified zone. The maximum value is represented in red. At this moment noted $t=0$, the dissolution process is started. \\textbf{(b)} The dissolution rate being higher at the bottom of the imprint, its apparent depth $h_d = z_{B} - z_{A}$ is increased during this first stage (this situation corresponds to dissolution steps till the bottom of the densified zone is reached). \\textbf{(c)} When the dissolution of the densification zone is completed, the dissolution rate becomes homogeneous again and the apparent depth of the imprint $h_d = z_{B} - z_{A}$ stops changing. \\textbf{(d)} Changes with time of $z_A$, $z_B$, $h_d$ (measured by AFM) for situations (a) to (c).}\n  \\label{fig:schema}\n\\end{figure}\n\n\n\\clearpage\n\\begin {figure}[ht]\n\t\\centering\n\t\t\\includegraphics[width=\\textwidth]{Dissolution.pdf}\n\t\\caption{Evolution of the residual imprint depth, the so-called dissolution depth $h_d$ as defined in Eq. \\eqref{eq:depth}, during dissolution for a given indentation maximum load (P$_m$) as a function of dissolution time. All values are mean values on 3 to 5 imprints and the error bars size is lower than that of the markers.}\n\t\\label{fig:dissolution}\n\\end{figure}\n\n\n\n\\clearpage\n\\begin {figure}[ht]\n\t\\centering\n\t\\includegraphics[width=\\textwidth]{Dissolution_rescaled.pdf}\n\\caption{Evolution of $h^*_d (t)$ the rescaled dissolution depth from Eq. \\eqref{eq:dim_an_4}, for a given maximum indentation load ($P_m$), as a function of the rescaled dissolution time $t^*$ from Eq. \\eqref{eq:dim_an_4} using $P_m$ = 10 mN as the reference load (labelled 'Ref.'). A linear fit is made for the first region (labelled as 'I') and a constant one for the second (labelled as 'II'). The shaded regions correspond to  confidence intervals within one standard deviation of their respective fits.}\n\\label{fig:pgs}\n\\end{figure}\n\n\n\n\n\\clearpage\n\\begin{figure}[ht]\n \\centering\n  \\includegraphics[width=.5\\textwidth]{models2.pdf}\n \\caption{Description of the different constitutive models in the shear ($\\tau_{\\textsf{eq}}$) - pressure (P) plane.\n  The direction of the plastic strain rate, \n  \n  is also superimposed in the isochoric plastic strain rate ($\\dot{\\gamma}^p_{\\textsf{eq}}$) vs densification rate ($\\dot{\\xi}^p$) plane and represented by arrows (see text for details). \n  Model (a) is Lambropoulos {\\em et al.}\\ model (associated flow rule). Model (b) is Kermouche {\\em et al.}\\ model (associated flow rule). Model (c) is the sequential model, where the plastic flow is non associated: the direction of the plastic strain rate is not normal to the yield surface.  The initial yield surface is represented in red while the saturated one is represented in blue. After saturation, the behaviour is again elastic till reaching the green yield locus, corresponding to a \\textsf{VM} model.}\n \\label{fig:models}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}[ht]\n \\centering\n  \\includegraphics[width=\\textwidth]{Ph_SiO2.pdf}\n \\caption{Comparison of the mechanical response of the indentation test on SiO$_2$ between experiment and three selected constitutive models. The experimental curve has been shifted to the right by 14 nm to account for the truncated indenter. The number of markers for the simulation plots has been reduced for clarity.}\n\\label{fig:Ph}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}[ht]\n \\centering\n  \\includegraphics[width=\\textwidth]{Print_Lambropoulos.pdf}\n \\caption{Densification field underneath the imprint with the model of Lambropoulos {\\em et al.}. Dark blue zones are not densified and light brown ones are above the experimental saturation value. The scale is non linear to highlight the isolines at 1 \\permil\\ and 1 \\%. The densification is not homogeneous in the zone above 21.6\\% and reach unphysical values of more than 100\\%.}\n\\label{fig:Print-Lamb}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}[ht]\n \\centering\n  \\includegraphics[width=\\textwidth]{Print_kermouche.pdf}\n \\caption{Densification field underneath the imprint with the model of Kermouche {\\em et al.}. Dark blue zones are not densified and light brown ones are above the experimental saturation value. The scale is non linear to highlight the isolines at 1 \\permil\\ and 1 \\%.}\n\\label{fig:Print-Kerm}\n\\end{figure}\n\n\\clearpage\n\\begin{figure}[ht]\n \\centering\n  \\includegraphics[width=\\textwidth]{Print_Keryvin.pdf}\n \\caption{Densification field underneath the imprint with the sequential model used in this study. Dark blue zones are not densified and light brown ones are above the experimental saturation value. The scale is non linear to highlight the isolines at 1 \\permil\\ and 1 \\%.}\n\\label{fig:Print-Kery}\n\\end{figure}\n\n\n\n\n\n", "itemtype": "equation", "pos": 18119, "prevtext": "\n\nTherefore, we define an equivalent dissolution time, $t^*$, and an equivalent dissolution depth, $h_d^*$, to retrieve the information of the reference test \"1\" thanks to the information of the other test \"2\".\nThey are thus calculated as:\n\n\n\n \n\n", "index": 13, "text": "\\begin{equation}\n h_d^* = h_{d,1}(t_1)= \\sqrt \\frac{P_{m,1}}{P_{m,2}} \\, h_{d,2}\\left(t^* = t_2\\sqrt \\frac{P_{m,1}}{P_{m,2}}\\right)  \n\\label{eq:dim_an_4} \n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"h_{d}^{*}=h_{d,1}(t_{1})=\\sqrt{\\frac{P_{m,1}}{P_{m,2}}}\\,h_{d,2}\\left(t^{*}=t_%&#10;{2}\\sqrt{\\frac{P_{m,1}}{P_{m,2}}}\\right)\" display=\"block\"><mrow><msubsup><mi>h</mi><mi>d</mi><mo>*</mo></msubsup><mo>=</mo><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>1</mn></mrow></msub><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><msqrt><mfrac><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub></mfrac></msqrt></mpadded><msub><mi>h</mi><mrow><mi>d</mi><mo>,</mo><mn>2</mn></mrow></msub><mrow><mo>(</mo><msup><mi>t</mi><mo>*</mo></msup><mo>=</mo><msub><mi>t</mi><mn>2</mn></msub><msqrt><mfrac><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>1</mn></mrow></msub><msub><mi>P</mi><mrow><mi>m</mi><mo>,</mo><mn>2</mn></mrow></msub></mfrac></msqrt><mo>)</mo></mrow></mrow></math>", "type": "latex"}]