[{"file": "1601.04235.tex", "nexttext": "\nFor $z=0$ there is a strong correlation since $\\Delta \\mu(z)\\simeq 0$, but at $z=1.5$ the correlation is much weaker $\\Delta \\mu \\sim 0.7$.\nWe conclude that if QNe-Ia represent an important  fraction of the SNe used in the work which  estimates the accelerating expansion of the Universe\\cite{perlmutter99,riess98}, this may have drastically altered the statistics and conclusions  of those studies \\cite{ouyed14}.  It is thus vital to differentiate between QNe-Ia and standard SNe-Ia.\nApplying our correction above to the Union2.1 data\\cite{union2.1} we obtain the true distance moduli of the observed SNe-Ia (if they are indeed QNe-Ia) as shown by red crosses in \\cite[Figure 6]{ouyed14}.    This  demonstrates how the SNe-Ia distance moduli, when corrected, lay very close to the $\\Omega_{M} =1$, $\\Omega_{\\Lambda} = 0$ curve.\n\n\nA QN-Ia may have  already  been observed in SN 2014J \\cite{ouyed15sn2014j}. \nSN 2014J's  $^{56}\\mathrm{Ni}$ mass was estimated to be $\\sim0.36~{\\rm M_\\odot}$ \\cite{churazov14}, based on $^{56}\\mathrm{Co}$ decay lines.\nHowever, based on the peak luminosity, $\\mathrm{M_{Ni}} \\sim 0.77~{\\rm M_\\odot}$ is expected.\n In the QN-Ia model, the discrepancy can be accounted for by the  QS spin-down power.\n Perhaps the best prospect for observationally distinguishing a QN-Ia from a SN-Ia is\n the detection of  the gravitational wave signal  produced during the explosive transition of the NS to a QS. If the QN is asymmetric, it should emit a gravitational wave signal that could be observable by Advanced LIGO\\cite{staff12}. This would be followed by another signal from the exploding WD; here the  time delay between the QN and the exploding WD   is the time it takes the QN ejecta to reach the \ndisrupted WD plus the burning time of the WD.\nOther types of Type Ia SNe (i.e. single or double degenerate scenarios) would  lack such a dual signal.\n Another strong observational signature  of a QN-Ia is high-energy emission (specifically X-ray signatures\\cite{ouyed07a,ouyed07b}) from the QS which would be\nimpossible in standard SNe-Ia channels. The QS, being an aligned rotator, would  be  radio quiet \\cite{ouyed06}. These\nsignature may be observed in the near future in SN 2014J.\n\n\n\n\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=3in]{assassin.pdf}\n\\caption{A QN occurring inside the second, hydrogen-poor,  CE  of a massive binary: The first hump results from the ejection and energization of the He-rich CE  ($M_{\\rm CE}=5M_{\\odot}; R_{\\rm CE}=3000R_{\\odot}$) by the QN. The second  hump is from the BH-accretion \nphase after the QS merges with the CO core.  The circles show u-band observations of\n the  SLSN ASASSN-15lh\\cite{dong2016}.}\n\\label{aba:fig1}\n\\end{figure}\n\n\n\n\n\\section{Quark Novae in Massive Binaries : a model for SLSNe Ia}\n\n QNe are likely to occur in binaries experiencing CE phases where the NS\ncan accrete enough mass to reach $M_{\\rm NS, c.}$. In particular, in massive binaries experiencing\ntwo CE phases, the NS would have access to two mass reservoirs\\cite{ouyed15,ouyed16}.\n In this picture, the NS would have evolved earlier from its more massive progenitor and is companion to\n the second star during its CE phase.\n\nWhen the \n system  enters the CE phase (in which the hydrogen envelope is  ejected), it leaves behind a close binary consisting of the NS and the giant star's He core. At this point the He-core has a mass of a few $M_{\\odot}$ and an orbital separation of $\\sim 3~{\\rm R_\\odot}$ (\\cite[Figure 1]{ouyed15}).\nDuring this phase, the NS  accretes up to $\\sim0.1~{\\rm M_\\odot}$  and relies on the second CE to grow in mass.\nThe He core then expands causing a  second He-rich CE phase.\nSufficient mass is accreted onto the NS during this second CE and the NS reaches\n$M_{\\rm NS, c.}$ and undergoes a QN explosion inside the expanded Hydrogen-poor envelope.\nThe QN ejecta shocks and unbinds the  CE providing a \n bright, short-lived hump matching those observed in double-humped  SLSNe\\cite{ouyed15,ouyed16}.\n\nFollowing the QN, the remaining system consists of a QS and the CO core (of mass $M_{\\rm CO}$) of the He star.  Orbital decay\nlead to a merger a few days to a few weeks following the QN event.\nThe QS then rapidly accretes from the CO core leading to the  collapse of the QS into a  Black Hole (BH).\nThe remainder of the CO core  is subsequently accreted by the BH.\nThe accretion luminosity powers the long lasting main hump of the double-humped SLSN.\n Figure 1 shows our fit to the recently discovered SLSN ASASSN-15lh\\cite{dong2016}. We fit it with a CE mass and radius of $5M_{\\odot}, 3000R_{\\odot}$, respectively. The BH-accretion\nparameters are $2\\times 10^{46}$ erg s$^{-1}$ for the initial accretion luminosity with an injection\npower in time $\\propto t^{-1.5}$. The time delay between the QN event and the\nonset of BH-accretion  is 20 days.  These parameters are similar to those\n we used to fit a number of hydrogen-poor SLSNe\\cite{ouyed16}  (\\cite[Table 2]{ouyed16}  and \\cite[Figure 2]{ouyed16}). Our model can also fit double-peaked SLSNe showing late-time emission (e.g.\niPTF13ehe and LSQ14bdq) which we modelled as the  collision between the He-rich CE (ejected by the QN) and the hydrogen-rich (i.e. first) CE ejected during the firts CE phase (\\cite[Figure 1]{ouyed16}).  The available accretion energy $\\eta_{\\rm BH}M_{\\rm CO}c^2$ ($\\eta_{\\rm BH}$ is the BH-accretion efficiency) is enough to account for the \n extreme radiation released during the long-lasting hump in SLSNe.\nThe QN is key to our model since besides accounting for the first peak, \nit also ejects the second CE at speeds of a  few $10,000$ km s$^{-1}$ which ensures a\nvery efficient harnessing of the BH-accretion input power by the very\nlarge envelope a few days to a few weeks following the QN event.  The QN deposits its momentum and\nenergy impulsively in the CE which makes our model fundamentally different from those\ninvolving spin-down power where the energy is deposited gradually.\n\n\n\n\\section{Summary}\n\nQNe should be  common in binaries   where\n accretion onto the NS from a companion (i.e. the disrupted WD in LMXBs) or during a CE phase \n (i.e. during  massive binaries evolution)  can drive the NS above the critical\n mass, $M_{\\rm NS, c.}$, triggering the QN.  The ability of the QN model in binaries to fit SLSNe in general (see http://www.quarknova.ca/LCGallery.html) and in particular a number of double-humped  SLSNe Ia, suggests that QNe may be an\n important component of  massive binary evolution and may even be responsible for  CE ejection. \n The QN-Ia  model has two main interesting features:  First, the detonation of the WD in the QN-Ia scenario is explained by standard shock physics governing the interaction of the QN ejecta and the WD.  Secondly, the QN-Ia provides an elegant explanation for the correlation between peak magnitude and light-curve shape through the contribution of spin-down energy to the  light-curve.  Our model  can be tested by further work including  simulations of \n QNe in binary evolution.\n \n Our model relies on the feasibility of the QN explosion which requires sophisticated simulations of the burning of a NS to a QS which are being pursued. Preliminary simulations with consistent treatment of nuclear and neutrino reactions,  particle diffusion and hydrodynamics show instabilities which  could lead to a detonation\\cite{niebergal}.\tWe also propose  that a ``core-collapse\" QN could  result from the collapse of the quark matter core\\cite{ouyed13b} which provides another avenue for the explosion. \n\n\\section*{Acknowledgments}\n\nThe research of RO, DL and NK is funded by the Natural Sciences and Engineering Research Council of Canada.\nJ.E.S is funded by the University of Florida Theoretical Astrophysics Fellowship.\n\n\\begin{thebibliography}{90}\n\\bibitem{bodmer71} A. R. Bodmer, {\\em PhRvD}, {\\bf 4}, 1601, (1971)\n\\bibitem{witten84} E. Witten, {\\em PhRvD}, {\\bf 30}, 272, (1984)\n\\bibitem{ouyed2002} R. Ouyed, J. Dey and M. Dey, {\\em A\\&A}, {\\bf 390}, 39, (2002)\n\\bibitem{keranen}  P. Ker{\\\"a}nen, R.,  Ouyed and P. Jaikumar, {\\em ApJ}, {\\bf 618}, 485 (2005)\n\\bibitem{vogt}  C. Vogt, R., Rapp and R. Ouyed, {\\em Nuclear Physics A}, {\\bf 735}, 543 (2004)\n\\bibitem{niebergal}  B. Niebergal, R. Ouyed and P.  Jaikumar, {\\rm PhRvC}, {\\bf 82}, 062801 (2010)\n\\bibitem{ouyed13b} R. Ouyed, B. Niebergal and P. Jaikumar,   ``Explosive Combustion of a Neutron Star into a Quark Star: the non-premixed scenario\" in proceedings of Compact Stars in the QCD phase diagram (CSQCDIII), Eds. L. Paulucci, J. E. Horvath, M. Chiapparini, and R. Negreiros, http://www.slac.stanford.edu/econf/C121212/ [arXiv:1304.8048] (2013)\n\\bibitem{ouyed2009} R. Ouyed, and D. Leahy, D., {\\em ApJ}, {\\bf 696}, 562 (2009)\n\\bibitem{jaikumar}  P. Jaikumar, B. Meyer, B. S. Otsuki, and R.  Ouyed, {\\em A\\&A}, {\\bf 471}, 227 (2007)\n\\bibitem{kostka1}  M. Kostka, N. Koning, Z. Shand, et al., {\\em A\\&A}, {\\bf 568}, A97 (2014)\n\\bibitem{leahy08} D. Leahy and R. Ouyed, {\\em MNRAS}, {\\bf 387}, 1193, (2008)\n\\bibitem{ouyed12} R. Ouyed, M. Kostka, N.  Koning, et al. 2012, {\\em MNRAS}, 423, 1652 (2012)\n\\bibitem{kostka2}  M. Kostka, N., Koning, D.  Leahy, et al., {\\em RevMexAstron.Astrop.}, {\\bf 50}, 167 (2014)\n\\bibitem{ouyed2011}  R. Ouyed, D., Leahy, A.,  Ouyed and P. Jaikumar, {\\em PhRvLett.}, {\\bf 107}, 151103 (2011)\n\\bibitem{ouyedcas}  R. Ouyed, D. Leahy and   N. Koning, {\\em RAA}, {\\bf 15}, 483  (2015)\n\\bibitem{ouyed07a} R. Ouyed, D. Leahy and B. Niebergal, {\\em A\\&A} {\\bf 473}, 357, (2007a)\n\\bibitem{ouyed07b} R. Ouyed, D. Leahy and B. Niebergal, {\\em A\\&A} {\\bf 475}, 63, (2007b)\n\\bibitem{staff07} J. E. Staff, R. Ouyed and M. Bagchi, M.\\ 2007, {\\em ApJ}, {\\bf 667}, 340 (2007)\n\\bibitem{ouyed13} R. Ouyed and J. E. Staff, {\\em RAA}, {\\bf 13}, 435, (2013)\n\\bibitem{ouyed14} R. Ouyed, N. Koning, D. Leahy, et al., {\\em RAA}, {\\bf 14}, 497, (2014)\n\\bibitem{guy07} J. Guy et al., {\\em A\\&A}, {\\bf 466}, 11, (2007)\n\\bibitem{perlmutter99} S. Perlmutter, et al. {\\em ApJ}, {\\bf 517}, 565, (1999)\n\\bibitem{riess98} A. G. Riess, et al., {\\em AJ}, {\\bf 116}, 1009, (1998)\n\\bibitem{union2.1}  N. Suzuki, D., Rubin, C., Lidman, et al. {\\em ApJ}, {\\bf 746}, 85 (2012)\n\\bibitem{ouyed15sn2014j} R. Ouyed, D. Leahy, N. Koning and J. E. Staff, {\\em ApJ}, {\\bf 801}, 64, (2015) \n\\bibitem{churazov14} E. Churazov et al., {\\em Nature}, {\\bf 512}, 406, (2014)\n\\bibitem{staff12} J. E. Staff, P. Jaikumar, V. Chan and R. Ouyed, {\\em ApJ}, {bf 751}, 24, (2012)\n\\bibitem{ouyed06} R. Ouyed, B. Niebergal, W. Dobler and D. Leahy, {\\em ApJ}, {\\bf 653} 558 (2006)\n\\bibitem{ouyed15} R. Ouyed, D. Leahy and N. Koning, {\\em MNRAS}, {\\bf 454}, 2353, (2015)\n\\bibitem{ouyed16} R. Ouyed, D. Leahy and N. Koning, {\\em ApJ}, in press (2016), http://arxiv.org/abs/1510.06135\n\\bibitem{dong2016} S. Dong, B. J. Shappee, J. L.  Prieto,  et al.\\  Science Magazine, {\\em 351}, issue 6270, {\\bf 257} (2016)\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 8277, "prevtext": "\n\n\\title{Quark-Noave in binaries: \\\\ Observational signatures and implications to astrophysics}\n\\author{Rachid Ouyed$^*$, Denis Leahy, Nico Koning}\n\n\\address{Department of Physics and Astronomy, University of Calgary,\\\\\n834 Campus Place N.W., Calgary, AB, Canada, T2N 1N4\\\\\n$^*$E-mail: rouyed@ucalgary.ca\\\\ \n\n}\n\n\\author{Jan E. Staff}\n\n\\address{Department of Astronomy, University of Florida,\\\\\nP.O. Box 112055, Gainesville, FL, 32611-2055, USA}\n\n\n\\begin{abstract}\nThe explosive transition of a massive neutron star to a quark star (the Quark-Nova; QN) releases \nin excess of $\\sim 10^{52}$ erg in kinetic energy  which \n can drastically impact the surrounding environment of the \nQN. A QN is triggered when a neutron star gains\n enough mass to reach the critical value for quark deconfinement to happen in the core.\nIn binaries,\n a neutron star has access to mass reservoirs (e.g.  accretion from a companion or from  a Common Envelope; CE).\n We explain observed light-curves of  hydrogen-poor superluminous\nSupernovae (SLSNe Ia) in the context of a QN occurring in the second CE phase of a massive binary. In particular this model  gives good fits to  light-curves of SLSNe  with double-humped light-curves.  Our model suggests the QN as a mechanism for  CE ejection  and that they be taken into account during binary evolution.\n  In  a short period binary with a  white dwarf companion,   the neutron star can quickly grow in mass and experience a QN event. Part of the QN ejecta   collides with the white dwarf; shocking, compressing; and heating it to driving  a thermonuclear runaway    producing a SN Ia impostor (a QN-Ia). \nUnlike ``normal'' Type Ia supernovae where no compact remnant is formed, a QN-Ia produces a  quark star \nundergoing rapid spin-down providing additional power  along with the $^{56}$Ni decay energy.\nType Ia SNe are used as standard candles and contamination of this data by QNe-Ia  can infer an\nincorrect cosmology.  \n\\end{abstract}\n\n\\keywords{stars: evolution, supernovae: general, stars: neutron, stars: white dwarfs}\n\n\\bodymatter\n\n\n\n\\section{Introduction}\n\n\n A QN is  the explosive transition of a massive neutron star (NS) to a quark star (QS; the\ncompact remnant). It  ejects the outermost layers of the NS\nas the relativistic QN ejecta with kinetic energy exceeding excess $10^{52}$ erg. The interaction of this ejecta with its surroundings  leads to unique \nphenomena  and has important implications to astrophysics. \n When occurring in binaries, Quark-Novae (QNe) have the potential to transform our view\n of binary evolution and has serious implications \n to both high-energy astrophysics and cosmology. \nAfter a description of the  QN and its energetics  in section 2, we briefly review two cases of QNe in binaries.\nThe first case is a QN-Ia (section 3) which is  a QN going off in a short period binary consisting of (the exploding) NS and a  white dwarf (WD) which is the mass reservoir. The extremely dense relativistic  QN ejecta impacts (shocks, compresses and heats) the WD and triggers the thermonuclear run-away of a traditional Type Ia.\nAlong side the type Ia,  the spinning-down  QS provides an additional\npower source which ``tampers\" with   the energy budget. In the second case,  we  show that a QN occurring in a massive binary can account for the ``exotic\" light-cuves of  double-humped hydrogen poor SLSNe (section 4).\nWe summarize in section 5.\n\n\\section{Quark Nova : Overview, energetics and dynamics}\n\nWe define $M_{\\rm NS, c.}$ as the  critical mass  for a non-rotating NS to undergo quark deconfinement in its  core. \nThe presence of enough strange quarks in the\ndeconfined core of the NS  then triggers the conversion of\nhadrons (i.e. matter made of {\\it up} and {\\it down} quarks) to the conjectured more stable {\\it (uds)}  matter  (i.e. matter made of free {\\it up}, {\\it down} and {\\it strange} quarks)\\cite{bodmer71,witten84}. In a QN\\cite{ouyed2002}, the {\\it (ud)-to-(uds)} conversion front  propagates toward the surface of the NS while harnessing  neutrino\\cite{keranen}, photon\\cite{vogt} and gravitational energy\\cite{niebergal,ouyed13b} possibly  yielding\n  a detonative regime.   Micro-physics driven hydrodynamical simulations of this\nconversion process seem to indicate that a detonation may indeed occur\\cite{niebergal} and when coupled with gravitational collapse may lead to a  universal mechanism\n for the ejection of  the NS outermost layers  ($M_{\\rm QN}\\sim 10^{-3}M_{\\odot}$ of  QN ejecta)\nwith  a universal kinetic energy, $E_{\\rm QN, KE}$, of a few times $10^{52}$ erg (i.e. with an associated Lorentz factor exceeding  $\\Gamma_{\\rm QN}\\sim 10$)\\cite{keranen,ouyed2009}.  Thus the kinetic  energy released in a QN exceeds that  of a  supernova by at least an order of magnitude.  \n\n\n The neutron-rich QN ejecta provides a favorable site for \\mbox{r-process} nucleosynthesis\\cite{jaikumar,kostka1}.  When this ejecta (expanding radially outward from the parent NS)\n collides with the preceding SN ejecta, it re-energizes and re-brightens the SN yielding a superluminous SN\\cite{leahy08}. This double-detonation generates  a superluminous double-peaked light-curve if the\n time-delay between the SN and the QN exceeds a few days. We   account  for the luminosity\\cite{ouyed12},   the photometric/spectroscopic  signatures\\cite{kostka2} as well as introduce nuclear/spallation signatures resulting from the interaction  of the ultra-relativistic  QN ejecta  with the  SN shell and circumstellar material\\cite{ouyed2011}.   For shorter time-delays of less than a day, the QN kinetic energy is lost to PdV work but \n  the collision between the  \\mbox{r-process-rich} QN ejecta with the SN ejecta yields unique nuclear\n signatures which may explain existing observations\\cite{ouyedcas}. The QS shows features\n reminiscent of soft gamma repeaters \\cite{ouyed07a,ouyed07b} while the explosion energetics and variability \n are reminiscent  of   gamma-ray bursts \\cite{staff07}. \n \n When occurring in binaries, the more complex interactions with the companion result in even more interesting\n features.   We review  the \n key signatures and   main  implications to astrophysics in this paper.\n \n \n\n\n\n\\section{Quark Nova Ia : A QN in a low-mass X-ray binary}\n\n We first discuss what happens when a NS in a close binary with a WD companion explodes as a QN.\n  In this scenario, Roche-Lobe overflow disrupts the WD which produces a Carbon-Oxygen (CO) torus surrounding the \n NS \\cite{ouyed13,ouyed14}.  Alternatively, the NS may fully merge with the WD so that the NS now is in the core of the WD when the QN occurs. The QN will be triggered following sufficient mass accretion.\n \n \n \n Some of the relativistic QN ejecta will impact  (shock, heat and compress) the disrupted\n  WD inducing a runaway nuclear burning of the CO\nin an event we termed a QN-Ia since it is   ``Type Ia''-like explosion.  A\n  crucial difference  here however is the  QS which provides extra power through \n  magnetic braking spin-down and   consequently a QN-Ia (which spectrum resembles a Type-Ia SN) is powered by a combination of $^{56}$Ni decay and the spin-down luminosity of the QS. This has drastic consequences\n  for cosmological models  if QNe-Ia contaminate\n the sample of Type Ia SNe used as distance indicators in cosmology as discussed below.\n \n \n\n\n\n\n\\subsection{Implication for cosmology}\n\nThe spin-down contribution yields a {\\it red-shift-dependent Phillips-like relation}\n(\\cite[Figure 1]{ouyed14} shows the correlation between peak absolute magnitude and light-curve shape)  which means that they can confuse (i.e. are {\\it NOT} rejected by the)  light-curve fitters \nused for cosmology (\\cite[Figure 4]{ouyed14}).     \n The rate of QNe-Ia may be a significant fraction of the observed  Type Ia SNe and may  be dominant\nat higher redshift\\cite{ouyed14}.  This is especially egregious given that the QN-Ia light-curve\n varies with redshift.   \n\nTo estimate the effect of contamination, we analyzed hundreds of synthetic QNe-Ia light-curves \nusing   the SALT2 light-curve fitting software\\cite{guy07} to find the difference ($\\Delta \\mu(z)$) between the actual distance modulus and the fitted distance modulus as a function of redshift, $z$. Most of the simulated QNe-Ia were best fitted\\cite{ouyed14} with :\n\n", "index": 1, "text": "\\begin{equation}\n\\Delta \\mu(z) = -1.13655~e^{-0.39035z} + 1.32865\\ .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Delta\\mu(z)=-1.13655~{}e^{-0.39035z}+1.32865\\ .\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mpadded width=\"+3.3pt\"><mn>1.13655</mn></mpadded><mo>⁢</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><mn>0.39035</mn><mo>⁢</mo><mi>z</mi></mrow></mrow></msup></mrow></mrow><mo>+</mo><mpadded width=\"+5pt\"><mn>1.32865</mn></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]