[{"file": "1601.03681.tex", "nexttext": "\n\nTo perform the maximum likelihood fit, we used the\n\\texttt{P8R2\\_SOURCE\\_V6} instrument response functions with the \n\\textit{Fermi} Science Tools version 10-00-05 and the \\texttt{NewMinuit}\nfitting function. In the initial fit, we held all parameters fixed at the\n3FGL catalog values except for the spectral parameters for the target\nsource, and the normalization for sources within 6$\\degr$ of the\ntarget or flagged in the 3FGL catalog as being variable. With the\nexponentially cutoff power-law (ECPL) model, the source is detected\nwith a test statistic (TS) of 228, corresponding to 15 $\\sigma$ \\citep{mattox96}.\nIntegrating the spectral model over the range 100 MeV to 100 GeV yields a\n photon flux of $7.8(2) \\times 10^{-9}$~ph~cm$^{-2}$~s$^{-1}$ and an energy flux\n of $5.0(6) \\times 10^{-12}$~erg~cm$^{-2}$~s$^{-1}$. The photon spectral index is $1.9 \\pm 0.2$\nand the cutoff energy is $5.0 \\pm 2.3$~GeV. Figure~\\ref{fig_gspec2}\nshows the spectral fit. When we fit with a simple power law and integrate over\nthe same energy range, we find a photon flux of $1.04(15) \\times 10^{-8}$~ph~cm$^{-2}$~s$^{-1}$, an energy flux of $6.4(6) \\times 10^{-12}$~erg~cm$^{-2}$~s$^{-1}$, and a spectral index of $2.29 \\pm 0.07$. The ECPL model is weakly preferred with the cutoff detected at a significance of only 1.3 $\\sigma$.\n\nFor the gamma-ray timing analysis, we selected photons from a region\nof radius 2$\\degr$ around the pulsar and assigned weights based on the\nbest-fit spectral model. We compute a pulse phase for each selected\nLAT photon using the \\texttt{fermi} plugin for \\textsc{Tempo2} \\citep{Ray11} and the\nbest-fit radio timing model.  The resulting weighted H-test value was\n18.8, corresponding to a significance of 3.45$\\sigma$, not enough for a\nhigh-confidence claim of a pulsed detection. It is not feasible to extend\nthe span of gamma-ray timing analysis earlier than the start of our radio\ntiming solution due to the significant orbital period variations that are\nthe hallmark of PSR~J1048+2339. However, the H-test value improves\nas the radio timing solution and correspondingly the gamma-ray timing span\nare extended forward with the accumulation of more radio observations. This\nsuggests that a confident detection of gamma-ray pulsations is likely with\n$1-2$ more years of radio timing data and an improved timing model that \nincludes proper motion and possibly higher-order orbital period derivatives. \n\n\\section{No X-ray Detection}\n\nA single {\\em Swift} XRT observation exists of the field in Figure~\\ref{fig_sources}, taken on 2011 January 19 in Photon Counting mode for an exposure of 1.2 ks (ObsID 00041540001).  \nThe mid-time of the exposure falls at $\\phi_{\\rm orb}=0.62$, which is near the maximum in the optical light curves. \nOnly three counts were detected inside a circular radius 47\\asec\\ around the position of PSR~J1048+2339 which is consistent with a non-detection of any X-ray source.\n\nWe derive an absorbed 0.5--3.0~keV 3-$\\sigma$ upper limit of \n$1.3 \\times 10^{-13}$~erg~s$^{-1}$~cm$^{-2}$ for a 0.2~keV blackbody neutron \nstar surface with the estimated Galactic hydrogen column density for the pulsar position, $N_{\\rm H} = 2.3 \\times 10^{20}$~cm$^{-2}$ \\citep{Kalberla05}. For the AGN NVSS~J104900+233821 we derive an upper limit of $1.7 \\times 10^{-13}$~erg~s$^{-1}$~cm$^{-2}$ for an assumed X-ray power-law index of 1.8 and the same  Galactic hydrogen column density. \n\nThe X-ray source 1RXS~J104838.7+234351, also shown\nin Figure~\\ref{fig_sources}, is within the error ellipse of the {\\em Fermi} \nsource 3FGL~J1048.6+2338. Since the position uncertainties for both the X-ray\nsource and PSR~J1048+2339 are much smaller than the distance between\nthe two objects, an association can be ruled out.\n\n\\section{Discussion}\n\n\\subsection{Association with the Gamma-ray Source}\n\nThe sources for our radio search were selected from a preliminary\nversion of the {\\em Fermi} 3FGL catalog \\citep{Cromartie15}. \nIn the final version of this\ncatalog \\citep{3FGL}, the source 3FGL~J1048.6+2338 is\nlisted as associated with the BL Lac active galactic nucleus\nNVSS~J104900+233821. However, the association was made by a\npipeline based on positional proximity and the radio flux \ndensity distribution of NVSS sources. While most pulsars exhibit gamma-ray spectra that can be fitted by a power law with an exponential cutoff, for weaker gamma-ray\nsources the spectrum shape may be ambiguous and be equally well-fitted with a power law, which is typical of AGNs. \nThe discovery of PSR~J1048+2339 well\nwithin the {\\em Fermi} source error ellipse (Figure~\\ref{fig_sources})\nmeans that the AGN association is likely spurious. A secure detection of\ngamma-ray pulsations from this pulsar will confirm the identification with\n3FGL~J1048.6+2338 and allow a search for emission from the NVSS source\nby gating the data to include only the off-pulse phase of the pulsar.\n\n\\subsection{Position, Proper Motion, and Pulsar Energetics}\n\\label{sec:energetics}\n\nThe SDSS and Pan-STARRS optical positions are \n(J2000.0) R.A.$=10^{\\rm h}\\,48^{\\rm m}\\,43^{\\rm s}\\!.4270(5)$, decl.$=+23\\degree\\,39\\amin\\,53\\asec\\!.503(7)$\nat epoch 2005 and\n(J2000.0) R.A.$=10^{\\rm h}\\,48^{\\rm m}\\,43^{\\rm s}\\!.429(3)$, decl.$=+23\\degree\\,39\\amin\\,53\\asec\\!.49(5)$\nat epoch 2011, respectively. While they are consistent within their\nrespective uncertainties, the radio timing position in\nTable~\\ref{tab_pulsars}, with end figures $43^{\\rm s}\\!.4168$(1) and $53\\asec\\!.403(4)$,\nis offset from them by $\\approx200$~mas. \n\nThe PPMXL catalog \\citep{PPMXL} includes the optical counterpart of\nPSR J1048+2339, with components of proper motion $\\mu_\\alpha{\\rm cos}\\,\\delta = -7.8 \\pm\n6.2$~mas~yr$^{-1}$, $\\mu_\\delta = -9.7 \\pm 6.2$~mas~yr$^{-1}$.\nThe APOP catalog of proper motions outside of the\nGalactic plane \\citep{APOP} also has an entry for this object, with\n$\\mu_\\alpha{\\rm cos}\\,\\delta = -18.7 \\pm 3.0$~mas~yr$^{-1}$, $\\mu_\\delta = -9.4 \\pm\n0.7$~mas~yr$^{-1}$.  The discrepancies between these results give some idea\nof the systematic errors involved, since they both derive from the same plate\nmaterial, the Palomar Observatory Sky Survey.\n\n\n\nThe pulsar position, proper motion, and orbital\nperiod derivatives are highly covariant in the timing analysis. \nDespite having two years of\nradio timing data on PSR~J1048+2339, we are still not able to\nconfidently fit for proper motion along with the five orbital period\nderivatives listed in Table~\\ref{tab_pulsars}. This means that any\nactual proper motion is subsumed in the fits for $f_{\\rm\n  orb}^{\\rm(n)}$ and position. The timing solution in\nTable~\\ref{tab_pulsars} uses the APOP proper motion as a fixed parameter and \nresults in the smallest rms residual. However, we are\nalso able to obtain phase-connected timing solutions using several\nalternative sets of free parameters: (1) position, proper motion, and\n$f_{\\rm orb}^{\\rm(1)}$, (2) position, $f_{\\rm orb}^{\\rm(1)}$, and\n$f_{\\rm orb}^{\\rm(2)}$, and (3) position, $f_{\\rm orb}^{\\rm(1)}$,\n$f_{\\rm orb}^{\\rm(2)}$, and $f_{\\rm orb}^{\\rm(3)}$. Based on the\nspread of position fits between these timing solutions, we conclude\nthat the position in the timing solution listed in\nTable~\\ref{tab_pulsars} is consistent with the SDSS and Pan-STARRS\noptical positions within a remaining systematic error of $\\sim\n250$~mas.\n\nThe present-epoch error ellipse for the PPMXL position, taking into account\nthe proper motion uncertainty, encompasses best-fit positions from all\nof our attempted timing solutions described above. The present-epoch\nerror ellipse for the APOP position is within our systematic error of\n$\\sim 250$~mas from the best-fit positions of all timing\nsolutions.  When it becomes possible to fit confidently for proper motion in\nour timing solution, the resulting position will very likely converge\nto that of the optical counterpart.\n\nThe observed rotation period derivative $\\dot{P}$ includes\na kinematic component $\\dot{P}_{\\rm k} = P \\mu^2D/c$ \\citep{Shklovskii70},\nwhere $\\mu$ is the total proper motion.\nAt the NE2001-estimated distance of 0.7~kpc, we calculate\n$\\dot{P}_{\\rm k} = 1.2 \\times 10^{-21}$~s~s$^{-1}$ using PPMXL and\n$\\dot{P}_{\\rm k} = 3.5 \\times 10^{-21}$~s~s$^{-1}$ using APOP total proper\nmotions, which contribute, respectively, 4\\% or 12\\% of the observed\n$\\dot{P} = 3.0 \\times 10^{-20}$~s~s$^{-1}$.\n\n\n\nGiven the evident systematic errors, we assume only an upper\nlimit on proper motion of $\\mu<25$~mas~yr$^{-1}$, corresponding to\na tangential velocity $v_{\\perp}<83$~km~s$^{-1}$ at $D=0.7$~kpc.\nThis would imply a $<17$\\% reduction to the apparent pulsar spin-down\nluminosity of $\\dot{E} = 1.2 \\times 10^{34}$~erg~s$^{-1}$ ($ \\dot{E} \\propto\n\\dot{P} P^{-3}$).  \n\nThe gamma-ray luminosity can be computed following \\citet{2PC}, equation 15. Assuming $f_\\Omega = 1$, and using the DM distance of 0.7 kpc, the gamma-ray luminosity is $L_\\gamma = 2.9 \\times 10^{32}$ erg s$^{-1}$. This yields an efficiency $\\eta_\\gamma = L_\\gamma/\\dot{E}$ of 2.4\\%. This is consistent with, but on the low end of the distribution of, efficiencies observed for LAT-detected MSPs \\citep{2PC}. Any kinematic corrections to the spin-down will serve to increase the efficiency.\n\n\\subsection{Interpreting the Optical Modulation}\n\\label{sec:interpret}\n\nThe most consistent feature of the optical light curves\nis the minimum at $\\phi_{\\rm orb}\\approx0.25$.\nThis accords with the expectation for pulsar wind\nheating of the companion star, as phase 0.25 corresponds to inferior\nconjunction of the companion, when we are viewing its cold side.\nThe consistent alignment also implies that a constant\nradio period serves well to extrapolate the orbital phase over the\nprevious 9~yr.   On the other hand, the light curves do not have\nthe symmetric heating maximum around $\\phi_{\\rm orb}=0.75$ expected in this scenario.\nRather, the flux is higher at $\\phi_{\\rm orb}=0.6$ and decreases toward $\\phi_{\\rm orb}=1.0$.\nThis resembles a similar sloping feature in the optical and X-ray\nlight curves of the transitioning millisecond pulsar PSR J1023+0038 when\nin its radio-pulsar state \\citep{wou04,bog11}.\n\n\n\nIt could indicate that the heating\nis asymmetric because it does not come directly from the pulsar, but is\nmediated by an intrabinary shock that has a skewed shape near the companion.\nAlternatively, the shape of the light curve may be affected by\nthe magnetic field of the companion directly channeling the\npulsar wind to localized regions on its surface \\citep{tan14,li14}.\n\nSpectral hardening around $\\phi_{\\rm orb}=0.6$ seen in the Pan-STARRS data is\ngenerally consistent with heating due to irradiation from the pulsar.  The amplitude\nof modulation is about 0.8 magnitudes in {\\ensuremath{i_{\\rm P1}}}, {\\ensuremath{z_{\\rm P1}}}, and {\\ensuremath{y_{\\rm P1}}}, but it increases\nto $1.2-1.4$ magnitudes in {\\ensuremath{g_{\\rm P1}}}\\ and {\\ensuremath{r_{\\rm P1}}}.  The departure from the expected\nsymmetry around $\\phi_{\\rm orb}=0.75$ in the Pan-STARRS data is even more\npronounced than in CRTS, which, because of the smaller number of Pan-STARRS\npoints, may indicate that stochastic variability is prevalent.\nSome measurements in the same filter differ by as much as\n$\\sim0.4$~magnitudes at the same orbital phase.\n\nThere may be some significance to the fact that the peak in the\napparent heating effect is displaced toward orbital phases earlier than 0.75 in both CRTS and\nPan-STARSS.  An earlier peak implies that the trailing side of the companion, seen while\nit is moving away from the observer, is hotter than the leading side. \nThis may indicate where the intrabinary shock is closest to the\nsurface of the companion and illuminating it with the greatest\ngeometrical covering factor.  In his prediction for ``hidden''\nmillisecond pulsars of type II, \\citet{tav91} argued that the wind ablated from\nthe companion would be displaced in the direction of orbital motion\n(leading) due to the Coriolis force.  This would force the shock\naway from the companion in the leading direction, possibly\nleaving the more efficient heating to the trailing side.\n\nAny more detailed interpretation of the optical modulation is hampered by the\nevident intrinsic variability in the CRTS and Pan-STARRS data on timescales\nthat are not yet fully explored.  However, it would be interesting with new\ndata to relate well-sampled optical light curves to the orbital phase\ndistribution of the radio eclipses, to see if both can be explained\nby the geometry of the ablated wind.\n\n\n\nIn addition to heating, there may be some modulation due to our changing\nview of the tidally distorted surface of the companion, nearly filling \nits Roche-lobe.  Such ellipsoidal modulation produces maxima of equal\nheight at $\\phi_{\\rm orb}=0$ and 0.5, and unequal minima at $\\phi_{\\rm orb}=0.25$ and 0.75,\nthe latter one being lower.  This effect dominates the light\ncurve of the 5~hr period redback PSR J1628$-$3205 \\citep{li14}\nand others, e.g., \\citet{bel13,hui15}.  However, the maximum\nellipsoidal amplitude is only expected to be $\\sim0.4$~mag,\nwhile the mean light curve of {\\rm PSR J1048+2339}\\ varies by $\\gtrsim1.0$~mag.  Also, the\ntwo local minima in the mean CRTS light curve are not separated by 0.5 in phase,\nbut more like 0.6.  It is possible that ellipsoidal\nmodulation is a small contributor even though it cannot\nexplain the gross features of the light curve of {\\rm PSR J1048+2339}.\n\n\\subsection{The Companion Star}\n\\label{sec:companion}\n\nWe would like to know the intrinsic colors of the companion star\nto estimate its spectral type and radius.   While the Pan-STARRS\nphotometry represents the best broad-band spectral information\ncurrently available on this object, its sparse observations,\ntogether with the substantial variability of the source,\nboth orbital and random, prevents a reliable color from being \nobtained from those exposures, which were taken more than 16 minutes\napart.  In contrast, the single-epoch SDSS photometry was acquired\nwithin 5 minutes, which is why we used the magnitudes transformed\nfrom the SDSS to calibrate the CRTS light curve\napproximately (see  Section~\\ref{sec:sdss}). \nThe conclusions that follow from this are tentative,\nand must be tested with detailed temperature measurements and\nmodeling of the orbital light curve. \n\nAssuming that we are viewing the orbit nearly edge-on ($i=90^{\\circ}$),\n$V\\approx20.9$ at $\\phi_{\\rm orb}=0.25$ represents the unheated side of\nthe companion. At the DM distance of $D=0.7$~kpc, the interstellar extinction\nmeasured from Pan-STARRS and 2MASS photometry is $A_V=0.05$ \\citep{gre15},\nso the extinction-corrected apparent magnitude is $V=20.85$\nand the absolute magnitude is $M_V\\approx +11.6$, suggesting a main-sequence\nstar of spectral type M4, which has a radius of $R_c=0.35\\,R_{\\odot}$\nand an effective temperature of $T_{\\rm eff}\\approx3350$~K.\n(If $i<90^{\\circ}$, the phase of minimum light represents a mixture\nof spectral types both hotter and cooler than M4.)  But the SDSS\ncolors at $\\phi_{\\rm orb}=0.96$, near quadrature, correspond to an earlier\nspectral type, around K6.  Therefore, we can assume that the\nheated side of the companion is, on average, hotter than a K6 star,\nor $T_h>4200~K$. \n\nGiven the pulsar's apparent spin-down luminosity,\n$\\dot E\\approx1\\times10^{34}$ erg~s$^{-1}$ corrected\nfor proper motion, we can estimate the\nefficiency of pulsar heating during the bright phase\nof the optical light curve.  Assuming an average $T_h=4400$~K\nfor the heated half of the star, its extra luminosity\nat phase 0.75 can be expressed in terms of the heating efficiency\n$\\eta$ of an assumed isotropic pulsar wind as\n$\\eta\\dot E R_c^2/4 a^2=2\\pi R_c^2\\sigma (T_h^4-T_{\\rm eff}^4)$,\nwhere $a$ is the orbital separation.  (Other authors use a factor\nof $4\\pi$ here instead of our $2\\pi$.) For an assumed NS mass of\n$1.4\\,M_{\\odot}$ and an orbital inclination of $i=90^{\\circ}$,\n$M_c=0.31\\,M_{\\odot}$ and $a=2.0\\,R_{\\odot}$. Therefore,\npulsar heating is only marginally able to power the observed\npeak luminosity, because the needed efficiency $\\eta$ is $\\approx0.69$.\n\nThere are a number of theoretical reasons that $\\eta$\nshould not exceed 0.5, as summarized by \\citet{li14}.\nHowever, \\citet{bre13} estimated an efficiency in the range\n$0.1\\le\\eta\\le0.6$ for the four systems they modeled,\nwhile \\citet{sch14} found $\\eta>1$ for the black\nwidow PSR J1810+1744.  \\citet{rom15b} modeled the redback\nPSR J2215+5135 with $\\eta=0.68$, and \\citet{rom15a} found\n$\\eta>1$ for the black widow PSR J1311$-$3430.  So more complex\nphysical effects are clearly having an important influence.\nOne way to reduce the inferred efficiency is to assume that\nthe pulsar wind is beamed in the orbital plane in this system,\nor channeled by the intrinsic magnetic field of the companion.\n\nWith an estimated $R_c=0.35\\,R_{\\odot}$ from its optical properties,\nthe companion appears to significantly underfill its Roche lobe,\nwhich has radius $r_L\\ge0.52\\,R_{\\odot}$ \\citep{egg83} for\n$M_{\\rm NS}\\ge1.4\\,M_{\\odot}$.  This would reduce any ellipsoidal modulation.\nIf we could double the distance to 1.4~kpc, then the companion\ncould be an M2 star with $T_{\\rm eff}\\approx3580$~K and fill its\nRoche lobe.  But the difficulty of pulsar wind heating would not be\nameliorated much because $\\eta$ would become only slightly smaller,\n$\\approx0.58$, for the same $T_h$ used above.\nHowever, these conclusions are sensitive to the effective $T_h$ and the\ninclination $i$, both of which remain to be measured.\n\n\\subsection{Orbital period variations}\n\nFigure~\\ref{fig_tasc} illustrates the orbital period variations of \nPSR~J1048+2339. Large orbital period variations are known to occur in other \nredback systems such as PSR~J1023+0038 \\citep{arc13} and J2339$-$0533\n\\citep{ple15}.  \nQuasi-periodic changes in the gravitational quadrupole\nmoment of the companion have been proposed to explain observations showing\nthe orbital period to oscillate \\citep{mat83}. \nSeveral other effects can contribute to orbital period variations: (1)\nenergy dissipation via gravitational wave emission, (2) mass loss, and\n(3) Doppler shifts due to the Shklovskii effect \\citep{Shklovskii70}\nor Galactic rotation. However, they would result in a monotonic change\nin $P_{\\rm orb}$ and therefore cannot adequately explain the observed\norbital period variations. \n\n\\cite{Applegate92} relates oscillations in the gravitational quadrupole\nmoment of a non-degenerate companion star to a cycle of magnetic activity \nsimilar to the 11-year Solar cycle. The changing magnetic field generates\na variable torque between the convective outer layer and radiative inner\nlayer of the star. The torque causes angular momentum to be exchanged between\nthe layers in a quasi-periodic manner, causing changes in the differential\nrotation between the layers and therefore in the shape of the star. \nSpin-up of the outer layer corresponds to the star becoming more oblate and to\nan increase in the gravitational quadrupole moment. Since the total angular\nmomentum in the binary system is conserved, this causes a decrease in the\norbital period. \\cite{ple15} give an overview of the literature and apply \nthe Applegate model to the orbital period variations of PSR~J2339$-$0533. We note that since this model relies on convective and radiative layers being present and stars with mass $\\lesssim 0.3$~\\msun\\ are fully convective, it implies that the companion of PSR~J1048+2339 is more massive than the minimum companion mass $M_{\\rm c,min} = 0.3$~\\msun and the orbital inclination is $< 90\\degrees$.  \n\nFollowing the same procedure as \\cite{ple15}, we obtain a modulation of $P_{\\rm orb}$ with a period of $P_{\\rm mod} = 1.58$ years and amplitude $A = 1.44 \\times 10^{-11}$~s$^{-1}$. Using $M_{\\rm c,min} = 0.3$~\\msun, and estimated companion radius $R_{\\rm c} \\approx 0.35$~\\rsun~(Section~\\ref{sec:companion}), we derive the change in the luminosity of the companion that would account for the energy needed for angular momentum transfer, $\\Delta L = 9.44 \\times 10^{27}$~erg~s$^{-1}$ (Eqn. 13 from \\citealt{ple15}). Based on the estimated companion effective temperature $T_{\\rm eff} \\approx 3350$~K~(Section~\\ref{sec:companion}), its total luminosity is $L_{\\rm c} = 5.32 \\times 10^{31}$~erg~s$^{-1}$. Since the energy budget for the angular momentum transfer is only $0.02\\%$ of the companion's intrinsic luminosity, the companion has sufficient energy output to generate the orbital period fluctuations even if the orbital inclination (assumed to be 90\\degrees) is overestimated, or $M_{\\rm c}$ or $T_{\\rm eff}$ are underestimated. \n\n\\section{Conclusions}\n\nThe discovery of the redback pulsar J1048+2339 in a {\\em Fermi} unassociated source and the interesting phenomenology in this binary system add a valuable data point for studies of this still not very well understood class of pulsars. Our radio observations show extensive eclipses around superior conjunction as well as sporadic ``mini-eclipses'' at other orbital phases and an occasional long-term absence of pulsed radio emission even near inferior conjunction. This indicates that the ionized gas environment in the system is very dynamic and changes significantly on time scales of hours to days. The radio timing solution that best predicts pulse arrival times includes a fixed proper motion from the APOP catalog \\citep{APOP} and five orbital period derivatives. A likely explanation of the rapid orbital period variations is quasi-periodic changes in the gravitational quadrupole moment of the companion due to a magnetic torque mechanism similar to that at play in the 11-year Solar cycle. \n\nPSR~J1048+2339 has a 20th magnitude optical counterpart detected by SDSS, CRTS, PTF, and Pan-STARRS, whose intensity modulation matches the pulsar orbital period. Its magnitude and colors are consistent with those of an M4 main-sequence star on the ``night'' side. While the optical light curve has the expected minimum at $\\phi_{\\rm orb} \\approx 0.25$, corresponding to inferior conjunction of the companion, it does not exhibit a well-defined maximum at $\\phi_{\\rm orb} \\approx 0.75$. This can be explained by heating not directly from the pulsar but from an asymmetric intra-binary shock. Alternatively, the companion magnetic field may be channeling the pulsar wind to specific regions on the companion's surface that get heated preferentially. \n\nWe did not find an X-ray counterpart in an existing short {\\em Swift} observation of the field containing PSR~J1048+2339.\n\nThe two-year span of the radio ephemeris does not allow a confident detection of gamma-ray pulsations. Due to the rapid orbital period variations, for the gamma-ray timing analysis we can use only {\\em Fermi} data taken within the radio ephemeris time limits. However, the H-test value of a potential gamma-ray pulsation detection improves as the span of the radio timing solution grows, indicating that detection of gamma-ray pulsations is likely as we extend and improve the PSR~J1048+2339 timing solution within the next 1--2 years.\n\n\nJ.S.D. was supported by the Chief of Naval Research and a {\\em Fermi} Guest Investigator grant. The Arecibo Observatory is operated by SRI International under a cooperative agreement with the National Science Foundation (AST-1100968), and in alliance with Ana G. M\\'endez-Universidad Metropolitana, and the Universities Space Research Association. The Green Bank Telescope is part of the National Radio Astronomy Observatory, a facility of the National Science Foundation operated under cooperative agreement by Associated Universities, Inc. \n\nThe CSS survey is funded by the National Aeronautics and Space Administration under Grant No. NNG05GF22G issued through the Science Mission Directorate Near-Earth Objects Observations Program. The CRTS survey is supported by the U.S. National Science Foundation under grant AST-0909182. The Pan-STARRS Surveys (PS1) have been made possible through contributions of the Institute for Astronomy, the University of Hawaii, the Pan-STARRS Project Office, the Max-Planck Society and its participating institutes, the Max Planck Institute for Astronomy, Heidelberg and the Max Planck Institute for Extraterrestrial Physics, Garching, The Johns Hopkins University, Durham University, the University of Edinburgh, Queen's University Belfast, the Harvard-Smithsonian Center for Astrophysics, the Las Cumbres Observatory Global Telescope Network Incorporated, the National Central University of Taiwan, the Space Telescope Science Institute, the National Aeronautics and Space Administration under Grant No. NNX08AR22G issued through the Planetary Science Division of the NASA Science Mission Directorate, the National Science Foundation under Grant No. AST-1238877, the University of Maryland, and Eotvos Lorand University (ELTE) and the Los Alamos National Laboratory. \n\nThe {\\em Fermi}-LAT Collaboration acknowledges generous ongoing support from a number of agencies and institutes that have supported both the development and the operation of the LAT as well as scientific data analysis. These include the National Aeronautics and Space Administration (NASA) and the Department of Energy in the United States, the Commissariat \\`{a} l'Energie Atomique and the Centre National de la Recherche Scientifique/Institut National de Physique NuclÃ©aire et de Physique des Particules in France, the Agenzia Spaziale Italiana and the Istituto Nazionale di Fisica Nucleare in Italy, the Ministry of Education, Culture, Sports, Science and Technology (MEXT), High Energy Accelerator Research Organization (KEK) and Japan Aerospace Exploration Agency (JAXA) in Japan, and the K. A. Wallenberg Foundation, the Swedish Research Council and the Swedish National Space Board in Sweden. Additional support for science analysis during the operations phase is gratefully acknowledged from the Istituto Nazionale di Astrofisica in Italy and the Centre National d'\\'Etudes Spatiales in France.\n\n\n\n\\clearpage\n\\begin{thebibliography}\n\n\\bibitem[Abdo et al.(2009)]{Abdo09} \nAbdo, A. A., et al. 2009, Science, 325, 848\n\n\\bibitem[Abdo et al.(2013)]{2PC}\nAbdo, A. A., et al. 2013, ApJS 208, 17\n\n\\bibitem[Acero et al.(2015)]{3FGL}\nAcero, F.,  et al. 2015, ApJS, 218, 23\n\n\\bibitem[Ahn et al.(2012)]{SDSS}\nAhn, C. P., et al. 2012, ApJS, 203, 21\n\n\\bibitem[Applegate(1992)]{Applegate92}\nApplegate, J. H. 1992, ApJ, 385, 621\n\n\\bibitem[Archibald {et al.}(2009)]{arc09}\nArchibald, A. M., Stairs, I. M., Ransom, S. M., {et al.}\\ 2009, Science, 324, 1411\n\n\\bibitem[Archibald {et al.}(2013)]{arc13}\nArchibald, A. M., {et al.}\\ 2013, arXiv:1311.5161\n\n\\bibitem[Arzoumanian {et al.}(1994)]{arz94}\nArzoumanian, Z., Fruchter, A. S., \\&  Taylor, J. H. 1994, ApJL, 462, L85\n\n\\bibitem[Bates {et al.}(2013)]{Bates2013}\nBates, S. D., Lorimer, D. R., \\& Verbiest, J. P. W. 2013, MNRAS, 431, 1352 \n\n\\bibitem[Bellm {et al.}(2013)]{bel13}\nBellm, E., Djorgovski, S. G., Drake, A., et al. 2015, arXiv:1510.00721\n\n \\bibitem[Blandford \\& Teukolsky(1976)]{BT76}\nBlanford, R., \\& Teukolsky, S. A. 1976, ApJ 205, 580\n\n\\bibitem[Breton {et al.}(2013)]{bre13}\nBreton, R. P., van Kerkwijk, M. H., Roberts, M. S. E., {et al.}\\ 2013,\n\\apj, 769, 108\n\n\\bibitem[Bogdanov {et al.}(2011)]{bog11}\nBogdanov, S., Archibald, A. M., Hessels, J. W. T., et al. 2011, \\apj, 742, 97\n\n\\bibitem[Chambers et al.(2006)]{Chambers06}\nChambers, K., \\& the Pan-STARRS Team 2006, AMOS Conf. Proc., 386-393\n\n\\bibitem[Cordes \\& Lazio(2002)]{NE2001}\nCordes, J. M., \\& Lazio, T. J. W. 2002, arXiv:astro-ph/0207156\n\n\\bibitem[Cromartie {et al.}(2015)]{Cromartie15}\nCromartie, H. T., Camilo, F., Kerr, M., {et al.}\\ 2015, ApJ, submitted\n\n\\bibitem[Drake {et al.}(2009)]{dra09}\nDrake, A. J., Djorgovski, S. G., Mahabal, A., {et al.}\\ 2009, \\apj, 696, 870\n\n\\bibitem[Drake {et al.}(2013)]{dra13}\nDrake, A. J., Catelan, M., Djorgovski, S. G., {et al.}\\ 2013, \\apj, 763, 32\n\n\\bibitem[Eggleton {et al.}(1983)]{egg83}\nEggleton, P. P. 1983, \\apj, 268, 368\n\n\\bibitem[Green {et al.}(2015)]{gre15}\nGreen, G. M., Schlafly, E. A., Finkbeiner, D. P., {et al.}\\ 2015, \\apj, 810, 25\n\n\\bibitem[Haslam {et al.}(1982)]{Haslam82}\nHaslam, C. G. T., Salter, C. J., Stoffel, H., \\& Wilson, W. E. 1982, A\\&AS, 47, 1\n\n\\bibitem[Horne \\& Baliunas(1986)]{hor86}\nHorne, J. H., \\& Baliunas, S. L. 1986, \\apj, 302, 757\n\n\\bibitem[Hotan et al.(2004)]{psrchive}\nHotan, A. W., van Straten, W., \\& Manchester, R. N. 2004, PASA, 21, 302\n\n\\bibitem[Hui {et al.}(2015)]{hui15}\nHui, C. Y., Hu, C. P., Park, S. M., {et al.}\\ 2015, ApJL, 801, L27\n\n\\bibitem[Kaiser et al.(2006)]{Kaiser06}\nKaiser, N., \\& the Pan-STARRS Team 2006, AMOS Conf. Proc., 376-385\n\n\\bibitem[Kalberla et al.(2005)]{Kalberla05}\nKalberla, P. M. W. et al. 2005, A\\&A, 440, 775\n\n\\bibitem[Kerr et al.(2011)]{Kerr11}\nKerr, M., et al. 2011, ApJ, 732, 38\n\n\\bibitem[Law {et al.}(2009)]{law09}\nLaw, N. M., Kulkarni, S. R., Dekany, R. G., {et al.}\\ 2009, \\pasp, 121, 1395\n\n\\bibitem[Li {et al.}(2014)]{li14}\nLi, M., Halpern J. P., \\& Thorstensen, J. R. 2014, \\apj, 795, 115\n\n\\bibitem[Lorimer \\& Kramer(2012)]{Handbook}\nLorimer, D. R., \\& Kramer, M. 2012, ``Handbook of Pulsar Astronomy'', Cambridge University Press\n\n\\bibitem[Magnier et al.(2013)]{Magnier13}\nMagnier, E. A., et al. 2013, 205, 20\n\n\\bibitem[Matese \\& Whitmire(1983)]{mat83}\nMatese, J. J., \\& Whitmire, D. P. 1983, A\\&A, 117, L7\n\n\\bibitem[Mattox et al.(1996)]{mattox96}\nMattox, J. R., Bertsch, D. L., Chiang, J., {et al.}\\ 1996,  \nApJ,  461, 396 \n\n\\bibitem[Nice \\& Thorsett(1992)]{nt92}\nNice, D. J. \\& Thorsett, S. E. 1992, ApJ, 397, 249\n\n\\bibitem[Pletsch \\& Clark(2015)]{ple15}\nPletsch, H. J., \\& Clark, C. J. 2015, \\apj, 807, 18\n\n\\bibitem[Qi et al.(2015)]{APOP}\nQi, Z., et al. 2015, AJ, 150, 137\n\n\\bibitem[Ransom et al.(2004)]{Ransom04}\nRansom, S. M., Stairs, I. H., Backer, D. J. {et al.}\\ 2004, ApJ, 604, 328\n\n\\bibitem[Rau {et al.}(2009)]{rau09}\nRau, A., Kulkarni, S. R., Law, N. M., {et al.}\\ 2009, \\pasp, 121, 1334\n\n\\bibitem[Ray {et al.}(2011)]{Ray11}\nRay, P. S., Kerr, M., Parent, D., {et al.}\\ 2011,  ApJS,  194,  17 \n\n\\bibitem[Ray et al.(2012)]{Ray12}\nRay, P. S. 2012, Fermi Symposium Proceedings, arXiv:1205.3089\n\n\\bibitem[Reich \\& Reich(1988)]{Reich88}\nReich, P. \\& Reich, W. 1988, A\\&A, 196, 211\n\n\\bibitem[Roberts et al.(2011)]{Roberts11}\nRoberts, M. S. E., et al. 2011, AIP Conf. Proc., 1357, 127\n\n\\bibitem[Roberts et al.(2013)]{Roberts13}\nRoberts, M. S. E., et al. 2013, IAU Proc., 291, 127\n\n\\bibitem[Roeser et al.(2010)]{PPMXL}\nRoeser, S., Demleitner, M., \\& Schilbach, E. 2010, AJ, 139, 2440\n\n\\bibitem[Romani et al.(2015a)]{rom15a}\nRomani, R. W., Filippenko, A. V., \\& Cenko, S. B. 2015a, \\apj, 804, 115\n\n\\bibitem[Romani et al.(2015b)]{rom15b}\nRomani, R. W., Graham, M. L., Filippenko, A. V., \\& Kerr, M. 2015b,\nApJL, 809, L10\n\n\\bibitem[Scargle(1982)]{sca82}\nScargle, J. 1982, \\apj, 263, 835\n\n\n\n\n\\bibitem[Schlafly et al.(2012)]{Schlafly12}\nSchlafly, E. F., et al. 2012, ApJ, 756, 158\n\n\\bibitem[Schroeder \\& Halpern(2014)]{sch14}\nSchroeder, J., \\& Halpern, J. 2014, \\apj, 793, 78\n\n\\bibitem[Shklovskii(1970)]{Shklovskii70}\nShklovskii, I. S. 1970, SvA, 13, 562\n\n\\bibitem[Tang {et al.}(2014)]{tan14}\nTang, S., Kaplan, D. L., Phinney, S., {et al.}\\ 2014, ApJL, 791, L5\n\n\\bibitem[Tavani(1991)]{tav91}\nTavani, M. 1991, ApJL, 379, L69\n\n\\bibitem[Tonry {et al.}(2012)]{Tonry12}\nTonry, J. L., et al. 2012, ApJ, 750, 99\n\n\\bibitem[Woudt {et al.}(2004)]{wou04}\nWoudt, P. A., Warner, B., \\& Pretorius, M. L. 2004, \\mnras, 351, 1015\n\n\\end{thebibliography}\n\n\n\\begin{deluxetable}{ll}\n\\tabletypesize{\\small}\n\\tablecolumns{2}\n\\tablewidth{0pc}\n\\tablecaption{Timing solution and derived parameters of PSR~J1048+2339\\label{tab_pulsars}}\n\\tablehead{\n\\colhead{Parameter} & \\colhead{Value\\tablenotemark{a}}}\n\\startdata\n\\cutinhead{Timing Fit Parameters}\nRight ascension, $\\alpha$ (J2000) & $10^{\\rm h}\\,48^{\\rm m}\\,43^{\\rm s}\\!.4183(2)$\\tablenotemark{b} \\\\\nDeclination, $\\delta$ (J2000) & $+23\\degree\\,39\\amin\\,53\\asec\\!.411(7)$\\tablenotemark{b} \\\\\nProper motion in $\\alpha, \\mu_\\alpha~{\\rm cos}~\\delta$ (mas~yr$^{-1}$) & $-18.7$\\tablenotemark{c} \\\\\nProper motion in $\\delta, \\mu_\\delta$ (mas~yr$^{-1}$) & $-9.4$\\tablenotemark{c} \\\\\nSpin frequency, $f$ (Hz) & 214.35478538736(7) \\\\\nSpin frequency derivative, $\\dot{f}$ (Hz~s$^{-1}$) & $-1.380(8) \\times 10^{-15}$ \\\\\nEpoch of timing solution (MJD) & 56897.0 \\\\\n\nDispersion measure, DM (pc~cm${}^{-3}$) & 16.6544(1)\\tablenotemark{d} \\\\\nTime of passage through ascending node, $T_{\\rm asc}$ (MJD) & 56637.598177(1) \\\\\nProjected semi-major axis, $x$ (lt-s)\\tablenotemark{e} & 0.836122(3) \\\\\nEccentricity & 0 \\\\\nOrbital frequency, $f_{\\rm orb}$ (Hz) & $ 4.6200376(1) \\times 10^{-5}$ \\\\\n1st orbital frequency derivative, $f_{\\rm orb}^{(1)}$ (Hz~s$^{-1}$) & $-8.30(3) \\times 10^{-18}$ \\\\\n2nd orbital frequency derivative, $f_{\\rm orb}^{(2)}$ (Hz~s$^{-2}$) & $-1.6(3) \\times 10^{-26}$ \\\\\n3rd orbital frequency derivative, $f_{\\rm orb}^{(3)}$ (Hz~s$^{-3}$) & $2.19(6) \\times 10^{-31}$ \\\\\n4th orbital frequency derivative, $f_{\\rm orb}^{(4)}$ (Hz~s$^{-4}$) & $-2.53(6) \\times 10^{-38}$ \\\\\n5th orbital frequency derivative, $f_{\\rm orb}^{(5)}$ (Hz~s$^{-5}$) & $1.01(2) \\times 10^{-46}$ \\\\\nPlanetary Ephemeris & DE421 \\\\\nTime Units & TDB \\\\\nTiming span (MJD) & 56508--57285 \\\\\nNumber of observation epochs & 26 \\\\\nNumber of points in timing fit & 72 \\\\\nWeighted rms post-fit residual ($\\mu$s) & 4.2 \\\\\n[-5pt]\n\\cutinhead{Derived Parameters}\n\n\nGalactic longitude, $l$ (deg) & 213.17  \\\\\nGalactic latitude, $b$ (deg) & 62.139  \\\\\n\nMass function (\\msun) & 0.00100 \\\\\nSurface magnetic field, $B$ (G)\\tablenotemark{f,g} &  $3.8 \\times 10^{8}$ \\\\\nSpin-down luminosity, $\\dot{E}$ (erg~s$^{-1}$)\\tablenotemark{g,h} & $1.2 \\times 10^{34}$ \\\\\nCharacteristic age, $\\tau_{c}$ (Gyr)\\tablenotemark{g,i} & 2.5 \\\\\nDistance, $D$ (kpc)\\tablenotemark{j} & 0.7 \\\\\n\n\n\\enddata\n\\tablenotetext{a}{Numbers in parentheses are 1-$\\sigma$ uncertainties reported by \\textsc{Tempo}.}\n\\tablenotetext{b}{Correlations between the orbital variability parameterization and the astrometric parameters result in a systematic uncertainty in the timing position of 250 mas (see Section~\\ref{sec:energetics}).}\n\\tablenotetext{c}{The APOP catalog \\citep{APOP} value was used as fixed parameter.}\n\\tablenotetext{d}{Determined from fit to 327 MHz data only.}\n\\tablenotetext{e}{$x = a_p~\\sin\\ i/c$, where $a_p$ is the pulsar orbit semi-major axis and $i$ is the inclination angle.}\n\\tablenotetext{f}{$B = 3.2 \\times 10^{19}~(P\\dot{P})^{1/2}~{\\rm G}$, where $P$ is in seconds.}\n\\tablenotetext{g}{Not corrected for acceleration effects.}\n\\tablenotetext{h}{$\\dot{E} = 4 \\pi^2 I \\dot{P} / P^3$ and assuming a moment of inertia $I = 10^{45}$~g~cm$^{2}$.}\n\\tablenotetext{i}{$\\tau_{c} \\equiv P / 2\\dot{P}$.}\n\\tablenotetext{j}{Based on DM, sky position, and the NE2001 model of ionized gas in the Galaxy \\citep{NE2001}.}\n\n\n\n\\end{deluxetable}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.7\\textwidth,angle=-90]{FIG1_left.ps}\n\\includegraphics[width=0.7\\textwidth,angle=-90]{FIG1_middle.ps}\n\\includegraphics[width=0.7\\textwidth,angle=-90]{FIG1_right.ps}\n\n\n\n\\caption{Folded pulse profiles and subintegration vs.\\ pulse phase for three epochs.  Left: MJD~57084, $\\phi_{\\rm orb} = 0.70 - 0.76$. Middle: MJD~57075, $\\phi_{\\rm orb} = 0.84 - 0.89$. Right: MJD~57064, $\\phi_{\\rm orb} = 0.94 - 0.99$; eclipse ingress occurs at $\\phi_{\\rm orb} \\sim 0.97$ ($t \\sim 700$~s) during this observation. Two full rotations are shown in each panel. \\label{fig_ingress}}\n\\end{center} \n\\end{figure}\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.99\\textwidth]{FIG2.eps}\n\n\\caption{Observations of PSR~J1048+2339 vs.\\ orbital phase where the pulsar was detected for at least part of the integration time are shown in blue, and non-detections are shown in red. Sessions 3 and 4 correspond to the 99 and 10-minute GBT observations at 820~MHz, respectively. In Session 3, egress occurs halfway through the 99-minute observation, at $\\phi_{\\rm orb} = 0.50$. Sessions 34 and 41 correspond to Arecibo observations at 1430~MHz. Arecibo sessions at 327~MHz typically consist of several 20-minute observations made in succession. In some cases, the last observation is shorter if it was aborted at the end of assigned telescope time.  \\label{fig_det}}\n\\end{center} \n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.75\\textwidth, angle=-90]{FIG3.ps}\n\n\\caption{Timing residuals vs.\\ orbital phase, showing an eclipse over\n  approximately half the orbit. All points shown are from observations\n  with the Arecibo telescope at 327~MHz. Typical observing time per TOA \n  is 20 minutes.\n  \n  \n  \n  \n\\label{fig_res}}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.7\\textwidth,angle=-90]{FIG4.ps}\n\n\\caption{Average polarimetric pulse profile for PSR~J1048+2339 from two\n  40-minute Arecibo observations at 1430~MHz. In the bottom panel,\n  total intensity is shown in black, while linear and circular\n  polarization are shown in red and blue, respectively. In the top\n  panel, the position angle of linear polarization is plotted for bins\n  in the linear polarization profile with signal-to-noise ratio $>3$.\n  \\label{fig_pol}}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.9\\textwidth]{FIG5.eps}\n\n\\caption{Normalized averaged pulse profiles from a 40-minute\n  coherently folded Arecibo observation at 1430~MHz, an archival\n  10-minute search-mode GBT observation at 820~MHz, and a\n  20-minute search-mode Arecibo observation at 327~MHz. The\n  latter was selected for the absence of eclipse ingress, egress,\n  short time scale emission variations, or TOA delays during the\n  observation. The profiles are phase-aligned using the radio timing\n  solution, and the dashed line provides a visual reference for the \n  intrinsic alignment of the peaks at different frequencies. Two complete turns \n  are shown.\\label{fig_multifreq}}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[angle=0,width=0.80\\linewidth,clip=]{FIG6a.ps}\n\n}\n\\vspace{0.2in}\n\\centerline{\n\\includegraphics[angle=0,width=0.80\\linewidth,clip=]{FIG6b.ps}\n\n}\n\\caption{\n(a) Photometry of {\\rm PSR J1048+2339}\\ from the CRTS, comprising 403\nmeasurements on 119 nights spanning 2005 April 10 -- 2013 June 3.\n(b) Lomb-Scargle periodogram of the above data excluding 25 outlier\npoints with $V_{\\rm CSS}<19.0$.\nThe peak at $4.62007(3)\\times10^{-5}$~Hz = 0.2505173(16)~d is consistent\nwith the radio pulsar orbital period.  Sideband frequencies are the 1-year\naliases.\n}\n\\label{fig:periodogram}\n\\end{figure}\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[angle=0,width=0.83\\linewidth,clip=]{FIG7a.ps}\n\n}\n\\vspace{0.2in}\n\\centerline{\n\\includegraphics[angle=0,width=0.83\\linewidth,clip=]{FIG7b.ps}\n\n}\n\\caption{\nFolded light curves of {\\rm PSR J1048+2339}\\ using the (constant) orbital period and phase\nfrom the radio pulsar ephemeris.  Phase 0 corresponds to the ascending\nnode of the pulsar.  (a) CRTS data from Figure~\\ref{fig:periodogram}a.\nThe inset is the binned light curve, constructed after excluding points\nwith $V_{\\rm CSS}<19.0$.  (b) PTF data.  All points were obtained over\n2012 March 23--27.\n}\n\\label{fig:fold}\n\\end{figure}\n\n\\begin{figure}\n\\centerline{\n\\includegraphics[angle=0,width=0.44\\linewidth,clip=]{FIG8.eps}\n\n}\n\\caption{Folded light curves of PSR~J1048+2339 in the Pan-STARRS survey. The vertical axis spans exactly 2 magnitudes in each panel to illustrate the relative amplitude of variability in the five bands.  The solid line is the mean unfiltered ($V_{\\rm CSS}$) light curve from the inset of Figure~\\ref{fig:fold}a.  The open circles at $\\phi_{\\rm orb}=0.96$ are the SDSS $g, r, i, z$ points.}\n\\label{fig_grizy}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.9\\textwidth]{FIG9.eps}\n\n\\caption{Relative positions of the 3FGL source J1048.6+2338 error\n  ellipse denoting 95\\% confidence, PSR~J1048+2339, and\n  the two lobes of the AGN NVSS~J104900+233821. The position\n  uncertainty of PSR~J1048+2339 from timing is much smaller than the\n  marker size. Also shown is the error circle of the X-ray source\n  1RXS~J104838.7+234351. \\label{fig_sources}}\n\\end{center}\n\\end{figure}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.9\\textwidth]{FIG10.eps}\n\n\\caption{The maximum likelihood fit of an exponentially cutoff power\n  law to the gamma-ray spectrum of PSR~J1048+2339 is shown as a solid line\n  and gives a photon spectral index of $1.9 \\pm 0.2$ and a cutoff energy of\n  $5.0 \\pm 2.3$~GeV. The dashed curves represent the fit uncertainty. The \n  points and upper limits are the fitted flux densities in 10 energy\n  bands. \n\\label{fig_gspec2}}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.9\\textwidth]{FIG11.eps}\n\n\\caption{The oscillation in the orbital period of PSR~J1048+2339 is shown as a shift in the time of passage through the ascending node vs.\\ MJD for the time span of our timing solution in Table~\\ref{tab_pulsars}. This is likely caused by changes in the companion's gravitational quadrupole moment.\\label{fig_tasc}}\n\\end{center}\n\\end{figure}\n\n\n", "itemtype": "equation", "pos": 23045, "prevtext": "\n\n\\title{Multiwavelength Observations of the Redback Millisecond Pulsar J1048$+$2339} \n\\author{\nJ.~S.~Deneva$^{1,*}$, \nP.~S.~Ray$^{2}$,\nF.~Camilo$^{3}$,\nJ.~P.~Halpern$^{3}$,\nK.~Wood$^{2}$,\nH.~T.~Cromartie$^{4}$,\nE.~Ferrara$^{5}$,\nM.~Kerr$^{6}$,\nS.~M.~Ransom$^{7}$,\nM.~T.~Wolff$^{2}$,\nK.~C.~Chambers$^{8}$,\nE.~A.~Magnier$^{8}$\n}\n\n\\affil{$^{1}$National Research Council, resident at the Naval Research Laboratory, Washington, DC 20375, USA}\n\\affil{$^{2}$Naval Research Laboratory, Washington, DC 20375, USA}\n\\affil{$^{3}$Columbia Astrophysics Laboratory, Columbia University, New York, NY 10027, USA}\n\\affil{$^{4}$University of Virginia, Charlottesville, VA 22904, USA}\n\\affil{$^{5}$Goddard Space Flight Center, Greenbelt, MD, 20771, USA}\n\\affil{$^{6}$CSIRO Astronomy and Space Science, Marsfield NSW 2122, Australia}\n\\affil{$^{7}$National Radio Astronomy Observatory, Charlottesville, VA 22903, USA}\n\\affil{$^{8}$Institute for Astronomy, University of Hawaii, Honolulu, HI 96822, USA}\n\n\\begin{abstract}\nWe report on radio timing and multiwavelength observations of the\n4.66~ms redback pulsar J1048+2339, which was discovered in an\nArecibo search targeting the {\\em Fermi}-LAT source\n3FGL~J1048.6+2338. Two years of timing \nallowed us to derive precise astrometric and orbital parameters for\nthe pulsar. PSR J1048+2339 is in a 6-hour binary, and exhibits radio\neclipses over half the orbital period and rapid orbital period variations. \nThe companion has a minimum mass of 0.3 \\msun, and we have identified a\n$V \\sim 20$ variable optical counterpart in data from several surveys.\nThe phasing of its $\\sim 1$~mag modulation at the orbital period suggests\nhighly efficient and asymmetric heating by the pulsar wind, which may be\ndue to an intrabinary shock that is distorted near the companion,\nor to the companion's magnetic field channeling the pulsar wind to specific\nlocations on its surface. \nWe also present gamma-ray spectral analysis of the source and\npreliminary results from searches for gamma-ray pulsations using the\nradio ephemeris. \n\\end{abstract}\n\n\\section{Introduction}\n\nData from the Large Area Telescope (LAT) on the {\\em Fermi} Gamma-ray\nSpace Telescope have shown definitively that millisecond pulsars\n(MSPs) are gamma-ray emitters similar to young pulsars \\citep{Abdo09},\nand more than a quarter of all known MSPs outside of globular clusters\nwere discovered in radio searches targeting {\\em Fermi} unidentified\nsources only within the past six years \\citep{Ray12}. {\\em Fermi} has\nbeen especially successful in uncovering MSPs in black widow and\nredback binary systems, where the pulsar's intense particle wind\ngradually ablates the companion. The main difference between the two\nclasses is the mass and type of the companion. While in black widow\nsystems the companion is degenerate, with a mass of 0.01--0.05~\\msun, redback pulsars have non-degenerate companions whose mass\nis an order of magnitude larger \\citep{Roberts11}. Both types are\nbelieved to be transitional between accreting low-mass X-ray binaries (LMXBs),\nrotation-powered binary MSPs, and isolated MSPs. Nineteen of 25 known\nblack widows and nine of 13 known redbacks in the Galactic field were\ndiscovered in radio searches of {\\em Fermi} unidentified sources. \n\nBlack widows and redbacks are relatively rare objects because they are\nselected against in undirected (``all sky'') surveys due to their\nintrinsic properties (radio eclipses, high line-of-sight acceleration\nfrom orbital motion) and because this stage in MSP evolution is short\ncompared to an MSP's lifetime. Consequently, there is much still to be\nlearned about the details of the transition between accreting and\nrotation-powered MSPs (\\citealt{Roberts11}, \\citealt{Roberts13}). This\nis especially true of redback pulsars, as they are the rarer and more\nrecently discovered type.\n\nIn this paper we present a detailed multiwavelength study of\nPSR~J1048+2339, a redback radio pulsar found in a {\\em Fermi} source\nby \\cite{Cromartie15}. The pulsar's prolonged radio eclipses around\nsuperior conjunction as well as ``mini-eclipses'' at other orbital\nphases are reminiscent of the redback class archetype, PSR~J1023+0038,\nwhose transition from LMXB to radio MSP was observed almost in real\ntime (\\citealt{arc09}, \\citealt{arc13}). In addition, PSR~J1048+2339\nexhibits significant orbital period variations similar to those\nobserved in the redbacks PSR~J1023+0038, PSR~J2339$-$0533\n\\citep{ple15}, and the original black widow pulsar B1957+20\n\\citep{arz94}.\n\nIn Section~\\ref{sec_radio} we present two years of radio timing\nobservations and polarimetry. In Section~\\ref{sec_optical} we focus on\nthe optical properties of the system, and in Section~\\ref{sec_gamma}\nwe discuss the gamma-ray counterpart.\n\n\\section{Radio Observations}\\label{sec_radio}\n\nPSR~J1048+2339 was discovered in a search at 327 MHz with the Arecibo telescope\nof high-latitude {\\em Fermi} unidentified sources from a preliminary version \nof the 3FGL {\\em Fermi} LAT source catalog  \\citep{Cromartie15}. \nThe source\nselection criteria were (1) non-variability in gamma-rays, (2)\npulsar-like gamma-ray spectrum, and (3) an error box 15\\arcmin\\ across\nor smaller, corresponding to the diameter of the Arecibo beam at\n327~MHz. The pulsar was discovered in a 15-minute observation targeting \nthe {\\em Fermi} source 3FGL~J1048.6+2338 on 2013 August 4.\nPSR J1048+2339 has a pulse period of 4.66 ms and a \ndispersion measure (DM) of 16.65~pc~cm$^{-3}$.\nAccording to the NE2001 model of\nelectron density in the Galaxy \\citep{NE2001}, this DM corresponds to\na distance of 0.7~kpc.\n\nWe performed timing observations of PSR J1048+2339 at 26 epochs\nbetween 2013 August 4 and 2015 September 20 using the Arecibo radio\ntelescope at 327~MHz. The observations used the PUPPI\nbackend in ``fast4k'' mode,\nwith 4096 channels and a 81.92~$\\mu$s sampling time. Since the minimum\nbandwidth provided by PUPPI, 100~MHz, is larger than the receiver\nbandwidth of 68~MHz, only 2680 channels were recorded to disk,\ncorresponding to the part of the PUPPI band covering the receiver\nbandwidth. After deriving a timing solution in 2015 July, \nwe observed PSR~J1048+2339 at 1430~MHz at two epochs in coherent folding,\nfull-Stokes mode using PUPPI with a bandwidth of 700~MHz, 448 channels, and\na 64~$\\mu$s sampling time. \n\nMany observations spanned eclipse ingress, egress, or showed\nsignificant short-timescale emission variations, especially near\ningress (Fig.~\\ref{fig_ingress}). We did not detect any radio emission in \nthe orbital phase range $\\phi_{\\rm orb} = $~0.02--0.49, corresponding to the main \neclipse when the pulsar is near superior conjunction with respect to the\ncompanion. Sporadic ``mini-eclipses'' occur frequently \nat other orbital phases and their duration ranges from tens to hundreds of \nseconds. At two epochs we did not detect the pulsar even at orbital phases where it is normally visible, $\\phi_{\\rm orb} \\sim$~0.6--0.8 (MJD 57343 and 57345; sessions 36 and 37 in Fig.~\\ref{fig_det}), indicating that the pulsed radio emission may be obscured by dense ionized gas for extended periods of time. \n\n\\subsection{Timing Solution}\n\nIn order to derive a phase-connected timing solution that accounts for\nevery rotation of the pulsar between observations, we extracted\ntimes-of-arrival (TOAs) from folded 327~MHz data using a pulse profile\ntemplate consisting of four Gaussian components, two each for the main\npulse and interpulse. \nWe used the \\textsc{Tempo} software package\\footnote{http://tempo.sourceforge.net} and the BTX binary model\n(\\citealt{BT76}; D.~J.~Nice, unpublished) to perform least-squares fitting\nof various pulsar parameters by minimizing the square of the\ndifferences between expected and measured TOAs, after excluding three points with large, apparently dispersion-induced delays. We scale the TOA uncertainties by a factor of 1.47 in order to bring the reduced $\\chi^2$ of the fit to unity.\nThe resulting best-fit parameters and other derived pulsar properties\nare listed in Table \\ref{tab_pulsars}. Figure~\\ref{fig_res} shows the timing residuals for all 327~MHz observations. There are no significant trends\nin the remaining timing residuals, indicating that at the current timing\nprecision and for the current data set, the ephemeris presented in\nTable \\ref{tab_pulsars} describes the TOAs. The most unusual timing property\nof J1048+2339 is its orbital period variation necessitating the\nfitting of five orbital period derivatives in order to obtain a timing\nmodel that fits the data well over the full time span of radio\nobservations ($\\sim 2$ years). \n\n\nThe relatively short span of the\nsolution and the large number of orbital period derivatives required\nto model the data mean that there are significant correlations between\nsome of the timing parameters (e.g. the astrometric and orbital\nparameters). As a result, the \\textsc{Tempo} uncertainties of the celestial coordinates are significantly underestimated (see Section~\\ref{sec:energetics}).\n \nTwo TOAs near eclipse egress (orbital phase $\\sim 0.55$) show an extra delay indicating that pulses are passing through the outer layers of the companion. One TOA near orbital phase $\\sim 0.75$ also shows an extra delay. Such\nfeatures are common in systems where gas turbulence and outflows may\nintroduce short-lived dispersive delays in the radio emission at\nvarious orbital phases. We note that this feature is present in only\none of several observations spanning that part of the orbit.\nWe calculate that the extra delays observed for these three TOAs correspond to a DM excess of 0.008, 0.003, and 0.005~pc~cm$^{-3}$. Assuming that the DM excess is incurred over a linear distance equivalent to the projected semimajor axis of the orbit (or the radius of the companion, which is of the same order of magnitude), we obtain an intra-binary electron density on the order of $10^5-10^6$~cm$^{-3}$. In comparison, \\cite{nt92} find an intra-binary electron density of $\\sim 10^7$~cm$^{-3}$ for the eclipsing MSP B1744$-$24A, and \n\n\\cite{Ransom04} find a similar value for PSR~J2140$-$2310A. \n\n\n\n\\subsection{Polarimetry and Profile Evolution}\n\nWe performed three observations of PSR~J1048+2339 using the Arecibo L-wide receiver and the PUPPI backend with a bandwidth of 700~MHz centered on 1430~MHz. One of the observations was in search mode, for a duration of 15 minutes. The remaining two observations were in coherent dedispersion full-Stokes mode, for 40 minutes each. \n\n\n\nThe coherently dedispersed L-wide data were analyzed with PSRCHIVE\n\\citep{psrchive} and Figure~\\ref{fig_pol} shows the calibrated \nfull-Stokes pulse profile averaged from the two observations. \nThe brightest component of the main pulse exhibits\nsignificant circular polarization, while the interpulse is\nlinearly polarized. The pulse profile and linear polarization vector position \nangle are consistent between the two observations. The calibrated period-averaged flux densities are $S_{\\rm 1430} = 0.076 \\pm 0.02$~mJy and $0.199 \\pm 0.04$~mJy, assuming a 20\\% uncertainty. The estimated rotation measure is $-2.4 \\pm 1.6$~rad~m$^{-2}$, consistent with zero. \n\nWe computed the flux density from our\nsearch-mode observations at other frequencies (where calibrated flux\ndensity measurements were not available) using the radiometer equation\n\\citep{Handbook}. At 327~MHz, out of 80 data sets we excluded those\nspanning ingress, egress, or containing ``mini-eclipses'' and calculated\na period-averaged flux density from each of the remaining 47 data sets.\nThe 327~MHz Arecibo receiver has gain $G = 11$~K/Jy\\footnote{http://www.naic.edu/\\~{}astro/RXstatus/rcvrtabz.shtml}. Nominal receiver temperature is 95~K, including spillover\\footnote{http://www.naic.edu/\\~{}phil/cal327/327Calib.html}. Scaling the 408~MHz sky temperature \\citep{Haslam82} to 327~MHz yields $T_{\\rm sky} = 33$~K.\n\nOverall, $T_{\\rm sys} = T_{\\rm rec} + T_{\\rm sky} = 128$~K. The range of flux density values we obtain is $S_{\\rm 327} = $~0.5--5.3~mJy, with a mean of 1.6~mJy and a standard deviation of 1.1~mJy. \n\nWe also analyzed two Robert C.\\ Byrd Green Bank Telescope (GBT) observations\nat 820 MHz from an earlier search of the {\\em Fermi} source\n3FGL~J1048.6+2338 where the pulsar was not detected in a blind\nperiodicity search, but a pulsed signal became evident after the data\nwere folded with our radio ephemeris. The observations used the GUPPI\nbackend with a bandwidth of 200~MHz. The 820~MHz receiver has $G =\n2$~K/Jy and $T_{\\rm sys} = 29$~K\\footnote{http://wwwlocal.gb.nrao.edu/gbtprops/man/GBTpg/node14\\_mn.html}. The observation times are 10 and 99 minutes, and we obtain period-averaged flux densities of $S_{\\rm 820} = 0.62$ and 0.11~mJy, respectively.\n\nThe difference in flux densities between observations at each of the three observing frequencies indicates significant scintillation and/or variability. Because of this, and the fact that we have only two observations at 820~MHz and three at 1430~MHz, we refrain from calculating a spectral index, but it appears compatible\nwith that of a typical pulsar.\n\nFigure~\\ref{fig_multifreq} shows averaged pulse profiles at 327, 820,\nand 1430~MHz aligned in phase using the radio ephemeris. There is\nsignificant profile evolution with frequency: the pulse at phase $\\sim\n1.0$ is brighter at 327~MHz but becomes weaker than the interpulse as\nthe frequency increases. Within the interpulse at phase $\\sim 0.4$ in Figure~\\ref{fig_multifreq},\nthe trailing component is brighter at 327~MHz but the leading\ncomponent dominates at the higher frequencies.\n\n\\section{Optical Observations}\\label{sec_optical}\n\n\\subsection{Catalina Real Time Transient Survey}\n\\label{sec:crts}\n\nUsing the radio timing position, we identified a 20th magnitude candidate optical counterpart to {\\rm PSR J1048+2339}\\ in the Catalina Real-Time Transient Survey (CRTS, \\citealt{dra09}) second data release. The Catalina ID number of the star is 1123054021805.\n\nWe extracted 8 years of CRTS data on this star,\nconsisting of 403 observations on\n119 nights from 2005 April~10 to 2013 June~3\n(Figure~\\ref{fig:periodogram}a).  On a typical night, four unfiltered\n30~s exposures of a field are taken within 30 minutes, and the\nphotometry is expressed as $V_{\\rm CSS}$ magnitudes (discussed in\nSection~\\ref{sec:interpret}).  The $3\\sigma$ limiting magnitude is\n$V_{\\rm CSS}\\approx20.3$ as we infer from those points whose error\nbars are $\\pm0.3$~mag.\n\nWe first transformed the times of the data to barycentric\ndynamical time for consistency with the radio pulsar ephemeris.\nMagnitudes were converted to fluxes, which were normalized by\nthe variance of the data \\citep{hor86}, and a Lomb-Scargle\nperiodogram \\citep{sca82} was calculated around the radio\npulsar's orbital period.  In this analysis we\nomitted high points that are clear outliers from the\nmean light curve, because they add noise at all frequencies.\nThis was done crudely by excluding the 25 points with $V_{\\rm CSS}<19.0$.\nAlthough some may just be statistical fluctuations,\n19 of them can be considered\nconfirmed outliers because there are at least two\non the same night. Examples of excluded points are\nthe four brightest in Figure~\\ref{fig:periodogram}a,\nwith magnitudes 18.12--17.59 on MJD 54536 (2008 March 11).\nThey clearly represent some sort of flare, a non-stationary process.\nThis simple procedure may cause us to underestimate the normal\nmaximum flux, and it does not account for smaller flares that may\noccur during fainter phases of the orbit; i.e., we do not iterate\nthe selection of outliers based on their phase in the folded\nlight curve.\n \nA strong signal (Figure~\\ref{fig:periodogram}b)\nis detected at $0.2505173(16)$~d, consistent with the\nmore precise orbital period of the radio pulsar, $P_{\\rm orb}=0.250519045(5)$~d.\nThe noise power in the periodogram is measured to be exponentially distributed with\na mean of 2.06 (not 1 as expected for white noise, due to the\nclosely correlated times of the nightly points), so the peak power\nof 42.0 has a single-trial chance probability of\n$e^{-42.0/2.06}=1.4\\times10^{-9}$.\n\nSince the optical search found a period consistent with the radio pulsar's\norbital period, we folded the data on the precise radio ephemeris.\nMore precisely, we used the orbital period and time of ascending node,\nbut not the period derivative(s), as the latter are known to wander on\nlong timescales in such systems\nand can become either positive or negative, as seen in\n\\citet{arz94} and \\cite{ple15}.  For the purpose of displaying the\nfolded data (Figure~\\ref{fig:fold}a), we restored\nthe high points previously omitted as flares in the\nperiodogram analysis.\n\n\nFinally, we calculated a mean light curve\nby averaging the points (by flux, but not weighted by error bars)\nin 30 bins in orbital phase while\nexcluding the flaring points.  The mean light curve\nis displayed in the inset of Figure~\\ref{fig:fold}a.\n\n\\subsection{Palomar Transient Factory}\n\\label{sec:pft}\n\nWe also extracted observations of {\\rm PSR J1048+2339}\\ from the Palomar Transient\nFactory (PTF, \\citealt{law09,rau09}).  Only nine $R$-filter measurements\nwere made over 2012 March 23--27, but they fortuitously cover a large\nfraction of the orbit, with smaller errors than CRTS.\nAs shown in Figure~\\ref{fig:fold}b, the shape of the modulation is very\nmuch like the mean CRTS light curve, and has the same total\namplitude of $\\approx0.9$~mag.\n\n\\subsection{Sloan Digital Sky Survey}\n\\label{sec:sdss}\n\nThe Sloan Digital Sky Survey (SDSS, \\citealt{SDSS}) photometric catalog lists\nthe optical counterpart of PSR~J1048+2339 at position\n(J2000.0) R.A.$=10^{\\rm h}\\,48^{\\rm m}\\,43^{\\rm s}\\!.4270(5)$,\ndecl.$=+23\\degree\\,39\\amin\\,53\\asec\\!.503(7)$.  \nThe observation occurred on 2005 February 4 (MJD 53405.39)\nat phase 0.96 of the binary orbit.\nThe SDSS PSF magnitudes are $u=23.45\\pm0.46,\ng=20.819\\pm0.040, r=19.646\\pm0.024, i=19.029\\pm0.022, z=18.733\\pm0.034$.\nWe used the equations of Lupton (2005)\\footnote{https://www.sdss3.org/dr8/algorithms/sdssUBVRITransform.php\\#Lupton2005}\nto transform these to the Johnson system, giving $V=20.14, B-V=1.27, V-R=0.82$.\nThis is useful, as the CRTS unfiltered magnitude $V_{\\rm CSS}$ is not\na good approximation to Johnson $V$ for red stars.\nKnowing the color, a more precise calibration of CRTS\nis given as $V=V_{\\rm CSS}+0.91(V-R)^2+0.04$ \\citep{dra13}.\nAt $\\phi_{\\rm orb}=0.96$, $V_{\\rm CSS}\\approx19.6$ from the\nbinned light curve in Figure~\\ref{fig:fold}a, therefore\n$V=V_{\\rm CSS}+0.65=20.25$, in excellent agreement with $V=20.14$\nfrom the SDSS.  The total range of the light curve,\nneglecting any color changes, is then $20.0 < V < 20.9$.\nIn principle, one could get some information about the $V-R$\ncolor variation around the orbit by comparing the CRTS and PTF\nlight curves.  But the sparseness of the PTF data, and the poor\nsensitivity of the CRTS data around the minimum of the light curve,\ndo not enable such a variation to be measured robustly.\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Pan-STARRS}\n\\label{sec:panstarrs}\n\nPSR~J1048+2339 was also detected by the Pan-STARRS PS1 survey \\citep{Chambers06, Kaiser06}. The Pan-STARRS survey has been photometrically calibrated using a two-stage approach.  In the first stage, photometrically stable nights are identified and the system zero points and a modest number of other parameters are determined based on the relative photometry overlaps, resulting in systematic uncertainties of ({\\ensuremath{g_{\\rm P1}}}, {\\ensuremath{r_{\\rm P1}}}, {\\ensuremath{i_{\\rm P1}}}, {\\ensuremath{z_{\\rm P1}}}, {\\ensuremath{y_{\\rm P1}}}) = (8.0, 7.0, 9.0, 10.7, 12.4) mmag \\citep{Schlafly12}.  In the second stage, the resulting zero points are used to tie the remainder of the data to this internal system \\citep{Magnier13}, with the overall photometric system tied to the AB system via spectrophotometric standards \\citep{Tonry12}.\n\nThere have been to date three image processing pipeline versions, designated PV1, PV2, and PV3. PV2 is currently the most reliable astrometrically, but yields fewer total detections than PV3 because it covers fewer epochs. The shorter wavelengths give smaller uncertainties in position. Using 16 detections in the {\\ensuremath{g_{\\rm P1}}}\\ and {\\ensuremath{r_{\\rm P1}}}\\ filters (mean epoch MJD 55674) and assuming a 50~mas error radius to allow for unknown systematics, we find (J2000.0) R.A.$=10^{\\rm h}\\,48^{\\rm m}\\,43^{\\rm s}\\!.429(3)$, decl.$=+23\\degree\\,39\\amin\\,53\\asec\\!.49(5)$.\n\nPV3 is preferred for photometry, being better calibrated and more complete.  For PSR~J1048+2339, PV3 yields 75 useful detections (by a point-spread function goodness-of-fit criterion), typically obtained on 6--8 nights per filter, and spanning MJD~$55242 - 57043$ (2010 February 15 -- 2015 January 21).  Figure~\\ref{fig_grizy} shows the light curves of PSR~J1048+2339 in all five bands, with orbital phase calculated using the same method as for the CRTS and PTF data (see Section~\\ref{sec:crts}).  Phase coverage is non-uniform in all filters. Nevertheless, it is evident that the amplitude of modulation is a decreasing function of wavelength; {\\ensuremath{g_{\\rm P1}}}\\ and {\\ensuremath{r_{\\rm P1}}}\\ span more than 1.0 mag, while the other bands are less variable.  This is expected for a heating effect, where brighter regions are hotter.  In all filters, the minimum occurs at $\\phi_{\\rm orb}\\approx0.25$ and the maximum at $\\phi_{\\rm orb}\\approx0.6$. On the {\\ensuremath{r_{\\rm P1}}}\\ filter data in Figure~\\ref{fig_grizy} we superpose the mean unfiltered CRTS light curve from the inset of Figure~\\ref{fig:fold}, without any renormalization.  These two light curves bear some resemblance, although both {\\ensuremath{g_{\\rm P1}}}\\ and {\\ensuremath{r_{\\rm P1}}}\\ have considerably higher amplitude of modulation than CRTS. The small number but high accuracy of the Pan-STARRS points leaves an impression that intrinsic variation may be frequent, while it is smoothed out in the CRTS mean light curve that comprises a much larger number of less precise measurements.\n\n\\section{Gamma-ray Counterpart}\\label{sec_gamma}\n\nWe performed a spectral analysis of the gamma-ray source\n3FGL~J1048.6+2338 to characterize its spectrum and perform an\noptimized pulsation search using the weighted H-test\n\\citep{Kerr11}. We used a subset of the recently released Pass 8 LAT data set\nstarting from 2013 August 4 (the beginning of our phase-connected radio timing solution) and extending through 2015 July 15 (MET 397267203 -- 458611204).\nWe selected SOURCE class events (\\texttt{evclass = 128\n  and evtype = 3}) only during the intervals of good science data\n(\\texttt{DATA\\_QUAL=1 and LAT\\_CONFIG=1}) and restricted our events to\nthose with a zenith angle less than 90$\\degr$ and energies from 100~MeV to 100~GeV.  We selected events from a 15$\\degr$ radius around the source and\nperformed a binned likelihood analysis over a $20\\degr \\times 20\\degr$\nregion with 0.1$\\degr$ pixels. The initial model we used was based on\nthe 3FGL catalog \\citep{3FGL}. We modified the spectral model for the\ntarget source to be an exponentially cutoff power law of the form \n\n", "index": 1, "text": "\\begin{equation}\n\\frac{dN}{dE} = N_0 \\frac{E}{E_0}^{-\\Gamma}\n\\exp\\left(-\\frac{E}{E_c}\\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{dN}{dE}=N_{0}\\frac{E}{E_{0}}^{-\\Gamma}\\exp\\left(-\\frac{E}{E_{c}}\\right).\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>N</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>E</mi></mrow></mfrac><mo>=</mo><mrow><msub><mi>N</mi><mn>0</mn></msub><mo>⁢</mo><msup><mfrac><mi>E</mi><msub><mi>E</mi><mn>0</mn></msub></mfrac><mrow><mo>-</mo><mi mathvariant=\"normal\">Γ</mi></mrow></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><mi>E</mi><msub><mi>E</mi><mi>c</mi></msub></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]