[{"file": "1601.02567.tex", "nexttext": "\nThere, $\\Delta E$ is the range of the linear electric-field sweep (0.2~V/cm in our case), $\\vert p_f - p_i \\vert$ is the difference in electric dipole moment of the intersecting states (here $p_i=1.24\\times10^{-27}$~Cm, $p_f=19.8 \\times 10^{-27}$~Cm), $\\Delta W$  is the minimal gap splitting at the center of the avoided crossing (here $h \\times 42$~MHz), and $\\Delta t$ is the ramp duration (here 1~$\\mu$s). It follows $\\tau = 32$~ns and $P_{\\rm adia} = 1-2.5\\times 10^{-14}$, so that the probability of adiabatic transfer is close to unity. The adiabatic state transformation results in an enhancement of dipolar interaction strength by a factor of about 250.\\\\\n\n\\noindent \\bf Electric field calibration\\[6pt]\n\\indent\\rm To control the electric field inside the chamber, we apply voltages to a set of electrodes and the TIP. We perform Stark spectroscopy of the $48D_{J}$ levels in order to zero and calibrate the electric field in the excitation region. The field zero corresponds to the symmetry lines of the Stark energy level diagrams measured as a function of the applied voltages. The applied field is zeroed and calibrated along all three axes. The voltage-to-electric-field calibration factors are obtained by comparing measured and calculated spectra. A convenient field marker is the field at which the $\\vert nD_{5/2}, m_{j}=\\pm 1/2 \\rangle$ levels become stationary as a function of applied field. For $n=48$, this occurs at an electric field of 2.08~V/cm. \\\\\n\n\\noindent \\bf Magnification calibration\\[6pt]\n\\indent\\rm We temporarily insert a double-slit mask in the collimated 480-nm beam. The mask is placed in front of the lens that focuses the beam into the experimental chamber. The slits have a width of 1.0~mm and a center-to-center separation of $d=6.0$~mm. The separation between adjacent diffraction maxima for wavelength $\\lambda=480$~nm and focal length of the lens $D=20$~cm is $\\lambda D/d=16~\\mu$m. This value has been verified by images of the double-slit diffraction pattern, taken at the focal point of the lens. The distribution of Rydberg-atom counts obtained with the double-slit mask in place consists of a series of parallel, equidistant stripes, which correspond to the maxima of the diffracted blue excitation light. To obtain a smooth image of the Rydberg-atom distribution, we average over at least $2 \\times 10^3$ individual images. The average spacing between the parallel stripes in the averaged image is 80 pixels, leading to a calibration factor of 5.0$\\pm$0.5~pixels per $\\mu$m distance in the object (atom) plane. This scaling factor is used to generate the length markers in the figures. Since one pixel of the camera corresponds to a distance of 40.5~$\\mu$m on the detector assembly's phosphor screen, the TIP magnification is 200, with a relative uncertainty of $10\\%$.\\\\\n\n\\noindent \\bf Spatial pair correlation function and angular integration\\[6pt]\n\\indent\\rm For each individual image, we apply a peak-detection algorithm to obtain the ion positions in that image. Each individual image yields a pixelated pair correlation image $X_{i,j}^{(k)}$, where $i,j$ are pixel indices, $k$ is an image counter, and the value of $X_{i,j}^{(k)}$ is the number of occurrences that the separation vector between two ions resides within the pixel $(i,j)$. Note the images $X_{i,j}^{(k)}$ are only very sparsely populated. We then apply an area correction factor that corrects for the fact that, for a given frame size $N\\times M$, pixels $(i,j)$ with larger magnitudes of $i$ and $j$ have smaller image overlaps when executing the pair correlation. The area-corrected pair correlation images are $A^{(k)}_{i,j}=f(i,j,N,M) X_{i,j}^{(k)}$, where $f(i,j,N,M)=NM/[(N-\\abs{i})(M-\\abs{j})]$ is the area correction factor. Then we calculate the average pair correlation function $A=(1/K) \\sum\\limits_{k=1}^{K} A^{(k)}$, where $K$ is the number of images used in the average. Moderate coarse-graining over an area approximately equivalent to the point spread function of a single-ion blip yields the pair correlation images $\\bar{A}$ shown in Fig.~2. Azimuthal integration of the $\\bar{A}$ yields the radial pair correlation functions $I(R)$ in Fig.~3.\\\\\n\n\\noindent \\bf Semi-classical calculation\\[6pt]\n\\indent\\rm We perform a semi-classical 3D simulation of the dynamics of Ryd\\-berg atoms interacting via dipole-dipole forces.  Rydberg-atom positions and velocities are initialized as explained in~\\cite{thaicharoen_measurement_2015}, and the positions and velocities are then propagated using a Runge-Kutta integrator that includes all pair-wise interatomic forces. For the initialization of the simulated samples, we use $C_{6}=1.014\\times10^{-59}$~Jm$^{6}$ (calculated in~\\cite{reinhard_level_2007}), and in the Runge-Kutta integrator we use $C_{3}=3.546\\times10^{-42}~\\rm{Jm}^{3}$ (obtained from the electric-dipole moments evident in the Stark spectra). In the simulations we record the atom positions at selected interaction times. We then calculate the average pair-correlation images and radial functions $I(R)$ using the same procedure as in the experiment.\\\\\n\n\n\\bibliography{dipoleref}\n\\bibliographystyle{Science}\n\n\\clearpage\n\n\n", "itemtype": "equation", "pos": 3400, "prevtext": "\n\n\\baselineskip16pt\n\n\\maketitle\n\\section*{}\n\n\\noindent \\bf Experimental setup\\[6pt]\n\\indent\\rm See Fig. 1 in the main text for an illustration. $^{85}$Rb atoms are prepared in a magneto-optical trap at a density of $\\sim 10^{10}$~cm$^{-3}$ and a temperature of $\\sim 100~\\mu$K. Approximately 15 atoms are excited into the $50S_{1/2}$ Rydberg state by using coincident 780-nm and 480-nm laser pulses. Both beams provide an excitation volume that is small enough to lessen the effect of electric-field inhomogeneity near the tip imaging probe (TIP) but large enough to contain about ten $50S_{1/2}$ Rydberg atoms. The Rydberg-atom number is limited by the weak van der Waals excitation blockade that applies to the $50S_{1/2}$ state. The electric field within the excitation volume is aligned along the $y$- or $z$-direction (see Fig.~1(a)). During the laser excitation, the initial field strength $E_{\\rm{i}}$ is set 0.1~V/cm below $E_{\\rm{c}}$, the field at which the 6$^{\\rm {th}}$ avoided crossing between the $50S$-like Stark state and the hydrogenic manifold is centerd ($E_c = 2.762$~V/cm). After laser excitation, the electric field is ramped linearly to a final value of $E_{\\rm{f}} = E_{\\rm{c}} + 0.1$~V/cm.  The ramp time is 1~$\\mu$s. The field is held at $E_{\\rm{f}}$ while we wait for the atom sample to evolve over the selected times. At the end of the interaction time, we apply a sudden 1.6~kV potential to the TIP, which is a beryllium-copper needle with a rounded head of 125~$\\mu$m diameter. The Rydberg atoms become field-ionized, and the resultant ions are imaged onto a microchannel plate detector (detection efficiency 30$\\%$ - 50$\\%$, corresponding to an average number of about 5 detected Rydberg atoms). The ion impact positions generate blips on the phosphor screen of the detector assembly, providing a spatial image of the ion (and atom) distribution. The images are recorded and analyzed as detailed below.\\\\\n\n\\noindent \\bf Adiabatic transfer through an avoided crossing\\[6pt]\n\\indent\\rm Here it is not possible to directly excite highly dipolar, elongated Stark states at a well-defined initial separation $R_c(0)$ that is sufficiently small to allow for kinetic studies of dipolar interactions. This is due to the Rydberg excitation blockade, which limits the achievable density, and the low oscillator strength of linear Stark states for optical excitation.\nTo solve this problem, we initially laser-excite atoms into an $S$-like Rydberg state in a weak electric field. This state has an oscillator strength that is sufficiently large for optical excitation of about ten Rydberg atoms during a time of $5~\\mu$s. Also, since atoms in the $S$-like Rydberg state mostly interact via a weak isotropic van der Waals potential, the Rydberg-atom density limit imposed by the excitation blockade is quite high ($\\sim 10^9~$cm$^{-3}$). We adiabatically transfer the $S$-like Rydberg atoms into a highly dipolar, linear Stark state by the means of an adiabatic passage through a level crossing~\\cite{wang_dipolar_2015}. Here we are working at the 6$^{\\rm{th}}$ crossing between the $50S_{1/2}$ Stark state and the hydrogenic manifold. This crossing has a gap size of 42~MHz, which is large enough that we can resolve the crossing using Stark spectroscopy. The probability of adiabatic state transformation is obtained from the Landau-Zener formula, which leads to (in SI units)\n", "index": 1, "text": "\n\\[P_{\\rm adia} = 1-\\exp(-\\Delta t / \\tau) \\quad {\\rm{with}} \\quad \\tau = \\frac{\\hbar \\Delta E \\vert p_f - p_i \\vert}{2\\pi(\\Delta W/2)^2} \\quad . \\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"P_{\\rm adia}=1-\\exp(-\\Delta t/\\tau)\\quad{\\rm{with}}\\quad\\tau=\\frac{\\hbar\\Delta&#10;E%&#10;|p_{f}-p_{i}|}{2\\pi(\\Delta W/2)^{2}}\\quad.\" display=\"block\"><mrow><mrow><mrow><msub><mi>P</mi><mi>adia</mi></msub><mo>=</mo><mrow><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>t</mi></mrow><mo>/</mo><mi>τ</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mi>with</mi></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mi>τ</mi><mo>=</mo><mfrac><mrow><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>E</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mi>p</mi><mi>f</mi></msub><mo>-</mo><msub><mi>p</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">|</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>W</mi></mrow><mo>/</mo><mn>2</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mo>.</mo></mrow></math>", "type": "latex"}]