[{"file": "1601.03328.tex", "nexttext": "\\\\\n \\subfloat[]{\n        \\includegraphics[width=0.11\\textwidth, height=4.37cm]{0deg.pdf}\n        \\label{fig:0deg}}\n \\subfloat[]{\n        \\includegraphics[width=0.11\\textwidth, height=4.37cm]{5deg.pdf}\n        \\label{fig:5deg}}\n \\subfloat[]{\n    \\label{fig:10deg}\n    \\includegraphics[width=0.11\\textwidth, height=4.37cm]{10deg.pdf}}\n \\subfloat[]{\n    \\label{fig:15deg}\n    \\includegraphics[width=0.11\\textwidth, height=4.37cm]{15deg.pdf}}\n \\caption{Simulated results of the power density distribution of the transmitted (the upper $-z$ half-space) and reflected (the lower $+z$ half-space) waves normalized to the incident power density in a case of (from right to left): (a) normal incidence; (b) incident wave at an angle $\\theta_b=5^\\circ$ from the $+z$-axis (counted towards the $+y$-direction); (c)~incident wave at an angle $\\theta_b=10^\\circ$; (d) incident wave at an angle $\\theta_b=15^\\circ$. The metasurface is located in the middle of the plots along the $y$-axis. The incident wave illuminates the metasurface from the bottom.}\n \\label{fig:HFSSresults}\n}\\end{figure}\nThe plots show that the metamirror with a sub-wavelength focal distance even at oblique angles efficiently focuses reflected waves with a moderate displacement of the focal spot from the initial position.\nThe numerical data are summarized in Table~\\ref{tab:planar}. \n\\begin{table}[h]\n\\centering\n\\begin{tabular}{|c|c|c|c|c|}\n\\hline\n\\begin{tabular}[c]{@{}c@{}}Declination \\\\of the incident \\\\ wave from \\\\ the normal\\\\$\\theta_b$, deg\\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Defo -\\\\cusing\\\\ angle \\\\$\\theta_d$, deg \\end{tabular}  \n& \\begin{tabular}[c]{@{}c@{}}Power gain\\\\ in the \\\\shifted\\\\ focal spot \\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Power gain \\\\in the \\\\ positions\\\\ of the initial\\\\ focal spot\\end{tabular}  \n& \\begin{tabular}[c]{@{}c@{}}Beam \\\\deviation\\\\factor \\\\ BDF \\end{tabular} \n\\\\ \\hline\n0   & 0   & 8.8  & 8.8  & - \\\\ \\hline\n5   & 7   & 8.4  & 7.6  & 0.71 \\\\ \\hline\n10  & 16  & 8.0  & 5.2  & 0.63\\\\ \\hline\n15  & 24  & 7.4  & 2.6  &0.63\\\\ \\hline\n\\end{tabular}\n\\caption{Focal spot displacement for obliquely incident illumination}\n\\label{tab:planar}\n\\end{table} \nOne can notice that the gain in the shifted focal spot becomes slightly smaller when the incidence angle increases, as expected.\nTaking into account the extremely short focal distance, the ability of the studied metamirror to collect electromagnetic energy can be considered as remarkable. \n\n\n\n\\subsection{Metamirror emulating a cylindrical lens in reflection}\n\nIn this section we consider another metamirror which focuses the reflected wave in a line parallel to the $x$-axis. The array is axially symmetric with respect to the $z$-axis. Such a structure, operating as a cylindrical lens in reflection, can be easily fabricated and tested experimentally. One horizontal row of the metamirror elements is depicted in Fig.~\\ref{fig:linear}. The metamirror is infinite and periodical along the $x$-axis, while it comprises 23 elements along the $y$-axis with the total length 370~mm. Each element is located in a unit cell with the size of $a=15$~mm. The thickness of the metamirror is approximately $\\lambda/7$ at the operating frequency 5~GHz. \nThe focal distance of the structure is $f=0.65\\lambda=39$~mm that implies a very small $f/D=0.12$ ratio and a very large subtended angle $\\theta_0=77^\\circ$.  \nThe $f/D$ ratio of the present reflector is extremely small compared to the known reflectarrays. \nFor instance, in \\cite{ScanReflectarray}, the smallest considered ratio is equal to $f/D=0.24$ and corresponds to the subtended angle of $\\theta_0=64^\\circ$ and, moreover, the author claims that reflectarrays of larger subtended angles are not practical.\n\nThe operation of this metamirror was first examined with full-wave simulations. A single row of the elements was placed between the plates of a parallel-plate waveguide with the following dimensions: the sizes along the $y$- and $z$-axes are, respectively, 80~cm and 90~cm, and the height equals to  $a=15$~mm.\nSince the elements of the metamirror can be considered as coupled vertical electric and horizontal magnetic dipoles, based on the image principle, a single row of the elements placed in the waveguide emulates a two-dimensional structure infinite in the $x$-direction. In the waveguide at the operating frequency of the metamirror only transverse electromagnetic (TEM) waves can propagate with the fields orthogonal to the direction of propagation. \n\nThe feed in the simulation was a vertical coaxial source that generated a cylindrical wave with the electric field along the $x$-axis. The feed was located at the focal distance of the metamirror on the $z$-axis. \nOn the edges of the waveguide the boundary conditions of a perfectly matched layer were applied to avoid parasitic reflections.\nThe source was displaced at 5~mm, 10~mm and 17.5~mm from the focal point along the $y$-axis, which corresponds to the defocusing angles $\\theta_d=7^{\\circ}$, $\\theta_d=16^{\\circ}$ and $\\theta_d=24^{\\circ}$. \nThe simulated results for these three cases are shown in Figs.~{\\ref{fig:5degHFSS}, \\ref{fig:10degHFSS} and \\ref{fig:15degHFSS}}. \n\\begin{figure}[!]\n{\\par\\centering\n \\subfloat[]{\n        \\includegraphics[width=0.25\\textwidth]{5degITHFSS.pdf}\n        \\label{fig:5degHFSS}}\n \\subfloat[]{\n        \\includegraphics[width=0.25\\textwidth]{5degIT.pdf}\n        \\label{fig:5degIT}} \\\\\n                \n \\subfloat[]{\n    \\label{fig:10degHFSS}\n    \\includegraphics[width=0.25\\textwidth]{10degITHFSS.pdf}}\n \\subfloat[]{\n    \\label{fig:10degIT}\n    \\includegraphics[width=0.25\\textwidth]{10degIT.pdf}} \\\\\n        \n    \\subfloat[]{\n        \\includegraphics[width=0.25\\textwidth]{15degITHFSS.pdf}\n        \\label{fig:15degHFSS}}\n     \\subfloat[]{\n        \\includegraphics[width=0.25\\textwidth]{15degIT.pdf}\n        \\label{fig:15degIT}}\n  \\caption{The electric field distributions of the wave reflected from the metamirror. The feed and the metamirror are positioned at $z=3.9$~cm and $z=0$~cm, respectively.\nPlots (a), (c) and (e) depict the simulated field distributions for the cases when the feed was displaced by  $\\theta_d=7^{\\circ}$, $\\theta_d=16^{\\circ}$ and $\\theta_d=24^{\\circ}$, respectively. Plots (b), (d) and (f) show the corresponding measured field distributions.}\n}\\end{figure}\nThe numerical data obtained in simulations are summarized in Table~\\ref{tab:1}. Comparing the results in Table~\\ref{tab:planar} and Table~\\ref{tab:1}, one can notice that the beam deviation factor is smaller for the case of the metamirror with cylindrical symmetry. This can be explained by the fact that the cylindrical metamirror has a greater length that results in increasing  phase errors  and decreasing the main beam steering angular range (stronger displacement of the focal spot for the oblique incidence).  \n\t\\begin{table}[htp]\n\t\t\\centering\n\t\t\\begin{tabular}{|c|c|c|c|c|}\n\t\t\t\\hline\n\t\t\t\\begin{tabular}[c]{@{}c@{}}Defocusing\\\\  angle \\\\  $\\theta_d$,\\\\ $\\deg$ \\end{tabular} \n\t\t\t& \\begin{tabular}[c]{@{}c@{}}Lateral  \\\\ displacement \\\\ from the\\\\focal spot,\\\\ mm \\end{tabular} \n\t\t\t& \\begin{tabular}[c]{@{}c@{}}  Scanned \\\\ beam angle \\\\ (simulation/\\\\experiment)\\\\ $\\theta_b$, $\\deg$ \\end{tabular}  \n\t\t\t& \\begin{tabular}[c]{@{}c@{}} BDF \\\\(simulation/\\\\experiment) \\end{tabular} \n \t\t\t& \\begin{tabular}[c]{@{}c@{}} Main \\\\ beam \\\\ level,\\\\ dB \\end{tabular}  \n\t\t\t\t\\\\ \\hline\n7   & 5 & 3.0 / 4.4 & 0.43 / 0.63 & 16.1   \\\\ \\hline\n16   & 11 & 6.0 / 7.0 &  0.38 / 0.44 & 14.7  \\\\ \\hline\n24   & 17 & 9.5 / 11.0 & 0.40 / 0.46  & 12.2  \\\\ \\hline\n\t\t\t\\end{tabular} \\\\\n\t\t\\caption{The beam steering due to the lateral feed-displacement}\n\t\t\\label{tab:1}\n\t\\end{table} \n\nFig.~\\ref{fig:pattern} shows the radiation patterns of the metamirror in the $yz$-plane.\n\\begin{figure}[!]\n{\\par\\centering\n \\subfloat{\\includegraphics[width=0.4\\textwidth]{Pattern.pdf}}\n  \\caption{Simulated scanned beam pattern for the metamirror with the subtended angle $\\theta_0=77^\\circ$ ($f/D=0.12$).}\n \\label{fig:pattern}}\n\\end{figure}  \nWe can conclude that despite of the sub-wavelength focal length the scanning characteristics of the studied metamirror are at the same level as those of comparable reflectarrays. \n\nFor instance, a microstrip antenna described in paper \\cite{ScanReflectarray} has the diameter about $22\\lambda$ and operates at 28~GHz. \nThe lowest ratio between the focal distance and aperture diameter  discussed by the author is approximately $f/D=0.24$ and it corresponds to the subtended angle equal to $\\theta_0=64^{\\circ}$. \nComputed patterns of the broadside beam from the article are presented in Appendix~\\ref{app:1}. \nComparison with the results of  \\cite{ScanReflectarray}  shows that the scanning performance of the metamirror is on par with the reflectarray despite the fact that its focal distance is smaller and subtended angle larger.\n\n\n\nBy comparing the two studied metamirrors with different diameters, one can conclude that the number of phase overlaps increases with subtended angle value increase (or reduction of $f/D$ ratio), because the path difference between different points of the reflectarray and the feed can consist of a greater number of wavelengths.\nMoreover, the beam deviation factor dependence on the length of the structure was noticed within the same defocusing angles.\nThe longer array, the smaller scanned beam angles $\\theta_b$  can be achieved. \n\n\n\n\n\n\n\\subsection{Experimental verification}\n\nTo verify the scanning properties of the metamirror considered in the previous section, measurements in a parallel-plate waveguide were conducted. \nA single row of the elements of the metamirrror with the symmetry along the $xz$-plane is shown in Fig.~\\ref{fig:metalens_experiment} {\\cite{FuncMetamirror}}.\n\\begin{figure}[h]\n\\centering\n      \\includegraphics[width=0.45\\textwidth]{metalens_experiment.pdf}\n   \\caption{An experimental sample of a single-row metamirror consisting of 23 sub-wavelength copper inclusions.}\n \\label{fig:metalens_experiment}\n\\end{figure}\nThe geometry and dimensions of the elements are represented in Appendix~\\ref{app:2}.\n\nA vertical coaxial feed was used as a source of incident cylindrical waves with the $x$-oriented electric field. The feed position was changed laterally from the focal point of the metamirror along the $y$-axis (see Fig.~\\ref{fig:exp1}).\n\\begin{figure}[h]\n\\centering\n      \\includegraphics[width=0.4\\textwidth]{experiment.pdf}\n   \\caption{Experimental setup. The bottom part of the waveguide with a copper mesh and the metamirror. Feed positions marked by numbers: 1 -- the initial focal point, 2 -- feed displaced at 5~mm ($\\theta_d=7^{\\circ}$), 3 -- feed displaced at 11~mm ($\\theta_d=16^{\\circ}$), 4 -- feed displaced at 17.5~mm ($\\theta_d=24^{\\circ}$).}\n \\label{fig:exp1}\n\\end{figure}\n\n\nIn the bottom plate of the waveguide a copper mesh ($25\\times35$~cm)  was embedded. \nUsing a movable coaxial probe positioned under the mesh, it is possible to measure the spatial distribution of the $x$-component of the electric field inside the waveguide (see Fig.~\\ref{fig:exp_full}). The mesh period (5~mm) is much smaller than the wavelength, therefore the field distribution inside the waveguide is not significantly disturbed by the mesh. \nA vertical coaxial probe located 5~mm below the mesh gauged the near fields penetrated through the mesh. \nTo reduce parasitic reflections from the edges of the waveguide, it was necessary to place microwave absorbing material blocks of 10~cm width at the edges of the waveguide. The measuring device in the experiment is a vector network analyzer Agilent Technologies E8363A. \nPort~1 and port~2 of the analyzer were connected to the stationary coaxial feed and to the movable coaxial probe, respectively. \nThe transmission coefficient $S_{21}$ from port~1 to port~2 was measured by the scanning system with the step of 10~mm. \nThe spatial distribution of the $x$-component of the electric field can be  represented by the distribution of the transmission coefficient. \n\nTwo sets of measurements are needed to determine the distribution of the reflected fields from the metamirror. \nFirst, the empty waveguide was analysed to obtain the field distribution of the incident wave. In the second set of measurements with the metamirror placed inside the waveguide, the total fields were measured. \nThe reflected fields distribution was found by subtracting the incident fields from the total ones.\n\\begin{figure}[h]\n\\centering\n      \\includegraphics[width=0.4\\textwidth]{exp_full.pdf}\n   \\caption{Experimental construction: the moving platforms (Physik Instrumente), coaxial probe antenna, coaxial feed antenna and parallel-plate waveguide.}\n \\label{fig:exp_full}\n\\end{figure}\n\n\nThe measured field distribution of the reflected wave from the metamirror for all  three cases of feed displacement are presented in  Figs.~\\ref{fig:5degIT}, \\ref{fig:10degIT} and \\ref{fig:15degIT}.\nAs it is seen from Table~\\ref{tab:1}, the scanned angles of the main beam in the experiment are well correlated with the corresponding values achieved through full-wave simulations.  \n\n\n\n\n\n\n\n\n\n\n\\section{Conclusion}\n\nIn this paper we have examined novel metasurface-based reflectors for their scanning ability at feed displacements  and the focusing ability for incident waves deviating from the main-beam direction.  \nAlthough it could have been expected that a reflector with a sub-wavelength focal length might be impractical due to its potentially strong sensitivity to the feed position, both the simulated and measured results of the considered extremely short-focus metamirrors reveal their modest but acceptable for many applications  scanning properties. In fact, the scanning abilities are on par with comparable state-of-the-art reflectarray antennas, despite the fact that the focal distance of metamirrors is significantly smaller, even smaller than the wavelength. \nBeing transparent outside the operational frequency range, metamirrors can be exploited in various applications, in particular for satellites, for radioastronomy and together with solar energy harvesting systems.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\appendices\n\\section{}\n\\label{app:1}\nHere we present scanning characteristics of microstrip reflectarrays studied by S.~R.~Rengarajan \\cite{ScanReflectarray}, for comparison with  studied metamirrors. \nA broadside microstrip reflectarray has the diameter about 22$\\lambda$ and operates at 28~GHz. \nThe focal length to diameter ratio is $f/D=0.24$ ($\\theta_0=64^{\\circ}$). \nComputed radiation pattern of the reflectarray is shown in Fig.~\\ref{fig:reflectarray1}. \n\\begin{figure}[h]\n{\\par\\centering\n \\subfloat[]{\n      \\includegraphics[width=0.4\\textwidth]{Reflectarray1.pdf}\n        \\label{fig:reflectarray1}}\\\\\n \\subfloat[]{\n \\includegraphics[width=0.4\\textwidth]{Reflectarray2.pdf}\n  \\label{fig:reflectarray2}}\n   \\caption{(a) Computed H-plane pattern of the broadside microstrip reflectarray. (b) Scanned beam patterns when the feed was displaced at a distance equal to 1, 2 or 3 beamwidths of the reflector's main beam.}\n \\label{fig:reflectarray}\n}\\end{figure}\nRadiation patterns of the reflector for the cases when the feed was displaced at a distance equal to 1, 2 and 3 beamwidths are depicted in Fig.~\\ref{fig:reflectarray2}.\nThese curves may be compared with similar scanned beams for parabolic reflectors with the same subtended angle \\cite{AntennaHandbook}.\nObviously, increased gain loss, higher levels of coma lobes, broader beams, and greater pattern degradation are exposed in the scanned beams of the reflectarray compared to those of parabolic reflectors. For example, when the feed is displaced at an angle about $15^\\circ$ (3 beamwidths) in microstrip reflectarray antenna, the beam degradation is significant {\\cite{ScanReflectarray}}. \n\n\n\n\\section{}\n\\label{app:2}\nThe metamirror used in the full-wave simulations and measurements consists of 23 sub-wavelength inclusions. There are two types of elements in use: so-called twisted omega element (Fig.~\\ref{fig:omega1}) and $\\Omega$-shaped element (Fig.~\\ref{fig:omega2}).\n\\begin{figure}[h]\n{\\par\\centering\n \\subfloat[]{\n      \\includegraphics[width=0.2\\textwidth]{omega1.pdf}\n        \\label{fig:omega1}}\n \\subfloat[]{\n \\includegraphics[width=0.2\\textwidth]{omega2.pdf}\n  \\label{fig:omega2}}\n   \\caption{Two types of the elements exploited in the metamirror. (a) A twisted omega element. (b) An element with shape of the letter $\\Omega$.}\n \\label{fig:omegas}\n}\\end{figure}\nThe location of the inclusions is symmetrical with respect to the center of the metamirror. \nThe elements are made of copper wire of the radius 0.275~mm, and their geometrical parameters are shown in Table~\\ref{atab:1}.\n\\begin{table}[h]\n\\begin{tabular}{cccccc}\n\\hline \\hline\n\\begin{tabular}[c]{@{}c@{}}Distance\\\\ to the \\\\center\\\\  of the \\\\ meta-\\\\mirror,\\\\ mm\\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Type of \\\\ an \\\\ element \\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Loop \\\\radius, \\\\ mm\\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Length of\\\\  the straight \\\\ wires, mm\\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Phase \\\\of the \\\\reflected \\\\ wave,  \\end{tabular} \n& \\begin{tabular}[c]{@{}c@{}}Position \\\\of the\\\\ straight \\\\wires\\end{tabular} \\\\ \\hline \\hline\n0 & Twist.$\\Omega$  & $R_1=3.45$  & $l_1=0.57$ & 280  & -z half-space       \\\\ \n18  & Twist.$\\Omega$     & $R_1=2.66$  & $l_1=1.50$    & 306    & -z half-space    \\\\\n33   & Twist.$\\Omega$     & $R_1=2.27$     & $l_1=2.87$ & 0  & -z half-space   \\\\ \n48     & Twist.$\\Omega$  & $R_1=3.19$   & $l_1=0.83$   & 65     &  +z half-space      \\\\\n63      &  $\\Omega$      & $R_2=3.45$      & $l_2=5.26$  & 140      & +z half-space   \\\\ \n78      & $\\Omega$       & $R_2=3.49$     & $l_2=5.04$  & 218     & -z half-space        \\\\ \n93      & Twist.$\\Omega$    & $R_1=2.66$   & $l_1=1.50 $  & 306  & -z half-space      \\\\ \n108  & Twist.$\\Omega$  & $R_1=2.50$   & $l_1=1.90$ & 27  & +z half-space       \\\\ \n123 & $\\Omega$   & $R_2=3.77$  & $l_2=3.55$   & 113  & +z half-space    \\\\ \n13 & $\\Omega$  & $ R_2=3.33$  & $l_2=5.79$   & 207 & -z half-space    \\\\ \n153  & Twist.$\\Omega$ & $R_1=3.16$ & $l_1=0.88$ & 285   & -z half-space     \\\\ \n168  & Twist.$\\Omega$ & $R_1=3.44$   & $l_1=2.09$  & 19   & +z half-space      \\\\ \\hline\n\\end{tabular}\n\\caption{Dimensions of the metamirror's elements and their locations in the focusing metamirror.}\n\\label{atab:1}\n\\end{table}\n\n\n\n\n\n\n\n\\section*{Acknowledgment}\n\n\nThis work was supported by Academy of Finland (project 287894). The authors would like to thank Dr. E.L. Svechnikov for his useful comments on preliminary results of this work.\n\n\n\n\n\\ifCLASSOPTIONcaptionsoff\n  \\newpage\n\\fi\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{1}\n\n\n\n\\bibitem{ScanMicrostrip}\nD.~M.~Pozar, S.~D.~Targonski, and H.~D.~Syrigos, ``Design of millimeter wave microstrip reflectarrays'', {\\emph{IEEE Trans. Antennas Propagat.}}, vol.~45, no.~2, pp.~287-296, February 1997. \n\n\\bibitem{Reflectarray}\nJ.~Huang and J.~A.~Encinar, \\emph{Reflectarray Antennas}. IEEE Press, New Jersey: A John-Wiley \\& Sons, 2008.\n\n\\bibitem{bandwidth}\nJ.~A.~Encinar and J.~A.~Zornoza, ``Broadband design of three-layer printed reflectarrays'', \\emph{IEEE Trans. Antennas Propag.}, vol.~51, no.~7, pp.~1662--1664, July 2003. \n\n\\bibitem{pozar11}\nD.~M.~Pozar, ``Bandwidth of reflectarrays'', \\emph{Electron. Lett.}, vol.~39, no.~21, pp.~1490--1491, 2003.\n\n\\bibitem{ScanReflectarray}\nS.~R.~Rengarajan, ``Scanning and defocusing characteristics of microstrip reflectarrays'', {\\emph{IEEE Antennas Wireless Propag. Lett.}}, vol.~9, 2010.\n\n\\bibitem{mmwave}\nJ.~Lanteri, J.~Y.~Dauvignac, Ch.~Pichot, and C.~Migliaccio, ``Beam-scanning improvement of reflectarrays by reducing the cell size at millimetre waves'', {\\emph{Microwave and Optical Technology Lett.}}, vol.~48, no.~5, May 2006.\n\n\\bibitem{ScanParabola}\nY.~T.~Lo, ``On the beam deviation factor of a parabolic reflector'', \\emph{IRE Transactions on Antennas and Propagation}, vol.~8, no.~3, pp.~347--349, 1960.\n\n\\bibitem{Tailoring}\nY.~Ra'di, V.~S.~Asadchy, and S.~A.~Tretyakov, ``Tailoring reflections from thin composite metamirrors'', \\emph{IEEE Trans. Antennas Propagat.}, vol.~62, no.~7, pp.~3749--3760, July 2014. \n\n\\bibitem{FuncMetamirror}\nV.~S.~Asadchy, Y.~Ra'di, J.~Vehmas, and S.~A.~Tretyakov, ``Functional metamirrors using bianisotropic elements'', \\emph{Physical Review Letters}, vol.~114, no.~9,  pp.~0955031--0955035, March 2015. \n\n\n\\bibitem{MetamirrorConf}\nV.~S.~Asadchy, S.~N.~Tcvetkova, Y.~Ra'di, and S.~A.~Tretyakov, ``Highly efficient frequency-selective reflectarrays based on sub-wavelength elements'', in \\emph{36th ESA Antenna Workshop on ``Antennas and RF Systems for Space Science''}, Noordwijk, The Netherlands, Oct. 6--9, 2015.\n\n\\bibitem{ScanParabola2}\nM.~Zimmwrman, S.~W.~Lee, B.~Housmand, Y.~Rahmat-Samii, and R.~Acosta, ``A comparison of reflector antenna design for a wide-angle scanning'', \\emph{NASA Technical Memorandum 101459}, February 1989.\n\n\\bibitem{hfss}\nANSYS HFSS, 2014: www.ansoft.com.\n\n\\bibitem{AntennaHandbook}\nY.~Rahmat-Samii, ``Reflector antennas'' in {\\emph{Antenna Handbook}}, Y.~T.~Lo and S.~W.~Lee, Eds. New York: Van Nostrand Reinhold, 1988. \n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\n\n\n\n\n\n\\title{Scanning characteristics of metamirror antennas with sub-wavelength focal distance}\n\n\n\n\n\n\n\n\n\n\n\n\\author{Svetlana~N.~Tcvetkova,\n        Viktar~S.~Asadchy,\n        and~Sergei~A.~Tretyakov,~\\IEEEmembership{Fellow,~IEEE}\n\\thanks{The authors are with the Department of Radio Science and Engineering, Aalto University, FI-00076 Aalto, Finland (e-mails: svetlana.tcvetkova@aalto.fi; viktar.asadchy@aalto.fi\n\n).}\n\n\n}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\maketitle\n\n\n\n\\begin{abstract}\nWe investigate beam scanning by lateral feed displacement in novel metasurface based reflector antennas with extremely short focal distances. Electric field distributions of the waves reflected from the antenna are studied numerically and experimentally for defocusing angles up to 24$^\\circ$. The results show that despite extremely small focal distances, the scanning ability of metamirrors is similar to that of comparable reflectarrays. In addition to offering a possibility to realize extremely small focal distances, metamirror antennas are practically penetrable and invisible for any radiation outside of the operating frequency range.\n\n\n\n\n\n\n\n\n\\end{abstract}\n\n\n\\begin{IEEEkeywords}\nBeam-scanning, feed displacement, reflectarrays, metasurfaces.\n\\end{IEEEkeywords}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\IEEEpeerreviewmaketitle\n\n\n\n\\section{Introduction}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\IEEEPARstart{P}{ossibility} for beam scanning of reflector antennas is an important feature for radar technologies  and other applications. For passive reflectors, beam scanning or producing multiple beams can be accomplished through lateral feed displacement (Fig.~\\ref{fig:ang1}).\n\\begin{figure}[htp]\n{\\par\\centering\n \\subfloat[]{\n        \\includegraphics[width=0.3\\textwidth]{Paraboloid.pdf}\n        \\label{fig:ang1}}\\\\\n \\subfloat[]{\n        \\includegraphics[width=0.3\\textwidth]{MetamirrorAngles.pdf}\n        \\label{fig:ang2}}     \n  \\caption{Lateral feed displacement in reflectors: (a) parabolic antenna, (b) metasurface based reflector}\n}\\end{figure} \nGeometrical parameters of reflectors are usually defined by the ratio between the focal length and the diameter ($f/D$) or by the subtended angle $\\theta_0$ that equals to $\\theta_0=\\tan^{-1}(0.5 D/f)$ for reflectarrays and $\\theta_0=2\\tan^{-1}(0.25 D/f)$ for parabolic reflectors \\cite{ScanMicrostrip}. \nWhen the feed is laterally displaced from the focal point of the reflector at a defocusing angle $\\theta_d$, the scanned beam is deflected at the angle $\\theta_b$.\nThe beam deviation factor, which can be described as $BDF=\\theta_b/\\theta_d$ is always less than unity for all known reflector structures.\n\n\nConventional reflector antennas, allowing feed-displacement scanning, can be classified into parabolic reflectors and reflectarrays. \nDespite the very wide bandwidth, favourable for many applications, conventional parabolic reflectors possess also several drawbacks such as bulky and heavy structures as well as high fabrication cost (for large antennas). Furthermore, the focal distance of parabolic reflectors generally is much larger than the operational wavelength. Designing reflectors with a short focal distance (to reduce the profile size and weight of the structure) implies parabolic shapes with great depth that compromises the size of the reflector. The mentioned drawbacks of parabolic reflectors can be partially  overcome using planar printed reflectarrays that combine many favourable features of both parabolic reflectors and antenna arrays {\\cite{Reflectarray}}. \nUsually, reflectarrays are formed by  arrays of metal patches over a metal ground plane. \nAll the patches have the same shape but their dimensions are slightly varied.\nIn contrast to parabolic reflectors where the phase compensation is achieved due to proper shaping of the reflecting surface, the necessary phase variations in reflectarrays are achieved due to the different dimensions of the patches.\nPrinted reflectarrays possess such advantages as low profile and light weight, which makes them good candidates for space applications, as well as low price and simplicity of manufacturing. Due to the resonant nature, reflectarrays have limited bandwidth which in most cases does not exceed 15\\% \\cite{bandwidth,pozar11}. \n\n\nMany papers \\cite{ScanReflectarray,mmwave} describe properties of reflector antennas when the beam-scanning performance is accomplished by lateral displacement of the feed from the focal point. \nFeed displacement can cause substantial degradation of the far-field pattern due to phase aberrations.\nSuch observations have been made, for instance, for the case of a symmetric microstrip reflectarray fed by a horn antenna which operates in the microwave frequency range {\\cite{ScanReflectarray}}. Thus, reflector antennas are traditionally designed for limited scan angles because of phase errors which can cause loss in the gain and degradation of the beam \\cite{ScanParabola}, although some improved designs are known for the millimeter-waves range {\\cite{mmwave}}.\n\n\n\n\n\n\nRecently, a new type of reflector antennas was introduced, based on metasurfaces with deeply sub-wavelength thickness \\cite{Tailoring,FuncMetamirror}. The structure of these reflecting metasurfaces  excludes a continuous reflecting surface (ground plane) that, however, does not compromise the high performance of the reflector antenna in the operational frequency band. These new reflector antennas, called \\emph{metamirrors,} are practically transparent and invisible for any radiation with frequencies beyond the desired operational band.\nSuch a unique functionality can be of paramount importance for many different applications, such as reflector antennas for satellites incorporated with the solar panels (more than 95\\% of solar energy is expected to be delivered to the panels through the antenna). Another exciting potential application of metamirrors is creating multi-functional and multi-frequency antenna arrays which combine several independent thin layers\noperating at different frequencies and performing different functionalities (with the overall thickness still not exceeding the wavelength) \\cite{MetamirrorConf}. \nDue to their deeply sub-wavelength constituent elements, metamirrors demonstrate an ability to confine incident energy at an extremely short focal distance, less than the operating wavelength.\n\n\nHowever, so far, the scanning characteristics of metamirrors have not been studied. It is known that scanning abilities of conventional reflector antennas (parabolic reflectors and relfectarrays) significantly degrade when the focal distance is reduced \\cite{ScanParabola2}.\nThus, it could be expected that metamirrors with sub-wavelength focal distances would experience the problem of extremely high beam degradation when the feed is laterally displaced from the focal point. In reception regime, it could be expected that even a slight deviation of the incidence angle from the target value might lead to severe distortions of the focusing ability.  The goal of this work is to investigate beam-scanning properties of novel metamirrors with a sub-wavelength focal distance. We consider two examples of metamirrors emulating spherical and cylindrical lenses in reflection regime. They have the same focal distance but different aperture sizes. We demonstrate, both numerically and experimentally, that despite of the sub-wavelength focal distance, the metasurface based reflectors possess quite acceptable scanning properties suitable for many applications. Furthermore,  radiation patterns and other characteristics of the two metamirrors under study are compared and discussed. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Scanning properties of metamirrors}\n\n\\subsection{Ground-free reflector and principles of its operation}\n\n\nThe operation mechanism of metamirrors is drastically different from that of reflectarrays and other types of reflector antennas. In contrast to conventional reflectors, a metamirror does not include any ground plane and generally represents a planar array of sub-wavelength sized elements embedded for mechanical support in a low-permittivity dielectric material (see Fig.~\\ref{fig:planar}). \n\\begin{figure}[!]\n{\\par\\centering\n \\subfloat[]{\\includegraphics[width=0.25\\textwidth]{Planar.pdf}\n \\label{fig:planar}}\\\\\n \\subfloat[]{\\includegraphics[width=0.4\\textwidth]{Array.pdf}\n  \\label{fig:linear}}\n  \\caption{Metamirrors formed by specifically shaped copper elements embedded in a dielectric supporting material layer are marked as a green box. (a) A metamirror emulating a spherical lens in reflection. (b) A single row of the elements of a metamirror imitating a cylindrical lens in reflection.}\n \\label{fig:PlanarLinear}}\n\\end{figure}  \nIn conventional reflectors, such as reflectarrays, the required phase control is achieved through different sizes or shapes of the patch elements, while the high reflection amplitude is due to a continuous ground plane. Since metamirrors lack a ground plane, their elements perform double functionality. First, they radiate a unit-magnitude wave in the backward direction $\\mathbf{\\textit E}_{\\rm {back}}=e^{j\\phi}\\,\\mathbf{\\textit E}_{\\rm {inc}}$ with the prescribed non-uniform phase distribution. Second, in the forward direction, they scatter a plane wave (with a uniform phase) which is out-of-phase with the incident wave $\\mathbf{\\textit E}_{\\rm forw}=-\\mathbf{\\textit E}_{\\rm {inc}}$ to ensure their destructive interference and zero transmission. Such asymmetric scattering properties \\cite{FuncMetamirror} require both electric and magnetic currents induced in the elements. It was shown in \\cite{Tailoring} that the obvious choice, when the elements are realized as simple separated electric and magnetic dipole antennas, is not practical and disadvantageous. It follows from the fact that in this case the electric and magnetic dipole antennas should resonate at different frequencies with different specified amplitudes and be precisely tuned taking into account also their mutual parasitic interactions.\n\nA more effective and practical way to accomplish the required asymmetric scattering from a ground-free reflector is based on the use of small scatterers comprising both induced electric and magnetic currents in a single element. Such magnetoelectric elements comprise electrically polarizable straight wires which are connected to magnetically polarizable wire loops (see Fig.~\\ref{fig:linear}). \nChanging the ratio between the length of the straight wires and the diameter of the loop, it is possible to design an arbitrary phase from 0 to $2\\pi$ of the backscattered wave from the element.\n\nIn metamirrors the phase of backscattering from each element is adjusted individually in order to effectively manage wavefronts of reflection from the structure, maintaining the reflected wave amplitude at the unity value and the necessary phase of the wave scattered in the forward direction. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Metamirror emulating a spherical lens in reflection}\nWe consider a metamirror (Fig.~\\ref{fig:planar}) composed of 6 concentric arrays of sub-wavelength elements embedded in a dielectric support with $\\epsilon_r=1.03$ and $\\tan \\delta=0.0001$ \\cite{FuncMetamirror}.\nThe diameter and the focal distance of the metamirror are $2.8\\lambda$ and $0.65\\lambda$, respectively. The sub-wavelength focal distance implies a very small focal length to diameter ratio $f/D=0.23$ and a large subtended angle $\\theta_0=65^\\circ$.  \nThe scanning properties of this reflector were studied numerically. The prototype operating at 5~GHz was modelled with a commercial electromagnetic software \\cite{hfss}. \n\nBased on the reciprocity principle, the metasurface was illuminated by an obliquely incident plane wave and the displacement of the focal spot in reflection was studied. The angle of incidence $\\theta_b$ deviated from 0 to 15 degrees from the normal ($+z$-direction). \nThe power density distributions of the transmitted and the reflected waves normalized to the incident power density for different deviation angles are plotted  in Fig.~{\\ref{fig:HFSSresults}}.\n\\begin{figure}[h]\n{\\par\\centering\n\n", "index": 1, "text": "\\begin{gather*}{\n        \\includegraphics[width=0.3\\textwidth]{scale.pdf}} \n              \\end{gather*}\n", "mathml": "", "type": "latex"}]