[{"file": "1601.01964.tex", "nexttext": "\nwhere $\\mu_0$ is the permeability and $\\rho$ the density \\citep{M54}.  In this relation the existence of axisymmetric kinetic and\nmagnetic perturbations depends solely on the radial profile of the rotation law. \n The stability problem  of toroidal fields plus differential rotation in cylindric geometry has  been studied  by several authors often considering the perturbations as  axisymmetric,  \\citep{C61,HG62,C79,F84,K92,DK93,PP05,HS06,Sh06} . \n \n\n\nAfter (\\ref{mich}) solid-body rotation and\nall kinds of super-rotation (``positive radial shearÂ´Â´) are  {\\em stabilized}  by the magnetic field unless the field strongly increases outwards.  The profiles $B_\\phi\\propto 1/R$ (current-free between the cylinders) and $B_\\phi\\propto R$ ($z$-pinch, homogeneous axial electric-current, see \\citep{GP04}) cannot destabilize any form of super-rotation if only axisymmetric perturbations are considered. It has been demonstrated   that  for fields with $B_\\phi\\propto 1/R$ {\\em all}    Taylor-Couette flows  are stable against axisymmetric perturbations. The Azimuthal MagnetoRotational Instability (AMRI) is thus basically nonaxisymmetric \\citep{HS06}.\n\nTaylor-Couette flows with positive shear are the prototype of hydrodynamic stability, \\citep{W33,S57}. The more surprising is the finding that even weak magnetic toroidal fields  can easily destabilize  such flows if also nonaxisymmetric perturbations are taken into account, \\citep{SK15,R16}. We shall  even demonstrate that the radial profile of the fields -- if  not too steep -- does not play an important role to allow instability. On the other hand, the new  instability is a double-diffusive phenomenon which does not appear if the molecular viscosity and the molecular magnetic resistivity are of the same order.\n\n\n\\section{The  Equations}\n\nThe equations of the problem are \n\\begin{eqnarray}\n \\frac{\\partial {\\mbox{\\boldmath ${U}$}}}{\\partial t} + ({\\mbox{\\boldmath ${U}$}}\\cdot \\nabla){\\mbox{\\boldmath ${U}$}}& =& -\\frac{1}{\\rho} \\nabla P + \\nu \\Delta {\\mbox{\\boldmath ${U}$}} \n   + \\frac{1}{\\mu_0\\rho}{\\textrm{curl}}{\\mbox{\\boldmath ${B}$}} \\times {\\mbox{\\boldmath ${B}$}}\\nonumber\\\\\n \\frac{\\partial {\\mbox{\\boldmath ${B}$}}}{\\partial t}&=& {\\textrm{curl}} ({\\mbox{\\boldmath ${U}$}} \\times {\\mbox{\\boldmath ${B}$}}) + \\eta \\Delta{\\mbox{\\boldmath ${B}$}}  \n   \\label{mhd2}\n\\end{eqnarray}\nwith $  {\\textrm{div}}\\ {\\mbox{\\boldmath ${U}$}} = {\\textrm{div}}\\ {\\mbox{\\boldmath ${B}$}} = 0$ for an incompressible fluid.  ${\\mbox{\\boldmath ${U}$}}$ is the velocity, ${\\mbox{\\boldmath ${B}$}}$ the magnetic field, $P$ the \npressure, $\\nu$ the kinematic viscosity and $\\eta$ is the magnetic diffusivity.\nThe  basic state in the cylindric system with the coordinates $R,\\phi,z$ is $ U_R=U_z=B_R=B_z=0$ for the poloidal components and \n$\n  {\\it \\Omega}  = a_{\\it \\Omega}  + {b_{\\it \\Omega}}/{R^2} \n$\nfor the rotation law with the constants \n\\begin{eqnarray}\n a_{\\it \\Omega}=\\frac{\\mu_{\\it \\Omega}-r_{\\rm in}^2}{1-r_{\\rm in}^2}{\\it \\Omega}_{\\rm in}, {\\qquad} \n b_{\\it \\Omega}= \\frac{1-\\mu_{\\it \\Omega}}{1-r_{\\rm in}^2}{\\it \\Omega}_{\\rm in} R_{\\rm in}^2.\n \\label{ab} \n\\end{eqnarray}\nHere \n$\n r_{\\rm in}={R_{\\rm in}}/{R_{\\rm out}}$ \nwith $R_{\\rm in}$ and $R_{\\rm out}$ as the radii and  ${\\it \\Omega}_{\\rm in}$   as   the angular velocity of the inner cylinder.  With $\\mu_{\\it \\Omega}= {\\it \\Omega}_{\\rm out}/{\\it \\Omega}_{\\rm in}$ super-rotation is represented by $\\mu_{{\\it \\Omega}}>1$.\n\nFor the magnetic field the stationary solution is \n \\begin{eqnarray}\nB_\\phi=a_B R+\\frac{b_B}{R}.\n\\label{basicB} \n \\end{eqnarray}\nThe radial magnetic profile $B_\\phi\\propto R$ is due to an \napplied homogeneous axial electric current (`$z$-pinch') while $B_\\phi\\propto 1/R$  is current-free in the fluid. We define $\\mu_B=B_{\\rm out}/B_{\\rm in}$.\nAlmost always    $r_{\\rm in}=0.9$ is chosen. The current-free field is then given by $\\mu_B=0.9$ and the field in the $z$-pinch  is $\\mu_B=1.1$. \n\nThe dimensionless physical parameters of the system are the magnetic Prandtl number ${\\mbox{{Pm}}}$, the \nHartmann number ${\\mbox{{Ha}}}$ and the Reynolds number ${\\mbox{{Re}}}$, i.e. \n\\begin{eqnarray}\n {{\\mbox{{Pm}}}} = \\frac{\\nu}{\\eta}, {\\qquad}\n {{\\mbox{{Ha}}}} =\\frac{B_{\\rm in} D}{\\sqrt{\\mu_0\\rho\\nu\\eta}},  {\\qquad}\n {{\\mbox{{Re}}}} =\\frac{{\\it \\Omega}_{\\rm out} D^2}{\\nu}.\n\\label{pm}\n\\end{eqnarray}\n These three parameters combine to the magnetic Mach number  ${\\mbox{{Mm}}}=\\sqrt{{\\mbox{{Pm}}}}{\\mbox{{Re}}}/{\\mbox{{Ha}}}$ indicating whether the rotation energy dominates the magnetic energy or not.\n\n A  linear code is used to solve the set of ordinary differential equations for the radial functions of flow, field and pressure  which results after a Fourier mode transformation   $\nF=F(R){\\rm{exp}}\\bigl({\\rm{i}}(kz+m\\phi+\\omega t)\\bigr)$ of the fluctuations. The solutions are optimized with respect to the Reynolds number  for given Hartmann number  by varying the  wave number. Only  solutions for $|m|=1$ are discussed in this Letter.\nThe hydrodynamic boundary conditions  at the cylinder walls are assumed as  $u_R=u_\\phi=u_z=0$. The cylinders are made from perfect-conducting or -- in one case -- from insulating material. For the conducting walls the fluctuations ${\\mbox{\\boldmath ${b}$}}$ must fulfill \n${\\rm d} b_\\phi/{\\rm d}R + b_\\phi/R=b_R=0$ \nat both $R_{\\rm in}$ and $R_{\\rm out}$ so that ten boundary conditions exist for the set of ten differential equations  (see \\citep{R13}). For $B_z=0$ one can easily show that the system is degenerated under the transformation $m\\to -m$ so that all\neigenvalues (for specific ${\\mbox{{Re}}}$ and ${\\mbox{{Ha}}}$) are  valid for each pair $m=\\pm 1$.\n\n\n\n\n\n\n\n\n\n\\section{Azimuthal magnetorotational instability}\n\nWe start with rotation laws  where the outer cylinder rotates with higher frequency  than the inner cylinder.\n For the small magnetic Prandtl number of ${\\mbox{{Pm}}}=10^{-5}$ Fig. \\ref{fig1a}  presents    the lines of marginal instability (i.e. for vanishing growth rate) for the two rotation profiles  with $\\mu_{\\it \\Omega}=1.9$ and $\\mu_{\\it \\Omega}=2.3$. The magnetic field between the cylinders is fixed to the vacuum-type, $B_\\phi\\propto 1/R$. The form of the resulting  lines corresponds to the general form of the lines for the AMRI (with  sub-rotation)  where the line of marginal instability forms a tilted conus where  both branches have a positive slope, \\citep{H10,R13}.  Absolute   minima of the Hartmann number and the Reynolds number exist, below which  the rotation law is stable. Above the minima  the  instability domain is always limited by two critical values of the Hartmann number or the Reynolds number. For a given (supercritical) Reynolds number there is a minimum magnetic field for the instability and there is a maximum magnetic field  suppressing the instability.  Above the weak-field branch the rotational shear is too strong to support nonaxisymmetric perturbations.\n \\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.35\\textwidth]{pm5e90mu19.re.eps}\n\\caption{The instability  cones  for the two super-rotation profiles with $\\mu_{\\it \\Omega}=1.9$ (cross-hatched)  and $\\mu_{\\it \\Omega}=2.3$ (hatched).  ${\\mbox{{Pm}}}=10^{-5}$. $r_{\\rm in}=0.9$, $\\mu_B=0.9$, $m=\\pm 1$, perfect-conducting cylinders.} \n\\label{fig1a} \n\\end{figure}\n\n The magnetic Mach number for both curves is always smaller than unity hence   for instability the magnetic field must be  strong.\n\\begin{figure}[h]\n\\centering\n\\hbox{\n\\includegraphics[width=0.25\\textwidth]{e90.k.eps}\n\\includegraphics[width=0.235\\textwidth]{e90.rom.eps}}  \n\n\\caption{The wave numbers $kD$ (left panel) and  the  drift frequency $\\omega_{\\rm dr}/{\\it \\Omega}_{\\rm out}$ (right panel) along the lines of marginal instability for  ${\\mbox{{Pm}}}=10^{-5}$ ($\\mu_{\\it \\Omega}=5.0,  2.3, 1.9$, from left to right) and ${\\mbox{{Pm}}}=10$ ($\\mu_{\\it \\Omega}=5.0$). $r_{\\rm in}=0.9$, $\\mu_B=0.9$, $m=\\pm 1$, perfect-conducting cylinders.} \n\\label{fig1b} \n\\end{figure}\n\nTo become unstable the  flat rotation law with  $\\mu_{\\it \\Omega}=1.9$ requires much higher Hartmann numbers and Reynolds numbers than the steeper rotation law with $\\mu_{\\it \\Omega}=2.3$.  The  rotation law  with $\\mu_{\\it \\Omega}{\\lower.7ex\\hbox{$\\;\\stackrel{\\textstyle<}{\\sim}\\;$}} 1.9$ nowhere within the gap   reaches the minimum Rossby number ${\\rm Ro}=(1/2){\\rm d}\\log{\\it \\Omega}/{\\rm d}\\log R=4.8$ which is found by local approximations of the solution of (\\ref{mhd2}) as a lower limit  which should be   exceeded for instability \\citep{L06,SK15}. The reason might be that, as the plots also show,   this  Rossby number is by far not uniform over the radius for Taylor-Couette  flows. They also demonstrate  that a  lower  limit  does {not} exist for perfect-conducting boundaries at the mentioned value. It is clear, however, that for more and more flat rotation law the supercritical Reynolds numbers and Hartmann numbers are growing. The question is whether  a minimum value $\\mu_{\\it \\Omega}>1$ indeed exists for which the critical Reynolds number and Hartmann number reach infinity.  Whether such a limit  exists \nbelow    $\\mu_{\\it \\Omega}=1.9$  is not yet finally clear for numerical reasons.\n\n\\subsection{Wave numbers and  azimuthal pattern migration}\n\nThe left panel of Fig. \\ref{fig1b} gives the optimized wave numbers of the instability normalized with the gap width $D$ along the two branches of instability for small and large ${\\mbox{{Pm}}}$. The axial size of cell is $\\delta z/D\\simeq \\pi/k$. Cells with $k<\\pi$ are thus  prolate while cells with $k>\\pi$ are oblate with respect to the rotaion axis. The limit $k=\\pi$ for nearly spherical cells is marked by a horizontal dotted line. The plot demonstrates  that the cell geometry strongly depends on the magnetic Prandtl number. \nFor small ${\\mbox{{Pm}}}$ also the wave numbers are small hence the cells are prolate or spherical. Along the strong-field (lower) branch of the instability cone the wave numbers   exceed  those  at the low-field (upper) branch where  the cells are rather  long  in axial direction. \nFor ${\\mbox{{Pm}}}\\gg 1$, however, the wave numbers at both branches of the  conus are  larger than $\\pi$ so that    the cells are always very flat.\n\nAlso the drift rates  possess a strong ${\\mbox{{Pm}}}$-dependence. The drift values as given in  the right panel of Fig. \\ref{fig1b}  are the real  parts $\\omega_{\\rm dr}$ of the frequency $\\omega$ of the Fourier mode  of the instability, normalized with the rotation rate of the {\\em outer}  cylinder. Because of  \n$\n \\dot \\phi=-{\\omega_{\\rm dr}}/{m}\n $\nthe azimuthal migration has the opposite sign of  $\\omega_{\\rm dr}$.   For AMRI with negative shear  we always found that the pattern migrates for all ${\\mbox{{Pm}}}$ in positive  $\\phi$-direction  (\\citep{R14}). For Tayler instability under the influence of super-rotation  the  situation is more complicated as  the pattern counterrotates for small ${\\mbox{{Pm}}}$ while it corotates for ${\\mbox{{Pm}}}> 1$, \\citep{R16}. \n The plot in  Fig. \\ref{fig1b} shows similar results. For small ${\\mbox{{Pm}}}$   positive $\\omega_{\\rm dr}$ occur and the  perturbation pattern indeed  rotates {\\em backwards}. Large ${\\mbox{{Pm}}}$ provide negative drift values hence the pattern migrates with the  rotation.  For $\\omega_{\\rm dr}/ {\\it \\Omega}_{\\rm out}=-1 $  the pattern  rotates just as the outer cylinder  (only possible for large ${\\mbox{{Pm}}}$).\n\n\n\n\n\\subsection{Influences of the magnetic Prandtl number and  boundary conditions}\n\nFigure \\ref{fig1d} gives the coordinates of the locations with minimum Hartmann number  shown in Fig. \\ref{fig1a} for  $\\mu_{\\it \\Omega}=2.3$ but for various ${\\mbox{{Pm}}}$. One finds   that for ${\\mbox{{Pm}}}\\to 0$ both the Hartmann number and the Reynolds number converge (to  ${\\mbox{{Ha}}}\\simeq 400$ \nand ${\\mbox{{Re}}}\\simeq 2000$). The curves scale, therefore,  with ${\\mbox{{Ha}}}$ and ${\\mbox{{Re}}}$ for small ${\\mbox{{Pm}}}$, so that the numerical values of ${\\mbox{{Ha}}}$ and ${\\mbox{{Re}}}$ given in Fig. \\ref{fig1a} for ${\\mbox{{Pm}}}=10^{-5}$ (sodium) can also be used for  the smaller value of gallium.\n\nOn the other hand, for increasing ${\\mbox{{Pm}}}$ the minimum Hartmann number and the Reynolds number are (slightly) reduced. More important is that the curves stop at   ${\\mbox{{Pm}}}\\simeq 2\\cdot  10^{-3}$  indicating that  for higher values of ${\\mbox{{Pm}}}$  no  solutions unstable against perturbations with $m=1$ exist. For ${\\mbox{{Pm}}}>1$, however, the instability  resurrects with strikingly low Reynolds numbers (Fig. \\ref{fig1e}, right). The low Reynolds numbers ensure that also for large magnetic Prandtl numbers the magnetic Mach number remains smaller than unity. \nInstabilities  which only exist for $\\nu\\neq \\eta$ belong to the class of {\\em double-diffusive} instabilities \\citep{A78}. They do not appear for  ${\\mbox{{Pm}}}\\approx 1$.\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.35\\textwidth]{eta90.mu23.mm23.eps} \n\\caption{The minimum values of   ${\\mbox{{Ha}}}$ and their corresponding Reynolds numbers   from  the curves of marginal instability shown in Fig. \\ref{fig1a} for  $\\mu_{\\it \\Omega}=2.3$ vs.  ${\\mbox{{Pm}}}$. For ${\\mbox{{Pm}}}>2\\cdot  10^{-3}$  no solution exists.  For $r_{\\rm in}=0.8$ the  Hartmann numbers (crosses) and Reynolds numbers (squares)  for $\\mu_{\\it \\Omega}=4$ (up) and $\\mu_{\\it \\Omega}=128$ (down) are given but only for  ${\\mbox{{Pm}}}= 10^{-5}$. } \n\\label{fig1d} \n\\end{figure}\n\n\n\n\nTo find out how strong  the influence of the boundary condition is, \nFig. \\ref{fig1e} (left)  gives the instability map for $\\mu_{\\it \\Omega}=5$ for the two cases of perfect-conducting walls and insulating boundary conditions. The application of the rather steep rotation law with $\\mu_{\\it \\Omega}=5$ has only  numerical reasons, the magnetic Prandtl number of ${\\mbox{{Pm}}}=10^{-5}$ characterizes liquid sodium (for laboratory experiments). Note that  for vacuum boundaries the super-rotation laws are much more stable than for perfect-conducting conditions. For AMRI with negative shear the critical Hartmann numbers for both kinds of boundary conditions do only slightly differ (but also with higher values for vacuum conditions). The influence of the boundary conditions is also large if the instability of the $z$-pinch under the presence of differential rotation is considered. Often, however,  vacuum boundary conditions lead to a much easier excitation of the instability than the  conducting conditions do, see \\citep{R16}.\n\\begin{figure}\n\\centering\n\n\\hbox{ \n\\includegraphics[width=0.25\\textwidth]{e90mu5.re.eps} \\hfill\n\\includegraphics[width=0.25\\textwidth]{pm10e90mu5.re.eps} }\n\\caption{Instability maps for  $\\mu_{\\it \\Omega}=5$. Left panel:  ${\\mbox{{Pm}}}=10^{-5}$ for perfect-conducting   and insulating  cylinders. Right panel:  ${\\mbox{{Pm}}}=10$, perfect-conducting cylinders.  All curves of marginal instability fulfill the condition ${\\mbox{{Mm}}}<1$. $r_{\\rm in}=0.9$. } \n\\label{fig1e} \n\\end{figure}\n\nOne  finds from the Figs. \\ref{fig1a} -- \\ref{fig1e} the expected  trend with $\\mu_{\\it \\Omega}$ for the minimum Reynolds number. For perfect-conducting boundaries and ${\\mbox{{Pm}}}=10^{-5}$ it decreases from 3500 for the flat rotation law ($\\mu_{\\it \\Omega}=1.9$) to 250 for the steeper rotation law ($\\mu_{\\it \\Omega}=5$). \n\n\n\\section{Resting inner cylinder}\n\nA Taylor-Couette flow with resting inner cylinder is clearly the most simple model for super-rotating fluids. As it  also forms the  steepest radial profile ($\\mu_{\\it \\Omega}=\\infty$) we expect the  minimal Hartmann numbers which are suitable  for a laboratory experiment (with cylinders from conducting material).  The thin  red  line in Fig. \\ref{fig2a} valid   for the \n current-free field $B_\\phi\\propto 1/R$ and for ${\\mbox{{Pm}}}=10^{-5}$   provides a minimum Hartmann number of about 145. In order to transform this value to the necessary electric-current along the axis (i.e. within the inner cylinder) the well-known  relation $I_{\\rm axis}=5 R_{\\rm in} B_{\\rm in}$ can be rewritten as\n\\begin{eqnarray}\nI_{\\rm axis}= 5 \\frac{R_{\\rm in}}{D} \\ {\\mbox{{Ha}}}\\ \\sqrt{\\mu_0\\rho\\nu\\eta}=5\\ {{\\mbox{{Ha}}}_{\\rm in}}\\sqrt{\\mu_0\\rho\\nu\\eta},\n\\label{current} \n \\end{eqnarray}\nwith ${\\mbox{{Ha}}}_{\\rm in}$ as the Hartmann number after (\\ref{pm}) formed with $R_{\\rm in}$ instead  with the gap width $D$.  We find  ${\\mbox{{Ha}}}_{\\rm in}=1300$  or $I_{\\rm axis} \\simeq  53.5$ kAmp for liquid sodium  as the conducting fluid (with $\\sqrt{\\mu_0\\rho\\nu\\eta}\\simeq 8.2$ in c.g.s.). This is the minimum current for instability with the gap width $D=0.1$. \nAnother calculation for $D=0.2$ and $\\mu_{\\it \\Omega}=128$ presented in Fig. \\ref{fig1d} leads to     ${\\mbox{{Ha}}}_{\\rm in}=800$ with only 33 kAmp as  the critical electric-current. Though the size of the container  does  not  influence the critical value of the electric-current but the gap width does. The wider the gap the weaker the necessary current  which is necessary to excite  the AMRI for super-rotation.\n\nSofar we did not vary the radial profile $1/R$  of the magnetic background field. One of the new  questions is, however, how  sensitive the described instability of super-rotating fluids reacts on the presence of axial electric-currents within the fluid.\nIn addition to the current-free field, in Fig. \\ref{fig2a} the lines of marginal instability for the field $B_\\phi\\propto R$ of the  $z$-pinch  with uniform axial current are given for two different magnetic Prandtl numbers. As the new examples (thick lines) contain axial electric-current, the Tayler instability for ${\\mbox{{Re}}}=0$ appears at certain values ${\\mbox{{Ha}}}_{\\rm Tay}$ of the Hartmann number \\citep{T57,T73,V72,S12}, which themselves  do not change for changing ${\\mbox{{Pm}}}$  \\citep{RS10}.\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.40\\textwidth]{superrot_stab_eta09_new.eps} \n\\caption{Instability map for Taylor-Couette  flows with resting inner cylinder. The radial profiles of the azimuthal background fields vary from $\\mu_B=1.1$ \n($z$-pinch, thick lines) to $\\mu_B=0.9$ (AMRI,  thin lines). Blue color:  ${\\mbox{{Pm}}}=0.02$. Red color: ${\\mbox{{Pm}}}=10^{-5}$.  $r_{\\rm in}=0.9$,  perfect-conducting boundaries.} \n\\label{fig2a} \n\\end{figure}\n\nFor larger Reynolds numbers -- if the rotation becomes important -- one finds only little differences of the lines of marginal instability for the two  field  profiles with or without axial electric  background current in the fluid. The minimum Hartmann number for instability are slightly  reduced by the  currents but the differences are small. The main  result is that the magnetic-induced instability of super-rotation in MHD Taylor-Couette  flows does not strongly depend on the radial profile of the field. It already works for current-free fields but  axial electric-currents do not basically change  the system, which is even true for  the $z$-pinch with its uniform current density.\n\n\n\n\n\n\n\n\\begin{thebibliography}{17}\n\\bibitem[Velikhov  (1959)]{V59} E.P. Velikhov, Sov. Phys. JETP  {\\bf 36}, 995 (1959)\n\\bibitem[]{M54} D. Michael, Mathematica {\\bf 1}, 45 (1954)\n\\bibitem[]{C61} S. Chandrasekhar, {\\it Hydrodynamic and Hydromagnetic Stability} (Clarendon Press, Oxford, 1961)\n\\bibitem[]{HG62}L.N.  Howard \\& A.S. Gupta, JFM {\\bf 14}, 463 (1962)\n\\bibitem[]{C79}G.  Chanmugam, MNRAS {\\bf187}, 769 (1979)\n\\bibitem[]{F84}D. Fearn, GAFD {\\bf 30}, 227 (1984)\n\\bibitem[]{K92} E. Knobloch,  MNRAS {\\bf 255}, 25 (1992)\n\\bibitem[]{DK93} B. Dubrulle \\& E. Knobloch,  Astron. Astrophys. {\\bf 274}, 667 (1993)\n\\bibitem[]{PP05} M.E. Pessah  \\& D. Psaltis,  ApJ {\\bf 628}, 879 (2005)\n\\bibitem[]{HS06} I. Herron \\& F. Soliman,  Appl. Math. Lett. {\\bf 19}, 1113 (2006)\n\\bibitem[]{Sh06} D. Shalybkov,  Phys. Rev. E {\\bf 73}, 016302  (2006)\n\\bibitem[]{GP04} H. Goedbloed \\& S. Poedts, {\\it Principles of Magnetohydrodynamics} (Cambridge, University Press  2004)\n\\bibitem[Wendt (1933)]{W33} F. Wendt,  Ingenieur-Archiv {\\bf 4}, 577 (1933)\n\\bibitem[Schultz-Grunow (1957)]{S57} F. Schultz-Grunow,  ZAMM {\\bf 39}, 101 (1959)\n \\bibitem[R\\\"udiger et al. (2013)]{R13} G. R\\\"udiger,  L.L.  Kitchatinov,  \\&   R. Hollerbach, {\\it Magnetic Processes in Astrophysics} (Wiley-VCH, 2013) \n\\bibitem[Hollerbach et al. (2010)]{H10} R. Hollerbach, V. Teeluck, \\& G. R\\\"udiger, Phys. Rev. Lett. {\\bf 104}, 044502 (2010)\n\\bibitem[Liu et al.(2006)]{L06} W. Liu, J. Goodman, \\& I. Herron,  Phys. Rev. E. {\\bf 74}, 6302 (2006)\n \\bibitem[]{SK15} F. Stefani \\& O.  Kirillov, Phys. Rev. E {\\bf 92}, 051001(R) (2015)\n\\bibitem[R\\\"udiger et al. (2014)]{R14} G. R\\\"udiger, M. Gellert, M. Schultz,  et al.,  MNRAS {\\bf 438}, 271 (2014)\n\\bibitem[R\\\"udiger et al. (2016)]{R16} G. R\\\"udiger,  M. Schultz, M. Gellert, \\& F. Stefani,   Phys. Fluids, acc.. (2016)\n\\bibitem[Acheson (1978)]{A78} D.J. Acheson,   Phil. Trans. R. Soc. A {\\bf 289}, 459 (1978)\n\\bibitem[Tayler (1957)]{T57} R.J. Tayler,   Proc. Phys. Soc. {\\bf 70}, 31 (1957)\n\\bibitem[Tayler (1973)]{T73} R.J. Tayler,  MNRAS {\\bf 161}, 365 (1973)\n\\bibitem[Vandakurov (1972)]{V72} Y.V.  Vandakurov,  Sov. Astron. {\\bf 16}, 265 (1972)\n \\bibitem[Seilmayer et al. (2012)]{S12} M. Seilmayer,  F. Stefani, Th.  Gundrum,  et al.,   Phys. Rev. Lett. {\\bf 108}, 244501  (2010)\n \\bibitem[R\\\"udiger \\&  Schultz (2010)]{RS10} G. R\\\"udiger \\& M.  Schultz, Astron. Nachr. {\\bf 331}, 121 (2010)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 2813, "prevtext": "\n\\title[Taylor-Couette flow with positive shear]{Double-diffusive magnetorotational instability of super-rotation\\\\ under the influence of  azimuthal  magnetic fields\n       }\n\\author\n{G. R\\\"udiger\\email{gruediger@aip.de}, M. Gellert,\n M. Schultz\n}\n \\affiliation{Leibniz-Institut f\\\"ur Astrophysik Potsdam, An der Sternwarte 16, D-14482 Potsdam, Germany}\n\\author{F. Stefani}\n \\affiliation{Helmholtz-Zentrum Dresden-Rossendorf, PF 510119, 01314 Dresden, Germany}\n\n\n\n\\date{\\today}\n\n\n\n\n\n\n\n\n\n\\begin{abstract} \nIt is demonstrated that the  Azimuthal MagnetoRotational Instability (AMRI) also works with super-rotation contrary to the standard MRI for axial fields which {\\em requires} negative  shear. The stability against nonaxisymmetric perturbations  of a conducting Taylor-Couette flow with positive shear  under the\ninfluence of a toroidal magnetic field  is considered which can  indeed be   unstable even if the \nfield between the cylinders is current-free.  This phenomenon is identified  as  a double-diffusive instability which only  works for small or large   magnetic Prandtl number ${\\mbox{{Pm}}}$. For all ${\\mbox{{Pm}}}$ the unstable combinations of rotation and field  lead to magnetic Mach numbers below unity. For small ${\\mbox{{Pm}}}$ the curves of marginal instability in the Hartmann/Reynolds number plane  do not  differ for differing    ${\\mbox{{Pm}}}$. \n \n\nFor models with resting inner cylinder it is demonstrated that experiments to realize this form of  AMRI  with liquid sodium need axial electric currents of about 33 kAmp flowing inside the inner cylinder at $r_{\\rm in}=0.8$, independent of the global scales of  the container. \nMoreover,  the instability of the super-rotation with not too small Reynolds number is \nonly weakly influenced by the radial profile of the field. The lines of marginal instability are very similar for the fields with the profiles between $B_\\phi\\propto 1/R$ (`current-free')  and  $B_\\phi\\propto R$ (`$z$ pinch').\n\\end{abstract}\n\\maketitle\n\n\n\\section{Introduction}\n\nIn recent years instabilities in rotating conducting fluids under the influence of magnetic fields\nbecame of high interest. Especially in view of astrophysical applications  the consideration of\ndifferential rotation is relevant. It has been  known for a long time that differential rotation with\nnegative shear (`sub-rotation') becomes unstable under the influence of an axial field \\citep{V59}. \nWhen considered separately, both ingredients of the MagnetoRotational Instability (MRI), i.e. the axial field and also\nthe  Kepler rotation, are stable. The full system proves to be unstable if and only if the fluid is sub-rotating. \n\nFor ideal fluids the criterion of stability against axisymmetric perturbations  of differential rotation under the presence of {\\em toroidal} fields  reads \n\n", "index": 1, "text": "\\begin{equation}\n \\frac{1}{R^3}\\frac{{\\rm{d}}}{{\\rm{d}}R}(R^2{\\it \\Omega})^2-\\frac{R}{\\mu_0\\rho}\n \\frac{{\\rm{d}}}{{\\rm{d}}R}\\left( \\frac{B_{\\phi}}{R} \\right)^2 > 0,\n\\label{mich} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{R^{3}}\\frac{{\\rm{d}}}{{\\rm{d}}R}(R^{2}{\\it\\Omega})^{2}-\\frac{R}{\\mu_{%&#10;0}\\rho}\\frac{{\\rm{d}}}{{\\rm{d}}R}\\left(\\frac{B_{\\phi}}{R}\\right)^{2}&gt;0,\" display=\"block\"><mrow><mrow><mrow><mrow><mfrac><mn>1</mn><msup><mi>R</mi><mn>3</mn></msup></mfrac><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">d</mi><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>R</mi></mrow></mfrac><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mi>Ω</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo>-</mo><mrow><mfrac><mi>R</mi><mrow><msub><mi>μ</mi><mn>0</mn></msub><mo>⁢</mo><mi>ρ</mi></mrow></mfrac><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">d</mi><mrow><mi mathvariant=\"normal\">d</mi><mo>⁢</mo><mi>R</mi></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>B</mi><mi>ϕ</mi></msub><mi>R</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>&gt;</mo><mn>0</mn></mrow><mo>,</mo></mrow></math>", "type": "latex"}]