[{"file": "1601.07013.tex", "nexttext": ">$, at the irradiation plane & 7.9 MeV \\\\\nCollisional energy loss in air $S_{col}(<\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\title{Development of a dedicated beam forming system for material and bioscience research with high intensity, small field electron beam of {{LILLYPUT~3}} accelerator at Wroclaw Technology Park\n\\thanks{Presented at Jagiellonian Symposium of Fundamental and Applied Subatomic Physics, Krak{\\'o}w, 2015}\n}\n\n\n\\author{Przemys{\\l}aw Adrich\\thanks{przemyslaw.adrich@ncbj.gov.pl}, Arkadiusz Zaj\\k{a}c\n\\address{National Centre for Nuclear Research, {\\'S}wierk, Poland}\n\\\\\nPiotr Wilk\n\\address{Wroclaw Technology Park, Wroc{\\l}aw, Poland}\n\\\\\nMaciej Chorowski, Jaros{\\l}aw Poli{\\'n}ski, Piotr Bogdan\n\\address{Wroc{\\l}aw University of Technology, Wroc{\\l}aw, Poland}\n}\n\\maketitle\n\\begin{abstract}\nThe primary use of the {{LILLYPUT~3}} accelerator at the Nondestructive Testing Laboratory at Wroclaw Technology Park is \\mbox{X-ray} radiography for nondestructive testing, including R\\&D of novel techniques for industrial and medical imaging.\nThe scope of possible applications could be greatly extended by providing a system for irradiation with electron beam. The purpose of this work was to design such a system, especially for high dose rate, small field irradiations under cryogenic conditions for material and bioscience research.\nIn this work, two possible solutions, based either on beam scanning or scattering and collimation, were studied and compared. It was found that under existing conditions efficiency of both systems would be comparable. The latter one was adopted due to its simplicity and much lower cost. The system design was optimized by means of detailed Monte Carlo modeling. The system is being currently fabricated at National Centre for Nuclear Research in {\\'S}wierk.\n\\end{abstract}\n\\PACS{02.70.Uu, 07.05.Tp, 29.27.Eg, 89.20.Bb}\n\n\n\n\n\n\n\\section{Introduction and motivation}\nThe {{LILLYPUT~3}} accelerator belongs to the line of radiographic electron linear accelerators developed and produced commercially by the National Centre for Nuclear Research (NCBJ). Recently an accelerator of this kind was delivered, installed and commissioned at the Nondestructive Testing Laboratory (NDT) at Wroclaw Technology Park (WPT). In a standard, radiographic configuration {{LILLYPUT~3}} delivers a selectable 6 or 9~MV \\mbox{X-ray} beams. The system delivered to Wroclaw is complete with a digital imaging system and an automatized object table, both designed and produced at NCBJ. The complete system is presented in Fig.~\\ref{fig:Lillyput3}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.8\\columnwidth]{fig_1.jpg}\n  \\caption{\\small The {{LILLYPUT~3}} system in a standard radiographic configuration installed at Nondestructive Testing Laboratory at Wroclaw Technology Park. The accelerator is visible on the left, the object table in the center and digital imaging system to the right.}\n  \\label{fig:Lillyput3}\n\\end{figure}\n\nThe functionality of the accelerator, and thus the scope of its application and overall utilization of the NDT laboratory, could be enhanced by providing a system for irradiation with electron beam. Such a system is not part of the standard configuration of the {{LILLYPUT~3}}, although the construction of the accelerator can, with minor modifications, accommodate it.\nIt is the purpose of this work to design a system for electron beam irradiation for the {{LILLYPUT~3}} accelerator at NDT.\nThis development is specifically motivated by research planned at NDT in the area of novel insulator materials capable of withstanding absorbed doses of radiation in the range of tens of MGy. \nThe secondary motivation for this work includes R\\&D into sterilization of novel, polymer based medical products and studies of structure modifications of irradiated polymers. For polymer irradiations, absorbed doses in the range of tens of kGy are sufficient.\n\n\n\\section{Purpose of the beam forming system}\nApart from the source of energetic electron beam, i.e. the accelerator, a key component of an electron irradiation system is the beam forming system. As schematically illustrated in Fig.~\\ref{fig:beam_forming_purpose}, the purpose of the electron beam forming system is to transform the primary ``pencil'' beam delivered by a linear electron accelerator with typically a Gaussian profile of FWHM$\\approx2-3$~mm, into a wide (FWHM on the order of centimeters to tens of centimeters) and uniformly distributed beam as required in any practical application.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.9\\columnwidth]{fig_2.jpg}\n  \\caption{\\small Schematic comparison of electron beam fluence distribution of the primary ``pencil'' beam with FWHM=3~mm, accelerated in an electron accelerator (to the left) and a desired beam at an irradiation plane (to the right) with FWHM=80~mm. The purpose of the beam forming system is to transform the former into the latter.}\n  \\label{fig:beam_forming_purpose}\n\\end{figure}\n\n\n\\section{Specific requirements and constraints on the electron beam forming system at NDT}\n\\label{sec:requirements}\nThe research planned at NDT requires delivery of 9~MeV electron beam with as high as possible dose rate at the irradiation plane and at the same time flattened to within few percent over a field of $\\phi=82$~mm diameter. The samples for the irradiation are going to be kept under cryogenic conditions, in a LN$_2$ cryostat. The electron beam has to be delivered directly to the surface of a sample inside of the cryostat. This is going to be achieved by means of an applicator tube that tightly fits in an opening of the cryostat. The applicator tube has to be filled either with vacuum or with helium gas in order to avoid vapor condensation inside the tube and on a thin window separating the inside of the applicator from the inside of the cryostat.\nDue to mechanical constraints, the distance between the accelerator exit window and the irradiation plane inside the cryostat cannot be shorter than 400~mm. Fig.~\\ref{fig:cryostat_applicator_3d} shows a 3D visualization of the cryostat (dark blue object to the right), the electron beam applicator (gray tube connected to the cryostat from the left) and parts of the accelerator assembly, namely beam focusing coils and target chamber equipped with 50~$\\mu$m thick beam exit window made of titanium foil. Dismounting of the titanium exit window, although beneficial in one of the contemplated solutions of the beam forming system, was excluded from consideration as it is a complex operation that brings risk of major disruption of the NDT operations.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.5\\columnwidth]{fig_3.jpg}\n  \\caption{\\small 3D visualization of an applicator tube (labeled ``1'') attached to the LN$_2$ cryostat (``2'') and part of the {{LILLYPUT~3}} accelerator: beam focusing coils (``3'') and target chamber with titanium beam exit window (``4''). Also visible is an X-ray beam collimator (``5''), moved to the side of the beam axis to make space for the electron beam forming system.}\n  \\label{fig:cryostat_applicator_3d}\n\\end{figure}\n\n\n\n\\section{Possible solutions of the electron beam forming system}\nThe problem of forming a usable electron beam can be addressed in two different ways. The first possible solution is beam scanning, schematically depicted in the left side of Fig.~\\ref{fig:activeVSpassive}. \n\\begin{figure}[!bth]\n  \\centering\n\t\\includegraphics[width=1.0\\columnwidth]{fig_4.jpg}\n  \\caption{\\small Two possible solutions of electron beam forming - a beam scanning system (left) and a scattering and collimation system (right).}\n  \\label{fig:activeVSpassive}\n\\end{figure}\nIn this solution, the beam exiting the linac is deflected by magnetic field. The field oscillates in time in such a way that the beam spot on the irradiation plane cyclically moves over entire irradiation field, resulting in a uniform beam fluence.\t \nThis kind of beam forming is common in industrial applications of electron beams \\cite{Scharf1989,Hamm2012}, although in these applications the beam is scanned along one axis only.\nBeam scanning is known to be very efficient as the losses of the beam on the way from the accelerator to the irradiation plane could be kept minimal,  provided that the beam is transported in vacuum. On the other hand the scanning systems are relatively complex both in construction and in control of the operation and it is not trivial to achieve uniform dose distribution, especially if the beam is to be scanned in two dimensions.\n\nThe second possible solution to the problem of electron beam forming, known as a passive one, is schematically depicted in the right side of Fig.~\\ref{fig:activeVSpassive}. In a passive system, the beam fluence at the irradiation plane is flattened by means of spreading the primary electron beam in a set of foils and subsequent collimation of the scattered beam to the area of the irradiation field. Due to the nature of this solution, the passive systems are generally less efficient than scanning systems as far as the beam transmission is considered. The main advantages of the passive systems are simplicity of construction and reliability of operation. In addition, in these systems it is relatively easy to achieve exceptionally well flattened beam. The passive systems are found in all modern medical electron accelerators for electron beam therapy, in many proton therapy facilities, as well as, in some research accelerators.\n\n\n\\section{Estimated efficiency of a scanning system under conditions at NDT Laboratory}\n\\label{sec:analysis_scanning}\nThe scanning beam system would be the most appropriate for the facility aiming at performing high dose rate irradiations. However, in case of the {{LILLYPUT~3}}  accelerator at NDT, to fully exploit the potential of a scanning system, the accelerator exit window would have to be removed prior to the installation of the system. As discussed in Sec.~\\ref{sec:requirements}, this is not possible. \n\nTo assess a realistically achievable efficiency of a potential scanning system, we first performed a Monte Carlo calculation of beam spot broadening due to interactions with window material. A simulated system is schematically depicted in Fig.~\\ref{fig:scanning_reality_check}. To minimize electron scattering in the air, an additional vacuum chamber was included. This vacuum chamber was assumed to have an entrance window identical to the exit window of the accelerator, i.e. made of 50~$\\mu$m thick titanium foil. There is 1~cm space between both windows in order to allow for air cooling, what would be necessary to avoid thermal breaking of these thin windows.  As illustrated in the figure, calculations revealed, that the FWHM of the beam spot at the irradiation plane would be 45~mm. \n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=1.0\\columnwidth]{fig_5.jpg}\n  \\caption{\\small A simplified model to analyse realistic efficiency of the scanning beam solution in which the primary ``pencil'' beam has to be transported through two 50~$\\mu$m thick titanium vacuum windows. Left side: a model of the system. Below the model, beam fluence distribution on exit from the accelerator (FWHM$\\approx$3~mm) and on the irradiation plane (FWHM$\\approx$45~mm) as calculated with a Monte Carlo method. Right side: beam fluence distribution calculated as a sum of nine Gaussian distributions each with FWHM=45~mm positioned in a 3x3 matrix, adopted as a simple approximation of beam scanning. On top of the distribution a $\\phi$=82 mm field is indicated.} \n  \\label{fig:scanning_reality_check}\n\\end{figure}\nReasonably flat fluence distribution can still be achieved by scanning such a broad beam. However, the efficiency of the system would be about 30\\% only, as nearly 70\\% of beam electrons would miss the irradiation field (as illustrated in the right side of Fig.~\\ref{fig:scanning_reality_check}). A similar efficiency can be achieved in a much simpler, passive beam forming system, discussed below. \n\n\n\\section{Dual-foil beam forming system}\nIn a passive beam forming system, schematically depicted in the right side of Fig.~\\ref{fig:activeVSpassive}, the narrow ``pencil'' electron beam extracted from a linear accelerator, is first scattered in a thin, flat foil made of a high-Z material. This foil is commonly referred to as the scattering foil. A second foil, known as flattening foil, which optimally has a Gaussian radial thickness profile, $h(r) = H\\exp(-r^2/R^2)$, is located at some distance, usually on the order of few centimeters, downstream from the primary foil. The parameters $H$ and $R$ depend on beam energy, field size, geometry and materials of the system. In the flattening foil, due to its variable thickness, the electrons near the beam axis (small $r$), where the foil is thickest, are most scattered, while the electrons at larger radial distance, $r$, from the beam axis are less scattered. As shown in e.g. \\cite{AbouMandour1978, Grusell1994, Kainz2005, Adrich2014}, such an arrangement results in a flat fluence profile on the irradiation plane within the area of the irradiation field. Without any collimation device, electron fluence outside the field is substantial and decreases slowly with increasing distance from the beam axis. This is not desired in practical applications, therefore the beam formed in the foils is usually collimated to the area of the irradiation field, by means of an appropriate collimator and/or applicator.\n\n\n\n\\section{Design of the dual-foil beam forming system for the {{LILLYPUT~3}}  accelerator at NDT}\nTo design a system that would maximize the beam transport efficiency, while conforming to all requirements and constraints discussed in Sec.~\\ref{sec:requirements}, a model of system geometry was constructed and its performance was assessed by means of Monte Carlo calculations of beam transport through the model. \n\\begin{figure}[!bth]\n  \\centering\n\t\\includegraphics[width=0.8\\columnwidth]{fig_6.jpg}\n  \\caption{\\small 3D visualization (top) and side view (bottom) of the Geant4 model of the system.} \n  \\label{fig:Geant4_model}\n\\end{figure}\nFig.~\\ref{fig:Geant4_model} shows a visualization of Geant4 \\cite{Agostinelli2003} model of the beam forming system constructed in this work. The model includes all system components that are relevant to the forming of the beam, i.e. the components with which the beam electrons can interact on the way to the irradiation plane. Those are, in order from the left to the right in Fig.~\\ref{fig:Geant4_model}, 50~$\\mu$m titanium exit window, 0.01~mm tantalum scattering foil, Gaussian profiled aluminum flattening foil mounted on top of a steel flange on entrance side of the applicator tube, steel applicator tube, aluminum holder of a beam monitoring device located inside of the applicator tube. The medium between foils is air. The applicator is filled with helium gas under atmospheric pressure. As discussed in Sec.~\\ref{sec:requirements}, helium atmosphere is to avoid vapor condensation inside of the applicator. This has to be accounted for in the simulation due to much lower scattering power of helium as compared to air \\cite{ICRU1984}. The steel flange and an aluminum holder of the beam monitor are included because they effectively act as a beam collimator. A thin titanium exit window at the end of the applicator is not included in the simulation as it has negligible influence on the beam fluence at the irradiation plane that is right next to it.\\\\\nBased on the results of Monte Carlo simulations all important parameters of the system are optimized. The method used for the design optimization is discussed in detail elsewhere \\cite{Adrich2015}. In short, in this method, optimal values of all system parameters, besides the parameters $H$ and $R$ describing the shape of the flattening foil, are first settled based on a set of simple rules and recipes. Then, in order to establish optimal values of $H$ and $R$, i.e. values that minimize the flatness of the beam fluence distribution over the irradiation field, the $H$ and $R$ are varied in small steps over reasonable ranges. At each step, the beam fluence distribution is calculated using the Monte Carlo model mentioned above. Flatness of the calculated fluence distribution is quantified as $f = (\\phi_{max}/\\phi_{min} - 1)\\cdot100\\%$, where $\\phi_{max}$ and $\\phi_{min}$ are, respectively, the maximum and miniumum of the fluence distribution within the irradiation field. At the end, the flatness, $f$, calculated separately at each step, is plotted as a function, $f(H,R)$, of the parameters $H$ and $R$, as shown in Fig.~\\ref{fig:HR_scan}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.95\\columnwidth]{fig_7.jpg}\n  \\caption{\\small Flatness, $f(H,R)$, of the Monte Carlo calculated electron fluence distribution at the irradiation field plotted as a function of the flattening foil thickness profile parameters $H$ and $R$. Contours indicate, as labeled, areas of flatness below 5\\%, 10\\% and 15\\%. A point of practically optimal values of $H$ (1.5~mm) and $R$ (6~mm) is indicated with a star.}\n  \\label{fig:HR_scan}\n\\end{figure}\nOptimal flattening foil should minimize $f(H,R)$ while keeping $H$, the parameter describing thickness of the flattening foil, as small as possible in order to simultaneously minimize beam energy loss in the foil. It is evident from the plot in Fig.~\\ref{fig:HR_scan}, that optimal flattening foil has $H\\approx{}1.5$~mm and $R\\approx{}6$~mm.\\\\\nThe electron fluence distribution, calculated at the irradiation plane for the optimized beam forming system, is shown in left panel of Fig.~\\ref{fig:Fluence_Espectrum}. The beam is nearly perfectly flattened within the irradiation field. The flatness of this distribution for $r<41$~mm (i.e. over the $\\phi{}=82$~mm field) is only 1.6\\%. In the right panel of the same figure, the energy spectrum of electrons impinging on the irradiation plane within the irradiation field is shown. The mean of this energy spectrum, $<E>=7.9$~MeV, is one of the inputs for estimation of the dose rate (see Sec.~\\ref{sec:dose_rate_estimation}). The transport efficiency, calculated as a ratio of the number of electrons registered, in the Monte Carlo calculation, within the irradiation field to the number of initial source electrons, amounts to about 39\\%, thus is higher than the one estimated for a beam scanning system analyzed in Sec.~\\ref{sec:analysis_scanning}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.47\\columnwidth]{fig_8a.jpg}\n\t\\includegraphics[width=0.47\\columnwidth]{fig_8b.jpg}\n  \\caption{\\small Fluence distribution and energy spectrum of electrons at the irradiation plane resulting in an optimized dual-foil beam forming system.} \n  \\label{fig:Fluence_Espectrum}\n\\end{figure}\n\n\n\\section{Dose rate estimation}\n\\label{sec:dose_rate_estimation}\nResults of the Monte Carlo calculations mentioned above, in conjunction with known parameters of the {{LILLYPUT~3}}  accelerator, allows for estimation of the expected dose rate, $\\dot{D}$, at the irradiation field.\nThe parameters used in the estimation are summarized in Table~\\ref{tab:parameters}.\nFrom the data in Table~\\ref{tab:parameters}, one can expect beam flux at the irradiation plane to be $9.2\\cdot10^{11}$~\\mbox{electrons/s$\\cdot$cm$^2$}. Multiplying the flux by dose deposited per electron, one can estimate the total dose rate to be about $\\dot{D}=17$~kGy/min or 1~MGy/h. The assumed beam current of 50~\\mbox{mA/imp} is in fact rather conservative assumption, as the {{LILLYPUT~3}} can run stably with twice as high beam current. Upper limit for $\\dot{D}$ is therefore about 34~kGy/min or 2~MGy/h.\n\n\\begin{table}[!hbt]\n\\centering\n\\begin{tabular}{l|c} \\hline\n\\hline\nInitial beam current & 50 mA/imp \\\\\nPulse duration & 4 $\\mu$s \\\\\nPulse repetition & 100 Hz \\\\\nTransmission efficiency & 39 \\% \\\\\n\\hline\nMean energy, $<\n", "index": 1, "text": "$$E$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"E\" display=\"block\"><mi>E</mi></math>", "type": "latex"}, {"file": "1601.07013.tex", "nexttext": ">$, at the irradiation plane & 7.9 MeV \\\\\nCollisional energy loss in air $S_{col}(<\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\n\\title{Development of a dedicated beam forming system for material and bioscience research with high intensity, small field electron beam of {{LILLYPUT~3}} accelerator at Wroclaw Technology Park\n\\thanks{Presented at Jagiellonian Symposium of Fundamental and Applied Subatomic Physics, Krak{\\'o}w, 2015}\n}\n\n\n\\author{Przemys{\\l}aw Adrich\\thanks{przemyslaw.adrich@ncbj.gov.pl}, Arkadiusz Zaj\\k{a}c\n\\address{National Centre for Nuclear Research, {\\'S}wierk, Poland}\n\\\\\nPiotr Wilk\n\\address{Wroclaw Technology Park, Wroc{\\l}aw, Poland}\n\\\\\nMaciej Chorowski, Jaros{\\l}aw Poli{\\'n}ski, Piotr Bogdan\n\\address{Wroc{\\l}aw University of Technology, Wroc{\\l}aw, Poland}\n}\n\\maketitle\n\\begin{abstract}\nThe primary use of the {{LILLYPUT~3}} accelerator at the Nondestructive Testing Laboratory at Wroclaw Technology Park is \\mbox{X-ray} radiography for nondestructive testing, including R\\&D of novel techniques for industrial and medical imaging.\nThe scope of possible applications could be greatly extended by providing a system for irradiation with electron beam. The purpose of this work was to design such a system, especially for high dose rate, small field irradiations under cryogenic conditions for material and bioscience research.\nIn this work, two possible solutions, based either on beam scanning or scattering and collimation, were studied and compared. It was found that under existing conditions efficiency of both systems would be comparable. The latter one was adopted due to its simplicity and much lower cost. The system design was optimized by means of detailed Monte Carlo modeling. The system is being currently fabricated at National Centre for Nuclear Research in {\\'S}wierk.\n\\end{abstract}\n\\PACS{02.70.Uu, 07.05.Tp, 29.27.Eg, 89.20.Bb}\n\n\n\n\n\n\n\\section{Introduction and motivation}\nThe {{LILLYPUT~3}} accelerator belongs to the line of radiographic electron linear accelerators developed and produced commercially by the National Centre for Nuclear Research (NCBJ). Recently an accelerator of this kind was delivered, installed and commissioned at the Nondestructive Testing Laboratory (NDT) at Wroclaw Technology Park (WPT). In a standard, radiographic configuration {{LILLYPUT~3}} delivers a selectable 6 or 9~MV \\mbox{X-ray} beams. The system delivered to Wroclaw is complete with a digital imaging system and an automatized object table, both designed and produced at NCBJ. The complete system is presented in Fig.~\\ref{fig:Lillyput3}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.8\\columnwidth]{fig_1.jpg}\n  \\caption{\\small The {{LILLYPUT~3}} system in a standard radiographic configuration installed at Nondestructive Testing Laboratory at Wroclaw Technology Park. The accelerator is visible on the left, the object table in the center and digital imaging system to the right.}\n  \\label{fig:Lillyput3}\n\\end{figure}\n\nThe functionality of the accelerator, and thus the scope of its application and overall utilization of the NDT laboratory, could be enhanced by providing a system for irradiation with electron beam. Such a system is not part of the standard configuration of the {{LILLYPUT~3}}, although the construction of the accelerator can, with minor modifications, accommodate it.\nIt is the purpose of this work to design a system for electron beam irradiation for the {{LILLYPUT~3}} accelerator at NDT.\nThis development is specifically motivated by research planned at NDT in the area of novel insulator materials capable of withstanding absorbed doses of radiation in the range of tens of MGy. \nThe secondary motivation for this work includes R\\&D into sterilization of novel, polymer based medical products and studies of structure modifications of irradiated polymers. For polymer irradiations, absorbed doses in the range of tens of kGy are sufficient.\n\n\n\\section{Purpose of the beam forming system}\nApart from the source of energetic electron beam, i.e. the accelerator, a key component of an electron irradiation system is the beam forming system. As schematically illustrated in Fig.~\\ref{fig:beam_forming_purpose}, the purpose of the electron beam forming system is to transform the primary ``pencil'' beam delivered by a linear electron accelerator with typically a Gaussian profile of FWHM$\\approx2-3$~mm, into a wide (FWHM on the order of centimeters to tens of centimeters) and uniformly distributed beam as required in any practical application.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.9\\columnwidth]{fig_2.jpg}\n  \\caption{\\small Schematic comparison of electron beam fluence distribution of the primary ``pencil'' beam with FWHM=3~mm, accelerated in an electron accelerator (to the left) and a desired beam at an irradiation plane (to the right) with FWHM=80~mm. The purpose of the beam forming system is to transform the former into the latter.}\n  \\label{fig:beam_forming_purpose}\n\\end{figure}\n\n\n\\section{Specific requirements and constraints on the electron beam forming system at NDT}\n\\label{sec:requirements}\nThe research planned at NDT requires delivery of 9~MeV electron beam with as high as possible dose rate at the irradiation plane and at the same time flattened to within few percent over a field of $\\phi=82$~mm diameter. The samples for the irradiation are going to be kept under cryogenic conditions, in a LN$_2$ cryostat. The electron beam has to be delivered directly to the surface of a sample inside of the cryostat. This is going to be achieved by means of an applicator tube that tightly fits in an opening of the cryostat. The applicator tube has to be filled either with vacuum or with helium gas in order to avoid vapor condensation inside the tube and on a thin window separating the inside of the applicator from the inside of the cryostat.\nDue to mechanical constraints, the distance between the accelerator exit window and the irradiation plane inside the cryostat cannot be shorter than 400~mm. Fig.~\\ref{fig:cryostat_applicator_3d} shows a 3D visualization of the cryostat (dark blue object to the right), the electron beam applicator (gray tube connected to the cryostat from the left) and parts of the accelerator assembly, namely beam focusing coils and target chamber equipped with 50~$\\mu$m thick beam exit window made of titanium foil. Dismounting of the titanium exit window, although beneficial in one of the contemplated solutions of the beam forming system, was excluded from consideration as it is a complex operation that brings risk of major disruption of the NDT operations.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.5\\columnwidth]{fig_3.jpg}\n  \\caption{\\small 3D visualization of an applicator tube (labeled ``1'') attached to the LN$_2$ cryostat (``2'') and part of the {{LILLYPUT~3}} accelerator: beam focusing coils (``3'') and target chamber with titanium beam exit window (``4''). Also visible is an X-ray beam collimator (``5''), moved to the side of the beam axis to make space for the electron beam forming system.}\n  \\label{fig:cryostat_applicator_3d}\n\\end{figure}\n\n\n\n\\section{Possible solutions of the electron beam forming system}\nThe problem of forming a usable electron beam can be addressed in two different ways. The first possible solution is beam scanning, schematically depicted in the left side of Fig.~\\ref{fig:activeVSpassive}. \n\\begin{figure}[!bth]\n  \\centering\n\t\\includegraphics[width=1.0\\columnwidth]{fig_4.jpg}\n  \\caption{\\small Two possible solutions of electron beam forming - a beam scanning system (left) and a scattering and collimation system (right).}\n  \\label{fig:activeVSpassive}\n\\end{figure}\nIn this solution, the beam exiting the linac is deflected by magnetic field. The field oscillates in time in such a way that the beam spot on the irradiation plane cyclically moves over entire irradiation field, resulting in a uniform beam fluence.\t \nThis kind of beam forming is common in industrial applications of electron beams \\cite{Scharf1989,Hamm2012}, although in these applications the beam is scanned along one axis only.\nBeam scanning is known to be very efficient as the losses of the beam on the way from the accelerator to the irradiation plane could be kept minimal,  provided that the beam is transported in vacuum. On the other hand the scanning systems are relatively complex both in construction and in control of the operation and it is not trivial to achieve uniform dose distribution, especially if the beam is to be scanned in two dimensions.\n\nThe second possible solution to the problem of electron beam forming, known as a passive one, is schematically depicted in the right side of Fig.~\\ref{fig:activeVSpassive}. In a passive system, the beam fluence at the irradiation plane is flattened by means of spreading the primary electron beam in a set of foils and subsequent collimation of the scattered beam to the area of the irradiation field. Due to the nature of this solution, the passive systems are generally less efficient than scanning systems as far as the beam transmission is considered. The main advantages of the passive systems are simplicity of construction and reliability of operation. In addition, in these systems it is relatively easy to achieve exceptionally well flattened beam. The passive systems are found in all modern medical electron accelerators for electron beam therapy, in many proton therapy facilities, as well as, in some research accelerators.\n\n\n\\section{Estimated efficiency of a scanning system under conditions at NDT Laboratory}\n\\label{sec:analysis_scanning}\nThe scanning beam system would be the most appropriate for the facility aiming at performing high dose rate irradiations. However, in case of the {{LILLYPUT~3}}  accelerator at NDT, to fully exploit the potential of a scanning system, the accelerator exit window would have to be removed prior to the installation of the system. As discussed in Sec.~\\ref{sec:requirements}, this is not possible. \n\nTo assess a realistically achievable efficiency of a potential scanning system, we first performed a Monte Carlo calculation of beam spot broadening due to interactions with window material. A simulated system is schematically depicted in Fig.~\\ref{fig:scanning_reality_check}. To minimize electron scattering in the air, an additional vacuum chamber was included. This vacuum chamber was assumed to have an entrance window identical to the exit window of the accelerator, i.e. made of 50~$\\mu$m thick titanium foil. There is 1~cm space between both windows in order to allow for air cooling, what would be necessary to avoid thermal breaking of these thin windows.  As illustrated in the figure, calculations revealed, that the FWHM of the beam spot at the irradiation plane would be 45~mm. \n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=1.0\\columnwidth]{fig_5.jpg}\n  \\caption{\\small A simplified model to analyse realistic efficiency of the scanning beam solution in which the primary ``pencil'' beam has to be transported through two 50~$\\mu$m thick titanium vacuum windows. Left side: a model of the system. Below the model, beam fluence distribution on exit from the accelerator (FWHM$\\approx$3~mm) and on the irradiation plane (FWHM$\\approx$45~mm) as calculated with a Monte Carlo method. Right side: beam fluence distribution calculated as a sum of nine Gaussian distributions each with FWHM=45~mm positioned in a 3x3 matrix, adopted as a simple approximation of beam scanning. On top of the distribution a $\\phi$=82 mm field is indicated.} \n  \\label{fig:scanning_reality_check}\n\\end{figure}\nReasonably flat fluence distribution can still be achieved by scanning such a broad beam. However, the efficiency of the system would be about 30\\% only, as nearly 70\\% of beam electrons would miss the irradiation field (as illustrated in the right side of Fig.~\\ref{fig:scanning_reality_check}). A similar efficiency can be achieved in a much simpler, passive beam forming system, discussed below. \n\n\n\\section{Dual-foil beam forming system}\nIn a passive beam forming system, schematically depicted in the right side of Fig.~\\ref{fig:activeVSpassive}, the narrow ``pencil'' electron beam extracted from a linear accelerator, is first scattered in a thin, flat foil made of a high-Z material. This foil is commonly referred to as the scattering foil. A second foil, known as flattening foil, which optimally has a Gaussian radial thickness profile, $h(r) = H\\exp(-r^2/R^2)$, is located at some distance, usually on the order of few centimeters, downstream from the primary foil. The parameters $H$ and $R$ depend on beam energy, field size, geometry and materials of the system. In the flattening foil, due to its variable thickness, the electrons near the beam axis (small $r$), where the foil is thickest, are most scattered, while the electrons at larger radial distance, $r$, from the beam axis are less scattered. As shown in e.g. \\cite{AbouMandour1978, Grusell1994, Kainz2005, Adrich2014}, such an arrangement results in a flat fluence profile on the irradiation plane within the area of the irradiation field. Without any collimation device, electron fluence outside the field is substantial and decreases slowly with increasing distance from the beam axis. This is not desired in practical applications, therefore the beam formed in the foils is usually collimated to the area of the irradiation field, by means of an appropriate collimator and/or applicator.\n\n\n\n\\section{Design of the dual-foil beam forming system for the {{LILLYPUT~3}}  accelerator at NDT}\nTo design a system that would maximize the beam transport efficiency, while conforming to all requirements and constraints discussed in Sec.~\\ref{sec:requirements}, a model of system geometry was constructed and its performance was assessed by means of Monte Carlo calculations of beam transport through the model. \n\\begin{figure}[!bth]\n  \\centering\n\t\\includegraphics[width=0.8\\columnwidth]{fig_6.jpg}\n  \\caption{\\small 3D visualization (top) and side view (bottom) of the Geant4 model of the system.} \n  \\label{fig:Geant4_model}\n\\end{figure}\nFig.~\\ref{fig:Geant4_model} shows a visualization of Geant4 \\cite{Agostinelli2003} model of the beam forming system constructed in this work. The model includes all system components that are relevant to the forming of the beam, i.e. the components with which the beam electrons can interact on the way to the irradiation plane. Those are, in order from the left to the right in Fig.~\\ref{fig:Geant4_model}, 50~$\\mu$m titanium exit window, 0.01~mm tantalum scattering foil, Gaussian profiled aluminum flattening foil mounted on top of a steel flange on entrance side of the applicator tube, steel applicator tube, aluminum holder of a beam monitoring device located inside of the applicator tube. The medium between foils is air. The applicator is filled with helium gas under atmospheric pressure. As discussed in Sec.~\\ref{sec:requirements}, helium atmosphere is to avoid vapor condensation inside of the applicator. This has to be accounted for in the simulation due to much lower scattering power of helium as compared to air \\cite{ICRU1984}. The steel flange and an aluminum holder of the beam monitor are included because they effectively act as a beam collimator. A thin titanium exit window at the end of the applicator is not included in the simulation as it has negligible influence on the beam fluence at the irradiation plane that is right next to it.\\\\\nBased on the results of Monte Carlo simulations all important parameters of the system are optimized. The method used for the design optimization is discussed in detail elsewhere \\cite{Adrich2015}. In short, in this method, optimal values of all system parameters, besides the parameters $H$ and $R$ describing the shape of the flattening foil, are first settled based on a set of simple rules and recipes. Then, in order to establish optimal values of $H$ and $R$, i.e. values that minimize the flatness of the beam fluence distribution over the irradiation field, the $H$ and $R$ are varied in small steps over reasonable ranges. At each step, the beam fluence distribution is calculated using the Monte Carlo model mentioned above. Flatness of the calculated fluence distribution is quantified as $f = (\\phi_{max}/\\phi_{min} - 1)\\cdot100\\%$, where $\\phi_{max}$ and $\\phi_{min}$ are, respectively, the maximum and miniumum of the fluence distribution within the irradiation field. At the end, the flatness, $f$, calculated separately at each step, is plotted as a function, $f(H,R)$, of the parameters $H$ and $R$, as shown in Fig.~\\ref{fig:HR_scan}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.95\\columnwidth]{fig_7.jpg}\n  \\caption{\\small Flatness, $f(H,R)$, of the Monte Carlo calculated electron fluence distribution at the irradiation field plotted as a function of the flattening foil thickness profile parameters $H$ and $R$. Contours indicate, as labeled, areas of flatness below 5\\%, 10\\% and 15\\%. A point of practically optimal values of $H$ (1.5~mm) and $R$ (6~mm) is indicated with a star.}\n  \\label{fig:HR_scan}\n\\end{figure}\nOptimal flattening foil should minimize $f(H,R)$ while keeping $H$, the parameter describing thickness of the flattening foil, as small as possible in order to simultaneously minimize beam energy loss in the foil. It is evident from the plot in Fig.~\\ref{fig:HR_scan}, that optimal flattening foil has $H\\approx{}1.5$~mm and $R\\approx{}6$~mm.\\\\\nThe electron fluence distribution, calculated at the irradiation plane for the optimized beam forming system, is shown in left panel of Fig.~\\ref{fig:Fluence_Espectrum}. The beam is nearly perfectly flattened within the irradiation field. The flatness of this distribution for $r<41$~mm (i.e. over the $\\phi{}=82$~mm field) is only 1.6\\%. In the right panel of the same figure, the energy spectrum of electrons impinging on the irradiation plane within the irradiation field is shown. The mean of this energy spectrum, $<E>=7.9$~MeV, is one of the inputs for estimation of the dose rate (see Sec.~\\ref{sec:dose_rate_estimation}). The transport efficiency, calculated as a ratio of the number of electrons registered, in the Monte Carlo calculation, within the irradiation field to the number of initial source electrons, amounts to about 39\\%, thus is higher than the one estimated for a beam scanning system analyzed in Sec.~\\ref{sec:analysis_scanning}.\n\\begin{figure}[!hbt]\n  \\centering\n\t\\includegraphics[width=0.47\\columnwidth]{fig_8a.jpg}\n\t\\includegraphics[width=0.47\\columnwidth]{fig_8b.jpg}\n  \\caption{\\small Fluence distribution and energy spectrum of electrons at the irradiation plane resulting in an optimized dual-foil beam forming system.} \n  \\label{fig:Fluence_Espectrum}\n\\end{figure}\n\n\n\\section{Dose rate estimation}\n\\label{sec:dose_rate_estimation}\nResults of the Monte Carlo calculations mentioned above, in conjunction with known parameters of the {{LILLYPUT~3}}  accelerator, allows for estimation of the expected dose rate, $\\dot{D}$, at the irradiation field.\nThe parameters used in the estimation are summarized in Table~\\ref{tab:parameters}.\nFrom the data in Table~\\ref{tab:parameters}, one can expect beam flux at the irradiation plane to be $9.2\\cdot10^{11}$~\\mbox{electrons/s$\\cdot$cm$^2$}. Multiplying the flux by dose deposited per electron, one can estimate the total dose rate to be about $\\dot{D}=17$~kGy/min or 1~MGy/h. The assumed beam current of 50~\\mbox{mA/imp} is in fact rather conservative assumption, as the {{LILLYPUT~3}} can run stably with twice as high beam current. Upper limit for $\\dot{D}$ is therefore about 34~kGy/min or 2~MGy/h.\n\n\\begin{table}[!hbt]\n\\centering\n\\begin{tabular}{l|c} \\hline\n\\hline\nInitial beam current & 50 mA/imp \\\\\nPulse duration & 4 $\\mu$s \\\\\nPulse repetition & 100 Hz \\\\\nTransmission efficiency & 39 \\% \\\\\n\\hline\nMean energy, $<\n", "index": 1, "text": "$$E$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"E\" display=\"block\"><mi>E</mi></math>", "type": "latex"}]