[{"file": "1601.07247.tex", "nexttext": "\n\nHere, $\\delta m_i$, $\\tilde{\\chi }_{ij}$, and $h_{\\rm exc,  \\it j}$ ($i, j =X, Y$), as the coordinates defined in Fig. 2(b), are the small deviation  from $\\mbox{\\boldmath $M$}$,\nthe rf magnetic susceptibility tensor including spin-wave dispersion relation, and the rf external magnetic field in space $\\mbox{\\boldmath $r$}=(x,y)$ and time $t$, respectively.\nThe spin-wave dispersion relation in the case of arbitrary magnetization angle was calculated by using the formula described in Ref. \\cite{McMichael, Landeros}.\nHere, we assume that $\\mbox{\\boldmath $h$}_{\\rm exc}$ is attributed to the temporal change of an out-of-plane demagnetization field induced by ultrafast demagnetization in the focused area, which can be expressed as\n\n\\begin{eqnarray}\n&& h_{\\rm exc, \\it Y}(\\mbox{\\boldmath $r$},t)= -4 \\pi M_{\\rm s} \\delta m_Z (\\mbox{\\boldmath $r$},t) \\sin 2\\theta _{\\rm M},  \\\\\n&& \\delta m_Z(\\mbox{\\boldmath $r$},t) =  \\left[ \\frac{\\Delta M_{\\rm s}^0}{M_{\\rm s}} \\exp \\left(-\\frac{t}{\\tau _{\\rm rec}}\\right) \\Theta (t)+C_0\\right] \\nonumber \\\\\n&&\\hspace{4cm}\\times \\exp \\left(-\\frac{r^2}{2\\sigma _{\\rm pump}^2}\\right). \n\\end{eqnarray}\n\nHere, we approximate the saturation magnetization $M_{\\rm s}$ as being instantaneously reduced when the pump pulse laser shines and recovering exponentially with the recovery time $\\tau _{\\rm rec}$.\n$\\Delta M_{\\rm s}^0$, $\\Theta (t)$, and $C_0$ represent the magnitude of ultrafast demagnetization, the Heaviside step function, and the reduction of saturation magnetization due to the time-averaged temperature rising.\nThese equations are physically interpreted as follows.\nThe quantities relevant to propagation of the spin-wave are determined by the dispersion relation of the spin-wave and the excitation magnetic field in the wave-number $\\mbox{\\boldmath $k$}$ space, which are computed from $\\tilde{\\chi}$ in Eq. (1) and the Fourier transform of Eq. (2), respectively [Fig. 3(a)].\nThe respective MSSW and MSBVW modes show approximately linear and flat dispersion\nin the region of  $k < 6$ ${\\rm rad/\\mu m}$, where the Fourier transform of $h_{\\rm exc, \\it Y}$ has finite strength.\nSpin-waves with the $\\mbox{\\boldmath $k$}$ vector in this region are excited in-phase at $t=0$ \nand then form the wave-packet propagating away from the origin.\nThe excitation source, {i.e.,} $h_{\\rm exc, \\it Y}$, is symmetric in space but the spin-wave dispersion is highly anisotropic,\nso that the spin-wave directionally propagates, as mentioned above. \n\nThe observed $\\Delta \\varphi _{\\rm K}$ value may be proportional to the normal component $\\delta m_z (r, t)$, \nwhich can be computed by taking account of the finite radius of the probe beam spot:\n\n\\begin{eqnarray}\n&& \\Delta \\varphi_{\\rm K}(\\mbox{\\boldmath $r$},t) \\propto \\iint \\delta m_z (\\mbox{\\boldmath $r$}-\\mbox{\\boldmath $r$}^{\\prime },t) G_{\\rm probe}(\\mbox{\\boldmath $r$}^{\\prime })d^2r^{\\prime }, \\label{eq:obs} \\\\\n&& \\delta m_z (\\mbox{\\boldmath $r$},t)=\\delta m_Y (\\mbox{\\boldmath $r$},t)\\sin \\theta _{\\rm M} + \\delta m_Z (\\mbox{\\boldmath $r$},t) \\cos \\theta _{\\rm M}, \\label{eq:dmz}\n\\end{eqnarray}\nwhere $G_{\\rm probe}$ in Eq. (\\ref{eq:obs}) denotes Gaussian intensity distribution of probe beam, first and second terms in Eq. (\\ref{eq:dmz}) correspond to the oscillating component and the reduction of magnetization, respectively. \n\n\n\n\n\nThe calculated $x$-$t$ mapping of $\\Delta \\varphi_{\\rm K}$ is also shown in Fig. 3(b).\nThe data agrees well with the experimental data shown in Fig. 2(c).\nThe calculated data of the $y$-$t$ mapping of $\\Delta \\varphi_{\\rm K}$ did not show a propagating spin-wave pattern (not shown here),\nwhich was also consistent with experimental results.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=8.5cm,keepaspectratio,clip]{Fig4.eps}\n\\caption{Logarithmic amplitude (a), group velocity $v_{\\rm g}$ (b), frequency $f_0$ (c), packet width $\\sigma $ (d), and initial phase $\\phi _0$ (e) of the spin-wave obtained from the fitting as a function of the distance between the pump and probe positions. Solid and open symbols represent the values evaluated from the -$x$ and +$x$ directions, respectively. The solid curve indicates the calculated result.}\n\\label{f4}\n\\end{center}\n\\end{figure}\n\n\n\n\n\n\n\n\n\nIn order to quantitatively compare the calculated and experimental data,\nthe theoretical and experimental values of $\\Delta \\varphi_{\\rm K}$ corresponding to the spin-wave packet were analyzed \nusing the fitting of the Gaussian wave-packet:\n\\begin{eqnarray}\n\\Delta \\varphi_{\\rm K}(x,t)&=&A \\exp \\left[ \\frac{\\left( v_{\\rm g}t-x\\right) ^2}{2\\sigma ^2}\\right] \\sin \\left( 2\\pi f_0 t -\\phi _0 \\right). \\label{eq:fit}\n\\end{eqnarray}\nHere $A$, $v_{\\rm g}$, and $\\sigma $ are the amplitude, group velocity, and packet width, respectively, of a Gaussian envelope,\nand $f_0$ and $\\phi _0$ are the center frequency and phase of the spin-wave, respectively, for a sinusoidal function.\nGenerally, a spin-wave packet generated by a pulse magnetic field forms a shape slightly deviated from the Gaussian wave-packet \\cite{Wu},\nwhereas the measured wave-packets are approximately fitted by Eq. (\\ref{eq:fit}), as shown in Fig. 2(a) with a broken curve. \nThe full set of quantities obtained from the experimental and theoretical data are shown in Fig. 4 \nwith circles and solid curves, respectively.\nThe experimental values agree well with the theoretical data within acceptable errors.\n\nThe propagation length, $\\lambda $, of the spin-wave was evaluated to be 3.5 $\\pm $ 0.1 ${\\rm \\mu m}$ from the data in Fig. 4(a),\nwhich is relatively shorter than the values reported in a permalloy thin films.\nThe $\\lambda $ value may be simply connected to $v_{\\rm g}$ and the relaxation time of the spin-wave, $\\tau $, by the relation $\\lambda = v_{\\rm g} \\tau $.\nWhen the Gilbert damping is the main loss mechanism, \nthe $\\tau $ value is roughly estimated by the relation $\\tau  \\sim 1/ 2 \\pi \\alpha f_0 P$, where $\\alpha $ and $P$ are the Gilbert damping constant and the precession ellipticity factor, respectively.\nThe $v_{\\rm g}$ and $f_0$ values evaluated from the experiment are roughly independent of $x$ and are about 4 km/s and 5.5 $\\sim $ 5.9 GHz, respectively [Figs. 4(b) and 4(c)]. The $P$ value was calculated to be $\\sim $ 2.6.\nThese values yield $\\tau \\sim$ 1.6 ns and $\\lambda = 6.4$ $\\mu$m with the experimental $\\alpha$ of 0.0071\n being approximately consistent with the-above-mentioned $\\lambda$ values. \nThe packet width, $\\sigma$, is $\\sim$1 $\\mu$m [Figs. 4(d)], \nwhich is comparable to the width of the effective excitation field in $k$-space [Fig. 3(a)].\nThe center wave-number, $k_0$, for the generated spin-wave can be roughly \nevaluated to be 0.8 $\\sim $ 1.0 rad/$\\mu $m by the slope, {\\it i.e.,} $\\phi_0 = k_0 x$, from the data in Fig. 4(e). \nThe values of $f_0$ and $v_{\\rm g}$ ($=2\\pi df/dk$) at $k_0$ for the spin-wave dispersion in the film, as shown in Fig. 3(a) by the vertical broken line, \nalso accord with the values shown in Figs. 4(b) and 4(c), respectively. \n\nThe above discussion allows us to conclude that the primary origin of the coherent spin-wave generated by the focused pulse laser in permalloy films\nis the local modulation of the out-of-plane demagnetization field, {\\it i.e.,} Eq. (2).\nHowever, Eq. (2) is a rather naive approximation of the effective magnetic field.\nAnother contribution resulting from the local reduction of magnetization is the effective magnetic field stemming from magnetic charges along the rim of the pump laser-focused spot.\nThis has a spatial symmetry different from that expressed by Eq. (2) and results in an antisymmetric spin-wave emission with respect to the magnetization direction, \nas suggested by the theoretical simulation by Au {\\it et al.} \\cite{Au}.\nThe phase of the spin-wave observed in this study is close to symmetric [Fig. 2(b)],\nso that the effect of such contributions may be ruled out by the result observed here.\nThe phenomenon should be investigated in more detail by means of a two-dimensional imaging of the spin-wave propagation, with the simulation taking a more correct derivation of Eq.(2) into account using the Poisson equation, or more generally, Maxwell's equations with the metal's finite conductivity,\nwhich will be addressed as a next step. \n\nIn conclusion, we have investigated an ultrashort laser pulse-induced propagating spin-wave in a 20-nm-thick permalloy film. \nThe propagating spin-wave packet was clearly observed in the case where the propagation direction was perpendicular to the magnetization direction. \nVarious quantities that characterize the propagating spin-wave were experimentally evaluated, and those were quantitatively well-explained by the theoretical model\nin which the propagating spin-wave was excited by the out-of-plane demagnetization field with a Gaussian intensity distribution that was induced by the focused pulse laser.\n\nThis  work  was  partially  supported  by Grants-in-Aid for Scientific Research (Nano Spin Conversion Science, No. 26103004)\nand the WPI-AIMR fusion research project.\nS. I. and S. M. thank to the Neo-Arc corp., Japan and Y. Kondo for their assistances for development of experimental set-up. \nThey also thank to S. Tamaru, T. Satoh, Y. Hashimoto, and T. Miyazaki for valuable discussions. \nS. I. and Y. S. thank to Grant-in-Aid for JSPS Fellow (No. 26-4778) and to the GP Spin program, respectively.\n\n\\begin{thebibliography}{10}\n\n\n\\bibitem{Kostylev} M. P. Kostylev, A. A. Serga, T. Schneider, B. Leven, and B. Hillebrands, Appl. Phys. Lett. {\\bf 87}, 153501 (2005)\n\\bibitem{Schneider} T. Schneider, A. A. Serga, B. Leven, B. Hillebrands, R. L. Stamps, and M. P. Kostylev, Appl. Phys. Lett. {\\bf 92}, 022505 (2008)\n\\bibitem{Sato}N. Sato, K. Sekiguchi, and Y. Nozaki, Appl. Phys. Express {\\bf 6}, 063001 (2013)\n\\bibitem{Jamali}M. Jamali, J. H. Kwon, S. -M. Seo, K. -J. Lee, and H. Yang, Scientific Report, {\\bf 3}, 3160 (2013)\n\n\\bibitem{Chumak} A. Chumak, A. A. Serga, B. Hillebrands, Nat. Commun. {\\bf 5}, 4700 (2014)\n\n\n\\bibitem{Covington}M. Covington, T. M. Crawford, and G. J. Parker, Phys. Rev. Lett. {\\bf 89}, 237202 (2002)\n\\bibitem{Wu} M. Wu, B. A. Kalinikos, P. Krivosik, and C. E. Patton, J. Appl. Phys. {\\bf 99}, 013901 (2006)\n\\bibitem{Tamaru}S. Tamaru, J. A. Bain, R. J. M. van de Veerdonk, T. M. Crawford, M. Covington, and M. H. Kryder, Phys. Rev. B, {\\bf 70}, 104416 (2004)\n\\bibitem{Sekiguchi}K. Sekiguchi, K. Yamada, S. M. Seo, K. J. Lee, D. Chiba, K. Kobayashi, and T. Ono, Appl. Phys. Lett. {\\bf 97}, 022508 (2010)\n\\bibitem{Yu}H. Yu, R. Huber, T. Schwarze, F. Brandl, T. Rapp, P. Berberich, G. Duerr, and D. Grundler, Appl. Phys. Lett. {\\bf 100}, 262412 (2012)\n\\bibitem{Birt}D. R. Birt, K. An, M. Tsoi, S. Tamaru, D. Ricketts, K. L. Wong, P. K. Amiri, K. L. Wang, and X. Li, Appl. Phys. Lett, {\\bf 101}, 252409 (2012)\n\\bibitem{Sebastian}T. Sebastian, Y. Ohdaira, T. Kubota, P. Pirro, T. Br\\\"{a}cher, K. Vogt, A. A. Serga, H. Naganuma, M. Oogane, Y. Ando, and B. Hillebrands, Appl. Phys. Lett. {\\bf 100}, 112402 (2012)\n\\bibitem{Schneider2008}T. Schneider, A. A. Serga, T. Neumann, B. Hillebrands, and M. P. Kostylev, Phys. Rev. B {\\bf 77}, 214411 (2008)\n\n\\bibitem{Demidov} V. E. Demidov, S. Urazhdin, and S. O. Demokritov, Nat. Mater. {\\bf 9}, 984 (2010)\n\\bibitem{Madami} M. Madami, S. Bonetti, G. Consolo, S. Tacchi, G. Carlotti, G. Gubbiotti, F. B. Mancoff, M. A. Yar, and J. \\AA kerman, Nat. Nanotec. {\\bf 6}, 635 (2011)\n\n\n\\bibitem{Serga} A. A. Serga, A. V. Chumak, and B. Hillebrands, J. Phys. D: Appl. Phys. {\\bf 43} 264002 (2010)\n\n\n\\bibitem{Satoh} T. Satoh, Y. Terui, R. Moriya, B. A. Ivanov, K. Ando, E. Saitoh, T. Shimura, and K. Kuroda, Nat. Photo. {\\bf 6}, 662 (2012)\n\n\n\\bibitem{Au}Y. Au, M. Dvornik, T. Davison, E. Ahmad, P. S. Keatley, A. Vansteenkiste, B. Van Waeyenberge, and V. V. Kruglyak, Phys. Rev. Lett. {\\bf 110}, 097201 (2013)\n\n\\bibitem{Yun}S. -J. Yun, C. -G. Cho, and S. -B. Choe, Appl. Phys. Express {\\bf 8}, 063009 (2015)\n\n\n\\bibitem{Kimel}A. V. Kimel, A. Kirilyuk, P. A. Usachev, R. V. Pisarev, A. M. Balbashov, and Th. Rasing. Nature {\\bf 435}, 655 (2005)\n\n\n\\bibitem{Beaurepaire}E. Beaurepaire, J. -C. Merle, A. Daunois, and J. -Y. Bigot, Phys. Rev. Lett. {\\bf 76}, 4250 (1996).\n\n\\bibitem{Koopmans}B. Koopmans, G. Malinowski, F. Dalla Longa, D. Steiauf, M. Fahnle, T. Roth, M. Cinchetti, and M. Aeschlimann, Nat. Mater. {\\bf 13}, 2593 (2009).\n\n\n\\bibitem{Araujo} Marcos A. C. de Ara\\'{u}jo, R. Silva, E. de Lima, D. P. Pereira, and P. C. de Oliveira, Appl. Opt. {\\bf 48}, 393 (2009)\n\n\n\\bibitem{Kampen2002}\nM. van Kampen, C. Jozsa, J. T. Kohlhepp, P. LeClair, L. Lagae, W. J. M. de Jonge, and B. Koopmans,\nPhys. Rev. Lett. {\\bf 88,} 227201 (2002).\n\n\n\n\\bibitem{Sup} Supplementary material \n\n\n\n\\bibitem{McMichael}R. D. McMichael and P. Krivosik, IEEE Trans. Magn. {\\bf 40}, 1 (2004)\n\\bibitem{Landeros} P. Landeros, R. E. Arias, and D. L. Mills, Phys. Rev. B {\\bf 77}, 214405 (2008)\n\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 13262, "prevtext": "\n\n\\preprint{APS/123-QED}\n\n\\title{Quantification of a propagating spin-wave-packet created \\\\\nby an ultrashort laser pulse in a thin film of magnetic metal}\n\n\n\\author{S. Iihama$^1$}\n\\email{iihama@mlab.apph.tohoku.ac.jp}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n \n\\author{Y. Sasaki$^1$}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n\n\\author{A. Sugihara$^2$}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n\n\\author{A. Kamimaki$^1$}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n\n\\author{Y. Ando$^1$}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n\n\\author{S. Mizukami$^2$}\n\\email{mizukami@wpi-aimr.tohoku.ac.jp}\n\\affiliation{$^1$Department of Applied Physics, Graduate School of Engineering, Tohoku University, Japan \\\\\n$^2$WPI Advanced Institute for Materials Research, Tohoku University, Japan}\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\date{\\today}\n             \n\n\\begin{abstract}\nCoherent spin-wave generation by focused ultrashort laser pulse irradiation was investigated for a permalloy thin film at micrometer scale using an all-optical space and time-resolved magneto-optical Kerr effect.\nThe spin-wave packet propagating perpendicular to magnetization direction was clearly observed, \nhowever that propagating parallel to the magnetization direction was not observed. \nThe propagation length, group velocity, center frequency, and packet-width of the observed spin-wave packet \nwere evaluated and quantitatively explained in terms of the propagation of a magneto-static spin-wave driven by ultrafast change of an out-of-plane demagnetization field induced by the focused-pulse laser.\n\n\\end{abstract}\n\n\\pacs{Valid PACS appear here}\n                             \n\n                              \n\\maketitle\n\n\n\n\n\nInformation processing by spin-waves such as spin-wave logic gates or magnon transistors \\cite{Kostylev, Schneider, Sato, Jamali,Chumak},\nhas attracted much attention for the realization of future devices with low power consumption. \nIn previous studies, the propagating spin-waves have been excited by a local radiofrequency (rf) magnetic field generated by an  rf electric current fed into an antenna \\cite{Covington, Wu, Tamaru, Sekiguchi, Yu, Birt, Sebastian, Schneider2008} or by a dc electric current via a spin-transfer-torque \\cite{Demidov, Madami}.\nAmong them, manipulation of spin-waves propagating in thin films of magnetic metals are of interest \\cite{Covington, Tamaru, Sekiguchi, Yu, Birt, Sebastian},\nbecause magnetic metal thin films may be well-suited for integration into silicon nano-technology \\cite{Serga}.\nHowever, the propagation length of spin-waves in thin films of magnetic metals is very short,\nso that the precise characterization of the spin-wave propagation in the near sub-micrometer region is a technological challenge, for which\nit may be valuable to explore the various observational methods.\n\nRecently, it has been demonstrated that a propagating spin-wave can be generated by a focused-ulrashort laser pulse in an insulating ferrimagnet \\cite{Satoh}. \nThis finding is the beginning of {\\it opto-magnonics}, which opens new avenues for investigating propagating spin-waves using laser light. \nInspired by this experiment, Au {\\it et al.} also attempted to observe the propagating spin-wave created in metallic magnetic thin films by a laser pulse and discussed the nature of spin-wave excitation.\nHowever, their discussion was still qualitative because the strong heating and acoustic wave induced by laser pulse irradiation overlapped the spin-wave propagation, making quantitative analysis difficult to perform \\cite{Au}.\nSubsequently Yun {\\it et al.} also performed a similar experiment and evaluated the spin-wave propagation length in CoFeB thin films,\nbut also did not present a quantitative discussion for the mechanism behind the generation of spin-waves by a pulse laser \\cite{Yun}.\nThus, this mechanism has yet to be clarified.\nGenerally, there are several discussions on the laser-induced spin dynamics, even in insulating magnets in which the inverse Faraday effect is considered to be the main origin of spin-wave generation \\cite{Kimel}.\nIn the case of a metallic magnet, strong light absorption and ultrafast demagnetization occur over a very short-time scale when the laser pulse is incident upon it \\cite{Beaurepaire, Koopmans}; \nthis is an unique property in metallic magnets, from which it follows that  the scenario of spin-wave generation by a pulse laser may differ between metals and insulators.\n\nIn this letter, we report a clear observation of the propagation of a spin-wave packet created by an ultrashort laser pulse in a permalloy thin film by means of the space- and time-resolved magneto-optical Kerr effect (STR-MOKE).\nThe observed propagation of a spin-wave generated by a laser pulse is {\\it quantitatively} explained by a theoretical model taking account of the ultrafast change of the out-of-plane demagnetization field induced by the laser pulse with a Gaussian distribution in space.\n\nThe STR-MOKE measurements were performed by a standard, all-optical pump-probe set-up with the two-color method [Fig. 1(a)]. \nThe source of the pulse was a Ti: Sapphire laser with a wavelength, pulse width, and pulse repetition rate of $\\sim$800 nm, $\\sim$120 fs, and $\\sim$80 MHz, respectively.\nA BaB$_2$O$_4$ (BBO) crystal was used for the frequency-doubling of the pump laser. \nThen, the pump laser amplitude was modulated using a mechanical chopper with a modulation frequency at 370 Hz.\nBoth the probe and the pump laser with linear-polarization were focused onto a sample by the objective lens with $NA=0.65$ via a scanning mirror by which \nthe spot position of the probe laser beam on the sample can be changed by changing the angle of the mirror.\nThe spot radius of the probe laser beam ($\\sigma _{\\rm probe}$), {\\it i.e.,} the half-width at which the light intensity becomes $e^{-0.5}$, \nwas evaluated to be 0.51 ${\\rm \\mu m}$ using the knife-edge method \\cite{Araujo}. \nThe intensity of the pump laser beam at the focused area approximated to a Gaussian function with radius ($\\sigma _{\\rm pump}$) was evaluated to be 0.50 $\\mu$m \\cite{Sup}; the fluence of the pump laser pulse was estimated to be several mJ/cm$^2$.\nThe spot position of the probe laser beam on the sample was scanned along the direction perpendicular ($x$-axis) or parallel ($y$-axis) to the in-plane component of the magnetization $\\mbox{\\boldmath $M$}$ [Fig. 1(b)].\nThe pump laser pulse-induced change in the Kerr rotation angle of the reflected probe laser pulse ($\\Delta \\varphi _{\\rm K}$) was detected by a balanced photo-diode detector and a lock-in amplifier,\nand the output voltage was then recorded as a function of the pump-probe delay time and distance.\nDuring the measurements, a magnetic field $\\mbox{\\boldmath $H$}_{\\rm ext}$ of 3 kOe  with a field angle of $\\sim$5$^{\\circ }$ from the normal of the sample plane ($z$-axis) was externally applied by a permanent magnet to the sample.\nThe sample consists of a 20-nm-thick permalloy (Ni$_{80}$Fe$_{20}$) film deposited onto a Si/SiO$_2$ substrate by ultra-high  vacuum magnetron sputtering.\n\n\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=8.2cm,keepaspectratio,clip]{Fig1.eps}\n\\caption{Schematic illustration of (a) the optical set-up for the space- and time-resolved magneto-optical Kerr effect \nand (b) the coordinate system. \nThe probe beam spot was scanned along the direction perpendicular ($x$ direction) or parallel ($y$ direction) to the in-plane component of \nthe magnetization unit vector, $\\mbox{\\boldmath $M$}$.\nBoth  $\\mbox{\\boldmath $M$}$ and the external magnetic field vector $\\mbox{\\boldmath $H$}_{\\rm ext}$ are in the $y-z$ plane.\nThe directions of $\\mbox{\\boldmath $H$}_{\\rm ext}$ and $\\mbox{\\boldmath $M$}$ are defined by the angles $\\theta _{\\rm H}$ and $\\theta _{\\rm M}$ with respect to a film normal, respectively.\n$\\delta m_{\\rm Z}$ and $\\delta m_{\\rm Y}$ correspond to small changes in the parallel and perpendicular components of $\\mbox{\\boldmath $M$}$, respectively, in an $X-Y-Z$ coordinate system that is defined by the rotation of the $x-y-z$ coordinate system about the $x$-axis.  \n}\n\\label{f1}\n\\end{center}\n\\end{figure}  \n\n\n\n\n\n\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=8cm,keepaspectratio,clip]{Fig2.eps}\n\\end{center}\n\\caption{Change in the Kerr rotation angle $\\Delta \\varphi _{\\rm K}$ as a function of time at $x$ = 0 $\\mu $m (pump-probe overlap) (a) and $x$ = -3.1 $\\mu $m (b). Broken curves are fitted to results using a Gaussian wave-packet. (c) The value of $\\Delta \\varphi _{\\rm K}$ is mapped as a function of time and probe position $x$.}\n\\label{f2}\n\\end{figure}\n\nFigures 2(a) and 2(b) show $\\Delta \\varphi _{\\rm K}$ as a function of time with $x=$ 0 and -3.4 $\\mu$m, respectively.\n\n$\\Delta \\varphi _{\\rm K}$ at $x=0$ $\\mu$m exhibits a damped-sinusoidal oscillation superposed with an exponentially-damped background. \nThe damped-oscillation and background are, respectively, attributed to the damped-magnetization precession and the recovery of magnetization magnitude from ultrafast demagnetization, and are both induced by the pump laser over a short time scale \\cite{Kampen2002}.\nOn the other hand, the shape of the $\\Delta \\varphi _{\\rm K}$ observed at $x=$ -3.4 ${\\rm \\mu m}$ becomes a wave-packet form [Fig. 2(b)]. \nThe pump beam is not incident at this area, \nso this spatio-temporal non-local pump-probe response evidently demonstrates the spin-wave packet propagation generated by the pump laser pulse.\nSpatio-temporal evolution of a spin-wave is more visible in the $\\Delta \\varphi _{\\rm K}$ mapped in space-time [Fig. 2(c)].\nThe large $\\Delta \\varphi _{\\rm K}$ around $x = 0$ $\\mu$m corresponds to the change of magnetization magnitude as mentioned above.\nThe strip-like pattern of $\\Delta \\varphi _{\\rm K}$ around $x = 0$ $\\mu$m corresponds to the emission and time-evolution of the wave.\nThe center of mass of the wave-packet symmetrically moves up to about 5 $\\mu$m within 1.5 ns from the pump laser irradiated area, \nindicating that the group velocity of the spin-wave packet is about 3-4 km/s.\nOn the other hand, no propagating spin-wave was clearly observed when the scanning direction of the probe laser beam was parallel to the $y$-axis (not shown here).\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=8cm,keepaspectratio,clip]{Fig3.eps}\n\\end{center}\n\\caption{(a) The spin-wave frequency $f$ as a function of the wave-number $k$ calculated for the 20-nm-thick permalloy film under an oblique magnetic field for the $k_{\\rm x}$ (red open circles) and $k_{\\rm y}$ directions (blue open triangles), respectively.\nAn effective excitation magnetic field in $k$-space $h_{\\rm exc}(k)$ was also plotted (solid curve),\nwhich is generated by the ultrafast demagnetization induced by a focused pump laser pulse. \n(b) The simulated value of $\\Delta \\varphi _{\\rm K}$ is mapped as a function of time and probe position $x$, and corresponds to that in Fig. 2(c).\n}\n\\label{f3}\n\\end{figure} \n\nThe-above-mentioned value of the group velocity and its anisotropy are qualitatively consistent with the nature of long-wavelength spin-waves  in magnetic films, {\\it i.e.,} magnetostatic spin-waves.\nThe magnetostatic spin-wave is governed not by a short-range exchange interaction, but by a long-range magnetic dipolar interaction,\nso that the two anisotorpic modes depending on their propagation directions are known in in-plane magnetized films, \n{\\it i.e.,} the magnetostatic surface spin-wave mode (MSSW) and the magnetostatic backward volume wave mode (MSBVW)with the wave vector perpendicular and parallel to the magnetization direction, respectively.\nThe group velocity of MSSW is generally much larger than that of MSBVW in the case of thin films; \nthus, the observed spin-wave packet may be attributed to that of the MSSW created by a laser pulse.\nIn order to confirm this speculation, quantitative analysis is necessary with the magnetostatic spin-wave dispersion relation and the details of the laser-induced spin-wave generation mechanism taken into account.\nThis is because the nature of the spin-wave observed should depend on its average frequency and wave number, \nwhich are determined by the dispersion relation and the wave number-dependent stimulus by the pulse laser.\n\nThe coherent spin-wave generated by a pulse laser may be described by linear response theory based on the linearized Landau-Lifshitz-Gilbert equation taking account of the magnetostatic interaction with a thin film limit (see the details of the calculation in the Supplementary Materials\\cite{Sup}) :\n\n", "index": 1, "text": "\\begin{equation}\n{\\small\n\\delta m_i (\\mbox{\\boldmath $r$},t) = \\iint  \\tilde{\\chi }_{ij} (\\mbox{\\boldmath $r$}-\\mbox{\\boldmath $r$}^{\\prime },t-t^{\\prime })h_{\\rm exc,  \\it j} (\\mbox{\\boldmath $r$}^{\\prime },t^{\\prime }) d^2r^{\\prime }dt.\n} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\small\\delta m_{i}(\\mbox{\\boldmath$r$},t)=\\iint\\tilde{\\chi}_{ij}(\\mbox{%&#10;\\boldmath$r$}-\\mbox{\\boldmath$r$}^{\\prime},t-t^{\\prime})h_{\\rm exc,\\it j}(%&#10;\\mbox{\\boldmath$r$}^{\\prime},t^{\\prime})d^{2}r^{\\prime}dt.}\" display=\"block\"><mrow><mrow><mrow><mi mathsize=\"90%\">δ</mi><mo>⁢</mo><msub><mi mathsize=\"90%\">m</mi><mi mathsize=\"90%\">i</mi></msub><mo>⁢</mo><mrow><mo maxsize=\"90%\" minsize=\"90%\">(</mo><mi mathsize=\"90%\">𝒓</mi><mo mathsize=\"90%\" stretchy=\"false\">,</mo><mi mathsize=\"90%\">t</mi><mo maxsize=\"90%\" minsize=\"90%\">)</mo></mrow></mrow><mo mathsize=\"90%\" stretchy=\"false\">=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\iint</mtext></merror><mo>⁢</mo><msub><mover accent=\"true\"><mi mathsize=\"90%\">χ</mi><mo mathsize=\"90%\" stretchy=\"false\">~</mo></mover><mrow><mi mathsize=\"90%\">i</mi><mo>⁢</mo><mi mathsize=\"90%\">j</mi></mrow></msub><mo>⁢</mo><mrow><mo maxsize=\"90%\" minsize=\"90%\">(</mo><mrow><mi mathsize=\"90%\">𝒓</mi><mo mathsize=\"90%\" stretchy=\"false\">-</mo><msup><mi mathsize=\"90%\">𝒓</mi><mo mathsize=\"90%\" stretchy=\"false\">′</mo></msup></mrow><mo mathsize=\"90%\" stretchy=\"false\">,</mo><mrow><mi mathsize=\"90%\">t</mi><mo mathsize=\"90%\" stretchy=\"false\">-</mo><msup><mi mathsize=\"90%\">t</mi><mo mathsize=\"90%\" stretchy=\"false\">′</mo></msup></mrow><mo maxsize=\"90%\" minsize=\"90%\">)</mo></mrow><mo>⁢</mo><msub><mi mathsize=\"90%\">h</mi><mrow><mi mathsize=\"90%\">exc</mi><mo mathsize=\"90%\" stretchy=\"false\">,</mo><mi mathsize=\"90%\">j</mi></mrow></msub><mo>⁢</mo><mrow><mo maxsize=\"90%\" minsize=\"90%\">(</mo><msup><mi mathsize=\"90%\">𝒓</mi><mo mathsize=\"90%\" stretchy=\"false\">′</mo></msup><mo mathsize=\"90%\" stretchy=\"false\">,</mo><msup><mi mathsize=\"90%\">t</mi><mo mathsize=\"90%\" stretchy=\"false\">′</mo></msup><mo maxsize=\"90%\" minsize=\"90%\">)</mo></mrow><mo>⁢</mo><msup><mi mathsize=\"90%\">d</mi><mn mathsize=\"90%\">2</mn></msup><mo>⁢</mo><msup><mi mathsize=\"90%\">r</mi><mo mathsize=\"90%\" stretchy=\"false\">′</mo></msup><mo>⁢</mo><mi mathsize=\"90%\">d</mi><mo>⁢</mo><mi mathsize=\"90%\">t</mi></mrow></mrow><mo mathsize=\"90%\" stretchy=\"false\">.</mo></mrow></math>", "type": "latex"}]