[{"file": "1601.05431.tex", "nexttext": "\n where $\\rho_i=\\rho_0 + l\\left[ i -(N_\\rho-1)/2 \\right]$, $i \\in [ 0, ..., N_\\rho-1]$, \n $\\theta_j=l j/\\rho_0$,  $j \\in [0,...,N_\\theta-1] $, and  $z_k = \\left[k - (N_z-1)/2\\right]l$, $k \\in [0,...,N_z-1]$, and $\\rho_0=lN_\\theta/(2\\pi)$ is the radius of the ring at the trap minimum. \n  We emphasize that the discretization length is not constant, but increases linearly with increasing distance from the center axis of the ring. Therefore, the curvature of the ring geometry is fully taken into account.\n  In this representation, $|\\tilde{\\psi}_{ijk}|^2$ corresponds to the number of atoms per unit cell, where the volume of the unit cell is $l^3 \\rho_i/\\rho_0$.  For the lattice size chosen here, the volume of the unit cell varies from $0.6 l^3$ for $i=0$ to $1.4l^3$ for $i=16$.\n\n In this representation, the equations of motion take the form\n \\begin{eqnarray} \n i\\hbar \\frac{d}{dt}\\tilde{\\psi}_{ijk} &=& -J \\Bigg[ \\left( \\tilde{\\psi}_{i+1jk} +\\tilde{\\psi}_{i-1jk} - 2\\tilde{\\psi}_{ijk}  \\right)\n +\\frac{l^2}{4\\rho_i^2}\\tilde{\\psi}_{ijk}\\nonumber \\\\\n&&  + \\frac{\\rho_0^2}{\\rho_i^2}\\left(\\tilde{\\psi}_{ij+1k}  +\\tilde{\\psi}_{ij-1k}-2\\tilde{\\psi}_{ijk} \\right)\\nonumber \\\\\n&&  + \\left(\\tilde{\\psi}_{ijk+1}+\\tilde{\\psi}_{ijk-1}-2\\tilde{\\psi}_{ijk} \\right) \\Bigg]\\nonumber \\\\\n&&+\\left[  V_{ijk} +U(\\rho_i)|\\tilde{\\psi}_{ijk} |^2\\right] \\tilde{\\psi}_{ijk}, \\label{eqn:eom}\n\\end{eqnarray}\nwhere $J=\\hbar^2/(2ml^2)$ is the hopping parameter, and the interaction term is given by $U(\\rho_i) =  U_0 \\rho_0/\\rho_i$, where $U_0= gl^{-3}$.  \n On the lattice, the external potential is given by $V_{ijk} = \\frac{\\hbar^2}{4Jl^2} \\left[\\omega_\\rho^2\\left(\\rho_i - \\rho_0\\right)^2 + \\omega_z^2 z_k^2 \\right]  +\\alpha(t)V_b\\exp\\left[- 0.5 \\rho_i^2(\\theta_j-\\theta_b(t))^2/l_b^2\\right]$. \n\n \n\\begin{figure}\n   \\includegraphics[scale=.58]{figures/phase_winding_time.eps} \n   \\caption{We depict the time evolution of the average phase winding around the center of the toroid for stirring frequencies, $\\omega_s/\\omega_0= 2.6, 3.4, 3.6$, and barrier heights $V_b/J=1.0, 1.8, 2.4$.}\n   \\label{fig:phwdtime}\n\\end{figure}\n\n As mentioned above, we initialize the dynamics by sampling from the initial Wigner distribution. For the initial state, we choose a   non-interacting Bose gas in the toroidal trap, of zero temperature.  After the initialization, the interactions are turned on slowly to generate the desired  interacting ensemble in the trap \\footnote{The eigenstates of the non-interacting Bose gas are generated by diagonalizing the non-interacting Hamiltonian on the lattice in $\\rho$ and $z$ directions, and using plane waves along $\\theta$. The interaction strength is turned on slowly, according to $\\alpha_U(t)= (1+\\tanh\\left\\lbrace 5[(t-100)/8000-0.5]\\right \\rbrace )/2 $ The total initialization time is $16000 \\Delta t$}.\n  This process of turning on the interaction results in a non-zero temperature. \n This  temperature  is measured by weakly coupling harmonic oscillators to the current as described in Ref. \\cite{ring}. For examples discussed in this paper, the temperature of the atomic cloud after initialization is approximately  4.0 J = 43 nK \\footnote{Using the notation of \\cite{ring}, the harmonic oscillator parameters are $\\omega_{ho}/J = 1.0$, $U_{ho}/J=0.02$ and the coupling is turned on and off over a time scale $\\tau_{ho}/J=4000$.}.\n\n Throughout this paper, we use a lattice with the dimensions $N_{\\rho}=17$, $N_{\\theta}=126$, and $N_z=5$, and $N=50000$ atoms. The trapping frequencies are $\\omega_\\rho/J = 0.5$ and $\\omega_z/J = 2.5$.   We propagate and average over 72 initial states and the length scale of the barrier is $l_b/l=3$. \n  We set $U_0/J=0.07$, which corresponds to a length scale $l=0.99 \\mu$m, a time scale $\\Delta t = \\hbar/J = 0.71$ ms and an energy scale $J=10.8$ nK for sodium atoms.\n\nWe now consider the following experiment:\nStarting at $t_1=100 \\Delta t$, we ramp the barrier magnitude from 0 to the final barrier height $V_{b}$ over  a time period of $200\\Delta t$, while keeping the barrier stationary. Then at $t_2= 300 \\Delta t$, the barrier is accelerated to its final stirring frequency, $\\omega_s$ over $200 \\Delta t$. At $t_3=500\\Delta t$, the atomic cloud is stirred at constant frequency for a time period of $1200\\Delta t$ at maximum barrier height and then the barrier height is ramped down over the time $200\\Delta t$ while continuing to stir the atoms at the frequency $\\omega_s$.  We refer to this procedure as protocol 1.\n\n Additionally, we compare this protocol to the process of turning on the barrier height to $V_{b}$, while stirring at constant frequency $\\omega_s$, starting at $t_1$ and reaching the maximum barrier height at $t_2$.  The atomic cloud is stirred for $1400\\Delta t$ before ramping down the barrier, while continuing to stir at constant frequency. This second protocol is reminiscent of the experiments reported in Ref. \\cite{gretchensquid}.  As we discuss below, the first protocol is the preferable protocol for large stirring frequencies, because it avoids exciting phase slips before the barrier has reached its maximum height.\n\n\n  In Fig. \\ref{fig:density}, we illustrate the dynamics of the system by depicting the density $n(\\rho,\\theta)$ in the $z=0$ layer, and the current $j_\\theta(\\rho,\\theta)$ along the azimuthal direction of the ring, at four different times, for a barrier height of $V_b/J=1.8$ and stirring frequency $\\omega_s/\\omega_0=3.8$ for the first protocol.\n  At the first time, $t = 300 \\Delta t$, the trap potential is fully ramped up, as is visible in the density depletion of the ring shaped condensate, but is still stationary. Here, the phase winding is still zero, and both positive and negative current fluctuations are visible. We note again that these fluctuations are predominantly of thermal origin.\n     At the second time, $t = 410 \\Delta t$, one phase slip has occurred. Now the current has acquired a preferred direction, as is immediately visible in Fig. \\ref{fig:density} (d).\n       At the third time, $t = 480 \\Delta t$, a second phase slip has occurred, and the magnitude of the current has increased, Fig. \\ref{fig:density} (t).\n     Finally, at time $t = 2000 \\Delta t$, the barrier has been ramped down, so the density of the condensate does not display a depleted region. However, as is visible from the current in  Fig. \\ref{fig:density} (h), the stirring of this ring shaped condensate, has imparted a finite current circulating in the ring.\n     \n\nFor a system with a complex order parameter, such as a condensate of atoms or a superconductor, this current is related to the well-defined phase. In the condensed phase, this results in a quantization of the phase winding around a ring geometry. \n We determine the phase along the central line along the ring, which tracks the maximal density for a given azimuthal angle, and in the $z=0$ plane.\n   We calculate the phase at the angle $\\theta$ via \n \\begin{eqnarray}\n \\phi(\\mathbf{\\theta} )= \\phi(\\rho_0,\\theta,0) & = & \\tan^{-1}(\\text{Im }\\psi (\\mathbf{\\theta})/\\text{Re } \\psi(\\mathbf{\\theta})).\n \\end{eqnarray}\n \n  The phase winding is the sum of the phase differences around the ring,\n$n_{\\Delta \\phi} =\\left( \\sum_\\theta \\delta \\phi(\\mathbf{\\theta}) \\right) /2\\pi $,  where the phase difference between two points, $\\delta \\phi (\\theta) = \\phi(\\mathbf{\\theta+\\theta_0}) - \\phi(\\mathbf{\\theta}) $ is between $ -\\pi$ and $\\pi$.\nThe phase winding is calculated in each individual realization and then averaged over the realizations to generate the average phase winding.\n\n\n\n\\section{Phase Slip Dynamics}\\label{dynamics}\n\nIn Fig. \\ref{fig:phwdtime} we show the time evolution of the average phase winding along the center of the toroidal trap for three different barrier heights and three different stirring frequencies.  For all three rotation frequencies $\\omega_{s}$, and for the smallest barrier height of $V_{b}/J = 1$, the phase winding does not relax to the new ground state. Instead, on the time scales of a typical experiment, it remains in a long-lived, metastable state. \n On the other hand, for large barrier heights such as $V_{b}/J = 2.4$, the coupling across the barrier is  small compared to the temperature, so that the dynamics are oscillatory and noisy for the length of the experiment. Here, the dynamics of the experiment result in a distribution of phase windings, rather than - essentially - a single phase winding number.  However, there is an intermediate regime, for example for $V_{b}/J = 1.8$, for which the system relaxes consistently to the desired ground state in a realistic time.\n\n\\begin{figure}\n   \\includegraphics[scale=.58]{figures/final_phase_winding.eps} \n    \\caption{We depict the average final phase winding as a function of the barrier sweep frequency for barrier heights, $V_b/J=1.0, 1.8, 2.4$. For $V_{b}/J =1$, the system is remains dynamically trapped below the equilibrium phase winding number. For large barrier heights the system approaches a linear response. This tendency is already visible for $V_{b}/J = 2.4$, and continues for higher values. The intermediate example with $V_{b}/J = 1.8$, provides a realistic value that leads to a step-like response in a realistic time. The black line indicates steps at $\\omega_s/\\omega_0 = n+1/2$, where $n$ is an integer.}\n    \\label{fig:steps}\n\\end{figure}\n\nThis behavior can also be seen in Fig. \\ref{fig:steps}. Here, we depict the final, average phase winding at the end of the experiment, as a function of the stirring frequency, for several barrier heights.\n  As indicated, the idealized, fully quantized, and fully relaxed phase winding shows steps at $\\omega_{s}/\\omega_{0} = n + 1/2$, with $n$ being an integer. This is shown as a black line.\n   For too small of a barrier height, such as $V_{b}/J= 1$, the system remains dynamically trapped at a smaller phase winding than for the fully relaxed system.\n   As the barrier height is increased, the behavior of the phase winding approaches the idealized, step-like behavior. However, as the barrier height is increased further, the average phase winding approaches a linear, classical behavior. Here, the phases across the barrier are essentially uncorrelated, due to the small coupling that is overcome by the fluctuations. \n \n In Fig. \\ref{fig:histogram} (a) and (b) we elaborate on this behavior. We show the distribution of the phase winding, as a function of time, which goes beyond the expectation value of this distribution that was shown in Fig. \\ref{fig:steps}.   In Fig. \\ref{fig:histogram} (a) we show the case of the larger value of the barrier height, $V_{b}/J = 2.4$, and in Fig. \\ref{fig:histogram} (b) we show the case with $V_{b}/J = 1.8$. For the intermediate barrier height of $V_{b}/J = 1.8$, the system converges to a single value of the phase winding over the time of the experiment. The transient oscillations are damped out on this time scale. For the larger value of $V_{b}/J = 2.4$ the distribution of phase windings is wider and stays oscillatory throughout the experiment time. It does not settle to a single value, but rather a distribution that mostly includes $n_{\\Delta \\theta} = 3$ and $4$, in this example. \n \n We note that the width of this distribution is controlled by the long range phase fluctuations, along the quasi-1D geometry of the ring-shaped condensate. As discussed in Ref. \\cite{phasefluct}, the single particle correlation function along the ring falls off exponentially, with a length scale $l_{\\phi} = \\hbar^{2} N_{0}/(\\pi m \\rho_{0} k_{B} T)$. $N_{0}$ is the number of condensed atoms. \n This length scale has to be compared to the circumference of the ring, $L_{c} =2 \\pi \\rho_{0} \\approx 124.4 \\mu$m.\n  For $N_{0}\\approx N$, and $N$ being the total atom number, and for $T = 50$ nK, we have $l_{\\phi} = 336 \\mu$m. This results in a ratio $L_{c}/l_{\\phi}$ that is smaller than $1$. However, this does suggest, that the phase coherence  across the barrier can be further stabilized by increasing this ratio. \n This ratio can also be written as\n \\begin{eqnarray}\n \\frac{L_{c}}{ l_{\\phi}} &=& \\frac{4 \\pi^{2}}{ n_{2D} \\lambda_{T}^{2}}\n \\end{eqnarray}\n where $\\lambda_{T}$ is the thermal de Broglie wavelength, $\\lambda_{T} = (2\\pi \\hbar^{2} /(m k_{B} T))^{1/2}$, and $n_{2D} = N/ (\\pi \\rho_{0}^{2})$ is a the density of a hypothetical system of area $\\pi \\rho_{0}^{2}$ with $N$ atoms. Therefore, the figure of merit that determines if the  elongated 3D condensate is phase coherent along its extended 1D axis, is of the form of an inverse 2D phase space density.\n \n  We note that in the regime of strong phase coherence along the ring shaped condensate, a protocol that fully splits the ring at the barrier, then winds up the phase, and then smoothly reconnects the ring, can also be performed. Here, the phase coherence is not provided by the link across the barrier, but by the phase coherence in the ring. \n\n\n\\begin{figure}\n   \\includegraphics[scale=.58]{figures/phase_winding_histogram.eps} \n    \\caption{We plot the occupation of each phase winding for sweep frequency  $\\omega_s/\\omega_0=3.8$ and barrier heights $V_b/J=1.8, 2.4$. In (a) and (b), the barrier is stationary while it is ramped up, from $t_1=100 \\Delta t$ to $t_2=300 \\Delta t$ and then accelerated at maximum height, from $t_2=300 \\Delta t$ to $t_3=500 \\Delta t$ (protocol 1). In (c), the barrier stirs with a constant frequency while the magnitude is ramped up, from $t_1=100 \\Delta t$ to $t_2=300 \\Delta t$ (protocol 2).}\n    \\label{fig:histogram}\n\\end{figure}\n\n\n\n\\section{Optimizing the barrier ramp-up}\\label{optimal}\n\n  As a last point, we compare two ramp-up protocols, shown in Figs. \\ref{fig:histogram} (b) and (c). In  Fig. \\ref{fig:histogram} (b) we show the case in which the barrier height is ramped up first, while remaining stationary, and then its velocity. This is the case which has been discussed thoughout this paper.\n In Fig. \\ref{fig:histogram} (c) we show the case in which the velocity is always at its final magnitude, and the height is ramped up from zero. \n  We see that in the latter case the response is visibly more oscillatory and noisy. Here, the phase slips begins to occurs around $t=200 \\Delta t$, when the barrier is still well below its maximum height.  Each phase slip generates phonic excitations which are released into the bulk of the condensate, as visible in Fig.~\\ref{fig:histogram} (c).  Similar processes were observed in Ref. \\cite{ring}.  Additionally, observe that it takes longer for the system to relax to a single phase winding. This suggests that the density at the barrier should be minimized when the phase slips occur to reduce undesirable excitations. \n    \nThis is illustrated in Fig. \\ref{fig:heating}. Here, we show the total energy per particle during these evolution of these two protocols. A larger magnitude of this quantity will result in a higher temperature of the system after it has thermalized, and therefore can be used as a measure for how well the SQUID is implemented.   So in this protocol additional undesired excitations are created, along with the desired phase slips, which leads to longer relaxation times and additional heating of the system.  These effects are more pronounced at higher stirring frequencies than at lower stirring frequencies and are expected to play a bigger role as the stirring frequency is further increased.  Again, we observe that the preferable operation of the SQUID consists of first ramping up the barrier height, and then the barrier velocity.\n \n\n\\begin{figure}\n   \\includegraphics[scale=.58]{figures/energy_ws3.8.eps} \n    \\caption{We depict the dynamics of the energy for sweep frequency $\\omega_s/\\omega_0=3.8$ and barrier height, $V_b/J=1.8$. In protocol 1 the barrier is stationary while it is ramped up, from $t_1=100 \\Delta t$ to $t_2=300\\Delta t$ and then accelerated at maximum height, from $t_2=300 \\Delta t$ to $t_3=500 \\Delta t$. In protocol 2, the barrier stirs at constant frequency while the magnitude is ramped up, from $t_1=100 \\Delta t$ to $t_2=300 \\Delta t$. $E_0$ is the total energy at t=0.}\n    \\label{fig:heating}\n\\end{figure}\n\n\n\\section{Conclusions}\\label{conclude}\n\nIn conclusion, we  have demonstrated the atomtronic implementation of a SQUID in a toroidal Bose-Einstein condensate, with particular emphasis on the effect of thermal fluctuations. These are included in our Truncated Wigner approximation of a realistic system, as realized in the experiments of Refs. \\cite{gretchensquid, gretchenother}.\n We show that the regime of SQUID operation is viable for intermediate barrier heights, which imitated the SNS junction of a solid state SQUID. For too low of a barrier height, the rate of phase slips is too low for the system to reach the equilibrium  phase winding number for a given moving barrier speed. \n  For too high of a barrier, the thermal phase fluctuations suppress the coherence across the barrier, and the characteristic, step-like behavior of the phase winding is washed out into a classical, linear response. \n   Furthermore, we investigate two ramp-up protocols of the barrier height and the barrier velocity, and show that ramping up the barrier height first, before setting it in motion,  results in less heating.\n We emphasize that these results and considerations will similarly apply to all atomtronic circuits, that are based on condensate dynamics in non-trivial trap geometries, and are therefore of broad interest to the emerging field of imitating superconducting circuitry with Bose-Einstein condensates. \n\n\n\n\\begin{acknowledgments}\n\n We acknowledge support from the Deutsche Forschungsgemeinschaft through the SFB 925 and the Hamburg Centre for Ultrafast Imaging, and from the Landesexzellenzinitiative Hamburg, supported by the Joachim Herz Stiftung. \n \n \n \n\\end{acknowledgments}\n\n\n\n\n\\begin{thebibliography}{10}\n\n\n\\bibitem{holland}\nR. A. Pepino, J. Cooper, D. Z. Anderson and M. J. Holland, Phys. Rev. Lett. {\\bf 103}, 140405 (2009).\nA. Ruschhaupt and J. G. Muga,  Phys. Rev. A {\\bf 70}, 061604 (2004).\n J. A. Stickney, D. Z. Anderson and A. A. Zozulya,  Phys. Rev. A {\\bf 75}, 013608 (2007).\n\n\n\\bibitem{gretchensquid}\n Stephen Eckel, Jeffrey G. Lee, Fred Jendrzejewski, Noel Murray, Charles W. Clark, Christopher J. Lobb, William D. Phillips, Mark Edwards, Gretchen K. Campbell, \nNature {\\bf 506}, 200-203 (2014). \n\n\\bibitem{gretchenother}\nA. Ramanathan, K. C. Wright, S. R.Muniz, M. Zelan,W.\nT. Hill, C. J. Lobb, K. Helmerson, W. D. Phillips, and\nG. K. Campbell, Phys. Rev. Lett. 106, 130401 (2011); \n C. Ryu, et al.,  Phys. Rev. Lett. {\\bf 99}, 260401 (2007); \n K. C. Wright, R. B. Blakestad, C. J. Lobb, W. D. Phillips, and G. K. Campbell\nPhys. Rev. Lett. {\\bf 110}, 025302 (2013). \n\n\n\\bibitem{boshier}\nC. Ryu, P. W. Blackburn, A. A. Blinova, and M. G. Boshier, Phys. Rev. Lett. {\\bf 111}, 205301 (2013). \n\n\n\n\\bibitem{dalibard}\nLaura Corman, Lauriane Chomaz, Tom Bienaime, Remi Desbuquois, Christof Weitenberg, Sylvain Nascimbene, Jean Dalibard, Jerome Beugnon, Phys. Rev. Lett. {\\bf 113}, 135302 (2014).\n\n\n\\bibitem{stirring}\nC. Raman, M. K\\\"ohl, R. Onofrio, D. S. Durfee, C. E. Kuklewicz, Z. Hadzibabic, and W. Ketterle, Phys. Rev. Lett. {\\bf 83}, 2502 (1999); \n R. Desbuquois, L. Chomaz, T. Yefsah, J. Leonard,  J. Beugnon, C. Weitenberg, and J. Dalibard, Nature Phys. {\\bf 8}, 645 (2012);\n W. Weimer, K. Morgener, V. P. Singh, J. Siegl, K. Hueck, N. Luick, L. Mathey, H. Moritz, Phys. Rev. Lett. {\\bf 114}, 095301 (2015); Vijay Pal Singh, Wolf Weimer, Kai Morgener, Jonas Siegl, Klaus Hueck, Niclas Luick, Henning Moritz, Ludwig Mathey, arxiv/1509.02168.\n\n\\bibitem{ringtheory}\n F. Piazza, L. A. Collins, and A. Smerzi,  J. Phys. B: At. Mol. Opt. Phys. {\\bf 46}, 095302 (2013); \n A. I. Yakimenko, K. O. Isaieva, S. I. Vilchinskii, and E. A. Ostrovskaya, Phys. Rev. A {\\bf 91}, 023607 (2015); \n\n\n\\bibitem{TWARevs}\nP. B. Blakie, et al., Adv. in Phys. 57, 363 (2008); A. Polkovnikov, Annals of Phys. 325, 1790 (2010).\n\n\n\\bibitem{ring}\nAmy C. Mathey, Charles W. Clark, L. Mathey, Phys. Rev. A {\\bf 90} 023604.\n\n\\bibitem{phasefluct}\nL. Mathey, A. Ramanathan, K. C. Wright, S. R. Muniz, W. D. Phillips, Charles W. Clark, Phys. Rev. A {\\bf 82}, 033607 (2010).\n\n\\end{thebibliography}\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 6427, "prevtext": "\n\n\\title{Realizing and optimizing an atomtronic SQUID}\n\n\n\\author{Amy C. Mathey$^{1}$, and L. Mathey$^{1,2}$}\n\n\n\\affiliation{$^{1}$Zentrum f\\\"ur Optische Quantentechnologien and Institut f\\\"ur Laserphysik, Universit\\\"at Hamburg, 22761 Hamburg, Germany\\\\\n$^{2}$The Hamburg Centre for Ultrafast Imaging, Luruper Chaussee 149, Hamburg 22761, Germany}\n\n\\begin{abstract}\n We demonstrate how a toroidal Bose-Einstein condensate with a movable barrier can be used to realize an atomtronic SQUID.  The magnitude of the barrier height, which creates the analogue of an SNS junction, is of crucial importance. For too low of a barrier, the relaxation  of the system is dynamically suppressed, due to the small rate of phase slips at the barrier. For too high of a barrier, the phase coherence across the barrier is suppressed due to thermal fluctuations, which are included in our Truncated Wigner approach. Furthermore, we show that the ramp-up protocol of the barrier can be improved by ramping up its height first, and its velocity after that, which is of direct practical relevance for on-going experimental realizations.   \n\\end{abstract}\n\\maketitle\n\n\n\\section{Introduction}\n\n\nThe advancement of  cold atom technology, and the level of control that can be achieved in such systems, has motivated the question if it can be used to emulate electronic circuitry, and possibly move beyond its features, Ref. \\cite{holland}. \n While a realization of, say, the equivalent of electrons moving in a semiconducting material is an interesting direction in itself, it is particularly intriguing to capitalize on the specific features of cold atom systems, such as long-range phase coherence in Bose-Einstein condensates. This motivates to realize systems  inspired by superconducting circuitry.    \n Experimentally, an interesting starting point, and a remarkable achievement of its own, is the realization of Bose-Einstein condensates (BECs) in toroidal geometries, Refs. \\cite{gretchensquid, gretchenother, boshier, dalibard}. \n\n\\begin{figure}\n   \\includegraphics[scale=.52]{figures/n_jx_Ipn72Vb1.8fb3.8.eps} \n    \\caption{The density, $n(\\rho,\\theta)$ and the $\\theta$ component of the current, $j_\\theta(\\rho,\\theta)$ at $z=0$ before ($t=300 \\Delta t = 217.2$ ms), during ($t=410 \\Delta t =724.0$ ms and $t=480 \\Delta t =847.6$ ms) and after ($t=2000 \\Delta t = 1448$ ms) stirring. The barrier height is $V_b/J=1.8$ and the stirring frequency is $ \\omega_s/\\omega_0=3.8$.}\n    \\label{fig:density}\n\\end{figure}\n\n In this paper, we study the equivalent of an electronic SQUID. The condensate wave function is the equivalent of the superconducting wave function, and a potential barrier, at which the condensate density is suppressed,  replaces the SNS interface. This barrier is then moved at a constant speed, which imitates a non-zero magnetic flux through the  ring. This setup can also be seen as a stirring experiment, testing the superfluid properties of  condensates,  see Refs. \\cite{stirring}.\n  Other theoretical studies of the ring geometry were reported in Refs. \\cite{ringtheory}.\n \n We demonstrate that a regime of  a controlled and effective realization of an atomtronic SQUID exists for intermediate potential barrier heights, for realistic temperatures. For small barrier heights, the dynamical relaxation of the condensate to the ground state phase winding is suppressed, because phase slips at the barrier occur only at a very small rate. For large barrier heights, the phase coherence across the barrier is suppressed because of thermal fluctuations. This results in a smoothed-out response of the rotation, approaching a linear dependence on the stirring velocity, rather than a quantized, step-like response, that is characteristic for a SQUID.  Furthermore, we consider two seemingly similar turn on processes for the SQUID operation: to either first ramp up the barrier to full speed and then ramp up the barrier height, or use the reverse order. Interestingly, we find that the latter results in noticeably less heating, and that the new ground state is reached more quickly. \n \n This paper is organized as follows: In Sect. \\ref{method} we describe our simulation method, in Sect. \\ref{dynamics} we discuss the phase slip dynamics. In Sect. \\ref{optimal} we compare the two possible barrier ramp-up scenarios, and in Sect. \\ref{conclude} we conclude. \n \n \n\n\\section{Simulation method}\\label{method}\n\nBecause the SQUID dynamics is dominated by the dynamics at the barrier, and because of the low density at the barrier, and therefore the low mean-field energy, it is imperative to include thermal fluctuations of the system. \n We include both thermal fluctuations, and lowest order of quantum fluctuations, within a Truncated Wigner approximation (TWA), see e.g. \\cite{TWARevs}. The approach that we use is closely related to the one of Ref. \\cite{ring}. \n\nWe describe the system with the Hamiltonian\n \\begin{eqnarray}\n\\hat{H}&=&\\int d\\mathbf{r} \\Big( \\hat{\\Psi}^\\dagger(\\mathbf{r}) \\left[ -\\frac{\\hbar^2 {\\mathbf{\\nabla} ^}2}{2m} + V(\\mathbf{r},t) \\right] \\hat{\\Psi}(\\mathbf{r}) \\nonumber \\\\ \n&&+ \\frac{g}{2} \\hat{\\Psi}^\\dagger(\\mathbf{r}) \\hat{\\Psi}^\\dagger(\\mathbf{r}) \\hat{\\Psi}(\\mathbf{r}) \\hat{\\Psi}(\\mathbf{r})\\Big)\n \\end{eqnarray}\n\nwhere $m$ is the atomic mass and $g$ is the interaction strength, for which we use the approximation $g=4\\pi a_s \\hbar^2/m$, with $a_{s}$  being the s-wave scattering length. \nThe external potential, $ V(\\mathbf{r},t) = V_{tr} (\\mathbf{r} )+ V_{bar} (\\mathbf{r},t) $ consists of the trapping potential,  \n$ V_{tr}(\\mathbf{r}) = \\frac{1}{2} m \\omega_\\rho^2(\\rho - \\rho_0)^2 + \\frac{1}{2}m \\omega_z^2z^2$ and the time-dependent stirring potential, $V_{bar}(\\mathbf{r},t) = \\alpha(t)V_b\\exp\\left[- 0.5 \\rho^2(\\theta-\\theta_b(t))^2/l_b^2\\right]$. \n Within the Truncated Wigner Approximation (TWA), the operators, $\\hat{\\Psi}$ are replaced by classical fields, which are propagated according to the equations of motion of this    Hamlitonian. The initial condition of these classical fields are generated from the Wigner distribution of the initial state. \n\nIn order to carry out the calculations, we discretize the real-space description by introducing a lattice approximation and work in cylindrical coordinates.   We replace the continuous wave function, $\\psi(\\rho,\\theta,z)$ by a discrete wavefunction, $\\tilde{\\psi}_{ijk}=\\tilde{\\psi}(\\rho_i,\\theta_j,z_k) $, with the mapping\n\n", "index": 1, "text": "$$\n\\psi(\\rho,\\theta,z)  \\rightarrow \\left( \\frac{\\rho_0}{\\rho_i l^3}\\right)^{1/2}\\tilde{\\psi}_{ijk}\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"\\psi(\\rho,\\theta,z)\\rightarrow\\left(\\frac{\\rho_{0}}{\\rho_{i}l^{3}}\\right)^{1/2%&#10;}\\tilde{\\psi}_{ijk}\" display=\"block\"><mrow><mrow><mi>ψ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>ρ</mi><mo>,</mo><mi>θ</mi><mo>,</mo><mi>z</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>→</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>ρ</mi><mn>0</mn></msub><mrow><msub><mi>ρ</mi><mi>i</mi></msub><mo>⁢</mo><msup><mi>l</mi><mn>3</mn></msup></mrow></mfrac><mo>)</mo></mrow><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><msub><mover accent=\"true\"><mi>ψ</mi><mo stretchy=\"false\">~</mo></mover><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>k</mi></mrow></msub></mrow></mrow></math>", "type": "latex"}]