[{"file": "1601.07881.tex", "nexttext": "\n\nwhere $\\mathbf{U} \\in \\mathbb{R}^{n \\times n}$ and $\\mathbf{V} \\in \\mathbb{R}^{p \\times n}$ contain the left and right singular vectors and where $\\mathbf{S} \\in \\mathbb{R}^{p \\times p}$ is the diagonal matrix of singular values. Importantly, $\\mathbf{U}$ and $\\mathbf{V}$ have rank equal to that of $\\mathbf{X}$. The $i$th principal component, then, is the $i$th column of $\\mathbf{U}$. The corresponding column of $\\mathbf{V}$ gives weights that indicate the extent to which each PANAS-X category contributed to that component. Similarly, squaring the corresponding singular element of $\\mathbf{S}$ gives the magnitude of variance accounted for by that component. In the \\textbf{Supplemental Information} we examine, in detail, the robustness of this analysis to the exclusion of individual data points (Figure~\\ref{figure:leaveOneOut}), random permutations of the flexibility estimates (Figure~\\ref{figure:randomMood}), eschewing PCA in favor of individual PANAS-X categories (Figure~\\ref{figure:individualPANASXCategories}), other principal components besides the first (Figure~\\ref{figure:PC4}), the use previously-defined emotional affect classes rather than a principal component to identify indices of positivity (Figure~\\ref{figure:panasClasses}--\\ref{figure:fatigue}), and the use of exploratory factor analysis instead of PCA (Figure~\\ref{figure:figEFA}). We also test the robustness of our results after controlling for other psychophysiological and nuisance variables (Figure~\\ref{figure:headMotion},\\ref{figure:nuisance}).\n\n\\subsection*{Dynamic network construction and community detection}\nWe sought a division of brain regions into communities, which are thought to reflect the brain's functional sub-systems \\cite{sporns2016modular}. We divided the parcel time series into $T=14$ windows of 37 time points (TRs) each ($\\approx$1.36 minutes in length). For each window, we calculated the wavelet coherence matrix, $\\mathbf{C} \\in \\mathbb{R}^{N\\times N}$. Each element, $C_{ij}$, represented the magnitude squared coherence of the scale two (0.0625--0.125 Hz) Daubechies wavelet (length 4) decomposition of the windowed time series obtained from regions $i$ and $j$ (\\url{http://www.atmos.washington.edu/~wmtsa/}). This particular frequency band was selected based on previous work \\cite{bassett2011dynamic, braun2015dynamic}. Each dynamic network was treated as a layer in a multi-layer network, $\\mathcal{C} = \\{ \\mathbf{C}_1 \\ldots \\mathbf{C}_{14} \\}$. To detect the temporal evolution of modules, we maximized the multi-layer modularity \\cite{mucha2010community}, which seeks the assignment all brain regions in all layers to modules such that:\n\n\n", "itemtype": "equation", "pos": 13731, "prevtext": "\n\n\\preprint{APS/123-QED}\n\n\\title{A positive mood, a flexible brain}\n\n\\author{Richard F. Betzel$^1$}\n\\author{Theodore D. Satterthwaite$^2$}\n\\author{Joshua I. Gold$^3$}\n\\author{Danielle S. Bassett$^{1,4}$}\n \\email{dsb @ seas.upenn.edu}\n\\affiliation{\n Department of Bioengineering, University of Pennsylvania, Philadelphia, PA, 19104\n}\n\\affiliation{\n Neuropsychiatry Section, Department of Psychiatry, University of Pennsylvania, Philadelphia, PA, 19104\n}\n\\affiliation{\n Department of Neuroscience, University of Pennsylvania, Philadelphia, PA, 19104\n}\n\\affiliation{\nDepartment of Electrical and Systems Engineering, University of Pennsylvania, Philadelphia, PA, 19104\n}\n\n\\date{\\today}\n             \n\n\\begin{abstract}\nFlexible reconfiguration of human brain networks supports cognitive flexibility and learning. However, modulating flexibility to enhance learning requires an understanding of the relationship between flexibility and brain state. In an unprecedented longitudinal data set, we investigate the relationship between flexibility and mood, demonstrating that flexibility is positively correlated with emotional state. Our results inform the modulation of brain state to enhance response to training in health and injury.\n\\end{abstract}\n\n\n                             \n\n                              \n\\maketitle\n\n\n\n\n\\begin{figure*}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=1\\textwidth]{PCAandFlexCombined}}\n\\caption{\\textbf{Summary of principal component and flexibility analyses.} \\emph{(A)} Correlation matrix of PANAS-X categories with one another, ordered by loading of PANAS-X categories onto the first principal component. \\emph{(B)} Variance accounted for by each of the first ten principal components. \\emph{(C)} Detail of the positivity index. Each colored point indicates the loading of a PANAS-X category onto the first principal component, which we termed the ``positivity index.'' \\emph{(D,E)} Topographic representation of mean and standard deviation of flexibility. \\emph{(F)} Mean and standard deviation of flexibility scores plotted against one another. Color-coding indicates brain systems: fronto-parietal (purple), somatomotor (green), peripheral visual (blue), and the rest of brain (grey). Inset depicts topographic representation of somatomotor (SMN), fronto-parietal (FP1), and peripheral visual (VIS2) \\emph{(G)} The $z$-score of the mean system flexibility. \\emph{(H)} The $z$-score of the standard deviation of system flexibility.}\\label{figure:fig1}\n\\end{center}\n\\end{figure*}\n\n\nTransient changes in the patterns of communication between brain areas support both learning and cognitive flexibility \\cite{bassett2011dynamic,braun2015dynamic}. These abilities are not static but can vary considerably over time and as a function of an individual's affective state. For example, learning often shows an ``inverted-U'' relationship with arousal, with optimal learning at moderate levels of arousal \\cite{robert1908relation}. Together, these findings imply that the influence of affective state on learning and cognition may involve modulations of brain network flexibility. However, virtually nothing is known about such modulations.\n\nA potential simple and intuitive affect-related driver of daily variations in brain network flexibility is mood \\cite{critchley2005neural}. Mood can fluctuate normally over time scales ranging from minutes to weeks. Moreover, mood can affect learning, for example by biasing the perception of reward outcomes \\cite{eldar2016mood}. These biases are thought to arise from neurophysiological changes in neurotransmitter systems linked to arousal \\cite{nassar2012rational}. However, the network-level mechanisms of these processes in the human brain remain unknown. We hypothesized that positive mood is associated with enhanced brain network flexibility, potentially explaining the observations that more flexible brains display greater cognitive flexibility and better learning \\cite{bassett2011dynamic,braun2015dynamic}.\n\nTo address this hypothesis, we leveraged data from the \\textit{MyConnectome Project}, which acquired extensive longitudinal neuroimaging and psychophysiological data from a single participant \\cite{laumann2015functional, poldrack2015long}, who underwent multiple resting-state fMRI scans each week for a year. The participant also recorded his mood on a standard questionnaire (expanded Positive and Negative Affect Schedule; PANAS-X) \\cite{watson1988development}. Subjective ratings across the 60 mood categories were correlated with one another, suggesting the presence of a latent structure (Table \\ref{table:panasxTerms}; Figure~\\ref{figure:fig1}A). We interrogated this structure using a principal components analysis, generating a set of mutually orthogonal components, loadings of PANAS-X categories onto components, and the percent variance accounted for by each component. The first component explained $\\approx$33\\% of the variance (the next accounted for $\\approx$12\\%) (Figure \\ref{figure:fig1}B). The top three PANAS-X categories, in terms of their loading magnitude onto the first component, were ``happy'', ``enthusiastic'', and ``confident''. The bottom three were ``downhearted'', ``blue'', and ``irritable''. We termed the first principal component ``positivity index'' ($PI$), due to its sensitivity to emotional valence (Figure \\ref{figure:fig1}C).\n\nNext, we estimated flexibility in 630 brain regions and on average across the brain. This entailed dividing regional fMRI BOLD time series into non-overlapping windows. Within each window, we estimated functional connectivity between all pairs of brain regions using a magnitude-squared wavelet coherence \\cite{bassett2011dynamic}. The result was an ordered set of functional connectivity matrices, each of which represented a layer in a multi-layer network \\cite{bassett2013robust}. Next, we used a community detection algorithm to partition brain regions into communities (functional sub-systems \\cite{power2011functional}) across layers (windows) \\cite{mucha2010community} (Figures~\\ref{figure:exampleLouvainOutput},\\ref{figure:paramSweep}). Using these community assignments, we calculated the flexibility of each brain region as the fraction of times that its community assignment changed from one layer to the next \\cite{bassett2011dynamic}. We repeated this analysis for all scan sessions.\n\nWe first asked which regions of the brain were flexible \\emph{versus} inflexible, and which region's flexibility values varied appreciably across scan sessions. We observed that most brain regions possessed similar levels of mean flexibility and quotidian variability; the latter measured by the standard deviation (Figures~\\ref{figure:fig1}D,E). A small number of regions, however, including components of visual, fronto-parietal, and somatomotor systems, possessed lower mean flexibility than the rest of the brain and were also more variable (Figure~\\ref{figure:fig1}F). To quantify these observations, we aggregated regional flexibility by brain system and found that these same systems had mean flexibilities much lower than expected by chance (permutation test, $z_{FP2} = -6.52$, $p = 3.44 \\times 10^{-11}$; $z_{SMN} = -4.53$, $p = 3.00 \\times 10^{-6}$; $z_{VIS2} = -8.52$, $p<10^{-15}$; FDR-controlled, $d = 0.001$) (Figure~\\ref{figure:fig1}G). Similarly, the quotidian variability of SMN and VIS2 were much greater than expected (permutation test, $z_{SMN} = 13.45$, $p<10^{-15}$; $z_{VIS2} = 7.93$, $p<10^{-15}$; FDR-controlled, $d = 0.001$) (Figure~\\ref{figure:fig1}H). The presence of high quotidian variability in relatively rigid regions suggests the presence of a strong energetic constraint on network dynamics.\n\nGlobal flexibility, or the average flexibility across brain regions, was positively correlated with positivity index (Pearson's correlation, $\\hat{r}(PI,F) = 0.289, p = 0.013$) (Figure \\ref{figure:fig2}A) (See Supplementary Information for details; Figures~\\ref{figure:leaveOneOut}--\\ref{figure:nuisance}), implying that positive emotional states correspond to a more flexible brain. To better understand which brain regions contributed to this correlation, we calculated the correlation of each brain region's flexibility with the positivity index. We observed that most brain regions were not significantly associated with the positivity index. However, regions comprising the somatomotor system exhibited significant positive correlations (permutation test, $z = 8.40, p < 10^{-15}$) (Figure \\ref{figure:fig2}B,C), complementing prior work linking heightened motor activations -- potentially due to motor imagery -- with positive mood \\cite{adolphs2002neural}.  A few systems were also more anti-correlated with flexibility than expected, including cingulo-opercular ($z_{CO} = -3.38$, $p = 3.63 \\times 10^{-4}$), dorsal attention ($z_{DAN} = -4.14$, $p = 1.66 \\times 10^{-5}$), and peripheral visual networks ($z_{VIS2} = -3.52$, $p = 2.11 \\times 10^{-4}$) (FDR-controlled, $d = 0.001$), suggesting that relative stability in these higher-order cognitive systems was accompanied by positive mood.\n\n\\begin{figure*}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=1\\textwidth]{FigurePICorrWithRegFlex2}}\n\\caption{\\textbf{(Relationship of flexibility scores with positivity index.)} \\emph{(A)} Global flexibility as a function of positivity index. \\emph{(B)} Topographic representation of correlation of regional flexibility with positivity index. \\emph{(C)} Regional correlations grouped by system between regional flexibility and positivity index.}\\label{figure:fig2}\n\\end{center}\n\\end{figure*}\n\n\nThe relationship between mood and flexibility suggests a potential network-level mechanism for learning deficits observed in mood disorders \\cite{chrobak2015implicit}, and the dependence of those deficits on cognitive flexibility \\cite{papmeyer2015neurocognition}. In these individuals, the development of pharmacological and stimulation-based interventions to alter brain network flexibility is therefore of particular interest. For example, brain network flexibility can be altered through modulation of NMDA receptor function \\cite{braun2016dynamic}. However, an arguably more powerful approach might be to target states of arousal, which are known to be altered in mood disorders \\cite{hegerl2014vigilance}, implicated in learning \\cite{critchley2005neural}, and modulated by norepinephrine systems \\cite{critchley2005neural}.  There is some preliminary evidence that arousal modulates network connectivity \\cite{eldar2016mood}, but further work is needed to understand the patterns and dynamics of these network modulations and their relationship to mood.\n\nNeurophysiological underpinnings aside, our observations can nevertheless inform the development of educational interventions to enhance learning. Intuitively, our results support the notion that by altering mood, one might alter brain network flexibility, and therefore predispose the brain to learn quickly in subsequent tasks. Such an outcome would directly fulfill the goals of personalized neuroeducation \\cite{devonshire2010neuroscience}: the use of neuroscientific information to inform educational practices tuned to individual students.  Potentially powerful modulations could include simple mental exercises, which are easily translated into educational settings. For example, self-affirmation tasks have been shown to parametrically alter brain activity \\cite{cascio2015self} to a degree that predicts individual differences in future behavior \\cite{falk2015self}. Future work could define a carefully titrated library of mental tasks that modulate brain network flexibility (and subsequent learning) in a predictable fashion by modulating mood.\n\n\\section*{Online methods}\n\\subsection*{MyConnectome data}\nAll data were obtained from the \\textit{MyConnectome Project}'s data-sharing webpage (\\url{http://myconnectome.org/wp/data-sharing/}). Specifically, we studied pre-processed parcel fMRI time series for scan sessions 14--104. Details of the pre-processing procedure have been described elsewhere \\cite{laumann2015functional, poldrack2015long}. Each session consisted of 518 time points during which the average fMRI BOLD signal was measured for $N=630$ parcels or regions of interest (ROIs). With a TR of 2.2 s, the analyzed segment of each session was approximately 19 minutes long. In addition to fMRI data, we also examined behavioral data available on the same webpage. The behavioral data included additional biometric information, such as heart rate and blood pressure, though we analyzed only PANAS-X categories, a set of emotional categories that the subject rated on a 0-5 Likert scale. Usually the PANAS-X test includes 60 categories. Only 57 were used as part of our analysis; the categories ``bashful'', ``timid'', and ``shy'' had ratings of zero for the entire duration of the experiment.\n\n\\subsection*{Principal component analysis}\nOur analysis focused on the $n=73$ scan sessions for which both resting-state fMRI data and all $p=57$ PANAS-X categories were available. We standardized each category to have zero mean and unit variance. We represented the full set as the matrix, $\\mathbf{X} \\in \\mathbb{R}^{n \\times p}$, which we submitted to a principal component analysis (PCA). Essentially, PCA takes a data matrix and linearly factorizes it by creating a set of orthogonal \\textit{principal components}, subject to the condition that each successive component has the greatest possible variance. Each component is a linear combination of the original data variables.\n\nSpecifically, we performed PCA using a singular value decomposition (SVD) \\cite{eckart1936approximation} which deconstructs $\\mathbf{X}$ according to the equation:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\mathbf{X} = \\mathbf{U} \\mathbf{S} \\mathbf{V}^T\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{X}=\\mathbf{U}\\mathbf{S}\\mathbf{V}^{T}\" display=\"block\"><mrow><mi>𝐗</mi><mo>=</mo><msup><mi>𝐔𝐒𝐕</mi><mi>T</mi></msup></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nis maximized. In this expression, $C_{ijs}$ is the coherence of regions $i$ and $j$ in layer $s$. The tensor $P_{ijs}$ is the expected coherence in an appropriate null model. Specifically, we choose $P_{ijs} = \\frac{k_{is} k_{js}}{2m_s}$, which is a multi-layer extension of the common configuration model. The parameter, $\\gamma$, scales the relative contribution of the expected connectivity and effectively controls the number of modules detected within a given layer. The other free parameter, $\\omega$, determines the similarity of modules across layers, and is therefore sometimes referred to as the \\emph{temporal resolution parameter} \\cite{bassett2013robust}. In the main text, we fix these parameters to the commonly-used default values of $\\gamma = \\omega = 1$ \\cite{bassett2013robust}. In the supplement we demonstrate the robustness of our results to variation in the resolution parameters (Figure \\ref{figure:paramSweep}).\n\nWe use a Louvain-like locally greedy algorithm to maximize the multi-layer modularity, $Q(\\gamma, \\omega)$ \\cite{jutla2011generalized} (typical output is show in Figure~\\ref{figure:exampleLouvainOutput}). Due to near-degeneracies in the modularity landscape \\cite{good2010performance} and stochastic elements in the optimization algorithm \\cite{blondel2008fast}, the output typically varies from one run to another. For this reason, rather than focus on any single run, we characterized the statistical properties of 50 runs of the algorithm, which correspond to 50 optimizations of the multi-layer modularity.\n\n\\subsection*{Regional and global flexibility}\nThe output of the Louvain-like locally greedy algorithm was a partition, $\\mathbf{G} \\in \\mathbb{R}^{N \\times T}$, whose element $G_{i,r} \\in \\{1 \\ldots c \\}$ is the community to which brain region $i$ in layer $r$ was assigned in that optimization. The multi-layer modularity maximization simultaneously assigns brain regions in all layers to communities so that community labels are consistent across layers, thus circumventing the commonly studied community matching problem. Given $\\mathbf{G}$, we can calculate each brain region's flexibility score:\n\n\n", "itemtype": "equation", "pos": 16477, "prevtext": "\n\nwhere $\\mathbf{U} \\in \\mathbb{R}^{n \\times n}$ and $\\mathbf{V} \\in \\mathbb{R}^{p \\times n}$ contain the left and right singular vectors and where $\\mathbf{S} \\in \\mathbb{R}^{p \\times p}$ is the diagonal matrix of singular values. Importantly, $\\mathbf{U}$ and $\\mathbf{V}$ have rank equal to that of $\\mathbf{X}$. The $i$th principal component, then, is the $i$th column of $\\mathbf{U}$. The corresponding column of $\\mathbf{V}$ gives weights that indicate the extent to which each PANAS-X category contributed to that component. Similarly, squaring the corresponding singular element of $\\mathbf{S}$ gives the magnitude of variance accounted for by that component. In the \\textbf{Supplemental Information} we examine, in detail, the robustness of this analysis to the exclusion of individual data points (Figure~\\ref{figure:leaveOneOut}), random permutations of the flexibility estimates (Figure~\\ref{figure:randomMood}), eschewing PCA in favor of individual PANAS-X categories (Figure~\\ref{figure:individualPANASXCategories}), other principal components besides the first (Figure~\\ref{figure:PC4}), the use previously-defined emotional affect classes rather than a principal component to identify indices of positivity (Figure~\\ref{figure:panasClasses}--\\ref{figure:fatigue}), and the use of exploratory factor analysis instead of PCA (Figure~\\ref{figure:figEFA}). We also test the robustness of our results after controlling for other psychophysiological and nuisance variables (Figure~\\ref{figure:headMotion},\\ref{figure:nuisance}).\n\n\\subsection*{Dynamic network construction and community detection}\nWe sought a division of brain regions into communities, which are thought to reflect the brain's functional sub-systems \\cite{sporns2016modular}. We divided the parcel time series into $T=14$ windows of 37 time points (TRs) each ($\\approx$1.36 minutes in length). For each window, we calculated the wavelet coherence matrix, $\\mathbf{C} \\in \\mathbb{R}^{N\\times N}$. Each element, $C_{ij}$, represented the magnitude squared coherence of the scale two (0.0625--0.125 Hz) Daubechies wavelet (length 4) decomposition of the windowed time series obtained from regions $i$ and $j$ (\\url{http://www.atmos.washington.edu/~wmtsa/}). This particular frequency band was selected based on previous work \\cite{bassett2011dynamic, braun2015dynamic}. Each dynamic network was treated as a layer in a multi-layer network, $\\mathcal{C} = \\{ \\mathbf{C}_1 \\ldots \\mathbf{C}_{14} \\}$. To detect the temporal evolution of modules, we maximized the multi-layer modularity \\cite{mucha2010community}, which seeks the assignment all brain regions in all layers to modules such that:\n\n\n", "index": 3, "text": "\\begin{equation}\n\\begin{split}\nQ(\\gamma, \\omega) & = \\frac{1}{2 \\mu} \\sum_{ijsr} [(C_{ijs} - \\gamma P_{ijs})]\\delta (G_{is},G_{js}) \\\\\n& + \\delta (i,j) \\cdot \\omega ]\\delta (G_{is}, G_{jr})\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\split Q(\\gamma,\\omega)&amp;=\\frac{1}{2\\mu}\\sum_{ijsr}[(C_{ijs}-\\gamma P_{ijs})]%&#10;\\delta(G_{is},G_{js})\\\\&#10;&amp;+\\delta(i,j)\\cdot\\omega]\\delta(G_{is},G_{jr})\" display=\"block\"><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>{split}</mtext></merror><mi>Q</mi><mrow><mo stretchy=\"false\">(</mo><mi>γ</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">&amp;</mi><mo>=</mo><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>μ</mi></mrow></mfrac><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>r</mi></mrow></munder><mrow><mo stretchy=\"false\">[</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>-</mo><mi>γ</mi><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">]</mo></mrow><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>,</mo><msub><mi>G</mi><mrow><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">&amp;</mi><mo>+</mo><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow><mo>⋅</mo><mi>ω</mi><mo stretchy=\"false\">]</mo><mi>δ</mi><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>,</mo><msub><mi>G</mi><mrow><mi>j</mi><mo>⁢</mo><mi>r</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nwhich counts the fraction of times that brain region, $i$, changes its community assignment in successive layers. Flexibility is normalized so that scores near zero and one correspond to brain regions whose community assignments are highly consistent and highly variable, respectively, across layers. Flexibility can also be averaged over all brain regions to obtain the \\textit{global flexibility} of the whole brain, $F = \\frac{1}{N} \\sum_{i = 1}^N f_i$. Both regional and global flexibility scores were calculated separately for each of the 50 modular partitions obtained from the Louvain-like algorithm and averaged across optimizations.\n\n\\subsection*{System assignments}\nIn addition to community assignments, each brain region was also assigned to a brain system. The designation of regions to systems was developed as part of an earlier study \\cite{laumann2015functional}, which defined, in total, 13 systems based on the topographic patterns of functional connections: cingulo-opercular (CO), default mode (DMN), dorsal attention (DAN), fronto-parietal 1 (FP1), fronto-parietal 2 (FP2), medial-parietal (MedPar), parietal-occipital (ParOcc), salience (SAL), somatomotor (SMN), ventral attention (VAN), primary visual (VIS1), and peripheral visual (VIS2). In addition to the previously-defined systems \\cite{laumann2015functional} we also included two other systems: (i) a subcortical (SUB) system comprised of bilateral thalamus, caudate, putamen, pallidum, hippocampus, amygdala, and accumbens, and (ii) a category reserved for brain regions with no clear assignment (NONE) (See Figure~\\ref{figure:brainSystems}). \n\nIn the main text, it was sometimes advantageous to describe measures at the level of brain systems as opposed individual brain regions or the whole brain (e.g. mean and standard deviation flexibility; mean correlation of flexibility with the positivity index). Such system-level measures were obtained by averaging across each system's constituent regions. However, because such measures may be biased by system size (i.e. number of regions assigned to that system), we compared the observed measures against the distribution of similar measurements obtained from a permutation null model, wherein the total number of regions assigned to each system remained constant but where assignments were, otherwise, made at random. Specifically, we calculated the mean, $\\mu_{sys}$, and standard deviation, $\\sigma_{sys}$, system-level measurements based on 10000 iterations of the permutation null model and expressed the observed measure, $y_{sys}$, as a $z$-score:\n\n\n", "itemtype": "equation", "pos": 18847, "prevtext": "\n\nis maximized. In this expression, $C_{ijs}$ is the coherence of regions $i$ and $j$ in layer $s$. The tensor $P_{ijs}$ is the expected coherence in an appropriate null model. Specifically, we choose $P_{ijs} = \\frac{k_{is} k_{js}}{2m_s}$, which is a multi-layer extension of the common configuration model. The parameter, $\\gamma$, scales the relative contribution of the expected connectivity and effectively controls the number of modules detected within a given layer. The other free parameter, $\\omega$, determines the similarity of modules across layers, and is therefore sometimes referred to as the \\emph{temporal resolution parameter} \\cite{bassett2013robust}. In the main text, we fix these parameters to the commonly-used default values of $\\gamma = \\omega = 1$ \\cite{bassett2013robust}. In the supplement we demonstrate the robustness of our results to variation in the resolution parameters (Figure \\ref{figure:paramSweep}).\n\nWe use a Louvain-like locally greedy algorithm to maximize the multi-layer modularity, $Q(\\gamma, \\omega)$ \\cite{jutla2011generalized} (typical output is show in Figure~\\ref{figure:exampleLouvainOutput}). Due to near-degeneracies in the modularity landscape \\cite{good2010performance} and stochastic elements in the optimization algorithm \\cite{blondel2008fast}, the output typically varies from one run to another. For this reason, rather than focus on any single run, we characterized the statistical properties of 50 runs of the algorithm, which correspond to 50 optimizations of the multi-layer modularity.\n\n\\subsection*{Regional and global flexibility}\nThe output of the Louvain-like locally greedy algorithm was a partition, $\\mathbf{G} \\in \\mathbb{R}^{N \\times T}$, whose element $G_{i,r} \\in \\{1 \\ldots c \\}$ is the community to which brain region $i$ in layer $r$ was assigned in that optimization. The multi-layer modularity maximization simultaneously assigns brain regions in all layers to communities so that community labels are consistent across layers, thus circumventing the commonly studied community matching problem. Given $\\mathbf{G}$, we can calculate each brain region's flexibility score:\n\n\n", "index": 5, "text": "\\begin{equation}\nf_i = \\frac{1}{T - 1} \\sum_{s = 1}^{T - 1} \\delta (G_{i,s},G_{i,s + 1})\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"f_{i}=\\frac{1}{T-1}\\sum_{s=1}^{T-1}\\delta(G_{i,s},G_{i,s+1})\" display=\"block\"><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>T</mi><mo>-</mo><mn>1</mn></mrow></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>s</mi><mo>=</mo><mn>1</mn></mrow><mrow><mi>T</mi><mo>-</mo><mn>1</mn></mrow></munderover><mrow><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>,</mo><mi>s</mi></mrow></msub><mo>,</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>,</mo><mrow><mi>s</mi><mo>+</mo><mn>1</mn></mrow></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nWe corrected for multiple comparisons by controlling the false discovery rate (FDR) using the linear step-up procedure \\cite{benjamini1995controlling}. In each case, we calculated an adjusted critical value, $p_{adj}$, by fixing the maximum FDR at $d=0.001$.\n\n\\subsection*{Acknowledgements} We thank Tyler Moore for helpful discussions and Russell Poldrack for providing additional imaging resources. RFB and DSB acknowledge support from the John D. and Catherine T. MacArthur Foundation, the Alfred P. Sloan Foundation, the Army Research Laboratory and the Army Research Office through contract numbers W911NF-10-2-0022 and W911NF-14-1-0679, the National Institute of Mental Health (2-R01-DC-009209-11), the National Institute of Child Health and Human Development (1R01HD086888-01), the Office of Naval Research, and the National Science Foundation (BCS-1441502 and BCS-1430087). JIG acknowledges support from the National Science Foundation (NSF-1533623. TDS was supported by the National Institute of Mental Health (K23MH098130 and R01MH107703).\n\n\\clearpage\n\\beginsupplement\n\\section*{Supplementary Information}\n\\subsection{Community detection}\n\\subsubsection{Multi-layer modularity maximization}\n\nA central topic in network science, generally, is how to identify a network's mesoscale structure: what are the organizational principles that dominate the intermediate scale between that of individual nodes and the network as a whole \\cite{newman2012communities}? One possible class of mesoscale organization is ``community structure,'' meaning that the network can be decomposed into communities or modules of densely inter-connected sub-networks \\cite{fortunato2010community}. The most popular method for detecting communities is to partition a network's nodes into non-overlapping clusters so as to maximize a modularity quality function of the form \\cite{newman2004finding}: $Q = \\text{observed within-community density} - \\text{expected within-community density}$. The partition that maximizes $Q$ is often accepted as a good estimate of a network's community structure.\n\nMore formally, the typical expression for $Q$ is given as:\n\n\n", "itemtype": "equation", "pos": 21536, "prevtext": "\n\nwhich counts the fraction of times that brain region, $i$, changes its community assignment in successive layers. Flexibility is normalized so that scores near zero and one correspond to brain regions whose community assignments are highly consistent and highly variable, respectively, across layers. Flexibility can also be averaged over all brain regions to obtain the \\textit{global flexibility} of the whole brain, $F = \\frac{1}{N} \\sum_{i = 1}^N f_i$. Both regional and global flexibility scores were calculated separately for each of the 50 modular partitions obtained from the Louvain-like algorithm and averaged across optimizations.\n\n\\subsection*{System assignments}\nIn addition to community assignments, each brain region was also assigned to a brain system. The designation of regions to systems was developed as part of an earlier study \\cite{laumann2015functional}, which defined, in total, 13 systems based on the topographic patterns of functional connections: cingulo-opercular (CO), default mode (DMN), dorsal attention (DAN), fronto-parietal 1 (FP1), fronto-parietal 2 (FP2), medial-parietal (MedPar), parietal-occipital (ParOcc), salience (SAL), somatomotor (SMN), ventral attention (VAN), primary visual (VIS1), and peripheral visual (VIS2). In addition to the previously-defined systems \\cite{laumann2015functional} we also included two other systems: (i) a subcortical (SUB) system comprised of bilateral thalamus, caudate, putamen, pallidum, hippocampus, amygdala, and accumbens, and (ii) a category reserved for brain regions with no clear assignment (NONE) (See Figure~\\ref{figure:brainSystems}). \n\nIn the main text, it was sometimes advantageous to describe measures at the level of brain systems as opposed individual brain regions or the whole brain (e.g. mean and standard deviation flexibility; mean correlation of flexibility with the positivity index). Such system-level measures were obtained by averaging across each system's constituent regions. However, because such measures may be biased by system size (i.e. number of regions assigned to that system), we compared the observed measures against the distribution of similar measurements obtained from a permutation null model, wherein the total number of regions assigned to each system remained constant but where assignments were, otherwise, made at random. Specifically, we calculated the mean, $\\mu_{sys}$, and standard deviation, $\\sigma_{sys}$, system-level measurements based on 10000 iterations of the permutation null model and expressed the observed measure, $y_{sys}$, as a $z$-score:\n\n\n", "index": 7, "text": "\\begin{equation}\nz_{sys} = \\frac{y_{sys} - \\mu_{sys}}{\\sigma_{sys}}\\\\.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"z_{sys}=\\frac{y_{sys}-\\mu_{sys}}{\\sigma_{sys}}\\\\&#10;.\" display=\"block\"><mrow><mrow><msub><mi>z</mi><mrow><mi>s</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>=</mo><mfrac><mrow><msub><mi>y</mi><mrow><mi>s</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>-</mo><msub><mi>μ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mrow><msub><mi>σ</mi><mrow><mi>s</mi><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mi>s</mi></mrow></msub></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nwhere, $C_{ij}$ and $P_{ij}$ are the observed and expected weight of the connection between nodes $i,j$, respectively. Often, the expected weight is given as: $P_{ij} = \\frac{k_i k_j}{2m}$, which corresponds to the null model wherein connections are formed randomly but where node strengths (i.e. $k_i = \\sum_j C_{ij}$) are preserved. The Kronecker delta function is equal to 1 when nodes' community assignments are the same (i.e. $G_i = G_j$) and is 0 otherwise, ensuring that the only $i,j$ contibuting to the summation (and therefore to $Q$) are those assigned to the same community.\n\nRecently, modularity has been generalized so as to be compatible with multi-layer networks \\cite{mucha2010community}. A multi-layer network extends the standard network model of nodes and edges to one in which additional layers can be used to represent different connection classes among nodes (e.g. air, road, rail traffic between cities) or, in our case, observations of the same network at different time points \\cite{kivela2014multilayer}. The expression for modularity's multi-layer analogue retains the general form of the single-layer version:\n\n\n", "itemtype": "equation", "pos": 23763, "prevtext": "\n\nWe corrected for multiple comparisons by controlling the false discovery rate (FDR) using the linear step-up procedure \\cite{benjamini1995controlling}. In each case, we calculated an adjusted critical value, $p_{adj}$, by fixing the maximum FDR at $d=0.001$.\n\n\\subsection*{Acknowledgements} We thank Tyler Moore for helpful discussions and Russell Poldrack for providing additional imaging resources. RFB and DSB acknowledge support from the John D. and Catherine T. MacArthur Foundation, the Alfred P. Sloan Foundation, the Army Research Laboratory and the Army Research Office through contract numbers W911NF-10-2-0022 and W911NF-14-1-0679, the National Institute of Mental Health (2-R01-DC-009209-11), the National Institute of Child Health and Human Development (1R01HD086888-01), the Office of Naval Research, and the National Science Foundation (BCS-1441502 and BCS-1430087). JIG acknowledges support from the National Science Foundation (NSF-1533623. TDS was supported by the National Institute of Mental Health (K23MH098130 and R01MH107703).\n\n\\clearpage\n\\beginsupplement\n\\section*{Supplementary Information}\n\\subsection{Community detection}\n\\subsubsection{Multi-layer modularity maximization}\n\nA central topic in network science, generally, is how to identify a network's mesoscale structure: what are the organizational principles that dominate the intermediate scale between that of individual nodes and the network as a whole \\cite{newman2012communities}? One possible class of mesoscale organization is ``community structure,'' meaning that the network can be decomposed into communities or modules of densely inter-connected sub-networks \\cite{fortunato2010community}. The most popular method for detecting communities is to partition a network's nodes into non-overlapping clusters so as to maximize a modularity quality function of the form \\cite{newman2004finding}: $Q = \\text{observed within-community density} - \\text{expected within-community density}$. The partition that maximizes $Q$ is often accepted as a good estimate of a network's community structure.\n\nMore formally, the typical expression for $Q$ is given as:\n\n\n", "index": 9, "text": "\\begin{equation}\nQ = \\frac{1}{2m} \\sum_{ij}^N [C_{ij} - P_{ij}] \\delta (G_i,G_j)\\\\.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"Q=\\frac{1}{2m}\\sum_{ij}^{N}[C_{ij}-P_{ij}]\\delta(G_{i},G_{j})\\\\&#10;.\" display=\"block\"><mrow><mrow><mi>Q</mi><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>m</mi></mrow></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow><mi>N</mi></munderover><mrow><mrow><mo stretchy=\"false\">[</mo><mrow><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>-</mo><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mi>δ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mi>i</mi></msub><mo>,</mo><msub><mi>G</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nis maximized. In this expression, $C_{ijs}$ is the coherence of regions $i$ and $j$ in layer $s$. The tensor $P_{ijs}$ is the expected coherence in an appropriate null model. Specifically, we choose $P_{ijs} = \\frac{k_{is} k_{js}}{2m_s}$, which is a multi-layer extension of the common configuration model. The parameter, $\\gamma$, scales the relative contribution of the expected connectivity and effectively controls the number of modules detected within a given layer. The other free parameter, $\\omega$, determines the similarity of modules across layers, and is therefore sometimes referred to as the \\emph{temporal resolution parameter} \\cite{bassett2013robust}. In the main text, we fix these parameters to the commonly-used default values of $\\gamma = \\omega = 1$ \\cite{bassett2013robust}. In the supplement we demonstrate the robustness of our results to variation in the resolution parameters (Figure \\ref{figure:paramSweep}).\n\nWe use a Louvain-like locally greedy algorithm to maximize the multi-layer modularity, $Q(\\gamma, \\omega)$ \\cite{jutla2011generalized} (typical output is show in Figure~\\ref{figure:exampleLouvainOutput}). Due to near-degeneracies in the modularity landscape \\cite{good2010performance} and stochastic elements in the optimization algorithm \\cite{blondel2008fast}, the output typically varies from one run to another. For this reason, rather than focus on any single run, we characterized the statistical properties of 50 runs of the algorithm, which correspond to 50 optimizations of the multi-layer modularity.\n\n\\subsection*{Regional and global flexibility}\nThe output of the Louvain-like locally greedy algorithm was a partition, $\\mathbf{G} \\in \\mathbb{R}^{N \\times T}$, whose element $G_{i,r} \\in \\{1 \\ldots c \\}$ is the community to which brain region $i$ in layer $r$ was assigned in that optimization. The multi-layer modularity maximization simultaneously assigns brain regions in all layers to communities so that community labels are consistent across layers, thus circumventing the commonly studied community matching problem. Given $\\mathbf{G}$, we can calculate each brain region's flexibility score:\n\n\n", "itemtype": "equation", "pos": 16477, "prevtext": "\n\nwhere $\\mathbf{U} \\in \\mathbb{R}^{n \\times n}$ and $\\mathbf{V} \\in \\mathbb{R}^{p \\times n}$ contain the left and right singular vectors and where $\\mathbf{S} \\in \\mathbb{R}^{p \\times p}$ is the diagonal matrix of singular values. Importantly, $\\mathbf{U}$ and $\\mathbf{V}$ have rank equal to that of $\\mathbf{X}$. The $i$th principal component, then, is the $i$th column of $\\mathbf{U}$. The corresponding column of $\\mathbf{V}$ gives weights that indicate the extent to which each PANAS-X category contributed to that component. Similarly, squaring the corresponding singular element of $\\mathbf{S}$ gives the magnitude of variance accounted for by that component. In the \\textbf{Supplemental Information} we examine, in detail, the robustness of this analysis to the exclusion of individual data points (Figure~\\ref{figure:leaveOneOut}), random permutations of the flexibility estimates (Figure~\\ref{figure:randomMood}), eschewing PCA in favor of individual PANAS-X categories (Figure~\\ref{figure:individualPANASXCategories}), other principal components besides the first (Figure~\\ref{figure:PC4}), the use previously-defined emotional affect classes rather than a principal component to identify indices of positivity (Figure~\\ref{figure:panasClasses}--\\ref{figure:fatigue}), and the use of exploratory factor analysis instead of PCA (Figure~\\ref{figure:figEFA}). We also test the robustness of our results after controlling for other psychophysiological and nuisance variables (Figure~\\ref{figure:headMotion},\\ref{figure:nuisance}).\n\n\\subsection*{Dynamic network construction and community detection}\nWe sought a division of brain regions into communities, which are thought to reflect the brain's functional sub-systems \\cite{sporns2016modular}. We divided the parcel time series into $T=14$ windows of 37 time points (TRs) each ($\\approx$1.36 minutes in length). For each window, we calculated the wavelet coherence matrix, $\\mathbf{C} \\in \\mathbb{R}^{N\\times N}$. Each element, $C_{ij}$, represented the magnitude squared coherence of the scale two (0.0625--0.125 Hz) Daubechies wavelet (length 4) decomposition of the windowed time series obtained from regions $i$ and $j$ (\\url{http://www.atmos.washington.edu/~wmtsa/}). This particular frequency band was selected based on previous work \\cite{bassett2011dynamic, braun2015dynamic}. Each dynamic network was treated as a layer in a multi-layer network, $\\mathcal{C} = \\{ \\mathbf{C}_1 \\ldots \\mathbf{C}_{14} \\}$. To detect the temporal evolution of modules, we maximized the multi-layer modularity \\cite{mucha2010community}, which seeks the assignment all brain regions in all layers to modules such that:\n\n\n", "index": 3, "text": "\\begin{equation}\n\\begin{split}\nQ(\\gamma, \\omega) & = \\frac{1}{2 \\mu} \\sum_{ijsr} [(C_{ijs} - \\gamma P_{ijs})]\\delta (G_{is},G_{js}) \\\\\n& + \\delta (i,j) \\cdot \\omega ]\\delta (G_{is}, G_{jr})\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\split Q(\\gamma,\\omega)&amp;=\\frac{1}{2\\mu}\\sum_{ijsr}[(C_{ijs}-\\gamma P_{ijs})]%&#10;\\delta(G_{is},G_{js})\\\\&#10;&amp;+\\delta(i,j)\\cdot\\omega]\\delta(G_{is},G_{jr})\" display=\"block\"><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>{split}</mtext></merror><mi>Q</mi><mrow><mo stretchy=\"false\">(</mo><mi>γ</mi><mo>,</mo><mi>ω</mi><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">&amp;</mi><mo>=</mo><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>μ</mi></mrow></mfrac><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mi>r</mi></mrow></munder><mrow><mo stretchy=\"false\">[</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>C</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>-</mo><mi>γ</mi><msub><mi>P</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">]</mo></mrow><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>,</mo><msub><mi>G</mi><mrow><mi>j</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow><mi mathvariant=\"normal\">&amp;</mi><mo>+</mo><mi>δ</mi><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>j</mi><mo stretchy=\"false\">)</mo></mrow><mo>⋅</mo><mi>ω</mi><mo stretchy=\"false\">]</mo><mi>δ</mi><mo stretchy=\"false\">(</mo><msub><mi>G</mi><mrow><mi>i</mi><mo>⁢</mo><mi>s</mi></mrow></msub><mo>,</mo><msub><mi>G</mi><mrow><mi>j</mi><mo>⁢</mo><mi>r</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nHere, $\\mathbf{c}_i$ is the $i^{th}$ principal component. Further, $\\mathbf{x}_j \\in \\mathbb{R}^n$, is the $j^{th}$ column of $\\mathbf{X}$ and represents the full set of observations of the $j$th variable, standardized to have zero mean and unit variance. The weights, $w_{ji}$, give the degree to which variable $j$ contributes to component $j$. The weights are selected so that each successive component accounts for the maximum amount of variance possible. As noted in the Online Methods, all of the components, the associated weights (loadings), and the percent variance accounted for by each component can be directly calculated via a singular value decomposition (SVD) of $\\mathbf{X}$. Moreover, because each successive component is chosen so as to account for the maximum amount of variance, there exists a single optimal solution.\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{EFAAnalysis}}\n\\caption{\\textbf{Summary of exploratory factor analysis (EFA) with $m = 1$.} \\emph{(A)} Correlation of PCA loadings onto $PI$ and loadings of PANAS-X onto the first factor. \\emph{(B)} Correlation of factor scores with global flexibility.}\\label{figure:figEFA}\n\\end{center}\n\\end{figure}\n\n\n\\subsubsection{EFA model}\nEFA, on the other hand, is based on the common factor model \\cite{thurstone1947multiple} and assumes that each observed variable is a linear combination of unobserved ``common factors'':\n\n\n", "itemtype": "equation", "pos": 44943, "prevtext": "\n\nHere, $C_{ijs}$ is the weight of the connection between nodes $i,j$ in layer $s$ and $P_{ijs}$ is the corresponding expected weight in an appropriate null model. The variable, $G_{is}$, encodes the community assignments of node $i$ in layer $s$. Typical output of the algorithm is shown in Figure \\ref{figure:exampleLouvainOutput}B,D.\n\nModularity, both single- and multi-layer, can be maximized using a number of algorithms \\cite{fortunato2010community}. Perhaps the most popular is the so-called ``Louvain algorithm'' \\cite{blondel2008fast}. Due to the stochastic nature of the algorithm, the computational complexity of modularity maximization, and the fact that the modularity landscape usually features many near-optimal solutions \\cite{good2010performance}, it is considered best practice not to focus on the output of any single run, but to run the algorithm many times and characterize the statistical properties of an ensemble of near-optimal solutions \\cite{bassett2013robust}.\n\n\n\\begin{figure}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{exampleDynamicCommunitiesAssociationMatrices}}\n\\caption{\\textbf{Example ``low'' and ``high'' flexibility sessions.} \\emph{(A,B)} Association matrix for low \\emph{versus} high flexibility session. \\emph{(C,D)} Dynamic community matrix and regional flexibility series.}\\label{figure:exampleLouvainOutput}\n\\end{center}\n\\end{figure}\n\n\n\\subsubsection{Robustness to choice of resolution parameters}\nThe expression for multi-layer modularity further generalizes modularity by introducing two resolution parameters, $\\gamma$ and $\\omega$. Along with the actual structure of the network itself, these parameters determine the composition of detected communities. Specifically, $\\gamma$ scales the importance of the expected weight (the term $P_{ijs}$), effectively determining community number and size. The parameter $\\omega$, on the other hand, controls the strength of inter-layer coupling between nodes; larger or smaller values of $\\omega$ lead to more- or less-consistent communities across layers.\n\nDespite the importance of these parameters, many applications of multi-layer modularity leave them fixed at their \\textit{de facto} default values, $\\gamma = \\omega = 1$ \\cite{bassett2013robust}. Though a complete exploration of both parameters is beyond the scope of most studies, it is considered good practice to demonstrate that one's results are robust to reasonable variations in the parameters' values \\cite{bassett2011dynamic,bassett2013robust,braun2015dynamic}. Accordingly, we sought to replicate the principal results from the main text, i.e. the correlation of flexibility with positivity, across variations in the two resolution parameters. To this end, we varied both $\\gamma$ and $\\omega$ over the range [0.95, 0.975, 1.00, 1.025, 1.05] and maximized multi-layer modularity for all pairs of parameter values. This procedure generated 25 estimates of $\\hat{r}(PI,F)$ (24 \\textit{new} estimates, including a repeat of the case where $\\gamma = \\omega = 1$, which was already investigated in the main text). In general, these results support the hypothesis that $\\hat{r}(PI,F)>0$ (minimum correlation of $\\hat{r}(PI,F) = 0.19$ and maximum correlation of $\\hat{r}(PI,F) = 0.31$) (Figure \\ref{figure:paramSweep}A). We also took this opportunity to cross-validate the flexibility estimates we obtained in the main text by comparing those estimates to the new set of flexibility estimates obtained with $\\gamma = \\omega = 1$. We found remarkable consistency, with $\\hat{r} = 0.988$ and $p < 10^{-15}$ (Figure \\ref{figure:paramSweep}B). For completeness, we show scatterplots of flexibility against the positivity index for all $\\gamma, \\omega$ pairs (Figures \\ref{figure:paramSweep}C-G).\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{ParameterSweep}}\n\\caption{\\textbf{Robustness to choice of resolution parameters.} \\emph{(A)} Pearson correlation coefficients for 25 different $\\gamma,\\omega$ values in the neighborhood of $\\gamma = 1, \\omega = 1$. \\emph{(B)} Scatterplot of global flexibility scores obtained from Louvain runs 1-50 and 51-100. \\emph{(C-G)} Scatterplots of positivity index, $PI$, against global flexibility for each of the 25 parameter combinations. Each panel fixes $\\gamma$ at a particular value (either 0.950, 0.975, 1.000, 1.025, 1.050) and varies $\\omega$ over the same range.}\\label{figure:paramSweep}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{Robustness of positivity index with global flexibility correlation}\n\nIn the main text, we presented data suggesting that an index of positivity, $PI$, was positively correlated with global flexibility, $F$, i.e. $\\hat{r}(PI,F) > 0$. This main result indicates that more flexible brains, i.e. greater dynamic reconfiguration, are associated with positive emotions. However, it is important to acknowledge that the Pearson's correlation coefficient, which we used to characterize the relationship between these variables, can be sensitive to outlying data points, which can bias the overall magnitude of the observed correlation coefficient. To quantify the robustness of our reported estimates, we assessed the robustness of the observed correlation coefficient value using a ``leave one out'' analysis. In brief, this analysis consists of performing the principal component analysis (PCA) using, instead of the full set of PANAS-X variables, a limited set, thereby yielding new estimates of the positivity index, which we call $PI'$. Then, we calculate the correlation between the positivity index and flexibility $\\hat{r}(PI',F)$ and determine whether the results of this analysis are in line with those presented in the main text.\n\n\n\\begin{figure}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{leaveOneOut}}\n\\caption{\\textbf{Summary of robustness testing procedure.} \\emph{(A)} Distribution of correlation coefficients, $\\hat{r}(PI',F)$, where $PI'$ is a positivity index estimated after omitting PANAS-X categories from the PCA analysis. \\emph{(B)} Distribution of correlation coefficients, $\\hat{r}(PI',F)$, where $PI'$ is a positivity index estimated after omitting all data acquired from each recording session from the PCA analysis.}\\label{figure:leaveOneOut}\n\\end{center}\n\\end{figure}\n\n\nWe generate limited sets of observations two different ways, each corresponding to a distinct null hypothesis. First, to test the hypothesis that the correlation between the positivity index and flexibility $\\hat{r}(PI,F)$ is biased by individual PANAS-X categories, we systematically omit each of the $p=57$ categories from the data set, performing the PCA using all $n=73$ observations but only $p-1=56$ categories. Second, to test the hypothesis that $\\hat{r}(PI,F)$ is biased by individual recording sessions, we systemically omit each of the $n = 73$ recording sessions, which includes all the PANAS-X categories as well as the global flexibility score. For this second test, we perform PCA on $n - 1=72$ observations of $p$ categories, and calculate $\\hat{r}(PI',F)$ based on the same $n-1=72$ observations.\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{randomMood}}\n\\caption{\\textbf{Summary of randomly permuted recording sessions.} \\emph{(A)} Distribution of correlation coefficients of $PI$ with $F$ after randomly permuting the order of the recording sessions. The red line indicates the observed correlation coefficient. \\emph{(B)} Topographic representation of z-score correlation of regional flexibility with $PI$ obtained after randomly permuting the order recording sessions. The top panel shows the complete set of z-scored coefficients; the bottom panel shows only those regions whose z-score exceed $\\pm2$. \\emph{(C)} Standardized z-score correlation of regional flexibility with $PI$ aggregated by system.}\\label{figure:randomMood}\n\\end{center}\n\\end{figure}\n\n\nIn both cases, we found ample support for the hypothesis that $\\hat{r}(PI,F) > 0$. Moreover, for every $PI'$ we generated, the correlation magnitude always satisfied $0.26 \\ge \\hat{r}(PI',F) \\ge 0.39$ (Figure \\ref{figure:leaveOneOut}A,B). While not conclusive, these analyses provided additional evidence that emotional state is positively correlated with global flexibility and not obviously biased by any single observation.\n\nIn addition to these ``leave one out'' analysis, we also tested the null hypothesis that the magnitude of the observed correlation $\\hat{r}(PI,F)$ occurred by chance. To this end, we randomly permuted the order of the vector containing the global flexibility scores and calculated the correlation of the re-ordered flexibility with $PI$. We repeated this 10000 times, generating a null distribution of correlation coefficients, against which we compared the observed correlation. We performed this comparison both parametrically and non-parametrically. The parametric test involved estimating the mean, $\\hat{r}_{\\mu}(PI,F)$, and standard deviation, $\\hat{r}_{\\sigma}(PI,F)$, of the null distribution and standardizing the observed correlation against these estimates: $\\hat{r}_z(PI,F) = \\frac{\\hat{r}(PI,F) - \\hat{r}_{\\mu}(PI,F)}{\\hat{r}_{\\sigma}(PI,F)}$. This non-parametric test involved, simply, estimating what fraction of null distribution was greater than the observed correlation coefficient. The parametric and non-parametric tests yielded p-values of $p=0.0087$ and $p=0.0111$, respectively. These results suggest that the observed correlation, $\\hat{r}(PI,F)$, was not likely to have been produced by chance (Figure \\ref{figure:randomMood}A).\n\nWe performed an analogous analysis of the regional flexibility scores, which generated region-level flexibility z-scores (Figure \\ref{figure:randomMood}B). As in the main text, we aggregated these scores by brain system and, once again, compared the average z-score for each system against a permutation-based chance model. The system with the single greatest z-score was the somatsensory system ($z_{SMN} = 8.369$, $p < 10^{-15}$), which agrees with the results presented in the main text (Figure \\ref{figure:randomMood}C).\n\n\\subsection{Correlation of PANAS-X categories with global flexibility}\n\n\n\\begin{figure}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{individualPANASXCategories}}\n\\caption{\\textbf{Relationship between flexibility and individual PANAS-X scores.} \\emph{(A)} Relationship of individual PANAS-X categories to PANAS-X loadings onto $PI$. \\emph{(B)} Top six PANAS-X categories, in terms of loading onto $PI$, and their relationships with global flexibility, $F$. \\emph{(C)} Bottom six PANAS-X categories, in terms of loading onto $PI$, and their relationships with global flexibility, $F$.}\\label{figure:individualPANASXCategories}\n\\end{center}\n\\end{figure}\n\n\nThe results presented in the main text showed a positive correlation of global flexibility with a ``positivity index'' ($PI$). The positivity index itself was based on a PCA of PANAS-X categories. Though the loadings of those categories onto $PI$ gives some sense of how individual emotional categories contribute to $PI$, we nonetheless felt that it would be illuminating to present the reader with plots showing the relationship of PANAS-X categories with flexibility. Indeed, the correlation magnitude of PANAS-X categories with $PI$ was highly correlated with the loadings of each category (Figure \\ref{figure:individualPANASXCategories}A). Figures \\ref{figure:individualPANASXCategories}B,C show, in detail, the PANAS-X categories with the strongest positive loadings onto $PI$ (shown in red in Figure \\ref{figure:individualPANASXCategories}B) and those with the strongest negative loadings onto $PI$ (shown in blue Figure \\ref{figure:individualPANASXCategories}C).\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{PC4}}\n\\caption{\\textbf{Analysis of other principal components.} \\emph{(A)} Correlation magnitude for the first ten principal components. \\emph{(B)} Scatterplot of global flexibility against the fourth component, $PC4$. \\emph{(C)} Correlation of regional flexibility scores with $PC4$ and averaged by brain system. The $y$-axis is expressed as $z$-scores relative to a permutation null model. \\emph{(D)} Topographic representation of the correlation magnitude of regional flexibility with $PC4$. \\emph{(E)} Loadings of PANAS-X scores onto $PC4$.}\\label{figure:PC4}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{Other principal components}\nWe termed the first principal component the ``positivity index'' ($PI$), which accounted for an overwhelmingly large percentage of variance ($\\approx 33\\%$) among the PANAS-X scores. Despite the other principal components accounting for much less total variance, we sought to investigate whether any were predictive of global flexibility, $F$. To this end, we calculated the correlation between flexibility and the first ten principal components ($PC2, \\ldots, PC10$), excluding $PC1$, which we already analyzed as $PI$. These remaining components accounted for, at most $\\approx 11\\%$ and no less than $\\approx 2\\%$, of the remaining variance. The fourth component, $PC4$,  accounted for $\\approx 6\\%$ variance, and was correlated with, $F$ ($\\hat{r}(PC4,F) = 0.407$, $p = 3.49 \\times 10^{-4}$) (Figure \\ref{figure:PC4}A,B). The remaining components were not obviously correlated with global flexibility (mean correlation magnitude of $3.53\\times10^{-4}$, after excluding $PC4$). Unlike $PI$, which placed PANAS-X categories along a continuum of ``positive'' and ``negative'' emotions, $PC4$ paints a less clear picture, intermingling PANAS-X terms of seemingly dissimilar emotional affect (e.g. ``proud'' and ``disgusted with self'' have similar loadings). Nonetheless, we can speculate that $PC4$ tracks the subject's state of arousal or surprise based on the observation that the PANAS-X categories with the greatest magnitude loadings were ``surprised'', ``amazed'', and ``astonished'' (Figure \\ref{figure:PC4}E). Finally, we calculated the correlation coefficients of regional flexibility scores with $PC4$ and aggregated them by brain systems. The most obvious association was the positive correlation of regional flexibility and $PC4$ for regions within somatomotor cortex (permutation test; $z_{SMN} = 8.81$, $p < 10^{-15}$) (Figure \\ref{figure:PC4}C,D). Collectively, these results suggest that increased levels of surprise correspond to decreases in global flexibility. Furthermore, this relationship appears to have its neuroanatomical underpinnings in somatomotor cortex.\n\n\n\\begin{figure}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{PANASClasses}}\n\\caption{\\textbf{Correlations of flexibility with PANAS-X affect classes.} \\emph{(A-L)} Scatterplot of PANAS-X composite affect scores with global flexibility.}\\label{figure:panasClasses}\n\\end{center}\n\\end{figure}\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{PANASClassesVsPI}}\n\\caption{\\textbf{Correlations of positivity index with PANAS-X affect classes.} \\emph{(A-L)} Scatterplot of PANAS-X composite affect scores with positivity index.}\\label{figure:PANASClassesVsPI}\n\\end{center}\n\\end{figure}\n\n\n\n\\begin{figure}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{fatigue}}\n\\caption{\\textbf{Correlations of regional flexibility with ``fatigue''.} \\emph{(A)} System-level correlations. \\emph{(B)} Topographic distribution showing the correlation magnitude of ``fatigue'' with regional flexibility.}\\label{figure:fatigue}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{PANAS-X affect scores}\nThe PANAS-X features (in the form used here) $p=57$ categories. In the main text we used a PCA to distill these categories into a single composite ``positivity index''. Nonetheless, there exist alternative methods for grouping the categories into other affective classes. One commonly used set of sub-divisions \\cite{watson1999panas} groups categories into hierarchical affect classes: ``negative affect'', ``positive affect'', ``fear'', ``hostility'', ``guilt'', ``sadness'', ``joviality'', ``self-assurance'', ``attentiveness'', ``fatigue'', ``serenity'', and ``surprise'' (Table \\ref{table:panasxCategories}). Often ``shyness'' is also included, though the categories comprising this class were omitted from the PANAS-X used in the current study. A composite score can be estimate for each affect class by summing the responses of the PANAS-X categories. We tested whether global flexibility was correlated with any of these affect classes. Indeed, a number of these classes exhibited significant correlations with flexibility. At a statistical threshold of $p < 0.05$ (uncorrected), we observed that ``positive affect'' ($\\hat{r} = 0.278, p = 0.017$), ``guilt'' ($\\hat{r} = -0.268, p = 0.022$), ``joviality'' ($\\hat{r} = 0.255, p = 0.029$), ``attentiveness'' ($\\hat{r} = 0.324, p = 0.051$), ``surprise'' ($\\hat{r} = -0.260, p = 0.026$), and ``fatigue'' ($\\hat{r} = -0.455, p = 0.001$) were all correlated with flexibility (Figure \\ref{figure:panasClasses}). In general, these results agree with those obtained from our PCA analysis: ``positive affect'', ``joviality'', and ``attentiveness'' (which capture positive emotions, broadly) are all positively correlated with flexibility and also strongly correlated with the PCA-derived positivity index ($\\hat{r} = 0.896, 0.908, 0.735$, respectively; all $p < 10^{-15}$). Less positive terms like ``guilt'', ``fatigue'', and ``surprise'', on the other hand, were all negatively correlated with flexibility and either negatively correlated or uncorrelated with the positivity index ($\\hat{r} = -0.681, -0.479, 0.010$, $p = 3.341 \\times 10^{-11}, 1.820 \\times 10^{-5}, 0.935$, respectively) (Figure \\ref{figure:PANASClassesVsPI}). Interestingly, the PANAS-X categories that comprise the ``surprise'' class were identical to those with the strongest loadings onto the fourth principal component, $PC4$. \n\nThe affect class ``fatigue'' exhibited the greatest magnitude correlation with global flexibility. Accordingly, we investigated its correlation with regional flexibility scores to determine its topographic distribution and its mapping onto brain systems. Like the positivity index, $PI$, and other principal components, e.g. $PC4$, ``fatigue'' was strongly anti-correlated with the regional flexibility of somatomotor cortex ($z_{SMN} = -10.110, p_{SMN} < 10^{-15}$) (Figure \\ref{figure:fatigue}A,B). Also as before, a number of other systems are also implicated, including cingulo-opercular (CO), fronto-parietal (FP1), and peripheral visual (VIS2) ($z_{CO} = 4.469$, $z_{FP1} = 4.481$, $z_{VIS2} = 3.002$; all $p < 0.001$), which were more positively correlated with fatigue than expected by chance.\n\n\\subsection{PCA versus factor analysis}\nPCA and exploratory factor analysis (EFA) both attempt to identify low-rank approximations of the covariance structure among a set of observed variables. Both techniques have been applied widely in the psychological sciences, where they have been instrumental in the development of clinical and behavioral indices and the subsequent identification of items that load onto these scales \\cite{comrey1988factor, galbraith2002analysis}. The rationale for using either technique in place of the other is part of an ongoing debate \\cite{fabrigar1999evaluating}. In this subsection, we demonstrate that under some reasonable assumptions, EFA yields similar results to those presented in the main text for PCA.\n\n\\subsubsection{PCA model}\nEssentially, PCA assumes that a matrix of observations, $\\mathbf{X} \\in \\mathbb{R}^{n \\times p}$, can be decomposed into principal components, where each component has the form:\n\n\n", "index": 13, "text": "\\begin{equation}\n\\mathbf{c}_i = w_{1i} \\mathbf{x}_1 + w_{2i} \\mathbf{x}_2 \\ldots w_{pi} \\mathbf{x}_p\\\\.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{c}_{i}=w_{1i}\\mathbf{x}_{1}+w_{2i}\\mathbf{x}_{2}\\ldots w_{pi}\\mathbf{x%&#10;}_{p}\\\\&#10;.\" display=\"block\"><mrow><mrow><msub><mi>𝐜</mi><mi>i</mi></msub><mo>=</mo><mrow><mrow><msub><mi>w</mi><mrow><mn>1</mn><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>𝐱</mi><mn>1</mn></msub></mrow><mo>+</mo><mrow><msub><mi>w</mi><mrow><mn>2</mn><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>𝐱</mi><mn>2</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">…</mi><mo>⁢</mo><msub><mi>w</mi><mrow><mi>p</mi><mo>⁢</mo><mi>i</mi></mrow></msub><mo>⁢</mo><msub><mi>𝐱</mi><mi>p</mi></msub></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07881.tex", "nexttext": "\n\nAs before, $\\mathbf{x}_j$, is the $j^{th}$ observed variable. The variables $\\eta_{i}$ represents the unobserved common factors. The weights, $\\lambda_{ji}$ give the contribution of factor $i$ to observed variable $j$. Finally, $\\varepsilon_j$ is the unique variance associated with variable $j$ (i.e. the variance unaccounted for by the factors). EFA requires the user to specify the number of common factors, $m$. In general, varying $m$ returns different estimates of each factor (i.e. $\\eta_1$ with $m=1$ will not be the same as $\\eta_1$ if $m>1$).\n\nUnlike PCA, which uses linear algebra to directly calculate components from observed data, EFA estimates both the unique variances \\textit{and} the weights (the $\\varepsilon$s and $\\lambda$s, respectively) in order to model the observed variables. Because EFA amounts to model-fitting, it benefits greatly if there are many times more observations than there are variables; when the ratio of observations to variables is too low, the fitting procedure can lead to unstable parameter estimates \\cite{unkel2010simultaneous}.\n\n\\subsubsection{EFA model applied to PANAS-X data}\nBecause the PANAS-X scores have approximately the same number of observations as categories (the actual ratio is $73/57 \\approx 1.28$) and because PCA and EFA frequently give comparable results under many practical circumstances, we opted to use PCA in the main text to define an index of positivity. Here, however, we demonstrate that we can derive a similar index using EFA. Specifically, we submit the data matrix of observed PANAS-X scores, $\\mathbf{X}$, to an EFA with $m=1$ (i.e. we seek to obtain a single common factor). The result is a set of loadings that are highly consistent with the loadings of PANAS-X scores onto the positivity index (Pearson's correlation, $\\hat{r} = 1.00$, $p < 10^{-15}$). Indeed, the top five loadings were ``happy'', ``enthusiastic'', ``confident'', ``cheerful'', and ``delighted.'' The bottom loadings were ``upset'', ``sad'', ``irritable'', ``blue'', and ``downhearted.'' Similarly, when we calculated the correlation of the factor scores with global flexibility, we observed a pattern in line with that described in the main text, where increases in factor scores correspond to increases in global flexibility (Pearson's correlation coefficient, $\\hat{r} = 0.264$, $p = 0.024$) (Figure \\ref{figure:figEFA}).\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{flexibilityAndHeadMotion}}\n\\caption{\\textbf{Non-significant impact of subject head motion} \\emph{(A)} Scatterplot of frame-wise displacement with global flexibility, $F$. \\emph{(B)} Scatterplot of global flexibility, $F$, against $PI$ after frame-wise displacement was regressed out.}\\label{figure:headMotion}\n\\end{center}\n\\end{figure}\n\n\n\\subsection{Nuisance variables}\nTo this point, we have demonstrated the robustness of the correlation between positivity index, $PI$, and global flexibility, $F$. Another concern is that this relationship is mediated by a third, unmeasured variable. In other words, by virtue of both $PI$ and $F$ being correlated with unknown variable, $x$, we observe a correlation between $PI$ and $F$. To determine whether this was the case, we investigated the relationship of $F$ with head motion and other psychophysiological variables collected as part of the \\emph{MyConnectome Project}.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{nuisanceVariables}}\n\\caption{\\textbf{Correlation of $PI$ and $F$ after regressing out nuisance variables.} \\emph{(A)} Pearson's correlation magnitude of the positivity index, $PI$, with the residuals of $F$ after regressing out each nuisance variable. \\emph{(B)} Number of recording sessions over which each nuisance variable was measured.}\\label{figure:nuisance}\n\\end{center}\n\\end{figure}\n\n\n\\subsubsection{Relationship of global flexibility and head motion}\nRecent work has demonstrated that subject head motion within the scanner can introduce systematic biases in functional connectivity patterns \\cite{power2012spurious}. It is therefore possible that global flexibility, rather than tracking the reconfiguration of communities over time, is driven by head motion. To test whether this was the case, we asked whether global flexibility was correlated with average frame-wise displacement, which represents an estimate of the amplitude with which a subject's head moves relative to a reference frame. Our analysis revealed no correlation between this motion variable and global flexibility ($\\hat{r}(\\text{motion},F) = 0.013$, $p=0.912$) (Figure \\ref{figure:headMotion}A). In addition, we regressed out frame-wise displacement from the global flexibility estimates and recalculated the correlation of the residuals with the positivity index. This additional step did not influence the magnitude of correlation (which we observed to be $\\hat{r}(PI,F) = 0.284$, $p=0.015$) (Figure \\ref{figure:headMotion}B).\n\n\n\n\\subsubsection{Other psychophysiological measurements}\nIn addition to PANAS-X categories, the \\emph{MyConnectome Project} made a number of other psychophysiological measures. For example, on certain recording sessions, blood was drawn and measures such as platelet and red blood cell counts made. Other measures include subjective rates of sleep quality, whether the subject drank alcohol the previous evening, and whether there were precipitation on the day of the scan (See Table\\ref{table:nuisance} for a complete list). An important concern is whether these variables account for the correlation between $F$ and $PI$, $\\hat{r}(PI,F)$. As with the motion control subsection, we regressed each variable from $F$, and calculated the correlation of the residuals with $PI$. Many of the psychophysiological measurements were not performed in every scan session. For such cases, we performed the regression analysis on the subset of sessions for which those variables were measured. In general, even after controlling for other psychophysiological variables, we still observed a positive correlation between $PI$ and $F$ (Figure \\ref{figure:nuisance}A). For most variables, regressing them out from flexibility yielded little change in $\\hat{r}(PI,F)$. There are two notable cases, however, that deviate from this trend. First, after controlling for variables based on bloodwork (in \\ref{figure:nuisance} they are preceded with the label ``blood:'') we observed a large increase in the magnitude of $\\hat{r}(PI,F)$. However, bloodwork was performed on only 16 of the 73 analyzed recording sessions; such a small sample does not permit us to make strong quantitative statements. The second notable case concerned the variable ``how much did tinnitus bother you today?''. Controlling for this variable decreased $\\hat{r}(PI,F)$ to $\\approx0.1$. Like the bloodwork, this variable was measured during a small fraction of the recording sessions (22 of 73). Again, with such a small sample size we are not in a position to make strong quantitative statements about the relationship of the subject's tinnitus with flexibility. Limiting ourselves to variables that were measured during at least 50\\% of the analyzed recording sessions, we found that the median correlation after regressing out each nuisance variable from $F$ was comparable to the correlation magnitude reported in the main text ($\\hat{r}(PI,F)_{median} = 0.276$; $\\hat{r}(PI,F)_{min} = 0.208$; $\\hat{r}(PI,F)_{max} = 0.418$). While not conclusive, these results suggest that the psychophysiological measurements collected in addition to the PANAS-X scores did not, on their own, account for the strength of the correlation of flexibility and the positivity index.\n\n\n\\begin{figure*}[b]\n\\begin{center}\n\\centerline{\\includegraphics[width=1\\textwidth]{allSystems}}\n\\caption{\\textbf{Brain systems.} Topographic distribution of the 12 cortical brain systems.}\\label{figure:brainSystems}\n\\end{center}\n\\end{figure*}\n\n\n\\clearpage\n\n\\begin{table*}[h]\n\\begin{center}\n\\begin{tabular}{|p{12cm}|}\n\\hline\nactive, afraid, alert, alone, amazed, angry, angry-at-self, ashamed, astonished, at-ease, attentive, bashful, blameworthy, blue, bold, calm, cheerful, concentrating, confident, daring, delighted, determined, disgusted, disgusted-with-self, dissatisfied-with-self, distressed, downhearted, drowsy, energetic, enthusiastic, excited, fearless, frightened, guilty, happy, hostile, inspired, interested, irritable, jittery, joyful, lively, loathing, lonely, nervous, proud, relaxed, sad, scared, scornful, shaky, sheepish, shy, sleepy, sluggish, strong, surprised, timid, tired, upset\\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\caption{\\textbf{PANAS-X categories.} Complete list of PANAS-X categories.}\n\\label{table:panasxTerms}\n\\end{table*}\n\n\n\\begin{table*}[h]\n\\begin{center}\n\\begin{tabular}{|l|l|l|}\n\\hline\n\\textbf{PANAS-X Class}& \\multicolumn{2}{p{12cm}|}{\\raggedright \\textbf{PANAS-X Category}} \\\\ \\hline \\hline\n\\textbf{negative affect}& \\multicolumn{2}{p{12cm}|}{\\raggedright {afraid, scared, nervous, jittery, irritable, hostile, guilty, ashamed, upset, distressed}} \\\\ \\hline\n\\textbf{positive affect}& \\multicolumn{2}{p{12cm}|}{\\raggedright {active, alert, attentive, determined, enthusiastic, excited, inspired, interested, proud, strong}} \\\\ \\hline\n\\textbf{fear}& \\multicolumn{2}{p{12cm}|}{\\raggedright {afraid, scared, frightened, nervous, jittery, shaky}} \\\\ \\hline\n\\textbf{hostility}& \\multicolumn{2}{p{12cm}|}{\\raggedright {angry, hostile, irritable, scornful, disgusted, loathing}} \\\\ \\hline\n\\textbf{guilt}& \\multicolumn{2}{p{12cm}|}{\\raggedright {guilty, ashamed, blameworthy, angry at self, disgusted with self, dissatisfied with self}} \\\\ \\hline\n\\textbf{sadness}& \\multicolumn{2}{p{12cm}|}{\\raggedright {sad, blue, downhearted, alone, lonely}} \\\\ \\hline\n\\textbf{joviality}& \\multicolumn{2}{p{12cm}|}{\\raggedright {happy, joyful, delighted, cheerful, excited, enthusiastic, lively, energetic}} \\\\ \\hline\n\\textbf{self-assurance}& \\multicolumn{2}{p{12cm}|}{\\raggedright {proud, strong, confident, bold, daring, fearless}} \\\\ \\hline\n\\textbf{attentiveness}& \\multicolumn{2}{p{12cm}|}{\\raggedright {alert, attentive, concentrating, determined}} \\\\ \\hline\n\\textbf{fatigue}& \\multicolumn{2}{p{12cm}|}{\\raggedright {sleepy, tired, sluggish, drowsy}} \\\\ \\hline\n\\textbf{serenity}& \\multicolumn{2}{p{12cm}|}{\\raggedright {calm, relaxed, at ease}} \\\\ \\hline\n\\textbf{surprise}& \\multicolumn{2}{p{12cm}|}{\\raggedright {amazed, surprised, astonished}} \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\caption{\\textbf{PANAS-X class assignments.} The first column displays the name of each affect class and the second column displays the PANAS-X scores assigned to that class.}\n\\label{table:panasxCategories}\n\\end{table*}\n\n\n\\begin{table*}[h]\n{\\renewcommand\\arraystretch{1.25}\n\\begin{tabular}{|l|l|l|} \\hline\n\\textbf{Variable class}& \\multicolumn{2}{p{12cm}|}{\\raggedright \\textbf{Variable name}} \\\\ \\hline \\hline\n\\textbf{N/A}:& \\multicolumn{2}{l|}{subcode, date} \\\\ \\hline\n\\textbf{after scan}& \\multicolumn{2}{p{12cm}|}{\\raggedright anxiety during scan, diastolic, pulse, systolic} \\\\ \\hline\n\\textbf{blood}& \\multicolumn{2}{p{12cm}|}{\\raggedright ba, eo, hgb, ly, mch, mchc, mcv, mo, mpv, ne, plt, rbc, wbc} \\\\ \\hline\n\\textbf{date of week}& \\multicolumn{2}{p{12cm}|}{\\raggedright date of week} \\\\ \\hline\n\\textbf{email}& \\multicolumn{2}{p{12cm}|}{\\raggedright LIWC-CDI, LIWC-negemo, LIWC-posemo} \\\\ \\hline\n\\textbf{morning}& \\multicolumn{2}{p{12cm}|}{\\raggedright pulse, sleep quality, soreness, diastolic, systolic} \\\\ \\hline\n\\textbf{previous evening}& \\multicolumn{2}{p{12cm}|}{\\raggedright alcohol, gut health, how much did tinnitus bother you today, psoriasis severity, stress, time spent outdoors} \\\\ \\hline\n\\textbf{rna}& \\multicolumn{2}{p{12cm}|}{\\raggedright rin} \\\\ \\hline\n\\textbf{same evening}& \\multicolumn{2}{p{12cm}|}{\\raggedright alcohol, gut health, how much did tinnitus bother you today, psoriasis severity, stress, time spent outdoors} \\\\ \\hline\n\\textbf{scan}& \\multicolumn{2}{p{12cm}|}{\\raggedright has breath hold, has dots, has dti, has faceloc, has grid, has n-back, has resting, has superloc, has T1W, has T2W, noise cancel} \\\\ \\hline\n\\textbf{weather}& \\multicolumn{2}{p{12cm}|}{\\raggedright precip, temp hi, temp lo} \\\\ \\hline\n\\textbf{weight}& \\multicolumn{2}{p{12cm}|}{\\raggedright weight} \\\\ \\hline\n\\textbf{zeo}& \\multicolumn{2}{p{12cm}|}{\\raggedright time in deep, time in light, time in REM, total Z, zq} \\\\ \\hline\n\\end{tabular}}\n\\caption{\\textbf{Psychophysiological variables} The first column displays the broad class to which each variable was assigned. The second column lists the specific variable names.}\n\\label{table:nuisance}\n\\end{table*}\n\n\\bibliography{biblio}\n\n\n", "itemtype": "equation", "pos": 46503, "prevtext": "\n\nHere, $\\mathbf{c}_i$ is the $i^{th}$ principal component. Further, $\\mathbf{x}_j \\in \\mathbb{R}^n$, is the $j^{th}$ column of $\\mathbf{X}$ and represents the full set of observations of the $j$th variable, standardized to have zero mean and unit variance. The weights, $w_{ji}$, give the degree to which variable $j$ contributes to component $j$. The weights are selected so that each successive component accounts for the maximum amount of variance possible. As noted in the Online Methods, all of the components, the associated weights (loadings), and the percent variance accounted for by each component can be directly calculated via a singular value decomposition (SVD) of $\\mathbf{X}$. Moreover, because each successive component is chosen so as to account for the maximum amount of variance, there exists a single optimal solution.\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\centerline{\\includegraphics[width=0.5\\textwidth]{EFAAnalysis}}\n\\caption{\\textbf{Summary of exploratory factor analysis (EFA) with $m = 1$.} \\emph{(A)} Correlation of PCA loadings onto $PI$ and loadings of PANAS-X onto the first factor. \\emph{(B)} Correlation of factor scores with global flexibility.}\\label{figure:figEFA}\n\\end{center}\n\\end{figure}\n\n\n\\subsubsection{EFA model}\nEFA, on the other hand, is based on the common factor model \\cite{thurstone1947multiple} and assumes that each observed variable is a linear combination of unobserved ``common factors'':\n\n\n", "index": 15, "text": "\\begin{equation}\n\\mathbf{x}_j = \\lambda_{1j} \\eta_1 + \\lambda_{2j} \\eta_2 \\ldots \\lambda_{mj} \\eta_m + \\varepsilon_j\\\\.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{x}_{j}=\\lambda_{1j}\\eta_{1}+\\lambda_{2j}\\eta_{2}\\ldots\\lambda_{mj}\\eta%&#10;_{m}+\\varepsilon_{j}\\\\&#10;.\" display=\"block\"><mrow><mrow><msub><mi>𝐱</mi><mi>j</mi></msub><mo>=</mo><mrow><mrow><msub><mi>λ</mi><mrow><mn>1</mn><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>η</mi><mn>1</mn></msub></mrow><mo>+</mo><mrow><msub><mi>λ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>η</mi><mn>2</mn></msub><mo>⁢</mo><mi mathvariant=\"normal\">…</mi><mo>⁢</mo><msub><mi>λ</mi><mrow><mi>m</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>η</mi><mi>m</mi></msub></mrow><mo>+</mo><msub><mi>ε</mi><mi>j</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]