[{"file": "1601.08157.tex", "nexttext": "\nwhere $H$ here is the diameter of the tube, and $P=0.643$ and $Q=2.79$ ~\\citep{bretherton1961motion}.\nThis model agrees well with the empirical fit of ~\\citet{aussillous2000quick} of \n~\\citet{taylor1961deposition}'s experimental data. We adopt $P=0.6$ and $Q=1.5$ in Eq.~\\ref{eq:extend_bre}, and \nthe fitted thickness ${h^{EB}_{2D}}/H$ almost coincides with the \nnumerical value ${h^{sim}|_{2D}}/H$. The mean film thickness ${\\bar{h}}/H$ agrees well with the two values ${h^{sim}|_{2D}}/H$ and \n${h^{EB}_{2D}}/H$ of the $2$D drop at low capillary numbers, but starts deviating when ${Ca_{d}}$\nincreases. As the confinement increases, the film thickness ${\\bar{h}}/H$ agrees better with the $2$D results.\nThe agreement between ${\\bar{h}}/H$ with the thickness ${h^{sim}|_{2D}}/H \\approx {h^{EB}_{2D}}/H$ can be attributed to two reasons: first,\nthe central region where ${\\bar{h}}$ is measured is rather flat as illustrated by the \nsparsely distributed contour lines in Fig.~\\ref{fig:filmthick}, implying the mean film thickness \n${\\bar{h}}$ adopts the constant  thickness $h$ of the \n vertical slice ($y=0$); second, as we will show in  Sec.~\\ref{sec:flowfield}, the velocity field \nof this slice is strongly resemblant to that of a $2$D matching-viscosity droplet. \n\n\nWe plot in Fig.~\\ref{fig:filmthick_overCa} (b) the scaled minimum film thickness ${h_{min}}/H$ of the pancake droplet, \nthat ${h_{min}}^{y=0}/H$ of its middle vertical slice, and that ${h_{min}^{sim}|_{2D}}/H$ of the $2$D drop. For all \n${R/H}$, ${h_{min}}^{y=0}/H$ is slightly below ${h_{min}^{sim}|_{2D}}/H$ and increases with ${R/H}$. For the most \nconfined case, ${R/H}=3$,  ${h_{min}}^{y=0}/H$ agrees with ${h_{min}^{sim}|_{2D}}/H$ reasonably well, which is in accordance\nwith the agreement between their mean thickness counterparts \\textit{i.e.} ${\\bar{h}}/H$ and ${h^{sim}|_{2D}}/H$ as discussed. The \nglobal minimum ${h_{min}}/H$ is however approximately half of the local ${h_{min}}^{y=0}/H$, as \ncan  be inferred from the minima of the contour maps (Fig.~\\ref{fig:filmthick}) that \nrepresent the thickness of the film above the lateral and rear interfacial protrusions.\nThe difference between these two minima indicates the $3$D nature of the droplet interface. \nNote that, while ${\\bar{h}}/H$ slightly increases with the confinement ${R/H}$, ${h_{min}}/H$ decreases significantly\nwith ${R/H}$, especially at large ${Ca_{d}}$ numbers. This suggests that the $3$D nature is more pronounced for a more \nconfined drop. \n\n\n\n\\begin{figure}\n        \\centering\n \\hspace{-1em}\\includegraphics[scale = 0.5] {FIG4_slim.pdf}\n       \\caption{The scaled  mean ${\\bar{h}}/H$ (a) and minimum ${h_{min}}/H$ (b) film thickness versus\nthe capillary number ${Ca_{d}}$, for a pancake droplet under confinement ${R/H}=1.5$ (circles), $2$ (squares) and $3$ \n(diamonds). Its minimum thickness on the middle vertical slice is denoted by \n${h_{min}}^{y=0}$. The dashed curve corresponds the constant film \nthickness ${h^{EB}_{2D}}/H$ of a $2$D drop predicted by the EB model~\\citep{klaseboer2014extended} with $P=0.6$ and $Q=1.5$.\nThe triangles denote the numerical data $h^{sim}|_{2D}/H$ (constant) and $h^{sim}_{min}|_{2D}/H$ (minimum) for a $2$D \ndrop. \n} \n\\label{fig:filmthick_overCa}\n\\end{figure}\n\n\\subsection{Velocity field}\\label{sec:flowfield}\nWe hereby demonstrate the $3$D nature of the interior and exterior flow of the pancake droplet, which has been\nalso observed in ~\\citet{ling15droplet}. The velocity fields projected on the vertical, horizontal and transverse \nplanes in the reference frame of the drop are depicted. We first show in Fig.~\\ref{fig:vecxz} (a) that on \nthe middle \nvertical plane $y=0$ of the drop\nwith $\\Ca=0.007$ under confinement ${R/H}=2$. We compare it to the $2$D  \ndrop with $\\lambda=1$ in Fig.~\\ref{fig:vecxz} (b). We find the \ntwo flow patterns highly resemblant, supporting the hypothesis made in Sec.~\\ref{sec:shape}\nregarding their film thickness. In the top-half domain, the interior flow  consists of three recirculating zones, two \nclockwise appearing beside the front and rear meniscus respectively and a third anti-clockwise one in between; \nthey are clearly distinguished by six stagnation points, two on the interface (black circles), two on the axis \n(magenta circles) and the other two as the tips (green circles) of the droplet. The front interfacial stagnation \npoint has been predicted for an axisymmetric inviscid bubble in a tube, \\textit{i.e.}, a Taylor \nbubble by ~\\citet{taylor1961deposition}, as also discussed by~\\citet{hodges2004motion}. The recirculation has been \nobserved numerically by ~\\citet{westborg1989creeping} and ~\\citet{martinez1990axisymmetric} for an axisymmetric  \nviscous droplet both near its front and rear meniscus, as well as by Lin \\textit{et al.} (2015) for a $2$D drop with \n$\\lambda \\approx 1.35$.\n\n\n\n\nAs explained by ~\\citet{martinez1990axisymmetric}, this flow structure appears as a result of the combination of the \nshear exerted by the wall onto the film and the zero net flux condition inside the drop. The interface \ntends to keep pace with the moving wall to reduce the viscous dissipation in the film, \nproducing the interior backward flow; the zero net flux condition dictates a compensating \nforward flow in the near-axis region. This global balance results \nfrom the local divergence-free condition  $\\partial u^{2D}_x /\\partial x+\\partial u^{2D}_z /\\partial z=0$.\n\nThis $2$D scenario holds in any vertical slice of a spanwise-infinitely-long droplet confined by two plates.\nBut there is no reason why this condition should be satisfied in the middle slice\n\nof the  'pancake'. The symmetry imposes indeed $u_y = 0$ but not necessarily $\\partial u_y /\\partial y = 0$. The \nsimilarity between the two flows shows \\textit{a posteriori} that the in-plane divergence-free condition is \napproximately verified though, $\\partial u_x /\\partial x+\\partial u_z /\\partial z = -\\partial \nu_y/ \\partial y \\approx 0$. This will be confirmed in the horizontal flow fields investigated next.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n    \\hspace{-1em}\\includegraphics[scale = 1.175] \n{FIG5_slim.pdf}\n       \\caption{Velocity field in the droplet frame including the vectors and streamlines of \nthe flow (a): on the $y=0$ plane of the drop with ${Ca_{\\infty}}=0.007$ and ${R/H}=2$.\n        (b): of a $2$D droplet with ${Ca_{\\infty}}=0.007$ and $\\lambda=1$ travelling in a infinitely long channel. Red \ncurves denote the droplet interface and black/magenta/tip circles denote the interfacial/axial/tip stagnation \npoints; the contour colour indicates the in-plane velocity magnitude scaled by the droplet velocity \n$||\\mathbf{u}||_{2}/{U_d}$. }\n\\label{fig:vecxz}\n\\end{figure}\n\n\nIn Fig.~\\ref{fig:vecxy}, we display the velocity fields on the planes located at $z=0$, $0.1$, $0.2$ and \n$0.285$ together with the colour-coded wall-normal velocity $u_z$; note that the walls are located at $z =\\pm 0.347$. \nThe flow field can be partitioned into three patches depending on the \nradial position $r_{xy}$ with respect to the origin: first, the inner patch that is \ncircular ($r_{xy} \\lessapprox 1$) inside which the flow is mostly in the streamwise direction, \\textit{i.e.}, $u_y \n\\approx 0$ and $\\partial u_y/\\partial y \\approx 0$; second, the outer patch ($r_{xy}\\gtrapprox \n1.5$) that contains the flow passing around the droplet; third, the annular patch ($1 \\lessapprox r_{xy} \n\\lessapprox 1.5$) that bridges the other two, where the flow mainly follows the in-plane curvature of the \ninterface (red). \nThe flow inside all the patches varies direction when the horizontal plane shifts from the \nmiddle $z=0$ towards\nthe top wall. More specifically, in the inner patch, the flow goes forward at $z=0$ but backward at \n$z=0.285$, reflecting the anti-clockwise recirculation on the vertical planes (see Fig.~\\ref{fig:vecxz} (a)). In \naddition, the low in-plane velocities at $z=0.2$ correspond to the core of this \nrecirculation. \nThe velocity field in the outer patch represents the relative \nmotion of the ambient flow with respect to the drop: near $z=0$, the flow is faster\nthan the drop and 'pushes' it; near the wall, the flow is slower and 'retards' it. \nThe annular patch encompasses the droplet interface, and due to the non-penetration condition, the flow mostly follows \nthe motion of the fluid elements along the interface: at $z=0$, the ambient flow 'pushes' the droplet forward, \nresulting in a clockwise annular flow; \nnear the top wall, the ambient flow 'drags' the droplet backward resulting in a counter-clockwise flow. \nUnlike the middle vertical slice, the in-plane divergence-free condition in the middle horizontal plane is clearly\nbroken, as a source (resp. a sink) emerges on the axis at $x \\approx -1.3$  (resp. $x \\approx 1.2$) \nwhich exactly corresponds to the back (resp. the front) axial stagnation point on the middle vertical plane (see \nFig.~\\ref{fig:vecxz} (a)). \n\n\n\n\n\\begin{figure}\n    \\hspace{-0.75em}\\includegraphics[scale = 0.47] {FIG6_slim.pdf}\n       \\caption{Flow on the horizontal planes at (a): $z=0$, (b): $z=0.1$, (c): $z=0.2$ and (d): \n$z=0.285$ for the same drop as in Fig.~\\ref{fig:vecxz} (a), shown in \nhalf ($y \\geqq 0$) of the domain. The top wall is located at $z=0.347$. The contour colour \nindicates the wall-normal velocity \n$u_{z}$. A reference vector with  norm $||\\mathbf{u}||_2 = 1$ is given. Red curves\nrepresent the droplet interface cut by the planes and the black dashed curves indicate the radial position of \n$r_{xy}=1$ and $r_{xy}=1.5$. Magenta circles in (a) denote the same axial stagnation points as in Fig.~\\ref{fig:vecxz} \n(a).}\n\\label{fig:vecxy}\n\\end{figure}\n\nWe then come to the flow in the transverse planes shown in Fig.~\\ref{fig:vecyz}. \nBecause of  symmetry, we focus on the quarter ($y\\geqq 0, z\\geqq 0$) and we zoom in the \nlateral interface of the drop. We observe two vortical structures aligned in the streamwise direction:\none at the rear, rotating clockwise, and the other in the front, rotating anti-clockwise.\nThe two structures are most intense at about $x=-0.85$ and $0.85$, \\textit{i.e.}, where their axis intersects the \ninterface; they both decay in strength away from these maximum swirl regions and are connected at a no-swirl  position \nslightly aft the droplet centre, \\textit{i.e.}, between the $x=-0.15$ and $x=0$ plane. At this position, the vorticity \nswitches sign and streamlines change their spiralling direction. \nThese streamwise vortex structures are closely related to the flow in the horizontal planes shown in \nFig.~\\ref{fig:vecxy}: at $x=-0.85$ and $y \\approx 1$, the flow is in the \npositive (resp. negative) $y$ direction in the annular patch at $z=0$ (resp. $z=0.285$), which generates a \nclockwise vortex; the vortex at $x=0.85$ appears likewise though oppositely oriented, because the flows in the annular \npatch reverse their spanwise directions.\n\n\\begin{figure}\n    \\hspace{-1em}\\includegraphics[scale = 0.345] {FIG7_slim.pdf}\n       \\caption{Flow on the transverse planes at (a): $x=-0.85$, (b): $x=-0.4$, (c): $x=-0.15$, \n(d): $x=0$, (e): $x=0.4$ and (f): $x=0.85$ for the same drop as in Fig.~\\ref{fig:vecxz} (a), illustrated near \nthe droplet interface (red) in the $y\\geqq 0, z\\geqq 0$ quarter of the domain. The contour \n colour indicates the streamwise velocity $u_{x}$. A reference vector with  norm $||\\mathbf{u}||_2 = 0.4$ is given.}\n\\label{fig:vecyz}\n\\end{figure}\n\n\n\\section{Conclusions and discussions}\nWe report a $3$D computation of a translating pancake droplet in a \nHele-Shaw cell. The cell gap width is around $0.5 \\sim 0.85$ the radius of a relaxed drop \nand the capillary number is in the range $\\left[0.007,0.16\\right]$. \n\n\n\n\n\n\nOur simulations together with the recent experiments~\\citet{huerre2015droplets} and the prior asymptotic \nanalysis~\\citet{burgess1990analysis} confirmed a common and unique interfacial topology of a pancake\ndroplet/bubble, \\textit{viz.} a pair of protrusions formed symmetrically on the lateral rim of the rear-half \ninterface. The viscosity ratios of the three studies are $\\lambda=1$, $25$ and $0$ respectively, suggesting that this\ntopology is rather insensitive to the viscosity ratio. As a complementary clue, the work of \n~\\citet{lhuissier2013levitation} is worth-noting. They investigated experimentally and \ntheoretically the levitation of an oil drop ($\\lambda \\approx 2500$) on a moving wall mediated by the air film between \nthem, observing a ridge of minimum film thickness on the downstream and lateral sides; although not \nbeing explicitly mentioned, three closed iso-contour patterns have been revealed indicating the interfacial protrusions \n(see their video~\\citet{APSFGD14-0056}). \n\nThe velocity field in the vertical planes closely resembles that of a $2$D droplet in a channel, while an analogous \nresemblance is missing in the horizontal planes. For a $2$D unconfined droplet or a $2$D Brinkman model \nof the drop~\\citep{gallaire2014marangoni} where the confinement of Hele-Shaw cell is depth-averaged, the interior flow \npattern, in the drop frame, is featured with two symmetric counter-rotating recirculation regions to \nsatisfy the zero  net flux condition; the drop's lateral interfaces recede due to the backward viscous forces from \nthe exterior flow and consequently the flow near the symmetry axis advances to ensure global balance. \nFor a $3$D pancake droplet, this feature is however absent in the horizontal planes. Recirculation therefore takes \nplaces \nin a preferential direction, in the \nvertical planes in which the drop is confined but not in the horizontal unconfined planes.\nThis preference results from the anisotropy of the wall confinement as the viscous forces on the \ndroplet interface in the vertical planes overwhelm those active in the horizontal planes. Indeed, the lubrication film \nbridging the wall and the interface is so thin that the viscous effects in the \nformer case play a dominant role in the determination of the flow pattern.\n\n\n\\section*{Acknowledgements}\nWe thank Dr. Etienne Lac for sharing the data of ~\\citet{lac2009motion}. \nDr. Mathias Nagel and Giacomo Gallino are acknowledged for performing $2$D BIM computations in \nsupport of validating our Gerris setup. L.Z. thanks Gioele Balestra for delightful discussions.\nThe European Research Council is acknowledged for funding the work through a starting grant (ERC SimCoMiCs 280117).\n\n\\bibliographystyle{jfm}\n\n\n", "itemtype": "equation", "pos": 15379, "prevtext": "\n\\maketitle \n\n\\begin{abstract}\nWe adopt a boundary integral method to study the dynamics of a translating droplet confined in a Hele-Shaw cell in \nthe Stokes regime. The droplet is driven by an ambient fluid with the same viscosity. We characterise the \nthree-dimensional ($3$D) nature of the droplet interface and of the flow field.\nThe interface develops an arc-shaped ridge near the rear-half rim with a protrusion in the rear and a \nlaterally symmetric pair of higher peaks; this pair of protrusions has been identified \nby the recent experiments~\\citep{huerre2015droplets} and predicted asymptotically \n~\\citep{burgess1990analysis}. The  mean film thickness is well predicted by the extended \nBretherton model~\\citep{klaseboer2014extended} with fitting parameters. The flow\nin the streamwise wall-normal middle plane is featured with recirculating zones,\nwhich are partitioned by stagnation points closely resembling those of a two-dimensional droplet in a channel. \nRecirculation is absent in the wall-parallel, unconfined, planes, in sharp contrast to the interior flow inside a \nmoving  droplet in free space. The preferred orientation of the recirculation results from the anisotropic confinement \nof the Hele-Shaw cell. We pinpoint counter-rotating streamwise\nvortex structures near the lateral interface of the droplet, further highlighting the complex $3$D flow pattern.\n \n\n\\end{abstract}\n\n\n\n\\section{Introduction}\\label{sec:introduction}\nThe dynamics of a droplet or bubble pushed by a carrier fluid flowing in a confined space\nis a classical multiphase problem that has a long history. In such cases, a capillary interface \ndevelops between the immiscible droplet/bubble and the carrier fluid that wets the wall. A thin film is formed \nbetween the interface and the wall, lubricating the droplet/bubble.  Despite the fundamental nature of questions \nregarding the thickness of the film, the shape of the menisci or the relative velocity of the droplet, and regardless of\nthe steadyfast efforts initiated in the 60's ~\\citep{taylor1961deposition,bretherton1961motion}, several issues remain \nopen. In addition, owing to the increasing importance of droplet/bubble-based \nmicro-fluidic systems in micro-engineering and micro-technology, there has been a renewed interest in this old problem; \na proper understanding shall facilitate a more controllable and precise manipulation of the suspended phase.\n\nThe existing literature focused mainly on a moving droplet/bubble confined in a capillary tube or between two \nclosely-spaced parallel plates (Hele-Shaw cell). In the former case, ~\\citet{taylor1961deposition} performed \nexperiments by blowing air into a tube filled with a viscous liquid where the air forms a round-ended cylindrical bubble\nnow referred to as a Taylor bubble. He measured the bubble velocity ${U_d}$ compared with the mean \nvelocity ${U_{\\infty}}$ of the underlying flow, showing its excess velocity $m = \\left({U_d}-U_{\\infty}\\right) /{U_d}$ as a \nfunction of the capillary number ${Ca_{d}} = \\mu {U_d}/\\gamma$, where $\\mu$ denotes the dynamic viscosity of the liquid and \n$\\gamma$ the surface tension; he also predicted the presence of stagnation points in the flow ahead of the front\nmeniscus and how the number and location of the stagnations vary with $m$. Almost at the same time, \n~\\citet{bretherton1961motion} conducted similar experiments and performed a\nlubrication analysis for an axisymmetric Taylor bubble, showing that the lubrication equations were similar to their  \ntwo-dimensional ($2$D) version assuming spanwise invariance. He focused on the shape of the front/rear menisci,  \nthe pressure drop, the thickness of the \nlubrication film and the excess velocity $m$. Bretherton established the well-known $2/3$ scaling between the \nnondimensional film thickness $2h/H$ and the capillary number ${Ca_{d}}$, namely, $2h/H = 0.643\\left( 3{Ca_{d}} \\right)^{2/3} $, \nwhere $h$ and $H$ denotes \nthe film thickness and the tube diameter respectively.\n\n\n\n\n\n\n\n\n\n\n\n\nThe situation is more complicated in a Hele-Shaw cell where the droplet is so squeezed\nand thus adopts a pancake-like shape as illustrated in Fig.~\\ref{fig:sketch}. Its \nlength scale in the unconfined direction is much larger than that in the confined direction. The latter corresponds to \nthe gap width of the cell which is again much larger than the thickness of the lubrication film. The \ndynamics of a pancake droplet in the Hele-Shaw cell occur at different length scales spanning a broad \nrange; their close coupling makes the problem truly multi-scale. Asymptotic methods have been adopted by  \n~\\citet{park1984two,burgess1990analysis} assuming  small capillary numbers and gap widths, allowing \ndepth-averaged $2$D simulations to be carried out by ~\\citet{meiburg1989bubbles} using lumped \nboundary conditions.\n\nVery recently, elaborate experiments have been performed by ~\\citet{huerre2015droplets} to measure the thickness and \ntopology of the lubrication film between a viscous, surfactant-laden droplet and the wall. \nThey identified a regime when the interface resembles a catamaran shape featured with two protrusions formed on \nits \nlateral sides. This interfacial topology has also been predicted theoretically by \n~\\citet{burgess1990analysis} for a pancake bubble (see Fig. $5$ of that paper).\n\n\n\n\n\n\n\n\nAs far as we know, very few three-dimensional ($3$D) simulations have been conducted for a pancake\ndroplet/bubble despite the very recent work of ~\\citet{ling15droplet} for a droplet with small but finite inertia. \nHere, we simulate a matching-viscosity droplet (the \nfluid inside and outside  has the same viscosity) in \nthe inertialess regime based on an accelerated boundary integral method (BIM). We focus on the effect of \nthe capillary number and the confinement (in other words the aspect ratio) of the droplet. We show the topology of the \nlubrication film and the spatial distribution of the film \nthickness. The dependence of the mean and minimum film thickness  on the capillary number are reported, and they \nare compared with the numerical and theoretical predictions of a $2$D droplet in a channel. Finally, \nwe depict the flow field inside and outside the droplet, demonstrating its complex three-dimensionality.\\\\\n\n\n\n\n\n\\section{Problem description}\\label{sec:problem}\nAs shown in Fig.~\\ref{fig:sketch} (a), we consider a translating pancake droplet at velocity ${U_{d}}$ driven by a \nPoiseuille flow with mean velocity ${U_{\\infty}}$ between two infinitely large plates placed at $z=\\pm H/2$. The radius \nof the droplet in relaxation is $a$ and all the length scales hereinafter are scaled by $a$ otherwise specified. Since \nthe thickness $h(x,y)$ of the lubrication film is much smaller than the gap width $H$, the drop can be viewed as a \ncylinder of radius $R$ and height $H$, where \n$R^{2}H=4a^{3}/3$. We use $R/H$ to quantify the confinement. The fluid inside and outside the droplet has the same \ndynamic viscosity $\\mu$, the viscosity ratio $\\lambda$ between the two (inside versus outside) is $1$. The surface \ntension of the droplet interface \nis $\\gamma$. We define capillary numbers based on the velocity of the underlying flow or that of the \ndroplet, leading to ${Ca_{\\infty}} = \\mu \n{U_{\\infty}}/\\gamma$ or ${Ca_{d}} = \\mu {U_d}/\\gamma$ respectively.\n\n\\begin{figure}\n\\centering\n\t\\includegraphics[scale=0.41]{FIG1_slim.pdf}\n\t\t\\caption{(a): A pancake droplet translating at velocity ${U_{d}}$ in a Hele-Shaw cell with gap \nwidth $H$, driven by an ambient fluid with a mean velocity of ${U_{\\infty}}$. The thickness of the lubrication film \nis $h(x,y)$ as denoted in the inset. (b): A discretized drop with ${Ca_{\\infty}}=0.02$ under confinement \n${R/H}=2$. Blue lines denote the walls and the green dashed curve indicates the nearly-flat region of the film.}  \n\\label{fig:sketch}\n\\end{figure}\n\n\n\\section{Numerical methods}\nWe use a BIM accelerated by the general geometry Ewald method (GGEM) proposed by \n\\citet{graham07_prl}. On top of a GGEM-based-BIM code originally developed to simulate elastic capsules in general\ngeometries~\\citep{zhu_sorting_14SM,lai14}, we implement a new module to simulate droplets.\nThe interface of the droplet is discretized by triangular elements, shown in Fig.~\\ref{fig:sketch} (b).\nWe perform singular integration on the droplet interface\nusing the plane polar coordinates with Gauss-Legendre quadrature~\\citep{pozrikidis1992boundary}, a high-order \nnear-singularity subtraction has also been adopted following~\\citet{zinchenko2006boundary}. A robust fourth-order local\nfitting algorithm (see Appendix B of ~\\citet{zinchenko2006boundary} for details) is used to accurately calculate the \nsurface normal \nvectors and curvatures of the interface. The most important feature\nincorporated is the so-called passive-mesh-stabilization scheme ~\\citep{zinchenko2013emulsion} which has dramatically \nimproved the robustness of our simulations because the orthogonality and \nsmoothness of the triangular elements is well guaranteed over long time evolution. For validation, we \nsimulated a droplet tightly squeezed in a long tube and observed excellent agreement with the data of\n~\\cite{lac2009motion} based on a $3$D axisymmetric BIM implementation.\n\nWe use Gerris flow solver~\\citep{popinet2009accurate} for some complementary simulations of a $2$D\ndrop in a channel. Rigorous validations against our own $2$D BIM codes have been conducted.\nGerris is adopted here to obtain accurate flow fields conveniently.\n\n\n\n\n\n\n\\section{Results}\\label{sec:results}\nWe focus on the regime ${Ca_{\\infty}}\\in \\left(0.007, \n0.16\\right)$ when the capillary forces are important. Lower capillary numbers are not pursued because they would \nrequire prohibitively high computational cost due to the rapid decrease of the \nfilm thickness $h$ with decreasing ${Ca_{\\infty}}$.  \n\n\nThree confinement levels ${R/H}=1.5$, $2$ and $3$ have been examined, their corresponding gap widths \nare $H=0.840$, $0.693$ and $0.529$. As depicted in Fig.~\\ref{fig:sketch}, we denote the $x$, $y$ and $z$ direction as \nthe streamwise, spanwise and wall-normal direction, the $yz$, $xz$ and $xy$ planes as the transverse, vertical and \nhorizontal planes.\n\n\\subsection{Droplet velocity}\\label{sec:udrop}\nFig.~\\ref{fig:dropprofca002} (a) depicts the dependence of the scaled droplet velocity ${U_d}/{U_{\\infty}}$ with the \ncapillary number ${Ca_{\\infty}}$ and confinement ${R/H}$. The velocity increases slightly with ${R/H}$. This weak \ndependence is in accordance with the experimental observations\nof ~\\citet{shen2014dynamics} for  $\\lambda \\approx 1.4$ and capillary numbers several orders smaller than \nours.\nThe droplet velocity increases with ${Ca_{\\infty}}$ monotonically and crosses the ${U_d}/{U_{\\infty}}=1$ line \nwhen ${Ca_{\\infty}} \\approx 0.04$. This is in contrast with the predicted velocity of \n${U_d}/{U_{\\infty}}=1$ by ~\\citet{gallaire2014marangoni} for a matching-viscosity pancake droplet modelled by an undeformed\ncylinder at sufficiently low ${Ca_{\\infty}}$. The mismatch results from a two-folded drawback of their model: it neglects the \nimpeding effect of the dynamics menisci of the drop at low ${Ca_{\\infty}}$; it does not capture film thickening \nat high ${Ca_{\\infty}}$ that enhances the droplet velocity.\n\n\n\n\n\n\n\n\\subsection{Shape of the droplet and film thickness}\\label{sec:shape}\n\\begin{figure}\n    \\hspace{0em}\\includegraphics[scale = 0.475] {FIG2_slim.pdf}\n       \\caption{(a): The scaled droplet velocity ${U_d}/{U_{\\infty}}$ as a function of ${Ca_{\\infty}}$ for varying confinement.\n       (b): Stretching the thin film region of the drop as in Fig.~\\ref{fig:sketch} (b) by $7.5$ in $z$. }\n\\label{fig:dropprofca002}\n\\end{figure}\n\nTo better visualize the fine-scale geometrical features of the drop shown in Fig.~\\ref{fig:sketch} (b), we stretch its \ntop interface by $7.5$ vertically and the zoomed portray is shown in Fig.~\\ref{fig:dropprofca002} (b).\nThe interface clearly bulges on the rear-half of the rim of the interface, displaying an arc-shaped ridge.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe show in Fig.~\\ref{fig:filmthick} the contour lines of constant film thickness $h\\left( x,y \\right)/H$ for \nthe droplets with ${Ca_{\\infty}}=0.007$, $0.02$ and $0.08$ under confinement ${R/H}=2$. Observe that the topography of the \ndroplet is inversely correlated to the contour map of the film thickness. \nThe black curve $h/H=0.5$ represents the edge of droplet cut by the $z=0$ plane, which resembles a circle at \n${Ca_{\\infty}}=0.007$ but becomes elongated at ${Ca_{\\infty}}=0.08$.\nFor all ${Ca_{\\infty}}$ investigated, the contour map exhibits three local minima: one at the rear and a \nsymmetric pair on the lateral edges. These minima correspond to the peaks of the interfacial protrusions. \n\n\n\nThe two symmetric lateral protrusions are higher than the rear one. \nThey have been recently observed experimentally by ~\\citet{huerre2015droplets} for a pancake droplet \nwith $\\lambda=25$ who noted the resulting 'catamaran-like shape' adopted by the droplet. This feature has also been portrayed \ntheoretically by ~\\citet{burgess1990analysis} performing a multi-region asymptotic analysis of a \npancake bubble (see Fig. 5 of their paper). As far as we know, our study\nrepresents the first computational work that identifies this unique interfacial topology.\n\n\n~\\citet{burgess1990analysis} showed in the low capillary number asymptotic limit that the contour lines of $h/H$ are \nstreamwise parallel in the central film region (excluding the lateral portion) where the viscous \nforces dominate resulting in the flat film. The contour lines of the ${Ca_{\\infty}}=0.08$ case\nare indeed parallel in the region $x \\in (-1, 1), y\\in(-0.75,0.75)$. At a reduced capillary number\n${Ca_{\\infty}}=0.007$, such parallel lines disappear and the three protrusions instead\noccupy a large portion of the film, pointing to its $3$D nature. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n    \\hspace{-0.35em}\\includegraphics[scale = 0.41] {FIG3_slim.pdf}\n       \\caption{Contour lines of the scaled film thickness $h/H$ for droplets with ${Ca_{\\infty}}=0.007$, $0.02$ and \n$0.08$  under confinement $R/H=2$. The black contour line $h/H=0.5$ indicates the edge of the droplet cut by the $z=0$ \nplane. }\n\\label{fig:filmthick}\n\\end{figure}\n\nWe show in Fig.~\\ref{fig:filmthick_overCa} (a) the dependence of the mean  thickness  ${\\bar{h}}$ \n on the capillary number.  ${Ca_{d}}$ is adopted instead of ${Ca_{\\infty}}$ to be consistent with the prior studies. We obtain \n${\\bar{h}}$  by averaging $h$ over a central circular patch with radius \n$R_{cen}=0.3R_{xy}$, where $R_{xy}$ is the effective radius of the nearly-circular droplet profile in the $z=0$ plane.\nThe scaled film thickness ${\\bar{h}}/H$ increases with ${Ca_{d}}$ monotonically and weekly depends on ${R/H}$.\n\nFor comparison, we use Gerris to simulate a $2$D matching-viscosity droplet in a channel of width $H$ where\nthe droplet length is much larger than its width. The film far away from the dynamic menisci is almost flat with a \nconstant thickness of ${h^{sim}|_{2D}}$ which is reported in Fig.~\\ref{fig:filmthick_overCa} (a). Additionally, we \ninclude the prediction of the extended Bretherton (EB) model proposed by ~\\citet{klaseboer2014extended} for a Taylor \nbubble, according to which, apart from the dynamic meniscus regions, the lubrication film has a constant thickness of \n${h^{EB}_{2D}}$\n\n", "index": 1, "text": "\\begin{align}\\label{eq:extend_bre}\n {h^{EB}_{2D}}/H = \\frac{1}{2}\\frac{P \\left( 3{Ca_{d}} \\right)^{2/3}}{1+PQ\\left( 3{Ca_{d}} \\right)^{2/3}},\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{h^{EB}_{2D}}/H=\\frac{1}{2}\\frac{P\\left(3{Ca_{d}}\\right)^{2/3}}{1%&#10;+PQ\\left(3{Ca_{d}}\\right)^{2/3}},\" display=\"inline\"><mrow><mrow><mrow><msubsup><mi>h</mi><mrow><mn>2</mn><mo>⁢</mo><mi>D</mi></mrow><mrow><mi>E</mi><mo>⁢</mo><mi>B</mi></mrow></msubsup><mo>/</mo><mi>H</mi></mrow><mo>=</mo><mrow><mstyle displaystyle=\"true\"><mfrac><mn>1</mn><mn>2</mn></mfrac></mstyle><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mi>P</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>3</mn><mo>⁢</mo><mi>C</mi><mo>⁢</mo><msub><mi>a</mi><mi>d</mi></msub></mrow><mo>)</mo></mrow><mrow><mn>2</mn><mo>/</mo><mn>3</mn></mrow></msup></mrow><mrow><mn>1</mn><mo>+</mo><mrow><mi>P</mi><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mn>3</mn><mo>⁢</mo><mi>C</mi><mo>⁢</mo><msub><mi>a</mi><mi>d</mi></msub></mrow><mo>)</mo></mrow><mrow><mn>2</mn><mo>/</mo><mn>3</mn></mrow></msup></mrow></mrow></mfrac></mstyle></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]