[{"file": "1601.00116.tex", "nexttext": " \nwhere $T_d$  is the dust temperature and \n$\\tau_\\lambda = 6\\times10^{-27}\\,N_H/\\lambda\\,\\, \\mathrm{H\\,cm^{-3}}$\nis the \noptical depth (Draine \\& Lee 1984) and $\\Omega$ is the solid angle of the source. Given $\\Omega$, the observed \nfluxes in the \ntwo bands determine the dust temperature $T_d$ and associated hydrogen \ncolumn $N_H$.\n\n\nFor RS5 we obtain extincted K$_s$ and L$'$ band fluxes of 1.5 mJy and 25\\,mJy, respectively. \nInfrared emission from RS5 traces dust emission \nfrom the protoplanetary disk  candidate. \nThe infrared emission  is unresolved at K$_s$ band, \nimplying that the solid angle is less than (27 mas)$^2$, equivalent to radius $R\\la110$\\,AU at 8\\,kpc. Adopting 3 \nmagnitudes of extinction in K$_s$ band and noting that $A_\\lambda \\propto 1/\\lambda$, equation (1) \nyields the extinction corrected K$_s$ and L$'$ fluxes for \na dust temperature of 740\\,K \nin a layer at the disk surface with  $N_H \\approx 1.5\\times 10^{20}\\mathrm{cm^{-2}} \\, \n(R/100\\,\\mathrm{AU})^{-2}$. These values are reasonable \nproviding  that the external radiation field is strong enough. \nTo check this, we note that  the \nbolometric luminosity estimated from the 3.8\\,$\\mu$m flux is $4\\pi d^2 \\nu S_\\nu \n\\approx 200\\,\\mathrm{L}_\\odot$. Adopting a total luminosity $L_* \\approx 2\\times 10^7\\,\\mathrm{L}_\\odot$ in the inner \n0.1\\,pc due to the population of hot stars surrounding Sgr A*, implies then \n the disk intercepts $\\sim L_* /(4\\pi \n(0.1\\,\\mathrm{pc})^2) \\times 2\\pi R^2\\sim 240\\,(R/100\\,\\mathrm{AU})^2\\,\\mathrm{L}_\\odot$, suggesting that $R\\sim \n100\\,$AU. Source P8 is less constrained with \nan extincted L$'$ band flux of 1.8\\,mJy, and a  K$_s$ band \nupper limit of 0.5 mJy. \nThis yields an \nupper limit on the dust temperature of $1250$\\,K.\nThe high dust temperature associated with RS5 and P8 imply that these ionized features are associated with a layer of \nhot dust and that they are not blobs of ionized gas. The luminosity and column density of gas estimated from near-IR \ndata here are very similar to those made toward proplyds found in Orion (Shuping {\\it et al.}\\, 2006). \nThe EUV Lyman continuum ionization radiation from a smaller number of massive stars is estimated to \nbe $\\Phi\\approx 8\\times10^{49}$\\,s$^{-1}$ (Genzel, Hollenbach \\& Townes 1994) and for an assumed $\\sim 0.5$ pc \ndistance from the source of ionization, the incident ionizing photon flux is $\\Phi/(4\\pi\\,(\\mathrm{0.5\\,pc})^2) \n\\approx 2\\times10^{12}$\\,s$^{-1}$\\,cm$^{-2}$. We also note that the peak flux densities of radio source RS5 is \nroughly five times stronger than those of distant proplyd candidates (P8 and P26 in Yusef-Zadeh {\\it et al.}\\, 2015), \nconsistent with the suggestion that RS5 is photo-ionized by the stellar cluster near Sgr A*.\n\n\n\nAnother possibility is that these bowshock structure are  blobs of ionized gas and hot dust\nthat orbit  around Sgr A* and have a short photoevaporative lifetime.\nAs discussed \nby Yusef-Zadeh {\\it et al.}\\, (2015) \nthe photoevaporation time scale is $\\approx 300$\\,yr, unless there is a reservoir of neutral material \nassociated with a low-mass star. In addition,  the dusty blob \nmust be bound by self gravity to avoid tidal disruption by  Sgr A*.  \nA distance of 0.1 pc from Sgr A*, \nthe  density of the blob must exceed ${n_\\mathrm{H}}\n{\\lower.4ex\\hbox{$\\;\\buildrel >\\over{\\scriptstyle\\sim}\\;$}} 10^{11}\\, { \\, \\textrm{c}^{m}} -3 $ with a $M \\approx 0.5 \\, r_{100} \\, {\\hbox{$M_\\odot$}}$. \nThese values are sufficient for the   collapse and formation of  stars. \nTo support our argument,  we note that the G2 source\nwas considered to be a cloud of dust and gas  orbiting Sgr A* (Gillessen {\\it et al.}\\, 2012). However, recent \nmeasurements suggest that  G2 is unlikely to be an isolated  cloud  of gas \nand must have an embedded core, possibly a pre-main sequence star  (Scoville and Burkert 2013; Witzel {\\it et al.}\\, 2014).  \nFuture submm observations should test  this scenario \nby searching for \nemission from cool dust in the inner disks of the proplyd candidates. \n\n\n\n\n\n\n\n\\subsection{Stellar Mass Loss and the Hot Gas Associated with Sgr A*}\n\nTo first order, the diffuse X-ray emission centered on Sgr A* is fit by an optically-thin thermal plasma with $kT$ = 3.5 \nkeV, total X-ray luminosity in the 2-10 keV band $\\sim 3\\times10^{33}$ erg s$^{-1}$, and mass \n$\\sim1\\times10^{-3}{\\mathrm{\\,M_\\odot}}$ (Baganoff {\\it et al.}\\, 2003; Wang {\\it et al.}\\, 2013), implying  a mean number density ${n_\\mathrm{H}}\\approx \n140\\,{\\mathrm{\\,cm^{-3}}}$.  This material is usually presumed to be accreting onto Sgr A*, and there is indeed \nevidence for an associated \nnon-thermal component arising  from the gas falling in towards Sgr A* (Wang {\\it et al.}\\, 2013).  The \nBondi accretion rate onto Sgr A* is $\\sim 10^{-5} {\\hbox{$M_\\odot$}}$\\,yr$^{-1}$, but this  is likely \n an overestimate given that \nSgr A* is not embedded in a uniform zero angular momentum medium.  Sub-mm polarization measurements indicate \nthat the accretion rate close to the event horizon is $\\sim 10^{-7}$ -- 10$^{-9}$ {\\hbox{$M_\\odot$}}\\, yr$^{-1}$, depending on \nassumptions about the magnetic field (Marrone {\\it et al.}\\, 2007).\n\nThis gas is generally thought  to be supplied by the combined winds of the mass-losing young stars in the central \nparsec of the Galaxy, which are estimated to supply material to Sgr A* at a rate of a few times $10^{-6}{\\mathrm{\\,M_\\odot\\,yr^{-1}}}$ (Coker \n\\& Melia 1997; Rockefeller {\\it et al.}\\, 2004; Cuadra {\\it et al.}\\, 2006, 2008).  However, the discovery of populations of young \nstars within the S-cluster which consists of $\\sim$16 B dwarfs and 3 O stars \non highly-eccentric orbits within 1$''$, begs the \nquestion whether mass loss from these stars plays a dominant role in supplying gas to the vicinity of Sgr A*.  Loeb \n(2004) suggested that mass loss from the S-stars could explain this hot gas.  \nIn this picture winds from the \nstars are shocked to high temperature because of the high orbital speeds of the S-stars.  To attain a shock \ntemperature of 3.5\\,keV requires a shock speed $\\sim 1700$\\,{km s$^{-1}$}, which corresponds to the Keplerian speed at 6\\,mpc \n(0.\\arcs15) from Sgr A*.  Loeb (2004) suggested that the S-stars were OB or WR stars with powerful winds, but it is now \nknown that they are mainly B stars. Theoretical calculations suggest that B stars have individual mass loss rates ${\\lower.4ex\\hbox{$\\;\\buildrel <\\over{\\scriptstyle\\sim}\\;$}} \n10^{-8}$\\,{\\hbox{$M_\\odot$}}\\,yr$^{-1}$ (e.g.~Vink, de Koter \\& Lamers 2000; Puls, Vink \\& Navarro 2008), insufficient to replenish \nthe hot gas.  However, the mass loss rates are known to be severely underpredicted, and recent modeling of the shells \nblown in molecular clouds by young A  and B stars suggests far higher rates, $\\sim 10^{-7}$--$10^{-6}$\\,{\\hbox{$M_\\odot$}}\\,yr$^{-1}$ \n(Offner \\& Arce 2015). Thus, the suggestion that \nthe wind  created \nby the merging of individual stellar winds from the B stars in the S-star cluster expands and \nexcludes the shocked winds from O and WR stars in the \ncentral parsec of the Galaxy (c.f. Loeb 2004)\n\n \nThe increasing evidence for YSOs within arcsecond of Sgr A*, such as the sources RS5 and P8 as discussed in this \npaper, \nsuggests that YSOs may be intermingled with the disk and S-star populations. \nAs pointed out earlier, the so-called G2 cloud could be another low-mass YSO candidate \norbiting Sgr A* (Scoville and Burkert 2013). \n\nThe young, massive stars within  $\\sim$ 0.05pc - 0.5pc of Sgr A*, \na fraction of which are found on the so-called clockwise rotating disk, \nare  formed between 2.5 and 6 Myrs ago (Lu et al 2009). \nThus, it is reasonable to assume that a population of lower mass \nstars, with attendant protoplanetary disks, is also present.  The IMF is not as top-heavy as originally \nthought, but still somewhat flatter than the Salpeter or Kroupa IMFs, with $\\phi(M) \\propto M^{-1.75}$ (Lu et \nal.~2013).  \nOf the 31 K$_s$ {$\\leq$} 16 magnitude stars that reside within the \nprojected distance of 1$''$ from Sgr A*, 16 are B stars, 3 are O stars, and 12 are late-type stars, \nof which 16 B stars and 3 late type stars are likely to be \ntrue members after correcting for contamination by foreground and background stars (Genzel {\\it et al.}\\, 2010). \nExtrapolation down to solar-mass stars is fraught with uncertainty but\nassuming that there are $\\sim$16 young stars within the S cluster  with \nmasses exceeding $3.5{\\mathrm{\\,M_\\odot}}$ implies about 120 stars with masses between 0.5 and 3.5 ${\\mathrm{\\,M_\\odot}}$.  \nIf these stars, which presumably have ages $\\sim3\\times10^6$ years still possess disks, then \nare exposed to the intense radiation from the OB stars in the central 0.5\\,pc ($G_0\\sim 10^5$) they will collectively \nlose mass by \nphotoevaporation at a rate $\\sim 10^{-6}{\\hbox{$M_\\odot$}}\\,\\mathrm{yr}^{-1}$.  In addition, material \nmass will be tidally stripped  from these \ndisks. Here, we assumed that  B-type main sequence stars are formed the same time as \nthe population of  OB  and WR stars beyond the inner 1$''$ of Sgr A*. \n The truncation radius for stellar mass $M$ is $r_t \\approx (2M_*/M_{BH})^{1/3}\\,r \\approx \n8\\,\\textrm{AU}\\,(M/{\\mathrm{\\,M_\\odot}})^{1/3}(r/5\\,\\mathrm{mpc}) $ where $r$ is distance from Sgr A*.\nFigure 12 shows a schematic diagram of how low mass stars feed Sgr A* as well as create a high  pressure X-ray gas  \nthat prevent the material belong the inner 0.5 fall into  Sgr A*. \n\n\n\n\n\n\n\n\n\nThe X-ray emission extends slightly beyond the S-cluster boundary suggesting that the gas is not bound to Sgr A* and \ninstead escapes as a supersonic wind (cf. Quaetaert 2004). At some point the escaping cluster wind encounters the material \nsupplied by the combined winds of the massive young stars beyond 0.5\\,pc.  In our proposed scenario, the outflowing \nmaterial from the S-cluster prevents this material from reaching within 1-2$''$ of Sgr A*.  \nOur interpretation of the \ndiffuse X-ray emission associated with Sgr A*, due to an expanding hot wind fed by the S-cluster (whether B stars or \nlow-mass YSOs or both), yields a very different estimate of the accretion rate onto Sgr A* than the standard picture.  \nInstead, a small fraction of the stellar winds injected very close to Sgr A* is captured by the black hole; a rough \nestimate of the accretion rate is obtained by using the Bondi-Hoyle accretion rate appropriate for a medium of density \n$\\rho$ moving by a point mass $M=4\\times10^6$\\,{\\hbox{$M_\\odot$}}\\, at the typical stellar orbital \nspeed $v=4000$\\,km\\,s$^{-1}$, i.e. $\\dot{M} = 4\\pi \nG^2M^2\\rho/v^3 \\approx 3\\times10^{-7}$\\,{\\hbox{$M_\\odot$}}\\,yr$^{-1}$. This estimate is likely \nan upper limit because it neglects any net \nangular momentum. The proposed model naturally reduces the accretion rate \nto \na level consistent with submm rotation measure constraints, \nand removes the need \nfor inflow-outflow  solutions which magically turn most of the inflowing material around at very small radii and eject it to infinity.\n\n\\subsection{Jet Activity  of Sgr A*}\n\nA  linear feature with an extent of $\\sim$3 \npc at a position angle of $\\sim60^\\circ$ (Yusef-Zadeh {\\it et al.}\\, 2012) \nwas recently suggested   to be tracing  a jet from Sgr A* interacting with the surrounding medium. \nHere we describe  two additional features, \nthe Sgr A East tower and cometary sources, with PAs  $\\sim60^\\circ$. \nThese features are suggestive  of a jet  interacting at sites near Sgr A*.\n\n\n\\subsubsection{The Sgr A East Tower}\n\nWe recently reported the tentative detection of a continuous linear structure \nsymmetrically centered on Sgr A* with \nPAs$\\sim60^\\circ$ and \n240$^\\circ$ \n(Yusef-Zadeh {\\it et al.}\\, 2012). The feature is terminated by linearly polarized \nstructures P1 and P4 $\\sim75''$ from Sgr A* at a PA$\\sim60^\\circ$ and $240^\\circ$, respectively. \nThis structure was interpreted as a mildly relativistic jet \ninteracting with the ionized gas orbiting Sgr A*. We observed \na larger region around Sgr A* \nand have identified  additional sites of \nof possible interaction between this jet candidate  \nand  the Sgr A East SNR.\nWe presented the  striking tower structure 150$''$ NE of Sgr A*. \nThis tower is an extension of  the Sgr A East shell distorted \n toward the   NE. We note  multiple bow shock-like structures \nat the location where the tower terminates. \nIn addition, structural details of P1 and P4 show linear structures \nthat are aligned along the jet candidate. \n  Altogether, morphological structures presented at radio \nsupport a picture in which  \na energetic jet-driven outflow  is required to explain the distortion of the Sgr A East shell, \nas well as the alignment  of a number of sources at \nPAs$\\sim50^\\circ-60^\\circ$ to the NE and\nPAs$\\sim230^\\circ-240^\\circ$ to the SW. \n\n\nWe adopt jet parameters $\\gamma\\sim 3$, $\\dot{M}\\sim1\\times10^{-7}{\\mathrm{\\,M_\\odot\\,yr^{-1}}}$, and opening angle 10 degrees.   \nThen the jet pressure at the location of the tower, 150$''$ (or 6pc) from Sgr A*, is about \n$P_\\mathrm{jet} = \\dot{M}\\, \\gamma\\, c\\, / (4\\pi\\, d^2)\\, \\approx \n4\\times10^{-8}\\,$ dyn\\,cm$^{-2}$.  \nThis is able to push through the thermal X-ray emitting gas filling \nthe interior of  Sgr A \nEast at speed $\\sqrt{P_\\mathrm{jet}/\\rho}\\approx 6\\,00$\\,{km s$^{-1}$}, implying a crossing time $\\sim \n10^4$\\,years assuming the  tower is 6pc away from Sgr A*. \n\nThe jet is  also able to  drag a portion of the Sgr A East shell. \nThe intensity of the synchrotron emission from the tower, i.e. 2.8\\,mJy per \n$1\\dasec39\\times0\\dasec6$ beam at 1.5\\,GHz implies an equipartition field of 0.7\\,mG and \na total pressure of $2\\times \\mathrm{B^2}\\,/8\\pi\\, \\approx3.5\\times10^{-8}$ erg\\, cm$^{-3}$ \n(Here we have adopted a source depth 1\\,pc, an $E^{-2}$ electron spectrum extending between 1\\,MeV and 10\\,GeV, and \nassumed that the energy density in protons is 100 times that for the electrons).\nThe jet pressure  is comparable to to  the magnetic pressure in the nonthermal shell \nof Sgr A East, thus the jet is able to push through.  \nThis picture implies that Sgr A East lies close to Sgr A*. The \nabsorption of Sgr A West against Sgr A East (Yusef-Zadeh \\& Morris 1987; Pedlar {\\it et al.}\\, \n1989) suggest that the NE jet must be moving away from us to be interacting with the shell of Sgr A East. \n\nAn alternative possibility that the tower is generated by the passage of a neutron star that received a large \nvelocity kick at birth.  The neutron star overtakes the remnant and produces a trail behind it as it interacts with \nthe remnant. However, the trail behind the neutral star is expected to be narrow in this picture, unlike the observed \nstructure of the extended base and the bow shock structures. Other SNRs also show jet-like or chimney-like structures at \nthe edge of the remnant (e.g., Crab and CAS A), so it may be that the the Sgr A East tower is \nproduced in the remnant by a generic mechanism  that   is not \nassociated with Sgr A*.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsubsection{Cometary Sources}\n\nRadio and infrared images, as described above, \nindicate alignment of a number of sources  within few arcseconds of Sgr A*  at a position angle around  50$^\\circ$. \nThese include the  cometary structures X7 and  X3 located SW, within 0.8$''$  and 3.4$''$ of Sgr A*, respectively\n (Muzic {\\it et al.}\\, 2007, 2010). \nBoth X3 and X7 show proper motions in the direction away from the direction toward Sgr A* \nsuggesting that the bow-shock morphology of these sources is produced by an outflow from the direction of Sgr A* \nand not by their   motion (Muzic {\\it et al.}\\, 2007, 2010).  \nWe now detect two additional cometary sources F1 and F2, within 4.8$''$  NE of Sgr A*. \nThese sources lie within 5$''$ of Sgr A* aligned at a PA$\\sim50^\\circ$. \nMuzic {\\it et al.}\\, (2007, 2010) explain the origin of  X3 and X7 in terms of an outflow either \nfrom the cluster wind \ninteracting with the atmosphere  of stars, or an outflow from Sgr A* driving a shock that produces the \ncometary morphology. \nGiven that almost all the cometary sources, X3, X7,  source F1 (radio cometary) and F2 (MIR cometary), \n have the same position angle to that \nof  polarized sources P1 and P4 and the Sgr A East tower, \na collimated outflow from Sgr A* could be better alternative to explain the \norigin of cometary structures. \n\n\nThe cometary sources are marginally resolved, implying stand-off distances equivalent to $\\sim 50$\\,mas at 8\\,kpc, ie. \n$\\sim6\\times10^{15}$\\,cm.  The ionized gas mass derived from the 35\\,GHz flux density $\\sim 0.2$\\,mJy beam$^{-1}$ is \n$\\sim 4\\times10^{-5}{\\mathrm{\\,M_\\odot}}$, and adopting a wind speed of 750\\, {km s$^{-1}$}\\, we obtain mass loss rates $\\sim 10^{-5}{\\mathrm{\\,M_\\odot\\,yr^{-1}}}$ \nand ram pressures at the stand-of distance $\\sim 10^{-4}$\\,dyn\\,cm$^{-2}$.  This is comparable to the jet ram pressure \nat $\\sim0.1$\\,pc from Sgr A* and compatible with the projected separations of X3, F1 and X7 sources, i.e., 0.13, 0.19, \n0.03 pc.\n\n\n\n\n\n\\subsection{Flaring Activity of Sgr A*}\n\nOne possible  explanation for the  ridge of radio emission \nis related the flaring activity of Sgr A*. \nPast monitoring campaigns  have found evidence for time \ndelay of $\\sim30$ minutes between the peak emission at 43 and 22 GHz \n(Yusef-Zadeh {\\it et al.}\\,  2006, 2009; \nBrinkerink {\\it et al.}\\, 2015).   This time delay is \nconsistent with a picture in which an overpressured synchrotron emitting plasma blob  at these \nwavelengths is initially optically thick. \nThe  blob then expands subrelativistically,  peaks and declines at each frequency once it \nbecomes optically thin.  \nIn this picture, the blob-like  and arc-like  structures noted   in the east-west ridge of emission \ndetected at radio wavelengths are interpreted to be  expanding blobs\nproduced by flaring activity escaping from Sgr A*. \nIf the thermal density of expanding blobs is \n sufficient to overcome the external pressure, the  outflow rate of thermal blobs of plasma is \nestimated to be ${\\lower.4ex\\hbox{$\\;\\buildrel <\\over{\\scriptstyle\\sim}\\;$}} 2\\times10^{-8}$\\,{\\hbox{$M_\\odot$}}\\,yr$^{-1}$ (Yusef-Zadeh {\\it et al.}\\, 2006). \nThe expansion blob model has \nsuccessfully been applied to flaring activity of microquasars where \noutflows  have  been detected  (e.g., Fender and Belloni 2004). \n\n\n\n\n\nAnother possibility is that  the ridge of radio emission results from \nthe interaction of  thermal winds from \nthe cluster of young massive stars   with the gravitational potential of Sgr A*. \nWardle and Yusef-Zadeh (1992) considered a picture in which the IRS 16 stars  are\nthe source of ionized winds interacting with Sgr A*.  \nIn this picture, \nthermal winds are  focused by Sgr A* and form\nblobs of hot gas in the Sgr A* ridge.\nGiven that  recent observations indicated that \nmass-losing stars are members of a cluster that  lie in a disk orbiting Sgr A*, \nit is not clear how the ridge is produced asymmetrically on one side of \nSgr A*.  \n\nVLBA measurements on mas scale  have identified  elongated structure associated \nwith Sgr A* at 43 GHz with a position angle of 95$^\\circ$ (Bower {\\it et al.}\\, \n2014). These authors explain this elongation in terms of both jet and \naccretion disk models. The radio plume and the ridge of emission closest \nto Sgr A* in Figure 1a lie along a  position angle similar to the \nintrinsic elongation of Sgr A*. This  suggests that the \nelongation of Sgr A* might be  associated with blobs of radio emission  \ndetected within the ridge but on a scale  roughly 2000 times \nsmaller than the ridge of emission from Sgr A*. The inference \nis that the radio sources in the plume-like and ridge structures are indirectly tracing \nthe interaction of an outflow due to flaring activity of Sgr A* and stars located in the S cluster.  \nThe orientation of the outflow from flaring activity is not collimated by the disk so the opening angle could be \nlarge, as evidenced in the plume structure.  On the other hand, the jet from Sgr A* is presumably \ncollimated by the disk \nand has a different PA than that of blobs of gas ejected from the \ncorona of the accretion disk  of Sgr A* due to its flare activity. \n\n\n\n\n\n\\subsection{Conclusions}\n\n\\subsubsection{Morphology}\n\nIn  summary, several new morphological features are \nrevealed within the inner 30$''$ of Sgr A*. On a scale of few arcseconds, an east-west \nplume-like ridge of emission appears to arise from Sgr A* toward SW. This diffuse feature shows eight radio sources \nwithin 2$''$ of Sgr A*, two of which are extended with arc-like morphology. One of the arc-like sources RS5 faces in \nthe general direction of Sgr A* whereas the other RS6 faces away from the direction of Sgr A*. Although the ridge of \nemission is seen on one side of Sgr A*, we also detect new  cometary and head-tail structures (sources F1, F2 \\& F3) \nwithin 13$''$ of Sgr A*  to the NE at the \nposition angle of $\\sim50^\\circ-60^\\circ$, \npointing in the direction of Sgr A*. Two previously identified cometary sources X3 and \nX7 located 3$''$ and 0.7$''$ to the SW of Sgr A*, respectively, at a position angle of $\\sim50^\\circ$. These five \ncometary sources X3, X7 and F1. F2 and F3 lie within $\\sim5^\\circ$ of a line passing through Sgr A*. \nIn addition, the ionized gas \nalong the Northern arm shows a discontinuity as the gas approaches Sgr A*. The discontinuous structure is $\\sim2.5''$ SE \nof Sgr A*. We also note that some of the ionized gas from the Northern arm shows a semi-linear feature curving around Sgr \nA* and giving the appearance of a cloud leaving a trail of ionized gas along its path. On a scale of $20''$, we note a \nhollow cone-like structure, within which a striking bent filament is detected. On a scale of two arcminutes from \nSgr A*, we detect a new tower-like feature which appears to be associated with the Sgr A East shell. \nThis remarkable structure becomes narrower as it extends to the NW with a PA$\\sim50^\\circ$ and terminated with \ntwo bow shock like structures.  \n\n\\subsubsection{Interpretation}\n\nThe identification of new structural and kinematic features within a few arcseconds of Sgr A* motivates a \nnew scenario for the origin of the hot gas responsible for the diffuse X-ray emission associated with Sgr A*. We \nargued the presence of low-mass YSO candidates within the inner 2$''$ of Sgr A* based on the \nmorphology, size and their dust and ionized properties. We  also  argued \nthat stellar winds from low mass YSOs  within the S cluster  merge to \nform a cluster wind that interacts with the surrounding orbiting ionized gas and excludes the combined winds from the \nmassive stars in the central parsec of the Galaxy. \nThe  accretion rate of the S-cluster wind onto Sgr A* is \n${\\lower.4ex\\hbox{$\\;\\buildrel <\\over{\\scriptstyle\\sim}\\;$}} \n3\\times10^{-7}$\\,{\\hbox{$M_\\odot$}}\\,yr$^{-1}$, \nhelping to explain the low luminosity of Sgr A*. \nThis is an alternative to models \nin which the low luminosity is due to ejection of the bulk of the material accreted from larger radii. \nIn our picture,  the cluster wind accounts  the  observed mass of  X-ray gas within 1$''$ of \nSgr A* has a residence time of  $\\sim10^3$ years. \nThis X-ray gas plays two major roles. \nOne  is that the  injected material during the cooling time \nof X-ray gas $\\sim10^5$ years expands away and leaves the inner 1$''$ of Sgr A*. \nThe injected ionized winds \n from the low-mass and/or young stars prevents the material  beyond  1$''$ of Sgr A* to reach Sgr A*. \nThe second role of the X-ray gas surrounding Sgr A* \nis that the accretion rate to the injected material by stars is \n at least two orders of magnitude  lower than the Bondi accretion rate  \nof $\\sim10^{-5}$ {\\hbox{$M_\\odot$}}\\, yr$^{-1}$. This is because the injected mass from stars \nhas a much higher velocity due to their orbital motion  \n and is highly stirred near Sgr A*. Thus, a very small fraction of the X-ray gas \naccretes onto Sgr A*. \n  \nOn a larger scale, we interpreted a number of cometary features\nand the distorted shape of the Sgr A East SNR in terms of the interaction of a collimated jet-driven outflow  with\nthe surrounding medium and impinging on stellar envelopes  as well as a portion of the nonthermal Sgr A East shell. \nLastly, we interpret that the east-west ridge of radio emission results from flaring activity of \nSgr A*. Flares are explained in terms of expanding, over-pressured,   plasma blobs that \nescape  the gravitational \npotential of Sgr A*. Unlike the jet-driven outflows,     the outflowing material should not be highly \ncollimated. Finally, we note that  many of these  suggestions \ncan be tested  by high resolution proper motion and submm  measurements. \n\n\n\nAcknowledgments:\nThis work is partially supported by the grant AST-0807400 from the NSF.\nThe research leading to these results has also received \nfunding from the European Research Council under the European Union's Seventh \nFramework Programme (FP/2007-2013)/ERC Grant Agreement No. [614922].\n\n\\begin{thebibliography}{99}\n\n\\bibitem[Baganoff et al.(2003)]{2003ApJ...591..891B} \nBaganoff, F.~K., et al.\\ 2003, \\apj, 591, 891\n\n\\bibitem[Baganoff et al.(2001)]{2001Natur.413...45B}\nBaganoff, F.~K., Bautz, M.~W., Brandt, W.~N., et al.\\ 2001, \\nat, 413, 45 \n\n\n\n\n\n\\bibitem[Falcke \\& Markoff(2000)]{2000A&A...362..113F}\nFalcke, H., \\& Markoff, S.\\ 2000, \\aap, 362, 113 \n\n\\bibitem[Black \\& Fesen(2015)]{2015MNRAS.447.2540B}\nBlack, C.~S., \\& Fesen, R.~A.\\ 2015, \\mnras, 447, 2540\n\n\\bibitem[Bower et al.(2014)]{2014ApJ...790....1B}\nBower, G.~C., Markoff, S., Brunthaler, A., et al.\\ 2014, \\apj, 790, 1 \n\n\\bibitem[Bower et al.(2015)]{2015ApJ...802...69B} Bower, G.~C., Markoff, \nS., Dexter, J., et al.\\ 2015, \\apj, 802, 69 \n\n\\bibitem[Brinkerink et al.(2015)]{2015A&A...576A..41B}\nBrinkerink, C.~D., Falcke, H., Law, C.~J., et al.\\ 2015, \\aap, 576, A41 \n\n\\bibitem[Broderick et al.(2011)]{2011ApJ...735..110B}\nBroderick, A.~E., Fish, V.~L., Doeleman, S.~S., \\& Loeb, A.\\ 2011, \\apj, 735, 110 \n\n\\bibitem[Coker \\& Melia(1998)]{coke98}\nCoker, R. \\&  Melia, F. 1997, ApJ, 488, L149\n\n\n\n\n\\bibitem[Cuadra et al.(2006)]{cuadra06}\t\nCuadra, J.,  Nayakshin, S., Springel, V. \\&  Di Matteo, T. 2006, MNRAS, 366,  358\t\n\n\\bibitem[Cuadra et al.(2008)]{2008MNRAS.383..458C}\t\nCuadra, J.,  Nayakshin, S. \\&  Martins, F. 2008, MNRAS, 383, 458\t\n\n\n\n\n\\bibitem[Draine \\& Lee(1984)]{1984ApJ...285...89D}\nDraine, B.~T., \\& Lee, H.~M.\\ 1984, \\apj, 285, 89 \n\n\\bibitem[Eckart et al.(2008)]{2008A&A...492..337E}\nEckart, A., Sch\\\"odel, R., Garc{\\'{{\\hbox{\\it I}}}}a-Mar{\\'{{\\hbox{\\it I}}}}n, M., et al.\\ 2008, \\aap, 492, 337 \n\n\n\n\n\\bibitem[Ekers et al.(1983)]{1983A&A...122..143E}\nEkers, R.~D., van Gorkom, J.~H., Schwarz, U.~J., \\& Goss, W.~M.\\ 1983, \\aap, 122, 143 \n\n\\bibitem[Fender \\& Belloni(2004)]{2004ARA&A..42..317F}\nFender, R., \\& Belloni, T.\\ 2004, \\araa, 42, 317 \n\n\\bibitem[Fesen \\& Staker(1993)]{1993MNRAS.263...69F}\nFesen, R.~A., \\& Staker, B.\\ 1993, \\mnras, 263, 69\n\n\\bibitem[Genzel et al.(1994)]{1994RPPh...57..417G}\nGenzel, R., Hollenbach, D., \\& Townes, C.~H.\\ 1994, Reports on Progress in Physics, 57, 417 \n\n\\bibitem[Genzel et al.(2010)]{2010RvMP...82.3121G}\nGenzel, R., Eisenhauer, F., \\& Gillessen, S.\\ 2010, Reviews of Modern Physics, 82, 3121 \n\n\\bibitem[Ghez et al.(2008)]{ghez08}\nGhez, A.~M., Salim, S., Weinberg, N.~N., Lu, J.~R., Do, T., et al. 2008, ApJ, 689, 1044\n\n\\bibitem[Gillessen et al.(2009)]{2009ApJ...692.1075G}\nGillessen, S., Eisenhauer, F., Trippe, S., et al.\\ 2009, \\apj, 692, 1075 \n\n\\bibitem[Gillessen et al.(2006)]{2006ApJ...640L.163G}\nGillessen, S., Eisenhauer, F., Quataert, E., et al.\\ 2006, \\apjl, 640, L163 \n\n\\bibitem[Gillessen et al.(2012)]{2012Natur.481...51G}\nGillessen, S., Genzel, R., Fritz, T.~K., et al.\\ 2012, \\nat, 481, 51 \n\n\n\n\n\\bibitem[Hartigan et al.(1995)]{1995ApJ...452..736H}\n{Hartigan}, P., {Edwards}, S., \\& {Ghandour}, L. 1995, ApJ, 452, 736\n\n\\bibitem[Koyama et al.(2007)]{2007PASJ...59S.245K}\nKoyama, K., Hyodo, Y., Inui, T., et al.\\ 2007, \\pasj, 59, 245 \n\n\\bibitem[Kroupa(2001)]{kroupa01}\nKroupa, P. 2001, MNRAS, 322, 231\n\n\\bibitem[Lacy et al.(1991)]{1991ApJ...380L..71L}\nLacy, J.~H., Achtermann, J.~M., \\& Serabyn, E.\\ 1991, \\apjl, 380, L71 \n\n\\bibitem[Laming et al.(2006)]{2006ApJ...644..260L}\nLaming, J.~M., Hwang, U., Radics, B., Lekli, G., \\& Tak{\\'a}cs, E.\\ 2006, \\apj, 644, 260\n\n\\bibitem[Li et al.(2013)]{2013ApJ...779..154L}\nLi, Z., Morris, M.~R., \\& Baganoff, F.~K.\\ 2013, \\apj, 779, 154 \n\n\\bibitem[Loeb(2004)]{2004MNRAS.350..725L}\nLoeb, A.\\ 2004, \\mnras, 350, 725 \n\n\\bibitem[Lu et al.(2009)]{lu09} \nLu, J.~R., Ghez, A.~M., Hornstein, S.~D., Morris, M.~R., Becklin, E.~E., \\& Matthews, K.\\ 2009, ApJ, 690, 1463\n\n\\bibitem[Lu et al.(2013)]{lu13}\n{Lu}, J. R., {Do}, T., {Ghez}, A. M., {Morris}, M. R., {Yelda}, S., \\& {Matthews}, K. 2013, \\apj, 764, 155\n\n\\bibitem[Maeda et al.(2002)]{2002ApJ...570..671M}\nMaeda, Y., Baganoff, F.~K., Feigelson, E.~D., et al.\\ 2002, \\apj, 570, 671 \n\n\\bibitem[Markoff et al.(2007)]{markoff07}\nMarkoff, S., Bower, G. \\& Falcke, H.  2007,  MNRAS,   379, 1519\n\n\n\n\n\\bibitem[Marrone et al.(2007)]{marrone07} \nMarrone, D. P.  {\\it et al.}\\,   2007, ApJ,  654, L57\n\n\\bibitem[Marrone et al.(2008)]{2008ApJ...682..373M}\nMarrone, D.~P., Baganoff, F.~K., Morris, M.~R., et al.\\ 2008, \\apj, 682, 373 \n\n\\bibitem[Moscibrokzka et al.(2009)]{mosc09}\nMoscibrokzka, M. et al. 2009, ApJ, 706, 497\n\n\n\n\n\\bibitem[Muno et al.(2008)]{muno08} \nMuno, M. P., Baganoff, F. K., Brandt {\\it et al.}\\,  2008, ApJ, 673, 251\n\n\\bibitem[Mu{{\\hbox{\\it V}} z}i{\\'c} et al.(2007)]{2007A&A...469..993M}\nMu{{\\hbox{\\it V}} z}i{\\'c}, K., Eckart, A., Sch{\\\"o}del, R., Meyer, L., \\& Zensus, A.\\ 2007, \\aap, 469, 993 \n\n\\bibitem[Mu{{\\hbox{\\it V}} z}i{\\'c} et al.(2010)]{2010A&A...521A..13M}\nMu{{\\hbox{\\it V}} z}i{\\'c}, K., Eckart, A., Sch{\\\"o}del, R., et al.\\ 2010, \\aap, 521, A13 \n\n\\bibitem[Nord et al.(2004)]{2004AJ....128.1646N}\nNord, M.~E., Lazio, T.~J.~W., Kassim, N.~E., et al.\\ 2004, \\aj, 128, 1646 \n\n\n\n\n\\bibitem[Nynka et al.(2013)]{2013ApJ...778L..31N}\nNynka, M., Hailey, C.~J., Mori, K., et al.\\ 2013, \\apjl, 778, L31\n\n\\bibitem[Offner et al.(2015)]{offner15}\n{Offner}, S. S. R. \\& {Arce}, H. G. 2015, ApJ in press (2015arXiv150807008O)\n\n\\bibitem[Park et al.(2005)]{2005ApJ...631..964P}\nPark, S., Muno, M.~P., Baganoff, F.~K., et al.\\ 2005, \\apj, 631, 964 \n\n\n\n\n\\bibitem[Perger et al.(2008)]{2008A&A...478..127P}\nPerger, M., Moultaka, J., Eckart, A., et al.\\ 2008, \\aap, 478, 127 \n\n\\bibitem[Pedlar et al.(1989)]{1989ApJ...342..769P}\nPedlar, A., Anantharamaiah, K.~R., Ekers, R.~D., et al.\\ 1989, \\apj, 342, 769 \n\n\\bibitem[Puls et al.(2008)]{puls08}\n{Puls}, J., {Vink}, J. S., \\& {Najarro}, F. 2008, \\aapr, 16, 209\n\n\\bibitem[Quataert(2004)]{2004ApJ...613..322Q}\nQuataert, E.\\ 2004, \\apj, 613, 322 \n\n\\bibitem[Reid \\& Brunthaler(2004]{reid04}\nReid, M. J. and Brunthaler, A. 2004, ApJ, 616, 872\n\n\\bibitem[Reid et al.(2007)]{2007ApJ...659..378R}\nReid, M.~J., Menten, K.~M., Trippe, S., Ott, T., \\& Genzel, R.\\ 2007, \\apj, 659, 378 \n\n\\bibitem[Rieke \\& Rieke(1989)]{rieke(89)} \nRieke, G. H. \\&  Rieke, M. J.  1989, ApJ, 344, L5 \n\n\\bibitem[Roberts et al.(1996)]{1996ApJ...459..627R}\nRoberts, D.~A., Yusef-Zadeh, F., \\& Goss, W.~M.\\ 1996, \\apj, 459, 627 \n\n\n\n\n\\bibitem[Rockefeller et al.(2004)]{rockefeller04}\nRockefeller, G., Fryer, C., Melia, F. \\& Warren, M. S.  ApJ, 2004, ApJ, 604, 662\t\n\n\\bibitem[Sanchez-Bermudez et al.(2014)]{2014A&A...567A..21S}\nSanchez-Bermudez, J., Sch{\\\"o}del, R., Alberdi, A., et al.\\ 2014, \\aap, 567, AA21\n\n\n\n\n\\bibitem[Sch{\\\"o}del et al.(2011)]{2011A&A...532A..83S}\nSch{\\\"o}del, R., Morris, M.~R., Muzic, K., et al.\\ 2011, \\aap, 532, A83 \n\n\\bibitem[Sch{\\\"o}del et al.(2009)]{2009A&A...502...91S}\nSch{\\\"o}del, R., Merritt, D., \\& Eckart, A.\\ 2009, \\aap, 502, 91 \n\n\\bibitem[Sch{\\\"o}del et al.(2013)]{2013MNRAS.429.1367S}\nSch{\\\"o}del, R., Yelda, S., Ghez, A., et al.\\ 2013, \\mnras, 429, 1367 \n\n\\bibitem[Scoville \\& Burkert(2013)]{2013ApJ...768..108S}\nScoville, N., \\& Burkert, A.\\ 2013, \\apj, 768, 108 \n\n\\bibitem[Shahzamanian et al.(2015)]{2015A&A...576A..20S}\nShahzamanian, B., Eckart, A., Valencia-S., M., et al.\\ 2015, \\aap, 576, A20 \n\n\\bibitem[Shcherbakov \\& Baganoff(2010)]{2010ApJ...716..504S}\nShcherbakov, R.~V., \\& Baganoff, F.~K.\\ 2010, \\apj, 716, 504 \n\n\\bibitem[Serabyn \\& Achtermann(1991)]{serabyn91}\nSerabyn, Lacy, J. H. \\& J. M. Achtermann  1991, ApJ, 378, 557\n\n\\bibitem[Shcherbakov \\& Baganoff(2010)]{shcherbakov10} \nShcherbakov  \\&  Baganoff, F.  2010, ApJ 716, 504\n\n\\bibitem[Shuping et al.(2006)]{2006ApJ...644L..71S}\nShuping, R.~Y., Kassis, M., Morris, M., Smith, N., \\& Bally, J.\\ 2006, \\apjl, 644, L71 \n\n\\bibitem[Steiner et al.(2013)]{steiner13} \nSteiner, J. E., Menezes, R. B. \\& Amorim, D. 2013,  MNRA, 431, 2789\n\n\\bibitem[Tanner et al.(2005)]{tanner05}\nTanner, A., Ghez, A. M., Morris, M. R. \\& Christou, J. C. 2005, ApJ, 624, 742\n\n\\bibitem[Vink et al.(2000)]{vink00}\n{Vink}, J. S., {de Koter}, A., \\& {Lamers}, H. J. G. L. M. 2000, A\\&A, 362, 295\n\n\n\n\n\n\\bibitem[Wang et al.(2013)]{wang13} \nWang, Q. D. {\\it et al.}\\,  2013,  Science, 341, 981\n\n\\bibitem[Wardle \\& Yusef-Zadeh(1992)]{1992Natur.357..308W}\nWardle, M., \\& Yusef-Zadeh, F.\\ 1992, \\nat, 357, 308 \n\n\\bibitem[Wheeler et al.(2008)]{2008ApJ...677.1091W}\nWheeler, J.~C., Maund, J.~R., \\& Couch, S.~M.\\ 2008, \\apj, 677, 1091\n\n\\bibitem[Witzel et al.(2014)]{2014ApJ...796L...8W}\nWitzel, G., Ghez, A.~M., Morris, M.~R., et al.\\ 2014, \\apjl, 796, L8 \n\n\\bibitem[Yelda et al.(2014)]{2014ApJ...783..131Y}\nYelda, S., Ghez, A.~M., Lu, J.~R., et al.\\ 2014, \\apj, 783, 131 \n\n\\bibitem[Yuan et al.(2004)]{yuan04}\nYuan, F., Quataert, E. \\& Narayan, R. 2004, ApJ, 606, 894\n\n\\bibitem[Yusef-Zadeh et al.(2014a)]{2014AAS...22421301Y}\nYusef-Zadeh, F., Wardle, M., Roberts, D.~A, et al.\\ 2014, American Astronomical Society Meeting Abstracts \\#224, 224, \\#213.01 \n\n\\bibitem[Yusef-Zadeh et al.(2014b)]{2014ApJ...792L...1Y}\nYusef-Zadeh, F., Roberts, D.~A., Bushouse, H., et al.\\ 2014, \\apjl, 792, L1 \n\n\\bibitem[Yusef-Zadeh et al.(2012)]{2012ApJ...758L..11Y}\nYusef-Zadeh, F., Arendt, R., Bushouse, H., et al.\\ 2012, \\apjl, 758, L11 \n\n\\bibitem[Yusef-Zadeh et al.(2006)]{2006ApJ...650..189Y}\nYusef-Zadeh, F., Roberts, D., Wardle, M., Heinke, C.~O., \\& Bower, G.~C.\\ 2006, \\apj, 650, 189 \n\n\\bibitem[Yusef-Zadeh et al.(2008)]{2008ApJ...682..361Y}\nYusef-Zadeh, F., Wardle, M., Heinke, C., et al.\\ 2008, \\apj, 682, 361 \n\n\\bibitem[Yusef-Zadeh et al.(2009)]{2009ApJ...706..348Y}\nYusef-Zadeh, F., Bushouse, H., Wardle, M., et al.\\ 2009, \\apj, 706, 348 \n\n\\bibitem[Yusef-Zadeh et al.(2004)]{2004ApJS..155..421Y}\nYusef-Zadeh, F., Hewitt, J.~W., \\& Cotton, W.\\ 2004, \\apjs, 155, 421 \n\n\\bibitem[Yusef-Zadeh et al.(2015b)]{2015ApJ...808...97Y}\nYusef-Zadeh, F., Wardle, M., Sewilo, M., et al.\\ 2015b, \\apj, 808, 97 \n\n\\bibitem[Yusef-Zadeh et al.(2015a)]{2015ApJ...809...10Y}\nYusef-Zadeh, F., Bushouse, H., Sch{\\\"o}del, R., et al.\\ 2015a, \\apj, 809, 10 \n\n\\bibitem[Yusef-Zadeh et al.(1990)]{1990Natur.348...45Y}\nYusef-Zadeh, F., Morris, M., \\& Ekers, R.~D.\\ 1990, \\nat, 348, 45 \n\n\\bibitem[Yusef-Zadeh \\& Melia(1992)]{zadeh92} \nYusef-Zadeh, F.  \\&  Melia, F.  1992, 385, L41\n\n\\bibitem[Yusef-Zadeh \\& Morris(1987)]{1987ApJ...320..545Y}\nYusef-Zadeh, F., \\& Morris, M.\\ 1987, \\apj, 320, 545 \n\n\\bibitem[Yusef-Zadeh et al.(1988)]{zadeh88} \nYusef-Zadeh, F.,  Morris, M. \\& Ekers, R. 1989, Proceedings of the IAU 136  1988. Edited by Mark Morris, Kluwer Academic Publishers, Dordrecht, p.443\n\n\\bibitem[Yusef-Zadeh et al.(2015c)]{2015ApJ...801L..26Y}\nYusef-Zadeh, F., Roberts, D.~A., Wardle, M., et al.\\ 2015, \\apjl, 801, L26 \n\n\\bibitem[Yusef-Zadeh et al.(2015)]{2015ApJ...801L..26Y}\nYusef-Zadeh, F., Roberts, D.~A., Wardle, M., et al.\\ 2015, \\apjl, 801, L26 \n\n\\bibitem[Zamaninasab et al.(2011)]{2011MNRAS.413..322Z}\nZamaninasab, M., Eckart, A., Dov{{\\hbox{\\it V}} c}iak, M., et al.\\ 2011, \\mnras, 413, 322 \n\n\\bibitem[Zhao et al.(2009)]{2009ApJ...699..186Z}\nZhao, J.-H., Morris, M.~R., Goss, W.~M., \\& An, T.\\ 2009, \\apj, 699, 186 \n\n\\bibitem[Zhao et al.(2013)]{2013ApJ...777..146Z}\nZhao, J.-H., Morris, M.~R., \\& Goss, W.~M.\\ 2013, \\apj, 777, 146 \n\n\\bibitem[Zhao et al.(1991)]{1991Natur.354...46Z}\nZhao, J.-H., Goss, W.~M., Lo, K.~Y., \\& Ekers, R.~D.\\ 1991, \\nat, 354, 46 \n\n\n\n\n\n\n\n\n\n\n\\end{thebibliography}\n\n\\begin{deluxetable}{llcccc}      \n\\tablecaption{VLA Observations of Sgr A*}\n\n\\tabletypesize{\\scriptsize}            \n\\tablecolumns{10}\n\\tablewidth{0pt}\n\\setlength{\\tabcolsep}{0.03in}\n\\tablehead{       \n\\colhead{Date} & \\colhead{Frequency} & \\colhead{Bandwidth} & \\colhead{Number of IFs} & \n\\colhead{Number of Channels} & \\colhead{{$ \\theta_{a} \\times \\theta_{b} $ (PA)}} \\\\\n & GHz & GHz & & & \\sl{arcsec} $ \\times $ \\sl{arcsec} (\\sl{deg}) }\n\\startdata\n2014 Feb. 21 & 44.6 & 8 & 16 & 64 & 0.074 $ \\times $ 0.034 (-4.0)\\\\\n2014 March 9 & 34.5 & 8 & 16 & 64 & 0.089 $ \\times $ 0.046 (-1.6)\\\\\n2014 March 10 & 14.1 & 8 & 16 & 64 & 0.187 $ \\times $ 0.073 (0.6)\\\\\n2014 April 17 & 8.9 & 2  & 16 & 64 & 0.187 $ \\times $ 0.073 (0.6)\\\\\n2014 April 02 & 5.5 & 2  & 16 & 64 & 0.59 $ \\times $ 0.27 (-0.2)\\\\\n2014 April 02 & 1.52 & 1  & 16 & 64 & 1.87 $ \\times $ 0.91 (0.8)\\\\\n\\enddata\n\\end{deluxetable}\n\\vfill\\eject\n\n\\begin{deluxetable}{lccccccccc}\n\\tablecaption{Predicted Positions of Young  Stars in the S Cluster (Gillessen {\\it et al.}\\, 2009) at the 2014.19 Epoch}\n\\tabletypesize{\\scriptsize}\n\\tabletypesize{\\scriptsize}\n\\tablecolumns{7}\n\\tablewidth{0pt}\n\\setlength{\\tabcolsep}{0.04in}\n\\tablehead{\n\\colhead{Source Name} & RA (IR)  & Dec (IR) & \\colhead{($\\sigma_X$)} & \\colhead{($\\sigma_Y$)}\\\\ \n\n                                &  \\sl{$17^{h} 45'$} & \\sl{$-29^\\circ 00'$} & \\sl{arcsec} & \\sl{arcsec} \n\n}\n\\startdata\n\n\nS1 &  40.0286 & 28.1151 & 0.0144 & 0.0187 \\\\  \nS2 & 40.0411 & 28.0174 & 0.0008 & 0.0013 \\\\\nS4 &  40.0570 & 28.0474 & 0.0216 & 0.0086 \\\\\nS5 & 40.0348 & 28.0605 & 0.0075 & 0.0077 \\\\\nS6  & 40.0337 & 28.0758 & 0.0212 & 0.0024 \\\\\nS8 &  40.0793 & 28.5629 &  0.0052 & 0.0048 \\\\\nS9 &  40.0358 & 28.0184 & 0.0058 & 0.0090 \\\\\nS12 &  40.0490 & 27.9601 & 0.0186 & 0.0144 \\\\\nS13 &  40.0342 & 28.3788 & 0.0221 & 0.0156 \\\\\nS14 & 40.0529 & 27.8995 & 0.0225 & 0.0193  \\\\\nS17 &  40.0425 & 27.7964 & 0.0015 & 0.0060 \\\\\nS18  & 40.0414 & 28.0197 & 0.0125 & 0.0149 \\\\\nS19 &  40.0421 & 28.1146 & 0.0203 & 0.0077 \\\\\nS21 &  40.0417 & 28.0590 & 0.0086 & 0.0050 \\\\\nS24  &  40.0393 & 28.1468& 0.0031& 0.0166 \\\\\nS27  &  40.0397 & 27.9761 &0.0033 &0.0160 \\\\\nS29  & 40.0304 & 27.9426 &0.0866 &0.1822 \\\\\nS31   & 40.0387 & 27.9182 &0.0416 &0.1664 \\\\\nS33  & 39.9993 & 28.1424 &0.1097 &0.0620 \\\\\nS38   & 40.0404 &  28.0739 &0.0218 &0.0226 \\\\\nS66  & 39.9561 & 27.8625 &0.1121 &0.1450 \\\\\nS67  & 39.9990 & 28.3748 &0.0648 &0.0858 \\\\\nS71  & 40.0204 & 28.2907 &0.5941 &1.1285 \\\\\nS83  & 40.1387 & 28.6212 &0.9300 &0.1324 \\\\\nS87  & 39.9140 & 28.3996 &0.2083 &0.3649 \\\\\nS96  & 39.9402 & 27.6973 &0.1739 &0.2426 \\\\\nS97  & 40.0403 & 29.0882 &2.0261 &0.4675 \\\\\n\\enddata\n\\end{deluxetable}\n\n\\vfill\\eject\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{deluxetable}{lccccccccc}\n\\tablecaption{Predicted Positions of S Stars (Lu et al. 2009) at the 2014.19 Epoch}\n\\tabletypesize{\\scriptsize}\n\\tabletypesize{\\scriptsize}\n\\tablecolumns{7}\n\\tablewidth{0pt}\n\\setlength{\\tabcolsep}{0.04in}\n\\tablehead{\n\\colhead{Source Name} & RA (IR)  & Dec (IR) & \\colhead{($\\sigma_X$)} & \\colhead{($\\sigma_Y$)}\\\\ \n                                &  \\sl{$17^{h} 45'$} & \\sl{$-29^\\circ 00'$} & \\sl{arcsec} & \\sl{arcsec} \n}\n\\startdata\nS0-14 &  39.9808 & 28.3463 & 0.0040 & 0.0017 \\\\  \nS0-15 &  39.9635 & 27.9216 & 0.0039 & 0.0016 \\\\\nS1-3  &  40.0587 & 27.1722 & 0.0012 & 0.0021 \\\\\nS1-2  &  40.0473 & 29.0847 & 0.0017 & 0.0063 \\\\\nS1-8  &  39.9958 & 28.9944 & 0.0031 & 0.0040 \\\\\nIRS16NW &  40.0465 & 26.8338 & 0.0009 & 0.0033 \\\\\nIRS16C  &  40.1151 & 27.4796 & 0.0023 & 0.0012 \\\\\nS1-12   &  39.9839 & 29.0952 & 0.0032 & 0.0038 \\\\\nS1-14   &  39.9395 & 28.456  & 0.0041 & 0.0013 \\\\\nIRS16SW &  40.1246 & 29.0023 & 0.0025 & 0.0023  \\\\\nS1-21   &  39.9143 & 27.9777 & 0.0060 & 0.0013  \\\\\nS1-22   &  39.9214 &28.5818  &0.0049  &0.0018   \\\\\nS1-24   & 40.0941  & 29.7428  &0.0019   &0.0039  \\\\\nS2-4    & 40.1553  & 29.5114  &0.0036  &0.0036  \\\\\nIRS16CC &40.1886  &27.4463   &0.0036  &0.0013   \\\\\nS2-6    &40.1663  &29.3915  &0.0027  &0.0023  \\\\\nS2-7  &40.1074  &26.2056  &0.0030  &0.0051  \\\\\nIRS29N  &39.9219  &26.7034   &0.0038  &0.0034  \\\\\nIRS16SWE  &40.1835  &29.1707  &0.0029  &0.0019  \\\\\nIRS33N  &40.0362  &30.3219   &0.0016  &0.0065  \\\\\nS2-17  &40.1421  &29.9418   &0.0033  &0.0047  \\\\\n S2-16  &39.9546  &25.9938  &0.0024  &0.0046  \\\\\nS2-19  & 40.0654 &25.7507   & 0.0015  &0.0047  \\\\\nS2-66  &39.9283  &25.8824  &0.0086   & 0.0116   \\\\\nS2-74  & 40.0452  &25.2775  &0.0020  &0.0063  \\\\\nIRS16NE  &40.2596  &27.1622  &0.0034  &0.0015  \\\\\nS3-5  &40.2636  & 29.2064 &0.0049  &0.0022   \\\\\nIRS33E  &40.0932  &31.1956  &0.0054   &0.0107   \\\\\nS3-19  &39.9227  & 30.8233  &0.0073  &0.0105  \\\\\nS3-25  &40.1437  &25.1221  &0.0055  &0.0089  \\\\\nS3-30  &40.1623  &30.9647  &0.0065   &0.0106  \\\\\nS3-10  &40.2908  &29.1575  &0.0060  &0.0026  \\\\\n\\enddata\n\\end{deluxetable}\n\n\n\n\n\n\n\\vfill\\eject\n\n\\begin{deluxetable}{lccccccccc}\n\\tablecaption{Predicted Positions of S Stars (Yelda {\\it et al.}\\,  2014) at the 2014.19 Epoch}\n\\tabletypesize{\\scriptsize}\n\\tabletypesize{\\scriptsize}\n\\tablecolumns{7}\n\\tablewidth{0pt}\n\\setlength{\\tabcolsep}{0.04in}\n\\tablehead{\n\\colhead{Source Name} & RA (IR)  & Dec (IR) & \\colhead{dX} & \\colhead{dY}\\\\\n&  \\sl{$17^{h} 45'$} & \\sl{$-29^\\circ 00'$} & \\sl{arcsec} & \\sl{arcsec}\n\n}\n\\startdata\nS1-3        &      40.0586     &     27.173     &     0.2669  &     0.8961    \\\\\nS0-15       &    39.9637      &  27.928         &     -0.9786 &     0.1414  \\\\\nIRS16C      &    40.1152     &  27.479          &  1.0093     &    0.5898  \\\\\nS1-12       &   39.9844      &  29.099    & -0.7068  &   -1.0301  \\\\\nS1-14       &   39.9394      &  28.465     &  -1.2979   &  -0.3955  \\\\\nIRS16SW     &  40.1252     &  28.999    &  1.1404   &  -0.9304  \\\\\nS0-14       &  39.9811      &  28.352    &  -0.7504 &    -0.2828  \\\\\nS1-1        &  40.1194      &  28.022    &  1.0634  &    0.0475  \\\\\nIRS16NW     &  40.0461    &  28.838     &  0.1021  &    1.2310  \\\\\nS1-33       &  39.9432     &  28.042    & -1.2481  &    0.0273  \\\\\nS1-18       &  39.9757     &  26.554  & -0.8217  &     1.5152  \\\\\nS1-22       &  39.9210 & 28.595 &  -1.5386  &   -0.5256  \\\\\nS2-4        &  40.1565 & 29.508 &  1.5503   &   -1.4388  \\\\\nS2-7        &  40.1069 & 26.204 &  0.9001   &   1.8649  \\\\\nS2-6        &  40.1673 & 29.386 &  1.6927   &  -1.3167  \\\\\nIRS16SW-E   & 40.184  & 29.164 &  1.9187   &  -1.0944   \\\\\nS2-22       &   40.2131   &  28.241 &  2.2934 &    -0.1724  \\\\\nS2-58       &   40.2015 & 29.161 &   2.1414  &    -1.0924  \\\\\nS1-2        &   40.0482 & 29.081 &  0.1296  &   -1.0118  \\\\\nS1-8        &   39.9966 & 29.001 & -0.5473  &   -0.9320  \\\\\nS1-21       &   39.9145 & 27.990 & -1.6247  &    0.0789  \\\\\nS1-19       &   40.0738 & 29.712 &  0.4655   &  -1.6432  \\\\\nS1-24       &   40.0951 & 29.740 &  0.7451   &  -1.6709  \\\\\nIRS16CC    &  40.1888 & 27.436 &  1.9748  &     0.6325  \\\\\nIRS29N      & 39.9213 & 26.7314 & -1.53534 &     1.3548  \\\\\nIRS33N      & 40.0372 &  30.3426 &  -0.01349  &   -2.2574  \\\\\nS2-50       & 40.1686 & 29.5458  & 1.70947 & -1.4895  \\\\\nS2-17       & 40.1436 & 29.9439  & 1.38141 &    -1.8701 \\\\\nS2-16       & 39.9538 & 26.0307  & -1.10837 &  2.0622  \\\\\nS2-21       & 39.9178 & 29.7348  & -1.58133 &    -1.6793  \\\\\nS2-19       & 40.0646 & 25.7450  & 0.34541  &    2.3194  \\\\\nS2-74       & 40.0442 & 25.2478  & 0.07746  &    2.7909  \\\\\nS2-76       & 40.0220 & 25.2451  & -0.21348 &     2.8184  \\\\\\\nIRS16NE     & 40.2599 & 27.1443  & 2.90649  &    0.9260  \\\\\nS3-2        & 40.2748  & 27.5406   & 3.10341 &     0.5632  \\\\\nS3-3        & 40.2750  & 28.6486   & 3.10449 &    -0.6172  \\\\\nS3-5        &  40.2648 & 29.191    & 2.9708  &   -1.1224  \\\\\nS3-96       &  39.7994  & 28.666  & -3.1334   &  -0.5972  \\\\\nS3-19       &  39.9227  & 30.863  & -1.5164   &  -2.7942  \\\\\nIRS33E      &  40.0942  & 31.203  & 0.7334    & -3.1336  \\\\\nS3-25       &  40.1433  & 25.105   &1.3774     & 2.9641  \\\\\nS3-26       &  39.8438  & 30.125  & -2.5510  & -2.0555  \\\\\nS3-30       &  40.1646  & 30.979 &   1.6565    & -2.9103  \\\\\nIRS13E1     &  39.8099  & 29.729 &  -2.9957   &  -1.6596  \\\\\nS3-190      &  39.7939  & 26.660 & -3.2056  &    1.4093  \\\\\nS3-10       &  40.2928  & 29.148 &   3.3391 &    -1.0790  \\\\\nIRS13E4     &  39.7893  & 29.462 &  -3.2661 &    -1.3927  \\\\\nIRS13E2     &  39.7918  & 29.786 & -3.2340  &   -1.7167  \\\\\nS3-314      &  40.3317  & 28.133 &  3.8484  &   -0.0639  \\\\\nS3-331      &  39.9466  & 24.390 & -1.2027  &    3.6787  \\\\\nS3-374      &  39.8279  & 30.929 & -2.7602  &   -2.8595  \\\\\nS4-36       &  39.7548  & 26.300 & -3.7193  &    1.7690  \\\\\nS4-71       &  40.0970  & 32.171 &  0.7697  &   -4.1025  \\\\\nIRS34W      &  39.7271  & 26.530 & -4.0827  &    1.5393  \\\\\nS4-169      &  40.3739  & 27.767 &  4.4024  &    0.3022  \\\\\nIRS3E       &  39.8623  & 24.245 & -2.3086  &    3.8236  \\\\\nIRS7SE      &  40.2682  & 24.599 &  3.0162  &    3.4705  \\\\\nS4-258      &  39.7011  & 29.683 & -4.4234  &   -1.6136  \\\\\nS4-262      &  40.3640  & 30.039  & 4.2724 &    -1.9700  \\\\\nIRS34NW     &  39.7483 & 25.252   & -3.8045 &     2.8174  \\\\\nS4-287      &  40.0493  & 32.826  & 0.1440  &   -4.7570  \\\\\nS4-364      &  40.2106  & 23.603  & 2.2608  &    4.4663  \\\\\nS5-34       &  39.7065  & 30.811  &-4.3528  &   -2.7421  \\\\\nIRS1W       &  40.4383  & 27.392  &  5.2471 &     0.6768  \\\\\nS5-235      &  40.2497  & 23.540  & 2.7737  &    4.5289  \\\\\nS5-237      &  40.4569  & 27.026  & 5.4915  &    1.0431  \\\\\nS5-236      &  39.6174  & 29.340  & -5.5214 &    -1.2707  \\\\\nS5-183      &  40.3870  & 31.513  & 4.5749  &   -3.4439  \\\\\nS5-187      &  39.9073  & 33.626  & -1.7185 &    -5.5571  \\\\\nS5-231      &  40.4814  & 27.937  &  5.8131 &     0.1319  \\\\\nS5-191      &  40.2804  & 32.963  & 3.1755  &   -4.8942  \\\\\nS6-89       &  40.4545  & 25.086  & 5.4602  &    2.9830  \\\\\nIRS9W       &  40.2609  & 33.638  & 2.9201  &   -5.5687  \\\\\nS6-90       &  39.7367  & 23.163  & -3.9571 &     4.9056  \\\\\nS6-96       &  39.5767  & 29.948  & -6.0548 &    -1.8790  \\\\\nS6-81       &  40.5221  & 27.770  & 6.3469  &    0.2995  \\\\\nS6-95       &  39.8557  & 22.060  & -2.3955 &      6.0087  \\\\\nS6-63       &  40.1824  & 34.364  & 1.8900  &   -6.2947  \\\\\nS6-93       &  40.3795  & 23.101  & 4.4765  &    4.9678  \\\\\nS6-100      &  40.1551  & 21.527  & 1.5319  &    6.5418  \\\\\nS6-82       &  40.5512  & 28.501 &   6.7288 &    -0.4320  \\\\\nS7-30       &  40.5303  & 30.770 &  6.4538  &   -2.7012  \\\\\nS7-161      &  39.4753  & 28.020 & -7.3861  &    0.0491  \\\\\nS7-16       &  40.1630  & 35.285 &  1.6362  &   -7.2159  \\\\\nS7-19       &  39.7511  & 21.539 & -3.7671  &    6.5295  \\\\\nS7-180      &  39.4757  & 29.704 & -7.3807  &   -1.6345  \\\\\nS7-10       &  39.9517  & 20.445 & -1.1363  &    7.6236  \\\\\nS7-36       &  40.5245  & 32.471 &  6.3780  &   -4.4018  \\\\\nS7-216      &  39.4498  & 26.607 &  -7.7205 &     1.4621  \\\\\nS7-20       &  39.7581  & 21.097 & -3.6762  &    6.9717  \\\\\nS7-228      &  39.4492  & 26.339 & -7.7281  &    1.7296  \\\\\nS7-236      &  39.4958  & 24.488 & -7.1167  &    3.5812  \\\\\nS8-15       &  39.9146  & 20.042 & -1.6228  &    8.0272  \\\\\nS8-7        &  39.7592  & 35.481  & -3.6613 &    -7.4118  \\\\\nS8-181      &  39.4564  & 31.661 & -7.6335  &   -3.5919  \\\\\nS8-4        &  40.0363  & 19.487  & -0.0264 &     8.5824  \\\\\nS8-196      &  39.4219  & 30.966  & -8.0861 &    -2.8968  \\\\\nS9-143      &  39.4005  & 31.424  & -8.3670 &    -3.3548  \\\\\nS9-20       &  40.3676  & 36.091  & 4.3203  &   -8.0216  \\\\\nS9-23       &  39.9392  & 18.939  & -1.3003 &     9.1305  \\\\\nS9-13       &  39.8091  & 19.226  & -3.0070 &     8.8430  \\\\\nS9-1        &  40.7579  & 27.803  & 9.4396  &    0.2660  \\\\\nS9-114      &  39.5431  & 34.936  & -6.4968 &    -6.8671  \\\\\nS9-283      &  39.3065  & 30.602  & -9.6001 &    -2.5329  \\\\\nS9-9        &  40.4686  & 36.258  & 5.6447  &   -8.1888  \\\\\nS10-50      &  40.7688  & 31.252  & 9.5831  &   -3.1832  \\\\\nS10-136     &  39.3801  & 33.320  & -8.6351 &    -5.2510  \\\\\nS10-5       &  39.9176  & 18.037  & -1.5838 &    10.0321  \\\\\nS10-4       &  40.0433  & 17.806  & 0.0653  &   10.2635  \\\\\nS10-32      &  40.8174  & 29.741  & 10.2201 &    -1.6723  \\\\\nS10-34      &  40.7155  & 33.673  & 8.8832  &   -5.6042  \\\\\nS10-7       &  40.7783  & 23.667  & 9.7069  &    4.4018  \\\\\nS10-48      &  39.9987  & 17.326  & -0.5190 &     10.7429  \\\\\nS11-21      &  40.2329  & 17.133  &  2.5531 &    10.9360  \\\\\nS11-5       &  40.1426  & 16.359  & 1.3684  &   11.7096  \\\\\nS13-3       &  40.9456  & 22.124  & 11.9027 &     5.9454  \\\\\n\\enddata\n\\end{deluxetable}\n\n\n\\begin{deluxetable}{llcccclcc}\n\\tablecaption{Positions of Radio Sources}\n\n\\tabletypesize{\\scriptsize}\n\\tablecolumns{9}\n\\tablewidth{0pt}\n\\setlength{\\tabcolsep}{0.03in}\n\\tablehead{\n\\colhead{ID} & \\colhead{Alt Name} & \\colhead{RA (J2000)} & \n\\colhead{Dec (J2000)} & \\colhead{Dist. from Sgr A*} & \\colhead{Pos. Accuracy} & \\colhead{$ \\theta_{a} \\times \\theta_{b} $ (PA)} & \\colhead{Peak Intensity} \n& \\colhead{Integrated Flux} \\\\\n& & ($17^{\\rm h}45^{\\rm m}$) & ($-29^{\\circ}00^{\\prime}$) & (\\sl{arcsec}) & (\\sl{mas}) & \\sl{mas} $ \\times $ \\sl{mas} \n(\\sl{deg}) & \\l{(mJy beam$^{-1}$)} & \\sl{(mJy)}\n}\n\\startdata\nRS1 &  & 40.0070 & 28.0275 & 0.41 & 2.72 & 21 $ \\times $ 0 (7)\n & 0.178 $ \\pm $ 0.018 & 0.133 $ \\pm $ 0.026  \\\\\nRS2 &  & 39.9986 & 27.9628 & 0.53 & 5.94 & 180 $ \\times $ 68 (1)\n & 0.238 $ \\pm $ 0.017 & 0.985 $ \\pm $ 0.084  \\\\\nRS3 &  & 39.9955 & 28.1008 & 0.56 & 2.90 & ---\n & 0.197 $ \\pm $ 0.018 & 0.102 $ \\pm $ 0.021  \\\\\nRS4 &  & 39.9569 & 28.4896 & 1.15 & 8.27 & 230 $ \\times $ 106 (180)\n & 0.206 $ \\pm $ 0.016 & 1.485 $ \\pm $ 0.133  \\\\\nRS5 &  & 39.9248 & 28.2151 & 1.50 & 7.08 & 326 $ \\times $ 76 (173)\n & 0.329 $ \\pm $ 0.016 & 2.492 $ \\pm $ 0.139  \\\\\nRS6 &  & 39.9139 & 28.5265 & 1.70 & 2.46 & 140 $ \\times $ 81 (11)\n & 0.471 $ \\pm $ 0.017 & 1.848 $ \\pm $ 0.080  \\\\\nRS7 &  & 39.8933 & 28.1996 & 1.91 & 2.97 & 59 $ \\times $ 53 (88) & 0.254 $ \\pm $ 0.017 & 0.492 $ \\pm $ 0.048  \\\\\nRS8 &  & 39.8881 & 28.3757 &  1.99  & 8.58   & 60 $ \\times $ 20 (14) & 0.075 $ \\pm $ 0.014 & 0.101 $\\pm  $ 0.030  \\\\                    &  \n\\enddata\n\\end{deluxetable}\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.6, angle=0]{f1a_kaconv_3291+3543_4693+4787.pdf}\n\\includegraphics[scale=0.6, angle=0]{f1b_ku_3291+3543_4693+4787.pdf}\n\\caption{\\small\\small{\n{\\it (a)}        \nA grayscale 34.5 GHz  image convolved to a resolution of \n0.1$''\\times0.1''$ with grayscale range -0.3 and 1 mJy.  \n{\\it (b)}\nThe same as (a) except at the 14.1 GHz with a resolution of \n234$\\times108$ mas. \n{\\it (c)}    \nSimilar to (a) except that the image display ranges between \n-0.31 and  0.1 mJy.  \n{\\it (d)}    \nSimilar to (a) except in reverse color with a resolution   88$\\times46$ mas. \n\n\n\n}}\n\\end{figure}\n\n\n\\begin{figure}[tbh]                 \n\\centering\n\\includegraphics[scale=0.6, angle=0]{f1c_ku_3291+3543_4693+4787.pdf}\n\\centering\n\\includegraphics[scale=0.6, angle=0]{f1d_ka100kl_BWG+error2.pdf}\n\n\n\\end{figure}\n\n\n\\begin{figure}[p]\n\\center\n\\includegraphics[scale=0.8, angle=0]{f2a_ka_conv_RS.pdf}\n\\includegraphics[scale=0.8, angle=0]{f2a_grays.pdf}\n\\caption{\\small\\small{\n{\\it (a)}  \nA 34.5 GHz grayscale image similar to  Figure 1a\nexcept that the image is convolved to a resolution of 0.1$''\\times0.1''$. \nThe coordinate labels are given relative to the position of \nSgr A*.  \nEight   radio sources are detected to the W of Sgr A* in the east-west ridge within  \n2$''$ of Sgr A* (see Table 5). \nThe grayscale  ranges between -220 and 500 $\\mu$Jy beam$^{-1}$. \n{\\it (b)}\nThe same as (a) except no contours are drawn.  \n{\\it (c)}  \nSimilar to (a) expect at 5.5 GHz with a resolution of \n0.59$''\\times0.27''$ (PA=$-0.2^\\circ$). \nThe grayscale  ranges between -2.5 and 5 mJy beam$^{-1}$. \n}}\n\\end{figure}\n\n\\vfill\\eject\n\n\\begin{figure}[tbh]                 \n\\centering\n\\includegraphics[scale=0.8, angle=0]{f2b_uband_RS.pdf}\n\\end{figure}\n\n\\vfill\\eject\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.8, angle=0]{f3a_ka_R0_gt100kl_Gill.pdf}\n\\includegraphics[scale=0.8, angle=0]{f3b_ka_R0_gt100kl_Lu.pdf}\\\\\n\\caption{\\small\\small{\n{\\it (a)}        \nGrayscale contours of  34.5 GHz emission \nat (-100, 100, 125, 150 200, 250, ..., \n400) $\\times \\mu$Jy beam$^{-1}$. \nThe error bars correspond to the predicted \nposition of  S-stars (Gillessen {\\it et al.}\\,  2009) \nat the epoch 2014.19. \nThe resolution of the image is 879$\\times448$ mas (PA=-2.5$^\\circ$). \n{\\it (b)}        \nSimilar to (a) except  that the crosses correspond to the \nposition of stars given by  Lu et al. (2009). \nThe drawn error bars are twice  the estimated values.\nThe grayscale  ranges between -140 and 500 $\\mu$Jy beam$^{-1}$ in both (a) and (b). \n{\\it (c)}  \nThe same region as  shown in (a)\nexcept that the image is convolved to a resolution of 0.1$''\\times0.1''$. \nThe coordinate labels are given relative to the position of \nSgr A*.  The crosses  correspond to radio sources detected in \nthe S-cluster RS1--8 (Table 4). \nThe grayscale  ranges between -200 and 500 $\\mu$Jy beam$^{-1}$. \n{\\it (d)}\nSimilar to (c) except an L$'$ image   \n}}  \n\\end{figure}\n\n\n\\begin{figure}[tbh]                 \n\\centering\n\\includegraphics[scale=0.8, angle=0]{f3c_yelda_RADEC.pdf}\n\\includegraphics[scale=0.8, angle=0]{f3d_rainer1_proplyd.pdf}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.7, angle=0]{f4a_proplyd_sgrastar_34ghz.pdf}\\\\\n\\includegraphics[scale=0.4, angle=0]{f4b_rainer_lir1_arc__greys.pdf}\n\\includegraphics[scale=0.4, angle=0]{f4c_rainer_kir1_arc__greys.pdf}\n\\caption{\\small\\small{\n{\\it (a)}        \nGrayscale contours of  34.5 GHz emission \nat -50, 50, 100, 150, ....350\\, $\\mu$Jy beam$^{-1}$\nwith a resolution of  879$\\times448$ mas (PA=-2.5$^\\circ$).\nRadio sources are labeled. \n{\\it (b)}\nThe same area as in (a) except that \ncontours of L$'$   emission at\n2.5, 2.75, 3, 3.25, 3.5, 4, 4.5, 5, 6, 10, 20, 30, \n40, 50) $\\times$ 10 mJy\n are superimposed on a  grayscale  34.5 GHz image. \n{\\it (c)}\nThe same as (b) except that \ncontours of K$_s$  emission with levels  \n2.5, 2.75, 3, 3.25, 3.5, 4, 4.5, 5, 6, 10, 20, 30, \n40, 50) $\\times$ 6.5 mJy \n are superimposed on a grayscale  34.5 GHz image. \nThe bar at the top shows the grayscale range in $\\mu$Jy. \n}}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.7, angle=0]{f5ab_X.pdf}\n\\caption{\n{\\it (a)}        \nGrayscale contours of 34.5 GHz emission from \na  cometary radio source (source F1) that points toward Sgr A* \nat (-3, -1, 1, 3, 5, 7, 10, 15, 20, 25, 30) $\\times$ 10 $\\mu$Jy beam${-1}$. \nwith a resolution of  879$\\times448$ mas (PA=-2.5$^\\circ$).\nThe range in grayscale is between -100 and 300 $\\mu$mJy beam$^{-1}$. \n{\\it (b)}  \nSimilar to (a) except at 3.8$\\mu$m with contour levels \n(16, 18, 20, 22, 25, 28, 34, 37) mJy per 27 mas$^2$). \nThe range in grayscale is between 15 and 38 mJy. \n{\\it (c)} \nA M$'$ band grayscale image at 4.68$\\mu$m in reverse color shows \ndusty stars and clouds near Sgr A*.  The inset  to the right shows a blow-up \nof a rectangular  region marked by dashed lines.  Contour levels are set at \n0.02, 0.04, 0.06, 0.08  Jy per arcsecond$^2$.    The labeled MIR cometary is also \ncalled source F2.      \n{\\it (d)} \nA grayscale contours of emission from the cometary source F3 at 34.5 GHz at \nat -6, 6, 10, 15, 18, 22, 30, 40, 50 and  60 $\\mu$Jy beam$^{-1}$.  The grayscale range \nis between -40 and 200 $\\mu$Jy. \n}\n\\end{figure}\n\n\\begin{figure}[tbh]                 \n\\centering\n\\includegraphics[scale=0.7, angle=0]{f5c_outflow_features_MIR.pdf}\n\\includegraphics[scale=0.7, angle=0]{f5d_Kaband_f3_v1.pdf}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.6, angle=0]{f6a_1045+1462_2513+2812.pdf}\n\\includegraphics[scale=0.6, angle=0]{f6b_1045+1462_2513+2812.pdf}\n\\caption{\n{\\it (a)}        \nA grayscale scale image of Sgr A East and West at 1.5 GHz. \nwith a resolution of  1.4$''\\times0.6''$  (PA=-1$^\\circ$).\nThe brightness range of the  grayscale is between \n-1.5$\\times10^{-4}$  and 0.002 Jy beam$^{-1}$. \n{\\it (b)}  Similar to (a) except that the  grayscale ranges is \n between -1.5$\\times10^{-4}$  and 5$\\times10^{-4}$  Jy beam$^{-1}$.  The 1$\\sigma$ rms noise\nis 53 $\\mu$Jy beam$^{-1}$. \n{\\it (c)}        \nA schematic diagram of features noted at 1.5 GHz. \n}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.8, angle=0]{f6c_20cm_cartoon.pdf}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.35, angle=0]{f7ab_20cm_P1+bow.pdf}\n\\includegraphics[scale=0.35, angle=0]{f7c_20cm_P4_v1.pdf}\n\\caption{\n{\\it (a - top left)}        \nGrayscale contours of the bow shock region  where the Sgr A East \ntower terminates at 1.52 GHz\nwith a resolution of  1.81$''\\times0.89''$ (PA=1.65$^\\circ$).\nThe levels are set at \n -0.9, 0.4, 0.5, 0.6, 0.7, 0.9, 1.1, 1.3, 1.5, \\&  1.7 \n mJy beam$^{-1}$. \n{\\it (b - top right)}        \nSimilar to (a) except that the grayscale contours of  P1\n -0.5, 0.5, 0.7, 1, 1.3, 1.6, 2.0, 2.5, 3.0 \\& 3.5\n mJy beam$^{-1}$. \n{\\it (c - bottom)}  \nThe P4 region at 1.52 GHz with \na resolution of  2.9$''\\times2.2''$ (PA=-38$^\\circ$).\nGrayscale range is between -0.8 and 2.4 mJy beam$^{-1}$.\nContour levels are set at (-1, -0.5, 1, 2, ...,8)$\\times0.5$ mJy beam$^{-1}$. \n}\n\\end{figure}\n\n\\begin{figure}[tbh]\n\\centering\n\\centering\n\\includegraphics[scale=0.4, angle=0]{f8a_CC_3291+3543_46934787.pdf}\n\\includegraphics[scale=0.6, angle=0]{f8b_Earm_34ghz.pdf}\n\\caption{{\n{\\it (a)}        \nThe same as (b) except at 5.8 GHz with a resolution of\n0.59$''\\times0.27''$.}\n{\\it (b)}        \nA grayscale 34 GHz continuum image of ionized gas showing  the East  ad North arms  of Sgr A West. \nThe spatial resolution of this image is 88.6 $\\times 46.5$ mas (PA=-1.56$^\\circ$). \nAxes are in the direction of RA and Dec and the coordinates are given in arcseconds with respect to \nSgr A*.  \n}\n\\end{figure}\n\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.3, angle=0]{f9_cartoon.pdf}\n\\caption{\\small\\small{\n\nA  diagram of prominent features in Sgr A West within  50$''$ of Sgr A*. \n}}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\clearpage\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.5, angle=0]{f10a_gcfil_20cm_v2log.pdf}\n\\includegraphics[scale=0.5, angle=0]{f10b_gcfil_6cm.pdf}\n\\caption{{\n{\\it (a)}        \n A 1.5 GHz continuum  image with a resolution of \n1.87$''\\times0.9''$ (PA=0.8$^\\circ$) shows Sgr A West and a striking filamentary structure\nadjacent to the North arm. \n{\\it (b)}        \nSimilar to (a) except at 5.5 GHz with a spatial resolution of \n0.59$''\\times0.27''$. \n{\\it (c)} \nA 1.5 GHz image of the bent filament and Sgr A* with a resolution of \n$1.8''\\times0.9''$ (PA$1.6^\\circ$). \nSgr A* is marked with a star. \n{\\it (d)}\nSimilar to c) except with a resolution of\n$1.4''\\times0.6''$ (PA$1.6^\\circ$). \n{\\it (e)} \nContours of 8.9 GHz emission from the bent  filament with a resolution of \n$0.34''\\times0.19''$ are set at (-0.05, 0.05, 0.1,  0.2,.., 0.7, 1, 1.5, 2) $\\times$ \n0.5 mJy beam$^{-1}$. \n}}\n\\end{figure}\n\n\\begin{figure}[tbh]\n\\centering\n\\includegraphics[scale=0.3, angle=0]{f10cde_bentfilament.pdf}\n\\end{figure}\n\n\n\n\n\n\\begin{figure}[tbh]\n\n\\centering\n\\includegraphics[scale=0.4,angle=0]{f11a_lc_comb_n.pdf}\n\\includegraphics[scale=0.4,angle=0]{f11b_lc_P2.pdf}\n\\caption{\nThree panels show the flux density of RS5 (left) and P8 (right) \nas a function of the \npixel number based on three different registered images\nat 34 GHz, 3.8 $\\mu$m and 2.16 $\\mu$m.  \nThe  slice for RS5 was made at a constant declination  $-29^\\circ\\,  00'\\,  28''.25$ between \n$17^h\\,  45^m\\,  39^s.879$  and $17^h\\, 45^m\\, 39^s.940$ for an extent of ~$\\sim0.81''$.\n} \n\\end{figure}\n\n\\vfill\\eject\n\n\n\n\\begin{figure}[tbh]\n\n\\centering\n\\includegraphics[scale=0.9,angle=0]{f12_new_cartoon.pdf}\n\\caption{ \nA schematic diagram of a  model of the emission \nwithin  the inner 1$''$ of Sgr A* where the S cluster is located.\nThe diffuse X-ray  cluster wind   is produced  from merged winds \nof  mass-losing B  stars or material  photoevaporating \nfrom the disks of young low mass stars that orbit Sgr A*. \nThe X-ray cluster  wind plays two roles. First, its pressure  \nis sufficient to prevent external material beyond 1$''$ of Sgr A* to approach  Sgr A*. \nSecond, the inner  material feeds Sgr A* (c.f. Loeb 2004; Quataert 2004). \n} \n\\end{figure}\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\n\\pagenumbering{arabic} \n\\voffset=-0.8in\n\n\n\n\n\\def\\degree{\\ifmmode{^\\circ} \\else{$^\\circ$}\\fi}\n\n\\oddsidemargin = 0pt \\topmargin = 0pt \\hoffset = 0mm \\voffset = -17mm\n\\textwidth = 160mm  \\textheight = 244mm\n\\parindent 0pt\n\\parskip 5pt\n\n\n\n\n\n\\shorttitle{Sgr A*}\n\\shortauthors{}\n\n\n\n\\title{Sgr A* and its Environment: Low Mass Star Formation,\\\\\nthe Origin of X-ray Gas and Collimated Outflow}\n\\author{F. Yusef-Zadeh$^1$, M. Wardle$^2$, R. Sch\\\"odel$^3$, \nD. A. Roberts$^1$, W. Cotton$^4$,\\\\ \nH. Bushouse$^5$,  R. Arendt$^6$, \n \\& M. Royster$^1$}\n\\affil{$^1$CIERA, Department of Physics and Astronomy Northwestern University, Evanston, IL 60208}\n\\affil{$^2$Department of Physics and Astronomy,  Macquarie University, Sydney NSW 2109, Australia}\n\\affil{$^3$Instituto de Astrofi$'$sica de Andaluci$'$a (CSIC), Glorieta de la Astronomica, 18008 Granada,  Spain} \n\\affil{$^4$National Radio Astronomy Observatory,  Charlottesville, VA 22903}\n\\affil{$^5$Space Telescope Science Institute, 3700 San Martin Drive, Baltimore, MD  21218}\n\\affil{$^6$NASA GSFC,  Code 665, Greenbelt, MD 20771} \n\n\n\n\n\n\n\n\n\\begin{abstract} \nWe present high-resolution multiwavelength radio continuum images of the region within 150{\\mbox{$^{\\prime\\prime}$}}\\ of {Sgr~A$\\textrm{*}$}, revealing a \nnumber of new extended features and stellar sources in this region. First, we detect a continuous 2{\\mbox{$^{\\prime\\prime}$}}\\ east-west ridge of \nradio emission, linking {Sgr~A$\\textrm{*}$}\\ and a cluster of stars associated with IRS 13N and IRS 13E. The ridge suggests that an \noutflow of east-west blob-like structures is emerging from {Sgr~A$\\textrm{*}$}.\nIn particular, we find \narc-like radio structures within the ridge with morphologies suggestive of photoevaporative protoplanetary disks.  We \nuse infrared K$_s$ and L$'$ fluxes to show that the emission has similar characteristics to those \n of a protoplanetary disk \nirradiated by the intense radiation field at the Galactic center. This suggests that star formation has taken \nplace within the S cluster 2{\\mbox{$^{\\prime\\prime}$}}\\ from {Sgr~A$\\textrm{*}$}. We suggest  that the diffuse X-ray emission associated with Sgr A* is \ndue to an expanding hot wind produced by the mass loss from  \nB-type main sequence  stars, and/or the disks of \nphotoevaporation of low mass young stellar objects (YSOs) \nat a rate $\\sim 10^{-6}{\\hbox{$M_\\odot$}}\\,\\mathrm{yr}^{-1}$. The proposed model naturally reduces the inferred \naccretion rate and is an \nalternative to the inflow-outflow style models to explain the underluminous nature of Sgr A*.\nSecond, on a scale of 5$''$ from Sgr A*, we detect new cometary radio and infrared \nsources  at a position angle PA$\\sim50^\\circ$ which is similar to that of two other cometary sources X3 and X7, all of \nwhich face Sgr A*. In addition, we detect a striking tower of \nradio emission at a PA$\\sim50^\\circ-60^\\circ$ along the major axis of the Sgr A East SNR shell\non a scale of 150$''$ from Sgr A*.  \nWe suggest  that  the cometary sources and the tower feature \nare tracing  interaction sites of a mildly relativistic jet\nfrom Sgr A*\nwith the atmosphere of stars and the nonthermal Sgr A East shell at a PA$\\sim50-60^\\circ$\n with   $\\dot{M}\\sim1\\times10^{-7}{\\mathrm{\\,M_\\odot\\,yr^{-1}}}$, and opening angle 10 degrees.\nLastly, we suggest that the east-west ridge of radio emission  traces  an outflow \nthat is  potentially associated with past flaring  activity from Sgr A*. \nThe  position angle of the outflow driven by  flaring activity is close to $-90^\\circ$ which is different than \nthe PA$\\sim60^\\circ$ of the radio ridge. \n\\end{abstract} \n\\keywords{accretion, accretion disks --- black hole physics --- Galaxy: center}\n\n\n\n\n\n\\section{Introduction}\n\nA 4$\\times 10^6$ {\\hbox{$M_\\odot$}}\\, black hole is coincident with the compact nonthermal radio source {Sgr~A$\\textrm{*}$}\\ at the center of the \nGalaxy (Ghez {\\it et al.}\\, 2008; Gillessen {\\it et al.}\\, 2009; Reid and Brunthaler 2004). The estimated mass accretion rate onto \nSgr A* is several orders of magnitude smaller than the rate at which young, windy stars in the innermost 0.5 pc supply \nmass to the Bondi radius of Sgr A* (Coker \\& Melia 1997; Cuadra {\\it et al.}\\, 2006, 2008). $Chandra$ observations have \ncharacterized the X-ray emission surrounding {Sgr~A$\\textrm{*}$}\\ to be spatially extended with a radius of $\\sim$1.5{\\mbox{$^{\\prime\\prime}$}}\\ \n(Baganoff {\\it et al.}\\, 2003; Wang {\\it et al.}\\, 2013). The X-ray luminosity is interpreted as arising from a radiatively \ninefficient accretion flow (RIAF, e.g. Yuan {\\it et al.}\\, 2004; Moscibrokzka {\\it et al.}\\, 2009). In this model, a fraction of the \ngaseous material accretes onto {Sgr~A$\\textrm{*}$}\\ and the rest is driven off as an outflow from {Sgr~A$\\textrm{*}$}\\ (e.g., Quataert 2004; \nShcherbakov and Baganoff 2010; Wang {\\it et al.}\\, 2013). Another  mechanism that may reduce the accretion rate is interaction \nwith a \njet or an outflow limiting the amount of gas falling onto Sgr~A* (Yusef-Zadeh {\\it et al.}\\, 2014a), thus modifying the \n accretion flow. In this picture, the interaction of the outflow with the surrounding gas or the \natmosphere  of mass-losing stars can provide an estimate of the power of the outflow. \n\nTwo different types of activity  are associated with Sgr A*. One\nis flaring \non hourly time scale at multiple wavelengths (e.g., Baganoff {\\it et al.}\\, 2001; \nGenzel {\\it et al.}\\, 2003). \nObservations of Sgr A* have detected a time delay at submm, mm, and  radio wavelengths consistent with a scenario  \nin which plasma blobs expand away from the disk, becoming visible at successive \nlonger  wavelengths\nas the optical depths become of order unity  effects (Yusef-Zadeh {\\it et al.}\\,  2006, 2008, 2009; Marrone {\\it et al.}\\,  2008; \nEckart {\\it et al.}\\, 2008; Brinkerink {\\it et al.}\\, 2015).  \nThe other is  a jet-driven outflow (e.g., Falcke \\& Markoff 2000). \nUnlike the flare activity, \nthe  existence of a jet from Sgr A* has not been firmly established because of the complex\n  thermal and nonthermal structures in this confused  region of the Galaxy.\nAt least five independent investigations based on X-ray, near-IR, and radio observations have suggested that a jet \nis emanating from {Sgr~A$\\textrm{*}$}. These studies have found  discrepant values for the jet position angle (PA) and \ninclination  (Markoff {\\it et al.}\\,  2007; Broderick {\\it et al.}\\,  2011; Zamaninasab {\\it et al.}\\,  2011; Muno {\\it et al.}\\, 2008; \nLi {\\it et al.}\\, 2013; Yusef-Zadeh {\\it et al.}\\,  2012; Shahzamanian {\\it et al.}\\, 2015). \nIt is possible that   some  of the gas approaching Sgr A* is\npushed away as part of an expanding hot plasma driven by flaring  and jet activity,    \nresulting Sgr A*'s low radiative efficiency.\nThus, the presence of  collimated \nstructures  from {Sgr~A$\\textrm{*}$}\\,  is critical in distinguishing between the competing accretion and outflow models.\n \nThe Galactic center is \na challenging region in which to image  a radio jet or a flare \nclose to {Sgr~A$\\textrm{*}$}, because of the limited spatial resolution and dynamic \nrange  caused by confusing sources, scatter broadening, and intrinsic temporal \nvariability of {Sgr~A$\\textrm{*}$}\\, on hourly time scales (e.g., Bower {\\it et al.}\\, 2014).\nHere we present  sensitive observations of the Galactic center at multiple radio frequencies\nobtained using the improved broad-band capability of the VLA, \n finding  new radio structures interpreted to be associated with Sgr A* activity. \n\n\nOn a scale of a few arcseconds  from   Sgr A*, \nwe identify  a ridge of east-west radio emission which bends toward the SW in the direction away from Sgr A*. \nThis ridge,  which is detected to the west of Sgr A*,   shows a number of blobs and arc-like \nfeatures surrounded by a diffuse plume-like structure.  \nWe interpret that the  plume-like feature as arising  from flaring activity, thus produces  \nan  outflow from \nthe direction of Sgr A* on a scale of $\\sim$0.1 pc, with an opening angle of $\\sim35^\\circ$.\nThe position angle of the outflow driven by flaring activity of  Sgr A* is consistent with the   east-west elongation of \nSgr A* observed on milliarcsecond (mas) scale  (Bower {\\it et al.}\\, 2015).   \nA large number of  stars being members of \nthe so-called ``S-cluster''\\footnote{A loosely defined term \nconsisting of $\\sim$30 stars within a projected distance of 1$\"$ from  Sgr A*, 2/3 of which \nare spectroscopically classified as  O/B stars with orbital periods of a dozen  to few hundred years \nand the rest older stars (e.g., Genzel {\\it et al.}\\, 2003). \nWe point out that the stars in this region \nhave different spectral types and ages and probably heterogeneous origins} \n  also lie \nalong the ridge.   \nWe  compare  infrared  and radio images of the ridge and argue that bow-shock  structures \ndetected within the inner 2$''$ of Sgr A* are   proplyd candidates. We show that \nradio  sources with comparable scale size to those associated with  proplyds \ncan not be simply blobs of dusty ionized gas but are associated with a  reservoir  of \nhot dust surrounded by ionized gas.\n\n\n\nOn a larger  scale,  within two arcminutes NE of Sgr A*, \nwe  find  new cometary sources (F1, F2 and F3)  pointing toward Sgr A*  \nand a large-scale tower-like structure associated with the Sgr A East supernova remnant (SNR) 150$''$ from Sgr A*.\nThe position angle of these new structures\nis similar to two other IR-identified cometary sources, X3 and X7,  found to the SW of Sgr A* (Muzic {\\it et al.}\\, 2007, 2010). \nOne interpretation that we put forth is \nthat these features could be the  result of a\njet from Sgr A*  interacting with the atmosphere  of dusty  stars near \nSgr A* and with the  Sgr A East shell, respectively. \n\n\n\nIn addition, we suggest that \nthe diffuse X-ray emission  centered on  Sgr A* arises  through hot gas\ncreated by the collision of stellar winds from B stars in the S-star cluster or \nyoung low-mass stars (c.f. Loeb 2004). \nThis nuclear wind   created by  mass-losing stars near Sgr A* produces hot expanding X-ray gas (c.f. Quataert 2004)\nthat excludes the shocked winds from O and WR stars in the central parsec of the Galaxy and prevents accretion \nonto Sgr A*.  \nMeanwhile Sgr A* accretes material from the cluster winds\nat a much lower rate potentially explaining\nthe low luminosity of Sgr A* without the ejection of a large fraction of the accreted material.\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\section{Observations and Data Reduction}\n\\subsection{Radio Data}\n\nMulti-wavelength radio continuum observations were carried out with the Karl G. Jansky Very Large Array \n(VLA)\\footnote{Karl G. Jansky Very Large Array (VLA) of the National Radio Astronomy Observatory is a facility \nof the National Science Foundation, operated under a cooperative agreement by Associated Universities, Inc.} in \nits A-configuration at 44, 34.5, 8.5, 5.5 and 1.4 GHz during March and April 2014. Table 1 gives columns of the \ndate, center frequency, bandwidth, the number of subbands (IF), the number of channels, and the spatial \nresolution of each observation. \nIn all \nobservations, we used 3C286 to calibrate the flux density scale,  3C286 and J1733-1304 (aka NRAO530) to \ncalibrate the bandpass, and J1744-3116 to calibrate the complex gains. The broad 8 GHz bandwidths at 34 and 44 \nGHz, 2 GHz bandwidths at 5 and 14 GHz, and 1 GHz bandwidth\n at 1.4 GHz provide   a significant improvement over earlier  observations that had only 100 MHz of bandwidth.\nWe observed  Sgr A* using the 3-bit sampler system at 34 and 44 GHz, which provided full polarization correlations. \n \n\n\n\\subsection{Infrared  Data}\n\nDetails of the  near-IR observations and data reduction of the Galactic center at $K_s$  and $L'$ bands, \ncentral wavelengths 2.18, and 3.8 $\\mu$m, respectively, were recently given in Yusef-Zadeh {\\it et al.}\\, (2015). \nThese observations used adaptive optics and were acquired with \nVLT/NACO\\footnote{Based on observations made with ESO Telescopes at the La\nSilla or Paranal Observatories under programs ID 089.B-0503}, with a pixel scale of 0.027$\"$ per pixel.\n$L'$-band observations were obtained \nin speckle mode using \nfive fields with different pointing and\ndepths. Field\\,1 was centered on {Sgr~A$\\textrm{*}$}, and Fields 2--5 were offset by approximately 20{\\mbox{$^{\\prime\\prime}$}}\\ to the northeast,\nsoutheast, southwest, and northwest, respectively.\nStandard near-IR  image data reduction was applied \nfollowed by combining  individual pointings into large mosaics. In the case of\nthe $L'$ image, the speckle holography technique, as described in Sch\\\"odel {\\it et al.}\\,  (2013), was applied to the\nthousands of obtained speckle frames to create final high-Strehl images for each pointing. \nFinally, we calibrated the images astrometrically by using the positions and proper motions of SiO maser stars in the\nGalactic center (Reid {\\it et al.}\\ 2007). \n\nImaging data in M$'$-band were taken with NACO/VLT in 2003, 2004, and 2006. We retrieved the data from the ESO archive. \nChopping was used for background subtraction. The images were flat-fielded and corrected for bad pixels. Since the \nchop throw was small in all observations (due to technical limitations at the VLT) the images from the individual \nepochs show strong negative residuals from stellar and diffuse sources in the off-target chop positions. However, some \ndithering was applied during the observing runs and the initial pointing as well as the chopping angle were different \nfor the different observing epochs. Therefore, residuals could be effectively removed by averaging the images from \nall observing epochs; the images were sub-pixel shifted onto a common position of the centroid of the star IRS 16C \nand median combined. Any remaining artifacts from chopping were effectively removed by rejecting the lowest 20\\% at \neach pixel before calculating the median value. Approximately 12000 frames, each with 0.056 s integration time, were \ncombined, corresponding to an accumulated exposure time of about 800 s. The photometry was calibrated by assuming \nconstant extinction between the L and M bands and the same magnitudes at both bands for the sources IRS 16C and IRS \n16NW. Their L'-band fluxes were taken from Sch\\\"odel {\\it et al.}\\,  (2010). The uncertainty of the zero point was estimated to \nbe 0.15 mag.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\\section{Results}\n\nBecause of better sensitivity to detect weak radio emission, we first present newly recognized  \nfeatures within a few arcseconds of Sgr A* and then  compare  the positions of \nnear-IR identified stellar sources with radio data. Lastly, we present large\nstructures on a scale between a few arcseconds to  two arcminutes surrounding \nSgr A* and identify new features associated with the Sgr A East SNR shell. \n\n\\subsection{Small Scale  Radio  Features}\n\n\\subsubsection{The Sgr A* Radio Ridge}\n\nFigure 1a,b show images of the inner 10{\\mbox{$^{\\prime\\prime}$}}\\ of {Sgr~A$\\textrm{*}$}\\ at mean frequencies (wavelengths) 34.5 GHz (9mm) and 14.1 GHz \n(2cm). Prominent stellar and ionized features are labeled. These images reveal a ridge of emission to the \nwest of north of  {Sgr~A$\\textrm{*}$}\\ extending for about 1.5--2{\\mbox{$^{\\prime\\prime}$}}\\ at position angles ranging between $\\sim$90 and $-125^\\circ$. This ridge of \nemission,  which was previously detected in low resolution images at 8 GHz (Wardle and Yusef-Zadeh 1992) links Sgr A* to the \nwestern edge of the minicavity, an ionized feature with a diameter of 2{\\mbox{$^{\\prime\\prime}$}}. The western edge of the minicavity \ncoincides with the two stellar clusters IRS 13N and IRS 13E. The  {Sgr~A$\\textrm{*}$}\\ radio ridge consists of a number of blob-like and \narc-like structures with angular scales of 0.2--0.5{\\mbox{$^{\\prime\\prime}$}}. The two arc-like structures coincide with source $\\epsilon$ \nwhich has been detected in earlier narrow bandwidth images with low spatial resolutions at 15 GHz (Yusef-Zadeh {\\it et al.}\\, \n1990; Zhao  {\\it et al.}\\, 1991). To illustrate the asymmetric nature of the ridge structure, \nFigure 1c shows a saturated image of the region \nshown in Figure 1a,b. We interpret that this structure has\n an opening angle of $\\sim35^\\circ$ \npointed in the direction toward  W and SW from Sgr A*. Figure 1d \nshows another 34.5 GHz rendition of the ridge of emission in reverse color, but at higher resolution than that of \nFigure 1a.  The images at multiple frequencies confirm the reality of blob and arc-like structures along the ridge. \nNote the diffuse plume-like structure, as drawn schematically on Figure 1a, \nsurrounding the blob and arc-like structures. \nThe widening of the plume-like \nstructure away from Sgr A* suggests  that a plume of  gaseous material is moving outward  and\nexpanding away, \nsuggesting  that Sgr A* is responsible for the ridge.\nProper motion measurements of the brightest source in the ridge indicate \nhigh velocity ionized gas moving away from Sgr A* to the SW (Zhao {\\it et al.}\\, 2009).  \nThis radio ridge appears distinct  from the ionized gas associated with the mini-spiral HII region \norbiting Sgr A* and is not confused \nwith numerous dusty stellar sources and diffuse emission   found in mid-IR images of this region. \nFuture high resolution proper motion, polarization \nand spectral index measurements of the ridge will provide additional constraints in \nthe claim that this feature is associated physically to Sgr A*. \n \n\\subsubsection{Radio Emission from the S Cluster}\n\nThe region within $\\sim$2{\\mbox{$^{\\prime\\prime}$}}\\ of Sgr A* where the ridge of radio emission and the plume-like structure are detected, \nis adjacent to the S-cluster. \nThis cluster consists mostly of young, early type stars with orbital periods of 10 to a few 100 years.\nThe kinematics of the stars in the cluster, which following other workers we refer to as  $``$S stars$''$, \nhave been used to \nmeasure the mass of Sgr A* (Ghez {\\it et al.}\\, 2008; Gillessen {\\it et al.}\\,  2009).  Figures 2a,b show \ncontours of 34.5 GHz emission and a grayscale image of \na region  of $3.5''\\times2.5''$ centered on Sgr A*. \nFigure 2c shows contours of 5.5 GHz  \nemission  superimposed on a  grayscale image. \nThe crosses on Figure 2a,c correspond to eight radio sources RS1--8 found in the plume-like region to the \nwest of Sgr A*.  \n\nThe trajectories of young stars are known from proper motion \nmeasurements in the near-IR. To see if these  stars have radio continuum counterparts, their positions at the epoch of \nour 34 GHz observation on March 9, 2014 (2014.19) have been calculated based on proper motions and orbital \naccelerations derived from \nnear-IR observations (Gillessen {\\it et al.}\\, 2009; Lu {\\it et al.}\\, 2006; Yelda {\\it et al.}\\ 2014). Tables 2, 3  give the \npositions of S cluster  and their corresponding positional \nuncertainties at the epoch of 2014.19 and from two different catalogs (Gillessen {\\it et al.}\\, 2006; Lu {\\it et al.}\\, 2009). \nTable  4\ngives the predicted X/Y offsets (in \narcsecond) of  stars relative to Sgr A* for the epoch 2014.19. These tables list the positions of the 28, 31 and  \n117 \nstars identified by Gillessen {\\it et al.}\\, (2009), Lu {\\it et al.}\\, (2006) and Yelda {\\it et al.}\\, 2014,  respectively.   \nTable 5 lists Gaussian-fitted \npositions of 8 radio sources (RS1--8) embedded within the diffuse extended emission associated with \n the Sgr A* ridge and the plume-like \nstructure at 34 GHz (see Figs. 1 and 2).\nEntries in columns 1 to 9 give the name of the source at 34 GHz, alternative  names in the literature, the RA and Dec,\n the angular distance from Sgr A* in \nincreasing order, positional accuracy, the peak intensity and  the flux density \nthat are associated with these sources.\n\n\n\n\nFigure 3a,b superimpose contours of radio emission on a 34 GHz grayscale image, with crosses indicating \nthe positions of the  stars in the S cluster for which orbits have been determined by Gillessen {\\it et al.}\\, (2009) and Lu {\\it et al.}\\,  \n(2009), respectively.  \nMany of the S-stars, as noted in Figure 3a,  are projected against the bright, scatter-broadened radio source Sgr A* and \nthe diffuse emission from the Sgr A* ridge, thus they can not be discerned  at radio wavelengths. \nThe comparison of \nradio sources (RSs) listed in Table 5 with stellar sources  given in Table 2 \nindicates that RS1, RS2 and RS3 lie within the \n1$\\sigma$ position of S33, which is an early type star (Gillessen {\\it et al.}\\,  2009).  These radio sources \nappear compact but they are embedded within the extended emission from the ridge of emission (see Fig. 2b) \nso it is not \nclear if these sources are radio  counterparts to S33 unless we measure the proper motion of radio sources.  \nIf these radio sources are not randomly coincident with S33 and are associated with stars, we  \ncan determine the \nmass loss rate from the ionized winds. \nThe radio emission is assumed to arise  from S33 with a  flux density of $\\sim0.2$ mJy at 34.5 GHz  \nand is due to a spherically-symmetric, homogeneous  wind of fully--ionized \ngas expanding with a constant terminal velocity $\\sim$700 {km s$^{-1}$}\\, (Panagia \\& Felli 1975). \nThe   mass loss rate of S33 is estimated to be $\\dot{M} = 2\\times10^{-6}$ {\\hbox{$M_\\odot$}} yr$^{-1}$. \nClumpiness of the  ionized wind would  reduce this estimate. \n\n\n\n\n\n\n\n\n\nFigure 3c shows a grayscale 34 GHz image in negative  and labeled with the positions of those  stars for \nwhich orbits have been determined by Yelda {\\it et al.}\\, (2014). We note several prominent young stars, \nIRS~16SW, IRS~16NW, IRS~16C, that are not members of the S-cluster but have radio counterparts (Yusef-Zadeh {\\it et al.}\\, \n 2013). Figure 3d shows the distribution of stars over the area shown in Figure 3c at 3.8$\\mu$m. The \ncrosses correspond to the position  of stars (Yelda {\\it et al.}\\, 2014) at the epoch that radio data were \ntaken. Apart from  stars labeled on this figure, \nthe spectral classification of remaining faint sources is unknown. \nThese faint sources  are \npossibly  late-type stars associated with  the evolved nuclear cluster or young low-mass stars (see $\\S4$).\nFive near-IR stellar sources A--E are  labeled on Figure 3d and  will be discussed below. \n\n\n\\subsubsection{Bow Shock-like Radio Sources RS5 and RS6}\n\nFigure 4a,b,c show the relative position of 34.5 GHz sources RS5 -- RS8 and 3.8 $\\mu$m and 2.18 $\\mu$m sources A -- D with \nrespect to each other.  Two of the newly detected radio sources in the ridge, RS5 and RS6 located $\\sim1.6''$ from Sgr A* (see \nFig. 2), are partially resolved, with size scales ranging between 850 to 1200 AU. A close-up views of these arc-like \nstructures are shown in Figure 4a whereas Figures 4b,c show contours of 3.8 and 2.18$\\mu$m emission superimposed on a 34.5 GHz \nimage, respectively. A comparison of radio with near-IR images reveals that the arc-like structures RS5 and RS6 have 3.8$\\mu$m \ncounterparts with a bow shock morphology. There are two near-IR stellar sources, S1-22 (Lu {\\it et al.}\\, 2009) and a stellar source \nA, as labeled on Figure 4c.  S1-22 lies at the apex of a bow shock-like structure and is an early type star which is projected \nagainst the extended radio emission associated with RS6. Star A has no radio counterpart, and is not identified \nin any catalogs of early type stars near Sgr A*. \nIt is unlikely that star A \nis  associated with RS6 for two  reasons. First,  proper motion measurements indicate \nthat star A is moving to \nthe NW with a velocity of 117$\\pm16$ {km s$^{-1}$}\\, (Sch\\\"odel {\\it et al.} 2009). The proper motion of ionized gas associated with the blob \n$\\epsilon$ which coincides with RS5, RS6 and RS7 is $\\sim338\\pm21$ {km s$^{-1}$}\\, to the SW (Zhao {\\it et al.}\\, 2009). Second, \n it \nis unlikely that a late-type star could have a stellar wind strong enough to produce the observed \n stand-off distance of the bow-shock's \napex,  $\\sim$6 milliparsec (mpc).  This  requires a Wolf-Rayet star  (Tanner \n{\\it et al.}\\, 2005; Sanchez-Bermudez {\\it et al.}\\, 2014). Thus, it is unlikely that star A is associated with the bow-shock structure RS5. \n\nAs for S1-22, the proper motion data gives a tangential velocity of $\\sim$326 {km s$^{-1}$}\\, to the SE (Yelda {\\it et al.}\\, 2014). \nRadio \nproper motion measurements have a coarse arcsecond spatial resolution , \ngiving the proper motion of RS5, R6 and RS7, when compared to \nthose of near-IR sources. In spite of  the difference in resolution between radio and near-IR proper motion measurements, \nthe magnitude of radio proper motion of RS5, RS6 and RS7 is similar to that of S1-22. Thus, it is possible that S1-22 is \nphysically associated with RS6 with the standoff distance of $\\sim$4 mpc. \n\n\n\n\n\n\nIn addition to star A, three 3.8$\\mu$m sources B, C and D, labeled on Figures 4b,c, are not \nfound in the catalogs of early type stars. \nRS7 and RS8 are likely  to be radio counterparts \nto source B, and C, respectively. A  radio source with a flux density of 58 $\\mu$Jy at 34 GHz is detected at the \nposition of source D which lies in an extended region associated with the ridge.  \nThe bright radio sources B and D are \nclearly stellar sources since they are detected at L$'$ and K$_s$ bands. \nThe offsets seen in the position of radio and \nnear-IR sources could have a contribution from  proper motion of individual sources. \nThe near-IR images at 2.18 and 3.8$\\mu$m were \ntaken during June and September 2012 whereas the 34.5 GHz data was taken on March 9, 2014.\nThe L$'$ sources associated with RS5, RS7 (or source A), RS8 (or source B), and D, \nlie  to the  SSE of their radio counterparts, suggesting either \ncorrelated motion, coincidence, or a systematic error in the image registration arising because \nthe radio and infrared  images are taken at different epochs.\nWe compared Gaussian fitted positions of B, C and D at 34.5 GHz and L$'$ band and found  \n3.4 and 3 sigma offsets to the north  in the positions of stars B and D and their radio counterparts, respectively. \nWe also compared the positional offset for IRS 16C and its radio counterpart and determined  \n that this implies a proper motion of IRS 16 that is roughly twice \nhigher the actual value determined at radio and infrared wavelengths (Lu {\\it et al.}\\,  2009; Yusef-Zadeh {\\it et al.}\\, 2015a). \nThus, we can not establish that radio sources are counterparts to stellar sources. \nGiven the offsets in positions and the non-detection of source C in K$_s$,  it is just possible that \nthe radio sources\nare gas blobs and are not directly associated with  stars. However, it is \nnot clear how gas blobs near  Sgr A* could survive the tidal shear of  Sgr A* unless they have densities \nthat withstand  the tidal shear or that  they are transient (Yusef-Zadeh {\\it et al.}\\, 2015c). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Large Scale Features}\n  \n\\subsubsection{Cometary  Sources F1 and F2}\n\nThere are two known cometary sources, X3 and X7,  lying within 3$''$ to the SW of Sgr A* \nat near-IR wavelengths. \nX3 is located $\\sim3''$ \nfrom Sgr A* (Muzic {\\it et al.}\\, 2007, 2010) \nshowing tail-head structure pointing toward Sgr A*. \nIt  has a radio counterpart at 44 GHz (source 16 in Yusef-Zadeh {\\it et al.}\\, 2014b) and \n a  peak flux density  0.22 mJy beam$^{-1}$ at 34.5 GHz. \nThe second cometary source  X7 (Muzic {\\it et al.}\\, 2007)   \nis  identified in Figure 3d as source E at near-IR.   \nThis   cometary source also \npoints  toward  the direction of Sgr A*. \nA compact 34.5 GHz source with a peak flux density of 100 $\\mu$Jy is detected at the position \nof source E  0.7$''$ from Sgr A*. \nThis source lies too close to Sgr A* where the noise increases near the bright source  Sgr \nA*, thus, structural details of this source are not  clear at radio wavelengths. \nWe detect a third radio source with a cometary morphology similar to X3 and X7. \nUnlike X3 and X7, this source,  which we denote  F1,   \nlies  4.8$''$ to the NE of Sgr A*. \nFigure 5a,b show grayscale \ncontours of this cometary  feature at 34.5 GHz and 3.8$\\mu$m, respectively. \nF1  has an extent of 0.65$''\\times0.25''$ (length $\\times$ width) \nwith an integrated flux density of $\\sim2$ mJy  and background subtracted peak intensity \nof 416 mJy per  $(0.12'')^2$ at 34.5 GHz and 3.8$\\mu$m, respectively.  \n\n\nFigure 5c shows a large  view  of the \nregion  which includes X3, X7,  the  radio cometary feature (F1) and the  MIR cometary  feature (F2) at \n4.68 $\\mu$m in reverse color.\nWe note a gap in the region to the NE of Sgr A* where F1 is detected. \nThis gap  appears to be devoid of dust emission at MIR. \nThe MIR  gap can also be identified at radio in  Figure 1b. However, \nthe lack of short   {\\it uv} spacings may contribute in suppressing  the emission from \n the bright source Sgr A*.  \nA close up view of infrared  emission at M$'$ band \nfrom the inner $3''\\times3''$ \nof Sgr A* is shown in the inset to the right of Figure 5c.  \nAn additional cometary feature is detected at MIR \nto the NE of IRS 16C in the inset. This source,  which we call F2,  is  well within the MIR gap and lies along \nthe direction where X3, X7 and  F1  are located. \n\nLastly,  an additional  radio source $\\sim13''$ NE of Sgr A* shows  a head-tail structure \npointing toward Sgr A*. This radio feature shows a tail feature with an extent of $\\sim0.6''$ at the  \nPS$\\sim57^\\circ$. The peak flux density of this source which we call  F3 is \n0.32 mJy beam$^{-1}$ at 34.5 GHz with a spatial resolution \nof 89$''\\times46''$ mas.  \nThis source has been detected   in the L$'$ band as IRS 5 SE (Perger {\\it et al.}\\, 2008).\nThis source  is  interpreted as a stellar bow-shock resulting from the interaction of a masss-losing stars \nand the minispiral. \n\n\\subsubsection{Sgr A East Tower}\n\nThe nonthermal radio source Sgr A East \nis  a young shell-type  SNR  with an angular size of \n2.7$'\\times3.6'$ and a spectral index $\\alpha$=0.76, where \nthe flux density S$_\\nu\\propto\\nu^{-\\alpha}$\n(Ekers {\\it et al.}\\, 1983; Yusef-Zadeh \\& Morris 1987; \nPedlar {\\it et al.}\\, 1989).  Thermal X-ray emission is concentrated in  the interior of the remnant suggesting \nthat  Sgr A East  is a mixed morphology SNR interacting with the 50 {km s$^{-1}$}\\,  molecular cloud \n (Maeda {\\it et al.}\\, 2002; Park {\\it et al.}\\, 2005).  The thermal X-ray emitting plasma  has \ntwo  components,  characterized by temperatures of 1 and 6 keV and  corresponding  electron density of 4.7 \n and 0.6  cm$^{-3}$, respectively. \n(Park {\\it et al.}\\, 2005; Koyama {\\it et al.}\\, 2007).  A candidate neutron  star CXOGC J174545.5--285829 (the cannonball) \ndetected in  X-ray and radio has also been associated with the remnant (Park {\\it et al.}\\, 2005; Zhao {\\it et al.}\\, 2013). \n\nOur broad band 1.5 GHz image of Sgr A East provides a wealth of details associated with Sgr A East and the surrounding \nenvironment.  Figures 6a,b show large scale views of Sgr A East displayed with two different grayscale \nlevels at 1.5 GHz. The major axis of the Sgr A East shell is along the Galactic plane. A number of new features are \ndetected in this complex region. Here we describe three new features. One is a distorted region to the NE of the Sgr A \nEast shell, 100$''$ E and 80$''$ N of Sgr A*.  A striking tower-like structure with an extent of 100$''$ appears to \nemerge from a gap \nin the brightness distribution of Sgr A East. The base of this tower is about \n20$''-25''$ across with mean flux density of $\\sim2.8$ mJy per 1.39$''\\times0.6''$ beam at 1.5 \nGHz. The base  narrows as it extends to the NE with a position angle of $\\sim50^\\circ$. A schematic diagram of \nthese features is shown in Figure 6c. The tower is terminated by  two bow-shock-like structures. Grayscale contours \nof these  are displayed in Figure 7a. \n\nThe second feature is the  polarized source P1 which was first identified at 8 GHz (Yusef-Zadeh \n{\\it et al.}\\, 2012). At  1.5 GHz, P1  is resolved into two linear structures\n (see the total intensity image in Figure 6b), that appears to cross each other at right angles. One of the linear \nfeatures has a PA$\\sim50^\\circ$, as shown in Figure 7b. Lastly, the region surrounding the polarized source P4 \n(Yusef-Zadeh {\\it et al.}\\, 2012) is shown at 1.5 GHz in Figure 7c.  This elongated feature extents for 20$''$ at 1.5 GHz with \na position angle of $\\sim50^\\circ$. A number of blob-like structures were previously reported to the NE of this \nfeature (Yusef-Zadeh {\\it et al.}\\, 2012).\n \n\n\n\n\\subsection{Other Features}\n\n\n\\subsubsection{A Semi-linear Feature}\nWe identify a striking semi-linear radio \ncontinuum feature  projected \nperpendicular to the radio Sgr A* \nridge\\footnote{The Sgr A* radio  ridge should be distinguished from the mid-IR Sgr A* ridge discussed  \nby Sch\\\"odel {\\it et al.}\\, (2011)}.  \nFigure 8a shows a 5.5 GHz image that reveals  roughly \nuniform brightness \n$\\sim0.5$ mJy per 0.5$''\\times0.27''$ beam. The semi-linear feature appears to arise from the ionized bar \nas it curves concave toward Sgr A*, crosses the ridge at an angular distance of $\\sim$1{\\mbox{$^{\\prime\\prime}$}}\\ west of Sgr A*, and \ncontinues to the north of Sgr A*. To highlight  this structure, white dashed lines are drawn along this radio feature. \nThe semi-linear continuous structure has  an extent of 5{\\mbox{$^{\\prime\\prime}$}}\\ and  width of 0.5{\\mbox{$^{\\prime\\prime}$}},  becoming \nwider and more diffuse \nas it extends to the north of Sgr A*.  The Northern arm shows a discontinuity, \nas it  approaches Sgr A*, \n which is best seen at $\\alpha, \\delta\\, (J2000)=17^h\\, 45^m\\, 40.18^s, -29^\\circ\\, \n0'\\, 29''$ in Figures 1a-c. \nThe elongated features makes a 90$^\\circ$ \nchange to the south in its direction as it approaches Sgr A* (see the schematic diagram in Fig. 9). \nThe kinematics of ionized gas show that the radial \nvelocity of this elongated feature is close to  zero {km s$^{-1}$}\\, but \nchanges by $\\sim$200 {km s$^{-1}$}\\, close to the  location of the discontinuity (Zhao {\\it et al.}\\, 2009). \n\n\n\n\n\n\n\n\\subsubsection{The Minicavity and the  Bar}\n\nThe bar of ionized gas lies a few arcseconds to the south of Sgr A* where the Eastern and Northern arms of \nSgr A West cross  each other. High spatial resolution images of the ionized bar \nshow a minicavity of ionized gas  with high velocity dispersion \n(Lacy {\\it et al.}\\,  1991; Roberts {\\it et al.}\\,  1996; Zhao {\\it et al.}\\,  2009).\nFigure 8b shows a larger area  of the Eastern arm and the minicavity at 34 GHz. \nThe mini-cavity and the Eastern  arm are distinct from the North arm. \nHigh resolution observations  have shown that the minicavity extends further to the SE (Zhao {\\it et al.} 1991). \nThe new images show that a gap separates the eastern and western halves of the minicavity and that \nthe   North and East arms are \ntwo distinct features associated with the eastern and western halves of the mini-cavity, respectively.   \nThe structure of the Eastern arm has  a wavy appearance \nwith a wavelength of  2$''-4''$ as its extends along the western half of the minicavity. \nFigure 9 shows a schematic diagram of  the   small and large-scale features \nrevealed in the inner 50{\\mbox{$^{\\prime\\prime}$}}\\ of \nSgr A*. \n\n\\subsubsection{A Bent Filament}\n\nFigures 10a,b   show the large-scale area  at 1.5 and 5.5 GHz, respectively. \n A striking filamentary structure is seen within a cavity of ionized gas \nto the north of Sgr A*.\nThis bent and narrow  filament  resembles  the nonthermal radio filaments seen throughout the Galactic center (e.g., \nYusef-Zadeh {\\it et al.}\\, 2004; Nord {\\it et al.}\\,  2004). \nThe southern end of this filament  is pointed toward Sgr A*. \nFigure 10c,d show details  of  the bent filament \nat 1.5 GHz at  two different resolutions indicating that the \nfilament may experience  another bend at $\\sim2''$ to the N of Sgr A*. \nBecause of the large angular size of Sgr A* \ninduced by  scatter broadening at 1.5 GHz, it is not clear if there is additional change in the position angle \nof the bent filament in the inner 1$''$ of Sgr A*.  \nFigure 10e shows grayscale contours of 8.9 GHz emission from the filament. \nThe surface brightness of the filament at 1.5 GHz is $\\sim3$  mJy beam$^{-1}$ as it bends to the NW (see Fig. 10). \nThe  length  of  this filament at 1.5 GHz is  $\\sim25''$.\nThe width of the filament is unresolved at  1.5 GHz but is partially resolved at roughly  0.3{\\mbox{$^{\\prime\\prime}$}}\\, at 8.9 GHz. \nThe cavity  in which  this bent filament lies, as best revealed in Figure 10c, \nis dark  and devoid of diffuse ionized gas at 1.5 GHz. This cavity has  a cone-shaped \nstructure  and the cometary supergiant star IRS 7 (Rieke and Rieke 1989; Yusef-Zadeh {\\it et al.}\\, 1989; \nSerabyn {\\it et al.}\\, 1991; \nYusef-Zadeh \\& Melia 1992) is seen  within the cone structure  at  5.5 GHz. \n\nThe bent filament lies in a region with varying background emission, thus accurate determination of \nthe spectral index  is not \npossible. Approximately accounting for the background flux, \nthe surface brightness is $\\sim$3--4 mJy beam$^{-1}$ at 5.5 and 1.5 GHz, \nimplying a flat spectrum between  these frequencies.  The sensitivity at  34 and 44 GHz \nis not sufficient to \ndetect the bent filament. The origin of the bent filament is unknown, though its morphology gives the best \njet-like appearance that may be originated within 1$''$ of Sgr A*. \n It is also possible that this filament is a member of the  \npopulation of  nonthermal radio filaments found in the Galactic center\nsuch as the  linear filaments found \nwithin the inner few arcminutes of Sgr A* where the Sgr A East SNR lies (Yusef-Zadeh {\\it et al.}\\, 2004; Nord {\\it et al.}\\, 2004). Future \nFuture high resolution\nmeasurements at low frequencies  including proper motion \nobservations are required to constrain the nature of this bent structure.\n \n\\section{Discussion}\n\nHere we discuss four  aspects of the new structures found near Sgr A*. First, we interpret the \narc-like sources in terms of \nrecent low-mass star formation activity within 2$''$ of Sgr A*. Second, we explain the origin of hot X-ray gas within the S \ncluster as arising from  colliding winds from mass-losing stars, either from  low-mass YSOs or \nyoung B   stars in the S cluster or both,  \nand estimate the accretion rate onto Sgr A*. \nThird, we argue that the cometary radio structures and the Sgr A East tower \nare signatures of an   interaction between  a collimated \noutflow from Sgr A* with a PA$\\sim50^\\circ-60^\\circ$ with  the stellar envelopes \nand ionized gas along the path  \nof the jet. The consequence of \nthis interaction infers  not only the mass loss rate from Sgr A* but also provides  a \nlower bound on  the accretion rate onto Sgr A*. Fourth, the\n ridge of  radio emission is interpreted as due \nto past flaring activity associated with Sgr A*.\n\n\n\\subsection{Proplyd Candidates  Near  Sgr A*?}\n\nThe nature of the radio sources within two arcseconds of Sgr A* is not clear. Two arc-like radio sources RS5 and \nRS6 resemble the bow-shock sources found at 34 GHz about $20''$ away from Sgr A* (Yusef-Zadeh {\\it et al.}\\, 2015c). As \ndisplayed in Figures 4b,c, RS5 and RS6 have near-IR counterparts. Although there is an early type star \nS1-22 that may be \nassociated with RS6,  RS5 is not  identified as a near-IR star in various catalogs (e.g., Lu {\\it et al.}\\, 2009, 2013).  \nThere is no evidence for a known young and massive star associated with RS5.\nRS5 has 3.8 and 2.18$\\mu$m counterparts \nsuggesting the the dust, traced by near-IR emission, and ionized gas, as traced at radio, \nare either intermixed, or else closely related through separate, \nas observed in \nphotodissociating regions (PDRs). Because of the strong radiation field that produces \nhigh temperature of the ionized gas, as traced by radio emission, dust grains \nmixed in with ionized gas would have been evaporated. Thus, RS5 resembles the population of bow-shock sources that \nhave recently been found 20$''$ from Sgr A* and are interpreted as candidate photoevaporative \nprotoplanetary disks \n(proplyds) associated with newly formed low-mass stars (Yusef-Zadeh {\\it et al.}\\, 2015c). The short expansion time scale and \nthe low density of ionized gas associated with the arc-like structures provide strong arguments in favor of \nprotoplanetary disks (Li \\& Loeb  2013; Yusef-Zadeh {\\it et al.}\\, 2015c).\n\nTo examine the protoplanetary disk scenario, we compared radio and near-IR flux from RS5 and another proplyd \ncandidate, the so-called P8 source (Fig. 2c in Yusef-Zadeh {\\it et al.}\\, 2015). P8 is among 44 proplyd\n candidates found within \n25$''$ of Sgr A*. Figures 11a,b show a horizontal slice that crosses RS5 and P8, respectively, at 35 GHz, \nand the L$'$ and K$_s$ near-IR bands. The arrows point to the location of proplyd candidates. The emission from RS5 in the three panels \nlies at pixel 25.29 with peak surface brightness  of 0.31 mJy beam$^{-1}$ (beam = 88$\\times45$ mas$^2$), 49 mJy pixel$^{-2}$ \n(pixel size = 27 mas) and 1.5 mJy pixel$^{-2}$ (pixel size = 27 mas) at 35 GHz, L$'$,  and K$_s$, respectively. \nSimilarly, the intensity profile of P8 is shown in Figure 11b with a low signal-to-noise emission at K$_s$ band. The \narc-like sources are likely photoionized externally by the UV radiation field from the \n$\\sim100$ OB and WR stars that lie \nwithin 10$''$ of Sgr A*. We suggest that RS5 and P8 are proplyd candidates that are \nexternally photoionized by strong \nsources of UV radiation. \n\nAssuming that radio emission traces the ionization front of proplyd candidates, we use the \nflux at L$'$ and K$_s$ to determine the temperature of dust emission from the outer surface of a \nhot disk.\nWe use the measured fluxes at K$_s$ and L$'$ bands to check  \nthat the emission is consistent with a protoplanetary disk irradiated by the intense radiation field in the inner Galaxy. \nThe flux at frequency $\\nu$ is given by \n\n", "index": 1, "text": "\\begin{equation} \nS_\\nu = B_\\nu(T_d)(1-e^{-\\tau_\\nu})\\, \\Omega \\label{eqn:IR-flux} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"S_{\\nu}=B_{\\nu}(T_{d})(1-e^{-\\tau_{\\nu}})\\,\\Omega\" display=\"block\"><mrow><msub><mi>S</mi><mi>ν</mi></msub><mo>=</mo><mrow><msub><mi>B</mi><mi>ν</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>T</mi><mi>d</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msup><mi>e</mi><mrow><mo>-</mo><msub><mi>τ</mi><mi>ν</mi></msub></mrow></msup></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow></math>", "type": "latex"}]