[{"file": "1601.07910.tex", "nexttext": "\nwhere the integral is over the unit cell and  $\\Omega_z^n(k)$ is the $z$\ncomponent of the Berry curvature: \n$ \\Omega^n(\\mathbf{k})= \\nabla_k\\wedge A_n(\\mathbf{k})$  defined from the\nBerry connection:\n${\\cal A}_n({\\bf k})=\\left<u_n({\\bf k})\\vert -i\\nabla_{{\\bf k}}\\vert u_n({\\bf k})\\right>$.\nThe non trivial topology of metallic states (anomalous Hall systems) is associated to a finite, non quantized Hall conductivity that can be computed using a Kubo formula.\nThe main technical difficulty in addressing disordered systems is the breakdown of translational symmetry which prevents working directly in momentum space. The subject being very old, many numerical and analytical tools have been worked out to deal with this oddity. Topological systems share the same problem as most topological indices are naturally defined in k space. We have used a numerical recipe based on the Kubo formula a to compute the Hall conductivity in the disordered tight binding model similar to that described in \\cite{CB01}.\n\nThe localization behavior of the system has been explored with standard tools: Level spacing statistics, and inverse participation ratio (IPR) \\cite{EM08}. A  transfer matrix method \\cite{Abrahams10} has been also used to compute the localization length and confirm the presence of a mobility edge.  \n\n\n\n\\section{Warming up: Disorder equally distributed in both sublattices}\n\\label{sec_even} \n\nWe first present the case of Anderson disorder equally distributed in the two sublattices which shows the standard behavior of class A systems: extended states carrying the topological index remain at singular energies, approach each other as disorder increases (levitation) and merge (annihilation of the topological index). \nFigure \\ref{Fig_equal} shows\nthe spectrum for the Haldane model with Anderson disorder\nequally distributed over the two sublattices for a disorder strength W = 3t.\nThe dots correspond to a given eigenenergy for a given\ndisorder realization in a finite lattice with size d = 30. We\nhave performed 1000 disorder realizations. Superimposed\nto the spectrum we show the level spacing variance as a\nfunction of energy. The variance of the level spacing variation\ncontains information on the localization of the states at a given energy region\n(details can be found in the supporting information).\nGaussian Unitary Ensemble (GUE) and Poisson (P) ensemble statistics are associated to extended  and localized states \nrespectively. \nIt is clear that there are two extended\nstates, one below the gap and another one above,\nwhere the variance clearly approaches the GUE variance 0.178. \n\nThese results\nare in perfect agreement with those presented in Ref. \\cite{Prodan11}.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=0.7\\columnwidth]{Fig1}\n\\par\\end{centering}\n\\caption{\\label{Fig_equal} Level statistics analysis for the Haldane model with\nAnderson disorder W= 3t equally distributed over the two sublattices. States are localized (Poisson distribution) all along the energy range. Extended states (GUE) are found at the two singular energies marked in the figure (green lines). This result agrees with the analysis done in Ref. \\cite{Prodan11}. }\n\\end{figure}\n\nIn Fig. \\ref{Fig_equal2} we show the level statistics variance and the\nDOS for three different disorder strengths: $W = 4t, 5t, 6t$.\nLevitation and annihilation is clearly operative, and the\ncritical disorder for localization is in good agreement with that obtained in ref. \\cite{CLV15}\nfor the topological transition, $4t < W_c < 5t$.\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=0.9\\columnwidth]{Equal2}\n\\par\\end{centering}\n\\caption{\\label{Fig_equal2} Localization transition studied through level statistics\nfor the Haldane model with Anderson disorder equally\ndistributed over the two sublattices. The horizontal green line marks the GUE variance. The two extended states present at W=3t merge around W=5t and annihilate as disorder increases. All states become localized for $W>W_c\\sim5t$. }\n\\end{figure}\n\n\n\n\n\n\\section{Main results}\n\\label{sec_results}\n\n\\subsection{Disorder selectively distributed in only one sublattice: Topological model}\n\\label{sec_selectivetopo}\n\nThe first unexpected result obtained is that, for selectively distributed disorder in only one sublattice, the class A system ends up in a robust metallic state where the extended states are separated from the localized states at the band edges by a well defined mobility edge.  \n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=0.7\\columnwidth]{Fig2}\n\\par\\end{centering}\n\\caption{\\label{Fig_selective} Level statistics analysis for the Haldane model with\nAnderson disorder selectively distributed over one sublattice. The red dotted horizontal line marks the variance of the GUE associated to the presence of extended states. \nAs disorder increases, the singular energies where extended states were located\nat moderate disorder strength $W/t=20-30$, evolve to a full extended region of delocalized\nstates with a well defined mobility edge.}\n\\end{figure}\n\nFigure \\ref{Fig_selective} shows a level spacing statistic analysis of the\nsystem for increasing disorder strength. What we see in the figure is the statistics associated to two characteristic energies in the  spectrum: one at the edge (blue line)\nwhere states start to localize first when disorder is introduced, and one at the middle\nof the band (green line) where extended states are expected to persist up to higher\ndisorder strength. The red dotted horizontal line marks the variance of the\nGUE associated to the presence of extended states. \nWe see that, as disorder increases, the singular energies where extended states were located\nat moderate disorder strength $W/t=20-30$, evolve to a full extended region of delocalized\nstates with a well defined mobility edge.  Fig. \\ref{selective2}\nshows that the extended region of delocalized states is a robust feature that persists up\nto a disorder strength of W=200t.\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=0.7\\columnwidth]{Fig3}\n\\par\\end{centering}\n\\caption{\\label{selective2} Level spacing variation for increasing disorder \nstrengths W/t in the selectively distributed disorder case.  \nThe middle region has the same variance as that of\nGUE and corresponds to extended states. Even\nthough the transition is becoming sharper, the\nregion is not shrinking. This is a clear evidence for the existence of an\nextended region of delocalized states. A mobility edge in the center of the band has emerged \nfrom the singular, isolated energies by increasing disorder.}\n\\end{figure}\nWe have also set up a calculation of the localization length via a transfer matrix method  to confirm the presence of the mobility edge.\n\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1.0\\columnwidth]{HallC}\n\\par\\end{centering}\n\\caption{\\label{HallC}Hall conductivity of the resulting metallic state emerging from the Chern insulator for disorder strengths above the critical value for the topological transition. \n The conductivity is not quantized and depends on the chemical potential. Despite the big numerical error bars a finite non-zero value can be granted.}\n\\end{figure}\n\nThe topological nature of the metallic state is reflected in the calculation of the Hall conductivity shown in Fig. \\ref{HallC}. \nIn our previous publication \\cite{CLV15} we showed that \nthe Chern insulator suffered a topological transition to a trivial state at a critical disorder strength around $W_c\\sim 50t$. What we see here is the further evolution to an anomalous Hall metal when disorder is further increased and the metallic state is well established. \nThe panels in Fig. \\ref{HallC} show that the Hall conductivity stays finite in\nthe metallic region for $W > W_c$. The different curves correspond to different sizes of the system. We see that for \nincreasing system sizes $\\sigma_{xy}$ is not decreasing what proofs that we are not dealing with a  finite size effect. Despite the large numerical error bars (bigger for smaller sizes), a finite conductivity can be granted.\n\n\\subsection{Disorder selectively distributed in only one sublattice: Topologically trivial case}\n\\label{sec_selectivetopo}\n\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1.0\\columnwidth]{TrivialVariance}\n\\par\\end{centering}\n\\caption{\\label{Fig:TrivialVariance}Level spacing variation for the disordered trivial insulator in the selectively distributed disorder case. The results are very similar to these in the topological case in Fig. \\ref{selective2}. }\n\\end{figure}\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=1.0\\columnwidth]{Hall_trivial}\n\\par\\end{centering}\n\\caption{\\label{Hall_trivial}A comparison of the Hall conductivity of the resulting metallic state emerging from the topological (left hand side) and trivial insulator (right and side). A finite Hall conductivity is obtained in both cases.}\n\\end{figure}\n\nThe second unexpected result is obtained when analyzing the trivial case. As it was mentioned when\ndescribing the Haldane model, the parameters can be tuned to describe a trivial insulator for values of the staggered potential $\\vert M\\vert > 3\\sqrt{3} t_2\\sin\\phi$. In order to ascertain the possible role of topology in the development of the metallic phase, we have analyzed the localization behavior of the trivial case with  generic values of the parameters chosen so that {\\cal T} is still broken but the original insulator has a trivial gap with \nzero Chern number. The localization properties are shown in fig. \\ref{Fig:TrivialVariance}. The final state is metallic with a well defined mobility edge. The topological nature of the final state is reflected in  the Hall conductivity  shown in  Fig. \\ref{Hall_trivial}. \nWe compare the topological $M = 0$ case  with the trivial $\\vert M\\vert > 3\\sqrt{3} t_2\\sin\\phi$ for $t_2/t=0.1 e^{i\\pi/2}$.\nWe have used larger system sizes,\nand higher number of disorder realizations; 105, 105, 104,\nand 5000 disorder realizations, respectively for d = 6,\n12, 18, and 22. Note that $\\sigma_{xy}$ \nis finite only in the\nenergy region where states have a larger amplitude in\nthe non-disorder sublattice. These findings agree well\nwith the results for the level spacing variance discussed\nabove.\n\n\n\n\n\n\n\n\\section{Understanding what is going on: Side questions.}\n\\label{sec_understanding}\nThis work rises a number of additional questions. We have addressed some of them, others remain open. \n\nFor simplicity, a purely imaginary value of  the $t_2$ parameter $t_2=i 0.1 t$ has been used through the work ($\\phi=\\pi/2$). This choice induces an accidental particle--hole symmetry to the system that technically belongs to class D. We have performed some additional calculations with a non--zero real part for $t_2$ to ensure that we are discussing class A physics and found no qualitative differences. It could be thought that, since disorder affects only one sublattice, the final metallic state coincides with the trivial metal of the triangular lattice. The result of the Hall conductivity makes obvious that this is not so. We have performed some calculations of partial IPR and saw that the wave function of extended states has always some weight in the disordered sublattice. It is interesting to note that this is so also in the case of vacancy disorder when the disordered sublattice is depleted.  \n\n\n\nIrrespective of the topological character of the clean system, the final state in the class A analyzed is a {\\cal T} broken disordered metal with finite Hall conductivity. Our results show that, while a topological insulator can be become trivial by an appropriate tuning of the parameters as happens in the Haldane model,  the anomalous Hall metal is a very robust and a stable phase for  {\\cal T} broken metals in the absence of an external magnetic field.  \n\n\nAs we mentioned above, even when for the highest values of disorder, the disordered sublattice is never decoupled from the ordered one. The physics that we observe all along the work is that of the disordered Honeycomb lattice, as proven by the fact that the extended states found in the extreme disorder case have a non zero weight in the disordered sublattice. Even though the weight in the disordered sublattice is orders of magnitude smaller than in the clean sublattice, the two sublattices do not ``decouple\". This explains the metallic nature of the final state: An electron in the disordered sublattice can propagate to a very long distant site by hopping to the clean sublattice, propagate there, and hop back. The probability of the process is suppressed to be of order $\\alpha t^2$  but it is never zero. This also explains why the final metallic state is a topological metal since the anomalous Hall effect is due to the\ninterband matrix elements of the current operators \\cite{KL54}. \n\n   \nThe different behavior of  IQHE and anomalous Hall metals under disorder has been examined  in refs. \\cite{ON02,ON03}.  The properties of  disordered topological metals arising from clean topological insulators have been analyzed in ref. \\onlinecite{MR13}.\nThe metallicity of the final state  seems to be at odds with the non-linear\nsigma model results \\cite{EM08,MFM15} so it would be very interesting to implement the selective disorder case in this approach.\n\nThe physics described in this work can be realized in topological materials based on other more complicated partite lattices \\cite{XLZ15}. The results presented in this work are conceptually important, although we recognize that to implement the selectively distributed disorder might be a hard task. To this respect, we note that experiments have been done in graphene where defects are located selectively in one sublattice to check the magnetic properties of the system \\cite{UBetal10}. Artificial \\cite{GMetal12} or optical lattices \\cite{JMetal14} are other possibilities to realize this physics. \n \n\\begin{acknowledgments}\nWe gratefully acknowledge useful conversations with Alberto Cortijo, Bel\\'en Valenzuela, Fernando de Juan, Adolfo G. Grushin,  and J. A. Verg\\'es. \nEC acknowledges the financial support of FCT-Portugal through grant No. EXPL/FIS-NAN/1728/2013. This research was supported in part by the Spanish MECD grants FIS2014-57432-P, the  European Union structural funds and the Comunidad de Madrid MAD2D-CM Program (S2013/MIT-3007),   the European Union Seventh Framework Programme under grant agreement no. 604391 Graphene Flagship FPA2012-32828.\n\\end{acknowledgments}\n\n\\bibliography{Chern2}\n\n", "itemtype": "equation", "pos": 9148, "prevtext": "\n\n\\bibliographystyle{naturemag}\n\n\n\\title{Anomalous Hall metals from strong disorder in class A systems on partite lattices}\n\n\\author{ Eduardo V. Castro}\n\\email{eduardo.castro@tecnico.ulisboa.pt}\n\\affiliation{CeFEMA, Instituto Superior T\\'{e}cnico, Universidade de \nLisboa, Av. Rovisco Pais, 1049-001 Lisboa, Portugal}\n\\affiliation{Beijing Computational Science Research Center, Beijing 100084, China }\n\n\\author{ Raphael de Gail}\n\\affiliation{Instituto de Ciencia de Materiales de Madrid, CSIC,\nSor Juana In\\'es de la Cruz 3,  Cantoblanco,\nE-28049 Madrid, Spain}\n\n\\author{M. Pilar L\\'opez-Sancho}\n\\affiliation{Instituto de Ciencia de Materiales de Madrid, CSIC,\nSor Juana In\\'es de la Cruz 3,  Cantoblanco,\nE-28049 Madrid, Spain}\n\n\\author{Mar\\'{\\i}a A. H. Vozmediano}\n\\affiliation{Instituto de Ciencia de Materiales de Madrid, CSIC,\nSor Juana In\\'es de la Cruz 3,  Cantoblanco,\nE-28049 Madrid, Spain}\n\n\\date{\\today}\n\n\\maketitle\n\n{\\bf Topological matter is a trending topic in condensed matter: From a fundamental point of view it has introduced new phenomena and tools, and for technological applications, it holds the promise of basic stable quantum computing. Similarly, the physics of localization by disorder, an old paradigm  of obvious technological importance in the field, continues revealing surprises when new properties of matter appear. This work deals with the localization behavior of electronic systems based on partite lattices with special attention to the role of topology. We find an unexpected result from the point of view of localization properties: A robust topological metallic state characterized by a non--quantized Hall conductivity arises from strong disorder  in class A (time reversal symmetry broken) insulators. The key issue is the nature of the disorder realization: selective disorder in only one sublattice in systems based on bipartite lattices. The generality of the result is based on the partite nature of most recent 2D materials as graphene or transition metal dichalcogenides, and the possibility of the physical realization of the particular disorder demonstrated in \\cite{UBetal10}. An anomalous Hall metal arises also when the original  clean insulator is topologically trivial.} \n\n\\section{Introduction}\n\\label{sec_intro}\n\nAfter the seminal work of P. Anderson \\cite{Anderson58} it was understood that in a non-interacting two dimensional electron system at zero temperature in spacial dimension $D\\leq 2$ and in the thermodynamic limit, the electronic wave function will be localized by disorder. In more realistic situations the scaling theory of localization allowed a classification of the localization behavior of materials into universality classes set by symmetry and space dimensionality  \\cite{AALR79,ATAF80} based on the Altland-Zirnbauer sets of random matrices  \\cite{AZ97}. The advent of topological insulators \\cite{BHZ06,HK10,QZ11} provided a new class of delocalized states, the edge states, robust under disorder provided some discrete symmetries were preserved. The symmetry classes were then adapted to include the topological features and a ``tenfold way\" classification  was set \\cite{SRFL08,EM08}. \n\nCentering the attention on the three non--chiral symmetry classes of the original Wigner--Dyson classification in two dimensions, we expect the following situation: \nAll states will be localized in the orthogonal class AI (time reversal symmetry ${\\cal T}$ with ${\\cal T}^2=1$ preserved);  a mobility edge \\cite{LR85}, i.e., a well defined energy separating a region of extended states from the localized states, is expected in the symplectic class AII (time reversal symmetry with ${\\cal T}^2=-1$ preserved). Finally, in the unitary class A (${\\cal T}$ broken), extended states can remain at particular energies. Only classes A and AII support topological indices. The prototypical examples in classe A are systems showing the integer quantum Hall effect (IQHE) and anomalous quantum Hall systems, the later exemplified by the Haldane model \\cite{H88}.  Spin Hall systems \\cite{KM05,KM05b} belong to class AII.\n\nThe interplay of topology and localization was first analyzed in the context of the robustness under disorder of the Hall conductivity quantization in the IQHE\\cite{Pruisken88,Pru88,CC88,Letal94}. This is an example of a Chern insulator that belongs to  symmetry class A (all discrete symmetries are broken) in the standard classification. The mechanism for localization in both topological classes A, and AII, is  referred to as ``levitation and annihilation\" \\cite{OAN07}. For moderate disorder, the states in the edges of the conduction and valence bands  start to localize. As disorder increases, the gap is totally populated by localized states and the extended states carrying the Chern number shift towards one another and annihilate leading to the topological phase transition. The difference between the two classes is that, while in the symplectic class AII, a finite region of extended states with a well defined mobility edge  remains until the transition takes place,  there is no mobility edge in the unitary class A systems. The extended states carrying the Chern number are located at particular single energies.\n\nWe use the Haldane model \\cite{H88} as a typical example of class A system based on a bipartite lattice. As it is known, depending on the parameter values, the model can represent a Chern or a trivial insulator.  The main result of this work is the finding of an extended region of delocalized states with a well defined mobility edge for strong disorder in class A systems when disorder is selectively distributed in only one sublattice. Why this is surprising is because there is no mobility edge in this class. Hence our result implies that the standard classification has to be modified. Moreover the final metallic state is an anomalous Hall metal even in the case when the clean starting system is a topologically trivial insulator.\n\nIn addition to its fundamental interest, the physics of this work can be realized in actual material systems. Many of the 2D materials relevant for technological or fundamental physics are based on bipartite lattices. Most prominent examples like  graphene  and its siblings silicene, germanene, or stanene;   black phosphorus, boron nitride, or  transition metal dichalcogenides MX$_2$ (M$=$ Mo, W and X$=$ S, Se) are based on the Honeycomb lattice \\cite{Gibney15}.  The experimental possibility of inducing disorder selectively in one sublattice only, has been proven in \\cite{UBetal10}.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\\section{Model and methods}\n\\label{sec_model}\n\n\\begin{figure}\n\\begin{centering}\n\\includegraphics[width=0.7\\columnwidth]{Hal}\n\\par\n\\end{centering}\n\\caption{\\label{Fig_Hal}Phase diagram of the Haldane model as a function of the parameters\nM and $\\phi$ with $\\vert t_2/t_1\\vert <1/3$. The condition $\\vert M\\vert =3\\sqrt{3} t_2\\sin\\phi$ sets the boundary between a trivial  (Chern number $\\nu$=0 ) and a topological insulator $\\nu=\\pm 1$. }\n\\end{figure}\n\nWe use the Haldane model \\cite{H88} as a generic example of a Chern topological insulator. \nThe Haldane model tight binding Hamiltonian can be written as \n\n\n\\begin{eqnarray}\nH  &=  -t\\displaystyle\\sum_{<ij>}c_i^{\\dagger}c_j+\n-t_2\\sum_{<<ij>>}e^{-i\\phi_{ij}}c_i^{\\dagger}c_j\\\\ \\nonumber\n&+  M\\displaystyle\\sum_i \\eta_i c_i^{\\dagger}c_i +\\mbox{H.c.},\n\\label{TBHmodel}\n\\end{eqnarray}\n\nwhere $c_i=A,B$ are defined in the two triangular sublattices that form the honeycomb lattice. \nThe first term $t$ represents a standard\nreal nearest neighbor hopping that links the two triangular sublattices.\nThe next term represents a complex next nearest neighbor hopping $t_2 e^{-i\\phi_{ij}}$\nacting within each triangular sublattice with a \nphase  $\\phi_{ij}$ that has\nopposite signs $\\phi_{ij}=\\pm\\phi$ in the two sublattices.\nThis term breaks time--reversal symmetry and opens a non--trivial topological gap\nat the Dirac points. \nThe last term represents a staggered potential($\\eta_i=\\pm 1$). It breaks \ninversion symmetry and opens a trivial gap at the Dirac points. The topological transition occurs at $\\vert M\\vert =3\\sqrt{3} t'\\sin\\phi$ as indicated in Fig. \\ref{Fig_Hal}.\nWe have done our calculations for the simplest case $\\phi=\\pi/2$ and a typical value $t_2$=0.1t. M has been set to zero except when analyzing the topologically trivial case.\nA physical realization of the model with optical lattices has been presented in \n\\cite{JMetal14}(see also \\cite{W13}).\n \nPotential (Anderson) disorder is implemented by adding to the Hamiltonian the term $\\sum_{i\\in A,B}\\varepsilon_{i}c_{i}^{\\dagger}c_{i}$,\nwith a uniform distribution of random local energies, $\\varepsilon_{i}\\in[-W/2,W/2]$. We will discuss two cases: disorder equally or selectively\ndistributed among the two sublattices.  For selective disorder the sum runs only over one sublattice. \n\nThe Haldane model belongs to symmetry class~A  where the different topological\nphases can be characterized by a $\\mathbb{Z}$--topological number,\nthe Chern number $\\nu$.\nIn the clean insulating system it can be computed from the single particle Bloch states $u_n({\\bf k})$ as:\n\n", "index": 1, "text": "\\begin{equation}\n\\nu_n=\\frac{1}{2\\pi}\\int_S\\Omega_z^n(k) dS,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\nu_{n}=\\frac{1}{2\\pi}\\int_{S}\\Omega_{z}^{n}(k)dS,\" display=\"block\"><mrow><mrow><msub><mi>ν</mi><mi>n</mi></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>S</mi></msub><mrow><msubsup><mi mathvariant=\"normal\">Ω</mi><mi>z</mi><mi>n</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>S</mi></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]