[{"file": "1601.06237.tex", "nexttext": "\n\nwhere the subscripts $c$ and $a$ denote the cathode and anode respectively. Measured at location $x$, $N_x$ and $\\sigma_x$ are the number of electrons and the signal width respectively, as determined from the Novosibrisk fit. $F$ is the excess noise factor. Typically, the excess noise factor is larger for fine mesh PMTs than standard PMTs. Recognizing the Poisson nature of the photoelectrons and that the measured width at the anode contains contributions from both the constant electronic noise and the excess noise factor, Equation \\ref{eqnF} can be written as: \n\n\n", "itemtype": "equation", "pos": 7173, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\\title{Characterization of the Aging and Excess Noise of a Hamamatsu Fine Mesh Photopentode}\n\n\n\\author{D. Fujimoto\\corref{cor1}}\n\\ead{fujimoto@phas.ubc.ca}\n\n\\author{C. Hearty}\n\\ead{hearty@physics.ubc.ca}\n\n\\cortext[cor1]{Corresponding author.}\n\\address{University of British Columbia, 6224 Agricultural Road, Vancouver, BC, V6T 1Z1, Canada}\n\n\n\\begin{abstract}\nThe excess noise factor and the aging characteristics of 16 Hamamatsu R11283 photopentodes have been tested. These fine-mesh phototubes are to be paired with pure CsI scintillation crystals considered for use in the endcap calorimeter of the Belle~II detector. The average excess noise factor was found to be $1.9\\pm0.1\\pm0.4$. The electronic noise of a custom preamplifier produced by the University of Montreal~\\cite{preamp} was found as a consequence of this measurement and was $1730\\pm33$ electrons, in agreement with previous values.  On average, the gain~$\\times $~quantum efficiency was reduced to $93\\pm3$~\\% of the initial value after passing $7$~C through the anode. This corresponds to 70 years of standard Belle~II operation.\n\\end{abstract}\n\n\n\\begin{keyword}\nHamamatsu \\sep Photomultiplier \\sep Mesh \\sep CsI \\sep Belle~II \\sep Aging\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\\section{Introduction}\n\nOne of the upgrade considerations for the Belle~II detector, situated at KEK in Tskuba, Japan, is to replace the current thallium-doped cesium iodide (CsI(Tl)) scintillation crystals in the endcap electromagnetic calorimeter (ECL) with pure CsI~\\cite{belle2Tech}. One of the primary goals of this exchange is to reduce pileup due to the increased luminosity of the SuperKEKB accelerator. While pure CsI has a shorter scintillation time constant, it also has a reduced light yield, with the emission spectrum peaking in the UV range rather than in the visible range~\\cite{csiPure,csiDoped}. Therefore, the new crystals will need new photosensors. One option for the new photosensor is the R11283 photomultiplier tube (PMT), developed by Hamamatsu Photonics for this project. This model has five flying leads and for this reason is often referred to as a photopentode. This PMT is a head-on type with three fine mesh dynodes, UV transparent window, and a bialkali photocathode. The photocathode has a minimum effective diameter of $39$~mm, and a wavelength of maximum response of $420$~nm~\\cite{R11283Tech}. Pure CsI has an emission maximum at $315$~nm. The PMT can be seen in Fig.~\\ref{PP_CsI_preamp}. \n\n\n\\begin{figure}[t]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=9cm]{PP_CsI_preamp2.pdf}\n    \\caption{R11283 PMT with version 4 preamp produced by the University of Montreal~\\protect\\cite{preamp} and glued pure CsI puck (AMCRYS) for the aging study. The preamp functions and output are powered and transmitted by a mini-display port cable, whereas the voltage divider has a SHV cable soldered to it. }\n    \\label{PP_CsI_preamp}\n\\end{figure}\n\nMagnetic fields decrease the performance due to changes in the electron path. These fine mesh PMTs will operate in the 1.5~T Belle~II magnetic field, reducing the nominal gain by a factor of 3.5~\\cite{Kuzmin_ECL}. The average nominal gain of the 16 PMTs at an operating voltage of $-1000$~V was $255\\pm11$. As summarized in Table \\ref{hamaTbl}, Hamamatsu provides a variety of measurements at $-750$~V with purchase. \n\n\n\\begin{table}[ht]\n\\centering\n\\caption[Hamamatsu Measured Quantities]{Average Hamamatsu quantities which were measured at $-750$~V and the PMT internal gain at $-750$~V and $-1000$~V operating voltage for a population of 16 PMTs.}\n\\begin{tabular}{lll}\n\\hline\nQuantity & Average & Range \\\\ \\hline\nAnode Luminous Sensitivity ($\\mu$A/lm)\t\t& $14000\\pm1000$ \t\t& $[8750.0,26100.0]$\\\\\nCathode Luminous Sensitivity ($\\mu$A/lm) \t& $83\\pm3$\t\t \t\t& $[69.3,106.0]$\\\\\nCathode Blue Sensitivity Index\t\t\t\t& $9.4\\pm0.1$\t\t\t& $[8.70,10.10]$\\\\\nDark Current (nA) \t\t\t\t\t\t\t& $0.011\\pm0.007$\t\t& $[0.00,0.03]$\\\\\nGain at $-750$~V (Hamamatsu)\t\t\t\t& $170\\pm7$\t\t\t\t& $[125,276]$\\\\\nGain at $-1000$~V (max)     \t\t\t\t& $255\\pm11$\t\t\t& $[183,367]$\\\\\\hline\n\\end{tabular}\n\\label{hamaTbl}\n\\end{table}\n\nThe PMT readout electronics were designed and produced by the University of Montreal~\\cite{preamp} and consists of a preamp (version 4) and a shaper for every PMT. The shaper has a shaping time of 50~ns and for a step-function input, the signal produced has a peaking time of $200$~ns. The combination of the two components produces a signal whose amplitude is proportional to the charge at the anode (Fig.~\\ref{screenshot}). The board connected directly to the PMT (Fig.~\\ref{PP_CsI_preamp}) houses both the voltage divider to power the PMT dynodes, and the preamp electronics. The shapers house and are powered by a motherboard which also provides the correct voltages to the preamps electronics. \n\n\n\\begin{figure}[t]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=9cm,trim= 1cm 0cm 1cm 5cm, clip=true]{run463_single.pdf}\n   \\caption{Typical waveform produced by the University of Montreal shaper from a signal produced in pure CsI. The signal has a slightly longer peaking time due to the time constant of the scintillation material.}\n    \\label{screenshot}\n\\end{figure}\n\n\n\\section{Methods}\nThe shaper output was fed into a peak-sensing ADC (LeCroy L2259B) and the output histogrammed using the MIDAS program~\\cite{MIDAS}. The histogram was then fitted with the sum of an exponential and a Novosibirsk function. The exponential roughly describes the background, which was primarily due to backscatter. The Novosibirsk function is an asymmetric Gaussian-like function with four parameters: height, peak location, width, and an asymmetry parameter~\\cite{novosibirsk}. Figure~\\ref{novoFit} shows an example of fitting this sum to the spectrum produced by the $662$~KeV decay of $^{137}$Cs.\n\n\n\\begin{figure}[ht]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=9cm,trim= 0cm 0cm 0cm 0cm, clip=true]{cs137Fit_edit.pdf}\n   \\caption{Histogram of peak-sensing ADC output with Novosibirsk fit for the spectrum produced by gammas from a $^{137}$Cs source. }\n    \\label{novoFit}\n\\end{figure}\n\nThe response of the system to energy deposits in pure CsI is linear. Using several calibration sources, the value of the peak location at zero energy deposited was extrapolated and attributed to a DC offset in the peak-sensing ADC. This pedestal was then subtracted from the measurements prior to any further manipulation. The charge at the anode is proportional to the peak location, and the uncertainty to the width of this distribution. To calibrate the charge at the anode, the calibration test pulse feature of the preamp was used. This allows for a known amount of charge to be injected into the preamp, which is then processed as every other signal. From this calibration, the relationship between the ADC binning and the charge at the anode was found. \n\n\n\\section{Excess Noise Factor}\nThe excess noise factor is a common index for estimating the performance of photosensors~\\cite{hamamatsuHandbook}. This factor describes the uncertainty introduced into the system as a result of the electron multiplication process: \n\n\n", "index": 1, "text": "\\begin{equation}\n\\left(\\frac{\\sigma_a}{N_a}\\right)^2 = F \\cdot \\left(\\frac{\\sigma_c}{N_c}\\right)^2,  \\label{eqnF}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\left(\\frac{\\sigma_{a}}{N_{a}}\\right)^{2}=F\\cdot\\left(\\frac{\\sigma_{c}}{N_{c}}%&#10;\\right)^{2},\" display=\"block\"><mrow><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>σ</mi><mi>a</mi></msub><msub><mi>N</mi><mi>a</mi></msub></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>=</mo><mrow><mi>F</mi><mo>⋅</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>σ</mi><mi>c</mi></msub><msub><mi>N</mi><mi>c</mi></msub></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06237.tex", "nexttext": "\n\nwhere the internal PMT gain has been applied to put all relevant quantities in units of number of electrons at the photocathode (photoelectrons). Here, $\\sigma_m$ is the measured width at the anode and $\\sigma_o$ is the contribution of the electronic noise. From this the excess noise factor can be easily found by varying the light intensity ($N_c$) and measuring the resulting distribution width ($\\sigma_m$).\n\n\n\\begin{figure}[ht]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=9cm,trim= 2cm 4cm 3cm 3cm, clip=true]{setupDiagram.pdf}\n   \\caption{Setup for the excess noise measurement. A UV laser was reflected off of a screen to provide uniform incident light of controlled intensity.}\n    \\label{Fsetup}\n\\end{figure}\n\nTo this end, a UV laser was used to illuminate the PMT (Fig.~\\ref{Fsetup}). The laser was first reflected off of a diffusive white screen to provide uniform light. The light intensity was controlled via the laser voltage and the screen-to-PMT distance. Using a single preamp, the excess noise factor was found for all 16 PMTs.\n\n\n\\begin{figure}[ht]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=9cm,trim= 0cm 0cm 0cm 1cm, clip=true]{calc_npe2_PP07.pdf}\n   \\caption{The excess noise factor is given by the slope of the fitted linear line as seen in Equation~\\ref{eqnF_lin}. The intercept gives the electronic noise in units of number of photoelectrons.}\n    \\label{Fanalysis}\n\\end{figure}\n\nFigure~\\ref{Fanalysis} shows the results of this analysis for one of the PMTs. The slope is the excess noise factor, and the intercept is the electronic noise in units of photoelectrons. The operating voltage for these measurements was $-1000~$V. On average, the excess noise factor was found to be $1.9\\pm0.1\\pm0.4$, and the average electronic noise was $1730\\pm33$ electrons at the anode, which is in good agreement with previous measurements~\\cite{preamp}. The systematic error in the excess noise factor was dominated by the specifications on the capacitor used in the test pulse calibration. Over the 16 PMTs tested, the range of the excess noise factors was $1.8$~--~$2.1$, whereas the range of the electronic noise was $1526$~--~$1913$ electrons at the anode. Assuming that the light yield of the CsI crystal is $85$ photoelectrons per MeV deposited~\\cite{csiYield}, this electronic noise corresponds to an equivalent noise energy of about $80$~keV.\n\nTo estimate the impact of magnetic fields on the excess noise, the PMT gain was reduced by lowering the operating voltage. Above a gain of 55, the PMT was seen to have a constant excess noise factor. Below this, the excess noise factor increases non-linearly with decreasing gain, rising to $3.5\\pm0.1\\pm0.4$ at a gain of 25. In comparison, two avalanche photodiodes (APD) from the Hamamatsu S8664 series have been measured to have an excess noise factors of 3.4 and 5.1~\\cite{APD15}. These APDs are also being studied for pure CsI application as a competing option for the Belle~II endcap ECL upgrade. \n\n\n\\section{Aging}\n\nOf importance to the Belle~II experiment is the effects of aging of the PMT. Given that the Belle~II endcap ECL will be in a magnetic field of approximately $1.5$~T, it is expected that the gain of the PMTs will drop by about a third~\\cite{Kuzmin_ECL}. To simulate this, the aging process was performed with the operating voltage of the PMTs set to $-491$~V, reducing the average gain to $85\\pm3$ or one third of the nominal gain at $-1000~$V. \n\nThe performance of the PMT was characterized by the gain$\\times$quantum efficiency, which was monitored as a function of the charge collected at the anode. The gain$\\times$quantum efficiency was found from the slope of the peak ADC bin as a function of the energy deposited in the CsI. The change in the gain$\\times$quantum efficiency relative to the initial value was monitored as a function of the charge passed through the anode, and also as a function of the real lab time elapsed. Light from a UV LED (335~nm) was used to age the PMTs, which were arrayed in a 4$\\times$4 array (Fig.~\\ref{AgingSetup}). The PMTs were encased in an incubator with a UV transparent acrylic window which maintained the temperature at $37\\pm2~^\\circ$C. The relative humidity was maintained at $15$~--~$20$~\\% by means of a desiccant and a slow influx of N$_2$ flow into the incubator. One of the 16 PMTs was capped with black rubber to prevent aging and act as a control. This PMT was also used to correct for the residual variation in temperature. The relative peak location response with temperature was roughly linear and varied at a rate of $-1.2\\pm0.2~\\%/^\\circ$C. Probably due to the poor thermal contact between dynodes and the environment exterior to the PMT, there is about a $8$~--~$10$ hour delay before the PMTs reached thermal equilibrium.\n\n\n\\begin{figure}[ht]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=10cm,trim= 1cm 1cm 1cm 1cm, clip=true]{lifetimeSetup.pdf}\n   \\caption{The experimental setup for the aging measurements. A 4$\\times$4 array of PMTs was encased in an incubator, with the temperature and humidity controlled. Aging was accelerated with a UV LED, and a $^{207}$Bi source was used to track the PMT performance. }\n    \\label{AgingSetup}\n\\end{figure}\n\nTo track the performance, a constant light source was produced by gluing pure CsI pucks to the faces of the PMTs (Fig.~\\ref{PP_CsI_preamp}) and triggering scintillation light with a $^{207}$Bi source. The glue used was TSE3032 silicone rubber produced by Momentive Performance Materials, which has an index of refraction of 1.406~\\cite{TSE3032}. In comparison, the index of refraction of pure CsI is 1.95 at the emission maximum~\\cite{csiPure}. The CsI cylindrical pucks were manufactured by AMCRYS and were approximately the same diameter as the photocathode. \n\nThe measurement of the current was enabled by a modified preamp from the University of Montreal. This preamp did not perform any of the signal processing of the regular preamps, but rather contained a resistor such that the current could be measured with a Keithley 6485 Picoammeter. Prior to aging, a current baseline was established for each PMT using constant incident light. Using the baseline, only one of the PMTs was needed to track the current through the anode and the current could be estimated for the other PMTs. \n\nThe $^{207}$Bi source was chosen for its two easily visible decays at $0.570$~MeV and $1.064~$MeV. Given the linear response of the PMT with energy, these two peaks were used to establish the gain$\\times$quantum efficiency, which can be seen as a function of the integrated current in Fig.~\\ref{gSvQ_All}. The PMT in the third column of the first row (PP03) is the control PMT and was not aged. Roughly $7$~C of charge was passed through the anode, corresponding to approximately 70 years of standard Belle~II operation~\\cite{radDose}. \n\nThere are a few different observed behaviours in the PMT aging. Some of the PMTs exhibited a burn-in period where the performance decreased rapidly during the first coulomb of charge, then appeared to stabilize. Some appeared to age continuously throughout, whereas others exhibited little to no aging or even experienced an improvement in the performance. The control PMT did not see any significant change in performance at the end of the aging process. \n\nAfter 48 days of aging, the LED was turned off and the stability monitored (Fig.~\\ref{gSvT_All}). Even after aging, some of the PMTs continued to see a decrease in performance. Of note, one of the 14 aged PMTs (PP02) saw nearly 10~\\% decrease in performance within a week. This degradation is worrying as it is rapid enough to be difficult to track via a physics-based calibration system. The control PMT did not observe any significant change in performance after the end of the aging process. \n\nOn average, the PMT performance was reduced to $93\\pm3$~\\% of the initial value prior to aging. \n\n\n\\begin{figure}[H]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=17cm,trim= 0cm 0cm 0cm 0cm, clip=true, angle=90]{gSvQ_All.pdf}\n   \\caption{PMT gain$\\times$quantum efficiency relative to the first measurement, as a function of the charge passed through the anode, after temperature corrections. The horizontal dotted line marks the initial relative value of one. PP03 is the capped control PMT. }\n    \\label{gSvQ_All}\n\\end{figure}\n\n\n\\begin{figure}[H]\n    \\centering\n    \\includegraphics[keepaspectratio=true,width=17cm,trim= 0cm 0cm 0cm 0cm, clip=true, angle=90]{gSvT_All.pdf}\n   \\caption{PMT gain$\\times$quantum efficiency relative to the first measurement, as a function of lab time elapsed, after temperature corrections. The vertical dotted line marks the point where the UV LED was turned off and aging was halted. The horizontal dotted line marks the initial relative value of one. }\n    \\label{gSvT_All}\n\\end{figure}\n\n\n\\section{Summary}\nThe initial quantities measured by Hamamatsu prior to shipping can be found in Table \\ref{hamaTbl}. Using processing electronics developed by the University of Montreal, the excess noise factor and aging properties of the R11283 photopentode were studied. The average excess noise factor for 16 PMTs was found to be $1.9\\pm0.1\\pm0.4$ and the average electronic noise was measured to be $1730\\pm33$ electrons at the anode. This electronic noise corresponds to an equivalent noise energy of 80~keV. The phototube aging was accelerated with a UV LED. At a reduced gain of $85\\pm3$, 14 PMTs were aged with 7~C passed through the anode. The average performance of the PMTs was reduced to $93\\pm3$~\\% of the initial measurement. Of the 14 aged PMTs, only one showed signs of rapid aging that could be a problem for some calibration systems. \n\n\n\\section*{Acknowledgements}\nThis work was supported by the technical support staff at TRIUMF, in particular P. Amaudruz who developed the pulsed UV laser and aided in the setup of MIDAS. Additionally, J.P. Martin, N.A. Starinski, and P. Taras of the University of Montreal designed and produced the preamp, motherboard, and shaper electronics. D. Jow aided in the gluing of the CsI to the PMTs. Funding for this work was provided by NSERC. \n\n\n\n\\bibliography{thesisBib}\n\n\n", "itemtype": "equation", "pos": 7872, "prevtext": "\n\nwhere the subscripts $c$ and $a$ denote the cathode and anode respectively. Measured at location $x$, $N_x$ and $\\sigma_x$ are the number of electrons and the signal width respectively, as determined from the Novosibrisk fit. $F$ is the excess noise factor. Typically, the excess noise factor is larger for fine mesh PMTs than standard PMTs. Recognizing the Poisson nature of the photoelectrons and that the measured width at the anode contains contributions from both the constant electronic noise and the excess noise factor, Equation \\ref{eqnF} can be written as: \n\n\n", "index": 3, "text": "\\begin{equation}\n\\sigma^2_m = F\\cdot N_c + \\sigma_o^2, \\label{eqnF_lin}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\sigma^{2}_{m}=F\\cdot N_{c}+\\sigma_{o}^{2},\" display=\"block\"><mrow><mrow><msubsup><mi>σ</mi><mi>m</mi><mn>2</mn></msubsup><mo>=</mo><mrow><mrow><mi>F</mi><mo>⋅</mo><msub><mi>N</mi><mi>c</mi></msub></mrow><mo>+</mo><msubsup><mi>σ</mi><mi>o</mi><mn>2</mn></msubsup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]