[{"file": "1601.04928.tex", "nexttext": "\n\nThe subscript $N$ denotes the number of jets desired in the final state, and is an input to the measurement.  For the Higgs + jet,\n$W^{+} $+ jet and $Z $+ jet processes considered here, we have $N=1$.  Values of ${\\cal T}_1$ near zero indicate a final state containing a single narrow energy deposition, while larger values denote a final state containing two or more well-separated energy depositions.  \nThe $p_i$ are light-like vectors for each of the initial-state beams and final-state jets in the problem, while the $q_k$ denote the four-momenta of any final-state radiation.  The $Q_i$ are dimensionful variables that characterize the hardness of the beam-jets and final-state jets.  We set $Q_i = 2 E_i$, twice the energy of each jet.  \n\nThe cross section for ${{\\cal T}_N}$ less than some value ${\\cal T}_N^{cut}$ can be expressed in the form~\\cite{Stewart:2010pd,Stewart:2009yx}\n\n\n", "itemtype": "equation", "pos": 2536, "prevtext": "\n\n\\section{Introduction}\n\nRun I of the Large Hadron Collider (LHC)  was marked by the discovery and initial characterization of the Higgs boson. \nThe comparison of Standard Model (SM) predictions with data from Run I of the LHC was limited by the statistical precision of the experimental data.  This will no longer be the case during Run II, and systematic errors will dominate.  The largest systematic error currently hindering our understanding of Higgs properties is the theoretical precision of the SM predictions.  \nThis is the case for the well-measured di-boson modes~\\cite{Higgserrors} which dominate the overall signal-strength determination.  \nThe theoretical uncertainties must be reduced in order to sharpen our understanding of the mechanism of electroweak symmetry breaking in Nature. Calculations through next-to-next-to-leading order (NNLO) in perturbative QCD have become increasingly necessary to match the \nprecision of LHC measurements. In particular improvements in both the overall production rate of the Higgs boson and in the modeling of its kinematic distributions are needed to match the expected experimental precision of Run II. \n\nNNLO calculations for scattering processes with final-state jets at hadron colliders possess a complex singularity structure. \nPartial results for $2 \\to 2$  processes such as inclusive jet production~\\cite{Ridder:2013mf}, Higgs+jet production~\\cite{Boughezal:2013uia,Boughezal:2015dra} and Z+jet production~\\cite{Ridder:2016rzm} are available (full results for Z+j using antenna subtraction will be available soon~\\cite{Ridder:upcoming}). More recently complete results for Higgs+jet production~\\cite{Boughezal:2015aha}, $W^{+}$+jet \nproduction~\\cite{Boughezal:2015dva} and $Z$+jet production~\\cite{Boughezal:2015ded} were achieved using N-jettiness subtraction method~\\cite{Boughezal:2015dva,Boughezal:2015eha,Stewart:2010tn,Gaunt:2015pea}. The purpose of this contribution is to summarize the method and the results achieved for these processes.\n\n\\section{Description of N-jettiness subtraction}\n\\label{sec:jettinessDef}\n\nWe review here the salient features of the N-jettiness subtraction scheme for NNLO calculations, which was recently \nintroduced in the context of the NNLO computation of $W^{+}$ boson and Higgs boson production in association with \na jet~\\cite{Boughezal:2015aha,Boughezal:2015dva,Boughezal:2015ded}.  We begin with the definition of $N$-jettiness$,{{\\cal T}_N}$, a global event shape variable designed to veto final-state jets~\\cite{Stewart:2010tn}:\n\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eq:taudef}\n{\\cal T}_N = \\sum_k \\rm{min}_i \\left\\{ \\frac{2 p_i \\cdot q_k}{Q_i} \\right \\}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\cal T}_{N}=\\sum_{k}\\rm{min}_{i}\\left\\{\\frac{2p_{i}\\cdot q_{k}}{Q_{i}}\\right\\}.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mi>N</mi></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder><mrow><msub><mi>min</mi><mi mathvariant=\"normal\">i</mi></msub><mo>⁢</mo><mrow><mo>{</mo><mfrac><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">p</mi><mi mathvariant=\"normal\">i</mi></msub></mrow><mo>⋅</mo><msub><mi mathvariant=\"normal\">q</mi><mi mathvariant=\"normal\">k</mi></msub></mrow><msub><mi mathvariant=\"normal\">Q</mi><mi mathvariant=\"normal\">i</mi></msub></mfrac><mo>}</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04928.tex", "nexttext": "\n\nThe function $H$ contains the virtual corrections to the process.  The beam function $B$ encodes the effect of radiation collinear to one of the two initial beams.  It can be written as a perturbative matching coefficient convoluted with a parton distribution function.  $S$ describes the soft radiation, while $J_n$ contains the radiation collinear to a final-state jet.  The ellipsis denotes power-suppressed terms which become negligible for ${{\\cal T}_N} \\ll Q_i$. Each of these functions obeys a renormalization-group equation that allows logarithms of ${{\\cal T}_N}$ to be resummed.  If this expression is instead expanded to fixed-order in the strong coupling constant, it reproduces the cross section for low ${{\\cal T}_N}$. The derivation of this factorization theorem in the small-${\\cal T}_N$ limit relies upon the machinery of Soft-Collinear Effective Theory~\\cite{Bauer:2000ew}.\n\nThe basic idea behind N-jettiness subtraction is that ${{\\cal T}_N}$ fully captures the singularity structure of QCD amplitudes with final-state partons.  This allows us to calculate the NNLO corrections to processes such as Higgs + jet, $W^{+} $+ jet and Z + jet in the following way.  We divide the phase space according to whether ${{\\cal T}_N}$ is greater than or less than ${\\cal T}_N^{cut}$.  For ${{\\cal T}_N} > {\\cal T}_N^{cut}$ there are at least two hard partons in the final state, since all singularities are controlled by N-jettiness.  This region of phase space can therefore be obtained from, for example, a NLO calculation of Higgs production in association with two jets in the case where the born process is Higgs + jet.  Below ${\\cal T}_N^{cut}$, the cross section is given by the factorization theorem of Eq.~(\\ref{eq:fact}) expanded to second order in the strong coupling constant.  As long as ${\\cal T}_N^{cut}$ is smaller than any other kinematic invariant in the problem, power corrections below the cutoff are unimportant.\n\nAll ingredients of Eq.~(\\ref{eq:fact}) are known to the appropriate order to describe the low ${{\\cal T}_N}$ region through second order in the strong coupling constant.  The two-loop virtual corrections for the processes discussed here are known~\\cite{Gehrmann:2011aa,Gehrmann:2011ab}.\nThe beam functions are known through NNLO~\\cite{Gaunt:2014xga,Gaunt:2014cfa}, as are the jet functions~\\cite{Becher:2006qw,Becher:2010pd} and soft function~\\cite{Boughezal:2015eha}.  It is therefore possible to combine this information to provide the full NNLO calculation of Higgs + jet\nand $W^{+}/Z $+ jet. \n\nA full NNLO calculation requires as well the high ${{\\cal T}_N}$ region above ${\\cal T}_N^{cut}$.  However, a finite value of ${{\\cal T}_N}$ implies that there are actually \n$N+1$ resolved partons in the final state.  This is the crucial observation; ${{\\cal T}_N}$ completely describes the singularity structure of QCD amplitudes that contain $N$ final-state partons at leading order.  The high ${{\\cal T}_N}$ region of phase space is therefore described by a NLO calculation with $N+1$ jets.  We must choose ${\\cal T}_N^{cut}$ much smaller than any other kinematical invariant in the problem in order to a\nvoid power corrections to Eq.~(\\ref{eq:fact}) below the cutoff.  \n\n\n\\section{Numerical Results} \\label{sec:numerics}\n\n\nWe now present some numerical results for Higgs, $W^{+}$ and Z production in association with a jet. For validation checks of the results presented here we refer the reader to the detailed description in~\\cite{Boughezal:2015aha,Boughezal:2015dva,Boughezal:2015ded}.  We focus on 8 TeV proton-proton collisions.  Jets are reconstructed using the anti-$k_T$ algorithm~\\cite{Cacciari:2008gp} with $R=0.5$.  For the Higgs+jet process\nwe show results using the NNPDF~\\cite{Ball:2012cx} parton distribution functions (PDFs), for the $W^{+}$+jet we use \nCT10 PDFs~\\cite{Gao:2013xoa} while for Z + jet we use CT14 PDFs~\\cite{Dulat:2015mca}.  We use the perturbative order of the PDFs that is consistent with the partonic cross section under consideration: LO PDFs with LO partonic cross sections, NLO PDFs with NLO partonic cross sections, and NNLO PDFs with NNLO partonic cross sections.  We set the renormalization and factorization scales equal to the mass of the Higgs boson, $\\mu_R = \\mu_F = m_H$ for Higgs+jet, $\\mu=M_W$ for $W^{+}$+jet and $\\mu=\\mu_0=\\sqrt{m_{ll}^2+\\sum (p_{T}^{jet})^2}$  for Z + jet. For the latter scale choice the sum is over the transverse momenta of all final-state jets, and $m_{ll}$ is the invariant mass of the di-lepton pair arising from the $Z$-boson decay.  To estimate the residual theoretical error, we vary these scales simultaneously around the central value by a factor of two. We set the mass of the Higgs boson as $m_H = 125$ GeV. We impose the following cuts on the final-state jet: $p_T^{jet} > 30$ GeV, $|\\eta_{jet}|<2.4$ for Higgs+jet and $|\\eta_{jet}|<2.5$ for $W^{+}$+jet. For the Z + jet process we show a plot for the dependence of the ratio $\\sigma_{NNLO}/\\sigma_{NLO}$ \non the power corrections as a function of $\\tau_1^{cut}$ and refer the reader to the corresponding paper for more phenomenological studies~\\cite{Boughezal:2015ded}.\n\nWe begin by showing few distributions in the Higgs plus jet production case.  In Fig.~\\ref{fig:pTjet} we show the transverse momentum distribution of the leading jet. There is a shape dependence to the corrections, with the $K$-factor decreasing as $p_T^{jet}$ is increased. \nThis trend is visible when going from LO to NLO in perturbation theory, and also when going from NLO to NNLO.  We note that the NNLO \nresult is entirely contained within the NLO scale-variation band.  The shape dependence and magnitude of the NNLO corrections for the $p_T^{jet}$ distribution are in agreement with the results of Ref.~\\cite{Boughezal:2015dra}, obtained using sector-improved residue subtraction \nscheme~\\cite{Czakon:2010td,Boughezal:2011jf}. In Fig.~\\ref{fig:pThiggs} we show the transverse momentum of the Higgs boson. The NLO corrections range from 40\\% to 120\\% near $p_{T}^H=60$ GeV, depending on the scale choice.  The magnitude of this correction decreases as the transverse momentum of the Higgs increases.  The NNLO corrections are more mild, reaching only 20\\% at most for the central scale choice $\\mu=m_H$.  They also decrease slightly as the transverse momentum of the Higgs increases.  The shape dependence and magnitude of the NNLO corrections for the $p_T^{H}$ distribution are in agreement with the results of Ref.~\\cite{Boughezal:2015dra}.  We note that we have combined the two bins closest to the boundary $p_T^H=30$ GeV to avoid the well-known Sudakov shoulder effect~\\cite{Catani:1997xc}.\n\n\\begin{figure}[!tbp]\n  \\centering\n  \\begin{minipage}[b]{0.47\\textwidth}\n    \\includegraphics[width=\\textwidth]{h1j_pTJ.pdf}\n    \\caption{The transverse momentum of the leading jet for the Higgs+jet process at LO, NLO, and NNLO in the strong coupling constant. The lower inset shows the ratios of NLO over LO cross sections, and NNLO over NLO cross sections.  Both shaded regions in the upper panel and the lower inset indicate the scale-variation errors.} \\label{fig:pTjet}\n  \\end{minipage}\n  \\hfill\n  \\begin{minipage}[b]{0.47\\textwidth}\n    \\includegraphics[width=\\textwidth]{h1j_pTH.pdf}\n    \\caption{The transverse momentum of the Higgs boson at LO, NLO, and NNLO in the strong coupling constant. The lower inset shows the ratios of NLO over LO cross sections, and NNLO over NLO cross sections.  Both shaded regions in the upper panel and the lower inset indicate the scale-variation errors.} \\label{fig:pThiggs}\n  \\end{minipage}\n\\end{figure}\n\nIn Fig.~\\ref{fig:ptspectrum} we show the transverse momentum spectrum of the leading jet for $W^{+}$ + jet at LO, NLO and \nNNLO in perturbation theory.  The ratios of the NLO cross section over the LO result, as well as the NNLO cross section over the NLO one, \nare shown in the lower inset.  The shaded bands in the upper inset indicate the theoretical errors at each order estimated by varying \nthe renormalization and factorization scales by a factor of two around their central value, as do the shaded regions in the lower inset.  In the\n lower inset we have shown the results for both ${\\cal T}_N^{cut}=0.05$ GeV and ${\\cal T}_N^{cut}=0.07$ GeV, for the scale choice \n $\\mu=2 M_W$, to demonstrate the ${\\cal T}_N^{cut}$ independence in every bin studied.  The NLO corrections are large and positive for this scale choice, increasing the cross section by 40\\% at $p_T^{jet}=40 $ GeV and by nearly a factor of two at $p_T^{jet}=180$ GeV.  The scale variation at NLO reaches approximately $\\pm 20\\%$ for $p_T^{jet}=180$ GeV.  The shift when going from NLO to NNLO is much more mild, giving only a percent-level decrease of the cross section that varies only slightly as $p_T^{jet}$ is increased.  The scale variation at NNLO is at the percent level and is nearly invisible on this plot.  \n\n\n\\begin{figure}[!tbp]\n  \\centering\n  \\begin{minipage}[b]{0.47\\textwidth}\n    \\includegraphics[width=\\textwidth]{w1j_pTJ_tauband.pdf}\n    \\caption{The transverse momentum spectrum of the leading jet for $W^{+}$ + jet at LO, NLO and NNLO in perturbation theory.  The bands indicate the estimated theoretical error. The lower inset shows the ratios of the NLO over the LO cross section, and the NNLO over the NLO cross section.  Both shaded regions in the upper panel and the lower inset indicate the scale-variation errors.  The dashed and solid black lines in the lower inset respectively show the distribution for ${\\cal T}_1^{cut}=0.05$ GeV and ${\\cal T}_1^{cut}=0.07$ GeV, for the scale choice $\\mu=2 M_W$.} \\label{fig:ptspectrum}\n  \\end{minipage}\n  \\hfill\n  \\begin{minipage}[b]{0.475\\textwidth}\n    \\includegraphics[width=\\textwidth]{w1j_pTW_tauband.pdf}\n    \\caption{The transverse momentum spectrum of the $W^{+}$-boson at LO, NLO and NNLO in perturbation theory.  The bands indicate the estimated theoretical error. The lower inset shows the ratios of the NLO over the LO cross section, and the NNLO over the NLO cross section. Both shaded regions in the upper panel and the lower inset indicate the scale-variation errors.  The dashed and solid black lines in the lower inset respectively show the distribution for ${\\cal T}_1^{cut}=0.05$ GeV and ${\\cal T}_1^{cut}=0.07$ GeV, for the scale choice $\\mu=2 M_W$.}  \\label{fig:ptWspectrum}\n  \\end{minipage}\n\\end{figure}\n\nThe transverse momentum spectrum of the $W$-boson is shown in Fig.~\\ref{fig:ptWspectrum}.  The NLO \ncorrections are again 40\\% for $p_T^W \\geq 50$ GeV with a sizable scale dependence, while the NNLO corrections \nare flat in this region and decrease the cross section by a small amount.  The phase-space region \n$p_T^{W}<30$ GeV only opens up at NLO, leading to a different pattern of corrections for these transverse momentum values.  \nThe instability of the perturbative series in the bins closest to the boundary $p_T^W=30$ GeV is caused by the well-known Sudakov-shoulder \neffect~\\cite{Catani:1997xc}.\n\nFinally, in Fig.~\\ref{fig:taucheck} we show the dependence of the sum of the cross sections above and below the N-jettiness cutoff\n${\\cal T}_N^{cut}$ and the effect of power corrections. The validation is done for the ratio $\\sigma_{\\text{NNLO}}/\\sigma_{\\text{NLO}}$ in\n 13 TeV proton-proton collisions.  We have checked that the NLO cross section obtained with $N$-jettiness subtraction agrees with \nthe result obtained with standard techniques.  These cross sections are obtained using CT14 PDFs at the same order in perturbation theory as the partonic cross section, and contain the following fiducial cuts on the leading final-state jet and the two leptons from CMS~\\cite{Khachatryan:2014zya}: $p_T^{jet} > 30$ GeV, $|\\eta_{jet}|<2.4$, $p_T^{l} > 20$ GeV, $|\\eta_{l}|<2.4$ and $71\\, \\text{GeV} ~< m_{ll} ~< 111 \\, \\text{GeV}$. The ATLAS analysis is similar but with slightly different cuts.  We reconstruct jets using the anti-$k_T$ algorithm~\\cite{Cacciari:2008gp} with $R=0.5$.  \nA dynamical scale $\\mu_0=\\sqrt{m_{ll}^2+\\sum p_{T}^{jet,2}}$ is chosen to describe this process, where the sum is over the transverse\n momenta of all final-state jets, and $m_{ll}$ the invariant mass of the di-lepton pair arising from the $Z$-boson decay. In this \nvalidation plot we have set the renormalization and factorization scales to $\\mu_R = \\mu_F = 2 \\times \\mu_0$; since the corrections are larger for this scale choice, it is easier to illustrate the important aspects of the ${\\cal T}_1^{cut}$ variation.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=3.3in]{validation.pdf}\n\\caption{Plot of the NNLO cross section over the NLO result, $\\sigma_{\\text{NNLO}}/\\sigma_{\\text{NLO}}$, as a function of ${\\cal T}_1^{cut}$, for the scale choice $\\mu= 2 \\times \\mu_0$.  The vertical bars accompanying each point indicate the integration errors.} \\label{fig:taucheck}\n\\end{figure}\n\nA few features can be seen in Fig.~\\ref{fig:taucheck}.  First, in the region ${\\cal T}_1^{cut} < 0.2$ GeV the result becomes independent of the particular value of the cut chosen within the numerical errors.  The NNLO correction for $\\mu = 2 \\times \\mu_0$ corresponds to a $+3\\%$ shift in the cross section.  The plot makes clear that we have numerical control over the NNLO cross section to the per-mille level, completely sufficient for phenomenological predictions.  We observe an approximately linear dependence of $\\sigma_{\\text{NNLO}}$ on ${\\rm ln}\\left({\\cal T}_1^{cut}\\right)$ in the region $ 0.2 \\, {\\rm GeV} < {\\cal T}_1^{cut} < 0.5 \\, {\\rm GeV}$, indicating the onset of the neglected power corrections.  These power corrections have the form $({{\\cal T}_N} / Q) \\, {\\rm ln}^n({{\\cal T}_N} / Q)$, where $n \\leq 3$ at NNLO~\\cite{Gaunt:2015pea} and $Q$ is a hard scale such as $p_T^{jet}$.\n\n \n\\section{Conclusions}\n\nWe have presented in this proceedings the complete NNLO calculation of $W^{+}/Z$ + jet and Higgs boson production in association with a jet in hadronic collisions.  To perform this computation we have used a new subtraction scheme based on the $N$-jettiness event-shape variable  ${{\\cal T}_N}$.  \nWe will further study the phenomenological impact of our NNLO result in future work, including the prediction for the exclusive one-jet bin, where an intricate interplay between various sources of higher-order corrections was recently pointed out~\\cite{Boughezal:2015oga}.\nWe will in addition use the full NNLO result to improve upon the resummation of jet-veto logarithms that occur when Higgs production is measured in exclusive jet bins.  Previous work has indicated that this resummation has an important effect in reducing the theoretical uncertainties that plague the predictions for exclusive jet multiplicities~\\cite{Boughezal:2013oha}. \n\n\n\n\\begin{thebibliography}{99}\n\n\\bibitem{Higgserrors}\nFor recent studies of the Higgs couplings to various states, see ATLAS-CONF-2015-007;\nV.~Khachatryan {\\it et al.}  [CMS Collaboration],\n   arXiv:1412.8662 [hep-ex].\n\n\\bibitem{Ridder:2013mf} \n  A.~Gehrmann-De Ridder, T.~Gehrmann, E.~W.~N.~Glover and J.~Pires,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 110}, no. 16, 162003 (2013);\n  \n  J.~Currie, A.~Gehrmann-De Ridder, E.~W.~N.~Glover and J.~Pires,\n  \n  JHEP {\\bf 1401}, 110 (2014).\n  \n\n\\bibitem{Boughezal:2013uia} \n  R.~Boughezal, F.~Caola, K.~Melnikov, F.~Petriello and M.~Schulze,\n  \n  JHEP {\\bf 1306}, 072 (2013);\n    \n  X.~Chen, T.~Gehrmann, E.~W.~N.~Glover and M.~Jaquier,\n  \n  Phys.\\ Lett.\\ B {\\bf 740}, 147 (2015).\n  \n  \n  \n\\bibitem{Boughezal:2015dra} \n  R.~Boughezal, F.~Caola, K.~Melnikov, F.~Petriello and M.~Schulze,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 8, 082003 (2015)\n  [arXiv:1504.07922 [hep-ph]].\n  \n  \n \n \n\\bibitem{Ridder:2016rzm} \n  A.~G.~D.~Ridder, T.~Gehrmann, E.~W.~N.~Glover, A.~Huss and T.~A.~Morgan,\n  \n  arXiv:1601.04569 [hep-ph].\n  \n  \n  \n\\bibitem{Ridder:upcoming} \n  Private communication with Thomas Gehrmann.\n  \n  \n  \n \n\\bibitem{Boughezal:2015aha} \n  R.~Boughezal, C.~Focke, W.~Giele, X.~Liu and F.~Petriello,\n  \n  Phys.\\ Lett.\\ B {\\bf 748}, 5 (2015)\n  [arXiv:1505.03893 [hep-ph]].\n  \n  \n   \n  \n\\bibitem{Boughezal:2015dva} \n  R.~Boughezal, C.~Focke, X.~Liu and F.~Petriello,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 115}, no. 6, 062002 (2015)\n  [arXiv:1504.02131 [hep-ph]].\n  \n  \n  \n    \n\\bibitem{Boughezal:2015ded} \n  R.~Boughezal, J.~M.~Campbell, R.~K.~Ellis, C.~Focke, W.~T.~Giele, X.~Liu and F.~Petriello,\n  \n  arXiv:1512.01291 [hep-ph].\n  \n  \n\n  \n\\bibitem{Boughezal:2015eha} \n  R.~Boughezal, X.~Liu and F.~Petriello,\n  \n  Phys.\\ Rev.\\ D {\\bf 91}, no. 9, 094035 (2015)\n  [arXiv:1504.02540 [hep-ph]].\n  \n  \n   \n \\bibitem{Stewart:2010tn} \n  I.~W.~Stewart, F.~J.~Tackmann and W.~J.~Waalewijn,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 105}, 092002 (2010)\n  [arXiv:1004.2489 [hep-ph]].\n  \n\n \n\\bibitem{Gaunt:2015pea} \n  J.~Gaunt, M.~Stahlhofen, F.~J.~Tackmann and J.~R.~Walsh,\n  \n  JHEP {\\bf 1509}, 058 (2015)\n  [arXiv:1505.04794 [hep-ph]].\n  \n  \n \n \\bibitem{Stewart:2010pd} \n  I.~W.~Stewart, F.~J.~Tackmann and W.~J.~Waalewijn,\n  \n  Phys.\\ Rev.\\ Lett.\\  {\\bf 106}, 032001 (2011)\n  [arXiv:1005.4060 [hep-ph]].\n  \n\n\\bibitem{Stewart:2009yx} \n  I.~W.~Stewart, F.~J.~Tackmann and W.~J.~Waalewijn,\n  \n  Phys.\\ Rev.\\ D {\\bf 81}, 094035 (2010)\n  [arXiv:0910.0467 [hep-ph]].\n  \n  \n\n  \n  \n\\bibitem{Bauer:2000ew} \n  C.~W.~Bauer, S.~Fleming and M.~E.~Luke,\n  \n  Phys.\\ Rev.\\ D {\\bf 63}, 014006 (2000);\n C.~W. Bauer, S.~Fleming, D.~Pirjol, and I.~W. Stewart,\n\\newblock Phys. Rev. {\\bf D63}, 114020 (2001), hep-ph/0011336;\n  C.~W.~Bauer and I.~W.~Stewart,\n  \n  Phys.\\ Lett.\\ B {\\bf 516}, 134 (2001)\n  [hep-ph/0107001];\nC.~W. Bauer, D.~Pirjol, and I.~W. Stewart,\n\\newblock Phys. Rev. {\\bf D65}, 054022 (2002), hep-ph/0109045;\n\nC.~W. Bauer, S.~Fleming, D.~Pirjol, I.~Z. Rothstein, and I.~W. Stewart,\n\\newblock Phys. Rev. {\\bf D66}, 014017 (2002), hep-ph/0202088.\n\n\n\\bibitem{Gehrmann:2011aa} \n  T.~Gehrmann, M.~Jaquier, E.~W.~N.~Glover and A.~Koukoutsakis,\n  \n  JHEP {\\bf 1202}, 056 (2012)\n  [arXiv:1112.3554 [hep-ph]].\n  \n  \n\\bibitem{Gehrmann:2011ab} \n  T.~Gehrmann and L.~Tancredi,\n  \n  JHEP {\\bf 1202}, 004 (2012).\n    \n\n\\bibitem{Gaunt:2014xga} \n  J.~R.~Gaunt, M.~Stahlhofen and F.~J.~Tackmann,\n  \n  JHEP {\\bf 1404}, 113 (2014)\n  [arXiv:1401.5478 [hep-ph]].\n  \n\n\\bibitem{Gaunt:2014cfa} \n  J.~Gaunt, M.~Stahlhofen and F.~J.~Tackmann,\n  \n  JHEP {\\bf 1408}, 020 (2014)\n  [arXiv:1405.1044 [hep-ph]].\n  \n\n\\bibitem{Becher:2006qw} \n  T.~Becher and M.~Neubert,\n  \n  Phys.\\ Lett.\\ B {\\bf 637}, 251 (2006)\n  [hep-ph/0603140].\n  \n\n\\bibitem{Becher:2010pd} \n  T.~Becher and G.~Bell,\n  \n  Phys.\\ Lett.\\ B {\\bf 695}, 252 (2011)\n  [arXiv:1008.1936 [hep-ph]].\n  \n\n\\bibitem{Cacciari:2008gp} \n  M.~Cacciari, G.~P.~Salam and G.~Soyez,\n  \n  JHEP {\\bf 0804}, 063 (2008)\n  [arXiv:0802.1189 [hep-ph]].\n  \n\n\\bibitem{Ball:2012cx} \n  R.~D.~Ball, V.~Bertone, S.~Carrazza, C.~S.~Deans, L.~Del Debbio, S.~Forte, A.~Guffanti and N.~P.~Hartland {\\it et al.},\n  \n  Nucl.\\ Phys.\\ B {\\bf 867}, 244 (2013)\n  [arXiv:1207.1303 [hep-ph]].\n  \n\n\\bibitem{Gao:2013xoa} \n  J.~Gao, M.~Guzzi, J.~Huston, H.~L.~Lai, Z.~Li, P.~Nadolsky, J.~Pumplin and D.~Stump {\\it et al.},\n  \n  Phys.\\ Rev.\\ D {\\bf 89}, no. 3, 033009 (2014).\n  \n\n\\bibitem{Dulat:2015mca} \n  S.~Dulat {\\it et al.},\n  \n  arXiv:1506.07443 [hep-ph].\n  \n  \n\\bibitem{Catani:1997xc} \n  S.~Catani and B.~R.~Webber,\n  \n  JHEP {\\bf 9710}, 005 (1997).\n  \n\n\\bibitem{Czakon:2010td} \n  M.~Czakon,\n  \n  Phys.\\ Lett.\\ B {\\bf 693}, 259 (2010)\n  [arXiv:1005.0274 [hep-ph]].\n  \n\n\\bibitem{Boughezal:2011jf} \n  R.~Boughezal, K.~Melnikov and F.~Petriello,\n  \n  Phys.\\ Rev.\\ D {\\bf 85}, 034025 (2012)\n  [arXiv:1111.7041 [hep-ph]].\n  \n   \n \n\\bibitem{Boughezal:2015oga} \n  R.~Boughezal, C.~Focke and X.~Liu,\n  \n  Phys.\\ Rev.\\ D {\\bf 92}, no. 9, 094002 (2015)\n  doi:10.1103/PhysRevD.92.094002\n  [arXiv:1501.01059 [hep-ph]].\n  \n  \n    \n\n\\bibitem{Boughezal:2013oha} \n  R.~Boughezal, X.~Liu, F.~Petriello, F.~J.~Tackmann and J.~R.~Walsh,\n  \n  Phys.\\ Rev.\\ D {\\bf 89}, no. 7, 074044 (2014)\n  [arXiv:1312.4535 [hep-ph]].\n  \n  \n \n \\bibitem{Khachatryan:2014zya} \n  V.~Khachatryan {\\it et al.} [CMS Collaboration],\n  \n  Phys.\\ Rev.\\ D {\\bf 91}, no. 5, 052008 (2015).\n  \n  \n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 3554, "prevtext": "\n\nThe subscript $N$ denotes the number of jets desired in the final state, and is an input to the measurement.  For the Higgs + jet,\n$W^{+} $+ jet and $Z $+ jet processes considered here, we have $N=1$.  Values of ${\\cal T}_1$ near zero indicate a final state containing a single narrow energy deposition, while larger values denote a final state containing two or more well-separated energy depositions.  \nThe $p_i$ are light-like vectors for each of the initial-state beams and final-state jets in the problem, while the $q_k$ denote the four-momenta of any final-state radiation.  The $Q_i$ are dimensionful variables that characterize the hardness of the beam-jets and final-state jets.  We set $Q_i = 2 E_i$, twice the energy of each jet.  \n\nThe cross section for ${{\\cal T}_N}$ less than some value ${\\cal T}_N^{cut}$ can be expressed in the form~\\cite{Stewart:2010pd,Stewart:2009yx}\n\n\n", "index": 3, "text": "\\begin{equation} \\label{eq:fact}\n \\sigma({{\\cal T}_N} < {\\cal T}_N^{cut})=  \\int H \\otimes B \\otimes B \\otimes S \\otimes   \\left[ \\prod_n^{N} J_n \\right] +\\cdots .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\sigma({{\\cal T}_{N}}&lt;{\\cal T}_{N}^{cut})=\\int H\\otimes B\\otimes B\\otimes S%&#10;\\otimes\\left[\\prod_{n}^{N}J_{n}\\right]+\\cdots.\" display=\"block\"><mrow><mi>σ</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mi>N</mi></msub><mo>&lt;</mo><msubsup><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mi>N</mi><mrow><mi>c</mi><mo>⁢</mo><mi>u</mi><mo>⁢</mo><mi>t</mi></mrow></msubsup><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>H</mi><mo>⊗</mo><mi>B</mi><mo>⊗</mo><mi>B</mi><mo>⊗</mo><mi>S</mi><mo>⊗</mo><mrow><mo>[</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∏</mo><mi>n</mi><mi>N</mi></munderover><msub><mi>J</mi><mi>n</mi></msub><mo>]</mo></mrow><mo>+</mo><mi mathvariant=\"normal\">⋯</mi><mo>.</mo></mrow></math>", "type": "latex"}]