[{"file": "1601.01589.tex", "nexttext": "\n\\end{small}\n\nIn what follows, only the corrected metallicities will be used, and\ntherefore we will note the calibrated metallicities simply as [M/H].\n\n As noted at the beginning of the Section, soft priors have been\n imposed on the expected results, by removing some parameter\n combinations from the solution space. For the adopted priors, we\n imposed:\n\n \\begin{itemize}\n \\item\n  an effective temperature between $4000-6500$~K,\n  \\item\n  a surface gravity lower than $3.75$, \n  \\item\n  a metallicity range between $-5$ and $+1$ (i.e. all the available metallicity range of the templates). \n  \\end{itemize}\n\nThe temperature range can be justified by the colour selection of\nCarina's candidates ($0.5<B-V<1.2$, see Fig.\\,\\ref{Fig:CMD}).  As fas as the assumption on the\nsurface gravity is concerned, the reason relies on our {\\it a priori }\nknowledge of the properties of the observed stars.  Indeed, given the\ndistance modulus of Carina \\citep[$m-M\\sim20.1$, e.g.][]{Dallora03},\nall of Carina's main sequence stars should be outside the observed\nmagnitude range.  In other words, all the stars belonging to Carina\nare expected to be either red clump stars or on the red giant\nbranch, hence with a {$\\log g$}\\ lower than 3.5.\n\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_CMD_BV} \n\\end{center}\n\\caption{Colour-magnitude diagram of the final adopted Carina sample\n  ({731}\\ members). The RC is at $(B-V)<0.7$ and $V>20$,\n  whereas the RGB contains all the stars with $(B-V)>0.7$ up to\n  $V=18$. }\n  \\label{Fig:CMD}\n\\end{figure}\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_SNR} \n\\end{center}\n\\caption{Histogram of the mean signal-to-noise ratio per pixel of the\n  spectra of the final Carina sample that is considered for the\n  analysis ({731}\\ members).}\n\\label{Fig:SNR_histogram}\n\\end{figure}\n\nThat said, one must still understand the effect of removing regions of\nthe solution space on the parameterisation of foreground stars that\nmight have the same radial velocity as Carina, and contaminate our\nsample (the risk here being to mis-parameterise a dwarf star as a\ngiant). A first statement that can be made is that given the radial\nvelocity of Carina ($221{\\,{\\rm km~s^{-1}}}$), foreground stars having a similar\nradial velocity are expected to be mainly halo stars, and therefore\ngiants.  For the few foreground stars that might still have\n{$\\log g$}$>$3.75, the algorithm will always match, by design, the\nobservations with the closest template (the latter being the one\nhaving the closest parameters as the true spectrum). This implies that\nthe derived parameters of a dwarf star will therefore be at the\nboundaries of the grid and easily identifiable. In order to make sure\nthat such contaminators are excluded from our analysis, we further\ndecided to discard all the stars for which the surface gravity is\ngreater than $3.25$, as well as the stars with a spectra having a SNR\nlower than 5\\,pixel$^{-1}$, because of the large uncertainty in the\nderived parameters. Figure~\\ref{Fig:SNR_histogram} shows the SNR\nhistogram of the Carina sample that is considered in what follows. The\nbulk of the spectra have SNR$\\sim$10 ~pixel$^{-1}$, with some of them\nhaving up to SNR$\\sim$40 ~pixel$^{-1}$. \n{  A selection of three spectra, at SNR$\\sim5, 10,20$ ~pixel$^{-1}$, with their best-fit solution are shown in Fig.~\\ref{Fig:Obs_spectra}.}\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_spec_low_SNR}\\\\\n \\includegraphics[width=0.5\\textwidth]{Carina_spec_med_SNR}\\\\\n \\includegraphics[width=0.5\\textwidth]{Carina_spec_high_SNR}\\\\\n\\end{center}\n\\caption{{  Observed (black) and fitted spectra (red) corresponding to the synthetic spectrum having the parameters of the stars for three stars having SNR$\\sim5, 10,20$ ~pixel$^{-1}$. The wavelength range has been truncated at the blue end by $40$\\AA\\, to make the plots clearer to visualise.}}\n\\label{Fig:Obs_spectra}\n\\end{figure}\n\n\n\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_errors} \n\\end{center}\n\\caption{{  Errors on the effective temperature, surface gravity, uncalibrated metallicity and calibrated metallicity as a function of signal-to-noise, for the sample of stars that we have identified as Carina members and with SNR greater than 5\\,pixel$^{-1}$. }}\n\\label{Fig:SNR_errors}\n\\end{figure}\n\nTypical uncertainties on the parameters were obtained using the error\nspectrum of each target, producing 10 Monte-Carlo realisations of\nobserved spectra and re-deriving the parameters. For {T$_{\\rm eff}$}, {$\\log g$}\\ and\n[M/H], the median uncertainties are of the order of 226{\\,{\\rm K}}, 0.48{\\,{\\rm dex}}\\,\nand 0.29{\\,{\\rm dex}}, respectively, {  with the errors being the largest for the lowest SNR values, as expected (see Fig.~\\ref{Fig:SNR_errors})}.  \n\nFigure~\\ref{Fig:CMD} shows the CMD for\nCarina for our adopted sample, colour-coded according to the\nmetallicity of the stars.  We find that the mean metallicity for the\nwhole sample is ${\\hbox{[M/H]}}\\approx-1.78$, with a large span in the derived\nvalues, ranging from $\\sim-4$ to $\\sim-0.5$. This result is in very good\nagreement with previous studies \\citep[see for example][]{Koch06}.\n \n \n\n\\subsection{Age determination of the red giant branch stars}\n\\label{sec:ages}\n\nA rough estimate of the age of the stars can be obtained by comparing the colour,\nmagnitudes and atmospheric parameters of the stars with theoretical\nisochrones.  Following \\citet{Kordopatis11b}, we constructed a library\nof isochrones with a constant step in age ($0.5{\\,{\\rm Gyr}}$) and metallicity\n($0.1{\\,{\\rm dex}}$). The step in metallicity has been chosen in order to be\nsmaller than the typical error on this parameter.  The isochrones have\nbeen computed using the online\ninterpolator\\footnote{\\url{http://stev.oapd.inaf.it/cgi-bin/cmd}} of\nthe Padova group, based on the \\citet{Marigo08} sets, for a\nmetallicity range of $[-2.1;0.1]$.\n Since the isochrones do not reach as low metallicities as the metal-poorest stars in our sample, we do not attempt to derive ages for those stars that have a metallicity that does not reach $-2.1$ within $2\\sigma_{\\tiny {\\hbox{[M/H]}}}$,  where $\\sigma_{\\tiny {\\hbox{[M/H]}}}$ is the uncertainty on the derived metallicity. \n\n\n\nThe expected age, $\\bar{a}$, of a star with parameters $\\hat \\theta_k$ ($k \\equiv {\\hbox{[M/H]}}$, $V$, $B-V$, {T$_{\\rm eff}$}, {$\\log g$}), has been obtained as follows. First, we select the set of isochrones within {\\hbox{[M/H]}}$\\pm \\sigma_{\\tiny {\\hbox{[M/H]}}}$. Then, we assign for each point $i$ on the selected isochrones a Gaussian weight $W_i$ , which depends on the distance between the points on the isochrones and the measured observables or derived parameters. In practice,  $W_i$ is computed as:\n\n \n", "itemtype": "equation", "pos": 14936, "prevtext": "\n\n\\label{firstpage}\n\n\\maketitle\n\n\\begin{abstract}\nWe study the chemodynamical properties of the Carina dwarf\nspheroidal by combining an intermediate spectroscopic resolution\ndataset of more than 900 red giant and red clump stars, with\nhigh-precision photometry to derive the atmospheric parameters,\nmetallicities and age estimates for our targets. Within the red giant\nbranch population, we find evidence for the presence of three distinct\nstellar sub-populations with different metallicities, spatial\ndistributions, kinematics and ages. \nAs in the Fornax and Sculptor dwarf spheroidals, the subpopulation with the lowest average metallicity is more extended and kinematically hotter than all other populations. However, we identify an inversion in the parallel ordering of metallicity, kinematics and characteristic length scale in the two {  most metal rich subpopulations, which therefore do not contribute to a global negative chemical gradient.} Contrary to common trends in the chemical properties with radius, the metal richest population is more extended and mildly kinematically hotter than the main component of intermediate metallicity.\nMore investigations are required to ascertain the nature of this inversion,\nbut we comment on the mechanisms that might have caused it.\n\\end{abstract}\n\n\\begin{keywords}\ngalaxies: dwarf -- galaxies: kinematics and dynamics -- galaxies:\nformation -- galaxies: evolution -- galaxies: individual: Carina dwarf Spheroidal\n\\end{keywords}\n\n\n\n\\section{Introduction}\n\n\nSince the late 1970s, it has been suggested that the Milky Way's halo\nhas been assembled from the merging and accretion of many smaller\nsystems \\citep[e.g.][]{Searle78}. In this paradigm, it has long been\nassumed that the Galaxy's satellites are remnants of this population of\nbuilding blocks.  However, first analyses of the chemical abundances\nof the stellar populations in the surviving dwarf spheroidal galaxies\n(dSphs) appeared inconsistent with this idea\n{  \\citep[e.g.,][]{Shetrone01,Venn04}}. In particular, the metal-poor tail of the\ndSph metallicity distribution seemed significantly different from that\nof the Galactic halo \\citep{Helmi06}.  Since then, extremely\nmetal-poor stars have been discovered in Galactic satellite\ngalaxies such as Sculptor \\citep[e.g.:][]{Frebel10}. Both the\nclassical and the ultra-faint dSphs are now known to have a wide\nabundance dispersion and to host some of the most extreme metal-poor\nstars known.  In fact, $\\sim$ 30\\% of the known stars with [Fe/H]\n$\\leq -3.5$ are found in dwarf galaxies\n\\citep[e.g.][]{Kirby10,Kirby12,Frebel10a}.\n\nThe connection between the surviving dwarfs and those that dissolved\nto form the halo can partially be addressed by examining in detail the\nstellar kinematics and chemical compositions of present-day dwarf\ngalaxies. Establishing the detailed chemical histories of these\nsystems can provide constraints on their dominant enrichment events\nand timescales. In addition, modelling of the kinematics can yield\npowerful information on the dark matter profile, especially in the\ncase of multiple populations \\citep[e.g.:][]{Walker11, Amorisco12a}.\n\nA multitude of independent studies have addressed the evolutionary\ncomplexities of dwarf spheroidal galaxies in the Local Group.\nSince \\citet{Harbeck01}, stellar population gradients have been observed\nin many satellites of both the Milky Way and Andromeda -- for example\nSculptor \\citep{Tolstoy04}, Fornax \\citep{Battaglia06}, Sextans \\citep{Lee03},\nTucana \\citep{Harbeck01}, Draco \\citep{Faria07}, and And II \\citep{Ho12}.\nWhether such gradients are ubiquitous remains an open question, as\ndwarfs like Leo I, And I, And III and Carina seem to be characterised\nby more homogeneous stellar populations, with milder radial\ndependences \\citep{Harbeck01, Koch06, Koch07}.\n\nA much closer look into specific dwarfs is allowed by large\nspectroscopic datasets. For example, in Sculptor, Fornax and Sextans,\ndedicated spectroscopic studies have allowed the identification of\nindependent stellar subpopulations, with chemo-dynamically distinct\nproperties {  \\citep{Battaglia06, Battaglia08, Battaglia11, Walker11,\n  Amorisco12b, Hendricks14}}. By providing a bridge between chemical and kinematical\nproperties of several hundreds of bright stars, chemo-dynamical\nanalyses yield important constraints on the complex processes that\ngovern the formation and evolution of such puny galaxies. For\ninstance, subpopulations with a higher average metallicity are more\ncentrally concentrated and kinematically colder. Whether the dwarf is\ncharacterised exclusively by old stellar populations -- as in the case\nof Sculptor \\citep[see e.g.][]{deBoer12a} -- or whether multiple\npopulations of different ages are present at the same time -- as in\nFornax \\citep[e.g.,][]{deBoer12b} -- the parallel {\\it ordering} of\nmetallicity, characteristic scale of the stellar distribution and\nkinematical state seems to be a fundamental outcome of the dSphs'\nevolutionary histories.\n \nThe importance of Carina is that it provides one of the cleanest\nexamples of an episodic star formation (SF) history. This is evident\nfrom its colour-magnitude diagram \\citep{Tolstoy09, Stetson11}, which clearly\nshows at least three different main sequence turn-offs. A number of\ninvestigations have inferred the SF history of Carina using\nphotometric data \\citep[e.g.,][]{Hurleykeller98, Rizzi03, Dolphin05}, with evidence\nfor at least two major SF episodes, one at old times ($>8$ Gyr\nago), a second at intermediate ages ($4-6{\\,{\\rm Gyr}}$ ago), and perhaps continuing into\neven more recent activity ($2{\\,{\\rm Gyr}}$ ago). Using both wide-field photometry and spectroscopic\ndata, \\citet{deBoer14b} find that about $60\\%$ of the stars in Carina \nformed in the SF episode at intermediate ages. However, interestingly, \nas the oldest episode, also the intermediate one has enriched stars \nstarting from low metallicities.\n\nGiven such a complex and episodic SF history, one would expect to\ndetect similarly clear population gradients and chemo-dynamical\ndifferences in Carina's stellar population.  Based on deep multicolour\nphotometry, \\citet{Harbeck01} find that red clump (RC) stars are indeed more\nconcentrated than the older horizontal branch stars. However, no\ndistinction in the spatial distribution of red and blue horizontal\nbranch stars can be found \\citep[a gradient that is instead very clear\n  in Sculptor,][]{Tolstoy04}.  More recently, \\citet{Battaglia12} observe an age\ngradient by selecting stellar populations of very different ages with\ncuts in the colour magnitude diagram (CMD).  This confirms the existence of\na marked age gradient over a baseline that is essentially as long as\nthe age of the universe.\n\nHowever, the presence of any gradient within the population of old red\ngiant stars is substantially less clear, as is the existence of a\ncorresponding metallicity gradient within the same population.  By\nusing a set of 437 radial velocity members, \\citet{Koch06} measure a\nvery mild chemical gradient, with metal-poor stars having an only\nslightly more extended spatial distribution. Analogously,\n\\citet{Walker11} could not identify any statistically significant\ndistinction (in either spatial distribution or kinematics) by looking\nfor two different subpopulations in a sample of more than 700 member\nred giants (RGs).\n \nBecause of their shallow potential wells, the evolutionary histories\nof dSphs are critically dependent on both properties before infall --\nfor instance virial mass and gas content -- and any subsequent\nenvironmental factors, mainly driven by the details of their\norbits. In contrast to the wide orbits of Sculptor and Fornax,\nCarina's proper motion \\citep{Piatek03} suggests a pericenter of only a\nfew tens of ${\\,{\\rm kpc}}$ from the centre of the Milky Way, which makes it more\nprone to tidal disturbances. Indeed, several investigations have\nidentified a component of `extratidal' stars around Carina\n\\citep[e.g.,][]{Majewski05, Munoz06}. Recent deep photometric studies\n\\citep{Battaglia12} suggest the presence of tenuous but extended\ntails, and \\citet{deBoer14b} has shown that these have compatible properties with Carina's metal poor\nstars \\citep[although see also][]{McMonigal14}. Interestingly, the perturbations arising from a tidal field\nhave been shown to be capable of systematically weakening chemical gradients,\nby mixing any distinct stellar subpopulations {  \\citep{Sales10,Pasetto11}}.\n\n\nIn this paper, we present a new dataset that we use in order to bring\nfurther constraints on Carina's history, based on intermediate\nresolution spectra of 956 stars. We describe how the analysis of the\nspectra has been done in order to derive the atmospheric parameters of\nthe stars, namely the effective temperature ({T$_{\\rm eff}$}), surface gravity\n({$\\log g$}) and global metallicity ({\\hbox{[M/H]}}), and how these parameters are\ncombined with high precision photometry to derive an age estimate for\nthe stars belonging to Carina.  We find evidence for the presence of\nthree distinct stellar subpopulations, and show the age-metallicity\ndiagram of Carina. Finally we comment on the possible effects of\nexternal disturbances.\n\nThe paper is organised as follows: in Sect.~\\ref{sec:data} we describe\nthe datasets used. Section~\\ref{sec:parameters} explains how the\natmospheric parameters have been derived and the ages have been\nestimated. Finally, Sect.~\\ref{sec:description} shows the results and\nSect.~\\ref{sec:conclusions} concludes.\n\n\n\n\\section{Presentation of the data}\n\\label{sec:data}\n\nThe available data include $1.3 \\times 10^4$ medium resolution spectra\nof 956 stars from the ESO-VLT large programmes, 180.B-0806, 084.B-0836\n(P.I.: G.\\,Gilmore) and our VISTA $JHK_s$ photometry. In addition, the\nphotometric data is complemented by the high-precision optical $UBVRI$\nphotometry of \\citet{Stetson11}.\n\nThe VLT datasets extend over 5 years, with some multiple observations\nof the same stars. The targets have been selected in order to sample\nthe red clump and the giant branch of Carina, and have been observed\nusing the LR8 setup of the FLAMES-GIRAFFE instrument\n($820.6-940.0{\\,{\\rm nm}}$). For the spectra reduction and sky subtraction, we\nrefer the reader to \\citet{Koch06}, since the same method has been\napplied here too.  The radial velocities have been estimated using the\nalgorithm of \\citet{Koposov11}, which delivers precise, accurate,\nradial velocities from moderate resolution spectroscopy. The algorithm\nworks by fitting synthetic templates from \\citet{Munari05} covering a\nlarge range of stellar parameters ($-2.5 <$[Fe/H] $< 0.5$, 3000 $<$\n{T$_{\\rm eff}$} $<$ 80000, 1.5 $<$ {$\\log g$} $< $5) to our spectra from each\nexposure.\n\nOnce each exposure has been put in the rest frame, we have stacked the\nmultiple exposures corresponding to each star in order to increase the\nsignal-to-noise ratio (SNR) of the data. The final SNR spans values\nfrom 2 to 50 per pixel.  Figure~\\ref{Fig:Vrad_histogram} shows the\nradial velocity distribution of the total sample of {956}\\ stars\nobserved with the LR8 setup. From this, we can see that most of the\ntargeted stars peak at a common radial velocity, as expected. The\nGaussian fit of the histogram has a mean radial velocity of\n$221.4{\\,{\\rm km~s^{-1}}}$ with a dispersion of $10{\\,{\\rm km~s^{-1}}}$, consistent with previous\ndeterminations of the radial velocity of Carina star members ranging\nfrom $220.4{\\,{\\rm km~s^{-1}}}$ to $224{\\,{\\rm km~s^{-1}}}$ and dispersions ranging from $6.8{\\,{\\rm km~s^{-1}}}$\nto $11.7{\\,{\\rm km~s^{-1}}}$ \\citep{Mateo98, Majewski05, Helmi06, Koch06, Fabrizio11,\n  Lemasle12}.\n\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_Vrad} \n\\end{center}\n\\caption{Histogram of the radial velocities for the total sample of\n  stars observed at the LR8 setup ({956}~stars). The fitted\n  Gaussian is plotted in red, and the fitting parameters are written\n  on the top left corner of the figure. The mean value and dispersion\n  of the radial velocity of Carina are in good agreement with the\n  literature vaues.}\n\\label{Fig:Vrad_histogram}\n\\end{figure}\n\n\n\n\n\\section{Extraction of the atmospheric parameters and selection of the Carina subsample}\n\\label{sec:parameters}\n\nOnce the spectra are stacked, we used an updated version of the\nautomatic parameterisation pipeline presented in \\citet{Kordopatis11a}\nto obtain the effective temperature, surface gravity and metallicity\nof the targets.  The pipeline allows us to apply soft priors according\nto the observed selection function, by removing from the solution\nspace combinations of parameters that are not expected to be found.\nThe method is based on a grid of synthetic spectra used during the\nlearning phase of the algorithm.  Only the wavelength regions\n$840-877.5{\\,{\\rm nm}}$ and $880.1-882.0{\\,{\\rm nm}}$ are selected for the\nparameterisation, the discontinuity being introduced to avoid strong\ncontamination by telluric lines {  and to keep within our wavelength range the MgI line at 8807\\AA, which is known to be sensitive to surface gravity variations} \\citep[see][]{Kordopatis11b}.\n{  Furthermore, the cores of the Calcium triplet lines are removed from the wavelength region (two pixels for the first line, and three for the other two lines, corresponding to  0.8  and  1.2\\AA,  respectively), in order to avoid a mis-match between the synthetic spectra and the observations, due to non local thermodynamical equilibrium effects.}\n\n\nThe learning grid has a constant metallicity step of $0.25{\\,{\\rm dex}}$, and\nspans effective temperatures from $[3000-8000]$\\,K, surface gravities\nfrom $[0-5]$(${\\,{\\rm cgs}}$ units) and metallicities from\n$[-5.0,+1.0]$. Finally, the $\\alpha-$enhancement of the considered\ntemplates is not a free parameter, but it varies with metallicity\n($[\\alpha/$Fe$]=-0.4\\times {\\rm {[Fe/H]}}$ in the range $-1\\leq {\\rm {[Fe/H]}} \\leq0$).\n{  We note that this adopted $\\alpha$-enhancement has no consequences for the determination of {\\hbox{[M/H]}}\\, in the case where a star does not follow the same trend \\citep[as is expected to be the case for Carina dSph stars, see][]{Venn12}. In such a case the measurement of ${\\hbox{[M/H]}}$\\, will still be sound, but {\\hbox{[M/H]}}$\\ne$[Fe/H] \\citep[see][for further details]{Kordopatis13b}.}\n\nWe used the calibration relation established for RAVE DR4 \\citep[][see\n  also \\citealt{Kordopatis15a}]{Kordopatis13b}, which employs the same\ngrid of synthetic spectra on a very similar wavelength range, to\ncorrect the metallicities of the pipeline. The calibration is a simple\nlow-order polynomial of two variables, the surface gravity and the\nmetallicity itself, and roughly corrects the metallicity of the giants\nby $\\sim0.3{\\,{\\rm dex}}$ and the one of the dwarfs by $\\sim 0.1{\\,{\\rm dex}}$. The\nadopted relation allowing to obtain the calibrated metallicity,\n{\\hbox{[M/H]}}$_c$, from the one derived from the pipeline, {\\hbox{[M/H]}}$_p$, is:\n\n \\begin{small}\n\n", "index": 1, "text": "\\begin{equation}\n\\begin{split}\n{\\hbox{[M/H]}}_{c} - {\\hbox{[M/H]}}_{p}=-0.076 - 0.006 \\times \\log g + 0.003\\times\\log^2g \\\\\n- 0.021\\times {\\hbox{[M/H]}}_{p}\\times\\log g \n+0.582\\times {\\hbox{[M/H]}}_{p}+0.205\\times {\\hbox{[M/H]}}_{p}^2.\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle{\\hbox{[M/H]}}_{c}-{\\hbox{[M/H]}}_{p}=-0.076-0.006%&#10;\\times\\log g+0.003\\times\\log^{2}g\\\\&#10;\\displaystyle-0.021\\times{\\hbox{[M/H]}}_{p}\\times\\log g+0.582\\times{\\hbox{[M/H%&#10;]}}_{p}+0.205\\times{\\hbox{[M/H]}}_{p}^{2}.\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mrow><msub><mtext>[M/H]</mtext><mi>c</mi></msub><mo>-</mo><msub><mtext>[M/H]</mtext><mi>p</mi></msub></mrow><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mn>0.076</mn></mrow><mo>-</mo><mrow><mn>0.006</mn><mo>×</mo><mrow><mi>log</mi><mo>⁡</mo><mi>g</mi></mrow></mrow></mrow><mo>+</mo><mrow><mn>0.003</mn><mo>×</mo><mrow><msup><mi>log</mi><mn>2</mn></msup><mo>⁡</mo><mi>g</mi></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mrow><mrow><mo>-</mo><mrow><mn>0.021</mn><mo>×</mo><msub><mtext>[M/H]</mtext><mi>p</mi></msub><mo>×</mo><mrow><mi>log</mi><mo>⁡</mo><mi>g</mi></mrow></mrow></mrow><mo>+</mo><mrow><mn>0.582</mn><mo>×</mo><msub><mtext>[M/H]</mtext><mi>p</mi></msub></mrow><mo>+</mo><mrow><mn>0.205</mn><mo>×</mo><msubsup><mtext>[M/H]</mtext><mi>p</mi><mn>2</mn></msubsup></mrow></mrow><mo>.</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.01589.tex", "nexttext": "\n\nwhere $\\theta_{i,k}$ corresponds to the considered parameters of the isochrones and\n$\\sigma_{\\hat \\theta_k}$ to the associated uncertainties of the\nmeasurements. It is worth mentioning that we did not include to this\nweight any additional multiplicative factor proportional to the mass\nof the stars, as suggested by \\citet[][see also\n  \\citealt{Kordopatis11b}]{Zwitter10} because this factor is useful\nonly for surveys having a mixture of dwarfs and giants. Indeed, this\nfactor defined as the stellar mass difference between two adjacent\npoints on the isochrones, is introduced in order to give additional\nweight to the likelihood of observing a dwarf, because they are\ncharacterised by slower evolutionary phases. Since our survey includes\nonly giant stars, this factor has been ignored.\n\n\n\nThe expected age $\\bar{a}$ of a given star is  then obtained by computing the weighted mean: \n\n\n", "itemtype": "equation", "pos": 21984, "prevtext": "\n\\end{small}\n\nIn what follows, only the corrected metallicities will be used, and\ntherefore we will note the calibrated metallicities simply as [M/H].\n\n As noted at the beginning of the Section, soft priors have been\n imposed on the expected results, by removing some parameter\n combinations from the solution space. For the adopted priors, we\n imposed:\n\n \\begin{itemize}\n \\item\n  an effective temperature between $4000-6500$~K,\n  \\item\n  a surface gravity lower than $3.75$, \n  \\item\n  a metallicity range between $-5$ and $+1$ (i.e. all the available metallicity range of the templates). \n  \\end{itemize}\n\nThe temperature range can be justified by the colour selection of\nCarina's candidates ($0.5<B-V<1.2$, see Fig.\\,\\ref{Fig:CMD}).  As fas as the assumption on the\nsurface gravity is concerned, the reason relies on our {\\it a priori }\nknowledge of the properties of the observed stars.  Indeed, given the\ndistance modulus of Carina \\citep[$m-M\\sim20.1$, e.g.][]{Dallora03},\nall of Carina's main sequence stars should be outside the observed\nmagnitude range.  In other words, all the stars belonging to Carina\nare expected to be either red clump stars or on the red giant\nbranch, hence with a {$\\log g$}\\ lower than 3.5.\n\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_CMD_BV} \n\\end{center}\n\\caption{Colour-magnitude diagram of the final adopted Carina sample\n  ({731}\\ members). The RC is at $(B-V)<0.7$ and $V>20$,\n  whereas the RGB contains all the stars with $(B-V)>0.7$ up to\n  $V=18$. }\n  \\label{Fig:CMD}\n\\end{figure}\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_SNR} \n\\end{center}\n\\caption{Histogram of the mean signal-to-noise ratio per pixel of the\n  spectra of the final Carina sample that is considered for the\n  analysis ({731}\\ members).}\n\\label{Fig:SNR_histogram}\n\\end{figure}\n\nThat said, one must still understand the effect of removing regions of\nthe solution space on the parameterisation of foreground stars that\nmight have the same radial velocity as Carina, and contaminate our\nsample (the risk here being to mis-parameterise a dwarf star as a\ngiant). A first statement that can be made is that given the radial\nvelocity of Carina ($221{\\,{\\rm km~s^{-1}}}$), foreground stars having a similar\nradial velocity are expected to be mainly halo stars, and therefore\ngiants.  For the few foreground stars that might still have\n{$\\log g$}$>$3.75, the algorithm will always match, by design, the\nobservations with the closest template (the latter being the one\nhaving the closest parameters as the true spectrum). This implies that\nthe derived parameters of a dwarf star will therefore be at the\nboundaries of the grid and easily identifiable. In order to make sure\nthat such contaminators are excluded from our analysis, we further\ndecided to discard all the stars for which the surface gravity is\ngreater than $3.25$, as well as the stars with a spectra having a SNR\nlower than 5\\,pixel$^{-1}$, because of the large uncertainty in the\nderived parameters. Figure~\\ref{Fig:SNR_histogram} shows the SNR\nhistogram of the Carina sample that is considered in what follows. The\nbulk of the spectra have SNR$\\sim$10 ~pixel$^{-1}$, with some of them\nhaving up to SNR$\\sim$40 ~pixel$^{-1}$. \n{  A selection of three spectra, at SNR$\\sim5, 10,20$ ~pixel$^{-1}$, with their best-fit solution are shown in Fig.~\\ref{Fig:Obs_spectra}.}\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_spec_low_SNR}\\\\\n \\includegraphics[width=0.5\\textwidth]{Carina_spec_med_SNR}\\\\\n \\includegraphics[width=0.5\\textwidth]{Carina_spec_high_SNR}\\\\\n\\end{center}\n\\caption{{  Observed (black) and fitted spectra (red) corresponding to the synthetic spectrum having the parameters of the stars for three stars having SNR$\\sim5, 10,20$ ~pixel$^{-1}$. The wavelength range has been truncated at the blue end by $40$\\AA\\, to make the plots clearer to visualise.}}\n\\label{Fig:Obs_spectra}\n\\end{figure}\n\n\n\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_errors} \n\\end{center}\n\\caption{{  Errors on the effective temperature, surface gravity, uncalibrated metallicity and calibrated metallicity as a function of signal-to-noise, for the sample of stars that we have identified as Carina members and with SNR greater than 5\\,pixel$^{-1}$. }}\n\\label{Fig:SNR_errors}\n\\end{figure}\n\nTypical uncertainties on the parameters were obtained using the error\nspectrum of each target, producing 10 Monte-Carlo realisations of\nobserved spectra and re-deriving the parameters. For {T$_{\\rm eff}$}, {$\\log g$}\\ and\n[M/H], the median uncertainties are of the order of 226{\\,{\\rm K}}, 0.48{\\,{\\rm dex}}\\,\nand 0.29{\\,{\\rm dex}}, respectively, {  with the errors being the largest for the lowest SNR values, as expected (see Fig.~\\ref{Fig:SNR_errors})}.  \n\nFigure~\\ref{Fig:CMD} shows the CMD for\nCarina for our adopted sample, colour-coded according to the\nmetallicity of the stars.  We find that the mean metallicity for the\nwhole sample is ${\\hbox{[M/H]}}\\approx-1.78$, with a large span in the derived\nvalues, ranging from $\\sim-4$ to $\\sim-0.5$. This result is in very good\nagreement with previous studies \\citep[see for example][]{Koch06}.\n \n \n\n\\subsection{Age determination of the red giant branch stars}\n\\label{sec:ages}\n\nA rough estimate of the age of the stars can be obtained by comparing the colour,\nmagnitudes and atmospheric parameters of the stars with theoretical\nisochrones.  Following \\citet{Kordopatis11b}, we constructed a library\nof isochrones with a constant step in age ($0.5{\\,{\\rm Gyr}}$) and metallicity\n($0.1{\\,{\\rm dex}}$). The step in metallicity has been chosen in order to be\nsmaller than the typical error on this parameter.  The isochrones have\nbeen computed using the online\ninterpolator\\footnote{\\url{http://stev.oapd.inaf.it/cgi-bin/cmd}} of\nthe Padova group, based on the \\citet{Marigo08} sets, for a\nmetallicity range of $[-2.1;0.1]$.\n Since the isochrones do not reach as low metallicities as the metal-poorest stars in our sample, we do not attempt to derive ages for those stars that have a metallicity that does not reach $-2.1$ within $2\\sigma_{\\tiny {\\hbox{[M/H]}}}$,  where $\\sigma_{\\tiny {\\hbox{[M/H]}}}$ is the uncertainty on the derived metallicity. \n\n\n\nThe expected age, $\\bar{a}$, of a star with parameters $\\hat \\theta_k$ ($k \\equiv {\\hbox{[M/H]}}$, $V$, $B-V$, {T$_{\\rm eff}$}, {$\\log g$}), has been obtained as follows. First, we select the set of isochrones within {\\hbox{[M/H]}}$\\pm \\sigma_{\\tiny {\\hbox{[M/H]}}}$. Then, we assign for each point $i$ on the selected isochrones a Gaussian weight $W_i$ , which depends on the distance between the points on the isochrones and the measured observables or derived parameters. In practice,  $W_i$ is computed as:\n\n \n", "index": 3, "text": "\\begin{equation}\nW_i= \\mathrm{exp}\\left(-\\sum_k \\frac{(\\theta_{i,k} - \\hat \\theta_k)^2}{2\\sigma^2_{\\hat \\theta_k}}\\right)\n\\label{eqn:weight_isochrones}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"W_{i}=\\mathrm{exp}\\left(-\\sum_{k}\\frac{(\\theta_{i,k}-\\hat{\\theta}_{k})^{2}}{2%&#10;\\sigma^{2}_{\\hat{\\theta}_{k}}}\\right)\" display=\"block\"><mrow><msub><mi>W</mi><mi>i</mi></msub><mo>=</mo><mrow><mi>exp</mi><mo>⁢</mo><mrow><mo>(</mo><mrow><mo>-</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>θ</mi><mrow><mi>i</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>σ</mi><msub><mover accent=\"true\"><mi>θ</mi><mo stretchy=\"false\">^</mo></mover><mi>k</mi></msub><mn>2</mn></msubsup></mrow></mfrac></mrow></mrow><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01589.tex", "nexttext": "\n\nwhere $a_i$ are the associated ages of the points on the isochrones. The associated error of the expected age is obtained by: \n\n\n", "itemtype": "equation", "pos": 23039, "prevtext": "\n\nwhere $\\theta_{i,k}$ corresponds to the considered parameters of the isochrones and\n$\\sigma_{\\hat \\theta_k}$ to the associated uncertainties of the\nmeasurements. It is worth mentioning that we did not include to this\nweight any additional multiplicative factor proportional to the mass\nof the stars, as suggested by \\citet[][see also\n  \\citealt{Kordopatis11b}]{Zwitter10} because this factor is useful\nonly for surveys having a mixture of dwarfs and giants. Indeed, this\nfactor defined as the stellar mass difference between two adjacent\npoints on the isochrones, is introduced in order to give additional\nweight to the likelihood of observing a dwarf, because they are\ncharacterised by slower evolutionary phases. Since our survey includes\nonly giant stars, this factor has been ignored.\n\n\n\nThe expected age $\\bar{a}$ of a given star is  then obtained by computing the weighted mean: \n\n\n", "index": 5, "text": "\\begin{equation}\n\\bar{a}=\\frac{\\sum_{i} W_{i} \\cdot   a_i}{\\sum_{i} W_i },\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\bar{a}=\\frac{\\sum_{i}W_{i}\\cdot a_{i}}{\\sum_{i}W_{i}},\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">¯</mo></mover><mo>=</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><msub><mi>W</mi><mi>i</mi></msub><mo>⋅</mo><msub><mi>a</mi><mi>i</mi></msub></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><msub><mi>W</mi><mi>i</mi></msub></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01589.tex", "nexttext": "\n\nWe assumed a distance modulus for Carina of $m-M=20.1$ and a line-of-sight $E(B-V)=0.03$~mag, as\nestimated by, e.g. \\citet{Dallora03} and \\citet{Karczmarek15}\\footnote{ {We note that our age estimation is rather robust to the adopted distance modulus. Indeed, assuming for example $m-M=20.3$\\,mag \\citep[see][for a discussion of possible values of the distance modulus]{Vandenberg15}, leads to a median change in the final ages of $0.3{\\,{\\rm Gyr}}$ with a $\\sigma$ of $1.6{\\,{\\rm Gyr}}$.}}. The\nconsidered age-range of the isochrones has been set to be between\n$1{\\,{\\rm Gyr}}$ and $13.7{\\,{\\rm Gyr}}$.  We have tested two different configurations:\none where only $V$, $(B-V)$ and the metallicity are taken into\naccount, and one where we additionally consider the information\nrelated to the effective temperatures and surface gravities.\nFigure~\\ref{Fig:Ages} shows the differences in the age estimations\naccording to these two approaches for the RGB stars only (for the RC stars, see the discussion below). We can see that our sample can\nbe separated at least into two populations, one old ($\\sim 13{\\,{\\rm Gyr}}$), and one of\nintermediate age having a peak at $\\sim7.5{\\,{\\rm Gyr}}$ and with a much\nbroader age range. This result is in good agreement with, for\nexample \\citet{Stetson11}, who fit the turn-off stars in the CMD and\nestimate that Carina has at least two populations: one of $12{\\,{\\rm Gyr}}$ and\none of $4-6{\\,{\\rm Gyr}}$, or with Norris et al. (in prep) who are completing a similar age-metallicity analysis using high-resolution spectra of giant stars.\n  In particular, we find that this intermediate age\npopulation has a tail extending to young ages, down to $1{\\,{\\rm Gyr}}$. Taking\ninto account the atmospheric parameters in\nEq.~\\ref{eqn:weight_isochrones} does not change the age distributions drastically,\nas can be seen from the dotted (with {T$_{\\rm eff}$}, {$\\log g$}) and plain\n(without {T$_{\\rm eff}$}, {$\\log g$}) histograms of Fig.~\\ref{Fig:Ages}. This\nsimilarity in the age estimations shows that our effective\ntemperatures, gravities and metallicities are consistent with the CMD\nof Carina. However, since the atmospheric parameters can have large covariances, and that the ages are not fundamentally changed when taking into account the {T$_{\\rm eff}$}\\ and the {$\\log g$}, in what follows, we have considered only the ages computed\nwithout taking into account the atmospheric parameters.\n \n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.5\\textwidth]{Carina_RGB_Ages} \n\\end{center}\n\\caption{Age distribution of the RGB stars of Carina. The dotted\n  (plain) line corresponds to age estimations with (without) taking into\n  account the information on the effective temperature and gravity. }\n\\label{Fig:Ages}\n\\end{figure}\n\nWe note that for 10 stars, no age estimation was possible. The reason\nis that they are too far from the isochrones, either because they are\nforeground contaminators, binary stars, or stars for which the\nmeasurements (metallicity and/or photometry) are of poor quality and\nwith underestimated errors. \n\n\n\\subsection{Age determination of the red clump-region stars}\n\nThe RC  stars are massive stars which have\npassed through the explosive ignition of the Helium at the RGB tip and\nare now burning the helium core.  Once all the helium in the core is\nexhausted, then the stars begin their AGB phase.  Their absolute\nmagnitude mildly depends on the metallicity and their age, with the\noldest and most metal-poor ones being also the faintest.\n\nThe determination of the age of the stars in the RC region of the CMD ($B-V\\leq 0.7$) by the projection on the\nisochrones is generally difficult to obtain because all the isochrones\npass through that region. \nA first run of our pipeline on\nthe stars in the RC-region has shown that the estimated ages of the bulk of these stars is\nsimilar to the intermediate age population of the RGB ($\\sim 7.5{\\,{\\rm Gyr}}$\nfor the RGB, $\\sim 6{\\,{\\rm Gyr}}$ for the RC-region), as expected from the observing\nbiases (at these magnitudes, we do not see the oldest RC stars with\nstill fainter magnitudes).  Nevertheless, we find a non-negligible\nfraction of stars with ages lower than $4{\\,{\\rm Gyr}}$. \n\n{  Since they do not have a counter-part (in terms of star-counts) on the RGB, \nit seems clear that the ages of the stars in the RC-region having low metallicities should have much older ages than what is derived (therefore likely being the oldest stars that have left the Horizontal Branch, and are now on the AGB}. If these stars do follow the derived age-metallicity relation of the RGB stars, then their estimated ages should be $\\sim13{\\,{\\rm Gyr}}$. Given these facts we decide, in what follows, not to take into account the ages of the RC-region stars in our analysis.\n  \n\n\n \\section{Chemodynamical separation of the stellar  populations} \n \\label{sec:description} \n \nIn order to identify and separate any chemodynamic stellar\nsubpopulations, we use the maximum likelihood technique presented by\n\\citet{Walker11} and later developed in \\citet{Amorisco12b}. \nWe model the spectroscopic target as the combination of multiple subpopulations with different intrinsic properties, including metallicity, kinematics and spatial distribution. \n{  The crucial advances in this technique are that:\n\\begin{enumerate}\n\\item\n  all available information can be used at the same time, improving\n  the quality of the population division with respect to a method that only uses one dimension at a time (for example metallicity or kinematics, separately); \n \\item\n  as a result of the population division, each single star is tagged with its membership probability to all identified subpopulations, so that with respect to the cross-contamination due to hard cuts, such a mixture model can better disentangle the properties of any different component; \n \\item\n  the number of independent subpopulations needed to best describe the data can be determined objectively, by comparing the gain in likelihood due to the increased number of populations to the growth in the number of free parameters of the model; \n \\item\n  any selection function can be explicitly taken into account. \n \\end{enumerate}\n\nDetails on the technique can be found in \\citet{Walker11} and\n\\citet{Amorisco14b}.}  The mapping of the chemodynamical subpopulations\nonto the space of stellar ages is presented in\nSect.~\\ref{sec:age_decomposition}.\n\n \n\n\\begin{table*}\n \\centering\n \n  \\caption{Three distinct chemo-dynamical subpopulations in the Carina dSph: the structural parameters.}\n  \\begin{tabular}{@{}lcccccc@{}}\n  \\hline\n   Subpop     &    $\\langle[{\\rm M/H}]\\rangle$ & StD$([{\\rm M/H}])$ & $R_{\\rm h}/$pc & $e$ & $\\langle \\sigma_{LOS}\\rangle/$kms$^{-1}$ & $f$\\\\\n\\hline\nRGB Metal Poor (MP) & $-2.4\\pm0.1$ & $0.21\\pm0.08$ & $500^{+150}_{-75}$ & $0.5\\pm0.15$ & $10.4\\pm1$ & $0.21\\pm0.06$\\\\ \nRGB Intermed. Met. (IM) & $-1.84\\pm0.05$ & $0.10\\pm0.07$ & $185\\pm20$ & $\\lesssim0.2$ & $7.6\\pm0.5$ & $0.59\\pm0.04$\\\\ \nRGB Metal Rich (MR) & $-1.0\\pm0.1$ & $0.23\\pm0.07$ & $400^{+100}_{-50}$ & $0.45^{+0.15}_{-0.1}$ & $8.5\\pm0.8$ & $0.20\\pm0.05$\\\\ \n\\hline\nRed Clump & $-1.50\\pm0.05$ & $0.50\\pm0.05$ & $225 \\pm 20$ & $0.30 \\pm0.06 $ & $8.6 \\pm 0.3$ &  -- \\\\ \n \\hline\n\\end{tabular}\n\n\\label{tab:pop_numbers}\n\\end{table*}\n\n\n\n\\subsection{Three distinct red giant branch subpopulations}\n\n\n\\begin{figure*}\n\\centering\n\\hspace{-.5cm}\n\\includegraphics[width=.5\\textwidth]{carinapops}\n\\includegraphics[width=.4\\textwidth]{carinapops0}\n\\caption{Three distinct subpopulations. \n  Left upper panel: metallicity distribution function decomposed in three populations. \n   Black: the MDF of the entire RGB sample. Blue, purple and red, respectively the \n   contributions of metal-poor, intermediate-metallicity and metal-rich populations\n   to the global RGB MDF. Note that distribution appear broader than the measured \n   intrinsic spreads because of uncertainties on the discrete metallicity measurements.\n   Left lower panel: the inference for the average velocity dispersion of the three RGB subpopulations.\n  Right panel: the spatial distribution of the {  stars having more than 75 percent probability of being members} \n  \n  (metal rich population\n  in red, intermediate metallicity in purple, metal poor in blue). Coloured ellipses display the best fitting half-light radii\n  for the each subpopulation; additionally the red clump population is in green and black lines display the position angle \n  of the photometry and direction of Carina's tidal tails. }\n\\label{pops}\n\\end{figure*}\n\n\nWe first restrict ourselves to the subset of high-probability Carina members\nbelonging to the RGB ($B-V>0.7$, 400 members)\nand investigate any chemo-dynamical sub-divisions. We find that a\ntwo-populations model is preferred over one with a single population,\nbut a model including three-populations represents the best description of the\ndata (the probability of obtaining an analogous gain in the likelihood\nfunction by pure chance is negligible, despite the additional degrees of freedom\nof the three-populations model). Table\\,\\ref{tab:pop_numbers} collects the properties of the three \nidentified subpopulations.\n\nWe find that chemistry is the main driver of the division: we identify\na metal poor (MP) population, with average metallicity of about\n$\\langle[{\\rm M/H}]\\rangle\\approx-2.4$, a population of intermediate\nmetallicity (IM, $\\langle[{\\rm M/H}]\\rangle\\approx-1.8$) and a metal\nricher (MR) population, with $\\langle[{\\rm M/H}]\\rangle\\approx-1$.\nThe upper-left panel in Fig.~\\ref{pops} displays the metallicity\ndistribution function of our sample of red giant stars and illustrates\nthe division in subpopulations.  The bulk of Carina's red giants\nbelong to the population of intermediate metallicity, collecting a\nfraction $f_{\\rm IM}\\approx60\\%$ of the total RGB population,\nsimilarly to what found by \\citet{deBoer14b}.  Note that this plot\nincludes both (i) a convolution with the individual observational\nuncertainty of each metallicity measurement and (ii) the partial\nweighing of each star with its membership probability to each\nsubpopulation. The first is responsible for the larger metallicity\nspread of each population (with respect to the intrinsic spread listed\nin Table~\\ref{tab:pop_numbers}), while the second is responsible for\nthe skewness and overlap between the different populations {   due to those stars that have similar probabilities of belonging to either population (caused by both observational uncertainties in metallicity and by the similarity between the recovered kinematical properties of the populations)}.\n\nThe right panel of Fig.~\\ref{pops} shows the spatial distribution of\nthe three subpopulations, with symbols identifying the high\nprobability members {  ($p\\geq0.75$)}.  Each ellipse corresponds to the best fitting\nelliptical half-light radius $R_{\\rm h}$, with its ellipticity and\nposition angle.  \n\n{  The properties of the spatial distributions of the different populations are obtained by assuming a parametric functional form (Plummer profile) and by fitting for the spatial distribution of discrete spectroscopic targets, following \\citet{Walker11}, but also allowing for a non zero ellipticity.}\n\n\nThe MP population is considerably elongated and\nextended. In fact, we are not entirely able to measure its half-light\nradius, as we find that its distribution in the radial range probed by\nour data is almost flat. We find that MP stars are approximately\naligned with Carina's tidal tails, as measured by\n\\citet{Battaglia12}. The MR population is somewhat less extended,\nalthough also quite spread out over our radial coverage.  On the\ncontrary, the IM population is substantially more compact and\ncentrally peaked, with a well defined half-light radius and a\ndecreasing number counts profile.\n\nIn contrast with all other previously studied dSphs, we find that the MR\npopulation is more extended than the IM population, and, accordingly, its\ncharacteristic velocity dispersion is most likely larger, as shown in the \nlower-left panel of Fig.~\\ref{pops}. \n{  This inversion can be captured even with hard cuts in metallicity, i.e. without the use of the likelihood division method. Although such a binning makes the signal weaker due to the large errors in metallicities, the trends shown in Fig.~\\ref{Fig:Simple_decompositions} indicate, indeed, that the high metallicity tail is at least as kinematically hot than the bulk of the stars in the intermediate-metallicity bin. The same cuts can be used to show that the spatial distribution of the stars in the intermediate-metallicity bin is  more compact than that of the high-metallicity tail, proving that our result is robust.}\n\n \\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.4\\textwidth]{met-kin_new} \n\\end{center}\n\\caption{ Projected velocity dispersion versus metallicity, obtained by simply binning the spectroscopic data for the RGBs. Black points are obtained using subsets of  50 RGBs each (successive bins shift by 25 stars at a time, so that not all data points are independent). All measurements are obtained through a maximum likelihood method, and the vertical error bars show $1\\sigma$ uncertainties. The wider and coloured error bars group RGB stars into wider bins, and are fully independent from each other (respectively, the three bins contain 75, 250, 75 RGBs).}\n  \\label{Fig:Simple_decompositions}\n\\end{figure}\n\nThis represents the first\ncase in which it is not possible to identify a complete parallel {\\it ordering}\nof metallicity, characteristic scale of the stellar distribution and\nkinematical state. The MR population is more extended than the\nIM population, and, at the same time, at least as kinematically hot.\nIn turn, this may provide a justifications to previous measurements of a very \nlimited global chemical gradient in both \\citet{Koch06} and \\citet{Walker11}.\n\n\n\\subsection{Comparison with the Red Clump population}\n\nWe have decided to carry out a separate analysis of the RC\npopulation, keeping it distinct from the RGB population.\nWe do not try to separate subpopulations based on chemistry within the RC, and \ninstead only measure global properties of their spatial distribution,\nkinematics and chemistry.\n\nWe use more than 400 line-of-sight velocity measurements and\nassociated spatial position for RC stars that belong to Carina with\nhigh probability. As listed in Table~\\ref{tab:pop_numbers}, we find that the RC population\nbears significant similarities with the population of intermediate\nmetallicity in the red giant branch.  Its half light radius is\ncomparable with the half light radius of the photometry and so are its\nellipticity and position angle (as shown in the right panel of\nFig.~\\ref{pops}). Note that, being on average slightly younger, it is likely\nthat the RC population probes a combination of the IM and MR red giant\nsubpopulations. Therefore, the fact that the IM population is even\nmore concentrated than the RC population is a confirmation of the\ninversion described in the previous section.  The same reasoning\napplies to the kinematics of the RC population, whose velocity\ndispersion is slightly hotter than the the one of the IM population.\n\n\n\n\\subsection{Age decomposition of the red giant branch stars}\n\\label{sec:age_decomposition}\n\nIn this section, we investigate how the chemo-dynamical\npopulation splitting we have just obtained projects into the \nspace of stellar ages. Grey points in Fig.~\\ref{pops_ages} illustrate the \nage-metallicity relation for the RGB stars we have derived \nand presented in Sect.~\\ref{sec:ages} (error-bars are also \nshown for a selection of precise measurements, where \nuncertainties are lower than $1.5{\\,{\\rm Gyr}}$). As previously noted, \ndespite Carina's narrow RGB and the well known age-metallicity \ndegeneracy which makes the uncertainty on the age of any \nsingle RG substantial, we identify a well defined age-metallicity \nrelation on the whole population, thanks to the precise photometry \nof \\citet{Stetson11} and metallicity estimates of our analysis. \n\nHigh-probability members of each subpopulation are highlighted \nin different colours in the lower panel of Fig.~\\ref{pops_ages}. They do not clearly \nseparate out in age, but the presence of a gradient in the mean \nages of the three populations is clear. The upper panel of Fig.~\\ref{pops_ages}\ndirectly projects the population split into the space of stellar ages, \nby showing the distributions of the ages of members of each stellar \nsubpopulation (as for plots in Fig.~\\ref{pops}, distributions in Fig.~\\ref{pops_ages} are \nconvolved with the uncertainties of each single age measurement, which\ncontribute to broaden each probability distribution substantially). \nWe find that the MP stellar population almost exclusively contains stars \nthat are associated with the oldest isochrone in our library ($13.7{\\,{\\rm Gyr}}$), \nthe IM has a considerable component of intermediate age stars \n($6 - 10{\\,{\\rm Gyr}}$), while, to continue the gradient, the MR population \nextends up to recent times.\n\nEven though the task of individual age estimation remains challenging, \nwe find that the chemodynamical division into subpopulations of the \nCarina dSph is globally compatible with the independent picture presented \nby its SF history. As the photometrically derived SF history suggests, \nCarina has experienced three major SF episodes. Indeed, we find \nindependent and corroboratory evidence for this in the spectroscopy: \nthree stellar subpopulations are identified, with ages compatible with \nthose indicated by the SF history.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=.45\\textwidth]{Caragedistrc2}\n\\caption{Subpopulations and ages. Upper panel: the probability\n  distribution for the age of the three distinct chemo-dynamical\n  subpopulations in Carina (metal rich in red, intermediate in purple,\n  metal poor in blue, total in black). Lower panel: the\n  age-metallicity diagram for the RGB stars in the spectroscopic\n  sample; error bars are shown only for stars with a precise age\n  estimate ($\\delta_{\\rm age}\\leq1.5$ Gyr); colored points identify\n  high-probability members {  (probability of being a member larger than 75 percent)} for each chemo-dynamical subpopulation.}\n\\label{pops_ages}\n\\end{figure}\n\n\n\n\n\\section{Discussion and Conclusions}\n\\label{sec:conclusions}\n\nWe have shown that, similar to Fornax and Sculptor, the Carina dSph is\ncharacterised by the presence of multiple stellar populations, with\ndistinct chemical properties, spatial distributions and kinematical\nstates. However, Carina appears substantially\nmore mixed than either Sculptor or Fornax, which is reflected in the\ncomparatively smaller differences among the characteristic scale\nlengths (as well as velocity dispersions) of its subpopulations. The\nMP population is more extended (and kinematically hotter) than the two\nyounger populations (respectively IM and MR). What is more notable is\nthat we find that the youngest MR population is more extended and at\nleast as kinematically hot as the IM population, with evidence for an\n{\\it inversion} of the usual ordering. Accordingly, the IM metallicity\npopulation is also more concentrated than the RC population.\n\nWhile metal richer stellar subpopulations are\ngenerally more spatially concentrated and accordingly kinematically\ncolder, the evolutionary history of Carina partially broke this common\nparallel ordering. This opens the question as to whether Carina's stellar\npopulations were formed with the properties we observe today -- and\nthen any difference from Fornax or Sculptor has to be found in the\nintrinsic properties and triggers of the SF episodes -- or whether Carina \ninitially had a more pronounced chemical gradient but this was subsequently \nperturbed by environmental factors.\n\n\\citet{Sales10} have shown that strong enough tidal disturbances may\nbe capable of homogenising the properties of multiple\nsubpopulations. They suggest that, by removing a substantial fraction\nof the outer dark matter envelope, stripping causes the velocity\ndispersion of extended populations to decrease, weakening any\nkinematical difference with more concentrated tracers. Indeed,\nCarina's proper motion suggests a pericenter of only a few tens of\n{\\,{\\rm kpc}}, which is considerably smaller than either Fornax or\nSculptor. Also, the presence of an extended extratidal component \nwould suggest tidal disturbance as a feasible mechanism to mix the\noriginally more segregated subpopulations of Carina after infall.\n\nHowever, it remains unclear whether tides alone can be responsible for\nCarina's present configuration. In particular, tidal effects are\nstrongest on more extended populations which implies that they should\nnaturally preserve any original outside-in ordering in the\ncharacteristic scales of stellar subpopulations: it seems somewhat\npuzzling that tides are capable of causing an inversion in the\nordering of the subpopulations as observed here.  As a consequence, it\nis tempting to discuss other possible mechanism that may cause such\nphenomenology.\n\nIf the current distribution of the MR population has not been altered\nby tides, then the gas from which it is was originated was initially\nmore spread out than the gas from which the IM population was born. In\nthe following we list mechanisms that may be held responsible for\nthis.\n\n\\begin{itemize}\n\\item{Ram pressure: if the MR is formed after infall, gas may have been \ndisturbed by the interaction with the corona of the Milky Way, \nin the form of ram pressure, perhaps also triggering star formation {  \\citep[see also][on how Milky Way feedback can affect the evolution of dSph satellites, even at $100{\\,{\\rm kpc}}$]{Nayakshin13}}.}\n\\item{Stellar feedback from the IM population: if not energetic enough \nto entirely remove the remaining gas, feedback would naturally result \nin the gas being distributed on more energetic orbits {  \\citep[an illustration of this effect has been recently provided by][]{El-Badry15}}. It is unclear however if the cooling necessary \nto restart star formation would newly concentrate it in the central regions.}\n\n\\item{\nInteraction with an another dwarf galaxy or dark halo, {  likely before infall,} that may have triggered the star formation and perturbed the gas by dynamical interaction.}\n\\end{itemize}\n\n\\citet{Donghia08} have suggested low mass galaxies only light up with\nstar formation when belonging to groups at intermediate redshifts.\nIndeed, star formation is quite challenging to achieve in such small\nhaloes \\citep[e.g.,][]{Read06} and the larger virial mass of a group\nmay help dwarfs to more easily retain their gas after episodes of\nintense stellar feedback \\citep[e.g.,][]{Penarrubia12,Amorisco14}.\nHere we note that interactions between low mass dwarfs may also\ncontribute in triggering and facilitating star formation, in a\nsystematic way over the population of low mass galaxies. Such interactions\nare not unfrequent in a $\\Lambda$CDM universe \\citep[e.g.,][]{Deason14,Wetzel15}, and would\njustify the fact that a fraction of the low mass members \nof the Local Group show signs suggesting a violent and active past \\citep{Kleyna03,\nColeman04, Amorisco14b, deBoer14b}.\n\n\n\n\\section*{Acknowledgments}\nWe thank the anonymous referee for comments that helped improving the quality of the paper. \nIt is a great pleasure to also thank Mike Irwin, Thomas de Boer and Else Starkenburg for many\ndiscussions and precious insight. The Dark Cosmology centre is funded\nby the DNRF.\n\n\n\n\n\\bibliographystyle{mnras} \\bibliography{../Carina}\n\n\n\n\n\n\\bsp\t\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 23258, "prevtext": "\n\nwhere $a_i$ are the associated ages of the points on the isochrones. The associated error of the expected age is obtained by: \n\n\n", "index": 7, "text": "\\begin{equation}\n\\sigma(\\bar{a})=\\sqrt{\\frac{\\sum_{i} W_i \\cdot   [\\bar{a} - a_i ]^2}{\\sum_{i} W_i }}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\sigma(\\bar{a})=\\sqrt{\\frac{\\sum_{i}W_{i}\\cdot[\\bar{a}-a_{i}]^{2}}{\\sum_{i}W_{%&#10;i}}}.\" display=\"block\"><mrow><mrow><mrow><mi>σ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">¯</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><msqrt><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><mrow><msub><mi>W</mi><mi>i</mi></msub><mo>⋅</mo><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mover accent=\"true\"><mi>a</mi><mo stretchy=\"false\">¯</mo></mover><mo>-</mo><msub><mi>a</mi><mi>i</mi></msub></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup></mrow></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><mi>i</mi></msub><msub><mi>W</mi><mi>i</mi></msub></mrow></mfrac></msqrt></mrow><mo>.</mo></mrow></math>", "type": "latex"}]