[{"file": "1601.08101.tex", "nexttext": "\nwhere $\\vartheta$ is the angle that the rays make with the normal to the surface element and $n$ is the refractive index of the medium. When translating the etendue concept to fast electron motion, the notion of a refractive index loses its meaning. The deflection of an electron as it passes through a magnetic field layer does not obey Snell's law. We will therefore be limiting ourselves to a single material and the specular reflections of electrons at the magnetic field layers. This implies that we can set the refractive index to $n=1$ and omit it from the calculation.\n\nGiven a finite sized circular source $S$ with radius $R$ emitting rays with an angular spread of opening angle $\\theta$, the total etendue of the source is\n\n", "itemtype": "equation", "pos": 5729, "prevtext": "\n\n\\title{A method to achieve rapid localised deep heating in a laser irradiated solid density target}\n\n\\author{H.~Schmitz}\n\\email{holger.schmitz@stfc.ac.uk}\n\n\\author{A.P.L.~Robinson}\n\n\\affiliation{Central Laser Facility, STFC, Rutherford Appleton Laboratory, Didcot,\nOxon., OX11 0QX}\n\n\\begin{abstract}\nRapid heating of small buried regions by laser generated fast electrons may be useful for applications such as XUV radiation sources or as drivers for shock experiments. In non-structured targets the heating profile possesses a global maximum near the front surface. This paper presents a new target design that uses resistive guiding to concentrate the fast electron current density at a finite depth inside the target. The choice of geometry uses principles of non-imaging optics. A global temperature maximum at depths up to $50\\mu$m into the target is achieved. Although theoretical calculations suggest that small source sizes should perform better than large ones, simulations show that a large angular spread at high intensities results in significant losses of the fast electrons to the sides. A systematic parameter scan suggests an optimal laser intensity. A ratio of 1.6 is demonstrated between the maximum ion temperature and the ion temperature at the front surface.\n\\end{abstract}\n\n\\keywords{fast electron, computational, plasma}\n\n\\maketitle\n\n\\setlength{\\myfiguerwidth}{\\columnwidth}\n\n\n\\section{Introduction \\label{SecIntroduction}}\n\nWhen a high intensity laser impinges on a solid density target a large part of the electromagnetic energy of the laser is converted into kinetic energy of fast moving electrons. The ponderomotive force of the laser accelerates electrons to relativistic energies and typically around 15\\% to 30\\% of the laser energy is converted \\cite{Nakatsutsumi:2008} while conversion rates up to 90\\% have been shown \\cite{Ping:2008}. These electrons can be useful for a number of different applications such as the Fast Ignition scheme for inertial confinement fusion \\cite{Tabak:1994}, ion acceleration \\cite{Wilks:2001}, or as a means to heat localised regions within the target \\cite{Robinson:2013}. In the last of these applications the local hot spots can act as XUV radiation sources \\cite{Park:2006}, as drivers for shock experiments \\cite{Robinson:2013} or as drivers of jets in laboratory astrophysics experiments \\cite{Schmitz:2015}. In all cases there is a need to control the propagation of the fast electrons inside the solid density target.\n\nOne method of influencing the propagation of fast electrons is through magnetic fields, self generated at resistivity gradients \\cite{Robinson:2007,Robinson:2012}. Using a number of materials with different Z to construct the target can generate multi kilotesla magnetic fields at the material interfaces \\cite{Robinson:2007,Ramakrishna:2010}. These magnetic fields are strongly localised to a very narrow region around the interface, on a scale length comparable to the electron skin depth. These thin magnetic field layers reflect electrons that intercept the layer at sufficiently oblique angles. It has been shown that, for reasons of symmetry, the reflection is specular \\cite{Schmitz:2012a}. Because the motion of the electrons in the homogeneous domains can be assumed to be ballistic, one can apply the concepts of geometric mirror optics to the design of targets that guide and focus fast electrons.\n\nThe aim of this paper is to investigate possible geometries for heating a small, well defined region within a solid density target. To this end, the fast electrons that originate from the laser-plasma interaction region near the critical density surface need to be focused into a small volume. The fast electron current in this volume will draw a neutralising return current of cold background electrons in order to preserve global charge neutrality. This return current is responsible for depositing the fast electron energy into the target via Ohmic heating. It is therefore the aim to concentrate the electrons as much as possible to create an optimal hot spot inside the target.\n\nIn order to understand the limitations of this endeavour, section \\ref{SecEtendue} will review the optical concept of etendue. The etendue is a conservation property that is linked to the Liouville equation and provides a quantitative measure of how well a diffuse source can be collimated. It is linked to the source radius and its angular spread. In section \\ref{SecSimulations} we will investigate the ability of specially designed targets to collimate electrons into a small region deep inside the target. The design of the targets is inspired by the concepts of non-imaging optics, specifically it will be a variant of a Compound Elliptical Concentrator (CEC) \\cite{Winston:2005}. Simulations using the ZEPHYROS code \\cite{Robinson:2012} will provide insight into electron transport and heating inside these targets. The predictions of the theory presented in section \\ref{SecEtendue} will be compared with the results of the simulation.\n\nSection \\ref{SecResults} will summarise the results and present the conclusions.\n\n\\section{Fast electron etendue \\label{SecEtendue}}\n\nIn this section we will provide a short introduction of the concept of etendue and maximum concentration in optics. The specular reflection of fast electrons at material interfaces and the ballistic motion inside the homogeneous domains allows us to treat the fast electron trajectories the same way as light rays in geometric optics. Specifically we can apply the same fundamental conservation laws to the electron dynamics. The etendue of a source which is extended over a small surface area $dS$ with rays confined to a small solid angle $d\\Omega$ is given by\n\n", "index": 1, "text": "\\begin{equation}\ndG = n^2dS\\,cos\\vartheta\\,d\\Omega,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"dG=n^{2}dS\\,cos\\vartheta\\,d\\Omega,\" display=\"block\"><mrow><mrow><mrow><mi>d</mi><mo>⁢</mo><mi>G</mi></mrow><mo>=</mo><mrow><msup><mi>n</mi><mn>2</mn></msup><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>S</mi></mpadded><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>s</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>ϑ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nHere $\\Omega_{\\theta}$ is the solid angle of the cone with half angle $\\theta$. One can show directly from Liouville's theorem that the etendue of a bundle of rays is a conserved quantity. This means that, given a second circular surface $S'$ with radius $R'$, and assuming that all rays from the source pass through $S'$ then $G'=G$, or\n\n", "itemtype": "equation", "pos": 6530, "prevtext": "\nwhere $\\vartheta$ is the angle that the rays make with the normal to the surface element and $n$ is the refractive index of the medium. When translating the etendue concept to fast electron motion, the notion of a refractive index loses its meaning. The deflection of an electron as it passes through a magnetic field layer does not obey Snell's law. We will therefore be limiting ourselves to a single material and the specular reflections of electrons at the magnetic field layers. This implies that we can set the refractive index to $n=1$ and omit it from the calculation.\n\nGiven a finite sized circular source $S$ with radius $R$ emitting rays with an angular spread of opening angle $\\theta$, the total etendue of the source is\n\n", "index": 3, "text": "\\begin{equation}\nG = \\int_0^{2\\pi}\\int_0^R\\int_{\\Omega_{\\theta}}r\\cos\\theta\\;d\\Omega\\,dr\\,d\\phi = \\pi^2 R^2 \\sin^2\\theta.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"G=\\int_{0}^{2\\pi}\\int_{0}^{R}\\int_{\\Omega_{\\theta}}r\\cos\\theta\\;d\\Omega\\,dr\\,d%&#10;\\phi=\\pi^{2}R^{2}\\sin^{2}\\theta.\" display=\"block\"><mrow><mrow><mi>G</mi><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msubsup><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>R</mi></msubsup><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>θ</mi></msub></msub><mrow><mi>r</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mpadded width=\"+2.8pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi mathvariant=\"normal\">Ω</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>r</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mi>ϕ</mi></mrow></mrow></mrow></mrow></mrow></mrow><mo>=</mo><mrow><msup><mi>π</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup><mo>⁢</mo><mrow><msup><mi>sin</mi><mn>2</mn></msup><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nHere $\\theta'$ is the cone half angle of the rays passing through $S'$. The maximum value that the angle of a bundle of forward going rays can assume is $\\theta_{\\text{max}} = \\pi/2$. This leads to a minimum value of $R'$ or a maximum concentration,\n\n", "itemtype": "equation", "pos": 7005, "prevtext": "\nHere $\\Omega_{\\theta}$ is the solid angle of the cone with half angle $\\theta$. One can show directly from Liouville's theorem that the etendue of a bundle of rays is a conserved quantity. This means that, given a second circular surface $S'$ with radius $R'$, and assuming that all rays from the source pass through $S'$ then $G'=G$, or\n\n", "index": 5, "text": "\\begin{equation}\nR' \\sin\\theta' = R \\sin\\theta.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"R^{\\prime}\\sin\\theta^{\\prime}=R\\sin\\theta.\" display=\"block\"><mrow><mrow><mrow><msup><mi>R</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><msup><mi>θ</mi><mo>′</mo></msup></mrow></mrow><mo>=</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nThe product $R\\sin\\theta$ is a measure of how well a bundle of rays can be collected and directly gives the minimum radius of a disk that this bundle can be focused onto. \n\nIn general the angular spread of fast electrons will depend on many parameters, such as the laser intensity or the laser contrast ratio. Green et al \\cite{Green:2008} compared experimental data with other results published in the literature and concluded that the angular spread increases with laser intensity. This means that, assuming a fixed power of the laser beam, the angular spread of fast electrons increases as the beam radius decreases. Thus, the beam radius and the angular spread are competing factors in an attempt to minimise $R'_{\\text{min}}$ and it is not a priori clear whether a small spot size coupled with a large angular spread is better than a large spot size coupled with a small angular spread. In order to make a prediction we use a crude fit to the data presented by Green et al \\cite{Green:2008},\n\n", "itemtype": "equation", "pos": 7318, "prevtext": "\nHere $\\theta'$ is the cone half angle of the rays passing through $S'$. The maximum value that the angle of a bundle of forward going rays can assume is $\\theta_{\\text{max}} = \\pi/2$. This leads to a minimum value of $R'$ or a maximum concentration,\n\n", "index": 7, "text": "\\begin{equation}\nR'_{\\text{min}} = R \\sin\\theta. \\label{EqRmin}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"R^{\\prime}_{\\text{min}}=R\\sin\\theta.\" display=\"block\"><mrow><mrow><msubsup><mi>R</mi><mtext>min</mtext><mo>′</mo></msubsup><mo>=</mo><mrow><mi>R</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>θ</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nThis formula is based on intensities in the range from $10^{18}\\text{W cm}^{-2}$ to $10^{21}\\text{W cm}^{-2}$.  It should be emphasised that the form above is only a rough approximation to a small data set. We use it here merely to derive an approximate functional dependence of $R'_{\\text{min}}$ on the spot radius $R$. For fixed beam power $P$ the average intensity over a circular disk is\n\n", "itemtype": "equation", "pos": 8394, "prevtext": "\nThe product $R\\sin\\theta$ is a measure of how well a bundle of rays can be collected and directly gives the minimum radius of a disk that this bundle can be focused onto. \n\nIn general the angular spread of fast electrons will depend on many parameters, such as the laser intensity or the laser contrast ratio. Green et al \\cite{Green:2008} compared experimental data with other results published in the literature and concluded that the angular spread increases with laser intensity. This means that, assuming a fixed power of the laser beam, the angular spread of fast electrons increases as the beam radius decreases. Thus, the beam radius and the angular spread are competing factors in an attempt to minimise $R'_{\\text{min}}$ and it is not a priori clear whether a small spot size coupled with a large angular spread is better than a large spot size coupled with a small angular spread. In order to make a prediction we use a crude fit to the data presented by Green et al \\cite{Green:2008},\n\n", "index": 9, "text": "\\begin{equation}\n\\theta = 17.3\\degree + 5.85\\degree \\ln\\frac{I}{10^{18}\\text{W cm}^{-2}}. \\label{EqThetaApprox}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\theta=17.3\\degree+5.85\\degree\\ln\\frac{I}{10^{18}\\text{W cm}^{-2}}.\" display=\"block\"><mrow><mrow><mi>θ</mi><mo>=</mo><mrow><mrow><mn>17.3</mn><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\degree</mtext></merror></mrow><mo>+</mo><mrow><mn>5.85</mn><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\degree</mtext></merror><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mfrac><mi>I</mi><mrow><msup><mn>10</mn><mn>18</mn></msup><mo>⁢</mo><msup><mtext>W cm</mtext><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mfrac></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nThis relation allows us to express $\\theta$, and therefore $R'_{\\text{min}}$, purely as a function of the beam radius.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=10cm]{rmin_v_r.pdf}\n\\end{center}\n\\caption{Minimum radius of fast electron beam as a function of laser spot size for various laser beam powers. The curves are limited to the region of validity of equation \\ref{EqThetaApprox}, between $I = 10^{18}\\text{W cm}^{-2}$ and $10^{21}\\text{W cm}^{-2}$.}\n\\label{FigRminVsR}\n\\end{figure}\n\nFigure \\ref{FigRminVsR} shows the dependence of $R'_{\\text{min}}$ on the beam Radius $R$ for various powers. One can see that, due to the logarithmic dependence of $\\theta$ on the intensity, the advantage of decreasing the spot radius outweighs the disadvantage of an increasing angular spread of fast electrons. The minimum achievable focusing radius increases with the power of the incident laser, as is to be expected. In addition, $R'_{\\text{min}}$ also increases with $R$ despite the fact that that angular spread decreases. For smaller values of $P$ the curves plotted in figure \\ref{FigRminVsR} stop at some maximum value of $R$. This corresponds to the radius at which the intensity drops below $I = 10^{18}\\text{W cm}^{-2}$, below which equation \\ref{EqThetaApprox} loses its justification. Although the curves seem to flatten towards this point, we expect the value of $R'_{\\text{min}}$ to steadily increase with $R$. This is due to the fact that for low intensities the value of $\\theta$ will not fall below a finite positive lower bound. Thus, the value of $\\sin\\theta$ is also bounded from below implying that $R\\sin\\theta$ will grow with $R$.\n\nThe results of this section seem to imply that it is always favourable to focus the laser spot to the smallest radius possible. This will result in a point linke source of fast electrons with a large angular spread. Given that the $\\theta$ is less than $90\\degree$ the value of $R'_{\\text{min}}$ will be below $R$ which means that the electrons can be guided into a region even smaller than the laser spot size where they can rapidly heat the target.\n\nIt should be pointed out that the values of $R'_{\\text{min}}$ presented here impose a theoretical lower limit to the size of the heated structure. Whether this limit can be achieved in a concrete experiment design will depend on other factors. As we will see in the next section, the losses of fast electrons through the magnetic field layer play an important role in designing the optimal target geometry. These losses are not included in the calculations above in which we assumed perfectly reflecting interfaces.\n\n\n\\section{Simulations \\label{SecSimulations}}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=7cm]{geometry.pdf}\n\\end{center}\n\\caption{Geometry of the target used in the simulations.}\n\\label{FigConcentrator}\n\\end{figure}\n\nIn order to evaluate the theoretical calculations we performed simulations of the electron transport in structured targets. In contrast to imaging optics, a non-imaging component does not need to map each point on some object plane uniquely onto a point on an image plane. Instead, different rays from a single point on the source may end up on different points on a receiver, depending on their path. While designing an ideal concentrator using imaging optics is highly impractical, using non-imaging optics the task is greatly simplified. Various methods are used to design non-imaging components \\cite{Winston:2005}. In the {\\em Edge Ray Approach} limiting rays originating from the edges of the source are considered and the design is chosen so that these rays hit the edges of the receiver. Geometric arguments are used to prove that rays emerging from between the edges of the source will end up between the edges of the receiver. The {\\em Flow Line Approach}, on the other hand, is more general and uses the description of the Hamiltonian flow in 6 dimensional space.\n\nThe most common designs resulting from these methods are the Compound Parabolic Concentrator (CPC) and the Compound Elliptical Concentrator (CEC). In these designs a section of a parabola or ellipse is rotated around the optical axis to create a reflecting surface. Here the symmetry axis of the parabola or ellipse is not identical to the axis of rotation and, in general, does not have to be aligned with it. While CPCs are used for infinitely distant sources (parallel rays), CECs are used for finite sized diffuse sources. \n\nIn our simulations we used a variant of a CEC. The geometry of the collector is shown in figure \\ref{FigConcentrator}. The simulations were carried out using the 3D particle hybrid code ZEPHYROS \\cite{Robinson:2012}. In all simulations presented here the bulk of the target consists of CH while the plug that acts as the collector is made from carbon. The radius of the plug at the target front surface is $R$ and the small radius inside the target is $r$ where the end surface is located. The sides of the plug are defined by a section of an ellipse that is shifted down along the $y$--axis by the small radius $r$, denoted by the red curve in figure \\ref{FigConcentrator},\n\n", "itemtype": "equation", "pos": 8913, "prevtext": "\nThis formula is based on intensities in the range from $10^{18}\\text{W cm}^{-2}$ to $10^{21}\\text{W cm}^{-2}$.  It should be emphasised that the form above is only a rough approximation to a small data set. We use it here merely to derive an approximate functional dependence of $R'_{\\text{min}}$ on the spot radius $R$. For fixed beam power $P$ the average intensity over a circular disk is\n\n", "index": 11, "text": "\\begin{equation}\nI = \\frac{P}{\\pi R^2}. \\label{EqPower}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"I=\\frac{P}{\\pi R^{2}}.\" display=\"block\"><mrow><mrow><mi>I</mi><mo>=</mo><mfrac><mi>P</mi><mrow><mi>π</mi><mo>⁢</mo><msup><mi>R</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nwhere $d$ is the depth of the plug and $a$ and $b$ are the semi-major and the semi-minor axes respectively. The centre $C$ of the ellipse lies on the front surface and the semi-minor axis has a radius of $b=R+r$. The semi-major axis is chosen such that the ellipse passes through the point $D = (d,r)$,\n\n", "itemtype": "equation", "pos": 14120, "prevtext": "\nThis relation allows us to express $\\theta$, and therefore $R'_{\\text{min}}$, purely as a function of the beam radius.\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=10cm]{rmin_v_r.pdf}\n\\end{center}\n\\caption{Minimum radius of fast electron beam as a function of laser spot size for various laser beam powers. The curves are limited to the region of validity of equation \\ref{EqThetaApprox}, between $I = 10^{18}\\text{W cm}^{-2}$ and $10^{21}\\text{W cm}^{-2}$.}\n\\label{FigRminVsR}\n\\end{figure}\n\nFigure \\ref{FigRminVsR} shows the dependence of $R'_{\\text{min}}$ on the beam Radius $R$ for various powers. One can see that, due to the logarithmic dependence of $\\theta$ on the intensity, the advantage of decreasing the spot radius outweighs the disadvantage of an increasing angular spread of fast electrons. The minimum achievable focusing radius increases with the power of the incident laser, as is to be expected. In addition, $R'_{\\text{min}}$ also increases with $R$ despite the fact that that angular spread decreases. For smaller values of $P$ the curves plotted in figure \\ref{FigRminVsR} stop at some maximum value of $R$. This corresponds to the radius at which the intensity drops below $I = 10^{18}\\text{W cm}^{-2}$, below which equation \\ref{EqThetaApprox} loses its justification. Although the curves seem to flatten towards this point, we expect the value of $R'_{\\text{min}}$ to steadily increase with $R$. This is due to the fact that for low intensities the value of $\\theta$ will not fall below a finite positive lower bound. Thus, the value of $\\sin\\theta$ is also bounded from below implying that $R\\sin\\theta$ will grow with $R$.\n\nThe results of this section seem to imply that it is always favourable to focus the laser spot to the smallest radius possible. This will result in a point linke source of fast electrons with a large angular spread. Given that the $\\theta$ is less than $90\\degree$ the value of $R'_{\\text{min}}$ will be below $R$ which means that the electrons can be guided into a region even smaller than the laser spot size where they can rapidly heat the target.\n\nIt should be pointed out that the values of $R'_{\\text{min}}$ presented here impose a theoretical lower limit to the size of the heated structure. Whether this limit can be achieved in a concrete experiment design will depend on other factors. As we will see in the next section, the losses of fast electrons through the magnetic field layer play an important role in designing the optimal target geometry. These losses are not included in the calculations above in which we assumed perfectly reflecting interfaces.\n\n\n\\section{Simulations \\label{SecSimulations}}\n\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=7cm]{geometry.pdf}\n\\end{center}\n\\caption{Geometry of the target used in the simulations.}\n\\label{FigConcentrator}\n\\end{figure}\n\nIn order to evaluate the theoretical calculations we performed simulations of the electron transport in structured targets. In contrast to imaging optics, a non-imaging component does not need to map each point on some object plane uniquely onto a point on an image plane. Instead, different rays from a single point on the source may end up on different points on a receiver, depending on their path. While designing an ideal concentrator using imaging optics is highly impractical, using non-imaging optics the task is greatly simplified. Various methods are used to design non-imaging components \\cite{Winston:2005}. In the {\\em Edge Ray Approach} limiting rays originating from the edges of the source are considered and the design is chosen so that these rays hit the edges of the receiver. Geometric arguments are used to prove that rays emerging from between the edges of the source will end up between the edges of the receiver. The {\\em Flow Line Approach}, on the other hand, is more general and uses the description of the Hamiltonian flow in 6 dimensional space.\n\nThe most common designs resulting from these methods are the Compound Parabolic Concentrator (CPC) and the Compound Elliptical Concentrator (CEC). In these designs a section of a parabola or ellipse is rotated around the optical axis to create a reflecting surface. Here the symmetry axis of the parabola or ellipse is not identical to the axis of rotation and, in general, does not have to be aligned with it. While CPCs are used for infinitely distant sources (parallel rays), CECs are used for finite sized diffuse sources. \n\nIn our simulations we used a variant of a CEC. The geometry of the collector is shown in figure \\ref{FigConcentrator}. The simulations were carried out using the 3D particle hybrid code ZEPHYROS \\cite{Robinson:2012}. In all simulations presented here the bulk of the target consists of CH while the plug that acts as the collector is made from carbon. The radius of the plug at the target front surface is $R$ and the small radius inside the target is $r$ where the end surface is located. The sides of the plug are defined by a section of an ellipse that is shifted down along the $y$--axis by the small radius $r$, denoted by the red curve in figure \\ref{FigConcentrator},\n\n", "index": 13, "text": "\\begin{equation}\n\\frac{x^2}{a^2} + \\frac{(y+r)^2}{b^2} = 1 \\quad \\text{with} \\quad y>0, 0\\le x \\le d,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\frac{x^{2}}{a^{2}}+\\frac{(y+r)^{2}}{b^{2}}=1\\quad\\text{with}\\quad y&gt;0,0\\leq x%&#10;\\leq d,\" display=\"block\"><mrow><mrow><mrow><mrow><mfrac><msup><mi>x</mi><mn>2</mn></msup><msup><mi>a</mi><mn>2</mn></msup></mfrac><mo>+</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>y</mi><mo>+</mo><mi>r</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><msup><mi>b</mi><mn>2</mn></msup></mfrac></mrow><mo>=</mo><mrow><mn>1</mn><mo mathvariant=\"italic\" separator=\"true\"> </mo><mtext>with</mtext></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\"> </mo><mrow><mrow><mi>y</mi><mo>&gt;</mo><mn>0</mn></mrow><mo>,</mo><mrow><mn>0</mn><mo>≤</mo><mi>x</mi><mo>≤</mo><mi>d</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nThis section is then rotated around the $x$--axis to create the rotationally symmetric collector. Note that typical CEC geometries prescribe the locations of the focal points in order to optimise the number of rays collected onto the end surface. Here we do not impose such a restriction due to a number of other constraints imposed by the nature of the fast electron transport. Firstly we don't expect the fast electrons to travel arbitrary distances inside the solid density target before losing their energy. This means that we want to retain the depth $d$ as one of the free parameters. Fixing the focal points implies that $d$ is a function of $r$ and $R$ and can not be chosen freely. Secondly our geometry ensures that the ellipse intersects the front surface of the target at a right angle. This minimises the losses of fast electrons through the material interface.\n\n\\begin{table}[]\n\\begin{center}\n\\begin{tabular}{|l|l|l|l|l|l|l|l|}\n\\hline\nRun & \\makecell{Power\\\\ \\hline $10^{13}$W} & \\makecell{$R_{\\text{spot}}$ \\\\ \\hline $\\mu\\text{m}$} & \\makecell{$I/10^{18}$ \\\\ \\hline $\\text{W\\;cm}^{-2}$} & \\makecell{$R$ \\\\ \\hline $\\mu\\text{m}$} & \\makecell{$r = R_{\\text{min}}$ \\\\ \\hline $\\mu\\text{m}$} & $\\theta$ & \\makecell{$d$ \\\\ \\hline $\\mu\\text{m}$}\\\\ \\hline\nA$_{30}$, A$_{40}$, A$_{50}$   & 8                  & 5                               & 101.86                      & 10               & 6.99                              & 0.774   & 30, 40, 50 \\\\ \\hline\nB$_{30}$, B$_{40}$, B$_{50}$   & 8                  & 10                              & 25.47                       & 20               & 11.823                            & 0.632   & 30, 40, 50 \\\\ \\hline\nC$_{30}$, C$_{40}$, C$_{50}$   & 8                  & 20                              & 6.37                        & 40               & 18.858                            & 0.491   & 30, 40, 50 \\\\ \\hline\nD$_{30}$, D$_{40}$, D$_{50}$   & 2                  & 5                               & 25.47                       & 10               & 5.9114                            & 0.632   & 30, 40, 50 \\\\ \\hline\nE$_{30}$, E$_{40}$, E$_{50}$   & 2                  & 10                              & 6.37                        & 20               & 9.4290                            & 0.491   & 30, 40, 50 \\\\ \\hline\nF$_{30}$, F$_{40}$, F$_{50}$   & 2                  & 20                              & 1.5915                      & 40               & 13.693                            & 0.349   & 30, 40, 50 \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\caption{Overview of the parameters of the ZEPHYROS simulation runs.}\n\\label{tblSimulationParams}\n\\end{table}\n\nWe performed two sets of runs, each with fixed power but varying laser spot sizes. The first set of runs (A$_d$, B$_d$, and C$_d$) used a laser power of $P=8\\times 10^{13}$W, the second set (runs D$_d$, E$_d$, and F$_d$) used $P=2\\times 10^{13}$W. For each power three laser spot sizes, $R_{\\text{spot}}=5$, $10$, and $20\\mu$m were considered. For each run the average intensity  and the fast electron spread were calculated using equations \\ref{EqPower} and \\ref{EqThetaApprox}. In all cases the front radius of the collector was chosen to be twice the laser spot radius in order to increase the number of fast electrons captured. Using equation \\ref{EqRmin} with the front collector radius, the minimum radius $R_{\\text{min}}$ was determined. This value was used for the small radius of the collector $r = R_{\\text{min}}$. In each case, three runs with depth $d = 30, 40, $ and $50\\mu$m were performed. An overview of the parameters can be seen in table \\ref{tblSimulationParams}.\n\nIn all simulation runs a box size of $300\\times300\\times200$ was chosen. The cell size was $\\Delta x=0.5\\mu$m, resulting in a box of size $150\\times150\\times100\\mu\\text{m}^2$. The laser was incident on the left boundary for 1ps and the total duration of the simulation was 2ps. The beam has a Gaussian transverse profile with a radius of $R_{\\text{spot}}$ and an intensity of $I$ as given in table \\ref{tblSimulationParams}. The laser is not simulated directly but is used to inject fast electrons into the simulation domain. The electrons have an exponential energy distribution with a temperature of $T_f$ given by Wilks' scaling \\cite{Wilks:1992}\n\n", "itemtype": "equation", "pos": 14540, "prevtext": "\nwhere $d$ is the depth of the plug and $a$ and $b$ are the semi-major and the semi-minor axes respectively. The centre $C$ of the ellipse lies on the front surface and the semi-minor axis has a radius of $b=R+r$. The semi-major axis is chosen such that the ellipse passes through the point $D = (d,r)$,\n\n", "index": 15, "text": "\\begin{equation}\na = \\frac{bd}{\\sqrt{b^2-4r^2}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"a=\\frac{bd}{\\sqrt{b^{2}-4r^{2}}}.\" display=\"block\"><mrow><mrow><mi>a</mi><mo>=</mo><mfrac><mrow><mi>b</mi><mo>⁢</mo><mi>d</mi></mrow><msqrt><mrow><msup><mi>b</mi><mn>2</mn></msup><mo>-</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow></mrow></msqrt></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.08101.tex", "nexttext": "\nwhere $I$ is taken in units of $10^{18}\\text{W\\;cm}^{-2}$ and the laser wavelength $\\lambda_L$ is given in units of $\\mu\\text{m}$. The resistivity of the target is calculated using the model of Lee and More \\cite{Lee:1984}.\n\n\\section{Results\\label{SecResults}}\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[width=0.33\\textwidth]{by_10_40_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{by_20_40_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{by_40_40_CH_C.pdf}\n\\end{center}\n\\caption{The out of plane magnetic field $B_y$ at the end of the simulation. The length of the collector is $40\\mu$m and the power is $P=8\\times10^{13} W$. The laser spot radius is $R=5\\mu$m (run A$_{40}$, left panel), $10\\mu$m (run B$_{40}$, middle panel), and $20\\mu$m (run C$_{40}$, right panel). The opening radius of the collector is twice the laser spot radius. The electron divergence angle is calculated from equation \\ref{EqThetaApprox} and the small radius of the collector is chosen to be equal to $R'_{\\text{min}}$ given by equation \\ref{EqRmin}}\n\\label{FigBySurface}\n\\end{figure}\n\nFigure \\ref{FigBySurface} shows the out of plane magnetic field $B_y$ for the runs A$_{40}$, B$_{40}$, and C$_{40}$ with $R_{\\text{spot}}=5$, $10$, and $20\\mu$m respectively at the end of the simulation. In all cases the sharp resistivity gradient at the material interface results in magnetic field strengths of around 600 to 800T. Note that no magnetic field is observed at the circular tip of the concentrator. This is to be expected since the fast electron current here is perpendicular to the surface, and only the parallel component of the fast electron current generates a magnetic field. At larger radii another, more diffuse magnetic field is observed. This field is caused by the radial gradient of the fast electron current. The radial location of the field scales with the radius of the laser spot size. Due to the angular spread of the electrons this field is not able to contain the fast electrons.\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[width=0.33\\textwidth]{ti_10_40_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_20_40_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_40_40_CH_C.pdf}\n\\end{center}\n\\caption{The ion temperature at the end of the simulation for runs A$_{40}$ (left panel), B$_{40}$ (middle panel), and C$_{40}$ (right panel).}\n\\label{FigTiSurface}\n\\end{figure}\n\nFigure \\ref{FigTiSurface} shows the ion temperature $T_i$ inside the target for a slice $z=0$ for runs A$_{40}$, B$_{40}$, and C$_{40}$ . In section \\ref{SecEtendue} it was shown that a smaller spot radius implies a smaller etendue value and hence better focusability onto a small surface. One might anticipate that smaller etendue will improve the ability to deposit the electron energy into a small volume inside the target. Comparing the three panels of figure \\ref{FigTiSurface} one can see that the overall heated volume indeed increases with spot radius. However, for the smallest radius of $R_{\\text{spot}}=5\\mu$m (run A$_{40}$) the energy deposited is concentrated in the first 15$\\mu$m near the front surface of the target, at $x=0$. There is almost no heating present near the tip of the collector geometry. Traces of fast electrons escaping the carbon plug at large angles can be seen beyond 15$\\mu$m inside the target. This indicates that fast electrons are escaping the concentrator. Due to the high intensity of the laser beam for this power and at this spot radius the angular spread has a half angle of around $44\\degree$. In addition, higher intensities correspond to higher electron energies according to equation \\ref{EqWilksScaling}. Both factors reduce the ability of the self generated magnetic field at the carbon--CH material boundary to reflect the electrons. In figure \\ref{FigTiAxis} the ion temperature $T_i$ is plotted along the $x$--axis for the runs A$_d$, B$_d$ and C$_d$ with $d=30\\mu$m (left panel), $d=40\\mu$m (middle panel), and $d=50\\mu$m (right panel). For all three values of $d$ the temperature of runs A$_d$ show similar profiles with a maximum of over 900eV near the front surface and quickly falling off to below 300eV for $x\\gtrsim 30\\mu$m. \n\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[width=0.33\\textwidth]{ti_axis_30_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_axis_40_CH_C.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_axis_50_CH_C.pdf}\n\\end{center}\n\\caption{The ion temperature at the end of the simulation along the simulation axis for different spot radii $R$. The power is $P=8\\times10^{13} W$. The length of the collector is $L=30\\mu$m (left panel), $40\\mu$m (middle panel), and $50\\mu$m (right panel). The opening radius of the collector is twice the laser spot radius. The electron divergence angle is calculated from equation \\ref{EqThetaApprox} and the small radius of the collector is chosen to be equal to $R'_{\\text{min}}$ given by equation \\ref{EqRmin}}\n\\label{FigTiAxis}\n\\end{figure}\n\nFor a laser spot radius of $R_{\\text{spot}}=10\\mu$m, run B$_{40}$, the number of escaping electrons is greatly reduced and the carbon plug is heated more evenly and to greater depths, as can be seen in the middle panel of figure \\ref{FigTiSurface}. With a maximum around 550eV the ion temperature is lower than what was seen for run A$_{40}$ . However, the heated region extends all the way to the tip of the collector and beyond. Two feature are visible. Inside the collector region a heated structure converging from the edge of the collector at the front surface towards the centre near $x\\approx25\\mu$m. This feature seems to be caused by fast electrons being redirected by the magnetic field just as they are injected at the front surface. A second feature can be seen at the tip of the collector and beyond. An increased temperature is observed at the material interface around the outer edge for $x>30\\mu$m and in the direct extension of this interface up to $x\\approx 50\\mu$m in the CH cladding. The heating in this region is caused by fast electrons being guided along the outer edge of the collector and subsequently leaving the tip at a tangential direction. The on-axis temperature profiles for runs B$_d$, $d=30, 40, 50\\mu$m in figure \\ref{FigTiAxis} show little dependence on the length of the collector. In all three cases the temperature profile is almost flat around 530eV up to a depth of $x\\approx 30\\mu$m. Deeper into the target, the temperature falls off. The rate of decrease is smaller for the $R_{\\text{spot}}=10\\mu$m runs compared with the $R_{\\text{spot}}=5\\mu$m runs and for $x\\gtrsim20\\mu$m the ion temperature for runs B$_d$ is larger than the ion temperature for runs A$_d$, independent of the value of $d$.\n\nWhen the laser spot is increased to $R_{\\text{spot}}=20\\mu$m in run C$_{40}$ the two features that are observed in run B$_{40}$ are still present but they now overlap due to the modified aspect ratio of the collector geometry, as can be seen in the right panel of figure \\ref{FigTiSurface}. The heated region originating from the edge of the collector at the front surface converges to a point just beyond the tip of the collector around $x\\approx45\\mu$m. At the same time electrons are guided tangentially along the outer edges of the geometry and leave the collector to converge in the same region. This results in an increase in heating just beyond the tip, inside the CH material. The temperature profiles along the $x$--axis shown in figure \\ref{FigTiAxis} confirm this behaviour. For all three values of $d$ the temperature profile is flat around 350eV for small values of $x$. An increase in temperature can be observed inside the target and the location of the maximum depends on the value of $d$. This indicates that the guiding structure of the collector is indeed responsible for the increase in heating deep inside the target.\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=0.33\\textwidth]{ti_10_40_CH_C_P025.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_20_40_CH_C_P025.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_40_40_CH_C_P025.pdf}\n\\end{center}\n\\caption{The ion temperature at the end of the simulation. The length of the collector is $40\\mu$m and the power is $P=2\\times10^{13} W$. The laser spot radius is $R=5\\mu$m (run D$_{40}$, left panel), $10\\mu$m (run E$_{40}$, middle panel), and $20\\mu$m (run F$_{40}$, right panel). The opening radius of the collector is twice the laser spot radius. The electron divergence angle is calculated from equation \\ref{EqThetaApprox} and the small radius of the collector is chosen to be equal to $R'_{\\text{min}}$ given by equation \\ref{EqRmin}}\n\\label{FigTiSurfaceLowPower}\n\\end{figure}\n\nFigures \\ref{FigTiSurfaceLowPower} and \\ref{FigTiAxisLowPower} show the results for runs D$_d$, E$_d$, and F$_d$, with $d=30, 40,$ and $50\\mu$m. Here the spot radii are chosen as in runs A$_d$, B$_d$, and C$_d$, but the laser power is reduced by a factor of 4. This means that the laser intensity in runs D$_d$ with $R_{\\text{spot}}=5\\mu$m is the same as in runs A$_d$ with $R_{\\text{spot}}=10\\mu$m. Similarly, the laser intensity in runs E$_d$ with $R_{\\text{spot}}=10\\mu$m is the same as in runs B$_d$ with $R_{\\text{spot}}=20\\mu$m. The temperature distribution resulting from run D$_{40}$ can be seen in the left panel of figure \\ref{FigTiSurfaceLowPower}. The figure shares some similarities with those seen for run A$_{40}$ and some with run B$_{40}$. The temperature initially plateaus but only up to a depth of $x\\approx 15\\mu$m beyond which it drops off rapidly. The heated region converging from the collector edges at the front surface also converges to around $x\\approx 15\\mu$m. Figure \\ref{FigTiAxisLowPower} shows that this behaviour is independent of the collector length $d$. \n\n\n\\begin{figure}[ht]\n\\begin{center}\n\\includegraphics[width=0.33\\textwidth]{ti_axis_30_CH_C_P025.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_axis_40_CH_C_P025.pdf}\\hfill\n\\includegraphics[width=0.33\\textwidth]{ti_axis_50_CH_C_P025.pdf}\n\\end{center}\n\\caption{The ion temperature at the end of the simulation along the simulation axis for different spot radii $R$. The power is $P=8\\times10^{13} W$. The length of the collector is $L=30\\mu$m (left panel), $40\\mu$m (middle panel), and $50\\mu$m (right panel). The opening radius of the collector is twice the laser spot radius. The electron divergence angle is calculated from equation \\ref{EqThetaApprox} and the small radius of the collector is chosen to be equal to $R'_{\\text{min}}$ given by equation \\ref{EqRmin}}\n\\label{FigTiAxisLowPower}\n\\end{figure}\n\nFor run E$_{40}$ with $R_{\\text{spot}}=10\\mu$m and low power the behaviour is very similar to run B$_d$ with $R_{\\text{spot}}=20\\mu$m. The temperature is low near the front surface but increases beyond the tip of the collector deep inside the target. The on-axis temperature profiles for runs E$_d$ shown in figure \\ref{FigTiAxisLowPower} show that the location and magnitude of the temperature maximum depend on the value of $d$. For the cases considered here, the optimum length of the collector is $d=30\\mu$m. In this case the temperature shows a sharp peak at $x=30\\mu$m with a temperature above 560eV, compared to the plateau at 350eV. This corresponds to a factor of 1.6 between the maximum and the baseline. Finally, for runs F$_d$ the laser intensity has the lowest value of all the runs considered here. The low intensity results in a small fast electron temperature according to equation \\ref{EqWilksScaling}. The fast electrons are only mildly relativistic and susceptible to the filamentation instability which is enhanced by the low divergence half angle of around $20\\degree$. This results in a patchy heating profile and a loss of the electron energy near the front surface of the target, as can be seen in the right panel of figure \\ref{FigTiAxisLowPower}.\n\n\\section{Summary and Conclusions}\n\nWe have performed simulations of fast electron transport with the aim of heating a small region deep inside the target and producing a temperature maximum at finite depth. Using self generated magnetic fields at resistivity gradients, the trajectories of laser generated fast electron current can be manipulated. The return current carried by the background electrons neutralises the fast electron current and causes Ohmic heating. Using this mechanism it is possible to control the heating profile inside the target. It has been shown that principles of geometrical mirror optics can be used to calculate the fast electron trajectories which play the role of the light rays in optics. Using the inventory of non-imaging optics a target geometry was designed similar to a Compound Elliptical Concentrator. We have shown that this geometry allows the energy density deposited to increase at some finite depth inside the target. A factor of 1.6 of the peak ion temperature ratio to the ion temperature at the front surface has been demonstrated with the peak temperature lying roughly $30\\mu$m into the target.\n\nThe results of the simulations indicate that there is an optimal range for the intensity of the laser beam for focusing fast electrons deep inside the target. Electrons originating from relatively low intensity beams with large spot size and small angular divergence can create a heated region inside the target with a global temperature maximum. At first glance, this seems to be in contradiction to the calculations presented is section \\ref{SecEtendue}. These calculations revise the etendue concept of non-imaging optics in the context of fast electron transport. They predict that small sources of fast electrons with large angular spread result in better focusability than large sources with small angular spread resulting from a laser beam with the same total power. The calculations don't take into account any losses of electrons. The conclusion is that the etendue must be seen as a theoretical limit to the focusability of the fast electron beam but cannot be taken as a prediction for the actual heating profile. \n\nThe discrepancy between the simulations and the predictions of section \\ref{SecEtendue} is mainly due to electron loss through the magnetic field layers. A small spot size implies a large intensity and this results in a large angular divergence of the fast electrons together with a high average kinetic energy. High energy electrons that impinge on the magnetic field layer at large angles are not effectively reflected due to their increased Larmor radius. These electrons are lost through the boundaries of the collector geometry, reducing the heating further into the target. \n\n\n\\section*{Acknowledgments}\nThis work is funded by the European Research Council, grant STRUCMAGFAST. The authors would like to thank M.~Tabak for many fruitful discussions.\n\n\n\\bibliographystyle{apsrev}       \n\n\\begin{thebibliography}{15}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname bibnamefont\\endcsname\\relax\n  \\def\\bibnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname bibfnamefont\\endcsname\\relax\n  \\def\\bibfnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname citenamefont\\endcsname\\relax\n  \\def\\citenamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem[{\\citenamefont{Nakatsutsumi et~al.}(2008)\\citenamefont{Nakatsutsumi,\n  Davies, Kodama, Green, Lancaster, Akli, Beg, Chen, Clark, Freeman\n  et~al.}}]{Nakatsutsumi:2008}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Nakatsutsumi}},\n  \\bibinfo{author}{\\bibfnamefont{J.~R.} \\bibnamefont{Davies}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Kodama}},\n  \\bibinfo{author}{\\bibfnamefont{J.~S.} \\bibnamefont{Green}},\n  \\bibinfo{author}{\\bibfnamefont{K.~L.} \\bibnamefont{Lancaster}},\n  \\bibinfo{author}{\\bibfnamefont{K.~U.} \\bibnamefont{Akli}},\n  \\bibinfo{author}{\\bibfnamefont{F.~N.} \\bibnamefont{Beg}},\n  \\bibinfo{author}{\\bibfnamefont{S.~N.} \\bibnamefont{Chen}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Clark}},\n  \\bibinfo{author}{\\bibfnamefont{R.~R.} \\bibnamefont{Freeman}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{New Journal of Physics}\n  \\textbf{\\bibinfo{volume}{10}}, \\bibinfo{pages}{043046}\n  (\\bibinfo{year}{2008}),\n  \\urlprefix\\url{http://iopscience.iop.org/1367-2630/10/4/043046}.\n\n\\bibitem[{\\citenamefont{Ping et~al.}(2008)\\citenamefont{Ping, Shepherd,\n  Lasinski, Tabak, Chen, Chung, Fournier, Hansen, Kemp, Liedahl\n  et~al.}}]{Ping:2008}\n\\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Ping}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Shepherd}},\n  \\bibinfo{author}{\\bibfnamefont{B.~F.} \\bibnamefont{Lasinski}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Tabak}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Chen}},\n  \\bibinfo{author}{\\bibfnamefont{H.~K.} \\bibnamefont{Chung}},\n  \\bibinfo{author}{\\bibfnamefont{K.~B.} \\bibnamefont{Fournier}},\n  \\bibinfo{author}{\\bibfnamefont{S.~B.} \\bibnamefont{Hansen}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Kemp}},\n  \\bibinfo{author}{\\bibfnamefont{D.~A.} \\bibnamefont{Liedahl}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Physical Review Letters}\n  \\textbf{\\bibinfo{volume}{100}}, \\bibinfo{pages}{085004}\n  (\\bibinfo{year}{2008}),\n  \\urlprefix\\url{http://dx.doi.org/10.1103/PhysRevLett.100.085004}.\n\n\\bibitem[{\\citenamefont{Tabak et~al.}(1994)\\citenamefont{Tabak, Hammer,\n  Glinsky, Kruer, Wilks, Woodworth, Campbell, Perry, and Mason}}]{Tabak:1994}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Tabak}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Hammer}},\n  \\bibinfo{author}{\\bibfnamefont{M.~E.} \\bibnamefont{Glinsky}},\n  \\bibinfo{author}{\\bibfnamefont{W.~L.} \\bibnamefont{Kruer}},\n  \\bibinfo{author}{\\bibfnamefont{S.~C.} \\bibnamefont{Wilks}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Woodworth}},\n  \\bibinfo{author}{\\bibfnamefont{E.~M.} \\bibnamefont{Campbell}},\n  \\bibinfo{author}{\\bibfnamefont{M.~D.} \\bibnamefont{Perry}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~J.} \\bibnamefont{Mason}},\n  \\bibinfo{journal}{Physics of Plasmas} \\textbf{\\bibinfo{volume}{1}},\n  \\bibinfo{pages}{1626} (\\bibinfo{year}{1994}), ISSN \\bibinfo{issn}{1070664X},\n  \\urlprefix\\url{http://link.aip.org/link/PHPAEN/v1/i5/p1626/s1\\&Agg=doi}.\n\n\\bibitem[{\\citenamefont{Wilks et~al.}(2001)\\citenamefont{Wilks, Langdon, Cowan,\n  Roth, Singh, Hatchett, Key, Pennington, MacKinnon, and Snavely}}]{Wilks:2001}\n\\bibinfo{author}{\\bibfnamefont{S.~C.} \\bibnamefont{Wilks}},\n  \\bibinfo{author}{\\bibfnamefont{a.~B.} \\bibnamefont{Langdon}},\n  \\bibinfo{author}{\\bibfnamefont{T.~E.} \\bibnamefont{Cowan}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Roth}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Singh}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Hatchett}},\n  \\bibinfo{author}{\\bibfnamefont{M.~H.} \\bibnamefont{Key}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Pennington}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{MacKinnon}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.~a.}\n  \\bibnamefont{Snavely}}, \\bibinfo{journal}{Physics of Plasmas}\n  \\textbf{\\bibinfo{volume}{8}}, \\bibinfo{pages}{542} (\\bibinfo{year}{2001}),\n  ISSN \\bibinfo{issn}{1070664X},\n  \\urlprefix\\url{http://scitation.aip.org/content/aip/journal/pop/8/2/10.1063/1.1333697}.\n\n\\bibitem[{\\citenamefont{Robinson et~al.}(2013)\\citenamefont{Robinson, Schmitz,\n  and Pasley}}]{Robinson:2013}\n\\bibinfo{author}{\\bibfnamefont{A.~P.~L.} \\bibnamefont{Robinson}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Schmitz}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Pasley}},\n  \\bibinfo{journal}{Physics of Plasmas} \\textbf{\\bibinfo{volume}{20}},\n  \\bibinfo{pages}{122701} (\\bibinfo{year}{2013}), ISSN\n  \\bibinfo{issn}{1070664X},\n  \\urlprefix\\url{http://scitation.aip.org/content/aip/journal/pop/20/12/10.1063/1.4838238}.\n\n\\bibitem[{\\citenamefont{Park et~al.}(2006)\\citenamefont{Park, Chambers, Chung,\n  Clarke, Eagleton, Giraldez, Goldsack, Heathcote, Izumi, Key\n  et~al.}}]{Park:2006}\n\\bibinfo{author}{\\bibfnamefont{H.-S.} \\bibnamefont{Park}},\n  \\bibinfo{author}{\\bibfnamefont{D.~M.} \\bibnamefont{Chambers}},\n  \\bibinfo{author}{\\bibfnamefont{H.-K.} \\bibnamefont{Chung}},\n  \\bibinfo{author}{\\bibfnamefont{R.~J.} \\bibnamefont{Clarke}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Eagleton}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Giraldez}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Goldsack}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Heathcote}},\n  \\bibinfo{author}{\\bibfnamefont{N.}~\\bibnamefont{Izumi}},\n  \\bibinfo{author}{\\bibfnamefont{M.~H.} \\bibnamefont{Key}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Physics of Plasmas}\n  \\textbf{\\bibinfo{volume}{13}}, \\bibinfo{pages}{056309}\n  (\\bibinfo{year}{2006}), ISSN \\bibinfo{issn}{1070664X},\n  \\urlprefix\\url{http://scitation.aip.org/content/aip/journal/pop/13/5/10.1063/1.2178775}.\n\n\\bibitem[{\\citenamefont{Schmitz and Robinson}(2015)}]{Schmitz:2015}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Schmitz}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Robinson}},\n  \\bibinfo{journal}{High Energy Density Physics} \\textbf{\\bibinfo{volume}{15}},\n  \\bibinfo{pages}{82} (\\bibinfo{year}{2015}), ISSN \\bibinfo{issn}{15741818},\n  \\urlprefix\\url{http://linkinghub.elsevier.com/retrieve/pii/S1574181815000403}.\n\n\\bibitem[{\\citenamefont{Robinson and Sherlock}(2007)}]{Robinson:2007}\n\\bibinfo{author}{\\bibfnamefont{A.~P.~L.} \\bibnamefont{Robinson}}\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Sherlock}},\n  \\bibinfo{journal}{Physics of Plasmas} \\textbf{\\bibinfo{volume}{14}},\n  \\bibinfo{pages}{083105} (\\bibinfo{year}{2007}),\n  \\urlprefix\\url{http://dx.doi.org/10.1063/1.2768317}.\n\n\\bibitem[{\\citenamefont{Robinson et~al.}(2012)\\citenamefont{Robinson, Key, and\n  Tabak}}]{Robinson:2012}\n\\bibinfo{author}{\\bibfnamefont{A.~P.~L.} \\bibnamefont{Robinson}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Key}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Tabak}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{108}},\n  \\bibinfo{pages}{1} (\\bibinfo{year}{2012}), ISSN \\bibinfo{issn}{0031-9007},\n  \\urlprefix\\url{http://link.aps.org/doi/10.1103/PhysRevLett.108.125004}.\n\n\\bibitem[{\\citenamefont{Ramakrishna et~al.}(2010)\\citenamefont{Ramakrishna,\n  Kar, Robinson, Adams, Markey, Quinn, Yuan, McKenna, Lancaster, Green\n  et~al.}}]{Ramakrishna:2010}\n\\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Ramakrishna}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Kar}},\n  \\bibinfo{author}{\\bibfnamefont{A.~P.~L.} \\bibnamefont{Robinson}},\n  \\bibinfo{author}{\\bibfnamefont{D.~J.} \\bibnamefont{Adams}},\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Markey}},\n  \\bibinfo{author}{\\bibfnamefont{M.~N.} \\bibnamefont{Quinn}},\n  \\bibinfo{author}{\\bibfnamefont{X.~H.} \\bibnamefont{Yuan}},\n  \\bibinfo{author}{\\bibfnamefont{P.}~\\bibnamefont{McKenna}},\n  \\bibinfo{author}{\\bibfnamefont{K.~L.} \\bibnamefont{Lancaster}},\n  \\bibinfo{author}{\\bibfnamefont{J.~S.} \\bibnamefont{Green}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Physical Review Letters}\n  \\textbf{\\bibinfo{volume}{105}}, \\bibinfo{pages}{135001}\n  (\\bibinfo{year}{2010}),\n  \\urlprefix\\url{http://dx.doi.org/10.1103/PhysRevLett.105.135001}.\n\n\\bibitem[{\\citenamefont{Schmitz et~al.}(2012)\\citenamefont{Schmitz, Lloyd, and\n  Evans}}]{Schmitz:2012a}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Schmitz}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Lloyd}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~G.} \\bibnamefont{Evans}},\n  \\bibinfo{journal}{Plasma Physics and Controlled Fusion}\n  \\textbf{\\bibinfo{volume}{54}}, \\bibinfo{pages}{085016}\n  (\\bibinfo{year}{2012}),\n  \\urlprefix\\url{http://dx.doi.org/10.1088/0741-3335/54/8/085016}.\n\n\\bibitem[{\\citenamefont{Winston et~al.}(2005)\\citenamefont{Winston, Mi\\~{n}ano,\n  and Benitez}}]{Winston:2005}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Winston}},\n  \\bibinfo{author}{\\bibfnamefont{J.~C.} \\bibnamefont{Mi\\~{n}ano}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{P.~G.}\n  \\bibnamefont{Benitez}}, \\emph{\\bibinfo{title}{{Nonimaging optics}}}\n  (\\bibinfo{publisher}{Academic Press}, \\bibinfo{address}{Amsterdam},\n  \\bibinfo{year}{2005}).\n\n\\bibitem[{\\citenamefont{Green et~al.}(2008)\\citenamefont{Green, Ovchinnikov,\n  Evans, Akli, Azechi, Beg, Bellei, Freeman, Habara, Heathcote\n  et~al.}}]{Green:2008}\n\\bibinfo{author}{\\bibfnamefont{J.~S.} \\bibnamefont{Green}},\n  \\bibinfo{author}{\\bibfnamefont{V.~M.} \\bibnamefont{Ovchinnikov}},\n  \\bibinfo{author}{\\bibfnamefont{R.~G.} \\bibnamefont{Evans}},\n  \\bibinfo{author}{\\bibfnamefont{K.~U.} \\bibnamefont{Akli}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Azechi}},\n  \\bibinfo{author}{\\bibfnamefont{F.~N.} \\bibnamefont{Beg}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Bellei}},\n  \\bibinfo{author}{\\bibfnamefont{R.~R.} \\bibnamefont{Freeman}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Habara}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Heathcote}},\n  \\bibnamefont{et~al.}, \\bibinfo{journal}{Physical Review Letters}\n  \\textbf{\\bibinfo{volume}{100}}, \\bibinfo{pages}{015003}\n  (\\bibinfo{year}{2008}),\n  \\urlprefix\\url{http://dx.doi.org/10.1103/PhysRevLett.100.015003}.\n\n\\bibitem[{\\citenamefont{Wilks et~al.}(1992)\\citenamefont{Wilks, Kruer, Tabak,\n  and Langdon}}]{Wilks:1992}\n\\bibinfo{author}{\\bibfnamefont{S.~C.} \\bibnamefont{Wilks}},\n  \\bibinfo{author}{\\bibfnamefont{W.~L.} \\bibnamefont{Kruer}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Tabak}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.~B.} \\bibnamefont{Langdon}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{69}},\n  \\bibinfo{pages}{1383} (\\bibinfo{year}{1992}),\n  \\urlprefix\\url{http://link.aps.org/doi/10.1103/PhysRevLett.69.1383}.\n\n\\bibitem[{\\citenamefont{Lee and More}(1984)}]{Lee:1984}\n\\bibinfo{author}{\\bibfnamefont{Y.~T.} \\bibnamefont{Lee}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{More}},\n  \\bibinfo{journal}{Physics of Fluids} \\textbf{\\bibinfo{volume}{27}},\n  \\bibinfo{pages}{1273} (\\bibinfo{year}{1984}), ISSN \\bibinfo{issn}{00319171},\n  \\urlprefix\\url{http://link.aip.org/link/PFLDAS/v27/i5/p1273/s1\\&Agg=doi}.\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 18862, "prevtext": "\nThis section is then rotated around the $x$--axis to create the rotationally symmetric collector. Note that typical CEC geometries prescribe the locations of the focal points in order to optimise the number of rays collected onto the end surface. Here we do not impose such a restriction due to a number of other constraints imposed by the nature of the fast electron transport. Firstly we don't expect the fast electrons to travel arbitrary distances inside the solid density target before losing their energy. This means that we want to retain the depth $d$ as one of the free parameters. Fixing the focal points implies that $d$ is a function of $r$ and $R$ and can not be chosen freely. Secondly our geometry ensures that the ellipse intersects the front surface of the target at a right angle. This minimises the losses of fast electrons through the material interface.\n\n\\begin{table}[]\n\\begin{center}\n\\begin{tabular}{|l|l|l|l|l|l|l|l|}\n\\hline\nRun & \\makecell{Power\\\\ \\hline $10^{13}$W} & \\makecell{$R_{\\text{spot}}$ \\\\ \\hline $\\mu\\text{m}$} & \\makecell{$I/10^{18}$ \\\\ \\hline $\\text{W\\;cm}^{-2}$} & \\makecell{$R$ \\\\ \\hline $\\mu\\text{m}$} & \\makecell{$r = R_{\\text{min}}$ \\\\ \\hline $\\mu\\text{m}$} & $\\theta$ & \\makecell{$d$ \\\\ \\hline $\\mu\\text{m}$}\\\\ \\hline\nA$_{30}$, A$_{40}$, A$_{50}$   & 8                  & 5                               & 101.86                      & 10               & 6.99                              & 0.774   & 30, 40, 50 \\\\ \\hline\nB$_{30}$, B$_{40}$, B$_{50}$   & 8                  & 10                              & 25.47                       & 20               & 11.823                            & 0.632   & 30, 40, 50 \\\\ \\hline\nC$_{30}$, C$_{40}$, C$_{50}$   & 8                  & 20                              & 6.37                        & 40               & 18.858                            & 0.491   & 30, 40, 50 \\\\ \\hline\nD$_{30}$, D$_{40}$, D$_{50}$   & 2                  & 5                               & 25.47                       & 10               & 5.9114                            & 0.632   & 30, 40, 50 \\\\ \\hline\nE$_{30}$, E$_{40}$, E$_{50}$   & 2                  & 10                              & 6.37                        & 20               & 9.4290                            & 0.491   & 30, 40, 50 \\\\ \\hline\nF$_{30}$, F$_{40}$, F$_{50}$   & 2                  & 20                              & 1.5915                      & 40               & 13.693                            & 0.349   & 30, 40, 50 \\\\ \\hline\n\\end{tabular}\n\\end{center}\n\\caption{Overview of the parameters of the ZEPHYROS simulation runs.}\n\\label{tblSimulationParams}\n\\end{table}\n\nWe performed two sets of runs, each with fixed power but varying laser spot sizes. The first set of runs (A$_d$, B$_d$, and C$_d$) used a laser power of $P=8\\times 10^{13}$W, the second set (runs D$_d$, E$_d$, and F$_d$) used $P=2\\times 10^{13}$W. For each power three laser spot sizes, $R_{\\text{spot}}=5$, $10$, and $20\\mu$m were considered. For each run the average intensity  and the fast electron spread were calculated using equations \\ref{EqPower} and \\ref{EqThetaApprox}. In all cases the front radius of the collector was chosen to be twice the laser spot radius in order to increase the number of fast electrons captured. Using equation \\ref{EqRmin} with the front collector radius, the minimum radius $R_{\\text{min}}$ was determined. This value was used for the small radius of the collector $r = R_{\\text{min}}$. In each case, three runs with depth $d = 30, 40, $ and $50\\mu$m were performed. An overview of the parameters can be seen in table \\ref{tblSimulationParams}.\n\nIn all simulation runs a box size of $300\\times300\\times200$ was chosen. The cell size was $\\Delta x=0.5\\mu$m, resulting in a box of size $150\\times150\\times100\\mu\\text{m}^2$. The laser was incident on the left boundary for 1ps and the total duration of the simulation was 2ps. The beam has a Gaussian transverse profile with a radius of $R_{\\text{spot}}$ and an intensity of $I$ as given in table \\ref{tblSimulationParams}. The laser is not simulated directly but is used to inject fast electrons into the simulation domain. The electrons have an exponential energy distribution with a temperature of $T_f$ given by Wilks' scaling \\cite{Wilks:1992}\n\n", "index": 17, "text": "\\begin{equation}\nT_f = 2m_ec^2\\left( \\sqrt{1+\\frac{I\\lambda_L^2}{1.38\\times10^{18}}} - 1\\right),\\label{EqWilksScaling}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"T_{f}=2m_{e}c^{2}\\left(\\sqrt{1+\\frac{I\\lambda_{L}^{2}}{1.38\\times 10^{18}}}-1%&#10;\\right),\" display=\"block\"><mrow><mrow><msub><mi>T</mi><mi>f</mi></msub><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>m</mi><mi>e</mi></msub><mo>⁢</mo><msup><mi>c</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>(</mo><mrow><msqrt><mrow><mn>1</mn><mo>+</mo><mfrac><mrow><mi>I</mi><mo>⁢</mo><msubsup><mi>λ</mi><mi>L</mi><mn>2</mn></msubsup></mrow><mrow><mn>1.38</mn><mo>×</mo><msup><mn>10</mn><mn>18</mn></msup></mrow></mfrac></mrow></msqrt><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]