[{"file": "1601.00933.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 8560, "prevtext": "\n\n\\title{Density functional theory study of skyrmion pinning by atomic defects in MnSi}\n\n\\author{Hong Chul Choi}\n\n\\affiliation{Theoretical Division, Los Alamos National Laboratory, Los Alamos, New Mexico 87545, USA}\n\\author{Shi-Zeng Lin}\n\n\\affiliation{Theoretical Division, Los Alamos National Laboratory, Los Alamos, New Mexico 87545, USA}\n\\author{Jian-Xin Zhu}\n\n\\affiliation{Theoretical Division, Los Alamos National Laboratory, Los Alamos, New Mexico 87545, USA}\n\\affiliation{Center for Integrated Nanotechnologies, Los Alamos National Laboratory, Los Alamos, New Mexico 87545, USA}\n\\begin{abstract}\nA magnetic skyrmion observed experimentally in chiral magnets is a topologically protected spin texture. For their unique properties, such as high mobility under current drive, skyrmions have huge potential for applications in next-generation spintronic devices. Defects naturally occurring in magnets have profound effects on the static and dynamical properties of skyrmions. In this work, we study the effect of an atomic defect on a skyrmion using the first-principles calculations within the density functional theory, taking MnSi as an example. By substituting one site of Mn or Si with different elements, we can tune the pinning energy. The effects of pinning by an atomic defect can be understood qualitatively within a phenomenological model. \n\\end{abstract}\n\t\n\\pacs{12.39.Dc,73.20.Hb,71.15.Nc}\n\n\n\n\\date{\\today}\n\\maketitle\n\\section{Introduction}\nA skyrmions in magnets is a spin texture with a topological charge $N=\\int d^2r\\mathbf{n}\\cdot(\\partial_x\\mathbf{n}\\times\\partial_y\\mathbf{n})/(4\\pi)=\\pm 1$, where the unit vector $\\mathbf{n}$ represents the direction of local magnetic moments. Skyrmions in chiral magnets without inversion symmetry were predicted in 1992~\\cite{Bogdanov89} and were later discovered in MnSi by small angle neutron scattering.~\\cite{Muhlbauer2009} Real space imaging by Lorentz transmission electron microscopy was performed in thin films and has revealed a detailed spin arrangement in an individual skyrmion~\\cite{Yu2010a}. Furthermore a dilute gas of skyrmions was observed near phase boundary between the skyrmion lattice and ferromagnetic state, where the systems undergo a first-order phase transition between these two states. Since then skyrmions have been observed in many compounds, including magnetic \nmetals,~\\cite{Muhlbauer2009,Yu2010a} semiconductors~\\cite{Yu2011} and insulators,~\\cite{Adams2012,Seki2012} suggesting that skyrmions may be ubiquitous in magnets. In these magnets, the spatial inversion symmetry is broken, where the Dzyaloshinskii-Moriya (DM) \ninteraction~\\cite{Dzyaloshinsky1958,Moriya60,Moriya60b} is responsible for the stabilization of skyrmions. Because of the weakness of  the DM interaction compared to the ferromagnetic exchange interaction, the size of skyrmion is much bigger than the atomic lattice constant and is typically about tens of nanometers. \n\nSkyrmions can be manipulated by various external fields, such as electric and magnetic fields, temperature gradient and electric current \netc.~\\cite{Jonietz2010,Yu2012,Schulz2012,White2012,PhysRevLett.113.107203,Shibata2015} The ability to drive skyrmions by an electric current is particularly interesting from the viewpoint of spintronic applications. Remarkably the threshold current to drive the skyrmion is about $10^6\\ \\mathrm{A/m^2}$ which is about 5 to 6 orders of magnitude weaker than that for a magnetic domain wall. \\cite{Jonietz2010,Yu2012,Schulz2012} There are several interesting theoretical proposal to utilize skyrmions in memory devices.~\\cite{Fert2013,zhou_reversible_2014,sampaio_nucleation_2013} To this end, it is crucial to understand and control the dynamics of skyrmions. \n\nDefects occurring naturally in real materials provide a pinning barrier for skyrmions and is responsible for the experimental observed threshold current to drive skyrmions into motion. Similar to vortices in superconductors~\\cite{Blatter94}, defects impact the behavior of skyrmions both in equilibrium and dynamically, such as arrangement of skyrmions and direction of motion of skyrmions. For applications, it is necessary to control the energy landscape generated by defects. For instance, one needs to pin skyrmions at a desired position in the memory applications. Therefore, it is required to understand origin of pinning of skyrmions by defects. There are several work, where the effects of defects were modeled \nphenomenologically,~\\cite{szlin13skyrmion2,Everschor12,Iwasaki2013} but the microscopic mechanism of pinning effect has not been considered. In this work, we address this issue by performing the first-principles calculations within the density functional theory (DFT). We study the effect of an atomic defect on a single skyrmion by focusing on the prototypical skyrmion-hosting materials MnSi as an example. We show that the defect energy landscape can be tuned by substitution of Mn or Si with different elements. The impurity modifies the local electronic density of states (LDOS) and spin-orbit coupling, which in turn change the interactions between magnetic moments. We then provide a qualitative understanding of the pinning effect based on a phenomenological model.\n\n\n\n\n\\section{Method}\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure1.pdf}\n\\caption{(color online)\n\n(a) Primitive unit cell of MnSi has 4 Mn and 4 Si atoms in the cubic symmetry. (b) The $8\\times8\\times1$ supercell was adopted to accommodate\n a skyrmion spin texture with 256 Mn atoms and 256 Si atoms. (c) The four Mn atoms in a unit cell are located at $z=$0.1395, 0.3605, 0.6395, and 0.8605, respectively. The $8\\times8\\times1$ supercell can be regarded as four  $8\\times8$ two dimensional (2D) lattices stacked along the $z$-axis. We label the position at $(1, 1)$, $(2, 2)$, $(3, 3)$, and $(4,4)$ in the 2D coordinate as 1, 2, 3, 4  respectively, for convenience.\n}\n\\label{fig1}\n\\end{figure}\n\nThe cubic primitive cell (lattice constant= 0.4559 nm) of  $\\mathrm{MnSi}$, which belongs to the $P{2}_{1} 3$ space group symmetry, is displayed in Fig. \\ref{fig1}(a).  The primitive cell has 4 $\\mathrm{Mn}$ and 4 $\\mathrm{Si}$ atoms without an inversion center. The lack of an inversion symmetry together with the spin-orbit coupling gives rise to  the DM interaction. There is also ferromagnetic exchange interaction between Mn atoms due to the double-exchange mechanism mediated by conduction electrons. The competition between the weak DM interaction and exchange interaction stabilizes a long wavelength magnetic normal spiral in the ground state, with a pitch period $\\lambda=$18 nm in bulk and 8.5 nm in thin films. In bulk, the normal spiral becomes the conical spiral state under moderate magnetic field of the order of $0.1$ Tesla in the most region of the magnetic field-temperature phase diagram. Near $T_N=30$ K, a triangular lattice of skyrmion is stabilized in a small region of the phase diagram. In thin films, the skyrmion phase is stabilized down to zero temperature.\n\nWe perform first-principles calculations within the DFT to study the effect of an impurity on a skyrmion in MnSi, employing the projector augmented plane-wave method \\cite{paw} implemented in Vienna {\\it ab-initio} simulation package (VASP)~\\cite{vasp}. \nWe used the VASP pseudopotential (Mn, Si), a $1\\times1\\times1$ Monkhorst-pack-kpoint mesh, \nand a 300 eV cutoff.\nThe linear mixing method for updating spin-polarized electron density was adopted.\nThe spin-orbit coupling is accounted for to include the DM interaction in the calculation.\n\nThe skyrmion size in MnSi is about 10 nm. This requires a large number of unit cell, which renders the calculations extremely expensive. To make the problem tractable, we introduce a smaller system size with the periodic boundary condition and confine a skyrmion at the center of the unit cell. In this case, the size of skyrmion is determined by the competition of exchange, DM interactions and the geometry confinement due to the small system size.  In the calculations, we use $8\\times 8\\times 1$ supercell, as shown in Fig. \\ref{fig1}(b). We then introduce a skyrmion into the system by patternizing the spin configuration on Mn atoms, $\\mathbf{S}(x, y, z)$. A skyrmion is centrosymmetric and we use the polar coordinate $\\mathbf{r}=(r, \\phi)$. At its center, the spins point down while spins point up in the region away from the skyrmion center. The spins rotate in the azimuthal direction with the rotation direction fixed by the DM vector. We initialize the system according to\n\n", "index": 1, "text": "\\begin{equation}\\label{eqSxSySz}\n(S_x, S_y, S_z)=S_0[\\cos(\\varphi) \\sin(\\theta),\\ \\sin(\\varphi) \\sin (\\theta),\\ \\cos (\\theta)],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"(S_{x},S_{y},S_{z})=S_{0}[\\cos(\\varphi)\\sin(\\theta),\\ \\sin(\\varphi)\\sin(\\theta%&#10;),\\ \\cos(\\theta)],\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">(</mo><msub><mi>S</mi><mi>x</mi></msub><mo>,</mo><msub><mi>S</mi><mi>y</mi></msub><mo>,</mo><msub><mi>S</mi><mi>z</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mrow><msub><mi>S</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>φ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"7.5pt\">,</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>φ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo rspace=\"7.5pt\">,</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00933.tex", "nexttext": "\nIn the above notation, we have projected all Mn into the $x$-$y$ plane. The phase shift $\\pi/2$ accounts for the helicity of skyrmion in MnSi. The Si atoms do not carry magnetic moment actively. We then relax the system in the calculations until convergence is achieved. The system may be trapped by a local energy minimum. To obtain a lower energy state, we use different initial condition by changing $r_0$. The calculated magnetic moment of Mn does not depend on the initial value $S_0$.\n\nThe definition of skyrmion topological charge $N=\\int d^2r\\mathbf{n}\\cdot(\\partial_x\\mathbf{n}\\times\\partial_y\\mathbf{n})/(4\\pi)$ valid in the continuum limit does not apply here because of the small skyrmion size. We use an alternative definition by calculating the solid angle \n\n", "itemtype": "equation", "pos": 8703, "prevtext": "\n\n", "index": 3, "text": "\\begin{equation}\\label{eqtheta}\n\\theta(r) = \\pi [1 -{\\tanh(r/r_{0})}],\\ \\ \\ \\mathrm{and}\\ \\ \\  \\varphi=\\phi+\\pi/2 ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\theta(r)=\\pi[1-{\\tanh(r/r_{0})}],\\ \\ \\ \\mathrm{and}\\ \\ \\ \\varphi=\\phi+\\pi/2,\" display=\"block\"><mrow><mrow><mrow><mrow><mi>θ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>π</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>tanh</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>r</mi><mo>/</mo><msub><mi>r</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow></mrow><mo rspace=\"17.5pt\">,</mo><mi>and</mi></mrow></mrow><mo mathvariant=\"italic\" separator=\"true\">   </mo><mrow><mi>φ</mi><mo>=</mo><mrow><mi>ϕ</mi><mo>+</mo><mrow><mi>π</mi><mo>/</mo><mn>2</mn></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00933.tex", "nexttext": "\nsubtended by three neighboring spins, $\\mathbf{S}_i$ in the projects $x$-$y$ plane. We then sum $\\Theta_i$ in the whole system and the skyrmion topological charge is given by $N_S=\\sum_i\\Theta_i/4\\pi$. Here $N_s=1$ for the skyrmion considered in Eqs.~\\eqref{eqSxSySz} and~\\eqref{eqtheta}.\n\n\nThe calculated magnetic moment of a Mn ion is 1 $\\mu_{B}$, which is larger than the experimental value 0.4 $\\mu_{B}$,~\\cite{Ishikawa1976} which is consistent with the previous first-principles calculations for a ferromagnetic state of MnSi.~\\cite{MnSi-DFT-04} The overestimate of the magnetic moment may be due to the strong correlation effect and quantum fluctuation of moments neglected in the DFT calculations. Despite the overestimate of moment and the finite size effect, we hope that the qualitative features of the effect of an atomic impurity on a skyrmion can be captured by the present study and provides guidance to understand microscopic origin of the pinning of skyrmions.\n\nIn the calculations, we fix the center of a skyrmion at the center of the supercell. We substitute one Mn or Si at different site by Co, Ir, Zn and Pb and calculate the total energy. No external magnetic field is applied in the calculations.\n\n\\section{Computational results}\n\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure2.pdf}\n\\caption{(color online)\n(a)-(d) Skyrmion spin textures and (e) total energy of a skyrmion relative to the energy in the ferromagnetic state as a function of the initial skyrmion size $r_0$ in Eq.~\\eqref{eqtheta} in the $8\\times8\\times1$ supercell.\nIn Fig. (a)-(d), arrows demonstrate the in-plane component of local moments at each site.\nThe blue (red) color of the arrow  means a negative (positive) value of the $z$ component of the local moment.\n}\n\\label{fig2}\n\\end{figure}\n\nBefore proceeding to investigate the effect of an impurity, we first obtain the optimal skyrmion texture in the $8\\times8\\times1$ supercell of MnSi by starting from different initial conditions parameterized by $r_0$. The dependence of the total energy and the corresponding skyrmion structure are shown in \nFig.~\\ref{fig2}. The optimal skyrmion size in this supercell is about $r_0=2$. This can be understood as follows. For a small skyrmion size, such as $r_0=1.5$, it costs energy in the ferromagnetic exchange interaction because the skyrmion deviates significantly from its optimal size determined by the competition between the exchange and DM interaction, which is much bigger than the supercell size. On the other hand, when skyrmions size increases such as those shown in Figs. \\ref{fig2}(c) and (d),  the spins are not parallel and have in-plane components that wind counterclockwise at the boundary. This costs energy because the in-plane components of spins are antiparallel at the boundary due to the periodic arrangement of the supercell. The skyrmion energy is higher than that of a ferromagnetic state.\n\n\n \n\\begin{figure}[b]\n\\includegraphics[width=1.0\\linewidth]{figure3.pdf}\n\\caption{(color online) Relative total energy as function of the impurity  position for various impurity atoms in the $8\\times8\\times1$ supercell. Here we take the skyrmion energy with an impurity atom located at (1,1) as an energy reference. All the spin configurations have the skyrmion topological charge $N_s=1$ except for $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$ with $N_s\\approx 0.5$. The 2D coordinate is defined Fig. \\ref{fig1}(c).\n}\n\\label{fig3}\n\\end{figure}\n\nAfter obtaining a metastable skyrmion solution by the DFT calculations, with all the microscopic interactions being taken into account, we then introduce an atomic impurity by replacing one of the Mn or Si atom in a supercell by an alien atom. Because of the centrosymmetry of the skyrmion, we introduce an impurity at a varying distance from the skyrmion center, as labeled by 1,2, 3, and 4 in Fig \\ref{fig1}(c). When one of 64 formula unit atoms is substituted with one impurity atom, such as Co, Ir, Zn and Pb considered here, the doping concentration becomes 1/64, which corresponds to $\\mathrm{Mn_{63/64}Co_{1/64}Si}$, $\\mathrm{Mn_{63/64}Ir_{1/64}Si}$, $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$, and $\\mathrm{MnSi_{63/64}Pb_{1/64}}$. The total energy as a function impurity position for different impurity atom is depicted in Fig. \\ref{fig3}. For the Zn and Pb impurities, the energy decreases when the impurity is close to the skyrmion center, indicating an attraction between the skyrmion and the impurity. Therefore the Zn and Pb impurities behave as pinning centers for skyrmions. On the other hand, for the Co impurity, the energy increases meaning a repulsive interaction between the skyrmion and the impurity. The Co impurity works as an energy barrier for skyrmions. For the Ir impurity, the interaction between the impurity and the skyrmion is nonmonotonic. When the impurity approaches the skyrmion center, the interaction is repulsive and then becomes attractive when the impurity is at the skyrmion center. A qualitative understanding of these behavior will be presented below.\n\nThe Zn doped at the skyrmion center has dramatic effect as indicated by a sharp decrease of energy in Fig. \\ref{fig3}. The calculated skyrmion topological charge is $N_s\\approx 0.5$. In real systems with a large skyrmion size, a single atomic impurity cannot modify the whole skyrmion texture because a skyrmion is topologically protected against local perturbations. Therefore we ascribe the reduction of $N_s$ here to the finite size effect. In real systems, the skyrmion energy is expected to decreases monotonically when the skyrmion approaches to the Zn impurity.\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure4.pdf}\n\\caption{(color online)\nMagnetic moment $S$ as a function of the position in (a) $\\mathrm{MnSi}$ and doped $\\mathrm{MnSi}$ such as (b) $\\mathrm{Mn_{63/64}Co_{1/64}Si}$, (c) $\\mathrm{Mn_{63/64}Ir_{1/64}Si}$, (d) $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$, and (e) $\\mathrm{MnSi_{63/64}Pb_{1/64}}$. The impurity atoms are located at (4,4), which are indicated by the small arrow.  The red and blue lines represent the different diagonals $(x,\\ x)$ and $(x,\\ 9-x)$, as ${x}$ changes from 1 to 8.\n}\n\\label{fig4}\n\\end{figure}\n\n\nThe spatial variations of the local moments $S$ are investigated in MnSi and doped MnSi. \nThe red and blue lines in Fig. \\ref{fig4} show how the $S$ of each local moment  is distributed along the two different diagonals when the impurity atoms (Co, Ir, Zn, Pb) are placed at (4,4).\nThe magnetic moment of the localized $d$ electrons seems to be hardly affected by the $\\mathrm{Pb}$ atom.\nThe magnetic moment is mainly determined by on-site interactions, and the screening effect of $p$ electrons has weak impact on the moments.\nAs Co and Ir atoms have two more valence electrons compared to Mn atoms,\nthe magnetic moments with more  than half filled occupancy \nat the impurity sites are reduced.\nZn atom has the fully-occupied $d$ orbital and it can also influence \nthe reduction of the local moments of the neighboring sites. \nThe local moment at (4,3) is also suppressed than that in $\\mathrm{MnSi}$ , \nas shown in Fig.~\\ref{fig4}(d).\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure5.pdf}\n\\caption{(color online)\nLDOS at different sites: (a) the boundary (1, 1), (b) (2, 2), (c)  (3, 3), and (d) the center (4, 4). The impurity is located at the skyrmion center (4, 4). For comparison, the LDOS of the pure MnSi system is also shown. The 2D coordinate for the supercell is defined in Fig.~\\ref{fig1}(c).}\n\\label{fig5}\n\\end{figure}\n\n\nThe LDOS can provide information about the real-space electronic structure, which can be measured in experiments, such as the scanning tunneling microscopy. Meanwhile the interaction between magnetic moments depends on the LDOS, the knowledge of LDOS is helpful to understand the effect of impurity on skyrmion. Here we consider the effect of skyrmion spin texture on the LDOS in MnSi with an impurity.\n\nFigure~\\ref{fig5} demonstrates the LDOS at (1, 1)-(4, 4) from the boundary to center\nfor the various doped $\\mathrm{MnSi}$'s, where the impurity atom is located at  (4, 4).\nThe LDOS at (1, 1) and (2, 2) are almost identical, \nbecause they are away from the impurity site. The LDOS at (3, 3) shows the slight difference,\nas shown in Fig.~\\ref{fig5}(c). The impurity has strong effect on the LDOS at the impurity site as displayed in Fig.~\\ref{fig5}(d). The LDOS at the Fermi energy $E_F$ is reduced for the Co, Ir and Zn impurities in comparison to the case of the pure MnSi system. This behavior can be understood as follows. The energy level of the fully occupied $d$ electrons in the Zn ion is located below $E_F$ so that the $d$ states of Zn hardly contribute to $E_F$. For Ir, because $5d$ electrons are much more extended, which leads to a broader effective bandwidth and a reduced intensity of LDOS at the Fermi energy; while for Co, the $3d$ electrons are more localized than those of Ir $5d$ and close to Mn $3d$ electrons, therefore the intensity of LDOS on Co is similar to that on Mn.\n\n\\begin{figure}[tb]\n\\includegraphics[width=\\columnwidth]{figure6.pdf}\n\\caption{(color online)\n(a) Magnetic moment (b) LDOS at the impurity atom \nfor $\\mathrm{MnSi}$ and doped $\\mathrm{MnSi}$, where the impurity atoms are placed at (4,4) in the $8\\times8\\times1$ supercell. The red circle and black lines are the peak positions and are guide to eyes.\n}\n\\label{fig6}\n\\end{figure}\n\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure7.pdf}\n\\caption{(color online) (a) Total skyrmion energy relative to the ferromagnetic state, (b) exchange, and (c) DM interaction energies as a function of the distance from the center of the single skyrmion in pure systems. The energy is in unit of $D^2/J$ and the length is unit of $J/D$.}\n\\label{fig7}\n\\end{figure}\n\nFigure~\\ref{fig6} summarizes the local magnetic moment and LDOS  at Fermi surface on the impurity size with different atomic impurities in comparison to the pure system. The impurity is fixed at (4, 4) and the local moment is averaged over the four neighboring sites such as (4, 4), (4, 5), (5, 5),and (5, 4). The moment is suppressed in $\\mathrm{Co}$, $\\mathrm{Ir}$, and $\\mathrm{Zn}$ doped $\\mathrm{MnSi}$, while it does not change much in the  $\\mathrm{Pb}$ doped $\\mathrm{MnSi}$. The LDOS at $E_F$ in $\\mathrm{Ir}$ and $\\mathrm{Zn}$ doped $\\mathrm{MnSi}$ are reduced less than half of that of $\\mathrm{MnSi}$.\nFor the $\\mathrm{Co}$ doped case, the reduction is about 10 $\\%$ and is relatively small.\n\n\\section{Discussions}\nBased on the DFT results, we now discuss the effect of impurities on the skyrmion using a phenomenological theory with an effective interaction between magnetic moments. The effective Hamiltonian density is\n\n", "itemtype": "equation", "pos": 9606, "prevtext": "\nIn the above notation, we have projected all Mn into the $x$-$y$ plane. The phase shift $\\pi/2$ accounts for the helicity of skyrmion in MnSi. The Si atoms do not carry magnetic moment actively. We then relax the system in the calculations until convergence is achieved. The system may be trapped by a local energy minimum. To obtain a lower energy state, we use different initial condition by changing $r_0$. The calculated magnetic moment of Mn does not depend on the initial value $S_0$.\n\nThe definition of skyrmion topological charge $N=\\int d^2r\\mathbf{n}\\cdot(\\partial_x\\mathbf{n}\\times\\partial_y\\mathbf{n})/(4\\pi)$ valid in the continuum limit does not apply here because of the small skyrmion size. We use an alternative definition by calculating the solid angle \n\n", "index": 5, "text": "\\begin{equation}\n\\Theta_i = 2\\arctan\\left[\\frac{\\mathbf{S}_{i} \\cdot (\\mathbf{S}_{j} \\times \\mathbf{ S}_{k})} {1+\\mathbf{S}_i\\cdot\\mathbf{S}_j +\\mathbf{S}_j\\cdot\\mathbf{S}_k +\\mathbf{S}_k\\cdot\\mathbf{S}_i} \\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\Theta_{i}=2\\arctan\\left[\\frac{\\mathbf{S}_{i}\\cdot(\\mathbf{S}_{j}\\times\\mathbf%&#10;{S}_{k})}{1+\\mathbf{S}_{i}\\cdot\\mathbf{S}_{j}+\\mathbf{S}_{j}\\cdot\\mathbf{S}_{k%&#10;}+\\mathbf{S}_{k}\\cdot\\mathbf{S}_{i}}\\right],\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Θ</mi><mi>i</mi></msub><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>arctan</mi><mo>⁡</mo><mrow><mo>[</mo><mfrac><mrow><msub><mi>𝐒</mi><mi>i</mi></msub><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝐒</mi><mi>j</mi></msub><mo>×</mo><msub><mi>𝐒</mi><mi>k</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>1</mn><mo>+</mo><mrow><msub><mi>𝐒</mi><mi>i</mi></msub><mo>⋅</mo><msub><mi>𝐒</mi><mi>j</mi></msub></mrow><mo>+</mo><mrow><msub><mi>𝐒</mi><mi>j</mi></msub><mo>⋅</mo><msub><mi>𝐒</mi><mi>k</mi></msub></mrow><mo>+</mo><mrow><msub><mi>𝐒</mi><mi>k</mi></msub><mo>⋅</mo><msub><mi>𝐒</mi><mi>i</mi></msub></mrow></mrow></mfrac><mo>]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00933.tex", "nexttext": "\nwhere $J$ and $D$ are the exchange and DM interaction respectively. Equation~\\eqref{eqH} has successfully captured several key experimental observations in B20 compounds.~\\cite{okamura_microwave_2013,schwarze_universal_2015} At zero temperature, the Hamiltonian Eq.~\\eqref{eqH} stabilizes a magnetic spiral, triangular lattice skyrmion and spin-polarized ferromagnetic state upon increasing the field. Both transitions are of the first order.~\\cite{Bogdanov94}\n\nHere we consider a single skyrmion solution in the ferromagnetic background in clean systems. The total energy and the contributions due to the exchange interaction, DM interaction as a function of distance $r$ from the skyrmion center are displayed in Fig.~\\ref{fig7}. The single skyrmion is a metastable which has higher energy than the ferromagnet. The main energy contribution comes from the core region of the skyrmion. The skyrmion solution costs energy in the exchange interaction and save energy in the DM interaction. Based on this observation, an impurity can attract or pin a skyrmion if the exchange interaction or magnetic moment is reduced, or the DM interaction is enhanced. This observation provides a consistent understanding of the effects of an atomic impurity on the skyrmion obtained by the DFT calculations.   \n\nFor the Zn impurity, it reduces the magnetic moment and LDOS. For the Pb impurity, the magnetic moment and LDOS do not change much. Due to the large atomic number of Pb, the spin-orbit interaction, hence the DM interaction is enhanced. Therefore both the Zn impurity and Pb impurity provide attractive potential to the skyrmion. For the Ir defect, it also attracts skyrmion because the reduction of LDOS, magnetic moment and enhancement of DM interaction when it is doped at the skyrmion center. For the Co impurity, both the exchange and DM interactions are expected to be slightly reduced because of the reduction of the LDOS and magnetic moment. It could be possible that the energy loss due to the decrease of DM interactions outweigh the energy gain due to the reduction of the exchange interaction, which leads to a weak repulsion between the Co impurity and the skyrmion. This simple explanation is consistent with the rests obtained by the DFT calculations in Fig.~\\ref{fig3}.\n\nFinally we provide an estimate of $J$ in Eq. \\eqref{eqH} based on the DFT results. The calculated skyrmion energy relative to the ferromagnetic state is about $\\sim$ 0.84 meV /f.u., therefore the skyrmion energy in the $8\\times8$ mesh is about $\\sim$ 54 meV  ($\\sim$ 540 K). The skyrmion self-energy in Eq. \\eqref{eqH}  is of the order of $J$. The N\\'{e}el temperature $T_N$ is of the order of $J N_c$ with $N_c$ the coordination number of spins. For MnSi according to experiments, $T_N\\approx 45$ K \\cite{Yu2010a} and the estimated $J$ is one of order of magnitude smaller than that of DFT calculations. There are two reasons: firstly the DFT calculations overestimate the magnetic moment by a factor of $2.5$ and thus overestimate the energy by a factor of $6.25$; secondly, the thermal and quantum fluctuations that are not accounted for in the DFT calculations can reduce the mean-field $T_N$ by one order of magnitude. After taking these two effects into account, the estimated $J$ by the DFT calculations and experiments can be comparable within the same order of magnitude.\n\n\\section{Summary}\nWe have studied the effect of an atomic impurity on the skyrmion in MnSi by performing the density functional theory calculations. We have demonstrated that the interactions between the defects and skyrmion can be tuned by substitution of different elements. For Mn substituted by Zn or Ir and Si substituted by Pb, the interaction is attractive, indicating a pinning of the skyrmion. While for Mn substituted by Co, the interaction between the defect and the skyrmion is weakly repulsive. We have also computed the local density of state and magnetic moments to understand the impacts of impurities on the magnetic and electronic properties. Based on the density functional theory results, we have provided a qualitative understanding using a phenomenological model. Due to the limitation of the density functional theory for a large spin texture, the calculations are subjected to the finite size finite effect. Nevertheless we believe that the qualitative features presented here should still hold in the large system size.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{acknowledgments}\nWe thank Yuan-Yen Tai for helpful discussions. This work was carried out under the auspices of the National Nuclear Security Administration of the US DOE at LANL under Contract No. DE-AC52-06NA25396 and was supported by the LANL LDRD-DR Program.\n\\end{acknowledgments}\n\n\\bibliography{reference}\n\n\n", "itemtype": "equation", "pos": 20581, "prevtext": "\nsubtended by three neighboring spins, $\\mathbf{S}_i$ in the projects $x$-$y$ plane. We then sum $\\Theta_i$ in the whole system and the skyrmion topological charge is given by $N_S=\\sum_i\\Theta_i/4\\pi$. Here $N_s=1$ for the skyrmion considered in Eqs.~\\eqref{eqSxSySz} and~\\eqref{eqtheta}.\n\n\nThe calculated magnetic moment of a Mn ion is 1 $\\mu_{B}$, which is larger than the experimental value 0.4 $\\mu_{B}$,~\\cite{Ishikawa1976} which is consistent with the previous first-principles calculations for a ferromagnetic state of MnSi.~\\cite{MnSi-DFT-04} The overestimate of the magnetic moment may be due to the strong correlation effect and quantum fluctuation of moments neglected in the DFT calculations. Despite the overestimate of moment and the finite size effect, we hope that the qualitative features of the effect of an atomic impurity on a skyrmion can be captured by the present study and provides guidance to understand microscopic origin of the pinning of skyrmions.\n\nIn the calculations, we fix the center of a skyrmion at the center of the supercell. We substitute one Mn or Si at different site by Co, Ir, Zn and Pb and calculate the total energy. No external magnetic field is applied in the calculations.\n\n\\section{Computational results}\n\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure2.pdf}\n\\caption{(color online)\n(a)-(d) Skyrmion spin textures and (e) total energy of a skyrmion relative to the energy in the ferromagnetic state as a function of the initial skyrmion size $r_0$ in Eq.~\\eqref{eqtheta} in the $8\\times8\\times1$ supercell.\nIn Fig. (a)-(d), arrows demonstrate the in-plane component of local moments at each site.\nThe blue (red) color of the arrow  means a negative (positive) value of the $z$ component of the local moment.\n}\n\\label{fig2}\n\\end{figure}\n\nBefore proceeding to investigate the effect of an impurity, we first obtain the optimal skyrmion texture in the $8\\times8\\times1$ supercell of MnSi by starting from different initial conditions parameterized by $r_0$. The dependence of the total energy and the corresponding skyrmion structure are shown in \nFig.~\\ref{fig2}. The optimal skyrmion size in this supercell is about $r_0=2$. This can be understood as follows. For a small skyrmion size, such as $r_0=1.5$, it costs energy in the ferromagnetic exchange interaction because the skyrmion deviates significantly from its optimal size determined by the competition between the exchange and DM interaction, which is much bigger than the supercell size. On the other hand, when skyrmions size increases such as those shown in Figs. \\ref{fig2}(c) and (d),  the spins are not parallel and have in-plane components that wind counterclockwise at the boundary. This costs energy because the in-plane components of spins are antiparallel at the boundary due to the periodic arrangement of the supercell. The skyrmion energy is higher than that of a ferromagnetic state.\n\n\n \n\\begin{figure}[b]\n\\includegraphics[width=1.0\\linewidth]{figure3.pdf}\n\\caption{(color online) Relative total energy as function of the impurity  position for various impurity atoms in the $8\\times8\\times1$ supercell. Here we take the skyrmion energy with an impurity atom located at (1,1) as an energy reference. All the spin configurations have the skyrmion topological charge $N_s=1$ except for $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$ with $N_s\\approx 0.5$. The 2D coordinate is defined Fig. \\ref{fig1}(c).\n}\n\\label{fig3}\n\\end{figure}\n\nAfter obtaining a metastable skyrmion solution by the DFT calculations, with all the microscopic interactions being taken into account, we then introduce an atomic impurity by replacing one of the Mn or Si atom in a supercell by an alien atom. Because of the centrosymmetry of the skyrmion, we introduce an impurity at a varying distance from the skyrmion center, as labeled by 1,2, 3, and 4 in Fig \\ref{fig1}(c). When one of 64 formula unit atoms is substituted with one impurity atom, such as Co, Ir, Zn and Pb considered here, the doping concentration becomes 1/64, which corresponds to $\\mathrm{Mn_{63/64}Co_{1/64}Si}$, $\\mathrm{Mn_{63/64}Ir_{1/64}Si}$, $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$, and $\\mathrm{MnSi_{63/64}Pb_{1/64}}$. The total energy as a function impurity position for different impurity atom is depicted in Fig. \\ref{fig3}. For the Zn and Pb impurities, the energy decreases when the impurity is close to the skyrmion center, indicating an attraction between the skyrmion and the impurity. Therefore the Zn and Pb impurities behave as pinning centers for skyrmions. On the other hand, for the Co impurity, the energy increases meaning a repulsive interaction between the skyrmion and the impurity. The Co impurity works as an energy barrier for skyrmions. For the Ir impurity, the interaction between the impurity and the skyrmion is nonmonotonic. When the impurity approaches the skyrmion center, the interaction is repulsive and then becomes attractive when the impurity is at the skyrmion center. A qualitative understanding of these behavior will be presented below.\n\nThe Zn doped at the skyrmion center has dramatic effect as indicated by a sharp decrease of energy in Fig. \\ref{fig3}. The calculated skyrmion topological charge is $N_s\\approx 0.5$. In real systems with a large skyrmion size, a single atomic impurity cannot modify the whole skyrmion texture because a skyrmion is topologically protected against local perturbations. Therefore we ascribe the reduction of $N_s$ here to the finite size effect. In real systems, the skyrmion energy is expected to decreases monotonically when the skyrmion approaches to the Zn impurity.\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure4.pdf}\n\\caption{(color online)\nMagnetic moment $S$ as a function of the position in (a) $\\mathrm{MnSi}$ and doped $\\mathrm{MnSi}$ such as (b) $\\mathrm{Mn_{63/64}Co_{1/64}Si}$, (c) $\\mathrm{Mn_{63/64}Ir_{1/64}Si}$, (d) $\\mathrm{Mn_{63/64}Zn_{1/64}Si}$, and (e) $\\mathrm{MnSi_{63/64}Pb_{1/64}}$. The impurity atoms are located at (4,4), which are indicated by the small arrow.  The red and blue lines represent the different diagonals $(x,\\ x)$ and $(x,\\ 9-x)$, as ${x}$ changes from 1 to 8.\n}\n\\label{fig4}\n\\end{figure}\n\n\nThe spatial variations of the local moments $S$ are investigated in MnSi and doped MnSi. \nThe red and blue lines in Fig. \\ref{fig4} show how the $S$ of each local moment  is distributed along the two different diagonals when the impurity atoms (Co, Ir, Zn, Pb) are placed at (4,4).\nThe magnetic moment of the localized $d$ electrons seems to be hardly affected by the $\\mathrm{Pb}$ atom.\nThe magnetic moment is mainly determined by on-site interactions, and the screening effect of $p$ electrons has weak impact on the moments.\nAs Co and Ir atoms have two more valence electrons compared to Mn atoms,\nthe magnetic moments with more  than half filled occupancy \nat the impurity sites are reduced.\nZn atom has the fully-occupied $d$ orbital and it can also influence \nthe reduction of the local moments of the neighboring sites. \nThe local moment at (4,3) is also suppressed than that in $\\mathrm{MnSi}$ , \nas shown in Fig.~\\ref{fig4}(d).\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure5.pdf}\n\\caption{(color online)\nLDOS at different sites: (a) the boundary (1, 1), (b) (2, 2), (c)  (3, 3), and (d) the center (4, 4). The impurity is located at the skyrmion center (4, 4). For comparison, the LDOS of the pure MnSi system is also shown. The 2D coordinate for the supercell is defined in Fig.~\\ref{fig1}(c).}\n\\label{fig5}\n\\end{figure}\n\n\nThe LDOS can provide information about the real-space electronic structure, which can be measured in experiments, such as the scanning tunneling microscopy. Meanwhile the interaction between magnetic moments depends on the LDOS, the knowledge of LDOS is helpful to understand the effect of impurity on skyrmion. Here we consider the effect of skyrmion spin texture on the LDOS in MnSi with an impurity.\n\nFigure~\\ref{fig5} demonstrates the LDOS at (1, 1)-(4, 4) from the boundary to center\nfor the various doped $\\mathrm{MnSi}$'s, where the impurity atom is located at  (4, 4).\nThe LDOS at (1, 1) and (2, 2) are almost identical, \nbecause they are away from the impurity site. The LDOS at (3, 3) shows the slight difference,\nas shown in Fig.~\\ref{fig5}(c). The impurity has strong effect on the LDOS at the impurity site as displayed in Fig.~\\ref{fig5}(d). The LDOS at the Fermi energy $E_F$ is reduced for the Co, Ir and Zn impurities in comparison to the case of the pure MnSi system. This behavior can be understood as follows. The energy level of the fully occupied $d$ electrons in the Zn ion is located below $E_F$ so that the $d$ states of Zn hardly contribute to $E_F$. For Ir, because $5d$ electrons are much more extended, which leads to a broader effective bandwidth and a reduced intensity of LDOS at the Fermi energy; while for Co, the $3d$ electrons are more localized than those of Ir $5d$ and close to Mn $3d$ electrons, therefore the intensity of LDOS on Co is similar to that on Mn.\n\n\\begin{figure}[tb]\n\\includegraphics[width=\\columnwidth]{figure6.pdf}\n\\caption{(color online)\n(a) Magnetic moment (b) LDOS at the impurity atom \nfor $\\mathrm{MnSi}$ and doped $\\mathrm{MnSi}$, where the impurity atoms are placed at (4,4) in the $8\\times8\\times1$ supercell. The red circle and black lines are the peak positions and are guide to eyes.\n}\n\\label{fig6}\n\\end{figure}\n\n\n\\begin{figure}[tb]\n\\includegraphics[width=1.0\\linewidth]{figure7.pdf}\n\\caption{(color online) (a) Total skyrmion energy relative to the ferromagnetic state, (b) exchange, and (c) DM interaction energies as a function of the distance from the center of the single skyrmion in pure systems. The energy is in unit of $D^2/J$ and the length is unit of $J/D$.}\n\\label{fig7}\n\\end{figure}\n\nFigure~\\ref{fig6} summarizes the local magnetic moment and LDOS  at Fermi surface on the impurity size with different atomic impurities in comparison to the pure system. The impurity is fixed at (4, 4) and the local moment is averaged over the four neighboring sites such as (4, 4), (4, 5), (5, 5),and (5, 4). The moment is suppressed in $\\mathrm{Co}$, $\\mathrm{Ir}$, and $\\mathrm{Zn}$ doped $\\mathrm{MnSi}$, while it does not change much in the  $\\mathrm{Pb}$ doped $\\mathrm{MnSi}$. The LDOS at $E_F$ in $\\mathrm{Ir}$ and $\\mathrm{Zn}$ doped $\\mathrm{MnSi}$ are reduced less than half of that of $\\mathrm{MnSi}$.\nFor the $\\mathrm{Co}$ doped case, the reduction is about 10 $\\%$ and is relatively small.\n\n\\section{Discussions}\nBased on the DFT results, we now discuss the effect of impurities on the skyrmion using a phenomenological theory with an effective interaction between magnetic moments. The effective Hamiltonian density is\n\n", "index": 7, "text": "\\begin{equation}\\label{eqH}\n\\mathcal{H}= \\frac{J}{2} \\sum_{\\mu=x, y} (\\partial_{\\mu} \\mathbf{n})^2+D \\mathbf{n} \\cdot \\nabla \\times \\mathbf{n} -\\mathbf{B} \\cdot \\mathbf{n},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{H}=\\frac{J}{2}\\sum_{\\mu=x,y}(\\partial_{\\mu}\\mathbf{n})^{2}+D\\mathbf{n%&#10;}\\cdot\\nabla\\times\\mathbf{n}-\\mathbf{B}\\cdot\\mathbf{n},\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">ℋ</mi><mo>=</mo><mrow><mrow><mrow><mfrac><mi>J</mi><mn>2</mn></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>μ</mi><mo>=</mo><mrow><mi>x</mi><mo>,</mo><mi>y</mi></mrow></mrow></munder><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mi>𝐧</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>+</mo><mrow><mrow><mrow><mi>D</mi><mo>⁢</mo><mi>𝐧</mi></mrow><mo>⋅</mo><mo>∇</mo></mrow><mo>×</mo><mi>𝐧</mi></mrow></mrow><mo>-</mo><mrow><mi>𝐁</mi><mo>⋅</mo><mi>𝐧</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]