[{"file": "1601.02534.tex", "nexttext": "\nwhere $P_0$ is a constant and $\\lambda_i$ is the sputtering\nyield of the $i$ species, such that for $\\alpha_2>0$ erosion is\nmore efficient at surface troughs than at surface peaks, as in\nthe classic Bradley-Harper (BH) mechanism.\\cite{Bradley1988} Finally, the surface current is\n\n", "itemtype": "equation", "pos": 35519, "prevtext": "\n\n\n\n\n\\title{Ion-beam nanopatterning of silicon surfaces under\nco-deposition of non-silicide-forming impurities}\n\n\n\n\n\n\n\n\n\n\n\\author{B. Moon}\n\\affiliation{Department of Physics, Sook-Myung Women's\nUniversity, Seoul 140-742, Korea}\n\\affiliation{Department of Physics, Korea University, Seoul\n136-701, Korea}\n\\author{S. Yoo}\n\\affiliation{Department of Physics, Sook-Myung Women's\nUniversity, Seoul 140-742, Korea}\n\\author{J.-S. Kim}\n\\email[]{jskim@sm.ac.kr}\n\\affiliation{Department of Physics, Sook-Myung Women's\nUniversity, Seoul 140-742, Korea}\n\\author{S. J. Kang}\n\\affiliation{Institute for Basic Science: Center for Functional\nInterfaces of Correlated Electron Systems, Seoul National\nUniversity, Seoul 19-419, Korea}\n\\author{J. Mu\\~{n}oz-Garc\\'{i}a}\n\\affiliation{Departamento de Matem\\'aticas and Grupo\nInterdisciplinar de Sistemas Complejos (GISC), Universidad\nCarlos III de Madrid, 28911 Legan\\'es, Spain}\n\\author{R. Cuerno}\n\\email[]{cuerno@math.uc3m.es}\n\\affiliation{Departamento de Matem\\'aticas and Grupo\nInterdisciplinar de Sistemas Complejos (GISC), Universidad\nCarlos III de Madrid, 28911 Legan\\'es, Spain}\n\n\n\\date{Received \\today }\n\n\\begin{abstract}\nWe report experiments on surface nanopatterning of Si targets\nwhich are irradiated with 2 keV Ar$^+$ ions impinging at\nnear-glancing incidence, under concurrent co-deposition of Au\nimpurities simultaneously extracted from a gold target by the\nsame ion beam. Previous recent experiments by a number of groups\nsuggest that silicide formation is a prerequisite for pattern\nformation in the presence of metallic impurities. In spite of the fact that Au is known not to form stable\ncompounds with the Si atoms, ripples nonetheless emerge in our\nexperiments with nanometric wavelengths and small amplitudes,\nand with an orientation that changes with distance to the Au\nsource. We provide results of sample analysis through Auger\nelectron and energy-dispersive X-ray spectroscopies for their\nspace-resolved chemical composition, and through atomic force,\nscanning transmission electron, and high-resolution transmission\nmicroscopies for their morphological properties. We discuss\nthese findings in the light of current continuum models for this\nclass of systems. The composition of and the dynamics within the near-surface amorphized layer that ensues is expected to play a\nrelevant role to account for the unexpected formation of these\nsurface structures.\n\\end{abstract}\n\n\\pacs{\n79.20.Rf, \n81.16.Rf, \n68.35.Ct, \n05.45.-a  \n}\n\n\n\\maketitle\n\n\n\\section{Introduction}\n\\label{sec:intro}\n\n\n\n\nIon beam irradiation employing low energy noble gas ions is a functional tool to obtain nanoscale surface patterns in a diversity of materials. \\cite{Munoz-Garcia2009book} Under proper conditions these patterns can be ordered over large lateral distances in comparison to their heights.\\cite{Facsko1999} In particular, and due to their technological relevance, much work has been focused on the formation of such surface nanostructures on silicon.\\cite{Munoz-Garcia2014} The first experiment reporting the formation of silicon nanopatterns by ion irradiation was published in Ref.\\ \\onlinecite{Gago2001}, in which 1.2 keV Ar$^+$ ions were employed to form ordered nanodots on a Si substrate. Despite many experiments having shown the formation of a large variety of nanostructures on silicon surfaces, it turned out that most of these results were due to the effect of impurities incorporation.\\cite{Munoz-Garcia2014} This is, at least, the case for small angles of incidence as first noted by Ozaydin \\textit{et al.}\\cite{Ozaydin2005} In this work, the authors brought to light the importance of a continuous metal supply to enhance the pattern formation. Thus, only silicon substrates with metal impurity concentrations above a certain threshold may develop nanostructures at normal incidence.\\cite{Zhou2011} This point was confirmed by Madi \\textit{et al.}, who showed the absence of surface nanopatterns for Ar$^+$ ions at different energies and clean conditions, for incidence angles smaller than 48$^\\circ$.\\cite{Madi2011} Above this angle, and up to 80$^\\circ$, the formation of perpendicular ripples was reported, with wavevector parallel to the projection of the ion beam.\n\nRecent efforts have explored the morphologies formed under systematic impurity incorporation in order to better understand this process and the intervening physical mechanisms. In this line, in 2008 Hofs\\\"ass and Zhang proposed a setup combining ion irradiation and atom deposition to study ripple formation on silicon surfaces at 70$^\\circ$ and 80$^\\circ$ with 5 keV Xe$^+$ ions.\\cite{Hofsass2008} This technique, known as surfactant sputtering, consists on locating an adjacent plate with a certain tilt next to the substrate. This experimental geometry allows to modify substrate composition and irradiation conditions, since the plate is co-sputtered during ion bombardment and some material is deposited on the substrate. In this experiment, ripples properties were altered depending on the plate material and the distance to it. For instance, the substrate surface roughness was found to increase with the distance to a gold plate. In contrast to the previous experiment in which ripples are formed for large angles of incidence in the absence of contamination, in Refs.\\ \\onlinecite{Macko2010} and \\onlinecite{Zhang2011} similar setups were employed with smaller angles of incidence and an iron plate perpendicular to the substrate, and allowing for different angular locations, respectively. In these experiments, due to redeposition, metal content is maximum next to the plate location and decreases with the distance to it. The sputtered metallic material (and perhaps reflected ions) influences pattern appearance, which would not be formed without this surfactant sputtering. Using 2 keV Kr$^+$ ions at 30$^\\circ$, in Ref.\\ \\onlinecite{Macko2010} different pattern types were observed depending on the distance to the plate. Similarly, parallel mode ripples and dots far from the plate were observed in Ref.\\ \\onlinecite{Zhang2011} using 5 keV Xe$^+$ ions at normal incidence. Later works have confirmed the dependence of the topography on the plate distance at low temperatures, $140-440\\, \\mbox{K}$,\\cite{Macko2011} confirming metal silicide formation and its segregation as key mechanisms to induce pattern formation. Silicide-induced patterning was also  recently studied by surfactant sputtering employing different co-deposited materials in Refs.\\ \\onlinecite{Hofsass2013} and \\onlinecite{Engler2014}, in which the requisite of silicide formation to observe silicon nanopatterning was confirmed for 5 keV Xe$^+$ ions at 60$^\\circ$ and 2 keV Kr$^+$ ions at 30$^\\circ$, respectively. Interestingly, in the former work, no ripple formation was observed for the case of copper and gold contamination, suggesting that only materials leading to silicide phase separation may form patterns on silicon substrates.\n\n\n\nAlthough the mechanisms inducing pattern formation under surfactant sputtering are not yet completely understood, from the previous experimental results it seems convenient to distinguish between two different cases: when selective formation of silicide occurs, and when silicon and impurities do not react chemically. The former case has been addressed theoretically in Ref~\\onlinecite{Bradley2013a}, where a mathematical model is formulated to describe the height and composition evolutions for normal incidence bombardment and oblique deposition. It is found that silicide formation and the interaction between the surface composition and morphology are crucial to destabilize the surface. For the case in which silicon and impurities do not react chemically, some theoretical works predict pattern formation when impurity deposition is simultaneous to ion bombardment.\\cite{Zhou2010,Bradley2011b,Bradley2012b,Bradley2012a} These models predict, for instance, a pattern instability that can emerge purely as the result of the difference in the sputtering yields for both species\\cite{Bradley2012a} when a minimal impurity concentration value is reached.\\cite{Bradley2011b} A more extended revision of these models will be provided in Section \\ref{sec:models}.\n\nIn order to check the possibility of nanopattern production for the case of non-silicide formation, in this paper we have conducted experiments in which Au atoms were co-deposited over a silicon substrate using the surfactant sputtering technique. It is important to stress that gold does not form stable silicide, but a metastable alloy with Si within a wide range of compositions below its eutectic temperature.\\cite{Hofsass2013} In the experiment described below, well-defined nanopatterns with different features were found on the Si substrate, indicating that silicide formation is not a necessary condition for pattern formation. Based on our experimental findings, we will try to rationalize the role of Au impurities and how the formation of Si nanopatterns is catalyzed by them.\n\nThe paper is organized as follows. Section \\ref{sec:exp} is devoted to describe our experimental setup, while results thus obtained are reported in detail in Sec.\\ \\ref{sec:results}. A rationalization of our observations in the light of current continuum descriptions of the process is contained in Sec.\\ \\ref{sec:models}. This is followed by a discussion in Sec.\\ \\ref{sec:disc}. The paper closes by summarizing our main results and conclusions in Sec.\\ \\ref{sec:concl}.\n\n\n\\section{Experiments}\n\\label{sec:exp}\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.79\\linewidth]{Sputter_Geometry.pdf}\n\\caption{Schematic of the geometry employed in this work\nfor the ion-irradiation of Si(100) substrate with simultaneous\nco-sputtering of Au target.\nThe arrows indicate the Ar$^+$ ion beam.}\n\\label{Sputter_Geometry}\n\\end{figure}\n\nIon-beam sputtering (IBS) has been performed in a custom-built\nultrahigh vacuum chamber with a base pressure of mid-10$^{-10}$\nTorr. We have used an (99.999 \\%) Ar gas as the ion source. The\nion energy $\\varepsilon$ was 2 keV, and the ion flux $f$ was\n1.59 ions nm$^{-2}$s$^{-1}$, which is estimated from the target\ncurrent. Since secondary electrons are not taken into account,\nthis is only a nominal value for $f$ which sets an upper limit\nfor the actual ion flux.\nAll the images are taken for fixed fluence of 8,586 ions nm$^{-2}$.\nWe have used a Kauffman-type ion gun\n(IQE-11, SPECS), the beam diameter being $ < 10$ mm.\n\nBefore loading the sample into the chamber for IBS, 10 mm\n$\\times$ 10 mm Si(100) chips were immersed into a HF solution\n(99\\% H$_2$O + 1\\% HF) for 5 seconds, in order to remove the\nnatural oxide from the surface, and then rinsed by de-ionized\nwater. For the co-deposition of Au during IBS, we mounted the Si\nsample at the edge of a single crystalline (99.999\\%, Mateck)\nAu(001) target at a right angle, using a silicon glue. Thus, the\nion-beam simultaneously irradiated both the Si(100) at a\nnear-glancing angle of 75$^{\\circ}$ and the Au sample at\n15$^{\\circ}$ from the respective surface normals, see Fig.\\\n\\ref{Sputter_Geometry}.\n\nIn order to align the ion beam, we placed two 100 nm-thick Au\nfilms deposited on Si(100) in the same experimental geometry as\nshown in Fig.\\ \\ref{Sputter_Geometry}, and irradiated the films\nwith the Ar$^+$ ion beam as specified above. The location and\nthe profile of the beam on the target surfaces is, then,\nidentified by the erosion profile of the Au films.\nThat information is used to adjust the beam to be well inside the sample, precluding impurity\ndeposition from the sample holder, as also confirmed by Auger\nelectron spectroscopy (AES).\n\nAfter sputtering the sample, its surface topography was\ninvestigated {\\it ex situ} by both an atomic force microscope\n(AFM, XE-100, Park Systems) in the tapping mode and a scanning\nelectron microscope (SEM, JSM-7600F, JEOL). The cross-sectional specimen for the transmission electron microscope (TEM) analysis was prepared using a conventional ion-mill procedure after mechanically grinding the specimen. TEM (JEM 2100F, JEOL) was operated at an acceleration voltage of 200 kV for both the high-resolution (HR-TEM) and scanning transmission electron microscopy (STEM) modes. An annular dark field (ADF) detector ranging from 100 to 250 mrad was used for high angle annular dark field (HAADF) imaging. Energy dispersive X-ray spectroscopy (EDX) analysis was carried out simultaneously with the HAADF-STEM imaging.\nDepth profiling was also performed by taking Auger electron\nspectra (PHI Nanoprobe 700), while raster-sputtering a 3\nmm$\\times$3 mm area with the Ar$^{+}$ beam.\n\n\n\\section{Results}\n\\label{sec:results}\n\nFigure\\ \\ref{Null_Pattern} shows typical (a) 3 $\\times 3$\n$\\mu$m$^2$ and (b) 1 $\\times 1$ $\\mu$m$^2$ Si surfaces after IBS\nunder the stated sputtering condition, in the absence of gold codeposition.\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{Null_Pattern.pdf}\n\\caption{Topographies of Si(100) after IBS {\\it without} metal\nco-deposition at two different lateral scales, 3 $\\mu$m (a) and\n1 $\\mu$m (b). Top-left and bottom-right insets show the corresponding 2D\n auto-correlation and Fourier transform, respectively.}\n\\label{Null_Pattern}\n\\end{figure}\nNo surface pattern is detectable, as suggested by the auto-correlation function and\n 2D Fourier transform (FT) provided in the top left and bottom\nright insets of each image, respectively. For a height\nprofile $h(x,y)$, the auto-correlation function is defined as\n$\\langle h(\\mathbf{r_0}) h(\\mathbf{r_0}+\\mathbf{r})\\rangle$,\nwhere $\\mathbf{r}=(x,y)$ denotes a point on the target plane and\nthe brackets denote average with respect to the position of the\nreference point $\\mathbf{r}_0$. For the sputtered surfaces in Fig.\\ \\ref{Null_Pattern}, the\nvalues of the surface roughness or width, $W$, are (a) 0.2 nm and (b) 0.1 nm, respectively.\nThese values are similar to those of the Si substrate prior to irradiation. Here, $W(t)$ is\ndefined by $W(t)\\equiv\\sqrt{\\langle[h(\\textbf{r},t)-\\overline{h}(t)]^{2}\\rangle}$,\nwhere $\\overline{h}(t)$ is the mean height at time $t$. The\nbracket denotes the average over the imaged space.\n\nFigure\\ \\ref{Patterns} presents the surface topographies\nobtained at four different sites on the Si(100) target after IBS\nwith concurrent Au co-deposition. In sharp contrast to the case\nof clean Si(100), now well-defined nanopatterns form.\nNote that the pattern changes from (a) to (d) in Fig.\\\n\\ref{Patterns} as the imaging site is further away from the Au\nsource and the flux of co-deposited Au impurities becomes smaller.\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{Patterns.pdf}\n\\caption{The patterns on Si substrate formed by IBS with Au\nco-sputtering. From (a) to (d), the distance from the Au source\nto the respective imaging site increases as indicated in the top-right inset. (a) Site 1 is in the\n{\\it relatively} Au-rich region; (b) Site 2 is at a transition\nregion in which the ripple reorientation is under way; (c) Site\n3 is located in a Si-rich region; (d) Site 4 is at the most\nSi-rich region near the edge of the Si substrate. The arrow in\n(a) indicates the projection of the ion beam direction,\nwhich is common to the four images. Top-left and bottom-right insets show the corresponding 2D\nauto-correlation and Fourier transform, respectively. }\n\\label{Patterns}\n\\end{figure}\n\nFigure \\ref{Patterns}(a) shows a ripple pattern near the Au\nsource (site 1), as indicated in the upper-right inset. As seen\nin the real-space image and consistent with the 2D\nautocorrelation and FT provided in the insets, the ridges of\nthe ripples run along the projection of the ion beam direction,\ntheir wavelength being close to 120 nm.\nThis is the same ripple orientation as obtained on pure Au(001)\ntargets under a similar sputtering condition.\\cite{Kim2009} The\nmean uninterrupted ridge length of the ripples ($> 1 \\mu$m), or\ncoherence length, is, nevertheless, much shorter than that for\nAu(001). Ripple growth in this {\\it relatively} Au-rich region\nis probably interrupted by chemical and structural defects,\nsuch as segregated Au nano-clusters, as observed in the TEM images\nshown later.\n\nFigure~\\ref{PSD}(a) shows the 1D power spectral densities (PSD) along the two\ndifferent directions on the substrate plane, namely,\nthe squared modulus of the FT of 1D cuts of the surface in Fig.\\ \\ref{Patterns}(a) along each\ndirection. From now on, $x$ corresponds to the projection\nof the ion beam and $y$ is the perpendicular direction. In the figure\none can clearly identify a characteristic wave-vector value\nalong the $y$-axis, $k_y \\simeq 10$ $\\mu$m$^{-1}$, at which an\nabrupt change takes place in the slope of the curve. This value\ncorresponds to the mean wavelength mode of the observed ripple\npattern. In contrast, there is no such feature along the\n$x$-axis, parallel to the ion beam direction. Since the ripples\nridges are thus parallel to the latter, we term these {\\it\nparallel ripples}.\n\nFigure\\ \\ref{Patterns}(b) shows the pattern observed 0.75 mm\naway from site 1 and the Au source (site 2), as indicated\nin the inset at the upper-right corner. As suggested by the 2D\nautocorrelation and FT, patterning seems to be occurring along\nthe two substrate directions. Along the ion beam direction,\nripples still develop, with very short coherence lengths.\nPerpendicular to the ion beam direction, shortened ripples\nconcatenate with neighboring ones to form an array of stripes.\nThe two 1D PSD curves along the $x$ and $y$ directions almost\ncoincide for this pattern, see Fig.\\ \\ref{PSD}(b), reflecting\nthe two-dimensional nature of the structure. Along the\n$x$-direction, though, one can observe a broad peak, reflecting a\nprominent ripple-like texture with a wave-vector running\nalong the ion beam direction. Such a quasi-two-dimensional\npattern is often observed during ripple reorientation\ntransitions.\\cite{Metya:2013bq} In our system, the transition\nproperly takes place when one moves further away from the Au\nsource as detailed below. From now on, the region represented\nby the site 2 is thus termed {\\it transition region}.\n\n\nFigure\\ \\ref{Patterns}(c) shows an image taken further away from the Au source, at site 3. A well-defined ripple pattern is\nobserved, but now the ripple ridges run perpendicular to the ion beam direction, so that ripple re-orientation has fully taken\nplace. We term these {\\it perpendicular ripples}. Accordingly,\nin Fig.\\ \\ref{PSD}(c) the PSD along the $x$-direction clearly\nshows a sharp peak at a well-defined mean wavelength,\ncharacteristic of the perpendicular ripple pattern.\nConsidering that, under the same sputtering condition, IBS\nproduces parallel ripples both for bulk\\cite{Kim2009} Au(001)\nand for the {\\it relatively} Au-rich region in Fig.\\\n\\ref{Patterns}(a),\nthe perpendicular ripple in Fig.\\ \\ref{Patterns}(c) and the\nreorientation transition seem triggered by the reduced Au\nconcentration, sufficiently far away from the Au impurity\nsource.\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{PSD_modified.pdf}\n\\caption{1D power spectral densities of the surface\nheight at the four different sites considered in Fig.\\\n\\ref{Patterns}, namely, (a) site 1 in the {\\it relatively}\nAu-rich region, (b) site 2 at the ripple reorientation\ntransition region, (c) site 3 in the Si-rich region, and (d)\nsite site 4 at the Si-richest region near the edge of the\nsample. Triangles (squares) stand for the PSD data along the $x$($y$) direction.\n}\n\\label{PSD}\n\\end{figure}\n\nFinally, Fig.\\ \\ref{Patterns}(d) shows an image at the farthest position from the Au source, site 4.\nOne can still observe a perpendicular ripple pattern, the\ncorresponding PSDs clearly showing a well-defined peak\nalong the $x$-direction [Fig.\\ \\ref{PSD}(d)], which corresponds to the\nmean wavelength of these perpendicular ripples. The mean\nwavelength and surface roughness of these ripples are smaller\nthan those at site 3, as summarized in Fig.\\ \\ref{Summary}(b).\nMoving away from the Au source, and thus for a reduced Au flux,\nthe surface at site 4 behaves more like clean Si(100), which\nshows very efficient healing kinetics leading to virtually flat\nsurfaces under the present sputtering condition, as shown in\nFig.\\ \\ref{Null_Pattern}.\n\n\\begin{figure} [!htbp]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{Summary_modified4.pdf}\n\\caption{(a) Sketch of the detailed experimental geometry.\nSolid orange lines in (a) indicate the trajectories of\nthe recoiled or sputtered Au particles landing on the various sites\nof the Si substrate. (b) The surface width ($W$, blue triangles) and the ripples wavelength\n($\\lambda$, black squares) as functions of the distance from the Au source.\nHere, $x = 0$ indicates the position in contact with the Au\ntarget, and $x = 10$ (mm) is the farthest position from the Au\nsource. Note, in the Au-rich (Si-rich) region ripples ridges are parallel (perpendicular)\nto the projection of the ion beam.}\n\\label{Summary}\n\\end{figure}\n\nThe perpendicular ripples in both Figs.\\ \\ref{Patterns}(c) and\n(d) are, however, wiggly; each ridge looks either sectioned\ninto small pieces or with a very small coherence length. This\nsuggests that the instability along the $y$ direction\nperpendicular to the ripples still remains effective enough, so\nas to induce sectioning of the ripple ridges. Moreover, each\npiece has neither a uniform width nor a sinusoidal shape,\npointing to the significance of non-linear\neffects.\\cite{Kim2013,Munoz-Garcia2014}\n\nPrevious\nexperimental\\cite{Hofsass2008,Macko2010,Macko2011,Zhang2011,Redondo-cubero2012,Hofsass2013apa,Engler2014}\nand theoretical \\cite{Bradley2012a,Bradley2013a} results indicate that the direction of the wave-vector of the ripple pattern\nfollows that of the impurity flux. Although these experimental\nresults are obtained for silicide-forming metallic impurities,\nwhich is not the case in our system, the perpendicular ripple\npatterns we observe at the sites 3 and 4 indeed seem consistent with\nsuch results.\nFigure\\ \\ref{Summary}(a) depicts the sputtering geometry and\nalso the recoil geometry in real scale, including sketches of\nthe directions of the Au impurity flux reaching the four sites.\nIn the previous experiments,\\cite{Hofsass2008,Macko2010,Macko2011,Zhang2011,Redondo-cubero2012,Hofsass2013apa,Engler2014} the incidence of the ion\nbeam is near normal to the average surface orientation, or\nits influence is isotropic. In our case, however, the ion beam\nincidence is close to glancing.\n\nIn the {\\it relatively} Au-rich region, the target behaves as a\npure Au surface in the erosive regime,\\cite{Kim2009} for which\nrecrystallization is very efficient,\\cite{Valbusa2002}\nirradiation-induced material rearrangement or viscous flow is\nnegligible,\\cite{Munoz-Garcia2014} and\nthe morphological instability seems to be of the erosive Bradley-Harper\\cite{Bradley1988}\n(BH) type.\\cite{Chan2007}\nThis accounts for the parallel ripple orientation. In the\nopposite limit in which Au impurities are scarce, purely erosive mechanisms are less effective in the Si-like surface (recall no\npattern forms in the absence of impurities), surface material\nrearrangement or viscous flow being expected to be more\nrelevant.\\cite{Munoz-Garcia2014} Still, the direction of the Au\nflux may be influencing the orientation of the ripple pattern,\nas frequently observed in other experiments. The 2D-like pattern in between the two, {\\it relatively} Au-rich and Au-poor,\nregions [Fig.\\ \\ref{Patterns}(b)] may result from the balance\nof the two driving forces. We have performed SRIM\nsimulations\\cite{Ziegler2010} (not shown) and obtained that the\nsputtering yield of the recoiled Au impurities is negligible.\nHowever, the recoiled Au atoms do transfer their momentum to the Si atoms and can displace them by close to 1 nm. This mass\ndisplacement might drive the ripple orientation inducing\nCarter-Vishnyakov-like (CV) surface-rearrangement\ncurrents.\\cite{Carter1996} Recall that, for high-incidence\nangles, CV effects actually destabilize the surface and\ncontribute to ripple formation.\n\nFigure~\\ref{Depth_Profile} shows depth profiles of our samples\nshowing the atomic weight percent of Au and Si obtained by AES.\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.85\\linewidth]{Depth_Profile.pdf}\n\\caption{Depth profiles of Au (MNN transition, 2,022 eV) and Si\n(KLL transition, 1,621 eV) are the plots of AES\nsignals  while raster-sputtering 3$\\times$3 mm$^2$ areas by\n1 keV Ar$^{+}$. Note that the region named as 'Au-like film' is\nsampled closer to the Au source than the site 1, as shown in the inset.}\n\\label{Depth_Profile}\n\\end{figure}\nThe measurement is made at three different locations: At the\nvicinity of the Au source, in between sites 1 and 2, and close\nto site 3, as shown in the inset of Fig.~\\ref{Depth_Profile}. Since the depth profile is taken\nover a 3 mm$\\times$3 mm, raster-sputtered area, the spatial\nresolution is limited by the same scale. From the profiles, we\ncan clearly see that, as expected, the Au content is higher for\nlocations which are closer to the Au source. The nominal atomic\nweight percentages of Au at the surface decrease from 100\\% to 30\\%\n(5.8\\% of the atomic concentration), and then to 18\\% (3.0\\% of\nthe atomic concentration) as moving further away from the Au\nsource. The values are nominal, since they are calculated\nby assuming that the concentration of Au is vertically uniform, or\n at least within the escape depth of the Au AES electrons. The\nresidual Au impurities are confined within a layer\nwhich is approximately 5 nm deep, except for the Au-like film formed\nclosest to the Au target. This thickness is comparable to that\nof the amorphized topmost surface layer that is revealed by\nHRTEM and STEM (Figs.\\ \\ref{HRTEM} and \\ref{STEM}). Note that\nthe amplitude of the nanostructures formed by IBS is less than 2 nm [cf.\\ Fig.~\\ref{Summary}(b)].\nThus, the nanostructures form solely in the Au containing\nregion, indicative of the active role of the Au impurities in\nthe pattern formation.\n\n\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{HRTEM_modified.pdf}\n\\caption{HR-TEM images obtained from different regions of the Si target: (a) to (d), around the\nsites 1 to 4 in Fig.~\\ref{Patterns}, respectively. In (a), the yellow dotted circles\nenclose the Au clusters. }\n\\label{HRTEM}\n\\end{figure}\n\n\\begin{figure} [!htbp]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{STEM.pdf}\n\\caption{ (a)-(c) HAADF-STEM images obtained from different regions around the sites 2, 3  and 4, respectively.  (a') EDX (Au(LÎ±1)) line profile of the boxed areas indicated in the HAADF-STEM image (a).\nThe EDX profile is displayed simultaneously with the HAADF-STEM image for comparison.}\n\\label{STEM}\n\\end{figure}\n\n\n\n\n\n\n\n\n\n\n\n\nFig.\\ \\ref{HRTEM}(a), the HRTEM image around site 1, shows\nthat the surface region is made of an amorphous Si layer embracing\nAu nanoclusters. The yellow dotted  circles\nindicate crystalline clusters displaying regularly spaced lines\noriented differently in different regions, but having distinctly different spacing from that of crystalline Si.\nThese clusters\nseem to be formed of the co-deposited, but segregated, Au\nimpurities, due to the high Au concentration in this region. On\nthe other hand, their surroundings show no ordered features,\nand are reminiscent of\nan amorphous region formed of Si possibly with very disperse Au\nimpurities. For regions which are further away from the Au source [panels (b) through (d) in Fig.\\ \\ref{HRTEM}], no Au\nnanoclusters in the amorphized layer can be detected by HRTEM,\nthe layer structure looking more homogeneous from this point of\nview.\n\nWe have further characterized the chemical structure of our\nsamples through the EDX  in conjunction with High-angle\nannular dark-field scanning transmission electron microscope\n(HAADF-STEM).\n\n\nThe HAADF-STEM image in Fig.\\ \\ref{STEM}(a) shows\nthe interface with clear contrast in its intensity.\nFig.\\ \\ref{STEM}(a') shows the Au EDX signal along a\nline normal to the interface in the boxed region in Fig.\\ \\ref{STEM}(a).\nIt clealy tells that the high intensity in Fig.\\ \\ref{STEM}(a) originates from the high Au concentration. Since Au does not form stable\nsilicides,\\cite{Hofsass2013apa} we should expect phase\nseparation in the form of Au clusters.\n\n\n\nMetastable clusters of Au silicide have been reported only at\nelevated temperatures.\\cite{Baumann1991}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWithin the alloyed layer in Fig.\\ \\ref{STEM}(a), the Au impurity concentration looks higher around the ridge\n\nthan around valleys. High impurity concentration around ridges is commonly\nobserved for many silicide-forming\nimpurities.\\cite{Hofsass2008,Macko2010,Macko2011,Zhang2011,Redondo-cubero2012,Hofsass2013apa,Engler2014}\nIn those systems, phase separation associated with silicide\nformation is thought to be at the origin of the surface\nnanopatterning. In principle, it is thus tempting to conclude\nthat phase separation of Au, and an inhomogeneous sputtering\nyield distribution, also induces the observed pattern formation\nin our case.\n\nHowever, note that SRIM calculations\\cite{Ziegler2010} under our present condition lead to virtually identical sputtering yields for Au and Si, see Fig.\\ \\ref{fig:srim}.\n\\begin{figure} [!tbp]\n\\centering\n\\includegraphics[width=0.95\\linewidth]{SRIM.pdf}\n\\caption{Sputtering yields of Si (black squares) and Au (red bullets) targets vs incidence angle $\\theta$, as obtained from SRIM simulations for 2 keV Ar$^+$ irradiation. Note the curves cross at the $\\theta=75^{\\circ}$ value employed in our experiments.}\n\\label{fig:srim}\n\\end{figure}\nHence, apparently phase\nseparation does not lead to an inhomogeneous sputtering yield\nover the surface, and thus to pattern formation. Still, as\nrecently pointed out,\\cite{Engler2014} rapid segregation of Au\nunder a constant external deposition flux makes the apparent\nsputtering yield of phase-separated Au much smaller than that of Si,\nsince the external Au supply constantly replenishes the\nsputtered Au. This effectively-lower Au sputtering yield, then,\nmight in turn lead to pattern formation. Within this scenario,\nsurface valleys erode faster due to the relatively low-Au\nconcentrations,\n\nas compared with the ridge region.\n\nFurther away from the Au source, the Au flux is low and the\nalloyed layer is thin as shown in Fig.\\ \\ref{STEM}(b)\nand (c) consistently with the narrowed, (dark) Au containing layers\nin Fig.\\ \\ref{HRTEM}(c) and (d), respectively.\n\n\n\n They do not reveal clear modulation of the Au concentration in the\nsubstrate plane. Thus, at this moment we may not be able to contend\nthat the patterns observed in the {\\it relatively} Au-poor region have\nthe same origin as in the  Au-rich region. Note, our failure to\nobserve a compositional pattern in the impurity-poor regions\nmay be due to the low Au concentration there. Combined with a low\nspatial resolution of HAADF-STEM image,  this result may hamper detection of\nsmall modulations of the impurity concentration, even if they\nactually exist.\n\n\n\\section{Comparison with continuum models}\n\\label{sec:models}\n\nTo date, a number of continuum models are available in the\nliterature (some of which have been already mentioned), in\nwhich surface nanopattern formation is described in the presence\nof non-negligible impurity co-deposition, see an overview in\nRef.\\ \\onlinecite{Munoz-Garcia2014}. For instance, an early work for\nso-called surfactant sputtering \\cite{Kree2009} put forward a\ncoupled system of equations \\cite{Shenoy2007,Cuerno2011}\nfor the dynamics of the surface height and the surfactant concentration,\nalthough no predictions were provided for dependencies of the\npattern properties with experimental parameters. More recently,\nrelated approaches have been pursued in greater detail,\nconsidering the effects of various incidence conditions and\nrelaxation mechanisms. Thus, concurrent impingement of ions and\nimpurities has been considered,\n\\cite{Zhou2010,Bradley2011b,Bradley2012b} leading to e.g.\\ an\nanalytical result \\cite{Bradley2011b} on a minimal threshold\nvalue which is required for the impurity concentration so that\npatterns can appear. A generalization to oblique ion and\nimpurity incidences has then been performed,\\cite{Bradley2012a}\nwith the result that an instability can arise purely as a result\nof differential sputtering rates for the two impinging species,\nin interplay with a phase shift between the concentration and\nthe height profiles.\n\n\n\n\nMore recently,\\cite{Bradley2013a} silicide formation has been\nexplicitly incorporated to the models, with the conclusion that\nit plays a decisive role, in agreement with many experimental\nresults as already discussed.\n\nIn this section we put the results of the experiments described\nin Sections \\ref{sec:exp} and \\ref{sec:results} in the light of\nthese continuum models, with the aim to stress similarities\nand differences between predictions and observations. Although\nsuch a discussion will allow to somewhat rationalize the latter,\nit will mostly suggest issues that should possibly be taken\ninto account for model improvement, to be able to account for the\nexperimental results.\n\nTwo very basic experimental observations can be taken as a first\nbasis for modeling: {\\it (i)} Under the chosen irradiation\nconditions, pure Si targets are morphologically stable, while Au\ntargets are not. {\\it (ii)} There is a space gradient in the Au\nimpurity concentration within the Si target: this concentration\nis maximum near the Au source and it decreases with distance to\nthe latter. Moreover, we can add the result from our SRIM\nsimulations shown in Fig.\\ \\ref{fig:srim} that, {\\it (iii)} at the ion energy and incidence\nangle considered, the sputtering yields of Au and Si take the\nsame values.\n\nThese observations can be readily implemented in the\nphenomenological model originally put forward in Ref.\\\n\\onlinecite{Bradley2011b} for ion-beam sputtering of a\nmonoelemental target of atomic species $B$ (silicon in our\nexperiment), under simultaneous co-deposition of impurities\nof a different species $A$ (gold, in our case). Further important\nassumptions which agree with our experimental results include\nthat the two atomic species are mutually inert, i.e.\\ they form\nno compound; and that a surface layer, of thickness $\\Delta$,\nforms on top of the irradiated target, within which there is\ndeposition of species $A$, both species being subject to\ntransport and sputtering effects. We should note that in this\nmodel \\cite{Bradley2011b} ions and impurities arrive under\nnormal incidence, in stark difference with the present\nexperiments. However, for the sake of simplicity we first\nproceed by neglecting this fact. Likewise, we restrict ourselves\nto a one-dimensional system. We will come back to these\nassumptions later.\n\nThe model consists of the following two coupled\nequations:\\cite{Bradley2011b}\n\\begin{eqnarray}\n\\partial_t h(\\mathbf{x},t) & = & - \\Omega \\left( F_A + F_B - F_d+ \\nabla \\cdot \\mathbf{J}_A + \\nabla \\cdot \\mathbf{J}_B\\right) ,\\label{eqh} \\\\\n\\Delta \\partial_t c_s(\\mathbf{x},t) & = & - \\Omega \\left( F_A -\nF_d + \\nabla \\cdot \\mathbf{J}_A \\right) . \\label{eqc}\n\\end{eqnarray}\nHere, $F_d$ is the deposition flux of impurities, $c_s=c_A$\ntheir space-time-dependent surface concentration (such that $c_B= 1-c_A$), $\\Omega$ is the atomic volume of both species,\nassumed to be equal for simplicity, $h$ is the height of the\nirradiated target, and $F_i$ and $\\mathbf{J}_i$ are,\nrespectively, the erosion flux and surface current of species\n$i=A,B$. More specifically,\n\n", "index": 1, "text": "\\begin{equation}\nF_i = c_i \\lambda_i (P_0 + \\alpha_2 \\nabla^2 h), \\label{eq_f}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"F_{i}=c_{i}\\lambda_{i}(P_{0}+\\alpha_{2}\\nabla^{2}h),\" display=\"block\"><mrow><mrow><msub><mi>F</mi><mi>i</mi></msub><mo>=</mo><mrow><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>λ</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>P</mi><mn>0</mn></msub><mo>+</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>⁢</mo><mrow><msup><mo>∇</mo><mn>2</mn></msup><mo>⁡</mo><mi>h</mi></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02534.tex", "nexttext": "\nwhere the first term on the rhs is Fickian diffusion ($D_i$ is\nsurface diffusivity and $\\rho_s$ the areal density of mobile\nsurface atoms), the second one is Mullins' surface diffusion\n($\\gamma$ is surface tension and $T$ is temperature), and the\nlast one is a stabilizing Carter-Vishnyakov (CV)\nterm,\\cite{Carter1996} in which $\\mu_i >0$. For our experimental\nsystem, for which the topmost surface layer can be thought of as an amorphous Si phase with Au impurities, CV terms can be\nthought of as proxies of surface-confined viscous flow, recently shown to describe IBS patterning of clean Si\ntargets.\\cite{Umbach2001,Castro2010,Cuerno2011,Castro2012a,Castro2012b,Norris2012,Moreno-Barrado2015,Moreno-Barrado2015b,Moreno-Barrado2015c}\nIn such a case, the coefficient in front of the third order\nderivative term in $\\mathbf{J}_B$ should more properly be\nrelated with radiation-induced viscosity. Nevertheless, this\nfact does not play a relevant role in the discussion to follow.\nSimilarly, note that pure Au targets recrystallize very\nefficiently under our experimental conditions, so that $\\mu_A$\nis small as discussed above, at least in regions where the Au\ndensity is high enough that recrystallization becomes feasible.\n\nThe analysis of model (\\ref{eqh})-(\\ref{eq_j}) performed in\nRef.\\ \\onlinecite{Bradley2011b} corresponds to the case of\nimmobile impurities, i.e., $D_A=\\mu_A=0$. Moreover, a coordinate rescaling is performed \\cite{Bradley2011b,Bradley2012b} by\nconstants which are inversely proportional to the sputtering\nyield difference, $(\\lambda_A - \\lambda_B)$. But, because of the SRIM result from Fig.\\ \\ref{fig:srim}, we are interested in a system with the same sputtering yields for both species, for which this parameter combination is zero.\n\nWe have performed a linear stability analysis of the full model\n(\\ref{eqh})-(\\ref{eq_j}) for precisely the case in which\n$\\lambda_A = \\lambda_B \\equiv \\lambda$ and $D_A, \\mu_A\\neq 0$.\nThe result is that the model supports a flat solution $h=- v_0\nt$ and $c_s = c_0$, characterized by a constant surface velocity $v_0=\\Omega (\\lambda P_0-F_d)$ and uniform impurity coverage\n$c_0=F_d/(\\lambda P_0)$. Moreover, under the standard\nlarge-wavelength approximation (namely, for wave-vectors $k \\ll\n1$), the linear dispersion relation $\\omega_k$ for periodic\nperturbations of this flat solution, $h(x,t) =-v_0t+ u_*\ne^{\\omega_k t} e^{{\\rm i} k x}$ and $c(x,t) = c_0 + \\phi_*\ne^{\\omega_k t} e^{{\\rm i} k x}$, where $|u_*|, |\\phi_*| \\ll\n1$,\\cite{Bradley2011b} reads\n\n", "itemtype": "equation", "pos": 35893, "prevtext": "\nwhere $P_0$ is a constant and $\\lambda_i$ is the sputtering\nyield of the $i$ species, such that for $\\alpha_2>0$ erosion is\nmore efficient at surface troughs than at surface peaks, as in\nthe classic Bradley-Harper (BH) mechanism.\\cite{Bradley1988} Finally, the surface current is\n\n", "index": 3, "text": "\\begin{equation}\n\\mathbf{J}_i = -D_i \\rho_s \\nabla c_i + \\frac{D_i \\rho_s c_i\n\\Omega \\gamma}{k_BT} \\nabla \\nabla^2 h - \\mu_i c_i \\nabla h,\n\\label{eq_j}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathbf{J}_{i}=-D_{i}\\rho_{s}\\nabla c_{i}+\\frac{D_{i}\\rho_{s}c_{i}\\Omega\\gamma%&#10;}{k_{B}T}\\nabla\\nabla^{2}h-\\mu_{i}c_{i}\\nabla h,\" display=\"block\"><mrow><mrow><msub><mi>𝐉</mi><mi>i</mi></msub><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><msub><mi>D</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo>∇</mo><mo>⁡</mo><msub><mi>c</mi><mi>i</mi></msub></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mrow><msub><mi>D</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mi>γ</mi></mrow><mrow><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi></mrow></mfrac><mo>⁢</mo><mrow><mrow><mo>∇</mo><mo>⁡</mo><msup><mo>∇</mo><mn>2</mn></msup></mrow><mo>⁡</mo><mi>h</mi></mrow></mrow></mrow><mo>-</mo><mrow><msub><mi>μ</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>h</mi></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02534.tex", "nexttext": "\nNaturally, both $G$ and $C$ depend on the parameters entering\nmodel (\\ref{eqh})-(\\ref{eq_j}). For our case of interest, we\nobtain\n\n", "itemtype": "equation", "pos": 38576, "prevtext": "\nwhere the first term on the rhs is Fickian diffusion ($D_i$ is\nsurface diffusivity and $\\rho_s$ the areal density of mobile\nsurface atoms), the second one is Mullins' surface diffusion\n($\\gamma$ is surface tension and $T$ is temperature), and the\nlast one is a stabilizing Carter-Vishnyakov (CV)\nterm,\\cite{Carter1996} in which $\\mu_i >0$. For our experimental\nsystem, for which the topmost surface layer can be thought of as an amorphous Si phase with Au impurities, CV terms can be\nthought of as proxies of surface-confined viscous flow, recently shown to describe IBS patterning of clean Si\ntargets.\\cite{Umbach2001,Castro2010,Cuerno2011,Castro2012a,Castro2012b,Norris2012,Moreno-Barrado2015,Moreno-Barrado2015b,Moreno-Barrado2015c}\nIn such a case, the coefficient in front of the third order\nderivative term in $\\mathbf{J}_B$ should more properly be\nrelated with radiation-induced viscosity. Nevertheless, this\nfact does not play a relevant role in the discussion to follow.\nSimilarly, note that pure Au targets recrystallize very\nefficiently under our experimental conditions, so that $\\mu_A$\nis small as discussed above, at least in regions where the Au\ndensity is high enough that recrystallization becomes feasible.\n\nThe analysis of model (\\ref{eqh})-(\\ref{eq_j}) performed in\nRef.\\ \\onlinecite{Bradley2011b} corresponds to the case of\nimmobile impurities, i.e., $D_A=\\mu_A=0$. Moreover, a coordinate rescaling is performed \\cite{Bradley2011b,Bradley2012b} by\nconstants which are inversely proportional to the sputtering\nyield difference, $(\\lambda_A - \\lambda_B)$. But, because of the SRIM result from Fig.\\ \\ref{fig:srim}, we are interested in a system with the same sputtering yields for both species, for which this parameter combination is zero.\n\nWe have performed a linear stability analysis of the full model\n(\\ref{eqh})-(\\ref{eq_j}) for precisely the case in which\n$\\lambda_A = \\lambda_B \\equiv \\lambda$ and $D_A, \\mu_A\\neq 0$.\nThe result is that the model supports a flat solution $h=- v_0\nt$ and $c_s = c_0$, characterized by a constant surface velocity $v_0=\\Omega (\\lambda P_0-F_d)$ and uniform impurity coverage\n$c_0=F_d/(\\lambda P_0)$. Moreover, under the standard\nlarge-wavelength approximation (namely, for wave-vectors $k \\ll\n1$), the linear dispersion relation $\\omega_k$ for periodic\nperturbations of this flat solution, $h(x,t) =-v_0t+ u_*\ne^{\\omega_k t} e^{{\\rm i} k x}$ and $c(x,t) = c_0 + \\phi_*\ne^{\\omega_k t} e^{{\\rm i} k x}$, where $|u_*|, |\\phi_*| \\ll\n1$,\\cite{Bradley2011b} reads\n\n", "index": 5, "text": "\\begin{equation}\n{\\rm Re}(\\omega_k^{+}) \\simeq -C k^2 - G k^4 . \\label{eq_wk}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"{\\rm Re}(\\omega_{k}^{+})\\simeq-Ck^{2}-Gk^{4}.\" display=\"block\"><mrow><mrow><mrow><mi>Re</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>ω</mi><mi>k</mi><mo>+</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>≃</mo><mrow><mrow><mo>-</mo><mrow><mi>C</mi><mo>⁢</mo><msup><mi>k</mi><mn>2</mn></msup></mrow></mrow><mo>-</mo><mrow><mi>G</mi><mo>⁢</mo><msup><mi>k</mi><mn>4</mn></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02534.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 38799, "prevtext": "\nNaturally, both $G$ and $C$ depend on the parameters entering\nmodel (\\ref{eqh})-(\\ref{eq_j}). For our case of interest, we\nobtain\n\n", "index": 7, "text": "\\begin{equation}\n\nC = \\Omega\\left[ c_0 (\\mu_A - \\alpha_2 \\lambda_A) + (1-c_0) (\\mu_B- \\alpha_2 \\lambda_B) \\right] \\label{eq_C}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\par&#10; C=\\Omega\\left[c_{0}(\\mu_{A}-\\alpha_{2}\\lambda_{A})+(1-c_{0})(\\mu_{B}-%&#10;\\alpha_{2}\\lambda_{B})\\right]\" display=\"block\"><mrow><mi>C</mi><mo>=</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>c</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>μ</mi><mi>A</mi></msub><mo>-</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>λ</mi><mi>A</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>c</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>μ</mi><mi>B</mi></msub><mo>-</mo><mrow><msub><mi>α</mi><mn>2</mn></msub><mo>⁢</mo><msub><mi>λ</mi><mi>B</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02534.tex", "nexttext": "\nwhere $\\Omega_i=\\Omega {D_i \\rho_s \\gamma}/({k_BT})$.\n\n\nThe morphological stability of the surface is controlled by the\nsign of the constant $C$ in Eq.\\ \\eqref{eq_C}, in a way that in\nprinciple agrees with the simplest expectations: If the impurity concentration is very large ($c_0\\simeq 1$), then $C \\simeq\n\\Omega (\\mu_A - \\alpha_2 \\lambda_A) < 0$ because gold is under a\npattern-forming condition (CV effects, $\\mu_A$, are negligible\nwith respect to BH effects, $\\alpha_2 \\lambda_A$), thus the system displays pattern formation. Conversely, for very low impurity\nconcentration ($c_0\\simeq 0$), then $C \\simeq \\Omega (\\mu_B -\n\\alpha_2 \\lambda_B) > 0$, which rules out unstable modes and\npattern formation, because Si is under such stable conditions\n(CV contributions, $\\mu_B$, dominate over BH effects, $\\alpha_2\n\\lambda_B$). Actually, there is a threshold impurity\nconcentration, $c_0^* = (\\mu_B - \\alpha_2 \\lambda_B)/(\\mu_B -\n\\mu_A)$, such that patterns form only provided $c_0>c_0^*$.\n\nThus, model (\\ref{eqh})-(\\ref{eq_j}) can in principle\nrationalize the basic experimental fact that Au impurities lead\nto pattern formation in our Si targets. However, a number of\nfurther considerations have to be made at this point:\n\n\\begin{itemize}\n\\item Although in the experimental system the reference surface\nconcentration of impurities $c_0 \\propto F_d$ is {\\it not} a\nspace-independent constant as assumed in the model, the\nvariation of the deposition flux across the experimental system\ndoes occur in macroscopic scales which are much larger than the\nripple wavelength. On the other hand, in our experiments we\nobtain ripple formation throughout the sample, while the model\nleads to expecting flat surfaces for regions where $c_0 <\nc_0^*$. This was checked in Fig.~\\ref{Null_Pattern}, but perhaps\nwe did not employ large enough targets, with areas sufficiently\nfar from the Au source, featuring no surface pattern.\n\n\\item Whenever pattern formation occurs in the model topography,\na space modulation simultaneously takes place in the composition field. As discussed in Sec.\\ \\ref{sec:results}, in the\nexperiments such type of composition pattern is seen in the\nrelatively Au-rich regions only, being possibly beyond detection limit in the Au-poorer regions, for the experimental technique\nemployed.\n\n\\item The model suggests that, in regions where the impurity\nconcentration $c_0$ takes intermediate values, ripple formation\nis analogous to what is seen for a pure Au system. However, this is not the case in the experiments either: in the former case\nperpendicular ripples are observed, while parallel ripples form\non the relatively Au-rich regions which are very close to the\nimpurity source.\n\\end{itemize}\n\nThe lack of simultaneous patterning in the surface morphology\nand composition suggests the need for a closer experimental\ncharacterization of the space distribution of atomic species in\nthe amorphized surface layer that ensues. From the general point of view of reaction-diffusion type models,\\cite{Cross2009} like\nthe present two-field model\n(\\ref{eqh})-(\\ref{eq_j}),\\cite{Munoz-Garcia2014} simultaneous\npatterning of the two fields, i.e., height and impurity\nconcentration, is the rule rather than the exception.\n\nOn the other hand, indeed the assumption of normal incidence for both, ions and impurity atoms recoiling from the gold source, is an overly simplifying one. On the basis of the mentioned IBS\nexperiments on Si targets with concurrent silicide-forming\nimpurity co-deposition, a high relative angle between the ions\nand impurities has been suggested to facilitate pattern\nformation.\\cite{Engler2014} Moreover, the results in Sect.\\\n\\ref{sec:results} show a rotation of the ripple structure with\nincreasing Au concentration. Thus, a two-dimensional\ngeneralization of model (\\ref{eqh})-(\\ref{eq_j}) is required,\nfor arbitrary ion and impurity incidence angles. This will lead\nin particular to an anisotropic version of the linear dispersion relation (\\ref{eq_wk})-(\\ref{eq_B}). However, it is not obvious\nthat this can improve the results on the ripple orientation as a function of impurity concentration $c_0$. This is because,\nexperimentally, the $y$ axis is the only unstable direction for\nAu, while both directions are stable for Si. Therefore, a convex linear combination of the (2D anisotropic generalizations of\nthe) Au and Si 2D linear dispersion relations, such as Eq.\\\n\\eqref{eq_C} is, cannot possibly yield an unstable $x$\ndirection, as would be needed to explain the ripple orientation\nfor intermediate impurity concentrations.\n\nIn the search for alternative models to account for the present\nobservations, we note that, although formulated for\n(impurity-free) IBS of binary systems, a model has been put\nforward \\cite{Norris2013b} in which (ion-assisted)\nphase-separation can control the nano structuring process. In\nthis work it is concluded that pattern formation will occur\nonly if phase separation in the amorphized layer is fast enough so\nthat it completes before the layer is sputtered away. Moreover,\nthe morphological transition in such a case leads to highly\nordered patterns. The large degree of disorder in the\nperpendicular ripple structures we observe, and the relative\nhomogeneity of the amorphous layer in the corresponding regions,\nboth contrast with these theoretical results.\n\nSeeking for further theoretical descriptions, recall that, for\npure Si targets, ripple formation has been recently accounted\nfor on the basis of viscous flow of the topmost amorphized\nlayer.\\cite{Castro2010,Cuerno2011,Castro2012a,Castro2012b,Norris2012,Moreno-Barrado2015,Moreno-Barrado2015b,Moreno-Barrado2015c}In\nthis approach, a crucial effect of ion irradiation is\ninducing residual stress in the amorphous layer, which is\nrelaxed via solid flow. The characteristics of the surface\ndynamics are contingent upon the properties of the\nnon-homogeneous stress distribution that builds up within the\nlayer,\\cite{Moreno-Barrado2015,Moreno-Barrado2015b} which in\nparticular controls the value of the critical incidence\n$\\theta_c$ angle for the ions, above which perpendicular ripples form.\nIn our present experiment, ripple formation does not occur on uncontaminated Si, namely $\\theta_c \\gtrsim 90^{\\circ}$,\nwhich we expect to originate in the properties of the stress\ndistribution under the corresponding conditions. Recently, a\nsimilar result has been accounted for \\cite{Hofsass2015} on the\nbasis of material redistribution using a Monte Carlo-based\ncrater function approach, which we believe can constitute an\nequivalent, microscopic-based description of viscous flow.\nUnder this scenario, perpendicular ripple formation\nin our experiments for intermediate impurity concentration might occur due to the\ninfluence of Au impurities in the stress distribution. Indeed,\nrecall the results of our SRIM simulations that recoiled Au\natoms transfer momentum to the Si atoms and can displace them by close to 1 nm.\nSuch a displacement may reflect into a modified\nstress distribution, to such an extent that it may be\nresponsible for the formation of perpendicular ripples. In the\nrelatively Au-rich regions, due to efficient recrystallization,\nthe high gold coverage would override viscous flow and lead to\nparallel ripple formation, akin to a pure Au target under the\nsame sputtering conditions.\n\n\n\n\n\n\n\n\n\\section{Discussion}\n\\label{sec:disc}\n\n\n\n\n\n\n\n\n\nOur experimental results show that, under conditions for which\npure Si targets do not become structured under IBS, Au\nimpurities can induce surface pattern formation, in a way that\nis correlated with the impurity concentration. This is in spite\nof the fact that, as discussed in detail\nelsewhere,\\cite{Hofsass2013apa} no silicide is expected to form\nfor our combination or materials. Already at the low Au\nconcentration values reached far ($\\gtrsim 10$ mm) from the\nimpurity source, a perpendicular ripple pattern forms, which is\nstrongly disordered and has small wavelength and amplitude. The\norientation of these ripples conforms to expectations based on\nsilicide-forming impurities,\\cite{Engler2014} that a large\nrelative angle between ions and recoiling impurity\natoms, $\\alpha$, enhances pattern formation. In our case, such an angle\nvalue is large indeed, $\\alpha \\simeq 150^{\\circ}$. This fact\nmay account for the disagreement between some of our\nexperimental observations and currently available models, usually\nstudied for small $\\alpha$.\n\n\nCloser to the gold plate, for moderate but increasing impurity concentration values, the\nwavelength of the perpendicular ripples also\nincreases. However, in this range of Au concentration values we\nhave not been able to detect a direct correlation between the\nbehaviors of the topography and the composition, i.e.,\nwe do not find a space modulation of Au concentration field. If there is\nany, it remains beyond detection limit for the STEM measurements\nreported in Sec.\\ \\ref{sec:results}. This fact calls for a more\ndetailed experimental assessment of the impurity concentration,\nwith respect to both, the substrate coordinates (composition\nmodulation) and the depth along the thickness of the amorphized\nlayer.\n\nActually, co-deposition of Au impurities has been already\nattempted previously\\cite{Hofsass2013apa,Engler2014} in order to surface pattern\nSi through IBS, to no effect. The experimental conditions\nemployed in these works are nevertheless different from ours,\nthe most notable difference is our large relative angle\nbetween ions and the recoiling Au atoms. Engler {\\it et al}.\\\nalready \\cite{Engler2014} suggested experimental setups with\nlarge $\\alpha$ to maximize the coupling between height\nfluctuations and the concentration modulation via shadowing\neffects. A second major feature of our setup is the large\nion incidence angle, $\\theta$, employed. In our case $\\theta=75^\\circ$. This also stems from\nan observation by Engler {\\it et al.} They observed that large incidence angles drive Si marginally stable, already without Au co-deposition.\n\nThese might have also triggered our system into the unstable state, giving\nthe patterns we observe. As a third difference with previous works, we have used Ar$^+$\nions, which are lighter than previous choices, such as Xe$^+$ or\nKr$^+$. Note that the use of light elements as projectiles does\nnot necessarily enhance pattern formation in the absence of\nimpurity co-deposition. Thus, under our sputtering condition\nAr$^+$ does not induce ripple formation on clean Si, while\nKr$^+$ does.\\cite{Engler2014} Indeed, the ion/target mass ratio\nis known to play a non-trivial role\nin the ion-induced stress distribution and thus in the\npatterning properties of\nSi.\\cite{Moreno-Barrado2015,Moreno-Barrado2015c}\n\n\n\nIncreased momentum transfer from the use of\nheavy projectiles is supposed to drive the Si substrate into the\nunstable state. In short, our experimental combination of relatively high\n$\\alpha$ and $\\theta$ values seems to cooperatively destabilize\nthe Si surface under IBS for relatively low impurity\nconcentrations. Then, the space modulation of the latter,\ncoupled to height fluctuations, might have led to the observed\nperpendicular ripple patterns. This picture needs to be taken\nwith caution, since precisely in the Au-poor regions we cannot\ndetect the modulation of the Au concentration profile.\n\nFor locations which are sufficiently close to the Au source,\nimpurities are able to form clusters, as seen in our HR TEM\nimages, which appear to be dispersed within an amorphous Si\nmatrix. Morphologically, this seems sufficient for the surface\nto display parallel ripples, very much akin to those obtained on\npure Au films. The concentration of Au which is required for\nthis behavior has a moderate value near $6\\%$. Close to it, the\nmorphological behavior corresponds to a transition between the\ntopographies observed for relatively low and relatively high Au\nconcentrations. Thus, somehow a superposition of the two ripple\nstructures is observed, characterized (recall the PSD curves in\nFig.\\ \\ref{PSD}) by an increase of the ripple wavelength in the\n$x$ direction until disappearance of the characteristic scale\nalong this direction for increasing Au concentration. This occurs together\nwith simultaneous appearance of a characteristic wavelength\nalong the $y$ direction. The behavior of the PSD curves seems\nreminiscent\\cite{Cross2009} of a morphological Type II\ntransition along the $x$ direction and a Type I transition along the $y$ direction: indeed,\\cite{Cross2009} in a Type II\ntransition the characteristic wavelength diverges when\napproaching the transition point from the pattern-forming side.\nThis is actually the experimentally observed behavior for pure\nsapphire\\cite{Zhou2007} or Si targets in the absence of\nimpurities at low\nenergies.\\cite{Madi2008,Madi2009,Madi2011,Madi2012,Castro2012b,Moreno-Barrado2015}\nIn contrast, a Type I morphological transition features the\nsudden appearance of a characteristic wavelength at the\ncorresponding transition point.\\cite{Cross2009} To date, there\nseem to be no experimental observations of Type I transitions in\nthe context of IBS surface nanopatterning.\\cite{Madi2012} Note\nan alternative scenario is actually feasible for our\nexperimental results, as already discussed above: The coherence\nlength along the $y$ axis of the low-Au-concentration ripples\nmay be indicating that the corresponding wave-vector corresponds\nto an unstable Fourier mode of the height, which is not the most dominant mode\nfor such Au concentration values, but becomes so\nat a sufficiently high value of the impurity concentration.\nHence, systematic experimental confirmation of the type of\nmorphological transition that is actually taking place seems\nrequired. In particular, this may provide an invaluable hint to\nthe theoretical modeling, as the transition type usually\nconstrains basic structural aspects of potential theoretical\ndescriptions.\n\nOn general grounds, the lack of compound formation and the fact\nthat ripples are actually induced on the Si target ---already\nfor very small impurity concentration values under otherwise\nnon-pattern forming conditions--- leads one naturally to\ncontemplate the relevance of viscous flow as the mechanism\ncontrolling the surface dynamics. Indeed, it has been recently\nshown\\cite{Moreno-Barrado2015,Moreno-Barrado2015c}\nfor clean Si targets that modifications in the space distribution of\nirradiation-induced stress, e.g.\\ by changing the ion/target combination,\ncan alter the morphological stability of the surface. In the\npresent experiments, changes in the impurity concentration are\nalso shown to have a similar impact, hence it is natural to\nponder whether they correlate with analogous modifications in\nthe stress distribution which could account to the observed\nripple properties. Microscopic, e.g.\\ Molecular Dynamics,\nsimulations can be naturally expected to provide insights into\nthis issue.\n\n\\section{Summary and Conclusion}\n\\label{sec:concl}\n\nWe find that Au co-deposition can catalyze pattern formation on\nSi(001) during IBS under a sputter condition producing no\npatterns on clean Si(001). With the increase of Au flux\ncloser to the Au co-sputtered target, the ripple pattern on Si\nchanges its $k$-vector direction, parallel to perpendicular\nto the surface-projected ion beam direction. Au does not form stable\nsilicides, so that the present observation is at variance with\nthe prevailing notion that silicide formation is a\nprerequisite for impurity-induced pattern formation.\n\nWithin an existing minimal model coupling the dynamics of\nthe height and concentration fields, in which no silicide\nformation takes place, the instability can still develop with\nthe increase of Au concentration. The present work, thus, provides\na first example demonstrating such a novel mechanism for\nimpurity-induced pattern formation without invoking silicide formation.\nImprovement of the theoretical model is still required in order to reflect the\nreal experimental situation and elucidate many unattended observations, such as the ripple\nreorientation transition.\n\nAs predicted by the model, we observe a modulation of the Au concentration in the patterns\nformed with a relatively high impurity flux. Replenishing the Au coverage by the continuous influx of recoiled impurity atoms from the gold target reduces the effective sputtering\nyield of gold near the Au segregated crest, thus the resulting inhomogeneity of the sputtering yield can promote pattern formation. For the relatively Au-poor region, such a spatial\ninhomogeneity is not discernible for the impurity coverage, so that the generalization of the picture awaits further elaborate experimental investigation.\n\n\n\\section{Acknowledgments}\n\nWe would like to thank L. V\\'azquez for discussions. This work\nwas supported by NRF (Korea) Grants Nos.\\ 2014K2A1A2048433 and\n2013R1A2000245 and by MINECO (Spain) Grants Nos.\\ FIS2012-32349\nand FIS2012-38866-C05-01.\n\n\n\n\n\n\n\n\\begin{thebibliography}{47}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\\expandafter\\ifx\\csname bibnamefont\\endcsname\\relax\n  \\def\\bibnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname bibfnamefont\\endcsname\\relax\n  \\def\\bibfnamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname citenamefont\\endcsname\\relax\n  \\def\\citenamefont#1{#1}\\fi\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem[{\\citenamefont{Mu{\\~n}oz-Garc{\\'\\i}a\n  et~al.}(2009)\\citenamefont{Mu{\\~n}oz-Garc{\\'\\i}a, V{\\'a}zquez, Cuerno,\n  S{\\'a}nchez-Garc{\\'\\i}a, Castro, and Gago}}]{Munoz-Garcia2009book}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V{\\'a}zquez}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{author}{\\bibfnamefont{J.~A.} \\bibnamefont{S{\\'a}nchez-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}}, in\n  \\emph{\\bibinfo{booktitle}{Toward Functional Nanomaterials}}, edited by\n  \\bibinfo{editor}{\\bibfnamefont{Z.~M.} \\bibnamefont{Wang}}\n  (\\bibinfo{publisher}{Springer}, \\bibinfo{year}{2009}), pp.\n  \\bibinfo{pages}{323--398}.\n\n\\bibitem[{\\citenamefont{Facsko et~al.}(1999)\\citenamefont{Facsko, Dekorsy,\n  Koerdt, Trappe, Kurz, Vogt, and Hartnagel}}]{Facsko1999}\n\\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Facsko}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Dekorsy}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Koerdt}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Trappe}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Kurz}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Vogt}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.~L.} \\bibnamefont{Hartnagel}},\n  \\bibinfo{journal}{Science} \\textbf{\\bibinfo{volume}{285}},\n  \\bibinfo{pages}{1551} (\\bibinfo{year}{1999}).\n\n\\bibitem[{\\citenamefont{Mu{\\~n}oz-Garc{\\'\\i}a\n  et~al.}(2014)\\citenamefont{Mu{\\~n}oz-Garc{\\'\\i}a, V\\'azquez, Castro, Gago,\n  Redondo-Cubero, Moreno-Barrado, and Cuerno}}]{Munoz-Garcia2014}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V\\'azquez}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Redondo-Cubero}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Moreno-Barrado}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Materials Science and Engineering: R: Reports}\n  \\textbf{\\bibinfo{volume}{86}}, \\bibinfo{pages}{1} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Gago et~al.}(2001)\\citenamefont{Gago, V\\'{a}zquez,\n  Cuerno, Varela, Ballesteros, and Albella}}]{Gago2001}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V\\'{a}zquez}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Varela}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Ballesteros}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{J.~M.}\n  \\bibnamefont{Albella}}, \\bibinfo{journal}{Applied Physics Letters}\n  \\textbf{\\bibinfo{volume}{78}}, \\bibinfo{pages}{3316} (\\bibinfo{year}{2001}).\n\n\\bibitem[{\\citenamefont{Ozaydin et~al.}(2005)\\citenamefont{Ozaydin, \\\"Ozcan,\n  Wang, Ludwig, Zhou, Headrick, and Siddons}}]{Ozaydin2005}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Ozaydin}},\n  \\bibinfo{author}{\\bibfnamefont{A.~S.} \\bibnamefont{\\\"Ozcan}},\n  \\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Wang}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Ludwig}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Zhou}},\n  \\bibinfo{author}{\\bibfnamefont{R.~L.} \\bibnamefont{Headrick}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{D.~P.}\n  \\bibnamefont{Siddons}}, \\bibinfo{journal}{Applied Physics Letters}\n  \\textbf{\\bibinfo{volume}{87}}, \\bibinfo{pages}{163104}\n  (\\bibinfo{year}{2005}).\n\n\\bibitem[{\\citenamefont{Zhou et~al.}(2011)\\citenamefont{Zhou, Facsko, Lu, and\n  Moller}}]{Zhou2011}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Zhou}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Facsko}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Lu}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{W.}~\\bibnamefont{Moller}},\n  \\bibinfo{journal}{Journal of Applied Physics} \\textbf{\\bibinfo{volume}{109}},\n  \\bibinfo{pages}{104315} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Madi et~al.}(2011)\\citenamefont{Madi, Anzenberg,\n  Ludwig~Jr, and Aziz}}]{Madi2011}\n\\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Madi}},\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Anzenberg}},\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Ludwig~Jr}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Aziz}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{106}},\n  \\bibinfo{pages}{66101} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Hofs{\\\"a}ss and Zhang}(2008)}]{Hofsass2008}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Hofs{\\\"a}ss}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Zhang}},\n  \\bibinfo{journal}{Applied Physics A} \\textbf{\\bibinfo{volume}{92}},\n  \\bibinfo{pages}{517} (\\bibinfo{year}{2008}).\n\n\\bibitem[{\\citenamefont{Macko et~al.}(2010)\\citenamefont{Macko, Frost, Ziberi,\n  F\\\"{o}rster, and Michely}}]{Macko2010}\n\\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Macko}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Frost}},\n  \\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Ziberi}},\n  \\bibinfo{author}{\\bibfnamefont{D.~F.} \\bibnamefont{F\\\"{o}rster}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Michely}},\n  \\bibinfo{journal}{Nanotechnology} \\textbf{\\bibinfo{volume}{21}},\n  \\bibinfo{pages}{085301} (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Zhang et~al.}(2011)\\citenamefont{Zhang, Br{\\\"o}tzmann,\n  and Hofs{\\\"a}ss}}]{Zhang2011}\n\\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Zhang}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Br{\\\"o}tzmann}},\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Hofs{\\\"a}ss}},\n  \\bibinfo{journal}{New Journal of Physics} \\textbf{\\bibinfo{volume}{13}},\n  \\bibinfo{pages}{013033} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Macko et~al.}(2011)\\citenamefont{Macko, Frost, Engler,\n  Hirsch, H{\\\"o}che, Grenzer, and Michely}}]{Macko2011}\n\\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Macko}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Frost}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Engler}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Hirsch}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{H{\\\"o}che}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Grenzer}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Michely}},\n  \\bibinfo{journal}{New Journal of Physics} \\textbf{\\bibinfo{volume}{13}},\n  \\bibinfo{pages}{073017} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Hofs{\\\"a}ss et~al.}(2013)\\citenamefont{Hofs{\\\"a}ss,\n  Bobes, and Zhang}}]{Hofsass2013}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Hofs{\\\"a}ss}},\n  \\bibinfo{author}{\\bibfnamefont{O.}~\\bibnamefont{Bobes}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Zhang}},\n  \\bibinfo{journal}{AIP Conference Proceedings}\n  \\textbf{\\bibinfo{volume}{1525}}, \\bibinfo{pages}{386} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Engler et~al.}(2014)\\citenamefont{Engler, Frost,\n  M{\\\"u}ller, Macko, Will, Feder, Spermann, H{\\\"u}bner, Facsko, and\n  Michely}}]{Engler2014}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Engler}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Frost}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{M{\\\"u}ller}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Macko}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Will}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Feder}},\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Spermann}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{H{\\\"u}bner}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Facsko}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Michely}},\n  \\bibinfo{journal}{Nanotechnolgy} \\textbf{\\bibinfo{volume}{25}},\n  \\bibinfo{pages}{115303} (\\bibinfo{year}{2014}).\n\n\\bibitem[{\\citenamefont{Bradley}(2013)}]{Bradley2013a}\n\\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{Bradley}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{87}},\n  \\bibinfo{pages}{205408} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Zhou and Lu}(2010)}]{Zhou2010}\n\\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Zhou}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Lu}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{82}},\n  \\bibinfo{pages}{125404} (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Bradley}(2011)}]{Bradley2011b}\n\\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{Bradley}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{83}},\n  \\bibinfo{pages}{195410} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Bradley and Shipman}(2012)}]{Bradley2012b}\n\\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{Bradley}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{P.~D.} \\bibnamefont{Shipman}},\n  \\bibinfo{journal}{Applied Surface Science} \\textbf{\\bibinfo{volume}{258}},\n  \\bibinfo{pages}{4161} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Bradley}(2012)}]{Bradley2012a}\n\\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{Bradley}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{85}},\n  \\bibinfo{pages}{115419} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Kim et~al.}(2009)\\citenamefont{Kim, Joe, Kim, Ha, Lee,\n  Kahng, and Kim}}]{Kim2009}\n\\bibinfo{author}{\\bibfnamefont{J.-H.} \\bibnamefont{Kim}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Joe}},\n  \\bibinfo{author}{\\bibfnamefont{S.-P.} \\bibnamefont{Kim}},\n  \\bibinfo{author}{\\bibfnamefont{N.-B.} \\bibnamefont{Ha}},\n  \\bibinfo{author}{\\bibfnamefont{K.-R.} \\bibnamefont{Lee}},\n  \\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Kahng}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{J.-S.} \\bibnamefont{Kim}},\n  \\bibinfo{journal}{Phys. Rev. B} \\textbf{\\bibinfo{volume}{79}},\n  \\bibinfo{pages}{205403} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Metya and Ghose}(2013)}]{Metya:2013bq}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Metya}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{D.}~\\bibnamefont{Ghose}},\n  \\bibinfo{journal}{Applied Physics Letters} \\textbf{\\bibinfo{volume}{103}},\n  \\bibinfo{pages}{161602} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Kim et~al.}(2013)\\citenamefont{Kim, Kim,\n  Mu{\\~n}oz-Garc{\\'\\i}a, and Cuerno}}]{Kim2013}\n\\bibinfo{author}{\\bibfnamefont{J.-H.} \\bibnamefont{Kim}},\n  \\bibinfo{author}{\\bibfnamefont{J.-S.} \\bibnamefont{Kim}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{87}},\n  \\bibinfo{pages}{085438} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Redondo-Cubero\n  et~al.}(2012)\\citenamefont{Redondo-Cubero, Gago, Palomares, M{\\\"u}cklich,\n  Vinnichenko, and V{\\'a}zquez}}]{Redondo-cubero2012}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Redondo-Cubero}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Palomares}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{M{\\\"u}cklich}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Vinnichenko}},\n  \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V{\\'a}zquez}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{86}},\n  \\bibinfo{pages}{085436} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Hofs\\\"{a}ss et~al.}(2013)\\citenamefont{Hofs\\\"{a}ss,\n  Zhang, Pape, Bobes, and Br\\\"{o}tzmann}}]{Hofsass2013apa}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Hofs\\\"{a}ss}},\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Zhang}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Pape}},\n  \\bibinfo{author}{\\bibfnamefont{O.}~\\bibnamefont{Bobes}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Br\\\"{o}tzmann}},\n  \\bibinfo{journal}{Applied Physics A} \\textbf{\\bibinfo{volume}{111}},\n  \\bibinfo{pages}{653} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Valbusa et~al.}(2002)\\citenamefont{Valbusa, Boragno,\n  and Buatier~de Mongeot}}]{Valbusa2002}\n\\bibinfo{author}{\\bibfnamefont{U.}~\\bibnamefont{Valbusa}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Boragno}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{F.}~\\bibnamefont{Buatier~de Mongeot}},\n  \\bibinfo{journal}{Journal of Physics: Condensed Matter}\n  \\textbf{\\bibinfo{volume}{14}}, \\bibinfo{pages}{8153} (\\bibinfo{year}{2002}).\n\n\\bibitem[{\\citenamefont{Bradley and Harper}(1988)}]{Bradley1988}\n\\bibinfo{author}{\\bibfnamefont{R.~M.} \\bibnamefont{Bradley}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{J.~M.~E.} \\bibnamefont{Harper}},\n  \\bibinfo{journal}{Journal of Vacuum Science and Technology A}\n  \\textbf{\\bibinfo{volume}{6}}, \\bibinfo{pages}{2390} (\\bibinfo{year}{1988}).\n\n\\bibitem[{\\citenamefont{Chan and Chason}(2007)}]{Chan2007}\n\\bibinfo{author}{\\bibfnamefont{W.~L.} \\bibnamefont{Chan}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Chason}},\n  \\bibinfo{journal}{Journal of Applied Physics} \\textbf{\\bibinfo{volume}{101}},\n  \\bibinfo{pages}{121301} (\\bibinfo{year}{2007}).\n\n\\bibitem[{\\citenamefont{Ziegler et~al.}(2010)\\citenamefont{Ziegler, Ziegler,\n  and Biersack}}]{Ziegler2010}\n\\bibinfo{author}{\\bibfnamefont{J.~F.} \\bibnamefont{Ziegler}},\n  \\bibinfo{author}{\\bibfnamefont{M.~D.} \\bibnamefont{Ziegler}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{J.~P.}\n  \\bibnamefont{Biersack}}, \\bibinfo{journal}{Nuclear Instruments and Methods in\n  Physics Research Section B: Beam Interactions with Materials and Atoms}\n  \\textbf{\\bibinfo{volume}{268}}, \\bibinfo{pages}{1818} (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Carter and Vishnyakov}(1996)}]{Carter1996}\n\\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{Carter}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Vishnyakov}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{54}},\n  \\bibinfo{pages}{17647} (\\bibinfo{year}{1996}).\n\n\\bibitem[{\\citenamefont{Baumann and Schr{\\\"o}ter}(1991)}]{Baumann1991}\n\\bibinfo{author}{\\bibfnamefont{F.~H.} \\bibnamefont{Baumann}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{W.}~\\bibnamefont{Schr{\\\"o}ter}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{43}},\n  \\bibinfo{pages}{6510} (\\bibinfo{year}{1991}).\n\n\\bibitem[{\\citenamefont{Kree et~al.}(2009)\\citenamefont{Kree, Yasseri, and\n  Hartmann}}]{Kree2009}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Kree}},\n  \\bibinfo{author}{\\bibfnamefont{T.}~\\bibnamefont{Yasseri}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Hartmann}},\n  \\bibinfo{journal}{Nuclear Instruments and Methods in Physics Research Section\n  B: Beam Interactions with Materials and Atoms}\n  \\textbf{\\bibinfo{volume}{267}}, \\bibinfo{pages}{1403} (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Shenoy et~al.}(2007)\\citenamefont{Shenoy, Chan, and\n  Chason}}]{Shenoy2007}\n\\bibinfo{author}{\\bibfnamefont{V.}~\\bibnamefont{Shenoy}},\n  \\bibinfo{author}{\\bibfnamefont{W.}~\\bibnamefont{Chan}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{E.}~\\bibnamefont{Chason}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{98}},\n  \\bibinfo{pages}{256101} (\\bibinfo{year}{2007}).\n\n\\bibitem[{\\citenamefont{Cuerno et~al.}(2011)\\citenamefont{Cuerno, Castro,\n  Mu{\\~n}oz-Garc{\\'\\i}a, Gago, and V{\\'a}zquez}}]{Cuerno2011}\n\\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V{\\'a}zquez}},\n  \\bibinfo{journal}{Nuclear Instruments and Methods in Physics Research Section\n  B: Beam Interactions with Materials and Atoms}\n  \\textbf{\\bibinfo{volume}{269}}, \\bibinfo{pages}{894} (\\bibinfo{year}{2011}).\n\n\\bibitem[{\\citenamefont{Umbach et~al.}(2001)\\citenamefont{Umbach, Headrick, and\n  Chan}}]{Umbach2001}\n\\bibinfo{author}{\\bibfnamefont{C.~C.} \\bibnamefont{Umbach}},\n  \\bibinfo{author}{\\bibfnamefont{R.~L.} \\bibnamefont{Headrick}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{K.-C.} \\bibnamefont{Chan}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{87}},\n  \\bibinfo{pages}{246104} (\\bibinfo{year}{2001}).\n\n\\bibitem[{\\citenamefont{Castro and Cuerno}(2010)}]{Castro2010}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{arXiv preprint arXiv:1007.2144}  (\\bibinfo{year}{2010}).\n\n\\bibitem[{\\citenamefont{Castro and Cuerno}(2012)}]{Castro2012a}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Applied Surface Science} \\textbf{\\bibinfo{volume}{258}},\n  \\bibinfo{pages}{4171} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Castro et~al.}(2012)\\citenamefont{Castro, Gago,\n  V{\\'a}zquez, Mu{\\~n}oz-Garc{\\'\\i}a, and Cuerno}}]{Castro2012b}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V{\\'a}zquez}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{86}},\n  \\bibinfo{pages}{214107} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Norris}(2012)}]{Norris2012}\n\\bibinfo{author}{\\bibfnamefont{S.~A.} \\bibnamefont{Norris}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{86}},\n  \\bibinfo{pages}{235405} (\\bibinfo{year}{2012}).\n\n\\bibitem[{\\citenamefont{Moreno-Barrado\n  et~al.}(2015{\\natexlab{a}})\\citenamefont{Moreno-Barrado, Castro, Gago,\n  V\\'azquez, Mu{\\~n}oz-Garc{\\'\\i}a, Redondo-Cubero, Galiana, Ballesteros, and\n  Cuerno}}]{Moreno-Barrado2015}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Moreno-Barrado}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V\\'azquez}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Redondo-Cubero}},\n  \\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Galiana}},\n  \\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Ballesteros}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Physical Review B} \\textbf{\\bibinfo{volume}{91}},\n  \\bibinfo{pages}{155303} (\\bibinfo{year}{2015}{\\natexlab{a}}).\n\n\\bibitem[{\\citenamefont{Moreno-Barrado\n  et~al.}(2015{\\natexlab{b}})\\citenamefont{Moreno-Barrado, Gago,\n  Redondo-Cubero, V\\'azquez, Mu{\\~n}oz-Garc{\\'\\i}a, Cuerno, Lorenz, and\n  Castro}}]{Moreno-Barrado2015b}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Moreno-Barrado}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Gago}},\n  \\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Redondo-Cubero}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{V\\'azquez}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{author}{\\bibfnamefont{K.}~\\bibnamefont{Lorenz}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{journal}{EPL} \\textbf{\\bibinfo{volume}{109}}, \\bibinfo{pages}{48003}\n  (\\bibinfo{year}{2015}{\\natexlab{b}}).\n\n\\bibitem[{\\citenamefont{Moreno-Barrado\n  et~al.}(2015{\\natexlab{c}})\\citenamefont{Moreno-Barrado, Castro,\n  Mu{\\~n}oz-Garc{\\'\\i}a, and Cuerno}}]{Moreno-Barrado2015c}\n\\bibinfo{author}{\\bibfnamefont{A.}~\\bibnamefont{Moreno-Barrado}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Castro}},\n  \\bibinfo{author}{\\bibfnamefont{J.}~\\bibnamefont{Mu{\\~n}oz-Garc{\\'\\i}a}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{R.}~\\bibnamefont{Cuerno}},\n  \\bibinfo{journal}{Nuclear Instruments and Methods in Physics Research Section\n  B}  (\\bibinfo{year}{2015}{\\natexlab{c}}).\n\n\\bibitem[{\\citenamefont{Cross and Greenside}(2009)}]{Cross2009}\n\\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Cross}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Greenside}},\n  \\emph{\\bibinfo{title}{Pattern Formation and Dynamics in Nonequilibrium\n  Systems}} (\\bibinfo{publisher}{Cambridge University Press},\n  \\bibinfo{address}{Cambridge, England}, \\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Norris}(2013)}]{Norris2013b}\n\\bibinfo{author}{\\bibfnamefont{S.~A.} \\bibnamefont{Norris}},\n  \\bibinfo{journal}{Journal of Applied Physics} \\textbf{\\bibinfo{volume}{114}},\n  \\bibinfo{pages}{204303} (\\bibinfo{year}{2013}).\n\n\\bibitem[{\\citenamefont{Hofs{\\\"a}ss}(2015)}]{Hofsass2015}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Hofs{\\\"a}ss}},\n  \\bibinfo{journal}{unpublished}  (\\bibinfo{year}{2015}).\n\n\\bibitem[{\\citenamefont{Zhou et~al.}(2007)\\citenamefont{Zhou, Wang, Zhou,\n  Headrick, {\\\"O}zcan, Wang, {\\\"O}zaydin, Jr., and Siddons}}]{Zhou2007}\n\\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{Zhou}},\n  \\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Wang}},\n  \\bibinfo{author}{\\bibfnamefont{L.}~\\bibnamefont{Zhou}},\n  \\bibinfo{author}{\\bibfnamefont{R.~L.} \\bibnamefont{Headrick}},\n  \\bibinfo{author}{\\bibfnamefont{A.~S.} \\bibnamefont{{\\\"O}zcan}},\n  \\bibinfo{author}{\\bibfnamefont{Y.}~\\bibnamefont{Wang}},\n  \\bibinfo{author}{\\bibfnamefont{G.}~\\bibnamefont{{\\\"O}zaydin}},\n  \\bibinfo{author}{\\bibfnamefont{K.~F.~L.} \\bibnamefont{Jr.}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{D.~P.}\n  \\bibnamefont{Siddons}}, \\bibinfo{journal}{Physical Review B}\n  \\textbf{\\bibinfo{volume}{75}}, \\bibinfo{pages}{155416}\n  (\\bibinfo{year}{2007}).\n\n\\bibitem[{\\citenamefont{Madi et~al.}(2008)\\citenamefont{Madi, Davidovitch,\n  George, Norris, Brenner, and Aziz}}]{Madi2008}\n\\bibinfo{author}{\\bibfnamefont{C.}~\\bibnamefont{Madi}},\n  \\bibinfo{author}{\\bibfnamefont{B.}~\\bibnamefont{Davidovitch}},\n  \\bibinfo{author}{\\bibfnamefont{H.}~\\bibnamefont{George}},\n  \\bibinfo{author}{\\bibfnamefont{S.}~\\bibnamefont{Norris}},\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Brenner}}, \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Aziz}},\n  \\bibinfo{journal}{Physical Review Letters} \\textbf{\\bibinfo{volume}{101}},\n  \\bibinfo{pages}{246102} (\\bibinfo{year}{2008}).\n\n\\bibitem[{\\citenamefont{Madi et~al.}(2009)\\citenamefont{Madi, George, and\n  Aziz}}]{Madi2009}\n\\bibinfo{author}{\\bibfnamefont{C.~S.} \\bibnamefont{Madi}},\n  \\bibinfo{author}{\\bibfnamefont{H.~B.} \\bibnamefont{George}},\n  \\bibnamefont{and} \\bibinfo{author}{\\bibfnamefont{M.}~\\bibnamefont{Aziz}},\n  \\bibinfo{journal}{Journal of Physics: Condensed Matter}\n  \\textbf{\\bibinfo{volume}{21}}, \\bibinfo{pages}{224010}\n  (\\bibinfo{year}{2009}).\n\n\\bibitem[{\\citenamefont{Madi and Aziz}(2012)}]{Madi2012}\n\\bibinfo{author}{\\bibfnamefont{C.~S.} \\bibnamefont{Madi}} \\bibnamefont{and}\n  \\bibinfo{author}{\\bibfnamefont{M.~J.} \\bibnamefont{Aziz}},\n  \\bibinfo{journal}{Applied Surface Science} \\textbf{\\bibinfo{volume}{258}},\n  \\bibinfo{pages}{4112} (\\bibinfo{year}{2012}).\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 38945, "prevtext": "\nand\n\n", "index": 9, "text": "\\begin{equation}\nG = \\Omega \\left[c_0 \\Omega_A +(1-c_0)\\Omega_B +c_0 (D_A-D_B)\n\\rho_s (\\lambda \\alpha_2-\\mu_A)/(\\lambda P_0) \\right],\n\\label{eq_B}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"G=\\Omega\\left[c_{0}\\Omega_{A}+(1-c_{0})\\Omega_{B}+c_{0}(D_{A}-D_{B})\\rho_{s}(%&#10;\\lambda\\alpha_{2}-\\mu_{A})/(\\lambda P_{0})\\right],\" display=\"block\"><mrow><mrow><mi>G</mi><mo>=</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>c</mi><mn>0</mn></msub><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>A</mi></msub></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><msub><mi>c</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">Ω</mi><mi>B</mi></msub></mrow><mo>+</mo><mrow><mrow><msub><mi>c</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>D</mi><mi>A</mi></msub><mo>-</mo><msub><mi>D</mi><mi>B</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mi>α</mi><mn>2</mn></msub></mrow><mo>-</mo><msub><mi>μ</mi><mi>A</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>λ</mi><mo>⁢</mo><msub><mi>P</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]