[{"file": "1601.07437.tex", "nexttext": "\nStarting the derivation from the definition of the grandcanonical partition function one can show that the susceptibilities relate to cumulants of the event-by-event multiplicity distributions via\n \n", "itemtype": "equation", "pos": 7172, "prevtext": "\n\n\\begin{frontmatter}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\dochead{}\n\n\n\n\n\\title{The QCD Critical Point and Related Observables}\n\n\n\n\n\n\n\\author{Marlene Nahrgang}\n\n\\address{Department of Physics, Duke University, Durham, North Carolina 27708-0305, USA}\n\n\\begin{abstract}\n\nThe search for the critical point of QCD in heavy-ion collision experiments has sparked enormous interest with the completion of phase I of the RHIC beam energy scan. Here, I review the basics of the thermodynamics of the QCD phase transition and its implications for experimental multiplicity fluctuations in heavy-ion collisions. Several sources of noncritical fluctuations impact the observables and need to be understood in addition to the critical phenomena. Recent progress has been made in dynamical modeling of critical fluctuations, which ultimately is indispensable to understand potential signals of the QCD critical point in heavy-ion collision.\n\\end{abstract}\n\n\\begin{keyword}\n\n\n\n\n\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\n\n\n\n\\section{The QCD phase diagram and heavy-ion collisions}\n\\label{sec:intro}\nOne of the most fascinating opportunities of heavy-ion collisions is the investigation of the phases of strongly interacting matter at finite temperatures and densities. At ultrarelativistic beam energies the interaction of the initial nuclei excites the vacuum and high energies are deposited in the reaction zone, creating a very hot medium of vanishing net-baryon density. At lower beam energies the incoming baryon currents are stopped and the medium is less hot but more dense than at highest beam energies. In these extreme regimes it is expected that a new state of matter, the quark-gluon plasma of colored partonic degrees of freedom is created. The success of models like statistical hadronization \\cite{Andronic:2011yq} and of fluid dynamical simulations \\cite{Song:2010mg,Schenke:2010rr,Gale:2012rq} in comparison to a variety of experimental data, indicates that the medium thermalizes locally and a connection to QCD thermodynamics is possible. \n\nExperimental efforts started at lower beam energies, from Bevalac and AGS to the CERN-SPS, mounting up to highest beam energies at RHIC and the LHC. Recent interest has focused on the possibility of scanning the QCD phase diagram by varying the beam energy in the lower energy region. The recent beam energy scan phase I has been completed at RHIC where ample data has been taken and analyzed \\cite{Kumar:2012fb,Adamczyk:2013dal,Adamczyk:2014fia,Adare:2015aqk}. Currently, the beam energy and system size scan with the NA61 experiment at the CERN-SPS has started and future programs include the beam energy scan phase II at RHIC and upcoming facilities like the CBM \\cite{CBMphysicsbook} experiment at FAIR, GSI Helmholtz Center and NICA \\cite{NICAwhitepaper} at JINR in Dubna. The main goal of these endeavors is the investigation of the QCD phase transition and the discovery of a conjectured critical point at finite net-baryon density.\n\nFrom lattice QCD calculations at zero baryo-chemical potential it is known that the phase change between a partonic and a hadronic medium is an analytic crossover \\cite{Aoki:2006we} in the temperature range of $T_c=145-165$~MeV depending on the respective thermodynamic quantity \\cite{Borsanyi:2010bp}. From universality considerations \\cite{Hatta:2002sj}, studies of effective models \\cite{Scavenius:2000qd,Schaefer:2004en,Ratti:2005jh,Schaefer:2007pw,Pawlowski:2005xe,Skokov:2010wb,Herbst:2010rf} and the nonperturbative Dyson-Schwinger approach \\cite{Fischer:2012vc,Fischer:2014ata} there are good arguments for the existence of a critical point and a subsequent line of first-order phase transition in the phase diagram at finite net-baryon density. The location of the critical point is strongly parameter-dependent, e.g. if a vector-coupling is included, and on the approach to solve the thermodynamics of the model. \n\nIn this overview, I will focus on the connection between the thermodynamics of QCD matter and the experimental data obtained from heavy-ion collisions. Thermodynamics deals with infinite, static and homogeneous systems, which reach equilibrium in the long-time limit according to a set of controlled thermodynamic variables. Systems created in heavy-ion collisions, however, are very dynamical and undergo a variety of stages, e.g. initial state, pre-equilibrium, quark-gluon plasma and the hadronic gas, each contributing various effects to the final particle spectra. It is therefore necessary to include dynamical effects of the phase transition in realistic modeling of heavy-ion collisions and identify further contributions that impact signals of the QCD critical point.\n\n\\section{Fluctuation observables at the phase transition}\n\\label{sec:observables}\nAt the phase transition thermodynamic quantities change characteristically. This is seen in lattice calculations \\cite{Borsanyi:2013bia,Bazavov:2014noa} by the increase of, for example, the energy density scaled by the temperature, $e/T^4$, due to the liberation of color degrees of freedom. The speed of sound, $c_s^2=(\\partial p/\\partial e)_S$, has a minimum around the crossover transition and vanishes at a first-order phase transition. Similarly, the compressibility, $\\kappa_S=-1/V(\\partial V/\\partial p)_S$, has a maximum around the crossover transition and diverges at the first-order phase transition. These quantities are related to an anomaly in the pressure. It is straight forward to describe the phase transition in heavy-ion collisions via fluid dynamical calculations on the level of the equation of state and transport coefficients. In early (ideal) fluid dynamical calculations, for example, a pronounced minimum in the slope of the directed flow $v_1$ was observed at a first-order phase transition compared to the absence of a phase transition \\cite{Stoecker:2004qu}. Since modern calculations \\cite{Steinheimer:2014pfa} with improved schemes for particle production find a substantial reduction of this signal and hardly see any difference between the equation of state of a crossover and of a first-order phase transition, there is currently no confirmed impact of the anomaly in the pressure in simulations of heavy-ion collisions. \n\n\\begin{figure}\n\\includegraphics[width=0.19\\textwidth]{Sigflucs1d.eps}\n\\includegraphics[width=0.19\\textwidth]{Sigflucs2d.eps}\n\\includegraphics[width=0.19\\textwidth]{Sigflucs3d.eps}\n\\includegraphics[width=0.19\\textwidth]{Sigflucs4d.eps}\n\\includegraphics[width=0.19\\textwidth]{Sigflucs5d.eps}\n\\caption{Sketch of the order parameter and its derivatives at a phase transition.}\n\\label{fig:derivatives}\n\\end{figure}\n\n\\subsection{Susceptibilities and event-by-event fluctuations}\nWhile the order parameter(s) change characteristically at the phase transition, more details are revealed by taking derivatives, see Fig.~\\ref{fig:derivatives} for illustration. Derivatives of thermodynamic quantities are related to ensemble fluctuations, which can be measured as event-by-event fluctuations in heavy-ion collisions. The quantities to look at in this respect are the susceptibilities, which are defined as derivatives of the pressure with respect to the chemical potential\n\n", "index": 1, "text": "\\begin{equation}\n \\chi_n=\\frac{\\partial^n(P/T^4)}{\\partial(\\mu/T)^n}\\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\chi_{n}=\\frac{\\partial^{n}(P/T^{4})}{\\partial(\\mu/T)^{n}}\\,.\" display=\"block\"><mrow><mrow><msub><mi>χ</mi><mi>n</mi></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><mrow><msup><mo>∂</mo><mi>n</mi></msup><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>P</mi><mo>/</mo><msup><mi>T</mi><mn>4</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mo>∂</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>μ</mi><mo>/</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow><mi>n</mi></msup></mrow></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\n \n", "itemtype": "equation", "pos": 7458, "prevtext": "\nStarting the derivation from the definition of the grandcanonical partition function one can show that the susceptibilities relate to cumulants of the event-by-event multiplicity distributions via\n \n", "index": 3, "text": "\\begin{equation}\n \\chi_1=\\frac{1}{VT^3} \\langle N\\rangle\\, , \\quad  \\chi_2=\\frac{1}{VT^3} \\langle (\\Delta N)^2\\rangle\\, ,\\quad  \\chi_3=\\frac{1}{VT^3} \\langle (\\Delta N)^3\\rangle\\, , \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\chi_{1}=\\frac{1}{VT^{3}}\\langle N\\rangle\\,,\\quad\\chi_{2}=\\frac{1}{VT^{3}}%&#10;\\langle(\\Delta N)^{2}\\rangle\\,,\\quad\\chi_{3}=\\frac{1}{VT^{3}}\\langle(\\Delta N)%&#10;^{3}\\rangle\\,,\" display=\"block\"><mrow><mrow><mrow><msub><mi>χ</mi><mn>1</mn></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>V</mi><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>N</mi><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><msub><mi>χ</mi><mn>2</mn></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>V</mi><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><msub><mi>χ</mi><mn>3</mn></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>V</mi><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nHere, $N$ is the number of the measured particles or conserved charges and $\\Delta N=N-\\langle N\\rangle$ is the fluctuation around the event-averaged mean. Under the assumption that fluctuations are determined at a hypersurface which corresponds to a fixed temperature, the ratios of susceptibilities \n\n", "itemtype": "equation", "pos": 7657, "prevtext": "\n \n", "index": 5, "text": "\\begin{equation}\n \\chi_4=\\frac{1}{VT^3}\\langle(\\Delta N)^4\\rangle_c \\equiv\\frac{1}{VT^3} \\left(\\langle (\\Delta N)^4\\rangle-3\\langle (\\Delta N)^2\\rangle^2\\right)\\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\chi_{4}=\\frac{1}{VT^{3}}\\langle(\\Delta N)^{4}\\rangle_{c}\\equiv\\frac{1}{VT^{3}%&#10;}\\left(\\langle(\\Delta N)^{4}\\rangle-3\\langle(\\Delta N)^{2}\\rangle^{2}\\right)\\,.\" display=\"block\"><mrow><mrow><msub><mi>χ</mi><mn>4</mn></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi>V</mi><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>4</mn></msup><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub></mrow><mo>≡</mo><mrow><mfrac><mn>1</mn><mrow><mi>V</mi><mo>⁢</mo><msup><mi>T</mi><mn>3</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>4</mn></msup><mo stretchy=\"false\">⟩</mo></mrow><mo>-</mo><mrow><mn>3</mn><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo stretchy=\"false\">⟩</mo></mrow><mn>2</mn></msup></mrow></mrow><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nare independent of the volume to zero-th order in volume fluctuations.\nThe mean $M$, the variance $\\sigma^2$, the skewness $S$ and the kurtosis $\\kappa$ are obtained from measured event-by-event multiplicity distributions and can via Eqs. (\\ref{eq:ratios}) be compared to thermodynamic calculations.\n\n\\subsection{Fluctuations at a critical point}\nThe expected signal in fluctuation observables depends on the type of phase transition, crossover, critical point or first-order phase transition. In particular, the features of a critical point stand out. Due to the divergence of the correlation length of fluctuations, $\\xi\\to\\infty$, microscopic details of the specific interaction become less and less important the closer a system approaches its critical point. The relevant physics are determined by only a couple of parameters, such as the dimensionality of the system and other scale-invariant quantities. In this sense, large classes of physical phenomena, exhibit the same universal behavior in the scaling regime close to a critical point. QCD with finite quark-masses belongs to the universality class of $3$d Ising models. \nIn static and equilibrated systems, critical phenomena emerge as a result of the diverging correlations, most prominently the divergence of the fluctuations of the critical mode $\\sigma$. It has been shown that the higher-order cumulants are more sensitive to the divergence of the correlation \n  \n", "itemtype": "equation", "pos": 8139, "prevtext": "\nHere, $N$ is the number of the measured particles or conserved charges and $\\Delta N=N-\\langle N\\rangle$ is the fluctuation around the event-averaged mean. Under the assumption that fluctuations are determined at a hypersurface which corresponds to a fixed temperature, the ratios of susceptibilities \n\n", "index": 7, "text": "\\begin{equation}\n\\frac{\\chi_2}{\\chi_1}=\\frac{{\\sigma^2}}{M}\\, ,\\quad\\quad  \\quad \\quad \\frac{\\chi_3}{\\chi_2}={S}\\sigma\\, ,\\quad \\quad\\quad  \\quad \\frac{\\chi_4}{\\chi_2}={\\kappa}\\sigma^2\n\\label{eq:ratios}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\chi_{2}}{\\chi_{1}}=\\frac{{\\sigma^{2}}}{M}\\,,\\quad\\quad\\quad\\quad\\frac{%&#10;\\chi_{3}}{\\chi_{2}}={S}\\sigma\\,,\\quad\\quad\\quad\\quad\\frac{\\chi_{4}}{\\chi_{2}}=%&#10;{\\kappa}\\sigma^{2}\" display=\"block\"><mrow><mrow><mfrac><msub><mi>χ</mi><mn>2</mn></msub><msub><mi>χ</mi><mn>1</mn></msub></mfrac><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><msup><mi>σ</mi><mn>2</mn></msup><mi>M</mi></mfrac></mpadded></mrow><mo rspace=\"42.5pt\">,</mo><mrow><mrow><mfrac><msub><mi>χ</mi><mn>3</mn></msub><msub><mi>χ</mi><mn>2</mn></msub></mfrac><mo>=</mo><mrow><mi>S</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><mi>σ</mi></mpadded></mrow></mrow><mo rspace=\"42.5pt\">,</mo><mrow><mfrac><msub><mi>χ</mi><mn>4</mn></msub><msub><mi>χ</mi><mn>2</mn></msub></mfrac><mo>=</mo><mrow><mi>κ</mi><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nwhere the $\\xi$ dependence of the couplings from the $3$d Ising universality class has been employed \\cite{Stephanov:2008qz}.\n\nThe growth of the correlation length takes finite time, and close to the critical point not only the fluctuations diverge as a function of the correlation length with some critical exponent, but so do associated relaxation times $\\tau_{\\rm rel}\\propto \\xi^{\\, z}$, where $z$ is a dynamical critical exponent \\cite{Hohenberg:1977ym}. This implies that in a dynamical setup, a system which traverses the critical point in any finite amount of time is necessarily driven out of equilibrium, even if it reached thermal equilibrium in some state away from the critical point. This effect is called critical slowing down and known to weaken the phenomena of criticality. A phenomenological evolution equation of the correlation length has been studied in \\cite{Berdnikov:1999ph} and the maximal size of the correlation length was found to extend to $1.5-2.5$~fm.\n\nLow-energy effective models of QCD, like the quark-meson (QM) or Polyakov quark-meson model (PQM) include some aspects of the QCD phase transition, like the chiral $O(4)$ or the $Z(2)$ symmetry. Compared to lattice calculations they do not capture all the aspects of QCD but can easily be studied at finite $\\mu_B$, give an insight into the active degrees of freedom and real-time calculations can in principle be carried out.  \nTypically, mean-field critical exponents and critical phenomena do not describe the correct physics as mesonic fluctuations and thus important correlations are neglected. Functional renormalization group methods can go beyond the mean-field approximation and provide valuable information about the fluctuations in conserved-charge densities. In \\cite{Skokov:2012ds} it has been shown that $\\chi_4/\\chi_2$ has a prominent $T$-$\\mu_B$-dependence and the signal grows stronger as the critical point is approached.\n\n\\subsection{Fluctuations at a first-order phase transition}\nFluctuations at a first-order phase transition are of a very different nature. They occur only if a nonequilibrium situation is present. At the transition temperature the high and low temperature phase coexist. These two stable phases are separated by a potential barrier, the latent heat. At temperatures above and below $T_c$ metastable states exist as remnants of the phase coexistence, still separated by a barrier. Thus, a system which is in thermal equilibrium above the phase transition and cools to a temperature slightly below the phase transition needs a finite time to relax over this barrier into the new stable phase. If this nucleation rate is small and the expansion (cooling) is fast, parts of the system remain in the metastable phase until it becomes unstable at the lower spinodal. Here, the low-momentum modes are amplified by spinodal decomposition, which leads to domain formation of the two phases \\cite{Csernai:1995zn,Mishustin:1998eq,Scavenius:2000bb,Keranen:2002sw,Randrup:2009gp,Randrup:2010ax,Steinheimer:2012gc,Herold:2013qda}.\n \n \\subsection{Critical fluctuations in heavy-ion collisions}\n In order to obtain predictions for measurable particles, the work in \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw} applied the theory of critical phenomena to heavy-ion collisions by looking at a coupling of the order parameter $\\sigma$ to protons via $g_p \\bar{p}\\sigma p$ and derived expressions for the $n$-th order cumulants of proton multiplicity distributions including the leading-order critical contribution\n \n", "itemtype": "equation", "pos": 9788, "prevtext": "\nare independent of the volume to zero-th order in volume fluctuations.\nThe mean $M$, the variance $\\sigma^2$, the skewness $S$ and the kurtosis $\\kappa$ are obtained from measured event-by-event multiplicity distributions and can via Eqs. (\\ref{eq:ratios}) be compared to thermodynamic calculations.\n\n\\subsection{Fluctuations at a critical point}\nThe expected signal in fluctuation observables depends on the type of phase transition, crossover, critical point or first-order phase transition. In particular, the features of a critical point stand out. Due to the divergence of the correlation length of fluctuations, $\\xi\\to\\infty$, microscopic details of the specific interaction become less and less important the closer a system approaches its critical point. The relevant physics are determined by only a couple of parameters, such as the dimensionality of the system and other scale-invariant quantities. In this sense, large classes of physical phenomena, exhibit the same universal behavior in the scaling regime close to a critical point. QCD with finite quark-masses belongs to the universality class of $3$d Ising models. \nIn static and equilibrated systems, critical phenomena emerge as a result of the diverging correlations, most prominently the divergence of the fluctuations of the critical mode $\\sigma$. It has been shown that the higher-order cumulants are more sensitive to the divergence of the correlation \n  \n", "index": 9, "text": "\\begin{equation}\n   \\langle\\Delta\\sigma^2\\rangle\\propto\\xi^2\\, , \\qquad \\langle\\Delta\\sigma^3\\rangle\\propto\\xi^{9/2}\\, , \\qquad \n   \\langle\\Delta\\sigma^4\\rangle_c\\propto\\xi^7\\, ,\n   \\label{eq:sigmaflucs}\n  \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\langle\\Delta\\sigma^{2}\\rangle\\propto\\xi^{2}\\,,\\qquad\\langle\\Delta\\sigma^{3}%&#10;\\rangle\\propto\\xi^{9/2}\\,,\\qquad\\langle\\Delta\\sigma^{4}\\rangle_{c}\\propto\\xi^{%&#10;7}\\,,\" display=\"block\"><mrow><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>∝</mo><mpadded width=\"+1.7pt\"><msup><mi>ξ</mi><mn>2</mn></msup></mpadded></mrow><mo rspace=\"22.5pt\">,</mo><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>σ</mi><mn>3</mn></msup></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>∝</mo><mpadded width=\"+1.7pt\"><msup><mi>ξ</mi><mrow><mn>9</mn><mo>/</mo><mn>2</mn></mrow></msup></mpadded></mrow><mo rspace=\"22.5pt\">,</mo><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msup><mi>σ</mi><mn>4</mn></msup></mrow><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub><mo>∝</mo><mpadded width=\"+1.7pt\"><msup><mi>ξ</mi><mn>7</mn></msup></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nwhere $\\langle (\\Delta N_p^0)^n\\rangle_c$ is the $n$-order cumulant of the noncritical baseline, e.g. for a Poisson distribution, $n_p^0(k)$ is the Fermi-Dirac thermal distribution of protons and $\\gamma_p(k)=\\sqrt{k^2+m_p^2}$. Estimations based on these formulas have been the main motivation to search for the QCD critical point in heavy-ion collision experiments.\n \n Net-proton fluctuations based on Eq. (\\ref{eq:hrgflucs}) are shown in Fig.  \\ref{fig:netpflucs} (green, solid lines) as a function of the beam energy in comparison with preliminary data from the STAR collaboration \\cite{Luo:2015ewa}. The results depend strongly on the correlation length, for which an assumption according to \\cite{Athanasiou:2010kw} is used with $\\xi_{\\rm max}=2.6$~fm at $\\mu_B=0.15$~GeV and width $0.4$~GeV. Furthermore, the  $3$d Ising model parameters are fixed to $\\tilde\\lambda_3=1.5$ and $\\tilde\\lambda_4=13$, and the coupling is $g_p=9$. Freeze-out conditions are taken from \\cite{Cleymans:2005xv}. The experimental cuts have been included in the thermal integrals.\n Recently, this approach has been extended to correlated particle production over a hypersurface of a fluid dynamical expansion \\cite{Jiang:2015hri,Jiang:2015cnt}. Here, the mentioned parameters have been tuned for each collision energy to rougly reproduce the experimental data for the cumulants separately. The results shown here (red squares)\\footnote{L.~Jiang, P.~Li and H.~Song, private communication} are for parameter set I in \\cite{Jiang:2015hri}. The increasing trend at low energies in $\\kappa\\sigma^2$ can be described with appropriate parameter choices from a particlization over a fluid dynamic hypersurface, but the decreasing trend at the lower energies in $S\\sigma$ seems to be difficult to obtain. \n None of these models include any dynamical evolution of the critical fluctuations.\n \n \\begin{figure}\n  \\includegraphics[width=0.5\\textwidth]{c3c2plot.eps}\n  \\includegraphics[width=0.5\\textwidth]{c4c2plot.eps}\n  \\caption{Net-proton fluctuations as a function of beam energy compared to preliminary data from STAR \\cite{Luo:2015ewa} ($|y|<0.5$, $0.4<p_T<2$~(GeV/c)). The light green curves are based on Eq. (\\ref{eq:hrgflucs}) with fixed parameters and the dashed line includes fluctuations from resonance decays \\cite{workinprogress}. The red squares are obtained from particlization over a fluid dynamical hypersurface with parameters tuned to reproduce the experimental data for the cumulants \\cite{Jiang:2015hri}. In all curves criticality is introduced via the coupling of (anti-)protons to static, equilibrium $\\sigma$ fluctuations \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw}.}\n  \\label{fig:netpflucs}\n \\end{figure}\n\n \\section{Non-critical sources of fluctuations}\n \\label{sec:noncritical}\n Fluctuations reveal more details of the phase transition, but also of everything else that affects the multiplicity distributions. In order to separate the interesting fluctuations from the the non-critical contributions it is therefore indispensable to carefully identify and study further sources of fluctuations: \n \\begin{itemize}\n  \\item[\\textbullet] If the limited detector acceptance is smaller than the critical correlation length of the measured particles, the signal is diminished. Similarly, any detector efficiency which is smaller than $100$\\% due induces additional fluctuations to the finite probability that a certain particle is not detected. This washes out the critical fluctuation signal. Under the assumption that the detection of each particle is independent with constant efficiency, i.e. that the distribution of $n$ detected particles out of $N$ particles reaching the detector in acceptance is binomial, this effect can be corrected according to \\cite{Bzdak:2012ab,Bzdak:2013pha}. If the assumption of a binomial distribution is justified remains to be carefully checked by the experiments.\n  \\item[\\textbullet] Experimentally, it is not feasible to detect the neutrons. Quasielastic scatterings of protons or neutrons with pions via a delta resonance ($p(n)+\\pi\\to\\Delta\\to n(p)+\\pi$) in the hadronic phase wash out the critical fluctuations in net-baryon number. It is similar to limited acceptance or efficiency effects and under the assumption of complete isospin randomization, i.e. that the number of protons among the baryons is given by a binomial distribution, can be corrected \\cite{Kitazawa:2011wh,Kitazawa:2012at,Nahrgang:2014fza}.\n  \\item[\\textbullet] A very similar non-critical source of fluctuations is the decay of resonances in the late hadronic stage \\cite{Nahrgang:2014fza}. In Fig.~2 the impact of the stochastic contribution from resonance decay to the net-proton fluctuations is shown by the green, dashed line. The parameters are the same as described above. It is seen that the critical fluctuations are significantly reduced but survive, in particular in $\\chi_4/\\chi_2$, when resonance decays are included \\cite{workinprogress}.\n  \\item[\\textbullet] Volume fluctuations are inevitable in heavy-ion collision experiments and they are expected to affect all types of collisions, except very central ones \\cite{Skokov:2012ds,Sangaline:2015bma}. Recently, a variety of fluctuation observables, which are not only independent of the volume average but also independent of any volume fluctuations, so called strongly intensive measures have been proposed \\cite{Gorenstein:2011vq,Sangaline:2015bma}. \n  \\item[\\textbullet] Toward lower beam energies more of the initial net-baryon number is transported to midrapidity, which means that the assumption of a  grandcanonical ensemble might not be justified any more and the effects of global net-baryon number conservation start to affect the fluctuation observables. In microscopic transport models the individual scatterings are of microcanonical nature and net-baryon number conservation was found to have a huge impact on the net-baryon number kurtosis with the net-proton kurtosis to slightly follow this trend \\cite{Schuster:2009jv}. These calculations serve as valuable baseline studies. Starting from a binomial distribution the effects of global net-baryon number conservation have been studied in \\cite{Bzdak:2012an} as well.\n  \\item[\\textbullet] Initial fluctuations due to baryon stopping become increasingly important at low beam energies, since most of the measured protons come from the initial baryon current, which is transported to midrapidity during the initial collisions. Several models are able to somewhat different degrees to describe the rapidity distribution of particle production at lower beam energies but the impact of initial baryon-number fluctuations at midrapidity has not yet been studied.\n \\end{itemize}\n A recent MC sampling of critical and some noncritical contributions to the variance of pion fluctuations from a similar coupling as discussed for protons above found a large effect of noncritical fluctuations \\cite{Hippert:2015rwa}. \n\n \n  \\section{Dynamics of critical fluctuations}\n \\label{sec:dynamics}\n The estimations obtained in \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw} and its recent refinements in \\cite{Jiang:2015hri} and \\cite{workinprogress} as shown in Fig. \\ref{fig:netpflucs} are based on static, equilibrium expectations for $\\langle(\\Delta\\sigma)^n\\rangle_c$ albeit with a phenomenological input for a finite correlation length. In order to go beyond and achieve a quantitative statement about the connection between the thermodynamics of the QCD critical point and experimental observables the dynamics of fluctuations needs to be included in realistic modeling of heavy-ion collisions. \n  \n In \\cite{Mukherjee:2015swa} it is shown that the magnitude and sign of the critical contributions to the fluctuation signals can be different in non-equilibrium situations compared to equilibrium expectations due to the importance of memory effects. In this work, the real-time evolution of non-Gaussian cumulants is studied in the scaling regime, where \n$L_{\\rm micro}\\ll\\xi\\ll L_{\\rm sys}$ via an expansion of the Fokker-Planck dynamics of the order parameter. In general different combinations of trajectories, chemical freeze-out conditions and relaxation times $\\tau_{\\rm rel}$ can give similar results for the $\\sqrt{s}$-dependence of the higher-order cumulants.\n \n In order to investigate the dynamics of critical fluctuations within a realistic space-time evolution of heavy-ion collisions, the model of nonequilibrium chiral fluid dynamics (N$\\chi$FD) has been developed continuously over the recent years \\cite{Nahrgang:2011mg,Nahrgang:2011mv,Nahrgang:2011vn,Herold:2013bi,Herold:2013qda,Herold:2014zoa,Herold:2016uvv}. It explicitly propagates the order parameter fields coupled to a fluid dynamical evolution of the QGP. The order parameter of chiral symmetry, the $\\sigma$ field evolves via a stochastic relaxation equation\n \n", "itemtype": "equation", "pos": 13562, "prevtext": "\nwhere the $\\xi$ dependence of the couplings from the $3$d Ising universality class has been employed \\cite{Stephanov:2008qz}.\n\nThe growth of the correlation length takes finite time, and close to the critical point not only the fluctuations diverge as a function of the correlation length with some critical exponent, but so do associated relaxation times $\\tau_{\\rm rel}\\propto \\xi^{\\, z}$, where $z$ is a dynamical critical exponent \\cite{Hohenberg:1977ym}. This implies that in a dynamical setup, a system which traverses the critical point in any finite amount of time is necessarily driven out of equilibrium, even if it reached thermal equilibrium in some state away from the critical point. This effect is called critical slowing down and known to weaken the phenomena of criticality. A phenomenological evolution equation of the correlation length has been studied in \\cite{Berdnikov:1999ph} and the maximal size of the correlation length was found to extend to $1.5-2.5$~fm.\n\nLow-energy effective models of QCD, like the quark-meson (QM) or Polyakov quark-meson model (PQM) include some aspects of the QCD phase transition, like the chiral $O(4)$ or the $Z(2)$ symmetry. Compared to lattice calculations they do not capture all the aspects of QCD but can easily be studied at finite $\\mu_B$, give an insight into the active degrees of freedom and real-time calculations can in principle be carried out.  \nTypically, mean-field critical exponents and critical phenomena do not describe the correct physics as mesonic fluctuations and thus important correlations are neglected. Functional renormalization group methods can go beyond the mean-field approximation and provide valuable information about the fluctuations in conserved-charge densities. In \\cite{Skokov:2012ds} it has been shown that $\\chi_4/\\chi_2$ has a prominent $T$-$\\mu_B$-dependence and the signal grows stronger as the critical point is approached.\n\n\\subsection{Fluctuations at a first-order phase transition}\nFluctuations at a first-order phase transition are of a very different nature. They occur only if a nonequilibrium situation is present. At the transition temperature the high and low temperature phase coexist. These two stable phases are separated by a potential barrier, the latent heat. At temperatures above and below $T_c$ metastable states exist as remnants of the phase coexistence, still separated by a barrier. Thus, a system which is in thermal equilibrium above the phase transition and cools to a temperature slightly below the phase transition needs a finite time to relax over this barrier into the new stable phase. If this nucleation rate is small and the expansion (cooling) is fast, parts of the system remain in the metastable phase until it becomes unstable at the lower spinodal. Here, the low-momentum modes are amplified by spinodal decomposition, which leads to domain formation of the two phases \\cite{Csernai:1995zn,Mishustin:1998eq,Scavenius:2000bb,Keranen:2002sw,Randrup:2009gp,Randrup:2010ax,Steinheimer:2012gc,Herold:2013qda}.\n \n \\subsection{Critical fluctuations in heavy-ion collisions}\n In order to obtain predictions for measurable particles, the work in \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw} applied the theory of critical phenomena to heavy-ion collisions by looking at a coupling of the order parameter $\\sigma$ to protons via $g_p \\bar{p}\\sigma p$ and derived expressions for the $n$-th order cumulants of proton multiplicity distributions including the leading-order critical contribution\n \n", "index": 11, "text": "\\begin{equation}\n  \\langle\\Delta N_p^n\\rangle =  \\langle (\\Delta N_p^0)^n\\rangle_c  + \\,\\langle (V\\Delta\\sigma)^n\\rangle_c \\left(\\frac{-g_{p}d_p}{T}\\int_k \\frac{n_p^0(k)(1-n_p^0(k))}{\\gamma_p(k)}\\right)^n\\, ,\n  \\label{eq:hrgflucs}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\langle\\Delta N_{p}^{n}\\rangle=\\langle(\\Delta N_{p}^{0})^{n}\\rangle_{c}+\\,%&#10;\\langle(V\\Delta\\sigma)^{n}\\rangle_{c}\\left(\\frac{-g_{p}d_{p}}{T}\\int_{k}\\frac{%&#10;n_{p}^{0}(k)(1-n_{p}^{0}(k))}{\\gamma_{p}(k)}\\right)^{n}\\,,\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>N</mi><mi>p</mi><mi>n</mi></msubsup></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>N</mi><mi>p</mi><mn>0</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mi>n</mi></msup><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub><mo rspace=\"4.2pt\">+</mo><mrow><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>V</mi><mo>⁢</mo><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>σ</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>n</mi></msup><mo stretchy=\"false\">⟩</mo></mrow><mi>c</mi></msub><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mrow><mfrac><mrow><mo>-</mo><mrow><msub><mi>g</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>d</mi><mi>p</mi></msub></mrow></mrow><mi>T</mi></mfrac><mo>⁢</mo><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∫</mo><mi>k</mi></msub><mfrac><mrow><msubsup><mi>n</mi><mi>p</mi><mn>0</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>-</mo><mrow><msubsup><mi>n</mi><mi>p</mi><mn>0</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>γ</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow></mrow><mo>)</mo></mrow><mi>n</mi></msup></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\n where the chiral potential $U$, the scalar density $\\rho_s$ and the damping coefficient $\\eta$ are obtained from a chiral effective model like the (P)QM model. Following the fluctuation-dissipation theorem the magnitude of the noise field $\\xi$ is determined by the damping coefficient and taken in the Gaussian approximation. Due to the presence of $\\xi$ the evolution of the $\\sigma$ field becomes stochastic. The fermionic part of the Lagrangian is treated fluid dynamically and serves as heat bath for the nonequilibrium dynamics of the order parameter. The fluid dynamical evolution and the $\\sigma$ field evolution can be consistently derived within the 2PI effective action approach. The two sectors are coupled via a stochastic source term in the fluid dynamical equations\n  \n", "itemtype": "equation", "pos": 22727, "prevtext": "\nwhere $\\langle (\\Delta N_p^0)^n\\rangle_c$ is the $n$-order cumulant of the noncritical baseline, e.g. for a Poisson distribution, $n_p^0(k)$ is the Fermi-Dirac thermal distribution of protons and $\\gamma_p(k)=\\sqrt{k^2+m_p^2}$. Estimations based on these formulas have been the main motivation to search for the QCD critical point in heavy-ion collision experiments.\n \n Net-proton fluctuations based on Eq. (\\ref{eq:hrgflucs}) are shown in Fig.  \\ref{fig:netpflucs} (green, solid lines) as a function of the beam energy in comparison with preliminary data from the STAR collaboration \\cite{Luo:2015ewa}. The results depend strongly on the correlation length, for which an assumption according to \\cite{Athanasiou:2010kw} is used with $\\xi_{\\rm max}=2.6$~fm at $\\mu_B=0.15$~GeV and width $0.4$~GeV. Furthermore, the  $3$d Ising model parameters are fixed to $\\tilde\\lambda_3=1.5$ and $\\tilde\\lambda_4=13$, and the coupling is $g_p=9$. Freeze-out conditions are taken from \\cite{Cleymans:2005xv}. The experimental cuts have been included in the thermal integrals.\n Recently, this approach has been extended to correlated particle production over a hypersurface of a fluid dynamical expansion \\cite{Jiang:2015hri,Jiang:2015cnt}. Here, the mentioned parameters have been tuned for each collision energy to rougly reproduce the experimental data for the cumulants separately. The results shown here (red squares)\\footnote{L.~Jiang, P.~Li and H.~Song, private communication} are for parameter set I in \\cite{Jiang:2015hri}. The increasing trend at low energies in $\\kappa\\sigma^2$ can be described with appropriate parameter choices from a particlization over a fluid dynamic hypersurface, but the decreasing trend at the lower energies in $S\\sigma$ seems to be difficult to obtain. \n None of these models include any dynamical evolution of the critical fluctuations.\n \n \\begin{figure}\n  \\includegraphics[width=0.5\\textwidth]{c3c2plot.eps}\n  \\includegraphics[width=0.5\\textwidth]{c4c2plot.eps}\n  \\caption{Net-proton fluctuations as a function of beam energy compared to preliminary data from STAR \\cite{Luo:2015ewa} ($|y|<0.5$, $0.4<p_T<2$~(GeV/c)). The light green curves are based on Eq. (\\ref{eq:hrgflucs}) with fixed parameters and the dashed line includes fluctuations from resonance decays \\cite{workinprogress}. The red squares are obtained from particlization over a fluid dynamical hypersurface with parameters tuned to reproduce the experimental data for the cumulants \\cite{Jiang:2015hri}. In all curves criticality is introduced via the coupling of (anti-)protons to static, equilibrium $\\sigma$ fluctuations \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw}.}\n  \\label{fig:netpflucs}\n \\end{figure}\n\n \\section{Non-critical sources of fluctuations}\n \\label{sec:noncritical}\n Fluctuations reveal more details of the phase transition, but also of everything else that affects the multiplicity distributions. In order to separate the interesting fluctuations from the the non-critical contributions it is therefore indispensable to carefully identify and study further sources of fluctuations: \n \\begin{itemize}\n  \\item[\\textbullet] If the limited detector acceptance is smaller than the critical correlation length of the measured particles, the signal is diminished. Similarly, any detector efficiency which is smaller than $100$\\% due induces additional fluctuations to the finite probability that a certain particle is not detected. This washes out the critical fluctuation signal. Under the assumption that the detection of each particle is independent with constant efficiency, i.e. that the distribution of $n$ detected particles out of $N$ particles reaching the detector in acceptance is binomial, this effect can be corrected according to \\cite{Bzdak:2012ab,Bzdak:2013pha}. If the assumption of a binomial distribution is justified remains to be carefully checked by the experiments.\n  \\item[\\textbullet] Experimentally, it is not feasible to detect the neutrons. Quasielastic scatterings of protons or neutrons with pions via a delta resonance ($p(n)+\\pi\\to\\Delta\\to n(p)+\\pi$) in the hadronic phase wash out the critical fluctuations in net-baryon number. It is similar to limited acceptance or efficiency effects and under the assumption of complete isospin randomization, i.e. that the number of protons among the baryons is given by a binomial distribution, can be corrected \\cite{Kitazawa:2011wh,Kitazawa:2012at,Nahrgang:2014fza}.\n  \\item[\\textbullet] A very similar non-critical source of fluctuations is the decay of resonances in the late hadronic stage \\cite{Nahrgang:2014fza}. In Fig.~2 the impact of the stochastic contribution from resonance decay to the net-proton fluctuations is shown by the green, dashed line. The parameters are the same as described above. It is seen that the critical fluctuations are significantly reduced but survive, in particular in $\\chi_4/\\chi_2$, when resonance decays are included \\cite{workinprogress}.\n  \\item[\\textbullet] Volume fluctuations are inevitable in heavy-ion collision experiments and they are expected to affect all types of collisions, except very central ones \\cite{Skokov:2012ds,Sangaline:2015bma}. Recently, a variety of fluctuation observables, which are not only independent of the volume average but also independent of any volume fluctuations, so called strongly intensive measures have been proposed \\cite{Gorenstein:2011vq,Sangaline:2015bma}. \n  \\item[\\textbullet] Toward lower beam energies more of the initial net-baryon number is transported to midrapidity, which means that the assumption of a  grandcanonical ensemble might not be justified any more and the effects of global net-baryon number conservation start to affect the fluctuation observables. In microscopic transport models the individual scatterings are of microcanonical nature and net-baryon number conservation was found to have a huge impact on the net-baryon number kurtosis with the net-proton kurtosis to slightly follow this trend \\cite{Schuster:2009jv}. These calculations serve as valuable baseline studies. Starting from a binomial distribution the effects of global net-baryon number conservation have been studied in \\cite{Bzdak:2012an} as well.\n  \\item[\\textbullet] Initial fluctuations due to baryon stopping become increasingly important at low beam energies, since most of the measured protons come from the initial baryon current, which is transported to midrapidity during the initial collisions. Several models are able to somewhat different degrees to describe the rapidity distribution of particle production at lower beam energies but the impact of initial baryon-number fluctuations at midrapidity has not yet been studied.\n \\end{itemize}\n A recent MC sampling of critical and some noncritical contributions to the variance of pion fluctuations from a similar coupling as discussed for protons above found a large effect of noncritical fluctuations \\cite{Hippert:2015rwa}. \n\n \n  \\section{Dynamics of critical fluctuations}\n \\label{sec:dynamics}\n The estimations obtained in \\cite{Stephanov:1998dy,Stephanov:1999zu,Stephanov:2008qz,Athanasiou:2010kw} and its recent refinements in \\cite{Jiang:2015hri} and \\cite{workinprogress} as shown in Fig. \\ref{fig:netpflucs} are based on static, equilibrium expectations for $\\langle(\\Delta\\sigma)^n\\rangle_c$ albeit with a phenomenological input for a finite correlation length. In order to go beyond and achieve a quantitative statement about the connection between the thermodynamics of the QCD critical point and experimental observables the dynamics of fluctuations needs to be included in realistic modeling of heavy-ion collisions. \n  \n In \\cite{Mukherjee:2015swa} it is shown that the magnitude and sign of the critical contributions to the fluctuation signals can be different in non-equilibrium situations compared to equilibrium expectations due to the importance of memory effects. In this work, the real-time evolution of non-Gaussian cumulants is studied in the scaling regime, where \n$L_{\\rm micro}\\ll\\xi\\ll L_{\\rm sys}$ via an expansion of the Fokker-Planck dynamics of the order parameter. In general different combinations of trajectories, chemical freeze-out conditions and relaxation times $\\tau_{\\rm rel}$ can give similar results for the $\\sqrt{s}$-dependence of the higher-order cumulants.\n \n In order to investigate the dynamics of critical fluctuations within a realistic space-time evolution of heavy-ion collisions, the model of nonequilibrium chiral fluid dynamics (N$\\chi$FD) has been developed continuously over the recent years \\cite{Nahrgang:2011mg,Nahrgang:2011mv,Nahrgang:2011vn,Herold:2013bi,Herold:2013qda,Herold:2014zoa,Herold:2016uvv}. It explicitly propagates the order parameter fields coupled to a fluid dynamical evolution of the QGP. The order parameter of chiral symmetry, the $\\sigma$ field evolves via a stochastic relaxation equation\n \n", "index": 13, "text": "\\begin{equation}\n  \\partial_\\mu\\partial^\\mu\\sigma+\\frac{\\delta U}{\\delta\\sigma}+g\\rho_s+\\eta\\partial_t\\sigma=\\xi\\, ,\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\partial_{\\mu}\\partial^{\\mu}\\sigma+\\frac{\\delta U}{\\delta\\sigma}+g\\rho_{s}+%&#10;\\eta\\partial_{t}\\sigma=\\xi\\,,\" display=\"block\"><mrow><mrow><mrow><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msup><mo>∂</mo><mi>μ</mi></msup></mrow><mo>⁡</mo><mi>σ</mi></mrow><mo>+</mo><mfrac><mrow><mi>δ</mi><mo>⁢</mo><mi>U</mi></mrow><mrow><mi>δ</mi><mo>⁢</mo><mi>σ</mi></mrow></mfrac><mo>+</mo><mrow><mi>g</mi><mo>⁢</mo><msub><mi>ρ</mi><mi>s</mi></msub></mrow><mo>+</mo><mrow><mi>η</mi><mo>⁢</mo><mrow><msub><mo>∂</mo><mi>t</mi></msub><mo>⁡</mo><mi>σ</mi></mrow></mrow></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mi>ξ</mi></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\n Consequently, the fluid dynamical fields itself become stochastic quantities.\n This approach produces effects of supercooling, reheating and domain formation at the first-order phase transition, as well as critical slowing down at the critical point. Recently, a particlization has been added and the dynamics along a trajectory on the crossover side of the critical point shows that critical contributions to the net-proton kurtosis are present in dynamical systems \\cite{Herold:2016uvv}. Further and more quantitative work is underway.\n \n \\section{Fluid dynamical fluctuations}\n \\label{sec:FDF}\n In N$\\chi$FD the fluctuations in the fluid dynamical fields were induced by the stochastic evolution in the $\\sigma$ field. At finite baryochemical potential, however, the $\\sigma$ field mixes with the net-baryon density, which in the long-time limit becomes the true critical mode due to the diffusive dynamics \\cite{Son:2004iv}. The inclusion of fluctuations into the  fluid dynamical evolution equation is therefore a promising route to the dynamical treatment of critical fluctuations. While conventional fluid dynamics propagates only thermal averages of the fluid dynamical fields, we know that already in equilibrium there are thermal fluctuations and that the fast processes, which lead to local equilibration also lead to noise. For a consistent treatment of viscosities, of the baryon conductivity and the dissipation-fluctuation theorem the equations for fluctuating viscous fluid dynamics read \\cite{Kapusta:2011gt,Murase:2013tma}\n\n", "itemtype": "equation", "pos": 23644, "prevtext": "\n where the chiral potential $U$, the scalar density $\\rho_s$ and the damping coefficient $\\eta$ are obtained from a chiral effective model like the (P)QM model. Following the fluctuation-dissipation theorem the magnitude of the noise field $\\xi$ is determined by the damping coefficient and taken in the Gaussian approximation. Due to the presence of $\\xi$ the evolution of the $\\sigma$ field becomes stochastic. The fermionic part of the Lagrangian is treated fluid dynamically and serves as heat bath for the nonequilibrium dynamics of the order parameter. The fluid dynamical evolution and the $\\sigma$ field evolution can be consistently derived within the 2PI effective action approach. The two sectors are coupled via a stochastic source term in the fluid dynamical equations\n  \n", "index": 15, "text": "\\begin{equation}\n    \\partial_\\mu T^{\\mu\\nu}_{\\rm q}={ S^\\nu=-\\partial_\\mu T^{\\mu\\nu}_\\sigma}\\, ,\\quad  \\partial_\\mu N^{\\mu}_{\\rm q}= 0\\, .\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\partial_{\\mu}T^{\\mu\\nu}_{\\rm q}={S^{\\nu}=-\\partial_{\\mu}T^{\\mu\\nu}_{\\sigma}}%&#10;\\,,\\quad\\partial_{\\mu}N^{\\mu}_{\\rm q}=0\\,.\" display=\"block\"><mrow><mrow><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>T</mi><mi mathvariant=\"normal\">q</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msubsup></mrow><mo>=</mo><msup><mi>S</mi><mi>ν</mi></msup><mo>=</mo><mrow><mo>-</mo><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><mpadded width=\"+1.7pt\"><msubsup><mi>T</mi><mi>σ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msubsup></mpadded></mrow></mrow></mrow><mo rspace=\"12.5pt\">,</mo><mrow><mrow><msub><mo>∂</mo><mi>μ</mi></msub><mo>⁡</mo><msubsup><mi>N</mi><mi mathvariant=\"normal\">q</mi><mi>μ</mi></msubsup></mrow><mo>=</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nwith the autocorrelation of the noise term\n\n", "itemtype": "equation", "pos": 25342, "prevtext": "\n Consequently, the fluid dynamical fields itself become stochastic quantities.\n This approach produces effects of supercooling, reheating and domain formation at the first-order phase transition, as well as critical slowing down at the critical point. Recently, a particlization has been added and the dynamics along a trajectory on the crossover side of the critical point shows that critical contributions to the net-proton kurtosis are present in dynamical systems \\cite{Herold:2016uvv}. Further and more quantitative work is underway.\n \n \\section{Fluid dynamical fluctuations}\n \\label{sec:FDF}\n In N$\\chi$FD the fluctuations in the fluid dynamical fields were induced by the stochastic evolution in the $\\sigma$ field. At finite baryochemical potential, however, the $\\sigma$ field mixes with the net-baryon density, which in the long-time limit becomes the true critical mode due to the diffusive dynamics \\cite{Son:2004iv}. The inclusion of fluctuations into the  fluid dynamical evolution equation is therefore a promising route to the dynamical treatment of critical fluctuations. While conventional fluid dynamics propagates only thermal averages of the fluid dynamical fields, we know that already in equilibrium there are thermal fluctuations and that the fast processes, which lead to local equilibration also lead to noise. For a consistent treatment of viscosities, of the baryon conductivity and the dissipation-fluctuation theorem the equations for fluctuating viscous fluid dynamics read \\cite{Kapusta:2011gt,Murase:2013tma}\n\n", "index": 17, "text": "\\begin{align}\n T^{\\mu\\nu}&=T^{\\mu\\nu}_{\\rm eq}+\\Delta T^{\\mu\\nu}_{\\rm visc}+\\Xi^{\\mu\\nu} \\, ,\\\\\n N^{\\mu}&=N^{\\mu}_{\\rm eq}+\\Delta N^{\\mu}_{\\rm visc}+{\\rm I}^{\\mu}\\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle T^{\\mu\\nu}\" display=\"inline\"><msup><mi>T</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=T^{\\mu\\nu}_{\\rm eq}+\\Delta T^{\\mu\\nu}_{\\rm visc}+\\Xi^{\\mu\\nu}\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><msubsup><mi>T</mi><mi>eq</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msubsup><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>T</mi><mi>visc</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msubsup></mrow><mo>+</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">Ξ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup></mpadded></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle N^{\\mu}\" display=\"inline\"><msup><mi>N</mi><mi>μ</mi></msup></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=N^{\\mu}_{\\rm eq}+\\Delta N^{\\mu}_{\\rm visc}+{\\rm I}^{\\mu}\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><msubsup><mi>N</mi><mi>eq</mi><mi>μ</mi></msubsup><mo>+</mo><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msubsup><mi>N</mi><mi>visc</mi><mi>μ</mi></msubsup></mrow><mo>+</mo><mpadded width=\"+1.7pt\"><msup><mi mathvariant=\"normal\">I</mi><mi>μ</mi></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07437.tex", "nexttext": "\nAssuming enhanced conductivities at the critical point, the nonlinear fluid dynamical equations produce enhanced correlator of fluid dynamical densities in a  simple Bjorken expansion \\cite{Kapusta:2012zb}. First numerical implementations \\cite{Young:2014pka}, suggest an enhancement of flow due to the additional fluctuations, crucial questions of the renormalization of viscosities and the equation of state due to nonlinear effects \\cite{Chafin:2012eq,Kovtun:2011np} and the reproduction of equilibrium expectations remain and are currently under investigation.\n \n \\section{Toward the discovery of the critical point}\n \\label{sec:discovery}\n Through a realistic dynamical modeling of heavy-ion collisions the QCD critical point and experimental data can be connected and understood. \n The uncertainties of dynamical models can be reduced by relying on input from first-priniciple calculations whenever possible. Remaining unknown quantities can be tuned by comparing to experimental observables, which are not signals for the critical point. For noncritical bulk observables this procedure is well established in current fluid dynamical calculations for example. In order to search for the QCD critical point, it becomes necessary to include the dynamics of critical fluctuations and to develop appropriate interfaces of these fluctuations with the initial fluctuations and correlations and for particlization.\n  Such a framework is also capable to treat noncritical effects quantitatively. \n  This paper outlined a couple of recent approaches to address the dynamics of critical fluctuations and gave an outlook of important current and future developments, in particular, in form of fluid dynamical fluctuations and their integration into realistic descriptions of the space-time evolution of the quark-gluon plasma and the hadronic stage. With these tools the discovery of the QCD critical point and the investigation of its properties at current and future heavy-ion collision experiments will become possible.\n\n\\section*{Acknowledgments}\nM.N. acknowledges support from a fellowship within the Postdoc-Program of the German Academic Exchange Service (DAAD). This work was supported by the U.S. department of energy under grant DE-FG02-05ER41367. \n\n\n\n\n\n\n\n\n\n\n\n\\bibliography{biblio_nahrgang}\n\\bibliographystyle{elsarticle-num}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 25564, "prevtext": "\nwith the autocorrelation of the noise term\n\n", "index": 19, "text": "\\begin{align}\n\\langle \\Xi^{\\mu\\nu}(x)\\Xi^{\\alpha\\beta}(x')\\rangle & =  2T[\\eta(\\Delta^{\\mu\\alpha}\\Delta^{\\nu\\beta}+\\Delta^{\\mu\\beta}\\Delta^{\\nu\\alpha})+(\\zeta-2/3\\eta)\\Delta^{\\mu\\nu}\\Delta^{\\alpha\\beta}]\\delta^4(x-x')\\, ,\\\\\n\\langle {\\rm I}^{\\mu}(x){\\rm I}^{\\nu}(x')\\rangle & = 2T\\kappa\\Delta^{\\mu\\nu}\\delta^4(x-x')\\, .\n\\end{align}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\langle\\Xi^{\\mu\\nu}(x)\\Xi^{\\alpha\\beta}(x^{\\prime})\\rangle\" display=\"inline\"><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi mathvariant=\"normal\">Ξ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ξ</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=2T[\\eta(\\Delta^{\\mu\\alpha}\\Delta^{\\nu\\beta}+\\Delta^{\\mu\\beta}%&#10;\\Delta^{\\nu\\alpha})+(\\zeta-2/3\\eta)\\Delta^{\\mu\\nu}\\Delta^{\\alpha\\beta}]\\delta^%&#10;{4}(x-x^{\\prime})\\,,\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>α</mi></mrow></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>ν</mi><mo>⁢</mo><mi>β</mi></mrow></msup></mrow><mo>+</mo><mrow><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>β</mi></mrow></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>ν</mi><mo>⁢</mo><mi>α</mi></mrow></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>ζ</mi><mo>-</mo><mrow><mrow><mn>2</mn><mo>/</mo><mn>3</mn></mrow><mo>⁢</mo><mi>η</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>α</mi><mo>⁢</mo><mi>β</mi></mrow></msup></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msup><mi>δ</mi><mn>4</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><msup><mi>x</mi><mo>′</mo></msup></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle\\langle{\\rm I}^{\\mu}(x){\\rm I}^{\\nu}(x^{\\prime})\\rangle\" display=\"inline\"><mrow><mo stretchy=\"false\">⟨</mo><mrow><msup><mi mathvariant=\"normal\">I</mi><mi>μ</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">I</mi><mi>ν</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>x</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">⟩</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m2\" class=\"ltx_Math\" alttext=\"\\displaystyle=2T\\kappa\\Delta^{\\mu\\nu}\\delta^{4}(x-x^{\\prime})\\,.\" display=\"inline\"><mrow><mrow><mi/><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mi>κ</mi><mo>⁢</mo><msup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>μ</mi><mo>⁢</mo><mi>ν</mi></mrow></msup><mo>⁢</mo><msup><mi>δ</mi><mn>4</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><msup><mi>x</mi><mo>′</mo></msup></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]