[{"file": "1601.00686.tex", "nexttext": "\nwhere $S(t_R)$ is the instantaneous radioactive power at the bolometric luminosity maximum. $\\alpha$ is an efficiency factor of order unity, depending on\nthe distribution of $^{56}$Ni \\citep{jbb06}. We adopt a fiducial value of $\\alpha=1.3$ following \\citet{saa+12}. The radioactive\npower of $^{56}\\rm{Ni}\\rightarrow^{56}\\rm{Co}\\rightarrow^{56}\\rm{Fe}$ is \\citep{n94}\n\n", "itemtype": "equation", "pos": 32155, "prevtext": "\n\n\\title{An Intermediate Type Ia Supernova Between Normal And Super-Chandrasekhar}\n\n\\author{Yi~Cao\\altaffilmark{1}, J.~Johansson\\altaffilmark{2}, Peter~E.~Nugent\\altaffilmark{3,4}, \n\tA.~Goobar\\altaffilmark{5}, Jakob~Nordin\\altaffilmark{6}, S.~R.~Kulkarni\\altaffilmark{1}, \n\tS.~Bradley~Cenko\\altaffilmark{7,8}, Ori~Fox\\altaffilmark{9}, Mansi~M.~Kasliwal\\altaffilmark{1,10}, \n\tC.~Fremling\\altaffilmark{11}, R.~Amanullah\\altaffilmark{5}, E.~Y.~Hsiao\\altaffilmark{12,13}, D.~A.~Perley\\altaffilmark{1}, \n\tBrian~D.~Bue\\altaffilmark{14}, Frank J. Masci\\altaffilmark{15},\n\tWilliam H. Lee\\altaffilmark{16}, Nicolas~Chotard\\altaffilmark{17}}\n\\altaffiltext{1}{Astronomy Department, California Institute of Technology, Pasadena, CA 91125, USA}\n\\altaffiltext{2}{Benoziyo Center for Astrophysics, Weizmann Institute of Science, 76100 Rehovot, Israel}\n\\altaffiltext{3}{Computational Cosmology Center, Computational Research Division, Lawrence Berkeley National Laboratory,\n1 Cyclotron Road, MS 50B-4206, Berkeley, CA 94720, USA}\n\\altaffiltext{4}{Department of Astronomy, University of California Berkeley, Berkeley, CA 94720-3411, USA}\n\\altaffiltext{5}{Oskar Klein Centre, Physics Department, Stockholm University, SE-106 91 Stockholm, Sweden}\n\\altaffiltext{6}{Institut f\\\"{u}r Physik, Humboldt-Universit\\\"{a}t zu Berlin, Newtonstr. 15, 12489 Berlin, Germany}\n\\altaffiltext{7}{Astrophysics Science Division, NASA Goddard Space Flight Center, Mail Code 661, Greenbelt, Maryland 20771, USA}\n\\altaffiltext{8}{Joint Space-Science Institute, University of Maryland, College Park, MD 20742, USA}\n\\altaffiltext{9}{Space Telescope Science Institute, 3700 San Martin Drive, Baltimore, MD 21218, USA}\n\\altaffiltext{10}{Observatories of the Carnegie Institution for Science, 813 Santa Barbara Street, Pasadena, California 91101, USA}\n\\altaffiltext{11}{Department of Astronomy, The Oskar Klein Center, Stockholm University, AlbaNova, 10691 Stockholm, Sweden}\n\\altaffiltext{12}{Department of Physics, Florida State University, Tallahassee, FL 32306, USA}\n\\altaffiltext{13}{Department of Physics and Astronomy, Aarhus University, Ny Munkegade 120, 8000 Aarhus C, Denmark}\n\\altaffiltext{14}{Jet Propulsion Laboratory, California Institute of Technology, Pasadena, CA 91125, USA}\n\\altaffiltext{15}{Infrared Processing and Analysis Center, California Institute of Technology, MS 100-22, Pasadena, CA 91125, USA}\n\\altaffiltext{16}{Instituto de Astronom\\'{\\i}a, Universidad Nacional Aut\\'{o}noma de M\\'{e}xico, Apdo. Postal 70-264 Cd. Universitaria, \nM\\'{e}xico DF 04510, M\\'{e}xico}\n\\altaffiltext{17}{Universit\\'e de Lyon, F-69622, France ; Universit\\'e de Lyon 1, Villeurbanne ; CNRS/IN2P3, Institut de Physique Nucl\\'eaire de Lyon}\n\n\\begin{abstract}\nWhile recent observations provide evidence that super-Chandrasekhar Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernovae and at least a fraction of normal \nType {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernovae probably originate from double-degenerate systems, these two subclasses show distinct characteristics \nobservationally. Here we report an intermediate supernova iPTF13asv that may bridge this gap. On the one hand, similar to normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a\nsupernovae, the over-luminous iPTF13asv follows the empirical relation between the peak magnitude, the lightcurve shape and its intrinsic color, and shows\na near-IR secondary maximum like normal supernovae. On the other hand, similar to super-Chandrasekhar events, it has strong UV emission\naround maximum, low expansion velocities and persistent carbon absorption. We estimate a $^{56}$Ni mass of $0.81^{+0.10}_{-0.18}{M_\\odot}$ \nand a total ejecta mass of $1.44^{+0.44}_{-0.12}{M_\\odot}$. Despite these similarities, iPTF13asv lacks iron absorption in its early-phase spectra, \nindicating a stratified ejecta structure with weak mixing. Based on the strong stratification of the ejecta and the similarity to super-Chandrasekhar \nevents, we infer that iPTF13asv probably originates from a double-degenerate system. \n\\end{abstract}\n\n\\keywords{supernovae: general -- supernovae: individual (iPTF13asv) -- ultraviolet: general}\n\\maketitle\n\n\\section{Introduction}\n\\label{sec:introduction}\nType {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernovae (SNe) are thermonuclear explosions of carbon oxygen white dwarfs (WDs). Since the majority of them (normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe) \nfollow a well-established empirical relation between variation of their peak magnitudes and lightcurve shapes \\citep{Phillips1993}, they are standardized\nto measure cosmological distances (see \\citealt{GL2011} for a review). However, the underlying progenitor systems and explosion mechanisms of\nType {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe remain poorly understood. \n\nRecent observations have provided mounting evidence that Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe have multiple progenitor channels (see \\citealt{mmn14}\nfor a review). In the single-degenerate (SD) channel, a WD accretes material from a companion star and explodes when its mass approaches\nthe Chandrasekhar limit \\citep{wi73}. This channel is supported by possible detections of companion stars in pre- or post-SN images\n\\citep{mjf+14,fmj+14}, likely signatures of supernova-companion collisions \\citep{ckh+15,mbv+15}, and observations of variable \n\\ion{Na}{1}\\,D absorption \\citep{pcc+07,sgs+14}. In the double-degenerate (DD) channel, in contrast, two WDs collide or merge in \na binary or even triple system to produce a Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN \\citep[e.g.,][]{ni85,kkd+13}. This channel is consistent with observations of \ntwo nearby Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN2011fe and SN2014J \\citep[e.g.,][]{lbp+11,BDd2012,ssp+13,mpk+14,kff+14,gks+15,lnt+15}. \n\nUnlike the SD channel, SNe from the DD channel may have ejecta mass beyond the Chandrasekhar limit (super-Chandrasekhar Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe).\nIn fact, more than a handful of SNe were found to have total ejecta masses significantly exceeding the Chandrasekhar limit\n\\citep{hsn+06,hgp+07,yqw+10,ykk+09,saa+10,sgl+11,sct+14}. However, these super-Chandrasekhar SNe show distinctive characteristics compared to normal\nevents: they are over-luminous in both the optical and UV, implying a large amount of synthesized $^{56}$Ni. They show low expansion velocities and long\nrise times, leading to massive ejecta. They also show persistent absorption from unburned carbon. If they originate from the same DD systems as some \nnormal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe, then an intermediate case is needed to bridge the super-Chandrasekhar and normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. \n\nIn this paper, we present observations of a peculiar Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN, iPTF13asv, that shares observational characteristics with both super-Chandrasekhar and normal\nType {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN. It was discovered with $r=20.54\\pm0.16$\\,mag at $\\alpha=16^h22^m43^s.19$, \n$\\delta=+18^\\circ57^\\prime35{\\hbox{$\\ \\!\\!^{\\prime\\prime}$}}.0$ (J2000) in the vicinity of galaxy SDSS\\,J$162243.02{+}185733.8$ on UTC 2013 May $1.44$ (hereafter May \n$1.44$) by the intermediate Palomar Transient Factory (iPTF; \\citealt{LKD2009,RKL2009}). Nothing was\nseen at the same location down to 5-$\\sigma$ detection thresholds of $r\\simeq 21.0$\\,mag on images taken on April 30.5 and earlier. iPTF13asv was\nindependently discovered and classified as a peculiar Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a by \\citet{CBET3543}, and was designated as SN2013cv. \n\nThis paper is organized as follows: the observational data is present in \\S\\ref{sec:obs}. The photometric and spectroscopic \nproperties are analyzed in \\S\\ref{sec:analysis}, and we construct its bolometric lightcurve and estimate the total ejecta mass in \\S\\ref{sec:mass}. \nA discussions about the nature of iPTF13asv is given in \\S\\ref{sec:discussion} and our conclusions are summarized in \\S\\ref{sec:conclusion}. \n\nThroughout this paper, we adopt a Hubble Constant $H_0=67.77\\,{\\rm km}\\,{\\rm s}^{-1}\\,{\\rm Mpc}^{-1}$ \\citep{Planck2013}. \nThe apparent host galaxy of iPTF13asv does not have a redshift-independent \ndistance measurement in the NASA/IPAC Extragalactic Database. Thus we calculate a distance modulus of 36.07\\,mag by using its redshift\n$0.036$. The peculiar motion of the host galaxy at ${\\sim}100\\,\\rm{km}\\,\\rm{s}^{-1}$ introduces an uncertainty of $\\lessapprox0.05$\\,mag to the distance modulus. \nThe Galactic line-of-sight extinction is $E(B-V)=0.045$ \\citep{SF2011}. We correct for the Galactic extinction by using the parametrized model in\n\\citet{ftz99} with $R_V=3.1$. \n\n\n\\section{Observations}\n\\label{sec:obs}\nThe nightly-cadence survey of iPTF (weather-permitting) with the 48-inch telescope at Palomar Observatories (P48)\nprovides a well-sampled R-band light curve of iPTF13asv covering the pre-SN history and its rise phase. After \ndiscovery, we also utilized the Palomar 60-inch telescope (P60; \\citealt{CFM2006}), Andalusia Faint Object Spectrograph and \nCamera (ALFOSC) on the Nordic Optical Telescope (NOT), and the RATIR camera mounted on the OAN/SPM $1.5$-meter Harold L. Johnson \ntelescope for multi-band photometric follow-up observations. We also triggered target-of-opportunity observations of the \\textit{Swift}\nspacecraft for X-ray and UV follow-up. A sample of the ground-based photometric measurements are presented in Table~\\ref{tab:lightcurve}\nand the space-based measurements in Table~\\ref{tab:swift}. \n\n\\begin{deluxetable}{ccccc}\n    \\tablecolumns{5}\n    \\tablewidth{0pt}\n    \\tablecaption{Plhotometry of iPTF13asv \\label{tab:lightcurve}}\n    \\tablehead{\n        \\colhead{Tel./Inst.\\tablenotemark{1}}  &  \\colhead{filter}  &  \\colhead{MJD$-56000$}  &  \\colhead{mag.\\tablenotemark{2}}  &  \\colhead{mag. err.} \\\\\n                         &  \\colhead{(day)}      &                    &                  &                  }\n    \\startdata\n        P48   &    PTF-R      & 412.456      &    $>$20.35    &   \\nodata\\\\\n        P48   &    PTF-R      & 413.442      &     20.44    &   0.17\\\\\n        P48   &    PTF-R      & 413.471      &     20.34    &   0.16\\\\\n        P48   &    PTF-R      & 414.470      &     19.58    &   0.09\\\\\n        P48   &    PTF-R      & 415.469      &     19.06    &   0.06\\\\\n        \\multicolumn{5}{c}{\\nodata} \n    \\enddata\n    \\tablenotetext{1}{This column lists the telescopes and instruments used for photometric observations of iPTF13asv. We built reference images\n    by stacking pre-SN or post-SN frames and used image subtraction technique to remove light contamination from the host galaxy. Point-spread-function \n    (PSF) photometry is performed on subtracted images. The photometry is calibrated either to SDSS or by observing Landolt photometric standard stars. \n    }\n    \\tablenotetext{2}{Conventionally, the magnitudes in $UBVJH$ bands are in Vega system. Those in other bands are in AB system. No extinction is corrected\n    in this column. }\n\\end{deluxetable}\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=0.45\\textwidth]{lightcurve.pdf}\n\\caption{\\textbf{Multi-color light curve of iPTF13asv.} Colors and shapes represent different filters and instruments, respectively. \nA deviation of $\\simeq0.1$\\,mag between P48 R-band (red circles) and P60 r-band (red diamonds) is due to the difference between\nthe P48 Mould R filter and the P60 SDSS r filter. \nThe ``S'' ticks on the top axis denote spectroscopic observation epochs. The solid curves are SALT2 best-fit lightcurves in corresponding\nfilters. The dash-dotted curves are the IR template from \\citet{sga+15}.\nThe inset zooms into the very early phases of the PTF R-band lightcurve. The dashed curve in the inset shows the best $t^2$ law\nfit to the early lightcurve. \n\\label{fig:lightCurve}}\n\\end{figure}\n\n\n\\begin{deluxetable}{cccc}\n\\tablecolumns{4}\n\\tablewidth{0pt}\n\\tablecaption{{\\it Swift} Observations\\label{tab:swift}}\n\\tablehead{\n    \\colhead{Obs. Date} & \\multicolumn{2}{c}{UVOT (AB mag)\\tablenotemark{1}} & \n    \\colhead{XRT (cnt/s)\\tablenotemark{2}} \\\\\n    \\colhead{}          & \\colhead{$uvm2$} & \\colhead{$uvw2$} & \\colhead{}\n}\n\\startdata\nMay 17.4  &  $21.02\\pm0.08$  &  $20.59\\pm0.08$  &  $<3.6\\times10^{-3}$  \\\\\nMay 22.6  &  $21.25\\pm0.10$  &  $20.92\\pm0.09$  &  $<8.0\\times10^{-3}$  \\\\\nMay 25.9  &  $21.83\\pm0.12$  &  $21.39\\pm0.10$  &  $<4.3\\times10^{-3}$  \\\\\nJune 02.7 &  $<22.20$        &  $<22.36$        &  $<9.0\\times10^{-3}$  \\\\\nJune 10.5 &  $<21.98$        &  $<22.18$        &  $<1.2\\times10^{-2}$  \\\\\nJune 13.4 &  $<22.37$        &  $<22.46$        &  $<8.7\\times10^{-3}$  \\\\\n\\enddata\n\\tablenotetext{1}{We used the \\texttt{HEASoft} package to perform aperture photometry on the UVOT images. The photometry is corrected for \ncoincident loss and with the PSF growth curve, and calibrated with the latest calibration \\citep{BLH2011}. In order to remove host galaxy contamination\nin the photometric measurements, we acquired post-SN reference frames. In cases of non-detection, we estimated 5-$\\sigma$ upper limits.}\n\\tablenotetext{2}{We used the \\texttt{XImage} software to analyze the XRT data. In cases of non-detection, we estimate upper limits with a $99.7\\%$ \nconfidence level.}\n\\end{deluxetable}\n\nSpectroscopic observations were undertaken with the SuperNova Integral Field Spectragraph (SNIFS; \\citealt{SNIFS}) on the $2.2\\,$m telescope \nof the University of Hawaii, the Dual Imaging Spectrograph (DIS) on the ARC $3.5$\\,m telescope at Apache Point Observatory (APO), the Double Spectrograph \n(DBSP; \\citealt{DBSP}) on the 200-inch Hale telescope (P200) at Palomar Observatory, and the Folded-port InfraRed Echellette (FIRE) on the \nMagellan-{\\uppercase\\expandafter{\\romannumeral {1}\\relax}} Baade Telescope at Las Campanas Observatory. As presented in Figure \\ref{fig:specEvolution}, the spectral sequence provides\ntemporal coverage of the SN evolution. \n\nThe lightcurve and spectra are made publicly available via WISeREP\\footnote{WISeREP is available at \\url{http://www.weizmann.ac.il/astrophysics/wiserep/}.} \\citep{YG2012}. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{specEvolution.pdf}\n\\caption{\\textbf{Optical and near-IR spectral evolution of iPTF13asv.} Ticks at the bottom denote the main spectral features. \nThe phases and telescopes/instruments are labeled to the right of corresponding spectra. The long-slit spectra taken by APO/DIS, P200/DBSP and\nMagellan/FIRE are extracted through usual procedures in IRAF and/or IDL and calibrated using observations of spectroscopic stars. Data reduction \nof SNIFS is outlined in \\citet{AAB2006}. However, due to bad weather, flux calibration of SNIFS spectra was not complete. Therefore, we interpolate\nthe multi-band lightcurve and ``warp'' the spectra with low-order polynomials to match photometric data. \n\\label{fig:specEvolution}}\n\\end{figure}\n\n\\section{Analysis}\n\\label{sec:analysis}\n\n\\subsection{Initial Rise and Explosion Date}\n\\label{sec:explosion}\n\nIn order to determine the explosion date of iPTF13asv, \nwe follow \\citet{NSC2011} and model the early PTF-R-band lightcurve of iPTF13asv as a freely expanding fireball where\nthe luminosity increases as $\\propto t^2$ and the temperature remains constant. \nRestricting ourselves to the lightcurve within four days of discovery, \nwe find a best fit (the inset in Figure \\ref{fig:lightCurve}) at an explosion date of April $29.4\\pm0.3$ ($95\\%$ confidence interval) \nwith a fitting $\\chi^2=4.3$ for five degrees of freedom. The best-fit light curve is also consistent with \nthe upper limit on April $30.4$. \n\nIf we replace the $t^2$ model with a power-law model, we obtain strong degeneracy between the \nexplosion date and the power-law index over a large range of the parameter space. For simplicity, we use the explosion \ndate determined in the $t^2$ model in the following analysis. \n\nA caveat here is that there might be a dark time between the SN explosion and the time when it becomes visible \\citep{p12,pm15}. \nThe length of the dark time is roughly the diffusive timescale for the shallowest $^{56}$Ni layer in the ejecta. \n\n\\subsection{Lightcurve}\n\\label{sec:analysis:lightcurve}\nIn order to determine the lightcurve shape parameters of iPTF13asv, we use the SALT2 software \\citep{GAB2007} to fit its optical lightcurve. \nThe best-fit lightcurve gives a rest-frame B-band peak magnitude \n$m_B=16.28\\pm0.03$ on May $18.12\\pm0.09$. We set this B-band peak date as $t=0$ in the rest of this paper. The fit also gives a color \nterm $c=-0.16\\pm0.02$, and two shape parameters $x_0=0.0055\\pm0.0001$ and $x_1=0.37\\pm0.09$. Based on the fitted SALT2 light curve,\nwe derive a color $(B-V)_0=-0.14\\pm0.03$ at the B-band maximum. We also obtain $\\Delta m_{15}=1.03\\pm0.01$ from $x_1$ by using the relation \nin \\citet{GAB2007}. \n\nThe local extinction in the host galaxy of iPTF13asv is probably small for several reasons. First, as shown in Figure \\ref{fig:BV}, iPTF13asv and SN2011fe\nhave a similar B$-$V color around maximum. The difference of the B$-$V colors between 0 and $+30$ days is probably correlated with the different stretch\nof these two events \\citep{ng08}. Since SN2011fe is unreddened by its host \\citep{NSC2011,vst+12}, iPTF13asv also has little local extinction.\nSecond, the intrinsic color $B-V=0.95$\\,mag of iPTF13asv at $+35$ days are consistent with the latest calibration of the Lira relation \\citep{bsp+14}.\nThird, the absence of \\ion{Na}{1}\\,D absorption in the low-resolution optical spectra also implies weak extinction in the host galaxy \\citep{PPB2012}. \nTherefore, in what follows we neglect the local extinction correction. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{colorComp.pdf}\n\\caption{\\textbf{B$-$V color evolution of SN2011fe and iPTF13asv after correction for Galactic extinction} The solid line\nshows the Lira relation from \\citet{bsp+14} and the dashed lines corresponding to its $0.06$\\,mag scattering. \n\\label{fig:BV}}\n\\end{figure}\n\nAfter correction for Galactic extinction and including the distance uncertainty, we derive an absolute peak magnitude of iPTF13asv in its rest-frame B-band to be \n$-19.97\\pm0.06$. This is about $0.7$\\,mag brighter than normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. \n\nIn the UV, iPTF13asv is very luminous around peak. As shown in Figure \\ref{fig:swiftIaSample}, iPTF13asv has UV lightcurves\nof both $uvm2$ and $uvw2$ filters similar to many super-Chandrasekhar events, and brighter than all other events except for\nSN2009dc \\citep{Brown2014}. \nIn this comparison, no K-correction was made to iPTF13asv and the other SNe because K-correction is very \nsmall for low-redshift SNe. We note that calculations using the Nugent SN {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a template \\citep{nkp02} \nand the {\\it HST} spectra of SN2011fe \\citep{MSH2014} show \nthat at this redshift the K-correction is $<0.2$\\,mag in both filters and thus these comparisons are good to $\\lesssim20\\%$. \nIt is also worth noting that SN2011fe belongs to the NUV-blue subclass \\citep{BDd2012,MBR2013}. \nSince iPTF13asv and SN2011fe have similar an optical color and iPTF13asv is brighter in the UV than SN2011fe, \niPTF13asv also has a very blue UV-optical color, similar to other super-Chandrasekhar events \\citep{BKS2014}. \n\nWe also compare the IR lightcurves of iPTF13asv in the J- and H-band to the most recent lightcurve template for normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a\nevents (Figure \\ref{fig:lightCurve}; \\citealt{sga+15}) and find that the sparsely-sampled lightcurves of iPTF13asv roughly follow the template. \nThe peak magnitudes of iPTF13asv is $M_J=-18.97\\pm0.08$ and $M_H=-18.30\\pm0.19$, compared to the median peak magnitudes of\n$M_J=-18.39$ and $M_H=-18.36$ with rms scatters of $\\sigma_J=0.116\\pm0.027$ and $\\sigma_H=0.085\\pm0.16$ for normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a\nSNe \\citep{blw+12}. Without a IR spectrum around maximum, it is difficult to interpret why iPTF13asv is so bright in the J band. \nBoth J-band and H-band lightcurves show clear secondary maxima, indicating concentration of iron group elements in the central region\nof the iPTF13asv ejecta \\citep{Kasen2006}.\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{swiftIaSample.pdf}\n\\caption{\\textbf{UV lightcurve comparison between iPTF13asv and other SNe {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a.} \nA sample of SNe {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a from \\citet{MBR2013} are shown in gray. Highlighted by different colors are lightcurves of iPTF13asv (black), \nSN2011fe (sky blue), SN2012cg (blue), super-Chandrasekhar events SN2009dc, SN2011aa and\nLSQ12gdj (purple), and the most UV-luminous event SN2011de (orange). All magnitudes are in the AB system.\n\\label{fig:swiftIaSample}}\n\\end{figure}\n\n\\subsection{Spectra}\nAs a result of nucleosynthesis and mixing during SN explosions, iron absorption is commonly seen in SN spectra, either as\n\\ion{Fe}{2} at low effective temperatures or as \\ion{Fe}{3} at higher temperatures. However, neither of these iron features are present in the early-phase\nspectra of iPTF13asv. As highlighted in gray regions of Figure \\ref{fig:syn++}, spectral feature identification with SYN$++$ \\citep{tnm11}\non the iPTF13asv spectrum at $-8.7$ days shows no \\ion{Fe}{2} or \\ion{Fe}{3}. We also compare the iPTF13asv spectra against both\nnormal events (Figure \\ref{fig:specZoomIn} and super-Chandrasekhar events (Figure \\ref{fig:earlySuperC}) to illustrate that, unlike iPTF13asv,\nboth normal and super-Chandrasekhar SNe have iron absorption features at very early phases. \n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{synSpec.pdf}\n\\caption{\\textbf{SYN++ synthetic SN spectrum fit to iPTF13asv at -9.2 days.} From top to bottom are\nthe observed spectrum, the synthetic spectrum without Fe (solid), the synthetic spectrum with \\ion{Fe}{2} (dashed) and the synthetic\nspectrum with \\ion{Fe}{3} (dash-dotted). The absorption features from different species are illustrated \nin different colors. The \\ion{Fe}{2} and \\ion{Fe}{3} absorption wavelength ranges are highlighted in light gray. \n\\label{fig:syn++}}\n\\end{figure}\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=0.45\\textwidth]{specZoomIn.pdf}\n\\caption{\\textbf{Blue spectral comparison of iPTF13asv to SN2011fe and SN2012cg.} \nThe spectra of iPTF13asv between 3200\\,\\AA\\ and 5300\\,\\AA\\ (black) are compared\nwith those of normal SN2011fe (blue) and over-luminous SN2012cg (red) at similar phases. The gray color highlights\nthe UV region and the light gray color indicates the ion absorption features.\n\\label{fig:specZoomIn}}\n\\end{figure}\n\n\\begin{figure}[htb]\n\\centering\n\\includegraphics[width=0.45\\textwidth]{earlySpecSuperC.pdf}\n\\caption{\\textbf{Comparison of earliest spectra between iPTF13asv and super-Chandrasekhar events.} \nThe earliest two spectra of iPTF13asv (black) are compared to SN2006gz at $-14$ days (purple), SN2009dc at $-7$ days\n(green), and LSQ12gdj at $-8$ days (orange). The wavelength ranges for absorptions of \\ion{Fe}{2} and \\ion{Fe}{3} are highlighted in light gray. \n\\label{fig:earlySuperC}}\n\\end{figure}\n\nThe absence of iron at early phases indicates that synthesized iron group elements are confined in low-velocity regions of the ejecta. Since the iron\ngroup elements are the main absorbers of photons below $3500$\\,\\AA, the lack of iron group elements in fast-moving ejecta effectively reduces the UV \nopacity at early phases. In fact, as shown in the dark gray region in Figure \\ref{fig:specZoomIn}, the flux of iPTF13asv below $3500$\\,\\AA\\ is seemingly\nstronger than those of SN2011fe at early phases. We did not trigger \\textit{Swift} observations at early phases of iPTF13asv, because it is about 160\\,Mpc\naway from us. Our experience shows that \\textit{Swift} UV observations are usually sensitive to Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe within 100\\,Mpc. Otherwise, \n\\textit{Swift} observations at these phases would be perfectly suited to show the UV flux difference. \n\nThe spectral sequence in Figure \\ref{fig:specZoomIn} also shows that the iron features start to emerge in iPTF13asv about a week before maximum. \nAround maximum, the spectra of iPTF13asv show similar features to both normal and super-Chandrasekhar events\n(Figure \\ref{fig:specAtPeak}). The expansion velocities of iPTF13asv, as indicated by \\ion{Si}{2}\\,6355 minima, are similar to those of both SN2011fe and \nSN2012cg and higher than that of SN2009dc.\n\nWe further compare the expansion velocity evolution of iPTF13asv to a sample of normal and super-Chandrasekhar events (Figure \\ref{fig:velocity}). \nThe velocities are measured by fitting a Gaussian profile to the iPTF13asv spectra around the \\ion{Si}{2}\\,6355 features. \nThe continuum components are removed by a linear regression to regions at both sides of the absorption features. \nAs can be seen in Figure \\ref{fig:velocity}, iPTF13asv has a low expansion velocity and a shallow velocity gradient, compared to normal\nType {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. Around maximum, the expansion velocity of iPTF13asv is $\\simeq10,000\\,\\rm{km}\\,\\rm{s}^{-1}$ and the velocity \ngradient is roughly zero. The low expansion velocity and shallow velocity gradient of iPTF13asv is usually seen in super-Chandrasekhar events.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{specComparisonAtPeak.pdf}\n\\caption{\\textbf{Spectral cross-matching.} The spectrum of iPTF13asv around maximum matches those of SN2011fe, SN2012cg and \nSN2009dc (super-Chandrasekhar).\n\\label{fig:specAtPeak}}\n\\end{figure}\n\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{Velocity.pdf}\n\\caption{\\textbf{\\ion{Si}{2} velocity evolution of iPTF13asv and other SNe {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a.} The gray points are from a large sample of mostly normal\nSNe {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a in \\citet{fsk11}. Blue squares represent iPTF13asv and other color symbols as shown in the legend represent super-Chandrasekhar events. \n\\label{fig:velocity}}\n\\end{figure}\n\nWe also note that iPTF13asv shows weak but persistent \\ion{C}{2} absorption features between $-14.1$ and $+11.5$ days (Figure \\ref{fig:carbon}).\nThe velocities of these \\ion{C}{2} lines change from $\\simeq14,000\\,\\rm{km}\\,\\rm{s}^{-1}$ at $-14.1$ days to $\\simeq9,000\\,\\rm{km}\\,\\rm{s}^{-1}$. \nIn comparison, about 30\\% of normal SNe show the \\ion{C}{2}\\,6580 and \\ion{C}{2}\\,7234 absorption notches in early phases \\citep{taa+11,ptf+11,sf12}, \nbut these \\ion{C}{2} features usually disappear before maximum. In contrast, super-Chandrasekhar events usually show strong and persistent \\ion{C}{2}\nfeatures after maximum. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.5\\textwidth]{carbonFootprint.pdf}\n\\caption{\\textbf{Carbon features of iPTF13asv at different phases.} The numbers to the right of each spectrum indicate the phases in days. \nThe blue triangles point to the carbon features. The red dashed axes show velocities of \\ion{C}{2}\\,$6580$ and \\ion{C}{2}\\,$7234$ lines. \n\\label{fig:carbon}}\n\\end{figure}\n\n\n\\subsection{Host Galaxy}\n\\label{sec:result:host}\nAfter iPTF13asv faded away, we obtained a low signal-to-noise ratio spectrum of its apparent host galaxy SDSS\\,J162254.02+185733.8. \nThe spectrum only shows H$\\alpha$ emission at the redshift of iPTF13asv. We fit a Gaussian profile to the H$\\alpha$ line and\nmeasure a luminosity of $3\\times10^{38}\\,{\\rm ergs\\,s}^{-1}$. We adopt the empirical relation between H$\\alpha$ luminosity and \nstar formation rate \\citep{Kennicutt1998} and obtain a star formation rate of $2\\times10^{-3}\\,{M_\\odot}\\,{\\rm yr}^{-1}$ for the host galaxy. \n\nNext, we construct the spectral energy distribution (SED) of the host galaxy with optical photometry from SDSS and near-IR photometry \nmeasured on the SN reference images.  \nThe SED is then modeled with a galaxy synthesis code called the Fitting and Assessment \nof Synthetic Templates (FAST; \\citealt{kvl+09}) assuming an exponentially decaying star formation history and a solar metallicity. \nThe best fit model gives a galaxy age of $10^{8.6}\\,$years and a stellar mass of $10^{7.8}{M_\\odot}$ with a reduced $\\chi^2=1.6$ (Figure~\\ref{fig:sedfit}). \nThe best fit model also shows no ongoing star forming activity. Because SED fitting models are usually insensitive to very low\nstar forming rates, the best fit model is consistent with the low star formation\nrate derived from the H$\\alpha$ flux.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{SEDfit.pdf}\n\\caption{\\textbf{SED fit of the host galaxy.} The data points (red) are SDSS model magnitudes in optical and aperture-photometric measurements \nin the near-IR RATIR reference images. The blue spectrum is the best fit from FAST. \n\\label{fig:sedfit}}\n\\end{figure}\n\nThe derived star formation rate and the stellar mass of the iPTF13asv host galaxy follow the empirical relation between stellar mass and star formation rate\n\\citep{fhg+12}. Using the mass-metallicity relation \\citep{fhg+12}, we also estimate a gas-phase metallicity of $12+\\log({\\rm O/H})\\sim8$ for the host galaxy. \nCompared to the host galaxy sample of SNe Ia in \\citet{PSM2014}, SDSS\\,J162254.02+185733.8 is one of the least massive and most metal-poor\ngalaxies that host Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. \n\n\\section{Bolometric Lightcurve And Ejecta Mass}\n\\label{sec:mass}\n\n\\subsection{Bolometric Lightcurve}\nGiven the wavelength coverage of the iPTF13asv spectra, we first construct a pseudo-bolometric lightcurve between 3500\\,\\AA\\ and 9700\\,\\AA. In order\nto calibrate the absolute fluxes of these spectra, we use interpolated optical lightcurves to ``warp'' the spectra. Then the spectra are integrated to\nderive the pesudo-bolometric lightcurve. \n\nDue to the sparsely sampled UV and IR lightcurves, it is difficult to estimate the UV and IR radiation at different phases. Therefore we calculate optical-to-bolometric \ncorrection factors with a spectral template \\citep{hch+07}. In this calculation, we find that the UV correction reaches about 25\\% before the B-band \nmaximum and quickly drops to less than 5\\% around and after the B-band maximum. \nGiven the inference that the SN might be UV-luminous before maximum and the observational fact that the SN is among the UV-bright Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a\nSNe around maximum, our calculated correction probably underestimates the UV radiation. Using the Swift data around maximum, we estimate that \nthis UV correction introduces a systematic uncertainty of a few percent to the bolometric luminosity. Around maximum when the SN cools down, the\nUV contribution to the bolometric luminosity becomes even less important. \n\nIn the IR, the correction above 9700\\,\\AA\\ is below 10\\% around the B-band maximum, and then reaches a maximum of 24\\% around the secondary maximum \nin the near-IR. At the epochs with IR data, we find that the calculated correction is consistent with the IR measurements. \n\nThe final bolometric lightcurve is shown in Figure \\ref{fig:L_bol}. We further employ Gaussian process regression to derive\na maximum bolometric luminosity $L_{max}=(2.2\\pm0.2)\\times10^{43}\\,\\rm{erg}\\,\\rm{s}^{-1}$ at $-2.6$ days.\n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{bolometricLightcurve.pdf}\n\\caption{\\textbf{Bolometric lightcurve}. The measured bolometric luminosities at different phases are in black circles. The blue curve is the best fit from the Gaussian \nprocess regression. The gray region represents the 1-$\\sigma$ uncertainty of the regression curve. \n\\label{fig:L_bol}}\n\\end{figure}\n\n\\subsection{$^{56}$Ni Mass and Ejecta Mass}\n\nNext, we follow the procedure in \\citet{saa+12,SAA2014} to derive the $^{56}$Ni mass and the total ejecta mass. \nFirst, the $^{56}$Ni mass can be estimated through the following equation\n\n", "index": 1, "text": "\\begin{equation}\nL_{max} = \\alpha S(t_R)\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"L_{max}=\\alpha S(t_{R})\\ ,\" display=\"block\"><mrow><mrow><msub><mi>L</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>=</mo><mrow><mi>α</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>R</mi></msub><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00686.tex", "nexttext": "\nwhere $S(t)$ is in the unit of $10^{43}\\,\\rm{erg}\\,\\rm{s}^{-1}$ and $M_{\\rm{Ni}}$ is in the unit of ${M_\\odot}$. With the measured maximum bolometric luminosity\n$L_{max}=(2.2\\pm0.2)\\times10^{43}\\,\\rm{erg}\\,\\rm{s}^{-1}$ at $-2.6$ days, we estimate a $^{56}$Ni mass of $(0.77\\pm0.07){M_\\odot}$. \n\nAbout one month after the SN maximum, the SN debris expands approximately in a homologous manner. At this time, most $^{56}$Ni atoms have decayed to\n$^{56}$Co. Hence the total luminosity can be approximated by\n\n", "itemtype": "equation", "pos": 32582, "prevtext": "\nwhere $S(t_R)$ is the instantaneous radioactive power at the bolometric luminosity maximum. $\\alpha$ is an efficiency factor of order unity, depending on\nthe distribution of $^{56}$Ni \\citep{jbb06}. We adopt a fiducial value of $\\alpha=1.3$ following \\citet{saa+12}. The radioactive\npower of $^{56}\\rm{Ni}\\rightarrow^{56}\\rm{Co}\\rightarrow^{56}\\rm{Fe}$ is \\citep{n94}\n\n", "index": 3, "text": "\\begin{equation}\nS(t_r) = \\left[6.31\\exp{(-t_r/8.8)} + 1.43\\exp{(-t_r/111)}\\right]M_{\\rm{Ni}}\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"S(t_{r})=\\left[6.31\\exp{(-t_{r}/8.8)}+1.43\\exp{(-t_{r}/111)}\\right]M_{\\rm{Ni}}\\ ,\" display=\"block\"><mrow><mrow><mrow><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>t</mi><mi>r</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo>[</mo><mrow><mrow><mn>6.31</mn><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><msub><mi>t</mi><mi>r</mi></msub><mo>/</mo><mn>8.8</mn></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mn>1.43</mn><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><mrow><msub><mi>t</mi><mi>r</mi></msub><mo>/</mo><mn>111</mn></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><mpadded width=\"+5pt\"><msub><mi>M</mi><mi>Ni</mi></msub></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00686.tex", "nexttext": "\nwhere $S_\\gamma$ and $S_{e^+}$ are the decay energy of $^{56}$Co carried by $\\gamma$-ray photons and positions. At \ntime $t_0$, the mean optical path of $\\gamma$-ray photons becomes unity. For a given density and velocity profile,\n$t_0$ reflects the column density along the line of sight. We fit equation (\\ref{eq:lateTime})\nto the bolometric lightcurve of iPTF13asv after $+20$ days and obtained $t_0=44.2\\pm2.0\\,\\rm{days}$. \n\nNext, we estimate the total ejecta mass of iPTF13asv. If we assume a density profile $\\rho(v)\\propto\\exp(-v/v_e)$ where $v_e$\nis a scale velocity, then the ejecta mass can be expressed as\n\n", "itemtype": "equation", "pos": 33199, "prevtext": "\nwhere $S(t)$ is in the unit of $10^{43}\\,\\rm{erg}\\,\\rm{s}^{-1}$ and $M_{\\rm{Ni}}$ is in the unit of ${M_\\odot}$. With the measured maximum bolometric luminosity\n$L_{max}=(2.2\\pm0.2)\\times10^{43}\\,\\rm{erg}\\,\\rm{s}^{-1}$ at $-2.6$ days, we estimate a $^{56}$Ni mass of $(0.77\\pm0.07){M_\\odot}$. \n\nAbout one month after the SN maximum, the SN debris expands approximately in a homologous manner. At this time, most $^{56}$Ni atoms have decayed to\n$^{56}$Co. Hence the total luminosity can be approximated by\n\n", "index": 5, "text": "\\begin{equation}\nL(t) = \\left[1-\\exp(-(t_0/t)^2)\\right]S_\\gamma(t) + S_{e^+}(t)\\ ,\\label{eq:lateTime}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"L(t)=\\left[1-\\exp(-(t_{0}/t)^{2})\\right]S_{\\gamma}(t)+S_{e^{+}}(t)\\ ,\" display=\"block\"><mrow><mrow><mrow><mi>L</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mo>[</mo><mrow><mn>1</mn><mo>-</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mo>-</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>t</mi><mn>0</mn></msub><mo>/</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>S</mi><mi>γ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>S</mi><msup><mi>e</mi><mo>+</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00686.tex", "nexttext": "\nwhere $\\kappa_\\gamma$ is the Compton scattering opacity for $\\gamma$-ray photons . The value of $\\kappa_\\gamma$ is expected to lie \nin the range between $0.025\\,\\rm{cm}^2\\rm{g}^{-1}$ and $0.033\\,\\rm{cm}^2\\rm{g}^{-1}$ \\citep{ssh95}. We adopt a value of $0.025\\,\\rm{cm}^2\\rm{g}^{-1}$ \nfor the optically thin regime. The form factor $q$ describes the distribution of $^{56}$Ni and thus $^{56}$Co \\citep{j99}. For evenly mixed $^{56}$Ni, \nthe value of $q$ is close to one third. Taking element stratification and mixing in the interfaces into account, \\citet{SAA2014} found that $q=0.45\\pm0.05$.\nHere, we adopt $q=0.45$ in our estimation. \n\nThe value of $v_e$ can be obtained by conservation of energy. The total kinetic energy of the ejecta is $6M_{ej}v_e^2$. Neglecting the radiation energy, \nthe total kinetic energy is equal to the difference between the nuclear energy released in the explosion and the binding energy of the exploding white \ndwarf. The binding energy of a rotating white dwarf with mass $M_{ej}$ and central density $\\rho_c$ is given in \\citet{yl05}. Here\nwe restrict the central density to lie between $10^7$ and $10^{10}\\,\\rm{g}\\,\\rm{cm}^{-3}$. \n\nIf we further assume that the \nejecta is composed of unburned CO and synthesized Si, Fe and Ni, then the nuclear energy of the SN\nexplosion is formulated in \\citet{mi09} as a function of mass $M_{ej}$ and mass fractions $f_{\\rm{Fe}}$, $f_{\\rm{Ni}}$ and $f_{\\rm{Si}}$. The ratio\n$\\eta=f_{\\rm{Ni}}/(f_{\\rm{Ni}}+f_{\\rm{Fe}})$ is also a function of $\\rho_c$. Following \\citet{SAA2014}, we adopt a Gaussian prior\n\n", "itemtype": "equation", "pos": 33933, "prevtext": "\nwhere $S_\\gamma$ and $S_{e^+}$ are the decay energy of $^{56}$Co carried by $\\gamma$-ray photons and positions. At \ntime $t_0$, the mean optical path of $\\gamma$-ray photons becomes unity. For a given density and velocity profile,\n$t_0$ reflects the column density along the line of sight. We fit equation (\\ref{eq:lateTime})\nto the bolometric lightcurve of iPTF13asv after $+20$ days and obtained $t_0=44.2\\pm2.0\\,\\rm{days}$. \n\nNext, we estimate the total ejecta mass of iPTF13asv. If we assume a density profile $\\rho(v)\\propto\\exp(-v/v_e)$ where $v_e$\nis a scale velocity, then the ejecta mass can be expressed as\n\n", "index": 7, "text": "\\begin{equation}\nM_{ej}=\\frac{8\\pi}{\\kappa_\\gamma q}\\left(v_et_0\\right)^2\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"M_{ej}=\\frac{8\\pi}{\\kappa_{\\gamma}q}\\left(v_{e}t_{0}\\right)^{2}\\ ,\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mrow><mi>e</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mrow><mn>8</mn><mo>⁢</mo><mi>π</mi></mrow><mrow><msub><mi>κ</mi><mi>γ</mi></msub><mo>⁢</mo><mi>q</mi></mrow></mfrac><mo>⁢</mo><mpadded width=\"+5pt\"><msup><mrow><mo>(</mo><mrow><msub><mi>v</mi><mi>e</mi></msub><mo>⁢</mo><msub><mi>t</mi><mn>0</mn></msub></mrow><mo>)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00686.tex", "nexttext": "\nwhere $\\rho_{c,9}$ is $\\rho_c$ in units of $10^9\\,\\rm{g}\\,\\rm{cm}^{-3}$. In addition, we restrict the mass fraction $f_{\\rm{CO}}$ less than $10\\%$. \n\nBased on the above assumptions, with a given set of ejecta mass $M_{ej}$, central density $\\rho_c$ and the mass fractions of different elements, \nwe can calculate the maximum bolometric luminosity and $t_0$ in equation (\\ref{eq:lateTime}) and compare them with our measurements of iPTF13asv.\nAfter one million Markov-Chain-Monte-Carlo iterations, we obtain $M_{Ni}=0.81^{+0.10}_{-0.18}$ and $M_{ej}=1.44^{+0.44}_{-0.12}{M_\\odot}$ at a 95\\% \nconfidence level. \n\n\\subsection{Detached Shell Surrounding the SN}\n\nIn order to explain the almost constant \\ion{Si}{2} velocity in super-Chandrasekhar events, \\citet{saa+10} and \\citet{saa+12} hypothesize a stationary \nshell detached from the ejecta. The shell is accelerated to a constant speed $v_{sh}$ by colliding with fast-moving ejecta with velocities greater than $v_{sh}$. \nIn fact, some simulations of WD mergers show that the outermost material forms such a stationary envelope that collides with fast-moving ejecta \\citep{hk96}. \nFollowing the calculation procedure in \\citet{saa+10} and \\citet{saa+12}, we derive an envelope mass of $0.15^{+0.11}_{-0.01}{M_\\odot}$ for iPTF13asv. \n\nThough the detached shell has little effect on the $\\gamma$-ray opacity and peak luminosity of a SN, it reddens the SN and extends its rise time. \nHowever, compared to other super-Chandrasekhar events \\citep{saa+12}, iPTF13asv shows a blue intrinsic color and a much shorter rise time. \nBased on the color and rise time, we infer that iPTF13asv is unlikely to have this detached shell. \n\n\\section{Discussions}\n\\label{sec:discussion}\n\n\n\\subsection{Comparison To Super-Chandrasekhar And Normal Events}\nIn Table \\ref{tab:comparison}, we compare iPTF13asv against both super-Chandrasekhar and normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. \nIn addition to the features listed in the table, the H-band break, which is formed by absorption of \\ion{Fe}{2}, \\ion{Co}{2} and \\ion{Ni}{2} \\citep{hmp+13}, \nis distinctive between super-Chandrasekhar and normal events. The break usually appears in normal SNe within a month of maximum, but is \nabsent in the super-Chandrasekhar events. However, in the case of iPTF13asv, the only near-IR spectrum is taken one month after the maximum,\nand is therefore not constraining to the existence of the H-band break. \n\nAs can be seen from the table, on the one hand, the over-luminous iPTF13asv has a normal lightcurve shape and near-IR secondary peak. On the\nother hand, like super-Chandrasekhar events, iPTF13asv shows persistent \\ion{C}{2} absorption and low expansion velocity with little evolution. \nWhile the derived $^{56}$Ni mass is higher in iPTF13asv than in normal events, the total ejecta mass is close to the Chandrasekhar limit. \n\nWe further examine whether iPTF13asv follows the empirical relation between the peak magnitude, the lightcurve shape and the intrinsic color, i.e., \n\n", "itemtype": "equation", "pos": 35600, "prevtext": "\nwhere $\\kappa_\\gamma$ is the Compton scattering opacity for $\\gamma$-ray photons . The value of $\\kappa_\\gamma$ is expected to lie \nin the range between $0.025\\,\\rm{cm}^2\\rm{g}^{-1}$ and $0.033\\,\\rm{cm}^2\\rm{g}^{-1}$ \\citep{ssh95}. We adopt a value of $0.025\\,\\rm{cm}^2\\rm{g}^{-1}$ \nfor the optically thin regime. The form factor $q$ describes the distribution of $^{56}$Ni and thus $^{56}$Co \\citep{j99}. For evenly mixed $^{56}$Ni, \nthe value of $q$ is close to one third. Taking element stratification and mixing in the interfaces into account, \\citet{SAA2014} found that $q=0.45\\pm0.05$.\nHere, we adopt $q=0.45$ in our estimation. \n\nThe value of $v_e$ can be obtained by conservation of energy. The total kinetic energy of the ejecta is $6M_{ej}v_e^2$. Neglecting the radiation energy, \nthe total kinetic energy is equal to the difference between the nuclear energy released in the explosion and the binding energy of the exploding white \ndwarf. The binding energy of a rotating white dwarf with mass $M_{ej}$ and central density $\\rho_c$ is given in \\citet{yl05}. Here\nwe restrict the central density to lie between $10^7$ and $10^{10}\\,\\rm{g}\\,\\rm{cm}^{-3}$. \n\nIf we further assume that the \nejecta is composed of unburned CO and synthesized Si, Fe and Ni, then the nuclear energy of the SN\nexplosion is formulated in \\citet{mi09} as a function of mass $M_{ej}$ and mass fractions $f_{\\rm{Fe}}$, $f_{\\rm{Ni}}$ and $f_{\\rm{Si}}$. The ratio\n$\\eta=f_{\\rm{Ni}}/(f_{\\rm{Ni}}+f_{\\rm{Fe}})$ is also a function of $\\rho_c$. Following \\citet{SAA2014}, we adopt a Gaussian prior\n\n", "index": 9, "text": "\\begin{equation}\n\\eta=0.95-0.05\\rho_{c,9}\\pm0.03\\max(1,\\rho_{c,9})\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\eta=0.95-0.05\\rho_{c,9}\\pm 0.03\\max(1,\\rho_{c,9})\\ ,\" display=\"block\"><mrow><mrow><mi>η</mi><mo>=</mo><mrow><mrow><mn>0.95</mn><mo>-</mo><mrow><mn>0.05</mn><mo>⁢</mo><msub><mi>ρ</mi><mrow><mi>c</mi><mo>,</mo><mn>9</mn></mrow></msub></mrow></mrow><mo>±</mo><mrow><mn>0.03</mn><mo>⁢</mo><mrow><mi>max</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>,</mo><msub><mi>ρ</mi><mrow><mi>c</mi><mo>,</mo><mn>9</mn></mrow></msub><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00686.tex", "nexttext": "\nwhere $\\mu$ is the distance modulus, $m_B^*$ is the observed peak magnitude in the rest-frame B band, $\\alpha$, $\\beta$ and $M_B$ are free\nparameters. In order account for the dependence on the host galaxy properties, \\citet{SGC2011} suggest to use different values of $M_B$ for galaxies of stellar mass\ngreater and less than $10^{10}{M_\\odot}$. In the case of iPTF13asv, the stellar mass of its host galaxy is $\\sim10^{7.8}{M_\\odot}$. \nFor galaxies with stellar mass less than $10^{10}{M_\\odot}$, \\citet{bkg+14} obtained $M_B=-19.04\\pm0.01$, $\\alpha=0.141\\pm0.006$ and $\\beta=3.101\\pm0.075$.\nSubstituting $m_B^*=16.28\\pm0.03$, $x_1=0.37\\pm0.09$ and $c=-0.16\\pm0.02$ into the empirical relation, we find that iPTF13asv still follows the empirical \nrelation, whereas in contrast, super-Chandrasekhar events are outliers of this empirical relation \\citep{saa+12}. \n\n\\begin{deluxetable*}{cccc}\n\\tablecolumns{4}\n\\tablewidth{0pt}\n\\tablecaption{Comparison of iPTF13asv to normal and super-Chandrasekhar SNe\\label{tab:comparison}}\n\\tablehead{\n\t\\colhead{Feature}   &   \\colhead{Normal}   &  \\colhead{iPTF13asv}    &    \\colhead{super-Chandrasekhar}\n}\n\\startdata\nB-band peak magnitude   &  $-18\\sim-19.5$  &  $-19.97\\pm0.06$   &  $<-19.6$  \\\\\nUV peak magnitude    &  $\\gtrsim-15$  &  $-15.25$  &   $\\lesssim-15$  \\\\\n$\\Delta m_{15}$ (mag)    & $0.8\\sim1.2$   &  $1.0$   &  $\\simeq0.6$   \\\\\nNear-IR secondary peak   &   strong  &   strong   &   weak or absent  \\\\\nCarbon feature after max   &  no   &  weak   &  strong  \\\\\n\\ion{Si}{2}\\,6355 velocity at max ($10^3\\,\\rm{km}\\,\\rm{s}^{-1}$)\\tablenotemark{a}  & $10\\sim14$   &   $10$    &   $8\\sim12$    \\\\\n\\ion{Si}{2}\\,6355 velocity gradient at max  ($\\rm{km}\\,\\rm{s}^{-1}\\,\\rm{day}^{-1}$)\\tablenotemark{a}   &  $50-150$   &  $\\sim0$   &   $-72\\sim46$\\\\\n$^{56}$Ni mass (${M_\\odot}$)\\tablenotemark{b}    &  $0.3\\sim0.6$   & $0.81^{+0.10}_{-0.18}$   &  $>0.75$    \\\\\nEjecta mass (${M_\\odot}$)\\tablenotemark{b}    &  $0.8\\sim1.5$     &   $1.44^{+0.44}_{-0.12}$   &   $>1.5$ \n\\enddata\n\\tablenotetext{a}{The velocity measurements of normal events are from \\citet{fsk11}. Those of super-Chandrasekhar events are from \\citet{saa+12}. }\n\\tablenotetext{b}{The mass measurements of normal events are from \\citet{sra14}. Those of super-Chandrasekhar events are from \\citet{saa+12}.}\n\\end{deluxetable*}\n\nBased on this comparison, we suggest that iPTF13asv is an intermediate {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN between normal and super-Chandrasekhar events, and\nit may represent the transition of observational properties as the total ejecta mass increases from Chandrasekhar to super-Chandrasekhar in the DD channel. \n\nIn addition, \\citet{Brown2014} reported the UV brightest SN2011de. However, SN2011de is dissimilar to iPTF13asv, as it has a high-velocity component in \nits \\ion{Si}{2} line. The lack of a well-sampled lightcurve and a spectral sequence also makes it difficult to estimate the $^{56}$Ni mass and total ejecta mass\nof SN2011de. \n\n\\subsection{Strong UV Emission}\nStrong UV emission in a Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SN can be powered by an extrinsic SN-companion collision \\citep{Kasen2010} or intrinsic $^{56}$Ni decay. \nIn fact, in the UV-luminous SN2011de, \\citet{Brown2014} offered a possible explanation to its \\textit{Swift} lightcurve as a SN-companion collision. \nHence, despite similarities between iPTF13asv and super-Chandrasekhar events,\nwe assess whether the strong UV emission of iPTF13asv can be explained by collision between the SN and a companion star. \n\nWe utilize the scaling relation in \\citet{Kasen2010} to fit the observed $uvm2$ lightcurve. In order to account for the non-negligible emission \nfrom the SN itself, we use the well-sampled $uvm2$ lightcurve of SN2011fe as a template. The fitting result shows that the companion star\nis located at $2\\times10^{13}\\,\\rm{cm}$ away from the exploding WD (left panel of Figure \\ref{fig:SN-companion}). Given a typical mass ratio of a few, \nthe companion has a radius of $\\sim100{R_\\odot}$ to fill its Roche lobe. \n\n\\begin{figure}\n\\centering\n\\includegraphics[width=0.45\\textwidth]{SNCompanion.pdf}\n\\caption{\\textbf{Comparison between the SN-companion interaction signature model and iPTF13asv data.} \\textit{Left}: The $uvm2$ and\n$uvw2$ lightcurves of iPTF13asv (black circles) are compared to the total lightcurves (green) which combine the SN-companion interaction component\n(red; \\citealt{Kasen2010}) and the SN intrinsic emission (cyan). \\textit{Right}: the iPTF13asv spectrum at $-13.7$ days (black) is compared to \nthe thermal spectrum of SN-companion collision (red). \n\\label{fig:SN-companion}}\n\\end{figure}\n\nAlthough the model fit to the UV lightcurve looks plausible, it overshoots the optical spectrum of iPTF13asv at $-13.7$ days at short wavelengths (right panel\nof Figure \\ref{fig:SN-companion}). The model also produces a pulse of $\\simeq 200\\rm{\\mu Jy}$ in the R-band within a few days of explosion, much stronger\nthan the observed R-band fluxes $\\lessapprox150\\rm{\\mu Jy}$  at the very early phases (the inset of Figure \\ref{fig:lightCurve}). Additionally, \nwe caution that, as pointed out in \\citet{Kasen2010}, this scaling relation may become invalid after the first few days \nof the SN explosion. Hence, we conclude that the strong UV emission seen in iPTF13asv is not produced by SN-companion collision. \n\nAs a result of the above analysis, we are forced to conclude that the strong UV emission is intrinsic. In fact, the strong UV emission and the lack of iron in \nearly-phase spectra may be causally related. The latter implies an ejecta structure of weak mixing with most iron group elements concentrated in the low-velocity\nzones of the ejecta. Since the line blanketing of iron group elements dominates the UV opacity, the optical opacity of UV photons is very small until the\nphotosphere recedes into the low-velocity zones of the ejecta. Consequently, the SN appears to be more UV luminous around maximum. \nThe concentration of iron group elements is also supported by the strong secondary peak in the near-IR. The near-IR secondary peak results from transition \nof iron group elements from doubly ionized states to singly ionized states. The double-peaked morphology of the near-IR light curve is therefore a direct consequence \nof the abundance stratification of the ejecta, in particular, the concentration of iron group elements in the central regions \\citep{Kasen2006}. To sum up, all\nthese observational facts suggest that iPTF13asv has a stratified ejecta with strong concentration of iron group elements in the center. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{Progenitor}\n\nThe similarity to super-Chandrasekhar events and the derived ejecta mass naturally suggest that the progenitor of iPTF13asv is a DD system. This is\nfurther supported by the stratified ejecta. Hydrodynamic simulations (e.g., \\citealt{KSF2010,ssk+13}) show that explosions in a SD system cannot avoid \na certain level of mixing in the ejecta. Hence, these models have difficulty in concentrating most of iron group elements in the center of the ejecta. \nFor merging WDs, in contrast, simulations of prompt detonation (e.g., \\citealt{mrk+14}) produce strongly stratified structures along polar directions in\nasymmetric ejecta. In these directions, iron group elements are confined in the low-velocity regions. Hence, based on these arguments, we infer that\niPTF13asv originates from a DD system. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\subsection{UV-Luminous Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe At High Redshifts}\n\nSpectroscopic classification for high-redshift SNe requires very long integration on big telescopes. \nTherefore, in high-redshift SN surveys, an optical-UV ``dropout'' is introduced to preselect Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a\ncandidates \\citep[for example,][]{rst+04, rsc+07}. In practice, the F850LP, F775W and F606 filters on the {\\it HST} \nAdvanced Camera for Survey (ACS) are usually used to search for SNe at redshifts up to $1.8$. \n\nThe color preselection criteria may introduce bias by ignoring UV-luminous SNe. In Figure \\ref{fig:color}, we calculate the \ncolor difference in the F850LP, F775W and F606 filters for normal SN1992a \\citep{kjl+93}, near-UV blue SN2011fe \\citep{MSH2014} \nand UV-luminous iPTF13asv at different redshifts. As can be seen, the three SNe show different colors at high redshifts. Although\nthe rate of iPTF13asv-like events is probably low in the nearby Universe, there might be more such SNe at high redshifts, as\nthere are more metal-poor dwarf galaxies at high redshifts. Hence it might become an unnegligible component in estimating the\nSN rate at high redshifts. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{figure}\n\\includegraphics[width=0.45\\textwidth]{highZcolor.pdf}\n\\caption{\\textbf{Color difference as a function of redshift for three different SNe Ia.}\n\\label{fig:color}}\n\\end{figure}\n\n\\section{Conclusion}\n\\label{sec:conclusion}\nIn this paper, we present multi-wavelength observations of a peculiar over-luminous Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernova, iPTF13asv, discovered by\nthe intermediate Palomar Transient Factory. While its $\\Delta m_{15}=1.03\\pm0.01$\\,mag and sharp secondary near-IR peak resemble characteristic features\nof normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernovae, iPTF13asv shows low but almost constant expansion velocities and persistent carbon absorption \nfeatures after the maximum, both of which are commonly seen super-Chandrasekhar events. We derive a $^{56}$Ni mass of $0.81^{+0.10}_{-0.18}{M_\\odot}$ and a total\nejecta mass of $1.44^{+0.44}_{-0.12}{M_\\odot}$. Therefore, we suggest that iPTF13asv is an intermediate case between the\nnormal and super-Chandrasekhar events. \n\nOur observations of iPTF13asv also show an absence of iron absorption features in its early-phase spectra until several days before maximum, and strong UV\nemission around peak. These observations together with sharp near-IR secondary maxima indicate that iPTF13asv has a stratified\nstructure along the line of sight, with synthesized iron group elements concentrated in the center of its ejecta. Compared to hydrodynamic simulations, \nonly WD mergers might produce the inferred ejecta structure. Therefore, based on the stratified\nejecta and its similarity to super-Chandrasekhar events, we conclude that iPTF13asv originates from a double-degenerate progenitor system. \n\nWe speculate that iPTF13asv might be a transiting case between normal and super-Chandrasekhar events. \nMoving forward, the current and upcoming time-domain surveys, such as the Zwicky Transient Facility, will find many more Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a supernovae\nof different subclasses. Equipped with fast-turnaround follow-up observations which allow us to estimate the ejecta mass and the $^{56}$Ni mass, \nthese surveys will map how observational features vary as a function the total ejecta mass for supernovae from the double-degenerate channel. \nIn particular, UV photometry and optical spectroscopy of these supernovae at early phases will encode information about mixing of iron group elements. \n\n\n\n\n\\acknowledgments\n\nWe thank M. Kromer for useful discussion. We are also grateful to A. De Cia, O. Yaron, D. Tal, D. Perley, K. Tinyanont, A. Waszczak,\nI. Arcavi, and S. Tang for doing observation and data reduction. This research is partly supported by the \\textit{Swift} Guest Investigator program\nand by the National Science Foundation through the Global Relay of Observatories Watching Transients Happen program. \nA.G. and R.A. acknowledge support from the Swedish Research Council and the\nSwedish Space Board.\nE.~Y.~H. acknowledges the support provided by the Danish Agency for Science and Technology and Innovation\nthrough a Sapere Aude Level 2 grant.\n\nThe data presented here were obtained in part with ALFOSC, which is provided by\nthe Instituto de Astrofisica de Andalucia (IAA) under a joint agreement with the University\nof Copenhagen and NOTSA. We thank the RATIR project team and\nthe staff of the Observatorio Astron\\'{o}mico Nacional on\nSierra San Pedro M\\'{a}rtir. RATIR is a collaboration between\nthe University of California, the Universidad Nacional\nAut\\'{o}noma de M\\'{e}xico, NASA Goddard Space Flight\nCenter, and Arizona State University, benefiting from the\nloan of an H2RG detector and hardware and software support\nfrom Teledyne Scientific and Imaging. RATIR, the\nautomation of the Harold L. Johnson Telescope of the\nObservatorio Astron\\'{o}mico Nacional on Sierra San Pedro\nM\\'{a}rtir, and the operation of both are funded through NASA\ngrants NNX09AH71G, NNX09AT02G, NNX10AI27G, and\nNNX12AE66G, CONACyT grants LN 260369, and UNAM PAPIIT grant IG100414.\n\nA portion of this work was carried out at the Jet Propulsion Laboratory, under contract \nwith the National Aeronautics and Space Administration.  Copyright 2016 California Institute of Technology.  \nAll Rights Reserved. US Government Support Acknowledged.\n\n\\begin{thebibliography}{}\n\\expandafter\\ifx\\csname natexlab\\endcsname\\relax\\def\\natexlab#1{#1}\\fi\n\n\\bibitem[{{Aldering} {et~al.}(2006){Aldering}, {Antilogus}, {Bailey}, {Baltay},\n  {Bauer}, {Blanc}, {Bongard}, {Copin}, {Gangler}, {Gilles}, {Kessler},\n  {Kocevski}, {Lee}, {Loken}, {Nugent}, {Pain}, {P{\\'e}contal}, {Pereira},\n  {Perlmutter}, {Rabinowitz}, {Rigaudier}, {Scalzo}, {Smadja}, {Thomas},\n  {Wang}, {Weaver}, \\& {Nearby Supernova Factory}}]{AAB2006}\n{Aldering}, G., {Antilogus}, P., {Bailey}, S., {et~al.} 2006, \\apj, 650, 510\n\n\\bibitem[{{Barone-Nugent} {et~al.}(2012){Barone-Nugent}, {Lidman}, {Wyithe},\n  {Mould}, {Howell}, {Hook}, {Sullivan}, {Nugent}, {Arcavi}, {Cenko}, {Cooke},\n  {Gal-Yam}, {Hsiao}, {Kasliwal}, {Maguire}, {Ofek}, {Poznanski}, \\&\n  {Xu}}]{blw+12}\n{Barone-Nugent}, R.~L., {Lidman}, C., {Wyithe}, J.~S.~B., {et~al.} 2012,\n  \\mnras, 425, 1007\n\n\\bibitem[{{Betoule} {et~al.}(2014){Betoule}, {Kessler}, {Guy}, {Mosher},\n  {Hardin}, {Biswas}, {Astier}, {El-Hage}, {Konig}, {Kuhlmann}, {Marriner},\n  {Pain}, {Regnault}, {Balland}, {Bassett}, {Brown}, {Campbell}, {Carlberg},\n  {Cellier-Holzem}, {Cinabro}, {Conley}, {D'Andrea}, {DePoy}, {Doi}, {Ellis},\n  {Fabbro}, {Filippenko}, {Foley}, {Frieman}, {Fouchez}, {Galbany}, {Goobar},\n  {Gupta}, {Hill}, {Hlozek}, {Hogan}, {Hook}, {Howell}, {Jha}, {Le Guillou},\n  {Leloudas}, {Lidman}, {Marshall}, {M{\\\"o}ller}, {Mour{\\~a}o}, {Neveu},\n  {Nichol}, {Olmstead}, {Palanque-Delabrouille}, {Perlmutter}, {Prieto},\n  {Pritchet}, {Richmond}, {Riess}, {Ruhlmann-Kleider}, {Sako}, {Schahmaneche},\n  {Schneider}, {Smith}, {Sollerman}, {Sullivan}, {Walton}, \\&\n  {Wheeler}}]{bkg+14}\n{Betoule}, M., {Kessler}, R., {Guy}, J., {et~al.} 2014, \\aap, 568, A22\n\n\\bibitem[{{Breeveld} {et~al.}(2011){Breeveld}, {Landsman}, {Holland}, {Roming},\n  {Kuin}, \\& {Page}}]{BLH2011}\n{Breeveld}, A.~A., {Landsman}, W., {Holland}, S.~T., {et~al.} 2011, in American\n  Institute of Physics Conference Series, Vol. 1358, American Institute of\n  Physics Conference Series, ed. J.~E. {McEnery}, J.~L. {Racusin}, \\&\n  N.~{Gehrels}, 373--376\n\n\\bibitem[{{Brown}(2014)}]{Brown2014}\n{Brown}, P.~J. 2014, \\apjl, 796, L18\n\n\\bibitem[{{Brown} {et~al.}(2012){Brown}, {Dawson}, {de Pasquale}, {Gronwall},\n  {Holland}, {Immler}, {Kuin}, {Mazzali}, {Milne}, {Oates}, \\&\n  {Siegel}}]{BDd2012}\n{Brown}, P.~J., {Dawson}, K.~S., {de Pasquale}, M., {et~al.} 2012, \\apj, 753,\n  22\n\n\\bibitem[{{Brown} {et~al.}(2014){Brown}, {Kuin}, {Scalzo}, {Smitka}, {de\n  Pasquale}, {Holland}, {Krisciunas}, {Milne}, \\& {Wang}}]{BKS2014}\n{Brown}, P.~J., {Kuin}, P., {Scalzo}, R., {et~al.} 2014, \\apj, 787, 29\n\n\\bibitem[{{Burns} {et~al.}(2014){Burns}, {Stritzinger}, {Phillips}, {Hsiao},\n  {Contreras}, {Persson}, {Folatelli}, {Boldt}, {Campillay}, {Castell{\\'o}n},\n  {Freedman}, {Madore}, {Morrell}, {Salgado}, \\& {Suntzeff}}]{bsp+14}\n{Burns}, C.~R., {Stritzinger}, M., {Phillips}, M.~M., {et~al.} 2014, \\apj, 789,\n  32\n\n\\bibitem[{{Cao} {et~al.}(2015){Cao}, {Kulkarni}, {Howell}, {Gal-Yam},\n  {Kasliwal}, {Valenti}, {Johansson}, {Amanullah}, {Goobar}, {Sollerman},\n  {Taddia}, {Horesh}, {Sagiv}, {Cenko}, {Nugent}, {Arcavi}, {Surace},\n  {Wo{\\'z}niak}, {Moody}, {Rebbapragada}, {Bue}, \\& {Gehrels}}]{ckh+15}\n{Cao}, Y., {Kulkarni}, S.~R., {Howell}, D.~A., {et~al.} 2015, \\nat, 521, 328\n\n\\bibitem[{{Cenko} {et~al.}(2006){Cenko}, {Fox}, {Moon}, {Harrison}, {Kulkarni},\n  {Henning}, {Guzman}, {Bonati}, {Smith}, {Thicksten}, {Doyle}, {Petrie},\n  {Gal-Yam}, {Soderberg}, {Anagnostou}, \\& {Laity}}]{CFM2006}\n{Cenko}, S.~B., {Fox}, D.~B., {Moon}, D.-S., {et~al.} 2006, \\pasp, 118, 1396\n\n\\bibitem[{{Fitzpatrick}(1999)}]{ftz99}\n{Fitzpatrick}, E.~L. 1999, \\pasp, 111, 63\n\n\\bibitem[{{Foley} {et~al.}(2014){Foley}, {McCully}, {Jha}, {Bildsten}, {Fong},\n  {Narayan}, {Rest}, \\& {Stritzinger}}]{fmj+14}\n{Foley}, R.~J., {McCully}, C., {Jha}, S.~W., {et~al.} 2014, \\apj, 792, 29\n\n\\bibitem[{{Foley} {et~al.}(2011){Foley}, {Sanders}, \\& {Kirshner}}]{fsk11}\n{Foley}, R.~J., {Sanders}, N.~E., \\& {Kirshner}, R.~P. 2011, \\apj, 742, 89\n\n\\bibitem[{{Foster} {et~al.}(2012){Foster}, {Hopkins}, {Gunawardhana},\n  {Lara-L{\\'o}pez}, {Sharp}, {Steele}, {Taylor}, {Driver}, {Baldry}, {Bamford},\n  {Liske}, {Loveday}, {Norberg}, {Peacock}, {Alpaslan}, {Bauer},\n  {Bland-Hawthorn}, {Brough}, {Cameron}, {Colless}, {Conselice}, {Croom},\n  {Frenk}, {Hill}, {Jones}, {Kelvin}, {Kuijken}, {Nichol}, {Owers},\n  {Parkinson}, {Pimbblet}, {Popescu}, {Prescott}, {Robotham}, {Lopez-Sanchez},\n  {Sutherland}, {Thomas}, {Tuffs}, {van Kampen}, \\& {Wijesinghe}}]{fhg+12}\n{Foster}, C., {Hopkins}, A.~M., {Gunawardhana}, M., {et~al.} 2012, \\aap, 547,\n  A79\n\n\\bibitem[{{Goobar} \\& {Leibundgut}(2011)}]{GL2011}\n{Goobar}, A., \\& {Leibundgut}, B. 2011, Annual Review of Nuclear and Particle\n  Science, 61, 251\n\n\\bibitem[{{Goobar} {et~al.}(2015){Goobar}, {Kromer}, {Siverd}, {Stassun},\n  {Pepper}, {Amanullah}, {Kasliwal}, {Sollerman}, \\& {Taddia}}]{gks+15}\n{Goobar}, A., {Kromer}, M., {Siverd}, R., {et~al.} 2015, \\apj, 799, 106\n\n\\bibitem[{{Guy} {et~al.}(2007){Guy}, {Astier}, {Baumont}, {Hardin}, {Pain},\n  {Regnault}, {Basa}, {Carlberg}, {Conley}, {Fabbro}, {Fouchez}, {Hook},\n  {Howell}, {Perrett}, {Pritchet}, {Rich}, {Sullivan}, {Antilogus}, {Aubourg},\n  {Bazin}, {Bronder}, {Filiol}, {Palanque-Delabrouille}, {Ripoche}, \\&\n  {Ruhlmann-Kleider}}]{GAB2007}\n{Guy}, J., {Astier}, P., {Baumont}, S., {et~al.} 2007, \\aap, 466, 11\n\n\\bibitem[{{Hicken} {et~al.}(2007){Hicken}, {Garnavich}, {Prieto}, {Blondin},\n  {DePoy}, {Kirshner}, \\& {Parrent}}]{hgp+07}\n{Hicken}, M., {Garnavich}, P.~M., {Prieto}, J.~L., {et~al.} 2007, \\apjl, 669,\n  L17\n\n\\bibitem[{{Hoeflich} \\& {Khokhlov}(1996)}]{hk96}\n{Hoeflich}, P., \\& {Khokhlov}, A. 1996, \\apj, 457, 500\n\n\\bibitem[{{Howell} {et~al.}(2006){Howell}, {Sullivan}, {Nugent}, {Ellis},\n  {Conley}, {Le Borgne}, {Carlberg}, {Guy}, {Balam}, {Basa}, {Fouchez}, {Hook},\n  {Hsiao}, {Neill}, {Pain}, {Perrett}, \\& {Pritchet}}]{hsn+06}\n{Howell}, D.~A., {Sullivan}, M., {Nugent}, P.~E., {et~al.} 2006, \\nat, 443, 308\n\n\\bibitem[{{Hsiao} {et~al.}(2007){Hsiao}, {Conley}, {Howell}, {Sullivan},\n  {Pritchet}, {Carlberg}, {Nugent}, \\& {Phillips}}]{hch+07}\n{Hsiao}, E.~Y., {Conley}, A., {Howell}, D.~A., {et~al.} 2007, \\apj, 663, 1187\n\n\\bibitem[{{Hsiao} {et~al.}(2013){Hsiao}, {Marion}, {Phillips}, {Burns},\n  {Winge}, {Morrell}, {Contreras}, {Freedman}, {Kromer}, {Gall}, {Gerardy},\n  {H{\\\"o}flich}, {Im}, {Jeon}, {Kirshner}, {Nugent}, {Persson}, {Pignata},\n  {Roth}, {Stanishev}, {Stritzinger}, \\& {Suntzeff}}]{hmp+13}\n{Hsiao}, E.~Y., {Marion}, G.~H., {Phillips}, M.~M., {et~al.} 2013, \\apj, 766,\n  72\n\n\\bibitem[{{Jeffery}(1999)}]{j99}\n{Jeffery}, D.~J. 1999, ArXiv Astrophysics e-prints, astro-ph/9907015\n\n\\bibitem[{{Jeffery} {et~al.}(2006){Jeffery}, {Branch}, \\& {Baron}}]{jbb06}\n{Jeffery}, D.~J., {Branch}, D., \\& {Baron}, E. 2006, ArXiv Astrophysics\n  e-prints, astro-ph/0609804\n\n\\bibitem[{{Kasen}(2006)}]{Kasen2006}\n{Kasen}, D. 2006, \\apj, 649, 939\n\n\\bibitem[{{Kasen}(2010)}]{Kasen2010}\n---. 2010, \\apj, 708, 1025\n\n\\bibitem[{{Kelly} {et~al.}(2014){Kelly}, {Fox}, {Filippenko}, {Cenko}, {Prato},\n  {Schaefer}, {Shen}, {Zheng}, {Graham}, \\& {Tucker}}]{kff+14}\n{Kelly}, P.~L., {Fox}, O.~D., {Filippenko}, A.~V., {et~al.} 2014, \\apj, 790, 3\n\n\\bibitem[{{Kennicutt}(1998)}]{Kennicutt1998}\n{Kennicutt}, Jr., R.~C. 1998, \\araa, 36, 189\n\n\\bibitem[{{Kirshner} {et~al.}(1993){Kirshner}, {Jeffery}, {Leibundgut},\n  {Challis}, {Sonneborn}, {Phillips}, {Suntzeff}, {Smith}, {Winkler}, {Winge},\n  {Hamuy}, {Hunter}, {Roth}, {Blades}, {Branch}, {Chevalier}, {Fransson},\n  {Panagia}, {Wagoner}, {Wheeler}, \\& {Harkness}}]{kjl+93}\n{Kirshner}, R.~P., {Jeffery}, D.~J., {Leibundgut}, B., {et~al.} 1993, \\apj,\n  415, 589\n\n\\bibitem[{{Kriek} {et~al.}(2009){Kriek}, {van Dokkum}, {Labb{\\'e}}, {Franx},\n  {Illingworth}, {Marchesini}, \\& {Quadri}}]{kvl+09}\n{Kriek}, M., {van Dokkum}, P.~G., {Labb{\\'e}}, I., {et~al.} 2009, \\apj, 700,\n  221\n\n\\bibitem[{{Kromer} {et~al.}(2010){Kromer}, {Sim}, {Fink}, {R{\\\"o}pke},\n  {Seitenzahl}, \\& {Hillebrandt}}]{KSF2010}\n{Kromer}, M., {Sim}, S.~A., {Fink}, M., {et~al.} 2010, \\apj, 719, 1067\n\n\\bibitem[{{Kushnir} {et~al.}(2013){Kushnir}, {Katz}, {Dong}, {Livne}, \\&\n  {Fern{\\'a}ndez}}]{kkd+13}\n{Kushnir}, D., {Katz}, B., {Dong}, S., {Livne}, E., \\& {Fern{\\'a}ndez}, R.\n  2013, \\apjl, 778, L37\n\n\\bibitem[{{Lantz} {et~al.}(2004){Lantz}, {Aldering}, {Antilogus}, {Bonnaud},\n  {Capoani}, {Castera}, {Copin}, {Dubet}, {Gangler}, {Henault}, {Lemonnier},\n  {Pain}, {Pecontal}, {Pecontal}, \\& {Smadja}}]{SNIFS}\n{Lantz}, B., {Aldering}, G., {Antilogus}, P., {et~al.} 2004, in Society of\n  Photo-Optical Instrumentation Engineers (SPIE) Conference Series, Vol. 5249,\n  Optical Design and Engineering, ed. L.~{Mazuray}, P.~J. {Rogers}, \\&\n  R.~{Wartmann}, 146--155\n\n\\bibitem[{{Law} {et~al.}(2009){Law}, {Kulkarni}, {Dekany}, {Ofek}, {Quimby},\n  {Nugent}, {Surace}, {Grillmair}, {Bloom}, {Kasliwal}, {Bildsten}, {Brown},\n  {Cenko}, {Ciardi}, {Croner}, {Djorgovski}, {van Eyken}, {Filippenko}, {Fox},\n  {Gal-Yam}, {Hale}, {Hamam}, {Helou}, {Henning}, {Howell}, {Jacobsen},\n  {Laher}, {Mattingly}, {McKenna}, {Pickles}, {Poznanski}, {Rahmer}, {Rau},\n  {Rosing}, {Shara}, {Smith}, {Starr}, {Sullivan}, {Velur}, {Walters}, \\&\n  {Zolkower}}]{LKD2009}\n{Law}, N.~M., {Kulkarni}, S.~R., {Dekany}, R.~G., {et~al.} 2009, \\pasp, 121,\n  1395\n\n\\bibitem[{{Li} {et~al.}(2011){Li}, {Bloom}, {Podsiadlowski}, {Miller}, {Cenko},\n  {Jha}, {Sullivan}, {Howell}, {Nugent}, {Butler}, {Ofek}, {Kasliwal},\n  {Richards}, {Stockton}, {Shih}, {Bildsten}, {Shara}, {Bibby}, {Filippenko},\n  {Ganeshalingam}, {Silverman}, {Kulkarni}, {Law}, {Poznanski}, {Quimby},\n  {McCully}, {Patel}, {Maguire}, \\& {Shen}}]{lbp+11}\n{Li}, W., {Bloom}, J.~S., {Podsiadlowski}, P., {et~al.} 2011, \\nat, 480, 348\n\n\\bibitem[{{Lundqvist} {et~al.}(2015){Lundqvist}, {Nyholm}, {Taddia},\n  {Sollerman}, {Johansson}, {Kozma}, {Lundqvist}, {Fransson}, {Garnavich},\n  {Kromer}, {Shappee}, \\& {Goobar}}]{lnt+15}\n{Lundqvist}, P., {Nyholm}, A., {Taddia}, F., {et~al.} 2015, \\aap, 577, A39\n\n\\bibitem[{{Maeda} \\& {Iwamoto}(2009)}]{mi09}\n{Maeda}, K., \\& {Iwamoto}, K. 2009, \\mnras, 394, 239\n\n\\bibitem[{{Maoz} {et~al.}(2014){Maoz}, {Mannucci}, \\& {Nelemans}}]{mmn14}\n{Maoz}, D., {Mannucci}, F., \\& {Nelemans}, G. 2014, \\araa, 52, 107\n\n\\bibitem[{{Margutti} {et~al.}(2014){Margutti}, {Parrent}, {Kamble},\n  {Soderberg}, {Foley}, {Milisavljevic}, {Drout}, \\& {Kirshner}}]{mpk+14}\n{Margutti}, R., {Parrent}, J., {Kamble}, A., {et~al.} 2014, \\apj, 790, 52\n\n\\bibitem[{{Marion} {et~al.}(2015){Marion}, {Brown}, {Vink{\\'o}}, {Silverman},\n  {Sand}, {Challis}, {Kirshner}, {Wheeler}, {Berlind}, {Brown}, {Calkins},\n  {Comacho}, {Dhungana}, {Foley}, {Friedman}, {Graham}, {Howell}, {Hsiao},\n  {Irwin}, {Jha}, {Kehoe}, {Macri}, {Maeda}, {Mandel}, {McCully}, {Pandya},\n  {Rines}, {Wilhelmy}, \\& {Zheng}}]{mbv+15}\n{Marion}, G.~H., {Brown}, P.~J., {Vink{\\'o}}, J., {et~al.} 2015, ArXiv\n  e-prints, arXiv:1507.07261\n\n\\bibitem[{{Mazzali} {et~al.}(2014){Mazzali}, {Sullivan}, {Hachinger}, {Ellis},\n  {Nugent}, {Howell}, {Gal-Yam}, {Maguire}, {Cooke}, {Thomas}, {Nomoto}, \\&\n  {Walker}}]{MSH2014}\n{Mazzali}, P.~A., {Sullivan}, M., {Hachinger}, S., {et~al.} 2014, \\mnras, 439,\n  1959\n\n\\bibitem[{{McCully} {et~al.}(2014){McCully}, {Jha}, {Foley}, {Bildsten},\n  {Fong}, {Kirshner}, {Marion}, {Riess}, \\& {Stritzinger}}]{mjf+14}\n{McCully}, C., {Jha}, S.~W., {Foley}, R.~J., {et~al.} 2014, \\nat, 512, 54\n\n\\bibitem[{{Milne} {et~al.}(2013){Milne}, {Brown}, {Roming}, {Bufano}, \\&\n  {Gehrels}}]{MBR2013}\n{Milne}, P.~A., {Brown}, P.~J., {Roming}, P.~W.~A., {Bufano}, F., \\& {Gehrels},\n  N. 2013, \\apj, 779, 23\n\n\\bibitem[{{Moll} {et~al.}(2014){Moll}, {Raskin}, {Kasen}, \\&\n  {Woosley}}]{mrk+14}\n{Moll}, R., {Raskin}, C., {Kasen}, D., \\& {Woosley}, S.~E. 2014, \\apj, 785, 105\n\n\\bibitem[{{Nadyozhin}(1994)}]{n94}\n{Nadyozhin}, D.~K. 1994, \\apjs, 92, 527\n\n\\bibitem[{{Nobili} \\& {Goobar}(2008)}]{ng08}\n{Nobili}, S., \\& {Goobar}, A. 2008, \\aap, 487, 19\n\n\\bibitem[{{Nomoto} \\& {Iben}(1985)}]{ni85}\n{Nomoto}, K., \\& {Iben}, Jr., I. 1985, \\apj, 297, 531\n\n\\bibitem[{{Nugent} {et~al.}(2002){Nugent}, {Kim}, \\& {Perlmutter}}]{nkp02}\n{Nugent}, P., {Kim}, A., \\& {Perlmutter}, S. 2002, \\pasp, 114, 803\n\n\\bibitem[{{Nugent} {et~al.}(2011){Nugent}, {Sullivan}, {Cenko}, {Thomas},\n  {Kasen}, {Howell}, {Bersier}, {Bloom}, {Kulkarni}, {Kandrashoff},\n  {Filippenko}, {Silverman}, {Marcy}, {Howard}, {Isaacson}, {Maguire},\n  {Suzuki}, {Tarlton}, {Pan}, {Bildsten}, {Fulton}, {Parrent}, {Sand},\n  {Podsiadlowski}, {Bianco}, {Dilday}, {Graham}, {Lyman}, {James}, {Kasliwal},\n  {Law}, {Quimby}, {Hook}, {Walker}, {Mazzali}, {Pian}, {Ofek}, {Gal-Yam}, \\&\n  {Poznanski}}]{NSC2011}\n{Nugent}, P.~E., {Sullivan}, M., {Cenko}, S.~B., {et~al.} 2011, \\nat, 480, 344\n\n\\bibitem[{{Oke} \\& {Gunn}(1982)}]{DBSP}\n{Oke}, J.~B., \\& {Gunn}, J.~E. 1982, \\pasp, 94, 586\n\n\\bibitem[{{Pan} {et~al.}(2014){Pan}, {Sullivan}, {Maguire}, {Hook}, {Nugent},\n  {Howell}, {Arcavi}, {Botyanszki}, {Cenko}, {DeRose}, {Fakhouri}, {Gal-Yam},\n  {Hsiao}, {Kulkarni}, {Laher}, {Lidman}, {Nordin}, {Walker}, \\&\n  {Xu}}]{PSM2014}\n{Pan}, Y.-C., {Sullivan}, M., {Maguire}, K., {et~al.} 2014, \\mnras, 438, 1391\n\n\\bibitem[{{Parrent} {et~al.}(2011){Parrent}, {Thomas}, {Fesen}, {Marion},\n  {Challis}, {Garnavich}, {Milisavljevic}, {Vink{\\`o}}, \\& {Wheeler}}]{ptf+11}\n{Parrent}, J.~T., {Thomas}, R.~C., {Fesen}, R.~A., {et~al.} 2011, \\apj, 732, 30\n\n\\bibitem[{{Patat} {et~al.}(2007){Patat}, {Chandra}, {Chevalier}, {Justham},\n  {Podsiadlowski}, {Wolf}, {Gal-Yam}, {Pasquini}, {Crawford}, {Mazzali},\n  {Pauldrach}, {Nomoto}, {Benetti}, {Cappellaro}, {Elias-Rosa}, {Hillebrandt},\n  {Leonard}, {Pastorello}, {Renzini}, {Sabbadin}, {Simon}, \\&\n  {Turatto}}]{pcc+07}\n{Patat}, F., {Chandra}, P., {Chevalier}, R., {et~al.} 2007, Science, 317, 924\n\n\\bibitem[{{Phillips}(1993)}]{Phillips1993}\n{Phillips}, M.~M. 1993, \\apjl, 413, L105\n\n\\bibitem[{{Piro}(2012)}]{p12}\n{Piro}, A.~L. 2012, \\apj, 759, 83\n\n\\bibitem[{{Piro} \\& {Morozova}(2015)}]{pm15}\n{Piro}, A.~L., \\& {Morozova}, V.~S. 2015, ArXiv e-prints, arXiv:1512.03442\n\n\\bibitem[{{Planck Collaboration} {et~al.}(2013){Planck Collaboration}, {Ade},\n  {Aghanim}, {Armitage-Caplan}, {Arnaud}, {Ashdown}, {Atrio-Barandela},\n  {Aumont}, {Baccigalupi}, {Banday}, \\& et~al.}]{Planck2013}\n{Planck Collaboration}, {Ade}, P.~A.~R., {Aghanim}, N., {et~al.} 2013, ArXiv\n  e-prints, arXiv:1303.5076\n\n\\bibitem[{{Poznanski} {et~al.}(2012){Poznanski}, {Prochaska}, \\&\n  {Bloom}}]{PPB2012}\n{Poznanski}, D., {Prochaska}, J.~X., \\& {Bloom}, J.~S. 2012, \\mnras, 426, 1465\n\n\\bibitem[{{Rau} {et~al.}(2009){Rau}, {Kulkarni}, {Law}, {Bloom}, {Ciardi},\n  {Djorgovski}, {Fox}, {Gal-Yam}, {Grillmair}, {Kasliwal}, {Nugent}, {Ofek},\n  {Quimby}, {Reach}, {Shara}, {Bildsten}, {Cenko}, {Drake}, {Filippenko},\n  {Helfand}, {Helou}, {Howell}, {Poznanski}, \\& {Sullivan}}]{RKL2009}\n{Rau}, A., {Kulkarni}, S.~R., {Law}, N.~M., {et~al.} 2009, \\pasp, 121, 1334\n\n\\bibitem[{{Riess} {et~al.}(2004){Riess}, {Strolger}, {Tonry}, {Tsvetanov},\n  {Casertano}, {Ferguson}, {Mobasher}, {Challis}, {Panagia}, {Filippenko},\n  {Li}, {Chornock}, {Kirshner}, {Leibundgut}, {Dickinson}, {Koekemoer},\n  {Grogin}, \\& {Giavalisco}}]{rst+04}\n{Riess}, A.~G., {Strolger}, L.-G., {Tonry}, J., {et~al.} 2004, \\apjl, 600, L163\n\n\\bibitem[{{Riess} {et~al.}(2007){Riess}, {Strolger}, {Casertano}, {Ferguson},\n  {Mobasher}, {Gold}, {Challis}, {Filippenko}, {Jha}, {Li}, {Tonry}, {Foley},\n  {Kirshner}, {Dickinson}, {MacDonald}, {Eisenstein}, {Livio}, {Younger}, {Xu},\n  {Dahl{\\'e}n}, \\& {Stern}}]{rsc+07}\n{Riess}, A.~G., {Strolger}, L.-G., {Casertano}, S., {et~al.} 2007, \\apj, 659,\n  98\n\n\\bibitem[{{Scalzo} {et~al.}(2012){Scalzo}, {Aldering}, {Antilogus}, {Aragon},\n  {Bailey}, {Baltay}, {Bongard}, {Buton}, {Canto}, {Cellier-Holzem},\n  {Childress}, {Chotard}, {Copin}, {Fakhouri}, {Gangler}, {Guy}, {Hsiao},\n  {Kerschhaggl}, {Kowalski}, {Nugent}, {Paech}, {Pain}, {Pecontal}, {Pereira},\n  {Perlmutter}, {Rabinowitz}, {Rigault}, {Runge}, {Smadja}, {Tao}, {Thomas},\n  {Weaver}, {Wu}, \\& {Nearby Supernova Factory}}]{saa+12}\n{Scalzo}, R., {Aldering}, G., {Antilogus}, P., {et~al.} 2012, \\apj, 757, 12\n\n\\bibitem[{{Scalzo} {et~al.}(2014{\\natexlab{a}}){Scalzo}, {Aldering},\n  {Antilogus}, {Aragon}, {Bailey}, {Baltay}, {Bongard}, {Buton},\n  {Cellier-Holzem}, {Childress}, {Chotard}, {Copin}, {Fakhouri}, {Gangler},\n  {Guy}, {Kim}, {Kowalski}, {Kromer}, {Nordin}, {Nugent}, {Paech}, {Pain},\n  {Pecontal}, {Pereira}, {Perlmutter}, {Rabinowitz}, {Rigault}, {Runge},\n  {Saunders}, {Sim}, {Smadja}, {Tao}, {Taubenberger}, {Thomas}, {Weaver}, \\&\n  {Nearby Supernova Factory}}]{SAA2014}\n---. 2014{\\natexlab{a}}, \\mnras, 440, 1498\n\n\\bibitem[{{Scalzo} {et~al.}(2014{\\natexlab{b}}){Scalzo}, {Ruiter}, \\&\n  {Sim}}]{sra14}\n{Scalzo}, R.~A., {Ruiter}, A.~J., \\& {Sim}, S.~A. 2014{\\natexlab{b}}, \\mnras,\n  445, 2535\n\n\\bibitem[{{Scalzo} {et~al.}(2010){Scalzo}, {Aldering}, {Antilogus}, {Aragon},\n  {Bailey}, {Baltay}, {Bongard}, {Buton}, {Childress}, {Chotard}, {Copin},\n  {Fakhouri}, {Gal-Yam}, {Gangler}, {Hoyer}, {Kasliwal}, {Loken}, {Nugent},\n  {Pain}, {P{\\'e}contal}, {Pereira}, {Perlmutter}, {Rabinowitz}, {Rau},\n  {Rigaudier}, {Runge}, {Smadja}, {Tao}, {Thomas}, {Weaver}, \\& {Wu}}]{saa+10}\n{Scalzo}, R.~A., {Aldering}, G., {Antilogus}, P., {et~al.} 2010, \\apj, 713,\n  1073\n\n\\bibitem[{{Scalzo} {et~al.}(2014{\\natexlab{c}}){Scalzo}, {Childress}, {Tucker},\n  {Yuan}, {Schmidt}, {Brown}, {Contreras}, {Morrell}, {Hsiao}, {Burns},\n  {Phillips}, {Campillay}, {Gonzalez}, {Krisciunas}, {Stritzinger}, {Graham},\n  {Parrent}, {Valenti}, {Lidman}, {Schaefer}, {Scott}, {Fraser}, {Gal-Yam},\n  {Inserra}, {Maguire}, {Smartt}, {Sollerman}, {Sullivan}, {Taddia}, {Yaron},\n  {Young}, {Taubenberger}, {Baltay}, {Ellman}, {Feindt}, {Hadjiyska},\n  {McKinnon}, {Nugent}, {Rabinowitz}, \\& {Walker}}]{sct+14}\n{Scalzo}, R.~A., {Childress}, M., {Tucker}, B., {et~al.} 2014{\\natexlab{c}},\n  \\mnras, 445, 30\n\n\\bibitem[{{Schlafly} \\& {Finkbeiner}(2011)}]{SF2011}\n{Schlafly}, E.~F., \\& {Finkbeiner}, D.~P. 2011, \\apj, 737, 103\n\n\\bibitem[{{Shappee} {et~al.}(2013){Shappee}, {Stanek}, {Pogge}, \\&\n  {Garnavich}}]{ssp+13}\n{Shappee}, B.~J., {Stanek}, K.~Z., {Pogge}, R.~W., \\& {Garnavich}, P.~M. 2013,\n  \\apjl, 762, L5\n\n\\bibitem[{{Silverman} \\& {Filippenko}(2012)}]{sf12}\n{Silverman}, J.~M., \\& {Filippenko}, A.~V. 2012, \\mnras, 425, 1917\n\n\\bibitem[{{Silverman} {et~al.}(2011){Silverman}, {Ganeshalingam}, {Li},\n  {Filippenko}, {Miller}, \\& {Poznanski}}]{sgl+11}\n{Silverman}, J.~M., {Ganeshalingam}, M., {Li}, W., {et~al.} 2011, \\mnras, 410,\n  585\n\n\\bibitem[{{Sim} {et~al.}(2013){Sim}, {Seitenzahl}, {Kromer},\n  {Ciaraldi-Schoolmann}, {R{\\\"o}pke}, {Fink}, {Hillebrandt}, {Pakmor},\n  {Ruiter}, \\& {Taubenberger}}]{ssk+13}\n{Sim}, S.~A., {Seitenzahl}, I.~R., {Kromer}, M., {et~al.} 2013, \\mnras, 436,\n  333\n\n\\bibitem[{{Stanishev} {et~al.}(2015){Stanishev}, {Goobar}, {Amanullah},\n  {Bassett}, {Fantaye}, {Garnavich}, {Hlozek}, {Nordin}, {Okouma}, {Ostman},\n  {Sako}, {Scalzo}, \\& {Smith}}]{sga+15}\n{Stanishev}, V., {Goobar}, A., {Amanullah}, R., {et~al.} 2015, ArXiv e-prints,\n  arXiv:1505.07707\n\n\\bibitem[{{Sternberg} {et~al.}(2014){Sternberg}, {Gal-Yam}, {Simon}, {Patat},\n  {Hillebrandt}, {Phillips}, {Foley}, {Thompson}, {Morrell}, {Chomiuk},\n  {Soderberg}, {Yong}, {Kraus}, {Herczeg}, {Hsiao}, {Raskutti}, {Cohen},\n  {Mazzali}, \\& {Nomoto}}]{sgs+14}\n{Sternberg}, A., {Gal-Yam}, A., {Simon}, J.~D., {et~al.} 2014, \\mnras, 443,\n  1849\n\n\\bibitem[{{Sullivan} {et~al.}(2011){Sullivan}, {Guy}, {Conley}, {Regnault},\n  {Astier}, {Balland}, {Basa}, {Carlberg}, {Fouchez}, {Hardin}, {Hook},\n  {Howell}, {Pain}, {Palanque-Delabrouille}, {Perrett}, {Pritchet}, {Rich},\n  {Ruhlmann-Kleider}, {Balam}, {Baumont}, {Ellis}, {Fabbro}, {Fakhouri},\n  {Fourmanoit}, {Gonz{\\'a}lez-Gait{\\'a}n}, {Graham}, {Hudson}, {Hsiao},\n  {Kronborg}, {Lidman}, {Mourao}, {Neill}, {Perlmutter}, {Ripoche}, {Suzuki},\n  \\& {Walker}}]{SGC2011}\n{Sullivan}, M., {Guy}, J., {Conley}, A., {et~al.} 2011, \\apj, 737, 102\n\n\\bibitem[{{Swartz} {et~al.}(1995){Swartz}, {Sutherland}, \\& {Harkness}}]{ssh95}\n{Swartz}, D.~A., {Sutherland}, P.~G., \\& {Harkness}, R.~P. 1995, \\apj, 446, 766\n\n\\bibitem[{{Thomas} {et~al.}(2011{\\natexlab{a}}){Thomas}, {Nugent}, \\&\n  {Meza}}]{tnm11}\n{Thomas}, R.~C., {Nugent}, P.~E., \\& {Meza}, J.~C. 2011{\\natexlab{a}}, \\pasp,\n  123, 237\n\n\\bibitem[{{Thomas} {et~al.}(2011{\\natexlab{b}}){Thomas}, {Aldering},\n  {Antilogus}, {Aragon}, {Bailey}, {Baltay}, {Bongard}, {Buton}, {Canto},\n  {Childress}, {Chotard}, {Copin}, {Fakhouri}, {Gangler}, {Hsiao},\n  {Kerschhaggl}, {Kowalski}, {Loken}, {Nugent}, {Paech}, {Pain}, {Pecontal},\n  {Pereira}, {Perlmutter}, {Rabinowitz}, {Rigault}, {Rubin}, {Runge}, {Scalzo},\n  {Smadja}, {Tao}, {Weaver}, {Wu}, {Brown}, {Milne}, \\& {Nearby Supernova\n  Factory}}]{taa+11}\n{Thomas}, R.~C., {Aldering}, G., {Antilogus}, P., {et~al.} 2011{\\natexlab{b}},\n  \\apj, 743, 27\n\n\\bibitem[{{Vink{\\'o}} {et~al.}(2012){Vink{\\'o}}, {S{\\'a}rneczky}, {Tak{\\'a}ts},\n  {Marion}, {Heged{\\\"u}s}, {B{\\'{\\i}}r{\\'o}}, {Borkovits}, {Szegedi-Elek},\n  {Farkas}, {Klagyivik}, {Kiss}, {Kov{\\'a}cs}, {P{\\'a}l}, {Szak{\\'a}ts},\n  {Szalai}, {Szalai}, {Szatm{\\'a}ry}, {Szing}, {Vida}, \\& {Wheeler}}]{vst+12}\n{Vink{\\'o}}, J., {S{\\'a}rneczky}, K., {Tak{\\'a}ts}, K., {et~al.} 2012, \\aap,\n  546, A12\n\n\\bibitem[{{Whelan} \\& {Iben}(1973)}]{wi73}\n{Whelan}, J., \\& {Iben}, Jr., I. 1973, \\apj, 186, 1007\n\n\\bibitem[{{Yamanaka} {et~al.}(2009){Yamanaka}, {Kawabata}, {Kinugasa},\n  {Tanaka}, {Imada}, {Maeda}, {Nomoto}, {Arai}, {Chiyonobu}, {Fukazawa},\n  {Hashimoto}, {Honda}, {Ikejiri}, {Itoh}, {Kamata}, {Kawai}, {Komatsu},\n  {Konishi}, {Kuroda}, {Miyamoto}, {Miyazaki}, {Nagae}, {Nakaya}, {Ohsugi},\n  {Omodaka}, {Sakai}, {Sasada}, {Suzuki}, {Taguchi}, {Takahashi}, {Tanaka},\n  {Uemura}, {Yamashita}, {Yanagisawa}, \\& {Yoshida}}]{ykk+09}\n{Yamanaka}, M., {Kawabata}, K.~S., {Kinugasa}, K., {et~al.} 2009, \\apjl, 707,\n  L118\n\n\\bibitem[{{Yaron} \\& {Gal-Yam}(2012)}]{YG2012}\n{Yaron}, O., \\& {Gal-Yam}, A. 2012, \\pasp, 124, 668\n\n\\bibitem[{{Yoon} \\& {Langer}(2005)}]{yl05}\n{Yoon}, S.-C., \\& {Langer}, N. 2005, \\aap, 435, 967\n\n\\bibitem[{{Yuan} {et~al.}(2010){Yuan}, {Quimby}, {Wheeler}, {Vink{\\'o}},\n  {Chatzopoulos}, {Akerlof}, {Kulkarni}, {Miller}, {McKay}, \\&\n  {Aharonian}}]{yqw+10}\n{Yuan}, F., {Quimby}, R.~M., {Wheeler}, J.~C., {et~al.} 2010, \\apj, 715, 1338\n\n\\bibitem[{{Zhou} {et~al.}(2013){Zhou}, {Wang}, {Zhang}, {Chen}, {Liang},\n  {Zhang}, {Zhou}, {Huang}, {sZhao}, {Wang}, {Zhang}, {Balam}, {Graham}, \\&\n  {Hsiao}}]{CBET3543}\n{Zhou}, L., {Wang}, X., {Zhang}, K., {et~al.} 2013, Central Bureau Electronic\n  Telegrams, 3543, 1\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 38714, "prevtext": "\nwhere $\\rho_{c,9}$ is $\\rho_c$ in units of $10^9\\,\\rm{g}\\,\\rm{cm}^{-3}$. In addition, we restrict the mass fraction $f_{\\rm{CO}}$ less than $10\\%$. \n\nBased on the above assumptions, with a given set of ejecta mass $M_{ej}$, central density $\\rho_c$ and the mass fractions of different elements, \nwe can calculate the maximum bolometric luminosity and $t_0$ in equation (\\ref{eq:lateTime}) and compare them with our measurements of iPTF13asv.\nAfter one million Markov-Chain-Monte-Carlo iterations, we obtain $M_{Ni}=0.81^{+0.10}_{-0.18}$ and $M_{ej}=1.44^{+0.44}_{-0.12}{M_\\odot}$ at a 95\\% \nconfidence level. \n\n\\subsection{Detached Shell Surrounding the SN}\n\nIn order to explain the almost constant \\ion{Si}{2} velocity in super-Chandrasekhar events, \\citet{saa+10} and \\citet{saa+12} hypothesize a stationary \nshell detached from the ejecta. The shell is accelerated to a constant speed $v_{sh}$ by colliding with fast-moving ejecta with velocities greater than $v_{sh}$. \nIn fact, some simulations of WD mergers show that the outermost material forms such a stationary envelope that collides with fast-moving ejecta \\citep{hk96}. \nFollowing the calculation procedure in \\citet{saa+10} and \\citet{saa+12}, we derive an envelope mass of $0.15^{+0.11}_{-0.01}{M_\\odot}$ for iPTF13asv. \n\nThough the detached shell has little effect on the $\\gamma$-ray opacity and peak luminosity of a SN, it reddens the SN and extends its rise time. \nHowever, compared to other super-Chandrasekhar events \\citep{saa+12}, iPTF13asv shows a blue intrinsic color and a much shorter rise time. \nBased on the color and rise time, we infer that iPTF13asv is unlikely to have this detached shell. \n\n\\section{Discussions}\n\\label{sec:discussion}\n\n\n\\subsection{Comparison To Super-Chandrasekhar And Normal Events}\nIn Table \\ref{tab:comparison}, we compare iPTF13asv against both super-Chandrasekhar and normal Type {\\uppercase\\expandafter{\\romannumeral {1}\\relax}}a SNe. \nIn addition to the features listed in the table, the H-band break, which is formed by absorption of \\ion{Fe}{2}, \\ion{Co}{2} and \\ion{Ni}{2} \\citep{hmp+13}, \nis distinctive between super-Chandrasekhar and normal events. The break usually appears in normal SNe within a month of maximum, but is \nabsent in the super-Chandrasekhar events. However, in the case of iPTF13asv, the only near-IR spectrum is taken one month after the maximum,\nand is therefore not constraining to the existence of the H-band break. \n\nAs can be seen from the table, on the one hand, the over-luminous iPTF13asv has a normal lightcurve shape and near-IR secondary peak. On the\nother hand, like super-Chandrasekhar events, iPTF13asv shows persistent \\ion{C}{2} absorption and low expansion velocity with little evolution. \nWhile the derived $^{56}$Ni mass is higher in iPTF13asv than in normal events, the total ejecta mass is close to the Chandrasekhar limit. \n\nWe further examine whether iPTF13asv follows the empirical relation between the peak magnitude, the lightcurve shape and the intrinsic color, i.e., \n\n", "index": 11, "text": "\\begin{equation}\n\\mu=m_B^*-(M_B-\\alpha x_1+\\beta c)\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\mu=m_{B}^{*}-(M_{B}-\\alpha x_{1}+\\beta c)\\ ,\" display=\"block\"><mrow><mrow><mi>μ</mi><mo>=</mo><mrow><msubsup><mi>m</mi><mi>B</mi><mo>*</mo></msubsup><mo>-</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>M</mi><mi>B</mi></msub><mo>-</mo><mrow><mi>α</mi><mo>⁢</mo><msub><mi>x</mi><mn>1</mn></msub></mrow></mrow><mo>+</mo><mrow><mi>β</mi><mo>⁢</mo><mi>c</mi></mrow></mrow><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]