[{"file": "1601.02669.tex", "nexttext": "\nIn Fig. \\ref{fig_f0}c we report the experimental values of $M_{0,n}$ for the first modes, derived from the areas $A_{0n}$ of the thermal peaks in the displacement spectrum using $A_{0n}= \\frac{k_B \\mathrm{T}_K}{M_{0m} (2 \\pi f_{0n})^2}$ ($k_B$ is the Boltzmann constant and T$_K$ the temperature). They are compared with the theoretical values calculated for a realistic $w=0.15$~mm (showing a good agreement) and with a pointlike readout.\n\n\n\nThe mechanical quality factor $Q$ of the modes of different membranes has been measured both at room and at cryogenic temperatures, by driving the different resonances with a piezoelectric glued on the sample mount, and observing the ring-down with a Michelson interferometer. At room temperature, the $Q$ values are very scattered, ranging from few thousands up to $2\\times 10^5$. This feature is very common in SiN$_x$ membranes, and is due to the coupling with the frame and, through it, with the sample holder. At cryogenic temperatures, the values of $Q$ are still scattered, but globally higher. With a 1.5~mm diameter membrane on a 5~mm side, square frame clamped between two copper plates, we could measure a maximum $Q$ of $0.65\\times10^6$, at 8~K. With a 1~mm side, square membrane close to the edge of a $5 \\times 20$~mm$^2$ frame, glued on the opposite edge to a copper block, we could measure $Q$ values up to $1.3 \\times 10^6$ at 13~K. Such results are comparable with those commonly obtained with commercial, high-stress SiN$_x$ membranes and confirm the validity of our fabrication procedure, while stressing the importance of engineered frames and holders.\n\nWe characterized the optical properties of a circular membrane of nominal radius $R = 0.6$~mm by first performing VASE measurements soon after its fabrication, obtaining the following values for the membrane thickness, $L_d = 97.27 \\pm 0.01$ nm, index of refraction at $\\lambda = 1064 $ nm $n_R = 2.0210 \\pm 0.0005$. \nThese values have been confirmed by polarization-resolved transmission measurements again at $\\lambda = 1064 $ nm, performed on the final, diced samples. These latter measurements provide an intensity reflectivity at normal incidence $ |r_d|^2 = 0.355 \\pm 0.002$, perfectly consistent with the expression for the amplitude reflection and transmission coefficients of a dielectric membrane of thickness $L_d$ and refractive index $n$,\n\n\\begin{eqnarray} \\label{eq:r_d}\n\tr_d =  \\frac{(n^2 -1)\\sin\\beta}{2in\\cos\\beta + (n^2 +1)\\sin\\beta},  \\\\\n\tt_d = \\,\\frac{2n}{2in\\cos\\beta + (n^2 +1)\\sin\\beta}\\,,\\label{eq:t_d}\n\\end{eqnarray}\nwhere $\\beta = n kL_d = 2\\pi n L_d/\\lambda$. When $n=n_R$ is real there is no optical absorption, but in general $n = n_R+i n_I$, with the small but nonzero imaginary part $n_I$ providing a measure of optical absorption. In order to accurately evaluate it, we have placed\nthe membrane between two Al cylinders, and we have inserted it in a $L=9.03$~cm long cavity at room temperature formed by two spherical mirrors of radius of curvature $7.5$~cm.\n\nThe high-frequency component of the Pound-Drever-Hall (PDH) signal used to lock the cavity was acquired for the preliminary analysis of the mechanical modes at a vacuum chamber pressure of $1.7\\times10^{-2}$~mbar. The fundamental eigenfrequency is found to be $\\nu_{01}\\sim 348.5$~kHz, consistent with the theoretical expectation if we assume $R = 0.615$~mm.\n\nThe detected optical cavity modes as a function of the membrane position are also consistent with the theoretical model~\\cite{Jayich:2008nx,Biancofiore:2011uq} obtained with the cavity and membrane parameters. \nFinally the cavity finesse, ${\\mathcal F}_T$, as a function of the membrane position has been measured (see Fig.~\\ref{fig:Finesse_Scattering_FIT}) by the ringdown technique. The laser beam, deflected by an acousto-optic-modulator (AOM) and sent into the cavity, is switched off in 50~ns after the transmitted light has reached a threshold level. The leakage of transmitted light is monitored to estimate the cavity decay-time, which is fitted with a single exponential form whose time constant, $\\tau$, is related to ${\\mathcal F}_T$ via ${\\mathcal F}_T = \\pi c \\tau/ L$. Repeating the finesse measurement for different positions of the membrane as reported in Fig.~\\ref{fig:Finesse_Scattering_FIT}, allows to estimate $n_I$ and the roughness of the membrane.\n\n\\begin{figure}[!t]\n\\includegraphics[width=86mm]{figure03.ps}\n\\caption{Plot of the cavity finesse, ${\\mathcal F}_T$ versus membrane position along the cavity axis.\n    Red-symbols represent data for a circular-membrane, 1.2~mm diameter, and 97~nm thickness.\n    Red-line represents the best fit with fitting parameters $n_I = (1.97\\pm 0.08)\\times 10^{-6}$ and {$\\sigma_{\\textrm{opt}} =(287 \\pm 4)\\,$}pm, and with the following fixed parameters: the membrane thickness $L_d = 97$~nm, the real part of the {refractive index} $n_R = 2.021$, the cavity length $L = 9.03$~cm, the wavelength $\\lambda = 1064$~nm, and the empty-cavity finesse ${\\mathcal F}_v = 53518$, which is evaluated as mean value of the data shown as blue-symbols.\n    Green-symbols represents data for a square-membrane, 1~mm side, 50~nm thickness by Norcada, The green-line is the fitting with parameters {$n_I = (1.0 \\pm 0.01)\\times 10^{-5}$} and {$\\sigma_{\\textrm{opt}} =  (280 \\pm 10)\\,$}pm.\n\\label{fig:Finesse_Scattering_FIT}   }    \n\\end{figure}\n\nFor fitting the finesse data we consider the transfer function of a cavity with a membrane in the middle. The cavity consists of two semi-cavities;\ndenoting with $z$ the position of the membrane with respect to the cavity center, and assuming for the reflection and transmission coefficients of the mirrors $r_1 = r_2 =\\sqrt{{\\mathcal R}}$ and  $t_1 = t_2 = \\sqrt{{\\mathcal T}}$, we derive the following expression for the intensity transmission of the cavity,\n\n", "itemtype": "equation", "pos": 12875, "prevtext": "\n\\hyphenation{mo-des}\n\\title{Microfabrication of large area high-stress silicon nitride membranes for\noptomechanical devices}\n\n\\author{E. Serra}\n\\affiliation{Istituto Nazionale di Fisica Nucleare, TIFPA, 38123 Povo (TN), Italy}\n\\affiliation{Delft University of Technology, Else Kooi Laboratory, 2628 Delft, The Netherlands}\n\n\\author{M. Bawaj}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\\affiliation{INFN, Sezione di Perugia, 06123, Perugia, Italy}\n\n\\author{A. Borrielli}\n\\affiliation{Istituto Nazionale di Fisica Nucleare, TIFPA, 38123 Povo (TN), Italy}\n\\affiliation{\\mbox{Institute of Materials for Electronics and Magnetism, Nanoscience-Trento-FBK Division, 38123 Povo (TN), Italy}}\n\n\\author{G. Di Giuseppe}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\\affiliation{INFN, Sezione di Perugia, 06123, Perugia, Italy}\n\n\\author{S. Forte}\n\\affiliation{Delft University of Technology, Else Kooi Laboratory, 2628 Delft, The Netherlands}\n\\affiliation{Dipartimento di Fisica, Universit\\`a di Trento, 38123 Povo (TN), Italy}\n\n\\author{N. Kralj}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\n\\author{N. Malossi}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\\affiliation{INFN, Sezione di Perugia, 06123, Perugia, Italy}\n\n\\author{L. Marconi}\n\\affiliation{\\mbox{Dipartimento di Fisica e Astronomia, Universit\\`a di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}}\n\\affiliation{INFN, Sezione di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}\n\n\\author{F. Marin}\n\\affiliation{LENS, Via Carrara 1, 50019 Sesto Fiorentino (FI), Italy}\n\\affiliation{\\mbox{Dipartimento di Fisica e Astronomia, Universit\\`a di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}}\n\\affiliation{INFN, Sezione di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}\n\n\\author{F. Marino}\n\\affiliation{INFN, Sezione di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}\n\\affiliation{CNR-INO, L.go Enrico Fermi 6, 50125 Firenze, Italy}\n\n\\author{B. Morana}\n\\affiliation{Delft University of Technology, Else Kooi Laboratory, 2628 Delft, The Netherlands}\n\n\\author{R. Natali}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\\affiliation{INFN, Sezione di Perugia, 06123, Perugia, Italy}\n\n\\author{G. Pandraud}\n\\affiliation{Delft University of Technology, Else Kooi Laboratory, 2628 Delft, The Netherlands}\n\n\\author{A. Pontin}\n\\affiliation{\\mbox{Dipartimento di Fisica e Astronomia, Universit\\`a di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}}\n\\affiliation{INFN, Sezione di Firenze, Via Sansone 1, 50019 Sesto Fiorentino (FI), Italy}\n\n\\author{G.A.  Prodi}\n\\affiliation{Istituto Nazionale di Fisica Nucleare, TIFPA, 38123 Povo (TN), Italy}\n\\affiliation{Dipartimento di Fisica, Universit\\`a di Trento, 38123 Povo (TN), Italy}\n\n\\author{M. Rossi}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\n\\author{P.M. Sarro}\n\\affiliation{Delft University of Technology, Else Kooi Laboratory, 2628 Delft, The Netherlands}\n\n\n\\author{D. Vitali}\n\\affiliation{\\mbox{Physics Division, School of Science and Technology, Universit\\`a di Camerino, 62032 Camerino (MC), Italy}}\n\\affiliation{INFN, Sezione di Perugia, 06123, Perugia, Italy}\n\n\\author{M. Bonaldi}\n\\email[Corresponding author: ]{bonaldi@science.unitn.it}\n\\affiliation{Istituto Nazionale di Fisica Nucleare, TIFPA, 38123 Povo (TN), Italy}\n\\affiliation{\\mbox{Institute of Materials for Electronics and Magnetism, Nanoscience-Trento-FBK Division, 38123 Povo (TN), Italy}}\n\n\\begin{abstract}\n\n{In view of the integration of membrane resonators with more complex MEMS structures, we developed a general fabrication procedure for circular shape SiN$_x$ membranes using Deep Reactive Ion Etching (DRIE). Large area and high-stress SiN$_x$ membranes were fabricated and used as optomechanical resonators in a Michelson interferometer and in a Fabry-P$\\acute{\\textrm{e}}$rot cavity. The measurements show that the fabrication process preserves both the optical quality and the mechanical quality factor of the membrane.}\n\\end{abstract}\n\n\n                             \n\n                              \n\n\\maketitle\n\n{The optomechanical coupling between a laser beam and a microdevice via radiation pressure \\cite{optomechanicsRMP2014} is of great interest in quantum-optics and fundamental research. In fact, the latest micro- and nano-mechanical resonators, when used in a high-finesse Fabry-P$\\acute{\\textrm{e}}$rot optical cavity, offer great potential for precision sensing\\cite{Purdy_Science_2013,bawajNComms2015} and for manipulation of the quantum state of light\\cite{Safavi-Naeini_2013,Purdy_PRX2013}. \n\nIn many cases the resonators consist of a free-standing high-stress silicon nitride (SiNx) membrane supported by a silicon (Si) frame, where Q-frequency product above $10^{13}$ Hz can be obtained\\cite{WilsonPRL2009}  thanks to the large tensile stress (of the order of GPa).\nThese setups usually exploit dispersive coupling of the dielectric membrane placed in an optical cavity \\cite{ThompsonNature2008}, but there are a number of ongoing efforts to extend the capabilities of SiN$_x$ membrane resonators, for instance by coating them with a metal for use in hybrid optical-microwave setups \\cite{Andrews2014} or by enhancing optomechanical coupling by patterning of photonic crystal structures\\cite{bui}. We also mention recent studies aiming to understand and possibly overcome the current limits in their mechanical performance \\cite{VillanuevaPRL2014}.\n\nLarge area  free-standing silicon nitride membranes were originally proposed as TEM windows.\nGenerally, these are fabricated on a silicon (Si) support by low pressure chemical vapour deposition (LPCVD) and then released by wet etching the Si substrate. For this last step  potassium hydroxide (KOH) solutions are typically employed. However, this etching is highly selective along silicon crystal planes and allows precise control of dimensions only if the desired structure can be bounded by $<111>$ planes \\cite{Leondes}, as in rectangular membranes. On the other hand the integration of the resonator in complex microsystems requires a greater flexibility in terms of layout. \n\nIn this paper we describe a general fabrication procedure based on Deep Reactive Ion Etching (DRIE) through-wafer etching. The use of DRIE is really advantageous as it allows the fabrication of any-shape membranes. For example circular membranes have been shown to have superior mechanical properties\\cite{Wilson-RaePRL2011}. At the same time DRIE enables the fabrication of complex hybrid system around the membrane. This is required to ease the integration of the SiN$_x$ membrane with on-chip mechanical isolation, useful for improving the overall reproducibility of the resonator by reducing the mechanical coupling with the sample holder. We remark that this strategy has recently allowed the production of optomechanical microresonators where quality factors higher than 10$^6$ can reproducibly be obtained for specifically designed normal modes \\cite{SerraAPL2012,BorrielliPRApplied2015}. So far SiN$_x$ resonators suspended from phononic band-gap isolation structures have been built by combining DRIE with a wet etch release of the SiN$_x$ layer, but the process could not attain an optimal control of the membrane cleanliness \\cite{YuAPL2014,TsaturyanOE2014}.\nIn our case, a complete characterization shows that the main mechanical and optical features of the resonator are preserved for a lot of circular membranes. \n\nMembranes were fabricated following the steps shown in Figure \\ref{fig:process}. As substrate we employed a double-side-polished Si wafer with a thickness of 500 $\\mu$m and a RMS surface roughness lower than 1 nm. \nAfter standard cleaning by $\\rm 99 \\%$ and $\\rm 65 \\%$  $\\rm H NO_3$ baths followed by DI-water rinse steps, a LPCVD 200-nm-thick  tetraethylorthosilicate (TEOS)  SiO$_2$ layer was deposited on the silicon substrate (step 1). This layer has a low compressive stress and is used as etching stop for the DRIE process.\nA 100-nm-thick LPCVD nitride ($\\rm SiN_x$) layer was then deposited (step 2) after optimizing\\cite{Sarro} the recipe for a residual tensile stress of about 1 GPa having a refractive index at 1064 nm of $\\rm n=2.021$.\nThese properties were obtained by laser-based wafer curvature measurements (Flexus FLX-2908) and by variable angle spectroscopic ellipsometry (VASE), respectively. \nAfter the back-side etching (step 3),  a low-stress 1-$\\rm \\mu m$-thick layer of pure $\\rm Al$ was sputtered at $25 \\;^{\\circ}{\\rm C}$ (step 4) to protect the $\\rm SiN_x$  during the DRIE step. \nWe used a plasma enhanced chemical vapour deposition (PECVD) 6-$\\rm \\mu m$-thick $\\rm SiO_2$ layer (step 5), patterned with circular holes (step 6-7), as masking layer for the substrate etching. \nThe Si was then removed (step 8) by means of DRIE (Omega i2L Rapier).\nThe resulting etching rates were about 1.38 $\\rm \\mu m/cycle$ for $\\rm Si$ and 5 $\\rm nm/cycle$ for the oxide layer. To release the SiN$_x$ layer we first stripped the $\\rm Al$ layer (step 9) by a PES   solution, followed by a dip etching (step 10) in HF solution. The wafer is then rinsed in DI-water and diced.\n}\n\n\\begin{figure}[!t]\n\\includegraphics[width=86mm]{figure01.ps}\n\\caption{1-10) Fabrication steps. 11) Section view of the finished device. 12) Optical microscope image of a circular membrane of diameter 1.5 mm.  \n\\label{fig:process}}    \n\\end{figure}\n\n\nWe focus the analysis of the mechanical resonance frequencies on the circular membranes, due to their original shape with respect to the more common square membranes. The theoretical resonance frequencies in a circular membrane are given by the expression\n$\nf_{mn} = f_0\\,\\alpha_{mn}\n$\nwhere $\\alpha_{mn}$ is the $n$-th root of the Bessel polynomial of order $m$, and\n$\nf_{0} = \\frac{1}{2 \\pi}\\, \\sqrt{\\frac{T}{\\rho}}\\frac{1}{R}\n\n$\n($T$ is the stress, $\\rho$ the density, $R$ the radius of the membrane). We have measured the modal frequencies from a thermal spectrum acquired using a Michelson interferometer (Fig. \\ref{fig_f0}a), with the sample kept in a vacuum chamber. In Fig. \\ref{fig_f0}b we show the experimental resonance frequencies divided by the respective $\\alpha_{mn}$, for the first $m=0$ and $m=1$ order modes. We expect a constant value, equal to $f_0$. It appears that the lower modes slightly (but systematically) deviate from the predicted behavior, with a maximum spread of just $4\\%$, probably due to boundary effects, likely influenced by the clamping. We can extrapolate an asymptotic experimental value of $f_0 \\simeq 114$ kHz, to be compared with $f_0 = 118.6$~kHz that is calculated using the nominal parameters $R = 0.75$~mm, $T = 1$~GPa and $\\rho = 3200$~kg/m$^3$. The agreement is very good. We also remark that measurements taken at different times (entailing few degrees variations of the room temperature) yield fluctuations of the experimental $f_0$ by $2\\div3 \\%$.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=86mm]{figure02.ps}\n\\caption{a) Typical noise power spectral density (PSD) of the interferometer output; the modal frequencies can be clearly seen above background noise. b) Resonance frequencies of the first $0n$ (open circles) and $1m$ (stars) modes af a $R=0.75$ mm circular membrane, divided by the respective $\\alpha_{mn}$. c) Experimental effective mass $M_{0n}$ of the first modes (crosses), theoretical values calculated for a centered Gaussian readout with width $w=0.15$ mm (closed circles) and for a pointlike readout (triangles).\n\\label{fig_f0}}\n\\end{figure}\n\n\nAn interesting property of the circular membrane is that the effective modal mass depends on the modal index, as opposed to the square membranes. Namely, the effective mass of the $0n$ modes for a centered,  $\\delta-$like readout is $M_{0n} = M \\left(J_1\\left(\\alpha_{0n}\\right)\\right)^2$, where $M$ is the physical mass of the membrane and $J_m$ is the Bessel polynomial (the first values of $M_{0n}/M$ are 0.269, 0.116, 0.074, 0.054, 0.043). The mass is lower at higher index because the modal displacement is more concentrated in the center, while it remains homogeneous for a square membrane. For comparison, in the case of a square membrane the effective mass of the odd modes is $M/4$. A reduced effective mass, increasing the susceptibility, is a useful property in opto-mechanics experiments. In the realistic case of a centered, Gaussian readout with 1/e$^2$ width $w$, the effective mass becomes:\n\n", "index": 1, "text": "\\begin{equation}\nM_{0,n} = M \\left(\\frac{J_1\\left(\\alpha_{0n}\\right)}{\\frac{4}{w^2}\\int J_0 \\left(\\alpha_{0n}r/R\\right) \\exp \\left(\\frac{2 r^2}{w^2}\\right) r \\mathrm{d}r}\\right)^2  \\, .\n\\label{Meff}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"M_{0,n}=M\\left(\\frac{J_{1}\\left(\\alpha_{0n}\\right)}{\\frac{4}{w^{2}}\\int J_{0}%&#10;\\left(\\alpha_{0n}r/R\\right)\\exp\\left(\\frac{2r^{2}}{w^{2}}\\right)r\\mathrm{d}r}%&#10;\\right)^{2}\\,.\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mrow><mn>0</mn><mo>,</mo><mi>n</mi></mrow></msub><mo>=</mo><mrow><mi>M</mi><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo>(</mo><mfrac><mrow><msub><mi>J</mi><mn>1</mn></msub><mo>⁢</mo><mrow><mo>(</mo><msub><mi>α</mi><mrow><mn>0</mn><mo>⁢</mo><mi>n</mi></mrow></msub><mo>)</mo></mrow></mrow><mrow><mfrac><mn>4</mn><msup><mi>w</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>J</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><msub><mi>α</mi><mrow><mn>0</mn><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><mi>r</mi></mrow><mo>/</mo><mi>R</mi></mrow><mo>)</mo></mrow><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msup><mi>r</mi><mn>2</mn></msup></mrow><msup><mi>w</mi><mn>2</mn></msup></mfrac><mo>)</mo></mrow></mrow><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mrow><mo>d</mo><mi>r</mi></mrow></mrow></mrow></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02669.tex", "nexttext": "\n\nIn the ideal case ${\\mathcal R} = 1$ and $n$ is real, so that $t_d^2 +r_d^2 = \\exp\\left\\{2i\\arg(r_d)\\right\\}=\\exp\\left\\{2i\\phi_r\\right\\}$, the eigenfrequencies of the cavity modes are given by the zeros of the denominator of the cavity transmission\n\n\n", "itemtype": "equation", "pos": 18910, "prevtext": "\nIn Fig. \\ref{fig_f0}c we report the experimental values of $M_{0,n}$ for the first modes, derived from the areas $A_{0n}$ of the thermal peaks in the displacement spectrum using $A_{0n}= \\frac{k_B \\mathrm{T}_K}{M_{0m} (2 \\pi f_{0n})^2}$ ($k_B$ is the Boltzmann constant and T$_K$ the temperature). They are compared with the theoretical values calculated for a realistic $w=0.15$~mm (showing a good agreement) and with a pointlike readout.\n\n\n\nThe mechanical quality factor $Q$ of the modes of different membranes has been measured both at room and at cryogenic temperatures, by driving the different resonances with a piezoelectric glued on the sample mount, and observing the ring-down with a Michelson interferometer. At room temperature, the $Q$ values are very scattered, ranging from few thousands up to $2\\times 10^5$. This feature is very common in SiN$_x$ membranes, and is due to the coupling with the frame and, through it, with the sample holder. At cryogenic temperatures, the values of $Q$ are still scattered, but globally higher. With a 1.5~mm diameter membrane on a 5~mm side, square frame clamped between two copper plates, we could measure a maximum $Q$ of $0.65\\times10^6$, at 8~K. With a 1~mm side, square membrane close to the edge of a $5 \\times 20$~mm$^2$ frame, glued on the opposite edge to a copper block, we could measure $Q$ values up to $1.3 \\times 10^6$ at 13~K. Such results are comparable with those commonly obtained with commercial, high-stress SiN$_x$ membranes and confirm the validity of our fabrication procedure, while stressing the importance of engineered frames and holders.\n\nWe characterized the optical properties of a circular membrane of nominal radius $R = 0.6$~mm by first performing VASE measurements soon after its fabrication, obtaining the following values for the membrane thickness, $L_d = 97.27 \\pm 0.01$ nm, index of refraction at $\\lambda = 1064 $ nm $n_R = 2.0210 \\pm 0.0005$. \nThese values have been confirmed by polarization-resolved transmission measurements again at $\\lambda = 1064 $ nm, performed on the final, diced samples. These latter measurements provide an intensity reflectivity at normal incidence $ |r_d|^2 = 0.355 \\pm 0.002$, perfectly consistent with the expression for the amplitude reflection and transmission coefficients of a dielectric membrane of thickness $L_d$ and refractive index $n$,\n\n\\begin{eqnarray} \\label{eq:r_d}\n\tr_d =  \\frac{(n^2 -1)\\sin\\beta}{2in\\cos\\beta + (n^2 +1)\\sin\\beta},  \\\\\n\tt_d = \\,\\frac{2n}{2in\\cos\\beta + (n^2 +1)\\sin\\beta}\\,,\\label{eq:t_d}\n\\end{eqnarray}\nwhere $\\beta = n kL_d = 2\\pi n L_d/\\lambda$. When $n=n_R$ is real there is no optical absorption, but in general $n = n_R+i n_I$, with the small but nonzero imaginary part $n_I$ providing a measure of optical absorption. In order to accurately evaluate it, we have placed\nthe membrane between two Al cylinders, and we have inserted it in a $L=9.03$~cm long cavity at room temperature formed by two spherical mirrors of radius of curvature $7.5$~cm.\n\nThe high-frequency component of the Pound-Drever-Hall (PDH) signal used to lock the cavity was acquired for the preliminary analysis of the mechanical modes at a vacuum chamber pressure of $1.7\\times10^{-2}$~mbar. The fundamental eigenfrequency is found to be $\\nu_{01}\\sim 348.5$~kHz, consistent with the theoretical expectation if we assume $R = 0.615$~mm.\n\nThe detected optical cavity modes as a function of the membrane position are also consistent with the theoretical model~\\cite{Jayich:2008nx,Biancofiore:2011uq} obtained with the cavity and membrane parameters. \nFinally the cavity finesse, ${\\mathcal F}_T$, as a function of the membrane position has been measured (see Fig.~\\ref{fig:Finesse_Scattering_FIT}) by the ringdown technique. The laser beam, deflected by an acousto-optic-modulator (AOM) and sent into the cavity, is switched off in 50~ns after the transmitted light has reached a threshold level. The leakage of transmitted light is monitored to estimate the cavity decay-time, which is fitted with a single exponential form whose time constant, $\\tau$, is related to ${\\mathcal F}_T$ via ${\\mathcal F}_T = \\pi c \\tau/ L$. Repeating the finesse measurement for different positions of the membrane as reported in Fig.~\\ref{fig:Finesse_Scattering_FIT}, allows to estimate $n_I$ and the roughness of the membrane.\n\n\\begin{figure}[!t]\n\\includegraphics[width=86mm]{figure03.ps}\n\\caption{Plot of the cavity finesse, ${\\mathcal F}_T$ versus membrane position along the cavity axis.\n    Red-symbols represent data for a circular-membrane, 1.2~mm diameter, and 97~nm thickness.\n    Red-line represents the best fit with fitting parameters $n_I = (1.97\\pm 0.08)\\times 10^{-6}$ and {$\\sigma_{\\textrm{opt}} =(287 \\pm 4)\\,$}pm, and with the following fixed parameters: the membrane thickness $L_d = 97$~nm, the real part of the {refractive index} $n_R = 2.021$, the cavity length $L = 9.03$~cm, the wavelength $\\lambda = 1064$~nm, and the empty-cavity finesse ${\\mathcal F}_v = 53518$, which is evaluated as mean value of the data shown as blue-symbols.\n    Green-symbols represents data for a square-membrane, 1~mm side, 50~nm thickness by Norcada, The green-line is the fitting with parameters {$n_I = (1.0 \\pm 0.01)\\times 10^{-5}$} and {$\\sigma_{\\textrm{opt}} =  (280 \\pm 10)\\,$}pm.\n\\label{fig:Finesse_Scattering_FIT}   }    \n\\end{figure}\n\nFor fitting the finesse data we consider the transfer function of a cavity with a membrane in the middle. The cavity consists of two semi-cavities;\ndenoting with $z$ the position of the membrane with respect to the cavity center, and assuming for the reflection and transmission coefficients of the mirrors $r_1 = r_2 =\\sqrt{{\\mathcal R}}$ and  $t_1 = t_2 = \\sqrt{{\\mathcal T}}$, we derive the following expression for the intensity transmission of the cavity,\n\n", "index": 3, "text": "\\begin{equation}\\label{transm}\n{\\mathcal T}_c  = \\frac{\\left|{\\mathcal T}t_d\\right|^2}{\\left|1+2r_d\\sqrt{{\\mathcal R}} \\cos( 2kz){\\rm e}^{ikL} + {\\mathcal R}(t_d^2 +r_d^2) {\\rm e}^{2ikL}\\right|^2}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{\\mathcal{T}}_{c}=\\frac{\\left|{\\mathcal{T}}t_{d}\\right|^{2}}{\\left|1+2r_{d}%&#10;\\sqrt{{\\mathcal{R}}}\\cos(2kz){\\rm e}^{ikL}+{\\mathcal{R}}(t_{d}^{2}+r_{d}^{2}){%&#10;\\rm e}^{2ikL}\\right|^{2}}\\,.\" display=\"block\"><mrow><mrow><msub><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mi>c</mi></msub><mo>=</mo><mpadded width=\"+1.7pt\"><mfrac><msup><mrow><mo>|</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒯</mi><mo>⁢</mo><msub><mi>t</mi><mi>d</mi></msub></mrow><mo>|</mo></mrow><mn>2</mn></msup><msup><mrow><mo>|</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>r</mi><mi>d</mi></msub><mo>⁢</mo><msqrt><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi></msqrt><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>L</mi></mrow></msup></mrow><mo>+</mo><mrow><mi class=\"ltx_font_mathcaligraphic\">ℛ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>t</mi><mi>d</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>r</mi><mi>d</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msup><mi mathvariant=\"normal\">e</mi><mrow><mn>2</mn><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>L</mi></mrow></msup></mrow></mrow><mo>|</mo></mrow><mn>2</mn></msup></mfrac></mpadded></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02669.tex", "nexttext": "\n\nwhich gives the results in Ref.~\\cite{Jayich:2008nx}\n\n\n", "itemtype": "equation", "pos": 19376, "prevtext": "\n\nIn the ideal case ${\\mathcal R} = 1$ and $n$ is real, so that $t_d^2 +r_d^2 = \\exp\\left\\{2i\\arg(r_d)\\right\\}=\\exp\\left\\{2i\\phi_r\\right\\}$, the eigenfrequencies of the cavity modes are given by the zeros of the denominator of the cavity transmission\n\n\n", "index": 5, "text": "\\begin{equation}\\label{eq1}\n[\\cos(kL +\\phi_r) + |r_d| \\cos( 2kz)]^2 =  0\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"[\\cos(kL+\\phi_{r})+|r_{d}|\\cos(2kz)]^{2}=0\\,,\" display=\"block\"><mrow><mrow><msup><mrow><mo stretchy=\"false\">[</mo><mrow><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>k</mi><mo>⁢</mo><mi>L</mi></mrow><mo>+</mo><msub><mi>ϕ</mi><mi>r</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">|</mo><msub><mi>r</mi><mi>d</mi></msub><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mn>2</mn></msup><mo>=</mo><mpadded width=\"+1.7pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02669.tex", "nexttext": "\n\nWhen $\\mathcal{R} < 1$ and in the presence of absorption the resonance frequencies of the cavity modes are determined by the maxima of the transmission ${\\mathcal T}_c $ given by Eq.~(\\ref{transm}), and the finesse can be obtained from the width of the transmission peaks.\nRoughness can be introduced following Refs.~\\cite{Kleckner:2010,Winkler:1994,virgo}, according to which any optical element with a given roughness is responsible for a modification of the wavefront and therefore leads to a scattering loss from the incident optical mode into all the other cavity modes. This scattering into other modes induced by an {effective optical roughness $\\sigma_{\\textrm{opt}}$ can be modeled by including a factor $\\sqrt{\\exp[-(2k\\sigma_{\\textrm{opt}})^2]}$ multiplying $r_d$ in eq.~\\eqref{eq:r_d}.}\n\nFig.~\\ref{fig:Finesse_Scattering_FIT} shows the best fits for the set of data (red symbols) taken for the 1.2~mm--diameter circular membranes. We have taken $n_I$ and {$\\sigma_{\\textrm{opt}}$} as fitting parameters, while we have kept fixed all the other parameters ($L_d = 97$~nm, $n_R = 2.021$, $L = 9.03$~cm, $\\lambda = 1064$~nm, and ${\\mathcal F}_v = 53518$ corresponding to ${\\mathcal R}=0.9999413$).  Both absorption and roughness give a $z$-dependent effect, with a $\\lambda/4$ periodicity. The fit gives an imaginary part of the {refractive index} $n_i = (1.97\\pm 0.08)\\times 10^{-6}$ and {$\\sigma_{\\textrm{opt}} =(287 \\pm 4)\\,$}pm. As a comparison, the results for a 1~mm side, 50~nm thickness membrane by Norcada~\\cite{norcada} are reported with fitting parameters {$n_I = (1.0 \\pm 0.01)\\times 10^{-5}$} and {$\\sigma_{\\textrm{opt}} =$  $(280 \\pm 10)\\,$}pm. The circular membranes we fabricated present {a similar effective optical roughness with respect to a commercial square one but a lower absorption. As regards standard AFM measurement of roughness, we measured for our membranes $\\sigma_{\\textrm{rms}}= 0.7 \\pm 0.1\\,$nm over scan areas of 1$\\mu$m$\\times 1\\mu$m.}\n\nIn conclusion, we developed and validated a general fabrication procedure for free-standing large area high-stress SiN$_x$ membranes of any shape with a good dimensional precision by using DRIE etching. \nPossible improvements of the process could be obtained by the use of silicon substrates with a lower initial roughness. This work is a crucial step toward the integration of SiN$_x$ membranes in hybrid systems and on-chip mechanical isolation.\n\n\n\n\\begin{thebibliography}{99}\n\n\\bibitem{optomechanicsRMP2014} M. Aspelmeyer, T.J. Kippenberg, and F. Marquardt,\n\nRev. Mod. Phys. \\textbf{86}, 1391 (2014).\n\n\\bibitem{Purdy_Science_2013} T.P. Purdy, R.W. Peterson, and C.A. Regal,\n\nScience \\textbf{339}, 801 (2013).\n\n\\bibitem{bawajNComms2015}\nM. Bawaj, C. Biancofiore, M. Bonaldi, F. Bonfigli, A. Borrielli, G. Di Giuseppe, L. Marconi, F. Marino, R. Natali, A. Pontin, G.A. Prodi, E. Serra, D. Vitali, and F. Marin,\n\nNat. Commun. \\textbf{6}:7503 (2015).\n\n\\bibitem{Safavi-Naeini_2013} A.H. Safavi-Naeini, S. Groblacher, J.T. Hill, J. Chan, M. Aspelmeyer, and O. Painter,\n\nNature  \\textbf{500}, 185 (2013).\n\n\\bibitem{Purdy_PRX2013} T.P. Purdy, P.-L. Yu, R.W. Peterson, N.S. Kampel, and C.A. Regal,\n\nPhys. Rev. X \\textbf{3}, 031012 (2013).\n\n\\bibitem{WilsonPRL2009}\nD.J. Wilson, C.A. Regal, S.B. Papp, and H.J. Kimble,\n\nPhys. Rev. Lett. \\textbf{103}, 207204 (2009).\n\n\\bibitem{ThompsonNature2008}\nJ.D. Thompson, B.M. Zwickl, A.M. Jayich, Florian Marquardt, S.M. Girvin, and J.G.E. Harris,\n\nNature \\textbf{452}, 72-75 (2008).\n\n\\bibitem{Andrews2014}R.W. Andrews, R.W. Peterson, T.P. Purdy, K. Cicak, R.W. Simmonds, C.A. Regal, K.W. Lehnert,\n\nNat. Phys. \\textbf{10}, 321â\u0080\u0093326 (2014).\n\n\\bibitem{bui}\nCatvu H. Bui, Jiangjun Zheng, S. W. Hoch, Lennon Y. T. Lee, J. G. E. Harris, and Chee Wei Wong,\n\nAppl. Phys. Lett. \\textbf{100}, 021110 (2012).\n\n\\bibitem{VillanuevaPRL2014} L.â\u0080\u0089G. Villanueva and S. Schmid,\n\nPhys. Rev. Lett. \\textbf{113}, 227201 (2014).\n\n\\bibitem{Leondes}C.T. Leondes, \\textit{Mems/Nems Handbook}, Springer  (2006).\n\n\\bibitem{Wilson-RaePRL2011}\nI. Wilson-Rae, R.A. Barton, S.S. Verbridge, D.R. Southworth, B. Ilic, H.G. Craighead, and J.M. Parpia,\n\nPhys. Rev. Lett. \\textbf{106} 047205 (2011).\n\n\\bibitem{SerraAPL2012}E. Serra, A. Borrielli, F. S. Cataliotti, F. Marin, F. Marino, A. Pontin, G. A. Prodi, and M. Bonaldi,\n\nAppl. Phys. Lett., \\textbf{101}, 071101 (2012).\n\n\\bibitem{BorrielliPRApplied2015} A. Borrielli, A. Pontin, F. S. Cataliotti, L. Marconi, F. Marin, F. Marino, G. Pandraud, G. A. Prodi, E. Serra, and M. Bonaldi,\n\nPhys. Rev. Applied \\textbf{3}, 054009 (2015).\n\n\\bibitem{YuAPL2014}\nP.-L. Yu, K. Cicak, N.S. Kampel, Y. Tsaturyan, T.P. Purdy, R.W. Simmonds, and C.A. Regal,\n\nAppl. Phys. Lett. \\textbf{104}, 023510 (2014).\n\n\\bibitem{TsaturyanOE2014} Y. Tsaturyan, A. Barg, A. Simonsen, L.G. Villanueva, S. Schmid, A. Schliesser, and E.S. Polzik,\n\nOpt. Express \\textbf{22}, 6810 (2014).\n\n\\bibitem{Sarro}P.J. French, P.M. Sarro, R. Mall$\\acute{\\textrm{e}}$e, E.J.M. Fakkeldij, and R.F. Wolffenbuttel, \n\nSens. Actuators A \\textbf{58}, 149 (1997).\n\n\\bibitem{Biancofiore:2011uq}\nC. Biancofiore, M. Karuza, M. Galassi, R. Natali, P. Tombesi, G. Di Giuseppe, and D. Vitali, \n\nPhys. Rev. A \\textbf{84}, 033814 (2011).\n\n\\bibitem{Jayich:2008nx}\nA.M. Jayich, J.C. Sankey, B.M. Zwickl, C. Yang, J.D. Thompson, S.M. Girvin, A.A. Clerk, F. Marquardt and J.G.E. Harris,\n\nNew J. Phys. {\\bf 9}, 095008 (2008).\n\t\n\\bibitem{Kleckner:2010}\nD. Kleckner, W.T.M. Irvine, S.S.R. Oemrawsingh, and D. Bouwmeester,\n\nPhys. Rev. A \\textbf{81}, 043814 (2010).\n\n\\bibitem{Winkler:1994}\nW. Winkler, R. Schilling, K. Danzmann, J. Mizuno, A. R$\\ddot{\\mathrm{u}}$diger, and K.A. Strain,\n\nAppl. Opt. \t{\\bf 33}, 7547 (1994).\n\n\\bibitem{virgo}The Virgo collaboration,\n\\textit{The VIRGO physics book}, Vol. II, available online at http://www.virgo-gw.eu/vpb/\n\n\\bibitem{norcada}Norcada Inc., http://www.norcada.com.\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 19522, "prevtext": "\n\nwhich gives the results in Ref.~\\cite{Jayich:2008nx}\n\n\n", "index": 7, "text": "\\begin{equation}\\label{eq2}\n2kL  = \\nu\\frac{2\\pi}{\\Delta\\nu_{FSR}}= - 2\\phi_r + 2\\cos^{-1} [-|r_d| \\cos( 2kz)]\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"2kL=\\nu\\frac{2\\pi}{\\Delta\\nu_{FSR}}=-2\\phi_{r}+2\\cos^{-1}[-|r_{d}|\\cos(2kz)]\\,.\" display=\"block\"><mrow><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>L</mi></mrow><mo>=</mo><mrow><mi>ν</mi><mo>⁢</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><msub><mi>ν</mi><mrow><mi>F</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mi>R</mi></mrow></msub></mrow></mfrac></mrow><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>ϕ</mi><mi>r</mi></msub></mrow></mrow><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><msup><mi>cos</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁡</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">|</mo><msub><mi>r</mi><mi>d</mi></msub><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>k</mi><mo>⁢</mo><mi>z</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">]</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]