[{"file": "1601.03598.tex", "nexttext": "\nwhich for small angle $\\theta_0$ and $\\tau$ simplify to\n\n", "itemtype": "equation", "pos": 6387, "prevtext": "\n\n\\begin{frontmatter}\n\n\\title{Active correction of the tilt angle of the surface plane with respect to the rotation axis during azimuthal scan}\n\n\\author{M. Sereno, S. Lupone, M. Debiossac, N. Kalashnyk, P.Roncin}\n\\address{Institut des sciences mol\\'{e}culaires d'Orsay (ISMO), CNRS, Univ. Paris-Sud, Universit\\'{e} Paris-Saclay, Orsay F-91405, France}\n\n\n\\begin{abstract}\nA procedure to measure the residual tilt angle $\\tau$ between a flat surface and the azimuthal rotation axis of the sample holder is described. When the incidence angle $\\theta$ and readout of the azimuthal angle $\\phi$ are controlled by motors, an active compensation mechanism can be implemented to reduce the effect of the tilt angle during azimuthal motion. After this correction, the effective angle of incidence is kept fixed, and only the small residual oscillation of the scattering plane remains. \\end{abstract}\n\n\\begin{keyword}\ngrazing incidence, surface science, fast atom diffraction, triangulation.\n\\end{keyword}\n\n\\end{frontmatter}\n\n\n\n\\section{Introduction} \nThe investigation of surface at grazing angle of incidence offers an increased surface sensitivity. This the case for a broad range of experimental tools using X-rays\\cite{Renaud} , high energy electrons\\cite{Pukite} and ions\\cite{Pfandzelter} as well as fast atoms \\cite{Seifert_in_situ,Roncin2002}. In all these techniques the angle of incidence is only few degrees. It implies a very high mounting accuracy for azimuthal rotation of the surface. For most diffraction experiments, the problem is resolved with a goniometer which is hardly compatible with sample transfer under UHV conditions. Therefore a  strategy to allowing azimuthal scan of the sample with a positioning accuracy below one degree is highly desirables. In this work we propose a method designed for a grazing incidence fast atom diffraction setup (GIFAD) that solves this issue..\n\\begin{figure}[ht]\n\t\\begin{center}\\includegraphics [width=60mm]{schematic.eps}\\end{center}\n\t\\caption{{Typical grazing incidence setup where the incident beam has a fixed direction. If the surface plane is not exactly perpendicular to the rotation axis, the specular beam follows characteristic orbits during azimuthal scan.}}\n\t\\label{schematic}\n\\end{figure}\n\\section{Grazing incidence fast atom diffraction}\nGrazing incidence fast atom diffraction (GIFAD or FAD) has recently emerged as a new surface science technique with exclusive surface sensitivity and high structural resolution \\cite{Seifert_SiO2,Debiossac2}. In this technique a beam of $\\sim$keV atoms impinges the surface at incidence angles $\\theta$ fo about one degree. When the beam is aligned with a low index crystal direction, diffraction can take place provided that the surface quality is good enough in terms of flatness and coherence length. The later quantity is defined here as the mean distance without crystalline defect. First discovered with single crystal of wide band gap ionic insulator such as LiF \\cite{Schuller_2007,Rousseau_2007}, NaCl \\cite{Lalmi}, GIFAD has shown successful with metal \\cite{Bundaleski,Schuller_2009}, semi-conductors \\cite{Khemliche,Debiossac2} and even single layers of inorganic compounds \\cite{Seifert_SiO2} and organic molecules \\cite{Seifert_alanine,Busch}. In this later case, diffraction is not as sharp as for bulk crystal surface or inorganic layer probably due to the presence of more structural defects. Fortunately triangulation technique \\cite{Pfandzelter} easily reveals the direction where the absorbed molecules align to each other while the shape of the azimthual profile gives hints on the detailed molecular assembly \\cite{Seifert_alanine}. Actually even faint diffraction is enough to derive the lattice parameter of the molecular organization \\cite{Seifert_alanine}. Also, it has been suggested \\cite{Debiossac_PRA,Zugarramurdi} that azimuthal scans around channeling directions could reveal the range $R_c$ of the interaction potential above the surface. This fundamental parameter can be very useful for quantitative analysis since it governs the length $L_T\\sim R_c /\\theta$ of the atom trajectory above the surface\\cite{Debiossac_PRA}. At high energies, selective sputtering of step edges is also sensitive to the crystallographic direction \\cite{Michely}. In the same way GIFAD has demonstrated  pronounced intensity oscillations during a layer by layer molecular beam epitaxy growth\\cite{Atkinson}. Following these oscillation during azimuthal rotation would allow a better uniformity of the layers.\nIdeally, these azimuthal scans should be performed without changing the angle of incidence. This turns out to be more difficult than expected. On one hand it is not straightforward to put a goniometer under UHV condition. On the other hand sample transfer and rotation devices do not always allow for ultra-precise positioning of the sample. Most often the surface normal has a residual tilt angle $\\tau$ of about one degree with respect to the rotation axis. This is sufficient to prevent straight-forward application of azimuthal scan. When the control of both the azimuthal and incidence angle is motorized (or simply measured), an on-line correction can be performed as described below.\n\n\n\n\n\n\n\n\\section{The orbit of the specular spot }\nFor each azimuthal angle, the plane of incidence is defined as the plane containing both the incident beam and the surface normal. It also contains the specularly reflected beam, so that the location of the specular beam on the detector indicates the direction of the surface normal. During an azimuthal scan the specular beam spot follows the curve that can be described as an orbit. The general definition of the orbit is not complex, and ray tracing or graphical software offer direct solutions. However, the general analytic formula derived, for instance from direct matrix multiplications, has a large number of terms including the exact location of the impact on the surface. The approach used in this work is much simpler. Here the beam impacts the surface exactly on its intersection with the rotation axis. When the target surface is small enough with a detector far away from the surface, this kind of \"far field\" approximation is fully justified. Accordingly, the coordinates (x,y) on the detector correspond to the scattering angles. The parametric equation  is then very simple (eq \\ref{eq1} and \\ref{eq2}).\n\n\n", "index": 1, "text": "\\begin{equation} \\label{eq1}\n\t\\begin{split}   \n\t\tx = -2\\sin\\phi\\sin\\tau(\\cos\\theta_0\\cos\\phi\\sin\\tau-\\sin\\theta_0\\cos\\tau)\\\\ \n\t\ty = -2\\cos\\tau(\\cos\\phi\\cos\\theta_0\\sin\\tau-\\sin\\theta_0\\cos\\tau)   \\\\\n\t\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle x=-2\\sin\\phi\\sin\\tau(\\cos\\theta_{0}\\cos\\phi\\sin\\tau%&#10;-\\sin\\theta_{0}\\cos\\tau)\\\\&#10;\\displaystyle y=-2\\cos\\tau(\\cos\\phi\\cos\\theta_{0}\\sin\\tau-\\sin\\theta_{0}\\cos%&#10;\\tau)\\\\&#10;\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mi>x</mi><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>τ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>τ</mi></mrow></mrow><mo>-</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>τ</mi></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>y</mi><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>τ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>τ</mi></mrow></mrow><mo>-</mo><mrow><mrow><mi>sin</mi><mo>⁡</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>τ</mi></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.03598.tex", "nexttext": "\t\nwith $\\phi$ the azimuthal angle. \n\n\n\\begin{figure}[ht]\n\t\t\\begin{center}\\includegraphics [width=80mm]{Orbits.eps}\\end{center}\n\t\\caption{{Orbits corresponding to an angle of incidence $\\theta_0$ =1$^\\circ$ and to a tilt angle $\\tau$ of 1$^\\circ$, 0.66$^\\circ$, 0.33$^\\circ$ and 0.1$^\\circ$. For each panel, the horizontal scale is zoomed $\\sim$ ten times compared with the vertical one. The rightmost panel shows the four orbits plotted at the same scale.}}\n\t\\label{iresp}\n\\end{figure}\nWith such simple equations, the vertical axis and horizontal mid axis have well defined extension but  the figure \\ref{iresp} shows that the orbits are not simple ellipses.\n\\begin{figure}[ht]\n\t\\begin{center}\\includegraphics [width=60mm]{tilt_c}\\end{center}\n\t\\caption{{The plane containing the rotation axis and the surface normal can be taken as an angular reference for $\\phi$. Twice per revolution, at angles (b) $\\phi_0$ and (a) $\\phi_0$ +180$^\\circ$, this plane contains the primary beam, and coincides with the incidence plane. The effect of the tilt angle is then maximum with a variation of 4$\\tau$ between these two position (top two schemes). At 90$^\\circ$ from these values, (c) and (d), the beam momentum $\\vec{k}$ is almost perpendicular to the reference plane with only a tiny component $\\vec{k}\\sin\\theta_0$ parallel to the rotation axis (in dashed blue). In this projected plane, the swing of the specular beam is again 4$\\tau$ but the amplitude on the detector will only be 4$\\tau\\sin\\theta_0$, i.e. almost two order of magnitude smaller.}}\n\t\\label{tilt}\n\\end{figure}\n\n\\begin{figure}[ht]\n\t\\begin{center}\\includegraphics [width=60mm]{scheme_2}\\end{center}\n\t\\caption{{Schematic view of the orbit on the detector with the polar coordinates ($\\theta_{eff}$,$\\alpha$), where $\\theta_{eff}$ is the distance to the beam and $\\alpha$ the polar angle. \\textit{L} is the distance from the target surface to the detector. The small angle approximation is used, i.e. $sin\\theta_0\\sim\\theta_0$ and $sin\\tau\\sim\\tau$. The orbit in dashed red corresponds to the orbit of the line defined as the intercept of the reference plane with the surface, i.e. the surface line inside the incidence plane.}}\n\t\\label{scheme_2}\n\\end{figure}\n\n\\section{Experimental measure of $\\tau$}\nThe tilt angle has to be measured in situ because the transfer systems can also introduce slight variation of this value. The simplest reference, that can be measured with high accuracy is the location of the primary beam on the detector. To define its position it is just needed to remove the target from the beam for a fraction of a second. From eq. \\ref{eq1} the  tilt angle $\\tau$ can be calculated as the ratio of full extension in \\textit{y} to the full width in \\textit{x} measured at half height. Another option is to measure accurately five values to fit a parametric curve onto the data points. Intuitively, in the elliptic case, these five values correspond to the coordinates $x,y$ of the two focal points of the ellipse and the length of the chord which are linked to useful experimental parameters : the value of the tilt angle $\\tau$, the mean scattering angle $\\theta_0$, the mean inclination of the scattering plane $\\alpha_0$ (the position sensitive detector or the camera is never perfectly aligned), and the direct beam position. As depicted in fig.\\ref{scheme_2} these values can be determined as simple ratios between geometric distances measured on the detector. In particular the mean scattering angle $\\theta_0 $ can be estimated rather accurately from the simple ratio of the horizontal width at half height of the orbit to its vertical width. The main problem is that often a new surface has so many defects that the scattering profile of the helium atoms can be very diffuse with angular width $\\sigma_\\theta$ and $\\sigma_\\phi$ exceeding one degree. A possible solution is to track the mean value of the scattering distribution either by moment analysis or via fit procedure which can usually bring the accuracy down to $\\sigma/10$ or even $\\sigma/100$ if the statistics is high enough \\cite{Nataliya}. When the tilt is larger than the angle of incidence, closed orbit does not exist because the reflection is not possible in a selected azimuthal range. Even in this case, the reduced swing of the scattering plane can be measured by tracking the mean value of the scattering profile along \\textit{x} (see Fig.\\ref{swing}).\n\n\\section{Test bench with laser pointer}\n\nTo test the software of the correction procedure while avoiding possible damage inside the UHV chamber during test, a simple system outside vacuum has been built. A small manipulator holds a laser pointer with its beam  directed onto a polished silicon wafer placed on top of a rotating stepper motor. A second miniature linear stepper motor is used to control the incidence angle $\\theta$. The reflected laser beam is imaged onto a screen at a distance \\textit{L} few meters downstream. Only the specular spot is present and the impact on the target can be easily centered. The motors are controlled by an inexpensive micro-controller \"Arduino Mega\" board with a 3D printer \"RepRap 1.4\" board capable to host up to five \"Allegro A4988\" stepper motor controllers. The Arduino is connected to the host PC via an USB-Link through which it receives order and transmit results. The program is written in C language inside the open source, integrated Arduino development environment hosted in a PC and uploaded to the micro-controller by the USB-Link. Various ratios of tilt angle to incidence angle have been explored. In these test conditions the full trajectory can be recorded in few seconds. We found that the curvature radius is so large compared with the horizontal width that the easiest starting strategy is to consider the orbit as a quasi ellipse. Both the mean scattering angle $\\theta_0$ and the tilt angle $\\tau$ are determined by the orbit vertical and horizontal amplitudes at half height.\n\\begin{figure}[ht]\n\t\\begin{center}\\includegraphics [width=60mm]{laser_pointer.eps}\\end{center}\n\t\\caption{{Table top test bench used to develop the correction algorithm. The tilt angle between the surface and the rotation axis cannot be varied continuously but different values have been tested.}}\n\t\\label{laser_test}\n\\end{figure}\n\n\n\\section{in situ laser reflection}\nWhen the studied sample is placed in-between two view-ports located opposite to each other on\nthe UHV chamber, shining a laser at the surface and observing the reflected beam is as easy as on the test bench. A simple screen few meters away will convert a mm resolution to $1/100$ of a degree. A single azimuthal rotation, even partial, is sufficient to measure the tilt angle and the azimuthal reference. If the relative positions of the laser and atom beam axis are known, the azimuthal reference can be transferred to the atom beam. \n\n\n\\section{in situ measurement with atoms}\nAs stated above, the tilt angle can also be measured with diffuse scattering conditions if statistics is large enough to allow accurate determination of the centroid of the scattering profile. Such condition is illustrated in the insert of Fig. \\ref{swing} recorded at an incidence angle $\\theta_0$ = 0.7$^\\circ$. Surprisingly, a tilt angle of $1.1^\\circ$ that is almost twice larger than the angle of incidence could be measured. In this case the azimuthal scan is impossible without adjusting manually the incidence angle when it approaches the value near 0Â° (almost parallel to the surface). Therefore, the angle of incidence is discontinuous and no orbit can be drawn. As a consequence, the scattering pattern is not analyzed in the Cartesian coordinates ($k_x,k_y$) but in the polar coordinates ($\\theta_{eff},\\alpha$) illustrated in Fig. \\ref{scheme_2}. The smooth oscillation of the collision plane follows a sinusoidal curve indicating  an inclination $\\alpha_0$ = 0.15$^\\circ$ of the position sensitive detector with respect to the mean scattering plane, a tilt angle $\\tau= 1.1^\\circ$ and a azimuthal reference $\\phi_0$ = 87$^\\circ$.\n\n\n\\begin{figure}[ht]\n\\begin{center}\\includegraphics [width=60mm]{swing.eps}\\end{center}\t\n\t\\caption{{During an azimutal scan, the mean polar angle $\\langle\\alpha\\rangle$ of the scattering distribution (ex. in insert) is reported as a function of the azimuth $\\phi$ follows a smooth sinusoidal curves having a full amplitude of 4$\\tau$. Note that the quasi elliptic shape of the scattering profile is accidental and has nothing to do with the orbits discussed above.}}\n\t\\label{swing}\n\\end{figure}\n\n\\section{correction of incidence angle}\nFrom Eq. \\ref{eq2}, the correction to apply to the angle of incidence during rotation is a simple sinusoidal function having a full amplitude of 4$\\tau$ and a phase reference $\\phi_0$. These parameters are independent of the incidence angle and have to be measured for each new sample surface before applying any correction. The only practical issue is the users interface. To avoid possible problems during sample transfer or large amplitude movement, the default settings are that motor actions are performed without corrections.\nWhen an azimuthal scan is to be programmed, the azimuthal angle $\\phi_{start}$ is, a priori, at a random position with respect to the reference plane. At this position, the mean scattering angle $\\theta_0$ defined above, i.e. as the average incidence during an uncorrected azimuthal scan, has no particular meaning. At variance, the user should simply assume that the correction will maintain the effective angle of incidence $\\theta_{eff}=\\theta_{start}=\\theta_0+\\tau\\cos\\phi_{start}$ at the moment where the azimuthal scan is decided. It means that the system should evolve on the quasi perfect straight line associated with the incidence angle $\\theta_{eff}$ and not along the correction contour associated with the mean value $\\theta_0$ of the initial orbit. Care has to be taken to adjust the phase with the proper sign as illustrated in Fig.\\ref{correction}. Note that the corrected orbit is now almost a perfect line with less than $10^{-3}$ degree vertical amplitude. \n\\begin{figure}[ht]\n\t\\begin{center}\\includegraphics [width=60mm]{corrected_orbit.eps}\\end{center}\n\t\\caption{{Illustration of the correction. The system was evolving along the red orbit corresponding here to a tilt angle of 0.33$^\\circ$ and a mean angle of incidence $\\theta_0=1^\\circ$. When correction is required by the user, the system is at the location indicated by a circle corresponding to an effective scattering angle of 1.2$^\\circ$. The system is now expected to evolve along the corrected circle (looking here as a straight segment at this scale) corresponding to the dashed blue orbit associated with a mean incidence angle $\\theta_0=1.2^\\circ$.}}\n\t\\label{correction}\n\\end{figure}\n\n\\section{Conclusion}\n\nIt should be noticed that the specular angle can be ill-defined. This occurs, for instance, the case when surface twist and tilt mosaicity is present \\cite{Lalmi}. In this case there are several specular beams corresponding to the local surface orientation illuminated by the primary beam so that correction is not well defined. With a single crystal surface correction is straightforward but is severely limited by the quality of the mechanical transmission. This includes the difficult problem of mechanical backlash of the vacuum transmission because the correction applied to the angle of incidence has to be reversed at least once per turn. There is still the possibility of a 180$^\\circ$ azimuthal scan without backlash. In practice, the presence of two view-ports allowing optical measurement is certainly a favorable condition to measure the tilt angle rapidly and accurately.\n\n\\section{Acknowledgment}\nWe are grateful to Ala Husseen for help during the measurements and to Christophe Charri\\`{e}re who designed the general motor control system for his assistance in implementing the correction in the user interface software.\n\n\\begin{thebibliography}{5}\n\n\n    \n\\bibitem{Renaud} Probing surface and interface morphology with Grazing Incidence Small Angle X-Ray Scattering.\n    G. Renaud, R. Lazzari, F. Leroy Surface Science Reports \\textbf{64}, p 255â\u0080\u0093380 (2009) doi:10.1016/j.surfrep.2009.07.002\n    \n\\bibitem{Pukite} Reflection high energy electron diffraction measurements of AlGaAs growth instabilities and roughening rates on misoriented substrates.\n    J.M. Van Hove, P.R. Pukite, P.I. Cohen, Journal of Vacuum Science and Technology B {\\bf3} (2), 563-567 (1987).\n    \n\\bibitem{Pfandzelter} Ion Beam Triangulation of Ultrathin Mn and CoMn Films Grown on Cu(001).\n    R. Pfandzelter, T. Bernhard, and H. Winter, Phys. Rev. Lett. {\\bf90}, 036102 ( 2003).\n\n\\bibitem{Roncin2002} Evidence for $F^-$ Formation by Simultaneous Double-Electron Capture during Scattering of $F^+$ from a LiF(001) Surface.\n     P. Roncin, A. G. Borisov, H. Khemliche, A. Momeni, A. Mertens, and H. Winter. Phys. Rev. Lett. \\textbf{89}, 043201 (2002)\n   \n\\bibitem {Seifert_in_situ} In-situ monitoring of oxygen adsorption at Mo(112) surface via fast atom diffraction.\n     J. Seifert, H. Winter Surface Science Vol. 610 L1 (2013).\n              \n\\bibitem {Seifert_SiO2} Diffraction of fast atoms during grazing scattering from the surface of an ultrathin silica film on Mo(112).\n     J. Seifert, A. Sch\\\"{u}ller, H. Winter, R. W\\l{}odarczyk, J. Sauer, and M. Sierka Phys. Rev. B {\\bf82}, 035436 (2010).\n     \n\\bibitem{Debiossac2} Combined experimental and theoretical study of fast atom diffraction on the $\\beta_2$(2Ã\u00974) reconstructed GaAs(001) surface.\n    M. Debiossac, A. Zugarramurdi, H. Khemliche, P. Roncin, A. G. Borisov, A. Momeni, P. Atkinson, M. Eddrief, F. Finocchi, and V. H. Etgens, Phys. Rev. B {\\bf90}, 155308 (2014). \n\n\\bibitem{Schuller_2007} Diffraction of Fast Atomic Projectiles during Grazing Scattering from a LiF(001) Surface.\n    A. Sch\\\"{u}ller, S. Wethekam, and H. Winter, Phys. Rev. Lett. {\\bf98}, 016103 (2007).\n\n\\bibitem{Rousseau_2007} Quantum Scattering of Fast Atoms and Molecules on Surfaces.\n    P. Rousseau, H. Khemliche, A. G. Borisov, and P. Roncin, Phys. Rev. Lett. {\\bf98}, 016104 (2007).\n\n\\bibitem{Lalmi} High resolution imaging of superficial mosaicity in single crystals using grazing incidence fast atom diffraction.\n    B. Lalmi, H. Khemliche, A. Momeni, P. Soulisse and P. Roncin, J. Phys.: Condens. Matter {\\bf24} 442002 (2012).\n\n\\bibitem{Bundaleski} Grazing Incidence Diffraction of keV Helium Atoms on a Ag(110) Surface.\nN. Bundaleski, H. Khemliche, P. Soulisse, and P. Roncin, Phys. Rev. Lett. {\\bf101}, 177601 (2008).\n\n\\bibitem{Schuller_2009} Fast Atom Diffraction from Superstructures on a Fe(110) Surface\nA. Sch\\\"{u}ller, M. Busch, S. Wethekam, and H. Winter, Phys. Rev. Lett. {\\bf102}, 017602 (2009). doi: http://dx.doi.org/10.1103/PhysRevLett.102.017602\n\n\\bibitem{Khemliche} Grazing incidence fast atom diffraction: An innovative approach to surface structure analysis.\n     H. Khemliche, P. Rousseau, P. Roncin, V. H. Etgens and F. Finocchi ,Appl. Phys. Lett. {\\bf95}, 151901 (2009).\n     \n\\bibitem{Seifert_alanine} Surface Structure of Alanine on Cu(110) Studied by Fast Atom Diffraction.\n    J. Seifert, M. Busch, E. Meyer, and H. Winter, Phys. Rev. Lett. {\\bf111}, 137601 (2013).\n    \n\\bibitem{Busch} Surface Structure of Alanine on Cu(110) Studied by Fast Atom Diffraction.\n     M. Busch, J. Seifert, E. Meyer, and H. Winter, Phys. Rev. B {\\bf86}, 241402(R) (2012).\n\t\n\\bibitem{Debiossac_PRA}\tAtomic diffraction under oblique incidence: An analytical expression\n\tM. Debiossac and P. Roncin Phys. Rev. A {\\bf90}, 054701 (2014).\n   \n\\bibitem{Zugarramurdi} Theoretical study of the effect of beam misalignment in fast-atom diffraction at surfaces.\n     A. Zugarramurdi and A.G. Borisov, Phys. Rev. A {\\bf87}, 062902 (2013).\n\n\\bibitem{Michely} Step Edge Sputtering Yield at Grazing Incidence Ion Bombardment.\n      H. Hansen, C. Polop, T. Michely, A. Friedrich, and H.M. Urbassek Phys. Rev. Lett. {\\bf92}, 246106 (2004).\n\t\n\\bibitem {Atkinson} Dynamic grazing incidence fast atom diffraction during molecular beam epitaxial growth of GaAs.\n     P. Atkinson, M. Eddrief, V. H. Etgens, H. Khemliche, M. Debiossac, A. Momeni, M. Mulier, B. Lalmi, and P. Roncin, Applied Physics Letters {\\bf105}, 021602 (2014).\n\n\\bibitem{Nataliya} Atom beam triangulation of organic layers at 100 meV normal energy: self-assembled perylene on Ag(1 1 0) at room temperature.\n\tN. Kalashnyk, H. Khemliche and P. Roncin. Applied Surface Science. \\textbf{364}, p 235â\u0080\u0093240 doi:10.1016/j.apsusc.2015.12.134 (2015).\n\t\n\n\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhich for small angle $\\theta_0$ and $\\tau$ simplify to\n\n", "index": 3, "text": "\\begin{equation} \\label{eq2}\n\t\\begin{split}   \n\t\tx = -2\\tau\\sin\\phi(\\tau\\cos\\phi-\\theta_0)\\\\\n\t\ty = 2\\theta_0-2\\tau\\cos\\phi\\\\\n\t\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle x=-2\\tau\\sin\\phi(\\tau\\cos\\phi-\\theta_{0})\\\\&#10;\\displaystyle y=2\\theta_{0}-2\\tau\\cos\\phi\\\\&#10;\\end{split}\" display=\"block\"><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"right\"><mrow><mi>x</mi><mo>=</mo><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>τ</mi><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>ϕ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>τ</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow></mrow><mo>-</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"right\"><mrow><mi>y</mi><mo>=</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>θ</mi><mn>0</mn></msub></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><mi>τ</mi><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mi>ϕ</mi></mrow></mrow></mrow></mrow></mtd></mtr></mtable></math>", "type": "latex"}]