[{"file": "1601.05741.tex", "nexttext": "\nwhere ${\\mbox{\\boldmath ${K}$}}$ denotes a surface current density, ${\\mbox{\\boldmath ${n}$}}$ is the outward\nnormal vector associated with the surface, and the quantity ${\\kappa}$ is\nknown as the current potential \\cite{merkel_nescoil}.  Contours of the current potential\nrepresent streamlines of the current.\n\nIn general the current potential may be multiple-valued,\nbecause there may be net current that topologically links the surface. For example,\nthe standard toroidal field coils in a tokamak correspond to a current potential that increases\nas one moves toroidally around the surface, ${\\kappa} \\propto \\zeta$ where $\\zeta$ is the toroidal coordinate.\nIn general we can write ${\\kappa} = {\\kappa}_{sv} + G \\zeta + I \\theta$, where $G$ and $I$ are constants,\n$\\theta$ and $\\zeta$ are any poloidal and toroidal angle coordinates,\nand ${\\kappa}_{sv}$ is single-valued. Since $G$ and $I$ are determined by the total current which links the surface poloidally,\nand by the topology of the currents (corresponding to saddle, modular, or helical coils, etc),\nwe can consider the magnetic field driven by $G \\zeta + I \\theta$ to be part of the `known' $B_n^{fix}$,\nwhereas ${\\kappa}_{sv}$ generates $B_n^x$ and is considered `unknown', adopting the same philosophy as in {\\tt NESCOIL}. Hence,\nfor the rest of this paper we will be concerned only with the single-valued part\n${\\kappa}_{sv}$, dropping the subscript to simplify notation.\n\nTo describe scalar quantities on surfaces, such as the current potential and\nthe normal component of ${\\mbox{\\boldmath ${B}$}}$, we will expand in some set of basis functions $f_j(\\theta,\\zeta)$.\n\nEach surface generally may have its own set of basis functions.\nIt is convenient to require that the basis functions satisfy an orthogonality relation\n\n", "itemtype": "equation", "pos": 15648, "prevtext": "\n\n\n\\title{Efficient magnetic fields for supporting toroidal plasmas}\n\n\n\n\n\n\n\n\n\n\n\n\\author{Matt Landreman}\n\\email[]{mattland@umd.edu}\n\n\n\\affiliation{Institute for Research in Electronics and Applied Physics, University of Maryland, College Park, MD, 20742, USA}\n\\author{Allen Boozer}\n\\affiliation{Department of Applied Physics and Applied Mathematics,\nColumbia University, New York, NY, 10027, USA}\n\n\n\n\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\n\nThe magnetic field that supports tokamak and stellarator plasmas must be produced by coils well separated from the plasma.\nHowever the larger the separation, the more difficult it is to produce a given magnetic field in the plasma region,\nso plasma configurations should be chosen that can be supported as efficiently as possible by distant coils.\nThe properties of curl-free magnetic fields allow magnetic field distributions to be ranked in order of their difficulty of production from a distance.\nPlasma shapes with low curvature and spectral width may be difficult to support, whereas plasma shapes with sharp edges may be efficiently supported by distant coils.\nTwo measures of difficulty, which correctly identify such differences in difficulty, will be examined.  These measures, which can be expressed as matrices, relate the externally-produced normal magnetic field on the plasma surface to the either the normal field or current on a distant control surface.    A singular value decomposition (SVD) of either matrix yields an efficiency ordered basis for the magnetic  field distributions.  Calculations are carried out for both tokamak and stellarator cases.\nFor axisymmetric surfaces with circular cross-section, the SVD is calculated analytically, and the range of\npoloidal and toroidal mode numbers that can be controlled to a given desired level is determined.\nIf formulated properly, these efficiency measures are independent of the coordinates used to parameterize the surfaces.\n\n\\end{abstract}\n\n\\pacs{}\n\n\\maketitle \n\n\n\\section{Introduction}\n\nIn schemes for magnetic plasma confinement, including both tokamaks and stellarators, one must create and control\nmagnetic fields in the plasma region using electromagnetic coils at a distance from the plasma. In tokamaks, not only is it typically beneficial to provide axisymmetric shaping (elongation, triangularity, an X-point, etc), but also to manipulate nonaxisymmetric magnetic  field components in order to control error fields and edge localized modes (ELMs). In stellarators, coils shapes are optimized to achieve a plasma shape that has good physics properties. In both tokamaks and stellarators, the distance between the coils and plasma is a critical quantity.\n\nNearby coils cannot be used in a nuclear environment, and a small coil-plasma separation can complicate design and construction, increasing costs.\n(Indeed, much of the challenge in assembling the W7-X stellarator stemmed from the need to fit many device components in the small space between plasma and coils, ``lesson 1'' in \\cite{Klinger}.)\nThe distance between coils and plasma can sometimes be increased at the cost of\ngreater current in the coils and/or greater coil curvature, but this increase leads to other engineering challenges such as greater electromagnetic forces in the coils. However, beyond a certain plasma-coil separation, it is typically impossible to find practical coils to support a given plasma shape within a reasonable tolerance  \\cite{merkel_nescoil}.  Thus, magnetic confinement fusion program would greatly benefit from improved and systematic understanding of the efficient control of magnetic fields using distant coils. This paper contributes towards such a theory.\n\n\n\nOne might intuitively expect that the efficiency of creating a given plasma shape is directly related to the minimum spatial length scale of the shape, with structures of length scale $\\lambda$ being inefficient to produce using currents displaced from the plasma by a length $\\geq \\lambda$.  However, this reasoning is too simplistic, as the following counterexample shows. A diverted tokamak has a corner at the X-point, meaning the plasma shape contains arbitrarily small length scales.  Nonetheless, the X-point shape can be efficiently produced, in the sense that the required shaping coils have both reasonable currents and separations from the plasma.  The X-point plasma shape is used in ITER and all modern tokamak reactor concepts. Another quantity which fails to measure the efficiency of producing a plasma shape is the spectral width\n\\footnote{\nNote that the condition of small curvature is not simply related to the condition of small spectral width of $R(\\theta,\\zeta)$ and $Z(\\theta,\\zeta)$,\nand vice versa.\nThe circle $R=\\cos(\\theta)$, $Z=\\sin(\\theta)$ has low curvature but large spectral width when parameterized in terms of the alternative coordinate\n$\\vartheta = \\theta+\\sin(\\theta)$. Conversely, the shape given by $R=\\cos(\\theta)$, $Z=\\sin(\\theta)+\\sin(2\\theta)/2$ has\nsmall spectral width but infinite curvature.}, which we define loosely as the number of Fourier modes needed to represent the shape via $R(\\theta,\\zeta) = \\sum_{m,n} R_{m,n} e^{i(m\\theta-n\\zeta)}$ and $Z(\\theta,\\zeta) = \\sum_{m,n} Z_{m,n} e^{i(m\\theta-n\\zeta)}$  for some \npoloidal and toroidal angles $\\theta,\\zeta$.  Many Fourier modes are required to represent the boundaries of \ntokamak plasmas with divertors, while other shapes with very small spectral width, such as shapes with concavities, can be difficult  to create with external coils. Furthermore, the spectral width depends on the specific choice of coordinates. Better measures of efficiency are needed.\n\nStellarator optimizations to date have been based upon using a small number of Fourier modes to describe the plasma shape \\cite{NuhrenbergZille1988}, so these optimizations may have overlooked parts of parameter space that are worth exploring, and  included regions of parameter space where it is difficult to find coils. Since sharp corners are not necessarily inefficient to produce, it may be advantageous to include such shapes in optimizations.  Indeed, sharp edges may be necessary for an attractive divertor solution.\n\n\n\n\nIn this work we will focus on controlling $B_n$, the component of the magnetic field ${\\mbox{\\boldmath ${B}$}}$ normal to a specified toroidal surface.\nThe reason for this focus is that for any fixed-boundary MHD equilibrium solution, the same equilibrium could be realized\nin the realistic scenario of a free boundary if coils could be designed to achieve $B_n=0$ on the desired plasma boundary \\cite{merkel_nescoil}.\nThe linearity of Amp\\`{e}re's Law means we can write $B_n = B_n^{pl} + B_n^{fix} + B_n^x$ as a sum of contributions \n$B_n^{pl}$ from current in the plasma,\n$B_n^{fix}$ from fixed coil currents outside the plasma,\nand $B_n^{x}$ from other external shaping currents which are being determined.\nThe $B_n^{fix}$ term may represent the field due to\nstandard planar toroidal field coils, and/or the net poloidal current on a modular coil winding surface which creates the main toroidal field.\nThe $B_n^x$ term may represent the field due to saddle coils, nonplanar excursions of modular coils, poloidal shaping coils, etc.\n(Our division of the externally generated $B_n$ into $B_n^{fix}$ and $B_n^x$ corresponds to\nMerkel's division into $h$ and $g$ terms in \\cite{merkel_nescoil}.)\nThe problem of designing shaping coils is thus to find shaping currents that achieve $B_n^x \\approx -B_n^{pl}-B_n^{fix}$,\nhence our focus on controlling $B_n$.\n\n\n\n\n\n\n\nHere we will consider the control of $B_n$ on the plasma surface using a second toroidal ``control'' surface,\nwhich is offset by some distance (uniform or nonuniform) from the plasma.  \nDepending on the application, the control surface may be either a specific surface on which we wish to design coils, \nor any surface that is relatively far from the plasma.\nWe consider two ways to relate $B_n$ on the plasma\nsurface to quantities on the control surface, leading to two operators, which we call the inductance and transfer operators.\nThe inductance operator relates skin currents on the control surface to $B_n$ on the plasma surface.\nThis approach is closely related to the {\\tt NESCOIL}~method of stellarator coil design \\cite{merkel_nescoil}.\nThe transfer operator instead relates $B_n$ on the control surface to $B_n$ on the plasma surface.\n\n\n\nFor the part of the magnetic field driven by external coils, ${\\mbox{\\boldmath ${B}$}} = \\nabla \\phi$ for some scalar potential $\\phi$ satisfying $\\nabla^2 \\phi=0$.\nA given $B_n = {\\mbox{\\boldmath ${n}$}}\\cdot\\nabla\\phi$ on the control surface (with normal vector ${\\mbox{\\boldmath ${n}$}}$)\nrepresents a Neumann boundary condition, so Laplace's equation $\\nabla^2 \\phi=0$\ninside the control surface has a unique solution up to a constant,\nand so a unique $B_n$ on the plasma surface can be determined.  The transfer operator encodes this relationship between\n$B_n$ on the two surfaces.\nFinite-dimensional inductance and transfer matrices arise from discretizing the quantities of interest on the two surfaces\nby expanding in a finite number of basis functions.\n\nFor both the inductance and transfer matrices, a quantitative measure of control efficiency can be obtained\nusing a singular value decomposition (SVD).  The SVD results in an orthonormal set of right singular vectors,\neach representing a pattern of $B_n$ or the current potential on the control surface,\npaired with a left singular vector representing the\nresulting pattern of $B_n$ on the plasma surface. Each pair of left and right singular vectors is associated with a singular value,\nwhich measures the efficiency by which currents or $B_n$ on the control surface\ndrive $B_n$ on the plasma surface.\nEach singular value, with the associated right and left singular vectors, represents a vacuum solution of $\\nabla^2 \\phi$\nthroughout the volume enclosed by the control surface, and hence a pattern of ${\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}})$\neverywhere in this volume, not just on the two surfaces.  We call each of these spatial\npatterns of ${\\mbox{\\boldmath ${B}$}}$ (as well as the associated $B_n$ on the surfaces) a `magnetic field distribution'.\n\nGiven the transfer or inductance matrix SVD and $B_n^{pl} + B_n^{fix}$,\nthe difficulty of supporting the plasma shape can be measured using either of two sequences, which we call\nthe efficiency and feasibility sequences.\nThe efficiency sequence is the projection of\n$B_n^{pl}+B_n^{fix}$ onto the left singular vectors. It has an exponentially decreasing trend,\nwith rapid decrease for plasma shapes that can be efficiently produced.\nFor example, we will show this decrease is rapid for a diverted tokamak shape, despite the sharp corner at\nthe X point.\nThis sequence is insensitive to the particular choice of control surface, so its rate of decrease measures\nthe intrinsic efficiency of the plasma shape.\nThe feasibility sequence is the efficiency sequence divided by the singular values,\nrepresenting the amplitudes of $B_n$ or current on the control surface required to achieve $B_n=0$ on the plasma surface.\nIf this sequence is (exponentially) decreasing, the required amplitudes on the control surface are bounded, so it is feasible to\nsupport this plasma shape with coils on this control surface.\nA plasma shape could be optimized by targeting the rate of decrease of either the efficiency or feasibility sequence.\n\nWe examine both the inductance and transfer matrices since each has advantages and disadvantages.\nThe transfer matrix relates a $B_n$ to a $B_n$, so both the matrix and its singular values are naturally dimensionless.\nIts singular values have the satisfying property that they approach 1 as the plasma and control surfaces approach each other.\nIn contrast, the inductance matrix is not dimensionless,\nand its singular values do not have a simple limiting value when the surfaces coincide.  However,\nultimately we are interested in generating the magnetic field with currents on the control surface,\nand the connection to the generating current is clearer for the inductance matrix than for the transfer matrix.\nThe inductance matrix is easier and faster to compute, since computation of the transfer matrix\nrequires inverting a dense linear system which may be poorly conditioned depending\non the specific algorithm and surface shapes, and certain singularities arise (as is common in boundary integral equation methods.)\nWe will find that the inductance and transfer matrices generally give a similar\ndescription of external control of the magnetic field.\nSome long-wavelength structures are found to be more efficient using the transfer matrix than using the inductance matrix.\nThe reason is that magnetic field on the plasma surface is generated by gradients\nof the current potential rather than by the current potential itself;\nlong-wavelength magnetic field structures can be inefficiently generated even though they propagate efficiently.\n\nOther measures of inefficiency/difficulty could be considered besides the ones we consider here.\nOne example is the curvature of the conductors generating the shaping fields, equivalent to curvature of\ncontours of the current potential.  Another example is the magnetic energy throughout space divided by\nthe magnetic energy in the region enclosed by the plasma bounding surface.\n\nThe present work builds upon the work of several previous authors.\nSVD techniques have been applied to an inductance matrix in the extension of {\\tt NESCOIL}~by Pomphrey et al \\cite{pomphrey},\nand are discussed in \\cite{boozer2000_1,boozer2000_2}.\nThe concept of the transfer matrix was introduced by Pomphrey in unpublished work, and his numerical calculation\nappears in figure 2 of Ref \\cite{boozer2015}.\nThe concept of the transfer matrix and the importance of its singular value decomposition were also discussed elsewhere\nin Ref \\cite{boozer2015} and in \\cite{boozerJPP}.\n\nIn the following two sections we introduce preliminary concepts,\nthen review the definitions of the inductance matrix\nand transfer matrix.\nSome details of our numerical implementation are given in section \\ref{sec:numerical}.\nIn section \\ref{sec:axisymm} we\nbuild some intuition for the two matrices and their SVDs\nby considering the case of axisymmetric surfaces with circular cross-section,\nsince in this limit the SVDs can be computed analytically using a large-aspect-ratio approximation.\nWe also demonstrate that these analytical results agree extremely well\nwith finite-aspect-ratio numerical calculations.\nShaped axisymmetric surfaces are examined in section \\ref{sec:axisymm_shaped},\nand here we demonstrate (figure \\ref{fig:divertorEasy}) that both the inductance and transfer matrix\nfind the X-point divertor shape to be efficient, despite the sharp corner.\nA numerical example for the W7-X stellarator is presented in section \\ref{sec:nonaxisymm}.\nHere we show that our efficiency measures are consistent with the choice of coil winding surface for W7-X,\nthat it is as far from the plasma as possible while still allowing the desired plasma shape to be supported.\nIn section \\ref{sec:angles}, we prove that for a suitable definition of orthogonality and\nwithin discretization error,\nthe SVD is independent of the coordinates chosen to parameterize the surfaces,\nand also independent of the specific choice of basis functions.\nWe conclude in section \\ref{sec:conclusions}.\nAn alternative method for visualizing the relationship between the inductance and transfer matrices is presented in the appendix.\n\n\\section{Current potential and basis functions}\n\nDivergence-free currents on a surface have the form\n\n", "index": 1, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${K}$}} = {\\mbox{\\boldmath ${n}$}} \\times \\nabla {\\kappa}\n\\label{eq:currentPotential}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${K}$}}={\\mbox{\\boldmath${n}$}}\\times\\nabla{\\kappa}\" display=\"block\"><mrow><mi>𝑲</mi><mo>=</mo><mrow><mi>𝒏</mi><mo>×</mo><mrow><mo>∇</mo><mo>⁡</mo><mi>κ</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere $\\int d^2a$ represents an area integral over the surface, and $w(\\theta,\\zeta)$ is some weight, normalized so that\n\n", "itemtype": "equation", "pos": 17567, "prevtext": "\nwhere ${\\mbox{\\boldmath ${K}$}}$ denotes a surface current density, ${\\mbox{\\boldmath ${n}$}}$ is the outward\nnormal vector associated with the surface, and the quantity ${\\kappa}$ is\nknown as the current potential \\cite{merkel_nescoil}.  Contours of the current potential\nrepresent streamlines of the current.\n\nIn general the current potential may be multiple-valued,\nbecause there may be net current that topologically links the surface. For example,\nthe standard toroidal field coils in a tokamak correspond to a current potential that increases\nas one moves toroidally around the surface, ${\\kappa} \\propto \\zeta$ where $\\zeta$ is the toroidal coordinate.\nIn general we can write ${\\kappa} = {\\kappa}_{sv} + G \\zeta + I \\theta$, where $G$ and $I$ are constants,\n$\\theta$ and $\\zeta$ are any poloidal and toroidal angle coordinates,\nand ${\\kappa}_{sv}$ is single-valued. Since $G$ and $I$ are determined by the total current which links the surface poloidally,\nand by the topology of the currents (corresponding to saddle, modular, or helical coils, etc),\nwe can consider the magnetic field driven by $G \\zeta + I \\theta$ to be part of the `known' $B_n^{fix}$,\nwhereas ${\\kappa}_{sv}$ generates $B_n^x$ and is considered `unknown', adopting the same philosophy as in {\\tt NESCOIL}. Hence,\nfor the rest of this paper we will be concerned only with the single-valued part\n${\\kappa}_{sv}$, dropping the subscript to simplify notation.\n\nTo describe scalar quantities on surfaces, such as the current potential and\nthe normal component of ${\\mbox{\\boldmath ${B}$}}$, we will expand in some set of basis functions $f_j(\\theta,\\zeta)$.\n\nEach surface generally may have its own set of basis functions.\nIt is convenient to require that the basis functions satisfy an orthogonality relation\n\n", "index": 3, "text": "\\begin{equation}\n\\int d^2a\\; w f_i f_j = \\delta_{i,j}\n\\label{eq:orthogonality}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\int d^{2}a\\;wf_{i}f_{j}=\\delta_{i,j}\" display=\"block\"><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><mi>w</mi><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow><mo>=</mo><msub><mi>δ</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nAs we will see below, it can sometimes be useful to consider non-constant $w$.\nWe write the normal component of the magnetic field $B_n$ as a weighted linear combination of the basis functions:\n\n", "itemtype": "equation", "pos": 17782, "prevtext": "\nwhere $\\int d^2a$ represents an area integral over the surface, and $w(\\theta,\\zeta)$ is some weight, normalized so that\n\n", "index": 5, "text": "\\begin{equation}\n\\int d^2a\\;w = 1.\n\\label{eq:weightNormalization}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\int d^{2}a\\;w=1.\" display=\"block\"><mrow><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><mi>w</mi></mrow></mrow><mo>=</mo><mn>1</mn></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor some components $\\Phi_j$.  (Repeated indices imply summation.)\nUsing (\\ref{eq:orthogonality}),\n\n", "itemtype": "equation", "pos": 18057, "prevtext": "\nAs we will see below, it can sometimes be useful to consider non-constant $w$.\nWe write the normal component of the magnetic field $B_n$ as a weighted linear combination of the basis functions:\n\n", "index": 7, "text": "\\begin{equation}\nB_n = w\\; \\Phi_j f_j\n\\label{eq:Bnormal}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"B_{n}=w\\;\\Phi_{j}f_{j}\" display=\"block\"><mrow><msub><mi>B</mi><mi>n</mi></msub><mo>=</mo><mrow><mpadded width=\"+2.8pt\"><mi>w</mi></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">Φ</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThe components $\\Phi_j$ may be thought of as magnetic fluxes,\nas they are area integrals of the magnetic field.\nSimilarly, the single-valued part of the current potential may be written\n\n", "itemtype": "equation", "pos": 18228, "prevtext": "\nfor some components $\\Phi_j$.  (Repeated indices imply summation.)\nUsing (\\ref{eq:orthogonality}),\n\n", "index": 9, "text": "\\begin{equation}\n\\Phi_j = \\int d^2a\\; B_n f_j = \\int d^2 {\\mbox{\\boldmath ${a}$}} \\cdot{\\mbox{\\boldmath ${B}$}}\\; f_j.\n\\label{eq:fluxDef}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\Phi_{j}=\\int d^{2}a\\;B_{n}f_{j}=\\int d^{2}{\\mbox{\\boldmath${a}$}}\\cdot{\\mbox{%&#10;\\boldmath${B}$}}\\;f_{j}.\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mi>j</mi></msub><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><msub><mi>B</mi><mi>n</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mrow><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mi>𝒂</mi></mrow><mo>⋅</mo><mpadded width=\"+2.8pt\"><mi>𝑩</mi></mpadded></mrow><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor some components $I_j$, satisfying\n\n", "itemtype": "equation", "pos": 18567, "prevtext": "\nThe components $\\Phi_j$ may be thought of as magnetic fluxes,\nas they are area integrals of the magnetic field.\nSimilarly, the single-valued part of the current potential may be written\n\n", "index": 11, "text": "\\begin{equation}\n{\\kappa} = I_j f_j\n\\label{eq:currentI}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"{\\kappa}=I_{j}f_{j}\" display=\"block\"><mrow><mi>κ</mi><mo>=</mo><mrow><msub><mi>I</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nBoth ${\\kappa}$ and $I_j$ have units of Amp\\`{e}res.\nNotice that there is some freedom of definition in whether to include the weight $w$ in (\\ref{eq:Bnormal})\nor (\\ref{eq:fluxDef}), and in (\\ref{eq:currentI}) or (\\ref{eq:ICurrent}).\nThe choices used in (\\ref{eq:Bnormal})-(\\ref{eq:ICurrent})\nare made for consistency with \\cite{boozer2015}, where they enable several analogies to be drawn between toroidal magnetic\nfields and electric circuits.\n\nOne natural choice of basis functions is the Fourier basis, consisting of sines and cosines\nin the poloidal and toroidal angles.  This basis requires a specific choice of weight $w$.\nObserve that area integrals of any quantity $Q$ may be written\n\n", "itemtype": "equation", "pos": 18676, "prevtext": "\nfor some components $I_j$, satisfying\n\n", "index": 13, "text": "\\begin{equation}\nI_j = \\int d^2a\\; w {\\kappa} f_j.\n\\label{eq:ICurrent}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"I_{j}=\\int d^{2}a\\;w{\\kappa}f_{j}.\" display=\"block\"><mrow><mrow><msub><mi>I</mi><mi>j</mi></msub><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><mi>w</mi><mo>⁢</mo><mi>κ</mi><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n\nwhere $n_p$ is the number of identical toroidal periods\n(e.g. $n_p= 5$ for W7-X.)  Also,\n$N = |{\\mbox{\\boldmath ${N}$}}|$ where\n\n", "itemtype": "equation", "pos": 19455, "prevtext": "\nBoth ${\\kappa}$ and $I_j$ have units of Amp\\`{e}res.\nNotice that there is some freedom of definition in whether to include the weight $w$ in (\\ref{eq:Bnormal})\nor (\\ref{eq:fluxDef}), and in (\\ref{eq:currentI}) or (\\ref{eq:ICurrent}).\nThe choices used in (\\ref{eq:Bnormal})-(\\ref{eq:ICurrent})\nare made for consistency with \\cite{boozer2015}, where they enable several analogies to be drawn between toroidal magnetic\nfields and electric circuits.\n\nOne natural choice of basis functions is the Fourier basis, consisting of sines and cosines\nin the poloidal and toroidal angles.  This basis requires a specific choice of weight $w$.\nObserve that area integrals of any quantity $Q$ may be written\n\n", "index": 15, "text": "\\begin{equation}\n\\int d^2 a \\;Q = \\sum_{\\ell=1}^{n_p} \\int_0^{2\\pi} d\\theta \\int_0^{2\\pi/n_p} d\\zeta\\; N Q\n\\label{eq:areaIntegrals}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\int d^{2}a\\;Q=\\sum_{\\ell=1}^{n_{p}}\\int_{0}^{2\\pi}d\\theta\\int_{0}^{2\\pi/n_{p}%&#10;}d\\zeta\\;NQ\" display=\"block\"><mrow><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><mi>Q</mi></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi mathvariant=\"normal\">ℓ</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>n</mi><mi>p</mi></msub></munderover><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msubsup><mrow><mrow><mo>𝑑</mo><mi>θ</mi></mrow><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo>/</mo><msub><mi>n</mi><mi>p</mi></msub></mrow></msubsup><mrow><mrow><mo>𝑑</mo><mpadded width=\"+2.8pt\"><mi>ζ</mi></mpadded></mrow><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mi>Q</mi></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nis the (non-unit-length) normal vector.\nIn order for trigonometric functions to satisfy the orthogonality relation (\\ref{eq:orthogonality}),\nwe must choose $w \\propto 1/N$ to cancel the factor of $N$ in (\\ref{eq:areaIntegrals}).\nThe choice\n\n", "itemtype": "equation", "pos": 19731, "prevtext": "\n\nwhere $n_p$ is the number of identical toroidal periods\n(e.g. $n_p= 5$ for W7-X.)  Also,\n$N = |{\\mbox{\\boldmath ${N}$}}|$ where\n\n", "index": 17, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${N}$}} = \\frac{\\partial {\\mbox{\\boldmath ${r}$}}}{\\partial \\zeta} \\times \\frac{\\partial {\\mbox{\\boldmath ${r}$}}}{\\partial \\theta}\n\\label{eq:N}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${N}$}}=\\frac{\\partial{\\mbox{\\boldmath${r}$}}}{\\partial\\zeta}%&#10;\\times\\frac{\\partial{\\mbox{\\boldmath${r}$}}}{\\partial\\theta}\" display=\"block\"><mrow><mi>𝑵</mi><mo>=</mo><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒓</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>ζ</mi></mrow></mfrac><mo>×</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>𝒓</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>θ</mi></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nis then required by (\\ref{eq:weightNormalization}).  Then from (\\ref{eq:orthogonality}),\nthe functions\n\\begin{eqnarray}\nf_j(\\theta,\\zeta)\n&=&\\sqrt{2} \\sin(m_j \\theta - n_j \\zeta)  \\mbox{ and} \\label{eq:FourierFunctions} \\\\\n&&\\sqrt{2} \\cos(m_j \\theta - n_j \\zeta), \\nonumber\n\\end{eqnarray}\nfor integers $m_j$ and $n_j$ are valid basis functions satisfying our requirements.\n(We exclude the constant basis function with $m=n=0$. The component $\\Phi_j$ associated this basis function must have\nzero amplitude due to $\\nabla\\cdot{\\mbox{\\boldmath ${B}$}}=0$ and (\\ref{eq:fluxDef}).\nWe can also require the amplitude of the constant basis function to be zero\nfor the expansion of the current potential $I_j$, since we can shift ${\\kappa}$ by an arbitrary\nconstant without altering the physical surface current.)\nStellarator symmetry (the 3D generalization of tokamak up-down symmetry) can be imposed conveniently by considering only the sine \n\nfunctions in (\\ref{eq:FourierFunctions}).\n\nAs we will discuss in section \\ref{sec:angles}, the Fourier basis (\\ref{eq:FourierFunctions}) has an unsatisfying property\nthat some important quantities we will compute depend on the choice of coordinates\n$\\theta$ and $\\zeta$ used to parameterize the surfaces.  For example, the plasma surface could be parameterized\nby the coordinates of the widely-used {\\tt VMEC}~code \\cite{VMEC1983} (in which magnetic field lines are not straight),\nor any of the popular straight-field-line coordinates.\nIn section \\ref{sec:angles} we will show this coordinate-dependence is a result of the fact that the weight (\\ref{eq:FourierWeight})\ndepends on the choice of coordinates.  Therefore, it is advantageous to consider\na different set of\nbasis functions orthogonal under a weight that is constant on the surface,\nand therefore independent of the choice of coordinates.\nFrom (\\ref{eq:weightNormalization}), such a weight must be\n$w=1/A$ where $A = \\int d^2a$ is the area of the surface.\nThere are multiple ways to generate suitable basis functions.\nOne approach is to use the functions\n\\begin{eqnarray}\nf_j(\\theta,\\zeta)\n&=&\\sqrt{ \\frac{A}{2 \\pi^2 N(\\theta,\\zeta)} } \\sin(m_j \\theta - n_j \\zeta)  \\mbox{ and} \\label{eq:constantWFunctions} \\\\\n&&\\sqrt{ \\frac{A}{2 \\pi^2 N(\\theta,\\zeta)} } \\cos(m_j \\theta - n_j \\zeta) \\nonumber\n\\end{eqnarray}\nfor integers $m_j$ and $n_j$. This is the basis set used for the rest of this paper, except where noted otherwise.\nA different set of basis functions orthogonal under the same constant weight $w=1/A$ is discussed in section \\ref{sec:angles}.\n\n\n\n\\section{Inductance and transfer matrices}\n\\label{sec:matrices}\n\nConsider a toroidal surface on which a skin current ${\\mbox{\\boldmath ${K}$}}$ flows.\nWe can compute the resulting magnetic field at any point using the Biot-Savart Law\n\n", "itemtype": "equation", "pos": 20165, "prevtext": "\nis the (non-unit-length) normal vector.\nIn order for trigonometric functions to satisfy the orthogonality relation (\\ref{eq:orthogonality}),\nwe must choose $w \\propto 1/N$ to cancel the factor of $N$ in (\\ref{eq:areaIntegrals}).\nThe choice\n\n", "index": 19, "text": "\\begin{equation}\nw = 1/(4\\pi^2 N)\n\\label{eq:FourierWeight}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"w=1/(4\\pi^{2}N)\" display=\"block\"><mrow><mi>w</mi><mo>=</mo><mrow><mn>1</mn><mo>/</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>4</mn><mo>⁢</mo><msup><mi>π</mi><mn>2</mn></msup><mo>⁢</mo><mi>N</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nPrimes denote quantities on the surface.\nSubstituting in (\\ref{eq:currentPotential}),\n(\\ref{eq:areaIntegrals}), and (\\ref{eq:N}),\n\n", "itemtype": "equation", "pos": 23027, "prevtext": "\nis then required by (\\ref{eq:weightNormalization}).  Then from (\\ref{eq:orthogonality}),\nthe functions\n\\begin{eqnarray}\nf_j(\\theta,\\zeta)\n&=&\\sqrt{2} \\sin(m_j \\theta - n_j \\zeta)  \\mbox{ and} \\label{eq:FourierFunctions} \\\\\n&&\\sqrt{2} \\cos(m_j \\theta - n_j \\zeta), \\nonumber\n\\end{eqnarray}\nfor integers $m_j$ and $n_j$ are valid basis functions satisfying our requirements.\n(We exclude the constant basis function with $m=n=0$. The component $\\Phi_j$ associated this basis function must have\nzero amplitude due to $\\nabla\\cdot{\\mbox{\\boldmath ${B}$}}=0$ and (\\ref{eq:fluxDef}).\nWe can also require the amplitude of the constant basis function to be zero\nfor the expansion of the current potential $I_j$, since we can shift ${\\kappa}$ by an arbitrary\nconstant without altering the physical surface current.)\nStellarator symmetry (the 3D generalization of tokamak up-down symmetry) can be imposed conveniently by considering only the sine \n\nfunctions in (\\ref{eq:FourierFunctions}).\n\nAs we will discuss in section \\ref{sec:angles}, the Fourier basis (\\ref{eq:FourierFunctions}) has an unsatisfying property\nthat some important quantities we will compute depend on the choice of coordinates\n$\\theta$ and $\\zeta$ used to parameterize the surfaces.  For example, the plasma surface could be parameterized\nby the coordinates of the widely-used {\\tt VMEC}~code \\cite{VMEC1983} (in which magnetic field lines are not straight),\nor any of the popular straight-field-line coordinates.\nIn section \\ref{sec:angles} we will show this coordinate-dependence is a result of the fact that the weight (\\ref{eq:FourierWeight})\ndepends on the choice of coordinates.  Therefore, it is advantageous to consider\na different set of\nbasis functions orthogonal under a weight that is constant on the surface,\nand therefore independent of the choice of coordinates.\nFrom (\\ref{eq:weightNormalization}), such a weight must be\n$w=1/A$ where $A = \\int d^2a$ is the area of the surface.\nThere are multiple ways to generate suitable basis functions.\nOne approach is to use the functions\n\\begin{eqnarray}\nf_j(\\theta,\\zeta)\n&=&\\sqrt{ \\frac{A}{2 \\pi^2 N(\\theta,\\zeta)} } \\sin(m_j \\theta - n_j \\zeta)  \\mbox{ and} \\label{eq:constantWFunctions} \\\\\n&&\\sqrt{ \\frac{A}{2 \\pi^2 N(\\theta,\\zeta)} } \\cos(m_j \\theta - n_j \\zeta) \\nonumber\n\\end{eqnarray}\nfor integers $m_j$ and $n_j$. This is the basis set used for the rest of this paper, except where noted otherwise.\nA different set of basis functions orthogonal under the same constant weight $w=1/A$ is discussed in section \\ref{sec:angles}.\n\n\n\n\\section{Inductance and transfer matrices}\n\\label{sec:matrices}\n\nConsider a toroidal surface on which a skin current ${\\mbox{\\boldmath ${K}$}}$ flows.\nWe can compute the resulting magnetic field at any point using the Biot-Savart Law\n\n", "index": 21, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}}) = \\frac{\\mu_0}{4\\pi}\n\\int d^2a' \\frac{ {\\mbox{\\boldmath ${K}$}}({\\mbox{\\boldmath ${r}$}}') \\times ({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}')}\n{\\left|{\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}'\\right|^3}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${B}$}}({\\mbox{\\boldmath${r}$}})=\\frac{\\mu_{0}}{4\\pi}\\int d^{2%&#10;}a^{\\prime}\\frac{{\\mbox{\\boldmath${K}$}}({\\mbox{\\boldmath${r}$}}^{\\prime})%&#10;\\times({\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime})}{\\left|{\\mbox%&#10;{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}\\right|^{3}}.\" display=\"block\"><mrow><mrow><mrow><mi>𝑩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>a</mi><mo>′</mo></msup><mo>⁢</mo><mfrac><mrow><mrow><mi>𝑲</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝒓</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>×</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nIntegrating by parts in $\\theta'$ and $\\zeta'$ to remove the derivatives on ${\\kappa}'$,\nafter some algebra we obtain\n\n", "itemtype": "equation", "pos": 23461, "prevtext": "\nPrimes denote quantities on the surface.\nSubstituting in (\\ref{eq:currentPotential}),\n(\\ref{eq:areaIntegrals}), and (\\ref{eq:N}),\n\n", "index": 23, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}})\n=\\frac{\\mu_0}{4\\pi}\n\\sum_{\\ell'=1}^{n_p} \\int_0^{2\\pi} d\\theta' \\int_0^{2\\pi/n_p} d\\zeta'\n\\left( \\frac{\\partial {\\kappa}'}{\\partial \\zeta'} \\frac{\\partial{\\mbox{\\boldmath ${r}$}}'}{\\partial \\theta'}\n-\\frac{\\partial {\\kappa}'}{\\partial \\theta'} \\frac{\\partial{\\mbox{\\boldmath ${r}$}}'}{\\partial \\zeta'}\\right)\n\\times\n\\frac{\\left({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}'\\right)}\n{\\left| {\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}'\\right|^3}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${B}$}}({\\mbox{\\boldmath${r}$}})=\\frac{\\mu_{0}}{4\\pi}\\sum_{%&#10;\\ell^{\\prime}=1}^{n_{p}}\\int_{0}^{2\\pi}d\\theta^{\\prime}\\int_{0}^{2\\pi/n_{p}}d%&#10;\\zeta^{\\prime}\\left(\\frac{\\partial{\\kappa}^{\\prime}}{\\partial\\zeta^{\\prime}}%&#10;\\frac{\\partial{\\mbox{\\boldmath${r}$}}^{\\prime}}{\\partial\\theta^{\\prime}}-\\frac%&#10;{\\partial{\\kappa}^{\\prime}}{\\partial\\theta^{\\prime}}\\frac{\\partial{\\mbox{%&#10;\\boldmath${r}$}}^{\\prime}}{\\partial\\zeta^{\\prime}}\\right)\\times\\frac{\\left({%&#10;\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}\\right)}{\\left|{\\mbox{%&#10;\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}\\right|^{3}}.\" display=\"block\"><mrow><mrow><mrow><mi>𝑩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><msup><mi mathvariant=\"normal\">ℓ</mi><mo>′</mo></msup><mo>=</mo><mn>1</mn></mrow><msub><mi>n</mi><mi>p</mi></msub></munderover><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msubsup><mrow><mrow><mo>𝑑</mo><msup><mi>θ</mi><mo>′</mo></msup></mrow><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mrow><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo>/</mo><msub><mi>n</mi><mi>p</mi></msub></mrow></msubsup><mrow><mrow><mrow><mo>𝑑</mo><msup><mi>ζ</mi><mo>′</mo></msup></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>κ</mi><mo>′</mo></msup></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>ζ</mi><mo>′</mo></msup></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>θ</mi><mo>′</mo></msup></mrow></mfrac></mrow><mo>-</mo><mrow><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>κ</mi><mo>′</mo></msup></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>θ</mi><mo>′</mo></msup></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>ζ</mi><mo>′</mo></msup></mrow></mfrac></mrow></mrow><mo>)</mo></mrow></mrow><mo>×</mo><mfrac><mrow><mo>(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>)</mo></mrow><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere ${\\mbox{\\boldmath ${n}$}} = {\\mbox{\\boldmath ${N}$}}/|{\\mbox{\\boldmath ${N}$}}|$.\nThis magnetic field is precisely that generated by magnetic dipoles of density\n${\\kappa}$ covering the surface and oriented normal to it.\n\nLet us call the surface considered so far the ``control'' surface outside the plasma,\nand consider a second toroidal surface inside this control surface, representing the boundary of\na plasma. We evaluate the component of (\\ref{eq:BDueToDipoles})\nnormal to this inner surface,\ngiving a linear relation between $\\kappa$ and the magnetic field\nnormal to the plasma surface, denoted $B_n^p$.\nThe operator $M_{op}$ in this linear relation $B_n^p = M_{op} {\\kappa}$\nis the inductance operator.\nA discretized linear relation is obtained by applying\nthe operation $\\int d^2a f_i^p(\\theta,\\zeta) (\\ldots)$,\nwhere $f_i^p(\\theta,\\zeta)$ are the basis functions on the plasma surface.\nRecalling (\\ref{eq:fluxDef}), (\\ref{eq:currentI}), and  (\\ref{eq:ICurrent}),\nand letting $f_j^c(\\theta',\\zeta')$ denote the basis functions on the control surface, we obtain\n\n", "itemtype": "equation", "pos": 24119, "prevtext": "\nIntegrating by parts in $\\theta'$ and $\\zeta'$ to remove the derivatives on ${\\kappa}'$,\nafter some algebra we obtain\n\n", "index": 25, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}})\n=\\frac{\\mu_0}{4\\pi}\n\\int d^2a \\; {\\kappa}'\n\\left[\n\\frac{1}{\\left| {\\mbox{\\boldmath ${r}$}} - {\\mbox{\\boldmath ${r}$}}'\\right|^3} {\\mbox{\\boldmath ${n}$}}'\n-\\frac{3}{\\left| {\\mbox{\\boldmath ${r}$}} - {\\mbox{\\boldmath ${r}$}}'\\right|^5}\n{\\mbox{\\boldmath ${n}$}}'\\cdot ({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}') ({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}') \\right],\n\\label{eq:BDueToDipoles}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${B}$}}({\\mbox{\\boldmath${r}$}})=\\frac{\\mu_{0}}{4\\pi}\\int d^{2%&#10;}a\\;{\\kappa}^{\\prime}\\left[\\frac{1}{\\left|{\\mbox{\\boldmath${r}$}}-{\\mbox{%&#10;\\boldmath${r}$}}^{\\prime}\\right|^{3}}{\\mbox{\\boldmath${n}$}}^{\\prime}-\\frac{3}%&#10;{\\left|{\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}\\right|^{5}}{%&#10;\\mbox{\\boldmath${n}$}}^{\\prime}\\cdot({\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath$%&#10;{r}$}}^{\\prime})({\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime})%&#10;\\right],\" display=\"block\"><mrow><mrow><mrow><mi>𝑩</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><msup><mi>κ</mi><mo>′</mo></msup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mfrac><mn>1</mn><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac><mo>⁢</mo><msup><mi>𝒏</mi><mo>′</mo></msup></mrow><mo>-</mo><mrow><mrow><mrow><mfrac><mn>3</mn><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>5</mn></msup></mfrac><mo>⁢</mo><msup><mi>𝒏</mi><mo>′</mo></msup></mrow><mo>⋅</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n(or in alternate notation ${\\mbox{\\boldmath ${\\Phi}$}} = {\\mathbfsf{{M}}} {\\mbox{\\boldmath ${I}$}}$) where\n\n", "itemtype": "equation", "pos": 25683, "prevtext": "\nwhere ${\\mbox{\\boldmath ${n}$}} = {\\mbox{\\boldmath ${N}$}}/|{\\mbox{\\boldmath ${N}$}}|$.\nThis magnetic field is precisely that generated by magnetic dipoles of density\n${\\kappa}$ covering the surface and oriented normal to it.\n\nLet us call the surface considered so far the ``control'' surface outside the plasma,\nand consider a second toroidal surface inside this control surface, representing the boundary of\na plasma. We evaluate the component of (\\ref{eq:BDueToDipoles})\nnormal to this inner surface,\ngiving a linear relation between $\\kappa$ and the magnetic field\nnormal to the plasma surface, denoted $B_n^p$.\nThe operator $M_{op}$ in this linear relation $B_n^p = M_{op} {\\kappa}$\nis the inductance operator.\nA discretized linear relation is obtained by applying\nthe operation $\\int d^2a f_i^p(\\theta,\\zeta) (\\ldots)$,\nwhere $f_i^p(\\theta,\\zeta)$ are the basis functions on the plasma surface.\nRecalling (\\ref{eq:fluxDef}), (\\ref{eq:currentI}), and  (\\ref{eq:ICurrent}),\nand letting $f_j^c(\\theta',\\zeta')$ denote the basis functions on the control surface, we obtain\n\n", "index": 27, "text": "\\begin{equation}\n\\Phi_i = M_{i,j} I_j\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\Phi_{i}=M_{i,j}I_{j}\" display=\"block\"><mrow><msub><mi mathvariant=\"normal\">Φ</mi><mi>i</mi></msub><mo>=</mo><mrow><msub><mi>M</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>I</mi><mi>j</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nQuantities without primes refer to the plasma surface.\nWe call $M_{i,j}$ the (mutual) inductance matrix between the two surfaces,\nsince it relates currents to fluxes.\n\n\n\nNext, we define the transfer operator and matrix. As noted in the introduction, given $B_n$ on the control surface,\ndenoted $B_n^c$,\nLaplace's equation $\\nabla^2 \\phi=0$ gives a unique solution for $B_n$ on the plasma surface, denoted $B_n^p$.\nDue to the linearity of Laplace's equation,\n$B_n^c$ is a linear functional of $B_n^p$:\n$B_n^p = T_{op} B_n^c$ for some linear operator $T_{op}$.\nWe call $T_{op}$ the transfer operator.\nA discrete version of this linear relation also holds:\nthe vector of fluxes on the plasma surface ${\\mbox{\\boldmath ${\\Phi}$}}^p$ must be a linear function of\nthe vector of fluxes on the control surface ${\\mbox{\\boldmath ${\\Phi}$}}^c$.\nThe transfer matrix ${\\mathbfsf{{T}}}$ is precisely this linear relationship:\n\n", "itemtype": "equation", "pos": 25843, "prevtext": "\n(or in alternate notation ${\\mbox{\\boldmath ${\\Phi}$}} = {\\mathbfsf{{M}}} {\\mbox{\\boldmath ${I}$}}$) where\n\n", "index": 29, "text": "\\begin{equation}\nM_{i,j} =\n\\frac{\\mu_0}{4\\pi}\n\\int d^2a \\int d^2a' \\; f_i^p(\\theta,\\zeta) f_j^c(\\theta',\\zeta')\n\\left[\n\\frac{{\\mbox{\\boldmath ${n}$}}\\cdot{\\mbox{\\boldmath ${n}$}}'}{\\left| {\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}'\\right|^3}\n- \\frac{ 3 ({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r'}$}})\\cdot{\\mbox{\\boldmath ${n}$}} ({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r'}$}})\\cdot{\\mbox{\\boldmath ${n}$}}'}\n {\\left| {\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}'\\right|^5}\n\\right].\n\\label{eq:inductanceMatrix}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"M_{i,j}=\\frac{\\mu_{0}}{4\\pi}\\int d^{2}a\\int d^{2}a^{\\prime}\\;f_{i}^{p}(\\theta,%&#10;\\zeta)f_{j}^{c}(\\theta^{\\prime},\\zeta^{\\prime})\\left[\\frac{{\\mbox{\\boldmath${n%&#10;}$}}\\cdot{\\mbox{\\boldmath${n}$}}^{\\prime}}{\\left|{\\mbox{\\boldmath${r}$}}-{%&#10;\\mbox{\\boldmath${r}$}}^{\\prime}\\right|^{3}}-\\frac{3({\\mbox{\\boldmath${r}$}}-{%&#10;\\mbox{\\boldmath${r^{\\prime}}$}})\\cdot{\\mbox{\\boldmath${n}$}}({\\mbox{\\boldmath$%&#10;{r}$}}-{\\mbox{\\boldmath${r^{\\prime}}$}})\\cdot{\\mbox{\\boldmath${n}$}}^{\\prime}}%&#10;{\\left|{\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}\\right|^{5}}%&#10;\\right].\" display=\"block\"><mrow><mrow><msub><mi>M</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>a</mi><mo>′</mo></msup></mpadded><mo>⁢</mo><msubsup><mi>f</mi><mi>i</mi><mi>p</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><mi>ζ</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msubsup><mi>f</mi><mi>j</mi><mi>c</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>θ</mi><mo>′</mo></msup><mo>,</mo><msup><mi>ζ</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><mrow><mi>𝒏</mi><mo>⋅</mo><msup><mi>𝒏</mi><mo>′</mo></msup></mrow><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac><mo>-</mo><mfrac><mrow><mrow><mrow><mrow><mn>3</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo mathvariant=\"bold\">′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>𝒏</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo mathvariant=\"bold\">′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><msup><mi>𝒏</mi><mo>′</mo></msup></mrow><msup><mrow><mo>|</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo>|</mo></mrow><mn>5</mn></msup></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n\nFor any real matrix ${\\mathbfsf{{A}}}$, including the inductance and transfer matrix,\none can find a singular value decomposition\n\n", "itemtype": "equation", "pos": 27304, "prevtext": "\nQuantities without primes refer to the plasma surface.\nWe call $M_{i,j}$ the (mutual) inductance matrix between the two surfaces,\nsince it relates currents to fluxes.\n\n\n\nNext, we define the transfer operator and matrix. As noted in the introduction, given $B_n$ on the control surface,\ndenoted $B_n^c$,\nLaplace's equation $\\nabla^2 \\phi=0$ gives a unique solution for $B_n$ on the plasma surface, denoted $B_n^p$.\nDue to the linearity of Laplace's equation,\n$B_n^c$ is a linear functional of $B_n^p$:\n$B_n^p = T_{op} B_n^c$ for some linear operator $T_{op}$.\nWe call $T_{op}$ the transfer operator.\nA discrete version of this linear relation also holds:\nthe vector of fluxes on the plasma surface ${\\mbox{\\boldmath ${\\Phi}$}}^p$ must be a linear function of\nthe vector of fluxes on the control surface ${\\mbox{\\boldmath ${\\Phi}$}}^c$.\nThe transfer matrix ${\\mathbfsf{{T}}}$ is precisely this linear relationship:\n\n", "index": 31, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${\\Phi}$}}^p = {\\mathbfsf{{T}}} {\\mbox{\\boldmath ${\\Phi}$}}^c.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${\\Phi}$}}^{p}={\\mathbfsf{{T}}}{\\mbox{\\boldmath${\\Phi}$}}^{c}.\" display=\"block\"><mrow><mrow><msup><mi>𝚽</mi><mi>p</mi></msup><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>T</mi><mo>⁢</mo><msup><mi>𝚽</mi><mi>c</mi></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere ${\\mathbfsf{{U}}}$ and ${\\mathbfsf{{V}}}$ are orthogonal (${\\mathbfsf{{U}}}^{-1} = {\\mathbfsf{{U}}}^T$ and ${\\mathbfsf{{V}}}^{-1} = {\\mathbfsf{{V}}}^T$),\n${\\mathbfsf{{\\Sigma}}}$ is diagonal, and the diagonal elements of ${\\mathbfsf{{\\Sigma}}}$\nare real and non-negative.  These diagonal elements are the singular values,\nand the columns of ${\\mathbfsf{{U}}}$ and ${\\mathbfsf{{V}}}$ are the left singular vectors and right singular vectors respectively.\n\nThe SVD provides an intuitive way to understand the action of the matrix ${\\mathbfsf{{A}}}$ on any vector ${\\mbox{\\boldmath ${q}$}}$.\nFirst, ${\\mbox{\\boldmath ${q}$}}$ is decomposed in the orthonormal basis provided by the columns of ${\\mathbfsf{{V}}}$. Each component\nis then scaled by the corresponding singular value.\nThe results then give the amplitudes of the response in the basis provided by the columns of ${\\mathbfsf{{U}}}$.\nHence, the singular values of the transfer and inductance matrix represent the efficiency by which quantities on the control surface\n(either $B_n$ or ${\\kappa}$ respectively) propagate to the plasma surface.\nThe left- and right-singular values associated with each singular value\nrepresent the modes of $B_n$ or ${\\kappa}$ which propagate with the given efficiency.\nThe singular vectors of the transfer and inductance matrices give\nour efficiency-ordered magnetic field distributions.\n\n\n\nLet ${\\mbox{\\boldmath ${\\Phi}$}}^{pl}$ and ${\\mbox{\\boldmath ${\\Phi}$}}^{fix}$ denote the flux vectors associated\nwith the normal magnetic fields on the plasma surface $B_n^{pl}$ and $B_n^{fix}$ defined in the introduction.\nIf the number of basis functions retained on the plasma and control surfaces is the same,\nthen the singular-valued part of the current potential required to achieve total $B_n\\approx0$\ncan be computed in principle from\n${\\mbox{\\boldmath ${I}$}} = {\\mathbfsf{{M}}}^{-1} [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$.\nWe say `in principle' because ${\\mathbfsf{{M}}}$ is\nvery poorly conditioned, for a large current in a sufficiently small loop on the control surface\nwill cause little change to the plasma surface $B_n$.\nIf the number of basis functions on the surfaces is not the same, one can still apply aforementioned relation if\n${\\mathbfsf{{M}}}^{-1}$ is interpreted as the Moore-Penrose pseudoinverse, which is equivalent\nto solving for ${\\mbox{\\boldmath ${I}$}}$ in a least-squares sense.\nThis procedure for computing\na current potential is essentially the one used in the {\\tt NESCOIL}~code.\nUsing the SVD of ${\\mathbfsf{{M}}}={\\mathbfsf{{U}}}{\\mathbfsf{{\\Sigma}}}{\\mathbfsf{{V}}}^T$ we can write\n\n", "itemtype": "equation", "pos": 27547, "prevtext": "\n\nFor any real matrix ${\\mathbfsf{{A}}}$, including the inductance and transfer matrix,\none can find a singular value decomposition\n\n", "index": 33, "text": "\\begin{equation}\n{\\mathbfsf{{A}}} = {\\mathbfsf{{U}}}{\\mathbfsf{{\\Sigma}}}{\\mathbfsf{{V}}}^T\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"{\\mathbfsf{{A}}}={\\mathbfsf{{U}}}{\\mathbfsf{{\\Sigma}}}{\\mathbfsf{{V}}}^{T}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>A</mi></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>U</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi mathvariant=\"normal\">Σ</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mi>T</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nTo understand why large shaping currents ${\\mbox{\\boldmath ${I}$}}$ result from this procedure for some plasma shapes\nbut not for other shapes, we will consider various subsets of the products on the right-hand side of (\\ref{eq:motivateSequences}).\nLet ${\\mbox{\\boldmath ${S}$}}_e$ denote the rightmost product, ${\\mbox{\\boldmath ${S}$}}_e = {\\mathbfsf{{U}}}^T [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$,\nwhich is the\nprojection of the externally generated\nplasma surface $B_n$ onto the left singular vectors (which represent $B_n$ distributions on the plasma surface.)\nWe call the elements of ${\\mbox{\\boldmath ${S}$}}_e$ the efficiency sequence. The elements of this sequence are relatively insensitive\nto the distance between the plasma and control surfaces, since this separation mainly affects the singular\nvalues rather than the unitary matrix ${\\mathbfsf{{U}}}$. (Recall the eigenvalues of a unitary matrix all have unit norm.)\nIncluding the next term in the product (\\ref{eq:motivateSequences}), we define\nthe feasibility sequence\n${\\mbox{\\boldmath ${S}$}}_f = {\\mathbfsf{{\\Sigma}}}^{-1}{\\mathbfsf{{U}}}^T [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$,\nwhich is the efficiency sequence divided by the singular values. Roughly speaking, the sum of the feasibility sequence\ndetermines the magnitude of the required shaping currents ${\\mbox{\\boldmath ${I}$}}$, since ${\\mbox{\\boldmath ${I}$}}={\\mathbfsf{{V}}} {\\mbox{\\boldmath ${S}$}}_f$\nand ${\\mathbfsf{{V}}}$ is unitary.  \nAn increasing feasibility sequence has a diverging sum,\nso the magnitude of the required shaping currents diverges, hence it is likely infeasible to find suitable coils.\nConversely, a rapidly decreasing feasibility sequence means the amplitudes of shaping currents are small,\nhence it should be feasible to find suitable coils.\nAs the feasibility sequence depends on the singular values,\nit will be sensitive to the separation between plasma and control surfaces.\nEfficiency and feasibility sequences can be defined for the transfer matrix just\nas for the inductance matrix. \n\n\n\\section{Numerical solution}\n\\label{sec:numerical}\n\nThe inductance matrix can be computed from the definition (\\ref{eq:inductanceMatrix}),\ndiscretizing the two surface integrals using uniform grids in $\\theta$ and $\\zeta$ on each surface.\nA convenient expression for numerical evaluation of the inductance matrix is\n\n", "itemtype": "equation", "pos": 30292, "prevtext": "\nwhere ${\\mathbfsf{{U}}}$ and ${\\mathbfsf{{V}}}$ are orthogonal (${\\mathbfsf{{U}}}^{-1} = {\\mathbfsf{{U}}}^T$ and ${\\mathbfsf{{V}}}^{-1} = {\\mathbfsf{{V}}}^T$),\n${\\mathbfsf{{\\Sigma}}}$ is diagonal, and the diagonal elements of ${\\mathbfsf{{\\Sigma}}}$\nare real and non-negative.  These diagonal elements are the singular values,\nand the columns of ${\\mathbfsf{{U}}}$ and ${\\mathbfsf{{V}}}$ are the left singular vectors and right singular vectors respectively.\n\nThe SVD provides an intuitive way to understand the action of the matrix ${\\mathbfsf{{A}}}$ on any vector ${\\mbox{\\boldmath ${q}$}}$.\nFirst, ${\\mbox{\\boldmath ${q}$}}$ is decomposed in the orthonormal basis provided by the columns of ${\\mathbfsf{{V}}}$. Each component\nis then scaled by the corresponding singular value.\nThe results then give the amplitudes of the response in the basis provided by the columns of ${\\mathbfsf{{U}}}$.\nHence, the singular values of the transfer and inductance matrix represent the efficiency by which quantities on the control surface\n(either $B_n$ or ${\\kappa}$ respectively) propagate to the plasma surface.\nThe left- and right-singular values associated with each singular value\nrepresent the modes of $B_n$ or ${\\kappa}$ which propagate with the given efficiency.\nThe singular vectors of the transfer and inductance matrices give\nour efficiency-ordered magnetic field distributions.\n\n\n\nLet ${\\mbox{\\boldmath ${\\Phi}$}}^{pl}$ and ${\\mbox{\\boldmath ${\\Phi}$}}^{fix}$ denote the flux vectors associated\nwith the normal magnetic fields on the plasma surface $B_n^{pl}$ and $B_n^{fix}$ defined in the introduction.\nIf the number of basis functions retained on the plasma and control surfaces is the same,\nthen the singular-valued part of the current potential required to achieve total $B_n\\approx0$\ncan be computed in principle from\n${\\mbox{\\boldmath ${I}$}} = {\\mathbfsf{{M}}}^{-1} [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$.\nWe say `in principle' because ${\\mathbfsf{{M}}}$ is\nvery poorly conditioned, for a large current in a sufficiently small loop on the control surface\nwill cause little change to the plasma surface $B_n$.\nIf the number of basis functions on the surfaces is not the same, one can still apply aforementioned relation if\n${\\mathbfsf{{M}}}^{-1}$ is interpreted as the Moore-Penrose pseudoinverse, which is equivalent\nto solving for ${\\mbox{\\boldmath ${I}$}}$ in a least-squares sense.\nThis procedure for computing\na current potential is essentially the one used in the {\\tt NESCOIL}~code.\nUsing the SVD of ${\\mathbfsf{{M}}}={\\mathbfsf{{U}}}{\\mathbfsf{{\\Sigma}}}{\\mathbfsf{{V}}}^T$ we can write\n\n", "index": 35, "text": "\\begin{equation}\n{\\mbox{\\boldmath ${I}$}} = {\\mathbfsf{{V}}}{\\mathbfsf{{\\Sigma}}}^{-1}{\\mathbfsf{{U}}}^T [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ].\n\\label{eq:motivateSequences}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"{\\mbox{\\boldmath${I}$}}={\\mathbfsf{{V}}}{\\mathbfsf{{\\Sigma}}}^{-1}{\\mathbfsf{{%&#10;U}}}^{T}[{\\mbox{\\boldmath${\\Phi}$}}^{pl}+{\\mbox{\\boldmath${\\Phi}$}}^{fix}].\" display=\"block\"><mrow><mrow><mi>𝑰</mi><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>V</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mi>T</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msup><mi>𝚽</mi><mrow><mi>p</mi><mo>⁢</mo><mi>l</mi></mrow></msup><mo>+</mo><msup><mi>𝚽</mi><mrow><mi>f</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>x</mi></mrow></msup></mrow><mo stretchy=\"false\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere the matrix element $F_{i,j}^p$ is given by basis function $j$ on the plasma surface evaluated\nat a $(\\theta,\\zeta)$ grid point indexed by $i$,\nan analogous definition holds for ${\\mathbfsf{{F}}}^c$\n(representing the basis functions on the control surface),\n\n", "itemtype": "equation", "pos": 32948, "prevtext": "\nTo understand why large shaping currents ${\\mbox{\\boldmath ${I}$}}$ result from this procedure for some plasma shapes\nbut not for other shapes, we will consider various subsets of the products on the right-hand side of (\\ref{eq:motivateSequences}).\nLet ${\\mbox{\\boldmath ${S}$}}_e$ denote the rightmost product, ${\\mbox{\\boldmath ${S}$}}_e = {\\mathbfsf{{U}}}^T [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$,\nwhich is the\nprojection of the externally generated\nplasma surface $B_n$ onto the left singular vectors (which represent $B_n$ distributions on the plasma surface.)\nWe call the elements of ${\\mbox{\\boldmath ${S}$}}_e$ the efficiency sequence. The elements of this sequence are relatively insensitive\nto the distance between the plasma and control surfaces, since this separation mainly affects the singular\nvalues rather than the unitary matrix ${\\mathbfsf{{U}}}$. (Recall the eigenvalues of a unitary matrix all have unit norm.)\nIncluding the next term in the product (\\ref{eq:motivateSequences}), we define\nthe feasibility sequence\n${\\mbox{\\boldmath ${S}$}}_f = {\\mathbfsf{{\\Sigma}}}^{-1}{\\mathbfsf{{U}}}^T [ {\\mbox{\\boldmath ${\\Phi}$}}^{pl} + {\\mbox{\\boldmath ${\\Phi}$}}^{fix} ]$,\nwhich is the efficiency sequence divided by the singular values. Roughly speaking, the sum of the feasibility sequence\ndetermines the magnitude of the required shaping currents ${\\mbox{\\boldmath ${I}$}}$, since ${\\mbox{\\boldmath ${I}$}}={\\mathbfsf{{V}}} {\\mbox{\\boldmath ${S}$}}_f$\nand ${\\mathbfsf{{V}}}$ is unitary.  \nAn increasing feasibility sequence has a diverging sum,\nso the magnitude of the required shaping currents diverges, hence it is likely infeasible to find suitable coils.\nConversely, a rapidly decreasing feasibility sequence means the amplitudes of shaping currents are small,\nhence it should be feasible to find suitable coils.\nAs the feasibility sequence depends on the singular values,\nit will be sensitive to the separation between plasma and control surfaces.\nEfficiency and feasibility sequences can be defined for the transfer matrix just\nas for the inductance matrix. \n\n\n\\section{Numerical solution}\n\\label{sec:numerical}\n\nThe inductance matrix can be computed from the definition (\\ref{eq:inductanceMatrix}),\ndiscretizing the two surface integrals using uniform grids in $\\theta$ and $\\zeta$ on each surface.\nA convenient expression for numerical evaluation of the inductance matrix is\n\n", "index": 37, "text": "\\begin{equation}\n{\\mathbfsf{{M}}} = ({\\mathbfsf{{F}}}^p)^T {\\mathbfsf{{D}}} {\\mathbfsf{{F}}}^c,\n\\label{eq:matmul}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"{\\mathbfsf{{M}}}=({\\mathbfsf{{F}}}^{p})^{T}{\\mathbfsf{{D}}}{\\mathbfsf{{F}}}^{c},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>M</mi></mrow><mo>=</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>F</mi><mi>p</mi></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mi>T</mi></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>D</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>F</mi><mi>c</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n$d\\theta$ and $d\\zeta$ denote the spacing of grid points,\n${\\mbox{\\boldmath ${r}$}}_i$ and ${\\mbox{\\boldmath ${N}$}}_i$ are evaluated\nat a $(\\theta,\\zeta)$ grid point on the plasma surface indexed by $i$,\nand\n${\\mbox{\\boldmath ${r}$}}'_j$ and ${\\mbox{\\boldmath ${N}$}}'_j$ are evaluated\nat a $(\\theta',\\zeta')$ grid point on the control surface indexed by $j$.\nComputation times are typically dominated by the assembly of ${\\mathbfsf{{D}}}$\nand by the matrix multiplications in (\\ref{eq:matmul}).\nCalculations can be significantly accelerated with little programming effort by using\nOpenMP parallelism for the former and a multi-threaded BLAS subroutine for the latter.\n\nThe basic resolution parameters of the numerical calculation\nare the number of grid points $N_{\\theta}$ and $N_{\\zeta}$ on each surface,\ndetermining both dimensions of ${\\mathbfsf{{D}}}$ and determining the number of rows of ${\\mathbfsf{{F}}}^p$ and ${\\mathbfsf{{F}}}^c$,\nand the maximum poloidal and toroidal mode numbers $m_{\\max}$ and $n_{\\max}$\nfor the set of basis functions on each surface,\ndetermining the number of columns of ${\\mathbfsf{{F}}}^p$ and ${\\mathbfsf{{F}}}^c$ and determining both dimensions of ${\\mathbfsf{{M}}}$.\nTypically it is appropriate to choose $N_{\\theta} \\gg m_{\\max}$ and $N_{\\zeta} \\gg n_{\\max}$.\nIn principle, different numbers of grid points could be used on the two surfaces, and/or different\nnumbers of basis functions could be used on the two surfaces.\nHowever for all results presented here, the resolution parameters are identical on the two surfaces.\n\nNow consider computation of the transfer matrix, which amounts to solving Laplace's equation in the region between the plasma and control surfaces.\nThis problem is a classic case in which boundary integral equation methods excel \\cite{hess,Jaswon,merkel_nestor,merkel_varenna,Becker},\nsince these methods avoid\nthe need to discretize the volume inside the control surface; only the surfaces need to be discretized.\nWithin boundary integral equation methods, there are many options. Methods can be divided in two classes,\nthose which use Green's theorem\nas in \\cite{merkel_nestor}, and those which use a surface source distribution \\cite{hess}\nin which we write a surface integral\n\n", "itemtype": "equation", "pos": 33340, "prevtext": "\nwhere the matrix element $F_{i,j}^p$ is given by basis function $j$ on the plasma surface evaluated\nat a $(\\theta,\\zeta)$ grid point indexed by $i$,\nan analogous definition holds for ${\\mathbfsf{{F}}}^c$\n(representing the basis functions on the control surface),\n\n", "index": 39, "text": "\\begin{equation}\nD_{i,j} = d\\theta\\; d\\zeta\\; d\\theta'\\; d\\zeta'\\; n_p \\frac{\\mu_0}{4\\pi}\n\\sum_{\\ell'}\n\\left[\n\\frac{{\\mbox{\\boldmath ${N}$}}_i\\cdot{\\mbox{\\boldmath ${N}$}}'_j}{\\left| {\\mbox{\\boldmath ${r}$}}_i-{\\mbox{\\boldmath ${r}$}}'_j\\right|^3}\n- \\frac{ 3 ({\\mbox{\\boldmath ${r}$}}_i-{\\mbox{\\boldmath ${r}$}}'_j)\\cdot{\\mbox{\\boldmath ${N}$}}_i ({\\mbox{\\boldmath ${r}$}}_i-{\\mbox{\\boldmath ${r}$}}'_j)\\cdot{\\mbox{\\boldmath ${N}$}}'_j}\n {\\left| {\\mbox{\\boldmath ${r}$}}_i-{\\mbox{\\boldmath ${r}$}}'_j\\right|^5}\n\\right],\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"D_{i,j}=d\\theta\\;d\\zeta\\;d\\theta^{\\prime}\\;d\\zeta^{\\prime}\\;n_{p}\\frac{\\mu_{0}%&#10;}{4\\pi}\\sum_{\\ell^{\\prime}}\\left[\\frac{{\\mbox{\\boldmath${N}$}}_{i}\\cdot{\\mbox{%&#10;\\boldmath${N}$}}^{\\prime}_{j}}{\\left|{\\mbox{\\boldmath${r}$}}_{i}-{\\mbox{%&#10;\\boldmath${r}$}}^{\\prime}_{j}\\right|^{3}}-\\frac{3({\\mbox{\\boldmath${r}$}}_{i}-%&#10;{\\mbox{\\boldmath${r}$}}^{\\prime}_{j})\\cdot{\\mbox{\\boldmath${N}$}}_{i}({\\mbox{%&#10;\\boldmath${r}$}}_{i}-{\\mbox{\\boldmath${r}$}}^{\\prime}_{j})\\cdot{\\mbox{%&#10;\\boldmath${N}$}}^{\\prime}_{j}}{\\left|{\\mbox{\\boldmath${r}$}}_{i}-{\\mbox{%&#10;\\boldmath${r}$}}^{\\prime}_{j}\\right|^{5}}\\right],\" display=\"block\"><mrow><mrow><msub><mi>D</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mi>d</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>θ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>ζ</mi></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>θ</mi><mo>′</mo></msup></mpadded><mo>⁢</mo><mi>d</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>ζ</mi><mo>′</mo></msup></mpadded><mo>⁢</mo><msub><mi>n</mi><mi>p</mi></msub><mo>⁢</mo><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msup><mi mathvariant=\"normal\">ℓ</mi><mo>′</mo></msup></munder><mrow><mo>[</mo><mrow><mfrac><mrow><msub><mi>𝑵</mi><mi>i</mi></msub><mo>⋅</mo><msubsup><mi>𝑵</mi><mi>j</mi><mo>′</mo></msubsup></mrow><msup><mrow><mo>|</mo><mrow><msub><mi>𝒓</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>𝒓</mi><mi>j</mi><mo>′</mo></msubsup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac><mo>-</mo><mfrac><mrow><mrow><mrow><mrow><mn>3</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝒓</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>𝒓</mi><mi>j</mi><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><msub><mi>𝑵</mi><mi>i</mi></msub></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>𝒓</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>𝒓</mi><mi>j</mi><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><msubsup><mi>𝑵</mi><mi>j</mi><mo>′</mo></msubsup></mrow><msup><mrow><mo>|</mo><mrow><msub><mi>𝒓</mi><mi>i</mi></msub><mo>-</mo><msubsup><mi>𝒓</mi><mi>j</mi><mo>′</mo></msubsup></mrow><mo>|</mo></mrow><mn>5</mn></msup></mfrac></mrow><mo>]</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nHere, $y$ is some surface distribution which is solved for in terms of the Neumann boundary condition on the control surface,\nand $G({\\mbox{\\boldmath ${d}$}})$ is a solution of\nLaplace's equation with a singularity at ${\\mbox{\\boldmath ${d}$}}=0$, such as a monopole or dipole.\nThe sources are outside the control volume (by a finite or infinitesimal distance) and are not physical, introduced to span the space of possible solutions\nto Laplace's equation inside the control surface,\nso $G$ can be the monopole function $1/|{\\mbox{\\boldmath ${d}$}}|$ even for this magnetic field calculation.\nFor surface source distribution methods, one can choose the surface on which the sources are located\n(i.e. the integration surface in (\\ref{eq:surfaceSource})) to either be infinitesimally outside the control surface,\nor it can be a distinct third surface which is outside the control surface by a finite distance.\nIn the latter case, the transfer matrix must be independent of the specific choice of outermost surface\nif the calculation is well resolved numerically, since the transfer matrix is originally defined without reference to this third surface.\nFor good numerical convergence, this outer surface must be far from the control surface compared to the spacing of integration points,\nbut not so far that the coupling between outer and control surfaces is poorly conditioned.\nThe 3-surface method has the disadvantage that selecting a third surface shape which is an appropriate distance from the control surface\nsometimes requires manual adjustments; however the 2-surface source distribution method and Green's theorem method\nhave the disadvantage that one must carefully integrate over\na singularity at the point ${\\mbox{\\boldmath ${r}$}}'={\\mbox{\\boldmath ${r}$}}$, as in (\\ref{eq:surfaceSource}).\nThese singularities may be handled using specialized quadrature rules, or using the remarkable regularization\ntechnique of Merkel \\cite{merkel_nestor,merkel_varenna} in which one adds and subtracts a singular function that can be integrated analytically.\n(Note that the appendix of \\cite{merkel_nestor} contains many typographic errors.\nReaders should refer instead to \\cite{merkel_varenna} which contains the correct equations.)\n\nFor any of these schemes, the transfer matrix is computed using a similar sequence of steps.\nFirst, a dense matrix is assembled which relates either $\\phi({\\mbox{\\boldmath ${r}$}})$ (in the Green's theorem method)\nor $y({\\mbox{\\boldmath ${r}$}})$ (in the surface source method) on the outermost surface to $B_n$ on the control surface.\nThe inverse of this matrix is left-multiplied by another matrix that relates\n$\\phi({\\mbox{\\boldmath ${r}$}})$ or $y({\\mbox{\\boldmath ${r}$}})$ on the outermost surface to $B_n$ on the plasma surface.\nFor example, the method described in \\cite{boozer2015} for computing the transfer matrix\nis a 3-surface source distribution method with dipole sources.\nOne computes the outer-to-plasma-surface and outer-to-control-surface inductance matrices\n${\\mathbfsf{{M}}}^{(p,o)}$ and ${\\mathbfsf{{M}}}^{(c,o)}$, and then the transfer matrix follows from ${\\mathbfsf{{T}}} = {\\mathbfsf{{M}}}^{(p,o)} ({\\mathbfsf{{M}}}^{(c,o)})^{-1}$.\nThis method amounts to spanning the set\nof solutions to Laplace's equation using dipoles on the outer surface, where the dipole amplitudes are chosen to satisfy the\nNeumann boundary condition on the control surface.\n\n\nFor results shown here, we use two different surface source distribution methods,\nboth the 2-surface scheme with monopole source distribution\nand Merkel's regularization, and the 3-surface scheme with dipole source distribution,\nand we have verified the two approaches give identical results as a check of correctness.\nFor the 2-surface method, we use the same uniform $(\\theta,\\zeta)$ grid for $y$ and $B_n$.\n\n\n\n\\section{Circular axisymmetric surfaces}\n\\label{sec:axisymm}\n\nTo gain familiarity with the transfer and inductance matrices and their SVDs,\nlet us first consider the case in which both the plasma and control surfaces are axisymmetric,\nthough the magnetic field distributions we consider may be nonaxisymmetric.\nWe begin by analyzing the cylindrical limit, corresponding to large aspect ratio and circular cross section of the surfaces.\nIn this limit, we can compute the singular values and vectors of the transfer and inductance matrices analytically,\nbecause the singular vectors correspond to separable solutions of Laplace's equation\nfor the scalar magnetic potential $\\phi$ in cylindrical geometry.\nThis correspondence can be understood as follows.\nLaplace's equation becomes\n\n", "itemtype": "equation", "pos": 36118, "prevtext": "\n$d\\theta$ and $d\\zeta$ denote the spacing of grid points,\n${\\mbox{\\boldmath ${r}$}}_i$ and ${\\mbox{\\boldmath ${N}$}}_i$ are evaluated\nat a $(\\theta,\\zeta)$ grid point on the plasma surface indexed by $i$,\nand\n${\\mbox{\\boldmath ${r}$}}'_j$ and ${\\mbox{\\boldmath ${N}$}}'_j$ are evaluated\nat a $(\\theta',\\zeta')$ grid point on the control surface indexed by $j$.\nComputation times are typically dominated by the assembly of ${\\mathbfsf{{D}}}$\nand by the matrix multiplications in (\\ref{eq:matmul}).\nCalculations can be significantly accelerated with little programming effort by using\nOpenMP parallelism for the former and a multi-threaded BLAS subroutine for the latter.\n\nThe basic resolution parameters of the numerical calculation\nare the number of grid points $N_{\\theta}$ and $N_{\\zeta}$ on each surface,\ndetermining both dimensions of ${\\mathbfsf{{D}}}$ and determining the number of rows of ${\\mathbfsf{{F}}}^p$ and ${\\mathbfsf{{F}}}^c$,\nand the maximum poloidal and toroidal mode numbers $m_{\\max}$ and $n_{\\max}$\nfor the set of basis functions on each surface,\ndetermining the number of columns of ${\\mathbfsf{{F}}}^p$ and ${\\mathbfsf{{F}}}^c$ and determining both dimensions of ${\\mathbfsf{{M}}}$.\nTypically it is appropriate to choose $N_{\\theta} \\gg m_{\\max}$ and $N_{\\zeta} \\gg n_{\\max}$.\nIn principle, different numbers of grid points could be used on the two surfaces, and/or different\nnumbers of basis functions could be used on the two surfaces.\nHowever for all results presented here, the resolution parameters are identical on the two surfaces.\n\nNow consider computation of the transfer matrix, which amounts to solving Laplace's equation in the region between the plasma and control surfaces.\nThis problem is a classic case in which boundary integral equation methods excel \\cite{hess,Jaswon,merkel_nestor,merkel_varenna,Becker},\nsince these methods avoid\nthe need to discretize the volume inside the control surface; only the surfaces need to be discretized.\nWithin boundary integral equation methods, there are many options. Methods can be divided in two classes,\nthose which use Green's theorem\nas in \\cite{merkel_nestor}, and those which use a surface source distribution \\cite{hess}\nin which we write a surface integral\n\n", "index": 41, "text": "\\begin{equation}\n\\phi({\\mbox{\\boldmath ${r}$}}) = \\int d^2r' \\; y({\\mbox{\\boldmath ${r}$}}') G({\\mbox{\\boldmath ${r}$}}-{\\mbox{\\boldmath ${r}$}}').\n\\label{eq:surfaceSource}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\phi({\\mbox{\\boldmath${r}$}})=\\int d^{2}r^{\\prime}\\;y({\\mbox{\\boldmath${r}$}}^%&#10;{\\prime})G({\\mbox{\\boldmath${r}$}}-{\\mbox{\\boldmath${r}$}}^{\\prime}).\" display=\"block\"><mrow><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝒓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>r</mi><mo>′</mo></msup></mpadded><mo>⁢</mo><mi>y</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>𝒓</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>𝒓</mi><mo>-</mo><msup><mi>𝒓</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere $R \\approx$ constant.  Some of the separable solutions are\n\\begin{eqnarray}\n\\phi\n&=& y^s_{m,n} \\sin(m\\theta-n\\zeta) I_m\\left(\\frac{n r}{R}\\right) \\;\\;\\mbox{and} \\label{eq:highAspectRatioBesselDistrib} \\\\\n&& y^c_{m,n} \\cos(m\\theta-n\\zeta) I_m\\left(\\frac{n r}{R}\\right) \\nonumber\n\\end{eqnarray}\nfor integers $m$ and $n \\ne 0$, where $I_m$ is the modified Bessel function,\nand $y^s_{m,n}$ and $y^c_{m,n}$ are arbitrary constants.\nThere are also ``axisymmetric'' solutions\n\\begin{eqnarray}\n\\phi\n&=&\ny^s_{m,0} \\sin(m\\theta) r ^ m \\;\\; \\mbox{and} \\label{eq:highAspectRatioPowerDistrib} \\\\\n&& y^c_{m,0} \\cos(m\\theta) r ^ m. \\nonumber\n\\end{eqnarray}\nForming $B_n = \\partial \\phi/\\partial r$ and noting the weight $w$ is $\\approx$ constant,\nthese fields represent orthogonal flux vectors $\\Phi_j$ on both the plasma and control surfaces.\nThus,\na singular value decomposition ${\\mathbfsf{{U}}}{\\mathbfsf{{S}}}{\\mathbfsf{{V}}}^T$ for the transfer matrix can be constructed\nas follows: the columns of ${\\mathbfsf{{U}}}$ represent the (normalized) distributions (\\ref{eq:highAspectRatioBesselDistrib})-(\\ref{eq:highAspectRatioPowerDistrib}) for various $(m,n)$ evaluated on the plasma surface,\nthe columns of ${\\mathbfsf{{V}}}$ represent the (normalized) distributions (\\ref{eq:highAspectRatioBesselDistrib})-(\\ref{eq:highAspectRatioPowerDistrib}) for various $(m,n)$ evaluated on the control surface,\nand the singular values are the ratios of fluxes $\\Phi_j$ between the plasma and control surfaces.\nSince the SVD is unique up to the signs of the singular vectors under suitable assumptions (singular values in decreasing order, matrix is square, etc.),\nthen the SVD constructed above must be ``the'' SVD of the transfer matrix.  The singular values $\\sigma_{m,n}$ are thus\n\n", "itemtype": "equation", "pos": 40908, "prevtext": "\nHere, $y$ is some surface distribution which is solved for in terms of the Neumann boundary condition on the control surface,\nand $G({\\mbox{\\boldmath ${d}$}})$ is a solution of\nLaplace's equation with a singularity at ${\\mbox{\\boldmath ${d}$}}=0$, such as a monopole or dipole.\nThe sources are outside the control volume (by a finite or infinitesimal distance) and are not physical, introduced to span the space of possible solutions\nto Laplace's equation inside the control surface,\nso $G$ can be the monopole function $1/|{\\mbox{\\boldmath ${d}$}}|$ even for this magnetic field calculation.\nFor surface source distribution methods, one can choose the surface on which the sources are located\n(i.e. the integration surface in (\\ref{eq:surfaceSource})) to either be infinitesimally outside the control surface,\nor it can be a distinct third surface which is outside the control surface by a finite distance.\nIn the latter case, the transfer matrix must be independent of the specific choice of outermost surface\nif the calculation is well resolved numerically, since the transfer matrix is originally defined without reference to this third surface.\nFor good numerical convergence, this outer surface must be far from the control surface compared to the spacing of integration points,\nbut not so far that the coupling between outer and control surfaces is poorly conditioned.\nThe 3-surface method has the disadvantage that selecting a third surface shape which is an appropriate distance from the control surface\nsometimes requires manual adjustments; however the 2-surface source distribution method and Green's theorem method\nhave the disadvantage that one must carefully integrate over\na singularity at the point ${\\mbox{\\boldmath ${r}$}}'={\\mbox{\\boldmath ${r}$}}$, as in (\\ref{eq:surfaceSource}).\nThese singularities may be handled using specialized quadrature rules, or using the remarkable regularization\ntechnique of Merkel \\cite{merkel_nestor,merkel_varenna} in which one adds and subtracts a singular function that can be integrated analytically.\n(Note that the appendix of \\cite{merkel_nestor} contains many typographic errors.\nReaders should refer instead to \\cite{merkel_varenna} which contains the correct equations.)\n\nFor any of these schemes, the transfer matrix is computed using a similar sequence of steps.\nFirst, a dense matrix is assembled which relates either $\\phi({\\mbox{\\boldmath ${r}$}})$ (in the Green's theorem method)\nor $y({\\mbox{\\boldmath ${r}$}})$ (in the surface source method) on the outermost surface to $B_n$ on the control surface.\nThe inverse of this matrix is left-multiplied by another matrix that relates\n$\\phi({\\mbox{\\boldmath ${r}$}})$ or $y({\\mbox{\\boldmath ${r}$}})$ on the outermost surface to $B_n$ on the plasma surface.\nFor example, the method described in \\cite{boozer2015} for computing the transfer matrix\nis a 3-surface source distribution method with dipole sources.\nOne computes the outer-to-plasma-surface and outer-to-control-surface inductance matrices\n${\\mathbfsf{{M}}}^{(p,o)}$ and ${\\mathbfsf{{M}}}^{(c,o)}$, and then the transfer matrix follows from ${\\mathbfsf{{T}}} = {\\mathbfsf{{M}}}^{(p,o)} ({\\mathbfsf{{M}}}^{(c,o)})^{-1}$.\nThis method amounts to spanning the set\nof solutions to Laplace's equation using dipoles on the outer surface, where the dipole amplitudes are chosen to satisfy the\nNeumann boundary condition on the control surface.\n\n\nFor results shown here, we use two different surface source distribution methods,\nboth the 2-surface scheme with monopole source distribution\nand Merkel's regularization, and the 3-surface scheme with dipole source distribution,\nand we have verified the two approaches give identical results as a check of correctness.\nFor the 2-surface method, we use the same uniform $(\\theta,\\zeta)$ grid for $y$ and $B_n$.\n\n\n\n\\section{Circular axisymmetric surfaces}\n\\label{sec:axisymm}\n\nTo gain familiarity with the transfer and inductance matrices and their SVDs,\nlet us first consider the case in which both the plasma and control surfaces are axisymmetric,\nthough the magnetic field distributions we consider may be nonaxisymmetric.\nWe begin by analyzing the cylindrical limit, corresponding to large aspect ratio and circular cross section of the surfaces.\nIn this limit, we can compute the singular values and vectors of the transfer and inductance matrices analytically,\nbecause the singular vectors correspond to separable solutions of Laplace's equation\nfor the scalar magnetic potential $\\phi$ in cylindrical geometry.\nThis correspondence can be understood as follows.\nLaplace's equation becomes\n\n", "index": 43, "text": "\\begin{equation}\n\\frac{1}{r} \\frac{\\partial}{\\partial r} \\left( r \\frac{\\partial \\phi}{\\partial r}\\right)\n+ \\frac{1}{r^2} \\frac{\\partial^2 \\phi}{\\partial \\theta^2} + \\frac{1}{R^2} \\frac{\\partial^2 \\phi}{\\partial \\zeta^2}\n=0\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E22.m1\" class=\"ltx_Math\" alttext=\"\\frac{1}{r}\\frac{\\partial}{\\partial r}\\left(r\\frac{\\partial\\phi}{\\partial r}%&#10;\\right)+\\frac{1}{r^{2}}\\frac{\\partial^{2}\\phi}{\\partial\\theta^{2}}+\\frac{1}{R^%&#10;{2}}\\frac{\\partial^{2}\\phi}{\\partial\\zeta^{2}}=0\" display=\"block\"><mrow><mrow><mrow><mfrac><mn>1</mn><mi>r</mi></mfrac><mo>⁢</mo><mfrac><mo>∂</mo><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>(</mo><mrow><mi>r</mi><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>ϕ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>r</mi></mrow></mfrac></mrow><mo>)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><msup><mi>r</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><mrow><msup><mo>∂</mo><mn>2</mn></msup><mo>⁡</mo><mi>ϕ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>θ</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><msup><mi>R</mi><mn>2</mn></msup></mfrac><mo>⁢</mo><mfrac><mrow><msup><mo>∂</mo><mn>2</mn></msup><mo>⁡</mo><mi>ϕ</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><msup><mi>ζ</mi><mn>2</mn></msup></mrow></mfrac></mrow></mrow><mo>=</mo><mn>0</mn></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor the $n \\ne 0$ fields (\\ref{eq:highAspectRatioBesselDistrib}),\nwhere $a_P$ and $a_C$ are the minor radii of the plasma and control surfaces, and\n\n", "itemtype": "equation", "pos": 42915, "prevtext": "\nwhere $R \\approx$ constant.  Some of the separable solutions are\n\\begin{eqnarray}\n\\phi\n&=& y^s_{m,n} \\sin(m\\theta-n\\zeta) I_m\\left(\\frac{n r}{R}\\right) \\;\\;\\mbox{and} \\label{eq:highAspectRatioBesselDistrib} \\\\\n&& y^c_{m,n} \\cos(m\\theta-n\\zeta) I_m\\left(\\frac{n r}{R}\\right) \\nonumber\n\\end{eqnarray}\nfor integers $m$ and $n \\ne 0$, where $I_m$ is the modified Bessel function,\nand $y^s_{m,n}$ and $y^c_{m,n}$ are arbitrary constants.\nThere are also ``axisymmetric'' solutions\n\\begin{eqnarray}\n\\phi\n&=&\ny^s_{m,0} \\sin(m\\theta) r ^ m \\;\\; \\mbox{and} \\label{eq:highAspectRatioPowerDistrib} \\\\\n&& y^c_{m,0} \\cos(m\\theta) r ^ m. \\nonumber\n\\end{eqnarray}\nForming $B_n = \\partial \\phi/\\partial r$ and noting the weight $w$ is $\\approx$ constant,\nthese fields represent orthogonal flux vectors $\\Phi_j$ on both the plasma and control surfaces.\nThus,\na singular value decomposition ${\\mathbfsf{{U}}}{\\mathbfsf{{S}}}{\\mathbfsf{{V}}}^T$ for the transfer matrix can be constructed\nas follows: the columns of ${\\mathbfsf{{U}}}$ represent the (normalized) distributions (\\ref{eq:highAspectRatioBesselDistrib})-(\\ref{eq:highAspectRatioPowerDistrib}) for various $(m,n)$ evaluated on the plasma surface,\nthe columns of ${\\mathbfsf{{V}}}$ represent the (normalized) distributions (\\ref{eq:highAspectRatioBesselDistrib})-(\\ref{eq:highAspectRatioPowerDistrib}) for various $(m,n)$ evaluated on the control surface,\nand the singular values are the ratios of fluxes $\\Phi_j$ between the plasma and control surfaces.\nSince the SVD is unique up to the signs of the singular vectors under suitable assumptions (singular values in decreasing order, matrix is square, etc.),\nthen the SVD constructed above must be ``the'' SVD of the transfer matrix.  The singular values $\\sigma_{m,n}$ are thus\n\n", "index": 45, "text": "\\begin{equation}\n\\sigma_{m,n} = \\frac{\\Phi_P}{\\Phi_C} = \\frac{a_P}{a_C}\n\\left[\n\\frac{I_{m-1}\\left( \\frac{n a_P}{R}\\right) + I_{m+1}\\left( \\frac{n a_P}{R}\\right)}\n{I_{m-1}\\left( \\frac{n a_C}{R}\\right) + I_{m+1}\\left( \\frac{n a_C}{R}\\right)}\n\\right]\n\\label{eq:highAspectRatioBesselSV}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E23.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{m,n}=\\frac{\\Phi_{P}}{\\Phi_{C}}=\\frac{a_{P}}{a_{C}}\\left[\\frac{I_{m-1}%&#10;\\left(\\frac{na_{P}}{R}\\right)+I_{m+1}\\left(\\frac{na_{P}}{R}\\right)}{I_{m-1}%&#10;\\left(\\frac{na_{C}}{R}\\right)+I_{m+1}\\left(\\frac{na_{C}}{R}\\right)}\\right]\" display=\"block\"><mrow><msub><mi>σ</mi><mrow><mi>m</mi><mo>,</mo><mi>n</mi></mrow></msub><mo>=</mo><mfrac><msub><mi mathvariant=\"normal\">Φ</mi><mi>P</mi></msub><msub><mi mathvariant=\"normal\">Φ</mi><mi>C</mi></msub></mfrac><mo>=</mo><mrow><mfrac><msub><mi>a</mi><mi>P</mi></msub><msub><mi>a</mi><mi>C</mi></msub></mfrac><mo>⁢</mo><mrow><mo>[</mo><mfrac><mrow><mrow><msub><mi>I</mi><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><msub><mi>a</mi><mi>P</mi></msub></mrow><mi>R</mi></mfrac><mo>)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>I</mi><mrow><mi>m</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><msub><mi>a</mi><mi>P</mi></msub></mrow><mi>R</mi></mfrac><mo>)</mo></mrow></mrow></mrow><mrow><mrow><msub><mi>I</mi><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><msub><mi>a</mi><mi>C</mi></msub></mrow><mi>R</mi></mfrac><mo>)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>I</mi><mrow><mi>m</mi><mo>+</mo><mn>1</mn></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mfrac><mrow><mi>n</mi><mo>⁢</mo><msub><mi>a</mi><mi>C</mi></msub></mrow><mi>R</mi></mfrac><mo>)</mo></mrow></mrow></mrow></mfrac><mo>]</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor the $n=0$ fields (\\ref{eq:highAspectRatioPowerDistrib}).\nOne can see from these formulae\nthat in the limit that the plasma and control surfaces approach each other, $a_P/a_C \\to 1$, the singular values become 1.\n\nIf $n$ is not as large as the aspect ratio of the surfaces,\nthe Bessel functions in (\\ref{eq:highAspectRatioBesselSV}) can be expanded for small argument, giving\n$\\sigma_{m,n} \\approx (a_P / a_C) ^ m$ for $m \\ge 1$, or $\\sigma_{m,n} \\approx (a_P / a_C)^2$ for $m=0$.\nIn the latter case, it is interesting that the singular value becomes independent of the\nphysical wavelength $2\\pi R/n$, so the $m=0$ distributions are actually less efficient (i.e. have singular values that are smaller by $a_P / a_C$)\nthan the shorter wavelength $m=1$ distributions.  The $m=0$ distributions\nare comparable in efficiency to the $m=2$ distributions.\n\n\nA similar analysis can be done in this cylindrical limit to compute the singular values of the inductance matrix.\nIn this case, we must also consider the Laplace equation solutions which extend outside the control surface to infinity,\nreplacing $r^m \\to r^{-m}$ in (\\ref{eq:highAspectRatioPowerDistrib}) and $I_m \\to K_m$ (the modified\nBessel function of the second kind) in (\\ref{eq:highAspectRatioBesselDistrib}).\nContinuity of $B_r$ at the control surface is imposed, as is a jump condition on the tangential magnetic field\nassociated with the surface current. Supposing the current potential has the form\n\n", "itemtype": "equation", "pos": 43361, "prevtext": "\nfor the $n \\ne 0$ fields (\\ref{eq:highAspectRatioBesselDistrib}),\nwhere $a_P$ and $a_C$ are the minor radii of the plasma and control surfaces, and\n\n", "index": 47, "text": "\\begin{equation}\n\\sigma_{m,0} = \\left( a_P / a_C \\right) ^m\n\\label{eq:highAspectRatioPowerSV}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E24.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{m,0}=\\left(a_{P}/a_{C}\\right)^{m}\" display=\"block\"><mrow><msub><mi>σ</mi><mrow><mi>m</mi><mo>,</mo><mn>0</mn></mrow></msub><mo>=</mo><msup><mrow><mo>(</mo><mrow><msub><mi>a</mi><mi>P</mi></msub><mo>/</mo><msub><mi>a</mi><mi>C</mi></msub></mrow><mo>)</mo></mrow><mi>m</mi></msup></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor some $\\kappa^s_{m,n}, \\kappa^c_{m,n}$, we thereby obtain the radial magnetic field inside the control surface to be\n\\begin{eqnarray}\nB_r &=&\n -\\frac{\\mu_0 n}{2R}\n\\left[\n\\frac{I_{m-1}\\left(\\frac{n a_C}{R}\\right) + I_{m+1}\\left(\\frac{n a_C}{R}\\right)}\n{K_{m-1}\\left(\\frac{n a_C}{R}\\right) + K_{m+1}\\left(\\frac{n a_C}{R}\\right)}\nK_m\\left(\\frac{n a_C}{R}\\right)\n+ I_m\\left(\\frac{n a_C}{R}\\right) \\right]^{-1}\n\\left[I_{m-1}\\left(\\frac{n r}{R}\\right) + I_{m+1}\\left(\\frac{n r}{R}\\right) \\right] \\nonumber \\\\\n&&\\times\n\\left[ \\kappa^s_{m,n} \\sin(m\\theta-n\\zeta) + \\kappa^c_{m,n} \\cos(m\\theta-n\\zeta) \\right]\n\\end{eqnarray}\nwhen $n \\ne 0$, and\n\n", "itemtype": "equation", "pos": 44932, "prevtext": "\nfor the $n=0$ fields (\\ref{eq:highAspectRatioPowerDistrib}).\nOne can see from these formulae\nthat in the limit that the plasma and control surfaces approach each other, $a_P/a_C \\to 1$, the singular values become 1.\n\nIf $n$ is not as large as the aspect ratio of the surfaces,\nthe Bessel functions in (\\ref{eq:highAspectRatioBesselSV}) can be expanded for small argument, giving\n$\\sigma_{m,n} \\approx (a_P / a_C) ^ m$ for $m \\ge 1$, or $\\sigma_{m,n} \\approx (a_P / a_C)^2$ for $m=0$.\nIn the latter case, it is interesting that the singular value becomes independent of the\nphysical wavelength $2\\pi R/n$, so the $m=0$ distributions are actually less efficient (i.e. have singular values that are smaller by $a_P / a_C$)\nthan the shorter wavelength $m=1$ distributions.  The $m=0$ distributions\nare comparable in efficiency to the $m=2$ distributions.\n\n\nA similar analysis can be done in this cylindrical limit to compute the singular values of the inductance matrix.\nIn this case, we must also consider the Laplace equation solutions which extend outside the control surface to infinity,\nreplacing $r^m \\to r^{-m}$ in (\\ref{eq:highAspectRatioPowerDistrib}) and $I_m \\to K_m$ (the modified\nBessel function of the second kind) in (\\ref{eq:highAspectRatioBesselDistrib}).\nContinuity of $B_r$ at the control surface is imposed, as is a jump condition on the tangential magnetic field\nassociated with the surface current. Supposing the current potential has the form\n\n", "index": 49, "text": "\\begin{equation}\n\\kappa(\\theta,\\zeta) = \\kappa^s_{m,n} \\sin(m\\theta-n\\zeta) + \\kappa^c_{m,n} \\cos(m\\theta-n\\zeta)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E25.m1\" class=\"ltx_Math\" alttext=\"\\kappa(\\theta,\\zeta)=\\kappa^{s}_{m,n}\\sin(m\\theta-n\\zeta)+\\kappa^{c}_{m,n}\\cos%&#10;(m\\theta-n\\zeta)\" display=\"block\"><mrow><mrow><mi>κ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo>,</mo><mi>ζ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msubsup><mi>κ</mi><mrow><mi>m</mi><mo>,</mo><mi>n</mi></mrow><mi>s</mi></msubsup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo>-</mo><mrow><mi>n</mi><mo>⁢</mo><mi>ζ</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><msubsup><mi>κ</mi><mrow><mi>m</mi><mo>,</mo><mi>n</mi></mrow><mi>c</mi></msubsup><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo>-</mo><mrow><mi>n</mi><mo>⁢</mo><mi>ζ</mi></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhen $n=0$.\nComputing the magnetic flux $\\Phi_P$ on the plasma surface and the current $I_C$ on the control surface,\nthe singular values $\\sigma_{m,n}$ then follow from their ratio:\n\\begin{eqnarray}\n\\sigma_{m,n}&=&\\left| \\frac{\\Phi_P}{I_C}\\right| \\label{eq:highAspectRatioInductanceBesselSV} \\\\\n&=& 2\\pi^2 n \\mu_0 a_P\n\\left[\n\\frac{I_{m-1}\\left(\\frac{n a_C}{R}\\right) + I_{m+1}\\left(\\frac{n a_C}{R}\\right)}\n{K_{m-1}\\left(\\frac{n a_C}{R}\\right) + K_{m+1}\\left(\\frac{n a_C}{R}\\right)}\nK_m\\left(\\frac{n a_C}{R}\\right)\n+ I_m\\left(\\frac{n a_C}{R}\\right) \\right]^{-1}\n\\left[I_{m-1}\\left(\\frac{n a_P}{R}\\right) + I_{m+1}\\left(\\frac{n a_P}{R}\\right) \\right] \\nonumber\n\\end{eqnarray}\nwhen $n \\ne 0$, and\n\n", "itemtype": "equation", "pos": 45700, "prevtext": "\nfor some $\\kappa^s_{m,n}, \\kappa^c_{m,n}$, we thereby obtain the radial magnetic field inside the control surface to be\n\\begin{eqnarray}\nB_r &=&\n -\\frac{\\mu_0 n}{2R}\n\\left[\n\\frac{I_{m-1}\\left(\\frac{n a_C}{R}\\right) + I_{m+1}\\left(\\frac{n a_C}{R}\\right)}\n{K_{m-1}\\left(\\frac{n a_C}{R}\\right) + K_{m+1}\\left(\\frac{n a_C}{R}\\right)}\nK_m\\left(\\frac{n a_C}{R}\\right)\n+ I_m\\left(\\frac{n a_C}{R}\\right) \\right]^{-1}\n\\left[I_{m-1}\\left(\\frac{n r}{R}\\right) + I_{m+1}\\left(\\frac{n r}{R}\\right) \\right] \\nonumber \\\\\n&&\\times\n\\left[ \\kappa^s_{m,n} \\sin(m\\theta-n\\zeta) + \\kappa^c_{m,n} \\cos(m\\theta-n\\zeta) \\right]\n\\end{eqnarray}\nwhen $n \\ne 0$, and\n\n", "index": 51, "text": "\\begin{equation}\nB_r = -\\frac{\\mu_0 m}{2}\n\\frac{r^{m-1}}{a_C^m}\n\\left[ \\kappa^s_{m,0} \\sin(m\\theta) + \\kappa^c_{m,0} \\cos(m\\theta) \\right]\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E26.m1\" class=\"ltx_Math\" alttext=\"B_{r}=-\\frac{\\mu_{0}m}{2}\\frac{r^{m-1}}{a_{C}^{m}}\\left[\\kappa^{s}_{m,0}\\sin(m%&#10;\\theta)+\\kappa^{c}_{m,0}\\cos(m\\theta)\\right]\" display=\"block\"><mrow><msub><mi>B</mi><mi>r</mi></msub><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mrow><msub><mi>μ</mi><mn>0</mn></msub><mo>⁢</mo><mi>m</mi></mrow><mn>2</mn></mfrac><mo>⁢</mo><mfrac><msup><mi>r</mi><mrow><mi>m</mi><mo>-</mo><mn>1</mn></mrow></msup><msubsup><mi>a</mi><mi>C</mi><mi>m</mi></msubsup></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msubsup><mi>κ</mi><mrow><mi>m</mi><mo>,</mo><mn>0</mn></mrow><mi>s</mi></msubsup><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><msubsup><mi>κ</mi><mrow><mi>m</mi><mo>,</mo><mn>0</mn></mrow><mi>c</mi></msubsup><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>]</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nfor $n=0$.\nThese formulae, unlike those for the transfer matrix,\nremain dependent on $m$, $n$, and the aspect\nratio even when the plasma and control surfaces coincide,\n$a_P / a_C \\to 1$.\n\nSome insight into (\\ref{eq:highAspectRatioInductanceBesselSV}) can be gained by\nexpanding the Bessel functions for small argument, which is valid when $n$ is below the aspect ratio. In this case,\nwhen $m$ is nonzero, we obtain again (\\ref{eq:highAspectRatioInductancePowerSV}), indicating\nthe singular values are nearly independent of $n$. However, when $m=0$, the expansion of (\\ref{eq:highAspectRatioInductanceBesselSV})\nyields instead\n\n", "itemtype": "equation", "pos": 46548, "prevtext": "\nwhen $n=0$.\nComputing the magnetic flux $\\Phi_P$ on the plasma surface and the current $I_C$ on the control surface,\nthe singular values $\\sigma_{m,n}$ then follow from their ratio:\n\\begin{eqnarray}\n\\sigma_{m,n}&=&\\left| \\frac{\\Phi_P}{I_C}\\right| \\label{eq:highAspectRatioInductanceBesselSV} \\\\\n&=& 2\\pi^2 n \\mu_0 a_P\n\\left[\n\\frac{I_{m-1}\\left(\\frac{n a_C}{R}\\right) + I_{m+1}\\left(\\frac{n a_C}{R}\\right)}\n{K_{m-1}\\left(\\frac{n a_C}{R}\\right) + K_{m+1}\\left(\\frac{n a_C}{R}\\right)}\nK_m\\left(\\frac{n a_C}{R}\\right)\n+ I_m\\left(\\frac{n a_C}{R}\\right) \\right]^{-1}\n\\left[I_{m-1}\\left(\\frac{n a_P}{R}\\right) + I_{m+1}\\left(\\frac{n a_P}{R}\\right) \\right] \\nonumber\n\\end{eqnarray}\nwhen $n \\ne 0$, and\n\n", "index": 53, "text": "\\begin{equation}\n\\sigma_{m,0} = 2 \\pi^2 m \\mu_0 R \\left( a_P / a_C \\right)^m\n\\label{eq:highAspectRatioInductancePowerSV}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E27.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{m,0}=2\\pi^{2}m\\mu_{0}R\\left(a_{P}/a_{C}\\right)^{m}\" display=\"block\"><mrow><msub><mi>σ</mi><mrow><mi>m</mi><mo>,</mo><mn>0</mn></mrow></msub><mo>=</mo><mrow><mn>2</mn><mo>⁢</mo><msup><mi>π</mi><mn>2</mn></msup><mo>⁢</mo><mi>m</mi><mo>⁢</mo><msub><mi>μ</mi><mn>0</mn></msub><mo>⁢</mo><mi>R</mi><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><msub><mi>a</mi><mi>P</mi></msub><mo>/</mo><msub><mi>a</mi><mi>C</mi></msub></mrow><mo>)</mo></mrow><mi>m</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThis expression indicates the singular values actually grow like $n^2$,\nso the dominant singular vectors correspond to short wavelengths rather than long wavelengths.\nThis behavior is one instance of a phenomenon mentioned in the introduction:\nthe inductance matrix sometimes treats long-wavelength field distributions as inefficient,\nbecause the field is driven by the \\emph{gradient} of the current potential,\nand this gradient is small for long wavelengths.\nAt sufficiently large $n$ however the approximation leading to (\\ref{eq:growingWithN}) breaks down,\nand the singular values begin to decrease with $n$.\n\nFor the geometries in figure \\ref{fig:geometry},\nthe singular values of both transfer and inductance matrices\ncomputed using these approximate analytic formulae are shown in figure\n\\ref{fig:plotSingularValsVsMAndNForPaper1}.\nThe singular values of the inductance matrix have been normalized to the characteristic value\n$2\\pi^2 \\mu_0 R$ so the largest singular values are $O(1)$.\nOverall, the distributions of singular values for the transfer and inductance matrices are quite similar,\naside from two factors. First, the $m=0$ behavior is different, as already discussed, with the singular values\nof the transfer matrix decreasing monotonically with $n$ whereas those of the inductance matrix peak at intermediate $n$.\nSecond, the singular values of the transfer matrix generally decrease faster with $m$ and $n$ compared to\nthe singular values of the inductance matrix, and so a different color scale is used for the two matrices\nin the figure.  The physical reason for this different rate of decrease is the same effect described in the previous paragraph.\n\n\\begin{figure}[h!]\n\n\\includegraphics{m20151111_01_geometryIllustrationForBdistribPaper.png}\n\\caption{(Color online)\nGeometries used for figures \\ref{fig:plotSingularValsVsMAndNForPaper1}\nand \\ref{fig:plotSingularValsVsMAndNForPaper2}.\nThe ratio $a_C/a_P$ (minor radius of the control surface divided by that of the plasma\nsurface) is 1.7 in all three cases.\n\\label{fig:geometry}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\n\\includegraphics{plotSingularValsVsMAndNForPaper1.pdf}\n\\caption{(Color online)\nSingular values of the transfer and inductance matrices, computed\nusing the approximate analytic expressions\n(\\ref{eq:highAspectRatioBesselSV}),\n(\\ref{eq:highAspectRatioPowerSV}),\n(\\ref{eq:highAspectRatioInductanceBesselSV}),\nand (\\ref{eq:highAspectRatioInductancePowerSV}),\nvalid for large aspect ratio and circular cross section.\nResults are shown for three values of aspect ratio, using $a_C / a_P = 1.7$.\nThe inductance matrix singular values have been normalized by $2\\pi^2 \\mu_0 R$.\nNote the color scale is different for the transfer and inductance matrices.\nRed dashed curves are ellipses with major (minor) axes $n_0$ ($m_0$)\nrelated by (\\ref{eq:equivalentNAndM}).\n\\label{fig:plotSingularValsVsMAndNForPaper1}}\n\\end{figure}\n\n\nOne practical consequence of the analysis in this section is that we can analytically\ndetermine the toroidal mode numbers which can be controlled with comparable\nefficiency to given poloidal mode numbers. In other words, given some poloidal mode number $m_0$,\nwhat is the toroidal mode number $n_0$ such that the $(m=m_0,n=0)$ and $(m=0,n=n_0)$ modes\nhave comparable efficiency, as determined by the singular values?\nTo proceed, we compute $\\sigma_{m=0,n=n_0}$ from (\\ref{eq:highAspectRatioBesselSV}),\nexpanding the Bessel functions for large argument, $I_m(x) \\approx e^x/\\sqrt{2\\pi x}$.\nEquating the result to $\\sigma_{m=m_0,n=0}$ from (\\ref{eq:highAspectRatioPowerSV}), we find\n\n", "itemtype": "equation", "pos": 47310, "prevtext": "\nfor $n=0$.\nThese formulae, unlike those for the transfer matrix,\nremain dependent on $m$, $n$, and the aspect\nratio even when the plasma and control surfaces coincide,\n$a_P / a_C \\to 1$.\n\nSome insight into (\\ref{eq:highAspectRatioInductanceBesselSV}) can be gained by\nexpanding the Bessel functions for small argument, which is valid when $n$ is below the aspect ratio. In this case,\nwhen $m$ is nonzero, we obtain again (\\ref{eq:highAspectRatioInductancePowerSV}), indicating\nthe singular values are nearly independent of $n$. However, when $m=0$, the expansion of (\\ref{eq:highAspectRatioInductanceBesselSV})\nyields instead\n\n", "index": 55, "text": "\\begin{equation}\n\\sigma_{0,n} \\approx 2 \\pi^2 n^2 \\mu_0 a_P^2 / R.\n\\label{eq:growingWithN}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E28.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{0,n}\\approx 2\\pi^{2}n^{2}\\mu_{0}a_{P}^{2}/R.\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mrow><mn>0</mn><mo>,</mo><mi>n</mi></mrow></msub><mo>≈</mo><mrow><mrow><mn>2</mn><mo>⁢</mo><msup><mi>π</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>n</mi><mn>2</mn></msup><mo>⁢</mo><msub><mi>μ</mi><mn>0</mn></msub><mo>⁢</mo><msubsup><mi>a</mi><mi>P</mi><mn>2</mn></msubsup></mrow><mo>/</mo><mi>R</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nIn figure \\ref{fig:plotSingularValsVsMAndNForPaper1} we show ellipses in $(m,n)$-space,\nwhere the extent in $n$ is determined by (\\ref{eq:equivalentNAndM}) for several\nchoices of $m_0$.  It can be seen that (\\ref{eq:equivalentNAndM}) indeed gives\nquite an accurate estimate for the range of $m$ and $n$ which have comparable efficiency.\nWhile (\\ref{eq:equivalentNAndM}) was derived based on the transfer matrix singular values,\nit does not appear possible to form such an explicit expression for the inductance matrix singular values\ndue to their more complicated dependence on $m$ and $n$.\nHowever the transfer and inductance matrix contours in figure \\ref{fig:plotSingularValsVsMAndNForPaper1}\nare quite similar.\n\nNext, we compare these analytic results to direct numerical calculations which\nfully account for toroidal effects.\nFirst considering only axisymmetric basis functions for simplicity,\nresults are shown in figure \\ref{fig:highAspectRatioNtor0}\nfor three values of the minor radius of the plasma surface,\ntaking the aspect ratio of the control surface to be\n$R/a_C = 10$.\nThe agreement with (\\ref{eq:highAspectRatioPowerSV}) and (\\ref{eq:highAspectRatioInductancePowerSV}) is extremely close.\nThe $B_n$ distributions given by the singular vectors are found to correspond\nnearly exactly to Fourier modes of increasing $m$, as expected,\ncoming in pairs with $\\sin(m\\theta)$ or $\\cos(m\\theta)$ symmetry.\nThe factor of $m$ in (\\ref{eq:highAspectRatioInductancePowerSV}) which is not present\nin (\\ref{eq:highAspectRatioPowerSV}) causes the singular values of the inductance matrix to decrease\nless rapidly than those of the transfer matrix, particularly at low $n$.\n\nNext, we consider the set of basis functions given by various $n$ for $m=0$,\nwith results shown in figure \\ref{fig:highAspectRatioMpol0}.\nExcellent agreement is seen with the analytical results (\\ref{eq:highAspectRatioBesselSV}) and\n(\\ref{eq:highAspectRatioInductanceBesselSV}).\nAs expected, the $B_n$ distributions given by the singular vectors are found to correspond\nnearly exactly to Fourier modes of increasing $n$ for the transfer matrix, and to\nFourier modes of \\emph{decreasing} $n$ for the inductance matrix.\nFor these figures, numerical parameters used were $N_{\\theta} = 64$ and $N_{\\zeta} = 256$.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20150914_01_bdistribPaper_plotHighAspectRatioNtor0.pdf}\n\\includegraphics[width=3in]{m20151003_01_bdistrib_inductanceSingVals_HighAspectRatioNtor0.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer matrix and (b) inductance matrix\nfor surfaces of circular cross-section\nat high aspect ratio, considering only axisymmetric basis functions.\nFully toroidal numerical calculations agree extremely well with the predictions (\\ref{eq:highAspectRatioPowerSV})\nand (\\ref{eq:highAspectRatioInductancePowerSV})\nfrom the separable cylindrical solutions to Laplace's equation.\nThe singular values appear in pairs because both sine and cosine\nphases are permitted.\n\\label{fig:highAspectRatioNtor0}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20150914_02_bdistribPaper_plotHighAspectRatioMpol0.pdf}\n\\includegraphics[width=3in]{m20150914_02_bdistrib_inductanceSingVals_mpol0.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer matrix and (b) inductance matrix for surfaces of circular cross-section\nat high aspect ratio, considering only poloidally constant basis functions.\nFully    toroidal numerical calculations agree extremely well with the predictions (\\ref{eq:highAspectRatioBesselSV}) and (\\ref{eq:highAspectRatioInductanceBesselSV})\nfrom the separable cylindrical solutions to Laplace's equation.\n\\label{fig:highAspectRatioMpol0}}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\n\\includegraphics{plotSingularValsVsMAndNForPaper2.pdf}\n\\caption{(Color online)\nSingular values of the transfer and inductance matrices,\ncomputed using direct numerical simulation and\nfully accounting for toroidal effects, sorted by dominant poloidal and toroidal mode numbers $(m,n)$.\nResults are shown for three values of aspect ratio, using $a_C / a_P = 1.7$.\nThe inductance matrix singular values have been normalized by $2\\pi^2 \\mu_0 R$.\nNote the color scale is different for the transfer and inductance matrices.\nThe similarity to figure \\ref{fig:plotSingularValsVsMAndNForPaper1} demonstrates\nthe good accuracy of the analytic formulae even at finite aspect ratio.\n\\label{fig:plotSingularValsVsMAndNForPaper2}}\n\\end{figure}\n\n\n\nFigure \\ref{fig:plotSingularValsVsMAndNForPaper2} mirrors figure \\ref{fig:plotSingularValsVsMAndNForPaper1},\nbut showing data from the fully toroidal numerical calculation.\nIn this calculation each singular vector contains a mixture of $m$ and $n$ values,\nso the figure shows the singular value associated with the left singular vector that has maximal\namplitude of each given $(m,n)$.\nFigures \\ref{fig:plotSingularValsVsMAndNForPaper1} and \\ref{fig:plotSingularValsVsMAndNForPaper2} are not exactly identical,\ndue to toroidal effects which are not accounted for in the analytic expressions\nplotted in the former figure.\nHowever, the agreement is generally quite good, demonstrating that the analytic expressions\n(\\ref{eq:highAspectRatioBesselSV}),\n(\\ref{eq:highAspectRatioPowerSV}),\n(\\ref{eq:highAspectRatioInductanceBesselSV}),\nand (\\ref{eq:highAspectRatioInductancePowerSV})\nare remarkably accurate even at realistic values of aspect ratio.\nThe predicted non-monotonic $n$ dependence of the $m=0$ singular values of the inductance matrix\ncan be clearly seen.\n\nEquations (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV})\nand (\\ref{eq:highAspectRatioInductanceBesselSV})-(\\ref{eq:highAspectRatioInductancePowerSV}) may\nactually be useful in applications that do not directly involve the transfer or inductance matrices,\nsince they provide an efficiency ordering to pairs of poloidal and toroidal mode numbers $(m,n)$.\nFor example, considering the Dommaschk potentials \\cite{Dommaschk} for vacuum magnetic fields,\nthe potentials for various $(m,n)$ numbers can be sorted by $\\sigma_{m,n}$ to order them by efficiency.\n\nFinally, figure \\ref{fig:aspectRatio3} illustrates the behavior of the transfer matrix SVD at finite aspect ratio.\nFigure \\ref{fig:aspectRatio3}.a shows the geometry, with the plasma aspect ratio $R/a_P$ taken to be 3, and $a_C/a_P$ chosen to be 1.7, representing a reasonable\ndistance from the plasma at which control coils might be placed.\nConsidering both sine and cosine symmetries, figure \\ref{fig:aspectRatio3}.b shows there are approximately 500 distributions\nof $B_n$\nwith singular values above 0.01.\nFor comparison, the results of (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV})\nare also plotted, although the large-aspect-ratio approximation used to derive these analytic results\nis not very well satisfied.  Despite this questionable approximation, the analytic method\ndoes a good job of predicting the distribution of the `true' (numerical) singular values.\nNumerical parameters used were $N_\\theta = 64$, $N_\\zeta = 256$, $m_{\\max} = 24$, and $n_{\\max} = 60$.\nWe verified that none of the points in figure \\ref{fig:aspectRatio3} moved\nvisibly when any of the resolution parameters was doubled.\n\nRed crosses in figure \\ref{fig:aspectRatio3}.b show the numerically computed singular values if only the axisymmetric distributions are retained.\nThese singular values correspond to translation, elongation, triangularity, squareness, etc.,\nand they come in pairs (barely visible in the plot) corresponding to sine and cosine symmetry.\nIt can be clearly seen that\nto control $B_n$ to any given tolerance,\nthere are many more nonaxisymmetric degrees of freedom than there are axisymmetric degrees of freedom.\n\n\\begin{figure}[h!]\n\n\\includegraphics[width=3in]{m20151111_02_plotOfTokamakSingularValues1.pdf}\n\\includegraphics[width=3in]{m20151111_02_plotOfTokamakSingularValues2.pdf}\n\\caption{(Color online)\nSingular values for the geometry $R/a_P=3$ and $a_C/a_P = 1.7$ (figure \\ref{fig:geometry}.c).  Values computed by the code are shown as blue circles.\nThe subset of these singular values associated with axisymmetric singular vectors are shown as red crosses.  The cylindrical\nanalytic results (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV}) and\n(\\ref{eq:highAspectRatioInductanceBesselSV})-(\\ref{eq:highAspectRatioInductancePowerSV})\nare shown as green diamonds\nfor comparison.\nFor the inductance matrix, singular values are normalized by $2\\pi^2 \\mu_0 R$.\n\\label{fig:aspectRatio3}}\n\\end{figure}\n\n\n\\section{Shaped axisymmetric surfaces}\n\\label{sec:axisymm_shaped}\n\nNow that the singular vectors and values of the inductance and transfer matrices are known\nfor the case of circular surfaces, we proceed to consider plasma and control surfaces which are axisymmetric but non-circular.\nAt this point we will be able to demonstrate one of our main results: both the inductance and transfer matrix methods can correctly identify the X-point divertor\nshape as being efficient, despite its sharp corner.  We will also give examples of plasma shapes that have low curvature\nand low spectral width, yet are inefficient to produce.\n\nThe four shapes we will consider are shown in figure \\ref{fig:shapes}. The `divertor' shape is taken from a numerical\nGrad-Shafranov solution for the ITER\n15 MA baseline scenario.\nSince our numerical methods presume differentiable surface shapes, the surface at normalized poloidal flux = 0.995 rather than 1 is chosen so the corner at the X-point is very slightly rounded off.\nThe other three shapes are chosen to have small curvature and small spectral width, in the sense that all can be represented\nby Fourier series with 4 or fewer terms:\n\n", "itemtype": "equation", "pos": 50997, "prevtext": "\nThis expression indicates the singular values actually grow like $n^2$,\nso the dominant singular vectors correspond to short wavelengths rather than long wavelengths.\nThis behavior is one instance of a phenomenon mentioned in the introduction:\nthe inductance matrix sometimes treats long-wavelength field distributions as inefficient,\nbecause the field is driven by the \\emph{gradient} of the current potential,\nand this gradient is small for long wavelengths.\nAt sufficiently large $n$ however the approximation leading to (\\ref{eq:growingWithN}) breaks down,\nand the singular values begin to decrease with $n$.\n\nFor the geometries in figure \\ref{fig:geometry},\nthe singular values of both transfer and inductance matrices\ncomputed using these approximate analytic formulae are shown in figure\n\\ref{fig:plotSingularValsVsMAndNForPaper1}.\nThe singular values of the inductance matrix have been normalized to the characteristic value\n$2\\pi^2 \\mu_0 R$ so the largest singular values are $O(1)$.\nOverall, the distributions of singular values for the transfer and inductance matrices are quite similar,\naside from two factors. First, the $m=0$ behavior is different, as already discussed, with the singular values\nof the transfer matrix decreasing monotonically with $n$ whereas those of the inductance matrix peak at intermediate $n$.\nSecond, the singular values of the transfer matrix generally decrease faster with $m$ and $n$ compared to\nthe singular values of the inductance matrix, and so a different color scale is used for the two matrices\nin the figure.  The physical reason for this different rate of decrease is the same effect described in the previous paragraph.\n\n\\begin{figure}[h!]\n\n\\includegraphics{m20151111_01_geometryIllustrationForBdistribPaper.png}\n\\caption{(Color online)\nGeometries used for figures \\ref{fig:plotSingularValsVsMAndNForPaper1}\nand \\ref{fig:plotSingularValsVsMAndNForPaper2}.\nThe ratio $a_C/a_P$ (minor radius of the control surface divided by that of the plasma\nsurface) is 1.7 in all three cases.\n\\label{fig:geometry}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\n\\includegraphics{plotSingularValsVsMAndNForPaper1.pdf}\n\\caption{(Color online)\nSingular values of the transfer and inductance matrices, computed\nusing the approximate analytic expressions\n(\\ref{eq:highAspectRatioBesselSV}),\n(\\ref{eq:highAspectRatioPowerSV}),\n(\\ref{eq:highAspectRatioInductanceBesselSV}),\nand (\\ref{eq:highAspectRatioInductancePowerSV}),\nvalid for large aspect ratio and circular cross section.\nResults are shown for three values of aspect ratio, using $a_C / a_P = 1.7$.\nThe inductance matrix singular values have been normalized by $2\\pi^2 \\mu_0 R$.\nNote the color scale is different for the transfer and inductance matrices.\nRed dashed curves are ellipses with major (minor) axes $n_0$ ($m_0$)\nrelated by (\\ref{eq:equivalentNAndM}).\n\\label{fig:plotSingularValsVsMAndNForPaper1}}\n\\end{figure}\n\n\nOne practical consequence of the analysis in this section is that we can analytically\ndetermine the toroidal mode numbers which can be controlled with comparable\nefficiency to given poloidal mode numbers. In other words, given some poloidal mode number $m_0$,\nwhat is the toroidal mode number $n_0$ such that the $(m=m_0,n=0)$ and $(m=0,n=n_0)$ modes\nhave comparable efficiency, as determined by the singular values?\nTo proceed, we compute $\\sigma_{m=0,n=n_0}$ from (\\ref{eq:highAspectRatioBesselSV}),\nexpanding the Bessel functions for large argument, $I_m(x) \\approx e^x/\\sqrt{2\\pi x}$.\nEquating the result to $\\sigma_{m=m_0,n=0}$ from (\\ref{eq:highAspectRatioPowerSV}), we find\n\n", "index": 57, "text": "\\begin{equation}\nn_0 = \\left(m_0-\\frac{1}{2}\\right)\n\\frac{R}{a_P} \\left(\\frac{a_C}{a_P}-1\\right)^{-1}\n\\ln\\left(\\frac{a_C}{a_P}\\right).\n\\label{eq:equivalentNAndM}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E29.m1\" class=\"ltx_Math\" alttext=\"n_{0}=\\left(m_{0}-\\frac{1}{2}\\right)\\frac{R}{a_{P}}\\left(\\frac{a_{C}}{a_{P}}-1%&#10;\\right)^{-1}\\ln\\left(\\frac{a_{C}}{a_{P}}\\right).\" display=\"block\"><mrow><mrow><msub><mi>n</mi><mn>0</mn></msub><mo>=</mo><mrow><mrow><mo>(</mo><mrow><msub><mi>m</mi><mn>0</mn></msub><mo>-</mo><mfrac><mn>1</mn><mn>2</mn></mfrac></mrow><mo>)</mo></mrow><mo>⁢</mo><mfrac><mi>R</mi><msub><mi>a</mi><mi>P</mi></msub></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mfrac><msub><mi>a</mi><mi>C</mi></msub><msub><mi>a</mi><mi>P</mi></msub></mfrac><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mi>ln</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>a</mi><mi>C</mi></msub><msub><mi>a</mi><mi>P</mi></msub></mfrac><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n(For contrast, we retain 100 terms in the Fourier series for the divertor shape.)\nThe `ellipse' shape is chosen to have the same width, height, and median major radius as the divertor shape.\nThe `peanut' and `H' shapes are chosen just large enough to encircle the divertor shape, so any difficulty generating\nthese two shapes cannot be due to larger distance from a common control surface or coils.\nFor the ellipse, peanut, and H shapes, we have generated MHD equilibrium solutions just as for the divertor shape,\nthis time using the VMEC code \\cite{VMEC1983} run in fixed-boundary mode.\nTo emphasize that the divertor shape has a significantly sharper corner than the other shapes, figure \\ref{fig:curvature}\nshows the curvature (i.e. inverse radius of curvature) of the poloidal cross-section\n\n", "itemtype": "equation", "pos": 60901, "prevtext": "\nIn figure \\ref{fig:plotSingularValsVsMAndNForPaper1} we show ellipses in $(m,n)$-space,\nwhere the extent in $n$ is determined by (\\ref{eq:equivalentNAndM}) for several\nchoices of $m_0$.  It can be seen that (\\ref{eq:equivalentNAndM}) indeed gives\nquite an accurate estimate for the range of $m$ and $n$ which have comparable efficiency.\nWhile (\\ref{eq:equivalentNAndM}) was derived based on the transfer matrix singular values,\nit does not appear possible to form such an explicit expression for the inductance matrix singular values\ndue to their more complicated dependence on $m$ and $n$.\nHowever the transfer and inductance matrix contours in figure \\ref{fig:plotSingularValsVsMAndNForPaper1}\nare quite similar.\n\nNext, we compare these analytic results to direct numerical calculations which\nfully account for toroidal effects.\nFirst considering only axisymmetric basis functions for simplicity,\nresults are shown in figure \\ref{fig:highAspectRatioNtor0}\nfor three values of the minor radius of the plasma surface,\ntaking the aspect ratio of the control surface to be\n$R/a_C = 10$.\nThe agreement with (\\ref{eq:highAspectRatioPowerSV}) and (\\ref{eq:highAspectRatioInductancePowerSV}) is extremely close.\nThe $B_n$ distributions given by the singular vectors are found to correspond\nnearly exactly to Fourier modes of increasing $m$, as expected,\ncoming in pairs with $\\sin(m\\theta)$ or $\\cos(m\\theta)$ symmetry.\nThe factor of $m$ in (\\ref{eq:highAspectRatioInductancePowerSV}) which is not present\nin (\\ref{eq:highAspectRatioPowerSV}) causes the singular values of the inductance matrix to decrease\nless rapidly than those of the transfer matrix, particularly at low $n$.\n\nNext, we consider the set of basis functions given by various $n$ for $m=0$,\nwith results shown in figure \\ref{fig:highAspectRatioMpol0}.\nExcellent agreement is seen with the analytical results (\\ref{eq:highAspectRatioBesselSV}) and\n(\\ref{eq:highAspectRatioInductanceBesselSV}).\nAs expected, the $B_n$ distributions given by the singular vectors are found to correspond\nnearly exactly to Fourier modes of increasing $n$ for the transfer matrix, and to\nFourier modes of \\emph{decreasing} $n$ for the inductance matrix.\nFor these figures, numerical parameters used were $N_{\\theta} = 64$ and $N_{\\zeta} = 256$.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20150914_01_bdistribPaper_plotHighAspectRatioNtor0.pdf}\n\\includegraphics[width=3in]{m20151003_01_bdistrib_inductanceSingVals_HighAspectRatioNtor0.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer matrix and (b) inductance matrix\nfor surfaces of circular cross-section\nat high aspect ratio, considering only axisymmetric basis functions.\nFully toroidal numerical calculations agree extremely well with the predictions (\\ref{eq:highAspectRatioPowerSV})\nand (\\ref{eq:highAspectRatioInductancePowerSV})\nfrom the separable cylindrical solutions to Laplace's equation.\nThe singular values appear in pairs because both sine and cosine\nphases are permitted.\n\\label{fig:highAspectRatioNtor0}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20150914_02_bdistribPaper_plotHighAspectRatioMpol0.pdf}\n\\includegraphics[width=3in]{m20150914_02_bdistrib_inductanceSingVals_mpol0.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer matrix and (b) inductance matrix for surfaces of circular cross-section\nat high aspect ratio, considering only poloidally constant basis functions.\nFully    toroidal numerical calculations agree extremely well with the predictions (\\ref{eq:highAspectRatioBesselSV}) and (\\ref{eq:highAspectRatioInductanceBesselSV})\nfrom the separable cylindrical solutions to Laplace's equation.\n\\label{fig:highAspectRatioMpol0}}\n\\end{figure}\n\n\n\\begin{figure}[h!]\n\n\\includegraphics{plotSingularValsVsMAndNForPaper2.pdf}\n\\caption{(Color online)\nSingular values of the transfer and inductance matrices,\ncomputed using direct numerical simulation and\nfully accounting for toroidal effects, sorted by dominant poloidal and toroidal mode numbers $(m,n)$.\nResults are shown for three values of aspect ratio, using $a_C / a_P = 1.7$.\nThe inductance matrix singular values have been normalized by $2\\pi^2 \\mu_0 R$.\nNote the color scale is different for the transfer and inductance matrices.\nThe similarity to figure \\ref{fig:plotSingularValsVsMAndNForPaper1} demonstrates\nthe good accuracy of the analytic formulae even at finite aspect ratio.\n\\label{fig:plotSingularValsVsMAndNForPaper2}}\n\\end{figure}\n\n\n\nFigure \\ref{fig:plotSingularValsVsMAndNForPaper2} mirrors figure \\ref{fig:plotSingularValsVsMAndNForPaper1},\nbut showing data from the fully toroidal numerical calculation.\nIn this calculation each singular vector contains a mixture of $m$ and $n$ values,\nso the figure shows the singular value associated with the left singular vector that has maximal\namplitude of each given $(m,n)$.\nFigures \\ref{fig:plotSingularValsVsMAndNForPaper1} and \\ref{fig:plotSingularValsVsMAndNForPaper2} are not exactly identical,\ndue to toroidal effects which are not accounted for in the analytic expressions\nplotted in the former figure.\nHowever, the agreement is generally quite good, demonstrating that the analytic expressions\n(\\ref{eq:highAspectRatioBesselSV}),\n(\\ref{eq:highAspectRatioPowerSV}),\n(\\ref{eq:highAspectRatioInductanceBesselSV}),\nand (\\ref{eq:highAspectRatioInductancePowerSV})\nare remarkably accurate even at realistic values of aspect ratio.\nThe predicted non-monotonic $n$ dependence of the $m=0$ singular values of the inductance matrix\ncan be clearly seen.\n\nEquations (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV})\nand (\\ref{eq:highAspectRatioInductanceBesselSV})-(\\ref{eq:highAspectRatioInductancePowerSV}) may\nactually be useful in applications that do not directly involve the transfer or inductance matrices,\nsince they provide an efficiency ordering to pairs of poloidal and toroidal mode numbers $(m,n)$.\nFor example, considering the Dommaschk potentials \\cite{Dommaschk} for vacuum magnetic fields,\nthe potentials for various $(m,n)$ numbers can be sorted by $\\sigma_{m,n}$ to order them by efficiency.\n\nFinally, figure \\ref{fig:aspectRatio3} illustrates the behavior of the transfer matrix SVD at finite aspect ratio.\nFigure \\ref{fig:aspectRatio3}.a shows the geometry, with the plasma aspect ratio $R/a_P$ taken to be 3, and $a_C/a_P$ chosen to be 1.7, representing a reasonable\ndistance from the plasma at which control coils might be placed.\nConsidering both sine and cosine symmetries, figure \\ref{fig:aspectRatio3}.b shows there are approximately 500 distributions\nof $B_n$\nwith singular values above 0.01.\nFor comparison, the results of (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV})\nare also plotted, although the large-aspect-ratio approximation used to derive these analytic results\nis not very well satisfied.  Despite this questionable approximation, the analytic method\ndoes a good job of predicting the distribution of the `true' (numerical) singular values.\nNumerical parameters used were $N_\\theta = 64$, $N_\\zeta = 256$, $m_{\\max} = 24$, and $n_{\\max} = 60$.\nWe verified that none of the points in figure \\ref{fig:aspectRatio3} moved\nvisibly when any of the resolution parameters was doubled.\n\nRed crosses in figure \\ref{fig:aspectRatio3}.b show the numerically computed singular values if only the axisymmetric distributions are retained.\nThese singular values correspond to translation, elongation, triangularity, squareness, etc.,\nand they come in pairs (barely visible in the plot) corresponding to sine and cosine symmetry.\nIt can be clearly seen that\nto control $B_n$ to any given tolerance,\nthere are many more nonaxisymmetric degrees of freedom than there are axisymmetric degrees of freedom.\n\n\\begin{figure}[h!]\n\n\\includegraphics[width=3in]{m20151111_02_plotOfTokamakSingularValues1.pdf}\n\\includegraphics[width=3in]{m20151111_02_plotOfTokamakSingularValues2.pdf}\n\\caption{(Color online)\nSingular values for the geometry $R/a_P=3$ and $a_C/a_P = 1.7$ (figure \\ref{fig:geometry}.c).  Values computed by the code are shown as blue circles.\nThe subset of these singular values associated with axisymmetric singular vectors are shown as red crosses.  The cylindrical\nanalytic results (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV}) and\n(\\ref{eq:highAspectRatioInductanceBesselSV})-(\\ref{eq:highAspectRatioInductancePowerSV})\nare shown as green diamonds\nfor comparison.\nFor the inductance matrix, singular values are normalized by $2\\pi^2 \\mu_0 R$.\n\\label{fig:aspectRatio3}}\n\\end{figure}\n\n\n\\section{Shaped axisymmetric surfaces}\n\\label{sec:axisymm_shaped}\n\nNow that the singular vectors and values of the inductance and transfer matrices are known\nfor the case of circular surfaces, we proceed to consider plasma and control surfaces which are axisymmetric but non-circular.\nAt this point we will be able to demonstrate one of our main results: both the inductance and transfer matrix methods can correctly identify the X-point divertor\nshape as being efficient, despite its sharp corner.  We will also give examples of plasma shapes that have low curvature\nand low spectral width, yet are inefficient to produce.\n\nThe four shapes we will consider are shown in figure \\ref{fig:shapes}. The `divertor' shape is taken from a numerical\nGrad-Shafranov solution for the ITER\n15 MA baseline scenario.\nSince our numerical methods presume differentiable surface shapes, the surface at normalized poloidal flux = 0.995 rather than 1 is chosen so the corner at the X-point is very slightly rounded off.\nThe other three shapes are chosen to have small curvature and small spectral width, in the sense that all can be represented\nby Fourier series with 4 or fewer terms:\n\n", "index": 59, "text": "\\begin{equation}\nR(\\theta) = \\sum_{m=0}^3 R_m \\cos(m\\theta),\n\\;\\;\\;\nZ(\\theta) = \\sum_{m=0}^3 Z_m \\sin(m\\theta).\n\\label{eq:4TermFourier}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E30.m1\" class=\"ltx_Math\" alttext=\"R(\\theta)=\\sum_{m=0}^{3}R_{m}\\cos(m\\theta),\\;\\;\\;Z(\\theta)=\\sum_{m=0}^{3}Z_{m}%&#10;\\sin(m\\theta).\" display=\"block\"><mrow><mrow><mrow><mrow><mi>R</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>0</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>R</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo rspace=\"10.9pt\">,</mo><mrow><mrow><mi>Z</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>m</mi><mo>=</mo><mn>0</mn></mrow><mn>3</mn></munderover><mrow><msub><mi>Z</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>m</mi><mo>⁢</mo><mi>θ</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere primes indicate $d/d\\theta$, and $\\kappa_{RZ}$ is independent of the poloidal coordinate $\\theta$ used.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151228_02_plotPlasmaAndControlSurfaceForBDISTRIBPaper.pdf}\n\\caption{(Color online)\nThe four noncircular axisymmetric plasma shapes considered in section \\ref{sec:axisymm_shaped}.\nFor each case, the two control surfaces considered are shown in gray.\n\\label{fig:shapes}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151228_01_computeCurvature.pdf}\n\\caption{(Color online)\nCurvature (= inverse radius of curvature) in the $RZ$ plane for the four plasma surface shapes considered in section \\ref{sec:axisymm_shaped}.\nFor the divertor shape, the spike in curvature corresponds to the (near) X point.\n\\label{fig:curvature}}\n\\end{figure}\n\n\nIntuitively, we expect the ellipse and divertor shapes to be `efficient' and the peanut and H shapes to be inefficient in some sense,\nfor plasmas of roughly the ellipse and divertor shapes are common in experiments whereas the peanut and H shapes are uncommon.\nOne calculation supporting this notion of efficiency is presented in figure \\ref{fig:leastSquaresPsiSurfaces}.\nHere, we first compute $B_n^{pl}$, the magnetic field normal to the desired plasma surface driven by plasma current inside it, using the virtual casing principle \\cite{ShafranovVirtualCasing,DrevlakVirtualCasing}.\nNext, we solve the linear least-squares problem to determine the currents in the actual ITER shaping coils (6 poloidal field coils and 6 central solenoid coils)\nwhich minimize $\\chi^2 = \\int d^2a\\; B_n^2$, where\n$B_n = B_n^{pl} + B_n^x$ (in this case $B_n^{fix}=0$) and $B_n^x$ is the contribution from the shaping coils.\nContours are then plotted of the total poloidal flux, summing the plasma and external contributions.\nIt is clear that the ellipse and divertor shapes can be produced to high accuracy by the ITER coilset, whereas the least-squares approximations\nto the peanut and H shapes lack the desired concave regions.\nThis failure comes despite the fact, mentioned above, that the peanut and H target shapes are everywhere closer to the coils compared to the divertor shape.\nIf additional coils are included between\nthe actual ITER coils at similar distances from the plasma, the concave plasma shapes can be better approximated, but only with an unrealistic number of coils and large coil currents.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151229_04_LeastSquaresReconstructionOfShapesForBDISTRIBPaper3.pdf}\n\\caption{(Color online)\nOne demonstration that the ellipse and divertor shapes are more efficient to produce, in some sense,\nthan the peanut and H shapes. Black dashed curves show the target plasma shape.\nColored curves are contours of poloidal flux\nwhen currents in the ITER coilset ($\\times$) are chosen so to minimize $\\int d^2a\\; B_n^2$\non the target shape. While the ellipse and divertor shapes\nare produced to high accuracy, the desired concave regions in the peanut and H shapes are not produced.\n\\label{fig:leastSquaresPsiSurfaces}}\n\\end{figure}\n\nFor calculations using the inductance and transfer matrices, we will explore the effect of the choice of control surface by considering two options.\nOne option, the `ITER control surface', is obtained by fitting the locations of the ITER poloidal field and central solenoid coils with\na 4-term Fourier series as in (\\ref{eq:4TermFourier}).  This control surface thus represents a realistic surface on which shaping coils may be placed\nin an experiment.\nFor contrast, the other option is an `offset' control surface obtained by expanding the plasma surface by a uniform 1.5 m distance.\nThis choice will enable us to demonstrate that tailoring the control surface to the plasma shape has little effect on our results.\nThe control surfaces are shown in figure \\ref{fig:shapes}.\nFor these calculations we consider only axisymmetric basis functions and singular vectors,\nand we allow up-down asymmetry.\n\nOur main result is figure \\ref{fig:divertorEasy}, which shows\nthe efficiency sequences for the four shapes, i.e. the projection of $B_n^{pl} + B_n^{fix}$ onto the\nleft singular vectors.\nThe toroidal field can be ignored as it gives no $B_n$, and we can thus take $B_n^{fix}=0$.\nThe four equilibria have the same total plasma current (15 MA) and hence comparable poloidal field,\nso it is meaningful to compare the absolute magnitudes in figure \\ref{fig:divertorEasy} in addition to the rates\nof decrease.\nThe figure shows that to cancel $B_n^{pl}$ to a relative accuracy of $\\le 10^{-3}$, only the first 20-25 efficiency-ordered ${\\mbox{\\boldmath ${B}$}}$ distributions are required for the ellipse\nand divertor shapes.  The divertor shape is not significantly harder to produce than the ellipse in this regard.\nIn contrast, the `long tails' for the peanut and H shapes in figure \\ref{fig:divertorEasy} indicate that many more ${\\mbox{\\boldmath ${B}$}}$ distributions are required to create these shapes.\nFor the peanut shape, even with the first 80 efficiency-ordered ${\\mbox{\\boldmath ${B}$}}$ distributions,\nit is not possible to cancel $B_n^{pl}$ to a relative accuracy of  $< 10^{-2}$.\nThe trends are nearly identical for the transfer and inductance matrices.\n\nComparing the top row of subplots in figure \\ref{fig:divertorEasy} to the bottom row, it can be seen that\nchanging the control surface may change the precise values of the efficiency sequence,\nbut the overall rate of decrease is not significantly changed.\nWe have also repeated the analysis with other control surfaces, including surfaces with elliptical or circular cross-section, and the results are always\nquite similar to figure \\ref{fig:divertorEasy}.\nThis robustness is expected, for as pointed out previously, the efficiency sequences are independent of the singular values,\nand hence largely independent of the distance between plasma and control surfaces.\nThus, the rates of decrease of the data in figure \\ref{fig:divertorEasy} are a good measure of the intrinsic efficiency of producing a plasma\nshape.\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotMainResultsForPaper.pdf}\n\\caption{(Color online)\nEfficiency sequences, i.e. the projection of $B_n^{pl}$ (magnetic field driven by plasma current,\ncomponent normal to the target plasma shape)\nonto the left singular vectors of the inductance and transfer matrices.\nComparing the 4 plasma shapes in figure \\ref{fig:shapes},\nthe divertor and ellipse shapes\nare efficient to produce in the sense that only a small number of singular vectors are required to represent $B_n^{pl}$\nto any desired accuracy.\nMany more singular vectors are required to represent $B_n^{pl}$ for the difficult peanut and H shapes.\n\nFor the ellipse, peanut, and H shapes, approximately every other sequence element is exactly zero due to up-down symmetry,\nand the remaining elements alternate in magnitude associated with in-out symmetry vs. asymmetry.\n\\label{fig:divertorEasy}}\n\\end{figure}\n\nTo better understand these results, figure \\ref{fig:divertorSingularVects} displays additional details of the calculation\nfor the divertor plasma shape with ITER control surface.\nFigure \\ref{fig:divertorSingularVects}.a shows the field lines of the part of the magnetic field driven by the plasma current.\nIt can be seen that this magnetic field points into the plasma surface on one side of the X point and out of the plasma surface\non the other side of the X point. Hence, $B_n^{pl}$ has a sharp transition from one sign to the other in this region (figure \\ref{fig:divertorSingularVects}.b).\nWe use high numerical resolution ($N_{\\theta}=512, N_{\\zeta}=96,m_{\\max}=128$) so this transition is well resolved numerically.\nFigure \\ref{fig:divertorSingularVects}.c then displays the first few right singular vectors of the transfer matrix,\ncorresponding to the magnetic field component normal to the control surface for the most efficient magnetic field distributions.\nThese functions resemble $\\cos(\\theta)$, $\\sin(\\theta)$, $\\cos(2\\theta)$, $\\sin(2\\theta)$, etc., corresponding to vacuum fields with\nslow spatial variation, as expected from section \\ref{sec:axisymm}. The first right singular vectors of the inductance matrix (\\ref{fig:divertorSingularVects}.d)\nhave slightly faster spatial variation, consistent with the trend we observed in section \\ref{sec:axisymm}.\nThe components of these ${\\mbox{\\boldmath ${B}$}}$ distributions normal to the plasma surface are plotted in figures \\ref{fig:divertorSingularVects}.e-f,\ncorresponding to the left singular vectors. These singular vectors have fine structure near $\\theta=4.4$ corresponding to the X point,\nfor exactly the same reason $B_n^{pl}$ does: a ${\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}})$ with slow variation is projected normal to a surface with a sharp corner.\nHence, the basis of left singular vectors is able to resolve fine structure near the X point, precisely where $B_n^{pl}(\\theta)$ has fine structure.\n\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotBnAndFirstFewSingularVects.pdf}\n\\caption{(Color online)\n(a) Lines of the magnetic field driven by plasma current for the divertor shape example, equivalent to contours of poloidal flux.\n(b) Component of this field normal to the plasma surface.\n(c) The first 4 right singular vectors of the transfer matrix and (d) inductance matrix are slowly varying,\ncorresponding to vacuum ${\\mbox{\\boldmath ${B}$}}$ distributions with slow spatial variation.\nThe left singular vectors correspond to the projection of these distributions normal\nto the plasma surface, hence they have fine structure near the X point.\n\\label{fig:divertorSingularVects}}\n\\end{figure}\n\nNext, in figure \\ref{fig:ITERSingularVals} we examine the singular values for the four shapes and two control surfaces.\nThe overall pattern of singular values is extremely similar to the case of\ncircular surfaces, figure \\ref{fig:highAspectRatioNtor0}.\nThe singular values for circular surfaces behaved like $(a_P/a_C)^m$ (in pairs with sin or cos symmetry),\nand we can interpret the singular values for shaped surfaces as following\nthe same pattern for an effective ratio of surface radii $a_P/a_C$.\nParticularly for the ellipse and divertor shapes, for which the 1.5 m offset control surface is everywhere\ncloser to the plasma than the ITER control surface, the rate of decrease in the singular values\nin figure \\ref{fig:ITERSingularVals} is significantly faster for the more distant surface, as expected.\nFor the ITER control surface, the singular values for the peanut and H shapes\nare larger than for the ellipse and divertor shapes, which merely reflects the fact that\nthe ellipse and divertor shapes are smaller.\nFor a given effective $a_P/a_C$, the singular values are not very sensitive\nto the details of the surface shapes.\n\n\nHence the singular values themselves are not an ideal target for optimization.\nThe projections shown in figure \\ref{fig:divertorEasy} are more sensitive to the plasma shape, making them\na better target for optimization.\n\nFinally, we divide the efficiency sequences (figure \\ref{fig:divertorEasy}) by the singular values (figure \\ref{fig:ITERSingularVals})\nto get the feasibility sequences in figure \\ref{fig:feasibilitySequences}.\nDepending on whether the efficiency sequences or singular values decrease more rapidly, the feasibility sequences\nmay be (exponentially) increasing or decreasing. Indeed, the sequence for the ellipse shape is decreasing in the figure,\nwhile the sequences for the peanut and H shapes are increasing.\nThe sequences for the divertor shape have a significantly lower slope than the sequences for the peanut and H shapes,\nreflecting the fact that the divertor shape is easier to generate despite its larger curvature.\n(We only show the first 24 sequence elements for the divertor shape, since after this point\nthe projection becomes polluted by discretization error from the numerical ITER Grad-Shafranov solution we have available.\n)\n\n\\begin{figure}[h!]\n\\includegraphics{20151209-01-plotSingularValsForPaper_transfer.pdf}\n\\includegraphics{20151209-01-plotSingularValsForPaper_inductance.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer and (b) inductance matrices for the 4 shapes and 2 choices for control surface\nin figure \\ref{fig:shapes} (considering only axisymmetric distributions.)\nDespite the strong surface shaping, the results bear close resemblance to the results for circular cross-section surfaces\nin figure \\ref{fig:highAspectRatioNtor0}.\n\\label{fig:ITERSingularVals}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotFeasibilitySequences.pdf}\n\\caption{(Color online)\nFeasibility sequences, i.e. the efficiency sequences (figure \\ref{fig:divertorEasy}) divided by the singular values\n(figure \\ref{fig:ITERSingularVals}).\n\\label{fig:feasibilitySequences}}\n\\end{figure}\n\nWe have repeated the analysis of figures \\ref{fig:divertorEasy} and \\ref{fig:feasibilitySequences} taking $B_n^{pl}$ to be generated by an infinitesimally thin ring of current at the magnetic axis,\nand find only minor changes to the results.  The details of the current distribution inside the surface are unlikely to have a strong effect on $B_n^{pl}$ generally\nsince the plasma current is usually concentrated near the magnetic axis, relatively far from the boundary where $B_n^{pl}$ is evaluated.\n\n\n\\section{Nonaxisymmetric surfaces}\n\\label{sec:nonaxisymm}\n\nNow that some understanding of the inductance and transfer matrix SVD properties has been developed in the previous\nsections, let us present one example from the important but more complicated case of nonaxisymmetric surfaces.\nSome features from the previous axisymmetric cases will persist.  Application of the inductance and transfer matrix\nSVD for nonaxisymmetric shape optimization will be considered in future work.\n\nFigures \\ref{fig:w7x}-\\ref{fig:w7x_inductance_V}\npresent the SVD of the transfer and inductance matrices for a W7-X case.\nThe plasma surface is taken from a fixed-boundary {\\tt VMEC}~equilibrium ($\\beta=4.5\\%$) from prior to the selection of the W7-X coil shapes,\nso there is no ripple due to the discrete coils of the actual experiment.\nWe consider two control surfaces.\nThe `real' control surface is chosen to be a surface on which the W7-X\ncoils lie. The distance between the plasma and this control surfaces is not exactly uniform.\n(Not surprisingly, based on the difficulty of generating concave shapes as discussed in the previous section,\nthe designers of W7-X chose to make the coil surface closer to the plasma in the concave regions.)\nWe also consider an `expanded' control surface, obtained by adding $(0.5\\mathrm{ m})\\cos(\\theta)$ to $R$\nand $(0.5\\mathrm{ m})\\sin(\\theta)$ to $Z$ of the real control surface.\nFor computing the inductance and transfer matrices, in light of\nthe 5-fold toroidal periodicity of W7-X, we enforce 5-fold toroidal periodicity in the basis functions.\nWe also force $B_n$ to have stellarator symmetry by including only stellarator-symmetric basis functions in the calculation.\n\nFigure \\ref{fig:w7x}.c shows the singular values of the transfer and inductance matrices.\nJust as in the circular axisymmetric case of section \\ref{sec:axisymm},\nthe singular values decrease roughly exponentially,\nand the rate of decrease is a bit faster for the transfer matrix.\nThe rate of decrease is also faster for the expanded control surface since it is farther from the plasma.\n\nFigures \\ref{fig:w7x_transfer_U}-\\ref{fig:w7x_transfer_V} show the left and right singular vectors\nof the transfer matrix for the real control surface, transformed to $(\\theta,\\zeta)$-space.\nComparing these two figures, the patterns on the plasma and control surfaces are similar.\nAs one would expect, there is a general trend for the spatial frequencies to become higher\nas one proceeds through the sequence of singular vectors.\n\nFigures \\ref{fig:w7x_inductance_U}-\\ref{fig:w7x_inductance_V} show the left and right singular vectors\nof the inductance matrix for the real control surface, again transformed to $(\\theta,\\zeta)$-space.\nThe spatial frequencies of these singular vectors are noticeably higher\nthan those of the transfer matrix singular vectors, particularly\non the control surface (figure \\ref{fig:w7x_inductance_V}).\nThis phenomenon is yet another instance of the inductance matrix favoring shorter wavelengths,\ndue to the gradient in the relation between current potential and magnetic field.\n\n\\begin{figure}[h!]\n\n\n\n\\includegraphics[width=3in]{m20160115_01_W7XIllustrationForBdistribPaper.jpg}\n\\includegraphics[width=3in]{m20160115_01_W7XIllustrationForBdistribPaper_b.pdf}\n\\includegraphics[width=3in]{m20160116_01_plotForBDISTRIBPaper_W7XSingularVals.pdf}\n\\caption{(Color online)\n(a) Plasma surface (red) and the two control surfaces considered\n\nfor the W7-X scenario.\n(b) Cross-sections of the plasma and control surfaces\nat three toroidal angles.\n(c) Singular values of the transfer and inductance matrices.\nThe inductance matrix singular values have been divided by $2\\pi^2 \\mu_0 R_0$\nas in previous figures to fit on the same axes. ($R_0 = 5.5$ m.)\n\\label{fig:w7x}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_transfer_U.pdf}\n\\caption{(Color online)\nThe first 16 left singular vectors ${\\mathbfsf{{U}}}$ of the transfer matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the plasma surface.\n\\label{fig:w7x_transfer_U}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_transfer_V.pdf}\n\\caption{(Color online)\nThe first 16 right singular vectors ${\\mathbfsf{{V}}}$ of the transfer matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the control surface.\n\\label{fig:w7x_transfer_V}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_inductance_U.pdf}\n\\caption{(Color online)\nThe first 16 left singular vectors ${\\mathbfsf{{U}}}$ of the inductance matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the plasma surface.\n\\label{fig:w7x_inductance_U}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_inductance_V.pdf}\n\\caption{(Color online)\nThe first 16 right singular vectors ${\\mathbfsf{{V}}}$ of the inductance matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of current potential $\\kappa$ on the control surface.\n\\label{fig:w7x_inductance_V}}\n\\end{figure}\n\nFinally, in figure \\ref{fig:w7x_projection} we examine the difficulty of achieving a total $B_n=0$\non the W7-X plasma surface, showing the efficiency sequences given by projecting $B_n^{fix}$ onto the left singular vectors of the transfer and inductance matrices.\nSince the surface shapes are nonaxisymmetric,\nthe net poloidal current on the control surface (which we take to flow at constant $\\zeta$,\nas in {\\tt NESCOIL}) produces a nonzero $B_n^{fix}$.\n(The trends in figure \\ref{fig:w7x_projection} are unchanged if $B_n^{fix}$ is considered\nto arise instead from an axisymmetric toroidal magnetic field $\\propto 1/R$.)\nThe plasma current in W7-X is small, and in this example $B_n^{pl}$ is negligible compared to $B_n^{fix}$.\nFigures \\ref{fig:w7x_projection}.a-b illustrate that the general rates of decrease in the efficiency sequences\nare the same for the two control surfaces, as expected.\nTo achieve a total $B_n=0$ on the plasma surface by adding non-planarity to\nmodular coils on the control surface, the required magnitudes of the $B_n$ or current\ndistributions on the control surface are obtained by dividing the figure \\ref{fig:w7x_projection}.a-b\nsequences by the singular values, yielding the feasibility sequences. Results are shown in figures \\ref{fig:w7x_projection}.c-d.\nFor the real control surface, the rate of\ndecrease in figure \\ref{fig:w7x_projection}.a-b is just barely faster than the rate of decrease in the singular values,\nso the resulting sequences in figures \\ref{fig:w7x_projection}.c-d show a trend that is nearly flat but\nvery slightly decreasing.\nThis trend is in fact expected, for it indicates that the W7-X coils are just close enough to the plasma\nto achieve the necessary control of $B_n$,\nconsistent with the aim of the W7-X designers to push the coils as far from the plasma as possible.\nIf coils were further from the plasma so as to lie on the expanded control surface,\nthe singular values of the inductance and transfer matrices\ndecrease more rapidly (figure \\ref{fig:w7x}.c,) yielding feasibility sequences in figures \\ref{fig:w7x_projection}.c-d that are generally increasing.\nThe amplitude of $B_n$ or current needed on the control surface is thus unbounded,\nand one would effectively need to control an infinite number of the distributions\non the control surface.\nThus, the nearly flat trends in figures \\ref{fig:w7x_projection}.c-d for the real control surface are consistent with the choice\nof this winding surface for the actual W7-X coils: it is as far from the plasma as possible,\nat limit of where it is practical to achieve total $B_n=0$ on the desired plasma surface.\n\n\\begin{figure}[h!]\n\\includegraphics{20160112-01-plotProjectionOfBnOnSingVectsForW7X.pdf}\n\\caption{(Color online)\nThe magnetic field normal to the W7-X plasma surface driven by net poloidal current\non the control surface $B_n^{fix}$ is projected\nonto the left singular vectors of the transfer and inductance matrices in (a)-(b).\nThe results are divided by the singular values in (c)-(d) to give the required amplitudes\nof magnetic flux or current\non the control surface.\nThe general rate of decrease in the efficiency sequence is insensitive to the control surface,\nwhereas the rate of increase in the feasibility sequence increases with the distance between plasma\nand control surfaces.\nThe nearly flat trend in (c)-(d) for the real control surface indicates it is difficult\nto produce the W7-X plasma shape using coils further from the plasma than the actual\nW7-X coils.\n\\label{fig:w7x_projection}}\n\\end{figure}\n\n\n\\section{Universality and uniqueness: choice of angles and basis functions}\n\\label{sec:angles}\n\nWe now analyze several technical issues related to the uniqueness of the transfer and inductance matrices:\nare the SVDs of these matrices independent of the specific basis functions chosen?\nAnd are the singular values and vectors\nindependent of the choice of poloidal and toroidal angles $\\theta$ and $\\zeta$?\nFor example, one could parameterize the plasma surface using the coordinates of the {\\tt VMEC}~code\n(in which magnetic field lines are not straight), or the straight-field-line coordinates associated with the normal\ncylindrical toroidal angle, or Boozer coordinates, etc.\nWe will prove and demonstrate numerically that the SVDs are indeed independent of these choices of basis functions and angles,\nunder reasonable assumptions. Specifically, we loosely prove the following two results for both the inductance and transfer matrices:\n(1) Two different sets of basis functions which are orthogonal\nunder the same weight $w$ yield the same numerically converged singular values, and the associated\nsingular vectors represent the same patterns in real space; and (2) as long as the weight $w$ is\nspecified in a coordinate-independent manner, changing the choice of angles does not alter the\nnumerically converged singular values or real-space patterns represented by the singular vectors.\n\n\n\\subsection{Change of basis}\nTo carry out the rough proofs,\nwe begin by considering a single surface with two different sets of basis functions, $f^{(1)}_j$ and $f^{(2)}_{j}$.\nLet the two basis sets be associated with weights $w^{(1)}$ and $w^{(2)}$ which may or may not be equal.\nWe introduce a matrix ${\\mathbfsf{{A}}}$ with components $A_{i,j}$ which relates the bases:\n\n", "itemtype": "equation", "pos": 61847, "prevtext": "\n(For contrast, we retain 100 terms in the Fourier series for the divertor shape.)\nThe `ellipse' shape is chosen to have the same width, height, and median major radius as the divertor shape.\nThe `peanut' and `H' shapes are chosen just large enough to encircle the divertor shape, so any difficulty generating\nthese two shapes cannot be due to larger distance from a common control surface or coils.\nFor the ellipse, peanut, and H shapes, we have generated MHD equilibrium solutions just as for the divertor shape,\nthis time using the VMEC code \\cite{VMEC1983} run in fixed-boundary mode.\nTo emphasize that the divertor shape has a significantly sharper corner than the other shapes, figure \\ref{fig:curvature}\nshows the curvature (i.e. inverse radius of curvature) of the poloidal cross-section\n\n", "index": 61, "text": "\\begin{equation}\n\\kappa_{RZ} = (R'Z'' - Z'R'') / (R'^2 + Z'^2)^{3/2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E31.m1\" class=\"ltx_Math\" alttext=\"\\kappa_{RZ}=(R^{\\prime}Z^{\\prime\\prime}-Z^{\\prime}R^{\\prime\\prime})/(R^{\\prime&#10;2%&#10;}+Z^{\\prime 2})^{3/2},\" display=\"block\"><mrow><mrow><msub><mi>κ</mi><mrow><mi>R</mi><mo>⁢</mo><mi>Z</mi></mrow></msub><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msup><mi>R</mi><mo>′</mo></msup><mo>⁢</mo><msup><mi>Z</mi><mi>′′</mi></msup></mrow><mo>-</mo><mrow><msup><mi>Z</mi><mo>′</mo></msup><mo>⁢</mo><msup><mi>R</mi><mi>′′</mi></msup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>R</mi><mrow><mi mathsize=\"142%\" mathvariant=\"normal\">′</mi><mo>⁣</mo><mn>2</mn></mrow></msup><mo>+</mo><msup><mi>Z</mi><mrow><mi mathsize=\"142%\" mathvariant=\"normal\">′</mi><mo>⁣</mo><mn>2</mn></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n(For finite basis sets the basis functions in one set may not be exact linear combinations of the functions in the other set,\nbut once a sufficient number of basis functions are included in each set to resolve a given number of singular vectors to\na given level, (\\ref{eq:A1}) holds in an approximate sense.\nDue to this issue, our conclusions will apply only to the singular vectors and values that are well resolved numerically, rather than to all of them.)\n\n\n\n\n\nApplying the operation $\\int d^2a\\;w^{(1)}\\; f^{(1)}_{n}(\\ldots)$ to (\\ref{eq:A1})\ngives\n\n", "itemtype": "equation", "pos": 85840, "prevtext": "\nwhere primes indicate $d/d\\theta$, and $\\kappa_{RZ}$ is independent of the poloidal coordinate $\\theta$ used.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151228_02_plotPlasmaAndControlSurfaceForBDISTRIBPaper.pdf}\n\\caption{(Color online)\nThe four noncircular axisymmetric plasma shapes considered in section \\ref{sec:axisymm_shaped}.\nFor each case, the two control surfaces considered are shown in gray.\n\\label{fig:shapes}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151228_01_computeCurvature.pdf}\n\\caption{(Color online)\nCurvature (= inverse radius of curvature) in the $RZ$ plane for the four plasma surface shapes considered in section \\ref{sec:axisymm_shaped}.\nFor the divertor shape, the spike in curvature corresponds to the (near) X point.\n\\label{fig:curvature}}\n\\end{figure}\n\n\nIntuitively, we expect the ellipse and divertor shapes to be `efficient' and the peanut and H shapes to be inefficient in some sense,\nfor plasmas of roughly the ellipse and divertor shapes are common in experiments whereas the peanut and H shapes are uncommon.\nOne calculation supporting this notion of efficiency is presented in figure \\ref{fig:leastSquaresPsiSurfaces}.\nHere, we first compute $B_n^{pl}$, the magnetic field normal to the desired plasma surface driven by plasma current inside it, using the virtual casing principle \\cite{ShafranovVirtualCasing,DrevlakVirtualCasing}.\nNext, we solve the linear least-squares problem to determine the currents in the actual ITER shaping coils (6 poloidal field coils and 6 central solenoid coils)\nwhich minimize $\\chi^2 = \\int d^2a\\; B_n^2$, where\n$B_n = B_n^{pl} + B_n^x$ (in this case $B_n^{fix}=0$) and $B_n^x$ is the contribution from the shaping coils.\nContours are then plotted of the total poloidal flux, summing the plasma and external contributions.\nIt is clear that the ellipse and divertor shapes can be produced to high accuracy by the ITER coilset, whereas the least-squares approximations\nto the peanut and H shapes lack the desired concave regions.\nThis failure comes despite the fact, mentioned above, that the peanut and H target shapes are everywhere closer to the coils compared to the divertor shape.\nIf additional coils are included between\nthe actual ITER coils at similar distances from the plasma, the concave plasma shapes can be better approximated, but only with an unrealistic number of coils and large coil currents.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151229_04_LeastSquaresReconstructionOfShapesForBDISTRIBPaper3.pdf}\n\\caption{(Color online)\nOne demonstration that the ellipse and divertor shapes are more efficient to produce, in some sense,\nthan the peanut and H shapes. Black dashed curves show the target plasma shape.\nColored curves are contours of poloidal flux\nwhen currents in the ITER coilset ($\\times$) are chosen so to minimize $\\int d^2a\\; B_n^2$\non the target shape. While the ellipse and divertor shapes\nare produced to high accuracy, the desired concave regions in the peanut and H shapes are not produced.\n\\label{fig:leastSquaresPsiSurfaces}}\n\\end{figure}\n\nFor calculations using the inductance and transfer matrices, we will explore the effect of the choice of control surface by considering two options.\nOne option, the `ITER control surface', is obtained by fitting the locations of the ITER poloidal field and central solenoid coils with\na 4-term Fourier series as in (\\ref{eq:4TermFourier}).  This control surface thus represents a realistic surface on which shaping coils may be placed\nin an experiment.\nFor contrast, the other option is an `offset' control surface obtained by expanding the plasma surface by a uniform 1.5 m distance.\nThis choice will enable us to demonstrate that tailoring the control surface to the plasma shape has little effect on our results.\nThe control surfaces are shown in figure \\ref{fig:shapes}.\nFor these calculations we consider only axisymmetric basis functions and singular vectors,\nand we allow up-down asymmetry.\n\nOur main result is figure \\ref{fig:divertorEasy}, which shows\nthe efficiency sequences for the four shapes, i.e. the projection of $B_n^{pl} + B_n^{fix}$ onto the\nleft singular vectors.\nThe toroidal field can be ignored as it gives no $B_n$, and we can thus take $B_n^{fix}=0$.\nThe four equilibria have the same total plasma current (15 MA) and hence comparable poloidal field,\nso it is meaningful to compare the absolute magnitudes in figure \\ref{fig:divertorEasy} in addition to the rates\nof decrease.\nThe figure shows that to cancel $B_n^{pl}$ to a relative accuracy of $\\le 10^{-3}$, only the first 20-25 efficiency-ordered ${\\mbox{\\boldmath ${B}$}}$ distributions are required for the ellipse\nand divertor shapes.  The divertor shape is not significantly harder to produce than the ellipse in this regard.\nIn contrast, the `long tails' for the peanut and H shapes in figure \\ref{fig:divertorEasy} indicate that many more ${\\mbox{\\boldmath ${B}$}}$ distributions are required to create these shapes.\nFor the peanut shape, even with the first 80 efficiency-ordered ${\\mbox{\\boldmath ${B}$}}$ distributions,\nit is not possible to cancel $B_n^{pl}$ to a relative accuracy of  $< 10^{-2}$.\nThe trends are nearly identical for the transfer and inductance matrices.\n\nComparing the top row of subplots in figure \\ref{fig:divertorEasy} to the bottom row, it can be seen that\nchanging the control surface may change the precise values of the efficiency sequence,\nbut the overall rate of decrease is not significantly changed.\nWe have also repeated the analysis with other control surfaces, including surfaces with elliptical or circular cross-section, and the results are always\nquite similar to figure \\ref{fig:divertorEasy}.\nThis robustness is expected, for as pointed out previously, the efficiency sequences are independent of the singular values,\nand hence largely independent of the distance between plasma and control surfaces.\nThus, the rates of decrease of the data in figure \\ref{fig:divertorEasy} are a good measure of the intrinsic efficiency of producing a plasma\nshape.\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotMainResultsForPaper.pdf}\n\\caption{(Color online)\nEfficiency sequences, i.e. the projection of $B_n^{pl}$ (magnetic field driven by plasma current,\ncomponent normal to the target plasma shape)\nonto the left singular vectors of the inductance and transfer matrices.\nComparing the 4 plasma shapes in figure \\ref{fig:shapes},\nthe divertor and ellipse shapes\nare efficient to produce in the sense that only a small number of singular vectors are required to represent $B_n^{pl}$\nto any desired accuracy.\nMany more singular vectors are required to represent $B_n^{pl}$ for the difficult peanut and H shapes.\n\nFor the ellipse, peanut, and H shapes, approximately every other sequence element is exactly zero due to up-down symmetry,\nand the remaining elements alternate in magnitude associated with in-out symmetry vs. asymmetry.\n\\label{fig:divertorEasy}}\n\\end{figure}\n\nTo better understand these results, figure \\ref{fig:divertorSingularVects} displays additional details of the calculation\nfor the divertor plasma shape with ITER control surface.\nFigure \\ref{fig:divertorSingularVects}.a shows the field lines of the part of the magnetic field driven by the plasma current.\nIt can be seen that this magnetic field points into the plasma surface on one side of the X point and out of the plasma surface\non the other side of the X point. Hence, $B_n^{pl}$ has a sharp transition from one sign to the other in this region (figure \\ref{fig:divertorSingularVects}.b).\nWe use high numerical resolution ($N_{\\theta}=512, N_{\\zeta}=96,m_{\\max}=128$) so this transition is well resolved numerically.\nFigure \\ref{fig:divertorSingularVects}.c then displays the first few right singular vectors of the transfer matrix,\ncorresponding to the magnetic field component normal to the control surface for the most efficient magnetic field distributions.\nThese functions resemble $\\cos(\\theta)$, $\\sin(\\theta)$, $\\cos(2\\theta)$, $\\sin(2\\theta)$, etc., corresponding to vacuum fields with\nslow spatial variation, as expected from section \\ref{sec:axisymm}. The first right singular vectors of the inductance matrix (\\ref{fig:divertorSingularVects}.d)\nhave slightly faster spatial variation, consistent with the trend we observed in section \\ref{sec:axisymm}.\nThe components of these ${\\mbox{\\boldmath ${B}$}}$ distributions normal to the plasma surface are plotted in figures \\ref{fig:divertorSingularVects}.e-f,\ncorresponding to the left singular vectors. These singular vectors have fine structure near $\\theta=4.4$ corresponding to the X point,\nfor exactly the same reason $B_n^{pl}$ does: a ${\\mbox{\\boldmath ${B}$}}({\\mbox{\\boldmath ${r}$}})$ with slow variation is projected normal to a surface with a sharp corner.\nHence, the basis of left singular vectors is able to resolve fine structure near the X point, precisely where $B_n^{pl}(\\theta)$ has fine structure.\n\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotBnAndFirstFewSingularVects.pdf}\n\\caption{(Color online)\n(a) Lines of the magnetic field driven by plasma current for the divertor shape example, equivalent to contours of poloidal flux.\n(b) Component of this field normal to the plasma surface.\n(c) The first 4 right singular vectors of the transfer matrix and (d) inductance matrix are slowly varying,\ncorresponding to vacuum ${\\mbox{\\boldmath ${B}$}}$ distributions with slow spatial variation.\nThe left singular vectors correspond to the projection of these distributions normal\nto the plasma surface, hence they have fine structure near the X point.\n\\label{fig:divertorSingularVects}}\n\\end{figure}\n\nNext, in figure \\ref{fig:ITERSingularVals} we examine the singular values for the four shapes and two control surfaces.\nThe overall pattern of singular values is extremely similar to the case of\ncircular surfaces, figure \\ref{fig:highAspectRatioNtor0}.\nThe singular values for circular surfaces behaved like $(a_P/a_C)^m$ (in pairs with sin or cos symmetry),\nand we can interpret the singular values for shaped surfaces as following\nthe same pattern for an effective ratio of surface radii $a_P/a_C$.\nParticularly for the ellipse and divertor shapes, for which the 1.5 m offset control surface is everywhere\ncloser to the plasma than the ITER control surface, the rate of decrease in the singular values\nin figure \\ref{fig:ITERSingularVals} is significantly faster for the more distant surface, as expected.\nFor the ITER control surface, the singular values for the peanut and H shapes\nare larger than for the ellipse and divertor shapes, which merely reflects the fact that\nthe ellipse and divertor shapes are smaller.\nFor a given effective $a_P/a_C$, the singular values are not very sensitive\nto the details of the surface shapes.\n\n\nHence the singular values themselves are not an ideal target for optimization.\nThe projections shown in figure \\ref{fig:divertorEasy} are more sensitive to the plasma shape, making them\na better target for optimization.\n\nFinally, we divide the efficiency sequences (figure \\ref{fig:divertorEasy}) by the singular values (figure \\ref{fig:ITERSingularVals})\nto get the feasibility sequences in figure \\ref{fig:feasibilitySequences}.\nDepending on whether the efficiency sequences or singular values decrease more rapidly, the feasibility sequences\nmay be (exponentially) increasing or decreasing. Indeed, the sequence for the ellipse shape is decreasing in the figure,\nwhile the sequences for the peanut and H shapes are increasing.\nThe sequences for the divertor shape have a significantly lower slope than the sequences for the peanut and H shapes,\nreflecting the fact that the divertor shape is easier to generate despite its larger curvature.\n(We only show the first 24 sequence elements for the divertor shape, since after this point\nthe projection becomes polluted by discretization error from the numerical ITER Grad-Shafranov solution we have available.\n)\n\n\\begin{figure}[h!]\n\\includegraphics{20151209-01-plotSingularValsForPaper_transfer.pdf}\n\\includegraphics{20151209-01-plotSingularValsForPaper_inductance.pdf}\n\\caption{(Color online)\nSingular values of the (a) transfer and (b) inductance matrices for the 4 shapes and 2 choices for control surface\nin figure \\ref{fig:shapes} (considering only axisymmetric distributions.)\nDespite the strong surface shaping, the results bear close resemblance to the results for circular cross-section surfaces\nin figure \\ref{fig:highAspectRatioNtor0}.\n\\label{fig:ITERSingularVals}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics[width=6.5in]{20151209-01-plotFeasibilitySequences.pdf}\n\\caption{(Color online)\nFeasibility sequences, i.e. the efficiency sequences (figure \\ref{fig:divertorEasy}) divided by the singular values\n(figure \\ref{fig:ITERSingularVals}).\n\\label{fig:feasibilitySequences}}\n\\end{figure}\n\nWe have repeated the analysis of figures \\ref{fig:divertorEasy} and \\ref{fig:feasibilitySequences} taking $B_n^{pl}$ to be generated by an infinitesimally thin ring of current at the magnetic axis,\nand find only minor changes to the results.  The details of the current distribution inside the surface are unlikely to have a strong effect on $B_n^{pl}$ generally\nsince the plasma current is usually concentrated near the magnetic axis, relatively far from the boundary where $B_n^{pl}$ is evaluated.\n\n\n\\section{Nonaxisymmetric surfaces}\n\\label{sec:nonaxisymm}\n\nNow that some understanding of the inductance and transfer matrix SVD properties has been developed in the previous\nsections, let us present one example from the important but more complicated case of nonaxisymmetric surfaces.\nSome features from the previous axisymmetric cases will persist.  Application of the inductance and transfer matrix\nSVD for nonaxisymmetric shape optimization will be considered in future work.\n\nFigures \\ref{fig:w7x}-\\ref{fig:w7x_inductance_V}\npresent the SVD of the transfer and inductance matrices for a W7-X case.\nThe plasma surface is taken from a fixed-boundary {\\tt VMEC}~equilibrium ($\\beta=4.5\\%$) from prior to the selection of the W7-X coil shapes,\nso there is no ripple due to the discrete coils of the actual experiment.\nWe consider two control surfaces.\nThe `real' control surface is chosen to be a surface on which the W7-X\ncoils lie. The distance between the plasma and this control surfaces is not exactly uniform.\n(Not surprisingly, based on the difficulty of generating concave shapes as discussed in the previous section,\nthe designers of W7-X chose to make the coil surface closer to the plasma in the concave regions.)\nWe also consider an `expanded' control surface, obtained by adding $(0.5\\mathrm{ m})\\cos(\\theta)$ to $R$\nand $(0.5\\mathrm{ m})\\sin(\\theta)$ to $Z$ of the real control surface.\nFor computing the inductance and transfer matrices, in light of\nthe 5-fold toroidal periodicity of W7-X, we enforce 5-fold toroidal periodicity in the basis functions.\nWe also force $B_n$ to have stellarator symmetry by including only stellarator-symmetric basis functions in the calculation.\n\nFigure \\ref{fig:w7x}.c shows the singular values of the transfer and inductance matrices.\nJust as in the circular axisymmetric case of section \\ref{sec:axisymm},\nthe singular values decrease roughly exponentially,\nand the rate of decrease is a bit faster for the transfer matrix.\nThe rate of decrease is also faster for the expanded control surface since it is farther from the plasma.\n\nFigures \\ref{fig:w7x_transfer_U}-\\ref{fig:w7x_transfer_V} show the left and right singular vectors\nof the transfer matrix for the real control surface, transformed to $(\\theta,\\zeta)$-space.\nComparing these two figures, the patterns on the plasma and control surfaces are similar.\nAs one would expect, there is a general trend for the spatial frequencies to become higher\nas one proceeds through the sequence of singular vectors.\n\nFigures \\ref{fig:w7x_inductance_U}-\\ref{fig:w7x_inductance_V} show the left and right singular vectors\nof the inductance matrix for the real control surface, again transformed to $(\\theta,\\zeta)$-space.\nThe spatial frequencies of these singular vectors are noticeably higher\nthan those of the transfer matrix singular vectors, particularly\non the control surface (figure \\ref{fig:w7x_inductance_V}).\nThis phenomenon is yet another instance of the inductance matrix favoring shorter wavelengths,\ndue to the gradient in the relation between current potential and magnetic field.\n\n\\begin{figure}[h!]\n\n\n\n\\includegraphics[width=3in]{m20160115_01_W7XIllustrationForBdistribPaper.jpg}\n\\includegraphics[width=3in]{m20160115_01_W7XIllustrationForBdistribPaper_b.pdf}\n\\includegraphics[width=3in]{m20160116_01_plotForBDISTRIBPaper_W7XSingularVals.pdf}\n\\caption{(Color online)\n(a) Plasma surface (red) and the two control surfaces considered\n\nfor the W7-X scenario.\n(b) Cross-sections of the plasma and control surfaces\nat three toroidal angles.\n(c) Singular values of the transfer and inductance matrices.\nThe inductance matrix singular values have been divided by $2\\pi^2 \\mu_0 R_0$\nas in previous figures to fit on the same axes. ($R_0 = 5.5$ m.)\n\\label{fig:w7x}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_transfer_U.pdf}\n\\caption{(Color online)\nThe first 16 left singular vectors ${\\mathbfsf{{U}}}$ of the transfer matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the plasma surface.\n\\label{fig:w7x_transfer_U}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_transfer_V.pdf}\n\\caption{(Color online)\nThe first 16 right singular vectors ${\\mathbfsf{{V}}}$ of the transfer matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the control surface.\n\\label{fig:w7x_transfer_V}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_inductance_U.pdf}\n\\caption{(Color online)\nThe first 16 left singular vectors ${\\mathbfsf{{U}}}$ of the inductance matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of $B_n$ on the plasma surface.\n\\label{fig:w7x_inductance_U}}\n\\end{figure}\n\n\\begin{figure}[h!]\n\\includegraphics{m20151113_03_plotW7XSingularVectorsForPaper_inductance_V.pdf}\n\\caption{(Color online)\nThe first 16 right singular vectors ${\\mathbfsf{{V}}}$ of the inductance matrix for the W7-X scenario of figure \\ref{fig:w7x},\ncorresponding to distributions of current potential $\\kappa$ on the control surface.\n\\label{fig:w7x_inductance_V}}\n\\end{figure}\n\nFinally, in figure \\ref{fig:w7x_projection} we examine the difficulty of achieving a total $B_n=0$\non the W7-X plasma surface, showing the efficiency sequences given by projecting $B_n^{fix}$ onto the left singular vectors of the transfer and inductance matrices.\nSince the surface shapes are nonaxisymmetric,\nthe net poloidal current on the control surface (which we take to flow at constant $\\zeta$,\nas in {\\tt NESCOIL}) produces a nonzero $B_n^{fix}$.\n(The trends in figure \\ref{fig:w7x_projection} are unchanged if $B_n^{fix}$ is considered\nto arise instead from an axisymmetric toroidal magnetic field $\\propto 1/R$.)\nThe plasma current in W7-X is small, and in this example $B_n^{pl}$ is negligible compared to $B_n^{fix}$.\nFigures \\ref{fig:w7x_projection}.a-b illustrate that the general rates of decrease in the efficiency sequences\nare the same for the two control surfaces, as expected.\nTo achieve a total $B_n=0$ on the plasma surface by adding non-planarity to\nmodular coils on the control surface, the required magnitudes of the $B_n$ or current\ndistributions on the control surface are obtained by dividing the figure \\ref{fig:w7x_projection}.a-b\nsequences by the singular values, yielding the feasibility sequences. Results are shown in figures \\ref{fig:w7x_projection}.c-d.\nFor the real control surface, the rate of\ndecrease in figure \\ref{fig:w7x_projection}.a-b is just barely faster than the rate of decrease in the singular values,\nso the resulting sequences in figures \\ref{fig:w7x_projection}.c-d show a trend that is nearly flat but\nvery slightly decreasing.\nThis trend is in fact expected, for it indicates that the W7-X coils are just close enough to the plasma\nto achieve the necessary control of $B_n$,\nconsistent with the aim of the W7-X designers to push the coils as far from the plasma as possible.\nIf coils were further from the plasma so as to lie on the expanded control surface,\nthe singular values of the inductance and transfer matrices\ndecrease more rapidly (figure \\ref{fig:w7x}.c,) yielding feasibility sequences in figures \\ref{fig:w7x_projection}.c-d that are generally increasing.\nThe amplitude of $B_n$ or current needed on the control surface is thus unbounded,\nand one would effectively need to control an infinite number of the distributions\non the control surface.\nThus, the nearly flat trends in figures \\ref{fig:w7x_projection}.c-d for the real control surface are consistent with the choice\nof this winding surface for the actual W7-X coils: it is as far from the plasma as possible,\nat limit of where it is practical to achieve total $B_n=0$ on the desired plasma surface.\n\n\\begin{figure}[h!]\n\\includegraphics{20160112-01-plotProjectionOfBnOnSingVectsForW7X.pdf}\n\\caption{(Color online)\nThe magnetic field normal to the W7-X plasma surface driven by net poloidal current\non the control surface $B_n^{fix}$ is projected\nonto the left singular vectors of the transfer and inductance matrices in (a)-(b).\nThe results are divided by the singular values in (c)-(d) to give the required amplitudes\nof magnetic flux or current\non the control surface.\nThe general rate of decrease in the efficiency sequence is insensitive to the control surface,\nwhereas the rate of increase in the feasibility sequence increases with the distance between plasma\nand control surfaces.\nThe nearly flat trend in (c)-(d) for the real control surface indicates it is difficult\nto produce the W7-X plasma shape using coils further from the plasma than the actual\nW7-X coils.\n\\label{fig:w7x_projection}}\n\\end{figure}\n\n\n\\section{Universality and uniqueness: choice of angles and basis functions}\n\\label{sec:angles}\n\nWe now analyze several technical issues related to the uniqueness of the transfer and inductance matrices:\nare the SVDs of these matrices independent of the specific basis functions chosen?\nAnd are the singular values and vectors\nindependent of the choice of poloidal and toroidal angles $\\theta$ and $\\zeta$?\nFor example, one could parameterize the plasma surface using the coordinates of the {\\tt VMEC}~code\n(in which magnetic field lines are not straight), or the straight-field-line coordinates associated with the normal\ncylindrical toroidal angle, or Boozer coordinates, etc.\nWe will prove and demonstrate numerically that the SVDs are indeed independent of these choices of basis functions and angles,\nunder reasonable assumptions. Specifically, we loosely prove the following two results for both the inductance and transfer matrices:\n(1) Two different sets of basis functions which are orthogonal\nunder the same weight $w$ yield the same numerically converged singular values, and the associated\nsingular vectors represent the same patterns in real space; and (2) as long as the weight $w$ is\nspecified in a coordinate-independent manner, changing the choice of angles does not alter the\nnumerically converged singular values or real-space patterns represented by the singular vectors.\n\n\n\\subsection{Change of basis}\nTo carry out the rough proofs,\nwe begin by considering a single surface with two different sets of basis functions, $f^{(1)}_j$ and $f^{(2)}_{j}$.\nLet the two basis sets be associated with weights $w^{(1)}$ and $w^{(2)}$ which may or may not be equal.\nWe introduce a matrix ${\\mathbfsf{{A}}}$ with components $A_{i,j}$ which relates the bases:\n\n", "index": 63, "text": "\\begin{equation}\nf^{(2)}_{i}=A_{i,j}f^{(1)}_{j}.\n\\label{eq:A1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E32.m1\" class=\"ltx_Math\" alttext=\"f^{(2)}_{i}=A_{i,j}f^{(1)}_{j}.\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mi>i</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>=</mo><mrow><msub><mi>A</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msubsup><mi>f</mi><mi>j</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nWe now form\n\\begin{eqnarray}\n\\left( {\\mathbfsf{{A}}} {\\mathbfsf{{A}}}^T\\right)_{i,j}\n&=&\n A_{i,k}A_{j,k}\n=\\int d^2a \\; w^{(1)} f^{(2)}_{i} f^{(1)}_{k} A_{j,k}  \\label{eq:orthogonalMatrix} \\\\\n&=& \\int d^2a\\; w^{(1)} f^{(2)}_{i} f^{(2)}_{j}, \\nonumber\n\\end{eqnarray}\nwhere we have applied (\\ref{eq:A2}) to the first factor of ${\\mathbfsf{{A}}}$ and then used (\\ref{eq:A1}).\nIf $w^{(1)}=w^{(2)}$, then the right-hand side of (\\ref{eq:orthogonalMatrix})\nbecomes $\\delta_{i,j}$, so ${\\mathbfsf{{A}}}{\\mathbfsf{{A}}}^T={\\mathbfsf{{I}}}$.\nWe thus arrive at the important conclusion that\nif the two bases have the same weight, then ${\\mathbfsf{{A}}}$ is an orthogonal matrix.\n\n\\subsection{Uniqueness of inductance matrix}\n\\label{sec:uniqueness_inductance}\n\nNow suppose we have two inductance matrices, both relating the current potential on the control surface to $B_n$ on the plasma surface,\nbut using two different sets of basis functions on the plasma surface, $f_i^{(p1)}$ and $f_i^{(p2)}$:\n\n", "itemtype": "equation", "pos": 86471, "prevtext": "\n(For finite basis sets the basis functions in one set may not be exact linear combinations of the functions in the other set,\nbut once a sufficient number of basis functions are included in each set to resolve a given number of singular vectors to\na given level, (\\ref{eq:A1}) holds in an approximate sense.\nDue to this issue, our conclusions will apply only to the singular vectors and values that are well resolved numerically, rather than to all of them.)\n\n\n\n\n\nApplying the operation $\\int d^2a\\;w^{(1)}\\; f^{(1)}_{n}(\\ldots)$ to (\\ref{eq:A1})\ngives\n\n", "index": 65, "text": "\\begin{equation}\nA_{i,n} = \\int d^2a\\; w^{(1)} f^{(1)}_{n} f^{(2)}_{i}.\n\\label{eq:A2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E33.m1\" class=\"ltx_Math\" alttext=\"A_{i,n}=\\int d^{2}a\\;w^{(1)}f^{(1)}_{n}f^{(2)}_{i}.\" display=\"block\"><mrow><mrow><msub><mi>A</mi><mrow><mi>i</mi><mo>,</mo><mi>n</mi></mrow></msub><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><msup><mi>w</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>f</mi><mi>n</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>f</mi><mi>i</mi><mrow><mo stretchy=\"false\">(</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow></msubsup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 87559, "prevtext": "\nWe now form\n\\begin{eqnarray}\n\\left( {\\mathbfsf{{A}}} {\\mathbfsf{{A}}}^T\\right)_{i,j}\n&=&\n A_{i,k}A_{j,k}\n=\\int d^2a \\; w^{(1)} f^{(2)}_{i} f^{(1)}_{k} A_{j,k}  \\label{eq:orthogonalMatrix} \\\\\n&=& \\int d^2a\\; w^{(1)} f^{(2)}_{i} f^{(2)}_{j}, \\nonumber\n\\end{eqnarray}\nwhere we have applied (\\ref{eq:A2}) to the first factor of ${\\mathbfsf{{A}}}$ and then used (\\ref{eq:A1}).\nIf $w^{(1)}=w^{(2)}$, then the right-hand side of (\\ref{eq:orthogonalMatrix})\nbecomes $\\delta_{i,j}$, so ${\\mathbfsf{{A}}}{\\mathbfsf{{A}}}^T={\\mathbfsf{{I}}}$.\nWe thus arrive at the important conclusion that\nif the two bases have the same weight, then ${\\mathbfsf{{A}}}$ is an orthogonal matrix.\n\n\\subsection{Uniqueness of inductance matrix}\n\\label{sec:uniqueness_inductance}\n\nNow suppose we have two inductance matrices, both relating the current potential on the control surface to $B_n$ on the plasma surface,\nbut using two different sets of basis functions on the plasma surface, $f_i^{(p1)}$ and $f_i^{(p2)}$:\n\n", "index": 67, "text": "\\begin{equation}\nM_{i,j}^{\\left( p1,c \\right)}=\\int{{{d}^{2}}{{r}^{\\left( p \\right)}}}\\int{{{d}^{2}}{{r}^{\\left( c \\right)}}}f_{i}^{\\left( p1 \\right)}f_{j}^{\\left( c \\right)}F\\left( {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}},{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right)\n\\label{eq:M1}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E34.m1\" class=\"ltx_Math\" alttext=\"M_{i,j}^{\\left(p1,c\\right)}=\\int{{{d}^{2}}{{r}^{\\left(p\\right)}}}\\int{{{d}^{2}%&#10;}{{r}^{\\left(c\\right)}}}f_{i}^{\\left(p1\\right)}f_{j}^{\\left(c\\right)}F\\left({{%&#10;{\\mbox{\\boldmath${r}$}}}^{\\left(p\\right)}},{{{\\mbox{\\boldmath${r}$}}}^{\\left(c%&#10;\\right)}}\\right)\" display=\"block\"><mrow><msubsup><mi>M</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msubsup><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>r</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>r</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>f</mi><mi>i</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>f</mi><mi>j</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msubsup><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mrow><mo>(</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>,</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup><mo>)</mo></mrow></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere the integrals are over the two surfaces, superscripts indicate $p$ = plasma surface and $c$ = control surface, and\n\n", "itemtype": "equation", "pos": 87878, "prevtext": "\nand\n\n", "index": 69, "text": "\\begin{equation}\nM_{i,j}^{\\left( p2,c \\right)}=\\int{{{d}^{2}}{{r}^{\\left( p \\right)}}}\\int{{{d}^{2}}{{r}^{\\left( c \\right)}}}f_{i}^{\\left( p2 \\right)}f_{j}^{\\left( c \\right)}F\\left( {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}},{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right),\n\\label{eq:M2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E35.m1\" class=\"ltx_Math\" alttext=\"M_{i,j}^{\\left(p2,c\\right)}=\\int{{{d}^{2}}{{r}^{\\left(p\\right)}}}\\int{{{d}^{2}%&#10;}{{r}^{\\left(c\\right)}}}f_{i}^{\\left(p2\\right)}f_{j}^{\\left(c\\right)}F\\left({{%&#10;{\\mbox{\\boldmath${r}$}}}^{\\left(p\\right)}},{{{\\mbox{\\boldmath${r}$}}}^{\\left(c%&#10;\\right)}}\\right),\" display=\"block\"><mrow><mrow><msubsup><mi>M</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msubsup><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>r</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>r</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup><mo>⁢</mo><msubsup><mi>f</mi><mi>i</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>f</mi><mi>j</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msubsup><mo>⁢</mo><mi>F</mi><mo>⁢</mo><mrow><mo>(</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>,</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup><mo>)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nUsing (\\ref{eq:A1}), (\\ref{eq:M1}), and (\\ref{eq:M2}),\n\n", "itemtype": "equation", "pos": 88315, "prevtext": "\nwhere the integrals are over the two surfaces, superscripts indicate $p$ = plasma surface and $c$ = control surface, and\n\n", "index": 71, "text": "\\begin{equation}\nF\\left( {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}},{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right)=\\frac{{{\\mu }_{0}}}{4\\pi }\\left[ \\frac{3\\left( {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}}-{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right)\\cdot {{{\\mbox{\\boldmath ${n}$}}}^{\\left( p \\right)}}\\left( {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}}-{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right)\\cdot {{{\\mbox{\\boldmath ${n}$}}}^{\\left( c \\right)}}}{{{\\left| {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}}-{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right|}^{5}}}-\\frac{{{{\\mbox{\\boldmath ${n}$}}}^{\\left( p \\right)}}\\cdot {{{\\mbox{\\boldmath ${n}$}}}^{\\left( c \\right)}}}{{{\\left| {{{\\mbox{\\boldmath ${r}$}}}^{\\left( p \\right)}}-{{{\\mbox{\\boldmath ${r}$}}}^{\\left( c \\right)}} \\right|}^{3}}} \\right].\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E36.m1\" class=\"ltx_Math\" alttext=\"F\\left({{{\\mbox{\\boldmath${r}$}}}^{\\left(p\\right)}},{{{\\mbox{\\boldmath${r}$}}}%&#10;^{\\left(c\\right)}}\\right)=\\frac{{{\\mu}_{0}}}{4\\pi}\\left[\\frac{3\\left({{{\\mbox{%&#10;\\boldmath${r}$}}}^{\\left(p\\right)}}-{{{\\mbox{\\boldmath${r}$}}}^{\\left(c\\right)%&#10;}}\\right)\\cdot{{{\\mbox{\\boldmath${n}$}}}^{\\left(p\\right)}}\\left({{{\\mbox{%&#10;\\boldmath${r}$}}}^{\\left(p\\right)}}-{{{\\mbox{\\boldmath${r}$}}}^{\\left(c\\right)%&#10;}}\\right)\\cdot{{{\\mbox{\\boldmath${n}$}}}^{\\left(c\\right)}}}{{{\\left|{{{\\mbox{%&#10;\\boldmath${r}$}}}^{\\left(p\\right)}}-{{{\\mbox{\\boldmath${r}$}}}^{\\left(c\\right)%&#10;}}\\right|}^{5}}}-\\frac{{{{\\mbox{\\boldmath${n}$}}}^{\\left(p\\right)}}\\cdot{{{%&#10;\\mbox{\\boldmath${n}$}}}^{\\left(c\\right)}}}{{{\\left|{{{\\mbox{\\boldmath${r}$}}}^%&#10;{\\left(p\\right)}}-{{{\\mbox{\\boldmath${r}$}}}^{\\left(c\\right)}}\\right|}^{3}}}%&#10;\\right].\" display=\"block\"><mrow><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo>(</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>,</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><msub><mi>μ</mi><mn>0</mn></msub><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow></mfrac><mo>⁢</mo><mrow><mo>[</mo><mrow><mfrac><mrow><mrow><mrow><mrow><mn>3</mn><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>-</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>)</mo></mrow></mrow><mo>⋅</mo><msup><mi>𝒏</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup></mrow><mo>⁢</mo><mrow><mo>(</mo><mrow><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>-</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>)</mo></mrow></mrow><mo>⋅</mo><msup><mi>𝒏</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><msup><mrow><mo>|</mo><mrow><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>-</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>|</mo></mrow><mn>5</mn></msup></mfrac><mo>-</mo><mfrac><mrow><msup><mi>𝒏</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>⋅</mo><msup><mi>𝒏</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><msup><mrow><mo>|</mo><mrow><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>p</mi><mo>)</mo></mrow></msup><mo>-</mo><msup><mi>𝒓</mi><mrow><mo>(</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>|</mo></mrow><mn>3</mn></msup></mfrac></mrow><mo>]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nNow if we have the SVD for basis 1,\n\n", "itemtype": "equation", "pos": 89239, "prevtext": "\nUsing (\\ref{eq:A1}), (\\ref{eq:M1}), and (\\ref{eq:M2}),\n\n", "index": 73, "text": "\\begin{equation}\nM_{i,j}^{\\left( p2,c \\right)}={{A}_{i,k}}M_{k,j}^{\\left( p1,c \\right)}.\n\\label{eq:unitaryM}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E37.m1\" class=\"ltx_Math\" alttext=\"M_{i,j}^{\\left(p2,c\\right)}={{A}_{i,k}}M_{k,j}^{\\left(p1,c\\right)}.\" display=\"block\"><mrow><mrow><msubsup><mi>M</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msubsup><mo>=</mo><mrow><msub><mi>A</mi><mrow><mi>i</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>⁢</mo><msubsup><mi>M</mi><mrow><mi>k</mi><mo>,</mo><mi>j</mi></mrow><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\n(\\ref{eq:unitaryM}) implies\n\n", "itemtype": "equation", "pos": 89399, "prevtext": "\nNow if we have the SVD for basis 1,\n\n", "index": 75, "text": "\\begin{equation}\n{{{\\mathbfsf{{M}}}}^{\\left( p1,c \\right)}}={{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}{{\\left[ {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}} \\right]}^{T}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E38.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{M}}}}^{\\left(p1,c\\right)}}={{{\\mathbfsf{{U}}}}^{\\left(1\\right)}}%&#10;{{{\\mathbfsf{{\\Sigma}}}}^{\\left(1\\right)}}{{\\left[{{{\\mathbfsf{{V}}}}^{\\left(1%&#10;\\right)}}\\right]}^{T}},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mi>T</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nLet us now suppose the two sets of basis functions use the same weight $w$ so the matrix ${\\mathbfsf{{A}}}$ is orthogonal, as proved above. Then since both ${\\mathbfsf{{A}}}$ and ${{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$ are orthogonal, so is ${\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$. Hence the SVD for basis 2 is\n\n", "itemtype": "equation", "pos": 89650, "prevtext": "\n(\\ref{eq:unitaryM}) implies\n\n", "index": 77, "text": "\\begin{equation}\n{\\mathbfsf{{M}}}^{\\left( p2,c \\right)}={\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}{{\\left[ {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}} \\right]}^{T}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E39.m1\" class=\"ltx_Math\" alttext=\"{\\mathbfsf{{M}}}^{\\left(p2,c\\right)}={\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{%&#10;\\left(1\\right)}}{{{\\mathbfsf{{\\Sigma}}}}^{\\left(1\\right)}}{{\\left[{{{\\mathbfsf%&#10;{{V}}}}^{\\left(1\\right)}}\\right]}^{T}}.\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>A</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mi>T</mi></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere\n\\begin{eqnarray}\n{{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}} &=& {\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}, \\label{eq:newSVD} \\\\\n{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}, \\nonumber \\\\\n{{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}}. \\nonumber\n\\end{eqnarray}\nWe have thus proved that the singular values and the right singular vectors are unchanged under the change of basis.\nThe $i$th left singular vector in basis 1 represents the following physical pattern of $B_n$ on the plasma surface:\n\n", "itemtype": "equation", "pos": 90216, "prevtext": "\nLet us now suppose the two sets of basis functions use the same weight $w$ so the matrix ${\\mathbfsf{{A}}}$ is orthogonal, as proved above. Then since both ${\\mathbfsf{{A}}}$ and ${{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$ are orthogonal, so is ${\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$. Hence the SVD for basis 2 is\n\n", "index": 79, "text": "\\begin{equation}\n{{{\\mathbfsf{{M}}}}^{\\left( p2,c \\right)}}={{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}}{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}}{{\\left[ {{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} \\right]}^{T}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E40.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{M}}}}^{\\left(p2,c\\right)}}={{{\\mathbfsf{{U}}}}^{\\left(2\\right)}}%&#10;{{{\\mathbfsf{{\\Sigma}}}}^{\\left(2\\right)}}{{\\left[{{{\\mathbfsf{{V}}}}^{\\left(2%&#10;\\right)}}\\right]}^{T}}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>c</mi><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mi>T</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThe $i$th singular vector in basis 2 is\n\n", "itemtype": "equation", "pos": 91036, "prevtext": "\nwhere\n\\begin{eqnarray}\n{{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}} &=& {\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}, \\label{eq:newSVD} \\\\\n{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}, \\nonumber \\\\\n{{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}}. \\nonumber\n\\end{eqnarray}\nWe have thus proved that the singular values and the right singular vectors are unchanged under the change of basis.\nThe $i$th left singular vector in basis 1 represents the following physical pattern of $B_n$ on the plasma surface:\n\n", "index": 81, "text": "\\begin{equation}\nf_{j}^{\\left( p1 \\right)}U_{j,i}^{\\left( 1 \\right)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E41.m1\" class=\"ltx_Math\" alttext=\"f_{j}^{\\left(p1\\right)}U_{j,i}^{\\left(1\\right)}.\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mi>j</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>U</mi><mrow><mi>j</mi><mo>,</mo><mi>i</mi></mrow><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msubsup></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhere we have used (\\ref{eq:A1}), then (\\ref{eq:newSVD}), then (\\ref{eq:orthogonalMatrix}). Thus, although the matrices ${{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$ and ${{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}}$ have different matrix elements, the singular vectors represent the same physical pattern of $B_n$ in real space on the plasma surface.\n\nWe can repeat the above steps, considering a change of basis on the control surface instead of on the plasma surface.\nBy doing so we obtain the analogous result: the singular values and left singular vectors are unchanged, and the right-singular vectors correspond to the same physical current potential.\nThis completes the proof that the inductance matrix SVD is effectively independent of the choice of basis functions under the given assumptions.\n\n\\subsection{Uniqueness of transfer matrix}\n\\label{sec:uniqueness_transfer}\n\nWe now prove the transfer matrix has the same properties proved of the inductance matrix in the previous section.\nTo do so, we recall the discussion in section \\ref{sec:numerical}\nthat the transfer matrix can be written in terms of two inductance matrices:\nintroducing a third surface outside the control surface, and considering the outer-to-plasma-surface inductance matrix ${\\mathbfsf{{M}}}^{(p,o)}$\nand the outer-to-control-surface inductance matrix ${\\mathbfsf{{M}}}^{(c,o)}$, the transfer matrix can be computed from ${\\mathbfsf{{T}}} = {\\mathbfsf{{M}}}^{(p,o)} \\left[ {\\mathbfsf{{M}}}^{(c,o)}\\right]^{-1}$.\nIn the previous section regarding the basis-independence of the inductance matrix, the two surfaces used were arbitrary, so the results apply\nequally to the outer-to-plasma-surface inductance matrix and the outer-to-control-surface inductance matrix.\n\nSuppose we consider two basis sets on the plasma surface, orthogonal under the same weight, as in the previous section. Let us denote the two associated inductance matrices between the outer and plasma surfaces by ${\\mathbfsf{{M}}}^{\\left( p1,o \\right)}$ and ${{\\mathbfsf{{M}}}}^{\\left( p2,o \\right)}$.\nFrom (\\ref{eq:A1}), (\\ref{eq:M1}), and (\\ref{eq:M2}),\n\n", "itemtype": "equation", "pos": 91161, "prevtext": "\nThe $i$th singular vector in basis 2 is\n\n", "index": 83, "text": "\\begin{equation}\nf_{j}^{\\left( p2 \\right)}U_{j,i}^{\\left( 2 \\right)}\n =f_{k}^{\\left( p1 \\right)}U_{k,i}^{\\left( 1 \\right)}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E42.m1\" class=\"ltx_Math\" alttext=\"f_{j}^{\\left(p2\\right)}U_{j,i}^{\\left(2\\right)}=f_{k}^{\\left(p1\\right)}U_{k,i}%&#10;^{\\left(1\\right)}\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mi>j</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>U</mi><mrow><mi>j</mi><mo>,</mo><mi>i</mi></mrow><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msubsup></mrow><mo>=</mo><mrow><msubsup><mi>f</mi><mi>k</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>)</mo></mrow></msubsup><mo>⁢</mo><msubsup><mi>U</mi><mrow><mi>k</mi><mo>,</mo><mi>i</mi></mrow><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msubsup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThe transfer matrix for basis 1 is\n\n", "itemtype": "equation", "pos": 93393, "prevtext": "\nwhere we have used (\\ref{eq:A1}), then (\\ref{eq:newSVD}), then (\\ref{eq:orthogonalMatrix}). Thus, although the matrices ${{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}$ and ${{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}}$ have different matrix elements, the singular vectors represent the same physical pattern of $B_n$ in real space on the plasma surface.\n\nWe can repeat the above steps, considering a change of basis on the control surface instead of on the plasma surface.\nBy doing so we obtain the analogous result: the singular values and left singular vectors are unchanged, and the right-singular vectors correspond to the same physical current potential.\nThis completes the proof that the inductance matrix SVD is effectively independent of the choice of basis functions under the given assumptions.\n\n\\subsection{Uniqueness of transfer matrix}\n\\label{sec:uniqueness_transfer}\n\nWe now prove the transfer matrix has the same properties proved of the inductance matrix in the previous section.\nTo do so, we recall the discussion in section \\ref{sec:numerical}\nthat the transfer matrix can be written in terms of two inductance matrices:\nintroducing a third surface outside the control surface, and considering the outer-to-plasma-surface inductance matrix ${\\mathbfsf{{M}}}^{(p,o)}$\nand the outer-to-control-surface inductance matrix ${\\mathbfsf{{M}}}^{(c,o)}$, the transfer matrix can be computed from ${\\mathbfsf{{T}}} = {\\mathbfsf{{M}}}^{(p,o)} \\left[ {\\mathbfsf{{M}}}^{(c,o)}\\right]^{-1}$.\nIn the previous section regarding the basis-independence of the inductance matrix, the two surfaces used were arbitrary, so the results apply\nequally to the outer-to-plasma-surface inductance matrix and the outer-to-control-surface inductance matrix.\n\nSuppose we consider two basis sets on the plasma surface, orthogonal under the same weight, as in the previous section. Let us denote the two associated inductance matrices between the outer and plasma surfaces by ${\\mathbfsf{{M}}}^{\\left( p1,o \\right)}$ and ${{\\mathbfsf{{M}}}}^{\\left( p2,o \\right)}$.\nFrom (\\ref{eq:A1}), (\\ref{eq:M1}), and (\\ref{eq:M2}),\n\n", "index": 85, "text": "\\begin{equation}\n{{{\\mathbfsf{{M}}}}^{\\left( p2,o \\right)}}={\\mathbfsf{{A}}}{{{\\mathbfsf{{M}}}}^{\\left( p1,o \\right)}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E43.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{M}}}}^{\\left(p2,o\\right)}}={\\mathbfsf{{A}}}{{{\\mathbfsf{{M}}}}^{%&#10;\\left(p1,o\\right)}}.\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>A</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nand the transfer matrix for basis 2 is\n\n", "itemtype": "equation", "pos": 93563, "prevtext": "\nThe transfer matrix for basis 1 is\n\n", "index": 87, "text": "\\begin{equation}\n{{{\\mathbfsf{{T}}}}^{\\left( 1 \\right)}}={{{\\mathbfsf{{M}}}}^{\\left( p1,o \\right)}}{{\\left[ {{{\\mathbfsf{{M}}}}^{\\left( c,o \\right)}} \\right]}^{-1}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E44.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{T}}}}^{\\left(1\\right)}}={{{\\mathbfsf{{M}}}}^{\\left(p1,o\\right)}}%&#10;{{\\left[{{{\\mathbfsf{{M}}}}^{\\left(c,o\\right)}}\\right]}^{-1}},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>T</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mi>c</mi><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nHence, if the SVDs of the two transfer matrices are\n\n", "itemtype": "equation", "pos": 93783, "prevtext": "\nand the transfer matrix for basis 2 is\n\n", "index": 89, "text": "\\begin{equation}\n{{{\\mathbfsf{{T}}}}^{\\left( 2 \\right)}}={{{\\mathbfsf{{M}}}}^{\\left( p2,o \\right)}}{{\\left[ {{{\\mathbfsf{{M}}}}^{\\left( c,o \\right)}} \\right]}^{-1}}\n={\\mathbfsf{{A}}}{{{\\mathbfsf{{M}}}}^{\\left( p1,o \\right)}}{{\\left[ {{{\\mathbfsf{{M}}}}^{\\left( c,o \\right)}} \\right]}^{-1}}\n={\\mathbfsf{{A}}}{{{\\mathbfsf{{T}}}}^{\\left( 1 \\right)}}.\n\\label{eq:T2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E45.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{T}}}}^{\\left(2\\right)}}={{{\\mathbfsf{{M}}}}^{\\left(p2,o\\right)}}%&#10;{{\\left[{{{\\mathbfsf{{M}}}}^{\\left(c,o\\right)}}\\right]}^{-1}}={\\mathbfsf{{A}}}%&#10;{{{\\mathbfsf{{M}}}}^{\\left(p1,o\\right)}}{{\\left[{{{\\mathbfsf{{M}}}}^{\\left(c,o%&#10;\\right)}}\\right]}^{-1}}={\\mathbfsf{{A}}}{{{\\mathbfsf{{T}}}}^{\\left(1\\right)}}.\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>T</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>2</mn></mrow><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mi>c</mi><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>A</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mrow><mi>p</mi><mo>⁢</mo><mn>1</mn></mrow><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>M</mi><mrow><mo>(</mo><mi>c</mi><mo>,</mo><mi>o</mi><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>A</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>T</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nand\n\n", "itemtype": "equation", "pos": 94212, "prevtext": "\nHence, if the SVDs of the two transfer matrices are\n\n", "index": 91, "text": "\\begin{equation}\n{{{\\mathbfsf{{T}}}}^{\\left( 1 \\right)}}={{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}{{\\left[ {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}} \\right]}^{T}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E46.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{T}}}}^{\\left(1\\right)}}={{{\\mathbfsf{{U}}}}^{\\left(1\\right)}}{{{%&#10;\\mathbfsf{{\\Sigma}}}}^{\\left(1\\right)}}{{\\left[{{{\\mathbfsf{{V}}}}^{\\left(1%&#10;\\right)}}\\right]}^{T}}\" display=\"block\"><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>T</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mrow><mo>(</mo><mn>1</mn><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mi>T</mi></msup></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nthe fact that ${\\mathbfsf{{A}}}$ is orthogonal in (\\ref{eq:T2}) implies\n\\begin{eqnarray}\n{{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}} &=& {\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}, \\\\\n{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}, \\nonumber \\\\\n{{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}}, \\nonumber\n\\end{eqnarray}\nexactly as in the previous section. Thus, by the same reasoning as before, a change of basis on the plasma surface leaves the singular values and right singular vectors unchanged, and the left singular vectors correspond to the same physical pattern of $B_n$ on the plasma surface.\nRepeating this analysis with a change of basis on the control surface rather than the plasma surface,\nwe obtain an analogous result:\na change of basis on the control surface leaves the singular values and left singular vectors unchanged, while the right singular vectors correspond to the same physical $B_n$ on the control surface.\n\n\n\\subsection{Numerical example}\n\nTo demonstrate the above uniqueness properties of the inductance and transfer matrices,\nwe need an alternative set of basis functions $f'_j$  (different from (\\ref{eq:constantWFunctions}))\nwhich are orthogonal under the same constant weight $w = 1/A$.\nOne way to construct such a basis set is the following procedure.\n\nChoose any convenient coordinates $\\theta$ and $\\zeta$ to parameterize the surface\nso Fourier basis functions (\\ref{eq:FourierFunctions}) can be evaluated (though we will use different basis functions\nin the end).\nLet $L_{i,j}$ be the yet-unknown linear relation between these Fourier functions $f_j$ and the new basis functions $f'_j$ we seek:\n\n", "itemtype": "equation", "pos": 94435, "prevtext": "\nand\n\n", "index": 93, "text": "\\begin{equation}\n{{{\\mathbfsf{{T}}}}^{\\left( 2 \\right)}}={{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}}{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}}{{\\left[ {{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} \\right]}^{T}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E47.m1\" class=\"ltx_Math\" alttext=\"{{{\\mathbfsf{{T}}}}^{\\left(2\\right)}}={{{\\mathbfsf{{U}}}}^{\\left(2\\right)}}{{{%&#10;\\mathbfsf{{\\Sigma}}}}^{\\left(2\\right)}}{{\\left[{{{\\mathbfsf{{V}}}}^{\\left(2%&#10;\\right)}}\\right]}^{T}},\" display=\"block\"><mrow><mrow><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>T</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>U</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup><mo>⁢</mo><msup><mrow><mo>[</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>V</mi><mrow><mo>(</mo><mn>2</mn><mo>)</mo></mrow></msup></mrow><mo>]</mo></mrow><mi>T</mi></msup></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nNext, consider the matrix\n\n", "itemtype": "equation", "pos": 96381, "prevtext": "\nthe fact that ${\\mathbfsf{{A}}}$ is orthogonal in (\\ref{eq:T2}) implies\n\\begin{eqnarray}\n{{{\\mathbfsf{{U}}}}^{\\left( 2 \\right)}} &=& {\\mathbfsf{{A}}}{{{\\mathbfsf{{U}}}}^{\\left( 1 \\right)}}, \\\\\n{{{\\mathbfsf{{\\Sigma }}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{\\Sigma }}}}^{\\left( 1 \\right)}}, \\nonumber \\\\\n{{{\\mathbfsf{{V}}}}^{\\left( 2 \\right)}} &=& {{{\\mathbfsf{{V}}}}^{\\left( 1 \\right)}}, \\nonumber\n\\end{eqnarray}\nexactly as in the previous section. Thus, by the same reasoning as before, a change of basis on the plasma surface leaves the singular values and right singular vectors unchanged, and the left singular vectors correspond to the same physical pattern of $B_n$ on the plasma surface.\nRepeating this analysis with a change of basis on the control surface rather than the plasma surface,\nwe obtain an analogous result:\na change of basis on the control surface leaves the singular values and left singular vectors unchanged, while the right singular vectors correspond to the same physical $B_n$ on the control surface.\n\n\n\\subsection{Numerical example}\n\nTo demonstrate the above uniqueness properties of the inductance and transfer matrices,\nwe need an alternative set of basis functions $f'_j$  (different from (\\ref{eq:constantWFunctions}))\nwhich are orthogonal under the same constant weight $w = 1/A$.\nOne way to construct such a basis set is the following procedure.\n\nChoose any convenient coordinates $\\theta$ and $\\zeta$ to parameterize the surface\nso Fourier basis functions (\\ref{eq:FourierFunctions}) can be evaluated (though we will use different basis functions\nin the end).\nLet $L_{i,j}$ be the yet-unknown linear relation between these Fourier functions $f_j$ and the new basis functions $f'_j$ we seek:\n\n", "index": 95, "text": "\\begin{equation}\nf_i = L_{i,j} f'_j.\n\\label{eq:L}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E48.m1\" class=\"ltx_Math\" alttext=\"f_{i}=L_{i,j}f^{\\prime}_{j}.\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>=</mo><mrow><msub><mi>L</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msubsup><mi>f</mi><mi>j</mi><mo>′</mo></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nwhich can be evaluated numerically for any given surface.\nApplying (\\ref{eq:L}) twice and then applying (\\ref{eq:orthogonality}) for the new basis,\nwe find\n\n", "itemtype": "equation", "pos": 96472, "prevtext": "\nNext, consider the matrix\n\n", "index": 97, "text": "\\begin{equation}\nC_{i,j} = \\frac{1}{A} \\int d^2a\\; f_i f_j,\n\\label{eq:A}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E49.m1\" class=\"ltx_Math\" alttext=\"C_{i,j}=\\frac{1}{A}\\int d^{2}a\\;f_{i}f_{j},\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><mfrac><mn>1</mn><mi>A</mi></mfrac><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi>d</mi><mn>2</mn></msup><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>a</mi></mpadded><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThus, we can obtain ${\\mathbfsf{{L}}}$ by a (lower) Cholesky decomposition of ${\\mathbfsf{{C}}}$.\nWith ${\\mathbfsf{{L}}}$ now in hand, the new basis\nfunctions are then given by\n\n", "itemtype": "equation", "pos": 96716, "prevtext": "\nwhich can be evaluated numerically for any given surface.\nApplying (\\ref{eq:L}) twice and then applying (\\ref{eq:orthogonality}) for the new basis,\nwe find\n\n", "index": 99, "text": "\\begin{equation}\nC_{i,j} = L_{i,k} L_{j,k}  \\;\\;\\; \\Rightarrow \\;\\;\\; {\\mathbfsf{{C}}} = {\\mathbfsf{{L}}} {\\mathbfsf{{L}}}^{T}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E50.m1\" class=\"ltx_Math\" alttext=\"C_{i,j}=L_{i,k}L_{j,k}\\;\\;\\;\\Rightarrow\\;\\;\\;{\\mathbfsf{{C}}}={\\mathbfsf{{L}}}%&#10;{\\mathbfsf{{L}}}^{T}.\" display=\"block\"><mrow><mrow><msub><mi>C</mi><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>=</mo><mrow><msub><mi>L</mi><mrow><mi>i</mi><mo>,</mo><mi>k</mi></mrow></msub><mo>⁢</mo><mpadded width=\"+8.4pt\"><msub><mi>L</mi><mrow><mi>j</mi><mo>,</mo><mi>k</mi></mrow></msub></mpadded></mrow><mo rspace=\"10.9pt\">⇒</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>C</mi></mrow><mo>=</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><mi>L</mi><mo>⁢</mo><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>L</mi><mi>T</mi></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.05741.tex", "nexttext": "\nThese basis functions differ from (\\ref{eq:constantWFunctions}). For example, since ${\\mathbfsf{{L}}}^{-1}$ is lower-triangular,\nthe first basis function in the new set $f'_1$ is a pure Fourier function,\nso due to the variation of $N$, this first basis function cannot be a member of the set (\\ref{eq:constantWFunctions}).\nNote also that the construction above does not give a unique\nset of new (constant-$w$) basis functions:\nchanging the order of $m_j$ and $n_j$ in the Fourier functions\nwill give a different $C_{i,j}$ and hence a different set of basis functions $f'_j$.\n\nFigure \\ref{fig:basisChange} numerically demonstrates the independence of the SVDs with respect to the basis set\nfor an NCSX scenario.\nThe geometry is illustrated in figures \\ref{fig:basisChange}.a-b.\nThe plasma surface is taken from the outer surface of a {\\tt VMEC}~equilibrium, and we take the control surface\nto be offset by a uniform distance from the plasma surface. Only stellarator-symmetric distributions are included.\nFigure \\ref{fig:basisChange}.c displays the first 50 singular values computed using different choices for the basis\nfunctions on the plasma and control surface. The `standard basis' functions (\\ref{eq:constantWFunctions}) are used unless specified otherwise.\nResults obtained using the standard basis functions on both surfaces are shown with the $\\diamondsuit$ symbol.\nUsing the standard basis functions on the control surface with the `Cholesky basis' functions (\\ref{eq:CholeskyBasis}) on the plasma surface\ngives the + dataseries.\nUsing the standard basis functions on the plasma surface with the Cholesky basis functions on the control surface\ngives the $\\times$ dataseries. It can be seen that these three methods give identical singular values,\nas predicted by our proof above.\nThe fact that these quite different basis set constructions yield identical singular values\nhighlights the universality of our SVD analysis.\nSomewhat different singular values are obtained if the `pure' Fourier functions\n(\\ref{eq:FourierFunctions}) are used as the basis functions on either surface, as illustrated with\n$\\bullet$ symbols.  As already noted, the pure Fourier functions are only orthogonal under\na non-constant weight, i.e. a different weight than the standard or Cholesky basis sets,\nand so the singular values will generally differ.\n\n\\begin{figure}[h!]\n\\includegraphics[width=3in]{m20151124_01_NCSXIllustrationForBdistribPaper.jpg}\n\\includegraphics[width=3in]{m20151124_01_NCSXIllustrationForBdistribPaper_b.pdf}\n\\includegraphics[width=3in]{m20151124_02_BDISTRIBPaperPlot_NCSXSingularVals_changingBasis_c.pdf}\n\\includegraphics[width=3in]{m20151124_02_BDISTRIBPaperPlot_NCSXSingularVals_changingBasis_d.pdf}\n\\includegraphics[width=3in]{m20151124_03_BDISTRIBPaperPlot_NCSXSingularVals_changingAngles_e.pdf}\n\\includegraphics[width=3in]{m20151124_03_BDISTRIBPaperPlot_NCSXSingularVals_changingAngles_f.pdf}\n\\caption{(Color online)\n(a) NCSX plasma surface (red) and control surface (green) for demonstrating\nthe uniqueness results.\n(b) Cross-sections of the plasma and control surfaces\nat three toroidal angles.\n(c) The singular values of the inductance matrix are unchanged\nif different basis functions are used which share the same orthogonality weight ($\\diamondsuit,+,\\times$),\nwhereas the singular values change somewhat when changing to a basis with different weight ($\\bullet$).\n(d) Same result for the transfer matrix.\n(e) Singular values of the inductance matrix are independent of the coordinates used to parameterize the surfaces\nif a coordinate-independent weight is used, as in the\n`standard basis' (\\ref{eq:constantWFunctions}), but not if Fourier functions (\\ref{eq:FourierFunctions}) are used.\n(f) The same is true of the transfer matrix.\n\\label{fig:basisChange}}\n\\end{figure}\n\nA similar comparison of the transfer matrix singular values is shown in Figure \\ref{fig:basisChange}.d.\nAs with the inductance matrix, and as proved analytically above, any combination of the standard basis and Cholesky basis\nsets on the plasma and control surface yields identical singular values, since these basis sets share the same\northogonality weight.  Use of pure Fourier basis functions results in slightly different singular values.\n\n\n\\subsection{Change of angle coordinates}\n\nOne important consequence of sections \\ref{sec:uniqueness_inductance}-\\ref{sec:uniqueness_transfer}\nis that the inductance and transfer matrix SVDs are independent (up to discretization error) of the choice of angles used to parameterize the surfaces.\nKeeping the weight $w$ fixed, consider the basis functions (\\ref{eq:constantWFunctions}) for one pair of $(\\theta,\\zeta)$ angles\nand the basis functions (\\ref{eq:constantWFunctions}) for a different pair of $(\\theta,\\zeta)$ angles.\nTo these two sets of basis functions, we can apply the results of sections \\ref{sec:uniqueness_inductance}-\\ref{sec:uniqueness_transfer}.\nThus, SVD calculations with the two sets of angles must yield the same singular values, and the singular vectors must represent the same patterns in real space.\n\nNote however that the same reasoning does not apply to the Fourier functions (\\ref{eq:FourierFunctions}).\nThese functions are only a valid orthonormal basis if the orthogonality weight is $w = 1/(4\\pi^2 N)$, with $N(\\theta,\\zeta)=|{\\mbox{\\boldmath ${N}$}}|$ given by (\\ref{eq:N}),\nwhich \\emph{changes if we change the $(\\theta,\\zeta)$ coordinates}.  If we alter the coordinates used to parameterize the surfaces,\n$w$ changes, and so there is no reason the singular values and vectors will not change.  Thus, for maximal universality of the results,\nthere is good motivation\nto use the basis functions (\\ref{eq:constantWFunctions}) (as we have done throughout this work) and not (\\ref{eq:FourierFunctions}).\n\nThese points are illustrated in figures \\ref{fig:basisChange}.e-f.  The same plasma surface shape\nis parameterized by two different poloidal angles:\nthe angle used in the {\\tt VMEC}~code\n(chosen to minimize the spectral width of the surface shape), and the PEST angle (which makes magnetic field lines straight).\nBoth coordinate systems use the standard cylindrical toroidal angle, and the coordinates describing the control surface are held fixed.\nThe figures show that when the coordinate-independent weight $w=1/A$ is used (associated with the standard basis functions),\nthe singular values of the inductance and transfer matrices are independent of the choice of angle.\nHowever, when the Fourier basis functions are used (implying $w = 1/(4\\pi^2 N)$), the singular values\ndo depend on the choice of angle.\n\n\\section{Discussion and conclusions}\n\\label{sec:conclusions}\n\nTo minimize the engineering difficulties in a tokamak or stellarator reactor, the distance between plasma and coils should be large,\nand this distance can be much greater for `efficient' plasma shapes.  The transfer and inductance matrices, and the singular value\ndecompositions thereof,\nprovide information as to how efficiently a plasma shape can be produced from a distance.  \nOne quantitative measure of difficulty derived from these matrices is the efficiency sequence, \nthe rate of (exponential) decrease in the projection of $B_n^{pl}+B_n^{fix}$\n(normal magnetic field due to plasma current and any fixed known external coils) onto the left singular vectors.\nThis measure is rather insensitive to the choice of control surface.\nAnother measure is the feasibility sequence, which is the efficiency sequence divided by the singular values.\nThis sequence decreases or increases if it is likely feasible or infeasible to support the plasma shape using currents on the control surface.\n\nIn this work we have further developed the theory of the transfer and inductance matrices, and demonstrated their properties with several numerical computations. Specifically,\n\n\\begin{enumerate}\n\\item\nIn figure \\ref{fig:divertorEasy}, we demonstrated that the transfer and inductance matrices both correctly capture the fact that\na diverted tokamak shape is not significantly harder to produce than an elliptical shape, despite the sharp corner.\nThe figure also shows that the transfer and inductance matrices capture the fact that concave shapes are inefficient/difficult to produce.\n\\item\nFor axisymmetric surfaces with circular cross section, we computed the SVDs analytically in the large-aspect-ratio approximation,\nequations (\\ref{eq:highAspectRatioBesselSV})-(\\ref{eq:highAspectRatioPowerSV})\nand (\\ref{eq:highAspectRatioInductanceBesselSV})-(\\ref{eq:highAspectRatioInductancePowerSV}).\nWe demonstrated by direct numerical computation that these formulae remain extremely accurate at realistic aspect ratio.\nThese formulae may be applicable for other problems that do not directly involve the transfer or inductance matrices,\nsince they enable pairs of poloidal and toroidal mode numbers $(m,n)$ to be ranked by efficiency.\n\\item\nWe derived eq (\\ref{eq:equivalentNAndM}) relating the toroidal and poloidal mode numbers that can be controlled with comparable efficiency,\nand we demonstrated this formula agrees well with direct calculation of the transfer matrix singular values in toroidal geometry at realistic aspect ratio.\n\\item\nWe systematically compared the inductance and transfer matrix approaches. While the two methods generally yield the same trends\nthat shorter spatial wavelengths are less efficient, structures with the longest wavelengths are found to be the most\nefficient in the transfer matrix\napproach but not the most efficient in the inductance matrix approach. This behavior arises physically\nbecause the inductance matrix relates $B_n$ to the current potential,\n$B_n$ arises from the \\emph{gradient} of the current potential, and this gradient accentuates smaller structures.\nThis difference between the inductance and transfer matrix measures\nhas been visible in all the examples we considered,\nsuch as the different $m=0$ behavior in figure \\ref{fig:plotSingularValsVsMAndNForPaper1},\nthe opposite $n$ dependencies in figure \\ref{fig:highAspectRatioMpol0}.a-b,\nthe more complicated structures in figure \\ref{fig:divertorSingularVects}.d compared to \\ref{fig:divertorSingularVects}.c, \nand the shorter wavelengths in figure \\ref{fig:w7x_inductance_V} compared to figure \\ref{fig:w7x_transfer_V}.\n\n\n\\item\nWe proved analytically and demonstrated numerically that the SVD efficiency measures using both the transfer and inductance matrices are\nunique, in the following sense. Assuming a coordinate-independent orthogonality weight is used, and assuming\na sufficient number of basis functions are included to adequately resolve a given number of singular vectors,\nthen both the resolved singular values and the real-space representation of the resolved singular vectors\nare independent of the basis functions and independent of the coordinates used to parameterize\nthe surfaces.\n\\end{enumerate}\nWe anticipate these developments in the theory of efficient plasma shaping will facilitate\nstellarator optimization and tokamak control.\nOne potential application is the identification of efficiently produced stellarator shapes with relatively sharp corners in the boundary surface,\nwhich may enable divertor solutions.\n\n\\begin{acknowledgments}\nWe are grateful to Michael Drevlak for providing the W7-X plasma and coil surface   data, and to Geri Papp for assistance obtaining ITER data.\nWe also thank Sam Lazerson for assistance with the {\\tt VMEC}~and {\\tt NESCOIL}~codes.\nThis work was supported by the\nU.S. Department of Energy, Office of Science, Office of Fusion Energy Science,\nunder Award Numbers DE-FG02-93ER54197, DE-FC02-08ER54964, and DE-FG02-95ER54333.\nComputations were performed on the Edison and Cori systems at\nthe National Energy Research Scientific Computing Center, a DOE Office of Science User Facility supported by the Office of Science of the U.S. Department of Energy under Contract No. DE-AC02-05CH11231.\n\\end{acknowledgments}\n\n\n\\appendix\n\n\\section{Overlap matrix}\n\nHere we present one method to visualize the relationship between the inductance and transfer matrices.\nGiven any two measures of efficiency, each associated with an orthonormal efficiency-ordered set of functions on the plasma surface,\none illuminating method to compare the measures is to expand one set of functions in the other set.\nFor the inductance and transfer matrix singular vectors, this expansion is given by the ``overlap matrix''\n${\\mathbfsf{{U}}}_{\\mbox{transfer}}^T {\\mathbfsf{{U}}}_{\\mbox{inductance}}$.  This overlap matrix is shown in figure \\ref{fig:overlap_circular}\nfor the scenario of figure \\ref{fig:geometry}.a, axisymmetric surfaces with circular cross-section\nand plasma aspect ratio 10.  Several facts can be understood from this figure. First, each row and column are dominated by a single\n$O(1)$ matrix element, which indicates that the two efficiency measures result in essentially the same set of $B_n$ distributions,\nif one neglects the order.\nHowever, these dominant $O(1)$ matrix elements can be rather far from the diagonal, particularly for the first hundred\ndistributions, indicating that the two efficiency measures rank these distributions in a different order.\nAfter several hundred distributions, the dominant elements of the overlap matrix become more clustered near the diagonal,\nindicating the ranking of the two efficiency measures becomes more similar.\n\n\\begin{figure}[h!]\n\n\\includegraphics[width=3in]{plotOverlapMatricesForBdistribPaper_circular.pdf}\n\\caption{(Color online)\nElements of the overlap matrix ${\\mathbfsf{{U}}}_{\\mbox{transfer}}^T {\\mathbfsf{{U}}}_{\\mbox{inductance}}$, showing an expansion of the transfer matrix\n$B_n$ distributions in the inductance matrix $B_n$ distributions, and vice-versa.\nThis calculation is performed for axisymmetric surfaces with circular cross-section, $R/a_P=10$,and $a_C/a_P = 1.7$ (figure \\ref{fig:geometry}.a).\n\\label{fig:overlap_circular}}\n\\end{figure}\n\nFigure \\ref{fig:overlap_divertor} shows the overlap matrix for the divertor shape with the 1.5 m offset control surface,\nfrom figure \\ref{fig:shapes}. As this overlap\nmatrix is dominated by the diagonal for indices above $\\sim 10$, the inductance and transfer matrices provide essentially\nidentical information beyond the 10th singular vectors. However, the large values of the overlap matrix above the diagonal for indices $<10$ result\nfrom long-wavelength magnetic field structures that are weighted as more efficient by the transfer matrix than by the inductance matrix.\nFor instance, the 10th inductance matrix singular vector is dominated by an $m=1$ structure.\n\n\n\n\\begin{figure}[h!]\n\n\\includegraphics[width=3in]{20151209-01-plotITEROverlapMatrixForPaper_divertor.pdf}\n\\caption{(Color online)\nElements of the overlap matrix ${\\mathbfsf{{U}}}_{\\mbox{transfer}}^T {\\mathbfsf{{U}}}_{\\mbox{inductance}}$.\nThis calculation is performed for the axisymmetric divertor plasma shape with 1.5 m offset control surface (figure \\ref{fig:shapes}).\nNote that only the axisymmetric singular vectors are included here.\n\\label{fig:overlap_divertor}}\n\\end{figure}\n\nElements for the overlap matrix ${\\mathbfsf{{U}}}_{\\mbox{transfer}}^T {\\mathbfsf{{U}}}_{\\mbox{inductance}}$ of the W7-X example\nare shown in figure \\ref{fig:overlap_W7X}, again illustrating the\ntransfer matrix singular vectors expanded in the inductance matrix singular vectors,\nand equivalently the inductance matrix singular vectors expanded in the transfer matrix singular vectors.\nIt can be seen that the overlap matrix is generally largest near the diagonal, indicating the inductance and transfer matrix\ngive a roughly similar sense of efficiency.  However, as one moves away from the diagonal of the overlap matrix,\nthe decrease of the matrix element sizes is slow.  A singular vector of the transfer matrix generally has a projection of at least $1\\%$\nonto as many as $\\sim 100$ singular vectors of the inductance matrix, and vice-versa.  Thus, if several hundred singular vectors are being considered,\nit makes little difference whether one measures efficiency using the transfer or inductance matrix approaches, but if $\\le 100$ singular vectors\nare being considered, it makes a large difference.\nFigure \\ref{fig:overlap_W7X} has one off-diagonal feature, showing a significant overlap between transfer matrix\nsingular vectors of index $\\sim 9$ and inductance matrix singular vectors of index $\\sim 80$. This feature can be understood from the fact that these singular vectors have a significant $(m=0,n=1)$ component, which is precisely the component found to be most different between the inductance and transfer measures in section \\ref{sec:axisymm}, efficient according to the transfer matrix but inefficient according to the inductance matrix.\n\n\\begin{figure}[h!]\n\n\\includegraphics[width=3in]{plotOverlapMatricesForBdistribPaper_W7X.pdf}\n\\caption{(Color online)\nElements of the overlap matrix ${\\mathbfsf{{U}}}_{\\mbox{transfer}}^T {\\mathbfsf{{U}}}_{\\mbox{inductance}}$\nThis calculation is performed for the W7-X geometry of figure \\ref{fig:w7x} with real control surface.\n\\label{fig:overlap_W7X}}\n\\end{figure}\n\n\\bibliography{efficientBDistributionsPaper}\n\n\n\n", "itemtype": "equation", "pos": 97036, "prevtext": "\nThus, we can obtain ${\\mathbfsf{{L}}}$ by a (lower) Cholesky decomposition of ${\\mathbfsf{{C}}}$.\nWith ${\\mathbfsf{{L}}}$ now in hand, the new basis\nfunctions are then given by\n\n", "index": 101, "text": "\\begin{equation}\nf'_i = ({\\mathbfsf{{L}}}^{-1})_{i,j} f_j.\n\\label{eq:CholeskyBasis}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E51.m1\" class=\"ltx_Math\" alttext=\"f^{\\prime}_{i}=({\\mathbfsf{{L}}}^{-1})_{i,j}f_{j}.\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mi>i</mi><mo>′</mo></msubsup><mo>=</mo><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><merror class=\"ltx_ERROR undefined undefined\"><mtext>\\mathbfsf</mtext></merror><mo>⁢</mo><msup><mi>L</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>i</mi><mo>,</mo><mi>j</mi></mrow></msub><mo>⁢</mo><msub><mi>f</mi><mi>j</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]