[{"file": "1601.03920.tex", "nexttext": "\nwhere $R_{\\rm e, a}$ is the half-light radius along the major-axis and (b/a) is the axis ratio of the galaxy.  \n\nIn order to test the robustness of our results, we compute the number density of red nuggets using three alternative definitions of compactness:\n\n$\\bullet$ The criterion proposed by \\citep[]{Barro13} (hereinafter Barro13), used by several authors \\citep[e.g.][]{Barro15,Dam15,Pog13},\n\n", "itemtype": "equation", "pos": 9436, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\n\\begin{abstract}\nMassive high-redshift quiescent compact galaxies (nicknamed {\\it red nuggets}) have been traditionally connected to present-day elliptical galaxies, often overlooking the relationships that they may have with other galaxy types. We use large bulge-disk decomposition catalogues based on the Sloan Digital Sky Survey (SDSS) to check the hypothesis that red nuggets have {\\it survived} as compact cores embedded inside the haloes or disks of present-day massive galaxies. In this study, we designate a {\\it compact core} as the bulge component that satisfies a prescribed compactness criterion. Photometric and dynamic mass-size and mass-density relations are used to show that, in the inner regions of galaxies at $z\\sim0.1$, there are {\\it abundant} compact cores matching the peculiar properties of the red nuggets, an abundance comparable to that of red nuggets at $z\\sim1.5$. Furthermore, the morphology distribution of the present-day galaxies hosting compact cores is used to demonstrate that, in addition to the standard channel connecting red nuggets with elliptical galaxies, a comparable fraction of red nuggets might have ended up embedded in disks. This result generalises the inside-out formation scenario; present-day massive galaxies can begin as dense spheroidal cores (red nuggets), around which either a spheroidal halo or a disk are formed later.\n\\end{abstract}\n\n\n\n\\begin{keywords}\ngalaxies: evolution -- galaxies: formation -- galaxies: stellar content -- galaxies: structure -- galaxies: bulges.\n\\end{keywords}\n\n\n\n\n\n\\section{Introduction}\n\nAn approximate census of massive galaxies at redshift $z\\sim1.5$\nprovides a morphological classification into 40\\% disks, 15\\% extended\nspheroids, 25\\% compact spheroids and 20\\% peculiar objects\n\\citep[e.g.][]{Peth15}. More than 9 Gyrs later, in the present-day\nUniverse, a similar census of massive galaxies gives 30\\% disks, 65\\%\nextended spheroids and 5\\% peculiar morphologies. Strikingly, compact\nspheroids are virtually absent in the present-day Universe\n\\citep[e.g.][]{Tru09,Tay10,Saul15}. At $z\\sim1.5$, the majority ($\\sim$80 \\%) of massive compact spheroids were already quiescent, while the\nrest were actively forming stars. The massive high-redshift quiescent\ncompact galaxies have been termed {\\it red nuggets}\n\\citep{Dam09}. Recent studies on the number density evolution of red\nnuggets point to the star forming compact massive galaxies (sCMG) as\ntheir probable progenitors \\citep[e.g.][]{Barro13,vD15}. At redshift\n$z\\sim2.5$, the number density of sCMGs matched that of red nuggets.\nBy $z\\sim1.5$, 1.5 Gyr later, the number density of red\nnuggets has increased by an order of magnitude while that of sCMGs\nhas decreased by a factor of two. The straightforward\ninterpretation is that the red nuggets are the descendants of rapidly quenched sCMGs. But unlike this relative consensus on the origin of red nuggets, there is not the same agreement regarding their fate after $z\\sim1.5$.\n\nRed nuggets were discovered almost a decade ago\n\\citep[e.g.][]{Dad05,Tru06a,Lon07} and more than a hundred studies\nhave been carried out on their evolution. Since their discovery, red\nnuggets have been linked to present-day elliptical galaxies; the two classes share a similar spheroidal morphology, and the fraction of elliptical galaxies (extended\nspheroids) has increased by a factor of four in the last 9 Gyrs\n\\citep{Bui13}. But for the former population to have evolved into the latter, there must be a mechanism by which an ultra-compact spheroid with half-light radius\nof $\\sim$1 kpc can become a fully-fledged elliptical, three to six times\nlarger. Several physical processes, including major and minor mergers\n\\citep[e.g.][]{Naab09,Tru11} and puffing-up by AGN activity\n\\citep{Fan08}, have been proposed to explain the considerable growth\nin size. The prevailing paradigm, put forward by \\cite{Hop09} and\n\\cite{Bez09}, postulates an appealing scenario in which red nuggets\nended up in the centres of present-day giant ellipticals. This\nproposal is consistent with the inside-out growth scenario\n\\citep[e.g.][]{LP03} in which compact cores are formed at high\nredshift ($z\\geqslant 2$) through highly dissipative processes\n\\citep[e.g.][]{Naab07,Dek09,Oser10,Joh12} and\nthen grow an extended stellar halo through dissipation-less minor\nmergers \\citep[e.g.][]{Ferr14,MorI16}.\n\nIn addition to this traditional evolutionary scenario, there is another potentially important channel leading from red nuggets to disk galaxy\nbulges. The main observational evidences for\nthis scenario have been provided by \\cite{Gra13}, \\cite{DG13} and \\cite{GraDS15}. \\cite{Gra13} sample includes the set of 19 red nuggets\nobserved by \\cite{Dam09} and a catalogue of few hundred bulges\ncompiled by \\cite{GW08}. In two subsequent studies, \\cite{DG13}\nand \\cite{GraDS15} carried out detailed bulge+disk (B+D) decompositions, but only for a small sample of present-day S0 galaxies, finding that S0 bulges are structurally similar to red nuggets.\n\nFigure 1 of \\cite{Gra13} presents an instructive sketch of mass-size and mass-density diagrams\nfor all the spheroidal families, from giant elliptical galaxies to\nglobular clusters. In the accompanying text, the author emphasises the\nconsiderable overlap of the structural properties of red nuggets with\nthose of present-day bulges. Based on cosmological simulations, \\cite{Zol15} and \\cite{Tacch15} show that extended star-forming discs develop around red nuggets after compaction. \n\nThe aim of the present study is to carry out a comprehensive analysis of the connection between red nuggets and present-day compact cores without any restriction on the morphology of the host\ngalaxies. Specifically, the hypothesis we want to test is that a significant fraction of red\nnuggets have {\\it survived}, masked inside spheroidal or\ndisc galaxies in the present-day Universe.  \n\n\nTo support this hypothesis, we would need to find a sufficient population of compact cores embedded inside present-day galaxies, where:\n\n\\begin{itemize}\n\\item{{\\it Core} is a generalization of the bulge component in B+D decomposition of galaxies with all morphologies.} \n\\item{{\\it Compact core} is a core that fulfills the same compactness criterion used for red nuggets. We test the robustness of our results using three different definition of compactness, from the literature.} \n\\item{{\\it Sufficient} means that the abundance of present-day red nugget-like cores should be approaching\\footnote{Based on cosmological simulations \\citep[]{Wellons15,Furlong15}, we might expect $\\sim$ 20 \\% of the red nuggets to have been consumed or destroyed in merger events, so the abundances should not necessarily match exactly.} that of the red nuggets at $z\\sim1.5$.}\n\\end{itemize}\nThe present study takes advantage of SDSS-based catalogues containing B+D decomposition of hundreds of thousands of galaxies \\citep[e.g.][]{Sim11,Meert15}. In particular, we have used the \\cite{Men14} catalogue, itself a derivation of \\cite{Sim11}, which provides stellar masses for the B and D structural components. We impose the B+D decomposition on the entire present-day galaxy sample, regardless of their morphology, designating as {\\it cores} both the central components of ellipticals and the bulges of disc galaxies. After B+D decomposition, cores are treated as independent structures and evaluated for their compactness, according to standard criteria (see section 2).\n\n\nThe layout of the paper is the following: Section 2 is devoted to the\ndata description, including the selection of the z$\\sim$0 compact\ncore sample, reference elliptical galaxies and the compilation of red nuggets from the literature. Section 3 is devoted to the results of the present study,\nin particular the check of the working hypothesis, i.e. that red nuggets have survived as the compact cores of present-day galaxies. Discussion and conclusions follow in Sections 4 and 5. Decimal logarithms are used along the study. To keep consistency with other studies, we assume a $\\Lambda$CDM cosmology with $\\Omega_{\\Lambda}$ = 0.7, $\\Omega_{\\rm M}$ = 0.3 and $H_0$ = 70 km s$^{-1}$ Mpc$^{-1}$.\n\n\\section{The Data}\n\\label{sec:data}\n\nSeveral samples are extracted from the parent catalogue \\citep{Men14}. First we introduce the compactness criteria, which allow the selection of structurally similar cores and red nuggets. Second, low-redshift samples, namely the compact cores and reference ellipticals, are introduced and third, the high-redshift red nugget sample is presented.\n\n\\subsection{Compactness criteria}\n\\label{sec:compact}\n\n\nOur goal is to measure the abundance of z$\\sim$0.1 galaxy cores structurally similar to red nuggets, and compare it to that of red nuggets at z$\\sim$1.5. Therefore, information on the red nugget number density as a function of redshift becomes crucial for our work. Three different studies have addressed this issue in the literature, based on different criteria to define the red nuggets. As emphasised by \\citet{Dam15}, the galaxy number densities and the structural parameters are rather sensitive to the choice of the compactness criterion, as well as to the stellar mass range probed. Consequently, we have to assure that each comparison is carried out under the same selection criteria. \n\nIn the present study, circularised half-light radii $R_{\\rm e}$ have been used, with\n\n", "index": 1, "text": "\\begin{equation}\n    \\log (R_{\\rm e}) = \\log(R_{\\rm e, a}) + 0.5 \\log(b/a)\n\t\\label{eq:radius}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\log(R_{\\rm e})=\\log(R_{\\rm e,a})+0.5\\log(b/a)\" display=\"block\"><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mi mathvariant=\"normal\">e</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mrow><mi mathvariant=\"normal\">e</mi><mo>,</mo><mi mathvariant=\"normal\">a</mi></mrow></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mn>0.5</mn><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>b</mi><mo>/</mo><mi>a</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\nThis is generally associated with a mass limit $\\log(M_{\\star}/{\\rm M}_\\odot)\\geq10.0$.\n\n$\\bullet$ A more restrictive compactness criterion, proposed by \\cite{vD15} (hereinafter vDokkum15), \n\n", "itemtype": "equation", "pos": 9942, "prevtext": "\nwhere $R_{\\rm e, a}$ is the half-light radius along the major-axis and (b/a) is the axis ratio of the galaxy.  \n\nIn order to test the robustness of our results, we compute the number density of red nuggets using three alternative definitions of compactness:\n\n$\\bullet$ The criterion proposed by \\citep[]{Barro13} (hereinafter Barro13), used by several authors \\citep[e.g.][]{Barro15,Dam15,Pog13},\n\n", "index": 3, "text": "\\begin{equation}\n   \\log (R_{\\rm e}/{\\rm kpc}) < (\\log(M_{\\star}/{\\rm M}_\\odot) - 10.3)/1.5~.\n\t\\label{eq:barro13}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\log(R_{\\rm e}/{\\rm kpc})&lt;(\\log(M_{\\star}/{\\rm M}_{\\odot})-10.3)/1.5~{}.\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mi mathvariant=\"normal\">e</mi></msub><mo>/</mo><mi>kpc</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>&lt;</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>M</mi><mo>⋆</mo></msub><mo>/</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>10.3</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mpadded width=\"+3.3pt\"><mn>1.5</mn></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\nwith a $\\log(M_\\star/{\\rm M}_\\odot)\\geq 10.6$ limit.\n\n$\\bullet$ Finally, the criterion proposed by \\cite{vdW14} (hereinafter vdWel14)\n\n", "itemtype": "equation", "pos": 10262, "prevtext": "\nThis is generally associated with a mass limit $\\log(M_{\\star}/{\\rm M}_\\odot)\\geq10.0$.\n\n$\\bullet$ A more restrictive compactness criterion, proposed by \\cite{vD15} (hereinafter vDokkum15), \n\n", "index": 5, "text": "\\begin{equation}\n     \\log (R_{\\rm e}/{\\rm kpc}) < \\log(M_{\\star}/{\\rm M}_\\odot) - 10.7,\n\t\\label{eq:vD15}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\log(R_{\\rm e}/{\\rm kpc})&lt;\\log(M_{\\star}/{\\rm M}_{\\odot})-10.7,\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>R</mi><mi mathvariant=\"normal\">e</mi></msub><mo>/</mo><mi>kpc</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>&lt;</mo><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>M</mi><mo>⋆</mo></msub><mo>/</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mn>10.7</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\nwith a $\\log(M_\\star/{\\rm M}_\\odot)\\geq 10.7$ limit. It is worth mentioning that this criterion uses $R_{\\rm e, a}$, the half-light radius measured along the galaxy major axis, instead of the more common circularized radius, $R_{\\rm e}$. \n\nWhile we test our results on the abundances of red nuggets and compact cores using all three different sets of selection criteria (\\S\\,\\ref{sec:numberdens}), for the first part of this paper (\\S\\S\\,\\ref{sec:photo} - \\ref{sec:dyn}) we adopt the vDokkum15 definition. In fact, the definition of vdWel14 would not allow us to perform a direct comparison to other spheroidal systems (\\S\\,\\ref{sec:photo}) as it is based on major-axis effective radii. On the other hand, the lower mass cutoff of Barro13 would imply a significantly higher contamination from star-forming galaxies in our sample of red nuggets, with respect to the vDokkum15 higher mass cutoff \\citep[see][]{Mor13}.\n\n\n\n\\subsection{Low redshift samples}\n\\label{sec:lowz}\n \nThe parent sample used in our study is the \\cite{Men14} catalogue\n(hereafter Mendel14), an upgraded section of the \\cite{Sim11} catalogue\n(Simard11), which contains the B+D decomposition of more\nthan one million SDSS-DR7 galaxies. The main improvement to the original catalogue is\nthe stellar mass calculation of the bulge and\ndisk components. Stellar masses are computed through Spectral Energy Distribution (SED)-fitting to\nthe five SDSS-$ugriz$ bands, using dusty synthetic templates from\n\\cite{Con09} with a \\citet{Chab03} stellar initial mass function (IMF). The Mendel14 catalogue\nincludes 657,996 galaxies from the SDSS-DR7 \\citep{Aba09} with\nspectroscopic redshifts and successful $ugriz$ B+D decomposition available. The\noriginal 2D decomposition in Simard11 used three alternative galaxy\nfitting models: \n\\begin{enumerate}\n\\item{de Vaucouleurs bulge (fixed Sersic index $n_{\\rm\n  bulge}$ = 4) + exponential disk (Sersic index $n_{\\rm disk}$ = 1),}\n\\item{exponential disk + free-$n_{\\rm bulge}$, with $n_{\\rm bulge}$\nallowed to vary from 0.5 to 8 and} \n\\item{a single component free\n$n$-Sersic model to fit the whole galaxy ($n$-Sersic).}\n\\end{enumerate}\nIt is important to notice that Mendel14 stellar masses were computed using only two of\nthose fitting models: (ii) and (iii). The bias introduced by the use of (i)\ninstead of (ii) is discussed in Appendix~\\ref{app:bias}. \n\nTwo low-redshift subsamples are extracted from the  Mendel14 catalogue. The main one is the {\\it compact core} subsample (\\S\\,\\ref{sec:compl}), including galaxy cores that fulfill the vDokkum15 compactness criterion. The second subsample consists of bona-fide ellipticals (\\S\\,\\ref{sec:ellipt}), and serves as a reference point for the study of galaxy structural properties (\\S\\,\\ref{sec:photo}).\n\nBulge-disk decomposition is a delicate procedure demanding extra care to guarantee reliable outcomes. We have applied a rigorous screening, with eight steps, generally following the recommendations of the catalogue authors \\citep[e.g.][]{Men14,Berg14,Bluck14}.\n\n\n\\subsubsection{Compact core Subsample Selection}\n\\label{sec:compl}\n\nWe select compact cores from the Mendel14 catalogue based on different criteria. This is summarized in Table~\\ref{tab:subs}, where we also report the number of objects surviving each selection step.\n\nFirst, we adopt a surface brightness limit of $\\mu_{50,r} \\le 23.0$ mag arcsec$^{-2}$ to assure a complete sample. Although the formal surface brightness limit of the SDSS spectroscopic sample is $\\mu_{50,r} = 24.5$ mag arcsec$^{-2}$ \\citep{Stra02}, the sample in the range $\\mu_{50,r}$ 23.0 - 24.5 \nmag arcsec$^{-2}$ is not complete because galaxies were targeted only under some particular local sky conditions. Second, we exclude objects with uncertain decomposition, using the parameter {\\it dBD}, which is the offset between two alternative galaxy mass calculations, $M_B$ + $M_D$\n(sum of independently derived bulge and disk masses) and $M_{B+D}$\n(mass derived from the total bulge+disk photometry) in units of the\nstandard error. Significant inequality between these two masses is an indication of inconsistent decomposition, so systems with the cutoff $dBD > 1\\sigma$, proposed by Mendel14, are excluded. These two cuts removed 9.5 \\% of the objects, as seen in Table~\\ref{tab:subs}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_2Dhisto.eps}\n  \\caption{Bidimensional histogram showing the mass-size\n    distribution for all the decomposed cores in our sample galaxies\n    (203,369 objects, see Table~\\ref{tab:subs}). Three compactness criteria, Barro13, vDokkum15 and vdWel14 (described in the text), are overplotted and compact\n    cores are located below the dashed lines, rendering 65,637\n    systems under the Barro13 criterion. The more restrictive vDokkum15 and vdWel14 criteria render 10,566 and 12,721 respectively. Note that the vdWel14 line is only approximate, because the criterion requires major-axis sizes instead of the circularized radii used in the plot. The isolated white dot marks the approximate location of the Milky Way's bulge (e.g. Di Matteo et al. 2015; Licquia \\& Newman, 2015).}\n  \\label{fig:compactness}\n\\end{figure}\n\nThe third cutoff, limiting the redshift range, is set to achieve a\nsignificant sample completeness in terms of the core stellar mass, $M_{\\star,{\\rm core}}$, the main reference parameter of this\nstudy. The choice of redshift range, $0.025 \\leq z \\leq 0.15$, yields a significant completeness in our target mass range,\n$\\log(M_{\\star,{\\rm core}}/{\\rm M}_\\odot)\\geq 10.0$, as discussed in Appendix~\\ref{app:compl}. Notice that in the number density\nestimations (\\S\\,\\ref{sec:numberdens}), the V/Vmax statistic is\nalso used to correct for any residual incompleteness.\n\nIn the fourth step, we exclude galaxies reported to show anomalous B+D\ndecomposition, tagged `Type-4' in the Mendel14 classification. They comprise\ngalaxy/star superposition and inverted B+D profiles, in which a disk\ndominates at the center and a bulge at the external parts. Following\n\\cite{Berg14}, fifth and sixth cutoffs were applied to promote\nface-on inclinations and to avoid strong bars. Face-on galaxies (disk\ninclination $\\leq$ 60 degrees) are favoured in order to minimize\ninternal disk extinction on the bulge light, while high bulge\nellipticities are avoided to prevent strong bars being mistaken for\nbulges (e$_{\\rm core} <$ 0.6).\n\nFinally, the potential impact of poorly resolved galaxy images on the\nB+D decomposition is considered. We follow the study by \\cite{Gad08},\nwhich showed that the structural properties of cores can be reliably\nretrieved provided that their effective radii are larger than $\\sim$\n80 per cent of the PSF half-width-at-half-maximum (HWHM), i.e. \n($R_{\\rm e,core}$/PSF) $\\geq$ 0.8. So far, by imposing these seven selection criteria, the parent sample has been reduced to 203,369 objects (31\\% of the original sample; see Tab.~\\ref{tab:subs}). The last selection is on the cores that fulfill the vDokkum15 compactness criterion (equation \\ref{eq:vD15}). Additionally, Table \\ref{tab:subs} shows the corresponding results for the other criteria (Equations \\ref{eq:barro13} and \\ref{eq:vdW14}). Figure \\ref{fig:compactness} provides a visual display of the compact core selection criteria for both Barro13 and vDokkum15 on top of a 2D histogram including the 203,369 objects, which got through the first seven screening steps.  \n\nThe {\\it compact core} definition is essential to the present\nstudy and deserves further clarification. The B+D decomposition\nis straightforward for disk galaxies, where a compact core is\nsimply a bulge that has satisfied the compactness criterion. A\ndecomposed elliptical galaxy should not be interpreted literally as\nhaving physically meaningful bulge and a disk. In addition to the\ncentral {\\it core}, the external component can be a disk, a halo or\nany significant departure from a single fit. Distinct inner components\nhave been extensively observed in ellipticals\n\\citep[e.g.][]{Cote06,Lau07}. More recently, \\cite{Huang13} have shown\nthat more than 75 \\% of their sample of 94 nearby elliptical galaxies\nwere better described when additional subcomponents were added to the\nconventional single Sersic function.\n\n\\begin{table}\n\\caption{Subsample selection, listing the steps leading from the parent sample (Mendel14) to our {\\it compact core} subsample. Steps are described in the main text.}\n\\label{tab:subs}\n\\centering\n\\begin{tabular}{ | l  | r | }\n\\hline\nFilters & Objects \\\\\n\\hline \nParent sample (Mendel14) & 657,996\\\\ \nSurface Brightness & 655,530 \\\\ \nUncertain Decomposition & 595,402 \\\\ \n0.025 $\\leq$ z $\\leq$ 0.15 & 456,169 \\\\ \nType $\\neq$ 4 & 437,089 \\\\ \n${\\rm Disk(i)\\leq60^o}$ & 291,192 \\\\ \n${\\rm e_{\\rm core} < 0.6}$ & 249,990 \\\\ \n(R$_{\\rm core}$/PSF) $\\geq$ 0.8 & 203,369 \\\\\n{\\bf Compact cores (vDokkum15)} & {\\bf 10,566} \\\\\n\\hline\nCompact cores (Barro13) & 65,637 \\\\\nCompact cores (vdWel14) & 12,721 \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\n\nWe notice that some of the selection steps in Table~\\ref{tab:subs} might bias our compact core abundance estimates. For instance, while the use of a given redshift range is not expected to impact our results, selections based on core elongation and SDSS-image resolution might exclude some genuine compact cores from the number density estimates. Therefore, one should regard abundance estimates based on the compact core sample in Table~\\ref{tab:subs} as lower limits. In \\S~\\ref{sec:numberdens}, we discuss how removing some selection steps listed in Table~\\ref{tab:subs} can be used to obtain upper limits on the number densities.\n\n\n\\subsubsection{The Reference Elliptical Galaxies}\n\\label{sec:ellipt}\n\nThroughout this study, the cores resulting from galaxy decomposition are treated as if they were independent spheroids detached from their surrounding halos or disks. We compare the properties of these compact cores with a reference sample of bona-fide ellipticals.\n\nBona-fide ellipticals are selected from the subsample of 456,169 galaxies obtained after applying the first three selections listed in Table~\\ref{tab:subs} to the Mendel14 catalogue. {\\it Reference elliptical galaxies} have been selected according to their morphology and the type of fitted surface-brightness profiles. We require the galaxy morphology to be {\\it Elliptical} according to the definitions given in \\S~\\ref{sec:numberdens} and Tab.~\\ref{tab:morphoType}. Additionally, ellipticals must belong to the {\\it Type 1}, one of the four classes devised by \\cite{Men14} to divide galaxies according to their profile. {\\it Type 1} are single-component galaxies, in which the bulge component dominates the surface-brightness profile at all radii (i.e. B/T$\\sim$1). The resulting sample contains 18,916 elliptical galaxies. Size and mass parameters for these reference ellipticals are taken from the whole galaxy fit, using single component, free $n$-Sersic models. Note that a small fraction of ellipticals ($\\sim$4.5 \\%) are found to host a compact core. However, this does not affect our conclusions, our main aim being to compare the properties of ellipticals as a whole with those of compact cores, seen as separate structures, and red nuggets.\n\n\n\\subsection{The red nugget sample}\n\\label{sec:redsample}\n \n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_histo_redn.eps}\n  \\caption{Histogram of the 534 red nuggets that fulfil the vDokkum15 compactness criterion, separated into three redshift bins and shown as a function of their stellar mass.}\n  \\label{fig:histored}\n\\end{figure}\n\n\nOur sample includes observed red nuggets from 29 works in the\nliterature, 24 of which were part of two major\ncompilations by \\cite{Dam11} and \\cite{Sande13}, who renormalized them\nto a common observational frame. \\cite{Dam11} contributed 433 galaxies with spectroscopic redshifts spanning a range 0.18 $\\lesssim$ z $\\lesssim$ 2.67. Their compiled stellar masses were re-scaled to a\n\\citet{BGIMF} IMF. However, the stellar masses of our study\nwere derived by Mendel14 using M/L ratios for a Chabrier IMF. In order\nto carry out a consistent comparison, we have converted \\cite{Dam11}\nstellar mass values into the Chabrier IMF counterparts. The M/L\nconversion follows the prescriptions presented by \\citet[Table\n  2]{Ber10}, where masses with Chabrier IMF are 0.055 dex heavier than\nthose estimated with a Baldry \\& Glazebrook IMF. Effective radii are\ncircularized, as in Equation~\\ref{eq:radius}, and converted into\nphysical sizes. The velocity dispersion measurements were extracted\nfrom the original studies and corrected to a common aperture of one\neffective radius, using the prescription of \\cite{Cap06}. \n\nTraditionally, red nuggets have been loosely defined as high-redshift (z$\\sim$1.5) quiescent galaxies with high masses $M_{\\star}\\sim 10^{11} {\\rm M}_\\odot$ yet small effective radii $R_{\\rm e} \\sim 1$kpc. In order to avoid any ambiguity introduced by a free interpretations of the above definition, we have imposed tight constraints on the sample selection based on the vDokkum15 compactness criterion (Equation \\ref{eq:vD15}).  \n\nTable~\\ref{tab:rednuggets} summarizes the different studies\ncontributing to our red-nugget sample. Column 3 shows the number of\nobjects in each sample, followed by the number of galaxies with measured\nvelocity dispersion, $\\sigma$, in parenthesis. The number of galaxies identified as compact (vDokkum15) are shown in the fourth column. In summary, the final sample contains 534 red nuggets (see Figure \\ref{fig:histored}), 218 of them with velocity dispersion measurements.\n\nThe less strict Barro13 compactness criterion (Equation \\ref{eq:barro13}), with its lower mass limit, would generate a larger sample of 769 red nuggets, but at the cost of contaminating the sample with star-forming galaxies. In a study of star-forming galaxy contamination of assumed quiescent galaxy samples, \\cite{Mor13} find that, for z > 0.5 and $\\log(M_\\star/{\\rm M}_\\odot) < 10.25$, up to 85\\% of the galaxies show high specific Star Formation Rates (sSFR), i.e. $\\log({\\rm sSFR}/{\\rm Gyr}^{-1}) > -2$. The precise percentage depends on the quiescence selection criterion. Conversely, for $\\log(M_\\star/{\\rm M}_\\odot) > 10.75$, the contamination decreases to 30 \\%. From \\cite{Mor13} (Figure 10 and Table 2) we can conclude that any quiescent galaxy sample with a cutoff at log($M_{\\star})\\geq$10.6 will be significantly cleaner than its analogue with log($M_{\\star})\\geq$10.0. In summary, unless stated differently (e.g. in the number density comparison, \\S\\,\\ref{sec:numberdens} ), our red nugget sample follows the vDokkum15 compactness criterion.\n\n\\begin{figure*}\n  \\includegraphics[width=\\textwidth]{plot_spheroids.eps}\n  \\caption{The place of compact cores and red nuggets in the spheroidal family map. The upper-left panel shows the general mass-size plane, including dwarf spheroidals, dwarf ellipticals (dE), normal ellipticals, globular clusters, ultra-compact dwarves (UCD), compact ellipticals (cE). In the upper-right panel, an amplification of our main contribution is shown. Median values of our elliptical galaxies match the results from Shen et al. (2003) and segregate from the compact cores and red nuggets. The red nugget sample has been divided into three redshift slices, whose mass-size relations approach compact cores as redshifts gradually decrease. The lower half of the figure shows the mass-density relation with a similar format.}\n  \\label{fig:spheroids}\n\\end{figure*}\n\n\n\n\\begin{table}\n\\caption{Data compilation for the red nugget sample. The second column\n  shows the redshift range of each contribution, with the number of\n  objects displayed in the two last columns. The third column shows the total number of objects from each contribution, followed by the number of objects with measured velocity dispersion, $\\sigma$, in parenthesis. With a similar format, the last column shows the number of objects satisfying the vDokkum15 compactness criterion.} \n\n\\label{tab:rednuggets}\n\n\\bgroup\n\\setlength\\tabcolsep{\\fill}\n\\begin{tabular}{llrr}\n\\hline\nContributions & redshift & \\multicolumn{2}{c}{Objects}\\\\\n& & Total ($\\sigma$) & Compact \\\\ \n\\hline\n\\multicolumn{4}{c}{\\protect\\cite{Dam11} Compilation}  \\\\ \n\\hline\n\\cite{Sag10} & 0.24\\ --\\ 0.96 & 154 (154) & 70 (70) \\\\\n\\cite{Scha99} & 0.29\\ --\\ 0.99  & 36 (0) & 3 (0) \\\\ \n\\cite{Tre05} & 0.18\\ --\\ 1.14 & 76 (76) & 30 (30) \\\\ \n\\cite{Ret10} & 1.09\\ --\\ 1.35 & 44 (0) & 17 (0) \\\\ \n\\cite{New10} & 1.05\\ --\\ 1.59 & 17 (17) & 7 (7) \\\\ \n\\cite{Mac07} & 1.29\\ --\\ 1.59 & 5 (0) & 3 (0) \\\\ \n\\cite{Lon07} & 1.22\\ --\\ 1.70 & 9 (0) & 9 (0) \\\\ \n\\cite{Ryan12} & 1.33\\ --\\ 1.62 & 6 (0) & 2 (0) \\\\ \n\\cite{Dam11} & 0.62\\ --\\ 1.75 & 31 (0) & 10 (0) \\\\ \n\\cite{Carr10} & 1.23\\ --\\ 1.36 & 3 (0) & 3 (0) \\\\ \n\\cite{Dam09} & 1.40\\ --\\ 1.85 & 10 (0) & 7 (0) \\\\ \n\\cite{Sar11} & 0.96\\ --\\ 1.91 & 15 (0) & 1 (0) \\\\ \n\\cite{Cas10} & 1.32\\ --\\ 1.98 & 4 (0) & 1 (0) \\\\ \n\\cite{Cim08} & 1.42\\ --\\ 1.98 & 8 (0) & 5 (0) \\\\ \n\\cite{Dad05} & 1.39\\ --\\ 2.67 & 6 (0) & 4 (0) \\\\ \n\\cite{vDo08} & 2.02\\ --\\ 2.56 & 9 (0) & 9 (0) \\\\ \n\\hline \n\\multicolumn{4}{c}{\\protect\\cite{Sande13} Compilation}  \\\\ \n\\hline\n\\cite{Sande13} & 1.46\\ --\\ 2.09 & 5 (5) & 5 (5) \\\\ \n\\cite{Bez13} & 1.24\\ --\\ 1.62 & 6 (6) & 5 (5) \\\\ \n\\cite{vDo09} & 2.19 & 1 (1) & 1 (1) \\\\ \n\\cite{Ono12} & 1.43\\ --\\ 1.83 & 18 (1) & 11 (1) \\\\ \n\\cite{Cap09} & 1.42 & 2 (2) & 0 (0) \\\\ \n\\cite{Wel08} & 0.83\\ --\\ 1.14 & 40 (40) & 14 (14) \\\\ \n\\cite{Tof12} & 1.80\\ --\\ 2.19 & 1 (1) & 1 (1) \\\\ \n\\hline \n\\multicolumn{4}{c}{Others}  \\\\ \n\\hline\n\\cite{Tru07} & 0.42\\ --\\ 1.89 & 421 (0) & 227 (0) \\\\ \n\\cite{Kro14} & 1.84\\ --\\ 2.20 & 14 (0) & 5 (0) \\\\ \n\\cite{Bell14a} & 0.90\\ --\\ 1.58 & 11 (11) & 11 (11) \\\\ \n\\cite{Bell14b} & 2.09\\ --\\ 2.43 & 5 (5) & 5 (5) \\\\ \n\\cite{Bez15} & 0.36\\ --\\ 1.03 & 103 (103) & 2 (2) \\\\ \n\\cite{Zah15} & 0.21\\ --\\ 0.75 & 150 (150) & 66 (66) \\\\ \n\\hline\n TOTAL & 0.18\\ --\\ 2.67~~ & {\\bf 1,239} (601)~~ & {\\bf 534 (218)} \\\\ \n\\hline \n\n\\end{tabular}\n\\egroup\n\\end{table}\n\n\\section{Results}\n\\label{sec:results}\n\n\\subsection{Photometric Structural Comparison}\n\\label{sec:photo}\n\nThe question we pose here is: are there red nugget-like cores at z$\\sim$0.1? \n\nA considerable number of the z$\\sim$0.1 galaxy cores in our sample are found to be structurally similar to the red nuggets. Specifically 10,566 compact cores satisfy the vDokkum15 criterion, and thus share the same mass-size region as the red nuggets, as shown in Figure~\\ref{fig:compactness}\n\nIn Figure~\\ref{fig:spheroids}, built on the spheroidal family portrait by \\citet[Figure 1]{Gra13}, we put compact cores and red nuggets in the context of the other known members of the spheroidal family, including globular clusters, ultra-compact dwarves (UCD), compact ellipticals (cE), dwarf spheroidals, dwarf ellipticals (dE) and normal ellipticals (E). The right-hand side plots of Figure~\\ref{fig:spheroids} zoom on the selected portrait regions where data from the present study are concentrated.\n\nMass-size and mass-density relations are presented in Figure~\\ref{fig:spheroids}. Stellar masses are computed either for each galaxy as a whole, in the case of ellipticals and red nuggets, or for compact cores as individual structures. The stellar mass density $\\rho_{1/2}$ has been defined within the volume containing half each object's light. We take the half-light volume radius to be $r_{1/2}\\sim 4/3\\times R_{\\rm e}$. This relation between the 2D projected effective radius $R_{\\rm e}$ and the 3D half-light radius (${\\rm r_{1/2}}$) is shown to be valid for most surface brightness profiles and a wide range of Sersic indices \\citep[]{Cio99,Wolf10}:\n\n", "itemtype": "equation", "pos": 10517, "prevtext": "\nwith a $\\log(M_\\star/{\\rm M}_\\odot)\\geq 10.6$ limit.\n\n$\\bullet$ Finally, the criterion proposed by \\cite{vdW14} (hereinafter vdWel14)\n\n", "index": 7, "text": "\\begin{equation}\n    R_{\\rm e, a}/(M_\\star/10^{11}{\\rm M}_\\odot)^{0.75} < 2.5\\,{\\rm kpc},\n\t\\label{eq:vdW14}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"R_{\\rm e,a}/(M_{\\star}/10^{11}{\\rm M}_{\\odot})^{0.75}&lt;2.5\\,{\\rm kpc},\" display=\"block\"><mrow><mrow><mrow><msub><mi>R</mi><mrow><mi mathvariant=\"normal\">e</mi><mo>,</mo><mi mathvariant=\"normal\">a</mi></mrow></msub><mo>/</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msub><mi>M</mi><mo>⋆</mo></msub><mo>/</mo><msup><mn>10</mn><mn>11</mn></msup></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">M</mi><mo>⊙</mo></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>0.75</mn></msup></mrow><mo>&lt;</mo><mrow><mpadded width=\"+1.7pt\"><mn>2.5</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\n\nFor the density computation, we assume that the mass-to-light ratio within the cores is constant with radius, therefore half of the stellar mass of the core is enclosed inside the half-light radius (${\\rm r_{1/2}}$). For reference, the Figures include the mass-size and mass-density relations form \\cite{Shen03}. Their original relation, $\\log(R_{\\rm e}/{\\rm pc}) = 0.56\\log(M_{\\star}/{\\rm M}_\\odot)-2.54$, has been converted from \\cite{Kroupa01} IMF to Chabrier IMF, by adding 0.05 to the right-hand side of the equation \\citep[Table 2]{Ber10}. As expected, there is a good match between this relation and our reference ellipticals. The slight discrepancy -- a steeper mass-size relation at higher masses and a flatter one for lower masses -- has been explained by \\cite{Mos13} in terms of biased size measurements originating from the adopted fitting law (see also Appendix~\\ref{app:bias}). Also \\cite{LaB10} reported systematically lower effective radii for luminous SDSS galaxies due to sky overestimation.\n\nMedian values and RMS dispersion (compact cores and ellipticals) have been computed for stellar mass bins with equal width of 0.2 dex, excluding bins with less than sixty objects. For the red nugget subsample, median values and dispersion were calculated in eight equal size bins. The red nugget sample has been subdivided into three redshift slices, (bin A) 0.18$< z \\leq$1; (bin B) 1 $< z \\leq$1.8 and (bin C) 1.8$< z <$2.7, the first two with comparable sizes (254 and 239) and the third one with just 41 elements.\n\nMass-size relations in the upper part of Figure~\\ref{fig:spheroids} show that, for galaxies of similar mass, compact cores and red nuggets are 2-5 times smaller than ellipticals, showing also a different slope, $\\alpha$ ($R_{\\rm e}\\propto M_\\star^{\\alpha}$). On one side, the ellipticals \\citep[also][]{Shen03} have $\\alpha$=0.56. On the other side, compact cores, bin A and bin B red nuggets have $\\alpha$=0.98, 0.96 and 0.95 respectively.\n\nNote that the values of these slopes are a consequence of the selected compactness criterion. For instance, the reported ${\\rm \\langle \\alpha \\rangle \\sim}$0.96 values are driven by our choice of the vDokkum15 compactness criterion (Equation~\\ref{eq:vD15}), where $\\alpha$=1. \n\nThe redshift evolution of the intercept in the mass-size relation, i.e. the change in average size at a given stellar mass, has been parameterised by \\cite{Tru06b} as $\\langle R_{\\rm e} \\rangle_{M_\\star} \\propto (1 + z)^{\\beta}$. Values of the order of $\\beta\\sim$ -1.5 have been reported for massive Early Type Galaxies (ETGs) in general \\citep{New12,vdW14}. In the frame of our hypothesis, where we compare red nuggets with $z\\sim0.1$ compact cores, the mass-size trends of both samples will by definition be very similar, both being subject to the same mass-size selection limits. We therefore find a much smaller effective $\\beta\\approx-0.7$. For instance, the average size of red nuggets at $\\log(M_{\\star}/{\\rm M}_\\odot$) = 11 changes from just 1 to 1.4\\,kpc from $ z \\sim1.4-0.6$, and the average size of compact cores at this mass at $z\\sim0.1$ is just 1.7\\,kpc. So the mean size of the sub-population is relatively static, but slowly approaching its selection limit (2\\,kpc at this mass; see equation \\ref{eq:vD15}). \n\n\n\nThe bottom panels in Figure~\\ref{fig:spheroids} present the mass-density relation. Again, compact cores and red nuggets, selected with the same vDokkum15 criterion,  are segregated from the reference ellipticals, showing significantly higher densities at a given mass. For instance, at $\\log(M_{\\star}/{\\rm M}_\\odot$) = 11, red nugget density $\\log(\\rho_{1/2}/{\\rm M}_\\odot {\\rm pc}^{-3})$ decreases from 0.56 to 0.16 dex (i.e. 3.6 to 1.4 ${\\rm M}_\\odot{\\rm pc}^{-3}$) from redshift bin B to A. There is an additional decrease to $\\log(\\rho_{1/2}/{\\rm M}_\\odot {\\rm pc}^{-3})\\sim -0.02$dex (i.e. to 0.95 ${\\rm M}_\\odot {\\rm pc}^{-3}$) for z$\\sim$0.1 compact cores. This last density is more than 20 times larger than the typical one for elliptical galaxies of similar mass.\n\nWe have checked the robustness of our result against two possible\nsources of bias, i.e. the presence of AGN that can mimic a compact\ncore in some galaxies, as well as the choice of a fixed Sersic index\n$n_{\\rm bulge}$=4. As shown in Appendix~\\ref{app:bias}, these do not\naffect our results.\n\nIn summary, we have shown that a significant fraction of $z\\sim$0.1 galaxies contain compact cores structurally similar to red nuggets. The actual value of the fraction depends on the compactness criterion, but we find 5 \\% of galaxies contain a core satisfying the most restrictive criterion applied here (vDokkum15). \n\n\n\\subsection{Dynamical Structural Comparison}\n\\label{sec:dyn}\n\nWhile stellar masses are dependent on assumptions about the stellar\npopulations properties (e.g. age, metallicity and IMF), the dynamical masses follow more directly from\nobservations of velocity dispersion and angular size. In this section, we\nwill repeat the mass-size and mass-density relations in terms of dynamic mass measurements, comparing compact cores to\nred nuggets and elliptical galaxies. Velocity dispersion measurements\nin cores are vulnerable to light contamination from the disk/halo\ncomponent, leading to artificially low values of $\\sigma_{\\rm core}$. Our\nstrategy to avoid core contamination uses stellar population\nmeasurements to single-out disk light entering the spectroscopic\nfiber. As shown in Appendix~\\ref{app:contamina}, we impose a cutoff at luminosity-weighted ages, ${\\rm \\langle Age\\rangle_L} \\geq 9.05$\\,Gyr, to select 2,548\nuncontaminated compact cores. An aperture correction has been applied\nto bring velocity dispersion values to a common system, using\n\\cite{Cap06} prescription to convert each velocity dispersion into its\nequivalent at an aperture of one effective radius. Though\nsuch a prescription may not be accurate for cores, having been\noriginally derived for luminous spheroids,  the aperture corrections\nturn out to be very small, less than $\\sim$ 2.2 \\% on average, implying that\nour results are not significantly affected by the method used to\nestimate the aperture corrections. As a further check, we have used an alternative  prescription by \\cite{Jor95}, giving nearly equal aperture corrected values, with an insignificant mean offset of 1 km sec$^{-1}$. \n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_sigmas.eps}\n  \\caption{Median values of velocity dispersions ($\\sigma$) for\n    dynamical mass bins. Samples are compact cores (blue solid triangles),\n    and reference elliptical galaxies (red solid dots). Due to the small sample size, the red nuggets in 1$< z \\leq$1.8 are represented as individual points (black open squares) with a linear fit shown as a dashed line.}\n  \\label{fig:veldisp}\n\\end{figure}\n\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_dens_dyn.eps}\n  \\caption{The dynamical version of the photometric mass-density\n    relation in Figure~\\ref{fig:spheroids} is shown for individual red nuggets\n    (black open squares), median values of compact cores (blue solid triangles) and reference elliptical galaxies (red solid dots). The dashed line\n    corresponds to the linear fit to the red nuggets. There is a significant  segregation of elliptical galaxies with respect to red nuggets and compact cores .}\n  \\label{fig:Mdyn}\n\\end{figure}\n\nThe first comparison involves the velocity dispersion ($\\sigma$),\nthe dynamical parameter one might presume to be less affected by the subtleties of\nphotometric B+D decomposition. However, the measured $\\sigma$ are not\nexempt from some minor photometric dependencies. Firstly, the\ndisk-contamination cutoff is based on the stellar mass ($M_{\\star}$). Secondly, the $\\sigma$ aperture correction is derived from the core angular half-light radius and, thirdly, cores are binned according to their dynamical mass, which depends on the effective radius. Dynamical masses are computed with the formula: \n\n", "itemtype": "equation", "pos": 30196, "prevtext": "\nwith a $\\log(M_\\star/{\\rm M}_\\odot)\\geq 10.7$ limit. It is worth mentioning that this criterion uses $R_{\\rm e, a}$, the half-light radius measured along the galaxy major axis, instead of the more common circularized radius, $R_{\\rm e}$. \n\nWhile we test our results on the abundances of red nuggets and compact cores using all three different sets of selection criteria (\\S\\,\\ref{sec:numberdens}), for the first part of this paper (\\S\\S\\,\\ref{sec:photo} - \\ref{sec:dyn}) we adopt the vDokkum15 definition. In fact, the definition of vdWel14 would not allow us to perform a direct comparison to other spheroidal systems (\\S\\,\\ref{sec:photo}) as it is based on major-axis effective radii. On the other hand, the lower mass cutoff of Barro13 would imply a significantly higher contamination from star-forming galaxies in our sample of red nuggets, with respect to the vDokkum15 higher mass cutoff \\citep[see][]{Mor13}.\n\n\n\n\\subsection{Low redshift samples}\n\\label{sec:lowz}\n \nThe parent sample used in our study is the \\cite{Men14} catalogue\n(hereafter Mendel14), an upgraded section of the \\cite{Sim11} catalogue\n(Simard11), which contains the B+D decomposition of more\nthan one million SDSS-DR7 galaxies. The main improvement to the original catalogue is\nthe stellar mass calculation of the bulge and\ndisk components. Stellar masses are computed through Spectral Energy Distribution (SED)-fitting to\nthe five SDSS-$ugriz$ bands, using dusty synthetic templates from\n\\cite{Con09} with a \\citet{Chab03} stellar initial mass function (IMF). The Mendel14 catalogue\nincludes 657,996 galaxies from the SDSS-DR7 \\citep{Aba09} with\nspectroscopic redshifts and successful $ugriz$ B+D decomposition available. The\noriginal 2D decomposition in Simard11 used three alternative galaxy\nfitting models: \n\\begin{enumerate}\n\\item{de Vaucouleurs bulge (fixed Sersic index $n_{\\rm\n  bulge}$ = 4) + exponential disk (Sersic index $n_{\\rm disk}$ = 1),}\n\\item{exponential disk + free-$n_{\\rm bulge}$, with $n_{\\rm bulge}$\nallowed to vary from 0.5 to 8 and} \n\\item{a single component free\n$n$-Sersic model to fit the whole galaxy ($n$-Sersic).}\n\\end{enumerate}\nIt is important to notice that Mendel14 stellar masses were computed using only two of\nthose fitting models: (ii) and (iii). The bias introduced by the use of (i)\ninstead of (ii) is discussed in Appendix~\\ref{app:bias}. \n\nTwo low-redshift subsamples are extracted from the  Mendel14 catalogue. The main one is the {\\it compact core} subsample (\\S\\,\\ref{sec:compl}), including galaxy cores that fulfill the vDokkum15 compactness criterion. The second subsample consists of bona-fide ellipticals (\\S\\,\\ref{sec:ellipt}), and serves as a reference point for the study of galaxy structural properties (\\S\\,\\ref{sec:photo}).\n\nBulge-disk decomposition is a delicate procedure demanding extra care to guarantee reliable outcomes. We have applied a rigorous screening, with eight steps, generally following the recommendations of the catalogue authors \\citep[e.g.][]{Men14,Berg14,Bluck14}.\n\n\n\\subsubsection{Compact core Subsample Selection}\n\\label{sec:compl}\n\nWe select compact cores from the Mendel14 catalogue based on different criteria. This is summarized in Table~\\ref{tab:subs}, where we also report the number of objects surviving each selection step.\n\nFirst, we adopt a surface brightness limit of $\\mu_{50,r} \\le 23.0$ mag arcsec$^{-2}$ to assure a complete sample. Although the formal surface brightness limit of the SDSS spectroscopic sample is $\\mu_{50,r} = 24.5$ mag arcsec$^{-2}$ \\citep{Stra02}, the sample in the range $\\mu_{50,r}$ 23.0 - 24.5 \nmag arcsec$^{-2}$ is not complete because galaxies were targeted only under some particular local sky conditions. Second, we exclude objects with uncertain decomposition, using the parameter {\\it dBD}, which is the offset between two alternative galaxy mass calculations, $M_B$ + $M_D$\n(sum of independently derived bulge and disk masses) and $M_{B+D}$\n(mass derived from the total bulge+disk photometry) in units of the\nstandard error. Significant inequality between these two masses is an indication of inconsistent decomposition, so systems with the cutoff $dBD > 1\\sigma$, proposed by Mendel14, are excluded. These two cuts removed 9.5 \\% of the objects, as seen in Table~\\ref{tab:subs}\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_2Dhisto.eps}\n  \\caption{Bidimensional histogram showing the mass-size\n    distribution for all the decomposed cores in our sample galaxies\n    (203,369 objects, see Table~\\ref{tab:subs}). Three compactness criteria, Barro13, vDokkum15 and vdWel14 (described in the text), are overplotted and compact\n    cores are located below the dashed lines, rendering 65,637\n    systems under the Barro13 criterion. The more restrictive vDokkum15 and vdWel14 criteria render 10,566 and 12,721 respectively. Note that the vdWel14 line is only approximate, because the criterion requires major-axis sizes instead of the circularized radii used in the plot. The isolated white dot marks the approximate location of the Milky Way's bulge (e.g. Di Matteo et al. 2015; Licquia \\& Newman, 2015).}\n  \\label{fig:compactness}\n\\end{figure}\n\nThe third cutoff, limiting the redshift range, is set to achieve a\nsignificant sample completeness in terms of the core stellar mass, $M_{\\star,{\\rm core}}$, the main reference parameter of this\nstudy. The choice of redshift range, $0.025 \\leq z \\leq 0.15$, yields a significant completeness in our target mass range,\n$\\log(M_{\\star,{\\rm core}}/{\\rm M}_\\odot)\\geq 10.0$, as discussed in Appendix~\\ref{app:compl}. Notice that in the number density\nestimations (\\S\\,\\ref{sec:numberdens}), the V/Vmax statistic is\nalso used to correct for any residual incompleteness.\n\nIn the fourth step, we exclude galaxies reported to show anomalous B+D\ndecomposition, tagged `Type-4' in the Mendel14 classification. They comprise\ngalaxy/star superposition and inverted B+D profiles, in which a disk\ndominates at the center and a bulge at the external parts. Following\n\\cite{Berg14}, fifth and sixth cutoffs were applied to promote\nface-on inclinations and to avoid strong bars. Face-on galaxies (disk\ninclination $\\leq$ 60 degrees) are favoured in order to minimize\ninternal disk extinction on the bulge light, while high bulge\nellipticities are avoided to prevent strong bars being mistaken for\nbulges (e$_{\\rm core} <$ 0.6).\n\nFinally, the potential impact of poorly resolved galaxy images on the\nB+D decomposition is considered. We follow the study by \\cite{Gad08},\nwhich showed that the structural properties of cores can be reliably\nretrieved provided that their effective radii are larger than $\\sim$\n80 per cent of the PSF half-width-at-half-maximum (HWHM), i.e. \n($R_{\\rm e,core}$/PSF) $\\geq$ 0.8. So far, by imposing these seven selection criteria, the parent sample has been reduced to 203,369 objects (31\\% of the original sample; see Tab.~\\ref{tab:subs}). The last selection is on the cores that fulfill the vDokkum15 compactness criterion (equation \\ref{eq:vD15}). Additionally, Table \\ref{tab:subs} shows the corresponding results for the other criteria (Equations \\ref{eq:barro13} and \\ref{eq:vdW14}). Figure \\ref{fig:compactness} provides a visual display of the compact core selection criteria for both Barro13 and vDokkum15 on top of a 2D histogram including the 203,369 objects, which got through the first seven screening steps.  \n\nThe {\\it compact core} definition is essential to the present\nstudy and deserves further clarification. The B+D decomposition\nis straightforward for disk galaxies, where a compact core is\nsimply a bulge that has satisfied the compactness criterion. A\ndecomposed elliptical galaxy should not be interpreted literally as\nhaving physically meaningful bulge and a disk. In addition to the\ncentral {\\it core}, the external component can be a disk, a halo or\nany significant departure from a single fit. Distinct inner components\nhave been extensively observed in ellipticals\n\\citep[e.g.][]{Cote06,Lau07}. More recently, \\cite{Huang13} have shown\nthat more than 75 \\% of their sample of 94 nearby elliptical galaxies\nwere better described when additional subcomponents were added to the\nconventional single Sersic function.\n\n\\begin{table}\n\\caption{Subsample selection, listing the steps leading from the parent sample (Mendel14) to our {\\it compact core} subsample. Steps are described in the main text.}\n\\label{tab:subs}\n\\centering\n\\begin{tabular}{ | l  | r | }\n\\hline\nFilters & Objects \\\\\n\\hline \nParent sample (Mendel14) & 657,996\\\\ \nSurface Brightness & 655,530 \\\\ \nUncertain Decomposition & 595,402 \\\\ \n0.025 $\\leq$ z $\\leq$ 0.15 & 456,169 \\\\ \nType $\\neq$ 4 & 437,089 \\\\ \n${\\rm Disk(i)\\leq60^o}$ & 291,192 \\\\ \n${\\rm e_{\\rm core} < 0.6}$ & 249,990 \\\\ \n(R$_{\\rm core}$/PSF) $\\geq$ 0.8 & 203,369 \\\\\n{\\bf Compact cores (vDokkum15)} & {\\bf 10,566} \\\\\n\\hline\nCompact cores (Barro13) & 65,637 \\\\\nCompact cores (vdWel14) & 12,721 \\\\\n\\hline\n\\end{tabular}\n\\end{table}\n\n\nWe notice that some of the selection steps in Table~\\ref{tab:subs} might bias our compact core abundance estimates. For instance, while the use of a given redshift range is not expected to impact our results, selections based on core elongation and SDSS-image resolution might exclude some genuine compact cores from the number density estimates. Therefore, one should regard abundance estimates based on the compact core sample in Table~\\ref{tab:subs} as lower limits. In \\S~\\ref{sec:numberdens}, we discuss how removing some selection steps listed in Table~\\ref{tab:subs} can be used to obtain upper limits on the number densities.\n\n\n\\subsubsection{The Reference Elliptical Galaxies}\n\\label{sec:ellipt}\n\nThroughout this study, the cores resulting from galaxy decomposition are treated as if they were independent spheroids detached from their surrounding halos or disks. We compare the properties of these compact cores with a reference sample of bona-fide ellipticals.\n\nBona-fide ellipticals are selected from the subsample of 456,169 galaxies obtained after applying the first three selections listed in Table~\\ref{tab:subs} to the Mendel14 catalogue. {\\it Reference elliptical galaxies} have been selected according to their morphology and the type of fitted surface-brightness profiles. We require the galaxy morphology to be {\\it Elliptical} according to the definitions given in \\S~\\ref{sec:numberdens} and Tab.~\\ref{tab:morphoType}. Additionally, ellipticals must belong to the {\\it Type 1}, one of the four classes devised by \\cite{Men14} to divide galaxies according to their profile. {\\it Type 1} are single-component galaxies, in which the bulge component dominates the surface-brightness profile at all radii (i.e. B/T$\\sim$1). The resulting sample contains 18,916 elliptical galaxies. Size and mass parameters for these reference ellipticals are taken from the whole galaxy fit, using single component, free $n$-Sersic models. Note that a small fraction of ellipticals ($\\sim$4.5 \\%) are found to host a compact core. However, this does not affect our conclusions, our main aim being to compare the properties of ellipticals as a whole with those of compact cores, seen as separate structures, and red nuggets.\n\n\n\\subsection{The red nugget sample}\n\\label{sec:redsample}\n \n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_histo_redn.eps}\n  \\caption{Histogram of the 534 red nuggets that fulfil the vDokkum15 compactness criterion, separated into three redshift bins and shown as a function of their stellar mass.}\n  \\label{fig:histored}\n\\end{figure}\n\n\nOur sample includes observed red nuggets from 29 works in the\nliterature, 24 of which were part of two major\ncompilations by \\cite{Dam11} and \\cite{Sande13}, who renormalized them\nto a common observational frame. \\cite{Dam11} contributed 433 galaxies with spectroscopic redshifts spanning a range 0.18 $\\lesssim$ z $\\lesssim$ 2.67. Their compiled stellar masses were re-scaled to a\n\\citet{BGIMF} IMF. However, the stellar masses of our study\nwere derived by Mendel14 using M/L ratios for a Chabrier IMF. In order\nto carry out a consistent comparison, we have converted \\cite{Dam11}\nstellar mass values into the Chabrier IMF counterparts. The M/L\nconversion follows the prescriptions presented by \\citet[Table\n  2]{Ber10}, where masses with Chabrier IMF are 0.055 dex heavier than\nthose estimated with a Baldry \\& Glazebrook IMF. Effective radii are\ncircularized, as in Equation~\\ref{eq:radius}, and converted into\nphysical sizes. The velocity dispersion measurements were extracted\nfrom the original studies and corrected to a common aperture of one\neffective radius, using the prescription of \\cite{Cap06}. \n\nTraditionally, red nuggets have been loosely defined as high-redshift (z$\\sim$1.5) quiescent galaxies with high masses $M_{\\star}\\sim 10^{11} {\\rm M}_\\odot$ yet small effective radii $R_{\\rm e} \\sim 1$kpc. In order to avoid any ambiguity introduced by a free interpretations of the above definition, we have imposed tight constraints on the sample selection based on the vDokkum15 compactness criterion (Equation \\ref{eq:vD15}).  \n\nTable~\\ref{tab:rednuggets} summarizes the different studies\ncontributing to our red-nugget sample. Column 3 shows the number of\nobjects in each sample, followed by the number of galaxies with measured\nvelocity dispersion, $\\sigma$, in parenthesis. The number of galaxies identified as compact (vDokkum15) are shown in the fourth column. In summary, the final sample contains 534 red nuggets (see Figure \\ref{fig:histored}), 218 of them with velocity dispersion measurements.\n\nThe less strict Barro13 compactness criterion (Equation \\ref{eq:barro13}), with its lower mass limit, would generate a larger sample of 769 red nuggets, but at the cost of contaminating the sample with star-forming galaxies. In a study of star-forming galaxy contamination of assumed quiescent galaxy samples, \\cite{Mor13} find that, for z > 0.5 and $\\log(M_\\star/{\\rm M}_\\odot) < 10.25$, up to 85\\% of the galaxies show high specific Star Formation Rates (sSFR), i.e. $\\log({\\rm sSFR}/{\\rm Gyr}^{-1}) > -2$. The precise percentage depends on the quiescence selection criterion. Conversely, for $\\log(M_\\star/{\\rm M}_\\odot) > 10.75$, the contamination decreases to 30 \\%. From \\cite{Mor13} (Figure 10 and Table 2) we can conclude that any quiescent galaxy sample with a cutoff at log($M_{\\star})\\geq$10.6 will be significantly cleaner than its analogue with log($M_{\\star})\\geq$10.0. In summary, unless stated differently (e.g. in the number density comparison, \\S\\,\\ref{sec:numberdens} ), our red nugget sample follows the vDokkum15 compactness criterion.\n\n\\begin{figure*}\n  \\includegraphics[width=\\textwidth]{plot_spheroids.eps}\n  \\caption{The place of compact cores and red nuggets in the spheroidal family map. The upper-left panel shows the general mass-size plane, including dwarf spheroidals, dwarf ellipticals (dE), normal ellipticals, globular clusters, ultra-compact dwarves (UCD), compact ellipticals (cE). In the upper-right panel, an amplification of our main contribution is shown. Median values of our elliptical galaxies match the results from Shen et al. (2003) and segregate from the compact cores and red nuggets. The red nugget sample has been divided into three redshift slices, whose mass-size relations approach compact cores as redshifts gradually decrease. The lower half of the figure shows the mass-density relation with a similar format.}\n  \\label{fig:spheroids}\n\\end{figure*}\n\n\n\n\\begin{table}\n\\caption{Data compilation for the red nugget sample. The second column\n  shows the redshift range of each contribution, with the number of\n  objects displayed in the two last columns. The third column shows the total number of objects from each contribution, followed by the number of objects with measured velocity dispersion, $\\sigma$, in parenthesis. With a similar format, the last column shows the number of objects satisfying the vDokkum15 compactness criterion.} \n\n\\label{tab:rednuggets}\n\n\\bgroup\n\\setlength\\tabcolsep{\\fill}\n\\begin{tabular}{llrr}\n\\hline\nContributions & redshift & \\multicolumn{2}{c}{Objects}\\\\\n& & Total ($\\sigma$) & Compact \\\\ \n\\hline\n\\multicolumn{4}{c}{\\protect\\cite{Dam11} Compilation}  \\\\ \n\\hline\n\\cite{Sag10} & 0.24\\ --\\ 0.96 & 154 (154) & 70 (70) \\\\\n\\cite{Scha99} & 0.29\\ --\\ 0.99  & 36 (0) & 3 (0) \\\\ \n\\cite{Tre05} & 0.18\\ --\\ 1.14 & 76 (76) & 30 (30) \\\\ \n\\cite{Ret10} & 1.09\\ --\\ 1.35 & 44 (0) & 17 (0) \\\\ \n\\cite{New10} & 1.05\\ --\\ 1.59 & 17 (17) & 7 (7) \\\\ \n\\cite{Mac07} & 1.29\\ --\\ 1.59 & 5 (0) & 3 (0) \\\\ \n\\cite{Lon07} & 1.22\\ --\\ 1.70 & 9 (0) & 9 (0) \\\\ \n\\cite{Ryan12} & 1.33\\ --\\ 1.62 & 6 (0) & 2 (0) \\\\ \n\\cite{Dam11} & 0.62\\ --\\ 1.75 & 31 (0) & 10 (0) \\\\ \n\\cite{Carr10} & 1.23\\ --\\ 1.36 & 3 (0) & 3 (0) \\\\ \n\\cite{Dam09} & 1.40\\ --\\ 1.85 & 10 (0) & 7 (0) \\\\ \n\\cite{Sar11} & 0.96\\ --\\ 1.91 & 15 (0) & 1 (0) \\\\ \n\\cite{Cas10} & 1.32\\ --\\ 1.98 & 4 (0) & 1 (0) \\\\ \n\\cite{Cim08} & 1.42\\ --\\ 1.98 & 8 (0) & 5 (0) \\\\ \n\\cite{Dad05} & 1.39\\ --\\ 2.67 & 6 (0) & 4 (0) \\\\ \n\\cite{vDo08} & 2.02\\ --\\ 2.56 & 9 (0) & 9 (0) \\\\ \n\\hline \n\\multicolumn{4}{c}{\\protect\\cite{Sande13} Compilation}  \\\\ \n\\hline\n\\cite{Sande13} & 1.46\\ --\\ 2.09 & 5 (5) & 5 (5) \\\\ \n\\cite{Bez13} & 1.24\\ --\\ 1.62 & 6 (6) & 5 (5) \\\\ \n\\cite{vDo09} & 2.19 & 1 (1) & 1 (1) \\\\ \n\\cite{Ono12} & 1.43\\ --\\ 1.83 & 18 (1) & 11 (1) \\\\ \n\\cite{Cap09} & 1.42 & 2 (2) & 0 (0) \\\\ \n\\cite{Wel08} & 0.83\\ --\\ 1.14 & 40 (40) & 14 (14) \\\\ \n\\cite{Tof12} & 1.80\\ --\\ 2.19 & 1 (1) & 1 (1) \\\\ \n\\hline \n\\multicolumn{4}{c}{Others}  \\\\ \n\\hline\n\\cite{Tru07} & 0.42\\ --\\ 1.89 & 421 (0) & 227 (0) \\\\ \n\\cite{Kro14} & 1.84\\ --\\ 2.20 & 14 (0) & 5 (0) \\\\ \n\\cite{Bell14a} & 0.90\\ --\\ 1.58 & 11 (11) & 11 (11) \\\\ \n\\cite{Bell14b} & 2.09\\ --\\ 2.43 & 5 (5) & 5 (5) \\\\ \n\\cite{Bez15} & 0.36\\ --\\ 1.03 & 103 (103) & 2 (2) \\\\ \n\\cite{Zah15} & 0.21\\ --\\ 0.75 & 150 (150) & 66 (66) \\\\ \n\\hline\n TOTAL & 0.18\\ --\\ 2.67~~ & {\\bf 1,239} (601)~~ & {\\bf 534 (218)} \\\\ \n\\hline \n\n\\end{tabular}\n\\egroup\n\\end{table}\n\n\\section{Results}\n\\label{sec:results}\n\n\\subsection{Photometric Structural Comparison}\n\\label{sec:photo}\n\nThe question we pose here is: are there red nugget-like cores at z$\\sim$0.1? \n\nA considerable number of the z$\\sim$0.1 galaxy cores in our sample are found to be structurally similar to the red nuggets. Specifically 10,566 compact cores satisfy the vDokkum15 criterion, and thus share the same mass-size region as the red nuggets, as shown in Figure~\\ref{fig:compactness}\n\nIn Figure~\\ref{fig:spheroids}, built on the spheroidal family portrait by \\citet[Figure 1]{Gra13}, we put compact cores and red nuggets in the context of the other known members of the spheroidal family, including globular clusters, ultra-compact dwarves (UCD), compact ellipticals (cE), dwarf spheroidals, dwarf ellipticals (dE) and normal ellipticals (E). The right-hand side plots of Figure~\\ref{fig:spheroids} zoom on the selected portrait regions where data from the present study are concentrated.\n\nMass-size and mass-density relations are presented in Figure~\\ref{fig:spheroids}. Stellar masses are computed either for each galaxy as a whole, in the case of ellipticals and red nuggets, or for compact cores as individual structures. The stellar mass density $\\rho_{1/2}$ has been defined within the volume containing half each object's light. We take the half-light volume radius to be $r_{1/2}\\sim 4/3\\times R_{\\rm e}$. This relation between the 2D projected effective radius $R_{\\rm e}$ and the 3D half-light radius (${\\rm r_{1/2}}$) is shown to be valid for most surface brightness profiles and a wide range of Sersic indices \\citep[]{Cio99,Wolf10}:\n\n", "index": 9, "text": "\\begin{equation}\n\\rho_{1/2}\\equiv \\frac{3 M_\\star}{8\\pi r_{1/2}^3} \\approx \\frac{0.05 M_\\star}{R_{\\rm e}^3}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\rho_{1/2}\\equiv\\frac{3M_{\\star}}{8\\pi r_{1/2}^{3}}\\approx\\frac{0.05M_{\\star}}%&#10;{R_{\\rm e}^{3}}\" display=\"block\"><mrow><msub><mi>ρ</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow></msub><mo>≡</mo><mfrac><mrow><mn>3</mn><mo>⁢</mo><msub><mi>M</mi><mo>⋆</mo></msub></mrow><mrow><mn>8</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msubsup><mi>r</mi><mrow><mn>1</mn><mo>/</mo><mn>2</mn></mrow><mn>3</mn></msubsup></mrow></mfrac><mo>≈</mo><mfrac><mrow><mn>0.05</mn><mo>⁢</mo><msub><mi>M</mi><mo>⋆</mo></msub></mrow><msubsup><mi>R</mi><mi mathvariant=\"normal\">e</mi><mn>3</mn></msubsup></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\nwith a fixed virial constant $K=5$ deduced by \\cite{Cap06} for the ETGs.  \n\nIn Figure~\\ref{fig:veldisp}, we show the $\\sigma$ comparison between three different samples. First, 2,548 compact cores selected according to the vDokkum15 compactness criterion and filtered for disk light contamination, as explained in Appendix~\\ref{app:contamina}. Second, the reference elliptical galaxies defined in \\S\\,\\ref{sec:ellipt} also filtered  for light contamination from young stellar populations (8,090 objects) and third, the 28 red nuggets in the redshift slice 1$< z \\leq$1.8, with available $\\sigma$ observation and $M_{\\rm dyn} > M_\\star$. From Figure~\\ref{fig:veldisp} we can deduce that compact cores and red nuggets are clearly segregated from normal ellipticals. \n\nThe mass-density relation is presented in Figure~\\ref{fig:Mdyn} with\nmedian values of compact cores (blue solid triangles) and elliptical galaxies (red solid dots). Again, the small red nugget sample (28) is represented by individual black squares and a corresponding linear fit dashed line. Once again, the relative match between the  compact cores and red nuggets should not come as a surprise, but as a natural consequence of sharing the same compactness criterion. In fact \\cite{vD15} show that their compactness criterion corresponds to log$({\\rm \\sigma_{predicted}/km\\  s^{-1}})>$ 2.40. \n\n\n\\subsection{Number Densities}\n\\label{sec:numberdens}\n\nIn this section we compare the abundance of red nuggets at $z\n\\sim 1.5$ with that of $z\\sim 0.1$ compact cores. In \\S\\,\\ref{sec:compl}, we have emphasised the sensitivity of the number density to the choice of\na compactness criterion and the probed mass range, consequently, any number density comparison must be carried out based on given compactness and mass-selection criteria.  We carry out a detailed comparison, by taking advantage of the three available studies on the evolution with redshift of the red nugget abundance \\citep[]{Barro13,vdW14,vD15}. \n\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_massfunction.eps}\n  \\caption{Compact core Mass Function for the three alternative Barro13, vdWel14 and vDokkum15 compactness criteria. Each function spans the range between the upper and lower sample limits, as defined in the text. The lower mass cuts are tied to each compactness criteria definition.}\n  \\label{fig:MF}\n\\end{figure}\n\n\n\\begin{table*}\n  \\caption{Upper and lower number density limits (column 3) for galaxy cores with different compactness criteria and mass ranges. Maximum number densities for red nuggets (column 4) have been extracted from the literature.}\n\\label{tab:numberdens}\n\\centering\n\\begin{tabular}{ | l | c | c | c }\n\\hline\n\\multicolumn{2}{c}{Compactness criteria} & \\multicolumn{2}{c}{Number density}\\\\\nReference & Mass range & Compact cores & Red nuggets \\\\\n &  & low-up limits & maximum \\\\ \\hline\n & $\\log(M_{\\star,{\\rm core}}/{\\rm M}_\\odot$) & [10$^{-4}\\ {\\rm Mpc}^{-3}$] & [10$^{-4}\\ {\\rm Mpc}^{-3}$]\\\\ \\hline\nBarro13 & $\\geq$ 10.00 & 1.73 - 3.12 & 2.4 $\\pm$ 1.0 \\\\ \nvdWel14 & $\\geq$ 10.70 & 0.40 -  0.78 & 1.7 $\\pm$ 0.2  \\\\ \nvDokkum15 & $\\geq$ 10.60 & 0.28 - 0.72 & 1.4 $\\pm$ 0.1 \\\\ \\hline\n\\end{tabular}\n\\end{table*}\n\nWe make use of the three compact core samples defined in \\S\\,\\ref{sec:compl} and Table~\\ref{tab:subs} in the 8,032\\,deg$^2$ area coverage of the SDSS-DR7 Legacy Survey \\citep{Aba09}. Compact core Mass Functions (MF) have been computed for each compactness criteria and shown in Figure~\\ref{fig:MF}. As stated in Appendix~\\ref{app:compl}, V/Vmax volume corrections are applied to account for any residual incompleteness in our samples. Our Vmax calculation follows similar procedures as in \\citet{Sim11,Shen03} and Mass Functions are calculated for the redshift range $0.025 \\leq z \\leq 0.15$. Differences among the three MFs can be understood based on the compactness criteria illustrated in Figure~\\ref{fig:compactness}, where one can see, for instance, that the vDokkum15 criteria are more restrictive, at all but at high-masses, than those of Barro13 and vdWel14. As mentioned in \\S\\,\\ref{sec:compl}, the selections in Table~\\ref{tab:subs} provide lower limits for the number density. We have worked out corresponding upper limits by reinstating some systems that were excluded when creating the pure sample (due to disk inclination, core elongation, image resolution or Type-4 anomalous decomposition). For instance, filtering by core elongation will exclude genuine compact cores coexisting with bars. The final number of compact cores in the upper limit samples is: 153,038 for Barro13, 25,426 for vdWel14 and 21,830 for vDokkum15 criteria. Figure~\\ref{fig:MF} displays the three Mass Functions represented as a band enclosed between the upper and lower limit MFs (black connected dots). \n\nThe lower and upper number density limits can be compared with those for red nuggets, at different redshifts. Solid dots with error bars in Figure~\\ref{fig:numberdensity} are extracted form the published plots in \\citet[Figure 5]{Barro13}, \\citet[Figure 13]{vdW14} and \\citet[Figure 19]{vD15}. Dark shaded horizontal bands in Figure~\\ref{fig:numberdensity} correspond to the upper and lower limit compact core number density at z$\\sim$0.1, stretched along the width of the plot to aid the comparison with the red nuggets. These values correspond to the integral of the upper and lower limits of the mass functions in Figure~\\ref{fig:MF}. Results are also reported in Table~\\ref{tab:numberdens}. \n\nFigure~\\ref{fig:numberdensity} also plots the number density of the bona-fide ellipticals at z$\\sim$0.1 that satisfy, as a whole, the compactness criteria (see dash-shaded region), as well as the number density of $z \\sim 0.1$ compact cores residing only in ellipticals (with respect to other galaxy types). The density of compact ellipticals is further discussed in \\S\\,\\ref{sec:discussion}. The low abundance of ellipticals hosting a compact core, with respect to the number density of red nuggets, would refute any proposal that the centre of present-day ellipticals may be the {\\bf only} evolutionary path for red nuggets.\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\textwidth]{plot_number_density.eps}\n  \\caption{Evolution with redshift of the number density of massive quiescent compact galaxies for the three alternative compactness criteria. The solid dots with error bars are extracted from : Figure 5 of Barro et al. (2013); Figure 13 of van der Wel et al. (2014) and Figure 19 of van Dokkum et al. (2015). Our compact core number density results are represented by a shaded dark grey band confined between the upper and lower limits discussed in the text. Although our result corresponds to redshift $\\sim$ 0.1, the band is stretched along the full redshift range to aid the comparison with the high redshift data. The Figure also plots the number density of elliptical galaxies hosting a compact core, shown as a small shaded rectangle at redshift $\\sim$ 0.1. Secondly, the number density of entire galaxies, at z $\\sim$ 0.1, satisfying the compactness criterion, is shown as a dashed shaded band}\n  \\label{fig:numberdensity}\n\\end{figure*}    \n\n\nFrom Figure~\\ref{fig:numberdensity} we can conclude that the $z\\sim 0.1$ compact core number density is comparable to that of red nuggets. In agreement with our results, recent cosmological hydrodynamical simulations on the evolution of red nuggets \\citep[]{Wellons15,Furlong15} conclude that only a fraction of them have survived by $z \\sim 0$. For instance, \\cite{Wellons15} find that: ``about half acquire an ex-situ envelope and exist as the core of a more massive descendant, 30\\% survive undisturbed and gain very little mass...''\n\n\n\\subsection{Morphology}\n\\label{sec:morpho}\n\nThe morphological class of the galaxies\nhosting compact cores contains information relevant to our study. The \\cite{HC11} catalogue provides the\nautomated morphological classification of the SDSS DR7 spectroscopic\nsample, giving the probability P(E), P(S0), P(Sab) and P(Scd) of each\ngalaxy type. These probabilities can be converted into the T-type\nclassification scheme of \\cite{NaAb10} with the simple linear model\ncomputed by \\cite{Meert15},\n\n", "itemtype": "equation", "pos": 38289, "prevtext": "\n\nFor the density computation, we assume that the mass-to-light ratio within the cores is constant with radius, therefore half of the stellar mass of the core is enclosed inside the half-light radius (${\\rm r_{1/2}}$). For reference, the Figures include the mass-size and mass-density relations form \\cite{Shen03}. Their original relation, $\\log(R_{\\rm e}/{\\rm pc}) = 0.56\\log(M_{\\star}/{\\rm M}_\\odot)-2.54$, has been converted from \\cite{Kroupa01} IMF to Chabrier IMF, by adding 0.05 to the right-hand side of the equation \\citep[Table 2]{Ber10}. As expected, there is a good match between this relation and our reference ellipticals. The slight discrepancy -- a steeper mass-size relation at higher masses and a flatter one for lower masses -- has been explained by \\cite{Mos13} in terms of biased size measurements originating from the adopted fitting law (see also Appendix~\\ref{app:bias}). Also \\cite{LaB10} reported systematically lower effective radii for luminous SDSS galaxies due to sky overestimation.\n\nMedian values and RMS dispersion (compact cores and ellipticals) have been computed for stellar mass bins with equal width of 0.2 dex, excluding bins with less than sixty objects. For the red nugget subsample, median values and dispersion were calculated in eight equal size bins. The red nugget sample has been subdivided into three redshift slices, (bin A) 0.18$< z \\leq$1; (bin B) 1 $< z \\leq$1.8 and (bin C) 1.8$< z <$2.7, the first two with comparable sizes (254 and 239) and the third one with just 41 elements.\n\nMass-size relations in the upper part of Figure~\\ref{fig:spheroids} show that, for galaxies of similar mass, compact cores and red nuggets are 2-5 times smaller than ellipticals, showing also a different slope, $\\alpha$ ($R_{\\rm e}\\propto M_\\star^{\\alpha}$). On one side, the ellipticals \\citep[also][]{Shen03} have $\\alpha$=0.56. On the other side, compact cores, bin A and bin B red nuggets have $\\alpha$=0.98, 0.96 and 0.95 respectively.\n\nNote that the values of these slopes are a consequence of the selected compactness criterion. For instance, the reported ${\\rm \\langle \\alpha \\rangle \\sim}$0.96 values are driven by our choice of the vDokkum15 compactness criterion (Equation~\\ref{eq:vD15}), where $\\alpha$=1. \n\nThe redshift evolution of the intercept in the mass-size relation, i.e. the change in average size at a given stellar mass, has been parameterised by \\cite{Tru06b} as $\\langle R_{\\rm e} \\rangle_{M_\\star} \\propto (1 + z)^{\\beta}$. Values of the order of $\\beta\\sim$ -1.5 have been reported for massive Early Type Galaxies (ETGs) in general \\citep{New12,vdW14}. In the frame of our hypothesis, where we compare red nuggets with $z\\sim0.1$ compact cores, the mass-size trends of both samples will by definition be very similar, both being subject to the same mass-size selection limits. We therefore find a much smaller effective $\\beta\\approx-0.7$. For instance, the average size of red nuggets at $\\log(M_{\\star}/{\\rm M}_\\odot$) = 11 changes from just 1 to 1.4\\,kpc from $ z \\sim1.4-0.6$, and the average size of compact cores at this mass at $z\\sim0.1$ is just 1.7\\,kpc. So the mean size of the sub-population is relatively static, but slowly approaching its selection limit (2\\,kpc at this mass; see equation \\ref{eq:vD15}). \n\n\n\nThe bottom panels in Figure~\\ref{fig:spheroids} present the mass-density relation. Again, compact cores and red nuggets, selected with the same vDokkum15 criterion,  are segregated from the reference ellipticals, showing significantly higher densities at a given mass. For instance, at $\\log(M_{\\star}/{\\rm M}_\\odot$) = 11, red nugget density $\\log(\\rho_{1/2}/{\\rm M}_\\odot {\\rm pc}^{-3})$ decreases from 0.56 to 0.16 dex (i.e. 3.6 to 1.4 ${\\rm M}_\\odot{\\rm pc}^{-3}$) from redshift bin B to A. There is an additional decrease to $\\log(\\rho_{1/2}/{\\rm M}_\\odot {\\rm pc}^{-3})\\sim -0.02$dex (i.e. to 0.95 ${\\rm M}_\\odot {\\rm pc}^{-3}$) for z$\\sim$0.1 compact cores. This last density is more than 20 times larger than the typical one for elliptical galaxies of similar mass.\n\nWe have checked the robustness of our result against two possible\nsources of bias, i.e. the presence of AGN that can mimic a compact\ncore in some galaxies, as well as the choice of a fixed Sersic index\n$n_{\\rm bulge}$=4. As shown in Appendix~\\ref{app:bias}, these do not\naffect our results.\n\nIn summary, we have shown that a significant fraction of $z\\sim$0.1 galaxies contain compact cores structurally similar to red nuggets. The actual value of the fraction depends on the compactness criterion, but we find 5 \\% of galaxies contain a core satisfying the most restrictive criterion applied here (vDokkum15). \n\n\n\\subsection{Dynamical Structural Comparison}\n\\label{sec:dyn}\n\nWhile stellar masses are dependent on assumptions about the stellar\npopulations properties (e.g. age, metallicity and IMF), the dynamical masses follow more directly from\nobservations of velocity dispersion and angular size. In this section, we\nwill repeat the mass-size and mass-density relations in terms of dynamic mass measurements, comparing compact cores to\nred nuggets and elliptical galaxies. Velocity dispersion measurements\nin cores are vulnerable to light contamination from the disk/halo\ncomponent, leading to artificially low values of $\\sigma_{\\rm core}$. Our\nstrategy to avoid core contamination uses stellar population\nmeasurements to single-out disk light entering the spectroscopic\nfiber. As shown in Appendix~\\ref{app:contamina}, we impose a cutoff at luminosity-weighted ages, ${\\rm \\langle Age\\rangle_L} \\geq 9.05$\\,Gyr, to select 2,548\nuncontaminated compact cores. An aperture correction has been applied\nto bring velocity dispersion values to a common system, using\n\\cite{Cap06} prescription to convert each velocity dispersion into its\nequivalent at an aperture of one effective radius. Though\nsuch a prescription may not be accurate for cores, having been\noriginally derived for luminous spheroids,  the aperture corrections\nturn out to be very small, less than $\\sim$ 2.2 \\% on average, implying that\nour results are not significantly affected by the method used to\nestimate the aperture corrections. As a further check, we have used an alternative  prescription by \\cite{Jor95}, giving nearly equal aperture corrected values, with an insignificant mean offset of 1 km sec$^{-1}$. \n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_sigmas.eps}\n  \\caption{Median values of velocity dispersions ($\\sigma$) for\n    dynamical mass bins. Samples are compact cores (blue solid triangles),\n    and reference elliptical galaxies (red solid dots). Due to the small sample size, the red nuggets in 1$< z \\leq$1.8 are represented as individual points (black open squares) with a linear fit shown as a dashed line.}\n  \\label{fig:veldisp}\n\\end{figure}\n\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_dens_dyn.eps}\n  \\caption{The dynamical version of the photometric mass-density\n    relation in Figure~\\ref{fig:spheroids} is shown for individual red nuggets\n    (black open squares), median values of compact cores (blue solid triangles) and reference elliptical galaxies (red solid dots). The dashed line\n    corresponds to the linear fit to the red nuggets. There is a significant  segregation of elliptical galaxies with respect to red nuggets and compact cores .}\n  \\label{fig:Mdyn}\n\\end{figure}\n\nThe first comparison involves the velocity dispersion ($\\sigma$),\nthe dynamical parameter one might presume to be less affected by the subtleties of\nphotometric B+D decomposition. However, the measured $\\sigma$ are not\nexempt from some minor photometric dependencies. Firstly, the\ndisk-contamination cutoff is based on the stellar mass ($M_{\\star}$). Secondly, the $\\sigma$ aperture correction is derived from the core angular half-light radius and, thirdly, cores are binned according to their dynamical mass, which depends on the effective radius. Dynamical masses are computed with the formula: \n\n", "index": 11, "text": "\\begin{equation}\nM_{\\rm dyn} = K \\frac{\\sigma^2_{\\rm e} R_{\\rm e}}{{\\rm G}}\\label{eq:mdyn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"M_{\\rm dyn}=K\\frac{\\sigma^{2}_{\\rm e}R_{\\rm e}}{{\\rm G}}\" display=\"block\"><mrow><msub><mi>M</mi><mi>dyn</mi></msub><mo>=</mo><mrow><mi>K</mi><mo>⁢</mo><mfrac><mrow><msubsup><mi>σ</mi><mi mathvariant=\"normal\">e</mi><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>R</mi><mi mathvariant=\"normal\">e</mi></msub></mrow><mi mathvariant=\"normal\">G</mi></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.03920.tex", "nexttext": "\nWe also follow \\citet[Equation 8]{Meert15} in the definition of the galaxy\nmorphology classes in terms of T-type, which is presented in the\nsecond column of Table~\\ref{tab:morphoType}.\n\n\\begin{table}\n\\caption{Morphology class of galaxies hosting a compact core (vDokkum15). The class is assigned according to the definitions in column 2 \\citep{Meert15}. Morphology fractions are given for the sample in Table~\\ref{tab:subs} (10,566 galaxies) and integrated for $\\log(M_{\\star,{\\rm gal}}/{\\rm M}_\\odot)\\geq 10.50-10.75$ bin.}\n\\label{tab:morphoType}\n\\centering\n\\begin{tabular}{ | c | c | c |}\n\\hline\nClass & Definition &  vDokkum15   \\\\ \\hline\nElliptical & T-type $\\leq$ -3 & {\\bf 50.9 \\%}   \\\\ \nS0 & -3 $<$ T-type $\\leq$ 0.5 & {\\bf 43.4 \\%}   \\\\ \nSab & 0.5 $<$ T-type $\\leq$ 4 & {\\bf 5.4 \\%}   \\\\ \nScd & 4 $<$ T-type & {\\bf 0.3 \\%}  \\\\ \\hline\n\\end{tabular}\n\\end{table}\n\nOur goal here is to assess the morphological variety of the fully-fledged galaxies that host compact cores (rather than analyzing the compact core structure itself as in \\S\\,\\ref{sec:photo}). Figure~\\ref{fig:morphology} and Table~\\ref{tab:morphoType} show these results, with mass estimates, $M_{\\star,{\\rm gal}}$, also being for the the total host galaxy (not the core mass).\n\nFigure~\\ref{fig:morphology} shows the variation along $M_{\\star,{\\rm gal}}$ of the four morphology class fractions. Aside from the Scd class, which contributes a negligible amount, the other classes are identified by coloured bands. Inside each colour band, lines and symbols identify the results of each compactness criterion. Only the Barro13 results span the mass range down to the $\\log(M_{\\star,{\\rm gal}})\\sim 10$ level. The histograms, in the lower part, show the mass range covered by each compactness criterion. Note that very few galaxies, hosting compact cores, populate the $\\log(M_{\\star,{\\rm gal}}/{\\rm M}_\\odot) = 10.50-10.75$ bin (19 galaxies for vDokkum15 and 40 for vdWel14) and their presence is imperceptible in the histogram. Nevertheless, the morphology fraction is calculated for those galaxies.\n\nTable~\\ref{tab:morphoType} gives for morphology fractions integrated across all masses (hence less detailed than the mass-dependant results shown in Figure~\\ref{fig:morphology}). Using the vDokkum15 sample in Table~\\ref{tab:subs}, all host galaxies with compact cores of log(M$_{\\star,{\\rm core}})\\geq$10.6 (10,566) are integrated into four morphology fraction values. Host galaxy morphology essentially divides into a 50:50 mixture of elliptical and disk morphology (note that the majority of the sample is in early-type systems: E + S0). An alternative option to Figure~\\ref{fig:morphology}, using M$_{\\star,{\\rm core}}$ masses is considered in Appendix~\\ref{app:morpho}.\n\nAccording to Figure~\\ref{fig:morphology}, S0 and Sab classes dominate the morphologies of galaxies hosting compact cores, for  log(M$_{\\star,{\\rm gal}})\\leq$11.0. At the high-mass end, elliptical galaxies \npredominate over their disk counterparts. Integrated values in Table~\\ref{tab:morphoType} give more balanced results with comparable fractions of Elliptical and S0 classes and minor contributions from later-type disk classes.\n\n\n\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[scale=0.6]{plot_morpho_Mgal.eps}\n  \\caption{The morphology class fraction of galaxies hosting a compact\ncore. Both mass and morphology correspond to the whole galaxies. In the upper panel, the results are presented for the three alternative criteria used to select the compact cores: Barro13 (triangles), vdWel14 (dots) and vDokkum15 (squares). Colored bands correspond to each morphology class. The colored triangle extensions correspond to the Barro13 criterion, which includes host galaxies down to $\\log(M_{\\star, {\\rm gal}}/{\\rm M}_\\odot)\\geq$10.0. In the lower panel, three histograms are shown with the total stellar mass of the host galaxy, using a bin size 0.25\\,dex. It should be noted that very few host-galaxies populate the 10.5-10.75 mass bin (19 for vDokkum15 and 40 for vdWel14), but nevertheless their morphology fractions have been calculated.}\n  \\label{fig:morphology}\n\\end{figure*}\n\n\nA further simple computation can provide an estimation of the average\nextra stellar mass incorporated on top of the naked red nuggets to become\nfully-fledged present-day galaxies. Assuming that the red nuggets survive\nintact since redshift $\\sim 1.5$, the extra mass acquired during the\nlast $\\sim$ 9.2 Gyr equates to the difference between the total and\nthe core masses, roughly equal to the B+D decomposed disk-mass (Md) in\nMendel14.  The average extra mass for the vDokkum15 selected sample is $\\log (M_{\\star,{\\rm extra}}/{\\rm M}_\\odot)$ = 10.53, which means that an average 25.3$\\pm$13.5 \\% of the total galaxy mass at z$\\sim$0.1 has been accreted since z$\\sim$1.5 at a growth rate $\\sim 3.7 {\\rm M}_{\\odot}\\,{\\rm year}^{-1}$. These results are consistent with those of \\cite{vD10}, who estimate that $\\sim40\\%$ of the total stellar mass at $z = 0$ would have been added through mergers since $z\\sim2$ under this hypothesis. There is even better agreement with \\cite{Pat13}, who report a 33 \\% mass increase from z$\\sim$1.5 to z$\\sim$0.1.\n\n\n\n\\section{Discussion}\n\\label{sec:discussion}\n\nA few recent studies have offered interesting explanations for the early red nugget density evolution at redshifts larger than $z\\sim2$. \\cite{Barro13} offer a convincing explanation for the number density increase of red nuggets earlier than $z\\sim2$, built on the simultaneous decline of the number density of\nstar forming compact massive galaxies (sCMG). Their result has been corroborated by \\cite{vD15}. This interpretation suggests that the sCMG are being continuously converted into red nuggets by processes quenching their star formation, while new sCMGs are replenished by cold flows, until that process becomes inefficient by $z\\leq1.5$. Oddly, red nugget evolution below $z\\sim1.5$ is characterised by\nobservational disagreement and the lack of unanimous interpretation.\n\nFor instance, our relatively high number density of $z\\sim0.1$ compact cores, $(0.28-0.72)\\times 10^{-4}\\ {\\rm Mpc}^{-3}$, (see Table~\\ref{tab:numberdens} and Figure~\\ref{fig:numberdensity}) come into apparent conflict with the majority of the results from the literature, which range from lower \\citep[$\\sim 10^{-7}$ Mpc$^{-3}$,][]{Tru09,Tay10} to higher number densities \\citep[$\\sim 10^{-5}-10^{-4}$ Mpc$^{-3}$,][]{Val10,Pog13}. This conflict is only {\\em apparent} because the discrepancy results from the adoption of different search strategies, looking for either compact full galaxies (literature) or compact cores (this study). Contrary to compact cores, which are relatively abundant, very few full galaxies satisfy the demanding compactness criteria in their own right. In order to check this statement we have used our own data to calculate the number density of full galaxies satisfying the vDokkum15 compactness criterion. By using the single-Sersic fit version of the mass-size parameters from the Mendel14 catalogue, we obtain a number density of $3.0\\times 10^{-6}\\,{\\rm Mpc}^{-3}$, an order of magnitude lower than the corresponding compact core number density (as shown in Figure~\\ref{fig:numberdensity}). \n\nAccording to the hypothesis we are testing here, red nuggets - once formed - do not significantly change their internal structure or composition, but simply aggregate 2D or 3D envelopes to become the compact massive cores of present-day galaxies. Under this hypothesis, the number density of $z\\sim0.1$ compact cores should approximately match, or be slightly less than, the maximum value attained by the red nuggets. We have now shown that this is the case (see Figure~\\ref{fig:numberdensity} and Table~\\ref{tab:numberdens}). This result is in agreement with a recent study by \\cite{GraDS15}, their sample of 21 structurally decomposed lenticular galaxies also having a relatively high number density, comparable to our own lower-limits. Comparison with full galaxies at $z\\sim0.1$, rather than with compact cores, leads to a discrepancy, as shown here and in the literature. This is in no conflict with the above hypothesis which asserts only that the cores are sufficient -- not necessary -- building blocks for $z\\sim 0.1$ galaxies.\n\n\\section{Summary and Conclusions}\n\n \n\nIn this study, we have tested the hypothesis that high-redshift compact, quiescent and massive galaxies, nicknamed {\\it red nuggets}, have survived as the compact cores of massive present-day elliptical or disk galaxies. Two main questions are posed to test this hypothesis:\n\n\\begin{enumerate}\n\\item{Do compact cores, structurally similar to red nuggets, exist at $z\\sim0.1$?} \n\\item{if so, is their abundance comparable to that of red nuggets at $z\\sim1.5$?}\n\\end{enumerate}\n\nWe carry out this test using the recently published SDSS-based large catalogues of Bulge+Disk (B+D) galaxy decompositions, in particular from \\cite{Men14}, which includes stellar masses of the B and D structural components. We approach the test from a comprehensive perspective, imposing the B+D decomposition to the whole present-day galaxy sample, regardless of their morphology types. We adopt the generic name {\\it core} to include the central component of ellipticals and bulge of disks, and study these as if they were independent structures, defined based on their compactness, according to same criteria adopted in the literature to identify the red nuggets themselves \\citep[e.g.][]{Barro15,vdW14,vD15}. It is worth mentioning that our results depend heavily on the reliability of the photometric Bulge+Disk decomposition of SDSS galaxy data. Nevertheless, the huge size of the parent catalogue has allowed us to carry out a very strict quality screening, only passed by $\\sim\\!30$ \\% of the objects.  \n\nIn summary, the study concludes that the answer to both these questions above is {\\em yes}.  The details of this conclusion and other key results are as follows:\n\n\n\n\n$\\bullet$ We confirm that a small but significant fraction ($>$5\\%) of cores in present-day galaxies (regardless of morphology) is structurally similar to z$\\sim$1.5 red nuggets. In the mass-size and mass-density relations, the red nuggets and compact cores are significantly segregated from the normal elliptical galaxies, with average sizes $\\sim$4 times smaller and densities $\\sim$20 times larger than normal ellipticals at a given mass (e.g. $M_{\\star}\\sim 10^{11}{\\rm M}_\\odot$) (Figure~\\ref{fig:spheroids}).\n\n$\\bullet$ Not only do such compact cores exist, but their abundance matches approximately that of the red nuggets at $z\\sim1.5$ \\citep[e.g.][]{vD15}. This result is quite consistent with previous findings on the present-day abundance of compact galaxies, as we use of B+D decomposed cores (rather than to full galaxies).\n\n$\\bullet$ That these number densities are, if anything, slightly lower than the highest values for red nuggets, further agrees with the hypothesis, leaving room for the some $\\sim$20\\,\\% of red nuggets to have been destroyed in major merger events (as found in some cosmological simulations \\citep[e.g.][]{Wellons15,Furlong15}.\n\n$\\bullet$ Dynamical measurements of the samples of red nuggets, compact core and ellipticals corroborates the photometric analysis. Velocity dispersion, $\\sigma$, and dynamical mass density in red nuggets and compact cores are systematically larger than in normal ellipticals. For instance at a given $M_{\\rm dyn} = 10^{11}{\\rm M}_\\odot$, $\\sigma$ is 1.5-1.7 times larger and dynamical-mass density 11-35 times higher than in the normal ellipticals (Figures~\\ref{fig:veldisp} and \\ref{fig:Mdyn}).\n\n$\\bullet$ A simple calculation allows us to estimate the extra mass accreted by the red nuggets to become fully-fledged galaxies, under this hypothesis. Assuming that red nuggets start `naked' or with only rudimentary disks at $z\\sim1.5$, the extra stellar mass acquired over the last $\\sim\\!9$\\,Gyr is the difference between the mass of the galaxy and that of the compact core. We find that galaxies hosting a compact core would typically have accreted one quarter of their mass over the last $\\sim\\!9$\\,Gyr, at a growth rate of $\\sim\\!3.7\\ {\\rm M}_\\odot\\ {\\rm yr}^{-1}$.\n   \n$\\bullet$ Galaxies hosting compact cores (according to the vDokkum15 criterion) show varied morphological classes extending from ellipticals to spirals (Scd). The integrated fractions of morphology classes with $\\log(M_{\\rm gal}/{\\rm M}_\\odot)>$10.5 are: 50.9\\% (E), 43.4\\% (S0), 5.4\\% (Sab) and 0.3\\% (Scd). Results for alternative mass ranges and compactness criteria are given in Figure~\\ref{fig:morphology} and Appendix~\\ref{app:morpho}. These findings are consistent with red nuggets becoming cores of both present-day elliptical and disk galaxies.\n\n\n\\section*{Acknowledgements}\n\nWe thank the referee for a very constructive report, which improved the paper. We also thank Ignacio Trujillo, Mar\\'\\i a Cebri\\'an and the Galaxy Group at the IAC for enlightening discussions. We acknowledge the use of SDSS data (http://www.sdss.org/collaboration/credits.html), and support from grants AYA2013-48226-C3-1-P and AYA2013-47742-C04-02-P from the Spanish Ministry of Economy and Competitiveness (MINECO). IF thanks the IAC for hospitality under the Severo Ochoa visitor programme. MS and CdV acknowledge financial support from the MINECO under the 2011 Severo Ochoa Program SEV-2011-0187. CdV, MS and IM-V acknowledge financial support from MINECO under grants AYA2013-46886-P and AYA2014-58308-P.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{99}\n\\bibitem[\\protect\\citeauthoryear{Abazajian et al.}{2009}]{Aba09}\nAbazajian, K. N., Adelman-McCarthy, J. K., Ageros, M. A. et al., 2009, ApJS, 182, 543\n\n\\bibitem[\\protect\\citeauthoryear{Baldry \\& Glazebrook}{2003}]{BGIMF}\nBaldry, I.~K., Glazebrook, K., 2003, ApJ, 593, 258\n\n\\bibitem[\\protect\\citeauthoryear{Baldwin, Phillips \\& Terlevich}{1981}]{BPT81}\nBaldwin, J. A., Phillips, M. M., Terlevich, R., 1981, PASP, 93, 5\n\n\\bibitem[\\protect\\citeauthoryear{Barro et al.}{2013}]{Barro13} \nBarro, G., Faber, S.M., P\\' erez-Gonz\\' alez, P.G. et al. 2013, ApJ, 765, 104 \n\n\\bibitem[\\protect\\citeauthoryear{Barro et al.}{2015}]{Barro15} \nBarro, G., Faber, S.M., Dekel, A. et al. 2015, ApJ submitted (arXiv.1503.07164) \n\n\\bibitem[\\protect\\citeauthoryear{Belli et al.}{2014a}]{Bell14a}\nBelli, S., Newman, A. B., Ellis, R. S., Konidaris, N. P., 2014a, ApJ, 788, L29\n\n\\bibitem[\\protect\\citeauthoryear{Belli et al.}{2014b}]{Bell14b}\nBelli, S., Newman, A. B., Ellis, R. S., 2014b, ApJ, 783, 117\n\n\\bibitem[\\protect\\citeauthoryear{Berg et al.}{2014}]{Berg14}\nBerg, T. A. M., Simard, L., Mendel T. J., Ellison, S. L., 2014, MNRAS, 440, L66\n\n\\bibitem[\\protect\\citeauthoryear{Bernardi et al.}{2010}]{Ber10}\nBernardi, M., Shankar, F., Hyde, J. B., Mei, S., Marulli, F., Sheth, R. K., 2010, MNRAS, 404, 2087\n\n\\bibitem[\\protect\\citeauthoryear{Bezanson et al.}{2009}]{Bez09}\nBezanson, R., van Dokkum, P. G., Tal, T., Marchesini, D., Kriek, M., Franx, M., Coppi, P., 2009, ApJ, 697, 1290\n\n\\bibitem[\\protect\\citeauthoryear{Bezanson et al.}{2013}]{Bez13}\nBezanson, R., van Dokkum, P., van de Sande, J., Franx, M., Kriek, M., 2013, ApJ, 764, L8 \n\n\\bibitem[\\protect\\citeauthoryear{Bezanson et al.}{2015}]{Bez15}\nBezanson, R., Franx, M., van Dokkum, P., 2015, ApJ, 799, 148 \n\n\\bibitem[\\protect\\citeauthoryear{Bluck et al.}{2014}]{Bluck14}\nBluck, A.F.L., Mendel, J.T., Ellison, S.L. et al. 2014, MNRAS, 441, 599 \n\n\\bibitem[\\protect\\citeauthoryear{Buitrago et al.}{2013}]{Bui13}\nBuitrago, F., Trujillo, I., Conselice, C. J., H\\\"aussler, B., 2013, MNRAS, 428, 1460\n\n\\bibitem[\\protect\\citeauthoryear{Cappellari et al.}{2006}]{Cap06}\nCappellari, M., Bacon, R., Bureau, M. et al., 2006, MNRAS, 366, 1126 \n\n\\bibitem[\\protect\\citeauthoryear{Cappellari et al.}{2009}]{Cap09}\nCappellari, M., di Serego Alighieri, S., Cimatti, A. et al. 2009, ApJ, 704, L34\n\n\\bibitem[\\protect\\citeauthoryear{Cardelli, Clayton \\& Mathis}{1989}]{CCM89}\nCardelli, J.A., Clayton, G.C., Mathis, J.S., 1989, ApJ, 345, 245 \n\n\\bibitem[\\protect\\citeauthoryear{Carrasco et al.}{2010}]{Carr10}\nCarrasco, E. R., Conselice, C. J., Trujillo, I., 2010, MNRAS, 405, 2253 \n\n\\bibitem[\\protect\\citeauthoryear{Cassata et al.}{2010}]{Cas10}\nCassata, P., Giavalisco, M., Guo, Y. et al. 2010, ApJ, 714, L79 \n\n\\bibitem[\\protect\\citeauthoryear{Chabrier}{2003}]{Chab03}\nChabrier, G., 2003, ApJ, 586, L133\n\n\\bibitem[\\protect\\citeauthoryear{Cid Fernandes et al.}{2005}]{Cid05}\nCid Fernandes, R., Mateus, A., Sodr\\' e, L., Stasinska, G., Gomes, J.M.,  2005, MNRAS, 358, 363 \n\n\\bibitem[\\protect\\citeauthoryear{Cimatti et al.}{2008}]{Cim08}\nCimatti, A., Cassata, P., Pozzetti, L. et al., 2008, \\aap, 482, 21 \n\n\\bibitem[\\protect\\citeauthoryear{Ciotti}{1999}]{Cio99}\nCiotti, L., 1999, \\aap, 249, 99 \n\n\\bibitem[\\protect\\citeauthoryear{Conroy, Gunn \\& White}{2009}]{Con09}\nConroy, C., Gunn, J. E., White, M., 2009, ApJ, 699, 486\n\n\\bibitem[\\protect\\citeauthoryear{C\\^ot\\'e et al.}{2006}]{Cote06}\nC\\^ot\\'e, P., Piatek, S., Ferrarese, L. et al., 2006, ApJS, 165, 57\n\n\\bibitem[\\protect\\citeauthoryear{Daddi et al.}{2005}]{Dad05}\nDaddi, E., Renzini, A., Pirzkal, N. et al., 2005, ApJ, 626, 680 \n\n\\bibitem[\\protect\\citeauthoryear{Damjanov et al.}{2009}]{Dam09}\nDamjanov, I., McCarthy, P.J., Abraham, R.G. et al., 2009, ApJ, 695, 101\n\n\\bibitem[\\protect\\citeauthoryear{Damjanov et al.}{2011}]{Dam11}\nDamjanov, I., Abraham, R.G., Glazebrook, K. et al., 2011, ApJ, 739, L44\n\n\\bibitem[\\protect\\citeauthoryear{Damjanov et al.}{2015}]{Dam15}\nDamjanov, I., Geller, M.J., Zahid, H.J., Hwang, H.S., 2015, ApJ, 806, 158\n\n\\bibitem[\\protect\\citeauthoryear{Dekel et al.}{2009}]{Dek09}\nDekel, A., Birnboim, Y., Engel, G. et al. 2009, Nature, 457, 451\n\n\\bibitem[\\protect\\citeauthoryear{Di Matteo et al.}{2015}]{Dim15}\nDi Matteo, P., G\\' omez, A., Haywood, M. et al. 2015, \\aap, 577, 1\n\n\\bibitem[\\protect\\citeauthoryear{Dullo \\& Graham}{2013}]{DG13}\nDullo, B., Graham, A.W., 2013, ApJ, 768, 36\n\n\\bibitem[\\protect\\citeauthoryear{Fan et al.}{2008}]{Fan08}\nFan, L., Lapi, A., De Zotti, G., Danese, L., 2008, ApJ, 689, L101\n\n\\bibitem[\\protect\\citeauthoryear{Ferreras et al.}{2014}]{Ferr14}\nFerreras, I., Trujillo, I., M\\' armol-Queralt\\' o, E. et al., 2014, MNRAS, 444, 906 \n\n\\bibitem[\\protect\\citeauthoryear{Furlong et al.}{2015}]{Furlong15}\nFurlong, M., Bower, R.G., Crain, R.A. et al., 2015, preprint (arXiv.1510.05645) \n\n\\bibitem[\\protect\\citeauthoryear{Gadotti}{2008}]{Gad08}\nGadotti, D.A., 2008, MNRAS, 384, 420\n\n\\bibitem[\\protect\\citeauthoryear{Graham}{2013}]{Gra13}\nGraham, A.W., 2013, Planets, Stars and Stellar Systems. Vol. 6: Extragalactic Astronomy and Cosmology, ed. T. D. Oswalt \\& W. C. Keel (Dordrecht: Springer), 91 \n\n\\bibitem[\\protect\\citeauthoryear{Graham et al.}{2015}]{GraDS15}\nGraham, A. W., Dullo, B. T., Savorgnan, G. A. D., 2015, ApJ, 804, 32\n\n\\bibitem[\\protect\\citeauthoryear{Graham \\& Worley}{2008}]{GW08}\nGraham, A.W., Worley, C.C., 2008, MNRAS, 388, 1708\n\n\\bibitem[\\protect\\citeauthoryear{Hopkins et al.}{2009}]{Hop09}\nHopkins, P. F., Bundy, K., Murray, N., Quataert, E., Lauer, T. R., Ma, C.-P., 2009, MNRAS, 398, 898\n\n\\bibitem[\\protect\\citeauthoryear{Huang et al.}{2013}]{Huang13}\nHuang, S., Ho, L. C., Peng, C. Y., Li, Z.-Y., Barth, A. J., 2013, ApJ, 766, 47 \n\n\\bibitem[\\protect\\citeauthoryear{Huertas-Company et al.}{2011}]{HC11}\nHuertas-Company, M., Aguerri, J.A.L., Bernardi, M., Mei, S., Sanchez Almeida, J., 2011, \\aap, 525, 157 \n\n\\bibitem[\\protect\\citeauthoryear{J\\o rgensen, Franx \\& Kjaergaard}{1995}]{Jor95}\nJ\\o rgensen, I., Franx, M. \\& Kjaergaard, P., 1995, MNRAS, 276, 1341 \n\n\\bibitem[\\protect\\citeauthoryear{Johansson et al.}{2012}]{Joh12} Johansson, P.H., Naab, T., Ostriker, J.P., 2012, ApJ 754 115\n\n\\bibitem[\\protect\\citeauthoryear{Kewley et al.}{2001}]{Kew01} \nKewley L. J., Dopita M. A., Sutherland R. S., Heisler C. A., Trevena J., 2001, ApJ, 556, 121\n\n\\bibitem[\\protect\\citeauthoryear{Krogager et al.}{2014}]{Kro14}\nKrogager, J.-K., Zirm, A. W., Toft, S., Man, A., Brammer, G., 2014, ApJ, 797, 17\n\n\\bibitem[\\protect\\citeauthoryear{Kroupa}{2001}]{Kroupa01}\nKroupa, P., 2001, MNRAS, 322, 231\n\n\\bibitem[\\protect\\citeauthoryear{La Barbera et al.}{2010}]{LaB10}\nLa Barbera, F., de Carvalho, R.R., de la Rosa, I.G. et al., 2010, MNRAS, 408, 1313\n\n\\bibitem[\\protect\\citeauthoryear{Lackner \\& Gunn}{2012}]{LG12}\nLackner, C.N., Gunn, J.E., 2012, MNRAS, 421, L2277\n\n\\bibitem[\\protect\\citeauthoryear{Lauer et al.}{2007}]{Lau07}\nLauer, T.R., Gebhardt, K., Faber, S.M. et al., 2007, ApJ, 664, 226\n\n\\bibitem[\\protect\\citeauthoryear{Licquia \\& Newman}{2015}]{LN15}\nLicquia, T.C., Newman, J.A., 2015, ApJ, 806, 96\n\n\\bibitem[\\protect\\citeauthoryear{Loeb \\& Peebles}{2003}]{LP03}\nLoeb, A., Peebles, P. J. E., 2003, ApJ, 589, 29\n\n\\bibitem[\\protect\\citeauthoryear{Longhetti et al.}{2007}]{Lon07}\nLonghetti, M., Saracco, P., Severgnini, P. et al., 2007, MNRAS, 374, 614\n\n\\bibitem[\\protect\\citeauthoryear{McGrath et al.}{2007}]{Mac07}\nMcGrath, E. J., Stockton, A., Canalizo, G., 2007, ApJ, 669, 241 \n\n\\bibitem[\\protect\\citeauthoryear{Meert et al.}{2015}]{Meert15}\nMeert, A., Vikram, V., Bernardi, M., 2015, MNRAS, 446, 3943\n\n\\bibitem[\\protect\\citeauthoryear{Mendel et al.}{2014}]{Men14}\nMendel, J. T., Simard, L., Palmer, M., Ellison, S. L., Patton, D. R., 2014, ApJS, 210, 3\n\n\\bibitem[\\protect\\citeauthoryear{Moresco et al.}{2013}]{Mor13}\nMoresco, M., Pozzetti, L., Cimatti, A. et al., 2013, \\aap, 558, 61\n\n\\bibitem[\\protect\\citeauthoryear{Morishita \\& Ichikawa}{2016}]{MorI16}\nMorishita, T., Ichikawa, T., 2016, ApJ, 816, 87\n\n\\bibitem[\\protect\\citeauthoryear{Mosleh, Williams \\& Franx}{2013}]{Mos13}\nMosleh, M., Williams, R.J., Franx, M., 2013, ApJ, 777, 117\n\n\\bibitem[\\protect\\citeauthoryear{Naab et al.}{2007}]{Naab07}\nNaab, T., Johansson, P. H., Ostriker, J. P., Efstathiou, G., 2007, ApJ, 658, 710 \n\n\\bibitem[\\protect\\citeauthoryear{Naab et al.}{2009}]{Naab09}\nNaab, T., Johansson, P. H., Ostriker, J., 2009, ApJ, 699, L178\n\n\\bibitem[\\protect\\citeauthoryear{Newman et al.}{2010}]{New10}\nNewman, A. B., Ellis, R. S., Treu, T., Bundy, K., 2010, ApJ, 717, L103\n\n\\bibitem[\\protect\\citeauthoryear{Newman et al.}{2012}]{New12}\nNewman, A. B., Ellis, R. S., Bundy, K., Treu, T., 2012, ApJ, 746, 162\n\n\\bibitem[\\protect\\citeauthoryear{Nair \\& Abraham}{2010}]{NaAb10}\nNair, P.B., Abraham, R. G., 2010, ApJS, 186, 427\n\n\\bibitem[\\protect\\citeauthoryear{Onodera et al.}{2012}]{Ono12}\nOnodera, M. et al., 2012, ApJ, 755, 260\n\n\\bibitem[\\protect\\citeauthoryear{Oser et al.}{2010}]{Oser10}\nOser, L., Ostriker, J. P., Naab, T., Johansson, P. H., Burkert, A., 2010, ApJ, 725, 2312\n\n\\bibitem[\\protect\\citeauthoryear{Patel et al.}{2013}]{Pat13}\nPatel, S.G., van Dokkum, P.G., Franx, M. et al., 2013, ApJ, 766, 15\n\n\\bibitem[\\protect\\citeauthoryear{Peth et al.}{2015}]{Peth15} \nPeth, M. A., Lotz, J. M., Freeman, P. E. et al., 2015, MNRAS submitted (arXiv.1504.01751)\n\n\\bibitem[\\protect\\citeauthoryear{Poggianti et al.}{2013}]{Pog13}\nPoggianti, B. M., Moretti, A., Calvi, R., D'Onofrio M., Valentinuzzi T., Fritz J., Renzini A., 2013, ApJ, 777, 125\n\n\\bibitem[\\protect\\citeauthoryear{Rettura et al.}{2010}]{Ret10}\nRettura, A., Rosati, P., Nonino, M. et al. 2010, ApJ, 709, 512\n\n\\bibitem[\\protect\\citeauthoryear{Ryan et al.}{2012}]{Ryan12}\nRyan, R. E., Jr., McCarthy, P. J., Cohen, S. H. et al., 2012, ApJ, 749, 53\n\n\\bibitem[\\protect\\citeauthoryear{Saglia et al.}{2010}]{Sag10} \nSaglia, R. P., S\\' anchez-Bl\\' azquez, P., Bender, R. et al. 2010, \\aap, 524, A6 \n\n\\bibitem[\\protect\\citeauthoryear{S\\' anchez-Bl\\' azquez}{2016}]{SB15}\nS\\' anchez-Bl\\' azquez, P., 2016, in Laurikainen E., Peletier R., Gadotti D., eds., Astrophysics and Space Science Library, Vol. 418, Galactic Bulges. Springer International Publishing Switzerland, p. 127 \n\n\\bibitem[\\protect\\citeauthoryear{Saracco et al.}{2011}]{Sar11} \nSaracco, P., Longhetti, M., Gargiulo, A., 2011, MNRAS, 412, 2707\n\n\\bibitem[\\protect\\citeauthoryear{Saulder et al.}{2015}]{Saul15} \nSaulder, C., van den Bosch, R.C.E., Mieske, S., 2015, \\aap, 578, 134\n\n\\bibitem[\\protect\\citeauthoryear{Schade et al.}{1999}]{Scha99} \nSchade, D., Lilly, S.J., Crampton, D. et al. 1999, ApJ, 525, 31 \n\n\\bibitem[\\protect\\citeauthoryear{Shen et al.}{2003}]{Shen03} \nShen, S., Mo, H.J., Simon, D.M. et al. 2003, MNRAS, 343, 978 \n\n\\bibitem[\\protect\\citeauthoryear{Simard et al.}{2011}]{Sim11}\nSimard, L., Mendel, J. T., Patton, D. R., Ellison, S. L., McConnachie, A. W., 2011, ApJS, 196, 11\n\n\\bibitem[\\protect\\citeauthoryear{Strauss et al.}{2002}]{Stra02}\nStrauss, M. A., Weinberg, D. H., Lupton, R. H. et al., 2002, AJ, 124, 1810\n\n\\bibitem[\\protect\\citeauthoryear{Tacchella et al.}{2015}]{Tacch15}\nTacchella, S. et al., 2015, MNRAS submitted (arXiv:1509.00017) \n\n\\bibitem[\\protect\\citeauthoryear{Taylor et al.}{2010}]{Tay10}\nTaylor, E. N., Franx, M., Glazebrook, K. et al., 2010, ApJ, 720, 723 \n\n\\bibitem[\\protect\\citeauthoryear{Thomas et al.}{2013}]{Thom13}\nThomas, D., Steele, O., Maraston, C. et al., 2013, MNRAS, 431, 1383 \n\n\\bibitem[\\protect\\citeauthoryear{Toft et al.}{2012}]{Tof12}\nToft, S., Gallazzi, A., Zirm, A., Wold, M., Zibetti, S., Grillo, C., Man, A., 2012, ApJ, 754, 3\n\n\\bibitem[\\protect\\citeauthoryear{Treu et al.}{2005}]{Tre05}\nTreu T., Ellis R.S., Liao T.X. et al. 2005, ApJ, 633, 174\n\n\\bibitem[\\protect\\citeauthoryear{Trujillo et al.}{2006a}]{Tru06a}\nTrujillo, I., Feulner, G., Goranova, Y. et al., 2006a, MNRAS, 373, L36\n\n\\bibitem[\\protect\\citeauthoryear{Trujillo et al.}{2006b}]{Tru06b}\nTrujillo, I., F\\\"orster Schreiber, N.M., Rudnick, G. et al., 2006b, ApJ, 650, 18\n\n\\bibitem[\\protect\\citeauthoryear{Trujillo et al.}{2007}]{Tru07}\nTrujillo, I., Conselice, C. J., Bundy, K. et al., 2007, MNRAS, 382, 109 \n\n\\bibitem[\\protect\\citeauthoryear{Trujillo et al.}{2009}]{Tru09}\nTrujillo, I., Cenarro, A. J., de Lorenzo-C\\' aceres, A. et al., 2009, ApJ, 692, L118 \n\n\\bibitem[\\protect\\citeauthoryear{Trujillo et al.}{2011}]{Tru11}\nTrujillo, I., Ferreras, I., de la Rosa, I.G., 2011, MNRAS, 415, 3903 \n\n\\bibitem[\\protect\\citeauthoryear{Valentinuzzi et al.}{2010}]{Val10}\nValentinuzzi, T., Fritz, J., Poggianti, B. M. et al. 2010, ApJ, 712, 226 \n\n\\bibitem[\\protect\\citeauthoryear{van de Sande et al.}{2013}]{Sande13}\nvan de Sande, J., Kriek, M., Franx, M. et al. 2013, ApJ, 771, 85\n\n\\bibitem[\\protect\\citeauthoryear{van der Wel et al.}{2014}]{vdW14}\nvan der Wel, A., Franx, M., van Dokkum, P. G. et al. 2014, ApJ, 788, 28\n\n\\bibitem[\\protect\\citeauthoryear{van der Wel et al.}{2008}]{Wel08}\nvan der Wel, A., Holden, B. P., Zirm, A. W. et al. 2008, ApJ, 688, 48\n\n\\bibitem[\\protect\\citeauthoryear{van Dokkum et al.}{2008}]{vDo08}\nvan Dokkum, P. G., Franx, M., Kriek, M. et al., 2008, ApJ, 677, L5 \n\n\\bibitem[\\protect\\citeauthoryear{van Dokkum et al.}{2009}]{vDo09}\nvan Dokkum, P. G., Kriek, M., Franx, M., 2009, Nature, 460, 717 \n\n\\bibitem[\\protect\\citeauthoryear{van Dokkum et al.}{2010}]{vD10}\nvan Dokkum, P. G., Whitaker, K.E., Brammer, G., et al., 2010, ApJ, 709, 1018 \n\n\\bibitem[\\protect\\citeauthoryear{van Dokkum et al.}{2015}]{vD15}\nvan Dokkum, P. G., Nelson, E. J., Franx, M. et al., 2015, ApJ, 813, 23\n\n\\bibitem[\\protect\\citeauthoryear{Vazdekis et al.}{2010}]{Vaz10}\nVazdekis, A., S\\' anchez-Bl\\' azquez, P., Falc\\' on-Barroso, J., Cenarro, A. J., Beasley, M. A., Cardiel, N., Gorgas, J., Peletier, R. F., 2010, MNRAS, 404, 1639 \n\n\\bibitem[\\protect\\citeauthoryear{Wellons et al.}{2016}]{Wellons15}\nWellons, S., Torrey, P., Ma, Ch-P. et al., 2016, MNRAS, 456, 1030 \n\n\\bibitem[\\protect\\citeauthoryear{Wolf et al.}{2010}]{Wolf10}\nWolf, J., Martinez, G.D., Bullock, J.S. et al., 2010, MNRAS, 406, 1220 \n\n\\bibitem[\\protect\\citeauthoryear{Zahid et al.}{2015}]{Zah15}\nZahid, H. J., Damjanov, I., Geller, M., Chilingarian, I., 2015, ApJ, 806, 122\n\n\\bibitem[\\protect\\citeauthoryear{Zolotov et al.}{2015}]{Zol15}\nZolotov, A. et al., 2015, MNRAS, 450, 2327\n\n\\end{thebibliography}\n\n\n\n\n\n\\appendix\n\n\\section{Sample Completeness}\n\\label{app:compl}\n\nThe Mendel14 parent sample spans a redshift range 0.005 $\\leq z \\leq$\n0.4 and covers magnitudes 14.0 $\\leq$ mag$_{\\rm Petro,r}\\leq$ 17.77,\nwhere the bright-end magnitude limit is set to avoid problematic\ndeblending of luminous galaxies and the faint-end limit marks the\ncompleteness flux-limit of the spectroscopic SDSS sample\n\\citep{Stra02}. Rather than a flux-limited sample, we need a complete\nmass-limited one, given that the most relevant reference parameter of\nthe present study is the core stellar mass ($M_{\\star,{\\rm core}}$). \nAlthough we use the V/Vmax statistics to correct for residual\nincompleteness in number density estimations \n(\\S\\,\\ref{sec:numberdens}), it is advisable to rely on a sample with the\nhighest possible degree of completeness throughout our target mass range,\n$\\log (M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$.\n\nTo assess the sample completeness, we have worked out the Core Mass\nFunction (CMF) for redshift slices of $\\Delta z = 0.025$. (see\nFigure~\\ref{fig:complete}). To construct the CMF we have used the\nMendel14 decomposition parameter {\\it logMb}, corresponding to the\nlogarithm of $M_{\\star,{\\rm core}}$, instead of the more common\ntotal stellar mass of the galaxy. The area coverage of the SDSS-DR7\nLegacy Survey \\citep{Aba09} is 8,032\\,deg$^2$.\n\nAs a first approximation, the upper envelope of all the curves is\ntaken as our reference CMF. Our strategy to obtain a nearly complete\nsample for $\\log (M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$ is based on avoiding\nredshift ranges which are poorly populated due to incompleteness. The\nredshift range $0.025 \\leq z \\leq 0.150$ attains the highest\ncompleteness level for the $\\log (M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$ mass-limit. The\nlimiting CMFs for $0.025 \\leq z \\leq 0.15$ and $0.125 < z \\leq 0.150$\nare highlighted in Figure~\\ref{fig:complete} to enhance their contrast\nwith the excluded neighbour redshift slices. The low redshift slice \n$z\\leq 0.025$ is rather incomplete at its high-mass end for \n$\\log (M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$, and the high redshift slice \n$0.150 \\leq z \\leq 0.175$ is also very incomplete at its low-mass end.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_Append_Ab.eps}\n  \\caption{The Core Mass Function (CMF) for redshift slices of\n    $\\Delta z$ = 0.025 in the parent Mendel14 sample. Our strategy to\n    obtain a nearly complete sample for $\\log(M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$ \n    is based on avoiding redshift ranges\n    which are poorly populated due to incompleteness. For instance,\n    the z $\\leqslant$ 0.025 range is excluded due to high incompleteness at\n    $\\log(M_{\\rm core}/{\\rm M}_\\odot)\\geq 10.0$. The highest redshift bin is\n    equally excluded and the selected redshift range for the sample is\n    0.025$\\leqslant z \\leqslant$0.150.}\n  \\label{fig:complete}\n\\end{figure}\n\n\\section{Potential Bias Sources}\n\\label{app:bias}\n\nTwo possible bias sources have been checked for their impact on the\nphotometric B+D decompositions, namely the AGN emission and the choice\nof a fixed de Vaucouleurs shape for the compact cores.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_Append_B1_vD15.eps}\n  \\caption{Variation of sizes determined with different fitting laws, for the compact core sample (10,566 objects), plotted as a function of total galaxy mass: Galaxy effective radius measured with a single fit with a free-n Sersic function (green squares); Exponential disk scale length measured with bulge+disk (B+D) decomposition with bulge Sersic $n_b=4$ fit (open purple triangles); core effective radii calculated with $n_b=4$ (blue triangles) and $n_b=$free (red circles).}\n  \\label{fig:appb_1}\n\\end{figure}\n\nIn particular, the presence of strong emission from active galactic\nnuclei (AGN) can bias our measurements of galaxy sizes towards small\nvalues. Following \\cite{Thom13}, we have extracted emission line\nfluxes to construct the BPT diagram \\citep{BPT81}. We\ndesignate an object as {\\it emission} when the four diagnostic lines\nhave been detected with signal-to-noise ratio above 2. The AGN\nidentification in the BPT diagram follows the empirical separation\nfrom \\cite{Kew01} and includes both the Seyfert and LINER\nclasses. Galaxies designated as {\\it emission} (AGN) make the 14 (5)\\%\nof the compact core subsample, while corresponding figures for the\nnon-core elliptical subsample are 10(4)\\%. The mass-size and\nmass-density relations (Figure~\\ref{fig:spheroids}), represented by the median values in mass\nbins, are unaffected by the exclusion of AGNs or even the exclusion of\n{\\it emission} objects, proving that AGN contamination is not an issue\nfor our results.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_Append_B2.eps}\n  \\caption{Same as Figure B1, with equivalent symbols, but for the reference elliptical sample.}\n  \\label{fig:appb_2}\n\\end{figure}\n\nConcerning the choice of the bulge Sersic index, Mendel14 catalogue\nuses a fixed de Vaucouleurs bulge fit ($n_{\\rm bulge}$=4), instead of\na free-$n_{\\rm bulge}$ fit. According to the authors, the vast\nmajority of SDSS images have insufficient spatial resolution and/or\nsignal-to-noise ratio to provide an adequate n-bulge determination and\nthere is no significant advantage on using free-n$_{\\rm bulge}$ over\nfixed n$_{\\rm bulge}$=4 fits. As explained by \\cite{LG12}, at the SDSS\nresolution, the bulges have their profile tail subsumed in the disk,\nwhile the central peak is washed out by the PSF, making a bulge with\nsay $n_{\\rm bulge}$=4 indistinguishable from one with 3$\\leq n_{\\rm bulge}\\leq 5$. \n\nWhile Mendel14 only derive masses for the $n_{\\rm bulge}=4$ B+D fits,\nSimard11 provide photometric parameters for both free-n\nand fixed n=4 fits. We have used our compact core sample\n(10,566 objects) to assess the potential bias introduced by the Sersic\nindex choice on the structural parameters.\n\n Alternative galaxy/core size calculations are compared in Figure \\ref{fig:appb_1}. As a common base, we have used the total galaxy mass $\\log (M_{\\star}/{\\rm M}_\\odot)$ obtained from a single fit with a free-n Sersic function. For $\\log (M_{\\star,{\\rm core}}/{\\rm M}_\\odot) \\geq 10.6$, free-n cores are, on average, $0.11 \\pm 0.06$\\ dex larger than n=4 cores of similar mass. The use of free-n would decrease the reported separation of $0.38 \\pm 0.10$\\ dex between the reference ellipticals and compact cores (see Section \\ref{fig:spheroids}). As already mentioned, we avoided the use of free-n cores in the present study, due to the lack of $M_{\\star,{\\rm core}}$ information in the catalogues. In conclusion, the choice of Sersic index does not drastically affect our results. The moderate sensitivity to the Sersic index choice is an expected outcome of the distribution of the Sersic indexes in the free-n fits, which has 78 \\% of the values in the interval $3.5\\leq$ free-$n_{\\rm bulge}\\leq 7$, close to the fixed n=4 value. \n\nIn Figure \\ref{fig:appb_1}, the behavior of the lines representing the full-galaxy (green) and disk (purple) sizes can be explained in terms of the host galaxy morphology. The slight predominance of disks below $\\log (M_{\\star}/{\\rm M}_\\odot) \\sim 11.3$ is seemingly related to the larger fraction of disk galaxies in the lower end of our mass interval (see Figure \\ref{fig:morphology}). The prevalence of ellipticals at the high mass end generates a drop in the disk sizes.  \n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_Append_B3_vD15.eps}\n  \\caption{Both compact core and reference elliptical samples, analysed in terms of the mass fraction of their decomposed core (B) and disk (D) structures. A Sersic n=4 fitting law is used. Elliptical galaxies (red circles and open purple triangles) show the expected behaviour of Bulge/Total$\\sim$ 1 galaxies. The galaxies hosting compact cores show that the disk/halo accounts for any mass excess above a typical core mass of $\\log (M_{\\star,{\\rm core}}/{\\rm M}_\\odot) \\sim 11$}\n  \\label{fig:appb_3}\n\\end{figure}\n\nFigure \\ref{fig:appb_2} represents alternative fits to the galaxies of the reference elliptical sample. As expected, the disk size is visibly smaller than the full galaxy and even the cores. Note that the cores of these elliptical galaxies are predominantly extended, only 4.5 \\% of them being compact. For the extended cores, the discrepancy between core sizes measured with free-n and n=4 amounts to $0.05 \\pm 0.02$\\,dex, less than half the offset measured for compact cores (see Figure  \\ref{fig:appb_1})\n\nFinally, Figure \\ref{fig:appb_3} shows the variation with total mass of the mass fraction contained in the disks and bulges of our two SDSS samples: compact cores and reference ellipticals. As expected from the selection rules, the ellipticals have (B/T) $\\sim$ 1 and nearly all their mass is packed in the extended cores. Galaxies hosting a compact core show a distinct behavior in which the more massive the galaxy is, the more relevant the disk/halo becomes. In the frame of our hypothesis, this behavior is compatible with galaxies having a central, prototypical compact core of $M_{\\star,{\\rm core}}\\sim 10^{11}{\\rm M}_\\odot$, embedded in an accreted disk/halo (whose mass accounts for any excess above the core mass). \n\n\n\n\\section{Core contamination by disk light}\n\\label{app:contamina}\n\nIn face-on galaxies, contaminant disk light entering the fiber\naperture does not contribute to the velocity dispersion broadening of the core\n(i.e. dynamical mass), but contributes to the core stellar mass. Therefore,\ndisk contaminated cores tend to show an {\\it unphysical}\n$M_{\\star,{\\rm core}} > M_{\\rm dyn, core}$.\nIn principle, to minimise disk contamination, we could\nrestrict $\\sigma$ measurements to cores in which the SDSS fiber radius\n(1.5 arcsec) were smaller than the core effective radius. This would, however,\nbe a deficient strategy because the core light-profile frequently gets\nsubmersed below the disk before attaining its half-light radius. For\ninstance, cores with $R_{\\rm e}\\lesssim$ 1.5 arcsec could still be\ncontaminated. Our approach to avoid light contamination is based on\nthe simple fact that disk light originates in much younger stellar\npopulations than those from the core \\citep[e.g.][and references\ntherein]{SB15}. Light from a recent star formation event on top of an\nessentially old core star formation history (SFH) is an indication of\ndisk light contamination. Instead of using colours, we adopt the\nluminosity-weighted age ${\\rm \\langle Age\\rangle_L}$ as a more\nsensitive parameter to detect disk light contamination.\n\nWe have carried out a stellar population study in which average ages\n(e.g. ${\\rm \\langle Age\\rangle_L}$) and metallicities are obtained\nthrough spectral fitting, using the {\\it STARLIGHT} synthesis code\n\\citep{Cid05} to find the optimal mixture of Simple Stellar\nPopulations (SSPs) that describes a SDSS spectrum. For the present\nstudy, the basis SSPs correspond to 114 solar-scaled MILES models\n\\citep{Vaz10}. These models have a Kroupa universal IMF\n\\citep{Kroupa01} and span a range of six metallicities, from\nZ/Z$_{\\odot}$= 1/50 to 1.6, and 19 different ages, from 0.5 to 12.6\nGyr. The fitting interval spans from 4000 to 5500 \\AA, with emission\nlines and bad pixels being masked out. The extinction due to\nforeground dust is modelled with the CCM law \\citep{CCM89}. Since the SDSS\npipeline does not compute velocity dispersions for spectra with\nsignificant emission lines (as for some disk galaxies), we have also\nused the {\\it STARLIGHT} spectral fitting to compute our own velocity\ndispersion values.\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_Append_C.eps}\n  \\caption{This plot is used to determine a cutoff in ${\\rm \\langle\n      Age\\rangle_L}$, by demanding $(M_{\\rm dyn}/M_{\\star})\\geq\n    1$. Density contours replace the individual points, while\n    connected solid dots represent the median values in $(M_{\\rm\n      dyn}/M_{\\star})$ bins, with dashed lines outlining the\n    one-$\\sigma$ RMS dispersion around the median. At $(M_{\\rm\n      dyn}/M_{\\star})$ = 1.0, a rather conservative ${\\rm \\langle\n      Age\\rangle_L} + 1\\sigma$ = 9.05 Gyr cutoff value has been\n    obtained.}\n  \\label{fig:contamina}\n\\end{figure}\n\nFigure~\\ref{fig:contamina} shows the relation between the ${\\rm\n  \\langle Age\\rangle_L}$ and the $M_{\\rm dyn}/M_{\\star}$ ratio for a\nmixed sample of our compact cores and reference ellipticals (29,482). Individual points have been replaced by density contours and the connected solid dots\nrepresent the median values in bins of $M_{\\rm dyn}/M_{\\star}$, with\ndashed black lines outlining the one-$\\sigma$ RMS dispersion around\nthe median. The relation supports the idea that unphysical\n$M_{\\rm dyn}/M_{\\star}<1$ values are connected to low ${\\rm \\langle\n  Age\\rangle_L}$ values, i.e. disk contamination.  A rather\nconservative cut has been worked out to prevent core contamination, by\nselecting the ${\\rm \\langle Age\\rangle_L} + 1\\sigma = 9.05$\\,Gyr at\nwhich the $M_{\\rm dyn}/M_{\\star}$ ratio becomes larger than unity. \n\n\n\\section{Alternative morphology results}\n\\label{app:morpho}\n\n Figure~\\ref{fig:morphology} displays one of the most important results of the present study. However, an alternative perspective to that result is presented here. using $M_{\\star,{\\rm core}}$ instead of the $M_{\\star,{\\rm host}}$. In this case, Figure~\\ref{fig:morpho_Mcore}, the plot shape does not change substantially, but it is roughly shifted with respect to those using $M_{\\star,{\\rm host}}$. The mean $\\log(M_{\\star,{\\rm host}})-\\log(M_{\\star,{\\rm core}})$ is 0.25 dex, so morphology fractions of host galaxies with cores in the $\\log(M_{\\star,{\\rm core}}) = 10.75-11$ bin should be compared with those in the $\\log(M_{\\star,{\\rm host}})=11-11.25$ bin. It is worth emphasising that the integrated results of Figure~~\\ref{fig:morpho_Mcore} are identical to those in Table~\\ref{tab:morphoType}, because the integration mixes all the galaxies with either $\\log(M_{\\star,{\\rm host}})$ or $\\log(M_{\\star,{\\rm core}}) \\geq$10.5.\n\n\\begin{figure*}\n  \\includegraphics[scale=0.6]{plot_morpho_cores.eps}\n  \\caption{A similar plot to Figure~\\ref{fig:morphology}, but using compact core mass $M_{\\star,{\\rm core}}$ as the x-axis. Morphology refers to the host galaxies while mass corresponds to the compact cores.}\n  \\label{fig:morpho_Mcore}\n\\end{figure*}\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\bsp\t\n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 46573, "prevtext": "\nwith a fixed virial constant $K=5$ deduced by \\cite{Cap06} for the ETGs.  \n\nIn Figure~\\ref{fig:veldisp}, we show the $\\sigma$ comparison between three different samples. First, 2,548 compact cores selected according to the vDokkum15 compactness criterion and filtered for disk light contamination, as explained in Appendix~\\ref{app:contamina}. Second, the reference elliptical galaxies defined in \\S\\,\\ref{sec:ellipt} also filtered  for light contamination from young stellar populations (8,090 objects) and third, the 28 red nuggets in the redshift slice 1$< z \\leq$1.8, with available $\\sigma$ observation and $M_{\\rm dyn} > M_\\star$. From Figure~\\ref{fig:veldisp} we can deduce that compact cores and red nuggets are clearly segregated from normal ellipticals. \n\nThe mass-density relation is presented in Figure~\\ref{fig:Mdyn} with\nmedian values of compact cores (blue solid triangles) and elliptical galaxies (red solid dots). Again, the small red nugget sample (28) is represented by individual black squares and a corresponding linear fit dashed line. Once again, the relative match between the  compact cores and red nuggets should not come as a surprise, but as a natural consequence of sharing the same compactness criterion. In fact \\cite{vD15} show that their compactness criterion corresponds to log$({\\rm \\sigma_{predicted}/km\\  s^{-1}})>$ 2.40. \n\n\n\\subsection{Number Densities}\n\\label{sec:numberdens}\n\nIn this section we compare the abundance of red nuggets at $z\n\\sim 1.5$ with that of $z\\sim 0.1$ compact cores. In \\S\\,\\ref{sec:compl}, we have emphasised the sensitivity of the number density to the choice of\na compactness criterion and the probed mass range, consequently, any number density comparison must be carried out based on given compactness and mass-selection criteria.  We carry out a detailed comparison, by taking advantage of the three available studies on the evolution with redshift of the red nugget abundance \\citep[]{Barro13,vdW14,vD15}. \n\n\n\\begin{figure}\n  \\includegraphics[width=\\columnwidth]{plot_massfunction.eps}\n  \\caption{Compact core Mass Function for the three alternative Barro13, vdWel14 and vDokkum15 compactness criteria. Each function spans the range between the upper and lower sample limits, as defined in the text. The lower mass cuts are tied to each compactness criteria definition.}\n  \\label{fig:MF}\n\\end{figure}\n\n\n\\begin{table*}\n  \\caption{Upper and lower number density limits (column 3) for galaxy cores with different compactness criteria and mass ranges. Maximum number densities for red nuggets (column 4) have been extracted from the literature.}\n\\label{tab:numberdens}\n\\centering\n\\begin{tabular}{ | l | c | c | c }\n\\hline\n\\multicolumn{2}{c}{Compactness criteria} & \\multicolumn{2}{c}{Number density}\\\\\nReference & Mass range & Compact cores & Red nuggets \\\\\n &  & low-up limits & maximum \\\\ \\hline\n & $\\log(M_{\\star,{\\rm core}}/{\\rm M}_\\odot$) & [10$^{-4}\\ {\\rm Mpc}^{-3}$] & [10$^{-4}\\ {\\rm Mpc}^{-3}$]\\\\ \\hline\nBarro13 & $\\geq$ 10.00 & 1.73 - 3.12 & 2.4 $\\pm$ 1.0 \\\\ \nvdWel14 & $\\geq$ 10.70 & 0.40 -  0.78 & 1.7 $\\pm$ 0.2  \\\\ \nvDokkum15 & $\\geq$ 10.60 & 0.28 - 0.72 & 1.4 $\\pm$ 0.1 \\\\ \\hline\n\\end{tabular}\n\\end{table*}\n\nWe make use of the three compact core samples defined in \\S\\,\\ref{sec:compl} and Table~\\ref{tab:subs} in the 8,032\\,deg$^2$ area coverage of the SDSS-DR7 Legacy Survey \\citep{Aba09}. Compact core Mass Functions (MF) have been computed for each compactness criteria and shown in Figure~\\ref{fig:MF}. As stated in Appendix~\\ref{app:compl}, V/Vmax volume corrections are applied to account for any residual incompleteness in our samples. Our Vmax calculation follows similar procedures as in \\citet{Sim11,Shen03} and Mass Functions are calculated for the redshift range $0.025 \\leq z \\leq 0.15$. Differences among the three MFs can be understood based on the compactness criteria illustrated in Figure~\\ref{fig:compactness}, where one can see, for instance, that the vDokkum15 criteria are more restrictive, at all but at high-masses, than those of Barro13 and vdWel14. As mentioned in \\S\\,\\ref{sec:compl}, the selections in Table~\\ref{tab:subs} provide lower limits for the number density. We have worked out corresponding upper limits by reinstating some systems that were excluded when creating the pure sample (due to disk inclination, core elongation, image resolution or Type-4 anomalous decomposition). For instance, filtering by core elongation will exclude genuine compact cores coexisting with bars. The final number of compact cores in the upper limit samples is: 153,038 for Barro13, 25,426 for vdWel14 and 21,830 for vDokkum15 criteria. Figure~\\ref{fig:MF} displays the three Mass Functions represented as a band enclosed between the upper and lower limit MFs (black connected dots). \n\nThe lower and upper number density limits can be compared with those for red nuggets, at different redshifts. Solid dots with error bars in Figure~\\ref{fig:numberdensity} are extracted form the published plots in \\citet[Figure 5]{Barro13}, \\citet[Figure 13]{vdW14} and \\citet[Figure 19]{vD15}. Dark shaded horizontal bands in Figure~\\ref{fig:numberdensity} correspond to the upper and lower limit compact core number density at z$\\sim$0.1, stretched along the width of the plot to aid the comparison with the red nuggets. These values correspond to the integral of the upper and lower limits of the mass functions in Figure~\\ref{fig:MF}. Results are also reported in Table~\\ref{tab:numberdens}. \n\nFigure~\\ref{fig:numberdensity} also plots the number density of the bona-fide ellipticals at z$\\sim$0.1 that satisfy, as a whole, the compactness criteria (see dash-shaded region), as well as the number density of $z \\sim 0.1$ compact cores residing only in ellipticals (with respect to other galaxy types). The density of compact ellipticals is further discussed in \\S\\,\\ref{sec:discussion}. The low abundance of ellipticals hosting a compact core, with respect to the number density of red nuggets, would refute any proposal that the centre of present-day ellipticals may be the {\\bf only} evolutionary path for red nuggets.\n\n\\begin{figure*}\n  \\centering\n  \\includegraphics[width=\\textwidth]{plot_number_density.eps}\n  \\caption{Evolution with redshift of the number density of massive quiescent compact galaxies for the three alternative compactness criteria. The solid dots with error bars are extracted from : Figure 5 of Barro et al. (2013); Figure 13 of van der Wel et al. (2014) and Figure 19 of van Dokkum et al. (2015). Our compact core number density results are represented by a shaded dark grey band confined between the upper and lower limits discussed in the text. Although our result corresponds to redshift $\\sim$ 0.1, the band is stretched along the full redshift range to aid the comparison with the high redshift data. The Figure also plots the number density of elliptical galaxies hosting a compact core, shown as a small shaded rectangle at redshift $\\sim$ 0.1. Secondly, the number density of entire galaxies, at z $\\sim$ 0.1, satisfying the compactness criterion, is shown as a dashed shaded band}\n  \\label{fig:numberdensity}\n\\end{figure*}    \n\n\nFrom Figure~\\ref{fig:numberdensity} we can conclude that the $z\\sim 0.1$ compact core number density is comparable to that of red nuggets. In agreement with our results, recent cosmological hydrodynamical simulations on the evolution of red nuggets \\citep[]{Wellons15,Furlong15} conclude that only a fraction of them have survived by $z \\sim 0$. For instance, \\cite{Wellons15} find that: ``about half acquire an ex-situ envelope and exist as the core of a more massive descendant, 30\\% survive undisturbed and gain very little mass...''\n\n\n\\subsection{Morphology}\n\\label{sec:morpho}\n\nThe morphological class of the galaxies\nhosting compact cores contains information relevant to our study. The \\cite{HC11} catalogue provides the\nautomated morphological classification of the SDSS DR7 spectroscopic\nsample, giving the probability P(E), P(S0), P(Sab) and P(Scd) of each\ngalaxy type. These probabilities can be converted into the T-type\nclassification scheme of \\cite{NaAb10} with the simple linear model\ncomputed by \\cite{Meert15},\n\n", "index": 13, "text": "\\begin{equation}\n    {\\rm Ttype} = -4.6P({\\rm E})-2.4P({\\rm S0})+2.5P({\\rm Sab})+6.1P({\\rm Scd})\n\t\\label{eq:Ttype}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm Ttype}=-4.6P({\\rm E})-2.4P({\\rm S0})+2.5P({\\rm Sab})+6.1P({\\rm Scd})\" display=\"block\"><mrow><mi>Ttype</mi><mo>=</mo><mrow><mrow><mrow><mo>-</mo><mrow><mn>4.6</mn><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi mathvariant=\"normal\">E</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mn>2.4</mn><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>S0</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mn>2.5</mn><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>Sab</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mn>6.1</mn><mo>⁢</mo><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>Scd</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}]