[{"file": "1601.01737.tex", "nexttext": "\nwhere $c_s$ is the isothermal sound speed and $G$ is the gravitational\nconstant \\citep{stod63, ostriker64}.  This quantity depends only upon\nthe temperature and ionization state of the gas.  It is independent\nof the degree of concentration of the gas.\n\nThe sound speed at a temperature $T$ is\n\n", "itemtype": "equation", "pos": 16807, "prevtext": "\n\\label{firstpage}\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}}\n\\maketitle\n\n\\begin{abstract}\nUsing a cosmological simulation of the first gigayear \nof the universe, we find that\nthe mass per unit length of reionizing \nintergalactic filaments\nis proportional to the square of the sound speed with a\nproportionality constant equal to that predicted for a\ngravitationally bound, isothermal cylinder.  \nThese cylinders contain both gas\nand dark matter, and the dark matter contributes\nto the gravitational field roughly in proportion to \nits abundance.  The dark matter of each galaxy collapses\naccording to the cycloid predicted for spherically\nsymmetric collapse in an expanding universe.  In\ncontrast, the gas collapses more slowly into the \ncentre of the galaxy.   After  \nreionization filaments persist and, in some cases,\nbecome enriched in either gas or dark matter.  \nWe have incorporated these\nfindings into a unified model.  A key feature of\na gravitationally bound, isothermal cylinder is that\nthe mass per unit length depends only upon the\ntemperature and ionization state of the gas.  This\nproperty suggests a lower limit on the sizes of \ngalaxies that can form from a filamentary precursor.\nThe model may relate to outstanding\nproblems in galaxy formation and reionization.\n\\end{abstract}\n\n\\begin{keywords}\ncosmology: theory\n--\ngalaxies: formation\n--\ngalaxies: intergalactic mediium\n--\ncosmology: dark ages, reionization, first stars\n--\ngalaxies: structure\n--\ngalaxies: haloes\n\n\\end{keywords}\n\n\\section{Introduction}\n\\label{intro}\n\nThe two-stage model of \\citet{white78} \nfor galaxy formation\nhas survived as a general paradigm, in which\nthe overall architecture of the universe is\nformed by the potential wells formed by the collisionless\ngravitation of the dark\nmatter.  The luminous structures that are observed result\nfrom dissipational processes of the baryons trapped within\nthese wells.\n\nThis paradigm has justified the extensive use of N-body\nsimulations using only dark matter to understand structure\nformation (see, for example, the Millenium Simulations:\n\\citet{springel05,boylan-kolchin09}).\n\nHowever, in a cosmological simulation of the first gigayear \nthat contains both gas and dark matter, we find\nthat the structure of intergalactic filaments\nvaries with the speed of sound of the gas in a\nmanner predicted for a gravitationally bound, isothermal\ngas cylinder.  This relation holds despite the fact that \ntypically 84\\% or more\nof the filament mass is dark matter at this stage.\n\nThis finding, in conjunction with the very different motions\nfor gas and dark matter seen in our simulation,\nargues against a\npicture in which the gas is a passive passenger in a dark\nmatter potential well.   Rather the structure is better described\nas an isothermal gas cylinder with intermixed dark matter contributing\na proportionate amount to the gravitational field. \n\nIn a previous paper \\citep{harford08} \nwe suggested that the inclusion of gas\nphysics in the simulation led to the appearance of baryon\ndominated sheets\nand filaments, whose structures differed considerably from those\nassumed by the dark matter.  We argued that the baryon-rich\nfilaments were best explained as gravitationally bound,\nisothermal gas cylinders \\citep{harford11}.\n\nOur previous structural studies were done at a \nredshift of 5.135, shortly after the first gigayear, \nand were restricted to just those \nfilaments highly enriched in baryons \\citep{harford11}.\n\nIn the present study we examine the 1200 largest galaxies present in\nthe simulation\nat this redshift and trace their development back in time.  We\nfind the best match to an isothermal structure \noccurs during reionization\nwhen the baryon fraction is close to the cosmic value.  Baryon enrichment \nemerges later. \n\nWe present a unified model in the context of a simple\nscheme for galaxy formation in which the dark matter\ncollapses according to collisionless theory while the gas\ntends to remain in extended cylinders.\n\nA key property of an isothermal\ncylinder, which may have ramifications for understanding\nearly galaxy formation, is that the mass per unit length\ndepends only upon the temperature and ionization\nstate of the gas through the sound speed \\citep{stod63, ostriker64}.\nIt is interesting to speculate that collapsing overdensities \nwith too little mass may be unable to form gaseous galaxies\nvia a filamentary precursor.  In this way our model might be\nrelevant to the so-called ``missing satellite'' problem\n\\citep{kauffmann93}.\nThis refers to the discrepancy\nbetween the observed number of satellite galaxies \nof the Milky Way and the predicted number of\ndark matter haloes from dark matter only\nsimulations.\n\nIn any event, our results underscore the asymmetric distribution\nof gas around collapsing galaxies during the first gigayear.\nThe ability of an ionizing photon to escape from its\npoint of origin surely depends upon the quantity and geometry\nof this gas. \n\nMost studies on intergalactic filaments have dealt \nwith larger, hotter\nstructures at later times in a more complex universe.  In contrast,\nthe temperature during the first gigayear rarely exceeds \n$10^{5}{\\mbox{\\,{K}}}$ in our simulation, which contains primarily\ngalaxies\nwith total mass (dark matter, gas, and stars) less than \n$10^{11}{\\mbox{\\,{M}}}_\\odot$.\nOur study suggests that the intergalactic filaments\nassociated with small galaxies during the first \ngigayear may be a\nrelatively simple model system to study.\n\n\\section{Rationale and Overview of the Model}\n\\label{overview}\n\nIn our previous simulation studies we noted that\nat a redshift of 5.135 the gas and dark matter \nappear very different to the eye \\citep{harford08}.  \nIndividual, quasi-spherical blobs of dark matter\ncan be seen connected by long, thin, \nrelatively smooth filaments of gas.  Many of the \nfilaments appeared to have little dark matter, and\nthe dark matter that was present appeared to be \nmuch more\nclumpy than the gas.  In a subsequent study we showed\nthat the gas in these baryon dominated filaments\nhad gravitational potential profiles consistent \nwith their being\ngravitationally bound, isothermal cylinders\n\\citep{harford11}.\n\nIn the present study we have examined the structures\nof filaments at earlier redshifts.  We find that\ngas enrichment of filaments occurs only \nlate in the first gigayear.  Nevertheless, \nthe filamentary gas at early times still\nappears smoother than the dark matter, suggesting\na possible continuity of structure throughout\nthe first gigayear.\n\n     \\begin{figure}     \\begin{center}    \\leavevmode     \\includegraphics[scale=0.45]{image1a.eps}     \\includegraphics[scale=0.45]{image1b.eps}     \\end{center}     \\caption[1]{     \\label{hired}      \\begin{bfseries}{Gas and Dark Matter of a Collapsing Galaxy at Redshift 8.9.}\\end{bfseries}      The gas and dark matter are shown in separate images, each of which     is a projection on to the page of a sphere     having a comoving radius of 266 kpc     centred on the centre of collapse.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}    \\leavevmode     \\includegraphics[scale=0.45]{image2a.eps}     \\includegraphics[scale=0.45]{image2b.eps}     \\end{center}     \\caption[1]{     \\label{baryrich}      \\begin{bfseries}{Visualization of Separation of Gas and Dark Matter.}\\end{bfseries}      Shown are the gas and dark matter surrounding      the centre of collapse     at redshift 5.135 of the galaxy shown in Figure~\\ref{hired}.     As in that figure, gas and dark matter are shown in separate      images, each of which     is a projection on to the page of a sphere     having a comoving radius of 266 kpc     centred on the centre of collapse.         }     \\end{figure} \n\nFigure~\\ref{hired}  and Figure~\\ref{baryrich} show the\ncentre of collapse of the same galaxy at redshifts of\n8.9 and 5.135 respectively.  The gas and \ndark matter are shown separately in each figure.\nThe gas appears as a smooth rod at both times.\nThe dark matter at the earlier time is spread out\nalong the gas although it is not as smooth as the\ngas.  At the later time the dark matter\nhas collapsed into quasi-spherical blobs.\nFrom these findings we develop in this paper a model\nfor the formation of these structures.\n\nThe model views intergalactic filaments \nas intermediate structures in the\ncollapse of matter to form galaxies.\nA simple paradigm for gravitational collapse \nbegins with\ncollapse in one dimension to produces a plane,\nFurther collapse in a second dimension is expected \nto produce a rod, which\nthen collapses in the third dimension to a \nquasi-spherical ball.  Visual inspection of \nthe simulation\nsuggested that this paradigm would be a good starting point.  \n\nWe hypothesize that the rods are gravitationally\nbound, isothermal cylinders of gas with \ndark matter mixed in, at least initially. \nThe model postulates that\nthe dark matter collapses as a collisionless fluid\nleaving behind the gas, which\nis retarded by the hydrodynamic constraints \nof the isothermal cylinder.   As a result the cylinder\nmay become enriched in gas.\n\nWe have studied the formation of the 1200 largest\ngalaxies identified in our simulation at a redshift\nof 5.135.  In the remainder of the paper we will show:\n\n(1)  The majority of the galaxies are associated with\none or two filaments at least some of the time.\n\n(2) Where more than one filament is present, the\ntwo most massive ones tend to be oriented end to end\nas if they were part of a single structure.\n\n(3)  In the known mathematical structure of a \ngravitationally bound, isothermal cylinder\nthe mass per unit length depends only upon\nthe square of the sound speed, which in turn\ndepends only upon the temperature and ionization\nstate of the gas and not upon its concentration.  \nWe will show that for a  range of\nsound speeds the mass per unit length of the\nfilaments is linearly proportional to the square\nof the sound speed with a proportionality constant\nequal to that predicted by theory.\n\n(4)  The dark matter of the galaxies follows the\ntheoretical\ncycloid model for the collapse of a spherically\nsymmetric overdensity in an expanding universe.\n\n(5)  The gas associated with the dark matter at\nturnaround generally collapses toward the\ncentre more slowly than does the dark matter.\n\n(6)  The gas fraction of the filaments increases\nas the dark matter collapses toward the centre of\nthe galaxy.   Filaments with a cosmic ratio of\ngas and dark matter result when insufficient\ntime has elapsed since turnaround.\n\n(7) Retarded gas collapse toward the galaxy centre\nis associated with\nbaryon deficits in the galaxies at redshift 5.135.  \n\n\\section{Results}\\label{results}\n\nWe have studied\ngalaxy formation in the first gigayear of the universe\nusing a\nhigh resolution cosmological simulation containing\ndark matter, gas, star formation, chemistry, and \na self-consistent treatment of radiation and \nreionization.  \\footnote{Self-consistent means that\nthe ionization is computed from the radiation issuing\nfrom the actual sites of star formation.}\n\nThe dark matter is followed with an N-body\ncomputation in which the positions of the\nindividual dark matter particles can be followed\nthroughout the simulation.  The gas particles are\ngenerated anew after each time step for which a\nhydrodynamic computation on the underlying,\ndeformable grid is made.  \n\nWe have studied the development of the 1200\nlargest galaxies that are identified at a redshift\nof 5.135 at the end of the simulation.  The dark\nmatter particles associated with each of these\ngalaxies are\nidentified and used to trace the bulk motion\nof the collapsing galaxy.\n\n\\subsection{Identification of Filament Segments}\\label{filident}\n\nTo determine how well the model of Section~\\ref{overview}\ndescribes the simulation\nwe sought to identify rods of gas extending from the centres\nof the collapsing dark matter of the galaxies.\nSuch a structure would be characterized by\na preferential accumulation of gas in particular directions.\n\nIn the present paper we take advantage of the fact that\nthe gas surrounding the centre of collapse is largely a\nplanar slab.  Thus we examine the mass of gas in sectors\nof an annulus whose centre\nis at the center of collapse of the dark matter.  \nThe plane is determined \nby a principal component analyis of the gas in a sphere \nof radius 266.4 comoving kiloparsecs around\nthe centre of collapse of the galaxy.  \nWe define the centre of collapse of a galaxy at any given \ntime as the centre of mass of the dark matter particles\nthat will comprise the dark matter component of the\ngalaxy as identified at the end of the simulation at at\na redshift of 5.135.  Unlike the gas particles,\nindividual dark matter particles can be traced throughout\nthe simulation.  \n \nWe define a sector to contain a segment of a filament if\nits gas mass is greater than twice the average over\nall the sectors of the annulus.  Adjacent sectors\nsatisfying this criterion were merged \nto form a single segment.\nThe orientation of the segment\nis then determined more precisely using a principal \ncomponent analysis as described in Section~\\ref{methods}.\n \nThe filament identification process is completely defined by\nour algorithm, which is explained in more detail in the Appendix.  \nThere are no subjective elements.  The existence\nand locations of the galaxies at redshift 5.135 were determined\nfrom the galaxy finding program, \nDENMAX (\\citep{bertschinger91}).  \n\nOur algorithm identifies\nvisually clear segments that are usually part of\nlonger filaments extending radially\nfrom the centre of collapse.   Also identified, and therefore\nincluded in our analysis, are structures that may not be\nreadily identified or interpreted by eye.    \n\nFilaments were identified\nat six redshifts:  8.90, 8.09, 7.33, 6.69, 5.85, and 5.135,\ncorresponding to 0.57, 0.64, 0.73, 0.83, 0.98, and 1.16\ngigayears after the big bang.  These times correspond to\nscale factors of 0.101, 0.11, 0.12, 0.13, 0.146, and 0.163\nrespectively.\n\n\\subsection{Number and Alignment of Filaments}\nIf the filaments in the simulation correspond \nto the rods of the model,\nwe might expect to see for each galaxy two filaments\nprotruding from the centre of the galaxy that are roughly\naligned end-to-end.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{peak.eps}     \\end{center}     \\caption[1]{     \\label{numpeak}      \\begin{bfseries}{Number of Rods per Galaxy.}\\end{bfseries}      Data are shown for each of the six redshifts studied:     8.90 (black, filled circles),     8.09 (green X's), 7.33 (red squares), 6.69 (dull green triangles),     5.85 (orange diamonds), and     5.135 (blue stars).     }     \\end{figure} \n\nFigure~\\ref{numpeak}. shows that\nthe number of segments \nidentified for each galaxy is generally no more than two.\nThe six different curves are histograms of the number of\nsegments for a galaxy at the six redshifts studied.\nIn keeping with the model, in the few cases where more\nthan two were found, only the two most\nmassive were retained for further analysis.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{angle.eps}     \\end{center}     \\caption[1]{     \\label{peakalign}      \\begin{bfseries}{Angle Between Filament Segments.}\\end{bfseries}      Black, solid line with squares shows a histogram of the angle      between the two segment directions in cases where two are found.     Red, dotted line with triangles shows the same results when     the entries have     been weighted by the reciprocal of the sine of the angle.      }     \\end{figure} \n\nWhen two segments are\npresent at the same time for a galaxy,the preferred angle \nbetween their directions is close to 180 degrees,\nas if the segments were part of a single, straight rod passing\nthrough the centre of collapse.\nThis finding dovetails\nnicely with the simple paradigm for successive collapse in three\ndimensions. \n\nThe black, solid line with squares in Figure~\\ref{peakalign}\nshows a histogram of the angles between the directions of\npairs of segments.  Results for the six redshifts have been\npooled, since the individual results are very similar.  The red,\ndotted line with triangles shows the same histogram with\nentries weighted by the reciprocal of the sine of the angle.\nThis latter plot is suited to a situation in which the two\nfilaments are assumed to come together in three dimensions\nrather than forming within a predetermined plane.  \n\nIn this paper, for clarity,\nwe call each rod protruding from the centre of the\ngalaxy a filament\neven though it is attractive theoretically to envision\nthe collapse of a\nsingle filament passing through the centre of the galaxy.\n\n\\subsection{Isothermal Cylinders}\n\\label{isocylinders}\n\nThe mass per unit length predicted for a gravitationally bound, \nisothermal gas cylinder is computed from\n\n", "index": 1, "text": "\\begin{equation}\n\\label{isoequation}\n\\frac{2 c_s^{2}}{G}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{2c_{s}^{2}}{G}\" display=\"block\"><mfrac><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>c</mi><mi>s</mi><mn>2</mn></msubsup></mrow><mi>G</mi></mfrac></math>", "type": "latex"}, {"file": "1601.01737.tex", "nexttext": "\nwhere $k$ is the Boltzmann constant, $m_H$ the mass\nof the hydrogen atom, and $\\mu$ a mean particle mass to\ntake into account the ionization of the hydrogen.\nThe factor of 1.22 corrects for the\ncontribution of helium to the mean atomic weight.\n\nAlthough in theory the cylinder extends to infinity\nin the transverse direction,\nwe expect most of the mass to be present within\nsix proper kpc of the axis as deduced from the \nisothermal profiles we have found from the potential fields \nfor some of the segments \\footnote{The early filaments tend\nto have less gas than the later ones.  Consequently, we did\nnot consider it feasible to compute potential profiles for\nall the filament segments.}.\n\nThe presence of dark matter adds gravitational field without any\nadditional pressure.  We have considered two ways of\nincorporating dark matter into the model.\nIn the first,  the gas and dark matter are uniformly mixed.\nThis scheme is an idealization, of course, to facilitate\ncomputation.  The mass per unit length of the gas\nis simply reduced by the gas fraction of the filament.    \nThe total mass per length, including both gas and dark matter,\nremains the same as for the cylinder with only gas. \n\nA contrasting scheme assumes an all-gas cylinder as might\nbe found if the gas were to fall into a dark matter\npotential well having a low dark matter gradient at the\ncentre.\n\nAs will be seen in section~\\ref{filstructure}, the data are more \nconsistent with the first scheme than\nwith the second \\footnote{The very small amounts of stellar\nmaterial in the filaments have been ignored.}.\n\nBoth schemes differ from a simple\npicture in which gas traces dark matter.  In the first scheme\nthe total mass per unit length is constrained by the sound speed.\nAn increase in dark matter means a decrease in gas.  In the\nsecond scheme, the total mass per unit length of the filament \nis not constrained, but the total gas is.\n\nThe identification of the filament segments takes place in\ncomoving coordinates.  The structure of the segments are\ncompared to the model in proper coordinates. \n\nThe axis of each filament segment selected in \nsection~\\ref{filstructure} was determined more precisely\nusing a principal component analysis of the gas.  For structural\nstudies we analyzed the gas within a 12 proper kpc length\ncentred on the centre of  the segment.  A cylinder of radius\n6 proper kpc was considered.\n\nFor the remaining galaxies, to be considered eligible for\nfurther structural analysis, a\nsegment must pass a ``range'' test.  For this test the 12 kpc long \ncylinder is divided into three equal parts along its length. \nThe mass of gas within each part is\nrequired to be within 20\\% of the average of the three parts.\nThis test is designed to eliminate distortions such as might\nbe caused by local sub-galaxies or misalignment artifacts.\n\n\nThe segments from\n9.4\\% of the galaxies were discarded because their\nradius of influence was too small to encompass at least one\nhalf of a segment.  The radius of influence is defined as the\nturnaround radius in comoving coordinates. \nOf the remaining galaxies the fractions\nhaving at least one segment passing the\n``range test'' are 0.22, 0.21, 0.27, 0.34, 0.35,\nand 0.37 for redshifts 8.90, 8.09, 7.33, 6.69,\n5.85, and 5.135 respectively.   Sixty-six percent have at\nleast one segment at some redshift passing the test.\n\n\\subsection{Filament Structure}\n\\label{filstructure}\n\nWe present the structure of the\nfilaments using the square of the sound speed as a proxy for time.\nThis scheme accomodates the possibility that different\nfilaments are at different stages of development \nat the same time.  The sound speed depends only upon the\ntemperature and ionization state of the gas.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{bleach.eps}     \\end{center}     \\caption[1]{     \\label{reionization}      \\begin{bfseries}{History of Reionization.}\\end{bfseries}      The scatter plot shows the course of reionization as a     function of the square of the sound speed (arbitrary units), which     increases with     time. The ordinate values are mean atomic mass of the     hydrogen ($\\mu$ in     equation~\\ref{soundspeedequation}). Individual     dots represent filament segments      during the six redshifts     (8.90: black; 8.09: green; 7.33: red;     6.69: dull green; 5.85: orange; and     5.135: blue).     }     \\end{figure} \n\nThe course of reionization of the filament segments is shown in\nthe scatter plot in Figure~\\ref{reionization}, which shows the change \nwith sound speed of the mean particle mass\nof the hydrogen atoms as they undergo reionization in the first\ngigayear.  Each\npoint is a filament segment at one of the six redshifts.\nIn this paper the square of the sound speed is always expressed in the\nsame arbitrary units to facilitate comparisons with the predictions\nof the model.  One unit corresponds to a sound speed of\n$12.9 {\\mbox{\\,{km}}} {\\mbox{\\,{s}}}^{-1}$.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{linear1.eps}      \\end{center}     \\caption[1]{     \\label{figcorr}      \\begin{bfseries}{Proportionality of Total Mass Per Unit Length to Square of     Sound Speed.}\\end{bfseries}      The symbols show the     average total (gas plus dark matter) mass      per unit length      for the filaments in each bin of sound speed squared.     The units are arbitrarily     chosen to illustrate the expectation of      proportionality for the model,     shown as the diagonal, dotted line with a      slope of one.       A value of one on the abscissa corresponds to      a sound speed of 12.9 ${\\mbox{\\,{km}}}$ ${\\mbox{\\,{s}}}^{-1}$.       A value of one on the     ordinate corresponds to      7.71 $\\times10^{7}$ ${\\mbox{\\,{M}}}_\\odot$ ${\\mbox{\\,{kpc}}}^{-1}$.     in proper units.     The bin size is 0.035.       The vertical line through each symbol represents     one standard error for the average of      the filaments in that     bin.  Each red square     represents a bin containing at least fifteen filaments.       The green triangles represent other bins having      at least     two filamens, for which a standard deviation can be      calculated.  The remaining orange, open      circles represent bins     with a single filament.     The bins with at least fifteen filaments apiece have a linear     regression line constrained to pass through the origin with a     slope of 1.04 $\\pm$ 0.12 with a P value of      1.7 $\\times10^{-19}$ and RSquared     of 0.96.  The probability that the residuals belong to a normal     distribution is 0.21.     }     \\end{figure} \n\nFigure~\\ref{figcorr} shows the average total mass per unit length\nof filament segments as a function of the square of the sound\nspeed.  The units of the axes have been chosen arbitrarily so that\nan isothermal cylinder will fall along a straight line with unit\nslope.  The total mass per unit length is computed by dividing\nthat for the gas by the gas fraction of the segment under the \nsimpifying assumption that the dark matter is uniformly\nintermixed with the gas and contributes proportionately \nto the gravitational field as described in the first scheme in\nSection~\\ref{isocylinders}.  The alternative scheme described there, \nin which the structure is effectively pure gas, would predict\nfor most segments\na mass per unit length greater by a factor of about five. \n\nThe linear regression line constrained to pass through the \norigin for the bins having at least fifteen\nmembers, shown by red squares, has a slope of 1.04 $\\pm$ 0.12.\nThe sparser bins to the right (green triangles) show only a \ngeneral upward trend consistent with prediction.  Orange\ncircles indicate bins with a single member.\n\nThe period of best agreement\nwith the model corresponds to the period of\nactive reionization, when the gas in the segments is partially\nionized.  During this period most of the\nchange in sound speed is due to reionization.  The temperature\nchanges little. \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{gas.eps}     \\end{center}     \\caption[1]{     \\label{timescattgfract}      \\begin{bfseries}{Gas Fraction as Function of Sound Speed.}\\end{bfseries}      Each black, dot represents an individual     filament segment, where the abscissa is the square of the     sound speed (arbitrary units), and the ordinate is the gas fraction.       The cosmic baryon fraction is     indicated by the red, dashed line. There is little stellar     material in the filaments at these times, and its presence     has been ignored.     }     \\end{figure} \n\nThe end of reionization  marks the beginning of a\nperiod of increasing deviation of the gas fraction from\nthe cosmic value as shown in the scatter plot in \nFigure~\\ref{timescattgfract}.   Each open circle represents\na filament segment.  Compare the pattern to the course of\nreionization in Figure~\\ref{reionization}.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{density.eps}     \\end{center}     \\caption[1]{     \\label{figcorrbden}      \\begin{bfseries}{Total Mass Per Unit Length as a Function of       Proper Density at Turnaround.}\\end{bfseries}      Proper density at turnaround on the abscissa is in units of      $10^{6}{\\mbox{\\,{M}}}_\\odot {\\mbox{\\,{kpc}}}^{-3}$.     Total mass per unit proper length     of the filament segment     on the ordinate is in the same arbitrary units as for     Figure~\\ref{figcorr} and Figure~\\ref{figcorrb}.     Single standard errors are shown as described in     the legend to Figure~\\ref{figcorr}.  The dotted, vertical     lines delimit the density range of the segments used to     generate Figure~\\ref{figcorrb}.     }     \\end{figure} \n\nAnother variable that might affect the filament structure\nis the proper density at turnaround.   \nFigure~\\ref{figcorrbden} shows\nthat the total mass per unit length does indeed increase with\ndensity at turnaround as one might expect.  Here the symbols\nagain indicate the population range of the bin.  To control\nfor density at turnaround, only the segments in the bins \nbetween the two\ndotted lines in Figure~\\ref{figcorrbden} \nwere selected to produce Figure~\\ref{figcorrb}, a\nrevised version of Figure~\\ref{figcorr}.  The results are almost\nidentical.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{linear2.eps}     \\end{center}     \\caption[1]{     \\label{figcorrb}      \\begin{bfseries}{Proportionality of Total Mass Per Unit Length to Square of     Sound Speed When Controlled for Density at Turnaround.}\\end{bfseries}      This figure is the same as Figure~\\ref{figcorr} except that the     filaments have been drawn from a restricted range of proper     density at turnaround, namely      3.0-5.0 $\\times10^{5}{\\mbox{\\,{M}}}_\\odot$ ${\\mbox{\\,{kpc}}}^{-3}$.     The symbols show the     average total (gas plus dark matter) mass per unit length      for the filament segments in each bin of sound speed squared.     The units are arbitrarily     chosen as described for Figure~\\ref{figcorr}.     Each red square     represents a bin containing at least fifteen segments.       The green triangles represent other bins having at least     two segments, for which a standard deviation can be      calculated.  The remaining orange, open circles represent bins     with a single segment.     The bins with at least fifteen segments apiece have a linear     regression line constrained to pass through the origin with a     slope of 1.03 $\\pm$ 0.13 with a P value of      7.1 $\\times10^{-18}$ and RSquared     of 0.96.  The probability that the residuals belong to a normal     distribution is 0.23.     }     \\end{figure} \n\n\n\n\\subsection{The Collapse of Dark Matter}\n\\label{darkcollapse}\n\nThe simplest\ntheory of galaxy formation in an expanding\nuniverse is that of the\ncollapse of a spherically symmetric \noverdensity.  This case can be solved analytically\nto give a cycloid profile of collapse with time\n\\citep{peacock99}.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{cycloid.eps}     \\end{center}     \\caption[1]{     \\label{excycloid}      \\begin{bfseries}{Spherical Collapse of Dark Matter of an Example Galaxy.}\\end{bfseries}       Average proper radius of galaxy dark matter particles as a     function of time after the big bang is plotted as a green     solid line with green filled circles.  The corresponding     cycloid is is shown by the solid black line.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{over.eps}     \\end{center}     \\caption[1]{     \\label{overden}      \\begin{bfseries}{Histogram of Overdensity at Turnaround.}\\end{bfseries}      The overdensity is computed for a spherical volume centred     at the centre of mass of the dark matter particles and     having a radius equal to the average radius of the dark     matter particles of the galaxy. The dark matter particles      of the galaxy are considered to be those that are associated      with the galaxy as defined by DENMAX at the end of the      simulation at a redshift of 5.135.  The theoretical prediction     of 5.55 \\citep{peacock99} is shown by the vertical dotted line.     Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.     }     \\end{figure} \n\nWe find this \ntheory to be an excellent starting point for understanding\nthe collapse of the dark matter of each galaxy.\nIn virtually every case\nthe average radius of a galaxy's dark matter particles,\nwhich can be followed throughout the simulation,\nfollows this profile until some time \nafter turnaround.  An example profile for a single galaxy \nis shown in\nFigure~\\ref{excycloid}.\nFor the portion of the profile before turnaround, the\nroot-mean-square deviation from theory ranges \nfrom 10 to 17 per cent. \n\nA histogram of the overdensity within the average radius at \nturnaround is shown in\nFigure~\\ref{overden}.   There is rough agreement\nwith the theoretical value of 5.55 \\citep{peacock99},\n indicated by the vertical\ndotted line.  This finding supports the interpretation for the\ndark matter collapse as the collapse of a spherically\nsymmetric overdensity.\n\nThe cycloids generally begin their rise close to or slightly \nprior to the beginning of the simulation.  This finding\nsuggests an origin for most of\nthe galaxies from the cosmic\nfluctuations imposed at the beginning of the\nsimulation as opposed to density variations resulting\nfrom subsequent events.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{time.eps}     \\end{center}     \\caption[1]{     \\label{timff}      \\begin{bfseries}{Histogram of Time of Turnaround After Big Bang.}\\end{bfseries}      Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.  The times for the     six redshifts are shown by the six corresponding symbols.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{radius.eps}     \\end{center}     \\caption[1]{     \\label{turnradff}      \\begin{bfseries}{Histogram of Average Turnaround Radius.}\\end{bfseries}      Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.     }     \\end{figure} \n\nA histogram of the turnaround times together with\nthe times of the six redshifts at which filament\nsegments were studied is shown in Figure~\\ref{timff}.\nFigure~\\ref{turnradff} shows a histogram of proper\nturnaround radii.  \n\n\\subsection{Contrasting Motion of Dark Matter and Gas}\n\\label{contrast}\n\nUnlike the dark matter particles, the individual gas particles \nin the simulation cannot be traced throughout the simulation.\nRather, the gas particles are\ngenerated anew after each hydrodynamic computation. \nSince the structures\nare continually moving and changing shape, it is difficult to pin down\ngas movements on a small scale.  \n\nWhat we can compute unambiguously is the overall\ncollapse of dark matter\nand gas around the centre of gravity of the dark\nmatter associated with each galaxy.   At each redshift\nwe compute for each galaxy as a function of time\nthe proper radius of that mass of gas or dark\nmatter that was present at turnaround within the \naverage radius at turnaround.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{solo.eps}     \\end{center}     \\caption[1]{     \\label{solo}      \\begin{bfseries}{Overall Collapse of Dark Matter and Gas.}\\end{bfseries}      Shown is the contrasting motion of dark matter (dotted, red lines)     and gas (solid green lines) toward the centre of the galaxy.     At a series of redshifts starting at turnaround the lines show the     progression of the radius of the amount of mass that was     within the average radius at turnaround.  The units for the     radius are in fractions of the turnaround radius.     Each graph is for a single galaxy.  These particular      galaxies were     chosen to illustrate the categories of results obtained     for all the galaxies considered.     }     \\end{figure} \n\nFigure~\\ref{solo}\nshows some individual galaxy histories that illustrate the types of results obtained.  The time shown is\nthe time since turnaround.\nIn all of the graphs the dark matter collapses faster than the gas.  In the\nthird graph the collapse of the gas is just balanced by the expansion\nof the\nuniverse.  In the fourth graph the collapse of the gas is outpaced by the \nexpansion of the universe.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{dark.eps}     \\end{center}     \\caption[1]{     \\label{massradius}      \\begin{bfseries}{Dependence of Collapse of Dark Matter on the     Total Mass of the Galaxy.}\\end{bfseries}      The radius of the mass of dark matter that is present     within the average radius of the dark matter particles at     turnaround is followed with time.  The fractional collapse      is defined as the     ratio of the radius at the end of the simulation to that at     turnaround.  The radii are considered in proper units.       Each symbol represents an individual galaxy,  Only     galaxies that have had at some time at least one     analyzable filament are included.  However,     the total galaxy population of $1200$ gives very similar     results.  Total     galaxy mass includes dark matter, gas, and stars at a      redshift of 5.135.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{ratio.eps}     \\end{center}     \\caption[1]{     \\label{massradrat}      \\begin{bfseries}{Ratio of Gas Collapse to Dark Collapse.}\\end{bfseries}      The graph shows the ratio of the fractional     collapse of the gas to that of the dark matter for the     same galaxy as a function of the total mass of the     final galaxy (dark matter, gas, and stars).       The fractional collapse for dark matter or     gas is defined in the legend to Figure~\\ref{massradius}.     Each symbol represents an individual galaxy,     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{bary.eps}     \\end{center}     \\caption[1]{     \\label{massradbf}      \\begin{bfseries}{Relation of Gas Collapse to the     Baryon Fraction of the Galaxy.}\\end{bfseries}      The graph shows the ratio of the fractional     collapse of the gas to that of the dark matter for the     same galaxy as a function of the baryonic fraction of the     final galaxy.     The radius of the mass of dark matter or gas that is present     within the average radius of the dark matter particles at     turnaround is followed with time.  The fractional collapse      is defined as the     ratio of the radius at the end of the simulation to that at     turnaround.  The radii are considered in proper units.       Each symbol represents an individual galaxy,  Only galaxies     that have had an analyzable filament at some time have been     included.     }     \\end{figure} \n\nThe three figures starting with Figure~\\ref{massradius}\nsummarize results for those galaxies that have filament\nsegments that we analyzed in Section~\\ref{filstructure}. \nWe define the fractional collapse on the\nordinate as the ratio in proper units of the\nradius of the turnaround mass at the end of the \nsimulation to the radius at turnaround.\n\nFigure~\\ref{massradius} shows the effect of the final mass\nof the galaxy (including dark matter,gas, and stars) on the\ncollapse of the dark matter.  The scatter plot for the\nindividual galaxies shows that the fractional collapse at the\nend of the simulation is roughly in accord with virial expectation, and\nis little affected by the mass of the final galaxy.  This is\nwhat we expect for collisionless particles subject only to\ngravitation.\n\nThe gas collapse is, however, quite different.\nFigure~\\ref{massradrat} shows the fractional collapse of\nthe gas in each of these galaxies divided by the \nfractional collapse of the dark matter in the same galaxy.\nThe gas generally collapses more slowly than the\ndark matter.  This makes\nsense if hydrodynamic forces within the isothermal cylinder\nare opposing the overall gravitational collapse of the gas. \n\nFigure~\\ref{massradrat} also shows that more massive galaxies \nhave faster gas collapse than smaller ones.   This finding\ncan also be understood in the context of an isothermal cylinder.  \nThe more massive the galaxy the more gas beyond the\nisothermal limit it will likely have.  This excess gas cannot be\naccomodated within the isothermal cylinder structure. \n \nAs might be expected, retarded gas collapse is associated with\nbaryonic deficits in the final galaxies as shown in \nFigure~\\ref{massradbf}.\n\n\\subsection{Separation of Gas and Dark Matter}\n\nWe have previously reported that a significant fraction of\nintergalactic filaments at a redshift of 5.135 are\nenriched in baryons, some highly so \\citep{harford08,harford11}.\n\\citet{harford08}.  An example is shown in Figure~\\ref{baryrich}.\nIn the present study we find that this effect develops\ngradually during the first gigayear, beginning for the most\npart after reionization as shown in Figure~\\ref{timescattgfract}.\n\n     \\begin{figure}     \\begin{center}         \\leavevmode     \\includegraphics[scale=0.45]{leave.eps}     \\end{center}     \\caption[1]{     \\label{collapsegf}      \\begin{bfseries}{Dark Matter Leaves Gas Behind to Produce     Baryonic Enrichment of Filaments.}\\end{bfseries}    The graph shows the average gas fraction   of filament segments as a function of the fractional collapse   of the dark matter of the galaxy at the redshift of the segment.   Fractional collapse is defined and determined as specified in    Section~\\ref{contrast}.  Note that in this figure maximal   collapse is at the left and minimal collapse at the right.   Horizontal, dotted, red line indicates the cosmic gas fraction.     }     \\end{figure} \n\nWe suggest that this effect occurs when rapidly collapsing dark\nmatter effectively leaves behind the gas in the filaments.\nFigure~\\ref{collapsegf} shows the average gas fraction\nof filament segments as a function of the fractional collapse\nof the dark matter of the galaxy at the redshift of the segment.\nFractional collapse is defined and determined as specified in \nSection~\\ref{contrast}.  Note that in this figure maximal\ncollapse is at the left and minimal collapse at the right.\n\n\\section{Methods}\\label{methods}\n\nAs previously described \\citep{harford08,harford11}\nthe early universe was simulated from the big bang\nto a redshift of 5.135 with a\n``softened\nLagrangian hydrodynamics'' (SLH-P$^{3}$M) code \n\\citep{gnedin95,gnedin_bertschinger_96} with a flat $\\Lambda$CDM cosmology.\nThe cosmological parameters are  $\\Omega_{m} = 0.27$, $\\Omega_{b} = 0.04$, \n$\\sigma_{8} = 0.91$, and $h = 0.71$. \nGas dynamics are computed on a quasi-Lagrangian mesh, which deforms adaptively to\nprovide higher resolution in higher density regions.\n\nAn $8 h^{-1}$ comoving Mpc cube is represented by a \n$256 \\times 256 \\times 256$ grid.\nThe mass of the dark matter particle is  $2.73\\times10^{6}{\\mbox{\\,{solar masses}}}$\nThe mass of the gas particle is roughly\n$4.75\\times10^{5}{\\mbox{\\,{solar masses}}}$\nEach gas particle mass may be somewhat adjusted\naccording to the results of the hydrodynamic computation.\n\nThe galaxies were identified at the end of the simulation\nfrom the total mass distribution\nby DENMAX (\\citep{bertschinger91}). \nThe positions of the individual dark matter\nparticles associated with each of these galaxies can be\nfollowed throughout the simulation.\nFor a given galaxy defined by\nDENMAX at the end\nof the simulation, we define it\nat earlier times as the arrangement of its \nconstituent dark\nmatter particles at that time.  The centre of the\ngalaxy at any time is defined as the centre of mass\nof its dark matter particles.\n\nThis framework allows us to follow the collapse of \nthe dark matter particles with time and provides a moving\ncoordinate system for following the structure of the\nfilaments.   Since gas particles in the\nsimulation are computed from a mesh that is deformed \nhydrodynamically, we cannot follow the motion of individual\nones.\n\nFor convenience we define rhe radius of\ncollapse of a galaxy at a particular time \nas the average distance of its dark matter\nparticles from their centre of gravity.  We \nfind that this radius follows\nthe characteristic story of spherically \nsymmetric collapse in an expanding universe,\nnamely a period of orderly expansion followed by a\nperiod of contraction.   \n\nThe equations for the cycloid describing this collapse are\n\n", "itemtype": "equation", "pos": 17172, "prevtext": "\nwhere $c_s$ is the isothermal sound speed and $G$ is the gravitational\nconstant \\citep{stod63, ostriker64}.  This quantity depends only upon\nthe temperature and ionization state of the gas.  It is independent\nof the degree of concentration of the gas.\n\nThe sound speed at a temperature $T$ is\n\n", "index": 3, "text": "\\begin{equation}\n\\label{soundspeedequation}\nc_s = \\sqrtsign{\\frac{kT}{1.22\\mu m_H}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"c_{s}=\\sqrtsign{\\frac{kT}{1.22\\mu m_{H}}}\" display=\"block\"><mrow><msub><mi>c</mi><mi>s</mi></msub><mo>=</mo><msqrt><mfrac><mrow><mi>k</mi><mo>⁢</mo><mi>T</mi></mrow><mrow><mn>1.22</mn><mo>⁢</mo><mi>μ</mi><mo>⁢</mo><msub><mi>m</mi><mi>H</mi></msub></mrow></mfrac></msqrt></mrow></math>", "type": "latex"}, {"file": "1601.01737.tex", "nexttext": "\n\n", "itemtype": "equation", "pos": 42921, "prevtext": "\nwhere $k$ is the Boltzmann constant, $m_H$ the mass\nof the hydrogen atom, and $\\mu$ a mean particle mass to\ntake into account the ionization of the hydrogen.\nThe factor of 1.22 corrects for the\ncontribution of helium to the mean atomic weight.\n\nAlthough in theory the cylinder extends to infinity\nin the transverse direction,\nwe expect most of the mass to be present within\nsix proper kpc of the axis as deduced from the \nisothermal profiles we have found from the potential fields \nfor some of the segments \\footnote{The early filaments tend\nto have less gas than the later ones.  Consequently, we did\nnot consider it feasible to compute potential profiles for\nall the filament segments.}.\n\nThe presence of dark matter adds gravitational field without any\nadditional pressure.  We have considered two ways of\nincorporating dark matter into the model.\nIn the first,  the gas and dark matter are uniformly mixed.\nThis scheme is an idealization, of course, to facilitate\ncomputation.  The mass per unit length of the gas\nis simply reduced by the gas fraction of the filament.    \nThe total mass per length, including both gas and dark matter,\nremains the same as for the cylinder with only gas. \n\nA contrasting scheme assumes an all-gas cylinder as might\nbe found if the gas were to fall into a dark matter\npotential well having a low dark matter gradient at the\ncentre.\n\nAs will be seen in section~\\ref{filstructure}, the data are more \nconsistent with the first scheme than\nwith the second \\footnote{The very small amounts of stellar\nmaterial in the filaments have been ignored.}.\n\nBoth schemes differ from a simple\npicture in which gas traces dark matter.  In the first scheme\nthe total mass per unit length is constrained by the sound speed.\nAn increase in dark matter means a decrease in gas.  In the\nsecond scheme, the total mass per unit length of the filament \nis not constrained, but the total gas is.\n\nThe identification of the filament segments takes place in\ncomoving coordinates.  The structure of the segments are\ncompared to the model in proper coordinates. \n\nThe axis of each filament segment selected in \nsection~\\ref{filstructure} was determined more precisely\nusing a principal component analysis of the gas.  For structural\nstudies we analyzed the gas within a 12 proper kpc length\ncentred on the centre of  the segment.  A cylinder of radius\n6 proper kpc was considered.\n\nFor the remaining galaxies, to be considered eligible for\nfurther structural analysis, a\nsegment must pass a ``range'' test.  For this test the 12 kpc long \ncylinder is divided into three equal parts along its length. \nThe mass of gas within each part is\nrequired to be within 20\\% of the average of the three parts.\nThis test is designed to eliminate distortions such as might\nbe caused by local sub-galaxies or misalignment artifacts.\n\n\nThe segments from\n9.4\\% of the galaxies were discarded because their\nradius of influence was too small to encompass at least one\nhalf of a segment.  The radius of influence is defined as the\nturnaround radius in comoving coordinates. \nOf the remaining galaxies the fractions\nhaving at least one segment passing the\n``range test'' are 0.22, 0.21, 0.27, 0.34, 0.35,\nand 0.37 for redshifts 8.90, 8.09, 7.33, 6.69,\n5.85, and 5.135 respectively.   Sixty-six percent have at\nleast one segment at some redshift passing the test.\n\n\\subsection{Filament Structure}\n\\label{filstructure}\n\nWe present the structure of the\nfilaments using the square of the sound speed as a proxy for time.\nThis scheme accomodates the possibility that different\nfilaments are at different stages of development \nat the same time.  The sound speed depends only upon the\ntemperature and ionization state of the gas.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{bleach.eps}     \\end{center}     \\caption[1]{     \\label{reionization}      \\begin{bfseries}{History of Reionization.}\\end{bfseries}      The scatter plot shows the course of reionization as a     function of the square of the sound speed (arbitrary units), which     increases with     time. The ordinate values are mean atomic mass of the     hydrogen ($\\mu$ in     equation~\\ref{soundspeedequation}). Individual     dots represent filament segments      during the six redshifts     (8.90: black; 8.09: green; 7.33: red;     6.69: dull green; 5.85: orange; and     5.135: blue).     }     \\end{figure} \n\nThe course of reionization of the filament segments is shown in\nthe scatter plot in Figure~\\ref{reionization}, which shows the change \nwith sound speed of the mean particle mass\nof the hydrogen atoms as they undergo reionization in the first\ngigayear.  Each\npoint is a filament segment at one of the six redshifts.\nIn this paper the square of the sound speed is always expressed in the\nsame arbitrary units to facilitate comparisons with the predictions\nof the model.  One unit corresponds to a sound speed of\n$12.9 {\\mbox{\\,{km}}} {\\mbox{\\,{s}}}^{-1}$.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{linear1.eps}      \\end{center}     \\caption[1]{     \\label{figcorr}      \\begin{bfseries}{Proportionality of Total Mass Per Unit Length to Square of     Sound Speed.}\\end{bfseries}      The symbols show the     average total (gas plus dark matter) mass      per unit length      for the filaments in each bin of sound speed squared.     The units are arbitrarily     chosen to illustrate the expectation of      proportionality for the model,     shown as the diagonal, dotted line with a      slope of one.       A value of one on the abscissa corresponds to      a sound speed of 12.9 ${\\mbox{\\,{km}}}$ ${\\mbox{\\,{s}}}^{-1}$.       A value of one on the     ordinate corresponds to      7.71 $\\times10^{7}$ ${\\mbox{\\,{M}}}_\\odot$ ${\\mbox{\\,{kpc}}}^{-1}$.     in proper units.     The bin size is 0.035.       The vertical line through each symbol represents     one standard error for the average of      the filaments in that     bin.  Each red square     represents a bin containing at least fifteen filaments.       The green triangles represent other bins having      at least     two filamens, for which a standard deviation can be      calculated.  The remaining orange, open      circles represent bins     with a single filament.     The bins with at least fifteen filaments apiece have a linear     regression line constrained to pass through the origin with a     slope of 1.04 $\\pm$ 0.12 with a P value of      1.7 $\\times10^{-19}$ and RSquared     of 0.96.  The probability that the residuals belong to a normal     distribution is 0.21.     }     \\end{figure} \n\nFigure~\\ref{figcorr} shows the average total mass per unit length\nof filament segments as a function of the square of the sound\nspeed.  The units of the axes have been chosen arbitrarily so that\nan isothermal cylinder will fall along a straight line with unit\nslope.  The total mass per unit length is computed by dividing\nthat for the gas by the gas fraction of the segment under the \nsimpifying assumption that the dark matter is uniformly\nintermixed with the gas and contributes proportionately \nto the gravitational field as described in the first scheme in\nSection~\\ref{isocylinders}.  The alternative scheme described there, \nin which the structure is effectively pure gas, would predict\nfor most segments\na mass per unit length greater by a factor of about five. \n\nThe linear regression line constrained to pass through the \norigin for the bins having at least fifteen\nmembers, shown by red squares, has a slope of 1.04 $\\pm$ 0.12.\nThe sparser bins to the right (green triangles) show only a \ngeneral upward trend consistent with prediction.  Orange\ncircles indicate bins with a single member.\n\nThe period of best agreement\nwith the model corresponds to the period of\nactive reionization, when the gas in the segments is partially\nionized.  During this period most of the\nchange in sound speed is due to reionization.  The temperature\nchanges little. \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{gas.eps}     \\end{center}     \\caption[1]{     \\label{timescattgfract}      \\begin{bfseries}{Gas Fraction as Function of Sound Speed.}\\end{bfseries}      Each black, dot represents an individual     filament segment, where the abscissa is the square of the     sound speed (arbitrary units), and the ordinate is the gas fraction.       The cosmic baryon fraction is     indicated by the red, dashed line. There is little stellar     material in the filaments at these times, and its presence     has been ignored.     }     \\end{figure} \n\nThe end of reionization  marks the beginning of a\nperiod of increasing deviation of the gas fraction from\nthe cosmic value as shown in the scatter plot in \nFigure~\\ref{timescattgfract}.   Each open circle represents\na filament segment.  Compare the pattern to the course of\nreionization in Figure~\\ref{reionization}.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{density.eps}     \\end{center}     \\caption[1]{     \\label{figcorrbden}      \\begin{bfseries}{Total Mass Per Unit Length as a Function of       Proper Density at Turnaround.}\\end{bfseries}      Proper density at turnaround on the abscissa is in units of      $10^{6}{\\mbox{\\,{M}}}_\\odot {\\mbox{\\,{kpc}}}^{-3}$.     Total mass per unit proper length     of the filament segment     on the ordinate is in the same arbitrary units as for     Figure~\\ref{figcorr} and Figure~\\ref{figcorrb}.     Single standard errors are shown as described in     the legend to Figure~\\ref{figcorr}.  The dotted, vertical     lines delimit the density range of the segments used to     generate Figure~\\ref{figcorrb}.     }     \\end{figure} \n\nAnother variable that might affect the filament structure\nis the proper density at turnaround.   \nFigure~\\ref{figcorrbden} shows\nthat the total mass per unit length does indeed increase with\ndensity at turnaround as one might expect.  Here the symbols\nagain indicate the population range of the bin.  To control\nfor density at turnaround, only the segments in the bins \nbetween the two\ndotted lines in Figure~\\ref{figcorrbden} \nwere selected to produce Figure~\\ref{figcorrb}, a\nrevised version of Figure~\\ref{figcorr}.  The results are almost\nidentical.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.45]{linear2.eps}     \\end{center}     \\caption[1]{     \\label{figcorrb}      \\begin{bfseries}{Proportionality of Total Mass Per Unit Length to Square of     Sound Speed When Controlled for Density at Turnaround.}\\end{bfseries}      This figure is the same as Figure~\\ref{figcorr} except that the     filaments have been drawn from a restricted range of proper     density at turnaround, namely      3.0-5.0 $\\times10^{5}{\\mbox{\\,{M}}}_\\odot$ ${\\mbox{\\,{kpc}}}^{-3}$.     The symbols show the     average total (gas plus dark matter) mass per unit length      for the filament segments in each bin of sound speed squared.     The units are arbitrarily     chosen as described for Figure~\\ref{figcorr}.     Each red square     represents a bin containing at least fifteen segments.       The green triangles represent other bins having at least     two segments, for which a standard deviation can be      calculated.  The remaining orange, open circles represent bins     with a single segment.     The bins with at least fifteen segments apiece have a linear     regression line constrained to pass through the origin with a     slope of 1.03 $\\pm$ 0.13 with a P value of      7.1 $\\times10^{-18}$ and RSquared     of 0.96.  The probability that the residuals belong to a normal     distribution is 0.23.     }     \\end{figure} \n\n\n\n\\subsection{The Collapse of Dark Matter}\n\\label{darkcollapse}\n\nThe simplest\ntheory of galaxy formation in an expanding\nuniverse is that of the\ncollapse of a spherically symmetric \noverdensity.  This case can be solved analytically\nto give a cycloid profile of collapse with time\n\\citep{peacock99}.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{cycloid.eps}     \\end{center}     \\caption[1]{     \\label{excycloid}      \\begin{bfseries}{Spherical Collapse of Dark Matter of an Example Galaxy.}\\end{bfseries}       Average proper radius of galaxy dark matter particles as a     function of time after the big bang is plotted as a green     solid line with green filled circles.  The corresponding     cycloid is is shown by the solid black line.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{over.eps}     \\end{center}     \\caption[1]{     \\label{overden}      \\begin{bfseries}{Histogram of Overdensity at Turnaround.}\\end{bfseries}      The overdensity is computed for a spherical volume centred     at the centre of mass of the dark matter particles and     having a radius equal to the average radius of the dark     matter particles of the galaxy. The dark matter particles      of the galaxy are considered to be those that are associated      with the galaxy as defined by DENMAX at the end of the      simulation at a redshift of 5.135.  The theoretical prediction     of 5.55 \\citep{peacock99} is shown by the vertical dotted line.     Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.     }     \\end{figure} \n\nWe find this \ntheory to be an excellent starting point for understanding\nthe collapse of the dark matter of each galaxy.\nIn virtually every case\nthe average radius of a galaxy's dark matter particles,\nwhich can be followed throughout the simulation,\nfollows this profile until some time \nafter turnaround.  An example profile for a single galaxy \nis shown in\nFigure~\\ref{excycloid}.\nFor the portion of the profile before turnaround, the\nroot-mean-square deviation from theory ranges \nfrom 10 to 17 per cent. \n\nA histogram of the overdensity within the average radius at \nturnaround is shown in\nFigure~\\ref{overden}.   There is rough agreement\nwith the theoretical value of 5.55 \\citep{peacock99},\n indicated by the vertical\ndotted line.  This finding supports the interpretation for the\ndark matter collapse as the collapse of a spherically\nsymmetric overdensity.\n\nThe cycloids generally begin their rise close to or slightly \nprior to the beginning of the simulation.  This finding\nsuggests an origin for most of\nthe galaxies from the cosmic\nfluctuations imposed at the beginning of the\nsimulation as opposed to density variations resulting\nfrom subsequent events.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{time.eps}     \\end{center}     \\caption[1]{     \\label{timff}      \\begin{bfseries}{Histogram of Time of Turnaround After Big Bang.}\\end{bfseries}      Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.  The times for the     six redshifts are shown by the six corresponding symbols.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{radius.eps}     \\end{center}     \\caption[1]{     \\label{turnradff}      \\begin{bfseries}{Histogram of Average Turnaround Radius.}\\end{bfseries}      Included are the 1200 largest galaxies as defined by     DENMAX at the end of the simulation.     }     \\end{figure} \n\nA histogram of the turnaround times together with\nthe times of the six redshifts at which filament\nsegments were studied is shown in Figure~\\ref{timff}.\nFigure~\\ref{turnradff} shows a histogram of proper\nturnaround radii.  \n\n\\subsection{Contrasting Motion of Dark Matter and Gas}\n\\label{contrast}\n\nUnlike the dark matter particles, the individual gas particles \nin the simulation cannot be traced throughout the simulation.\nRather, the gas particles are\ngenerated anew after each hydrodynamic computation. \nSince the structures\nare continually moving and changing shape, it is difficult to pin down\ngas movements on a small scale.  \n\nWhat we can compute unambiguously is the overall\ncollapse of dark matter\nand gas around the centre of gravity of the dark\nmatter associated with each galaxy.   At each redshift\nwe compute for each galaxy as a function of time\nthe proper radius of that mass of gas or dark\nmatter that was present at turnaround within the \naverage radius at turnaround.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{solo.eps}     \\end{center}     \\caption[1]{     \\label{solo}      \\begin{bfseries}{Overall Collapse of Dark Matter and Gas.}\\end{bfseries}      Shown is the contrasting motion of dark matter (dotted, red lines)     and gas (solid green lines) toward the centre of the galaxy.     At a series of redshifts starting at turnaround the lines show the     progression of the radius of the amount of mass that was     within the average radius at turnaround.  The units for the     radius are in fractions of the turnaround radius.     Each graph is for a single galaxy.  These particular      galaxies were     chosen to illustrate the categories of results obtained     for all the galaxies considered.     }     \\end{figure} \n\nFigure~\\ref{solo}\nshows some individual galaxy histories that illustrate the types of results obtained.  The time shown is\nthe time since turnaround.\nIn all of the graphs the dark matter collapses faster than the gas.  In the\nthird graph the collapse of the gas is just balanced by the expansion\nof the\nuniverse.  In the fourth graph the collapse of the gas is outpaced by the \nexpansion of the universe.\n\n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{dark.eps}     \\end{center}     \\caption[1]{     \\label{massradius}      \\begin{bfseries}{Dependence of Collapse of Dark Matter on the     Total Mass of the Galaxy.}\\end{bfseries}      The radius of the mass of dark matter that is present     within the average radius of the dark matter particles at     turnaround is followed with time.  The fractional collapse      is defined as the     ratio of the radius at the end of the simulation to that at     turnaround.  The radii are considered in proper units.       Each symbol represents an individual galaxy,  Only     galaxies that have had at some time at least one     analyzable filament are included.  However,     the total galaxy population of $1200$ gives very similar     results.  Total     galaxy mass includes dark matter, gas, and stars at a      redshift of 5.135.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{ratio.eps}     \\end{center}     \\caption[1]{     \\label{massradrat}      \\begin{bfseries}{Ratio of Gas Collapse to Dark Collapse.}\\end{bfseries}      The graph shows the ratio of the fractional     collapse of the gas to that of the dark matter for the     same galaxy as a function of the total mass of the     final galaxy (dark matter, gas, and stars).       The fractional collapse for dark matter or     gas is defined in the legend to Figure~\\ref{massradius}.     Each symbol represents an individual galaxy,     }     \\end{figure} \n     \\begin{figure}     \\begin{center}     \\leavevmode     \\includegraphics[scale=0.5]{bary.eps}     \\end{center}     \\caption[1]{     \\label{massradbf}      \\begin{bfseries}{Relation of Gas Collapse to the     Baryon Fraction of the Galaxy.}\\end{bfseries}      The graph shows the ratio of the fractional     collapse of the gas to that of the dark matter for the     same galaxy as a function of the baryonic fraction of the     final galaxy.     The radius of the mass of dark matter or gas that is present     within the average radius of the dark matter particles at     turnaround is followed with time.  The fractional collapse      is defined as the     ratio of the radius at the end of the simulation to that at     turnaround.  The radii are considered in proper units.       Each symbol represents an individual galaxy,  Only galaxies     that have had an analyzable filament at some time have been     included.     }     \\end{figure} \n\nThe three figures starting with Figure~\\ref{massradius}\nsummarize results for those galaxies that have filament\nsegments that we analyzed in Section~\\ref{filstructure}. \nWe define the fractional collapse on the\nordinate as the ratio in proper units of the\nradius of the turnaround mass at the end of the \nsimulation to the radius at turnaround.\n\nFigure~\\ref{massradius} shows the effect of the final mass\nof the galaxy (including dark matter,gas, and stars) on the\ncollapse of the dark matter.  The scatter plot for the\nindividual galaxies shows that the fractional collapse at the\nend of the simulation is roughly in accord with virial expectation, and\nis little affected by the mass of the final galaxy.  This is\nwhat we expect for collisionless particles subject only to\ngravitation.\n\nThe gas collapse is, however, quite different.\nFigure~\\ref{massradrat} shows the fractional collapse of\nthe gas in each of these galaxies divided by the \nfractional collapse of the dark matter in the same galaxy.\nThe gas generally collapses more slowly than the\ndark matter.  This makes\nsense if hydrodynamic forces within the isothermal cylinder\nare opposing the overall gravitational collapse of the gas. \n\nFigure~\\ref{massradrat} also shows that more massive galaxies \nhave faster gas collapse than smaller ones.   This finding\ncan also be understood in the context of an isothermal cylinder.  \nThe more massive the galaxy the more gas beyond the\nisothermal limit it will likely have.  This excess gas cannot be\naccomodated within the isothermal cylinder structure. \n \nAs might be expected, retarded gas collapse is associated with\nbaryonic deficits in the final galaxies as shown in \nFigure~\\ref{massradbf}.\n\n\\subsection{Separation of Gas and Dark Matter}\n\nWe have previously reported that a significant fraction of\nintergalactic filaments at a redshift of 5.135 are\nenriched in baryons, some highly so \\citep{harford08,harford11}.\n\\citet{harford08}.  An example is shown in Figure~\\ref{baryrich}.\nIn the present study we find that this effect develops\ngradually during the first gigayear, beginning for the most\npart after reionization as shown in Figure~\\ref{timescattgfract}.\n\n     \\begin{figure}     \\begin{center}         \\leavevmode     \\includegraphics[scale=0.45]{leave.eps}     \\end{center}     \\caption[1]{     \\label{collapsegf}      \\begin{bfseries}{Dark Matter Leaves Gas Behind to Produce     Baryonic Enrichment of Filaments.}\\end{bfseries}    The graph shows the average gas fraction   of filament segments as a function of the fractional collapse   of the dark matter of the galaxy at the redshift of the segment.   Fractional collapse is defined and determined as specified in    Section~\\ref{contrast}.  Note that in this figure maximal   collapse is at the left and minimal collapse at the right.   Horizontal, dotted, red line indicates the cosmic gas fraction.     }     \\end{figure} \n\nWe suggest that this effect occurs when rapidly collapsing dark\nmatter effectively leaves behind the gas in the filaments.\nFigure~\\ref{collapsegf} shows the average gas fraction\nof filament segments as a function of the fractional collapse\nof the dark matter of the galaxy at the redshift of the segment.\nFractional collapse is defined and determined as specified in \nSection~\\ref{contrast}.  Note that in this figure maximal\ncollapse is at the left and minimal collapse at the right.\n\n\\section{Methods}\\label{methods}\n\nAs previously described \\citep{harford08,harford11}\nthe early universe was simulated from the big bang\nto a redshift of 5.135 with a\n``softened\nLagrangian hydrodynamics'' (SLH-P$^{3}$M) code \n\\citep{gnedin95,gnedin_bertschinger_96} with a flat $\\Lambda$CDM cosmology.\nThe cosmological parameters are  $\\Omega_{m} = 0.27$, $\\Omega_{b} = 0.04$, \n$\\sigma_{8} = 0.91$, and $h = 0.71$. \nGas dynamics are computed on a quasi-Lagrangian mesh, which deforms adaptively to\nprovide higher resolution in higher density regions.\n\nAn $8 h^{-1}$ comoving Mpc cube is represented by a \n$256 \\times 256 \\times 256$ grid.\nThe mass of the dark matter particle is  $2.73\\times10^{6}{\\mbox{\\,{solar masses}}}$\nThe mass of the gas particle is roughly\n$4.75\\times10^{5}{\\mbox{\\,{solar masses}}}$\nEach gas particle mass may be somewhat adjusted\naccording to the results of the hydrodynamic computation.\n\nThe galaxies were identified at the end of the simulation\nfrom the total mass distribution\nby DENMAX (\\citep{bertschinger91}). \nThe positions of the individual dark matter\nparticles associated with each of these galaxies can be\nfollowed throughout the simulation.\nFor a given galaxy defined by\nDENMAX at the end\nof the simulation, we define it\nat earlier times as the arrangement of its \nconstituent dark\nmatter particles at that time.  The centre of the\ngalaxy at any time is defined as the centre of mass\nof its dark matter particles.\n\nThis framework allows us to follow the collapse of \nthe dark matter particles with time and provides a moving\ncoordinate system for following the structure of the\nfilaments.   Since gas particles in the\nsimulation are computed from a mesh that is deformed \nhydrodynamically, we cannot follow the motion of individual\nones.\n\nFor convenience we define rhe radius of\ncollapse of a galaxy at a particular time \nas the average distance of its dark matter\nparticles from their centre of gravity.  We \nfind that this radius follows\nthe characteristic story of spherically \nsymmetric collapse in an expanding universe,\nnamely a period of orderly expansion followed by a\nperiod of contraction.   \n\nThe equations for the cycloid describing this collapse are\n\n", "index": 5, "text": "\\begin{equation}\nr=A(t-\\cos(\\theta))\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"r=A(t-\\cos(\\theta))\" display=\"block\"><mrow><mi>r</mi><mo>=</mo><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>t</mi><mo>-</mo><mrow><mi>cos</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01737.tex", "nexttext": "\nwhere r is the proper radius and t is the time \\citep{peacock99}. \n\nTo compute a cycloid corresponding to the collapse profile\nof a particular galaxy we set the parameter $A$ to \none half the radius of collapse that we see at turnaround\nand $B$ to\n\n\n", "itemtype": "equation", "pos": 42973, "prevtext": "\n\n", "index": 7, "text": "\\begin{equation}\nt=B(\\theta-\\sin(\\theta))\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"t=B(\\theta-\\sin(\\theta))\" display=\"block\"><mrow><mi>t</mi><mo>=</mo><mrow><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>θ</mi><mo>-</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mi>θ</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01737.tex", "nexttext": "\n\nwhere $m$ is the total mass (dark matter plus baryons) enclosed\nby the radius of collapse at turnaround and \n$G$ is the gravitational constant. \nWe compute this mass from the theoretically expected\noverdensity of $5.55$.  Finally, we may translate the theoretical\ncycloid slightly in time so that its turnaround coincides with the\nturnaround in the simulation.  The result is that the cycloid\ngenerally begins its ascent either at \nthe beginning of the simulation or\nslightly before.  We interpret this result to mean that the\ngalaxies we have studied originate from the fluctuations\nimposed at the start of the simulaton.\n\nAlthough the average radius of the dark matter particles initially\nfollows the cycloid expected for spherically symmetric collapse,\nby turnaround the galaxies are roughly planar slabs, and\nwe take advantage of this finding to determine\nthe orientation of the emerging filaments.  Filaments were identified\nat six redshifts:  8.90, 8.09, 7.33, 6.69, 5.85, and 5.135,\ncorresponding to 0.57, 0.64, 0.73, 0.83, 0.98, and 1.16\ngigayears after the big bang.\n\nThe perpendeicular axis of the plane is determined \nfrom the smallest component\nof a principal component analysis of the gas particles within the\ndark matter collapse radius\nusing the IDL package (Research Systems).\n\nThe small fraction of mass present in stellar material is neglected\nexcept when computing the baryon fraction of the DENMAX\nselected galaxies at redshift 5.135.\n\nThe regression lines and associated statistics were computed\nusing Mathematica (Wolfram Research).\n\n\\section{Discussion}\n\\label{discussion}\n\nThe theme of this paper is that the gas in the intergalactic filaments\nduring the first gigayear\ncan be best understood in terms\nof simple hydrodynamic principles. \nIn contrast, the dark matter\ncan be understood in terms of a spherically symmetric\ncollapse of an overdensity in an expanding universe.\n\nIt is important to emphasize that the filaments we see \nshould be distinguished\nfrom the generally larger ones others study\nat lower redshifts, which often contain within them\nmultiple galaxies.  Most papers on the cosmic\nweb have dealt with these massive, later structures.\n\nWe find remarkable uniformity in the behaviour of\nthe dark matter of the 1200 largest galaxies\nin the simulation.  These galaxies range in\ntotal mass, including dark matter, gas, and\nstars, over two orders of magnitude.  The dark\nmatter collapse follows closely the spherically\nsymmetric cycloid model at least through\nturnaround.  The overdensity at turnaround agrees\nroughly with theoretical expectation.  The matter\ncollapses initially into a rough plane and then  into\na one dimensional structure within the plane,\nresulting in up to two filaments protruding from the\ncentre of the galaxy oriented end to end.  At any time,\napproximately three quarters of the galaxies have at least\none filament emerging from it.\n\n  \\citet{danovich}  have reported that galaxies\ntend to be at the centre of three filaments,\ncontrary to\nour findings.  We also often see more than two\nfilaments extending from a single point.  However, we\nbelieve that many of these are likely to be the \nresult of later collisions among filaments.\nMost of the 1200 largest galaxies can be \ntraced back to an early stage\nwhen no more than two roughly end to end filaments\nare present.\n\nTo study the properties of filaments, it is necessary to\nidentify them in an algorithmic fashion free of subjective\nbias.  We find that visual inspection \ncan be deceptive.  A plane\nviewed edge on or the intersection of two planes can appear\nas a spurious filament.  In addition, some\nof the filament segments are difficult to pick out from the\nbackground by eye.\n \nWe believe that our criteria for selection of filament\nsegment candidates are good, and that it is not unreasonable\nto discard additional faint filaments that may be seen by eye.\nNote that the segments in Fgure~\\ref{numpeak} and\nFigure~\\ref{peakalign}  include all the candidate segments\nidentified before culling with the ``range test''.\n\nIt should also be appreciated that, at early times, \nthe centre of a future galaxy connecting two end to\nend filaments may not be apparent upon casual\ninspection.  Rather it may appear to the eye \nsimply as a point \non a single continuous filament.\nThis situation could lead to an apparent \npreference for\nmore than two filaments emanating from a \nsingle galaxy.  \n\nWe are impressed by the mathematical demonstration\nby \\citet{schmidburgk67} that parallel, isothermal filaments \ncan form naturally from isothermal planes.  In this model,\nof just gas without any cosmological modeling, the\nfilaments emerge in the plane in parallel at a regular spacing.\nNo intervention of dark matter is required to make the\nprocess energetically favorable.\nThis model may provide a useful starting point for\nunderstanding mathematically how the filaments form.\n\nWe argue that, during the reionization process, the gas\nassumes a structure that can be understood in terms of a\ngravitationally bound, isothermal\ncylinder at equilibrium at about $10^{4}{\\mbox{\\,{K}}}$.\nWe find that this temperature, close to the Lyman alpha cooling\nfloor, is tightly maintained during reionization.  \n\nThe change in sound speed during\nreionization can be seen reflected in a change in\nthe mass per unit length of the cylinder (Figure~\\ref{figcorr}).\nWe consider this finding together with the proportionality\nconstant to be strong evidence for gravitationally\nbound, isothermal cylinders.  \n\nIt is important to note\nthat the simulation follows in detail the ionization of the gas from\nradiation from the actual sites of stellar formation.  \nThis is in contrast \nto many simulations that merely impose a uniform\nradiation field and thus might miss such structural\nnuances. \n\nWe do not know the significance of finding the isothermal\ncylinders during reionization.  The timing may be\ncoincidental.  Large separations of gas and\ndark matter do not begin until the end of reionization.\nMost of the isothermal cylinders have a gas fraction\nclose to the cosmic value.\n\nIt is plausible that the stabilization effects of a\nhydrodynamic cylinder retard the collapse of the gas.\nOnly excess gas that cannot be accomodated into the\nisothermal cylinder structure would then be able to\nproceed to the centre of the galaxy as fast as the\ndark matter does.  We find that\nrapid gas movement into the galaxy is associated\nwith the larger galaxies.  Since these galaxies\nprobably \nrepresent larger primordial fluctuations,  they would be\nmore likely to have excess gas available.\n\nTwo modes of gas entry into galaxies have been\ndescribed in the literature.  In the ``hot mode''\nincoming gas is shock heated when it encounters\nthe potential well of the halo \\citep{rees77}.  \nThe shocked gas\nis elevated in temperature to where it can cool\nefficiently\nand then enter the halo.  This mode is thought\nto predominate\nfor galaxies larger than a few times \n$10^{11}{\\mbox{\\,{M}}}_\\odot$ and at low redshifts. \nIt is thought that for smaller galaxies,\nlike the ones we have studied,\nthe gas is not heated because the smaller\npotential wells cannot sustain shocks\n\\citep{birnboim03}.\nIn this ``cold mode'' scenario gas passes directly into\nthe galaxy without supersonic heating, \nperhaps mediated by intergalactic\nfilaments. \\citep{birnboim03,binney04,katz03,keres05,\ndekel06,ocvirk08,keres09b,dekel09d,brooks09}.\nOur model is consistent with the cold mode route.\nWe see no evidence for a hot gas stage in the\nformation of our galaxies.   \n\nA detailed analysis of the motion of gas into\ngalaxies is beyond the scope of this paper.  Our\nmodel suggests that the filaments during the\nfirst gigayear might actually\nretard the motion of their gas into the halo\nrather than facilitate it.\n\n   An important open question involves the timing\nand mechanism of the reionization of the universe.\nTo evaluate the role of ionizing radiation from\nstars one must know the fraction of stellar radiation\nthat escapes from its point of origin.  It is clear that the\ngas surrounding the centre of collapse of a galaxy is not\nspherically symmetric.  Our results may provide a more\nrealistic starting point for such calculations.\n\n   An important problem in cosmology is the\ndiscrepancy between the observed number of satellite\ngalaxies of the Milky Way and the predicted number\nfrom dark matter only simulations of galaxy formation\n\\citep{kauffmann93}.\nOur results suggest a mechanism that suppresses the\nentry of gas into dark matter haloes.  This\nphenomenon would be in contrast to the expulsion of\ngas from haloes by heating and photoionization.\nOn the other hand, the presence of filaments might\nfacilitate entry of gas by restricting its angular\nmomenturm.  Galaxies forming from\noverdensities having too little gas to form isothermal\ncylinders might lack this advantage. \n\nIt should be noted\nthat in our simulation the filament gas is generally not\ncooler than the surrounding gas.  Rather the gas heats\nup as the filaments form.  Only toward the end of\nthe simulation do we see surrounding gas that is\nhotter than that in the filaments.  Presumeably the\nconcentration of gas in the filaments shields them from\nphotoionization.  \n\nFinally, our model contributes to our intuition\nabout the roles of dark matter and \ngas in structure formation and suggests the\nnecessary simulation resolution to see the effects we\ndescribe here. \n\n\\section{Summary}\n\nWe propose a model for the development of intergalactic\nfilaments during the first gigayear of the universe.\nIn this model the structure of the filament gas is\ndetermined, not by the potential well of the enclosing\ndark matter, but by the hydrodynamic properties of the gas.\n\nThe model is described in the context of galaxy formation.\nUp to two extended filaments may protrude\nfrom the centre of collapse of the galaxy.  They tend to be\noriented end-to-end as if they comprised a single structure.\nDuring reionization the total mass per unit length of a filament\nis proportional to the square of the sound speed with a\nproportionality constant equal to that predicted for \na gravitatonally bound,\nisothermal cylinder.  These structures contain gas and dark\nmatter in roughly the cosmic abundances. The dark matter \ncontributes to the gravitatonal field in proportion to its\nabundance as if it were mixed in with the gas.\n\nThe dark matter of each galaxy collapses according to the\ncycloid model for a spherically symmetric overdensity in\nan expanding universe.  The cycloid profile is followed\nuntil some time after turnaround.  The density of the\nmaterial at turnaround agrees with theoretical\npredictions.\n\nAfter reionization some of the\nfilaments become increasingly enriched in either gas \nor dark matter.  The average gas fraction of the filament\nsegments increases as the extent of dark matter collapse\nincreases.\n\nOverall the dark matter collapses to roughly the same\nextent for each galaxy.  The isothermal model suggests\nan explanation for why the gas is generally retarded\nrelative to the dark matter\nin its movement toward the centre of the galaxy.\n\nThe model may provide a mathematical framework for\nunderstanding a variety of open questions in\nstructure formation in the early universe.\n\n\\section*{Acknowledgements}\nWe are grateful to Nickolay Y. Gnedin for \nproviding us with\nthe output of his simulation \nalong with his visualization software IFRIT,\n\n\\bibliographystyle{mnras}\n\n\\bibliography{harford}\n\n\\appendix\n\n\\section{Algorithm For Filament Identification}\n\nEach filament segment is selected in the context of a forming\ngalaxy.  Figure~\\ref{geom} shows the geometry\nfor this selection for an example galaxy.\nThe selection takes place in a comoving coordinate system whose\ncentre is the centre of mass of the collapsing dark particles of\nthe galaxy.  The XY plane is set to the plane of the gas of the\ngalaxy.  This plane is determined by a principal component\nanalysis of the gas particles within a sphere of radius $266$ kpc\ncentred at the centre of collapse.   The large black rectangle in the\nFigure~\\ref{geom} shows the XY plane.  Annuli above (red) and \nbelow (green) the plane\ndetermine a volume that is divided into equal bins by the light blue\nrectangles.  The intersection of the bins\nwith the plane are shown by the black annulus.  The inner and\nouter radii of the annuli are 88.8 and 133.2 comoving kpc\nrespectively.\n\nLocal concentrations\nof gas are determined from the mass of gas in each bin.  A bin having\nmore than twice the average amount of gas per bin is considered to\ncontain a possible filament.  In cases where neighboring bins of the\nannulus both meet the filament criterion, the gas in both bins is merged\nand analyzed together. An example of a gas filament passing through\na bin is shown in Figure~\\ref{filselect}.  The gas particles are\nshown in blue.\n\n     \\begin{figure}     \\begin{center}          \\leavevmode     \\includegraphics[scale=0.45]{geometry.eps}     \\end{center}     \\caption[1]{     \\label{geom}      \\begin{bfseries}{Coordinate System For Identification of Intergalactic       Filaments.}\\end{bfseries}      Outlined in black, is the XY plane      with the origin of the     coordinate system at its centre.  One pair of     annuli is shown with members above (red) and below (green)     the central plane,        The volume between the two annuli is divided into     equal, radial bins.  The intersection of the     volume with the plane is shown in black.     Planes marking the boundaries of the bins are outlined in     light blue.     }     \\end{figure} \n     \\begin{figure}     \\begin{center}           \\leavevmode     \\includegraphics[scale=0.45]{select.eps}     \\end{center}     \\caption[1]{     \\label{filselect}      \\begin{bfseries}{Identification of a Filament Extending From the      Centre of a Galaxy.}\\end{bfseries}   The centre of the collapsing dark matter    is at the centre of the coordinate system shown in    Figure~\\ref{geom} and the plane shown in that figure is    oriented to the plane of the gas.    The gas particles in a region    surrounding the centre of a collapsing galaxy are shown    in blue.    For clarity, only some of the bins are shown.     }     \\end{figure} \n\nThese filaments, so defined, are used to count the number of\nfilaments passsing through the annulus.  \nA more precise orientation of the selected\nfilament gas particles is obtained from a principal component\nanalysis.  The resulting filament vectors are used to determine the angle\nbetween the two most massive filaments in each annulus.  \nGenerally, \nno more than two filaments are found in an annulus.  \n\nThe procedure easily identifies segments of\ncontinuous rods of gas extending approximately radially \nfrom the centre of the dark matter of the galaxy.  However, not\nall segments identified are parts of visibly continuous rods.\nIn addition, sometimes the concentraion of gas in the bin is so low\nthat it is is not readily distinguishable from its neighbors by \ncasual visual inspection.\n\nFor further structural analysis, up to two of the most\nmassive filament segments from each annulus are then\nsubjected to a ``range'' test to eliminate structures that\nare not sufficiently ``filamentary'' as described in \nSection~\\ref{filident}.\n\n\\bsp  \n\\label{lastpage}\n\n", "itemtype": "equation", "pos": 43279, "prevtext": "\nwhere r is the proper radius and t is the time \\citep{peacock99}. \n\nTo compute a cycloid corresponding to the collapse profile\nof a particular galaxy we set the parameter $A$ to \none half the radius of collapse that we see at turnaround\nand $B$ to\n\n\n", "index": 9, "text": "\\begin{equation}\n\\sqrtsign{\\frac{A^{3}}{G m}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\sqrtsign{\\frac{A^{3}}{Gm}}\" display=\"block\"><msqrt><mfrac><msup><mi>A</mi><mn>3</mn></msup><mrow><mi>G</mi><mo>⁢</mo><mi>m</mi></mrow></mfrac></msqrt></math>", "type": "latex"}]