[{"file": "1601.07559.tex", "nexttext": "\nas a function of age, of an instantaneously formed star cluster of mass $10^6\\,{\\rm M}_{\\odot}$, for several stellar population models from BPASS. We adopt a \\citet{kroupa.02.imf} IMF with slopes of $-1.3$ from 0.1--$0.5~{\\rm M}_{\\odot}$ and $-2.35$ from 0.5--$100\\,{\\rm M}_{\\odot}$, consistent with that used in the simulation. We show the BPASS model at metallicity $Z=0.001$ ($Z=0.05\\,{Z_{\\odot}}$, black), the lowest metallicity available and the closest to our simulations, for both single-star evolution (dotted) and binary evolution (solid) models. We also compare those with $Z=0.02$ ($Z={Z_{\\odot}}$, cyan) models from BPASS. We note that the STARBURST99 models (not shown), which are the default model in \\citet{ma.15.fesc}, are nearly identical to the single-star model from BPASS at both metallicities.\n\nThe ionizing photons produced in the single-star and binary models stay the same for the first 3\\,Myr, but start to differ significantly after 3\\,Myr at $Z=0.05\\,{Z_{\\odot}}$, with the binary model producing an order of magnitude more ionizing photons by 10\\,Myr. However, at solar metallicity, far fewer ionizing photons are produced and the difference between single-star and binary models only becomes significant after 6 Myr.\n\nWe run our MCRT code on the same galaxy to compute ${f_{\\rm esc}}$ using both single-star and binary models at $Z=0.05\\,{Z_{\\odot}}$ from BPASS. The results are presented in Figure \\ref{fig:rt}. Lines and symbols show the instantaneous value and time-averaged  values over $\\sim100\\,{\\rm Myr}$, respectively. Dotted lines and open symbols represent the single-star model, while solid lines and filled symbols represent the binary model. From top to bottom, the three panels show ${f_{\\rm esc}}$ (the ``true'' fraction of ionizing photons that escape the galaxy virial radius), ${\\xi_{\\rm ion}}$, and the ``effective'' escape fraction ${f_{\\rm esc,\\,eff}}$ as defined below, for the z5m10mr galaxy from $z=5.5$--8. The effective escape fraction is defined as\n\n", "itemtype": "equation", "pos": 18600, "prevtext": "\n\\maketitle\n\\label{firstpage}\n\n\\begin{abstract}\nEmpirical constraints on reionization require galactic ionizing photon escape fractions ${f_{\\rm esc}}\\gtrsim 20\\%$, but recent high-resolution radiation-hydrodynamic calculations have consistently found much lower values $\\sim1$--5\\%. While these models have included strong stellar feedback and additional processes such as runaway stars, they have almost exclusively considered stellar evolution models based on single (isolated) stars, despite the fact that most massive stars are in binaries. We re-visit these calculations, combining radiative transfer and high-resolution cosmological simulations of galaxies with detailed models for stellar feedback from the Feedback in Realistic Environments (FIRE) project. For the first time, we use a stellar evolution model that includes a physically and observationally motivated treatment of binaries (the BPASS model). Binary mass transfer and mergers enhance the population of massive stars at late times ($\\gtrsim 3\\,{\\rm Myr}$) after star formation, which in turn strongly enhances the late-time ionizing photon production (especially at low metallicities). These photons are produced after feedback from massive stars has carved escape channels in the ISM, and so efficiently leak out of galaxies. As a result, the time-averaged ``effective'' escape fraction (ratio of escaped ionizing photons to observed $1500\\,$\\AA~photons) increases by factors $\\sim4$--10, sufficient to explain reionization. While important uncertainties remain, we conclude that binary evolution may be critical for understanding the ionization of the Universe.\n\\end{abstract}\n\n\\begin{keywords}\nbinaries: general -- stars: evolution -- galaxies: formation -- galaxies: high-redshift -- cosmology: theory\n\\end{keywords}\n\n\\section{Introduction}\n\\label{sec:intro}\nThe escape fraction (${f_{\\rm esc}}$) of hydrogen ionizing photons from high-redshift star-forming galaxies is perhaps the most important and yet most poorly understood parameter in understanding the reionization history. Models of cosmic reionization suggest ${f_{\\rm esc}}\\gtrsim20\\%$ \\citep[e.g.][]{kuhlen.fg.12,finkelstein.12.model,robertson.13.model,robertson.15.model} in order to match the optical depth of electron scattering inferred from cosmic microwave background (CMB) measurements \\citep[e.g.][]{hinshaw.13.wmap,planck.14}, assuming that most of the ionizing photons come from star-forming galaxies brighter than ${\\rm M_{UV}}=-13$. \n\nHowever, such a high ${f_{\\rm esc}}$ is problematic in the context of both observations and theory. From the local universe to redshift $z\\sim1$, there is no confirmed Lyman continuum (LyC) detection, neither from individual galaxies nor from stacked samples, implying upper limits of ${f_{\\rm esc}}=1$--3\\% \\citep[e.g.][]{leitet.11.fesc,leitet.13.fesc,bridge.10.fesc,siana.15.fesc}. Even at $z\\sim3$, many earlier reports of LyC detection from Lyman break galaxies (LBGs) and Ly$\\alpha$ emitters (LAEs) turn out to be contamination from foreground sources \\citep[e.g.][]{siana.15.fesc} and a low ${f_{\\rm esc}}$ about 5\\% has been derived from some galaxy samples at this redshift \\citep[e.g.][]{iwata.09.fesc,boutsia.11.fesc}.\n\nMoreover, the latest generation of cosmological hydrodynamic simulations of high-redshift galaxies predict ${f_{\\rm esc}}$ to be no more than a few percent in bright galaxies \\citep[e.g.][]{wise.14.fesc,kimm.cen.14.fesc,paard.15.fesc,ma.15.fesc}. These simulations include detailed models of ISM physics, star formation, and stellar feedback, in contrast to early generations of simulations which tended to over-predict ${f_{\\rm esc}}$ by an order of magnitude, owing to more simplistic models of the inter-stellar medium \\citep[see][and references therein]{ma.15.fesc}. The low ${f_{\\rm esc}}$ is due to the fact that newly formed stars, which dominate the intrinsic ionizing photon budget, begin life buried in their birth clouds, which absorb most of the ionizing photons. By the time low column density escape channels are cleared in the ISM, the massive stars have begun to die and the predicted ionizing photon luminosity has dropped exponentially. \\citet{ma.15.fesc} found that stellar populations older than 3\\,Myr have order unity photon escape fractions, but -- according to single stellar evolution models such as STARBURST99 \\citep{leitherer.99.sb} -- these stars only contribute a small fraction of the intrinsic ionizing photon budget. \n\nTherefore, there appears to be a factor of $\\sim4$--5 fewer ionizing photons predicted, compared to what is needed to ionize the Universe. Several solutions have been proposed. For example, \\citet{wise.14.fesc} suggested that tiny galaxies that are much fainter than ${\\rm M_{UV}}>-13$ may play a significant role in reionization, since ${f_{\\rm esc}}$ increases quickly from $5\\%$ to order unity for halo mass below $10^{8.5}\\,{\\rm M}_{\\odot}$. However, others have noted that the required number of tiny galaxies would imply a huge population of Milky Way satellites which have not been observed \\citep[see][]{mbk.14.faint,grause.16.reion.constraints.local}. Various authors have also proposed that runaway OB stars can boost ${f_{\\rm esc}}$; however both \\citet{kimm.cen.14.fesc} and \\citet{ma.15.fesc} showed that in high-resolution simulations these produce a marginal effect, increasing ${f_{\\rm esc}}$ systematically by a factor $\\sim 1.2$ (far short of the $\\gtrsim 4$ required). A more radical alternative is to invoke non-stellar sources for reionization, for example AGN \\citep[see e.g.][]{madau.15.agn}. This relies on recent observations \\citep[e.g.][]{giallongo.15.agn} suggesting much higher number densities of faint AGN at high redshift than previously thought \\citep[e.g.][]{hopkins.07.agn}.\n\nBut there are gaps in our understanding of stellar evolution. One key factor that is usually not considered in standard stellar population models is the effect of binary interaction. Mass transfer between binary stars, and binary mergers, can effectively increase the number of higher-mass stars at later times after star formation. Because the ionizing photon production rate depends so steeply on stellar mass, this can substantially increase the number of ionizing photons produced at these times, compared to what is expected from single-star evolution models \\citep[e.g.][]{demink.14.binary}. Recently, \\citet{stanway.16.bpass} pointed out that the emissivity of ionizing photons from high-redshift galaxies, inferred from their UV luminosities, would be significantly higher (by a factor of $\\sim1.5$) using stellar evolution models that account for binary interaction. Furthermore, binary evolution does not just produce {\\em more} ionizing photons, but it may also substantially change the escape fractions \\citep{ma.15.fesc}. \n\nIn this Letter, we explore the effect of binary interaction on ionizing photon production and escape by repeating the calculation described in \\citet{ma.15.fesc} using the Binary Population and Spectral Synthesis (BPASS) model of stellar population evolution\\footnote[8]{http://bpass.auckland.ac.nz} (\\citealt{eldridge.08.binary}; Eldridge et al, in preparation). These models are calibrated to observations of local stellar populations, and reproduce the observed multiplicity distributions \\citep{eldridge.08.binary}. Moreover, there is evidence that such models are both necessary and sufficient to explain the observed differences between various H\\,II-region emission-line properties of metal-poor, younger galaxies at $z\\sim2$--3 and local galaxies \\citep[][for a more detailed study see Strom et al., in preparation]{steidel.14.bpt}. In \\citet{ma.15.fesc}, we performed Monte Carlo radiative transfer (MCRT) calculations on a suite of cosmological hydrodynamic simulations and showed that the time-averaged ${f_{\\rm esc}}$ is about $5\\%$ for galaxies of halo masses from $10^9$--$10^{11}\\,{\\rm M}_{\\odot}$ at $z=6$ using the single-star evolution models from STARBURST99. We showed that the results did not vary substantially with the resolution of either the radiative transfer calculation or hydrodynamics (once sufficient resolution for convergence was reached), nor the details of the star formation model, nor the inclusion of runaway stars. We will show here, however, that the inclusion of binary evolution effects increases the predicted escape fractions substantially, reconciling them with constraints on reionization. We describe the simulation and radiative transfer code in Section \\ref{sec:method}, present the results in Section \\ref{sec:results}, and conclude in Section \\ref{sec:con}.\n\nWe adopt a standard flat $\\Lambda$CDM cosmology with cosmological parameters $H_0=70.2 {\\rm~km~s^{-1}~Mpc^{-1}}$, $\\Omega_{\\Lambda}=0.728$, $\\Omega_{m}=1-\\Omega_{\\Lambda}=0.272$, $\\Omega_b=0.0455$, $\\sigma_8=0.807$ and $n=0.961$, consistent with observations \\citep[e.g.][]{hinshaw.13.wmap,planck.14}.\n\n\n\\begin{table}\n\\begin{center}\n\\caption{Simulations analyzed in this paper.} \n\\label{tbl:sim}\n\\begin{tabular}{lcccccccc}\n\\hline\\hline\nName & $m_b$ & $\\epsilon_b$ & $m_{\\rm dm}$ & $\\epsilon_{\\rm dm}$ & $M_{\\rm vir}$ & $M_{\\ast}$ & $\\rm M_{UV}$ \\\\\n & (${\\rm M}_{\\odot}$) & (${\\rm pc}$) & (${\\rm M}_{\\odot}$) & (${\\rm pc}$) & (${\\rm M}_{\\odot}$) & (${\\rm M}_{\\odot}$) & (AB mag) \\\\\n\\hline\nz5m09 & 16.8 & 0.14 & 81.9 & 5.6 & 7.6e8 & 3.1e5 & -10.1 \\\\\nz5m10mr & 1.1e3 & 1.9 & 5.2e3 & 14 & 1.5e10 & 5.0e7 & -17.5 \\\\\nz5m11 & 2.1e3 & 4.2 & 1.0e4 & 14 & 5.6e10 & 2.0e8 & -18.5 \\\\\n\\hline \\\\\n\\multicolumn{8}{p{\\linewidth}}{{\\bf Notes.} Initial conditions and galaxy properties at $z=6$.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(1) Name: Simulation designation.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(2) $m_b$: Initial baryonic particle mass.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(3) $\\epsilon_b$: Minimum baryonic force softening. Force softening is adaptive.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(4) $m_{\\rm dm}$: Dark matter particle mass in the high-resolution regions.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(5) $\\epsilon_{\\rm dm}$: Minimum dark matter force softening.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(6) $M_{\\rm vir}$: Halo mass of the primary galaxy at $z=6$.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(7) $M_{\\ast}$: Stellar mass of the primary galaxy at $z=6$.} \\\\\n\\multicolumn{8}{p{\\linewidth}}{(8) $\\rm M_{UV}$: Galaxy UV magnitude (absolute AB magnitude at 1500 \\AA).} \\\\\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\n\\section{Method}\n\\label{sec:method}\nIn this work, we study the effect of binary evolution on ${f_{\\rm esc}}$ using three galaxies from a suite of cosmological zoom-in simulations presented in \\citet{ma.15.fesc}. The simulation and radiative transfer are identical. We {\\em only} replace the stellar evolution model used for the post-processing radiative transfer calculations. This is likely to be a lower limit to the impact of binaries on ${f_{\\rm esc}}$, because we do not include the enhanced radiative feedback due to binaries in our simulation. We briefly review the methodology here, but refer to \\citet{ma.15.fesc} for more details.\n\nThe simulations are part of the Feedback in Realistic Environment project\\footnote[9]{http://fire.northwestern.edu} \\citep[FIRE;][]{hopkins.14.fire}. They are run using GIZMO \\citep{hopkins.15.gizmo}, in P-SPH mode, which adopts a Lagrangian pressure-entropy formulation of the smoothed particle hydrodynamics (SPH) equations that improves the treatment of fluid-mixing instabilities \\citep{hopkins.13.sph}.\n\nGalaxy properties at $z=6$ for the three simulations used in this work (z5m09, z5m10mr, and z5m11) are listed in Table \\ref{tbl:sim}. The simulations span halo masses from $10^9$--$10^{11}\\,{\\rm M}_{\\odot}$ at $z=6$ and produce reasonable stellar mass--halo mass relation, SFR--stellar mass relation, and mass--metallicity relation \\citep{hopkins.14.fire,ma.15.fesc,ma.16.mzr}. At lower redshifts the same  simulations have also been shown to reproduce observed properties of galactic outflows and circum-galactic absorbers \\citep{muratov.15.outflows,faucher.15.absorbers}, as well as abundances and kinematics of observed (local) dwarfs in this mass range \\citep{onorbe.15.cusps,chan.15.dwarfs}.\n\n\nIn the simulations, gas follows an ionized-atomic-molecular cooling curve from $10-10^{10}$\\,K, including metallicity-dependent fine-structure and molecular cooling at low temperatures and high-temperature metal-line cooling followed species-by-species for 11 separately tracked species \\citep{wiersma.09.cooling}. We do not include a primordial chemistry network nor consider Pop III star formation, but apply a metallicity floor of $Z=10^{-4}\\,{Z_{\\odot}}$. At each timestep, the ionization states are determined following \\citet{katz.96.cooling} and cooling rates are computed from a compilation of CLOUDY runs, including a uniform but redshift-dependent photo-ionizing background tabulated in \\citet{fg.09.uvb}, and an approximate model of photo-ionizing and photo-electric heating from local sources. Gas self-shielding is accounted for with a local Jeans-length approximation, which is consistent with the radiative transfer calculations in \\citet{fg.10.lya}. The on-the-fly calculation of ionization states is consistent with more accurate post-processing radiative transfer calculations \\citep{ma.15.fesc}.\n\nWe follow the star formation criteria in \\citet{hopkins.13.sf} and allow star formation to take place only in dense, molecular, and self-gravitating regions with hydrogen number density above a threshold ${n_{\\rm th}}=100~{\\rm cm}^{-3}$. Stars form at 100\\% efficiency per free-fall time when the gas meets these criteria, and there is no star formation elsewhere. The high density threshold is very important in studying ${f_{\\rm esc}}$, because it resolves the formation and destruction of high-density star-forming clouds. Simulations using unphysically low ${n_{\\rm th}}$ fail to resolve this and tend to over-predict ${f_{\\rm esc}}$ by an order of magnitude \\citep[see][and reference therein]{ma.15.fesc}.\n\nThe simulations include several different stellar feedback mechanisms, including (1) local and long-range momentum flux from radiative pressure, (2) energy, momentum, mass and metal injection from SNe and stellar winds, and (3) photo-ionization and photo-electric heating. We follow \\citet{wiersma.09.metal} and include metal production from Type-II SNe, Type-Ia SNe, and stellar winds. Every star particle is treated as a single stellar population with known mass, age, and metallicity, assuming a \\citet{kroupa.02.imf} initial mass function (IMF) from $0.1$--$100~{\\rm M}_{\\odot}$. The feedback strengths are directly tabulated from STARBURST99.\n\n\n\nFor every snapshot, we map the main galaxy onto a Cartesian grid of side length $L$ equal to two virial radii and with $N$ cells along each dimension. We choose $N=256$ for z5m09 and z5m10mr and $N=300$ for z5m11, so that the cell size $l=L/N$ varies but is always smaller than 100 pc. This ensures convergence of the MCRT calculation \\citep{ma.15.fesc}. The MCRT code we use is derived from the MCRT code SEDONA \\citep{kasen.06.sedona}, but focuses on radiative transfer of hydrogen ionizing photons. The MCRT method is similar to that described in \\citet{fumagalli.11.mcrt,fumagalli.14.mcrt}. ${\\rm N_{star}}=3\\times10^7$ photon packets are isotropically emitted from the location of star particles, sampling their ionizing photon budgets. Another ${\\rm N_{UVB}}=3\\times10^7$ photon packets are emitted from the boundary of the computational domain in a manner that produces a uniform, isotropic ionizing background with intensity given by \\citet{fg.09.uvb}. The MCRT code includes photoionization, collisional ionization, recombination, and dust absorption and uses an iterative method to reach photoionization equilibrium. The numbers of photon packets and iteration are selected to ensure convergence.\n\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{spectra.pdf}\n\\caption{{\\em Top:} Ionizing photon production rate, ${Q_{\\rm ion}}$ as a function of age for a $10^6~{\\rm M}_{\\odot}$ star cluster, predicted by different stellar evolution models. {\\em Bottom:} Ratio of ionizing luminosity to $1500$ \\AA~luminosity, ${\\xi_{\\rm ion}}$ as a function of age for the same star cluster. We show both single-star models (dotted) and binary models (solid) at metallicities $Z=0.05~{Z_{\\odot}}$ (black) and $Z={Z_{\\odot}}$ (cyan), respectively. \nIncluding binaries leads to more massive stars at late times (from mass transfer and mergers), which dramatically enhances the ionizing photon production after $t\\sim 3$ Myr. ${Q_{\\rm ion}}$ also depends strongly on metallicity, with many more ionizing photons produced at low metallicity. STARBURST99 models, which also ignore binaries, are nearly identical to the BPASS single-star models at both metallicities.}\n\n\\label{fig:spectra}\n\\end{figure}\n\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{rt.pdf}\n\\caption{{\\em Top:} True ionizing photon escape fraction ${f_{\\rm esc}}$, in our z5m10mr simulation (a $\\sim 10^{10}~{\\rm M}_{\\odot}$ halo at $z=6$) as a function of redshift (or cosmic time). Lines show the instantaneous values in each snapshot, symbols are time-averaged in $100$ Myr intervals. {\\em Middle:} ${\\xi_{\\rm ion}}$ (as Fig.~\\ref{fig:spectra}) as a function of time. {\\em Bottom:} Effective escape fraction, ${f_{\\rm esc,\\,eff}}$ (Equation \\ref{eqn:feff}) as a function of time. In the single-star model, ${f_{\\rm esc}}\\lesssim 5\\%$ most of the time, insufficient for reionization. Accounting for binary effects boosts ${\\xi_{\\rm ion}}$ by a factor $\\sim 1.5$ -- useful but insufficient to explain reionization. But it also boosts ${f_{\\rm esc}}$ by factors $\\sim3$--6 because the ionizing photons produced later (after $t\\gtrsim 3\\,$Myr) preferentially escape, so the ``effective escape fraction'' ${f_{\\rm esc,\\,eff}}$ is increased by factors $\\sim4$--10 and reaches the $\\sim 20\\%$ values needed to explain reionization.}\n\\label{fig:rt}\n\\end{figure}\n\n\n\\begin{figure}[ht]\n\\centering\n\\includegraphics[width=0.5\\textwidth]{z5.pdf}\n\\caption{Effective escape fraction as a function time for z5m09, z5m10mr, and z5m11. In all cases, binary stellar models boost ${f_{\\rm esc,\\,eff}}$ by factors of $\\sim4$--10. In more massive galaxies, the mean ${f_{\\rm esc,\\,eff}}$ reaches $\\sim20\\%$, sufficient for reionization.}\n\\label{fig:z5}\n\\end{figure}\n\n\n\\section{Results}\n\\label{sec:results}\nIn Figure \\ref{fig:spectra}, we show the ionizing photon budget, $Q_{\\rm ion}$, and the ratio between hydrogen ionizing luminosity and the luminosity at $1500$\\,\\AA,\n\n", "index": 1, "text": "\\begin{equation}\n\\label{eqn:fion}\n{\\xi_{\\rm ion}} = \\frac{\\int_{508\\,\\text{\\AA}}^{912\\,\\text{\\AA}} L_{\\lambda} {\\rm d}\\lambda}{\\lambda L_{\\lambda}(1500\\,\\text{\\AA})},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\xi_{\\rm ion}}=\\frac{\\int_{508\\,\\text{\\AA}}^{912\\,\\text{\\AA}}L_{\\lambda}{\\rm d%&#10;}\\lambda}{\\lambda L_{\\lambda}(1500\\,\\text{\\AA})},\" display=\"block\"><mrow><mrow><msub><mi>ξ</mi><mi>ion</mi></msub><mo>=</mo><mfrac><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mpadded width=\"+1.7pt\"><mn>508</mn></mpadded><mo>⁢</mo><mtext>Å</mtext></mrow><mrow><mpadded width=\"+1.7pt\"><mn>912</mn></mpadded><mo>⁢</mo><mtext>Å</mtext></mrow></msubsup><mrow><msub><mi>L</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo>d</mo><mi>λ</mi></mrow></mrow></mrow><mrow><mi>λ</mi><mo>⁢</mo><msub><mi>L</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mpadded width=\"+1.7pt\"><mn>1500</mn></mpadded><mo>⁢</mo><mtext>Å</mtext></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07559.tex", "nexttext": "\nwhich is the ratio of the escaping ionizing flux to 1500 \\AA~flux, relative to what would be computed using single-star models. ${f_{\\rm esc,\\,eff}}$ simply equals ${f_{\\rm esc}}$ for single-star models, while for binary models, it also accounts for the change of ${\\xi_{\\rm ion}}$ relative to single-star models. \n\nFor single-star models, ${f_{\\rm esc}}$ is below $5\\%$ most of the time, consistent with earlier results in \\citet{ma.15.fesc}. This is because young stars are buried in their birth clouds, which prevent almost all ionizing photons from escaping. Most of the photons that escape come from stellar populations with age $\\sim3$--10\\,Myr, but they only contribute a very small fraction of the intrinsic ionizing photons in single-star models. However, at all times, the binary model predicts significantly higher (factors $\\sim3$--6) values for ${f_{\\rm esc}}$. We also find that ${\\xi_{\\rm ion}}$ is boosted by a factor of $\\sim1.5$, consistent with \\citet{stanway.16.bpass}. Multiplying the two factors, we find that the effective escape fraction is boosted by factors of $\\sim4$--10, with most of the contribution coming from the increased ${f_{\\rm esc}}$. Averaged over the entire redshift range $z=5.5$--8 that we consider here, accounting for binary effects increases the true ionizing escape fraction ${f_{\\rm esc}}$ from $6\\%$ to $14\\%$ and increases ${f_{\\rm esc,\\,eff}}$ from $6\\%$ to $\\sim 20\\%$. This is consistent with what is required in empirical reionization models.\n\nIn Figure \\ref{fig:z5}, we show the effective escape fraction as a function of time for all three galaxies. In all cases, binary models boost time-averaged ${f_{\\rm esc,\\,eff}}$ by factors of $\\sim 4$--10. In lowest mass halo (z5m09), ${f_{\\rm esc,\\,eff}}$ is still low, because halo gas is largely neutral in such a low-mass systems and consumes a large fraction of the ionizing photons. In more massive galaxies like z5m10mr and z5m11, ${f_{\\rm esc,\\,eff}}$ reaches $\\gtrsim20\\%$. \n\n\n\\section{Discussion and Conclusions}\n\\label{sec:con}\nIn this work, we study the effect of binary evolution on ionizing photon production and escape in high-redshift galaxies, using three high-resolution cosmological simulations from the FIRE project. The simulated galaxies are around the mass estimated to dominate re-ionization (halo $M_{\\rm halo}=10^9$--$10^{11}\\,{\\rm M}_{\\odot}$ at $z=6$). Using detailed radiative transfer calculations, we show that recent stellar evolution models which account for mass transfer and mergers in binaries (specifically, the BPASS model) produce significantly more ionizing photons for stellar populations older than 3\\,Myr compared to stellar evolution models ignoring binaries. These later-time photons easily escape, collectively increasing the escape fraction and ionizing photon production rate dramatically from high-redshift low-metallicity galaxies.\n\nWe emphasize that the most important change relative to single-star models is not in the absolute photon production rate, but its time-dependence, because photons can much more easily escape star-forming complexes once massive stellar winds and radiation have carved bubbles which clear photon escape channels.\n\nFor single-star evolution models, we predict ${f_{\\rm esc}}$ below $5\\%$ most of the time, less than what is required for cosmic reionization. However, when accounting for binary effects, ${f_{\\rm esc}}$ can be boosted by factors of $\\sim3$--6 and ${\\xi_{\\rm ion}}$ can be boosted by a factor of $1.5$. Therefore, the ``effective'' escape fraction (the ratio of escaped ionizing photon flux to 1500\\,\\AA~flux) can be boosted by factors of $\\sim4$--10. For the more massive galaxies in our simulation, this brings them into good agreement with the values required to ionize the Universe. \n\nNevertheless, the binary fraction in high-redshift galaxies and the details of binary evolution are both uncertain, so our results are not definitive. They do, however, demonstrate the potential for binary evolution to reconcile empirical constraints on reionization by starlight with observations and simulations.\n\nThe number of ionizing photons produced decreases significantly with increasing metallicity because stellar atmospheres become significantly cooler at higher metallicity. Also, dust extinction tends to be more significant at high metallicity. As a consequence, we suspect that at lower redshift and higher mass, the escape fraction will be much lower, consistent with direct observational constraints (see references in Section \\ref{sec:intro}).  This will be studied in future work.\n\n\n\n\n\\section*{Acknowledgments}\nWe thank Allison Strom for discussions that motivated this work. \nThe simulations used in this paper were run on XSEDE computational resources (allocations TG-AST120025, TG-AST130039, and TG-AST140023). \nThe analysis was performed on the Caltech compute cluster ``Zwicky'' (NSF MRI award \\#PHY-0960291).\nSupport for PFH was provided by an Alfred P. Sloan Research Fellowship, NASA ATP Grant NNX14AH35G, and NSF Collaborative Research Grant \\#1411920 and CAREER grant \\#1455342.\nD. Kasen is supported in part by a Department of Energy Office of Nuclear Physics Early Career Award, and by the Director, Office of Energy Research, Office of High Energy and Nuclear Physics, Divisions of Nuclear Physics, of the U.S. Department of Energy under Contract No. DE-AC02-05CH11231 and by the NSF through grant AST-1109896. \nD. Kere{\\v s} was supported by NSF grant AST-1412153 and funds from the University of California, San Diego. \nCAFG was supported by NSF through grants AST-1412836 and AST-1517491, by NASA through grant NNX15AB22G, and by STScI through grant HST-AR-14293.001-A.\nEQ was supported by NASA ATP grant 12-APT12-0183, a Simons Investigator award from the Simons Foundation, and the David and Lucile Packard Foundation. \n\n\n\\begin{thebibliography}{}\n\n\\bibitem[Boutsia et al.(2011)]{boutsia.11.fesc} \n\tBoutsia, K., Grazian, A., Giallongo, E., et al.\\ 2011, {ApJ}, 736, 41\n\n\\bibitem[Boylan-Kolchin et al.(2014)]{mbk.14.faint} \n\tBoylan-Kolchin, M., Bullock, J.~S., \\& Garrison-Kimmel, S.\\ 2014, {MNRAS}, 443, L44\n\n\\bibitem[Bridge et al.(2010)]{bridge.10.fesc} \n\tBridge, C.~R., Teplitz, H.~I., Siana, B., et al.\\ 2010, {ApJ}, 720, 465\n\n\\bibitem[Chan et al.(2015)]{chan.15.dwarfs} Chan, T.~K., Kere{\\v s}, D., O{\\~n}orbe, J., et al.\\ 2015, {MNRAS}, 454, 2981 \n\n\\bibitem[de Mink et al.(2014)]{demink.14.binary} \n\tde Mink, S.~E., Sana, H., Langer, N., Izzard, R.~G., \\& Schneider, F.~R.~N.\\ 2014, {ApJ}, 782, 7\n\n\\bibitem[Eldridge et al.(2008)]{eldridge.08.binary} \n\tEldridge, J.~J., Izzard, R.~G., \\& Tout, C.~A.\\ 2008, {MNRAS}, 384, 1109\n\n\\bibitem[Faucher-Gigu{\\`e}re et al.(2009)]{fg.09.uvb}\n        Faucher-Gigu{\\`e}re, C.-A., Lidz, A., Zaldarriaga, M., \\& Hernquist, L.\\ 2009, {ApJ}, 703, 1416\n\n\\bibitem[Faucher-Gigu{\\`e}re et al.(2010)]{fg.10.lya}\n        Faucher-Gigu{\\`e}re, C.-A., Kere{\\v s}, D., Dijkstra, M., Hernquist, L., \\& Zaldarriaga, M.\\ 2010, {ApJ}, 725, 633\n\n\\bibitem[Faucher-Gigu{\\`e}re et al.(2015)]{faucher.15.absorbers} Faucher-Gigu{\\`e}re, C.-A., Hopkins, P.~F., Kere{\\v s}, D., et al.\\ 2015, {MNRAS}, 449, 987 \n\n\\bibitem[Finkelstein et al.(2012)]{finkelstein.12.model} \n\tFinkelstein, S.~L., Papovich, C., Ryan, R.~E., et al.\\ 2012, {ApJ}, 758, 93\n\n\n\tFinkelstein, S.~L., Ryan, R.~E., Jr., Papovich, C., et al.\\ 2015, {ApJ}, 810, 71\n\n\\bibitem[Fumagalli et al.(2011)]{fumagalli.11.mcrt} \n\tFumagalli, M., Prochaska, J.~X., Kasen, D., et al.\\ 2011, {MNRAS}, 418, 1796\n\n\\bibitem[Fumagalli et al.(2014)]{fumagalli.14.mcrt} \n\tFumagalli, M., Hennawi, J.~F., Prochaska, J.~X., et al.\\ 2014, {ApJ}, 780, 74\n\n\\bibitem[Giallongo et al.(2015)]{giallongo.15.agn} \n\tGiallongo, E., Grazian, A., Fiore, F., et al.\\ 2015, {A\\&A}, 578, A83\n\n\\bibitem[Graus et al.(2016)]{grause.16.reion.constraints.local} \n    Graus, A.~S., Bullock, J.~S., Boylan-Kolchin, M., \\& Weisz, D.~R.\\ 2016, {MNRAS}, 456, 477 \n\n\\bibitem[Hinshaw et al.(2013)]{hinshaw.13.wmap} \n\tHinshaw, G., Larson, D., Komatsu, E., et al.\\ 2013, {ApJS}, 208, 19\n\n\\bibitem[Hopkins et al.(2007)]{hopkins.07.agn} \n\tHopkins, P.~F., Richards, G.~T., \\& Hernquist, L.\\ 2007, {ApJ}, 654, 731\n\n\\bibitem[Hopkins(2013)]{hopkins.13.sph}\n        Hopkins, P.~F.\\ 2013, {MNRAS}, 428, 2840\n\n\\bibitem[Hopkins et al.(2013)]{hopkins.13.sf}\n        Hopkins, P.~F., Narayanan, D., \\& Murray, N.\\ 2013, {MNRAS}, 432, 2647\n\n\\bibitem[Hopkins et al.(2014)]{hopkins.14.fire} \n\tHopkins, P.~F., Kere{\\v s}, D., O{\\~n}orbe, J., et al.\\ 2014, {MNRAS}, 445, 581\n\n\\bibitem[Hopkins(2015)]{hopkins.15.gizmo}\n        Hopkins, P.~F.\\ 2015, {MNRAS}, 450, 53\n\n\\bibitem[Iwata et al.(2009)]{iwata.09.fesc} \n\tIwata, I., Inoue, A.~K., Matsuda, Y., et al.\\ 2009, {ApJ}, 692, 1287\n\n\\bibitem[Izzard et al.(2004)]{izzard.04.winds}\n        Izzard, R.~G., Tout, C.~A., Karakas, A.~I., \\& Pols, O.~R.\\ 2004, {MNRAS}, 350, 407\n\n\\bibitem[Kasen et al.(2006)]{kasen.06.sedona} \n\tKasen, D., Thomas, R.~C., \\& Nugent, P.\\ 2006, {ApJ}, 651, 366\n\n\\bibitem[Katz et al.(1996)]{katz.96.cooling} \n\tKatz, N., Weinberg, D.~H., \\& Hernquist, L.\\ 1996, {ApJS}, 105, 19\n\n\\bibitem[Kimm \\& Cen(2014)]{kimm.cen.14.fesc} \n\tKimm, T., \\& Cen, R.\\ 2014, {ApJ}, 788, 121\n\n\\bibitem[Kroupa(2002)]{kroupa.02.imf}\n        Kroupa, P.\\ 2002, Science, 295, 82\n\n\\bibitem[Kuhlen \\& Faucher-Gigu{\\`e}re(2012)]{kuhlen.fg.12}\n        Kuhlen, M., \\& Faucher-Gigu{\\`e}re, C.-A.\\ 2012, {MNRAS}, 423, 862\n\n\\bibitem[Leitet et al.(2011)]{leitet.11.fesc} \n\tLeitet, E., Bergvall, N., Piskunov, N., \\& Andersson, B.-G.\\ 2011, {A\\&A}, 532, A107\n\n\\bibitem[Leitet et al.(2013)]{leitet.13.fesc} \n\tLeitet, E., Bergvall, N., Hayes, M., Linn{\\'e}, S., \\& Zackrisson, E.\\ 2013, {A\\&A}, 553, A106\n\n\\bibitem[Leitherer et al.(1999)]{leitherer.99.sb}\n        Leitherer, C., et al.\\ 1999, {ApJS}, 123, 3\n\n\\bibitem[Ma et al.(2015)]{ma.15.fesc} \n\tMa, X., Kasen, D., Hopkins, P.~F., et al.\\ 2015, {MNRAS}, 453, 960\n\n\\bibitem[Ma et al.(2016)]{ma.16.mzr} \n\tMa, X., Hopkins, P.~F., Faucher-Gigu{\\`e}re, C.-A., et al.\\ 2016, {MNRAS}, 456, 2140\n\n\\bibitem[Madau \\& Haardt(2015)]{madau.15.agn} \n\tMadau, P., \\& Haardt, F.\\ 2015, {ApJ}, 813, L8\n\n\\bibitem[Muratov et al.(2015)]{muratov.15.outflows} Muratov, A.~L., Kere{\\v s}, D., Faucher-Gigu{\\`e}re, C.-A., et al.\\ 2015, {MNRAS}, 454, 2691 \n\n\\bibitem[O{\\~n}orbe et al.(2015)]{onorbe.15.cusps} O{\\~n}orbe, J., Boylan-Kolchin, M., Bullock, J.~S., et al.\\ 2015, {MNRAS}, 454, 2092 \n\n\\bibitem[Paardekooper et al.(2015)]{paard.15.fesc} \n\tPaardekooper, J.-P., Khochfar, S., \\& Dalla Vecchia, C.\\ 2015, {MNRAS}, 451, 2544\n\n\\bibitem[Planck Collaboration et al.(2014)]{planck.14} \n\tPlanck Collaboration, Ade, P.~A.~R., Aghanim, N., et al.\\ 2014, {A\\&A}, 571, A16\n\n\\bibitem[Robertson et al.(2013)]{robertson.13.model} \n\tRobertson, B.~E., Furlanetto, S.~R., Schneider, E., et al.\\ 2013, {ApJ}, 768, 71\n\n\\bibitem[Robertson et al.(2015)]{robertson.15.model} \n\tRobertson, B.~E., Ellis, R.~S., Furlanetto, S.~R., \\& Dunlop, J.~S.\\ 2015, {ApJ}, 802, L19\n\n\\bibitem[Siana et al.(2010)]{siana.13.fesc} \n\tSiana, B., Teplitz, H.~I., Ferguson, H.~C., et al.\\ 2010, {ApJ}, 723, 241\n\n\\bibitem[Siana et al.(2015)]{siana.15.fesc} \n\tSiana, B., Shapley, A.~E., Kulas, K.~R., et al.\\ 2015, {ApJ}, 804, 17\n\n\\bibitem[Springel(2005)]{springel.05.gadget}\n        Springel, V.\\ 2005, {MNRAS}, 364, 1105\n\n\\bibitem[Stanway et al.(2016)]{stanway.16.bpass} \n\tStanway, E.~R., Eldridge, J.~J., \\& Becker, G.~D.\\ 2016, {MNRAS}, 456, 485\n\n\\bibitem[Steidel et al.(2014)]{steidel.14.bpt} \n\tSteidel, C.~C., Rudie, G.~C., Strom, A.~L., et al.\\ 2014, {ApJ}, 795, 165\n\n\\bibitem[Wiersma et al.(2009a)]{wiersma.09.cooling}\n        Wiersma, R.~P.~C., Schaye, J., \\& Smith, B.~D.\\ 2009, {MNRAS}, 393, 99\n\n\\bibitem[Wiersma et al.(2009b)]{wiersma.09.metal}\n        Wiersma, R.~P.~C., Schaye, J., Theuns, T., Dalla Vecchia, C., \\& Tornatore, L.\\ 2009, {MNRAS}, 399, 574\n\n\\bibitem[Wise et al.(2014)]{wise.14.fesc} \n\tWise, J.~H., Demchenko, V.~G., Halicek, M.~T., et al.\\ 2014, {MNRAS}, 442, 2560\n\n\\end{thebibliography}\n\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": 20787, "prevtext": "\nas a function of age, of an instantaneously formed star cluster of mass $10^6\\,{\\rm M}_{\\odot}$, for several stellar population models from BPASS. We adopt a \\citet{kroupa.02.imf} IMF with slopes of $-1.3$ from 0.1--$0.5~{\\rm M}_{\\odot}$ and $-2.35$ from 0.5--$100\\,{\\rm M}_{\\odot}$, consistent with that used in the simulation. We show the BPASS model at metallicity $Z=0.001$ ($Z=0.05\\,{Z_{\\odot}}$, black), the lowest metallicity available and the closest to our simulations, for both single-star evolution (dotted) and binary evolution (solid) models. We also compare those with $Z=0.02$ ($Z={Z_{\\odot}}$, cyan) models from BPASS. We note that the STARBURST99 models (not shown), which are the default model in \\citet{ma.15.fesc}, are nearly identical to the single-star model from BPASS at both metallicities.\n\nThe ionizing photons produced in the single-star and binary models stay the same for the first 3\\,Myr, but start to differ significantly after 3\\,Myr at $Z=0.05\\,{Z_{\\odot}}$, with the binary model producing an order of magnitude more ionizing photons by 10\\,Myr. However, at solar metallicity, far fewer ionizing photons are produced and the difference between single-star and binary models only becomes significant after 6 Myr.\n\nWe run our MCRT code on the same galaxy to compute ${f_{\\rm esc}}$ using both single-star and binary models at $Z=0.05\\,{Z_{\\odot}}$ from BPASS. The results are presented in Figure \\ref{fig:rt}. Lines and symbols show the instantaneous value and time-averaged  values over $\\sim100\\,{\\rm Myr}$, respectively. Dotted lines and open symbols represent the single-star model, while solid lines and filled symbols represent the binary model. From top to bottom, the three panels show ${f_{\\rm esc}}$ (the ``true'' fraction of ionizing photons that escape the galaxy virial radius), ${\\xi_{\\rm ion}}$, and the ``effective'' escape fraction ${f_{\\rm esc,\\,eff}}$ as defined below, for the z5m10mr galaxy from $z=5.5$--8. The effective escape fraction is defined as\n\n", "index": 3, "text": "\\begin{equation}\n\\label{eqn:feff}\n{f_{\\rm esc,\\,eff}} = {f_{\\rm esc}} \\frac{{\\xi_{\\rm ion}}}{{\\langle{\\xi_{\\rm ion}}\\rangle_{\\rm single}}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"{f_{\\rm esc,\\,eff}}={f_{\\rm esc}}\\frac{{\\xi_{\\rm ion}}}{{\\langle{\\xi_{\\rm ion}%&#10;}\\rangle_{\\rm single}}},\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mrow><mi>esc</mi><mo rspace=\"4.2pt\">,</mo><mi>eff</mi></mrow></msub><mo>=</mo><mrow><msub><mi>f</mi><mi>esc</mi></msub><mo>⁢</mo><mfrac><msub><mi>ξ</mi><mi>ion</mi></msub><msub><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>ξ</mi><mi>ion</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mi>single</mi></msub></mfrac></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]