[{"file": "1601.07038.tex", "nexttext": "\nwhere $\\Theta_D$ is the Debye temperature, $\\mu^*$ is the dimensionless Coulomb pseudopotential\nwhich describes the effect of the Coulomb repulsion.\nWe assume the bulk values for these parameters justified by the fact that the niobium host is rather thick.\nThe parameter $\\lambda_{eff}$ is an effective electron-phonon coupling for the whole system.\nFollowing the argument of de Gennes~\\cite{Yamazaki2,dGformula} the simplest way to define such an effective electron-phonon interaction parameter\nin an inhomogeneous system is by an averaging process described in the following way.\nLet us interpret $D_{Au}(\\varepsilon_F)t_{Au} /(D_{Nb}(\\varepsilon_F)t_{Nb}\n+ D_{Au}(\\varepsilon_F)t_{Au})$ as a probability of finding an electron in the normal metal layers (Au) and\n$D_{Nb}(\\varepsilon_F)t_{Nb} / (D_{Nb}(\\varepsilon_F)t_{Nb} + D_{Au}(\\varepsilon_F)t_{Au})$ in the superconducting Nb layers.\nThen the $\\lambda_{eff}$ effective electron-phonon coupling can be defined as\n\n", "itemtype": "equation", "pos": 14364, "prevtext": "\n\\special{header=psfrag.pro}\n\n\n\n\n\n\n\\title{Prediction of superconducting transition temperatures of heterostructures based on first principles}\n\n\\author{G{\\'{a}}bor \\surname{Csire}}\n\\affiliation{Institute for Solid State Physics and Optics,\n             Wigner Research Centre for Physics, Hungarian Academy of Sciences, \\\\\n             PO Box 49, H-1525 Budapest, Hungary}\n\\affiliation{Department of Physics of Complex Systems, E{\\\"{o}}tv{\\\"{o}}s University,\n             H-1117 Budapest, P{\\'a}zm{\\'a}ny P{\\'e}ter s{\\'e}t{\\'a}ny 1/A, Hungary}\n\n\\author{J{\\'o}zsef Cserti}\n\\affiliation{Department of Physics of Complex Systems, E{\\\"{o}}tv{\\\"{o}}s University,\n             H-1117 Budapest, P{\\'a}zm{\\'a}ny P{\\'e}ter s{\\'e}t{\\'a}ny 1/A, Hungary}\n\n\\author{Istv\\'{a}n T\\\"{u}tt\\H{o}}\n\\affiliation{Institute for Solid State Physics and Optics,\n             Wigner Research Centre for Physics, Hungarian Academy of Sciences, \\\\\n             PO Box 49, H-1525 Budapest, Hungary}\n\n\\author{Bal{\\'a}zs {\\'U}jfalussy}\n\\affiliation{Institute for Solid State Physics and Optics,\n             Wigner Research Centre for Physics, Hungarian Academy of Sciences, \\\\\n             PO Box 49, H-1525 Budapest, Hungary}\n\n\\date{\\today}\n\n\\begin{abstract}\n\nThe prediction of material-specific properties of superconducting systems\nsuch as the electronic structure and the transition temperature\nis one of the major challenge in modern solid-state physics.\nIn this paper we present the first material specific calculations\nof realistic superconductor -- normal metal heterostructures using density functional theory.\nIn particular, we calculate the quasiparticle spectrum of different normal metal overlayers on a Nb(100) host.\nWe find that the Andreev reflection leads to the formation of momentum dependent quasiparticle bands in the normal metal.\nAs a consequence, the spectrum has a strongly momentum dependent induced gap.\nFrom the thickness dependence of the gap size we calculate the superconducting critical temperature\nof Au/Nb(100) heterostructures where we find very good agreement with experiments. Moreover, predictions are\nmade for similar heterostructures of other compounds.\n\\end{abstract}\n\n\n\\maketitle\n\n\n\n\n\n\nModern material science now allows to produce thin film  materials\nthat consists  of several layers of various metals, in a way that some of these layers may become superconductors at low enough temperatures\n~\\cite{Yamazaki1, Yamazaki2, Ferrier}.\nSuch artificial composite materials are called superconductor-metal heterostructures, and their importance lies in the fact that\nevery superconducting device, for the foreseeable future, will have to interface with normal metals, which\ncarries power to it. These structures are also an ideal testing grounds for theories of low-dimensional superconductivity, which may\nlater become the basis of new devices and sensors. Therefore it is extremely important to understand the physics behind such interfaces,\nto make them more suitable for a given purpose.\n\nOne of the key experiment~\\cite{Yamazaki1, Yamazaki2} in the study of superconductor-metal heterostructures was carried out on\nan extremely thin layer of gold grown on top of a thicker Nb host.\nIn this experiment, while the thickness of the Nb sample (288~{\\AA}) was in the order of the superconducting coherence length (380~{\\AA}),\nthe gold overlayer was only a couple of atomic layers thick.\nIn order to investigate the superconducting properties of\nsuch bilayers, magnetization and magnetic susceptibility measurements were performed using a\nsuperconducting quantum interference device magnetometer~(SQUID)~\\cite{Yamazaki2}.\nIt was found that the superconducting transition temperature is significantly lowered in this composite\ncompared to the bulk, and it decays monotonically as the thickness of the gold overlayer increases.\n\nThe explanation of the above experiment poses a great challenge to theory because the standard theory of superconductivity, the BCS theory,\ndoes not describe inhomogeneous systems easily.\nHowever such systems can be treated efficiently in terms of the Bogoliubov-de Gennes (BdG) equations~\\cite{Bogo,deGennes}, \nwhich recently has been extended to a more material specific form~\\cite{Luders1,Luders2,Csire} leading to the so called Kohn-Sham-Bogoliubov-deGennes (KS-BdG) equations.\nIn principle these equations are able to describe systems with inhomogeneities in the pairing potential closely related\nto the superconducting gap $\\Delta$.\n\nSeveral theoretical studies on various model systems showed that in such inhomogeneous systems like multilayers,\nit is possible to find bound quasiparticle states which are a coherent mixture of electron and hole states.\nThese states have been found theoretically in superconductor -- normal metal -- superconductor\nheterostructures~\\cite{Andreev66} and in other systems as well~\\cite{deGennes63,Caroli}.\nThe Andreev reflection~\\cite{Andreev64} has been identified as the key effect which\nleads to the formation of such bound states, often referred to as Andreev bound states:\nin a semiclassical approximation, an electron with energy lying in the superconducting gap, arriving from the normal metal to the\ninterface is retro-reflected as a hole and a Cooper pair is formed with an electron of opposite spin in the superconductor.\nAlthough the properties of Andreev bound states became an intensively studied research field~\\cite{Fuechsle,Pillet,Dirks,Bretheau,Mayaffre},\ntheir material specific dispersion, namely their band structure, has never been calculated (nor observed experimentally) to date.\nOur aim in this paper is to make up for this deficiency in the theory and calculate the dispersion relation of Andreev states.\nWe also verify that this effect enables the transport of supercurrents through non-superconducting materials, and\nis the key to predict the superconducting transition temperature in the whole system.\n\nIn what follows we numerically solve the  above mentioned KS-BdG equations, as it was described in Ref.~\\cite{Csire}, for an \nAu/Nb(100) overlayer system.\nFor varying Au thicknesses we calculate the quasiparticle electronic structure and obtain the superconducting gap for each thickness.\nFinally a method is developed to calculate the critical temperature.\n\n\n\n\n\n\n\n\nThe first step down this road is to construct a realistic model of the interface lattice structure.\nSuch a model can be built up from two-dimensional translational invariant atomic layers as follows.\nWe divide the system into three regions: (i) a semi-infinite bulk (Nb); (ii) the interface region\nthat -- in our case -- consists of six superconducting layers (Nb), various number of normal metal layers and\nthree layers of empty spheres; (iii) and a semi-infinite vacuum.\nAlthough the thickness of the Nb layers in the experiment is not strictly semi-infinite, it is thick enough to be \napproximated by a semi-infinite bulk system. We use six Nb layers to mimic the transition between the semi-infinite bulk and the \noverlayer. The Nb has the body-centered cubic (bcc) crystal structure with a lattice parameter of $a = 3.3$~\\AA.\nWe assume the realistic face-centered cubic (fcc) crystal structure for the gold overlayers, and the termination of the material layers are\nmodeled by a semi-infinite vacuum. We also neglect imperfections at the interface, like interlayer relaxations and intermixing.\n\nIn such systems, where translational invariance is preserved only parallel to the interface, the quasiparticle spectrum  is obtained\nas a function of a two dimensional momentum vector $\\vec{k}_{||}$ . To visualize this spectrum, it is customary to calculate the Bloch spectral function (BSF).\nA three dimensional purely electronic system would result in a BSF which is a delta function every time when $\\varepsilon$\nand $\\vec{k}$ form a band. In two dimensionally translational invariant systems this is not always the case,\nand the BSF for layer $I$ is defined as\n$A_B^I(\\varepsilon, \\vec{k}_{||})= -\\frac{1}{\\pi} \\mathrm{Im} G_{II}(\\varepsilon,\\vec{k}_{||})$,\nwhere $G_{II}$ is the layer projected Green function (see Ref.~\\cite{Csire}).\nHowever, the integral of the BSF over the 2D Brillouin zone still gives the density of states in a layer resolved way.\nSince the BSF is equivalent to the quasiparticle spectrum, drawing a contour plot of\nthe BSF as a function of energy along specified directions of $\\vec{k}_{||}$ is a powerful tool to visualize the quasiparticle states.\nEvidently, in a layered system this contour plot can be done for each layer.\n\nIn order to understand the quasiparticle spectrum in the superconducting state better, let us first perform a calculation \njust in the normal state, by simply solving the Schr\\\"{o}dinger equation for the\nAu/Nb(001) overlayer system. In Fig.~\\ref{fig:normal1} we show the contour plot of the BSF\nfor a layer that we considered to be in the \"middle\" of the samples of various Au layer thicknesses.\nThe plots are restricted in energy to the range of [-0.05~Ry,0.05~Ry] (later we will choose\n${\\Delta}_{Nb}$, the superconducting gap to equal this value, and solve the BdG equations within this energy range).\nWhen Fig.~\\ref{fig:normal1} viewed as a sequence, one can immediately recognize the signatures of\nquantum confinement. For energies where the DOS in the bulk Nb is low, the states in the Au are confined, as they can not scatter into the Nb,\nand on the other side the system is limited by vacuum. In regions where the DOS is high in the Nb, the states in the Au\nare smeared out, as here the electrons can scatter more easily into the other side of the interface. The confined states\nin the Au, therefore, can be regarded as quantum-well (QW) states. \n\n\\begin{figure}[hbt!]\n   \\includegraphics[width=1\\linewidth]{./spectr_norm.jpg}\n   \\caption{\\label{fig:normal1}\n            Contour plot of the spectral function of Au/Nb(001) (normal state band structure)\n            from the \"middle\" of the gold layers for different thicknesses of the gold:\n            3 Au layers (a) and 6 Au layers (b)\n            9 Au layers (c) and 24 Au layers (d). }\n\\end{figure}\n\n\nNow let us consider the Nb in the superconducting state and solve the first-principles BdG equations as\ndescribed in Ref.~\\cite{Csire}. In this formalism each layer is characterized by an additional, potential-like parameter,\nthe  superconducting gap ${\\Delta}$. To solve\nthe BdG equation we will assume that all Nb layers show the same superconducting gap ${\\Delta}_{Nb}=0.05$~Ry. This is a much larger value\nthan the gap observed experimentally, in order to make it easier to visualize the quasiparticle spectrum. We also assume, that the\nsuperconducting gap is zero in the Au layers, namely we set ${\\Delta}_{Au}=0.0$Ry, as Au is not superconducting at all in the bulk.\n\nBased on the symmetry of the BdG equations it is known, that in bulk superconductors the quasiparticle states can be obtained\nfrom the electronic states by mirroring the band structure of the normal state to the Fermi energy and opening up a gap.\nIn the case of our inhomogeneous system the situation is entirely different, and the main question is how  the niobium host affects \nthe quasiparticle spectrum of the gold overlayers.\nIn Fig.~\\ref{fig:supra_band} we plot the BSF summed for all Au layers in the case of different number of gold layers\n(left hand side of the figure).\nTo illustrate the role of the crystal structure, on the right hand side of the figure we also show results of the same calculations \nperformed by assuming bcc Au layers throughout the overlayer. This is not entirely unrealistic for very thin layers but most \nlikely artificial for thicker ones, where the Au layers\nmost certainly grow in an fcc structure. Unfortunately there is very little known of the crystal structures of thin Au layers on Nb.\n\nWe can immediately see from Fig.~\\ref{fig:supra_band}, that the proximity of a superconductor\nin the studied heterostructures induces the expected mirroring of the electronic bands, and additionally opens up a\ngap at each band crossing.\nOne can also see from the figure that the size of the induced gap in the gold is strongly $\\vec{k}_{||}$-dependent,\nand it is the same for all layers, however, it decreases as function of the thickness of the gold overlayers.\nIt should be noted as well that those regions of the spectrum which were more or less smeared out in the normal state\n(visualized in the figure by weaker lines) now sharpened up.\nThis is the consequence of the opening of the superconducting gap in the Nb: the states where scattering\ninto was allowed before, now disappeared because of the gap.\nWe can also conclude from the figure that the quantum-well states, which we found to exist in the normal state band structure calculations,\nbecome bound Andreev states originating from the Andreev scattering at the interface.\nFinally, since Fig.~\\ref{fig:supra_band} was obtained by summing up $A_B^I(\\varepsilon, \\vec{k}_{||})$, and this sum does not show any significant\nbroadening, it is clear that the quasiparticle spectrum is virtually identical in every interfacial layer.\nIn Fig.~\\ref{fig:supra_band} one can also observe changes in the quasiparticle spectrum owing to different lattice structures.\nIn particularly, more `oscillations' can be seen in fcc gold overlayers compared to the bcc ones,\nwhich is the consequence of the more bands of the fcc gold in the normal state.\nAlso, there is a very sharp, almost  horizontal band in the case of bcc gold, which originates from the interface layers only.\nThis interface state does not appear in the case of fcc gold, so while its appearance is rather interesting, it is entirely fictitious.\n\n\n\\begin{figure}[hbt!]\n   \\includegraphics[width=1\\linewidth]{./spectr_sum.jpg}\n   \\caption{\\label{fig:supra_band}\n            Contour plot of the BSF summed for all Au layers of Au/Nb(001) in the case of different different thicknesses of the Au:\n            3 bcc Au layers (a1), 9 bcc Au layers (b1),\n            24 bcc Au layers (c1), and\n            3 fcc Au layers (a2), 9 fcc Au layers (b2),\n            24 fcc Au layers (c2). The momentum vector k is shown along the $k_x=k_y$ line in the 2D Brillouin zone.}\n\\end{figure}\n\n\n\n\n\n\n\n\nWe are now ready to calculate the superconducting transition temperature $T_c$.\nIn the strong-coupling limit (e.g. in the case of Nb) the $T_c$ is given by the McMillan formula\n\n", "index": 1, "text": "\\begin{equation}\n  T_c= \\frac{\\Theta_D}{1.45} \\exp{\\left(-\\frac{1.04(1+\\lambda_{eff})}{\\lambda_{eff}-\\mu^*(1+0.62\\lambda_{eff})}\\right) },\n  \\label{eq:McMillan}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"T_{c}=\\frac{\\Theta_{D}}{1.45}\\exp{\\left(-\\frac{1.04(1+\\lambda_{eff})}{\\lambda_%&#10;{eff}-\\mu^{*}(1+0.62\\lambda_{eff})}\\right)},\" display=\"block\"><mrow><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>=</mo><mrow><mfrac><msub><mi mathvariant=\"normal\">Θ</mi><mi>D</mi></msub><mn>1.45</mn></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><mfrac><mrow><mn>1.04</mn><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>-</mo><mrow><msup><mi>μ</mi><mo>*</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mrow><mn>0.62</mn><mo>⁢</mo><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mfrac></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07038.tex", "nexttext": "\nwhere $t_{Nb}$ and $t_{Au}$ are the thickness of the Nb and Au layers, respectively,  and $D(\\varepsilon_F)$ is the density of states\nat the Fermi level.\nSince the whole niobium -- gold system is superconducting (a common $T_c$ obtained experimentally in Ref. \\cite{Yamazaki1, Yamazaki2})\nCooper pairs must exist throughout the whole system. Therefore, the existence of the superconducting gap in the Au layers can be viewed\nin a way that the proximity of the superconductor induces an effective $\\lambda_{Au}$ electron-phonon coupling in the gold,\nwhich in turn can be obtained from the induced gap $\\Delta'_{Au}$ according to the BCS gap equation:\n\n", "itemtype": "equation", "pos": 15510, "prevtext": "\nwhere $\\Theta_D$ is the Debye temperature, $\\mu^*$ is the dimensionless Coulomb pseudopotential\nwhich describes the effect of the Coulomb repulsion.\nWe assume the bulk values for these parameters justified by the fact that the niobium host is rather thick.\nThe parameter $\\lambda_{eff}$ is an effective electron-phonon coupling for the whole system.\nFollowing the argument of de Gennes~\\cite{Yamazaki2,dGformula} the simplest way to define such an effective electron-phonon interaction parameter\nin an inhomogeneous system is by an averaging process described in the following way.\nLet us interpret $D_{Au}(\\varepsilon_F)t_{Au} /(D_{Nb}(\\varepsilon_F)t_{Nb}\n+ D_{Au}(\\varepsilon_F)t_{Au})$ as a probability of finding an electron in the normal metal layers (Au) and\n$D_{Nb}(\\varepsilon_F)t_{Nb} / (D_{Nb}(\\varepsilon_F)t_{Nb} + D_{Au}(\\varepsilon_F)t_{Au})$ in the superconducting Nb layers.\nThen the $\\lambda_{eff}$ effective electron-phonon coupling can be defined as\n\n", "index": 3, "text": "\\begin{equation}\n\\lambda_{eff}= \\frac{ \\lambda_{Nb} D_{Nb}(\\varepsilon_F)t_{Nb}+ \\lambda_{Au} D_{Au}(\\varepsilon_F)t_{Au}}{D_{Nb}(\\varepsilon_F)t_{Nb} + D_{Au}(\\varepsilon_F)t_{Au}},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{eff}=\\frac{\\lambda_{Nb}D_{Nb}(\\varepsilon_{F})t_{Nb}+\\lambda_{Au}D_{%&#10;Au}(\\varepsilon_{F})t_{Au}}{D_{Nb}(\\varepsilon_{F})t_{Nb}+D_{Au}(\\varepsilon_{%&#10;F})t_{Au}},\" display=\"block\"><mrow><mrow><msub><mi>λ</mi><mrow><mi>e</mi><mo>⁢</mo><mi>f</mi><mo>⁢</mo><mi>f</mi></mrow></msub><mo>=</mo><mfrac><mrow><mrow><msub><mi>λ</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msub><mo>⁢</mo><msub><mi>D</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ε</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>t</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msub></mrow><mo>+</mo><mrow><msub><mi>λ</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub><mo>⁢</mo><msub><mi>D</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ε</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>t</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub></mrow></mrow><mrow><mrow><msub><mi>D</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ε</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>t</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msub></mrow><mo>+</mo><mrow><msub><mi>D</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>ε</mi><mi>F</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>t</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub></mrow></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07038.tex", "nexttext": "\nThis induced gap $\\Delta'_{Au}$ can be read off from the quasiparticle spectrum shown in Fig.~\\ref{fig:supra_band}.\nIt should be noted that the whole calculation of the quasiparticle spectrum needs to be repeated with a more realistic value for $\\Delta_{Nb}$,\nsince as we mentioned earlier for better visualization we used artificially large $\\Delta_{Nb}$ in Fig.~\\ref{fig:supra_band}.\nWhile the BCS theory is valid only for the weak-coupling limit, nevertheless we apply the BCS gap equation here to the gold layers\nsince the induced gap is much smaller than the gap in the Nb.\nTo obtain the induced gap, we always take the maximum of the induced gap around the Fermi energy (as a function of $\\vec{k}_{||}$)  in the Brillouin zone because the maximum of the gap is the most characteristic of the strength of the electron-phonon coupling.\nIn summary, the $\\Delta'_{Au}$ induced gap can be read off from the calculated quasiparticle spectrum\nas the function of the thickness of the gold overlayers (see Fig. \\ref{fig:gap}), and the critical temperature can be calculated\nfrom the  McMillan-formula given by Eq.~(\\ref{eq:McMillan}).\nFigure \\ref{fig:tc} shows the critical temperature as a function of the thickness of Au overlayers obtained from the above procedure\ntogether with experimental results taken from the papers~\\cite{Yamazaki1, Yamazaki2}.\nOne can see clearly that our theoretical results are in very good agreement with the experimental findings, all points are within the experimental errors.\nMoreover, the slow decrease of the critical temperature as function of the Au overlayer thickness is well reproduced.\nWe should emphasize that our theory contains only one parameter, namely the critical temperature for bulk niobium.\nWhile in principles this quantity can be calculated~\\cite{Klein}, here for simplicity we take its experimental value.\n\n\\begin{figure}[hbt!]\n   \\includegraphics[width=0.85\\linewidth]{./gap.jpg}\n   \\caption{\\label{fig:gap}\n            (Color online) Induced gap on the gold layers as function of the thickness of the gold.}\n\\end{figure}\n\n\\begin{figure}[hbt!]\n   \\includegraphics[width=0.85\\linewidth]{./tc.jpg}\n   \\caption{\\label{fig:tc}\n            (Color online) The critical temperature as function of the thickness of the gold obtained from the McMillan formula.\n            The points with the error bars are the experimental results from Ref.~\\cite{Yamazaki2}}\n\\end{figure}\n\nOur theory presented above can be applied to other overlayer systems like NbAg, NbIr, NbAl and NbMo, and the superconducting transition temperature can be predicted.\nThe dependence of the critical temperature on the thickness of normal metal layers in these composites is shown in Fig.~\\ref{fig:tc_more}. It can be seen that the general trend is that the superconducting transition temperature decays as the normal metal thickness is\nincreased for all systems, only the rate of the decay depends on the material of the overlayer.\nThis behavior is a consequence of the size of the induced gap in the normal\nmetal and also the change of the density of states at the Fermi level which enters the McMillan formula\nthrough the effective electron-phonon coupling parameter.\nThis is most pronounced for the case of iridium overlayers, where the decay of transition temperature is the fastest, mostly due to the\nmuch higher density of states at the Fermi level.\n\n\\begin{figure}[hbt!]\n   \\includegraphics[width=0.85\\linewidth]{./more_tc.jpg}\n   \\caption{\\label{fig:tc_more}\n            (Color online) The critical temperature as function of the thickness in the case of different metal overlayers.}\n\\end{figure}\n\n\n\n\n\n\nIn summary, we have investigated the quasiparticle spectrum, and the superconducting\ntransition temperature of superconductor -- normal metal heterostructures.\nWe have developed a method to predict the transition temperature of such heterostructures based on the self-consistent solution of the\nKS-BdG equations.\nIn the case of the niobium -- gold system we obtained very good agreement with the experimental findings.\nOur theory was also applied for different metal overlayers on a Nb host to predict the superconducting transition\ntemperature.\nThus, our theoretical approach provides first principles based method for the systematic investigation of\nsuperconducting thin film heterostructures.\n\n\n\n\n\n{\\emph{Acknowledgment}} ---  This work was supported by the Hungarian  National, Research, Development and Innovation Office\nunder the contracts No. K115632 and K108676.\n\n\n\n\n\n\n\n\n\n\n\n\\begin{thebibliography}{19}\n\n\\providecommand{\\bibinfo}[2]{#2}\n\\providecommand{\\eprint}[2][]{\\url{#2}}\n\n\\bibitem{Yamazaki1}\n\\bibinfo{author}{Yamazaki, H.}, \\bibinfo{author}{Shannon, N.} \\&\n  \\bibinfo{author}{Takagi, H.}\n\\newblock \\bibinfo{title}{Interplay between superconductivity and\n  ferromagnetism in epitaxial Nb(110)/Au(111)/Fe(110) trilayers}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. B}} \\textbf{\\bibinfo{volume}{73}},\n  \\bibinfo{pages}{094507} (\\bibinfo{year}{2006}).\n\n\\bibitem{Yamazaki2}\n\\bibinfo{author}{Yamazaki, H.}, \\bibinfo{author}{Shannon, N.} \\&\n  \\bibinfo{author}{Takagi, H.}\n\\newblock \\bibinfo{title}{Interplay between superconductivity and\n  ferromagnetism in epitaxial Nb(110)/Au(111)/Co(0001) trilayers}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. B}} \\textbf{\\bibinfo{volume}{81}},\n  \\bibinfo{pages}{094503} (\\bibinfo{year}{2010}).\n\n\\bibitem{Ferrier}\n\\bibinfo{author}{Dassonneville, B.}, \\bibinfo{author}{Ferrier, M.},\n  \\bibinfo{author}{Gu\\'eron, S.} \\& \\bibinfo{author}{Bouchiat, H.}\n\\newblock \\bibinfo{title}{Dissipation and supercurrent fluctuations in a\n  diffusive normal-metal -- superconductor ring}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. Lett.}}\n  \\textbf{\\bibinfo{volume}{110}}, \\bibinfo{pages}{217001}\n  (\\bibinfo{year}{2013}).\n\n\\bibitem{Bogo}\n\\bibinfo{author}{Bogoliubov, N.~N.}\n\\newblock \\emph{\\bibinfo{journal}{JETP USSR}} \\textbf{\\bibinfo{volume}{34}},\n  \\bibinfo{pages}{58} (\\bibinfo{year}{1958}).\n\n\\bibitem{deGennes}\n\\bibinfo{author}{de~Gennes, P.~G.}\n\\newblock \\emph{\\bibinfo{title}{Superconductivity of Metals and Alloys}}\n  (\\bibinfo{publisher}{W. A. Benjamin}, \\bibinfo{address}{New York},\n  \\bibinfo{year}{1966}).\n\n\\bibitem{Luders1}\n\\bibinfo{author}{L\\\"uders, M.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Ab initio theory of superconductivity. I. density\n  functional formalism and approximate functionals}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. B}} \\textbf{\\bibinfo{volume}{72}},\n  \\bibinfo{pages}{024545} (\\bibinfo{year}{2005}).\n\n\\bibitem{Luders2}\n\\bibinfo{author}{Marques, M. A.~L.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Ab initio theory of superconductivity. II.\n  application to elemental metals}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. B}} \\textbf{\\bibinfo{volume}{72}},\n  \\bibinfo{pages}{024546} (\\bibinfo{year}{2005}).\n\n\\bibitem{Csire}\n\\bibinfo{author}{Csire, G.}, \\bibinfo{author}{\\'Ujfalussy, B.},\n  \\bibinfo{author}{Cserti, J.} \\& \\bibinfo{author}{Gy\\ifmmode~\\mbox{\\H{o}}\\else\n  \\H{o}\\fi{}rffy, B.}\n\\newblock \\bibinfo{title}{Multiple scattering theory for superconducting\n  heterostructures}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. B}} \\textbf{\\bibinfo{volume}{91}},\n  \\bibinfo{pages}{165142} (\\bibinfo{year}{2015}).\n\n\\bibitem{Andreev66}Electron Spectrum of the Intermediate State of Superconductors\n\\bibinfo{author}{Andreev, A.~F.}\n\\newblock \\bibinfo{title}{Electron Spectrum of the Intermediate State of Superconductors}.\n\\newblock \\emph{\\bibinfo{journal}{Sov. Phys. JETP}}\n  \\textbf{\\bibinfo{volume}{22}}, \\bibinfo{pages}{455} (\\bibinfo{year}{1966}).\n\n\\bibitem{deGennes63}\n\\bibinfo{author}{de~Gennes, P.} \\& \\bibinfo{author}{Saint-James, D.}\n\\newblock \\bibinfo{title}{Elementary excitations in the vicinity of a normal\n  metal-superconducting metal contact}.\n\\newblock \\emph{\\bibinfo{journal}{Physics Letters}}\n  \\textbf{\\bibinfo{volume}{4}}, \\bibinfo{pages}{151 -- 152}\n  (\\bibinfo{year}{1963}).\n\n\\bibitem{Caroli}\n\\bibinfo{author}{Caroli, C.}, \\bibinfo{author}{Gennes, P.~D.} \\&\n  \\bibinfo{author}{Matricon, J.}\n\\newblock \\bibinfo{title}{Bound fermion states on a vortex line in a type\n  II superconductor}.\n\\newblock \\emph{\\bibinfo{journal}{Physics Letters}}\n  \\textbf{\\bibinfo{volume}{9}}, \\bibinfo{pages}{307 -- 309}\n  (\\bibinfo{year}{1964}).\n\n\\bibitem{Andreev64}\n\\bibinfo{author}{Andreev, A.~F.}\n\\newblock \\bibinfo{title}{The Thermal Conductivity of the Intermediate State in Superconductors}.\n\\newblock \\emph{\\bibinfo{journal}{Sov. Phys. JETP}}\n  \\textbf{\\bibinfo{volume}{19}}, \\bibinfo{pages}{1228} (\\bibinfo{year}{1964}).\n\n\\bibitem{Fuechsle}\n\\bibinfo{author}{Fuechsle, M.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Effect of microwaves on the current-phase relation of\n  superconductor\\char21{}normal-metal\\char21{}superconductor Josephson\n  junctions}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. Lett.}}\n  \\textbf{\\bibinfo{volume}{102}}, \\bibinfo{pages}{127001}\n  (\\bibinfo{year}{2009}).\n\n\\bibitem{Pillet}\n\\bibinfo{author}{Pillet, J.~D.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Andreev bound states in supercurrent-carrying carbon\n  nanotubes revealed}.\n\\newblock \\emph{\\bibinfo{journal}{Nat Phys}} \\textbf{\\bibinfo{volume}{6}},\n  \\bibinfo{pages}{965--969} (\\bibinfo{year}{2010}).\n\n\\bibitem{Dirks}\n\\bibinfo{author}{Dirks, T.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Transport through Andreev bound states in a graphene\n  quantum dot}.\n\\newblock \\emph{\\bibinfo{journal}{Nat Phys}} \\textbf{\\bibinfo{volume}{7}},\n  \\bibinfo{pages}{386--390} (\\bibinfo{year}{2011}).\n\n\\bibitem{Bretheau}\n\\bibinfo{author}{Bretheau, L.}, \\bibinfo{author}{Girit, C.~O.},\n  \\bibinfo{author}{Pothier, H.}, \\bibinfo{author}{Esteve, D.} \\&\n  \\bibinfo{author}{Urbina, C.}\n\\newblock \\bibinfo{title}{Exciting Andreev pairs in a superconducting atomic\n  contact}.\n\\newblock \\emph{\\bibinfo{journal}{Nature}} \\textbf{\\bibinfo{volume}{499}},\n  \\bibinfo{pages}{312--315} (\\bibinfo{year}{2013}).\n\n\\bibitem{Mayaffre}\n\\bibinfo{author}{Mayaffre, H.} \\emph{et~al.}\n\\newblock \\bibinfo{title}{Evidence of Andreev bound states as a hallmark of the\n  fflo phase in $\\kappa$-(BEDT-TTF)$_2$Cu(NCS)$_2$}.\n\\newblock \\emph{\\bibinfo{journal}{Nat Phys}} \\textbf{\\bibinfo{volume}{10}},\n  \\bibinfo{pages}{928--932} (\\bibinfo{year}{2014}).\n\n\\bibitem{dGformula}\n\\bibinfo{author}{De~Gennes, P.~G.}\n\\newblock \\bibinfo{title}{Boundary effects in superconductors}.\n\\newblock \\emph{\\bibinfo{journal}{Rev. Mod. Phys.}}\n  \\textbf{\\bibinfo{volume}{36}}, \\bibinfo{pages}{225--237}\n  (\\bibinfo{year}{1964}).\n\n\\bibitem{Klein}\n\\bibinfo{author}{Klein, B.~M.} \\& \\bibinfo{author}{Papaconstantopoulos, D.~A.}\n\\newblock \\bibinfo{title}{Electron-phonon interaction and superconductivity in\n  transition metals and transition-metal carbides}.\n\\newblock \\emph{\\bibinfo{journal}{Phys. Rev. Lett.}}\n  \\textbf{\\bibinfo{volume}{32}}, \\bibinfo{pages}{1193--1195}\n  (\\bibinfo{year}{1974}).\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 16358, "prevtext": "\nwhere $t_{Nb}$ and $t_{Au}$ are the thickness of the Nb and Au layers, respectively,  and $D(\\varepsilon_F)$ is the density of states\nat the Fermi level.\nSince the whole niobium -- gold system is superconducting (a common $T_c$ obtained experimentally in Ref. \\cite{Yamazaki1, Yamazaki2})\nCooper pairs must exist throughout the whole system. Therefore, the existence of the superconducting gap in the Au layers can be viewed\nin a way that the proximity of the superconductor induces an effective $\\lambda_{Au}$ electron-phonon coupling in the gold,\nwhich in turn can be obtained from the induced gap $\\Delta'_{Au}$ according to the BCS gap equation:\n\n", "index": 5, "text": "\\begin{equation}\n  \\lambda_{Au}=-\\frac{1}{\\log \\left (\\frac{\\Delta'_{Au}}{2\\hbar \\omega_D^{Nb}} \\right)} .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\lambda_{Au}=-\\frac{1}{\\log\\left(\\frac{\\Delta^{\\prime}_{Au}}{2\\hbar\\omega_{D}^%&#10;{Nb}}\\right)}.\" display=\"block\"><mrow><mrow><msub><mi>λ</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow></msub><mo>=</mo><mrow><mo>-</mo><mfrac><mn>1</mn><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msubsup><mi mathvariant=\"normal\">Δ</mi><mrow><mi>A</mi><mo>⁢</mo><mi>u</mi></mrow><mo>′</mo></msubsup><mrow><mn>2</mn><mo>⁢</mo><mi mathvariant=\"normal\">ℏ</mi><mo>⁢</mo><msubsup><mi>ω</mi><mi>D</mi><mrow><mi>N</mi><mo>⁢</mo><mi>b</mi></mrow></msubsup></mrow></mfrac><mo>)</mo></mrow></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]