[{"file": "1601.05687.tex", "nexttext": "\nwhere $\\alpha = a(T-Tc)$, and the other phenomenological coefficients are constant. This order-parameter expansion is essentially different from the seminal model by Kittel \\cite{Kittel1951} as it involves a single symmetry-breaking AFE order-parameter $\\eta$, the polarization $P$ being a field-induced order-parameter. It expresses the property that a polar phase requires the mediation of the AFE order parameter to be stabilized upon application of an electric field. \n\nMinimizing $\\phi$ with respect to $\\eta$ and $P$ yields the equations of state:\n\\begin{eqnarray}\n\\eta(\\alpha + \\beta \\eta^2 + \\gamma \\eta^4 + \\delta P^2) & = & 0 \\label{eq:eos1}\\\\\nP(1+\\delta\\chi_0\\eta^2) & = & \\chi_0 E \\label{eq:eos2}\n\\end{eqnarray}\n\nAt $E=0$, Eqs.~(\\ref{eq:eos1}) and (\\ref{eq:eos2}) yield two possible stable phases: the PA phase ($\\eta=0$, $P=0$) and the AFE phase ($\\eta\\neq 0$, $P=0$). For $E\\neq 0$ two additional phases are stabilized: a FE phase ($\\eta =0$, $P\\neq 0$) in which the AFE antiparallel dipole configuration is absent, and a phase in which the AFE ordering  ($\\eta\\neq 0$) has a non-zero total polarization ($P\\neq 0$), i.e. having either a ferrielectric (FI)-type of dipolar order or a \"weak\" ferroelectric (WF) order, analogous to weak ferromagnetism, with a canting between antiparallel arrays of dipoles. Fig. 3(a) and 3(b) shows the location of these two field-induced phases in theoretical $\\alpha$--$E$ phase diagrams.  \n\n\\begin{figure}[b]\n\\begin{center}\n\\includegraphics[width=0.48\\textwidth]{figure3}\n\\end{center}\n\\caption{Theoretical Temperature-Field ($\\alpha$--$E$) phase diagrams associated with the free-energy given by Eq.~(\\ref{eq:potential}), with $\\beta > 0$, showing the location of the FE ((a)--(b)) and FI or WF phases (b) with respect to the AFE phase. Hatched and solid curves correspond respectively to second and first-order transitions. In (b) the region of stability of the FE phase is embedded in the region of stability of the FI or WF phase, whereas in (a) it is bounded by the AFE phase. The double arrow in (a) shows the thermodynamic path followed on increasing or decreasing $E$.}\n\\label{fig:3}\n\\end{figure}\n\nOne can deduce from Eq.(\\ref{eq:eos2}) the temperature dependence of the dielectric susceptibility  at the PA$\\rightarrow$AFE transition. For a second-order transition ($\\beta > 0$) one gets below $T_c$:\n\n", "itemtype": "equation", "pos": 13213, "prevtext": "\n\n\\title{Theory of antiferroelectric phase transitions}\n\\date{\\today}\n\\author{Pierre Tol\\'edano}\n\\affiliation{Laboratoire de Physique des Syst\\`emes Complexes, Universit\\'e de Picardie, 80000 Amiens, France}\n\\author{Mael Guennou}\n\\email{mael.guennou@list.lu}\n\\affiliation{Materials Research and Technology Department, Luxembourg Institute of Science and Technology, 41 rue du Brill, L-4422 Belvaux, Luxembourg}\n\n\n\n\n\\begin{abstract}\nAt variance with structural ferroic phase transitions which give rise to macroscopic tensors coupled to macroscopic fields, criteria defining antiferroelectric (AFE) phase transitions are still under discussion due to the absence of specific symmetry properties characterizing their existence. Here, we show that there exist indeed symmetry criteria defining AFE transitions. They relate the local symmetry of the polar crystallographic sites emerging at an AFE phase transition with the macroscopic symmetry of the AFE phase.  The microscopic nature of the symmetry-breaking mechanism of AFE transitions confirms the deep analogy existing between antiferroelectricty and antiferromagnetism.\n\\end{abstract}\n\n\\keywords{antiferroelectricity, Landau theory, symmetry}\n\n\\maketitle\n\nThe relation between antiferroelectricity and ferroelectricity is traditionally assumed to be analogous to the relation between antiferromagnetism and ferromagnetism. However, there is an essential difference between the symmetry properties governing spin and dipole orderings. In the paramagnetic state, time-reversal symmetry, which is not a symmetry operation in real space, exists everywhere and is lost at the transition to the antiferromagnetic or ferromagnetic states, only surviving in combination with part of the symmetry operations associated with the crystallographic space group of the atomic structure \\cite{Birss1966}. By contrast, in the paraelectric (PA) phase the symmetry operations of the crystal space-group are localized in space. As such, a paraelectric \"state\" does not exist by itself in the same sense as the paramagnetic state, and all crystal structures displaying non-polar symmetries can be potentially antiferroelectric. \n\nAFE transitions are assumed to result in the emergence of an ordered crystalline array of electric dipoles with adjacent dipoles oriented in opposite directions. They are recognized by the proximity of a ferroelectric (FE) phase induced from the AFE phase under applied electric field, which results in a double hysteresis loop relating the induced polarization to the electric field, and a typical critical anomaly of the dielectric permittivity \\cite{Rabe2013,Tagantsev2013,Hlinka2014}. A symmetry-based definition of AFE transitions is still lacking, in spite of previous attempts \\cite{Scott1974,Roos1976} inspired from a displacive picture, and focused on a definition for atomic displacement patterns associated to an AFE \"soft-mode\" thought as the driving mechanism of the PA to AFE phase transition. Such definitions are not well suited for describing the many important cases of order-disorder antiferroelectrics that represent a majority of the well-established AFE transitions. Besides, they are not linked to specific physical properties, so that the definition is of little use. This led the authors to state that antiferroelectricity was an ill-defined and hardly useful notion \\cite{Levanyuk1969}. \n\nSince all structural transitions to non-polar phases do not exhibit the dielectric properties characterizing AFE transitions, there are restrictive conditions required for their existence. Here we show that AFE transitions can be defined as structural transitions to non-polar phases where the spontaneous emergence of crystallographic polar sites at the local scale triggers the onset of an electric field-induced polar phase at the macroscopic scale. This definition stems from the two following conditions:\n\n{\\textit{{Condition 1: At the AFE transition, a set of crystallographic sites undergoes a symmetry lowering, with the emergence of polar sites giving rise to a local polarization.}}} \n\n{\\textit{{Condition 2: Application of an electric field to the AFE phase permits the emergence of a polar phase under the condition that the AFE crystallographic space-group has a symmorphic polar subgroup the macroscopic symmetry of which coincides with the local symmetry of an emerging polar site.}}}\n\nWhen the two preceding conditions are fulfilled one can speak of an AFE phase transition, since an AFE state cannot exist by itself. Condition 2 derives from the property that only symmetry operations of the AFE space-group forming a symmorphic group preserve the local site symmetries at the macroscopic level, since screw axes and glide planes are not local site symmetries.  However, the symmetry of the emerging polar phase, which coincides with the symmetry of the PA phase under applied electric field, can be higher than the symmorphic polar subgroup symmetry and may involve screw axes and glide planes. As it will be  shown below the polar phase symmetry depends on the orientation of the electric field which determines the nature of the coupling between the AFE transition order-parameter and the polarization. \n\n\\begin{figure}[th]\n\\begin{center}\n\\includegraphics[width=0.48\\textwidth]{figure1}\n\\end{center}\n\\caption{Illustration of the local symmetry-breaking mechanism corresponding to Condition 1. In the PA phase, all sites of an atomic row have a non-polar site symmetry $2/m$. At the AFE transition at $T_c$ the symmetry of the polarisable atomic sites lowers to $2$. The sites located at mid distance between polarisable atoms preserve their inversion centre yielding the onset of antiparallel dipoles on the polar sites. An electric field oriented along the dipoles favours a FI configuration. Above a coercive field $E_{c1}$ a FE dipolar order arises.}\n\\label{fig:1D}\n\\end{figure}\n\nFig.~\\ref{fig:1D} illustrates the local symmetry breaking mechanism corresponding to condition 1, as well as the local effect of an applied electric field on the emerging polar sites. Experimental observations on AFE phase transitions confirm the preceding symmetry-breaking scheme. Figs.~\\ref{fig:2} (a)--(c) show the onset of polar site symmetries occurring in well established examples of materials displaying the dielectric properties typifying AFE transitions. They involve two or four sets of independent polar sites arising at the transition from non-polar sites, which may carry anti-parallel dipoles. That the emergence of polar sites (Condition 1) is only a necessary condition for the existence of an AFE transition can be exemplified by the ferroelastic transition in SrTiO$_3$, where the dielectric properties characterizing AFE transition have not be detected. Fig.~\\ref{fig:2} (d) shows the onset of polar sites of symmetry $mm2$ at its cubic-to-tetragonal transition \\cite{Pytte1969}. The symmorphic polar subgroups of the  tetragonal $I4/mcm$ space-group are $I4$, $C2$, $Cm$ and $P1$, the point-group symmetries of which differ from $mm2$. Therefore, condition 2 is not fulfilled and the ferroelastic transition in SrTiO3 does not have an AFE character, in spite of the eventual existence of dipoles on the polar sites of its tetragonal phase. \n\n\\begin{figure}[th]\n\\begin{center}\n\\includegraphics[width=0.48\\textwidth]{figure2}\n\\end{center}\n\\caption{Emerging polar sites at the AFE transitions in (a) Cu(HCOO)$_2$.4H$_2$O \\cite{Omura2002}, (b) KCN \\cite{Stokes1984}, (c) PbZrO$_3$ \\cite{Teslic1998}, and (d) at the non-AFE transition in SrTiO$_3$. Coloured spheres indicate the polar sites carrying antiparallel dipoles in the AFE phase, whereby cristallographically equivalent sites are drawn in the same colour. At sites drawn in black, no local polarisation can emerge.}\n\\label{fig:2}\n\\end{figure}\n\nVerifications of conditions 1 and 2 for confirmed AFE materials are summarized in Table~\\ref{tab}. It shows that the two conditions are unambiguously verified for all the corresponding AFE transitions, the highest polar site symmetries coinciding with the symmetries of the maximal symmorphic polar subgroups. Table~\\ref{tab} shows that the field-induced polar phase has in most cases a higher symmetry than the polar sites. It also lists a number of materials (BiVO$_4$, TeO$_2$, NdP$_5$O$_14$) which undergo transitions fulfilling conditions 1 and 2 but have not been yet identified as AFE. It contains as well illustrative examples of transitions which do not verify condition 1 (NH$_4$Cl) or condition 2 (SrTiO$_3$). \n\n\\begin{table*}[th]\n\\caption{Verification of conditions 1 and 2 for selected structural transitions in AFE and other materials listed in column (a). Other columns have the following meaning: (b) Space-group changes occurring at the transitions.  (c)  Crystallographic sites undergoing a lowering of their local symmetry to a polar point-group.  (d) Symmorphic polar subgroups of the low-symmetry phase space-groups coinciding with the emerging polar site symmetries. (e)  Couplings between the AFE transition order-parameter and the polarization allowing emergence of a field-induced polar phase. (f) Corresponding orientation(s) of the electric-field. (g) Space-group of the polar phase. In (e) and (f) except for CsH$_3$(SeO$_3$)$_2$ only couplings corresponding to  non-general directions of $P$ and $E$ are given. In (e), $\\eta_1$ and $\\eta_2$ are two components of the same transition order-parameter except for PbZrO$_3$ where they correspond to different order-parameters.}\n\\footnotesize\n\\centering\n\\begin{tabular}{l >{$}l<{$} >{$}l<{$} >{$}l<{$} >{$}l<{$} >{$}l<{$} >{$}l<{$} }\n\\hline\\hline\n\n(a) & $(b)$ & $(c)$ & $(d)$ & $(e)$ & $(f)$ & $(g)$ \\\\\n\\hline\nCsH$_3$(SeO$_3$)$_2$ \t\t\t\t\t\t\t\t\t\t\t\t\t& P\\overline 1\\rightarrow P\\overline 1 \t& 1a: \\overline 1 \\rightarrow 1 \t\t\t\t\t& P1 \t\t& \\eta^2 P^2 & E  & P1\\\\\nCu(HCOO)$_2$.4H$_2$O \t  \t\t\t\t\t\t\t\t\t\t\t& P2_1/a \\rightarrow P2_1/a \t\t\t\t\t\t& 2a,2b,2c,2d: \\overline 1\\rightarrow 1  \t& P1  \t& \\eta^2 P_z^2 & E_z & P2_1 \\\\                      \nKCN \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& Immm \\rightarrow Pmmn \t\t\t\t\t\t\t\t& 2a, 2c: mmm \\rightarrow mm2 \t\t\t\t\t\t& Pmm2 \t& \\eta^2 P_z^2 & E_z & Imm2  \\\\\nC$_4$O$_4$H$_2$ \t\t \t\t\t\t\t\t\t\t\t\t\t\t\t& I4/m \\rightarrow P2_1/m \t\t\t\t\t\t\t& 2a,2b: 4/m \\rightarrow m\t\t\t\t\t\t\t\t& Pm,P1 & (\\eta_1\\eta_2,\\eta_1^2-\\eta_2^2)\\times \t& E_{xy} & Cm  \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 4c: 2/m \\rightarrow m \t\t\t\t\t\t\t\t\t&    \t\t& (P_xP_y,P_x^2-P_y^2), \t \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 4d: \\overline 4 \\rightarrow 1 \t\t\t\t\t&    \t\t& (\\eta_1^2+\\eta_2^2)P_z^2 & E_z & I4\\\\\nNH$_4$H$_2$PO$_4$ \t\t\t\t\t\t\t\t\t\t\t\t\t\t& I\\overline 42d \\rightarrow P2_12_12_1 & 4a,4b: \\overline 4 \\rightarrow 1\t\t\t\t& P1 \t\t& \\mathrm{idem} \t& E_{xy}, E_z & Cc, Fdd2 \\\\\nDyVO$_4$  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& I4_1/amd \\rightarrow Imma \t\t\t\t\t\t& 4a, 4b: \\overline 4m2 \\rightarrow mm2\t\t& Imm2,P1 & \\eta^2 P_z^2 \t& E_z  & I4_1md \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 16h: 2_{xy} \\rightarrow 1\t\t\t\t\t\t\t\t&         & \\eta(P_x^2-P_y^2) & E_{xy} & Imm2 \\\\\nBiVO$_4$\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& I4_1/a \\rightarrow B2/b \t\t\t\t\t\t\t& 4a, 4b: \\overline 4 \\rightarrow 2 \t\t\t& C2 &  \\eta^2 P_z^2 & E_z & I4_1 \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t\t\t&\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&    & \\eta (P_xP_y,P_x^2-P_y^2) & E_{xy} & Cc\\\\\nTeO$_2$\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& P4_12_12 \\rightarrow P2_12_12_1 \t\t\t& 4a: 2\\rightarrow 1 \t\t\t\t\t\t\t\t\t\t\t& P1 & \\eta^2 P_z^2 \t& E_z & P4_1  \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 8b: 1\\rightarrow 1\t\t \t\t\t\t\t\t\t\t\t& \t\t\t\t& \\eta (P_x^2-P_y^2)  & E_{xy} & C2\\\\\nPbZrO$_3$ \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& Pm\\overline 3m \\rightarrow Pbam       & 3d: 4/mmm \\rightarrow m,2 \t\t\t\t\t\t\t& Pm, P2 & (\\eta_1^2,\\eta_2^2)\\times P^2_{x,y,z}\t& E_{x,y,z} & P4mm  \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 1a, 1b: m\\overline 3m \\rightarrow m,1\t\t& P1 \t& (\\eta_1^2,\\eta_2^2)\\times P^2_{xy,yz,zx}\t& E_{xy,yz,zx} & Amm2 \\\\\nNdP$_5$O$_{14}$  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& Pmna \\rightarrow P2_1/b \t\t\t\t\t\t\t& 4e, 4f: 2 \\rightarrow 1 \t\t\t\t\t\t\t\t& P1 & \\eta P_xP_y & E_{xy} & Pnc2 \\\\\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t&\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& 4h: m \\rightarrow 1 \t\t\t\t\t\t\t\t\t\t&    & \\eta^2 P^2_z& E_z    & Pmn2_1\\\\\nNH$_4$Cl \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t& Pm\\overline 3m \\rightarrow P\\overline 43m &  \\mathrm{none} \\\\\nSrTiO$_3$ \t\t\t  \t\t\t\t\t\t\t\t\t\t\t\t\t\t& Pm\\overline 3m \\rightarrow I4/mcm \t\t& 3d: 4/mmm \\rightarrow mm2 \t\t\t\t\t\t\t& I4, C2, Cm, P1 \t& \\mathrm{none} \\\\\n\\hline\\hline\n\\end{tabular}\n\\label{tab}\n\\end{table*}\n\nApplication of an electric field $E$ to a non-polar AFE phase induces a coupling between the AFE order-parameter, here labelled $\\eta$, and the polarization $P$. The lowest degree coupling between $\\eta$and $P$ determines the stability and symmetry of an eventual field-induced FE phase, as well as the orientation of the electric dipoles in the AFE phase. It also establishes the link with the dielectric anomalies typifying AFE transitions. Only couplings of the $\\eta^2P^2$ or $\\eta P^n$ ($n\\ge 2$) types can be associated with an AFE transition, since under applied fields only such couplings reflect the remarkable property of AFE transitions to occur in materials {\\textit{{which do not have a stable polar phase at zero fields}}}. For a biquadratic $\\eta^2P^2$ coupling, the dielectric properties of AFE transitions derive from the Landau potential: \n\n", "index": 1, "text": "\\begin{equation}\n\\phi(\\eta,P,T) = \\phi_0(T) +  \\frac{\\alpha}{2}\\eta^2 + \\frac{\\beta}{4}\\eta^4 +\\frac{\\gamma}{6}\\eta^6 + \\frac{P^2}{2\\chi_0} + \\frac{\\delta}{2}\\eta^2P^2 - EP \n\\label{eq:potential}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\phi(\\eta,P,T)=\\phi_{0}(T)+\\frac{\\alpha}{2}\\eta^{2}+\\frac{\\beta}{4}\\eta^{4}+%&#10;\\frac{\\gamma}{6}\\eta^{6}+\\frac{P^{2}}{2\\chi_{0}}+\\frac{\\delta}{2}\\eta^{2}P^{2}%&#10;-EP\" display=\"block\"><mrow><mrow><mi>ϕ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>η</mi><mo>,</mo><mi>P</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><msub><mi>ϕ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mfrac><mi>α</mi><mn>2</mn></mfrac><mo>⁢</mo><msup><mi>η</mi><mn>2</mn></msup></mrow><mo>+</mo><mrow><mfrac><mi>β</mi><mn>4</mn></mfrac><mo>⁢</mo><msup><mi>η</mi><mn>4</mn></msup></mrow><mo>+</mo><mrow><mfrac><mi>γ</mi><mn>6</mn></mfrac><mo>⁢</mo><msup><mi>η</mi><mn>6</mn></msup></mrow><mo>+</mo><mfrac><msup><mi>P</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msub><mi>χ</mi><mn>0</mn></msub></mrow></mfrac><mo>+</mo><mrow><mfrac><mi>δ</mi><mn>2</mn></mfrac><mo>⁢</mo><msup><mi>η</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi>P</mi><mn>2</mn></msup></mrow></mrow><mo>-</mo><mrow><mi>E</mi><mo>⁢</mo><mi>P</mi></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05687.tex", "nexttext": "\nthe temperature dependence of which depends on the sign of $\\delta$ (Fig. 4 (a)). Fig. 4 (b) shows $\\chi(T)$ for a first-order transition ($\\beta < 0$) occurring at $T_1>T_c$, which involves an upward ($\\delta < 0$)  or downward ($\\delta > 0$) discontinuity. AFE transitions verifiy the preceding temperature dependences of $\\chi(T)$ for $\\delta > 0$, with a marked downward discontinuity at $T_1$ for CsH$_3$(SeO$_3$)$_2$ \\cite{Makita1965}, Cu(HCOO)$_2$.4H$_2$O \\cite{Okada1965}, KCN \\cite{Gesi1972,Ortiz-Lopez1988}, NH$_4$H$_2$PO$_4$ \\cite{Mason1952} and PbZrO$_3$ \\cite{Kanzig1957} and a smooth decrease below $T_c$ for C$_4$O$_4$H$_2$ \\cite{Feder1976}.\n \nReplacing in Eq.~(\\ref{eq:eos2}) the equilibrium value of $\\eta^2$ deduced from Eq.~(\\ref{eq:eos1}) provides the electric field dependence $P(E)$ of the polarization. It corresponds to a double hysteresis loop which can be observed for a second-order AFE transition below a temperature $T_0<T_c$ (Fig.~\\ref{fig:hysteresis} (a)--(d)), whereas for a first-order AFE transition it is observed below $T_1>T_c$  (Fig.~\\ref{fig:hysteresis} (e)--(f)). Characteristic double AFE loops have been observed experimentally in a number of AFE transitions, e.g. in CsH$_3$(SeO$_3$)$_2$ \\cite{Makita1965}, Cu(HCOO)$_2$.4H$_2$O \\cite{Okada1965} or PbZrO$_3$ \\cite{Kanzig1957}. Double hysteresis loops have also been reported at first-order FE transitions, as for example in BaTiO$_3$ \\cite{Merz1953}. However at variance with AFE transitions the linear dependence of $P(E)$ is observed within the region of stability of the PA phase, the two loops merging  into a single hysteresis loop at the transition to the FE phase.\n\n\\begin{figure}[th]\n\\begin{center}\n\\end{center}\n\\includegraphics[width=0.48\\textwidth]{figure4}\n\\caption{Temperature dependence of the dielectric susceptibility $\\chi(T)$ given by Eq. (4) across a second-order (a) and first-order (b) transition. The AFE susceptibility is defined as $\\chi = P/E$ at variance with the FE susceptibility $\\displaystyle\\chi = \\lim_{E\\rightarrow 0} \\frac{\\partial P}{\\partial E}$.}\n\\label{fig:4}\n\\end{figure}\n\nAssuming a $\\delta\\eta P^2$ coupling in Eq.~\\ref{eq:potential} modifies the previous results. The corresponding equations of state:\n\\begin{eqnarray}\n\\eta(\\alpha + \\beta \\eta^2 + \\gamma \\eta^4) + \\delta P^2 & = & 0\\\\\nP(1+\\delta\\chi_0\\eta) & = & \\chi_0 E\n\\end{eqnarray}\ndo not allow a stable FE phase under applied field but only FI or WF ($\\eta\\neq 0$, $P\\neq 0$) phases. The temperature dependence of the dielectric susceptibility below $T_c$, $\\chi(T) = \\chi_0 / (1 + \\delta \\chi_0 \\eta)$, has a similar shape than for a $\\delta\\eta^2P^2$ coupling (Fig. 4), and the double AFE hysteresis loops, deduced from Eqs. (5) and (6), reflect the emergence above a threshold field of a FI or WF phase. $\\eta P^2$ couplings occur exclusively for \"proper\" ferroelastic transitions \\cite{Toledano1980} where the AFE order-parameter $\\eta$ has the symmetry of spontaneous strain components. Phase transitions in DyVO$_4$ \\cite{Unoki1977,Kishimoto2010}, TeO$_2$ \\cite{Peercy1974}, BiVO$_4$ \\cite{Bierlein1975} and NdP$_5$O$_14$ \\cite{Schulz1974} verify this property. As shown in Table~\\ref{tab} application of  electric fields to the ferroelastic phases of the four compounds induce either a $\\eta P^2$ coupling for $E_{xy}$ fields, with the emergence of FI or WF phases, or a $\\eta^2P^2$ coupling for fields along $z$, giving rise to a FE phase. Typical AFE dielectric anomalies have been reported at the transitions in DyVO$_4$ \\cite{Unoki1977,Kishimoto2010} and TeO$_2$ \\cite{Peercy1974}.\n\n\\begin{figure}[th]\n\\begin{center}\n\\includegraphics[width=0.48\\textwidth]{figure5}\n\\end{center}\n\\caption{$E(P)$ and $E_c(T)$ curves deduced from equations (2) and (3) for a second-order PA-AFE transition (a)--(d) and a first-order transition (e)--(g). At low fields the linear behaviour of $P(E)$ indicates a progressive transformation of the AFE phase into a FI or WF dipolar order. At a coercive field $E_{c1}$ a discontinuous transition occurs to a FE phase. Reversing the field, $P(E)$ decreases along a different path below a coercive field $E_{c2}<E_{c1}$ forming a loop before reaching the linear regime.}\n\\label{fig:hysteresis}\n\\end{figure}\n\nOur extended investigation of materials undergoing structural transitions to non-polar phases shows that although conditions 1 and 2 are satisfied in a large number of materials, the emergence of a polar phase above a coercive field may not occur because of the large energy difference between the AFE and polar phases. This is due, in particular, to the additional strains possibly required for stabilizing a polar phase. For example, at the assumed AFE transition in NH$_4$H$_2$PO$_4$, a double hysteresis loop could not be observed \\cite{Kanzig1957}, the onset of a FE phase implying a monoclinic or triclinic deformation of its orthorhombic AFE phase. Therefore, antiferroelectrics presenting all the dielectric features typifying AFE transitions should not constitute a widespread class of materials, as compared to ferroelectrics. This is in contrast to antiferromagnets which form the largest class of magnetically ordered materials.\n\nThe analogy between antiferromagnets and antiferroelectrics is usually invoked because both antiferromagnetic and AFE structures display antiparallel arrays of spins or dipoles and because ferromagnetic or FE phases emerge above coercive fields. Our work underlines a deeper analogy consisting of the common microscopic nature of the symmetry-breaking order-parameter in the two classes of materials: the emergence of a discrete array of local dipolar sites, which constitutes in our approach the microscopic symmetry-breaking mechanism for the formation of an AFE phase, is the structural analogue of the continuous microscopic spin-density waves which are the symmetry-breaking order-parameters at antiferromagnetic transitions. It can be questioned if the analogy extends at the level of the interactions between dipoles i.e. if there exists a physical criterion characterizing AFE interactions, similar to the negative sign of the exchange interaction typifying antiferromagnetic interactions. In this respect it can be noted that all experimental examples of AFE transitions show a decrease or discontinuous drop of the dielectric permittivity, corresponding to a positive sign of the coupling coefficient $\\delta$ between $\\eta$ and $P$. Such repulsive coupling is necessary for compensating the attractive (negative) interactions existing between antiparallel dipoles \\cite{Margenau1969} and results from the different types of repulsive forces \\cite{London1937} between permanent and induced dipoles. By contrast, the dielectric permittivity at improper ferroelectric transitions undergoes an upward discontinuity \\cite{levanyuk1974} reflecting the attractive coupling between $\\eta$ and $P$ required for compensating the repulsive interactions between parallel dipoles. Although such considerations need to be substantiated by a detailed theoretical analysis they suggest that the decrease of the dielectric permittivity at a structural transition to a non-ferroelectric phase denotes the presence of AFE interactions, in the same way that the shape of its magnetic susceptibility typifies an antiferromagnetic ordering. \n\nIn summary, AFE phase transitions have been shown to occur under combined local and macroscopic symmetry conditions. A Landau theoretical description of their dielectric properties has been given by taking into account the electric-field induced couplings existing between the AFE and polarization order-parameters. This description leads to properties of AFE materials differing essentially from the properties deduced from Kittel's model of antiferroelectrics \\cite{Kittel1951}: the FE phase is absent from the phase diagram at zero field, its emergence as a purely field induced effect being conditioned by symmetry requirements. Furthermore, the AFE order parameter $\\eta$ may represent a structural mechanism inducing indirectly the antiparallel dipole lattices (\"improper\" antiferroelectricity), or can be expressed directly in terms of antiparallel dipoles (\"proper\" antiferroelectricity) as assumed by Kittel. \n\nThe authors are grateful to B. Mettout for very helpful discussions and J. Kreisel for suggesting this work. Work supported by the National Research Fund, Luxembourg (FNR/P12/4853155/Kreisel).\n\nBoth authors contributed equally to the work and preparation of the manuscript.\n\n\n\n\n\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{Birss1966}\nR.~E. Birss,\n\\newblock {\\em Symmetry and Magnetism},\n\\newblock North-Holland, 1966.\n\n\\bibitem{Rabe2013}\nK.~M. Rabe,\n\\newblock {\\em Functional Metal Oxides: New Science and Novel Applications},\n\\newblock Wiley, 2013.\n\n\\bibitem{Tagantsev2013}\nA.~K. Tagantsev et~al.,\n\\newblock Nat Commun {\\bf 4},  (2013).\n\n\\bibitem{Hlinka2014}\nJ.~Hlinka et~al.,\n\\newblock Phys. Rev. Lett. {\\bf 112}, 197601 (2014).\n\n\\bibitem{Scott1974}\nJ.~F. Scott,\n\\newblock Reviews of Modern Physics {\\bf 46}, 83 (1974).\n\n\\bibitem{Roos1976}\nJ.~Roos, R.~Kind, and J.~Petzelt,\n\\newblock Z. Physik B {\\bf 24}, 99 (1976).\n\n\\bibitem{Levanyuk1969}\nA.~P. Levanyuk and D.~G. Sannikov,\n\\newblock Soviet Physics JETP  (1969).\n\n\\bibitem{Pytte1969}\nE.~Pytte and J.~Feder,\n\\newblock Phys. Rev. {\\bf 187}, 1077 (1969).\n\n\\bibitem{Kittel1951}\nC.~Kittel,\n\\newblock Phys. Rev. {\\bf 82}, 726 (1951).\n\n\\bibitem{Makita1965}\nY.~Makita,\n\\newblock J. Phys. Soc. Jpn. {\\bf 20}, 1567 (1965).\n\n\\bibitem{Okada1965}\nK.~Okada,\n\\newblock Phys. Rev. Lett. {\\bf 15}, 252 (1965).\n\n\\bibitem{Gesi1972}\nK.~Gesi,\n\\newblock J. Phys. Soc. Jpn. {\\bf 33}, 561 (1972).\n\n\\bibitem{Ortiz-Lopez1988}\nJ.~Ortiz-Lopez and F.~Luty,\n\\newblock Phys. Rev. B {\\bf 37}, 5452 (1988).\n\n\\bibitem{Mason1952}\nW.~P. Mason and B.~T. Matthias,\n\\newblock Phys. Rev. {\\bf 88}, 477 (1952).\n\n\\bibitem{Kanzig1957}\nW.~K\\\"{a}nzig,\n\\newblock {\\em Ferroelectrics and Antiferroelectrics},\n\\newblock Academic Press, New York, 1957.\n\n\\bibitem{Feder1976}\nJ.~Feder,\n\\newblock Ferroelectrics {\\bf 12}, 71 (1976).\n\n\\bibitem{Merz1953}\nW.~J. Merz,\n\\newblock Phys. Rev. {\\bf 91}, 513 (1953).\n\n\\bibitem{Toledano1980}\nJ.-C. Tol\\'edano and P.~Tol\\'edano,\n\\newblock Phys. Rev. B {\\bf 21}, 1139 (1980).\n\n\\bibitem{Unoki1977}\nH.~Unoki and T.~Sakudo,\n\\newblock Phys. Rev. Lett. {\\bf 38}, 137 (1977).\n\n\\bibitem{Kishimoto2010}\nK.~Kishimoto, T.~Ishikura, H.~Nakamura, Y.~Wakabayashi, and T.~Kimura,\n\\newblock Phys. Rev. B {\\bf 82}, 012103 (2010).\n\n\\bibitem{Peercy1974}\nP.~S. Peercy and I.~J. Fritz,\n\\newblock Phys. Rev. Lett. {\\bf 32}, 466 (1974).\n\n\\bibitem{Bierlein1975}\nJ.~Bierlein and A.~Sleight,\n\\newblock Solid State Communications {\\bf 16}, 69 (1975).\n\n\\bibitem{Schulz1974}\nH.~Schulz, K.~H. Thiemann, and J.~Fenner,\n\\newblock Mat. Res. Bull. {\\bf 9}, 1515 (1974).\n\n\\bibitem{Margenau1969}\nH.~Margenau and N.~Kestner,\n\\newblock {\\em Theory of intermolecular forces},\n\\newblock Pergamon Press, 1969.\n\n\\bibitem{London1937}\nF.~London,\n\\newblock Trans. Faraday Soc. {\\bf 33}, 8b (1937).\n\n\\bibitem{levanyuk1974}\nA.~P. Levanyuk and D.~G. Sannikov,\n\\newblock Usp. Fiz. Nauk {\\bf 112}, 561 (1974).\n\n\\bibitem{Omura2002}\nT.~Omura, C.~Moriyoshi, K.~Itoh, S.~Ikeda, and I.~Fukazawa,\n\\newblock Ferroelectrics {\\bf 270}, 375 (2002).\n\n\\bibitem{Stokes1984}\nH.~T. Stokes and D.~M. Hatch,\n\\newblock Phys. Rev. B {\\bf 30}, 3845 (1984).\n\n\\bibitem{Teslic1998}\nS.~Teslic and T.~Egami,\n\\newblock Acta Crystallographica Section B {\\bf 54}, 750 (1998).\n\n\\end{thebibliography}\n\n\n\n\n", "itemtype": "equation", "pos": 15781, "prevtext": "\nwhere $\\alpha = a(T-Tc)$, and the other phenomenological coefficients are constant. This order-parameter expansion is essentially different from the seminal model by Kittel \\cite{Kittel1951} as it involves a single symmetry-breaking AFE order-parameter $\\eta$, the polarization $P$ being a field-induced order-parameter. It expresses the property that a polar phase requires the mediation of the AFE order parameter to be stabilized upon application of an electric field. \n\nMinimizing $\\phi$ with respect to $\\eta$ and $P$ yields the equations of state:\n\\begin{eqnarray}\n\\eta(\\alpha + \\beta \\eta^2 + \\gamma \\eta^4 + \\delta P^2) & = & 0 \\label{eq:eos1}\\\\\nP(1+\\delta\\chi_0\\eta^2) & = & \\chi_0 E \\label{eq:eos2}\n\\end{eqnarray}\n\nAt $E=0$, Eqs.~(\\ref{eq:eos1}) and (\\ref{eq:eos2}) yield two possible stable phases: the PA phase ($\\eta=0$, $P=0$) and the AFE phase ($\\eta\\neq 0$, $P=0$). For $E\\neq 0$ two additional phases are stabilized: a FE phase ($\\eta =0$, $P\\neq 0$) in which the AFE antiparallel dipole configuration is absent, and a phase in which the AFE ordering  ($\\eta\\neq 0$) has a non-zero total polarization ($P\\neq 0$), i.e. having either a ferrielectric (FI)-type of dipolar order or a \"weak\" ferroelectric (WF) order, analogous to weak ferromagnetism, with a canting between antiparallel arrays of dipoles. Fig. 3(a) and 3(b) shows the location of these two field-induced phases in theoretical $\\alpha$--$E$ phase diagrams.  \n\n\\begin{figure}[b]\n\\begin{center}\n\\includegraphics[width=0.48\\textwidth]{figure3}\n\\end{center}\n\\caption{Theoretical Temperature-Field ($\\alpha$--$E$) phase diagrams associated with the free-energy given by Eq.~(\\ref{eq:potential}), with $\\beta > 0$, showing the location of the FE ((a)--(b)) and FI or WF phases (b) with respect to the AFE phase. Hatched and solid curves correspond respectively to second and first-order transitions. In (b) the region of stability of the FE phase is embedded in the region of stability of the FI or WF phase, whereas in (a) it is bounded by the AFE phase. The double arrow in (a) shows the thermodynamic path followed on increasing or decreasing $E$.}\n\\label{fig:3}\n\\end{figure}\n\nOne can deduce from Eq.(\\ref{eq:eos2}) the temperature dependence of the dielectric susceptibility  at the PA$\\rightarrow$AFE transition. For a second-order transition ($\\beta > 0$) one gets below $T_c$:\n\n", "index": 3, "text": "\\begin{equation}\n\\chi(T) = \\displaystyle\\frac{\\chi_0}{1+\\delta a \\chi_0\\displaystyle\\frac{(T_c-T)}{\\beta}}     \n\\label{chiT}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\chi(T)=\\displaystyle\\frac{\\chi_{0}}{1+\\delta a\\chi_{0}\\displaystyle\\frac{(T_{%&#10;c}-T)}{\\beta}}\" display=\"block\"><mrow><mrow><mi>χ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msub><mi>χ</mi><mn>0</mn></msub><mrow><mn>1</mn><mo>+</mo><mrow><mi>δ</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><msub><mi>χ</mi><mn>0</mn></msub><mo>⁢</mo><mstyle displaystyle=\"true\"><mfrac><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>c</mi></msub><mo>-</mo><mi>T</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>β</mi></mfrac></mstyle></mrow></mrow></mfrac></mrow></math>", "type": "latex"}]