[{"file": "1601.06165.tex", "nexttext": "\n \\par\nThe results are shown in Tab.~\\ref{masse}. The logarithmic mean mass value for HERGs is 7.78 with a standard deviation of 0.66, while for F-NLS1s is 7.68 with a standard deviation of 0.44. The median values are 7.84 and 7.73, respectively. It is evident that the two distributions are very similar. We compared them by means of the Kolmogorov-Smirnov test (K-S), finding that the null hypothesis of the two samples being drawn from the same population cannot be rejected, with a p-value of 0.95. To directly compare this result with those found for other parent candidates by \\citet{Berton15a}, we also evaluated the product \n\n", "itemtype": "equation", "pos": 16262, "prevtext": " \n\n\n\n   \\title{Luminosity function of flat-spectrum \\\\ \nradio-loud narrow-line Seyfert 1 galaxies}\n\n\n\n   \\author{M. Berton\n\t\\inst{1}\\thanks{marco.berton.1@studenti.unipd.it}\n \t\\and A. Caccianiga\\inst{2}\n\t\\and L. Foschini\\inst{2}\n\t\\and B.~M. Peterson\\inst{3}\n\t\\and S. Mathur \\inst{3}\n\t\\and G. Terreran\\inst{4,5} \\and\n\t\\\\\n\tS. Ciroi\\inst{1} \n\t\\and E. Congiu\\inst{1}\n\t\\and V. Cracco\\inst{1} \n\t\\and M. Frezzato\\inst{1}\n\t\\and G. La Mura\\inst{1}\n\t\\and P. Rafanelli\\inst{1}\t\n         }\n\n   \\institute{$^{1}$ Dipartimento di Fisica e Astronomia \"G. Galilei\", Universit\\`a di Padova, Vicolo dell'Osservatorio 3, 35122 Padova, Italy;\\\\\n $^{2}$ INAF - Osservatorio Astronomico di Brera, via E. Bianchi 46, 23807 Merate (LC), Italy;\\\\\n\t$^{3}$ Department of Astronomy and Center for Cosmology and AstroParticle Physics, The Ohio State University, 140 West 18th Avenue, Columbus, OH 43210, USA;\\\\\n\t$^{4}$ Astrophysics Research Centre, School of Mathematics and Physics, Queen's University Belfast, Belfast BT7 1NN, UK;\\\\\n\t$^{5}$ INAF - Osservatorio Astronomico di Padova, Vicolo dell'Osservatorio 5, 35122 Padova, Italy.\\\\\n             }\n\n  \n\\authorrunning{M. Berton et al.}\n\\titlerunning{Luminosity function of F-NLS1s}\n\n\\abstract{Narrow-line Seyfert 1 galaxies are an interesting subclass of active galactic nuclei (AGN), which tipically does not exhibit any strong radio emission. Seven percent of them, though, are radio-loud and often show a flat radio-spectrum (F-NLS1s). This, along to the detection of $\\gamma$-ray emission coming from them, is usually interpreted as a sign of a relativistic beamed jet harbored in these objects. An important aspect of these AGN that must be understood is the nature of their parent population, in other words how do they appear when observed under different angles. In this paper we investigated whether compact steep-spectrum sources with an high excitation spectrum (CSS/HERGs) are good parent candidates. To do this, we analyzed the only two statistically complete samples of CSS/HERGs and F-NLS1s available in the literature. We derived the black hole mass and Eddington ratio distributions, and we built for the first time the radio luminosity function of F-NLS1s. Finally, we applied a relativistic beaming model to the luminosity function of CSS/HERGs, and compared the result with the observed function of F-NLS1s. We found that compact steep-spectrum sources are valid parent candidates and that F-NLS1s, when observed with a different inclination, might actually appear as CSS/HERGs. }\n\n\\keywords{Galaxies: Seyfert; galaxies: jets; galaxies: luminosity function; quasars: emission lines; quasars: supermassive black holes}\n\\maketitle\n\n\\section{Introduction}\nSince their first designation as a subclass of active galactic nuclei (AGN) in 1985 \\citep{Osterbrock85}, narrow-line Seyfert 1 galaxies (NLS1s) represented a source of new insights. By definition these AGN have a relatively low full width at half maximum (FWHM) of the permitted lines $-$ specifically FWHM(H$\\beta$) $<$ 2000 {km s$^{-1}$}\\ $-$ and a flux ratio of [O III]/H$\\beta <$ 3 \\citep{Osterbrock87, Goodrich89}. Moreover, the presence in the optical spectrum of strong Fe II multiplets shows that the broad line region (BLR) of these AGN is directly visible. The narrowness of the permitted lines cannot therefore be interpreted as due to obscuration, but instead to a low rotational velocity around a relatively low mass central black hole (10$^{6-8}$ M$_\\odot$, \\citealp{Mathur00}). This low black hole mass, along with the high Eddington ratio \\citep{Boroson92}, is sometimes interpreted as a consequence of the young age of these sources \\citep{Grupe00, Mathur00}. NLS1s may be therefore rapidly growing AGN and, if so, they are an excellent proxy to test the evolution of galaxies at relatively low redshifts. \\par\nDespite being tipically radio-quiet, a fraction of NLS1s is actually radio-loud (7\\%) or even very radio-loud (2.5\\%, \\citealp{Komossa06}). Few of these exhibit some extreme properties similar to those of blazars, such as flat radio-spectrum ($\\alpha_\\nu \\leq 0.5$, with F$_\\nu \\propto \\nu^{-\\alpha_\\nu}$) and high brightness temperature \\citep{Yuan08}. After the discovery of $\\gamma$-ray emission coming from these sources and detection by the \\textit{Fermi Gamma-ray Space Telescope} \\citep{Abdo09a,Abdo09b,Abdo09c, Foschini10}, NLS1s became the third class of $\\gamma$-ray emitting AGN with a relativistic beamed jet, in addition to BL Lacs and flat spectrum radio quasars (FSRQs). \\par\nAccording to the unified model of radio-loud AGN, for each beamed source there are about 2$\\Gamma^2$ misaligned sources ($\\Gamma$ is the bulk Lorentz factor of the jet), also known as the parent population. In particular, the parent population of BL Lacs and FSRQs are thought to be FRI and FRII radio-galaxies, respectively \\citep{Urry95}, even though some exceptions are known \\citep{Kollgaard92, Antonucci02}. In a more recent and less biased picture, the reviewed association with parent sources is between BL Lacs and low excitation radio-galaxies (LERG), and between FSRQs and high excitation radio-galaxies (HERG, \\citealp{Giommi12}). An akin picture for flat-spectrum radio-loud NLS1s (F-NLS1s) is not yet well-established. \\par\nA first hint regarding the parent population was provided by \\citet{Foschini11, Foschini12}, who first proposed steep-spectrum radio-loud NLS1s (S-NLS1s) as parent sources. This hypothesis was further supported by \\citet{Berton15a}, although a possible problem of numerical consistency was also pointed out, since the known S-NLS1s seem to be too few to represent the whole parent population. It is however possible that there is no need to include anything else in the parent population beside S-NLS1s. A GHz selected sample might show a lack of misaligned sources, because the relativistic beaming increases the luminosity - and hence the visibility - of beamed sources. An example for this is shown by \\citet{Urry95}: in their study on the radio luminosity functions (LFs), the observed densities of FSRQs and steep-spectrum radio-quasars (SSRQs) at 2.7 GHz are roughly the same, so one could expect the number of observed beamed and misaligned sources to be the same also for NLS1s. \\par\nAlternatively the lack of sources might be real, and could be explained with two different hypotheses \\citep{Foschini10,Foschini11}. The first one is based on the fact that the radio morphology of F-NLS1s is extremely compact. Young sources as NLS1s might have not developed radio-lobes yet. The radio emission might be then strongly collimated and, when observed at large angles, the source would be invisible for present day observatories, appearing as a radio-quiet NLS1s (RQNLS1s). Another hypothesis is instead based on a different assumption on the nature of NLS1s. Some authors suggest that the narrowness of the permitted lines might be only an apparent effect \\citep{Decarli08, Shen14}. If the BLR has a disk-like shape, when observed pole-on the permitted lines would show little rotational Doppler broadening, and would appear narrower than at higher inclination. NLS1s would then be nearly pole-on AGN. Increasing instead their observing angle, the permitted lines would become broader, and the source might appear as a broad-line or a narrow-line radio-galaxy (BLRG/NLRG), whether the line of sight intercepts the torus or not. NLS1s are typically hosted in disk-like galaxies \\citep{Crenshaw03}. If the host galaxy is the same for F-NLS1s too, the parent source would be disk-hosted BL/NLRG. These hypotheses were also investigated by \\citet{Berton15a}, who suggested that disk RGs with high Eddington ratio and low black hole mass may be parent sources, while RQNLS1s are not very good candidates. \\par\nThere is anyway another possibility that must be considered. RQNLS1s belong to the parent population if radio-lobes are lacking, but lobes might instead be only developed on small scale. In this case, the source could appear as a compact steep spectrum object (CSS). CSS represent an important fraction of radio sources, showing a radio spectrum peaked at $\\sim$100 MHz and radio-jets entirely within the host galaxy \\citep[see the review by][]{Odea98}. Often they are thought to be closely connected with Gigahertz peaked-spectrum sources (GPS), and a widely diffuse theory to explain their nature is the youth scenario \\citep{Fanti95}. Their age was determined in several ways, and found to be less than 10$^5$ years \\citep{Owsianik98, Murgia99}. Their jets already developed radio-lobes, and are typically still crossing the interstellar medium and interacting with it \\citep[e.g.][and references therein]{Morganti15}. As radio-galaxies, they can be classified as HERG or LERG according for example to the ratio [O III]/H$\\alpha$ \\citep{Laing94}. The main difference between these classes is likely the accretion mechanism onto the black hole, with HERGs showing typically a more efficient accretion process \\citep{Hardcastle07}. \\par\nA link between NLS1s and CSS was suggested by many authors \\citep{Oshlack01, Komossa06, Gallo06a, Yuan08, Caccianiga14, Gu15, Schulz15}. All the characteristics of NLS1s indeed closely recall those of CSS: as previously mentioned they are often considered young sources and at the same time their jet, when present, appears to interact with the medium \\citep{Marziani03, Komossa06}. RLNLS1s can be classified as HERG, having an efficient accretion mechanism and strong high-ionization lines. Therefore CSS/HERGs might be part of their parent population, under the assumption that radio-lobes are already developed in RLNLS1s.\\par \nThe aim of the present work is to study wheter CSS/HERGs are suitable to be the parent population of F-NLS1s or not. The paper is organized as follows: in Sect.~2 we present the samples selection; in Sect.~3 we describe the black hole mass and Eddington ratio analysis; in Sect.~4 we present the V/V$_{max}$ test for the samples; in Sect.~5 we build the luminosity functions and study the incidence of relativistic beaming; in Sect.~6 we discuss our results; in Sect.~7, finally, we briefly summarize our work. Throughout this work we adopt a standard $\\Lambda$CDM cosmology, with H$_0 = 70$ {km s$^{-1}$}\\ Mpc$^{-1}$, $\\Omega_M = 0.3$ and $\\Omega_\\Lambda = 0.7$ \\citep{Komatsu11}. \n\\section{Samples}\n\\subsection{NLS1s}\nComplete samples are required to build the luminosity functions. The NLS1s sample must also have measured spectral indices, to select only flat-spectrum sources without including any S-NLS1s. The largest sample in the literature that meets our requirements is that of \\citet{Yuan08}. It includes 23 very radio-loud NLS1s, and 19 out of 23 spectral indices are known. Their sample was selected from SDSS DR5, looking only for those sources whose radio-loudness - calculated using the 1.4 GHz flux density - is above 100 at $z < 0.8$. The sample includes 13 flat-spectrum sources and 4 with unknown spectral index. \\par\nThe Yuan sample should be statistically complete, being drawn from the already complete sample of \\citet{Zhou06}. Anyway we independently tested its completeness. We first notice that \\citet{Foschini15}, whose sample was selected with an accurate search in the literature, found all the very radio-loud objects in DR5 already included in the Yuan sample. The cumulative distribution of sources as a function of redshift anyway shows a flattening close to the upper $z$ limit. This flattening in the distribution is likely caused by the lack of classification. The S/N of the optical spectra worsen with increasing distance, and even if very radio-loud sources typically have bright optical lines (such as [O III], e.g. \\citealp{debruyn78}), a correct classification is quite difficult. \\par\nWe tried to avoid this problem considering that the quasars distribution in SDSS appears to be complete up at 94.6\\% up to magnitude i$<$19.1 \\citep{Richards02}. In the Yuan sample, all the flat-spectrum sources but one match this magnitude criterium when $z < 0.6$. We therefore decided to use this threshold as upper redshift limit for our sample. This allows to have a good degree of completeness in our sample. Using these criteria, 12 F-NLS1s remain. We will also consider 2 more sources with undetermined spectral index which meet the redshift criterion, to test the stability of our results.\n\n\\subsection{HERG}\nOur aim was to find CSS sources classified as HERGs, so we searched again in the literature for a suitable sample. We decided to use that of \\citet{Kunert10a}, who selected a sample of 44 low-luminosity compact objects, with a radio luminosity at 1.4 GHz lower than 10$^{26}$ W Hz$^{-1}$ (in a cosmology with H$_0$ = 100 {km s$^{-1}$}\\ Mpc$^{-1}$ and q$_0$ = 0.5). In addition to this criterion, these sources have a flux density 70 mJy $\\leq S_{1.4 \\; GHz} \\leq$ 1 Jy, and a radio spectral index $\\alpha_\\nu > 0.7$ between 1.4 and 4.85 GHz. Their radio-selected sample was later cross-matched with the SDSS DR7 spectroscopic archive, finding 29 sources at z $<$ 0.9 \\citep{Kunert10b}. Ten of them were classified as LERG, 12 as HERG, and 7 remained unclassified because of a S/N $\\lesssim 3$. We tested the completeness of this sample as before. As in the F-NLS1s sample, the cumulative distribution finds a drop in the source counts above z $\\sim$ 0.6. Below this threshold, only one source is above the SDSS completeness limit of 19.1 mag. Therefore we decided to use again the same limits, considering then only 10 sources. Since both samples have the same redshift limit, and they both have a lower limit in flux including only bright radio-sources, the comparison between them should be relatively unbiased. \n\n\\subsection{Control sample}\nAs a control sample for the luminosity function we decided to use the sample of 50 FSRQs used by \\citet{Padovani92}, which in turn are drawn from the work of \\citet{Wall85}. The sources have a flux density above 2 Jy at 2.7 GHz, and Galactic latitude $|b| >$ 10$^\\circ$. They also have a spectral index $\\alpha_\\nu \\leq 0.5$ between 2.7 and 5 GHz, and they were not classified as BL Lacs by \\citet{Stickel91}. \\citet{Padovani92} added one more source to the \\citet{Wall85} sample, because of its high optical polarization. \n\n\\section{Black hole mass}\n\\begin{table}[t!]\n\\centering\n\\caption{HERGs parameters. Columns: (1) Object SDSS name; (2) logarithm of the black hole mass in $M_\\odot$; (3) logarithm of the bolometric luminosity in {erg s$^{-1}$}; (4) logarithm of the Eddington ratio.}\n\\begin{tabular}{l c c c}\n\\hline\\hline\nSDSS Name & $\\log$M$_{BH}$ & $\\log$L$_{bol}$ & $\\log$Edd \\\\\n\\hline\nSDSS J002833.42+005510.9 & 8.94 & 44.1 & -2.96 \\\\\nSDSS J075756.71+395936.0 & 7.13 & 43.77 & -1.52 \\\\\nSDSS J084856.57+013647.8 & 7.05 & 44.41 & -0.74 \\\\\nSDSS J092607.99+074526.6 & 7.28 & 44.93 & -0.47 \\\\\nSDSS J094525.90+352103.5 & 7.23 & 44.48 & -0.85 \\\\\nSDSS J114311.01+053516.1 & 8.84 & 45.08 & -2.0 \\\\\nSDSS J115727.61+431806.3 & 7.68 & 44.67 & -1.1 \\\\\nSDSS J140416.35+411748.7 & 7.96 & 43.88 & -2.22 \\\\\nSDSS J140942.44+360415.8 & 8.24 & 43.82 & -2.52 \\\\\nSDSS J164311.34+315618.4 & 7.44 & 45.39 & -0.17 \\\\\n\n\\hline\n\\end{tabular}\n\\label{masse}\n\\end{table}\nAn important step to understand the relation between CSS/HERGs and F-NLS1s is to compare their black hole masses and Eddington ratio. Both these values were recently calculated for all our F-NLS1s by \\citet{Foschini15}, therefore we will adopt their values for our study. For CSS/HERGs we obtained the optical spectra from SDSS DR12. All of them were of type 2 or intermediate type AGN, therefore we could not use permitted lines to derive the black hole mass because the BLR is obscured. We then followed the procedure described by \\citet{Berton15a} for type 2 and intermediate sources, deriving the stellar velocity dispersion $\\sigma_*$ from the width of the [O III] lines core component. Once removed the blue wing, the core component of [O III] should indeed be less affected by the jets/ISM interaction, and typically dominated by the gravitational potential of the bulge stars \\citep{Greene05}. This method provided good approximations for black hole mass both in elliptical- and disk-hosted radio-galaxies. To obtain the bolometric luminosity, we used Eqn.~7 of \\citet{Berton15a}\n\n", "index": 1, "text": "\\begin{equation}\n\\log\\left(\\frac{L_{\\mathrm{bol}}}{\\textrm{erg s}^{-1}}\\right) = (7.54\\pm9.07) + (0.88\\pm0.22)\\log\\left(\\frac{L_{\\mathrm{[OIII]}}}{\\textrm{erg s}^{-1}}\\right) \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\log\\left(\\frac{L_{\\mathrm{bol}}}{\\textrm{erg s}^{-1}}\\right)=(7.54\\pm 9.07)+(%&#10;0.88\\pm 0.22)\\log\\left(\\frac{L_{\\mathrm{[OIII]}}}{\\textrm{erg s}^{-1}}\\right)\\,.\" display=\"block\"><mrow><mrow><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>L</mi><mi>bol</mi></msub><msup><mtext>erg s</mtext><mrow><mo>-</mo><mn>1</mn></mrow></msup></mfrac><mo>)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>7.54</mn><mo>±</mo><mn>9.07</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mn>0.88</mn><mo>±</mo><mn>0.22</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mi>log</mi><mo>⁡</mo><mrow><mo>(</mo><mfrac><msub><mi>L</mi><mrow><mo stretchy=\"false\">[</mo><mi>OIII</mi><mo stretchy=\"false\">]</mo></mrow></msub><msup><mtext>erg s</mtext><mrow><mo>-</mo><mn>1</mn></mrow></msup></mfrac><mo rspace=\"4.2pt\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhere $D_n$ is the deviation between the cumulative distributions and $n$ and $m$ are the number of elements in each sample. Such value is useful to test the distance between the samples. A low value indicates that the null hypothesis can be rejected in the two samples. In our case this value is equal to 0.52, and the CSS/HERGs sample appears then to be the closest to F-NLS1s, even closer than S-NLS1s. \\par\nThe Eddington ratio distributions are also quite close (K-S p-value 0.17). The median Eddington ratio is 0.06 for CSS/HERGs and 0.09 for F-NLS1s. These values are comparable to those of other NLS1s classes, but it is worth noting that the CSS/HERGs sample shows some outliers with lower accretion luminosities. All these values are shown in Fig.~\\ref{massacc}, along with two more classes of sources already studied by \\citet{Berton15a}, disk-hosted and elliptical-hosted radio-galaxies. \\par\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{massacc.eps} \n\\caption{Logarithm of the BH mass vs. logarithm of the Eddington ratio. Black squares are F-NLS1s, red circles are CSS/HERGs, blue triangles are disk-hosted radio-galaxies and green stars are elliptical-hosted radio-galaxies. The points of these last two samples are derived from \\citet{Berton15a}.}\n\\label{massacc}\n\\end{figure}\nThe good overlap in mass between F-NLS1s and CSS/HERGs is visible, and we also point out that disk RGs have a similar mass distribution to CSS/HERGs (K-S p-value 0.15). On the contrary, the black hole mass of elliptical radio-galaxies is much larger. The K-S confirms this difference providing a p-value of 3$\\times$10$^{-3}$, which allows us to reject the null hypothesis. \n\\section{V/V$_{max}$ test}\n\\label{VVmax}\nAnother step to understand the relation between these sources is to check whether evolution is present in our samples or not. An useful tool to test evolution is the so-called V/V$_{max}$ test \\citep{Schmidt68}. By definition, V$_{max}$ is the volume within which a source of luminosity $L$ can be detected, while $V$ is the spherical volume associated with each source. The luminosity of a source of detected flux $F$ is $L = 4\\pi d^2 F$, where $d$ is the luminosity distance. If the flux detection limit is F$_{min}$, the source can be detected up to \n\n", "itemtype": "equation", "pos": 17089, "prevtext": "\n \\par\nThe results are shown in Tab.~\\ref{masse}. The logarithmic mean mass value for HERGs is 7.78 with a standard deviation of 0.66, while for F-NLS1s is 7.68 with a standard deviation of 0.44. The median values are 7.84 and 7.73, respectively. It is evident that the two distributions are very similar. We compared them by means of the Kolmogorov-Smirnov test (K-S), finding that the null hypothesis of the two samples being drawn from the same population cannot be rejected, with a p-value of 0.95. To directly compare this result with those found for other parent candidates by \\citet{Berton15a}, we also evaluated the product \n\n", "index": 3, "text": "\\begin{equation}\n\\mathcal{P} = D_n \\sqrt{\\frac{nm}{n+m}} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\mathcal{P}=D_{n}\\sqrt{\\frac{nm}{n+m}}\\;,\" display=\"block\"><mrow><mrow><mi class=\"ltx_font_mathcaligraphic\">𝒫</mi><mo>=</mo><mrow><msub><mi>D</mi><mi>n</mi></msub><mo>⁢</mo><mpadded width=\"+2.8pt\"><msqrt><mfrac><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow><mrow><mi>n</mi><mo>+</mo><mi>m</mi></mrow></mfrac></msqrt></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhich corresponds to a redshift $z_{max}$. For a non-evolving population, the ratio between the spherical volume V corresponding to the object redshift and V$_{max}$ is expected to be uniformly distributed between 0 and 1, with an average value $\\langle V/V_{max} \\rangle = 0.5$. When $\\langle V/V_{max} \\rangle > 0.5$, the population is positively evolving, with more (or more luminous) sources located at larger distances. If conversely $\\langle V/V_{max} \\rangle < 0.5$, the sample is negatively evolving. \\par\nTo evaluate V$_{max}$ for each object, we used as $d_{max}$ the smaller value between those derived from the radio detection limit (1 mJy for F-NLS1s, 70 mJy for CSS/HERGs, 2 Jy for FRSQs), the spectroscopic limit for quasars in SDSS DR7 (19.1 mag), and the redshift upper limit of each sample, z = 0.6. The CSS/HERGs sample has also an upper flux limit, which translates into a lower redshift limit z$_{min}$. Therefore in this case we used the modified version of the test over the accessible volume V$_a$ \\citep{Avni80}, defined as\n\n", "itemtype": "equation", "pos": 19444, "prevtext": "\nwhere $D_n$ is the deviation between the cumulative distributions and $n$ and $m$ are the number of elements in each sample. Such value is useful to test the distance between the samples. A low value indicates that the null hypothesis can be rejected in the two samples. In our case this value is equal to 0.52, and the CSS/HERGs sample appears then to be the closest to F-NLS1s, even closer than S-NLS1s. \\par\nThe Eddington ratio distributions are also quite close (K-S p-value 0.17). The median Eddington ratio is 0.06 for CSS/HERGs and 0.09 for F-NLS1s. These values are comparable to those of other NLS1s classes, but it is worth noting that the CSS/HERGs sample shows some outliers with lower accretion luminosities. All these values are shown in Fig.~\\ref{massacc}, along with two more classes of sources already studied by \\citet{Berton15a}, disk-hosted and elliptical-hosted radio-galaxies. \\par\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{massacc.eps} \n\\caption{Logarithm of the BH mass vs. logarithm of the Eddington ratio. Black squares are F-NLS1s, red circles are CSS/HERGs, blue triangles are disk-hosted radio-galaxies and green stars are elliptical-hosted radio-galaxies. The points of these last two samples are derived from \\citet{Berton15a}.}\n\\label{massacc}\n\\end{figure}\nThe good overlap in mass between F-NLS1s and CSS/HERGs is visible, and we also point out that disk RGs have a similar mass distribution to CSS/HERGs (K-S p-value 0.15). On the contrary, the black hole mass of elliptical radio-galaxies is much larger. The K-S confirms this difference providing a p-value of 3$\\times$10$^{-3}$, which allows us to reject the null hypothesis. \n\\section{V/V$_{max}$ test}\n\\label{VVmax}\nAnother step to understand the relation between these sources is to check whether evolution is present in our samples or not. An useful tool to test evolution is the so-called V/V$_{max}$ test \\citep{Schmidt68}. By definition, V$_{max}$ is the volume within which a source of luminosity $L$ can be detected, while $V$ is the spherical volume associated with each source. The luminosity of a source of detected flux $F$ is $L = 4\\pi d^2 F$, where $d$ is the luminosity distance. If the flux detection limit is F$_{min}$, the source can be detected up to \n\n", "index": 5, "text": "\\begin{equation}\nd_{max} = \\sqrt{\\frac{L}{4\\pi F_{min}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"d_{max}=\\sqrt{\\frac{L}{4\\pi F_{min}}}\" display=\"block\"><mrow><msub><mi>d</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>=</mo><msqrt><mfrac><mi>L</mi><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>F</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac></msqrt></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhere V$_{min}$ is the inaccessible inner part of the comoving volume due to z$_{min}$, and $V$ is the comoving volume of each source. The associated error in the V/V$_{max}$ test is $\\sigma = 1/\\sqrt{12N}$, where $N$ is the number of sources in each sample. To calculate both the luminosity distance from redshift and the comoving volume, we used the \\texttt{Cosmolopy} tool developed for \\texttt{Python}\\footnote{http://roban.github.com/CosmoloPy/}. \\par\nThe results are summarized in Tab.~\\ref{vvmax}. The control sample of FSRQs is showing a strong positive evolution at 5$\\sigma$. This result is in agreement with that found by \\citet{Padovani92} and many other authors. FSRQs indeed are known for having a strong evolution with time. Conversely, the V/V$_{max}$ result is consistent with the uniform distribution at 1$\\sigma$ for both F-NLS1s and CSS/HERGs. In particular the result for F-NLS1s does not change whether the two sources with undetermined spectral index are included or not. This is an indication that, at least up to $z = 0.6$, these sources do not have any strong evolution. \\par\nWe performed a K-S test between the observed V/V$_{max}$ distributions in our sample and the theoretical uniform distribution. The null hypothesis is that the observed distribution is drawn from a uniform distribution. As reported in Tab.~\\ref{vvmax}, the test confirms all the previous results, showing that the only sample where the null hypothesis is rejected is the FSRQs sample. Therefore, while the luminosity function of FSRQs will be corrected for evolution and reported to z = 0, those of F-NLS1s and CSS/HERGs will not. \n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{fsrq_lf.eps} \n\\caption{Monochromatic radio luminosity function of FSRQs control sample at 1.4 GHz. The dashed line is the best-fit with a broken power-law. }\n\\label{fsrq_lf}\n\\end{figure}\n\\begin{table}[t!]\n\\centering\n\\caption{Results of the V/V$_{max}$ test. The results for F-NLS1s are showed in two different ways: with or without 2 sources with unknown spectral index. The former are indicated with an asterisk. Columns: (1) sample; (2) number of sources; (3) result of the test; (4) associated error to the test; (5) distance from uniform distribution in $\\sigma$ units; (6) K-S test p-value against uniform distribution.}\n\\begin{tabular}{l c c c c c}\n\\hline\\hline\nSample & N & V/V$_{max}$ & $\\sigma$ & d & K-S \\\\\n\\hline\nF-NLS1 & 12 & 0.52 & 0.08 & 0.25 & 0.95 \\\\\nF-NLS1* & 14 & 0.58 & 0.08 & 1.00 & 0.26 \\\\\nHERG & 10 & 0.54 & 0.09 & 0.44 & 0.72 \\\\\nFSRQ & 50 & 0.70 & 0.04 & 5.00 & 2$\\times$10$^{-9}$\\\\\n\\hline\n\\end{tabular}\n\\label{vvmax}\n\\end{table}\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=\\columnwidth]{flat_lf.eps} \n\\includegraphics[width=\\columnwidth]{heg_lf.eps}\n\\caption{Monochromatic radio luminosity functions at 1.4 GHz. Top panel: F-NLS1s; bottom panel: HERGs. Dashed lines are the single power-law best-fit.}\n\\label{fig:lf2}\n\\label{multiplot}\n\\end{figure}\n\\section{Luminosity functions}\n\\begin{table*}[t!]\n\\centering\n\\caption{Parameters of the luminosity functions. The LF of F-NLS1s is showed in two different ways: with or without 2 sources with unknown spectral index. The former is indicated with an asterisk. Columns: (1) Sample; (2) Function used for the best-fit. PL for power-law, BPL for broken power-law; (3) logarithm of minimum luminosity bin ({erg s$^{-1}$}); (4) logarithm of maximum luminosity bin ({erg s$^{-1}$}); (5) logarithm of luminosity break ({erg s$^{-1}$}); (6) logarithm of the luminosity function at the break (Mpc$^{-3}$); (7) coefficient of the power-law; (8) slope of the power-law (slope below the break for broken power-law); (9) slope above the break (for broken power-law only).}\n\\centering\n\\begin{tabular}{l c c c c c c c c }\n\\hline\\hline\nSample & Mod. & $\\log$ L$_{1}$ & $\\log$ L$_{2}$ & $\\log$ L$_b$ & $\\log\\Phi_b$ & $\\log{K}$ & $\\alpha$ & $\\beta$ \\\\\n\\hline\nF-NLS1 & PL & 40.5 & 42.5 & $-$ & $-$ & -2.15$\\pm$5.96 & -1.17$\\pm$0.14 & $-$ \\\\\nF-NLS1* & PL & 40.5 & 42.5 & $-$ & $-$ & -3.53$\\pm$5.88 & -1.13$\\pm$0.14 & $-$ \\\\\nHERG & PL & 40. & 42.5 & $-$ & $-$ & 33.32$\\pm$5.96 & -2.01$\\pm$0.14 & $-$ \\\\\nFSRQ & BPL & 42.5 & 43.75 & 43.32$\\pm$0.47 & -53.10$\\pm$1.34 & $-$  & 1.61$\\pm$0.98 & 4.33$\\pm$2.00 \\\\\n\\hline\n\\label{tab:lf}\n\\end{tabular}\n\\end{table*}\n\\subsection{Method}\nThe luminosity function (LF) describes the volumetric density of sources as a function of their luminosity. For flux-limited samples, the LF is computed as in \\citet{Peterson}\n\n", "itemtype": "equation", "pos": 20565, "prevtext": "\nwhich corresponds to a redshift $z_{max}$. For a non-evolving population, the ratio between the spherical volume V corresponding to the object redshift and V$_{max}$ is expected to be uniformly distributed between 0 and 1, with an average value $\\langle V/V_{max} \\rangle = 0.5$. When $\\langle V/V_{max} \\rangle > 0.5$, the population is positively evolving, with more (or more luminous) sources located at larger distances. If conversely $\\langle V/V_{max} \\rangle < 0.5$, the sample is negatively evolving. \\par\nTo evaluate V$_{max}$ for each object, we used as $d_{max}$ the smaller value between those derived from the radio detection limit (1 mJy for F-NLS1s, 70 mJy for CSS/HERGs, 2 Jy for FRSQs), the spectroscopic limit for quasars in SDSS DR7 (19.1 mag), and the redshift upper limit of each sample, z = 0.6. The CSS/HERGs sample has also an upper flux limit, which translates into a lower redshift limit z$_{min}$. Therefore in this case we used the modified version of the test over the accessible volume V$_a$ \\citep{Avni80}, defined as\n\n", "index": 7, "text": "\\begin{equation}\n\\frac{V}{V_a} = \\frac{V - V_{min}}{V_{max} - V_{min}} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{V}{V_{a}}=\\frac{V-V_{min}}{V_{max}-V_{min}}\\;,\" display=\"block\"><mrow><mrow><mfrac><mi>V</mi><msub><mi>V</mi><mi>a</mi></msub></mfrac><mo>=</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><mi>V</mi><mo>-</mo><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow><mrow><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>-</mo><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhere $\\Delta$L is the width of the luminosity bin, and A is the area of sky covered by the samples. In our cases, the area covered both by the DR5 and FIRST is $\\sim$1/7 of the whole sky, while the common area between DR7 and FIRST is $\\sim$1/6. \\par\nTo compute the LF we divided the sources in bins of luminosity (L$-\\Delta$L/2, L$+\\Delta$L/2). In those samples which have a lower redshift limit, instead of V$_{max}$ we used the accessible volume V$_a$. We assume that the only source of uncertainty in the LF is the error on the number counts per bin, hence we assumed a Poissonian statistics. It is worth noting that the Poissonian statistics is not symmetric for small values (N $\\lesssim$ 10): to evaluate the errors in the low statistic limit we used the values from \\citet{Gehrels86}. \\par\nOur aim was to determine the radio LF for each sample. We then calculated the luminosity at 1.4 GHz for each source from the peak flux of the FIRST survey. We performed a K-correction, using all the spectral indices we found in the literature. For those two sources with no known spectral index, we assumed a flat spectrum ($\\alpha_\\nu = 0$). We divided the luminosities in bins of 0.25 dex for the control sample, since there were enough data to fill each bin. In the other two cases, we used a binning of 0.5 dex. The LFs were fitted with a single power-law\n\n", "itemtype": "equation", "pos": 25160, "prevtext": "\nwhere V$_{min}$ is the inaccessible inner part of the comoving volume due to z$_{min}$, and $V$ is the comoving volume of each source. The associated error in the V/V$_{max}$ test is $\\sigma = 1/\\sqrt{12N}$, where $N$ is the number of sources in each sample. To calculate both the luminosity distance from redshift and the comoving volume, we used the \\texttt{Cosmolopy} tool developed for \\texttt{Python}\\footnote{http://roban.github.com/CosmoloPy/}. \\par\nThe results are summarized in Tab.~\\ref{vvmax}. The control sample of FSRQs is showing a strong positive evolution at 5$\\sigma$. This result is in agreement with that found by \\citet{Padovani92} and many other authors. FSRQs indeed are known for having a strong evolution with time. Conversely, the V/V$_{max}$ result is consistent with the uniform distribution at 1$\\sigma$ for both F-NLS1s and CSS/HERGs. In particular the result for F-NLS1s does not change whether the two sources with undetermined spectral index are included or not. This is an indication that, at least up to $z = 0.6$, these sources do not have any strong evolution. \\par\nWe performed a K-S test between the observed V/V$_{max}$ distributions in our sample and the theoretical uniform distribution. The null hypothesis is that the observed distribution is drawn from a uniform distribution. As reported in Tab.~\\ref{vvmax}, the test confirms all the previous results, showing that the only sample where the null hypothesis is rejected is the FSRQs sample. Therefore, while the luminosity function of FSRQs will be corrected for evolution and reported to z = 0, those of F-NLS1s and CSS/HERGs will not. \n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{fsrq_lf.eps} \n\\caption{Monochromatic radio luminosity function of FSRQs control sample at 1.4 GHz. The dashed line is the best-fit with a broken power-law. }\n\\label{fsrq_lf}\n\\end{figure}\n\\begin{table}[t!]\n\\centering\n\\caption{Results of the V/V$_{max}$ test. The results for F-NLS1s are showed in two different ways: with or without 2 sources with unknown spectral index. The former are indicated with an asterisk. Columns: (1) sample; (2) number of sources; (3) result of the test; (4) associated error to the test; (5) distance from uniform distribution in $\\sigma$ units; (6) K-S test p-value against uniform distribution.}\n\\begin{tabular}{l c c c c c}\n\\hline\\hline\nSample & N & V/V$_{max}$ & $\\sigma$ & d & K-S \\\\\n\\hline\nF-NLS1 & 12 & 0.52 & 0.08 & 0.25 & 0.95 \\\\\nF-NLS1* & 14 & 0.58 & 0.08 & 1.00 & 0.26 \\\\\nHERG & 10 & 0.54 & 0.09 & 0.44 & 0.72 \\\\\nFSRQ & 50 & 0.70 & 0.04 & 5.00 & 2$\\times$10$^{-9}$\\\\\n\\hline\n\\end{tabular}\n\\label{vvmax}\n\\end{table}\n\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=\\columnwidth]{flat_lf.eps} \n\\includegraphics[width=\\columnwidth]{heg_lf.eps}\n\\caption{Monochromatic radio luminosity functions at 1.4 GHz. Top panel: F-NLS1s; bottom panel: HERGs. Dashed lines are the single power-law best-fit.}\n\\label{fig:lf2}\n\\label{multiplot}\n\\end{figure}\n\\section{Luminosity functions}\n\\begin{table*}[t!]\n\\centering\n\\caption{Parameters of the luminosity functions. The LF of F-NLS1s is showed in two different ways: with or without 2 sources with unknown spectral index. The former is indicated with an asterisk. Columns: (1) Sample; (2) Function used for the best-fit. PL for power-law, BPL for broken power-law; (3) logarithm of minimum luminosity bin ({erg s$^{-1}$}); (4) logarithm of maximum luminosity bin ({erg s$^{-1}$}); (5) logarithm of luminosity break ({erg s$^{-1}$}); (6) logarithm of the luminosity function at the break (Mpc$^{-3}$); (7) coefficient of the power-law; (8) slope of the power-law (slope below the break for broken power-law); (9) slope above the break (for broken power-law only).}\n\\centering\n\\begin{tabular}{l c c c c c c c c }\n\\hline\\hline\nSample & Mod. & $\\log$ L$_{1}$ & $\\log$ L$_{2}$ & $\\log$ L$_b$ & $\\log\\Phi_b$ & $\\log{K}$ & $\\alpha$ & $\\beta$ \\\\\n\\hline\nF-NLS1 & PL & 40.5 & 42.5 & $-$ & $-$ & -2.15$\\pm$5.96 & -1.17$\\pm$0.14 & $-$ \\\\\nF-NLS1* & PL & 40.5 & 42.5 & $-$ & $-$ & -3.53$\\pm$5.88 & -1.13$\\pm$0.14 & $-$ \\\\\nHERG & PL & 40. & 42.5 & $-$ & $-$ & 33.32$\\pm$5.96 & -2.01$\\pm$0.14 & $-$ \\\\\nFSRQ & BPL & 42.5 & 43.75 & 43.32$\\pm$0.47 & -53.10$\\pm$1.34 & $-$  & 1.61$\\pm$0.98 & 4.33$\\pm$2.00 \\\\\n\\hline\n\\label{tab:lf}\n\\end{tabular}\n\\end{table*}\n\\subsection{Method}\nThe luminosity function (LF) describes the volumetric density of sources as a function of their luminosity. For flux-limited samples, the LF is computed as in \\citet{Peterson}\n\n", "index": 9, "text": "\\begin{equation}\n\\Phi(L) = \\frac{1}{\\Delta L}\\frac{4\\pi}{A}\\sum_{L_i \\in (L \\pm \\Delta L/2)} \\frac{1}{V_{max}(L)} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\Phi(L)=\\frac{1}{\\Delta L}\\frac{4\\pi}{A}\\sum_{L_{i}\\in(L\\pm\\Delta L/2)}\\frac{1%&#10;}{V_{max}(L)}\\;,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>L</mi></mrow></mfrac><mo>⁢</mo><mfrac><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi></mrow><mi>A</mi></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><msub><mi>L</mi><mi>i</mi></msub><mo>∈</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>L</mi><mo>±</mo><mrow><mrow><mi mathvariant=\"normal\">Δ</mi><mo>⁢</mo><mi>L</mi></mrow><mo>/</mo><mn>2</mn></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></munder><mpadded width=\"+2.8pt\"><mfrac><mn>1</mn><mrow><msub><mi>V</mi><mrow><mi>m</mi><mo>⁢</mo><mi>a</mi><mo>⁢</mo><mi>x</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhere K is a constant and $\\alpha$ the slope of the power-law. In the case of FSRQs, in analogy with what done by \\citet{Padovani92}, we used a broken power-law in the form\n\n", "itemtype": "equation", "pos": 26653, "prevtext": "\nwhere $\\Delta$L is the width of the luminosity bin, and A is the area of sky covered by the samples. In our cases, the area covered both by the DR5 and FIRST is $\\sim$1/7 of the whole sky, while the common area between DR7 and FIRST is $\\sim$1/6. \\par\nTo compute the LF we divided the sources in bins of luminosity (L$-\\Delta$L/2, L$+\\Delta$L/2). In those samples which have a lower redshift limit, instead of V$_{max}$ we used the accessible volume V$_a$. We assume that the only source of uncertainty in the LF is the error on the number counts per bin, hence we assumed a Poissonian statistics. It is worth noting that the Poissonian statistics is not symmetric for small values (N $\\lesssim$ 10): to evaluate the errors in the low statistic limit we used the values from \\citet{Gehrels86}. \\par\nOur aim was to determine the radio LF for each sample. We then calculated the luminosity at 1.4 GHz for each source from the peak flux of the FIRST survey. We performed a K-correction, using all the spectral indices we found in the literature. For those two sources with no known spectral index, we assumed a flat spectrum ($\\alpha_\\nu = 0$). We divided the luminosities in bins of 0.25 dex for the control sample, since there were enough data to fill each bin. In the other two cases, we used a binning of 0.5 dex. The LFs were fitted with a single power-law\n\n", "index": 11, "text": "\\begin{equation}\n\\Phi(L) = KL^\\alpha \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\Phi(L)=KL^{\\alpha}\\;,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>K</mi><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>L</mi><mi>α</mi></msup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nwhere $\\Phi_b$ is the normalization factor, $L_b$ is the break luminosity, and $\\alpha$ and $\\beta$ are the two slopes. In the FSRQs sample we also applied a correction for luminosity evolution to bring each source to z = 0. For this purpose, we assumed the same cosmological evolution found by \\citet{Padovani92}, $\\exp{(-T/\\tau)}$, where $T$ is the lookback time and $\\tau = 0.23$ is the time-scale of evolution in units of Hubble time. Using the spectral indices we also derived the 1.4 GHz flux for each FSRQ, to allow a direct comparison with the other samples. All fits were performed using the generalized least squares method. The results are shown in Fig.~\\ref{fsrq_lf} and \\ref{fig:lf2}, and summarized in Tab.~\\ref{tab:lf}. \\par\nOur FSRQs LF is in agreement with that obtained by \\citet{Padovani92} when the cosmology they adopted is used. In F-NLS1s, we note that the inclusion in the LF of the two sources with undetermined spectral index has a negligible impact, since neither the slope nor the coefficient of the LF are significantly affected (Tab.~\\ref{tab:lf}). In both cases, the scatter is quite high, likely because of the low statistic. The slope of HERGs is steeper than that of F-NLS1s, which indeed have a quite flat LF. In particular, the slope of F-NLS1s is close to that of FSRQs for luminosities below the break, even if the error on this slope is quite large. This result becomes more evident when the LFs of F-NLS1s and FSRQs are shown together, as in Fig.~\\ref{fsrq_flat}. The two LFs are quite close in the region of $10^{43}$ {erg s$^{-1}$}, and the LF of F-NLS1s appears to be an extension of that of FSRQs at lower luminosities. \n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{fsrq_flat_lf.eps} \n\\caption{Monochromatic radio luminosity functions of F-NLS1s and FSRQs at 1.4 GHz. The black squares are the F-NLS1s data points, the blue triangles the FSRQs data points. The blue dashed line is the broken power-law best-fit for FSRQs, the black solid line is the single power-law best-fit for F-NLS1s.}\n\\label{fsrq_flat}\n\\end{figure}\n\\subsection{Relativistic beaming}\nIn order to compare the beamed sources with their parent population, we have to take into account the effect of beaming on the LF shape. We then added the relativistic beaming to the CSS/HERGs luminosity function. This cannot be done analitically, as explained by \\citet{Urry84} and \\citet{Urry91}. We followed the procedure described by \\citet{Urry84} for a single power-law. In analogy with that work, we defined as ${\\mathcal{L}}$ the intrinsic luminosity, and with $L$ the observed luminosity. These two quantities are related via $L = \\delta^p {\\mathcal{L}}$, where $\\delta = [\\Gamma(1-\\beta\\cos\\theta)]^{-1}$ is the kinematic Doppler factor of the jet and the exponent is $p = 3 + \\alpha_\\nu$, where $\\alpha_\\nu$ is the intrinsic slope of the jet emission. The total flux emitted by the source is given by L = (1 + $f\\delta^p$)${\\mathcal{L}}_u$, where ${\\mathcal{L}}_u$ is the unbeamed luminosity and $f$ the ratio between the jet luminosity and the unbeamed luminosity. The model is then evaluated numerically via\n\n", "itemtype": "equation", "pos": 26883, "prevtext": "\nwhere K is a constant and $\\alpha$ the slope of the power-law. In the case of FSRQs, in analogy with what done by \\citet{Padovani92}, we used a broken power-law in the form\n\n", "index": 13, "text": "\\begin{equation}\n\\Phi(L) = \\frac{\\Phi_b}{\\left(L/L_b\\right)^\\alpha+\\left(L/L_b\\right)^\\beta} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Phi(L)=\\frac{\\Phi_{b}}{\\left(L/L_{b}\\right)^{\\alpha}+\\left(L/L_{b}\\right)^{%&#10;\\beta}}\\;,\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mpadded width=\"+2.8pt\"><mfrac><msub><mi mathvariant=\"normal\">Φ</mi><mi>b</mi></msub><mrow><msup><mrow><mo>(</mo><mrow><mi>L</mi><mo>/</mo><msub><mi>L</mi><mi>b</mi></msub></mrow><mo>)</mo></mrow><mi>α</mi></msup><mo>+</mo><msup><mrow><mo>(</mo><mrow><mi>L</mi><mo>/</mo><msub><mi>L</mi><mi>b</mi></msub></mrow><mo>)</mo></mrow><mi>β</mi></msup></mrow></mfrac></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06165.tex", "nexttext": "\nWe used $p = 3.7$, because the typical slope of a syncrotron spectrum is $\\alpha_\\nu = 0.7$. We also performed our calculations for different values of $f$ (0.01 $\\leq f \\leq$ 1), and of bulk Lorentz factor, 8 $\\leq \\Gamma \\leq$ 15, which are values already observed in $\\gamma$-ray emitting NLS1s \\citep{Abdo09c, Dammando12}. To evaluate the Doppler factor we assumed the angle to vary between $0^\\circ \\leq \\theta \\leq \\theta_c$, where $\\theta_c$ is the critical angle for which $\\delta(\\Gamma,f,\\theta_c) = 1$. Therefore all the sources with inclination $\\theta$ appear as F-NLS1s. In the case of a simple power-law, the resulting beamed LF is a broken power-law. \\par\nFrom the error bars we derived the maximum and minimum values allowable for the data. The errors in the models of beamed LF are evaluated by refitting such maximum and minimum values. These new fits were performed using the same functions adopted for the previous fitting of the data. We then added the relativistic beaming both to the best-fit, the minimum and the maximum fit. The resulting parent+beaming model is shown in Fig.~\\ref{beam}. \\par\n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{heg_beamate.eps} \n\\caption{HERGs LF with relativistic beaming added, for bulk Lorentz factor $\\Gamma = 10$ and ratio $f$ = 1. Black solid line is the model, red solid lines are the maximum and minimum values for the model. Black circles are F-NLS1s data, black dashed line is the F-NLS1s LF best-fit, and blue dashed lines are the maximum and minimum values for F-NLS1s LF. }\n\\label{beam}\n\\end{figure}\nIn order to test our results, we evaluated the distance between the model and our data by means of the reduced chi-squared, $\\chi^2_\\nu$. The results are shown in Tab.~\\ref{chi2}. We report the $\\chi^2_\\nu$ of the model and the lowest $\\chi^2_\\nu$ considering also the maximum and minimum curve. In all cases, the $\\chi^2_\\nu$ has 4 degrees of freedom. We also evaluated the model for several values of bulk Lorentz factor, to understand up to which values the model was still acceptable. \\par\n\\begin{table}[t!]\n\\centering\n\\caption{$\\chi^2_\\nu$ for the beaming model tested with different parameters. The star indicates that the F-NLS1s sample included also the two sources with unknown spectral index. Columns: (1) sample; (2) bulk Lorentz factor of the jet; (3) ratio between beamed and diffuse emission from the jet $f$; (4) $\\chi^2_\\nu$ of the model; (5) $\\chi^2_\\nu$ of the maximum model; (6) $\\chi^2_\\nu$ of the minimum model. }\n\\begin{tabular}{l c c c c c}\n\\hline\\hline\nSample & $\\Gamma$ & $f$ & $\\chi^2_\\nu$ & $\\chi^2_\\nu$ (max) & $\\chi^2_\\nu$ (min) \\\\\n\\hline\nHERG & 10 & 1.0 & 1.95 & 5.74 & 1.37 \\\\\nHERG* & 10 & 1.0 & 1.62 & 5.71 & 1.66 \\\\\nHERG & 8 & 1.0 & 2.15 & 6.29 & 1.05 \\\\\nHERG* & 8 & 1.0 & 1.83 & 6.34 & 1.23 \\\\\nHERG & 15 & 1.0 & 1.97 & 5.41 & 1.89 \\\\\nHERG* & 15 & 1.0 & 1.65 & 5.28 & 2.33 \\\\\nHERG & 10 & 0.5 & 1.92 & 5.52 & 1.61 \\\\\nHERG* & 10 & 0.5 & 1.59 & 5.44 & 1.98 \\\\\nHERG & 10 & 0.1 & 2.38 & 5.95 & 2.02 \\\\\nHERG* & 10 & 0.1 & 2.06 & 5.84 & 2.43 \\\\\nHERG & 10 & 0.01 & 9.34 & 16.43 & 3.17 \\\\\nHERG* & 10 & 0.01 & 9.53 & 17.55 & 2.89 \\\\\n\\hline\n\\end{tabular}\n\\label{chi2}\n\\end{table}\nAs shown in Fig.~\\ref{beam}, the best-fit power-law for F-NLS1s and the model prediction are in good agreement, but there is a deviation at lower luminosities. In particular, the slope of the model in the region occupied by F-NLS1s is -1.55, while the slope of the measured LF is -1.17. The values of $\\chi^2_\\nu$ are not very close to 1, largely because of this deviation. We think that the latter is due to a selection effect. Our F-NLS1s sample includes only very radio-loud NLS1s, therefore the resulting luminosity function might be underestimated in the low luminosity region. Keeping this in mind, the overlapping of the model with the observed function is quite satisfactory. \\par\nIn Tab.~\\ref{chi2} we report the values of $\\chi^2_\\nu$ calculated with the different values of $\\Gamma$ and $f$. We highlight that the closest $\\chi^2_\\nu$ between the model and the data is observed in the sample which includes the two sources with undetermined spectral index, for a ratio $f$ = 0.5 and $\\Gamma = 10$, which translates in a slope of the model of -1.59. This value of $f$ is significantly higher than that observed in FSRQs, which is between $10^{-3}-10^{-2}$ \\citep{Padovani92}. \\par\n\n\\section{Discussion}\n\\subsection{Black hole mass}\nThe first result that must be highlighted is that the black hole mass distribution of CSS/HERGs is quite similar to that of F-NLS1s, with typical values between 10$^7$ and 10$^8$ M$_\\odot$. Also the Eddington ratio is quite high, comparable to that of typical NLS1s, both radio-loud and quiet. This is quite expected if NLS1s and CSS/HERGs have both a radiatively efficient accretion mechanism, similar to that of FSRQs. \\par\nThe K-S test revealed that the distributions of these quantities, both mass and Eddington ratio, in F-NLS1s and CSS/HERGs might be drawn from the same population. The most obvious interpretation of this result is that CSS/HERGs might actually be misaligned F-NLS1s. Of course this result is obtained for very small samples, so it must be taken with some caution. In particular the masses of CSS/HERGs, being derived using forbidden lines, must be considered only as an upper limit. If the narrow-line region is perturbed because of interaction with the relativistic jet, the FWHM is indeed higher, and leads to an overestimate of the mass. Nevertheless our findings are in good agreement with those of previous works, where the similarity between CSS/HERGs and NLS1s was already pointed out. For example \\citet{Wu09} found that a large number of CSS/GPS has a black hole mass between 10$^{7.5}$ and 10$^8$ M$_\\odot$, and the same conclusion was obtained by \\citet{Son12} again on CSS, both HERGs and LERGs. Moreover the sample by \\citet{Foschini15}, of which our is a subset, revealed that on average F-NLS1s have also black hole mass between 10$^7$ and 10$^8$ M$_\\odot$. All these results then seem to support our hypothesis. \n\\subsection{Evolutionary picture}\nThe V/V$_{max}$ test shows that both F-NLS1s and CSS/HERGs have no significant luminosity and/or density evolution up to z $=$ 0.6. FSRQs instead show a strong luminosity evolution, but the sample is extended to much larger distances. An interesting result we found is shown in Fig.~\\ref{fsrq_flat}, and it might point out that FSRQs and F-NLS1s are strictly connected to each other. F-NLS1s were suggested to be the low-mass tail of $\\gamma$-ray emitting AGN, and in particular of FSRQs \\citep[][and references therein]{Foschini15}. Since the black hole mass and the jet power are connected \\citep{Heinz03}, the lower radio-luminosity and jet power of F-NLS1s might be a consequence of the lower black hole mass. Therefore it is expected to find F-NLS1s being the low-luminosity tail of FSRQs LF, as we indeed observe. Of course, there might be some low luminosity FSRQs which cannot be classified as NLS1s. The criteria for NLS1s classification is indeed based mainly on the H$\\beta$ width, which is not just a function of the black hole mass. Therefore not all low mass FSRQs can be classified as NLS1s, even if their black hole mass and radio emission are comparable. \\par\nAn explanation for the low mass is the young scenario of NLS1s. If this is true, F-NLS1s might be the young counterpart of FSRQs in which the nuclear activity started only recently, and in which the black hole (and possibly the host galaxy) is still (co-)evolving. \nA similar picture was already suggested for CSS sources years ago \\citep{Readhead96, Fanti95, Odea97}. These likely young radio sources are thought to be an evolutionary phase that is going to evolve into the giant double sources. In particular, \\citet{Kunert10b} took into account also the optical division into HERG and LERG, finding that the CSS/HERGs sources are likely going to evolve into FR$_{HERG}$. Recently, \\citet{Giommi12} suggested that the two blazar classes, and hence their parent population, should be divided according to their low or high ionization, and that all the other classifications are physically irrelevant. If this is true, FSRQs can be identified as beamed HERGs, and F-NLS1s, which might be young FSRQs, should be the beamed version of young HERGs, so CSS/HERGs. In summary, the evolutionary picture for beamed sources might be simply F-NLS1 $\\rightarrow$ FSRQ, and for their parent population CSS/HERGs $\\rightarrow$ FR$_{HERG}$. An evolutionary connection between F-NLS1s and FSRQs is then possible, where the formers are still growing to become the latters. This hypothesis finds further support in our Fig.~\\ref{beam}. When the relativistic beaming is added using the typical bulk Lorentz factor of $\\gamma$-ray emitting NLS1s, CSS/HERGs LF reproduces quite well the data. Even if at low luminosities the model predicts a larger number of F-NLS1s that we do not observe, we think that this discrepancy might only be due to the selection criterion of our NLS1s sample. Keeping this caveat in mind, the model seems then to indicate that CSS/HERGs might be good parent candidates. \\par\nIn young radio-sources as CSS, the jet activity might be intermittent, and several outburst episodes might be induced by pressure radiation instabilities in the accretion disk, with a timescale of 10$^2$-10$^5$ years \\citep{Czerny09, Wu09b}. A similar, strong variability is observed also in RLNLS1s \\citep{Foschini12a, Foschini15}, providing further confirmation for this unified model. If CSS/HERGs are parent sources, the origin for these activity/inactivity phases in F-NLS1s might be the same. The radiation pressure instability is indeed one of the hypotheses that can account for the non-thermal emission and extended structures observed in some radio-quiet NLS1s \\citep{Doi12}, where the jet activity phase might have lasted for only a few years leaving then the observed structures \\citep{Ghisellini04}. \\par\nThe inclusion of CSS/HERGs in the parent population of F-NLS1s might moreover definitively rule out the vast majority of RQNLS1s as parent candidates. In fact, since CSS/HERGs display lobes already developed \\citep{Orienti15}, this means that the extended radio emission form even in very young ages, which in turn implies the rejection of the radio-quiet hypothesis. This conclusion is in agreement with the results of \\citet{Berton15b}, where the observed differences in narrow-line region properties points in the same direction. \\par\nAnother aspect to consider is the role that S-NLS1s can play in this scenario. These sources are likely misaligned F-NLS1s \\citep{Berton15a}, therefore for this picture to be coherent they should also be part of the larger class of CSS/HERGs. The sample we used in this work unfortunately does not include any type 1 AGN, so our data can reveal nothing on this issue. Anyway this topic has already been investigated in the literature, particularly in recent years. Several authors indeed found that at least some S-NLS1s can indeed be classified as CSS/HERGs \\citep{Caccianiga14, Komossa15, Schulz15}. In particular the extended survey by \\citet{Gu15} showed that the radio morphology of almost each one of their S-NLS1s closely recalls that of CSS. These results are therefore in agreement with our hypothesis, and seem to favor the scenario in which CSS/HERGs are the largest class of F-NLS1s parent sources. It is also reasonable that S-NLS1s are objects observed at intermediate angles between F-NLS1s and obscured (type 2) CSS/HERGs. \\par\nIt is anyway not clear whether all type 1 CSS/HERGs are NLS1s. Few CSS/HERGs have indeed lines with a FWHM(H$\\beta$) $>$ 2000 {km s$^{-1}$}, and cannot be classified as NLS1s. It is then possible that the unification between CSS/HERGs and NLS1s is only in a statistical sense, that is CSS/HERGs and NLS1s are on average the same population, but with few exceptions likely connected to the NLS1s definition. If a more physical classification was used, such as black hole mass or Eddington ratio, the unification between these sources would show less outliers.\\par Anyway, it is also possible that the BLR geometry has some impact on these outliers. If a flattened component in the BLR is present, sources with a large inclination should appear as broad-line AGN, not classifiable as NLS1s. The presence of some relatively high mass type 1 sources in a CSS/HERGs sample might then provide a clue to the BLR geometry. Anyway it is worth noting that in the sample of CSS by \\citet{Son12}, the type 1 AGN have a BH mass always below 5$\\times$10$^8$ M$_\\odot$, and an average value of 8.9$\\times$10$^7$ M$_\\odot$. If these sources had a flattened BLR and were randomly oriented, some of them would show a much larger mass. Instead all the values are in good agreement with those of F-NLS1s, so they do not seem to have a flattened component in the BLR. In any case, a deeper study on a larger sample is necessary to better address this problem. \\par\n\n\\subsection{Host galaxy}\nA possible objection to the identification of CSS/HERGs as the parent population of F-NLS1s is that their host galaxy might be different. In particular CSS, as many radio-loud AGN, are usually thought to be hosted by elliptical galaxies \\citep{Best05, Orienti15} and triggered by merging activity \\citep{Holt09}. NLS1s instead are generally believed to be hosted by spiral galaxies \\citep{Crenshaw03} with a pseudobulge formed via secular evolution \\citep{Orbandexivry11, Mathur12}. Nevertheless, the K-S test we performed, along with other studies, seems to draw a more complicated picture. \\par\nCSS/HERGs have a black hole mass distribution closer to that of disk RGs than to that of elliptical RGs, showing typically lower black hole mass. This might be due to the young age of these sources, so perhaps the black hole is still growing to reach the mass value of typical elliptical. Anyway the black hole mass is directly connected with the bulge dynamics, particularly with its stellar velocity dispersion \\citep{Ferrarese00}. So in principle a relatively low mass black hole should be rather hosted in the small bulge of a disk galaxy, instead than in a more massive elliptical. Therefore it is possible that CSS/HERGs are also hosted in disk galaxies, as NLS1s. An example of disk-host for a powerful CSS was found by \\citet{Morganti11}. Moreover in a very large sample of AGN \\citet{Best12} found that HERGs host-galaxies have different properties than those of LERGs, and in particular that they are bluer, with lower mass, lower 4000 \\AA{} break and a stronger star formation. Such characteristics are reminiscent of those of a disk or star-forming galaxy. \\par\nFinally, we must underline that not much is known even about the host galaxy of F-NLS1s, mainly because of their high redshift. Few studies were performed on the closest F-NLS1, 1H 0323+342, and seem to suggest the presence of a disk and possibly of a pseudobulge \\citep{Anton08,Hamilton12,Leontavares14}, but of course further studies are necessary to characterize them as a population. \n\n\n\n\n\n\\section{Summary}\nIn this paper we investigated the relation that exists between CSS sources with an HERG optical spectrum and F-NLS1s. Our aim was to understand whether the CSS/HERGs class can be part of the parent population of F-NLS1s. To do this, we analyzed the only two statistically complete samples of CSS/HERG and F-NLS1 available so far. First we calculated the black hole mass and Eddington ratio by means of the optical spectrum, and then we studied their radio luminosity functions along with that of a control sample of FSRQs. \\par\nThe black hole masses are tipically between 10$^{7.5}$ and 10$^8$ M$_\\odot$ in both samples, and the Eddington ratio is around $\\sim$0.1. We performed a Kolmogorov-Smirnov test on the samples to compare their black hole mass distributions. Our results, in agreement with previous studies in the literature, seem to confirm that the two distributions might be drawn from the same population, and hence that CSS/HERGs are good candidates as parent sources. \\par\nThe luminosity functions seem to support the same scenario. A first result is that F-NLS1s might be the low-luminosity (and low-mass) tail of FSRQs, confirming the results of \\citet{Abdo09a} and \\citet{Foschini15}. The addition of relativistic beaming to CSS/HERGs luminosity function revealed that the latter might actually be F-NLS1s with the jet viewed at large angle, and thus belonging to the parent population. In this framework, RLNLS1s with a steep radio-spectrum are sources observed at intermediate angle between F-NLS1s and CSS/HERGs with a type 2 (absorbed) optical spectrum. \\par\nOur results seem also to be consistent with an evolutionary picture in which F-NLS1s and CSS/HERGs are the young and still growing phase of FSRQs and FR$_{HERG}$, respectively. A more detailed study is required on larger samples of sources. In particular, new spectral indices are necessary to effectively compare CSS/HERGs and F-NLS1s. New large surveys at different frequencies, such as VLASS, might be helpful to improve our knowledge on these sources. Also SKA, with its unprecedented sensitivity, will likely provide an incredible amount of information to largely deepen our understanding of RLNLS1s \\citep{Berton16a}. \n\n\\begin{acknowledgements}\nWe thank M.~L. Lister and R. Antonucci for helpful suggestions and discussions. This research has made use of the NASA/IPAC Extragalactic Database (NED) which is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and  Space Administration. Funding for the Sloan Digital Sky Survey has been provided by the Alfred P. Sloan Foundation, and the U.S. Department of Energy Office of Science. The SDSS web site is \\texttt{http://www.sdss.org}. SDSS-III is managed by the Astrophysical Research Consortium for the Participating Institutions of the SDSS-III Collaboration including the University of Arizona, the Brazilian Participation Group, Brookhaven National Laboratory, Carnegie Mellon University, University of Florida, the French Participation Group, the German Participation Group, Harvard University, the Instituto de Astrofisica de Canarias, the Michigan State/Notre Dame/JINA Participation Group, Johns Hopkins University, Lawrence Berkeley National Laboratory, Max Planck Institute for Astrophysics, Max Planck Institute for Extraterrestrial Physics, New Mexico State University, University of Portsmouth, Princeton University, the Spanish Participation Group, University of Tokyo, University of Utah, Vanderbilt University, University of Virginia, University of Washington, and Yale University.\n\\end{acknowledgements}\n\n\\bibliographystyle{aa}\n\\bibliography{./biblio}\n\n\n", "itemtype": "equation", "pos": 30132, "prevtext": "\nwhere $\\Phi_b$ is the normalization factor, $L_b$ is the break luminosity, and $\\alpha$ and $\\beta$ are the two slopes. In the FSRQs sample we also applied a correction for luminosity evolution to bring each source to z = 0. For this purpose, we assumed the same cosmological evolution found by \\citet{Padovani92}, $\\exp{(-T/\\tau)}$, where $T$ is the lookback time and $\\tau = 0.23$ is the time-scale of evolution in units of Hubble time. Using the spectral indices we also derived the 1.4 GHz flux for each FSRQ, to allow a direct comparison with the other samples. All fits were performed using the generalized least squares method. The results are shown in Fig.~\\ref{fsrq_lf} and \\ref{fig:lf2}, and summarized in Tab.~\\ref{tab:lf}. \\par\nOur FSRQs LF is in agreement with that obtained by \\citet{Padovani92} when the cosmology they adopted is used. In F-NLS1s, we note that the inclusion in the LF of the two sources with undetermined spectral index has a negligible impact, since neither the slope nor the coefficient of the LF are significantly affected (Tab.~\\ref{tab:lf}). In both cases, the scatter is quite high, likely because of the low statistic. The slope of HERGs is steeper than that of F-NLS1s, which indeed have a quite flat LF. In particular, the slope of F-NLS1s is close to that of FSRQs for luminosities below the break, even if the error on this slope is quite large. This result becomes more evident when the LFs of F-NLS1s and FSRQs are shown together, as in Fig.~\\ref{fsrq_flat}. The two LFs are quite close in the region of $10^{43}$ {erg s$^{-1}$}, and the LF of F-NLS1s appears to be an extension of that of FSRQs at lower luminosities. \n\\begin{figure}[t!]\n\\centering\n\\includegraphics[width=\\hsize]{fsrq_flat_lf.eps} \n\\caption{Monochromatic radio luminosity functions of F-NLS1s and FSRQs at 1.4 GHz. The black squares are the F-NLS1s data points, the blue triangles the FSRQs data points. The blue dashed line is the broken power-law best-fit for FSRQs, the black solid line is the single power-law best-fit for F-NLS1s.}\n\\label{fsrq_flat}\n\\end{figure}\n\\subsection{Relativistic beaming}\nIn order to compare the beamed sources with their parent population, we have to take into account the effect of beaming on the LF shape. We then added the relativistic beaming to the CSS/HERGs luminosity function. This cannot be done analitically, as explained by \\citet{Urry84} and \\citet{Urry91}. We followed the procedure described by \\citet{Urry84} for a single power-law. In analogy with that work, we defined as ${\\mathcal{L}}$ the intrinsic luminosity, and with $L$ the observed luminosity. These two quantities are related via $L = \\delta^p {\\mathcal{L}}$, where $\\delta = [\\Gamma(1-\\beta\\cos\\theta)]^{-1}$ is the kinematic Doppler factor of the jet and the exponent is $p = 3 + \\alpha_\\nu$, where $\\alpha_\\nu$ is the intrinsic slope of the jet emission. The total flux emitted by the source is given by L = (1 + $f\\delta^p$)${\\mathcal{L}}_u$, where ${\\mathcal{L}}_u$ is the unbeamed luminosity and $f$ the ratio between the jet luminosity and the unbeamed luminosity. The model is then evaluated numerically via\n\n", "index": 15, "text": "\\begin{equation}\n\\Phi(L) = \\int \\frac{K}{\\beta\\gamma p} f^{1/p} {\\mathcal{L}}^{\\alpha-1} \\left(\\frac{L}{{\\mathcal{L}}}-1\\right)^{-(p+1)/p} \\mathrm{d}{\\mathcal{L}} \\; .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"\\Phi(L)=\\int\\frac{K}{\\beta\\gamma p}f^{1/p}{\\mathcal{L}}^{\\alpha-1}\\left(\\frac{%&#10;L}{{\\mathcal{L}}}-1\\right)^{-(p+1)/p}\\mathrm{d}{\\mathcal{L}}\\;.\" display=\"block\"><mrow><mrow><mrow><mi mathvariant=\"normal\">Φ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>L</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mfrac><mi>K</mi><mrow><mi>β</mi><mo>⁢</mo><mi>γ</mi><mo>⁢</mo><mi>p</mi></mrow></mfrac><mo>⁢</mo><msup><mi>f</mi><mrow><mn>1</mn><mo>/</mo><mi>p</mi></mrow></msup><mo>⁢</mo><msup><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi><mrow><mi>α</mi><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mfrac><mi>L</mi><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi></mfrac><mo>-</mo><mn>1</mn></mrow><mo>)</mo></mrow><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mi>p</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mo>/</mo><mi>p</mi></mrow></mrow></msup><mo>⁢</mo><mrow><mo>d</mo><mpadded width=\"+2.8pt\"><mi class=\"ltx_font_mathcaligraphic\">ℒ</mi></mpadded></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]