[{"file": "1601.05538.tex", "nexttext": "\nwhere $\\epsilon_0 = C_0 + C_1 k_z^2 + C_2 k^2$ and $M(\\vec{k}) = M_0 - M_1 k_z^2 - M_2 k^2$ \\cite{PRB85_195320, PRB88_125427}, $k^2 = k_x^2+k_y^2$.  $A$, $C_0, C_1, C_2, M_0, M_1$ and $M_2$ are material parameters for which we used the values in Ref. \\cite{PRB85_195320}. The Hamiltonian consists of two uncoupled blocks representing the spin up and spin down states, which we can consider separately. We focus on the spin up states. \n\nDiagonalizing the spin up block yields the eigenvalues \n\n", "itemtype": "equation", "pos": 4417, "prevtext": " \n\\title{Dirac semimetal thin films in in-plane magnetic fields} \n\n\\author{Zhuo Bin Siu}\n\\affiliation{Computational Nanoelectronics and Nanodevices Laboratory, Electrical and Computer Engineering Department, National University of Singapore, Singapore} \n\\author{Mansoor B. A. Jalil} \n\\affiliation{Computational Nanoelectronics and Nanodevices Laboratory, Electrical and Computer Engineering Department, National University of Singapore, Singapore} \n\\author{Seng Ghee Tan} \n\\affiliation{Data Storage Institute, Agency for Science, Technology and Research (A*STAR), Singapore} \n\n\\begin{abstract}\nIn this work we study the effects of in-plane magnetic fields on thin films of the Dirac Semimetal (DSM) \\ce{Na3Bi} where one of the in-plane directions is perpendicular to the $k$-separation between the two Dirac points that exist for each spin orientation. We show numerically that the states localized near the surfaces of these thin films are related to the Fermi arc states in semi-infinite slabs. Due to the anisotropy between the two in-plane directions, the application of a magnetic field along these directions have differing effects.  A field parallel to the $k$ space separation between the Dirac points leads to a broadening of the surface state band and the formation of an energy plateau, while a perpendicular field shifts the energy where the hole and particle bands meet upwards, and sharpens the tips of the bands. We illustrate the effects of these changes to the dispersion relation by studying the transmission from a source segment without a magnetic field to a drain segment with a field, with the field and interface at various in-plane directions.      \n\\end{abstract} \n\n\\maketitle\n\n\n\\section{Introduction} \n\nThe Dirac Semimetal (DSM) \\cite{PRB85_195320, PRB83_205101, PRL108_140405, PRB88_125427} is a recently discovered topologically non-trivial state  which has attracted much attention.  Like the surface states of the more established three-dimensional topological insulators (TI) \\cite{RMP82_3045, JPSJ82_102001} , the low energy spectrum of DSMs take the form of Dirac cones. Unlike the Dirac cones in three-dimensional TI surface states which have linear dispersion only in the two dimensions in the plane of a TI \\textit{surface}, the DSM Dirac cones disperse linearly in all three $k$-space dimensions in \\textit{bulk} DSMs about the Dirac points. Moreover, unlike in conventional TIs where there is a odd number of Dirac points, the Dirac points in DSMs occur in pairs with one member of each pair acting as a Berry curvature source and the other member acting as a Berry curvature sink.   These pairs of Dirac points in DSMs give rise to surface states in the form of Fermi arcs linking the two points in $k$-space when the bulk DSM is truncated perpendicular to the direction of the $k$-space separation between the Dirac points.  These Dirac points are topologically stable against perturbations which preserve the translational symmetry. To date, two materials, \\ce{Cd3As2} \\cite{NatMat13_677, PRL113_027603, NatComm5_3786, NatMat13_851} and \\ce{Na3Bi}\\cite{Sci343_864, APL105_031901, Sci347_294}  have been experimentally confirmed to host the DSM state. \n\nThe effects of electric fields applied perpendicular to the surfaces of quasi-two dimensional thin films and quasi-one dimensional \\ce{Na3Bi} nanowires have been studied recently \\cite{SciRep5_7898, SciRep5_14639}.  In this work, we study the effects of \\textit{in plane magnetic fields} on DSM thin films. To lay the foundations for our subsequent discussion, we first review the energy dispersion of bulk \\ce{Na3Bi} and the emergence of Fermi arcs on semi-infinite slabs of \\ce{Na3Bi} terminated perpendicular to the $k$-space separation between the Dirac points. We then consider DSM thin films with finite thickness, and next move on to discuss the effects of in-plane magnetic fields on the dispersion relations. We finally showcase one consequence of the magnetic fields by considering the transmission from a source DSM thin film segment without a magnetic field to a drain DSM segment with a magnetic field for various directions of magnetic fields and source-drain interfaces. The anisotropy between the directions parallel and perpendicular to the $k$ space separation between the Dirac points gives rise to a rich transmission profile. \n\n\\section{ Bulk eigenstates } \n\nThe Hamiltonian for bulk \\ce{Na3Bi} reads  \n", "index": 1, "text": "\n\\[ \n\tH = \\epsilon_0(\\vec{k}) + \\begin{pmatrix} M(\\vec{k}) & A k_+ & 0 & 0 \\\\\n\tAk_- & -M(\\vec{k}) & 0 & 0 \\\\\n\t0 & 0 & M(\\vec{k}) & -Ak_- \\\\\n\t0 & 0 & -A k_+ & - M(\\vec{k}) \\end{pmatrix}\n\\]\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"H=\\epsilon_{0}(\\vec{k})+\\begin{pmatrix}M(\\vec{k})&amp;Ak_{+}&amp;0&amp;0\\\\&#10;Ak_{-}&amp;-M(\\vec{k})&amp;0&amp;0\\\\&#10;0&amp;0&amp;M(\\vec{k})&amp;-Ak_{-}\\\\&#10;0&amp;0&amp;-Ak_{+}&amp;-M(\\vec{k})\\end{pmatrix}\" display=\"block\"><mrow><mi>H</mi><mo>=</mo><mrow><mrow><msub><mi>ϵ</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mo>(</mo><mtable columnspacing=\"5pt\" displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mi>M</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"center\"><mrow><mi>A</mi><mo>⁢</mo><msub><mi>k</mi><mo>+</mo></msub></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi>A</mi><mo>⁢</mo><msub><mi>k</mi><mo>-</mo></msub></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mrow><mi>M</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mi>M</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mrow><mi>A</mi><mo>⁢</mo><msub><mi>k</mi><mo>-</mo></msub></mrow></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mn>0</mn></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mrow><mi>A</mi><mo>⁢</mo><msub><mi>k</mi><mo>+</mo></msub></mrow></mrow></mtd><mtd columnalign=\"center\"><mrow><mo>-</mo><mrow><mi>M</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mover accent=\"true\"><mi>k</mi><mo stretchy=\"false\">→</mo></mover><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05538.tex", "nexttext": " \nand the (unnormalized) eigenspinors\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere $\\epsilon_0 = C_0 + C_1 k_z^2 + C_2 k^2$ and $M(\\vec{k}) = M_0 - M_1 k_z^2 - M_2 k^2$ \\cite{PRB85_195320, PRB88_125427}, $k^2 = k_x^2+k_y^2$.  $A$, $C_0, C_1, C_2, M_0, M_1$ and $M_2$ are material parameters for which we used the values in Ref. \\cite{PRB85_195320}. The Hamiltonian consists of two uncoupled blocks representing the spin up and spin down states, which we can consider separately. We focus on the spin up states. \n\nDiagonalizing the spin up block yields the eigenvalues \n\n", "index": 3, "text": "\\begin{equation}\n\t\\epsilon_\\pm = \\epsilon_0 \\pm \\sqrt{ (Ak)^2 + M^2}  \\label{egEn} \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\epsilon_{\\pm}=\\epsilon_{0}\\pm\\sqrt{(Ak)^{2}+M^{2}}\" display=\"block\"><mrow><msub><mi>ϵ</mi><mo>±</mo></msub><mo>=</mo><mrow><msub><mi>ϵ</mi><mn>0</mn></msub><mo>±</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>A</mi><mo>⁢</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>M</mi><mn>2</mn></msup></mrow></msqrt></mrow></mrow></math>", "type": "latex"}, {"file": "1601.05538.tex", "nexttext": " \n\nThe bulk energy dispersion is shown in Fig. \\ref{gE4B}. The dispersion relation consists of two parabolic cone-like structures above (below) $\\epsilon_0$ corresponding to the $+$ ($-$) sign of Eq. \\ref{egEn} with the cone tips squashed inwards to form cusps, so that the points where the cone tip starts curving inwards correspond to the lowest (highest) energy at the two Dirac points.  The two Dirac points have energy $\\epsilon_0$ and lie along the $k_z=0$ line. \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.6]{E4B.eps}\n\\caption{  Energy offset from $\\epsilon_0$ plotted as a function of $k=\\sqrt(k_x^2+k_y^2)$ and $k_z$.  } \n\\label{gE4B}\n\\end{figure}\t\t\n\n\n\\section{Semi-infinite slabs}\nOne hallmark of a DSM is the emergence of Fermi arcs when a bulk DSM is truncated perpendicular to the $k$-space separation between the Dirac points. We therefore consider a semi-infinite slab terminated at the $x$ direction so that the slab extends to infinity along the $y$ and $z$ directions, and $k_y$ and $k_z$ are good quantum numbers. Fig. \\ref{gFermiArcs} shows the calculated Fermi arcs for spin up at various values of energy for semi-infinite slabs terminated along the $x=0$ line and extending to $x \\rightarrow \\pm \\infty$ respectively, as well as the \\textit{infinite} bulk equal energy contours at $k_x=0$ at those values of energy. The spin up Fermi arcs for semi-infinite slabs extending to $x\\rightarrow \\pm \\inf$ are reflections of each other along the $k_y=0$ line. (The spin down Fermi arcs are the reversal of the spin up Fermi arcs) .\n\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.6]{FermiArcs.eps}\n\\caption{  The thick lines indicate the Fermi arcs at the values of energy indicated in the legend. Solid lines correspond to the spin up Fermi arcs at a $+x$ terminated surface on a semi-infinite slab extending to $x\\rightarrow -\\infty$ while dotted lines correspond to arcs on $x$ terminated surfaces extending to $z \\rightarrow +\\infty$.  The thin dotted lines are the bulk EECs for an infinite slab at $k_x=0$ at the indicated values of energy.   }\n\\label{gFermiArcs}\n\\end{figure}\t\t\n\n The arcs emerge once the energy is increased from $-\\infty$ to the bottom of the bulk hole band cusp and continue to exist as the energy is increased towards $+\\infty$. The arcs are tangential to the bulk Equal Energy Contours (EECs) calculated with the wavevector perpendicular to the surface ( $k_x$ in this case ) set to 0.  (The two circles, one on the left and the other on the right, for each of the EECs for the three lower values of energies are the cross sections on the two `humps' on either side of the cusp in the hole bands. The single circle in the middle for $E=100\\ \\mathrm{eV}$ is the cross section of the `cone' of the bulk particle band. This value of energy lies above the top of the cusp of the bulk particle band. ) \n\nWe shall later see that the arcs play a significant role in the dispersion relations of thin films. \n\n\n\\section{Thin films} \n\nWe next consider thin films of infinite dimensions along the $y$ and $z$ direction, and finite thickness along the $x$ direction. $k_y$ and $k_z$ are hence good quantum numbers. In contrast to the semi-infinite slab which has only a single surface, a thin film has both an upper and a lower surface. As a result we expect to see aspects which we are familiar with from the previous discussion on semi-infinite slabs, as well as features which now emerge because of the finite thickness. \n\nFig. \\ref{gWx20kzComb} shows the dispersion relations for a 20 nm thick film at various values of $k_y$ as a function of $k_z$.  \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.4]{Wx20kzComb.eps}\n\\caption{  The dispersion relations for a 20 nm thick film as a function of $k_z$ for various values of $k_y$ indicated by the colors of the lines. The dotted lines show the bulk energy values assuming $k_x=0$. The thicker lines denote what we shall, for brevity, refer to as the 'lowest energy particle band' (LEPB). } \n\\label{gWx20kzComb}\n\\end{figure}\t\t\n\nSimilar to the semi-infinite slab, the hole bands bend downwards in energy at small $|k_z|$ to give rise to a cusp between the two Dirac points.  The finite thickness of the thin film here and leads to the formation of subbands. \n\nThere is a subband, highlighted with slightly thicker line Fig. \\ref{gWx20kzComb}, which traces the bulk $k_x = 0$ particle band for $k_z$ values outside the bulk cusp and the bulk hole band inside the bulk cusp. This band is special, as we shall explain later. For brevity we shall refer to it as the Lowest Energy Particle Band (LEPB), and the subband immediately below it in energy as the Highest Energy Hole Band (HEHB).  Except for the LEPB, the particle band bottoms are bounded in energy above the $k_x=0$ bulk particle band. The energies of the hole bands at $|k_z|$ lying outside the  two bulk Dirac points are also bounded below the $k_x=0$ bulk hole band.  At energies above the Dirac point corresponding to $|k_z|$ lying outside the two bulk Dirac points, the energy of the LEPB follows that of the bulk particle states closely. At energies below the Dirac point the energy of the lowest energy particle states lie slightly above the top of the `cusp' in the hole energy bands for $k_z$ lying between the two Dirac points. The band bottoms (tops) of the particle (hole) bands increase (decrease) in energy monotonously with $|k_y|$.  \n\nFor another perspective we now plot out the $k$ space EECs for the 20 nm thick thin film which we have been considering, as well at that of a thicker $50\\ \\mathrm{nm}$ thick film at $E=-50 \\mathrm{eV}$ in Fig. \\ref{gEm50Comb}. This is a value in energy which lies above the bottom of the LEPB but below the two `humps' surrounding the small $|k_z|$ cusp. \n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.4]{Em50Comb.eps}\n\\caption{  In  panel (a) on the left, the thick solid lines around the $k$-space origin represent the bulk Fermi arcs for slabs infinite in the $y$ and $z$ direction, and semi-infinite in the $+x$ and $-x$ direction at $E=-50 \\mathrm{eV}$.  The dotted green lines are the bulk EECs at the same value of energy, while the dots trace out the EECs for a 20 nm, and 50 nm thick film as indicated by the color of the dots. The relative charge densities of the states within the thickness of the thin film at various points in $k$-space and $E=-50 \\mathrm{eV}$ marked \\textit{i} to \\textit{vi} on the EECs are plotted out in panels (b) to (d). }\n\\label{gEm50Comb}\n\\end{figure}\t\t\n\nOne dominant feature of the figure is the presence of two series of concentric rings of EECs, one series of rings on the left and the other series on the right which we shall for simplicity refer to as the left and right onions. These two onions correspond to the two `humps' in Fig. \\ref{gWx20kzComb} that, at higher energies, eventually form the two Dirac points while the empty space in between corresponds to the cusp between the two humps in Fig.  \\ref{gWx20kzComb}. The outermost rings of each onion correspond to the HEHB.  The states that lie outside the two bulk Fermi arcs are bounded by the bulk EECs indicated by the green dotted lines. These states, such as states (iv) to (vi) in the diagram, are bulk states where there is significant charge density away from the two boundaries. In particular, away from the Fermi arcs, the bulk states (v) and (vi) resemble the usual infinite quantum well states with increasing number of density nodes as we move into the interior of the onion. As one would expect from the infinite quantum well, a larger thickness results in a larger number of states at a given energy. \n   \nWe now focus on the $k$-space around the vicinity of the bulk Fermi arcs. The bulk Fermi arcs for the upper and lower surface `penetrate' each other so that for fixed value of $|k_y|<0.15 \\mathrm{nm}^{-1}$ a line of constant $k_z$ cuts through both the upper and lower surface bulk Fermi arcs. There are always thin film states which lie near the bulk Fermi arcs regardless of the thickness of the film. The states which lie near the Fermi arcs are localized near the surface ( see the states labeled (i) to (iii) ) which the arcs correspond to, although the extent of localization decreases with increasing $|k_z|$ (compare state (iii) with states (i) and (ii) ). \n\nStates (i) and (iii) share approximately the same $k_y$ value. Point (i) with the smaller $|k_z|$ lies on the LEPB and point (iii) with the bigger $|k_z|$ lies on the HEHB. The states lying in the vicinity of the bulk Fermi arcs for small $|k_z|$ smaller than the $|k_z|$ which the two Fermi arcs intersect each other lie on the LEPB, while the states that lie on the Fermi arcs for larger values of $|k_z|$ lie on the HEHB. The states on the LEPB are therefore always surface states. The states on the HEHB (i.e. the outermost rings of the onions) for small $|k_z|$ lying on the Fermi arcs are also surface states (e.g. iii), but those states on the HEHB with larger values of $|k_z|$ (e.g. vi) are not surface states. \n\nAn examination of the EECs and density distribution at other values of energies (not shown) indicates that the LEPB states at a given energy are always located near the bulk Fermi arcs and are localized near either the upper or lower surface, whereas the other states present at the same value of energy located away from the bulk Fermi arcs are bulk states. The $k$-space locations of the LEPB states at a given energy are only very weakly dependent on the film thickness. Together, these indicate that the LEPB states originate from the bulk Fermi arcs and may share the topological protection of the latter. This robustness makes the LEPB states of particular interest in potential device applications. We shall consequently concentrate on the low energy regime in which only the LEPB is  present. \n\n\\section{Effects of an in-plane magnetic field} \nThe effects of an out-of-plane electric field on a DSM thin film / quasi-one-dimensional nanostructure were investigated in Refs. \\cite{SciRep5_7898,SciRep5_14639}. However to the best of our knowledge the effects of an in-plane magnetic field has not yet been studied. Here we investigate how a magnetic field in the $y$ and $z$ directions affect the dispersion relations. The modification of the equal energy contours by an in-plane magnetic field, and the anisotropy between the $k$-space directions perpendicular and parallel to the $k$ space separation between the Dirac points shall, as we show in the next section, lead to dramatic differences in the transmission from a source DSM segment without a magnetic field to a drain segment with a field as the energy and magnetic field are varied. \n\nWe model a magnetic field in the $y$ direction via the canonical substitution $k_z\\rightarrow (k_z +\\tilde{B}_y x)$ and a field in the $z$ direction via $k_y \\rightarrow (k_y - \\tilde{B}_y x)$ where we have absorbed the various physical constants into $\\vec{\\tilde{B}}$. In our numerical calculations the units for $k_y$ are in $\\mathrm{nm}^{-1}$, so that the quantities of $\\vec{\\tilde{B}}$ which appear subsequently carry units of $\\mathrm{nm}^{-2}$. \n\nFig. \\ref{gW20ByComb} shows the dispersion relations calculated as functions of the $y$ and $z$ wavevectors with the wavevector in the other direction set to 0 at various values of magnetic field in the $y$ direction. The $y$ direction is perpendicular to the $k$-space separation between the two Dirac points. We have split the $k_y$ dispersion relations into two separate panels in the figure for clarity.  \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.28]{W20ByComb.eps}\n\\caption{  The dispersion relations for a $20\\ \\mathrm{nm}$ thick slab (a) and (b) as a function of $k_z$ at $k_y = 0$,  and  (c) as a function of $k_y$ at $k_z = 0$ at the values of $\\tilde{B}_y$ indicated in the figure legends.  The LEPBs are indicated by thicker lines. }\n\\label{gW20ByComb}\n\\end{figure}\t\t\n\nFocusing first on panel (a) of the figure, we see that a small $B_y$ leads to the HEHB states with small $|k_z|$ bending upwards in energy to form a small upwards pointing kink centered at $k_z=0$. The band bottom of the LEPB band sharpens to form a downwards pointing kink at $k_z=0$ so that the $k$ space vicinity around where the LEPB and HEHB touch at $\\vec{k}=0$ is now reminiscent of a Dirac cone.  The portion of the band on the left and right side of this downwards kink form a plateau at around $60\\ \\mathrm{eV}$ in energy. The ``Dirac point'' where the LEPB and HEHB touch shifts upwards in energy as $B_y$ increases until it hits the band plateau (see panel (b) ) at around $60\\ \\mathrm{eV}$.  At this stage the downwards pointing kink in the particle band bottom disappears into the plateau. As $B_y$ increases even further the middle of the LEPB `plateau' becomes concave, the upwards kink of the HEHB blunts out and an energy gap between the LEPB and the HEBB opens up.  Panel (c) of the figure shows that in contrast to the complicated dispersion relation along the $k_z$ direction, the energy of the LEPB increases monotonically with $|k_y|$. We shall show the EECs at various values of energy and $\\tilde{B}_y$ in the next section when we discuss the transmission from a source segment without magnetic field to a drain segment with a magnetic field. \n\nFig. \\ref{gW20BzComb} shows the dispersion relations when a magnetic field in the $z$ direction parallel to the $k$ space separation between the two Dirac nodes is applied. \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.28]{W20BzComb.eps}\n\\caption{  The dispersion relations for a $20\\ \\mathrm{nm}$ thick slab for (a) as a function of $k_z$ at $k_y = 0$,  and  (b) as a function of $k_y$ at $k_z = 0$ at the values of $\\tilde{B}_z$ indicated in the figure legends.  The LEPBs are indicated by thicker lines. }\n\\label{gW20BzComb}\n\\end{figure}\t\t\n  \nPanel (a) shows that the dispersion relation of the LEPB along the $k_z$ direction is not very much affected by the magnetic field. A larger field however does push the other particle bands upwards in energy, and the hole bands downwards in energy, as well as increases the energy separation between the subbands. The $z$ magnetic field has a larger effect on the dispersion relation along the $k_y$ direction. As the magnetic field is increased, the band bottom of the LEPB flattens out and forms a plateau for an increasing range of $|k_y|$.  \n\n\\section{Transmission} \nHere we consider the transmission of the LEPB states from a source DSM film segment without a magnetic field, to a drain segment with a magnetic field. We consider the cases where the interface between the two segments lies along either $y=0$ or $z=0$ line so that the source and drain segments have semi-infinite extents in the in-plane ($yz$) direction perpendicular to the interface and infinite extent parallel to it. The momentum parallel to the interface direction is hence a good quantum number and is conserved in the transmission. Since the integration over all the source states contributing to the transmission at a given energy is essentially an integration over the transverse momentum range spanned by these states, the transmission is very much affected by the overlap between the ranges of transverse momentum spanned by the source and drain states. \n\nThe anisotropy between the $k$-space directions parallel ($z$) and perpendicular to the $k$-space separation leads to different transmission profiles depending on the direction of the interface. \n   \n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.35]{TBz.eps}\n\\caption{  The transmission from a source segment of $20\\ \\mathrm{nm}$ thick DSM thin film with no magnetic field to a drain segment with a magnetic field in the $z$ direction for (top) an interface parallel to the $z$ direction and (bottom) an interface parallel to the $y$ direction.   }\n\\label{gTBz}\n\\end{figure}\t\t\n\n\nFig. \\ref{gTBz} shows the transmission profiles from a source segment without a magnetic field to a drain segment with a magnetic field in the $z$ direction. (The energy range is chosen so that the only propagating states in the source are the LEPB states. ) The transmission for an interface parallel to the $z$ direction is almost unity and exhibits a decrease with magnetic field for an interface parallel to the $y$ direction.\n\nThe reason for these trends can be found in the EECs of the source and drain segments shown in Fig. \\ref{gEcEf70BzComb}. \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.3]{EcEf70BzComb.eps}\n\\caption{  (a) The EECs for a $20\\ \\mathrm{nm}$ thick DSM film at $70\\ \\mathrm{eV}$ at various strengths of $B_z$ indicated in the legend. (b) The particle density profiles within the thickness of the thin film at various values of $B_z$ at $k_y = 0.5\\ \\mathrm{nm}^{-1}$ as indicated by the dotted line on the EEC plots on panel (a).   }\n\\label{gEcEf70BzComb}\n\\end{figure}\t\t\n\nThe $k_y$ range spanned by the EECs increases with $B_z$ while the $k_z$ range spanned remains constant. For an interface along the $z$ direction (top of Fig. \\ref{gTBz} ) we essentially integrate across the $k_z$ range spanned by the source states in order to calculate the transmission.  At any given value of $k_z$ the profile of the source and drain EECs have a similar trend of curving outwards in the $k_y$ direction. This, and the fact that the $k_z$ range spanned by the source and drain EECs are almost the same and that the EECs have the same contour which bows outwards along the $k_y$ direction contribute towards the large transmission.  For an interface along the $y$ direction, we integrate along the $k_y$ range spanned by the source state. Although the $k_y$ range spanned by the drain EECs completely overlaps that spanned by the source EEC, the profile of the EEC at a given $k_y$ between the source and drain segments are quite different -- the source EEC (where $B_z = 0$) curves outwards along the $k_y$ direction but the drain EECs flatten out with increasing $B_z$. This flattening out of the drain EECs is accompanied by a shift in the position along the thickness of the film (in the $x$ direction) where the charge carriers with group velocity from the source to the drain are concentrated. Panel (b) in the figure shows that at low fields the charge carriers are localized near the boundaries of the film, but they increasingly get shifted towards the interior of the film with increasing $B_z$. This reduces the overlap between the wavefunctions of the LEPB states in the source and drain segments and leads to the trend of decreasing transmission with $B_z$ at a given energy. \n\nWe now shift our focus to the effects of applying a magnetic field in the $y$ direction. Fig. \\ref{gTB101} shows that the transmission from a source segment to a drain segment with a magnetic field in the $y$ direction for an interface parallel to the $y$ direction decreases with increasing magnetic field. \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.35]{TB101.eps}\n\\caption{  The transmission from a source segment without a magnetic field to a drain segment with a magnetic field in the $y$ direction for an interface parallel to the $y$ direction.    }\n\\label{gTB101}\n\\end{figure}\t\t\n\n\n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.35]{EcEf50ByComb.eps}\n\\caption{  The EECs at $E=50\\ \\mathrm{eV}$ at various values of $\\tilde{B}_z$ indicated in the legend.} \n\\label{gEcEf50ByComb}\n\\end{figure}\t\t\n\nThis can be explained from the shapes of the EECs as shown in Fig. \\ref{gEcEf50ByComb}. Comparing against Fig. \\ref{gW20ByComb}, the single lobe for $\\tilde{B}_z = 0$ corresponds to the cross section of the LEPB `cone'. The small, narrow `waist' of the $\\tilde{B}_z = 0.1$ around $\\vec{k}=0$ corresponds to the cross section of the downwards pointing kink in the LEPB. The central lodes enclosing $\\vec{k}=0$ surrounded by side lobes for $\\tilde{B}_z = 0.2,0.3\\ \\mathrm{nm}^2$  are the cross sections of the HEHB.  There is no central lobe in the $\\tilde{B}_z = 0.4$ because the top of the HEHB has fallen below $E = 50\\ \\mathrm{eV}$. \n\t\n\tCalculating the transmission across an interface parallel to the $y$ direction involves integrating over the $k_y$ range spanned by the source EEC.  The $k_y$ range spanned by the drain EECs decreases with increasing $B_y$.  As $\\tilde{B}_y$ increases from zero, gaps in the EECs begin to open apart so that the EEC which, is originally a single closed curve at $B_y=0$, breaks into three separate curves at $\\tilde{B}_y=0.1,0.2\\ \\mathrm{nm}^{-2}$ in the figure. The gaps in $k$-space between the EEC curves represents an absence of propagating states  at those values of $k_y$ and lead to a drop in the transmission. Once $\\tilde{B}_y$ increases beyond around 0.2 where the energy at $\\vec{k}=0$ of the LEPB rises above the energy at finite $|\\vec{k}|$, the band top of the HEHB drops in energy with increasing $\\tilde{B}_y$. An energy gap opens up.  This is manifested as the absence of the central EEC lobe at the larger values of $\\tilde{B}_y$ in the figure. At the same time, the $k_y$ ranges spanned by the side lobes decrease with $\\tilde{B}_y$. All of these contribute to the drop in transmission with $\\tilde{B}_y$. \n\t\n\t \n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.35]{tb100.eps}\n\\caption{  The transmission from a source segment without a magnetic field to a drain segment with a magnetic field in the $y$ direction for an interface parallel to the $z$ direction.    }\n\\label{gT100}\n\\end{figure}\t\t\n\nFinally, Fig. \\ref{gT100} shows the transmission from a source segment without a magnetic field to a drain segment with a magnetic field in the $y$ direction with the interface parallel to the $z$ direction.  \n\nThe decrease in transmission at a given value of energy with $B_y$ can also be explained by the EEC profile in Fig. \\ref{gEcEf50ByComb}. Here since the interface is parallel to the $z$ direction $k_z$ is conserved. From the figure it is evident that as $B_y$ is increased the EECs of the drain states are shifted towards larger $|k_z|$ so that the $k_z$ overlap between the source EEC centered around $k_z = 0$ and the drain EECs decreases and eventually drops to 0. \n  \nWe now look at what happens when we fix $B_y$ and vary the energy. Differing from the transmission profiles considered earlier, here we have at larger values of $B_y$ a trend where the transmission at a given value of $\\tilde{B}_y$ first drops to 0 as the energy is increased, and then increases from 0 as the energy is increased further. The region where the transmission is 0 essentially coincides with the energy band gap that opens up between the LEPB and HEHB. \n\n\\begin{figure}[ht!]\n\\centering\n\\includegraphics[scale=0.35]{ECBy02comb.eps}\n\\caption{  The EECs at $\\tilde{B}_y = 0.25$ (solid lines) and $\\tilde{B}_y = 0$ at the energies labeled on the legend.  The inset shows the $k_z$ dispersion relation for $\\tilde{B}_y = 0.25$ at $k_y = 0$ with the dotted horizontal lines indicating the energy levels at which the EECs are drawn   }\n\\label{gECBy02comb}\n\\end{figure}\t\t\n\nThis is also reflected in Fig. \\ref{gECBy02comb} which show the source and drain EECs at $\\tilde{B}_y = 0.025$, and $E = 50, 60$ and $70\\ \\mathrm{eV}$. These energies correspond to those at the value of $\\tilde{B}_y$ where the transmission decreases between $50\\ \\mathrm{eV}$ to $60\\ \\mathrm{eV}$, then increases between $60\\ \\mathrm{eV}$ to $70\\ \\mathrm{eV}$. The $50\\ \\mathrm{eV}$ drain EEC has a relative large $k_x$ overlap with EEC due to the middle EEC curve enclosing $|\\vec{k}|=0$ which corresponds to the cross section of the HEPB. The next value of energy $60\\ \\mathrm{eV}$ corresponds to an energy where the $k$-space range enclosed by the source EEC falls in the gap between the HEHB and LEPB and the transmission is zero. The topmost value of energy is above the bottom of the LEPB where the EECs corresponding to the cross section of the LEPB increase in $k$ space area and start to overlap with the source EEC again, giving rise to finite transmission.     \n\n\\section{Conclusion} \nIn this work we studied the effects of in-plane magnetic fields on a \\ce{Na3Bi} DSM thin film. We showed that in the absence of a magnetic field, there is a special band, the LEPB, which originates from the semi-infinite slab Fermi arcs which is localized near the surface of the thin films. The application of a magnetic field in the $y$ direction leads to the sharpening of the LEPB band bottom and HEHB band top at $\\vec{k}=0$, and a shifting of the energy where the LEPB and HEPB meet at $\\vec{k}=0$ upwards when the field is first applied. As the field is increased further, the energy of the LEPB band at $\\vec{k}=0$ is shifted above that of the $k$-space surrounding and an energy gap opens between the LEPB and HEHB. Applying a magnetic field in the $z$ direction leads to the broadening of the LEPB and the formation of an energy plateau along the $k$ space $y$ direction.  \n\nThese changes affect the transmission from a source segment without a magnetic field to a drain segment with a magnetic field as the overlap in the $k$-space direction parallel to the interface between the source and drain EECs vary. In the particular case of an interface parallel to the $y$ direction, the $k$ space overlap is not very much affected by the magnetic field. The reduction in transmission by the magnetic field comes instead from the localization of the drain wavefunctions further inside the thickness of the film away from the source wavefunction localized near the film surface with increasing magnetic fields. The anisotropy between the $k$ space direction parallel and perpendicular to the $k$ space separation between the Dirac points give rise to differing transmission profiles for interfaces between the source and drain segments along different directions. \n   \n\\section{Acknowledgments} \nWe thank the MOE Tier II grant MOE2013-T2-2-125 (NUS Grant No. R-263-000-B10-112), and the National Research Foundation of Singapore under the CRP Program ''Next Generation Spin Torque Memories: From Fundamental Physics to Applications'' NRF-CRP9-2013-01 for financial support.\n\n\n\n\\begin{thebibliography}{99}\n\t\n\t\\bibitem{PRB85_195320} Z. Wang \\textit{et al}, Phys. Rev. B \\textbf{85}, 195320 (2012). \n\t\\bibitem{PRB88_125427} Z. Wang \\textit{et al}, Phys. Rev. B \\textbf{88}, 125427 (2013). \n\n\t\n\n\t\\bibitem{PRB83_205101} X. Wan \\textit{et al}, Phys. Rev. B \\textbf{83}, 205101 (2011). \n\t\\bibitem{PRL108_140405} S.M. Young \\textit{et al}, Phys. Rev. Lett. \\textbf{108}, 14045 (2012). \t\n\t\n\n\n\t\\bibitem{RMP82_3045} M.Z. Hasan and C.L. Kane, Rev. Mod. Phys. \\textbf{82}, 3045 (2010).\n\t\\bibitem{JPSJ82_102001} Y. Ando, J. Phys. Soc. Jpn. \\textbf{82}, 102001 (2013). \n\t\n\n\t\\bibitem{NatMat13_677} Z.K. Liu \\textit{et al}, Nat. Mater. \\textbf{13}, 677 (2014). \n\t\\bibitem{PRL113_027603} S. Borisenko \\textit{et al}, Phys. Rev. Lett. \\textbf{13}, 027603 (2014). \n\t\\bibitem{NatComm5_3786} M. Neupane \\textit{et al}, Nat. Commun. \\textbf{5}, 3786 (2014). \n\t\\bibitem{NatMat13_851} S. Jeon \\textit{et al}, Nat. Mater. \\textbf{13}, 851 (2014). \n\n\n\t\\bibitem{Sci343_864} Z.K. Liu \\textit{et al}, Science \\textbf{343}, 864 (2014). \n\t\\bibitem{APL105_031901} Y. Zhang \\textit{et al}, Appl. Phys. Lett. \\textbf{105}, 031901 (2014). \n\t\\bibitem{Sci347_294} S-Y  Xu \\textit{et al}, Science \\textbf{347}, 294 (2014). \n\n\n\n\t\\bibitem{SciRep5_7898} X. Xiao \\textit{et al}, Sci. Rep. \\textbf{5}, 7898 (2015).\n\t\\bibitem{SciRep5_14639} H. Pan \\textit{et al}, Sci. Rep. \\textbf{5}, 14639 (2015).\n\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": -1, "prevtext": " \nand the (unnormalized) eigenspinors\n\n", "index": 5, "text": "\\begin{equation}\n\t|\\chi\\rangle = \\begin{pmatrix}  M \\pm \\sqrt{ (Ak)^2 + M^2} \\\\ A(k_x-ik_y) \\end{pmatrix}. \\label{egSp}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"|\\chi\\rangle=\\begin{pmatrix}M\\pm\\sqrt{(Ak)^{2}+M^{2}}\\\\&#10;A(k_{x}-ik_{y})\\end{pmatrix}.\" display=\"block\"><mrow><mrow><mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>χ</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><mo>(</mo><mtable displaystyle=\"true\" rowspacing=\"0pt\"><mtr><mtd columnalign=\"center\"><mrow><mi>M</mi><mo>±</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>A</mi><mo>⁢</mo><mi>k</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>M</mi><mn>2</mn></msup></mrow></msqrt></mrow></mtd></mtr><mtr><mtd columnalign=\"center\"><mrow><mi>A</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>x</mi></msub><mo>-</mo><mrow><mi>i</mi><mo>⁢</mo><msub><mi>k</mi><mi>y</mi></msub></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mtd></mtr></mtable><mo>)</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]