[{"file": "1601.06174.tex", "nexttext": "\n\nwhere $T_o$ and $T_b$ are respectively the exposure times for the\nobservation of the source (and its background) and for the observation\nof the background alone. The significance of the detection in each\nchannel (i.e., the signal-to-noise ratio), which is shown in the lower\npanel of Figure~\\ref{fig:data}, is simply\n\n\n", "itemtype": "equation", "pos": 12525, "prevtext": "\n\n\\title{An Empirical Method for Improving the Quality of {\\it RXTE} HEXTE Spectra}\n\n\\author{Javier~A.~Garc\\'ia\\altaffilmark{1}, \n        Victoria~Grinberg\\altaffilmark{2},\n        James~F.~Steiner\\altaffilmark{1, 2},\n        Jeffrey~E.~McClintock\\altaffilmark{1}, \n        Katja~Pottschmidt\\altaffilmark{3,4},\n        Richard~E.~Rothschild\\altaffilmark{5}}\n\n\\altaffiltext{1}{Harvard-Smithsonian Center for Astrophysics,\n  60 Garden St., Cambridge, MA 02138 USA; javier@head.cfa.harvard.edu,\n  jem@cfa.harvard.edu, jsteiner@head.cfa.harvard.edu}\n\n\\altaffiltext{2}{MIT Kavli Institute for Astrophysics and Space Research,\n  MIT, 70 Vassar Street, Cambridge, MA 02139, USA; \n  grinberg@space.mit.edu}\n\n\\altaffiltext{3}{Department of Physics \\& Center for Space Science and Technology, UMBC,\n     Baltimore, MD 21250, USA}\n\n\\altaffiltext{4}{CRESST \\& NASA Goddard Space Flight Center, Greenbelt, MD 20771, USA;\nkatja@milkyway.gsfc.nasa.gov}\n\n\\altaffiltext{5}{Center for Astrophysics and Space Sciences, University of California at San Diego, La Jolla, CA, USA,\nrrothschild@ucsd.edu}\n\n\n\n\n\\begin{abstract}\n\n  We have developed a correction tool to improve the quality of {\\it\n    RXTE} HEXTE spectra by employing the same method we used earlier to\n  improve the quality of {\\it RXTE} PCA spectra. We fit all of the\n  hundreds of HEXTE spectra of the Crab individually to a simple\n  power-law model, some 37~million counts in total for Cluster~A and\n  39~million counts for Cluster~B, and we create for each cluster a\n  combined spectrum of residuals. We find that the residual spectrum of\n  Cluster~A is free of instrumental artifacts while that of Cluster\\,B\n  contains significant features with amplitudes $\\sim1$\\%; the most\n  prominent is in the energy range 30--50~keV, which coincides with the\n  iodine K edge. Starting with the residual spectrum for Cluster~B, via\n  an iterative procedure we created the calibration tool {\\sc hexBcorr}\n  for correcting any Cluster~B spectrum of interest. We demonstrate the\n  efficacy of the tool by applying it to Cluster~B spectra of two bright\n  black holes, which contain several million counts apiece. For these\n  spectra, application of the tool significantly improves the goodness\n  of fit, while affecting only slightly the broadband fit\n  parameters. The tool may be important for the study of spectral\n  features, such as cyclotron lines, a topic that is beyond the scope of\n  this paper.\n\n\\end{abstract}\n\n\\keywords{instrumentation: detectors -- space vehicles: instruments --\nX-ray: individual (Crab, XTE~J1752--223, GX~339$-$4)}\n\n\n\n\n\n\n\\section{Introduction}\\label{sec:intro}\n\nThe {\\it Rossi X-ray Timing Explorer} ({\\it RXTE}) was launched into a\nlow earth orbit on 30 December 1995 and operated continuously until the\nmission was terminated on 4 January 2012. The three instruments aboard\n{\\it RXTE} were (i) the All Sky Monitor \\citep[ASM;][]{lev96}, which\nconsisted of three coded aperture cameras that scanned about $\\sim$80\\%\nof the sky every orbit; (ii) the Proportional Counter Array\n\\citep[PCA;][]{jah06}, a set of five proportional counter detectors\nsensitive over the energy range 2--60~keV; and (iii) the High Energy\nX-ray Timing Experiment \\citep[HEXTE;][]{rot98}, which consisted of two\nindependent clusters (A and B), each with four NaI(Tl)/CsI(Na) phoswich\nscintillation detectors sensitive over the energy range 15--250~keV. It\nis the calibration of the latter instrument that is the focus of this\npaper. A detailed discussion of the HEXTE detectors can be found in\n\\cite{rot98} and references therein; here, we provide a brief overview.\n\nEach of the eight HEXTE detectors was fitted with a lead honeycomb\ncollimator giving a 1$^\\circ$ FWHM field of view. All eight collimators\nwere co-aligned on source. The net open area of the eight detectors was\n$\\sim$1600\\,cm$^2$ with an average energy resolution of 15.4\\% FWHM at\n60~keV. Both clusters A and B achieved a near-real-time estimate of the\nbackground by being rocked between the source and a background field\nthrough an angle of $1\\fdg{}5$; the rocking axes of the clusters were\northogonal. The exposure time on source was 32\\,s, except early in the\nmission when it was 16\\,s. The corresponding observation times on the\nbackground were 28\\,s and 12\\,s, respectively.\n\nWe improve the calibration of the HEXTE using precisely the same\napproach we used previously for the PCA \\citep{gar14b}. Namely, for each\ncluster separately we fit individually all of the HEXTE spectra of the\nCrab, which we assume to be featureless, to a simple power-law model. We\nthen combine the residual spectra to create two master spectra that have\nextreme statistical precision. We find that the spectrum of Cluster~B\ncontains prominent instrumental artifacts, while the spectrum of\nCluster~A is essentially free of such artifacts. Via an iterative\nprocess, we create the calibration tool {\\sc hexBcorr}, and we\ndemonstrate the effectiveness of the tool in correcting the spectra of\ntwo bright black holes. It is especially important to perform this\ncorrection in studying spectra with high signal-to-noise, e.g., spectra\nof bright sources and/or spectra created by combining several data\nsets. We suggest that it may also be important for the study of spectral\nfeatures, such as cyclotron lines.\n\n\n\n\n\n\\section{Fits to Crab Spectra and the Creation of a Ratio\n  Spectrum for Cluster~B}\\label{sec:fits}\n\n\n\n\n\n\\begin{figure*}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0]{f1.pdf}\n\\caption{\nPhoton power-law index vs.\\ the number of counts in a Cluster~B\nspectrum of the Crab. Results for the complete sample of 283 spectra are\nshown in the left panel and results for the selected sample of 230 spectra\nin the right panel. The dashed lines and shaded regions indicate the\naverage value and $\\pm1$ standard deviation, respectively.\n}\n\\label{fig:slope}\n\\end{figure*}\n\n\n\nThe performance of the HEXTE was affected by three major events during\nthe 16-year\nmission\\footnote{\\url{http://heasarc.gsfc.nasa.gov/docs/xte/whatsnew/big.html}}.\n(1) On 1996 March 6, the pulse height analyzer in one of the detectors\nof Cluster~B failed so that after that date only three of the four\ndetectors were serviceable. (2) In October 2006 the mechanism that\nrocked Cluster~A failed and the cluster was parked in the on-source\nposition. (3) In March 2010 the mechanism that rocked Cluster~B also\nfailed (having completed several millions cycles and far exceeded its\ndesign goal). We consider only data that were taken when the instruments\nwere actively rocking because the analysis of HEXTE data that lack\nquasi-simultaneous measurements of the background is problematic\n\\citep{pot06}.\n\nOur analysis and discussion are focused on Cluster~B because, unlike\nCluster~A, it shows pronounced residual features; furthermore, it was\nactive $\\approx4.3$~years longer than Cluster~A. For Cluster~A we\nprovide only a summary of results (Section~\\ref{sec:ca}).\n\nDuring the mission, 283 individual pointed observations of the Crab were\nperformed with HEXTE Cluster~B. All the spectra for both clusters have\nbeen extracted using the standard tools in HEASOFT~6.16 and corrected\nfor deadtime using the {\\tt hxtdead} tool. Visual inspection of the\ndata, preliminary power-law fits to the spectra, and information available\nat the HEASARC revealed that for some observations the source was\nocculted by the Earth or that the data were acquired in a non-standard\nmode (e.g., the data corresponding to proposal P50100 lacks coverage\nbelow $\\sim$30~keV). Such data were excluded.\n\n\n\n\n\n\\begin{figure*}\n\\centering\n\n\\includegraphics[scale=0.8,angle=0]{f2.pdf}\n\\caption{ \n({\\it top}) Total counts spectra for the source, background\n  and model produced using all 230 Crab observations for HEXTE\n  Cluster~B. ({\\it bottom}) Significance of the signal, which for each\n  channel individually is the total source counts divided by its\n  uncertainty.  \n}\n\\label{fig:data}\n\\end{figure*}\n\n\n\n\n\n\n\n\\begin{figure}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.3cm 0 0 0}]{f3.pdf}\n\\caption{\nRatio spectrum for Cluster~B created by combining the residual spectra\nproduced by fitting individually our complete sample of 230 selected\nCrab spectra.\n}\n\\label{fig:ratioCB}\n\\end{figure}\n\n\nWe analyzed each of the 283 observations separately. For all of our\nmodel fitting and statistical analysis, we used {\\sc xspec}~12.9.0d\n\\citep{arn96}. Working with the data as grouped by the standard\nreduction procedure, we further binned the data to $\\sim 3$ channels per\nresolution element. Specifically, using {\\sc ISIS}~1.6.2 \\citep{hou02}\nwe binned up the data\\footnote{Whether one bins the data using {\\sc\n    isis} or {\\sc grppha} is unimportant; both tasks define the\n  groupings in the PHA source file, while the background and response\n  files remain unchanged.} by factors of 2, 3, and 4, in the energy\nranges 20--30~keV, 30--40~keV, and 40--250~keV, respectively.  No\nallowance was made for systematic error in the response of the\ndetector. Each spectrum was fitted using a power-law model, with its\nphoton index $\\Gamma$ and normalization as the only two fit\nparameters. \n\nBecause a break in the Crab spectrum has been reported by several\nobservers, we also alternatively fitted our data using a broken\npower-law model. However, for nearly all of the spectra the break energy\nwas unconstrained. Furthermore, the combined ratio spectrum (discussed\nbelow) differed only very slightly from that derived using the\nsingle-slope model. For simplicity, we therefore adopted the unbroken\npower-law model. For details, see Section~\\ref{sec:disc}.\n\n\n\n\n\n\\begin{figure*}[!ht]\n\\centering\n\n\\includegraphics[scale=0.6,angle=0]{f4.pdf}\n\\caption{\nA succession of Cluster~B ratio spectra (which were created by the\niterative process described in the text) displayed over the full\n20--250~keV band. ({\\it top}) The parent ratio spectrum, the blue curve\nlabeled {\\tt iter=0}, is identical to the ratio spectrum plotted in\nFigure~\\ref{fig:ratioCB}. Four of the nine smaller-amplitude daughter\nspectra are shown, including that generated by the tenth and final\niteration (the red curve labeled {\\tt iter=9}). ({\\it bottom}) The same\nratio spectra more sensitively displayed.\n}\n\\label{fig:iratio}\n\\end{figure*}\n\n\nThe left panel in Figure~\\ref{fig:slope} shows for each of the 283\nspectra the recovered power-law photon index $\\Gamma$ vs.\\ the total\nnumber of counts. We discard three categories of data for which: the fit\nis relatively poor with $\\chi^2_\\nu >1.6$ (red points); the uncertainty in\n$\\Gamma$ exceeds 0.4 (green points); and $\\Gamma$ is more than 0.2 above\nor below its mean value of $<\\Gamma>=2.053$ (orange points). The poor\nfits in the first category evidently result from background exposure\ntimes that are anomalously short, typically only 3\\% of the respective\nsource exposure time.\n\nWith the exclusion of these data, our final sample for Cluster~B is\ncomprised of 230 spectra which contains a total of 39~million\ncounts. The right panel in Figure~\\ref{fig:slope} shows for these\nselected spectra the power-law index vs.\\ the total number of counts.\nThe modest variability in the photon index is comparable to that found\nfor the PCA by us \\citep{gar14b} and by \\cite{sha12}. We note that\nlong-term variations in the flux and photon index of the Crab have been\nreported by \\cite{wil11}. Attempting to corroborate these results is\nbeyond the scope of this paper. Meanwhile, these variations do not\naffect our results (i.e., the performance of our correction tool)\nbecause we fit each observation independently.\n\nWe now combine all 230 Cluster-B Crab spectra to produce the three ``total\ncounts spectra'' shown in Figure~\\ref{fig:data}. The counts in\nchannel $i$ for the source spectrum is the sum over the individual\nspectra $j$ of the background-subtracted source counts $S_i = \\sum_j\nS_{i,j}$.  The background and model spectra are similar sums over the\nbackground counts ($B_i = \\sum_j B_{i,j}$) and model counts ($M_i =\n\\sum_j M_{i,j}$). We emphasize that the model here is not a fit to the\nsummed spectrum, but rather it is the sum of the models fitted to the 230\nindividual spectra.  At energies $\\gtrsim 140$~keV the background is\ndominant. In the highest channel at 250~keV, there are $\\sim100,000$\nbackground counts and only $\\sim5,000$ source counts.\n\nThe error bars for the source and background spectra in\nFigure~\\ref{fig:data} are plotted, but they are minuscule and scarcely\nvisible. For the source spectrum, the statistical uncertainty in the\nnumber of counts in channel $i$ is\n\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:sigma}\n\\sigma_i = \\sqrt{ S_i + (T_o/T_b) B_i + (T_o/T_b)^2 B_i},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\sigma_{i}=\\sqrt{S_{i}+(T_{o}/T_{b})B_{i}+(T_{o}/T_{b})^{2}B_{i}},\" display=\"block\"><mrow><mrow><msub><mi>σ</mi><mi>i</mi></msub><mo>=</mo><msqrt><mrow><msub><mi>S</mi><mi>i</mi></msub><mo>+</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>o</mi></msub><mo>/</mo><msub><mi>T</mi><mi>b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>B</mi><mi>i</mi></msub></mrow><mo>+</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mi>o</mi></msub><mo>/</mo><msub><mi>T</mi><mi>b</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi>B</mi><mi>i</mi></msub></mrow></mrow></msqrt></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06174.tex", "nexttext": "\n\n\nThe ratio spectrum $S_i/M_i \\pm \\sigma_i/M_i$ is shown in\nFigure~\\ref{fig:ratioCB}. Its most distinctive feature is a $\\approx1$\\%\ndip that extends from about 30~keV to 50~keV, which coincides with the\niodine K-edge at 33.17~keV \\citep{way98}. Additional features that are\nless significant are present above 100\\,keV. At this point we could adopt\nthe ratio spectrum in Figure~\\ref{fig:ratioCB} as a final product to be\nused in correcting HEXTE spectra for Cluster~B. However, via the\niterative process described in the following section we obtain a final\nproduct of much higher quality, which we refer to hereafter as the\n``correction curve.''\n\n\n\n\n\\section{Correction Curve for Cluster~B and the Calibration Tool HEXBCORR}\\label{sec:corr}\n\nWe now produce the correction curve for Cluster~B following precisely\nthe procedures we used earlier for the PCA, which are extensively\ndescribed in Section~4 in \\cite{gar14b}. Producing a correction curve\nfor the HEXTE is simpler than for the PCA because the HEXTE automatic\ngain control held the gain fixed throughout the mission so that every\nobservation has the same energy-to-channel mapping.\n\nIn brief: We start with the ratio spectrum shown in\nFigure~\\ref{fig:ratioCB}, which is identical to the curve labeled {\\tt\n  iter=0} in Figure~\\ref{fig:iratio} except that the error bars have\nbeen suppressed.  We then correct our 230 spectra by dividing each one\nby this ratio spectrum and repeat the process described in the previous\nsection, thereby creating a new ratio spectrum that is labeled {\\tt\n  iter=1} in Figure~\\ref{fig:iratio}. The procedure is repeated a total\nof 10 times, resulting in the red curve labeled {\\tt iter=9}, after\nwhich additional iterations do not produce significant changes in the\ncurve. The panels in Figure~\\ref{fig:iratio} show at two different\nscales the reduction in the amplitude of the residual features achieved\nat several points in the iteration process over the full energy range\n(20--250~keV). The top panel highlights the gross improvements achieved\nin the first few iterations, and the lower panel shows in detail how\neach successive iteration reduces further the amplitude of every\nresidual feature in the spectrum.\n\nWe repeated the analysis described above, this time including a\ncorrection for the normalization using the model {\\tt recorn} in\n{\\sc xspec}. We find that the addition of this model component has a very\nsmall effect on the ratio spectrum in Figure~\\ref{fig:ratioCB}, producing\nonly mild effects ($\\lesssim2\\sigma$) at energies above 100~keV. The\neffect is negligible in practice for the correction of HEXTE data, and\nfor simplicity we do not use {\\tt recorn} in our analysis.\n\nThe final correction curve for Cluster~B is the product of all 10\ncorrection curves (five of which are plotted in\nFigure~\\ref{fig:iratio}). This final correction curve, plotted in\nFigure~\\ref{fig:ratiohr}, constitutes the calibration tool {\\sc\n  hexBcorr}. To correct any Cluster~B object spectrum of interest\none simply divides the counts in each energy channel, as well as the\nerror, by the corresponding value of the correction curve.\n\n\n\n\n\n\\begin{figure}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.3cm 0 0 0}]{f5.pdf}\n\\caption{\nFinal correction curve for Cluster~B. The lighter shaded region\nbounding the curve shows the $1\\sigma$ level of statistical error.\n}\n\\label{fig:ratiohr}\n\\end{figure}\n\n\n\n\n\n\n\n\n\\begin{figure*}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.3cm 0 0 0}]{f6.pdf}\n\\caption{\nComparison of the residuals from the fits to the original and the\ncorrected data for XTE~J1752--223 (left panel) and GX~339--4 (right\npanel).\n}\n\\label{fig:tests}\n\\end{figure*}\n\n\n\n\n\\section{Testing the Tool HEXBCORR on Spectra of Stellar-Mass\n  Black Holes}\\label{sec:test}\n\nAs a test of the calibration tool {\\sc hexBcorr}, we apply it to\ncomposite spectra of two bright transient Galactic black holes:\nXTE~J1752$-$223 and GX~339$-$4. For both sources, the Cluster~B data\nwere collected in the bright hard state, and the spectra each contain\nseveral million counts. Our analysis is aimed at demonstrating the\nefficacy of {\\sc hexBcorr}, and we do not concern ourselves with\nemploying an accurate physical model.\n\nXTE~J1752$-$233: We selected 57 Cluster~B observations (all the data for\nproposal numbers 94044 and 94331). We combined the spectra in two\nsteps. First, we created a summed residual spectrum precisely as we did\nfor the Crab, as described in Section~\\ref{sec:fits}. Secondly, we then\nadded back in to this spectrum the average continuum component, which we\ngenerated synthetically using the average values of the spectral index\nand normalization parameter, and using the appropriate exposure time for\nthe summed spectrum. A detailed description of this process, and the\nrationale for combining spectra in this way, is given in Section~3 of\n\\cite{gar15}. The summed spectrum contains a total of $10.4$\\,million\ncounts in the energy range 20--250~keV. We applied the tool {\\sc\n  hexBcorr} to the spectrum by simply dividing the source counts, and\nerrors, by the correction curve shown in Figure~\\ref{fig:ratiohr}. We\nthen fitted both the original (uncorrected) and the corrected spectra\nusing a cutoff power-law model. The residuals are compared in the left\npanel of Figure~\\ref{fig:tests}, which shows the contributions to\n$\\chi^2$ for each channel. The effect of the correction is clear-cut.\nIn particular, the strong 30--50~keV feature, present in the original\nspectrum and in the Crab spectrum (Figure~\\ref{fig:ratioCB}), is\ncompletely absent in the corrected spectrum. Furthermore, the tool\nreduces the residuals at almost every energy. The reduction in total\n$\\chi^2$ is striking: $\\chi^2=205.1$ to $\\chi^2=68.3$\n($\\Delta\\chi^2=136.8$ with 54 degrees of freedom in both cases). At the\nsame time, the model parameters change only slightly: the photon index\nfrom $1.23\\pm0.01$ to $1.18\\pm0.01$; the cutoff energy from\n$125.7\\pm2.4$~keV to $111.9\\pm1.9$~keV; and the normalization from\n$0.26\\pm0.01$ to $0.23\\pm0.01$ (where the first quantity is the value\nfor the original spectrum).\n\nGX~339$-$4: We used the exceptionally bright hard-state Cluster~B data\ncollected in 21 observations made during 2002 April 20--30, which\ncorrespond to the data defined by Box~A in \\citet[][see their\nFigure~1]{gar15}. The combined spectrum contains a total of $5.6$\\,million\ncounts. We again fitted both the original and corrected data using the\nsame power-law model with a high energy cutoff; an additional mild\ncutoff was required at low energies in order to achieve a good fit.  As\nbefore, we do not seek a physical description of these data; rather we\napply a simple phenomenological model of the continuum.  The residuals\nare compared in the right panel of Figure~\\ref{fig:tests}, which shows\nthe contributions to $\\chi^2$ for each channel. Once again, strong\nresidual features near 40~keV that are present in the uncorrected\nspectrum are largely eliminated by the application of {\\sc hexBcorr}.\nThe improvement in the fit is quite significant, although less so than\nin the previous example: $\\chi^2=392.1$ for the uncorrected spectrum and\n$\\chi^2=337.0$ for the corrected spectrum (i.e., $\\Delta\\chi^2 = 55.1$\nwith 53 degree of freedom in both cases), while the model parameters in\nthis case are consistent within the uncertainties. For the original and\ncorrected spectra, respectively, the photon index is $1.65\\pm0.03$ and\n$1.60\\pm0.03$; the high energy cutoff is $73.0\\pm2.5$ and\n$67.0\\pm2.2$; and the normalization is $2.3\\pm0.2$ and\n$2.1\\pm0.2$. In comparison with the results for XTE~J1752$-$223, the\nconsistency of the fit parameters and smaller value of $\\Delta\\chi^2$\nfor GX~339$-$4 can be reasonably explained by noting that its spectrum\ncontains only about half as many counts.\n\n\n\n\\section{Fits to Crab Spectra and the Creation of a Ratio Spectrum for Cluster~A}\\label{sec:ca}\n\nWe performed precisely the same global analysis of the Crab data for\nCluster~A that we performed for Cluster~B. As in Section~\\ref{sec:fits},\nwe fitted all the available data for Cluster~A, in this case 204\nobservations; fitted the spectra with a simple power-law model; applied\nthe same selection criteria; and arrived at our final data sample of 168\nspectra comprising a total of 37\\,million counts. Again, following the\nprocedures described in Section~\\ref{sec:fits}, we produced a\ndata-to-model ratio spectrum that is a sum of all the selected\ndata. This ratio spectrum for Cluster~A is compared to that of Cluster~B\nin Figure~\\ref{fig:ratioCAB}.  There are no significant residual\nfeatures in the spectrum of Cluster~A, which is an unexpected result\ngiven that the clusters were built to the same design.  The residuals at\nall energies are approximately consistent with counting statistics. We\nconclude that it is unnecessary to correct Cluster~A data.\n\nWe tested the quality of raw (i.e., uncorrected) Cluster~A data for\nGX~339--4 by making a direct comparison with the corrected Cluster~B\nspectrum of this source shown in Figure~\\ref{fig:tests}. (Note that no\nrocked Cluster~A data are available for XTE~1752$-$233; see Section~\\ref\n{sec:fits}.) We generated the Cluster~A spectrum of GX~339--4 using\nprecisely the same procedures used for the Cluster~B spectrum\n(Section~\\ref{sec:test}), and we fitted both spectra independently using\nthe same cutoff power-law model. The fit residuals for the two\nspectra are compared in Figure~\\ref{fig:gx339-CAB}. The quality of the\nfits is very similar, and all the model parameters are consistent within\nthe uncertainties. The total $\\chi^2$ is slightly worse for the\nCluster~A spectrum ($\\chi^2=332.7$ vs.\\ $\\chi^2=371.43$), but this is\nlikely largely because the number of counts is greater (7.7\\,million\nvs. 5.6\\,million). Thus, we find that the uncorrected Cluster~A data are\ncomparable in quality to the corrected Cluster~A data, confirming our\nconclusion above that it is unnecessary to correct Cluster~A data.\n\n\n\n\n\n\\begin{figure}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.3cm 0 0 0}]{f7.pdf}\n\\caption{\nComparison of the residuals for the two clusters from fits to the\nCrab data. The blue spectrum for Cluster~B is identical to that shown in\nFigure~\\ref{fig:ratioCB}.\n}\n\\label{fig:ratioCAB}\n\\end{figure}\n\n\n\n\n\n\n\\section{Discussion and Conclusions}\\label{sec:disc}\n\nCluster~A data are free of the instrumental features that require\ncorrection in the Cluster~B data.  This is surprising if these features\nare instrumental because one would expect the performance of these\nessentially identical clusters to be more nearly similar. While the\nreason for the dissimilarity is unclear, the leading hypothesis is that\nit resulted from adjusting Cluster~B's calibration two months into the\nmission, which was necessitated by the failure of one of its four\ndetectors (see Section~\\ref{sec:fits}). Unfortunately, the Crab data\ncollected prior to the failure are too sparse to corroborate this\nhypothesis. Since the Brookhaven calibration was done with a single HEXTE\ndetector, it is possible that one or more cluster B detectors had a slightly\ndifferent response at and just beyond the K-edge of iodine, and that is the\nsource of the residual, since the same two segment description of the edge\nresponse was used for all detectors.\n\nThe calibration of the HEXTE depends on both laboratory and in-flight\ndata. The efficiency of the detectors vs.\\ energy was determined prior\nto launch using radioactive sources and monochromatic X-rays generated\nat Brookhaven National Laboratory. This part of the instrument response\nincludes the energy-dependent escape of photons above the K edge of\niodine. The efficiency vs.\\ energy above and below the edge was mimicked\nby two line segments, which is an imperfect model because the profile of\nthe edge is more complicated than a step function.\n\nThe final calibration of the open area and point spread function\n(PSF) of the instruments was determined post-launch using Crab\ndata. Multiple observations were made on-axis and over a range of\noff-axis angles. These data were used to adjust the preliminary\nlaboratory measurements of the PSF and open area. None of these\nindividual Crab observations was sensitive enough to detect the 1\\% dip\nseen in the combined ratio plot (Figure~\\ref{fig:ratioCB}). The\nadjustments to the calibration of Cluster~B after the detector failure\nwere solely to the open area and the PSF; the detector efficiencies were\nleft unchanged. These adjustments are the most significant event that\ndifferentiates the two HEXTE clusters. However, it remains an open\nquestion precisely how this event could produce the relatively large residuals in\nCluster~B that are absent in Cluster~A.\n\n\n\n\n\n\\begin{figure}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.3cm 0 0 0}]{f8.pdf}\n\\caption{\nComparison of the residuals for the two clusters from fits to the\ncombined spectrum of GX~339-4 with 5.6\\,million counts.\n}\n\\label{fig:gx339-CAB}\n\\end{figure}\n\n\nAs noted in Section~\\ref{sec:fits}, in creating the tool {\\sc hexBcorr}\nwe analyzed all the Crab data using a simple absorbed power-law model\nwhile ignoring the evidence that the spectrum breaks at an energy that\nis quite uncertain: $79\\pm10$~keV \\citep{str79}, $128\\pm4$~keV\n\\citep{jun89}, $60\\pm7$~keV \\citep{bar94} $57\\pm3$~keV \\citep{rot98},\n$100$~keV (fixed) \\citep{jou09}, $105\\pm20$~keV and $117\\pm19$~keV\n\\citep{yam11}.  In addition to these reports of a break, we note that\nour ratio spectrum in Figure~\\ref{fig:ratioCB} and our final correction\ncurve in Figure~\\ref{fig:ratiohr} show marginal evidence for a break at\nenergies $\\gtrsim150$~keV, although this apparent defect in our\ncorrection curve is relatively unimportant because spectra contain few\nsource counts at these energies and the background is the dominant\nsource of uncertainty.\n\nAs an alternative to the simple power-law model, we fitted our 283\nCluster-B spectra using a broken power-law model, but we obtained\nunsatisfactory results; namely, for nearly all the spectra the break\nenergy was unconstrained with values scattered randomly across the\nallowed range of 50--200 keV. Most importantly, the net ratio plot\nfor these fits was only marginally different from that obtained using\nthe simple power-law model, which accurately captures the important\n$\\sim1$\\% dip at $\\sim40$~keV and the other principal features in\nthe ratio spectrum (Figure~\\ref{fig:ratioCB}). Therefore, all of our\nresults are based on the simple power-law model.\n\nOur results for XTE~J1752--223 and GX~339--4 indicate that for combined\nspectra of bright sources, which are comprised of dozens of individual\nspectra and contain several million counts, the application of {\\sc\n  hexBcorr} significantly improves the quality of the fit to Cluster~B\ndata, while having at most a modest effect on broadband spectral\nparameters. For example, for the latter source with 5.6~million counts\nthe values of the photon index, cutoff energy, and normalization were\nconsistent within the statistical uncertainties. For XTE~J1752--223 with\n10.4~million counts, the parameters changed modestly, but by several\nstandard deviations: the photon index, cutoff energy and normalization\nchanged by $\\Delta\\Gamma=0.05\\pm 0.01$, $\\Delta E=13.8\\pm3.1$~keV, and\n$\\Delta N=0.03\\pm0.01$.  For an individual spectrum of a bright source\nwith an exposure time of only a few ks, it is likely that the correction\nis at most cosmetic with essentially no effect on the broadband\nparameters.\n\nHowever, the correction is potentially important for the study of\nspectral features such as cyclotron lines, particularly those at\nenergies of $\\sim 30-50$~keV. There have been a number of reports of\ncyclotron lines in this band, some based on HEXTE data\n\\citep[e.g.,][]{hei99,cob01, hei01,hei03,rod09,tsy12}. The instrumental\nfeatures we detect have an amplitude of about 1\\%, which is much less\nthan that of a typical cyclotron line. However, in some cases the\napplication of our calibration tool may prove fruitful.  For example,\n\\cite{dec13}, who discovered a 10~keV cyclotron line (with an amplitude\n$\\sim3\\%-10$\\%) in the spectrum of Swift~J1626.6--5156, find residual\nfeatures in their PCA and HEXTE (Cluster~B) spectra at $\\sim 40\n$~keV. The authors argue that these features are instrumental and not a\nharmonic of the 10~keV line, an hypothesis that can possibly be tested\nusing our calibration tool. A spectrum of the bursting pulsar\nGRO~J1744--28 provides a second example where a residual feature was\ninterpreted as an instrumental artifact rather than as a cyclotron line\n\\citep{hei99b}. The question of whether our calibration tool is actually\nimportant for the study of cyclotron lines is beyond the scope of this\npaper.\n\nThe benefits of correcting HEXTE Cluster-B data with {\\sc hexBcorr} are\ngreatest for spectra with many counts. Figure~\\ref{fig:deltachi} roughly\nquantifies this benefit by plotting the improvement in the fit achieved\nby application of the tool to the brighter Crab spectra as a function of\nthe total counts. The effect of the correction becomes apparent for\nspectra with $\\sim10^5$ counts and it becomes quite significant as the\nnumber of counts approaches $10^6$. The improvement in the fit for the\nspectra of GX~339--4 and XTE~J1752--228 with several million counts\napiece is dramatic. The figure indicates the value of making the\ncorrection for spectra with more than $\\sim10^5$~counts. This limit\nshould be considered only a useful rule of thumb since it likely depends\non the spectral shape.\n\n\n\n\n\n\\begin{figure}\n\\centering\n\n\\includegraphics[scale=0.6,angle=0,trim={0.4cm 0 0 0}]{f9.pdf}\n\\caption{ \nImprovement in the fit for Cluster-B data, as measured by a\n  decrease in $\\chi^2$, as a function of total counts for bright spectra\n  of the Crab and for summed spectra of GX~339--4 and\n  XTE~J1752--224. The Crab spectra were fitted over the 20--250~keV band\n  using the simple absorbed power-law model. The results shown for the\n  two black hole sources are those given in Section~\\ref{sec:test}.  \n}\n\\label{fig:deltachi}\n\\end{figure}\n\n\nIn summary, we have demonstrated that a mission-averaged spectrum of the\nCrab with 39~million counts in the HEXTE band reveals imperfections in\nthe calibration of Cluster~B. Following a procedure designed originally\nfor correcting PCA data, we show how to reduce the principal\n$\\sim$30--50~keV instrumental feature in Cluster~B data by an order of\nmagnitude, while significantly reducing the residuals at nearly all\nenergies in the full 20--250~keV band. To correct any Cluster~B spectrum\nof interest one applies the tool {\\sc hexBcorr}, which divides the\nspectrum, channel-by-channel, with the correction spectrum shown in\nFigure~\\ref{fig:ratiohr}. We show that for combined spectra of bright\nsources containing more than $10^5$ counts, the correction greatly\nimproves the quality of the fit while only mildly affecting the\nbroadband fit parameters. For individual spectra of bright sources with\nmany fewer counts, the effects on the broadband parameters will be\ncorrespondingly less. However, for the study of discrete spectral\nfeatures at energies of $\\sim$30--50~keV, such as cyclotron lines, the\ncorrection may be important even for individual spectra. Finally, we\nfind no significant residual features in the combined Crab spectrum\nusing Cluster~A observations, and we conclude that no correction is required\nfor these data. Earlier, we made publicly available the calibration tool\n{\\sc pcacorr}\\ for correcting PCA data \\citep{gar14b}. Now, the correction\ncurve for HEXTE Cluster~B along with a Python script, which constitutes\nthe tool {\\sc hexBcorr}, is publicly available at \n\\url{http://hea-www.cfa.harvard.edu/~javier/hexBcorr/}.\n\n\n\n\n\n\\acknowledgments \nWe thank an anonymous referee for several helpful comments.\nJG and JEM acknowledge the support of a CGPS grant from\nthe Smithsonian Institution. JFS has been supported by NASA Hubble\nFellowship grant HST-HF-51315.01 and NASA Einstein Fellowship grant\nPF5-160144. VG acknowledges support provided by NASA through the\nSmithsonian Astrophysical Observatory (SAO) contract SV3-73016 to MIT\nfor support of the Chandra X-Ray Center (CXC) and Science Instruments;\nCXC is operated by SAO for and on behalf of NASA under contract\nNAS8-03060.\n\n\n\n\n\n\\bibliographystyle{apj}\n\\bibliography{my-references}\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 12950, "prevtext": "\n\nwhere $T_o$ and $T_b$ are respectively the exposure times for the\nobservation of the source (and its background) and for the observation\nof the background alone. The significance of the detection in each\nchannel (i.e., the signal-to-noise ratio), which is shown in the lower\npanel of Figure~\\ref{fig:data}, is simply\n\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:sn}\n(SNR)_i = S_i / \\sigma_i.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"(SNR)_{i}=S_{i}/\\sigma_{i}.\" display=\"block\"><mrow><mrow><msub><mrow><mo stretchy=\"false\">(</mo><mrow><mi>S</mi><mo>⁢</mo><mi>N</mi><mo>⁢</mo><mi>R</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mi>i</mi></msub><mo>=</mo><mrow><msub><mi>S</mi><mi>i</mi></msub><mo>/</mo><msub><mi>σ</mi><mi>i</mi></msub></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]