[{"file": "1601.04434.tex", "nexttext": "\nHere the phenomenological parameter $\\eta<1$ describes a reduction in the critical current related, for instance, to a non-ideal interfaces. A very good fit to the data is obtained in all devices, with $\\eta$ always exceeding 0.6, see Table 1. The effective length $L_{\\rm eff}=\\sqrt{\\hbar D/ E_{\\rm Th}}$ associated to the fit Thouless energy $E_{\\rm Th}^{\\rm fit}$ exceeds the mere separation $L$ between the electrodes. It should indeed include about twice the superconducting coherence length since Andreev reflections take place in S over such a length \\cite{PRB-Dubos-2001}. The dependence of the critical current on a perpendicular magnetic field (Fig. \\ref{DC}d) shows both a quasi-gaussian monotonic decay associated to dephasing and a oscillatory part arising from interference effects \\cite{PRL-Bergeret-2007,PRB-Chiodi-2012}.\n\nThe hysteresis in the $V$-$I$ characteristics arises from the electron over-heating due to Joule heat appearing as soon as the bias current exceeds the critical current. The retrapping current can be roughly thought of as the value of the critical current at a bias-dependent, higher electronic temperature $T^*$, determined by the thermal balance between the dissipated Joule heat and the coupling to the phonon bath. Conversely, $T^*$ is also the temperature scale above which $I_r$ and $I_c$ merge and the behavior of the junction becomes non-hysteretic.\n\n\\begin{figure}[!t]\n\\includegraphics[width=\\columnwidth]{Fig1g}\n\\caption{\\emph{V-I} characteristics of device J3 measured at temperatures of (a) 100 mK and (b) 4.2 K. The arrows indicate the sweeping direction of the current bias. (c) Temperature dependence of the critical current $I_c$ (black dots) and the retrapping current $I_r$ (red dots) for sample J3. The green dotted line represents a fit to Eq. (1). Inset: AFM image of a typical Nb-Au-Nb junction. (d) Magnetic-field dependence of the critical current $I_c$ (black dots) and the retrapping current $I_r$ (red dots) ($T=280$ mK, device J1). Steps in current values appearing at large magnetic field are artifacts.}\n\\label{DC}\n\\end{figure}\n\n\\begin{figure}[!t]\n\n\\includegraphics[width=\\columnwidth]{Fig2g}\n\\caption{(a) Differential resistance map as a function of the dc current bias $I$ and the microwave excitation amplitude $I_{\\mu}$ for a frequency $\\nu=6$ GHz (device J2, $T_{\\rm bath}=100$ mK). The white arrow indicates the sweeping direction of the dc current bias. The top black arrows point to the individual \\emph{V-I} curves taken at microwave drives of (b) 0.020 (c) 0.035 (d) 0.056 (a.u.). Voltage is normalized to $h\\nu/2e$. (e) Calculated differential resistance map, including thermal effects.}\n\\label{6GHz}\n\n\\end{figure}\n\nWe now turn to the effect of a microwave excitation on the \\emph{V-I} characteristics. Microwave signals in the frequency range 1 to 26 GHz and with a power $P_{\\mu }$ were applied to the shielded cavity containing the sample. As the impedance of our samples is small compared to the estimated line impedance at high frequency, the samples are still current-biased in the microwave regime. The color map of \\mbox{Fig. \\ref{6GHz}a} shows the differential resistance $dV/dI$ obtained by numerical derivation as a function of the dc bias current $I$ and the microwave induced current $I_{\\mu}\\propto P_{\\mu}^{1/2}$ at frequency $\\nu=6$ GHz. The supercurrent branch and the Shapiro steps (up to an index exceeding 10) appear as dark regions, with zero differential resistance. At large excitation amplitudes, Fig. \\ref{6GHz}a map is symmetric in $I$ and the Shapiro steps' widths oscillate with the microwave excitation amplitude, producing a well-known pattern \\cite{Science-Doh-2005,PRL-Cleuziou-2007,NatPhys-Rokhinson,NatureNat-Pribiag,arxiv-Wiedenmann-2015}. At small microwave current $I_{\\mu}$, the hysteresis appears through the asymmetry of Fig. \\ref{6GHz}a map with respect to $I$.\n\nStrikingly, several low-index steps do not appear in the (positive) current branch corresponding to a current increasing from zero to above the critical current $I_c$. Individual \\emph{V-I} characteristics displayed in Fig. \\ref{6GHz}b-d clearly demonstrate that the absence of these steps stems from the voltage directly jumping from zero up to about $R_NI_c$, corresponding to the ohmic branch. Steps corresponding to voltages below $R_NI_c$ thus cannot be detected. The behavior discussed here is clearly distinct from the discussion of recent experiments on Josephson junctions based on topological insulator materials \\cite{NatPhys-Rokhinson,PRB-Lombardi,NatureNat-Pribiag,arxiv-Wiedenmann-2015}, in which odd-index Shapiro steps are predicted to be absent \\cite{PRL-FuKane-2009,PRL-Jiang-2011,PRB-Dominguez-2012,CRP-Badiane-2013}.\n\nLet us first focus on the behavior of the critical current as a function of the microwave current amplitude $I_{\\mu}$. In a current bias picture, the microwave irradiation adds adiabatically an oscillatory excursion $I_{\\mu}$ to the bias current $I$, so that the current oscillates between $I - I_{\\mu}$ and $I + I_{\\mu}$ \\cite{PRL-Chiodi-2009}. Switching to the resistive state then occurs at a lower critical current $I_c-I_{\\mu}$. Once the junction has switched, it remains in the resistive state due to hysteresis. To first approximation, one expects then a linear suppression of $I_c$ with increasing $I_{\\mu}$, as seen in Fig. \\ref{6GHz}a. We attribute the slight downward deviation from linear behavior to a small increase in the cryostat bath temperature at high microwave power. On the retrapping branch, a similar decay of the retrapping current $I_r$ with the microwave current $I_{\\mu}$ is observed. Here the electronic temperature is high compared to the bath temperature and varies with both the dc and ac bias, which plays a dominant role.\n\nIn order to provide a quantitative description, we need to consider the energy relaxation from the normal metal electronic population. In the present temperature range, electron-phonon scattering is the dominant mechanism. The coupling power between electrons at a temperature $T_e$ and phonons at a temperature $T_{ph}$ is $P_{e-ph}=\\Sigma U (T_e^5-T_{ph}^5)$, where $\\Sigma$ is the material-dependent coupling constant and $U$ is the metal volume. Considering a retrapping temperature $T^*$ of 1 to 3 K, the related rate $\\tau_{\\rm e-ph}^{-1}\\approx 0.16\\times T^3$ GHz in Au \\cite{PRB-Echternach-1992} is in the low GHz range ($\\approx 0.4$ GHz in J2 at $T^*$ = 1.4 K for instance). In most of the frequency range investigated here, the thermal relaxation is thus slow compared to the microwave ($\\tau_{\\rm e-ph}^{-1} < \\nu$) so that the electronic temperature can be considered as almost constant with time at a given ($I$,$I_{\\mu}$) bias point.\n\nWe consider a Resistively Shunted Junction (RSJ) model \\cite{Likharev} with a current bias, complemented with a thermal balance. The time-dependent current $i(t)=I+I_{\\mu} \\sin (2 \\pi \\nu t)$ through the junction is considered as the sum of the ohmic current $v/R$ and the Josephson current $I_c \\sin \\varphi$, where $\\varphi$ is the phase difference across the junction:\n\n", "itemtype": "equation", "pos": 6980, "prevtext": "\n\n\n\n\n\n\n\n\n\\title{Interplay Between Electron Over-Heating and ac Josephson Effect}\n\n\n\n\n\\author{A. De Cecco$^{1,2}$, K. Le Calvez$^{1,2}$, B. Sac\\'ep\\'e$^{1,2}$, C. B. Winkelmann$^{1,2}$ and H. Courtois$^{1,2}$}\n\n\n\n\n\\affiliation{$^{1}$Universit\\'e Grenoble Alpes, Institut N\\' eel, 25 Avenue des Martyrs, 38042 Grenoble, France}\n\\affiliation{$^{2}$CNRS, Institut N\\' eel, 25 Avenue des Martyrs, 38042 Grenoble, France}\n\n\n\n\n\n\\date{\\today}\n\n\\begin{abstract}\n\nWe study the response of high-critical current proximity Josephson junctions to a microwave excitation. Electron over-heating in such devices is known to create hysteretic dc voltage-current characteristics. Here we demonstrate that it also strongly influences the ac response. The interplay of electron over-heating and ac Josephson dynamics is revealed by the evolution of the Shapiro steps with the microwave drive amplitude. Extending the resistively shunted Josephson junction model by including a thermal balance for the electronic bath coupled to phonons, a strong electron over-heating is obtained.\n\\end{abstract}\n\n\n\\pacs{74.50.+r, 74.45.+c}\n\n\n\n\\maketitle\n\n\nA normal metal (N) coupled to two superconducting electrodes (S) constitutes a Josephson junction, that is, a device capable of sustaining a dissipationless supercurrent \\cite{Likharev,Superlattices-Courtois-1999,PRB-Angers08}. The small normal state resistance and lead-to-lead capacitance of SNS junctions make these strongly overdamped in the RCSJ model \\cite{Likharev}, meaning that the quantum phase dynamics is intrinsically non-hysteretic. Still, hysteresis is observed in the voltage-current ($V$-$I$) characteristics of high-critical current SNS junctions due to electronic over-heating associated to the sudden onset of dissipation when the bias exceeds the critical current \\cite{PRL-Courtois-2008}. Besides, under a microwave excitation at frequency $\\nu$, the junction characteristics display current-independent voltage plateaus defined by $V_n=n h\\nu/2e$ with $n$ an integer \\cite{Shapiro}. These so-called Shapiro steps are due to the phase-locking of the supercurrent oscillations at the Josephson frequency $2eV/h$ to the microwave. Shapiro steps have been frequently used for studying the phase dynamics of a variety of Josephson junctions \\cite{PRL-Dubos-2001,PRL-Lehnert-1999,PRL-LeSueur-2008,PRL-Chiodi-2009,PRL-Dassonneville-2013}, including junctions based on novel materials \\cite{Science-Doh-2005,PRL-Cleuziou-2007,PRL-FuKane-2009,PRL-Jiang-2011,PRB-Dominguez-2012,CRP-Badiane-2013,PRL-Fuechsle-2009,PRB-Lombardi,NatPhys-Rokhinson,arxiv-Wiedenmann-2015,NatureNat-Pribiag}. \nStill, the interplay between the electron over-heating and the ac Josephson dynamics has not yet been investigated.\n\nIn this Letter, we discuss the response of high-critical current proximity Josephson junctions to a microwave excitation. We demonstrate the prominent role of electronic over-heating in the Shapiro steps map. Low-index steps can be masked by the switching to the resistive state. A simple model explains this behavior as well as the observation of a sharp discontinuity in the measured critical current when the ac current is increased.\n\nWe have fabricated Nb-Au-Nb junctions using a lift-off lithography technique based on an Al-Mo metallic bilayer as a shadow mask \\cite{Nanotech-Samaddar-2013}, which avoids the deterioration of Nb superconducting properties by organic contamination. Conventional e-beam lithography, followed by a dry etch of the Mo top layer and a wet etch of the Al bottom layer, produces a locally suspended Mo mask. A shadow evaporation of Au (N island) and Nb (S leads) is performed through this mask at opposite angles. The edge roughness of the structures (see Fig. 1c inset) arises from the granularity of the Mo mask. The junctions were all about 210 nm wide, the separation between the Nb electrodes ranging from 180 to 500 nm, while the Au part was about 200 nm longer in order to ensure a good overlap with each electrode. The normal-state resistance of the junctions can be related to a diffusion constant $D$ in Au of about 100 cm$^2$/s. The critical temperature of the Nb electrodes is 8.5 K. Table 1 lists the main device parameters for the different junctions investigated.\n\nTransport measurements were performed at temperatures down to 100 mK. Fig. \\ref{DC}a-b show \\emph{V-I} characteristics of a typical sample. At low temperature, a strong superconducting branch is observed (Fig. \\ref{DC}a), with a large critical current $I_c$ exceeding 100 $\\mu$A. This is achieved owing to the short length of the Au bridge and the high interface transparencies. Above $I_c$, the \\emph{V-I} characteristic switches to the ohmic branch, characterized by the normal-state resistance $R_N$. When the current is lowered again, the $V$-$I$ characteristic remains on the ohmic branch down to the so-called retrapping current $I_r<I_c$. This pronounced hysteretic behaviour is of thermal origin and is typical of SNS junctions with a large critical current density \\cite{PRL-Courtois-2008}. At higher temperatures however, the thermal instability at the switching is negligible and the characteristic recovers a reversible behavior (Fig. \\ref{DC}b).\n\n\\begin{table}[!]\n\n\\setlength{\\tabcolsep}{4pt}\n\\begin{tabular}{cccccccccccc}\n\\hline\n\tN$^o$ & $L$ & $R_N$ & $\\, E_{\\rm Th}^{\\rm fit}\\,$ & $\\, L_{\\rm eff} \\,$ & $\\eta$ & $I_c^0$ & $I_r^0$ & $T^*$\\\\\n\t    & (nm) & ($\\Omega$) & ($\\mu$eV) & (nm) & & ($\\mu$A) & ($\\mu$A) & (K)\\\\\n\t\\hline\\hline\n\tJ1 & 225 & 2.4 & 28.1 & 474 & 0.86 & 104 & 33 & 1.9\\\\\n\tJ2 & 300 & 2.1 & 23.6 & 536 & 0.89 & 78 & 45 & 1.4\\\\\n\tJ3 & 180 & 1.7 & 49.6 & 390 & 0.78 & 178 & 35 & 2.6\\\\\n\tJ4 & 500 & 3.6 & 9.9 & 785 & 0.67 & 14 & 2 & 1.1\\\\  \\hline\n\\end{tabular}\n\n\\caption{Parameters of the reported samples. In all samples, the Au strip width $W$ is 210$\\pm 10$ nm, its thickness is 20 nm for sample J1 and 30 nm for samples J2 - J4, while Nb thickness is 60 nm for sample J1 and 90 nm for samples J2-J4. $L$ is the Nb-Nb distance. $R_N$ is the normal-state resistance measured at 4.2 K. $E_{\\rm Th}^{\\rm fit}$ and $\\eta$ are the fitting parameters in Eq. 1. $L_{\\rm eff}=\\sqrt{\\hbar D/ E_{\\rm Th}^{\\rm fit}}$ is the effective junction length. $I_c^0$ and $I_r^0$ the values of the critical/retrapping currents respectively at $T\\to 0$ and in the absence of magnetic field and microwave excitations. $T^*$ is defined by $I_c(T^*)=I_r^0$.}\n\\end{table}\n\nThe temperature dependence of the critical current is displayed in Fig. \\ref{DC}c. The properties of long SNS junctions depend only little on the superconducting electrodes' energy gap $\\Delta$, but are mainly governed by the normal island's Thouless energy \\cite{Superlattices-Courtois-1999,PRL-LeSueur-2008} $E_{\\rm Th}=\\hbar D / L^2$, where $D$ is the diffusion constant and $L$ the length of N. Within the Usadel equations framework and assuming $E_{\\rm Th}\\ll\\Delta$ and $k_BT>E_{\\rm Th}$, the temperature dependence of $I_c$ is \\cite{PRB-Dubos-2001}:\n\n", "index": 1, "text": "\\begin{equation}\neR_NI_c=\\eta \\, E_{\\rm Th}^{\\rm} \\frac{32}{3+2\\sqrt{2}}\\left[\\frac{2\\pi k_BT}{E_{\\rm Th}^{\\rm}}\\right]^{3/2}\\exp{\\left(-\\sqrt{\\frac{2\\pi k_BT}{E_{\\rm Th}^{\\rm}}}\\right)}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"eR_{N}I_{c}=\\eta\\,E_{\\rm Th}\\frac{32}{3+2\\sqrt{2}}\\left[\\frac{2\\pi k_{B}T}{E_{%&#10;\\rm Th}}\\right]^{3/2}\\exp{\\left(-\\sqrt{\\frac{2\\pi k_{B}T}{E_{\\rm Th}}}\\right)}.\" display=\"block\"><mrow><mrow><mrow><mi>e</mi><mo>⁢</mo><msub><mi>R</mi><mi>N</mi></msub><mo>⁢</mo><msub><mi>I</mi><mi>c</mi></msub></mrow><mo>=</mo><mrow><mpadded width=\"+1.7pt\"><mi>η</mi></mpadded><mo>⁢</mo><msub><mi>E</mi><mi>Th</mi></msub><mo>⁢</mo><mfrac><mn>32</mn><mrow><mn>3</mn><mo>+</mo><mrow><mn>2</mn><mo>⁢</mo><msqrt><mn>2</mn></msqrt></mrow></mrow></mfrac><mo>⁢</mo><msup><mrow><mo>[</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi></mrow><msub><mi>E</mi><mi>Th</mi></msub></mfrac><mo>]</mo></mrow><mrow><mn>3</mn><mo>/</mo><mn>2</mn></mrow></msup><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>(</mo><mrow><mo>-</mo><msqrt><mfrac><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><msub><mi>k</mi><mi>B</mi></msub><mo>⁢</mo><mi>T</mi></mrow><msub><mi>E</mi><mi>Th</mi></msub></mfrac></msqrt></mrow><mo>)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04434.tex", "nexttext": "\nThe time-dependent voltage $v$ relates to the time-derivative of the phase as $v(t)=\\hbar {\\dot \\varphi}/2e$ from the second Josephson relation. From Eq. (\\ref{current}), the phase dynamics can be modeled as that of a massless particle of position $\\varphi$ in a {\\it tilted washboard} potential $U(\\varphi)=-\\hbar [I_c \\cos \\varphi+i(t)]/2e$. The potential slope is proportional to the current bias $i(t)$: its average is thus determined by $I$ and it oscillates with an amplitude given by $I_{\\mu}$. For large enough $I$ or $I_{\\mu}$, the particle rolls down the slope. The Shapiro steps at voltage values $V_n=n\\, h f/2e$ correspond to the particle hopping across $n$ minima during one microwave period.\n\nWe can write the instantaneous Joule power:\n\n", "itemtype": "equation", "pos": 14284, "prevtext": "\nHere the phenomenological parameter $\\eta<1$ describes a reduction in the critical current related, for instance, to a non-ideal interfaces. A very good fit to the data is obtained in all devices, with $\\eta$ always exceeding 0.6, see Table 1. The effective length $L_{\\rm eff}=\\sqrt{\\hbar D/ E_{\\rm Th}}$ associated to the fit Thouless energy $E_{\\rm Th}^{\\rm fit}$ exceeds the mere separation $L$ between the electrodes. It should indeed include about twice the superconducting coherence length since Andreev reflections take place in S over such a length \\cite{PRB-Dubos-2001}. The dependence of the critical current on a perpendicular magnetic field (Fig. \\ref{DC}d) shows both a quasi-gaussian monotonic decay associated to dephasing and a oscillatory part arising from interference effects \\cite{PRL-Bergeret-2007,PRB-Chiodi-2012}.\n\nThe hysteresis in the $V$-$I$ characteristics arises from the electron over-heating due to Joule heat appearing as soon as the bias current exceeds the critical current. The retrapping current can be roughly thought of as the value of the critical current at a bias-dependent, higher electronic temperature $T^*$, determined by the thermal balance between the dissipated Joule heat and the coupling to the phonon bath. Conversely, $T^*$ is also the temperature scale above which $I_r$ and $I_c$ merge and the behavior of the junction becomes non-hysteretic.\n\n\\begin{figure}[!t]\n\\includegraphics[width=\\columnwidth]{Fig1g}\n\\caption{\\emph{V-I} characteristics of device J3 measured at temperatures of (a) 100 mK and (b) 4.2 K. The arrows indicate the sweeping direction of the current bias. (c) Temperature dependence of the critical current $I_c$ (black dots) and the retrapping current $I_r$ (red dots) for sample J3. The green dotted line represents a fit to Eq. (1). Inset: AFM image of a typical Nb-Au-Nb junction. (d) Magnetic-field dependence of the critical current $I_c$ (black dots) and the retrapping current $I_r$ (red dots) ($T=280$ mK, device J1). Steps in current values appearing at large magnetic field are artifacts.}\n\\label{DC}\n\\end{figure}\n\n\\begin{figure}[!t]\n\n\\includegraphics[width=\\columnwidth]{Fig2g}\n\\caption{(a) Differential resistance map as a function of the dc current bias $I$ and the microwave excitation amplitude $I_{\\mu}$ for a frequency $\\nu=6$ GHz (device J2, $T_{\\rm bath}=100$ mK). The white arrow indicates the sweeping direction of the dc current bias. The top black arrows point to the individual \\emph{V-I} curves taken at microwave drives of (b) 0.020 (c) 0.035 (d) 0.056 (a.u.). Voltage is normalized to $h\\nu/2e$. (e) Calculated differential resistance map, including thermal effects.}\n\\label{6GHz}\n\n\\end{figure}\n\nWe now turn to the effect of a microwave excitation on the \\emph{V-I} characteristics. Microwave signals in the frequency range 1 to 26 GHz and with a power $P_{\\mu }$ were applied to the shielded cavity containing the sample. As the impedance of our samples is small compared to the estimated line impedance at high frequency, the samples are still current-biased in the microwave regime. The color map of \\mbox{Fig. \\ref{6GHz}a} shows the differential resistance $dV/dI$ obtained by numerical derivation as a function of the dc bias current $I$ and the microwave induced current $I_{\\mu}\\propto P_{\\mu}^{1/2}$ at frequency $\\nu=6$ GHz. The supercurrent branch and the Shapiro steps (up to an index exceeding 10) appear as dark regions, with zero differential resistance. At large excitation amplitudes, Fig. \\ref{6GHz}a map is symmetric in $I$ and the Shapiro steps' widths oscillate with the microwave excitation amplitude, producing a well-known pattern \\cite{Science-Doh-2005,PRL-Cleuziou-2007,NatPhys-Rokhinson,NatureNat-Pribiag,arxiv-Wiedenmann-2015}. At small microwave current $I_{\\mu}$, the hysteresis appears through the asymmetry of Fig. \\ref{6GHz}a map with respect to $I$.\n\nStrikingly, several low-index steps do not appear in the (positive) current branch corresponding to a current increasing from zero to above the critical current $I_c$. Individual \\emph{V-I} characteristics displayed in Fig. \\ref{6GHz}b-d clearly demonstrate that the absence of these steps stems from the voltage directly jumping from zero up to about $R_NI_c$, corresponding to the ohmic branch. Steps corresponding to voltages below $R_NI_c$ thus cannot be detected. The behavior discussed here is clearly distinct from the discussion of recent experiments on Josephson junctions based on topological insulator materials \\cite{NatPhys-Rokhinson,PRB-Lombardi,NatureNat-Pribiag,arxiv-Wiedenmann-2015}, in which odd-index Shapiro steps are predicted to be absent \\cite{PRL-FuKane-2009,PRL-Jiang-2011,PRB-Dominguez-2012,CRP-Badiane-2013}.\n\nLet us first focus on the behavior of the critical current as a function of the microwave current amplitude $I_{\\mu}$. In a current bias picture, the microwave irradiation adds adiabatically an oscillatory excursion $I_{\\mu}$ to the bias current $I$, so that the current oscillates between $I - I_{\\mu}$ and $I + I_{\\mu}$ \\cite{PRL-Chiodi-2009}. Switching to the resistive state then occurs at a lower critical current $I_c-I_{\\mu}$. Once the junction has switched, it remains in the resistive state due to hysteresis. To first approximation, one expects then a linear suppression of $I_c$ with increasing $I_{\\mu}$, as seen in Fig. \\ref{6GHz}a. We attribute the slight downward deviation from linear behavior to a small increase in the cryostat bath temperature at high microwave power. On the retrapping branch, a similar decay of the retrapping current $I_r$ with the microwave current $I_{\\mu}$ is observed. Here the electronic temperature is high compared to the bath temperature and varies with both the dc and ac bias, which plays a dominant role.\n\nIn order to provide a quantitative description, we need to consider the energy relaxation from the normal metal electronic population. In the present temperature range, electron-phonon scattering is the dominant mechanism. The coupling power between electrons at a temperature $T_e$ and phonons at a temperature $T_{ph}$ is $P_{e-ph}=\\Sigma U (T_e^5-T_{ph}^5)$, where $\\Sigma$ is the material-dependent coupling constant and $U$ is the metal volume. Considering a retrapping temperature $T^*$ of 1 to 3 K, the related rate $\\tau_{\\rm e-ph}^{-1}\\approx 0.16\\times T^3$ GHz in Au \\cite{PRB-Echternach-1992} is in the low GHz range ($\\approx 0.4$ GHz in J2 at $T^*$ = 1.4 K for instance). In most of the frequency range investigated here, the thermal relaxation is thus slow compared to the microwave ($\\tau_{\\rm e-ph}^{-1} < \\nu$) so that the electronic temperature can be considered as almost constant with time at a given ($I$,$I_{\\mu}$) bias point.\n\nWe consider a Resistively Shunted Junction (RSJ) model \\cite{Likharev} with a current bias, complemented with a thermal balance. The time-dependent current $i(t)=I+I_{\\mu} \\sin (2 \\pi \\nu t)$ through the junction is considered as the sum of the ohmic current $v/R$ and the Josephson current $I_c \\sin \\varphi$, where $\\varphi$ is the phase difference across the junction:\n\n", "index": 3, "text": "\\begin{equation}\ni(t)= I +I_{\\mu}\\sin(2 \\pi \\nu t)= I_c \\sin \\varphi + v/R.\n\\label{current}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"i(t)=I+I_{\\mu}\\sin(2\\pi\\nu t)=I_{c}\\sin\\varphi+v/R.\" display=\"block\"><mrow><mrow><mrow><mi>i</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>I</mi><mo>+</mo><mrow><msub><mi>I</mi><mi>μ</mi></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>ν</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>I</mi><mi>c</mi></msub><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>φ</mi></mrow></mrow><mo>+</mo><mrow><mi>v</mi><mo>/</mo><mi>R</mi></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.04434.tex", "nexttext": "\nThe first term is the change of the Josephson energy. It is zero in average and does not contribute to the average power $P$ dissipated over one cycle. Only the second term, which is the Joule power across the junction resistance, dissipates. It can be non-zero in average even though the average voltage $V$ is zero.\n\nIn terms of heat balance, the dissipated power $P$ is balanced by the electron-phonon coupling power $P_{e-ph}$. The related temperature elevation acts on the phase dynamics through the temperature dependence of the critical current following Eq. (1). Using Eqs. (\\ref{current}) and (\\ref{power}) and taking the volume $U$ as a free parameter, we have numerically calculated the time-dependence of the phase, the dissipated power and the ensuing electronic temperature $T_e$ for every ($I$,$I_{\\mu}$) bias point, which gives access to the related dc voltage drop $V$. Fig. \\ref{6GHz}e shows the calculated differential resistance for device J2's parameters. For the best fit, the volume $U$ was chosen as 10 times the physical volume. This can be explained by both the inverse proximity effect in the leads in the vicinity of the N-S interface and the thermal conductance of the leads between the N island and the N metal regions of the leads. A semi-quantitative agreement for the differential resistance between Fig. \\ref{6GHz}a and \\ref{6GHz}e is readily seen.\n\n\\begin{figure}[!t]\n\n\\includegraphics[width=\\columnwidth]{Fig3g}\n\\caption{(a) Calculated electronic temperature $T_e$ map corresponding to situation of \\mbox{Fig. 2}, \\mbox{i.e.} for device J2 at $T_{\\rm bath}=100$ mK. Inset: Line cut showing the electronic temperature at zero dc bias current as a function of the microwave current. (b) Line cuts of the map (a) showing the dependence of the electronic temperature as a function of the dc bias current $I$ at different values of the microwave current indicated by arrows at the top of the map.}\n\\label{Temp}\n\n\\end{figure}\n\nThe associated temperature map of Fig. \\ref{Temp}a highlights the importance of dissipation in the ac phase dynamics in SNS junctions. Strikingly, the electronic temperature varies significantly as a function of the microwave current bias: the temperature increases from the bath temperature of 0.1 K up to above 2 K. On the first Shapiro step, the temperature is already of about 1 K. Even for zero dc current $I$ and hence zero voltage $V$, the electrons in N are significantly overheated at large microwave drives, see Fig. \\ref{Temp}a inset. The Shapiro steps structure appears also on the temperature map, as can be seen in Fig. \\ref{Temp}a and more clearly in Fig. \\ref{Temp}b as wiggles in every curve, especially the curve (2).\n\nBoth the data (Fig. \\ref{6GHz}a) and the calculations (Fig. \\ref{6GHz}e) exhibit a sudden drop of the critical current $I_c$ as the retrapping current $I_r$ reaches the border of the $n=0$ Shapiro step (at a microwave current $I_{\\mu}=I^*$ of about 0.04 in Fig. 2a). The numerical solution of the phase dynamics provides the explanation for this: for a zero dc current bias ($I=0$), while at an ac drive below $I^*$ the particle oscillates in a single washboard valley, above $I^*$ it hops back and forth between two valleys \\cite{SuppMat}. Although not causing any dc voltage over the junction, this produces dissipation similar to that of the $n=1$ state, which is also revealed by the temperature map {\\mbox Fig. \\ref{Temp}a}.\n\nWe have obtained a good agreement between experiment and calculation at every investigated microwave frequency up to 26 GHz. At higher frequency, as dissipation increases with excitation frequency $\\nu$ as $\\nu^2$, the electron over-heating is much increased in the superconducting state ($V=0$). The two currents $I_c(I_{\\mu})$ and $I_r(I_{\\mu})$ are thus seen to merge before $I_r$ reaches the border of the $n=0$ Shapiro step \\cite{SuppMat}.\n\n\\begin{figure}[!t]\n\\includegraphics[width=0.99\\columnwidth]{Fig4g}\n\\caption{a, b: Differential resistance maps as a function of {\\it I} and $I_{\\mu}$ for $\\nu=6$ GHz in non-hysteretic conditions, for (a) at base temperature and a magnetic field of 100 mT (device J2), and (b) at a bath temperature of about 4.2 K (device J3, no magnetic field). The white lines represent the usual Bessel-function-like amplitude of the step $n=0$.}\n\\label{nonhysteretic}\n\\end{figure}\n\nAs to evidence the role of the thermal instability in the absence of low index Shapiro steps and the change in behavior at $I^*$, we can drive the devices to non-hysteretic conditions, either by applying a magnetic field ({\\mbox Fig. \\ref{nonhysteretic}a}) or increasing the temperature ({\\mbox Fig. \\ref{nonhysteretic}b}). In both cases, the usual Shapiro pattern is recovered \\cite{Likharev}, as evidenced by the good agreement of the width of the $n=0$ step with the standard Bessel function expression (white dotted lines in {\\mbox Fig. \\ref{nonhysteretic}a} and b).\n\nIn summary, we have evidenced that electron over-heating is of paramount influence in the microwave response of Josephson junctions. Exploring the microwave response of Josephson junctions involves variable electronic temperatures, which is of uttermost importance for the complete analysis of devices based on new materials like topological conductors.\n\n\\begin{acknowledgments}\nWe acknowledge financial support from the ANR contract \"Nanoquartets\". Samples were fabricated at the Nanofab platform at CNRS, Grenoble. We thank A. Nabet and D. van Zanten for help in the experiments.\n\\end{acknowledgments}\n\n\\begin{thebibliography}{31}\n\\bibitem{Likharev} K. K. Likharev, {\\it Dynamics of Josephson Junctions and Circuits} (Gordon and Breach, 1991).\n\\bibitem{Superlattices-Courtois-1999} H. Courtois, P. Gandit, B. Pannetier, and D. Mailly, Superlatt. and Microstruct. {\\bf 25}, 721 (1999).\n\\bibitem{PRB-Angers08} L. Angers, F. Chiodi, G. Montambaux, M. Ferrier, S. Gu\\'eron, H. Bouchiat, and J. C. Cuevas, Phys. Rev. B {\\bf 77}, 165408 (2008).\n\\bibitem{PRL-Courtois-2008} H. Courtois, M. Meschke, J. T. Peltonen, and J. P. Pekola, Phys. Rev. Lett. {\\bf 101}, 067002 (2008).\n\\bibitem{Shapiro} S. Shapiro, {\\it Phys. Rev. Lett.} {\\bf 11}, 80 (1963).\n\\bibitem{PRL-Lehnert-1999} K. W. Lehnert, N. Argaman, H. R. Blank, K. C. Wong, S. J. Allen, E. L. Hu, and H. Kroemer, Phys. Rev. Lett. {\\bf 82}, 1265 (1999).\n\\bibitem{PRL-Dubos-2001} P. Dubos, H. Courtois, O. Buisson, and B. Pannetier, Phys. Rev. Lett. {\\bf 87}, 206801 (2001).\n\\bibitem{PRL-LeSueur-2008} H. le Sueur, P. Joyez, H. Pothier, C. Urbina, and D. Est\\`eve, Phys. Rev. Lett. {\\bf 100}, 197002 (2008).\n\\bibitem{PRL-Chiodi-2009} F. Chiodi, M. Aprili, and B. Reulet, Phys. Rev. Lett. {\\bf 103}, 177002 (2009).\n\\bibitem{PRL-Dassonneville-2013} B. Dassonneville, M. Ferrier, S. Gu\\'eron, and H. Bouchiat, Phys. Rev. Lett. {\\bf 110}, 217001 (2013).\n\\bibitem{Science-Doh-2005} Y.-J. Doh, J. A. van Dam, A. L. Roest, E. P. A. M. Bakkers, L. P. Kouwenhoven, and S. De Franceschi, Science {\\bf 309}, 272 (2005).\n\\bibitem{PRL-FuKane-2009} L. Fu, C. L. Kane, and E. J. Mele, Phys. Rev. Lett. {\\bf 98},106803 (2007).\n\\bibitem{PRL-Cleuziou-2007} J.-P. Cleuziou, W. Wernsdorfer, S. Andergassen, S. Florens, V. Bouchiat, Th. Ondar{\\c c}uhu, and M. Monthioux, Phys. Rev. Lett. {\\bf 99}, 117001 (2007).\n\\bibitem{PRL-Fuechsle-2009} M. Fuechsle, J. Bentner, D. A. Ryndyk, M. Reinwald, W. Wegscheider, and C. Strunk, Phys. Rev. Lett. {\\bf 102}, 127001 (2009).\n\\bibitem{PRL-Jiang-2011} L. Jiang, D. Pekker, J. Alicea, G. Refael, Y. Oreg and F. von Oppen, Phys. Rev. Lett. {\\bf 107}, 236401 (2011).\n\\bibitem{PRB-Dominguez-2012} F. Dominguez, F. Hassler, and G. Platero, Phys. Rev. B {\\bf 86} 140503 (2012).\n\\bibitem{NatPhys-Rokhinson} L. P. Rokhinson, X. Liu, and J. K. Furdyna, Nature Phys. {\\bf 8}, 795 (2012).\n\\bibitem{CRP-Badiane-2013} D. M. Badiane, L. I. Glazman, M. Houzet, and J. S. Meyer, Comptes Rendus Physique {\\bf 14}, 840 (2013).\n\\bibitem{PRB-Lombardi} L. Galletti, S. Charpentier, M. Iavarone, P. Lucignano, D. Massarotti, R. Arpaia, Y. Suzuki, K. Kadowaki, T. Bauch, A. Tagliacozzo, F. Tafuri, and F. Lombardi, Phys. Rev. B {\\bf 89}, 134512 (2014).\n\\bibitem{NatureNat-Pribiag} V. S. Pribiag, A. J. A. Beukman, F. Qu, M. C. Cassidy, C. Charpentier, W. Wegscheider and L. P. Kouwenhoven, Nat. Nanotech. {\\bf 10}, 593 (2015).\n\\bibitem{arxiv-Wiedenmann-2015} J. Wiedenmann, E. Bocquillon, R. S. Deacon, S. Hartinger, T. M. Klapwijk, L. Maier, C. Ames, C. Br{\\\" u}ne, K. Ishibashi, S. Tarucha, H. Buhmann, L. W. Molenkamp, arXiv:1503.05591.\n\\bibitem{Nanotech-Samaddar-2013} S. Samaddar, D. van Zanten, A. Fay, B. Sac\\'ep\\'e, H. Courtois, and C. B. Winkelmann, Nanotechnology {\\bf 24}, 375304 (2013).\n\\bibitem{PRB-Dubos-2001} P. Dubos, H. Courtois, B. Pannetier, F. K. Wilhelm, A. D. Zaikin, and G. Sch\\\" on, Phys. Rev. B {\\bf 63}, 064502 (2001).\n\\bibitem{PRB-Chiodi-2012} F. Chiodi, M. Ferrier, S. Gu\\' eron, J. C. Cuevas, G. Montambaux, F. Fortuna, A. Kasumov, and H. Bouchiat, Phys. Rev. B {\\bf  86}, 064510 (2012).\n\\bibitem{PRL-Bergeret-2007} J. C. Cuevas and F. S. Bergeret, Phys. Rev. Lett. {\\bf 99}, 217002 (2007).\n\\bibitem{PRB-Echternach-1992} P. M. Echternach, M. R. Thoman, C. M. Gould, and H. M. Bozler, Phys. Rev. B {\\bf 46}, 10339 (1992).\n\\bibitem{SuppMat} See Supplemental Material for details on the phase dynamics calculation and data at various microwave frequencies.\n\\end{thebibliography}\n\n\\clearpage\n\\widetext\n\\begin{center}\n\\textbf{\\large Supplemental Materials: Interplay Between Electron Over-Heating and ac Josephson Effect}\n\\end{center}\n\n\n\\setcounter{equation}{0}\n\\setcounter{figure}{0}\n\\setcounter{table}{0}\n\\setcounter{page}{1}\n\\makeatletter\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\title{Interplay Between Electron Over-Heating and ac Josephson Effect}\n\n\n\n\n\n\\author{A. De Cecco$^{1,2}$, K. Le Calvez$^{1,2}$, B. Sac\\'ep\\'e$^{1,2}$, C. B. Winkelmann$^{1,2}$, H. Courtois$^{1,2}$}\n\n\n\n\n\\affiliation{$^{1}$Universit\\'e Grenoble Alpes, Institut N\\' eel, 25 Avenue des Martyrs, 38042 Grenoble, France}\n\\affiliation{$^{2}$CNRS, Institut N\\' eel, 25 Avenue des Martyrs, 38042 Grenoble, France}\n\n\n\n\n\n\\date{\\today}\n\nIn this supplemental materials part, we provide some more details about the numerical calculation of the differential resistance map under microwave irradiation, as well as the calculation results supporting the explanation for the discontinuity observed in the differential resistance map. We also discuss additional experimental data obtained at different values of the microwave frequency.\n\n\n\n\n\n\n\\maketitle\n\n\\section{Numerical calculations}\n\nOur model is an extension of the RSJ model with the temperature dependence of the critical current (Eq. (1) of the main text), the electronic temperature $T_e$ in N being governed by the thermal balance between the Joule power and the coupling to phonons. We here neglect other heat transport channels out of N, which will eventually lead to a somewhat lower temperature.\n\nA sharp discontinuity in the differential conductance map at 6 GHz is described in the main text, see Fig. 2 of the main paper. Fig. \\ref{Zoom} shows both a zoom of the map and the time-dependence of the phase at two points at the same dc current bias, but at an ac current signal amplitude just below and above the threshold. While the mean voltage is zero in every case, the phase's excursion is larger in amplitude at larger ac signal. It exceeds 2$\\pi$ in the latter case, meaning that the effective particle travels over two neighboring minima of the potential landscape. The related dissipation makes the electronic temperature rise and the effective critical current drop, resulting in a sharp change in the differential conductance map.\n\n\\begin{figure}[b]\n\\includegraphics[width=0.5\\columnwidth]{FigS1g}\n\\caption{(a) Zoom of the differential resistance map as a function of $I$ and $I_{\\mu}$ at $\\nu=6$ GHz (device J2, $T_{bath} = 100$ mK) shown in Fig. 2e in the main paper. (b) Schematics showing the extent of the phase excursion at the two bias points. (c) Calculated time dependence of the phase at the bias points indicated by the crosses in (a).}\n\\label{Zoom}\n\\end{figure}\n\nThe agreement with experimental data at the same frequency is remarkable at every microwave frequency investigated. Fig. 2 in the main paper displays data and calculation at 6 GHz, while Fig. \\ref{8GHz} and Fig. \\ref{24GHz} in this supplementary materials display similar information at 8.8 GHz and 24.2 GHz.\n\nHere we also provide the map of the temperature derivative with respect to the current bias, see Fig. \\ref{Derivative}. This plot highlights the appearance in the temperature map of the Shapiro steps structure.\n\n\\begin{figure}[!t]\n\\includegraphics[width=0.5\\columnwidth]{FigS2g}\n\\caption{(a) Differential resistance map as a function of the dc current bias $I$ and the microwave excitation amplitude $I_{\\mu}$ for a frequency $\\nu=8.8$ GHz (device J2, $T_{\\rm bath}=100$ mK). The white arrow indicates the sweeping direction of the dc current bias. The top black arrows point to the individual \\emph{V-I} curves taken at microwave drives of (b) 0.010 (c) 0.043 (d) 0.072 (a.u.). Voltage is normalized to $h\\nu/2e$. (e) Calculated differential resistance map, including thermal effects, see text for details. The related calculated temperature is displayed in (f), its derivative with respect to bias current is in (g).}\n\\label{8GHz}\n\\end{figure}\n\n\\begin{figure}[!t]\n\\includegraphics[width=0.5\\columnwidth]{FigS4g}\n\\caption{(a) Differential resistance map as a function of $I$ and  $I_{\\mu}$ at $\\nu=24.2$ GHz (device J2, $T= 100$ mK). The white arrow indicates the sweeping direction of the dc current bias. The top black arrows point to the individual \\emph{V-I} curves taken at microwave drives of (b) 0.010 (c) 0.028 (d) 0.049 (a.u.). Voltage is normalized to $h\\nu/2e$. (e) Calculated differential resistance map, including thermal effects, see text for details. The related calculated temperature is displayed in (f), its derivative with respect to bias current is in (g).}\n\\label{24GHz}\n\\end{figure}\n\n\\begin{figure}[!b]\n\\includegraphics[width=0.5\\columnwidth]{FigS3g}\n\\caption{Calculated map of the temperature derivative with respect to the current bias, including thermal effects, see text for details, corresponding to the case of Fig. 2 of the main paper, \\mbox{i.e.} for sample J2 at a bath temperature of 100 mK.}\n\\label{Derivative}\n\\end{figure}\n\n\\section{Behavior at higher frequency}\n\nIn the higher frequency regime, we observe the appearance of fractional Shapiro steps at voltages $V_{n,m}=(n/m)\\,h\\nu/2e$, where $n$ and $m$ are integers. This appears as thin zero-differential resistance regions at intermediate positions compared to the integer steps in Fig. \\ref{24GHz}a, and short steps in Fig. \\ref{24GHz}b-d. Fractional Shapiro steps were already observed in similar devices \\cite{PRL-Lehnert-1999,PRL-Dubos-2001,PRL-Fuechsle-2009}. Multiple Andreev Reflections as well as non-thermal out-of-equilibrium energy distribution function can contribute to this phenomena. As they are not included in our model, fractional steps are absent from the calculation results.\n\nAt higher frequency, the dissipation at a given amplitude $I_{\\mu}$ is larger. The dominating effect of the microwave irradiation on the electronic population appears in Fig. \\ref{24GHz} through the merging of the critical current and the retrapping current above an intermediate level of ac current bias $I_{\\mu}>0.02$. As a consequence, no discontinuity is observed in the differential resistance map. Still, the n = 1 step is missing at low microwave excitation.\n\n\\begin{thebibliography}{9}\n\\bibitem{PRL-Dubos-2001} P. Dubos, H. Courtois, O. Buisson, and B. Pannetier, Phys. Rev. Lett. {\\bf 87}, 206801 (2001).\n\\bibitem{PRL-Lehnert-1999} K. W. Lehnert, N. Argaman, H. R. Blank, K. C. Wong, S. J. Allen, E. L. Hu, and H. Kroemer, Phys. Rev. Lett. {\\bf 82}, 1265 (1999).\n\\bibitem{PRL-Fuechsle-2009} M. Fuechsle, J. Bentner, D. A. Ryndyk, M. Reinwald, W. Wegscheider, and C. Strunk, Phys. Rev. Lett. {\\bf 102}, 127001 (2009).\n\\end{thebibliography}\n \n", "itemtype": "equation", "pos": 15143, "prevtext": "\nThe time-dependent voltage $v$ relates to the time-derivative of the phase as $v(t)=\\hbar {\\dot \\varphi}/2e$ from the second Josephson relation. From Eq. (\\ref{current}), the phase dynamics can be modeled as that of a massless particle of position $\\varphi$ in a {\\it tilted washboard} potential $U(\\varphi)=-\\hbar [I_c \\cos \\varphi+i(t)]/2e$. The potential slope is proportional to the current bias $i(t)$: its average is thus determined by $I$ and it oscillates with an amplitude given by $I_{\\mu}$. For large enough $I$ or $I_{\\mu}$, the particle rolls down the slope. The Shapiro steps at voltage values $V_n=n\\, h f/2e$ correspond to the particle hopping across $n$ minima during one microwave period.\n\nWe can write the instantaneous Joule power:\n\n", "index": 5, "text": "\\begin{equation}\np(t) = i \\cdot v = I_c  \\frac{\\hbar}{2e}{\\dot \\varphi} \\, \\sin\\varphi + \\frac{1}{R}\\left(\\frac{\\hbar}{2e}{\\dot \\varphi}\\right)^2.\n\\label{power}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"p(t)=i\\cdot v=I_{c}\\frac{\\hbar}{2e}{\\dot{\\varphi}}\\,\\sin\\varphi+\\frac{1}{R}%&#10;\\left(\\frac{\\hbar}{2e}{\\dot{\\varphi}}\\right)^{2}.\" display=\"block\"><mrow><mrow><mrow><mi>p</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mi>i</mi><mo>⋅</mo><mi>v</mi></mrow><mo>=</mo><mrow><mrow><msub><mi>I</mi><mi>c</mi></msub><mo>⁢</mo><mfrac><mi mathvariant=\"normal\">ℏ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>e</mi></mrow></mfrac><mo>⁢</mo><mpadded width=\"+1.7pt\"><mover accent=\"true\"><mi>φ</mi><mo>˙</mo></mover></mpadded><mo>⁢</mo><mrow><mi>sin</mi><mo>⁡</mo><mi>φ</mi></mrow></mrow><mo>+</mo><mrow><mfrac><mn>1</mn><mi>R</mi></mfrac><mo>⁢</mo><msup><mrow><mo>(</mo><mrow><mfrac><mi mathvariant=\"normal\">ℏ</mi><mrow><mn>2</mn><mo>⁢</mo><mi>e</mi></mrow></mfrac><mo>⁢</mo><mover accent=\"true\"><mi>φ</mi><mo>˙</mo></mover></mrow><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]