[{"file": "1601.07186.tex", "nexttext": "\nwhere $h$ is the disk scale height and $\\rho_{\\rm g}$ is the gas density.\nWe then assume that supersonic turbulent pressure is the primary source of pressure support in the disk with turbulent gas velocity dispersion $c_t$, in which case the rate of (volumetric) turbulent energy dissipation is\n\n", "itemtype": "equation", "pos": 12811, "prevtext": "\n\n\\maketitle\n\n\\begin{abstract}\nWe examine the stability of feedback-regulated star formation (SF) in galactic nuclei and contrast it to SF in extended discs. \nIn galactic nuclei the dynamical time becomes shorter than the time over which feedback from young stars evolves. \nWe argue analytically that the balance between stellar feedback and gravity is unstable in this regime.\nWe study this using numerical simulations with pc-scale resolution and explicit stellar feedback taken from stellar evolution models. \nThe nuclear gas mass, young stellar mass, and SFR within the central $\\sim$100 pc (the short-timescale regime) never reach steady-state, but instead go through dramatic, oscillatory cycles. \nStars form until a critical surface density of young stars is present (such that feedback overwhelms gravity), at which point they begin to expel gas from the nucleus. \nSince the dynamical times are shorter than the stellar evolution times,\nthe stars do not die as the gas is expelled, but continue to push, triggering a runaway quenching of star formation in the nucleus. \nHowever the expelled gas is largely not unbound from the galaxy, but goes into a galactic fountain which re-fills the nuclear region after the massive stars from the previous burst cycle have died off ($\\sim$50 Myr timescale). \nOn large scales ($>$1 kpc), the galaxy-scale gas content and SFR is more stable.\nWe examine the consequences of this episodic nuclear star formation for the Kennicutt-Schmidt (KS) relation: while a tight KS relation exists on $\\sim$1 kpc scales in good agreement with observations, the scatter increases dramatically in smaller apertures centered on galactic nuclei.\n\\end{abstract}\n\n\\begin{keywords} \nmethods: numerical -- stars: formation -- galaxies: evolution -- galaxies: formation -- galaxies: high- redshift -- galaxies: ISM -- galaxies: starburst\n\\end{keywords}\n\n\n\n\\section{Introduction}\nObservations of star formation in our Galaxy and in extragalactic systems show that stars are formed inefficiently.\nA common approach for parameterizing the star formation rate (SFR) efficiency is to express\n$\\dot \\rho_*  = \\epsilon \\rho_{{\\rm gas}}/t_{{\\rm ff}}$\nwhere $\\dot \\rho_*$ is the star formation rate per unit volume, $\\rho_{{\\rm gas}}$ is the volume density of gas, $t_{{\\rm ff}}$ is the local gas free fall time, and $\\epsilon$ is the star formation rate efficiency (i.e. the fraction of gas that turns into stars per galactic free fall time).\nSince the volumetric gas and star formation rate densities are not easily observable, this inefficiency is observationally probed through the Kennicutt-Schmidt~\\citep[KS;][]{Schmidt, Kennicutt} relation.\nThe KS relation considers the current star formation rate surface density as a function of the available fuel for star formation measured through the total (or molecular) gas surface density.\nAlthough there is still debate about the detailed slope and normalization of the KS relation, it is generally agreed that -- when measured/averaged over large areas within galaxies -- only a few percent of gas is able to be converted into stars per free fall time~\\citep[e.g.,][]{Zuckerman1974, Leroy2008, Bigiel2008}.\nUnderstanding and explaining this inefficiency forms a central component of star formation and galaxy formation research.\n\nTwo main classes of models have been presented to explain the low efficiency of star formation and the form of the KS law.\nIn one class it is argued that the small-scale properties of supersonic ISM turbulence are able to disrupt cloud collapse, giving rise to low SFR efficiencies~\\citep[e.g.,][]{Krumholz2005, Federrath2012}.\nThese models relate the low efficiency of star formation to the statistical properties of the density fluctuations in supersonic turbulence.\nHowever, since the rate-limiting step for gravitational collapse is the formation of dense gas clouds in the first place, this is an incomplete explanation of the galaxy-scale KS law.\n\nAnother approach has been to develop analytic global ``equilibrium\" models that explain the low efficiency of star formation and form of the KS law~\\citep{Silk1997, Thompson2005, Ostriker2011, FaucherGiguere2013}.\nThe common component of the equilibrium models is that the interstellar medium (ISM) remains in a quasi stable state by balancing feedback from young stellar populations with the global pressure of the self gravity of the disk~\\citep{Silk1997, Hopkins2011a}.\nWhile thermal pressure or radiation pressure contribute to the disk support, play a role in disrupting the giant molecular cloud (GMC) complexes where stars are formed~\\citep[e.g.,][]{Murray2010}, and could be a source of turbulence, turbulent pressure is thought to provide the dominant source of support against the vertical collapse in gas-rich galaxies~\\citep{Ostriker2011, FaucherGiguere2013}, except possibly in the most optically thick inner parts~\\citep{Thompson2005}.\nEquilibrium star formation models are able to derive star formation efficiencies by asserting that the turbulent energy injection rate from young stellar populations balances the turbulent energy dissipation rate.\nThe derived star formation efficiencies scale with measurable properties of galactic disks and are consistent with observed star formation efficiencies~\\citep{FaucherGiguere2013}.\n\nThese models implicitly assume that \n(1) gas in the local disk responds to feedback, \n(2) the strength of feedback scales with the star formation {\\it rate}, and \n(3) the star formation rate -- and therefore feedback -- responds in turn to the gas properties. \nIf feedback is ``too strong,\" gas will be expelled or pushed out to such low densities that it cannot form new stars, so the feedback ``supply\" will cease. \nIf feedback is ``too weak,\" gas collapses rapidly and forms more stars, injecting more feedback until collapse is halted. \n\nThis feedback cycle can only hold if the gas adjusts efficiently to the presence of feedback, {\\it and the feedback energy/momentum injection rate efficiently adjusts} to changes in the gas density via the star formation rate.\nAs long as the feedback is sufficiently strong and efficiently coupled to the gas, the gas will adjust to the presence of feedback.\nHowever, there are physical regimes where feedback evolves on timescales that are (much) longer than the local dynamical time.\nIn these regimes, the feedback energy/momentum injection rate will not respond to changes in the gas density, potentially breaking the feedback loop invoked in these star formation models.\n\nFor stellar feedback, the primary sources of direct momentum and energy injection into the local environment are radiation pressure, stellar winds, photoionization, and supernovae~\\citep{Murray2010, HopkinsKSlaw}, and cosmic rays~\\citep[e.g.,][]{Jubelgas2008, Uhlig2012, Booth2013, Salem2014}.   Magnetic fields may also act to suppress star formation regulation mechanisms~\\citep{Dolag1999,Wang2009, Pakmor2013, Marinacci2015}.\nThe relative importance of these mechanisms depends on the physical conditions of the gas.\nRadiation pressure~\\citep{Murray2010} and photoionization~\\citep{Whitworth1979, Krumholz2006, Walch2012, Sales2014} are often identified as being responsible for disrupting the dense star forming gas,\nbut supernovae probably dominate the turbulent momentum injection that balances the disk vertical collapse under most conditions~\\citep{Ostriker2011}.\n\n\n\\begin{figure}\n\\centerline{\\vbox{\\hbox{\\includegraphics[width=0.475\\textwidth]{./sb99_mom_budget.pdf}}}}\n\\caption{The direct momentum input taken from the {\\small STARBURST99} stellar evolution models using a Kroupa IMF. \nThe first $\\sim3 \\times 10^6$ years are characterized by nearly constant feedback levels dominated by radiation pressure from young stars.\nThe direct momentum injections levels begin to evolve only after massive stars begin moving off the main sequence which leads to a continual decrease in the direct radiation pressure momentum injection and an increase in the supernova momentum injection.  \nWe note that the momentum injection values shown are direct momentum injection values and do not account \nfor any gains owing to trapping of photons (i.e. multiple scattering events), gains from pressure confinement of hot gas (the ``b\" factor, as defined in Equation~\\ref{eqn:new_pstar}), or losses owing to inefficient coupling.\nWe note that the boost to the direct momentum injection is likely modest for radiation pressure owing to radiation hydro instabilities, but can provide an order of magnitude increase in the supernova contribution to the total momentum injection.}\n\\label{fig:sb99}\n\\end{figure}\n\n\nFigure~\\ref{fig:sb99} shows the direct momentum injection budget associated with a single age stellar population as a function of time since birth taken directly from {\\small STARBURST99}~\\citep{SB99_3}.\nRadiation pressure dominates the early stellar feedback budget until the death of the most massive stars ($\\sim$3 Myr) and drops to $\\sim$10\\% of its initial value by $\\sim$10 Myr.\nSupernovae dominate the direct momentum injection budget starting at $\\sim$3 Myr and continue to dominate until the time after which the least massive stars that die in supernovae move off the main sequence ($\\sim$40 Myr)\\footnote{For a Kroupa IMF with $M=8M_\\odot$ assumed to be the lower mass limit for supernova progenitors.}.\nFrom Figure~\\ref{fig:sb99}, the total momentum injection rate remains nearly constant until $\\sim$3 Myr, and remains variable but order-of-magnitude constant until $\\sim$40 Myr.\nThe constant early momentum injection rates allow us to define an interesting regime:  regions of galaxies that possess dynamical times less than the timescale over which stellar feedback levels adjust.\nIn these regimes, feedback can not efficiently adjust to changes in the gas distribution and/or the current star formation rate.\nIn this paper we focus on the nuclear regions of galaxies where the small spatial scales and central black hole ensure consistently short dynamical times.\n\nThe understanding of star formation in galactic nuclei that we present in this paper will set the stage for follow up studies focused on the accretion, growth, and feedback associated with supermassive black holes.\nPrevious studies have considered the impact of stellar and black hole feedback in concert on the central $\\sim$100 pc nuclear disk~\\citep[e.g.,][]{Hopkins2015}.\nHowever, those studies lacked the large-scale galactic disk that is important for understanding the long term behavior of supermassive black hole accretion and feedback.\n\n\nThe structure of this paper is as follows:\nIn Section~\\ref{sec:AA} we review the basic components of equilibrium feedback models.\nThis allows us to concretely explore the assumptions that break down for the equilibrium model at short dynamical times.\nWe propose alterations to the equilibrium feedback models that hold within short dynamical time regions and conclude that star formation within short dynamical time regions is likely to be inherently bursty.\nIn Section~\\ref{sec:Simulations} we describe the numerical simulations that we use to explore the properties of nuclear star formation.\nIn Section~\\ref{sec:Results} we present the results of our numerical simulations, with a focus on the bursty nature of nuclear star formation and implications for observations of the KS relation.\nIn Section~\\ref{sec:Discussion} we present a discussion of our results with implications for observations of nuclear stellar disks as well as the observed KS relation.\nIn Section~\\ref{sec:Conclusions} we summarize and conclude.\n\n\n\n\n\\section{Analytic Arguments}\n\\label{sec:AA}\n\\subsection{The Equilibrium Model}\nAnalytic models have been developed to explain the efficiency of star formation and form of the KS law.  \nIn global equilibrium models the star formation efficiency is derived by asserting that turbulent energy injection from young stellar populations balances the turbulent energy dissipation rate.\nOne of the first models to do this was~\\citet{Thompson2005}, where they examined radiation and mechanical feedback from young stellar populations with a focus on the central 100 pc of a starburst disk.\nWe adopt a similar setup here, which includes an isothermal spherical potential -- which could represent either a halo or bulge component.\nThe projected surface density follows a power law $\\Sigma_{\\rm tot} = \\sigma^2 / \\pi G r $\nwhere $\\sigma$ is the velocity dispersion of the potential.  \nThe mass profile is given by $M_{\\rm tot} = 2 \\sigma^2 r /G $, with an angular frequency of $\\Omega = \\sqrt{2} \\sigma / r$ set to enforce radial centrifugal balance.\nThe specified gas fraction is $f_{\\rm g} = M_{\\rm g}/M_{ {\\rm tot} } =  \\Sigma_{\\rm g}/\\Sigma_{ {\\rm tot} }$.\nFor such a model the disk mid plane pressure required to balance gravity can be approximated by\n\n", "index": 1, "text": "\\begin{equation}\np \\approx \\rho_{\\rm g} h^2 \\Omega^2.\n\\label{eqn:mid_plane_pressure}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"p\\approx\\rho_{\\rm g}h^{2}\\Omega^{2}.\" display=\"block\"><mrow><mrow><mi>p</mi><mo>≈</mo><mrow><msub><mi>ρ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><msup><mi>h</mi><mn>2</mn></msup><mo>⁢</mo><msup><mi mathvariant=\"normal\">Ω</mi><mn>2</mn></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nUnder the assumption that the system approaches an equilibrium, this energy dissipation rate needs to be balanced by feedback from young stars.\nThere are several possible ways to write down the feedback injection rate.  \nHere, we express the energy injection rate from young stars as \n\n", "itemtype": "equation", "pos": 13206, "prevtext": "\nwhere $h$ is the disk scale height and $\\rho_{\\rm g}$ is the gas density.\nWe then assume that supersonic turbulent pressure is the primary source of pressure support in the disk with turbulent gas velocity dispersion $c_t$, in which case the rate of (volumetric) turbulent energy dissipation is\n\n", "index": 3, "text": "\\begin{equation}\n\\dot u  \\approx \\rho_{\\rm g}  c_t^2 \\Omega.\n\\label{eqn:udot_diss}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\dot{u}\\approx\\rho_{\\rm g}c_{t}^{2}\\Omega.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>u</mi><mo>˙</mo></mover><mo>≈</mo><mrow><msub><mi>ρ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><msubsup><mi>c</mi><mi>t</mi><mn>2</mn></msubsup><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nThe second equality follows from expressing the turbulent pressure produced by stellar feedback as\n\n", "itemtype": "equation", "pos": 13589, "prevtext": "\nUnder the assumption that the system approaches an equilibrium, this energy dissipation rate needs to be balanced by feedback from young stars.\nThere are several possible ways to write down the feedback injection rate.  \nHere, we express the energy injection rate from young stars as \n\n", "index": 5, "text": "\\begin{equation}\n\\dot u \\approx \\frac{p_* c_t}{h} = \\frac{ f_p P_*/m_* \\dot \\Sigma_* c_t }{ 4 h}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\dot{u}\\approx\\frac{p_{*}c_{t}}{h}=\\frac{f_{p}P_{*}/m_{*}\\dot{\\Sigma}_{*}c_{t}%&#10;}{4h}.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>u</mi><mo>˙</mo></mover><mo>≈</mo><mfrac><mrow><msub><mi>p</mi><mo>*</mo></msub><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub></mrow><mi>h</mi></mfrac><mo>=</mo><mfrac><mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>P</mi><mo>*</mo></msub></mrow><mo>/</mo><msub><mi>m</mi><mo>*</mo></msub></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Σ</mi><mo>˙</mo></mover><mo>*</mo></msub><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>h</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nwhere $P_*/m_*$ is the radial momentum injected per unit stellar mass formed~\\citep{Ostriker2011, FaucherGiguere2013} and $f_p$ parameterizes the efficiency with which the radial momentum drives turbulent energy injection, but is of likely of order unity~\\citep{Ostriker2011}. \nAdopting the above expression of the young star pressure/turbulent energy injection rate does not require any assumptions about the origin of the momentum input, and can accommodate multiple momentum input sources (e.g., radiation pressure, supernovae, stellar winds, etc.).\nFor SNe, typical values for $P_*/m_*$ are of order $\\sim 3000$ km s${}^{-1}$~\\citep[see][for additional details]{Ostriker2011}. \n\n\nEnforcing pressure balance between the self gravity of the disk and turbulent pressure (i.e. between Equations~\\ref{eqn:mid_plane_pressure} and~\\ref{eqn:sfr_pressure}) we find the feedback self-regulated equilibrium condition \n\n", "itemtype": "equation", "pos": 13801, "prevtext": "\nThe second equality follows from expressing the turbulent pressure produced by stellar feedback as\n\n", "index": 7, "text": "\\begin{equation}\np_* = f_p \\frac{P_*}{4 m_*} \\dot \\Sigma_*\n\\label{eqn:sfr_pressure}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"p_{*}=f_{p}\\frac{P_{*}}{4m_{*}}\\dot{\\Sigma}_{*}\" display=\"block\"><mrow><msub><mi>p</mi><mo>*</mo></msub><mo>=</mo><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><mfrac><msub><mi>P</mi><mo>*</mo></msub><mrow><mn>4</mn><mo>⁢</mo><msub><mi>m</mi><mo>*</mo></msub></mrow></mfrac><mo>⁢</mo><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Σ</mi><mo>˙</mo></mover><mo>*</mo></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nUsing $c_t = h \\Omega$ and $ \\Sigma_{\\rm g}=2 h \\rho_{\\rm g}$, this can be rearranged in terms of the equilibrium star formation rate surface density\n\n", "itemtype": "equation", "pos": 14811, "prevtext": "\nwhere $P_*/m_*$ is the radial momentum injected per unit stellar mass formed~\\citep{Ostriker2011, FaucherGiguere2013} and $f_p$ parameterizes the efficiency with which the radial momentum drives turbulent energy injection, but is of likely of order unity~\\citep{Ostriker2011}. \nAdopting the above expression of the young star pressure/turbulent energy injection rate does not require any assumptions about the origin of the momentum input, and can accommodate multiple momentum input sources (e.g., radiation pressure, supernovae, stellar winds, etc.).\nFor SNe, typical values for $P_*/m_*$ are of order $\\sim 3000$ km s${}^{-1}$~\\citep[see][for additional details]{Ostriker2011}. \n\n\nEnforcing pressure balance between the self gravity of the disk and turbulent pressure (i.e. between Equations~\\ref{eqn:mid_plane_pressure} and~\\ref{eqn:sfr_pressure}) we find the feedback self-regulated equilibrium condition \n\n", "index": 9, "text": "\\begin{equation}\n\\rho_{\\rm g}  c_t ^2  \\approx  \\frac{ f_p P_*/m_*\\dot \\Sigma_*  }{ 4  }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\rho_{\\rm g}c_{t}^{2}\\approx\\frac{f_{p}P_{*}/m_{*}\\dot{\\Sigma}_{*}}{4}.\" display=\"block\"><mrow><mrow><mrow><msub><mi>ρ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><msubsup><mi>c</mi><mi>t</mi><mn>2</mn></msubsup></mrow><mo>≈</mo><mfrac><mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>P</mi><mo>*</mo></msub></mrow><mo>/</mo><msub><mi>m</mi><mo>*</mo></msub></mrow><mo>⁢</mo><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Σ</mi><mo>˙</mo></mover><mo>*</mo></msub></mrow><mn>4</mn></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nwhere $\\eta = 2 c_t  /   f_p (P_*/m_*)  $ is an efficiency that describes the fraction of gas that can convert into stars in a dynamical time.\nThis expression shows that the galactic star formation efficiency is directly related to the gas turbulent velocity dispersion in the disk.\n\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=0.333\\textwidth]{./initial_m_enc.pdf}\n\\includegraphics[width=0.333\\textwidth]{./initial_disk_vel.pdf}\n\\includegraphics[width=0.333\\textwidth]{./initial_disk_dyntime.pdf}\n}}}\n\\caption{The mass enclosed (left), rotational velocity (center), and dynamical time (right) are shown as a function of radius for the D1 (low mass) initial disk.  The black hole's dynamical relevance at scales $r{\\lesssim}$10-30 parsecs can be identified from any of the plots.   The horizontal lines in the dynamical time plot indicate 3 and 40 Myr.  Dynamical times are calculated using the enclosed mass profiles to determine the circular velocities.}\n\\label{fig:ICprofiles}\n\\end{figure*}\n\n\\subsection{Where the equilibrium models break down}\nThe equilibrium model as described above breaks down in two regimes.\n\n\\subsubsection{Equilibrium Breakdown from Short Dynamical Times}\nThe equilibrium model breaks down when feedback is unable to modulate its strength on sufficiently short timescales (i.e. the gas dynamical timescale).\nFeedback levels are set by young stellar populations, which evolve based on the rate at which massive stars evolve.\nHere, we are specifically concerned with the timescale over which radiation pressure and energy/momentum injection from supernovae decline as an initially young stellar population ages.\nRadiation pressure begins to drop when a stellar population is just $\\sim 3$ Myr old while supernova inject significant momentum until $\\sim 40$ Myr (Figure~\\ref{fig:sb99}).\nBoth of these feedback mechanisms have fallen to a small fraction ($\\sim0.01$) of their initial value by the time a stellar population is $\\sim100$ Myr old.\nIn regimes where the dynamical time is much shorter than the stellar evolution time (i.e. $\\tau_{{\\rm SE}} \\sim 10^6-10^7$ years; see Figure~\\ref{fig:sb99})\\footnote{In what follows, our analysis does not require that we identify a specific value of $\\tau_{{\\rm SE}}$.}, \nfeedback will not react sufficiently quickly to changes in the current gas density or star formation rate, but rather remain strong for a stellar evolution timescale.\n\nFor the one zone model used in this section, the dynamical time is\n\n", "itemtype": "equation", "pos": 15066, "prevtext": "\nUsing $c_t = h \\Omega$ and $ \\Sigma_{\\rm g}=2 h \\rho_{\\rm g}$, this can be rearranged in terms of the equilibrium star formation rate surface density\n\n", "index": 11, "text": "\\begin{equation}\n\\dot \\Sigma_* \\approx  \\eta \\Sigma_{\\rm g} \\Omega = \\Sigma_{\\rm g} \\Omega \\frac{ 2 c_t     }{  f_p P_*/m_*  }\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\dot{\\Sigma}_{*}\\approx\\eta\\Sigma_{\\rm g}\\Omega=\\Sigma_{\\rm g}\\Omega\\frac{2c_{%&#10;t}}{f_{p}P_{*}/m_{*}}\" display=\"block\"><mrow><msub><mover accent=\"true\"><mi mathvariant=\"normal\">Σ</mi><mo>˙</mo></mover><mo>*</mo></msub><mo>≈</mo><mrow><mi>η</mi><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mo>=</mo><mrow><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>P</mi><mo>*</mo></msub></mrow><mo>/</mo><msub><mi>m</mi><mo>*</mo></msub></mrow></mfrac></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nComparing this with a stellar evolution timescale $\\tau_{{\\rm SE}}$ we find that the dynamical time will be much shorter than the stellar evolution time ($\\tau_{{\\rm dyn}} \\ll \\tau_{{\\rm SE}}$) when\n\n", "itemtype": "equation", "pos": 17704, "prevtext": "\nwhere $\\eta = 2 c_t  /   f_p (P_*/m_*)  $ is an efficiency that describes the fraction of gas that can convert into stars in a dynamical time.\nThis expression shows that the galactic star formation efficiency is directly related to the gas turbulent velocity dispersion in the disk.\n\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=0.333\\textwidth]{./initial_m_enc.pdf}\n\\includegraphics[width=0.333\\textwidth]{./initial_disk_vel.pdf}\n\\includegraphics[width=0.333\\textwidth]{./initial_disk_dyntime.pdf}\n}}}\n\\caption{The mass enclosed (left), rotational velocity (center), and dynamical time (right) are shown as a function of radius for the D1 (low mass) initial disk.  The black hole's dynamical relevance at scales $r{\\lesssim}$10-30 parsecs can be identified from any of the plots.   The horizontal lines in the dynamical time plot indicate 3 and 40 Myr.  Dynamical times are calculated using the enclosed mass profiles to determine the circular velocities.}\n\\label{fig:ICprofiles}\n\\end{figure*}\n\n\\subsection{Where the equilibrium models break down}\nThe equilibrium model as described above breaks down in two regimes.\n\n\\subsubsection{Equilibrium Breakdown from Short Dynamical Times}\nThe equilibrium model breaks down when feedback is unable to modulate its strength on sufficiently short timescales (i.e. the gas dynamical timescale).\nFeedback levels are set by young stellar populations, which evolve based on the rate at which massive stars evolve.\nHere, we are specifically concerned with the timescale over which radiation pressure and energy/momentum injection from supernovae decline as an initially young stellar population ages.\nRadiation pressure begins to drop when a stellar population is just $\\sim 3$ Myr old while supernova inject significant momentum until $\\sim 40$ Myr (Figure~\\ref{fig:sb99}).\nBoth of these feedback mechanisms have fallen to a small fraction ($\\sim0.01$) of their initial value by the time a stellar population is $\\sim100$ Myr old.\nIn regimes where the dynamical time is much shorter than the stellar evolution time (i.e. $\\tau_{{\\rm SE}} \\sim 10^6-10^7$ years; see Figure~\\ref{fig:sb99})\\footnote{In what follows, our analysis does not require that we identify a specific value of $\\tau_{{\\rm SE}}$.}, \nfeedback will not react sufficiently quickly to changes in the current gas density or star formation rate, but rather remain strong for a stellar evolution timescale.\n\nFor the one zone model used in this section, the dynamical time is\n\n", "index": 13, "text": "\\begin{equation}\n\\tau_{{\\rm dyn}} = \\frac{\\sqrt{2} \\pi r }{\\sigma} \\sim 10^6 {\\rm yr}  \\left( \\frac{r}{100 {\\rm pc} }  \\right) \\left(  \\frac{\\sigma}{200 {\\rm km/s} }   \\right)^{-1}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\tau_{{\\rm dyn}}=\\frac{\\sqrt{2}\\pi r}{\\sigma}\\sim 10^{6}{\\rm yr}\\left(\\frac{r}%&#10;{100{\\rm pc}}\\right)\\left(\\frac{\\sigma}{200{\\rm km/s}}\\right)^{-1}.\" display=\"block\"><mrow><mrow><msub><mi>τ</mi><mi>dyn</mi></msub><mo>=</mo><mfrac><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mi>r</mi></mrow><mi>σ</mi></mfrac><mo>∼</mo><mrow><msup><mn>10</mn><mn>6</mn></msup><mo>⁢</mo><mi>yr</mi><mo>⁢</mo><mrow><mo>(</mo><mfrac><mi>r</mi><mrow><mn>100</mn><mo>⁢</mo><mi mathvariant=\"normal\">p</mi><mo>⁢</mo><mi mathvariant=\"normal\">c</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>σ</mi><mrow><mrow><mn>200</mn><mo>⁢</mo><mi mathvariant=\"normal\">k</mi><mo>⁢</mo><mi mathvariant=\"normal\">m</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">s</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mo>-</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nWhen this condition is met, massive stars contributing significantly to SNe and radiation pressure live longer than the gas dynamical time and thus feedback from young stars will persist for several dynamical times.\nFor reasonable $\\tau_{{\\rm SE}}$ values (e.g. $\\sim10$ Myr) the dynamical time can be much shorter than $\\tau_{{\\rm SE}}$ out to a significant fraction of the central $1$ kpc.\nIf the feedback from young stars exceeds gravity within this region, \nthen the system becomes unstable/unbound and remains in that state for several dynamical times until the young stars responsible for feedback move off the main sequence.\n\nTo explore this regime, we define the convenient quantity $a_*(t)=\\dot P / m_*$, which has units of acceleration. \nThis quantity is plotted in Figure 1 as a function of time. \nWe can express the turbulent pressure provided by young stars as\n\n", "itemtype": "equation", "pos": 18100, "prevtext": "\nComparing this with a stellar evolution timescale $\\tau_{{\\rm SE}}$ we find that the dynamical time will be much shorter than the stellar evolution time ($\\tau_{{\\rm dyn}} \\ll \\tau_{{\\rm SE}}$) when\n\n", "index": 15, "text": "\\begin{equation}\nr   \\ll 1  {\\rm kpc}  \\left(  \\frac{\\tau_{{\\rm SE}}}{10 {\\rm Myr}}    \\right) \\left(  \\frac{\\sigma}{200 {\\rm km/s} }   \\right).\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"r\\ll 1{\\rm kpc}\\left(\\frac{\\tau_{{\\rm SE}}}{10{\\rm Myr}}\\right)\\left(\\frac{%&#10;\\sigma}{200{\\rm km/s}}\\right).\" display=\"block\"><mrow><mrow><mi>r</mi><mo>≪</mo><mrow><mn>1</mn><mo>⁢</mo><mi mathvariant=\"normal\">k</mi><mo>⁢</mo><mi mathvariant=\"normal\">p</mi><mo>⁢</mo><mi mathvariant=\"normal\">c</mi><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi>τ</mi><mi>SE</mi></msub><mrow><mn>10</mn><mo>⁢</mo><mi mathvariant=\"normal\">M</mi><mo>⁢</mo><mi mathvariant=\"normal\">y</mi><mo>⁢</mo><mi mathvariant=\"normal\">r</mi></mrow></mfrac><mo>)</mo></mrow><mo>⁢</mo><mrow><mo>(</mo><mfrac><mi>σ</mi><mrow><mrow><mn>200</mn><mo>⁢</mo><mi mathvariant=\"normal\">k</mi><mo>⁢</mo><mi mathvariant=\"normal\">m</mi></mrow><mo>/</mo><mi mathvariant=\"normal\">s</mi></mrow></mfrac><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nwhere  $\\Sigma_{*,y}$ is the surface density of ``young stars\" which dominate the stellar feedback budget.  \nThroughout, we adopt a definition of young stars as being those stars with ages less than 40 Myrs.  \nThe quantity $b$ accounts for the increase in the momentum provided by stars via trapping of IR photons~\\citep{Thompson2005} or by SN acquired during the Sedov-Taylor phase~\\citep[e.g.,][]{Cioffi1988, Martizzi2015, Gatto2015, Kim2015}. \nThe total momentum injection per unit stellar mass ($P_*/m_*$, used in the previous subsection) is related to $a_*(t)$ via\n\n", "itemtype": "equation", "pos": 19134, "prevtext": "\nWhen this condition is met, massive stars contributing significantly to SNe and radiation pressure live longer than the gas dynamical time and thus feedback from young stars will persist for several dynamical times.\nFor reasonable $\\tau_{{\\rm SE}}$ values (e.g. $\\sim10$ Myr) the dynamical time can be much shorter than $\\tau_{{\\rm SE}}$ out to a significant fraction of the central $1$ kpc.\nIf the feedback from young stars exceeds gravity within this region, \nthen the system becomes unstable/unbound and remains in that state for several dynamical times until the young stars responsible for feedback move off the main sequence.\n\nTo explore this regime, we define the convenient quantity $a_*(t)=\\dot P / m_*$, which has units of acceleration. \nThis quantity is plotted in Figure 1 as a function of time. \nWe can express the turbulent pressure provided by young stars as\n\n", "index": 17, "text": "\\begin{equation}\np_{*,y} = \\Sigma_{*,y} a_*(t) \\cdot b f_p/4,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"p_{*,y}=\\Sigma_{*,y}a_{*}(t)\\cdot bf_{p}/4,\" display=\"block\"><mrow><mrow><msub><mi>p</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub><mo>=</mo><mrow><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow><mo>⁢</mo><msub><mi>f</mi><mi>p</mi></msub></mrow><mo>/</mo><mn>4</mn></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nwhere the boost factor $b$ is folded into the total momentum injection.\nSetting the turbulent pressure from young stars equal to the mid-plane pressure given by equation (\\ref{eqn:mid_plane_pressure}), we find the critical surface density of stars\n\n", "itemtype": "equation", "pos": 19781, "prevtext": "\nwhere  $\\Sigma_{*,y}$ is the surface density of ``young stars\" which dominate the stellar feedback budget.  \nThroughout, we adopt a definition of young stars as being those stars with ages less than 40 Myrs.  \nThe quantity $b$ accounts for the increase in the momentum provided by stars via trapping of IR photons~\\citep{Thompson2005} or by SN acquired during the Sedov-Taylor phase~\\citep[e.g.,][]{Cioffi1988, Martizzi2015, Gatto2015, Kim2015}. \nThe total momentum injection per unit stellar mass ($P_*/m_*$, used in the previous subsection) is related to $a_*(t)$ via\n\n", "index": 19, "text": "\\begin{equation}\n\\label{eqn:new_pstar}\nP_*/m_* = \\int_0 ^\\infty a_*(t) \\cdot b \\; dt\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"P_{*}/m_{*}=\\int_{0}^{\\infty}a_{*}(t)\\cdot b\\;dt\" display=\"block\"><mrow><mrow><msub><mi>P</mi><mo>*</mo></msub><mo>/</mo><msub><mi>m</mi><mo>*</mo></msub></mrow><mo>=</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><mrow><mrow><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mpadded width=\"+2.8pt\"><mi>b</mi></mpadded></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>t</mi></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nThis result is similar to the argument in~\\citet{Fall2010} and~\\citet{Murray2010} for when individual star clusters disperse giant molecular clouds, \nbut now we apply it to a galaxy nucleus which is allowed to have many {\\it independent} self-gravitating clouds.\n\n\nWe briefly note that the same critical condition can be derived by considering the energy -- rather than pressure -- balance.\nSpecifically, expressing the turbulent energy injection rate as\n\n", "itemtype": "equation", "pos": 20129, "prevtext": "\nwhere the boost factor $b$ is folded into the total momentum injection.\nSetting the turbulent pressure from young stars equal to the mid-plane pressure given by equation (\\ref{eqn:mid_plane_pressure}), we find the critical surface density of stars\n\n", "index": 21, "text": "\\begin{equation}\n\\Sigma_{*,y}^{\\rm crit} \\approx \\frac{2 \\Sigma_g c_t \\Omega }{f_p a_*(t)\\cdot b } = \\frac{ \\pi G Q \\Sigma_g ^2 }{ f_p a_*(t)\\cdot b } .\n\\label{eqn:NewFeedbackEquilibrium}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\Sigma_{*,y}^{\\rm crit}\\approx\\frac{2\\Sigma_{g}c_{t}\\Omega}{f_{p}a_{*}(t)\\cdot&#10;b%&#10;}=\\frac{\\pi GQ\\Sigma_{g}^{2}}{f_{p}a_{*}(t)\\cdot b}.\" display=\"block\"><mrow><mrow><msubsup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow><mi>crit</mi></msubsup><mo>≈</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>g</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac><mo>=</mo><mfrac><mrow><mi>π</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><msubsup><mi mathvariant=\"normal\">Σ</mi><mi>g</mi><mn>2</mn></msubsup></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nand equating this with the turbulent energy dissipation rate given in eqn.~\\ref{eqn:udot_diss} yields the same critical surface density of young stars.\nThis equivalence is built into the model with the assumption that the disk mid-plane pressure is related directly to the turbulent energy injection and dissipation rates.\n\nDefining the young stellar fraction as\n\n", "itemtype": "equation", "pos": 20787, "prevtext": "\nThis result is similar to the argument in~\\citet{Fall2010} and~\\citet{Murray2010} for when individual star clusters disperse giant molecular clouds, \nbut now we apply it to a galaxy nucleus which is allowed to have many {\\it independent} self-gravitating clouds.\n\n\nWe briefly note that the same critical condition can be derived by considering the energy -- rather than pressure -- balance.\nSpecifically, expressing the turbulent energy injection rate as\n\n", "index": 23, "text": "\\begin{equation}\n\\dot u \\sim \\frac{p_{*,y} c_t}{h} = \\frac{ f_p a_*(t) \\cdot b c_t \\Sigma_{*,y} }{4   h }.\n\\label{eqn:NewFeedbackRate}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\dot{u}\\sim\\frac{p_{*,y}c_{t}}{h}=\\frac{f_{p}a_{*}(t)\\cdot bc_{t}\\Sigma_{*,y}}%&#10;{4h}.\" display=\"block\"><mrow><mrow><mover accent=\"true\"><mi>u</mi><mo>˙</mo></mover><mo>∼</mo><mfrac><mrow><msub><mi>p</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub></mrow><mi>h</mi></mfrac><mo>=</mo><mfrac><mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>h</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nwe can write down the critical young stellar fraction or critical young star surface density in terms of the total surface density\n\n", "itemtype": "equation", "pos": 21300, "prevtext": "\nand equating this with the turbulent energy dissipation rate given in eqn.~\\ref{eqn:udot_diss} yields the same critical surface density of young stars.\nThis equivalence is built into the model with the assumption that the disk mid-plane pressure is related directly to the turbulent energy injection and dissipation rates.\n\nDefining the young stellar fraction as\n\n", "index": 25, "text": "\\begin{equation}\nf_{*,y} \\equiv \\frac{ \\Sigma_{*,y}  }{ \\Sigma_{ {\\rm tot} } }  \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"f_{*,y}\\equiv\\frac{\\Sigma_{*,y}}{\\Sigma_{{\\rm tot}}}\" display=\"block\"><mrow><msub><mi>f</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub><mo>≡</mo><mfrac><msub><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow></msub><msub><mi mathvariant=\"normal\">Σ</mi><mi>tot</mi></msub></mfrac></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nIf we assume a boost factor of $b=20$ and $a_*(t) = 1000 L_\\odot / c M_\\odot$ \nthis reduces to\n\n", "itemtype": "equation", "pos": 21527, "prevtext": "\nwe can write down the critical young stellar fraction or critical young star surface density in terms of the total surface density\n\n", "index": 27, "text": "\\begin{equation}\nf_{*,y}^{\\rm crit} \\equiv \\frac{ \\Sigma_{*,y}^{{\\rm crit}}  }{ \\Sigma_{ {\\rm tot} } }   \\sim  \\frac{2 f_{\\rm g} c_t \\Omega   }{ f_p a_*(t)\\cdot b }  \\sim  \\frac{ \\pi G  Q f_g \\Sigma_g  }{ f_p a_*(t)\\cdot b}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"f_{*,y}^{\\rm crit}\\equiv\\frac{\\Sigma_{*,y}^{{\\rm crit}}}{\\Sigma_{{\\rm tot}}}%&#10;\\sim\\frac{2f_{\\rm g}c_{t}\\Omega}{f_{p}a_{*}(t)\\cdot b}\\sim\\frac{\\pi GQf_{g}%&#10;\\Sigma_{g}}{f_{p}a_{*}(t)\\cdot b}.\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow><mi>crit</mi></msubsup><mo>≡</mo><mfrac><msubsup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow><mi>crit</mi></msubsup><msub><mi mathvariant=\"normal\">Σ</mi><mi>tot</mi></msub></mfrac><mo>∼</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi>f</mi><mi mathvariant=\"normal\">g</mi></msub><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac><mo>∼</mo><mfrac><mrow><mi>π</mi><mo>⁢</mo><mi>G</mi><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><msub><mi>f</mi><mi>g</mi></msub><mo>⁢</mo><msub><mi mathvariant=\"normal\">Σ</mi><mi>g</mi></msub></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nIf this critical surface density of young stars is exactly maintained, feedback driven turbulence and disk self-gravity will be in equilibrium.\nHowever, it follows that overshooting this critical young stellar surface density will lead to outflows, which will lower the system's gas fraction, and lead to a runaway outflow condition {\\it that will persist for several local dynamical times}.\\footnote{We caution that outflows can occur throughout our simulated disks even when this condition is not met.  The condition here will result in a strong, nearly complete, depletion of the local central gas reservoir whereas a steady level of gas outflow can be present elsewhere in the disk even when this condition is not met.}\nFor this reason, we argue that the critical surface density of young stars is an unstable critical point which will likely lead to a full shut down of star formation with the system going into an outflow state for a stellar evolution feedback timescale.  \n\nAfter the young stellar populations have aged and their feedback levels have been reduced, gas will return to the nuclear region.\nGravitational torquing of gas via asymmetric disk potential features can drive gas mass influx rates of order $\\dot M \\sim -\\left|a\\right|^\\beta \\Sigma_{{\\rm g}} R ^2 \\Omega$\nwhere $\\left|a\\right|$ is the asymmetric disk mode strength and $\\beta=1-2$ depending on whether we are in the linear or non-linear torquing regime~\\citep[see][for more details]{Hopkins2011c}.\nThis can repopulate the central gas reservoir within a few dynamical times, which will allow for a repetition of the central gas blowout cycle.\n\nThis result stands in contrast to the ``self-regulating\" feedback balance that applies to most of the disk.  \nThe key difference is whether or not feedback driven turbulent pressure adjusts rapidly or slowly compared to the local dynamical time.\nTypical galactic dynamical times at $\\sim$kpc distances are of order $\\sim100$Myrs (i.e. longer than the timescale over which stellar feedback evolves).\nUpward perturbations to the SFR do not lead to blow-out under normal `equilibrium' conditions because stars die on timescales much shorter than the local dynamical time.\nWhere this is the case, there is not enough time for minor SFR perturbations to affect the galaxy dynamics. \n\n\n\\subsubsection{Equilibrium Breakdown from Insufficient Feedback}\nExpressing the critical young star surface density as a fraction of the gas mass yields\n\n", "itemtype": "equation", "pos": 21862, "prevtext": "\nIf we assume a boost factor of $b=20$ and $a_*(t) = 1000 L_\\odot / c M_\\odot$ \nthis reduces to\n\n", "index": 29, "text": "\\begin{equation}\nf_{*,y}^{\\rm crit}  \\approx 1.5 \\times 10^{-2} f_g Q \\left( \\frac{\\Sigma _g}{10^3 M_\\odot \\mathrm{pc}^{-2}} \\right) .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"f_{*,y}^{\\rm crit}\\approx 1.5\\times 10^{-2}f_{g}Q\\left(\\frac{\\Sigma_{g}}{10^{3%&#10;}M_{\\odot}\\mathrm{pc}^{-2}}\\right).\" display=\"block\"><mrow><mrow><msubsup><mi>f</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow><mi>crit</mi></msubsup><mo>≈</mo><mrow><mrow><mn>1.5</mn><mo>×</mo><msup><mn>10</mn><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow><mo>⁢</mo><msub><mi>f</mi><mi>g</mi></msub><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><mrow><mo>(</mo><mfrac><msub><mi mathvariant=\"normal\">Σ</mi><mi>g</mi></msub><mrow><msup><mn>10</mn><mn>3</mn></msup><mo>⁢</mo><msub><mi>M</mi><mo>⊙</mo></msub><mo>⁢</mo><msup><mi>pc</mi><mrow><mo>-</mo><mn>2</mn></mrow></msup></mrow></mfrac><mo>)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nAn interesting limit is found by considering when the fraction of gas that must be turned into stars in order to achieve feedback balance is of order unity\n(i.e. $ \\Sigma_{*,y}^{{\\rm crit}} / \\Sigma_{\\rm g}  \\sim 1 $).  \nThis limit occurs for\n\n", "itemtype": "equation", "pos": 24469, "prevtext": "\nIf this critical surface density of young stars is exactly maintained, feedback driven turbulence and disk self-gravity will be in equilibrium.\nHowever, it follows that overshooting this critical young stellar surface density will lead to outflows, which will lower the system's gas fraction, and lead to a runaway outflow condition {\\it that will persist for several local dynamical times}.\\footnote{We caution that outflows can occur throughout our simulated disks even when this condition is not met.  The condition here will result in a strong, nearly complete, depletion of the local central gas reservoir whereas a steady level of gas outflow can be present elsewhere in the disk even when this condition is not met.}\nFor this reason, we argue that the critical surface density of young stars is an unstable critical point which will likely lead to a full shut down of star formation with the system going into an outflow state for a stellar evolution feedback timescale.  \n\nAfter the young stellar populations have aged and their feedback levels have been reduced, gas will return to the nuclear region.\nGravitational torquing of gas via asymmetric disk potential features can drive gas mass influx rates of order $\\dot M \\sim -\\left|a\\right|^\\beta \\Sigma_{{\\rm g}} R ^2 \\Omega$\nwhere $\\left|a\\right|$ is the asymmetric disk mode strength and $\\beta=1-2$ depending on whether we are in the linear or non-linear torquing regime~\\citep[see][for more details]{Hopkins2011c}.\nThis can repopulate the central gas reservoir within a few dynamical times, which will allow for a repetition of the central gas blowout cycle.\n\nThis result stands in contrast to the ``self-regulating\" feedback balance that applies to most of the disk.  \nThe key difference is whether or not feedback driven turbulent pressure adjusts rapidly or slowly compared to the local dynamical time.\nTypical galactic dynamical times at $\\sim$kpc distances are of order $\\sim100$Myrs (i.e. longer than the timescale over which stellar feedback evolves).\nUpward perturbations to the SFR do not lead to blow-out under normal `equilibrium' conditions because stars die on timescales much shorter than the local dynamical time.\nWhere this is the case, there is not enough time for minor SFR perturbations to affect the galaxy dynamics. \n\n\n\\subsubsection{Equilibrium Breakdown from Insufficient Feedback}\nExpressing the critical young star surface density as a fraction of the gas mass yields\n\n", "index": 31, "text": "\\begin{equation}\n\\frac{ \\Sigma_{*,y}^{{\\rm crit}} }{ \\Sigma_{\\rm g}  }  = \\frac{ 2 c_t \\Omega    }{  f_p a_*(t)\\cdot b} =   \\Omega \\frac{ Q \\sigma f_g   }{   \\sqrt{2} f_p a_*(t)\\cdot b  }.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\frac{\\Sigma_{*,y}^{{\\rm crit}}}{\\Sigma_{\\rm g}}=\\frac{2c_{t}\\Omega}{f_{p}a_{*%&#10;}(t)\\cdot b}=\\Omega\\frac{Q\\sigma f_{g}}{\\sqrt{2}f_{p}a_{*}(t)\\cdot b}.\" display=\"block\"><mrow><mrow><mfrac><msubsup><mi mathvariant=\"normal\">Σ</mi><mrow><mo>*</mo><mo>,</mo><mi>y</mi></mrow><mi>crit</mi></msubsup><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub></mfrac><mo>=</mo><mfrac><mrow><mn>2</mn><mo>⁢</mo><msub><mi>c</mi><mi>t</mi></msub><mo>⁢</mo><mi mathvariant=\"normal\">Ω</mi></mrow><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac><mo>=</mo><mrow><mi mathvariant=\"normal\">Ω</mi><mo>⁢</mo><mfrac><mrow><mi>Q</mi><mo>⁢</mo><mi>σ</mi><mo>⁢</mo><msub><mi>f</mi><mi>g</mi></msub></mrow><mrow><mrow><msqrt><mn>2</mn></msqrt><mo>⁢</mo><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow></mfrac></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.07186.tex", "nexttext": "\nfor $b=20$ and $a_*(t)= 1000 L_\\odot / c M_\\odot$.\nAt this gas surface density, feedback can efficiently oppose gas collapse only by converting an order unity fraction of the gas mass into stars.\nThis critical surface density value approximately corresponds to the maximum observed stellar surface density in a wide range of dense stellar systems~\\citep{Hopkins2010b} and \nrepresents a feedback failure mode that will be explored in more detail in a forthcoming paper (Grudic et al., in prep).\n\n\n\n\n\n \n\n\n\\section{Numerical Methods}\n\\label{sec:Simulations}\nWe investigate the galactic nuclear burst/quench cycles described above using numerical simulations.\n\n\\subsection{Simulation Code}\nThe simulations presented in this paper were performed using the N-body \nhydrodynamics code {\\small GIZMO}~\\citep{GIZMO}.  {\\small GIZMO} \nis originally derived from {\\small GADGET}~\\citep{GADGET} and contains \nmodifications centered around the ability to \nemploy several fundamentally different hydro solvers.\nIn this paper, we employ {\\small GIZMO} using the meshless-finite-mass method to solve the \nhydrodynamic equations of motion.\n\n\nIn addition to gravity and hydrodynamics, all simulations include a list of physical processes important to galaxy formation.\nThe specific galaxy formation model used in this paper is the FIRE feedback model~\\citep{Hopkins2014}.\nThis model has been explored extensively in previous papers simulating the evolution of galaxies within cosmological volumes.\nThe FIRE model is capable of reproducing many observed galaxy properties including the stellar mass-halo mass relation, Kennicutt-Schmidt law~\\citep{Hopkins2014},\nthe covering fractions of neutral hydrogen in the halos of z=2-3 Lyman Break Galaxies~\\citep[LBGs,][]{FaucherGiguere2015}, \nand can self-consistently generate galactic winds that regulated galaxy mass growth consistent with observational requirements~\\citep{Muratov2015}.\n\n\nDetails of the FIRE feedback model are given in~\\citet{Hopkins2014}, which we summarize briefly here.\nAll simulations include radiative gas cooling and star formation with associated feedback.\nSupermassive black hole particles are included in the present simulations because their gravity is dynamically important.\nHowever, no black hole feedback is included.\nGas cools radiatively under the assumption of local thermodynamic equilibrium down to 10 K.\nDense/cold gas clouds are allowed to form stars if they are locally self-gravitating.\nThe star formation rate is given by $\\dot \\rho_* = \\rho_{ {\\rm mol }} / t_{ {\\rm ff}}$ where the molecular fraction, $f_{{\\rm H_2}}$, is inferred as a function of local gas column density and metallicity following~\\citet{Krumholz2011}.  \nNewly formed stars provide feedback to the ISM through thermal heating via supernovae, photo-ionization, local and long range radiation pressure, and stellar winds.\nEach of these feedback sources has a well defined fiducial level that is adopted directly from {\\small STARBURST99}\ngiven a stellar particle's age and metallicity~\\citep{SB99_3}.\n\n\n\\subsection{Initial Conditions}\nWe employ initial conditions that are modeled after redshift $z=0$ isolated star forming late type galaxies.\nThe initial distribution of particles is sampled based on the scaling relations of~\\citet{MMWdisk} via the procedure outlined in~\\citet{SpringelWhiteDisk}.\nWe construct three isolated galaxies that are similar in their physical characteristics but varied in initial mass to use as initial conditions.\n\nThe three galaxies have total masses of $M_{{\\rm tot}}=\\{1.39\\times10^{11},3.37\\times10^{11},1.39\\times10^{12}\\} M_\\odot$.\nEach of these galaxies consists of a dark matter halo, stellar disk, stellar bulge, gaseous disk (with 20\\% gas fraction), and central supermassive black hole.\nThe three systems are similar in that they all contain 4 percent of their mass in the disk, a constant (small) fraction in the central supermassive black hole, 1 percent of their mass in the bulge, and the rest of the mass in the halo (see Table~\\ref{table:ICProperties}).\nThe stellar and gaseous disks are given exponential surface density profiles with the same disk scale length set by the halo spin parameter of $\\lambda=0.04$ ($R_d=\\{1.7, 2.3, 3.7\\}$ kpc).\nThe relative masses in stars and gas is set by the initial disk gas fraction, for which we adopt 20 percent.\nThe disks are initialized to be nearly in equilibrium (e.g., with $Q\\sim1$).\nThe dark matter halo and stellar bulge are setup using a~\\citet{H90} profile initial density distribution.\nAn NFW~\\citep{NFW} equivalent concentration parameter of $C=10$ is used for all systems.\nThe bulge scale length is set to be 0.2 times the stellar and gaseous disk scale lengths.\nThe single supermassive black hole is included in each galaxy as a collisionless particle that is initially placed at the center of each galaxy.\nSince the mass of the supermassive black hole is much larger than the typical gas or stellar particle mass, it remains close to the potential minimum of the host galaxy via self-consistently captured dynamical friction without any additional special treatment.\nAdditional values such as the force softening, mass resolution and naming convention that we used for this initial condition set are summarized in Table~\\ref{table:ICProperties}.\n\n\nFigure~\\ref{fig:ICprofiles} shows the mass profiles, rotational velocity curves, and radially dependent dynamical time for our fiducial low mass galaxy (D1).  \nThe dynamical times are defined using the enclosed mass profiles to calculate the circular velocity.\nAlthough we neglect black hole accretion and feedback in these sets of simulations, the presence of this massive particle is important owing to its impact on the dynamics of the nuclear region.\nThe presence of the central supermassive black hole dominates the mass enclosed and rotation curve for the inner 10-30 parsecs.  \nThe rotational velocity curves have a non-monotonic profile, but the dynamical time continually drops toward the galaxy center.\nThe characteristic stellar evolution timescales of $\\sim 3$ Myr and $\\sim 40$ Myr are identified with horizontal dashed lines in the right panel of Figure~\\ref{fig:ICprofiles}.\nWe identify $3$ and $40$ Myr lines because this roughly corresponds to the time when stars begin moving off the main sequence and when the most of the energy from the newly formed stellar population has been deposited, respectively.\nFor this setup the dynamical time drops below $\\sim 3$ Myr at a radius of $\\sim 100$ pc, which changes only slightly for the other initial disks.\nWithin this region, we expect star formation and gas supply to be unable to achieve a steady state solution owing to the short dynamical times.\nThe presence of a $10^7 M_\\odot$ black hole alone keeps the dynamical time below $3$ Myr for the central $\\sim 100$ pc, but a massive/compact stellar bulge could play a similar role in shaping the inner galactic potential.\n\n\n\\begin{figure}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=0.475\\textwidth]{.//d1_properties.jpeg}}}}\n\\caption{The projected gas surface density is shown at three snapshots during the evolution of the D1 system.  \nThe top row shows synthetic SDSS-g, -r, -i band images made using a simple line of sight attenuation model.\nThe bottom row shows the gas surface density, with magenta indicating atomic/molecular gas ($10$ K$<T<8\\times10^3$ K), green indicating warm ionized gas ($8 \\times 10^3$ K$< T<8 \\times10^5$ K), and yellow (though little is present) hot gas ($T> 10^5$ K).\nThe time of each snapshot is marked in the top row and the scale bar of 1 kpc is also indicated.\nFrom the initially smooth gas distribution a turbulent ISM develops, with dense star forming regions being continually formed by self-gravity and destroyed through feedback from young stars.}\n\\label{fig:gas_surface_density_1}\n\\end{figure}\n\n\\begin{table}\n\\begin{center}\n\\caption{The properties of the initial conditions used for the three isolated disks presented in this paper.  \nBelow, $M_{tot}$ is the total mass of each system and $m_p$ is the baryon particle mass. \nAdaptive gravitational softening lengths are employed with $\\epsilon$ being the minimum (Plummer equivalent) force softening length used for each particle type.\n}\n\\label{table:ICProperties}\n\\begin{tabular}{ l l c c c c c }\nID \t&\t\t\t\t\t\t\t&\tGas \tDisk\t\t\t& Halo   \t\t\t\t& Stellar  \tDisk\t\t\t\\\\\t\n\t&\t\t\t\t\t\t\t&\t\t\t\t\t&\t\t\t\t\t& \t\t\t\t\t\\\\\n\\hline\t\n\\hline \nD1  \t&\tM${}_{{\\rm tot}} \\;[M_\\odot ]$ \t& $1.11 \\times 10^9 $\t&   $1.32 \\times 10^{11}$ \t&  $4.45 \\times 10^9$  \t\\\\\n\t&\tm${}_{{\\rm p}} \\;[M_\\odot ]$& $10^3  $\t\t\t\t&   $8.0 \\times 10^4$  \t&  $3.0 \\times 10^3$  \t\\\\\n  \t&\t$\\epsilon \\;[pc]$\t\t\t\t& 1   \t\t\t\t\t&   10  \t\t\t\t&  2   \t\t\t\t\\\\\n\\hline\nD2  \t&\tM${}_{{\\rm tot}} \\;[M_\\odot ]$ \t& $2.72 \\times 10^9 $\t&   $3.23 \\times 10^{11}$  \t&  $1.09 \\times 10^{10}$  \t\\\\\n\t&\tm${}_{{\\rm p}} \\;[M_\\odot ]$ \t& $10^3 $\t\t\t\t&   $8.0 \\times 10^4$  \t&  $3.0 \\times 10^3$  \t\\\\\n  \t&\t$\\epsilon \\; [pc]$\t\t\t& 1   \t\t\t\t\t&   10  \t\t\t\t&  2   \t\t\t\t\\\\\n\\hline\nD3  \t&\tM${}_{{\\rm tot}} \\;[M_\\odot ]$\t& $1.11 \\times 10^{10} $\t&   $1.32 \\times 10^{12}$  &  $4.45 \\times 10^{10}$  \t\\\\\n\t&\tm${}_{{\\rm p}} \\;[M_\\odot ]$\t& $10^3 $\t\t\t\t&   $8.0 \\times 10^4$  \t&  $3.0 \\times 10^3$  \t\\\\\n  \t&\t$\\epsilon \\;[pc]$\t\t\t\t& 1   \t\t\t\t\t&   10  \t\t\t\t&  2   \t\t\t\t\\\\\n\\hline\n\\hline\n\\end{tabular}\n\\end{center}\n\\end{table}\n\n\n\n\n\\section{Results}\n\\label{sec:Results}\n\\subsection{Gas Distribution and Galaxy Structure}\nFigure~\\ref{fig:gas_surface_density_1} shows a time sequence of the D1 galaxy evolved from 1 to 2 Gyr. \nThe top panel shows a synthetic optical image of the galaxy while the bottom panel shows the gas content. \nAs indicated in both panels, throughout the entire simulation the disk remains globally stable without any strong bars developing (although there is a prominent spiral pattern).\nThis global stability is by construction.\nAs the simulation proceeds gas cools and collects into dense star forming clumps which are embedded in a volume filling warm phase of the ISM. \nThe color of the gas distribution on the bottom panel highlights this multi-phase structure: magenta gas indicates atomic/molecular material while green indicates warm ionized gas. \nThese star forming clumps are eventually disrupted through feedback from young stars.\nThe self-regulation of a multi-phase ISM through feedback from stars using the FIRE feedback model has been discussed extensively in~\\citet{Hopkins2014}.\nAlthough we only show results here for the D1 disk, we note that D2, and D3 show qualitatively indistinguishable behavior.\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=1.0\\textwidth]{.//gas_blowout_time_series_fov_0.jpeg}}}}\n\\caption{The projected gas surface density is shown at five snapshots during the evolution of the D1 system, focused around the galactic nucleus during a period of nuclear gas blowout.  \nThe white circle indicates a cylindrical aperture of 100 pc centered on the central supermassive black hole, which stays closely pinned to the potential minimum.\nSignificant molecular gas is initially present in the central 100 pc aperture.  The concentration of cold/molecular gas (indicated with purple) in the nuclear region in the first (leftmost) snapshot  has an associated elevated level of nuclear star formation.\nSoon after the feedback from young stars hits the critical level, leading to a near complete blowout of gas within the central 100 pc.\nThe gas density remains suppressed for the next $\\sim$30 Myr, while the feedback from young stars continues to be efficient in spite of the absence of much ongoing star formation.}\n\\label{fig:gas_surface_density_2}\n\\end{figure*}\n\n\nThe multi-phase ISM stretches across the full radial range of each galaxy, including the central region.  \nTo highlight the evolution of the ISM phase structure in the nuclear region, Figure~\\ref{fig:gas_surface_density_2} shows the gas surface density within a narrow field of view focused on the galactic nucleus at several times.\nWe can identify here the ISM structure extending down to ${\\lesssim}$100 pc scales.\nThe gas density in the central region can be seen to fluctuate through the images.\nThe most severe gas fluctuations are short lived and so we have selected times that highlight a period of central gas blowout. \nThe typical blowout cycle begins with a concentration of molecular (purple) star forming gas in the central $\\sim 100$ pc, as is found in the left most panel.\nThis dense gas concentration forms stars rapidly until the feedback from these young stars reaches the critical $f_{*,y}^{\\mathrm{crit}}$ value.\nThis transition occurs very rapidly as the dynamical times on these scales is only $\\sim$1 Myr (see Figure~\\ref{fig:ICprofiles}).  \nAfter gas is removed from the central region, the gas remains at very low densities for $\\sim$20-30 Myr (i.e. the third and fourth panels).\nBy $\\sim$50 Myr (the rightmost panel) molecular gas begins to build up again just outside of the central region.\nAsymmetric disk features are clearly present which foster the torquing of gas to the central 100 pc.\n\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=1.0\\textwidth]{.//nuclear_stellar_dist_0.jpeg}}}}\n\\caption{Same as Figure~\\ref{fig:gas_surface_density_2}, but zoomed further on the galaxy nucleus and with the locations of young star particles identified with black circles.\nThe left panel indicates the locations of the youngest stars which are highly clustered and generally coincide with the dense gas in which they were formed.\nSubsequent panels show the same star particles as they age.\nBy a few tens of millions of years the distribution of young stars becomes more randomized in this region with the stellar populations being well separated from their birth clouds.\nThis is partially driven by feedback, but aided significantly by the short dynamical times on these scales.  }\n\\label{fig:young_star_dist}\n\\end{figure*}\n\n \nIn addition to considering the gas distribution on these scales, we consider the distribution of young star clusters and their evolution with time.\nFigure~\\ref{fig:young_star_dist} shows the evolution of the stellar populations associated with this same blowout event.\nSpecifically, the stellar population that was less than $10$ Myr old is identified in the leftmost panel, and those same particles are tracked forward in time. \nIn the leftmost panel, the young stars (here $t<10$ Myr) take on a clustered distribution that is (mostly) coincident with dense star forming gas.\nIn some cases, young stars are found in low density regions when they have already been able to blow apart their birth cloud.\nWithin $10$ Myr (second panel from left), the stars have already randomized their locations significantly.  \nThere is little correlation between these young stars and the dense gas distribution.\nBy $20$ Myr (central panel), the stars continue to deposit significant momentum and energy via supernovae but the gas is almost completely evacuated.\nHowever, once the feedback from this young stellar population recedes (two rightmost panels) dense/cold molecular gas quickly returns to the central region.\n\nFrom Figure~\\ref{fig:young_star_dist} we identify that star formation occurs in several distinct self-bound dense gas clouds within the central $\\sim$100 pc.  \nHowever, the young stars rapidly decouple from their birth clouds owing both to feedback and the short dynamical time.\nThe rapid mixing of the young stellar populations drives the whole central region to react homogeneously to the presence of strong feedback.\nDespite the presence of multiple self-bound star forming clumps, the feedback response of the gas in the whole nuclear region acts like that of a single molecular cloud:\nstars form until a critical surface density of young stars is present (such that feedback overwhelms gravity) at which point they begin to expel gas from the nuclei. \n\n\n\n\n\\subsection{Star Formation Rates and Gas Masses Over Time}\nFigure~\\ref{fig:smoothed_sfr_rate} shows the SFR within the central 100 pc for the D1 galaxy.\nWe show the SFR when taken as an instantaneous value from the simulation, as well as averaged over the past 10 and 100 Myr by calculating $\\mathrm{ SFR} = M_*(t<t_0) / t_0$ where $t$ is the age of the star and $t_0$ is the averaging timescale.  \nWe present smoothed definitions of the SFR for two reasons.  \nFirst, the instantaneous SFR values obtained from the simulations rapidly vary and with significant magnitude.\nSmoothing the SFRs reduces the very high frequency noise allowing for more clear identification of the mean evolutionary trends.\nSecond, observational SFR indicators are not sensitive to the instantaneous SFR, but rather the total mass of young stars formed over some recent time window.\nThe smoothed definition of the SFR is therefore more in line with what is measured observationally through UV or nebular emission line SFR tracers~\\citep[e.g., see Table 1 of][]{Kennicutt2012}.\nIn the rest of this paper, we adopt a definition for the star formation rate as the average star formation rate over the past 10 Myr -- which would be most similar to what would be measured though H-alpha SFR measurements.  \n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=7.0in]{./smoothed_sfr_1_wb.pdf}}}}\n\\caption{The SFR within the central $100$ pc as a function of time for the D1 disk using the instantaneous SFR (green line), the mass of stars formed over the past 10 Myr (blue line), and the mass of stars formed over the past 100 Myr (black line).  \nThe mass of young stars gives a smoothed estimate of the SFR and provides a better match to observational SFR probes.  \nWe exclusively use the mass of young stars formed in the past 10 Myr (blue line) to determine the SFR throughout the rest of this paper.  }\n\\label{fig:smoothed_sfr_rate}\n\\end{figure*}\n\nThe episodic central star formation activity is directly examined in Figure~\\ref{fig:gas_nuclear_evolution} for the simulated systems. \nThe panels of Figure~\\ref{fig:gas_nuclear_evolution} show the time evolution of the gas mass, young stellar mass (i.e. $M_*(t<40$Myr$)$), star formation rate, and critical feedback value from top to bottom.\nFigure~\\ref{fig:gas_nuclear_evolution} presents these quantities within the central 100 pc, while Figure~\\ref{fig:gas_nuclear_evolution2} shows the same quantities within the central 1 kpc.\n\nOver very long periods of time (i.e. $\\sim$ 1 Gyr timescales) we find the central region's gas mass and star formation rate is characterized by a relatively steady state.\nThe time averaged star formation rate or central gas mass evolves only marginally over the full time period shown in Figure~\\ref{fig:gas_nuclear_evolution}.\nThis is impressive, given that in the nuclear regions of the galaxies explored here are being evolved for hundreds of dynamical times.\nThe steady nature of the SFR over $\\sim$1 Gyr time scales is consistent with star formation being effectively regulated by stellar feedback. \nPresumably, however, this would break down on time scales much greater than $\\sim$1 Gyr, where the absence of IGM accretion would lead to disk gas depletion.  \n\nOn shorter timescales the central 100 pc region is characterized by an oscillatory gas mass, star formation rate, and young stellar mass within the nuclear region.\nThe behavior of each of these components is offset in time but closely related.\nThe central gas mass increases in the absence of current strong stellar feedback until star formation becomes efficient in the central region owing to the presence of sufficiently dense, self-bound gas clumps.\nStar formation then proceeds efficiently until stellar feedback is sufficiently strong as defined by equation~\\ref{eqn:NewFeedbackEquilibrium} to balance gas collapse.\nOnce feedback is sufficiently strong, the gas supply is rapidly expelled (characterized by very sharp drops in the central gas content for any of the disks).\nThe young stars that are responsible for the strong feedback continue to inject strong feedback into the nuclear region for $\\sim$30-40 Myr causing the gas recovery in this region to be relatively slow.\nThe episodic sharp drops in the central gas content are correlated with the periods of peak young stellar mass.\nThe timescale for this behavior is of order $\\sim$100 Myr -- though the detailed duty cycle for this process is not very regular, and is different for our three disk models.\nThe time evolution shown in Figure~\\ref{fig:gas_nuclear_evolution} can be compared back against the central gas surface density plots shown in Figure~\\ref{fig:gas_surface_density_2}.  \nBoth figures present a complementary picture of the cyclical gas blowout from the central region.\n\n\n\nThe behavior of the same quantities averaged on larger spatial scales becomes significantly more stable.\nExamining Figure~\\ref{fig:gas_nuclear_evolution2} we find that averaged over the central 1 kpc, the mass of gas and young stars in the central regions shows no clear oscillatory behavior. \nThe instantaneous star formation rate (not shown) shows significant variability, which becomes nearly smooth when averaged over 10 Myr periods (the plotted curves).\nThe increased stability on 1 kpc scales is consistent with the analytic arguments outlined in Section~\\ref{sec:AA}.\nAlthough feedback operates to disrupt gas clouds locally feedback failed to collectively clear \nmaterial from the region.\nThe rate of gas consumption via star formation and gas expulsion via feedback are well balanced with the rate of gas return from aging stellar populations and influx from larger radii producing\nstable gas mass evolution.\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=7.0in]{./shell_mass_1_wb.pdf}}}}\n\\caption{Top to bottom: The gas mass, young stellar mass, star formation rates, and critical young stellar fraction as a function of time for the central 100 pc.\nThe episodic star formation in the central 100 pc is clear.  \nGas content first builds up in the central region, then star formation rapidly builds a population of young stars, which drive sufficiently strong feedback to drive down the central gas density. }\n\\label{fig:gas_nuclear_evolution}\n\\end{figure*}\n\n\n\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=7.0in]{./shell_mass_2_wb.pdf}}}}\n\\caption{Same as Figure~\\ref{fig:gas_nuclear_evolution} but for the central 1 kpc.  \nThe oscillatory properties that were present for the central 100 pc are not evident for the central 1 kpc.\nAll measured quantities are stable over this larger aperture, in contrast to the 100 pc central region.}\n\\label{fig:gas_nuclear_evolution2}\n\\end{figure*}\n\n\\subsection{The Threshold for Burst/Quench Cycles} \nIn Section~\\ref{sec:AA} we derived the surface density of young stars that were required to drive the outflows.\nThe surface density of young stars normalized by the critical surface density that is expressed in Equation~\\ref{eqn:NewFeedbackEquilibrium} is plotted as a function of time in the bottom panels of Figures~\\ref{fig:gas_nuclear_evolution} and~\\ref{fig:gas_nuclear_evolution2} for our three disks as evaluated within the central 100 pc and 1 kpc, respectively.\nPeriods of time with $f_{*,y}^{\\rm crit}<1$ indicate that the system has low levels of feedback compared to what is required for gas blowout and is therefore stable/collapsing while \nperiods of time with $f_{*,y}^{\\rm crit}>1$ indicate that the system is feedback dominated and is likely driving outflows.  \nThe central portion of each galaxy spends the majority of its time in a stable/collapsing state, bookended with brief periods of strong feedback. \nWe can compare the periods of time with high $f_{*,y}^{\\rm crit}$ values with the time evolution of the quantities presented in the bottom panel of Figure~\\ref{fig:gas_nuclear_evolution}.\nWhen $f_{*,y}^{\\rm crit}$ exceeds unity, there is a strong correspondence to a rapid drop in the central gas content of the system.\nContrasting the panels within Figure~\\ref{fig:gas_nuclear_evolution} reveals that the $f_{*,y}^{\\rm crit}$ values rise much more sharply than the young stellar mass.\nThe driving force behind this feature is that while the mass of young stars is initially responsible for pushing $f_{*,y}^{\\rm crit}$ above unity, \nonce this is achieved the rapid outflow of gas mass from the central region drives up the derived turbulent velocity and drives down the orbital frequency and gas mass.\nThe combination of these three effects results in the very sharp rise of the $f_{*,y}^{\\rm crit}$ values.  \nVery large $f_{*,y}^{\\rm crit}$ values are not long lived because (i) the gas fraction drops, (ii) new star formation ceases, and soon after (iii) the mass of young stellar mass decreases (owing to aging).\n\n\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\\includegraphics[width=7.0in]{./toomre_q_vs_time.pdf}}}}\n\\caption{(Left) The Toomre Q parameter is shown as a function of time for several radii within each disk.  \nQ approaches unity for all radii.  \nHowever, while Q  hovers around unity consistently with time for the large radii bins, the smaller radii bins have episodic and strong increases in the Toomre Q value.  \nThese increases in Q correspond to periods where stellar feedback temporarily dominates the central region's dynamics, and are indicative of local outflows.\n(Right) The $r, \\phi, z$ velocity dispersion is shown as a function of time for each disk for the central r=100 pc.\nSteady state velocity dispersion of $c_t\\sim$10-50 km/sec are achieved, with brief excursions to higher velocity dispersion when outflows are being launched.\n}\n\\label{fig:toomre_q}\n\\end{figure*}\n\n\n\\subsection{Toomre Q and Gas Velocity Dispersions}\nFurther insight into the dynamic behavior of the central gas reservoir can be obtained from Figure~\\ref{fig:toomre_q} which shows the Q parameter as a function of time for several disk radii.  \nThe Q value is evaluated via $Q = 2 c_t \\Omega / \\pi G \\Sigma_{\\rm g}$ using the $\\hat z$ component of the mass weighted gas velocity dispersion as a proxy for the turbulent velocity dispersion.\nWe adopt the vertical, mass weighted, velocity dispersion because the radial and azimuthal velocity dispersions are more subject to influence by the coherent, non-circular motion of dense clouds in the disk plane.\nMoreover, the mass (rather than volume) weighted velocity dispersion is both more important for the disk dynamics, and less subject to influence from rapidly outflowing material.\nThe Q value hovers around unity consistently with time at large radii, indicating steady-state self-regulation.  \nThe smaller radii bins have episodic and strong increases in the Toomre Q value, indicative of local outflows.  \n\nThe inner regions of the simulated disks experience brief periods of large gas velocity dispersions coincident with the presence of locally-driven outflows.\nBetween these periods, the gas velocity dispersions are of order 30-50 km/sec.\nMore specifically, the D1, D2, and D3 disks have median vertical gas velocity dispersions of in the central 1 kpc of $35.1$, $46.3$, and $30.7$ km/s, respectively.\nThis is consistent with the prediction that $c_t=f_g \\sigma / 2$ for $Q=1$~\\citep[our $c_t$ is slightly higher owing to the multi-component disk and order unity corrections calculated in][]{FaucherGiguere2013}.\nThe gas velocity dispersion measured on smaller scales is similar in magnitude (i.e. 30-50 km/sec), but with significantly more variability -- particularly around burst episodes.\n\n\n\n\n\n\n\\subsection{Nuclear Kennicutt-Schmidt Relation}\nEquilibrium analytic models have been used to explore the low efficiency of star formation that is observed in the KS relation~\\citep{Thompson2005, Ostriker2011, FaucherGiguere2013}.\nTheir breakdown may therefore have implications for the KS relation in those regions.\nIn Figure~\\ref{fig:ks_relation1} we consider the $\\Sigma_{{\\rm SFR}}$-$\\Sigma_{{\\rm gas}}$ KS relation for material within the central r=$100$ pc (left) and r=$1$ kpc (right).\nFigure~\\ref{fig:ks_relation1.5} shows the $\\Sigma_{{\\rm SFR}}$-$\\Omega\\Sigma_{{\\rm gas}}$ relation -- again for material within the central r=$100$ pc (left) and r=$1$ kpc (right).\\footnote{For clarity: we take the dynamical time to be $t_{{\\rm dyn}}=1/\\Omega = r/v$.  We calculate the dynamical time based on the local potential.}\nStar formation rate surface densities are calculated based on the mass of stars less than 10 Myr old -- consistent with the definition of SFR used throughout the rest of this paper.\n\n\\begin{figure*}\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=3.3in]{./ks_1.pdf}\n\\includegraphics[width=3.3in]{./ks_2.pdf}\n}}}\n\\caption{The $\\Sigma_{{\\rm SFR}}$-$\\Sigma_{{\\rm gas}}$ KS relation is shown for material within the central r=$100$ pc (left) and r=$1$ kpc (right).  \nWe find significantly increased scatter for the r=$100$ pc  relation compared to larger aperture relation. \nFor comparison, we present the empirically derived KS relations from~\\citet{FaucherGiguere2013} and~\\citet{Bouche2007}.   }\n\\label{fig:ks_relation1}\n\n\n\\centerline{\\vbox{\\hbox{\n\\includegraphics[width=3.3in]{./ks2_1.pdf}\n\\includegraphics[width=3.3in]{./ks2_2.pdf}\n}}}\n\\caption{The $\\Sigma_{{\\rm SFR}}$-$\\Omega\\Sigma_{{\\rm gas}}$ relation for material within the central r=$100$ pc (left) and r=$1$ kpc (right) is shown. \nThe same legend from Figure~\\ref{fig:ks_relation1} applies.\nThe dashed lines in the plots indicate 1\\%, 10\\%, and 100\\% of the gas mass being turned into stellar mass per dynamical time.\nThe star formation efficiency in the nucleus has more scatter than that at larger radii. \n}\n\\label{fig:ks_relation1.5}\n\\end{figure*}\n\nThe KS relation averaged over the central $\\sim$1 kpc is reasonably tight and consistent with the \nKS relations derived from observations by~\\citet{Bouche2007} and ~\\citet{FaucherGiguere2013}. \nThe slope of the KS relation predicted by our simulations is roughly n$\\sim$2 ($\\Sigma_{\\mathrm{SFR}} \\propto \\Sigma_g^n$). \nThis slope is steeper than slopes n$\\sim$1-1.5 often derived from observations assuming a constant $X_{\\mathrm{CO}}$ conversion factor~\\citep[e.g.,][]{Genzel2010} but is consistent with analytic equilibrium models~\\citep{Ostriker2011, FaucherGiguere2013}, \nand with an interpretation of observations assuming an $X_{\\mathrm{CO}}$ factor varying continuously with $\\Sigma_g$ \\citep{Ostriker2011, Narayanan2012}.\nThis has been shown already for our adopted ISM/star-formation/feedback model~\\citep{Hopkins2011a, FaucherGiguere2012, Hopkins2015}.\nThe SF efficiency for all three disks hovers around 5\\% star formation efficiency per dynamical time.\n\nThe smaller aperture KS relations have significantly more scatter than their larger aperture counterparts.\nThe dense cloud of points sitting around $\\Sigma_{\\mathrm{gas}} \\sim 10^2 M_\\odot \\mathrm{pc}^{-2}$ falls somewhat above the observed KS relation.\nThis is owing to the $100\\%$ local SF efficiency per free fall time (at the star formation density threshold) that is used in our simulations.\nOnce stars are formed in this cloud, they immediately start acting to clear the nuclear region of gas.\nSince the SFRs plotted in Figures~\\ref{fig:ks_relation1} and~\\ref{fig:ks_relation1.5} are derived from the mass of young stars we find a cloud of points that extends toward significantly lower gas surface densities.\nThis is a result of measuring the SFR from the mass of young stars that have both formed recently and begun to clear their birth cloud gas, and comparing it against the current gas mass.\nReexamination of Figure~\\ref{fig:young_star_dist} confirms how this process takes place in our simulations.\n\n\n\n\\section{Discussion}\n\\label{sec:Discussion}\n\nWe have examined the stability of self-regulated star formation in galactic nuclei.  \nStar formation in regions of galaxies with short dynamical times (shorter than the stellar evolution timescale) cannot reach a truly equilibrium state, but instead undergo ``burst quench\" cycles.\nWe presented an analytically motivated model where gas flows into the nuclear region and begins forming stars \nuntil enough young stellar mass is present to overwhelm the self gravity of the gas leading to a localized blowout of the gas.\n\nThis is similar to the behavior of a single GMC~\\citep[see, e.g.,][]{Fall2010, Murray2010} within which the local dynamical time can also become short.\nThe key difference between the nuclear region and a typical GMC is that this behavior is driven by the collectively short dynamical time of the disk, rather than the local potential of the star forming gas cloud.\nStar formation in the nuclear region can occur in several dense star-forming regions (see, e.g., Figure~\\ref{fig:young_star_dist}).\nHowever, for feedback purposes, massive young stars quickly separate from their birth clouds and the {\\it entire} nuclear region therefore acts as a single short dynamical time region. \n\nObserved nuclear stellar disks show indications of oscillatory star formation and feedback cycles.\n\\citet{Davies2007} found that a sample of Seyfert galaxies contained nuclear star clusters with spatial extent ${\\lesssim}$ 50 pc.\nInterestingly, although these nuclear star clusters could be identified to have characteristic ages of $\\sim$10-300 Myr, \nthere was little or no evidence of ongoing star formation in these same systems (as inferred through low values for the equivalent widths of Br$\\gamma$ emission).\nWe caution, however, that the modest gas surface densities ($\\Sigma_{{\\rm gas}}{\\lesssim} 300 M_\\odot$/pc${}^2$) explored in this paper are not directly comparable to the population ($\\Sigma_{{\\rm gas}}\\gtrsim 1000 M_\\odot$/pc${}^2$) studied in~\\citet{Davies2007}.\n\nIf there is a link between aging stellar populations and the fueling of AGN activity, as has been implied from the time offset between nuclear star formation and Seyfert activity, then the bursty nature of star formation found in our model would have implications for AGN fueling.  \nOur models included a central supermassive black hole -- which is dynamically important for the innermost galactic regions studied in this paper -- as well as stellar mass loss.\nHowever, we elected to not include black hole growth and associated black hole feedback in the present study as both processes add significant complicating factors to the interpretation of the results.\nIn the future, we intend to run additional simulations that consider the relationship between nuclear star formation and AGN activity~\\citep[for preliminary results on black hole growth and feedback in simulations focusing on the inner $\\sim$100 pc regions of gas-rich galaxies, see][]{Hopkins2015}.\n\n\nA particularly  interesting application of full galaxy simulations that will include both explicit feedback from stars and from massive black holes in a resolved ISM will be to study the generation and effects of galaxy-scale outflows driven by luminous AGN. \nSuch outflows have now been detected in luminous quasars over a wide range of redshift and in both atomic and molecular gas~\\citep[e.g.,][]{Rupke2011, Greene2012, Cicone2014, Harrison2014}.\nThese appear energetic enough to potentially strongly affect galaxy scale star formation. \nWhile idealized analytic and numerical calculations~\\citep[e.g.,][]{FaucherGiguere2012, Zubovas2012, Costa2014, Bourne2014} have begun to address the physics of such outflows, fully dynamical simulations of galaxies including both stellar and black hole feedback will likely be needed to robustly predicted how AGN-driven galactic winds are mass loaded and how they affect the host galaxy.\n\n\n\n\n\\section{Conclusions}\n\\label{sec:Conclusions}\nWe have studied the impact of feedback from young stars on the star formation rates and gas content of galactic nuclei.  \nWe outlined basic analytic arguments that modify existing feedback equilibrium star formation models~\\citep[e.g.,][]{Thompson2005, Ostriker2011, FaucherGiguere2013} to apply to short dynamical time regions.\nWe ran and explored numerical simulations that included realistic, time resolved stellar feedback prescriptions to directly model the evolution of several galaxy models.\n\nOur primary conclusions are as follows:\n\\begin{itemize}\n\\item The nuclear regions ($r\\ltsim100$ pc) of galaxies are characterized by dynamical times of order $\\sim$1 Myr.  \nFeedback from young stars evolves over timescales of tens of Myr (Figure~\\ref{fig:sb99}).  \nThis timescale mismatch means that feedback from young stars is not immediately responsive to changes in the gas state, and thus there is no {\\it stable equilibrium star formation rate}.\n\\item Instead, gas will continue to form stars until a critical mass of young stars is formed (eqn.~\\ref{eqn:NewFeedbackEquilibrium}), at which point the feedback from young stars leads to an unstable blowout from the nucleus.\nAfter the blowout new gas flows into the nucleus from larger radii (Figure~\\ref{fig:gas_surface_density_2}).\nAs a consequence, the gas content, star formation rate, and mass of young stars all oscillate in time when measured over $\\sim 100$ pc scales; they are significantly more stable when measured over larger $\\gtrsim 1$ kpc scales (Figures~\\ref{fig:gas_nuclear_evolution} and~\\ref{fig:gas_nuclear_evolution2}).\n\\item The simulated KS relation shows very different properties on $100$ pc and $1$ kpc scales (see Figure~\\ref{fig:ks_relation1}).  \nThe long dynamical time on large scales means the system can reach equilibrium. \nThis leads to a more stable star formation rate and gas content with time -- hence a tighter KS relation.\nIn the galactic nucleus, by contrast, the KS relation is much more variable and has larger scatter.\n\\end{itemize}\n\n \nIn the present study the dynamical effect of the central supermassive black hole was included but AGN feedback was not.\nIn this paper we have shown that stellar feedback {\\it alone} is capable of driving episodic star formation and outflows from galactic nuclei.\nHowever, considering both stellar and AGN feedback in concert will be important for understanding the relative importance of different feedback channels on galactic nuclei.\n\n\n\n\\section*{Acknowledgements} \nPT acknowledges helpful discussions with Sara Ellison, Nick McConnell, and Sarah Wellons.\nPT acknowledges support from NASA ATP Grant NNX14AH35G (PI Hopkins) and support through an MIT RSC award.\nSupport for PFH was provided by an Alfred P. Sloan Research Fellowship, NASA ATP Grant NNX14AH35G, NSF Collaborative Research Grant \\#1411920, and CAREER grant \\#1455342. \nCAFG was supported by NSF through grants AST-1412836 and AST-1517491, by NASA through grant NNX15AB22G, and by STScI through grant HST-AR-14293.001-A. \nMV acknowledges support through an MIT RSC award.\nDK was supported by NSF grant AST-1412153.\nEQ was supported in part by NASA ATP grant 12-APT12-0183, a Simons Investigator award from the Simons Foundation, and the David and Lucile Packard Foundation.\nThe simulations reported in this paper were run and processed on the ``Quest\" computer cluster at Northwestern University,  the Caltech compute cluster ``Zwicky\" (NSF MRI award \\#PHY-0960291), the joint partition of the MIT-Harvard computing cluster ``Odyssey\" supported by MKI and FAS, and allocation TG-AST130039 and TG-AST150059 granted by the Extreme Science and Engineering Discovery Environment (XSEDE) supported by the NSF.\n\n\n\n    \n\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 24916, "prevtext": "\nAn interesting limit is found by considering when the fraction of gas that must be turned into stars in order to achieve feedback balance is of order unity\n(i.e. $ \\Sigma_{*,y}^{{\\rm crit}} / \\Sigma_{\\rm g}  \\sim 1 $).  \nThis limit occurs for\n\n", "index": 33, "text": "\\begin{equation}\n \\Sigma_{\\rm g}  = \\frac{  f_p a_*(t)\\cdot b }{  \\pi Q  G    } \\approx 2.7 \\times 10^{11} \\frac{M_\\odot}{{\\rm kpc}^2}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\Sigma_{\\rm g}=\\frac{f_{p}a_{*}(t)\\cdot b}{\\pi QG}\\approx 2.7\\times 10^{11}%&#10;\\frac{M_{\\odot}}{{\\rm kpc}^{2}}\" display=\"block\"><mrow><msub><mi mathvariant=\"normal\">Σ</mi><mi mathvariant=\"normal\">g</mi></msub><mo>=</mo><mfrac><mrow><mrow><msub><mi>f</mi><mi>p</mi></msub><mo>⁢</mo><msub><mi>a</mi><mo>*</mo></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>⋅</mo><mi>b</mi></mrow><mrow><mi>π</mi><mo>⁢</mo><mi>Q</mi><mo>⁢</mo><mi>G</mi></mrow></mfrac><mo>≈</mo><mrow><mrow><mn>2.7</mn><mo>×</mo><msup><mn>10</mn><mn>11</mn></msup></mrow><mo>⁢</mo><mfrac><msub><mi>M</mi><mo>⊙</mo></msub><msup><mi>kpc</mi><mn>2</mn></msup></mfrac></mrow></mrow></math>", "type": "latex"}]