[{"file": "1601.05455.tex", "nexttext": "\n\nSince the orbital speed of the donor star and the wind speeds of AGB\nstars are of roughly the same order, and the accretor is heavier than\nthe donor, a substantial fraction of the total wind may be accreted (Bondi \\& Hoyle 1944; Struck et al. 2004; Mohamed \\& Podsiadlowski 2012). \n\nGiven that the wind speed and orbital speed are not known in this\nsystem, and the accretion rate depends on the ratio of these two\nspeeds to the fourth power, it is difficult to make a specific\nprediction here.  If $\\sim$ 1\\% of the wind of a typical AGB star (i.e\n1\\% of $10^{-6} M_\\odot$/yr) is accreted, however, then the system\nwould be expected to be bright in the ultraviolet due to strong\naccretion.  The system is not detected in GALEX data, but does show a\nblue excess in the spectrum of Levesque et al. (2014).  More targeted\nsearches for an accretion signature in this object are warranted, and\nshould be spread over the $\\sim$600 day period of the optically bright star,\ngiven that the accretion rate is likely to change with the pulsation\nphase.  The system does not show X-ray emission, with a 90\\% upper limit on its luminosity of about $10^{31} (d/6 {\\rm kpc})^2$ in data taken on March 25, 2013 (V. Antoniou, private communication).  Relatively few cataclysmic variables have X-ray luminosities higher than this value, and those which do are frequent dwarf nova outbursters (e.g. Britt et al. 2015).  This limit, again, is not particularly constraining, as many symbiotic stars have X-ray luminosities below $10^{31}$ erg/sec.\n\n\n\\section{Acknowledgments}\n\nWe thank the Lorentz Center for having hosted the workshop on ``The Impact of Massive Binaries throughout the Universe'', where the ideas in this paper were first discussed.  We thank Stephen Justham,  Ben Davies, Lennart van Haaften and Onno Pols for useful discussions, Vallia Antoniou for sharing the X-ray upper limit in advance of publication, and Terry Girard for helpful and detailed discussions of possible systematic errors in the Southern Proper Motion survey data. SdM acknowledges support by the EU Horizon 2020 program through a Marie Sklodowska-Curie Reintegration Fellowship, H2020-MSCA-IF-2014, project id 661502. \n\n\\begin{thebibliography}{99}\n\\bibitem{}Allen D.M., Barbuy B., 2006 A\\&A, 454, 895\n\\bibitem{}Angulo et al. 1999, Nuclear Physics A,656, 3\n\\bibitem{}Baade W., 1926, AN, 228, 359\n\\bibitem{}Biehle G.T., 1991, ApJ, 380, 167\n\\bibitem{}Biehle G.T., 1994, ApJ, 420, 364\n\\bibitem{}Bondi H., Hoyle F., 1944, MNRAS, 104, 273\n\\bibitem{}Britt C.T., et al., 2015, MNRAS, 448, 3455\n\\bibitem{}Cameron A.G.W., Fowler W.A., 1971, ApJ, 161, 111\n\\bibitem{}Cannon R.C., 1993, MNRAS, 263, 817\n\\bibitem{}Chevalier R., 1993, ApJL, 411, 33\n\\bibitem{}Cutri R.M., et al., 2003, The IRSA 2MASS All-Sky Point Source Catalog, NASA/IPAC Infrared Science Archive\n\\bibitem{}Fryer C.L., Benz W., Herant M., 1996, ApJ, 460, 801\n\\bibitem{G11}Girard T.M., et al., 2011, AJ, 142, 15\n\\bibitem{}Girardi L., et al., 2010, ApJ, 724, 1030\n\\bibitem{}Graczyk D., et al., 2014, ApJ, 780, 59\n\\bibitem{}Iben I., Renzini A., 1983, ARA\\&A, 21, 271\n\\bibitem{}Jorissen A., Mayor M., 1992, A\\&A, 260, 115\n\\bibitem{}Kallivayalil N., van der Marel R.P., Besla G., Anderson J., Alcock C., 2013, ApJ, 764, 161\n\\bibitem{}Karakas A.I., Lattanzio J.C., 2014, PASA, 31, 30\n\\bibitem{}Kobayashi C., Umeda H., Nomoto K., Tominaga N., Okhubo T., 2006, ApJ, 653, 1145\n\\bibitem{}Lambert D.L., Smith V.V., Busso M., Gallino R., Straniero O., 1995, ApJ, 450, 302\n\\bibitem{}Lau H.H.B., Doherty C.L., Gil-Pons P., Lattanzio J.C., 2011, ASPC, 445, 45 \n\\bibitem{}Kuchner M.J., Vakil D., Smith V.V., Lambert D.L., Plez B., Phinney E.S., 2002, ASPC, 263, 131\n\\bibitem{}Leonard P.J.T., Hills J.G., Dewey R.J., 1994, ApJ, 423, L19\n\\bibitem{L14}Levesque E.M., Massey P., \\.Zytkow A.N., Morrell N., 2014, MNRAS, 443L, 94\n\\bibitem{}Lugaro M., Davis A.M., Gallino R., Pellin M.J., Straniero O., K\\\"appeler F., 2003, ApJ, 593, 486\n\\bibitem{}Mahler T.A., Wasatonic R., Guinan E.F., 1997, IBVS, 4500, 1\n\\bibitem{}McClure R.D., 1984, ApJ, 208L, 31\n\\bibitem{}Merrill P.W., 1922, ApJ, 56, 457\n\\bibitem{}Mohamed S., Podsiadlowski P., 2012, Baltic Astronomy, 21, 88\n\\bibitem{}Mucciarelli A., 2014, AN, 335, 79\n\\bibitem{}Neugent K.F., Massey P., Skiff B., Drout M.R., Meynet G., Olsen K.A.G., 2010, ApJ, 719, 1784\n\\bibitem{}Samus, N.N., et al., 2012, General Catalog of Variable Stars, VizieR Online Data Catalog: B/gcvs\n\\bibitem{}Smith V.V., Lambert D.L., 1986, ApJ, 311, 843\n\\bibitem{}Sokoloski J., Bildsten L., 2010, ApJ, 723, 1188\n\\bibitem{}Stancliffe R. J., 2009, MNRAS, 394, 1051\n\\bibitem{}Stancliffe, R.J., 2010, MNRAS, 403, 505\n\\bibitem{}Struck C., Cohanim B.E., Willson L.A., 2004, MNRAS, 347, 173\n\\bibitem{}Taam R.E., Bodenheimer P., Ostriker J.P., 1978, ApJ, 222, 269\n\\bibitem{}Tajitsu, A., Sadakane, K., Naito, H.,  Arai, A.,  Aoki, W., 2015, Nature, 518, 381\n\\bibitem{}Tatarnikova  A. A., Marrese P. M., Munari U., Tomov T., Whitelock P. A., \\& Yudin B. F., 2003, MNRAS, 344, 1233\n\\bibitem{}Thorne K.S., \\.Zytkow Z.N., 1975, ApJ, 199L, 19\n\\bibitem{}Thorne K.S., \\.Zytkow A.N., 1977, ApJ, 212, 832\n\\bibitem{}Tout C.A., \\.Zytkow A.N., Church R.P., Lau H.B., Doherty C.L., Izzard R.G., 2014, MNRAS, 445L, 36\n\\bibitem{}Van Eck S., Jorissen A., 2000, A\\&A, 360, 196\n\\bibitem{}van Paradijs J., Spruit H.C., van Langevelde H.J., Waters L.B.F.M., 1995, A\\&A, 303L, 25\n\\bibitem{}Wesselink A.J., 1946, Bull. Ast. Int. Neth., 10, 91\n\\bibitem{}Zacharias N., Finch C.T., Girard T.M., Henden A., Batlett J.L., Monet D.G., Zacharias M.L., 2013, AJ, 145, 44\n\\end{thebibliography}\n\n\n\\label{lastpage}\n\n\n", "itemtype": "equation", "pos": 23612, "prevtext": "\n\n\n\\date{}\n\n\\pagerange{\\pageref{firstpage}--\\pageref{lastpage}} \\pubyear{}\n\n\\maketitle\n\n\\label{firstpage}\n\n\\begin{abstract}\nUsing the Southern Proper Motion (SPM) catalog, we show that the candidate Thorne-\\.Zytkow object HV~2112 has a proper motion implying a space velocity of about 3000{\\ensuremath{\\,\\rm{km}\\,\\rm{s}^{-1}}} if the object  is located at the distance of the Small Magellanic Cloud.  The proper motion is statistically different from that of the SMC at approximately $4\\sigma$ in SPM, although the result can drop to about $3\\sigma$ significance by including the UCAC4 data and considering systematic uncertainties in addition to the statistical ones.  Assuming the measurement is robust, this proper motion is sufficient to exclude its proposed membership of the Small Magellanic Cloud and to argue instead that it is likely to be a foreground star in the Milky Way halo. The smaller distance and therefore lower brightness argue against its proposed nature as a Thorne-\\.Zytkow object (the hypothesized star-like object formed when a normal star and a neutron star merge) or a super-Asymptotic Giant Branch (AGB) star.  Instead we propose a binary scenario where this star is the companion of a former massive AGB star, which polluted the object with via its stellar wind, i.e. a special case of an extrinsic S star. Our new scenario solves two additional problems with the two existing scenarios for its nature as Thorne-\\.Zytkow object or present-day super-AGB star. The puzzling high ratio of the strength of calcium to iron absorption lines is unexpected for SMC supergiants, but is fully consistent with the expectations for halo abundances.  Secondly, its strong variability can now be explained naturally as a manifestation of the Mira phenomenon. \n\nWe discuss further observational tests that could distinguish between the foreground and SMC scenarios in advance of the improved proper motion measurements likely to come from Gaia.\n\n\\end{abstract}\n\n\\begin{keywords}\nastrometry -- stars:abundances -- stars: chemically peculiar -- stars:individual:HV~2112\n\\end{keywords}\n\n\\section{Introduction}\n\nThe nature  of the star HV~2112, located in the same part of the sky as the Small Magellanic Cloud (SMC), has recently become the center of a vivid debate. Levesque et al. (2014) showed that it exhibits anomalous spectral features suggesting enhanced abundances of molybdenum, rubidium, lithium, calcium and possibly also potassium when compared to other SMC supergiants. The high inferred bolometric luminosity and the enhanced abundances of the first three elements  lead to the intriguing suggestion by Levesque et al. (2014) that HV~2112 could be a massive ``Thorne-\\.Zytkow Object'' ({T\\.ZO}), the hypothesized red-giant like stellar objects with neutron stars inside their cores. \n\n{T\\.ZOs}, first modeled by Thorne \\& \\.Zytkow (1975, 1977), may form as a result of unstable mass transfer in a massive X-ray binary after the neutron star is engulfed in the envelope of its companion star (Taam et al. 1978). Alternatively, these objects may form when the supernova kick of newly formed neutron star accidentally sends it towards and into its companion (Leonard et al. 1994). Whether {T\\.ZOs}~actually form is a matter of debate.  Fryer et al (1996) and Chevallier (1993) argued that the neutron star would accrete enough material to collapse to a black hole before forming a stable {T\\.ZO}.  Biehle (1991, 1994) and Cannon (1993) predict that massive TZOs, if stable, are powered by nuclear burning through the exotic interrupted rapid proton (irp)-process. Therefore they may be identified by enhanced abundances of rare proton-rich elements, including Mo and Rb. Also enhancements of Li have been predicted (Podsiadlowski et al. 1995).  The predictions triggered several (proposed) observing campaigns hoping to identify massive TZOs (van Paradijs et al. 1995, Kuchner et al. 2002, Levesque et al. 2014). So far HV~2112 is the most promising candidate, even though the abundances of Rb and Mo are not as high as expected and the enhancement of Ca and K was not predicted. \n\nTout et al. (2014) discuss an alternative explanation where HV~2112 is a ``super asymptotic giant branch (AGB) star''. This is the late evolutionary phase of stars with initial mass around 8{\\ensuremath{\\rm{M}_\\odot}},  massive enough to ignite carbon, but still low enough to experience thermal pulses and dredge up episodes typical for AGB stars.  Super AGB stars have higher core masses than typical red giants, giving them luminosities as high as red supergiants and {T\\.ZOs} in their early phases (Siess 2010). Similar to AGB stars they can, in principle, produce Mo and Rb through the slow neutron capture process (Karakas \\& Lattanzio 2014) and Li through the Cameron \\& Fowler (1971) mechanism.  Enhancement of Ca or K is, however, not predicted. \n\nIn both scenarios HV~2112 is assumed to be member of the SMC. This view is supported by its projected location in the sky and the kinematic properties: the measured radial velocity (RV) is similar to that of the SMC (Neugent et al. 2010). However, as Levesque et al. (2014) state, the possibility that it may be a halo giant with a similar RV cannot be ruled out, but it would require a novel explanation for the peculiar spectral features.\n\nIn this paper, we report the detection of a very large proper motion based on data from the Southern Proper Motion survey (Girard et al. 2011). If confirmed, the proper motion excludes membership in the SMC, making HV~2112 a foreground Milky way star (likely a giant due to its pulsational properties). A location in the Milky Way would rule out both proposed scenarios, the {T\\.ZO}-nature and sAGB-nature of HV~2112.\n\nWe propose a new scenario which involves pollution by the wind of a former massive AGB companion star.  In this manner, the enhancement of molybdenum, rubidium, and possibly lithium comes from the processes that would enrich a massive AGB star. By now the former companion has lost its entire envelope. Its remnant, most likely a massive white dwarf, is expected to be still around in a wide orbit.  HV~2112 in this scenario is the initially less massive secondary star. This scenario is similar to the scenario proposed by Iben \\& Renzini (1983) to explain extrinsic S stars as well as  Ba and CH stars (McClure 1984). One of the very attractive features of this scenario (and any scenario were it is placed in the Galactic halo) is the natural explanation provided for the Ca (and K) features. These elements appear enhanced when compared to SMC giants, but they are normal for the Galactic halo where [Ca/Fe] enhancements are typical. We discuss various testable predictions of this scenario.\n\n\\section{Proper motion measurements and their implications}\n\nThe star HV~2112 has had its proper motion measured as part of the\nSouthern Proper Motion survey.  This is a systematic astrometric study\nwith a baseline of approximately four decades covering nearly the\nentire southern sky down to approximately $V=17.5$ (Girard et al. 2011).  For HV~2112, the first epoch was obtained in 1972 and the second in 2007.  The star\nshows a proper motion of 2.8$\\pm$2.3 mas/year in right ascension and -9.8$\\pm$2.3 mas/year in declination.  \n\nWhile the star is strongly variable, there are two reasons to believe\nthat the proper motion measurements from SPM 4.0 are reliable.  First, in both\nepochs, it was among the brightest stars in its general vicinity --\nwithin two arcminutes, only one star is brighter in the second epoch V\nband CCD data, and only two stars are brighter in the first epoch B\nband photometry.  Additionally, within 2', there are only 8 stars brighter than $B=16$, so the probability of finding a star within 10\" which is even 10\\% as bright as HV~2112 is about $10^{-4}$.  Second, with the 35 year baseline, the total astrometric shift measured is about 0.35 arcseconds.  This shift is\nsufficiently large that it would require extreme fine tuning to produce an astrometric shift due to the combination of blending and source variability without the second object being apparent in the images, and as shown, the probability of such a star being that nearby is of order $10^{-4}$.\n\nThe UCAC4 catalog (Zacharias et al. 2013) often gives an additional useful second epoch for proper motions to that from the SPM, although UCAC4 and SPM make use of the same first epoch data.  For this object, however, the second epoch from UCAC caught this variable star in a relatively faint state, so that the positional uncertainty is several times as large as in the SPM data.  The UCAC4 proper motion estimate is $1.8\\pm2.9$ mas/yr in right ascension and $-3.3\\pm2.7$ mas/yr in declination.  If one takes a weighted average of the two measurements, then proper motion is $2.4\\pm1.8$ mas/year in right ascension and $-6.8\\pm1.8$ mas/year in declination.  This differs from zero at roughly 3.8$\\sigma$, and from the -1.1 mas/yr in declination of the SMC (Kallivayalil et al. 2013) by $3.2\\sigma$.  The deviation from the proper motion of the SMC in right ascension, which is -0.8 mas/yr (Kallivayalil et al. 2013) is statistically insignificant, being about 1.7$\\sigma$. Averaging SPM and UCAC using weights determined solely by their statistical uncertainties is a conservative approach, since any systematic uncertainties should be far more serious for the fainter UCAC4 epoch than for the SPM data, and the SPM measurement indicates a larger proper motion than does the UCAC4 measurement.\n\nWe have also checked for systematics in the astrometry of the field by taking the Hipparcos proper motion measurements for stars within 2 degrees of HV~2112 and cross-correlating them against the SPM 4.0 measurements.  We have found that there is no systematic offset at a\nlevel of about 0.5 mas/year, and that the differences between the SPM and Hipparcos\nmeasurements are comparable to those expected from the stated statistical errors.\n\nWe have test whether the internal errors for the SPM data are comparable to what is stated in the SPM catalogue.  Using the TOPCAT package, we have taken all the SPM stars within 1.5 degrees of HV~2112.  We have then filtered to include only stars whose 2MASS colours (Cutri et al. 2003) place them on one of the giant branches for the SMC and which have $V$ between 10 and 14 (i.e. a magnitude range for which we expect the errors to be similar to those for HV~2112), and then examined only those stars with proper motions of 5 masec/year or less.  We find that for these 199 stars, the standard deviation in the values of the proper motions in both dimensions is about 90\\% of the mean values of the uncertainties on the proper motions from SPM 4.0.  The expectation, if all the stars had measurement uncertainties of the mean uncertainty, and there were no interloper stars, would be that the standard deviation would be about 75\\% of the 1$\\sigma$ uncertainty (the expectation is not exactly $1\\sigma$ because the more extreme outliers will be eliminated by the 5 mas/year cut). It may then be that the measurement uncertainties are underestimated by about 20\\%, and that the significance of the proper motion measurement relative to the SMC proper motion is at only the 3.0$\\sigma$ level, but this gives us additional confidence that there are no major systematic uncertainties in SPM 4.0 that bias our results.\n\nAny statistically significant measurement of a proper motion in data\nwith the precision of SPM 4.0 immediately provides a strong argument\nagainst a location of the star in the Small Magellanic Cloud, because the statistical uncertainties on the proper motions are larger than the escape velocity from the SMC.  The proper motion in $\\delta$ of 10 mas/year at a distance of 62.1 kpc (Graczyk et al 2014) yields a space velocity of 3100 km/sec, well\nabove the escape velocity of the SMC.  If one instead takes this to be\nthe velocity of a halo star in the Milky Way halo, and assumes a 150\nkm/sec speed (a reasonable value given the star's radial velocity of\n157 km/sec -- Levesque et al. 2014), then it is likely to be located at a distance of about 3 kpc, although the statistical errors on the proper motion measurement allow for a wide range of possible distances.  Both the space velocity, and\nthe height, probably a few kpc below the Galactic Plane, given the\nGalactic latitude of 45 degrees, suggest that this is a halo star\nrather than a disk star in the Milky Way.\n\\begin{figure}\n\\centerline{\\includegraphics[width=8 cm]{spm_hv2112.pdf}}\n\\caption{The proper motions of stars within 2 degrees of HV~2112, which have magnitudes from $V$=10 to $V=14$ and $J-K$ colors consistent with the giant branch for metal poor stars (from $J-K$=0.78 to 1.35).  HV~2112 has the black circle around it in the figure.  It can be seen to be an outlier in the proper motion diagram, with the main locus of points toward the center being the SMC stars, and the outliers being foreground stars.}\\label{figpm}\n\\end{figure}\n\n\n\\begin{figure}\n\\centerline{\\epsfig{figure=TZO_Sstar_cartoon.eps, width=0.5\\textwidth}}\n\\caption{{Cartoon of the alternative evolutionary scenario proposed involving a wide binary system located in the Galactic halo (1). The primary star evolves to become a massive AGB star and pollutes its low mass companion with its enriched wind (2), leaving behind a white dwarf after shedding its entire envelope (3). Eventually, the enriched secondary becomes an AGB star itself showing the, now diluted, abundance patterns of enrichment in addition to Li made in situ. The cartoon suggests that the white dwarf remnant of the primary is now accreting the wind of the ``TZO-impostor''. This is a possibility, but at present we have no strong evidence proving or disproving this hypothesis.\n\n}}\\label{fig:scenario}\n\\end{figure}\n\n\n\\section{A formation scenario for HV~2112}\n\nAt a distance of a few kpc, the luminosity of this object is\nlikely to be $\\sim10^3 L_\\odot$, rather than the $10^5 L_\\odot$ it\nwould have in the SMC.  Furthermore, is has been classified as a Mira-like variable from photometry (Samus et al. 2012), and its emission lines in its bright phases are also consistent with Mira phenomenology (Levesque et al. 2014).  The hypothesis of a Mira star also fits well with the inferred luminosity for the closer distance.  These points were already noted in Levesque et al. (2014), but rejected on the basis of the then-likely association with the SMC.  Levesque et al. (2014) did briefly, but presciently, note that future kinematics observations could potentially place the object in the Milky Way, and that if they did, this would lead to a different interpretation than the Thorne-\\.Zytkow object interpretation pursued in their paper.  Likewise, the super asymptotic giant branch (sAGB) star interpretation considered by Tout et al. (2014) also cannot explain the object if it is located in the Galactic foreground due to brightness considerations.\n\nOn the other hand, the abundances may be explained by a scenario in which matter is transferred from a massive AGB primary star to a binary companion.  Eventually, the secondary will evolve off the main sequence\nand become an AGB star itself, albeit of significantly lower mass,\nallowing such an object still to exist in the old population in the halo.  These stars are\ngenerally referred to as extrinsic S stars (e.g. Iben \\& Renzini\n1983), following an initial purely phenomenological classification of\nS stars (Merrill 1922), which were later found, in a mnemonically\nfortunate coincidence to be rich in s-process elements (Smith \\& Lambert 1986).  The primary must be massive enough to produce substantial enhancements of molybdenum and rubidium.  This certainly is expected for super-AGB stars (Lau et al. 2011; Tout et al. 2014), but is likely to happen down to even 4 $M_\\odot$ (Lugaro et al. 2003), and is clearly seen in some S stars (e.g. Lambert et al. 1995 show that Rb abundances increase with increasing s-process elemental abundances, while Allen \\& Barbuy 2006 show an excess of molbydenum in most of the members of a large sample of barium stars\\footnote{The barium stars are thought to be an earlier evolutionary state of the extrinsic S stars}.).   The extrinsic S stars form through the binary evolution channel above,\nwhile the intrinsic S stars are formed by dredge-up of s-process\nelements, and show enhancement of Tc.  The Tc signature indicates that\nthe material has been placed into the stellar atmosphere on a\ntimescale of order or less than the radioactive decay time of Tc.\n\nThe placement of the star in the Milky Way halo also helps to explain\nthe calcium abundance anomaly that could not be explained by the super-AGB star scenario discussed in Tout et al. (2014) nor by the TZO\nscenario of Levesque et al. (2014).  Levesque et al. (2014) did not\nhave a calibrated estimate of the Ca abundance of the star, but did\nshow that the ratio of strengths of Ca lines to Fe lines was a factor\nof about 3 stronger than that for red supergiants in the SMC.  This is\nindicative of a [Ca/Fe] ratio about 3.  Kobayashi et al. (2006) shows\nthat halo stars in the solar neighborhood with [Fe/H]$<-1$ tend to\nhave [Ca/Fe] of about 0.4, which indicates a calcium to iron abundance\nratio about 2.5.  The most metal rich (and presumably youngest) SMC\ngiants have ratios of $\\alpha$ element abundances to iron abundances\nquite similar to solar (Mucciarelli 2014).  Relatively little discussion exists about the potassium excess in HV~2112, but it is of similar size to the Ca excess judging from the plots in Levesque et al. (2014), and this, also, can be explained well in terms of empirical halo abundances (Kobayashi et al. 2006).\n\n\nLithium is a fragile element and is easily destroyed at temperatures in excess of about $2.5x10^6$K. Even a modest depth of mixing can lead to efficient depletion (Stancliffe 2009). In principle, Lithium can be in the AGB phase of the primary star (Cameron \\& Fowler 1971) and accreted onto the secondary. However, all Lithium originating from the primary has most likely been destroyed when HV~2112 evolved to become an AGB star and developed a deep convective envelope. The present day lithium abundance is more likely the result of production in situ, in HV~2112 itself. Low mass AGB stars can produce lithium as a result of thermal haline mixing (Stancliffe 2010). An alternative possibility is that the white dwarf left behind accretes enough material to produce a substantial nova rate. Evidence for lithium production has been found in the classical nova V339 (Tajitsu et al. 2015).  This could pollute the envelope of HV~2112. The model predictions remain uncertain, but lithium is not uncommon in symbiotic Mira's.  For example V407 Cyg shows a strong lithium excess (Tatarnikova et al. 2003). \n\n\\section{The variability of the system and its implications}\nRadial pulsations have periods which scale with the dynamical timescale of the star -- that is, $P\\propto{\\rho^{-1/2}}$, where $P$ is the period of oscillation, and $\\rho$ is the density of the star.  Mira variables have pulsation period of about 140-700 days.  Their masses tend to be $\\approx 1M_\\odot$ and their radii tend to be about 300 $R_\\odot$.  The typical variations in radius are a factor of about 1.5 (e.g. Mahler et al. 1997).  Because the mass of the Thorne-\\.Zytkow object could be quite large, it is viable for such a star to have a pulsational period of about 600 days caused by the same pulsation mechanism as the classical Miras, even though its radius would be much larger than a classical Mira.\n\nOn the other hand, the radial velocity amplitude of the pulsations should be quite a bit larger if the object is at SMC distances than if it is a foreground Galactic Mira variable.  In essence, one can apply the Baade-Wesselink method (Baade 1926; Wesselink 1946) to estimate the radius and hence distance to the object.  At SMC distances, the radius of the star should be about 1500 $R_\\odot$, so a variation of 40\\% about the mean radius is a variation of 600 $R_\\odot$.  The pulsations of Miras in general, and HV~2112 in particular are such that most of the variation takes place in a relatively small range of pulse phase.  If we assume that such a size variation takes place in 0.2 times the pulse period, or 120 days, then we expect a velocity of expansion of about 50 km/sec.  This speed is not large enough to be inherently problematic for either scenario discussed here, but does provide a means for estimating the stellar radius, and hence the distance to the star if a radial velocity monitoring campaign is undertaken. \n\n\\subsection{Population estimate}\n\nWe can make a crude estimate of the number of extrinsic S stars in the Galaxy with a massive AGB progenitors as part of testing the plausibility of the scenario.  S stars make about 4\\% of giants in the temperature range where M stars are normally found, and extrinsic S stars make about 1/3 of S stars (van Eck \\& Jorissen 2000).   Extrinsic S stars are thus about 1\\% of the number of stars that appear to be M giants in color space. The SMC spans about $3\\times10^{-4}$ of the solid angle of the sky.  The Milky Way has $\\sim10^{11}$ stars, of which about $10^9$ are in the halo, and about $10^7$ are halo M giants.  There should then be approximately 30 extrinsic S stars in the Milky Way halo projected against the SMC. If we further assume that only the extrinsic S stars whose progenitors were more massive than 4 $M_\\odot$ can have the required abundances of rubidium and molybdenum, we must correct for the fact that only 11\\% of the stars between 1 and 10 $M_\\odot$ (i.e. the ones that produce AGB stars without undergoing supernovae) are above 4 $M_\\odot$ (and hence are heavy enough for production of these elements).  We then expect a few extrinsic S stars with massive enough progenitors in the SMC field. Since we additionally require that they be in an AGB state themselves to explain the Mira variations and the Li production, the expected number falls by a factor of about 30 (Girardi et al. 2010), so our expected number of objects is about 0.1.  The scenario we propose thus quite plausibly places a source of the type we invoke in a location projected against the SMC, while also not placing so many such objects projected against the SMC that we would have expected to have found many of them already.\n\n\\section{Additional testable predictions of the scenario}\n\nThe scenario makes several additional testable predictions.  First and foremost, the object should be in a wide binary system.  Orbital periods of extrinsic S stars are generally at least 600 days (Jorissen \\& Mayor 1992).  The white dwarf in this system should likely be a ONeMg white dwarf, and hence should be of considerably higher mass that the S star.  Nonetheless, the motions should still be of\nrelatively low orbital velocity.  Assuming a total system mass of about 2\n$M_\\odot$ and an orbital period of about 2 years, the orbital velocity\nof the optically bright star should be about 20 km/sec, while the\norbital velocity of the white dwarf should be about 10 km/sec. \n\nAdditionally, the system may show some accretion by the white dwarf in\nthe system.  In Mira itself, for example, the white dwarf companion of\nthe optically bright star is seen to be accreting at about $10^{-10}\nM_\\odot$ per year (Sokoloski \\& Bildsten 2010), but the orbital period\nof Mira is about 500 years.  If, instead, this system has an orbital\nperiod of only a few years, the accretion rate can be expected to be\nmuch higher.  To first order, the mass accretion rate from a stellar\nwind can be estimated to be:\n\n", "index": 1, "text": "\\begin{equation}\n\\left(\\frac{\\dot{m}_{acc}}{\\dot{m}_{w}}\\right) = \\left(\\frac{v_{acc}}{{v}_{w}}\\right)^4 \\left(\\frac{M_{acc}}{M_{acc}+M_{don}}\\right)^2.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\left(\\frac{\\dot{m}_{acc}}{\\dot{m}_{w}}\\right)=\\left(\\frac{v_{acc}}{{v}_{w}}%&#10;\\right)^{4}\\left(\\frac{M_{acc}}{M_{acc}+M_{don}}\\right)^{2}.\" display=\"block\"><mrow><mrow><mrow><mo>(</mo><mfrac><msub><mover accent=\"true\"><mi>m</mi><mo>˙</mo></mover><mrow><mi>a</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>c</mi></mrow></msub><msub><mover accent=\"true\"><mi>m</mi><mo>˙</mo></mover><mi>w</mi></msub></mfrac><mo>)</mo></mrow><mo>=</mo><mrow><msup><mrow><mo>(</mo><mfrac><msub><mi>v</mi><mrow><mi>a</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>c</mi></mrow></msub><msub><mi>v</mi><mi>w</mi></msub></mfrac><mo>)</mo></mrow><mn>4</mn></msup><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><msub><mi>M</mi><mrow><mi>a</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mrow><msub><mi>M</mi><mrow><mi>a</mi><mo>⁢</mo><mi>c</mi><mo>⁢</mo><mi>c</mi></mrow></msub><mo>+</mo><msub><mi>M</mi><mrow><mi>d</mi><mo>⁢</mo><mi>o</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mrow></mfrac><mo>)</mo></mrow><mn>2</mn></msup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]