[{"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhere $H_0 \\equiv H_{s=0}$ is the initial hamiltonian in the center-of-mass system (CM) and $U_s$ is the unitary transformation. The flow parameter $s$ has dimensions of $[{\\rm energy}]^{-2}$ and in terms of the SRG cutoff $\\lambda$ with dimension of momentum is given by the relation $s=\\lambda^{-4}$. As usual, we split the hamiltonian as $H_s=T + V_s$, where $T \\equiv T^{\\rm cm}+T^{\\rm rel}$ is the kinetic energy, which we assume to be independent of $s$, and $V_s$ is the evolved potential. For a translational invariant system, i.e. $V_s \\equiv V_s^{\\rm rel}$, we can separate the CM and consider only the SRG evolution of the hamiltonian for the relative motion, $H_s^{\\rm rel}=T^{\\rm rel} + V_s^{\\rm rel}$, since the CM kinetic energy $T^{\\rm cm}$ does not contribute~\\cite{Jurgenson:2009}. For simplicity, in what follows we will drop the superscript $``{\\rm rel}\"$. The SRG flow equation in operator form can then be written as\n\n\n", "itemtype": "equation", "pos": 11658, "prevtext": "\n\n\\begin{frontmatter}\n\n\\title{Fixed points of the SRG evolution and the on-shell limit of the nuclear force}\n\n\\author[1]{E. Ruiz Arriola}\n\\author[2]{S. Szpigel}\n\\author[3]{V. S. Tim\\'oteo\n\\footnote{Corresponding author, tel.: +55 11 981 483 747, e-mail address: varese@ft.unicamp.br}}\n\n\\address[1]{Departamento de F\\'isica At\\'omica, Molecular y Nuclear and Instituto Carlos I de Fisica Te\\'orica y Computacional \\\\\nUniversidad de Granada, E-18071 Granada, Spain}\n\n\\address[2]{Centro de R\\'adio-Astronomia e Astrof\\'\\i sica Mackenzie, Escola de Engenharia,\nUniversidade Presbiteriana Mackenzie \\\\ 01302-907, S\\~ao Paulo, SP, Brasil}\n\n\\address[3]{Grupo de \\'Optica e Modelagem Num\\'erica - GOMNI, Faculdade de Tecnologia - FT,\nUniversidade Estadual de Campinas - UNICAMP \\\\ 13484-332, Limeira, SP, Brasil}\n\n\n\\begin{abstract}\nWe study the infrared limit of the similarity renormalization group\n(SRG) using a simple toy model for the nuclear force aiming to\ninvestigate the fixed points of the SRG evolution with both the Wilson\nand the Wegner generators. We show how a fully diagonal interaction at\nthe similarity cutoff $\\lambda \\rightarrow 0$ may be obtained from the\neigenvalues of the hamiltonian and quantify the diagonalness by means\nof operator norms. While the fixed points for both generators are\nequivalent when no bound-states are allowed by the interaction, the\ndifferences arising from the presence of the Deuteron bound-state can\nbe disentangled very clearly by analyzing the evolved interactions in\nthe infrared limit $\\lambda \\to 0$ on a finite momentum grid. Another\nissue we investigate is the location on the diagonal of the\nhamiltonian in momentum-space where the SRG evolution places the\nDeuteron bound-state eigenvalue once it reaches the fixed point.  This\nfinite momentum grid setup provides an alternative derivation of the\ncelebrated trace identities, as a by product. The different effects\ndue to either the Wilson or the Wegner generators on the binding\nenergies of $A=2,3,4$ systems are investigated and related to the\nocurrence of a Tjon-line which emerges as the minimum of an avoided crossing\nbetween $E_\\alpha= 4 E_t - 3 E_d$ and $E_\\alpha= 2 E_t $.\nAll infrared features of the flow equations are illustrated using the\ntoy model for the two-nucleon $S$-waves.\n\\end{abstract}\n\n\\end{frontmatter}\n\n\n\n\\section{Introduction}\n\nThe similarity renormalization group (SRG) approach was proposed\nindependently by Glazek and Wilson and\nWegner~\\cite{Glazek:1993rc,Glazek:1994qc,wegner1994flow,Kehrein:2006ti}\nand was initially applied in solid-state physics to simplify\nmany-particle randomly disordered systems. Since the solution of a\nmany-particle problem requires diagonalization of the hamiltonian, a\ntransformation which makes it more diagonal would be of great\napplicability, specially if the eigenvalues are preserved.  This idea\nwas then applied by Wegner in order to suppress the off-diagonal\nmatrix-elements of the hamiltonian by means of unitary transformations\n\\cite{wegner1994flow}. The unitarity of the transformations ensures\nisospectrality and the generator of the transformations can be chosen\nto be diagonal if one wants to drive the original hamiltonian towards\na band-diagonal form and to suppress its off-diagonal\nmatrix-elements. As a by-product one gets a framework where these\noff-diagonal components may be better handled in perturbation theory.\n\nThe application of the SRG approach to nuclear physics was proposed by\nBogner, Furnstahl and Perry~\\cite{Bogner:2006pc} with these\nsimplifications in mind and will be our concern here (for reviews see\ne.g. \\cite{Bogner:2009bt,Furnstahl:2012fn,Furnstahl:2013oba} and\nreferences therein). The first applications of the SRG method\nconsidered high-precision~\\cite{Wiringa:1994wb,Stoks:1994wp} and\nchiral effective field theory\n(ChEFT)~\\cite{Entem:2003ft,Epelbaum:2004fk} nucleon-nucleon ($NN$)\ninteractions as the input for the two-body flow equations.  Despite\ndifferent degrees of freedom and types of interaction, the nuclear\nmany-body problem has the same difficulty as the many-electron problem\nin solid-state physics. More diagonal hamiltonians result in great\nsimplification and faster convergence in nuclear structure\ncalculations. This feature gave rise to a whole program of application\nof the SRG methods in nuclear physics\n\\cite{Bogner:2006pc,Bogner:2009bt,Furnstahl:2012fn,Furnstahl:2013oba}. The\nformalism was then extended to three-body forces using hyperspherical\nmomentum representation \\cite{Wendt:2013bla}.\n\nYet in the two-nucleon system, the interplay between the SRG and a\nsubtractive renormalization approach\n\\cite{Frederico:1999ps,Timoteo:2005ia,Timoteo:2011mm,Szpigel:2012bc}\nwas investigated using the ChEFT $NN$ interaction at leading-order\n\\cite{Szpigel:2011bj}. Also, the role of long-distance symmetries in\neffective interactions obtained via SRG flow equations have been\nrecently investigated by us, showing that there is a particular SRG\nscale at which the $SU(4)$ spin-isospin Wigner symmetry is realized\nalmost exactly \\cite{Arriola:2013nja,Timoteo:2012tt}. This is a\nremarkable result which shows that despite the increasing popularity\nof the SRG ideas, techniques and extensive computational applications\nthere is still much to be learned from dedicated analysis. The present\npaper provides further insights along these lines.\n\nThe aim of this work is to explore the details underlying our recent\nresults scanning all values of the SRG cutoff and to extend them.  In\nour previous letter \\cite{Arriola:2014aia} a connection between the\ninfrared limit of the SRG evolution with the Wegner generator and\nLevinson's theorem \\cite{Ma:2006zzc} was established. Consequences of\nthe infrared interactions for few-nucleon systems and the nuclear\nmany-body problem were discussed in Ref. \\cite{Arriola:2013gya} where\na theoretical and phenomenologically successful prediction for the\nTjon-line has been advanced. This is a well known existing linear\ncorrelation between the binding energies of the triton and the\n$\\alpha$-particle which should be expected on the basis of scale\ninvariance~\\cite{Delfino:2007zu} (see e.g.  \\cite{Hammer:2012id} for a\nreview and references therein). Further consequences regarding unitary\nneutron matter in the on-shell limit with a calculation of the Bertsch\nparameter were addressed in \\cite{Arriola:2014tva} and an SRG\ndiscussion of the BCS pairing gap has also been undertaken in\nRef.~\\cite{Arriola:2015hra}.\n\nIn this work we investigate the fixed points of the SRG evolution in\ndetail using a simple toy model for the nuclear force in the\ntwo-nucleon $S$-waves as a particular illustration which simplifies\nthe computational effort considerably and allows for detailed\nnumerical studies in the infrared limit. However, in the infrared\nregion we will suggest that many features are fairly general and model\nindependent. Here we focus on the Wilson and the Wegner SRG\ngenerators, since the evolution with a block-diagonal generator\n\\cite{Anderson:2008mu} in the infrared region has already been studied\nin previous works \\cite{Arriola:2013yca,Arriola:2013era}, where the\nexplicit renormalization of a simple $NN$ force and the implicit\nrenormalization of a pionless effective field theory (EFT) at\nnext-to-leading order were shown to be equivalent over a wide range of\nthe renormalization scale. The SRG equations are mostly solved\nnumerically on a finite momentum grid with sufficiently many points as\nto approach the continuum and therefore the grid is viewed as an\nauxiliary means. Here, we will analyze many effects which can only be\nclearly disentangled with the aid of this momentum grid, which by\nitself has some implications on its own and provides both an infrared\nand ultraviolet cutoffs featuring two basic properties of finite\nnuclei, namely, the long wavelength character of weak binding systems\nas well as the finite size of atomic nuclei.  Kukulin and\ncollaborators in a series of recent and remarkable works have profited\nfrom these finite grids in the few-body problem including both bound\nand scattering states by analyzing Hamiltonian\neigenvalues~\\cite{kukulin2009discrete,Rubtsova:2010zz,Pomerantsev:2014ija,Rubtsova:2015owa}. It\nis conceivable that a judicious combination of SRG and this approach\nmay provide useful insights into the nuclear few-body problem.\n\n\nThis paper is organized as follows. In Section \\ref{sec:Operator} we\npresent the SRG flow equations in operator form and introduce some\nuseful functional notation both in the continuum limit and in the\ndiscretized form which allows for a discussion of fixed points and\ntheir stability. In Section~\\ref{sec:toy} we review the toy model\nwhich provides a quite reasonable description of the $NN$ system in\nthe $S$-wave channels at low-momenta and will be used in practice to\ncarry out our infrared analysis. In Section~\\ref{sec:SRG-grid} we deal\nspecifically with the SRG flow equations on a finite momentum\ngrid. The scattering problem as a Lippmann-Schwinger (LS) equation on\nthe finite momentum grid is analyzed in\nSection~\\ref{sec:scatt-grid}. There we provide a motivation to define\nthe phase-shift as an energy-shift which, unlike the conventional\nphase-shifts determined from the solution of the LS equation, is\ninvariant under unitary transformations on the grid. We illustrate the\nusefulness of the analysis by re-deriving a set of generalized trace\nidentities, first unveiled by Graham, Jaffe, Quandt and Weigel in\nRef.~\\cite{Graham:2001iv}, but starting from a momentum grid. Our\nnumerical results on these issues are presented in\nSection~\\ref{sec:numerical}.  There we focus on the crucial issue of\nthe ordering of states along the SRG evolution trajectory and the\nremarkable connection to Levinson's theorem through an energy-shift\nformula. Our interpretation corrects the erroneous implementation of\nKukulin and collaborators~\\cite{kukulin2009discrete}. Some of the\nconsequences of the correct identification and ordering of states for\nthe nuclear binding energies when approaching the infrared limit in\nthe $A=2,3,4$ systems are discussed in Section~\\ref{sec:nucl}.  There\nthe SRG cutoff parameters triggers the avoided crossing pattern,\nfamiliar from molecular physics, underlying the Tjon-line\ncorrelation. Finally, in Section~\\ref{sec:summary} we present a\nsummary of the results and our main conclusions.\n\n\n\n\\section{SRG flow equations in operator form}\n\\label{sec:Operator}\n\nThe similarity renormalization group (SRG) approach, developed by Glazek and Wilson~\\cite{Glazek:1993rc,Glazek:1994qc} and independently by Wegner~\\cite{wegner1994flow}, has been intensively\napplied in the context of nuclear physics to handle multi-nucleon forces in order to soften the\nshort-distance core~\\cite{Bogner:2006pc,Furnstahl:2013oba} with a\nrather universal pattern for nuclear symmetries~\\cite{Timoteo:2011tt,\n  Arriola:2013nja} and interactions~\\cite{Dainton:2013axa}. The basic\nstrategy underlying the application of the SRG methods to nuclear\nforces is to evolve an initial (bare) interaction $H$, which has been\nfitted to $NN$ scattering data, via a continuous\nunitary transformation that runs a cutoff $\\lambda$ on energy\ndifferences. Such a transformation generates a family of unitarily\nequivalent smooth interactions $H_{\\lambda} =\nU_{\\lambda}~H~U_{\\lambda}^{\\dagger}$ with a band-diagonal structure of\na prescribed width roughly given by the SRG cutoff\n$\\lambda$.\n\nWe employ the formulation for the SRG developed by Wegner~\\cite{wegner1994flow},\nwhich is based on a non-perturbative flow equation that governs the\nunitary evolution of the hamiltonian with a flow parameter $s$ that ranges from $0$ to $\\infty$,\n\n\n", "index": 1, "text": "\\begin{equation}\nH_s=U_s H_0 U_s^\\dagger\\; ,\n\\label{eq:SRGflow}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"H_{s}=U_{s}H_{0}U_{s}^{\\dagger}\\;,\" display=\"block\"><mrow><mrow><msub><mi>H</mi><mi>s</mi></msub><mo>=</mo><mrow><msub><mi>U</mi><mi>s</mi></msub><mo>⁢</mo><msub><mi>H</mi><mn>0</mn></msub><mo>⁢</mo><mpadded width=\"+2.8pt\"><msubsup><mi>U</mi><mi>s</mi><mo>†</mo></msubsup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwith\n\n\n", "itemtype": "equation", "pos": 12688, "prevtext": "\n\n\\noindent\nwhere $H_0 \\equiv H_{s=0}$ is the initial hamiltonian in the center-of-mass system (CM) and $U_s$ is the unitary transformation. The flow parameter $s$ has dimensions of $[{\\rm energy}]^{-2}$ and in terms of the SRG cutoff $\\lambda$ with dimension of momentum is given by the relation $s=\\lambda^{-4}$. As usual, we split the hamiltonian as $H_s=T + V_s$, where $T \\equiv T^{\\rm cm}+T^{\\rm rel}$ is the kinetic energy, which we assume to be independent of $s$, and $V_s$ is the evolved potential. For a translational invariant system, i.e. $V_s \\equiv V_s^{\\rm rel}$, we can separate the CM and consider only the SRG evolution of the hamiltonian for the relative motion, $H_s^{\\rm rel}=T^{\\rm rel} + V_s^{\\rm rel}$, since the CM kinetic energy $T^{\\rm cm}$ does not contribute~\\cite{Jurgenson:2009}. For simplicity, in what follows we will drop the superscript $``{\\rm rel}\"$. The SRG flow equation in operator form can then be written as\n\n\n", "index": 3, "text": "\\begin{equation}\n\\frac{d H_s}{ds}=\\frac{d V_s}{ds}=[\\eta_s,H_s]\\; ,\n\\label{wegfloweq}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{dH_{s}}{ds}=\\frac{dV_{s}}{ds}=[\\eta_{s},H_{s}]\\;,\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>H</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>=</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>V</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>=</mo><mrow><mo stretchy=\"false\">[</mo><msub><mi>η</mi><mi>s</mi></msub><mo>,</mo><msub><mi>H</mi><mi>s</mi></msub><mo rspace=\"5.3pt\" stretchy=\"false\">]</mo></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nand is to be solved with the boundary condition $H_s|_{_{s \\to 0}} \\equiv H_0 = T + V_0$. The anti-hermitian operator $\\eta_s$ which specifies the unitary transformation $U_s$ is usually taken as $\\eta_s=[G_s,H_s]$, where $G_s$ is a hermitian operator which we will call the SRG generator since it defines $\\eta_s$ and so the flow of the hamiltonian. The most popular choices for the generator are the relative kinetic energy $G_s=T$ (Wilson generator)~\\cite{Bogner:2006pc}, the evolving diagonal part of the hamiltonian $G_s={\\rm diag}(H_s)=H^{D}_s$ (Wegner generator)~\\cite{Glazek:1994qc} and the so called block-diagonal generator $G_s=H^{BD}_s=PH_sP+QH_sQ$, where the operators $P$ and $Q=1-P$ are orthogonal projectors ($P^2 = P$, $Q^2 = Q$ , $QP=PQ=0$) for states below and above a given momentum scale $\\Lambda_{BD}$~\\cite{Anderson:2008mu}~\\footnote{This is a unitary implementation\n   to all energies of the previously proposed $V_{\\rm low k}$ approach~\\cite{Bogner:2001gq}.\n   Novel generators have been proposed in \\cite{Li:2011sr,Dicaire:2014fra}.}.\n\nSo far the SRG equations are quite general and can be used to evolve any hamiltonian. In what follows we will restrict to the case of $NN$ interactions in the center-of-mass (CM) system.\n\n\n\n\\subsection{Partial-wave equations}\n\nAfter decomposition of the $NN$ interaction in partial waves the\nstructure of the SRG flow equations simplifies considerably in the\noff-diagonal relative momentum-space basis (see\ne.g.~\\cite{Szpigel:2010bj} for an explicit derivation and details) for\nwhich the following normalization in the completeness relation will be\nassumed (here and in what follows we use units such that\n$\\hbar=c=M=1$, where $M$ is the nucleon mass):\n\n\\begin{eqnarray}\n\\frac{2}{\\pi} \\int p^2 dp | p \\rangle \\langle p |={\\bf 1} \\; .\n\\label{norm}\n\\end{eqnarray}\n\n\\noindent\nInserting this into Eq.~(\\ref{wegfloweq}) with the Wilson generator, $G_s=T$, the flow equation for the SRG evolution of the $NN$ potential is given by (we drop the partial-wave quantum numbers for simplicity)\n\n\\begin{eqnarray}\n\\frac{dV_{s}(p,p')}{ds}=-(\\epsilon_p-\\epsilon_p')^2 \\; V_{s}(p,p')+\\frac{2}{\\pi} \\int_{0}^{\\infty}dq \\; q^2\\;\n(\\epsilon_p+\\epsilon_p'-2 \\epsilon_q)\\; V_{s}(p,q)\\; V_{s}(q,p') \\; ,\n\\label{flowWil}\n\\end{eqnarray}\n\n\\noindent\nwhere $\\epsilon_p =\\langle p |T| p \\rangle =p^2$. The flow equation for the SRG evolution with the Wegner generator, $G_s=H^{D}_s$, reads\n\n\\begin{eqnarray}\n\\frac{dV_{s}(p,p')}{ds} =-(\\epsilon_p-\\epsilon_p')\\left[e_{p}(s) - e_{p'}(s)\\right]V_{s}(p,p')+ \\frac{2}{\\pi} \\int_{0}^{\\infty}dq \\; q^2\\;\n\\left[e_{p}(s) + e_{p'}(s) - 2 e_q(s)\\right]\\; V_{s}(p,q)\\; V_{s}(q,p') \\; ,\n\\label{flowWeg}\n\\end{eqnarray}\n\n\\noindent\nwhere $e_{p}(s) = \\langle p |H^{D}_s| p \\rangle=p^2 + V_s(p,p)$. As we\nsee, these are integro-differential equations which cannot generally be\nsolved analytically (see however~\\cite{Szpigel:1999gf,Jones:2013cba})\nand require a massive computational effort to be solved numerically. We will\ntackle this problem below by the traditional discretization method of\nthe continuum~\\footnote{However, the usefulness of discretizing the\n  continuum equations goes beyond the practical need of numerically\n  implementing the scattering problem; it provides a theoretical\n  bridge between the energy-shift in the spectrum and the scattering\n  phase-shifts. We will see that this becomes a crucial aspect when\n  the number of grid points is reduced to a minimum.}.\n\n\n\n\\subsection{Operator space}\n\nMost compact features of the SRG formalism can be best appreciated\nwithin an operator space setup. We start with some remarks from the\noperator theory for finite-dimensional operators in order to introduce\nsome notation (see e.g. the standard\ntextbook~\\cite{kolmogorov1999elements}). For operators acting on a\nHilbert space endowed with a scalar product of states $\\psi$ and\n$\\varphi$ such as $\\langle \\psi, \\varphi \\rangle$, we can also define\na further scalar product between operators $A$ and $B$, namely\n\n\\begin{eqnarray}\n\\langle A, B \\rangle = {\\rm Tr} \\left[ A^\\dagger B \\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nFrom here we define the Frobenius norm as usual \n\\begin{eqnarray}\n|| A ||^2 = \\langle A, A \\rangle = {\\rm Tr} \\left[ A^\\dagger A \\right] \\; , \n\\end{eqnarray}\n\n\\noindent\nand hence the induced distance between\noperators as\n\\begin{eqnarray}\nd[A,B]=||A-B||  \\; .\n\\end{eqnarray}\n\n\\noindent\nThe norm can also be defined as\n\\begin{eqnarray}\n|| A || = {\\rm sup}_{||\\psi||=1} || A \\psi || \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere the standard scalar product induced norm, $|| \\psi || =+ \\sqrt{\n  \\langle \\psi, \\psi \\rangle}$ has been introduced.  Of course, this\nrequires finite norm operators $||A|| < \\infty$ which is unfortunately\nnot the case for the usual unbounded operators in quantum mechanics,\nsuch as the kinetic energy. Therefore an ultraviolet cutoff $\\Lambda$\nis generally assumed to operate here. Using the partial-wave relative\nmomentum-space normalization metric given in Eq.~(\\ref{norm}) we have\n\n\\begin{eqnarray}\n\\langle \\psi , \\psi \\rangle = \\frac{2}{\\pi}\\int_0^\\infty dp ~ p^2  ~ |\\psi(p)|^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nThus, the kinetic energy would have infinite norm , $ || T || \\to\n\\Lambda^2/M \\to \\infty$ if everything is taken literally. However,\nnote that the continuum SRG flow equations do not need the kinetic energy\nto be bound, but rather the potential energy. So, the implicit\nassumption is that at very high energies the kinetic energy dominates\nover the potential energy and hence SRG flow equations are well defined\nprovided the value of the potential does not boundlessly grow.  The\nfirst problems we encounter with all these properties are: i) the fact\nthat the momentum-space basis spans a continuum set and ii) the\noperators are unbounded. This difficulty is circumvented in practice\nby using a finite grid in momentum-space and also introducing a\nhigh-momentum cutoff $p_{{\\rm max}} = \\Lambda$ which will be assumed\nbelow.\n\n\n\n\\subsection{Isospectral flow and fixed points}\n\nIn this section we briefly review the concepts of isospectral flow and fixed points incorporated in the\nSRG evolution and the variational interpretation in operator space.\n\nThe isospectrality of the SRG flow equation becomes evident from the\ntrace invariance property of the evolved hamiltonian $H_s$. For any\nchoice of the SRG generator $G_s$ we have a unitary transformation and\nhence\n\n\\begin{eqnarray}\n{\\rm Tr}~ H_s^n = {\\rm Tr}~ H_0^n \\; ,\n\\end{eqnarray}\n\nfor any integer $n$. This property follows directly from the\ncommutator structure of the SRG flow equation plus the regulator\nassumption\\footnote{Mathematically, such a property is ill defined in\n  the continuum limit since even for $n=1$ one has $ {\\rm Tr} (V_s)=\n  \\int_0^\\infty p^2 V_s(p,p) = \\int_0^\\infty r^2 dr V(r,r)$ which for\n  a local potential $V(r,r') = V(r) \\delta (r-r')$ diverges as the\n  momentum cutoff. Also, the trace of a commutator ${\\rm Tr}[A,B]$\n  only vanishes when both ${\\rm Tr}(AB)$ and ${\\rm Tr}(BA)$ are\n  finite, as the choice $A=p$ and $B=x$ clearly illustrates, since\n  $[p,x]= - i\\hbar$ and hence ${\\rm Tr}[p,x]= - i \\hbar ~{\\rm Tr}~\n  {\\bf I} = \\infty$. We will see below the correct mathematical\n  interpretation of the isospectral property on the light of the\n  so-called trace identities.}. Indeed, using the cyclic properties of the trace we get\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~H_s^n=n~{\\rm Tr}\\left(H_s^{n-1}\\frac{d H_s}{ds}\\right)=n~{\\rm Tr}\\left(H_s^{n-1}[\\eta_s,H_s]\\right)=0 \\, .\n\\end{eqnarray}\n\nFixed points of the SRG evolution correspond to stationary solutions of the flow equation, Eq.~(\\ref{eq:SRGflow}),\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = [[G_s, H_s],H_s] = 0 \\; .\n\\label{eq:fixed}\n\\end{eqnarray}\n\n\\noindent\nThis condition implies that there is a basis in which both $[G_s, H_s]$ and $H_s$ become simultaneously diagonal at a fixed point. The question is what choices of the generator $G_s$ actually drive the hamiltonian $H_s$ to the diagonal form. For generators $G_s$ which satisfy $d/ds({\\rm Tr}~ G_s^2)=0$ and using the cyclic properties of the trace and the invariance of ${\\rm Tr}~ H_s^n$, we get that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~(H_s-G_s)^2=2~{\\rm Tr}~[G_s,H_s]^2=-2~{\\rm Tr}\\left[\\left(i~[G_s,H_s]\\right)^\\dagger \\left(i~[G_s,H_s]\\right)\\right]\\le 0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nbecause $ A \\equiv i~[G_s,H_s] = A^\\dagger$ is a self-adjoint operator and therefore $A^\\dagger A $ is a semi-definite positive operator. Since ${\\rm Tr}~ (H_s-G_s)^2$ is positive but its derivative is negative, the limit $s \\to \\infty$ exists and corresponds to the infrared fixed point of the SRG evolution ($\\lambda \\to 0$), at which the hamiltonian $H_s$ becomes diagonal. Thus, the SRG flow equation just provides a continuous procedure to diagonalize the initial hamiltonian $H_0 = T + V_0$.\n\nIn the case of the SRG evolution with the Wilson generator, $G_s=T$, the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds}=\\frac{d V_s}{ds} = [[T,H_s],H_s]=[[T,V_s],T+V_s] \\; .\n\\end{eqnarray}\n\n\\noindent\nWe then get for $||V_s|| \\equiv {\\rm Tr}~V_s^2$ that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~V_s^2 = 2~{\\rm Tr}~[T,V_s]^2 = -2~{\\rm Tr}\\left[\\left(i~[T,V_s]\\right)^\\dagger \\left(i~[T,V_s]\\right)\\right]\n\\le 0  \\; .\n\\end{eqnarray}\n\n\\noindent\nAs a consequence of this and using the unitary equivalence, $H_s = T+V_s = U_sH_0 U_s^\\dagger$, we get that\n\n\\begin{eqnarray}\n0 < {\\rm Tr}~ V_s^2 \\le {\\rm Tr}~ V^2_0  \\; .\n\\end{eqnarray}\n\n\\noindent\nTherefore there must be a minimum value obtained at the limit $s \\to\n\\infty$ which also implies in $[T,V_{s \\to \\infty}]=0$ due to the stationary\ncondition on the derivative for the infrared fixed point. Hence\n\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} {\\rm Tr}~V_s^2 = \\min_{V_s} {\\rm Tr}~ V_s^2 \\Big|_{H_s= T+V_s = U_s H_0 U_s^\\dagger}  \\; .\n\\end{eqnarray}\n\n\\noindent\nThus, in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$) the SRG\nevolution with the Wilson generator yields asymptotically to the\nsmallest potential, in the Frobenius norm sense, giving the same\nspectrum as the initial potential $V_0$ and commuting with the kinetic\nenergy $T$, i.e.  being diagonal in momentum-space. This is a rather\ninteresting result as it provides a working definition on the ``size''\nof the potential, and moreover different potentials can actually be\ncompared using the distance between the operators induced by the\nFrobenius norm.  Furthermore, this can be interpreted as a\nquantitative measure of the off-shellness of the interaction. In the\npartial-wave relative momentum-space basis the orbital degeneracy\ninduced by the $(2/\\pi) p^2 dp$ integration measure in the Frobenius\nnorm has two complementary effects. While it suppresses the\ncontribution to the norm from low-energy states it also enhances the\ncontribution from high-energy components. Thus, minimizing the\npotential along the SRG evolution trajectory transfers very\nefficiently high-energy components into low-energy components. This\nprovides a working scheme where any short-distance, or equivalently\nhigh-momentum core, becomes softer. It is fair to say that this is the\nmain reason why SRG methods have become popular in realistic nuclear\napplications. For completeness let us mention that there is an\nalternative interpretation of softness of the interaction not based on\nthe Frobenius norm, and based on the insightful work of\nWeinberg~\\cite{Weinberg:1963zza} and taken up by recent studies from\nseveral viewpoints~\\cite{Bogner:2006tw,Perez:2014bua} where the\nrepulsive character of the interaction at short-distance plays a key\nrole.  At present the connection between these two alternatives, while\nsuggesting different measures of the softness, is somewhat vague and\nwe will not dwell into it here. In our case, we will deal with a\npotential toy model where the repulsive piece is absent from the start\n(see Section~\\ref{sec:toy}).\n\nIn the case of the SRG evolution with the Wegner generator, $G_s=H^{D}_s$, the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = \\frac{d V_s}{ds}=[[H^{D}_s,H_s],H_s] \\; .\n\\end{eqnarray}\n\n\\noindent\nThen, in this case we get for $|| H_s-H^{D}_s ||^2 \\equiv {\\rm Tr}~ (H_s-H^{D}_s)^2$ that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~(H_s-H^{D}_s)^2=2~{\\rm Tr}~[H^{D}_s,H_s]^2=-2~{\\rm Tr}~\\left[\\left(i~[H^{D}_s,H_s]\\right)^\\dagger \\left(i~[H^{D}_s,H_s]\\right)\\right]\n\\le 0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that $|| H_s-H^{D}_s || \\to 0$ and so\n\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} H_s = H^{D}_s = \\min_{H_s} || H_s-H^{D}_s ||  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich just shows that the Wegner generator minimizes the distance to\nits diagonal matrix-elements keeping the eigenvalues of the original\nHamiltonian. Of course, if the hamiltonian becomes diagonal the\neigenvectors cannot be free momentum eigenstates.\n\nFinally, for the block-diagonal generator we define two orthogonal projection operators $P+Q=1$ which split the states\nbelow or above a given momentum scale $\\Lambda_{BD}$. In this case the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = [[P H_s P + Q H_s Q ,H_s],H_s]  \\; .\n\\end{eqnarray}\n\n\\noindent\nWe then get that the evolution makes the asymptotic hamiltonian block-diagonal hence minimizing the off-diagonal matrix-elements,\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} H_s = P H_s P+Q H_s Q = \\min_{H_s} || H_s-P H_s P-Q H_s Q||  \\; .\n\\end{eqnarray}\n\n\n\n\\subsection{Discrete equations}\n\\label{sec:discrete}\n\nOnly in few cases the SRG operator equations can be handled in the\ncontinuum~\\cite{Szpigel:1999gf,Jones:2013cba}. In this section we\nanalyze the details of the implementation of the SRG when a finite\ndimensional reduction of the model space is imposed. The particular\ncase of a momentum grid discretization of the continuum will be\ndiscussed specifically in a later section. For simplicity we will consider a basis of eigenstates $| n \\rangle$ of the kinetic energy operator $T$ on a finite $N$-dimensional Hilbert space ${\\cal H}_N$, namely $T | n \\rangle = \\epsilon_n | n \\rangle~(n=1,2,\\dots,N)$, and assume that the corresponding spectrum of eigenvalues $\\epsilon_n$ is non-degenerate (similar to what happens in the partial-wave relative momentum-space basis for which $\\epsilon_n=p_n^2$). Thus, the matrix-elements of the hamiltonian $H= T + V$ in this basis read $H_{nm}\\equiv \\langle n |H| m \\rangle=\\delta_{nm}\\epsilon_n + V_{nm}$.\n\nThe discrete SRG flow equations for the matrix-elements of the hamiltonian in the case of the Wilson generator can be written in the form\n\n\\begin{eqnarray}\n\\frac{d H_{nm}(s)}{ds}&=&\\sum_{k} (\\epsilon_n+\\epsilon_m-2 \\epsilon_k) H_{nk}(s) H_{km}(s)\\nonumber\\\\\n &=&-(\\epsilon_n-\\epsilon_m)\\left[e_{n}(s)-e_{m}(s)\\right] H_{nm}(s) +\n\\sum_{k \\neq n,m} (\\epsilon_n+\\epsilon_m-2 \\epsilon_k) H_{nk}(s) H_{km}(s)  \\; ,\n\\label{eq:discWil}\n\\end{eqnarray}\n\n\\noindent\nwhere $H_{nm}(s)=\\delta_{nm}\\epsilon_n + V_{nm}(s)$ and $e_{n}(s)\\equiv H_{nn}(s)=\\epsilon_n + V_n(s)$. In the case of the Wegner generator the discrete SRG flow equations read\n\n\\begin{eqnarray}\n\\frac{d H_{nm}(s)}{ds} &=& \\sum_k \\left[e_{n}(s)+ e_{m}(s)- 2 e_{k}(s) \\right] H_{nk}(s) H_{km}(s) \\nonumber\\\\\n&=&-\\left[e_{n}(s)-e_{m}(s)\\right]^2 H_{nm}(s) +\n\\sum_{k \\neq n,m} \\left[e_{n}(s)+e_{m}(s)-2 e_{k}(s)\\right] H_{nk}(s) H_{km}(s) \\; .\n\\label{eq:discWeg}\n\\end{eqnarray}\n\n\\noindent\nThese equations are to be solved with the boundary conditions $H_{nm}(s)|_{_{s \\to 0}}\\equiv H_{nm}(0)=\\delta_{nm}\\epsilon_n + V_{nm}(0)$.\n\nThe fixed points of the SRG evolution with a given generator $G_s$ correspond to the stationary solutions of the SRG flow equations for the matrix-elements of the hamiltonian,\n\n\n", "itemtype": "equation", "pos": 12806, "prevtext": "\n\n\\noindent\nwith\n\n\n", "index": 5, "text": "\\begin{equation}\n\\eta_s=\\frac{d U_s}{ds}U_s^{\\dagger}=-\\eta_s^\\dagger\\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\eta_{s}=\\frac{dU_{s}}{ds}U_{s}^{\\dagger}=-\\eta_{s}^{\\dagger}\\;,\" display=\"block\"><mrow><mrow><msub><mi>η</mi><mi>s</mi></msub><mo>=</mo><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>U</mi><mi>s</mi></msub></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>⁢</mo><msubsup><mi>U</mi><mi>s</mi><mo>†</mo></msubsup></mrow><mo>=</mo><mrow><mo>-</mo><mpadded width=\"+2.8pt\"><msubsup><mi>η</mi><mi>s</mi><mo>†</mo></msubsup></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhich implies, for both the Wilson ($G_s=T$) and the Wegner ($G_s=H^{D}_s$) generators, that in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$) the hamiltonian $H_s$ becomes diagonal \\footnote{One should note that the stationary condition in operator form, Eq.~(\\ref{eq:fixed}), in principle just requires that at a fixed point both $[G_s,H_s]$ and $H_s$ become diagonal in the same basis, not necessarily the one in which the generator $G_s$ is diagonal. However, we can show that the condition $[[G_s,H_s],H_s]=0$ also implies that $[G_s,H_s]=0$. Taking a discrete basis in which $H_s$ is diagonal, i.e. $H_{\\alpha \\beta}(s)= \\delta_{\\alpha \\beta}H_{\\alpha}(s)$, we have\n\n\\begin{eqnarray}\n\\langle \\alpha |[G_s, H_s] | \\beta \\rangle=\\sum_\\gamma \\left[G_{\\alpha \\gamma}(s) H_{ \\gamma \\beta}(s) - H_{\\alpha \\gamma}(s)\nG_{\\gamma \\beta}(s)\\right]=  G_{\\alpha \\beta}(s)\\left[H_{\\beta}(s)- H_{\\alpha}(s)\\right] \\; . \\nonumber\n\\end{eqnarray}\n\n\\noindent\nThus, for $\\alpha \\neq \\beta$ we get, in the absence of degeneracies, that $\\langle \\alpha |[G_s, H_s] | \\beta \\rangle = 0$ only if $G_{\\alpha \\beta}(s)= 0$ and so both the hamiltonian $H_s$ and the generator $G_s$ are diagonal in the same basis. Of course, this becomes a trivial result for generators $G_s$ which by definition are diagonal in the basis of eigenstates of the kinetic energy operator $T$, such as the Wilson and the Wegner generators.}. Thus, we have that\n\n\\begin{eqnarray}\n\\lim_{s\\to \\infty} H_{nm}(s)=\\delta_{nm} E_n\\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $\\{E_n\\}_{n=1}^N$ denotes the spectrum of discrete eigenvalues of the hamiltonian $H_s$ obtained in the infrared limit $s \\to \\infty$, which are given by\n\n\\begin{eqnarray}\nE_n \\equiv \\lim_{s\\to \\infty}e_n(s)=\\epsilon_n + V_n(s \\to \\infty)\\; .\n\\end{eqnarray}\n\n\n\n\n\\subsubsection{Ordering of the spectrum induced by the SRG evolution}\n\nAs we have shown, the SRG evolution with both the Wilson and the Wegner generators on a finite $N$-dimensional discrete space have infrared fixed points at which the hamiltonian becomes diagonal. Thus, we have two interpolating SRG trajectories between the initial bare hamiltonian, $H_0$, and the final one, $H_{s \\to \\infty}$. From this point of view, there seems to be no conceptual difference between the SRG evolution with both generators, since the isospectrality of the SRG flow equation guarantees the invariance of the spectrum of eigenvalues of the hamiltonian $H_{s}$. This naive argument overlooks an important detail: the fact that through the SRG evolution the basis of eigenstates $|\\psi_{\\alpha} (s)\\rangle$ of the hamiltonian $H_s$ is actually changing, i.e.\n\n\n", "itemtype": "equation", "pos": 28520, "prevtext": "\n\n\\noindent\nand is to be solved with the boundary condition $H_s|_{_{s \\to 0}} \\equiv H_0 = T + V_0$. The anti-hermitian operator $\\eta_s$ which specifies the unitary transformation $U_s$ is usually taken as $\\eta_s=[G_s,H_s]$, where $G_s$ is a hermitian operator which we will call the SRG generator since it defines $\\eta_s$ and so the flow of the hamiltonian. The most popular choices for the generator are the relative kinetic energy $G_s=T$ (Wilson generator)~\\cite{Bogner:2006pc}, the evolving diagonal part of the hamiltonian $G_s={\\rm diag}(H_s)=H^{D}_s$ (Wegner generator)~\\cite{Glazek:1994qc} and the so called block-diagonal generator $G_s=H^{BD}_s=PH_sP+QH_sQ$, where the operators $P$ and $Q=1-P$ are orthogonal projectors ($P^2 = P$, $Q^2 = Q$ , $QP=PQ=0$) for states below and above a given momentum scale $\\Lambda_{BD}$~\\cite{Anderson:2008mu}~\\footnote{This is a unitary implementation\n   to all energies of the previously proposed $V_{\\rm low k}$ approach~\\cite{Bogner:2001gq}.\n   Novel generators have been proposed in \\cite{Li:2011sr,Dicaire:2014fra}.}.\n\nSo far the SRG equations are quite general and can be used to evolve any hamiltonian. In what follows we will restrict to the case of $NN$ interactions in the center-of-mass (CM) system.\n\n\n\n\\subsection{Partial-wave equations}\n\nAfter decomposition of the $NN$ interaction in partial waves the\nstructure of the SRG flow equations simplifies considerably in the\noff-diagonal relative momentum-space basis (see\ne.g.~\\cite{Szpigel:2010bj} for an explicit derivation and details) for\nwhich the following normalization in the completeness relation will be\nassumed (here and in what follows we use units such that\n$\\hbar=c=M=1$, where $M$ is the nucleon mass):\n\n\\begin{eqnarray}\n\\frac{2}{\\pi} \\int p^2 dp | p \\rangle \\langle p |={\\bf 1} \\; .\n\\label{norm}\n\\end{eqnarray}\n\n\\noindent\nInserting this into Eq.~(\\ref{wegfloweq}) with the Wilson generator, $G_s=T$, the flow equation for the SRG evolution of the $NN$ potential is given by (we drop the partial-wave quantum numbers for simplicity)\n\n\\begin{eqnarray}\n\\frac{dV_{s}(p,p')}{ds}=-(\\epsilon_p-\\epsilon_p')^2 \\; V_{s}(p,p')+\\frac{2}{\\pi} \\int_{0}^{\\infty}dq \\; q^2\\;\n(\\epsilon_p+\\epsilon_p'-2 \\epsilon_q)\\; V_{s}(p,q)\\; V_{s}(q,p') \\; ,\n\\label{flowWil}\n\\end{eqnarray}\n\n\\noindent\nwhere $\\epsilon_p =\\langle p |T| p \\rangle =p^2$. The flow equation for the SRG evolution with the Wegner generator, $G_s=H^{D}_s$, reads\n\n\\begin{eqnarray}\n\\frac{dV_{s}(p,p')}{ds} =-(\\epsilon_p-\\epsilon_p')\\left[e_{p}(s) - e_{p'}(s)\\right]V_{s}(p,p')+ \\frac{2}{\\pi} \\int_{0}^{\\infty}dq \\; q^2\\;\n\\left[e_{p}(s) + e_{p'}(s) - 2 e_q(s)\\right]\\; V_{s}(p,q)\\; V_{s}(q,p') \\; ,\n\\label{flowWeg}\n\\end{eqnarray}\n\n\\noindent\nwhere $e_{p}(s) = \\langle p |H^{D}_s| p \\rangle=p^2 + V_s(p,p)$. As we\nsee, these are integro-differential equations which cannot generally be\nsolved analytically (see however~\\cite{Szpigel:1999gf,Jones:2013cba})\nand require a massive computational effort to be solved numerically. We will\ntackle this problem below by the traditional discretization method of\nthe continuum~\\footnote{However, the usefulness of discretizing the\n  continuum equations goes beyond the practical need of numerically\n  implementing the scattering problem; it provides a theoretical\n  bridge between the energy-shift in the spectrum and the scattering\n  phase-shifts. We will see that this becomes a crucial aspect when\n  the number of grid points is reduced to a minimum.}.\n\n\n\n\\subsection{Operator space}\n\nMost compact features of the SRG formalism can be best appreciated\nwithin an operator space setup. We start with some remarks from the\noperator theory for finite-dimensional operators in order to introduce\nsome notation (see e.g. the standard\ntextbook~\\cite{kolmogorov1999elements}). For operators acting on a\nHilbert space endowed with a scalar product of states $\\psi$ and\n$\\varphi$ such as $\\langle \\psi, \\varphi \\rangle$, we can also define\na further scalar product between operators $A$ and $B$, namely\n\n\\begin{eqnarray}\n\\langle A, B \\rangle = {\\rm Tr} \\left[ A^\\dagger B \\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nFrom here we define the Frobenius norm as usual \n\\begin{eqnarray}\n|| A ||^2 = \\langle A, A \\rangle = {\\rm Tr} \\left[ A^\\dagger A \\right] \\; , \n\\end{eqnarray}\n\n\\noindent\nand hence the induced distance between\noperators as\n\\begin{eqnarray}\nd[A,B]=||A-B||  \\; .\n\\end{eqnarray}\n\n\\noindent\nThe norm can also be defined as\n\\begin{eqnarray}\n|| A || = {\\rm sup}_{||\\psi||=1} || A \\psi || \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere the standard scalar product induced norm, $|| \\psi || =+ \\sqrt{\n  \\langle \\psi, \\psi \\rangle}$ has been introduced.  Of course, this\nrequires finite norm operators $||A|| < \\infty$ which is unfortunately\nnot the case for the usual unbounded operators in quantum mechanics,\nsuch as the kinetic energy. Therefore an ultraviolet cutoff $\\Lambda$\nis generally assumed to operate here. Using the partial-wave relative\nmomentum-space normalization metric given in Eq.~(\\ref{norm}) we have\n\n\\begin{eqnarray}\n\\langle \\psi , \\psi \\rangle = \\frac{2}{\\pi}\\int_0^\\infty dp ~ p^2  ~ |\\psi(p)|^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nThus, the kinetic energy would have infinite norm , $ || T || \\to\n\\Lambda^2/M \\to \\infty$ if everything is taken literally. However,\nnote that the continuum SRG flow equations do not need the kinetic energy\nto be bound, but rather the potential energy. So, the implicit\nassumption is that at very high energies the kinetic energy dominates\nover the potential energy and hence SRG flow equations are well defined\nprovided the value of the potential does not boundlessly grow.  The\nfirst problems we encounter with all these properties are: i) the fact\nthat the momentum-space basis spans a continuum set and ii) the\noperators are unbounded. This difficulty is circumvented in practice\nby using a finite grid in momentum-space and also introducing a\nhigh-momentum cutoff $p_{{\\rm max}} = \\Lambda$ which will be assumed\nbelow.\n\n\n\n\\subsection{Isospectral flow and fixed points}\n\nIn this section we briefly review the concepts of isospectral flow and fixed points incorporated in the\nSRG evolution and the variational interpretation in operator space.\n\nThe isospectrality of the SRG flow equation becomes evident from the\ntrace invariance property of the evolved hamiltonian $H_s$. For any\nchoice of the SRG generator $G_s$ we have a unitary transformation and\nhence\n\n\\begin{eqnarray}\n{\\rm Tr}~ H_s^n = {\\rm Tr}~ H_0^n \\; ,\n\\end{eqnarray}\n\nfor any integer $n$. This property follows directly from the\ncommutator structure of the SRG flow equation plus the regulator\nassumption\\footnote{Mathematically, such a property is ill defined in\n  the continuum limit since even for $n=1$ one has $ {\\rm Tr} (V_s)=\n  \\int_0^\\infty p^2 V_s(p,p) = \\int_0^\\infty r^2 dr V(r,r)$ which for\n  a local potential $V(r,r') = V(r) \\delta (r-r')$ diverges as the\n  momentum cutoff. Also, the trace of a commutator ${\\rm Tr}[A,B]$\n  only vanishes when both ${\\rm Tr}(AB)$ and ${\\rm Tr}(BA)$ are\n  finite, as the choice $A=p$ and $B=x$ clearly illustrates, since\n  $[p,x]= - i\\hbar$ and hence ${\\rm Tr}[p,x]= - i \\hbar ~{\\rm Tr}~\n  {\\bf I} = \\infty$. We will see below the correct mathematical\n  interpretation of the isospectral property on the light of the\n  so-called trace identities.}. Indeed, using the cyclic properties of the trace we get\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~H_s^n=n~{\\rm Tr}\\left(H_s^{n-1}\\frac{d H_s}{ds}\\right)=n~{\\rm Tr}\\left(H_s^{n-1}[\\eta_s,H_s]\\right)=0 \\, .\n\\end{eqnarray}\n\nFixed points of the SRG evolution correspond to stationary solutions of the flow equation, Eq.~(\\ref{eq:SRGflow}),\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = [[G_s, H_s],H_s] = 0 \\; .\n\\label{eq:fixed}\n\\end{eqnarray}\n\n\\noindent\nThis condition implies that there is a basis in which both $[G_s, H_s]$ and $H_s$ become simultaneously diagonal at a fixed point. The question is what choices of the generator $G_s$ actually drive the hamiltonian $H_s$ to the diagonal form. For generators $G_s$ which satisfy $d/ds({\\rm Tr}~ G_s^2)=0$ and using the cyclic properties of the trace and the invariance of ${\\rm Tr}~ H_s^n$, we get that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~(H_s-G_s)^2=2~{\\rm Tr}~[G_s,H_s]^2=-2~{\\rm Tr}\\left[\\left(i~[G_s,H_s]\\right)^\\dagger \\left(i~[G_s,H_s]\\right)\\right]\\le 0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nbecause $ A \\equiv i~[G_s,H_s] = A^\\dagger$ is a self-adjoint operator and therefore $A^\\dagger A $ is a semi-definite positive operator. Since ${\\rm Tr}~ (H_s-G_s)^2$ is positive but its derivative is negative, the limit $s \\to \\infty$ exists and corresponds to the infrared fixed point of the SRG evolution ($\\lambda \\to 0$), at which the hamiltonian $H_s$ becomes diagonal. Thus, the SRG flow equation just provides a continuous procedure to diagonalize the initial hamiltonian $H_0 = T + V_0$.\n\nIn the case of the SRG evolution with the Wilson generator, $G_s=T$, the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds}=\\frac{d V_s}{ds} = [[T,H_s],H_s]=[[T,V_s],T+V_s] \\; .\n\\end{eqnarray}\n\n\\noindent\nWe then get for $||V_s|| \\equiv {\\rm Tr}~V_s^2$ that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~V_s^2 = 2~{\\rm Tr}~[T,V_s]^2 = -2~{\\rm Tr}\\left[\\left(i~[T,V_s]\\right)^\\dagger \\left(i~[T,V_s]\\right)\\right]\n\\le 0  \\; .\n\\end{eqnarray}\n\n\\noindent\nAs a consequence of this and using the unitary equivalence, $H_s = T+V_s = U_sH_0 U_s^\\dagger$, we get that\n\n\\begin{eqnarray}\n0 < {\\rm Tr}~ V_s^2 \\le {\\rm Tr}~ V^2_0  \\; .\n\\end{eqnarray}\n\n\\noindent\nTherefore there must be a minimum value obtained at the limit $s \\to\n\\infty$ which also implies in $[T,V_{s \\to \\infty}]=0$ due to the stationary\ncondition on the derivative for the infrared fixed point. Hence\n\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} {\\rm Tr}~V_s^2 = \\min_{V_s} {\\rm Tr}~ V_s^2 \\Big|_{H_s= T+V_s = U_s H_0 U_s^\\dagger}  \\; .\n\\end{eqnarray}\n\n\\noindent\nThus, in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$) the SRG\nevolution with the Wilson generator yields asymptotically to the\nsmallest potential, in the Frobenius norm sense, giving the same\nspectrum as the initial potential $V_0$ and commuting with the kinetic\nenergy $T$, i.e.  being diagonal in momentum-space. This is a rather\ninteresting result as it provides a working definition on the ``size''\nof the potential, and moreover different potentials can actually be\ncompared using the distance between the operators induced by the\nFrobenius norm.  Furthermore, this can be interpreted as a\nquantitative measure of the off-shellness of the interaction. In the\npartial-wave relative momentum-space basis the orbital degeneracy\ninduced by the $(2/\\pi) p^2 dp$ integration measure in the Frobenius\nnorm has two complementary effects. While it suppresses the\ncontribution to the norm from low-energy states it also enhances the\ncontribution from high-energy components. Thus, minimizing the\npotential along the SRG evolution trajectory transfers very\nefficiently high-energy components into low-energy components. This\nprovides a working scheme where any short-distance, or equivalently\nhigh-momentum core, becomes softer. It is fair to say that this is the\nmain reason why SRG methods have become popular in realistic nuclear\napplications. For completeness let us mention that there is an\nalternative interpretation of softness of the interaction not based on\nthe Frobenius norm, and based on the insightful work of\nWeinberg~\\cite{Weinberg:1963zza} and taken up by recent studies from\nseveral viewpoints~\\cite{Bogner:2006tw,Perez:2014bua} where the\nrepulsive character of the interaction at short-distance plays a key\nrole.  At present the connection between these two alternatives, while\nsuggesting different measures of the softness, is somewhat vague and\nwe will not dwell into it here. In our case, we will deal with a\npotential toy model where the repulsive piece is absent from the start\n(see Section~\\ref{sec:toy}).\n\nIn the case of the SRG evolution with the Wegner generator, $G_s=H^{D}_s$, the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = \\frac{d V_s}{ds}=[[H^{D}_s,H_s],H_s] \\; .\n\\end{eqnarray}\n\n\\noindent\nThen, in this case we get for $|| H_s-H^{D}_s ||^2 \\equiv {\\rm Tr}~ (H_s-H^{D}_s)^2$ that\n\n\\begin{eqnarray}\n\\frac{d}{ds}{\\rm Tr}~(H_s-H^{D}_s)^2=2~{\\rm Tr}~[H^{D}_s,H_s]^2=-2~{\\rm Tr}~\\left[\\left(i~[H^{D}_s,H_s]\\right)^\\dagger \\left(i~[H^{D}_s,H_s]\\right)\\right]\n\\le 0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that $|| H_s-H^{D}_s || \\to 0$ and so\n\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} H_s = H^{D}_s = \\min_{H_s} || H_s-H^{D}_s ||  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich just shows that the Wegner generator minimizes the distance to\nits diagonal matrix-elements keeping the eigenvalues of the original\nHamiltonian. Of course, if the hamiltonian becomes diagonal the\neigenvectors cannot be free momentum eigenstates.\n\nFinally, for the block-diagonal generator we define two orthogonal projection operators $P+Q=1$ which split the states\nbelow or above a given momentum scale $\\Lambda_{BD}$. In this case the flow equation is given by\n\n\\begin{eqnarray}\n\\frac{d H_s}{ds} = [[P H_s P + Q H_s Q ,H_s],H_s]  \\; .\n\\end{eqnarray}\n\n\\noindent\nWe then get that the evolution makes the asymptotic hamiltonian block-diagonal hence minimizing the off-diagonal matrix-elements,\n\\begin{eqnarray}\n\\lim_{s \\to \\infty} H_s = P H_s P+Q H_s Q = \\min_{H_s} || H_s-P H_s P-Q H_s Q||  \\; .\n\\end{eqnarray}\n\n\n\n\\subsection{Discrete equations}\n\\label{sec:discrete}\n\nOnly in few cases the SRG operator equations can be handled in the\ncontinuum~\\cite{Szpigel:1999gf,Jones:2013cba}. In this section we\nanalyze the details of the implementation of the SRG when a finite\ndimensional reduction of the model space is imposed. The particular\ncase of a momentum grid discretization of the continuum will be\ndiscussed specifically in a later section. For simplicity we will consider a basis of eigenstates $| n \\rangle$ of the kinetic energy operator $T$ on a finite $N$-dimensional Hilbert space ${\\cal H}_N$, namely $T | n \\rangle = \\epsilon_n | n \\rangle~(n=1,2,\\dots,N)$, and assume that the corresponding spectrum of eigenvalues $\\epsilon_n$ is non-degenerate (similar to what happens in the partial-wave relative momentum-space basis for which $\\epsilon_n=p_n^2$). Thus, the matrix-elements of the hamiltonian $H= T + V$ in this basis read $H_{nm}\\equiv \\langle n |H| m \\rangle=\\delta_{nm}\\epsilon_n + V_{nm}$.\n\nThe discrete SRG flow equations for the matrix-elements of the hamiltonian in the case of the Wilson generator can be written in the form\n\n\\begin{eqnarray}\n\\frac{d H_{nm}(s)}{ds}&=&\\sum_{k} (\\epsilon_n+\\epsilon_m-2 \\epsilon_k) H_{nk}(s) H_{km}(s)\\nonumber\\\\\n &=&-(\\epsilon_n-\\epsilon_m)\\left[e_{n}(s)-e_{m}(s)\\right] H_{nm}(s) +\n\\sum_{k \\neq n,m} (\\epsilon_n+\\epsilon_m-2 \\epsilon_k) H_{nk}(s) H_{km}(s)  \\; ,\n\\label{eq:discWil}\n\\end{eqnarray}\n\n\\noindent\nwhere $H_{nm}(s)=\\delta_{nm}\\epsilon_n + V_{nm}(s)$ and $e_{n}(s)\\equiv H_{nn}(s)=\\epsilon_n + V_n(s)$. In the case of the Wegner generator the discrete SRG flow equations read\n\n\\begin{eqnarray}\n\\frac{d H_{nm}(s)}{ds} &=& \\sum_k \\left[e_{n}(s)+ e_{m}(s)- 2 e_{k}(s) \\right] H_{nk}(s) H_{km}(s) \\nonumber\\\\\n&=&-\\left[e_{n}(s)-e_{m}(s)\\right]^2 H_{nm}(s) +\n\\sum_{k \\neq n,m} \\left[e_{n}(s)+e_{m}(s)-2 e_{k}(s)\\right] H_{nk}(s) H_{km}(s) \\; .\n\\label{eq:discWeg}\n\\end{eqnarray}\n\n\\noindent\nThese equations are to be solved with the boundary conditions $H_{nm}(s)|_{_{s \\to 0}}\\equiv H_{nm}(0)=\\delta_{nm}\\epsilon_n + V_{nm}(0)$.\n\nThe fixed points of the SRG evolution with a given generator $G_s$ correspond to the stationary solutions of the SRG flow equations for the matrix-elements of the hamiltonian,\n\n\n", "index": 7, "text": "\\begin{equation}\n\\frac{d H_{nm}(s)}{ds} = \\langle n| [[G_s,H_s],H_s]|m \\rangle=0 \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\frac{dH_{nm}(s)}{ds}=\\langle n|[[G_{s},H_{s}],H_{s}]|m\\rangle=0\\;,\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>H</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>n</mi><mo fence=\"true\" stretchy=\"false\">|</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mo stretchy=\"false\">[</mo><msub><mi>G</mi><mi>s</mi></msub><mo>,</mo><msub><mi>H</mi><mi>s</mi></msub><mo stretchy=\"false\">]</mo></mrow><mo>,</mo><msub><mi>H</mi><mi>s</mi></msub><mo stretchy=\"false\">]</mo></mrow><mo fence=\"true\" stretchy=\"false\">|</mo><mi>m</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mpadded width=\"+2.8pt\"><mn>0</mn></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nand thus the isospectrality does not necessarily fix the final\nordering of the eigenvalues which is obtained in the infrared limit $s\n\\to \\infty$ ($\\lambda \\to 0$). This is not a peculiar feature of the\nSRG evolution; it is shared by {\\it any} diagonalization procedure. In\nthe Gauss elimination method~\\cite{demidovich1973computational}, for\ninstance, one makes an arbitrary choice on how to reduce the original\nmatrix to a diagonal form in a finite number of steps; the re-ordering\nof eigenstates has to be over-imposed at the end by hand, arbitrarily\nchoosing one of the possible permutations of the eigenvalues. Such a\nre-ordering of eigenstates is equivalent to a unitary\ntransformation. However, unlike the conventional diagonalization\nmethods, the SRG evolution can be interpreted as a {\\it continuum}\ndiagonalization through the flow parameter $s$, and thus an infinite\nnumber of steps is involved. As a consequence, the SRG evolution\ninduces a very specific ordering of the eigenstates. This, of course,\ndoes not provide {\\it exact} results since in practice the infrared\nlimit $s \\to \\infty$ is never reached, but the errors scale\nexponentially with the flow parameter $s$ and are of order ${\\cal\n  O}[e^{-{\\rm min}~(s~\\epsilon_n^2)}]$. The crucial aspect is that\nsince on a finite dimensional discrete space the SRG flow equation\nbecomes a set of non-linear first-order coupled differential equations\nfor the matrix-elements of the evolved hamiltonian $H_{nm}(s)$ with\nthe boundary conditions $H_{nm}(s)|_{_{s \\to 0}}\\equiv H_{nm}(0)$, the\nuniqueness of the solution implies that just one particular ordering\nof the eigenvalues takes place asymptotically in the infrared limit $s\n\\to \\infty$, which may depend on the choice of the SRG generator\n$G_s$.\n\nLet us consider the initial bare hamiltonian $H_0$ in the basis of eigenstates $|n \\rangle$ of the kinetic energy operator $T$ on a finite $N$-dimensional Hilbert space ${\\cal H}_N$. The spectrum of eigenvalues $\\{\\epsilon_n\\}_{n=1}^N$ of the operator $T$ is assumed to be non-degenerate and arranged in ascending order, i.e. $\\epsilon_1 < \\epsilon_2 < \\dots < \\epsilon_N$. If we denote by $\\{E_{\\alpha}^0\\}_{\\alpha=1}^N$ the spectrum of $N$ discrete eigenvalues of $H_0$ obtained by any conventional matrix diagonalization method and arranged (by hand) in ascending order similarly to the spectrum of eigenvalues of $T$, i.e. $E_1^0 < E_2^0 < \\dots < E_N^0$, then we have that the final ordering of the spectrum of eigenvalues $\\{E_n\\}_{n=1}^N$ of the SRG evolved hamiltonian $H_{s}$, obtained asymptotically in the infrared limit $s \\to \\infty$, is specifically given by\n\n\\begin{eqnarray}\n\\{E_n\\}_{n=1}^N \\equiv \\{E_{\\pi(\\alpha)}^0\\}_{\\alpha=1}^N \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $\\pi(\\alpha)$ is one of the $N!$ possible permutations of the spectrum of $H_0$.\n\nIt is important to note that in the {\\it continuum} diagonalization of\nthe hamiltonian through the SRG evolution, the correspondence between\nthe kinetic energies $\\epsilon_n$ and the diagonal matrix-elements of\nthe potential $V_n(s)$ is maintained all the way along the SRG\ntrajectory, as one can clearly see from the expression for the\ndiagonal matrix-elements of the hamiltonian, $H_{nn}(s)=\\epsilon_n +\nV_n(s)$. Thus, we have a unique well-defined pairing of the kinetic\nenergies $\\epsilon_n$ with the eigenvalues $E_n$ obtained\nasymptotically in the infrared limit $s \\to \\infty$, namely\n$E_n=H_{nn}(s \\to \\infty)=\\epsilon_n + V_n(s \\to \\infty)$, which is\nindeed what determines the specific ordering of the spectrum induced\nby the SRG evolution. One should also note that depending on which\nparticular final ordering of the eigenvalues takes place in the\ninfrared limit $s \\to \\infty$ there may be crossing amongst diagonal\nmatrix-elements of the hamiltonian $H_{nn}(s)$ along the SRG\ntrajectory. On the other hand, in the conventional diagonalization\nmethods there are $N!$ different ways of pairing the kinetic energies\n$\\epsilon_n$ with the eigenvalues $E_{\\alpha}^0$, corresponding to the\npossible orderings of the spectrum. As we have discussed in\nRef.~\\cite{Arriola:2014aia}, this is a crucial issue to establish an\nisospectral definition of the phase-shift based on an energy-shift\napproach, which necessarily involves a prescription to order the\neigenvalues $E_{\\alpha}^0$ and set their pairing with the kinetic\nenergies $\\epsilon_n$.\n\nIn section \\ref{sec:numerical} we will illustrate through numerical\ncalculations that when bound-states are allowed by the interaction the\nphase-shifts evaluated using the energy-shift approach do not comply\nto Levinson's theorem \\cite{Ma:2006zzc} at low-energies if a naive\npairing is set just by ordering the spectrum of eigenvalues\n$E_{\\alpha}^0$ in ascending order as the kinetic energies\n$\\epsilon_n$; we further show that the specific ordering of the\nspectrum induced by the SRG evolution with the Wegner generator in the\ninfrared limit $s \\to \\infty$ remarkably provides a prescription to\nevaluate the phase-shifts using the energy-shift approach which allows\nto obtain results that fulfill Levinson's theorem in the presence of\nbound-states. In section \\ref{sec:nucl} we dicuss the inequivalent\nbehaviour of both the Wilson and the Wegner generators in simple\nvariational calculations beyond some critical SRG cutoff approaching\nthe infrared limit.\n\n\n\n\\subsubsection{Stability analysis of the infrared fixed points}\n\nAs we have pointed out, the uniqueness of the solution of the SRG flow\nequations on a finite $N$-dimensional discrete space implies that a\nvery specific final ordering of the eigenvalues of the hamiltonian is\nobtained in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$). Of\ncourse, the uniqueness of the solution further implies that the\ninfrared fixed point to which the SRG evolved hamiltonian is steadily\ndriven must be asymptotically stable. In this section we will carry\nout a perturbative stability analysis of the infrared fixed points for\nboth the Wilson and the Wegner generators, which is based on a\nlinearization of the SRG flow equations similar to that described in\nRef.~\\cite{Brockett1991}, as an attempt to determine {\\it a priory}\nthe final ordering of the spectrum induced by the SRG evolution in the\ninfrared limit. As we will see, the perturbative analysis is\nwell-succeeded in predicting the ordering of the spectrum only in the\ncase of the Wilson generator, although the results for both generators\nare consistent with the analytical proof of diagonalization of the SRG\nevolved hamiltonian presented in\nRefs~\\cite{Furnstahl:2012fn,Jurgenson:2009}.\n\nLet us consider a perturbation of the matrix-elements of the SRG\nevolved hamiltonian $H_{nm}(s)$ near an infrared fixed point $H_{nm}\n(s \\to \\infty) = \\delta_{nm} E_n$, namely\n\n\\begin{eqnarray}\nH_{nm} (s) = \\delta_{nm} E_n + \\Delta H_{nm}(s) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwith the matrix-elements of the perturbation $\\Delta H_{nm}(s)$ required to satisfy the condition $\\Delta H_{nm}(s \\to \\infty) = 0$.\n\nBy inserting the perturbed hamiltonian into the SRG flow equation and taking only the terms to first-order in the perturbation we can obtain a set of linearized flow equations for the matrix-elements $\\Delta H_{nm}(s)$. In the case of the Wilson generator $G_s=T$, we get from Eq.~(\\ref{eq:discWil})\n\n\\begin{eqnarray}\n\\frac{d \\Delta H_{nm}(s)}{ds}  = - (\\epsilon_n - \\epsilon_m) (E_n - E_m) \\Delta H_{nm}(s) \\; .\n\\end{eqnarray}\n\n\\noindent\nThe solutions of these equations for the diagonal matrix-elements ($n = m$) are just constants which actually vanish due to the condition $\\Delta H_{nn}(s \\to \\infty)=0$, namely $\\Delta H_{nn}(s) \\equiv C_{nn}=0$, while for the non-diagonal matrix-elements ($n \\neq m$) the solutions are given by\n\n\\begin{eqnarray}\n\\Delta H_{nm}(s) = C_{nm} e^{-s(\\epsilon_n - \\epsilon_m) (E_n - E_m)} \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere the integration constants $C_{nm}$ will depend on the initial conditions set for the matrix-elements $H_{nm}(s)$ of the perturbed hamiltonian. Thus, we have\n\n\\begin{eqnarray}\nH_{nm} (s)  = E_n \\delta_{nm}+ C_{nm} e^{-s(\\epsilon_n-\\epsilon_m)(E_n-E_m)} + \\dots \\; .\n\\end{eqnarray}\n\n\\noindent\nClearly, in the absence of degeneracies the off-diagonal matrix-elements will be ensured to monotonically decrease with $s$ provided $(\\epsilon_n - \\epsilon_m) (E_n-E_m) > 0$. This implies that from all $N!$ possible final orderings of the spectrum only the one in which the eigenvalues $E_n$ are arranged according to the kinetic energies $\\epsilon_n$, i.e. in ascending order, corresponds to an asymptotically stable infrared fixed point. Thus, in the Wilson generator case the perturbative stability analysis to first-order in the perturbation allows to predict beforehand the specific final ordering of the spectrum induced by the SRG evolution in the infrared limit.\n\nIn the case of the Wegner generator $G_s=H^{D}_s$, we get from Eq.~(\\ref{eq:discWeg})\n\n\\begin{eqnarray}\n\\frac{d \\Delta H_{nm}(s)}{ds} = -(E_n-E_m)^2 \\Delta H_{nm}(s) \\; .\n\\end{eqnarray}\n\n\\noindent\nwhich yields the solution\n\n\\begin{eqnarray}\n\\Delta H_{nm}(s) = C_{nm} e^{-s(E_n-E_m)^2} \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that\n\n\\begin{eqnarray}\nH_{nm} (s)  = E_n \\delta_{nm}+ C_{nm} e^{-s(E_n-E_m)^2} + \\dots \\; .\n\\end{eqnarray}\n\n\\noindent\nAs one can see, in this case the off-diagonal matrix-elements will monotonically decrease with $s$ (in the absence of degeneracies) regardless the ordering of the eigenvalues and so in principle all $N!$ possible final orderings of the spectrum correspond to asymptotically stable infrared fixed points. Thus, in the Wegner generator case the specific final ordering of the spectrum induced by the SRG evolution in the infrared limit cannot be determined {\\it a priory} through the perturbative stability analysis to first-order in the perturbation and we have to rely on numerical analysis.\n\n\n\n\\section{A simple toy model for the $NN$ interaction}\n\\label{sec:toy}\n\nWe intend to explore the infrared limit of the SRG evolution $(\\lambda\n\\to 0)$. Quite generally, the equations to be discussed involve heavy\nnumerical calculations with a discretized continuum spectrum in the\ncase of nuclear physics. The problem is that most of the\nhigh-precision potentials, which fit $NN$ scattering data up to the\npion-production threshold ($\\sqrt{m_\\pi M_N} \\sim 350~{\\rm MeV}$),\nhave a very long tail in momentum space which requires many points and\nlarge momentum cutoffs not to miss important contributions. As a\nconsequence the flow equation gets extremely stiff as the SRG\ncutoff $\\lambda$ approaches zero, such that the computational effort\nbecomes unduly expensive. Actually, there is currently a gap in SRG\ncalculations below $\\lambda \\sim 1~ {\\rm fm}^{-1}$ for high-precision\n\\cite{Wiringa:1994wb,Stoks:1994wp} and\nChEFT~\\cite{Entem:2003ft,Epelbaum:2004fk} $NN$ potentials.\n\nTherefore, we will illustrate most of our points by using a simple toy\nmodel for the $NN$ interaction which reduces the computational time\nand allow us to push the SRG evolution towards the infrared limit in a\nway which is not practical with realistic interactions. The simplicity\nof the toy model does not affect the main features of the $NN$\ninteraction in the $S$-wave channels and gives us the opportunity to\ninvestigate the infrared fixed point of the SRG flow equations with\nany generator. Here we concentrate on the Wilson and the Wegner\ngenerators.\n\nOur framework is defined by a toy model for the $NN$ force in the $^1S_0$ and the $^3S_1$ channels which consists of a separable gaussian potential, given by\n\n\n", "itemtype": "equation", "pos": 31265, "prevtext": "\n\n\\noindent\nwhich implies, for both the Wilson ($G_s=T$) and the Wegner ($G_s=H^{D}_s$) generators, that in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$) the hamiltonian $H_s$ becomes diagonal \\footnote{One should note that the stationary condition in operator form, Eq.~(\\ref{eq:fixed}), in principle just requires that at a fixed point both $[G_s,H_s]$ and $H_s$ become diagonal in the same basis, not necessarily the one in which the generator $G_s$ is diagonal. However, we can show that the condition $[[G_s,H_s],H_s]=0$ also implies that $[G_s,H_s]=0$. Taking a discrete basis in which $H_s$ is diagonal, i.e. $H_{\\alpha \\beta}(s)= \\delta_{\\alpha \\beta}H_{\\alpha}(s)$, we have\n\n\\begin{eqnarray}\n\\langle \\alpha |[G_s, H_s] | \\beta \\rangle=\\sum_\\gamma \\left[G_{\\alpha \\gamma}(s) H_{ \\gamma \\beta}(s) - H_{\\alpha \\gamma}(s)\nG_{\\gamma \\beta}(s)\\right]=  G_{\\alpha \\beta}(s)\\left[H_{\\beta}(s)- H_{\\alpha}(s)\\right] \\; . \\nonumber\n\\end{eqnarray}\n\n\\noindent\nThus, for $\\alpha \\neq \\beta$ we get, in the absence of degeneracies, that $\\langle \\alpha |[G_s, H_s] | \\beta \\rangle = 0$ only if $G_{\\alpha \\beta}(s)= 0$ and so both the hamiltonian $H_s$ and the generator $G_s$ are diagonal in the same basis. Of course, this becomes a trivial result for generators $G_s$ which by definition are diagonal in the basis of eigenstates of the kinetic energy operator $T$, such as the Wilson and the Wegner generators.}. Thus, we have that\n\n\\begin{eqnarray}\n\\lim_{s\\to \\infty} H_{nm}(s)=\\delta_{nm} E_n\\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $\\{E_n\\}_{n=1}^N$ denotes the spectrum of discrete eigenvalues of the hamiltonian $H_s$ obtained in the infrared limit $s \\to \\infty$, which are given by\n\n\\begin{eqnarray}\nE_n \\equiv \\lim_{s\\to \\infty}e_n(s)=\\epsilon_n + V_n(s \\to \\infty)\\; .\n\\end{eqnarray}\n\n\n\n\n\\subsubsection{Ordering of the spectrum induced by the SRG evolution}\n\nAs we have shown, the SRG evolution with both the Wilson and the Wegner generators on a finite $N$-dimensional discrete space have infrared fixed points at which the hamiltonian becomes diagonal. Thus, we have two interpolating SRG trajectories between the initial bare hamiltonian, $H_0$, and the final one, $H_{s \\to \\infty}$. From this point of view, there seems to be no conceptual difference between the SRG evolution with both generators, since the isospectrality of the SRG flow equation guarantees the invariance of the spectrum of eigenvalues of the hamiltonian $H_{s}$. This naive argument overlooks an important detail: the fact that through the SRG evolution the basis of eigenstates $|\\psi_{\\alpha} (s)\\rangle$ of the hamiltonian $H_s$ is actually changing, i.e.\n\n\n", "index": 9, "text": "\\begin{equation}\nU_{s}|\\psi_{\\alpha} (s=0)\\rangle = |\\psi_{\\alpha} (s)\\rangle \\;,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"U_{s}|\\psi_{\\alpha}(s=0)\\rangle=|\\psi_{\\alpha}(s)\\rangle\\;,\" display=\"block\"><mrow><mrow><msub><mi>U</mi><mi>s</mi></msub><mo stretchy=\"false\">|</mo><msub><mi>ψ</mi><mi>α</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>=</mo><mn>0</mn><mo stretchy=\"false\">)</mo></mrow><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mo stretchy=\"false\">|</mo><msub><mi>ψ</mi><mi>α</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow><mo rspace=\"5.3pt\" stretchy=\"false\">⟩</mo><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nThe parameters $C$ and $L$ are determined from the solution of the LS equation for the on-shell transition matrix $T$ by fitting the experimental values of the parameters of the Effective Range Expansion (ERE) to second order in the on-shell momentum, i.e. the scattering length $a_0$ and the effective range $r_e$. Namely, we solve the partial-wave LS equation for the $T$-matrix with the toy model potential,\n\n\n", "itemtype": "equation", "pos": 42911, "prevtext": "\n\n\\noindent\nand thus the isospectrality does not necessarily fix the final\nordering of the eigenvalues which is obtained in the infrared limit $s\n\\to \\infty$ ($\\lambda \\to 0$). This is not a peculiar feature of the\nSRG evolution; it is shared by {\\it any} diagonalization procedure. In\nthe Gauss elimination method~\\cite{demidovich1973computational}, for\ninstance, one makes an arbitrary choice on how to reduce the original\nmatrix to a diagonal form in a finite number of steps; the re-ordering\nof eigenstates has to be over-imposed at the end by hand, arbitrarily\nchoosing one of the possible permutations of the eigenvalues. Such a\nre-ordering of eigenstates is equivalent to a unitary\ntransformation. However, unlike the conventional diagonalization\nmethods, the SRG evolution can be interpreted as a {\\it continuum}\ndiagonalization through the flow parameter $s$, and thus an infinite\nnumber of steps is involved. As a consequence, the SRG evolution\ninduces a very specific ordering of the eigenstates. This, of course,\ndoes not provide {\\it exact} results since in practice the infrared\nlimit $s \\to \\infty$ is never reached, but the errors scale\nexponentially with the flow parameter $s$ and are of order ${\\cal\n  O}[e^{-{\\rm min}~(s~\\epsilon_n^2)}]$. The crucial aspect is that\nsince on a finite dimensional discrete space the SRG flow equation\nbecomes a set of non-linear first-order coupled differential equations\nfor the matrix-elements of the evolved hamiltonian $H_{nm}(s)$ with\nthe boundary conditions $H_{nm}(s)|_{_{s \\to 0}}\\equiv H_{nm}(0)$, the\nuniqueness of the solution implies that just one particular ordering\nof the eigenvalues takes place asymptotically in the infrared limit $s\n\\to \\infty$, which may depend on the choice of the SRG generator\n$G_s$.\n\nLet us consider the initial bare hamiltonian $H_0$ in the basis of eigenstates $|n \\rangle$ of the kinetic energy operator $T$ on a finite $N$-dimensional Hilbert space ${\\cal H}_N$. The spectrum of eigenvalues $\\{\\epsilon_n\\}_{n=1}^N$ of the operator $T$ is assumed to be non-degenerate and arranged in ascending order, i.e. $\\epsilon_1 < \\epsilon_2 < \\dots < \\epsilon_N$. If we denote by $\\{E_{\\alpha}^0\\}_{\\alpha=1}^N$ the spectrum of $N$ discrete eigenvalues of $H_0$ obtained by any conventional matrix diagonalization method and arranged (by hand) in ascending order similarly to the spectrum of eigenvalues of $T$, i.e. $E_1^0 < E_2^0 < \\dots < E_N^0$, then we have that the final ordering of the spectrum of eigenvalues $\\{E_n\\}_{n=1}^N$ of the SRG evolved hamiltonian $H_{s}$, obtained asymptotically in the infrared limit $s \\to \\infty$, is specifically given by\n\n\\begin{eqnarray}\n\\{E_n\\}_{n=1}^N \\equiv \\{E_{\\pi(\\alpha)}^0\\}_{\\alpha=1}^N \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $\\pi(\\alpha)$ is one of the $N!$ possible permutations of the spectrum of $H_0$.\n\nIt is important to note that in the {\\it continuum} diagonalization of\nthe hamiltonian through the SRG evolution, the correspondence between\nthe kinetic energies $\\epsilon_n$ and the diagonal matrix-elements of\nthe potential $V_n(s)$ is maintained all the way along the SRG\ntrajectory, as one can clearly see from the expression for the\ndiagonal matrix-elements of the hamiltonian, $H_{nn}(s)=\\epsilon_n +\nV_n(s)$. Thus, we have a unique well-defined pairing of the kinetic\nenergies $\\epsilon_n$ with the eigenvalues $E_n$ obtained\nasymptotically in the infrared limit $s \\to \\infty$, namely\n$E_n=H_{nn}(s \\to \\infty)=\\epsilon_n + V_n(s \\to \\infty)$, which is\nindeed what determines the specific ordering of the spectrum induced\nby the SRG evolution. One should also note that depending on which\nparticular final ordering of the eigenvalues takes place in the\ninfrared limit $s \\to \\infty$ there may be crossing amongst diagonal\nmatrix-elements of the hamiltonian $H_{nn}(s)$ along the SRG\ntrajectory. On the other hand, in the conventional diagonalization\nmethods there are $N!$ different ways of pairing the kinetic energies\n$\\epsilon_n$ with the eigenvalues $E_{\\alpha}^0$, corresponding to the\npossible orderings of the spectrum. As we have discussed in\nRef.~\\cite{Arriola:2014aia}, this is a crucial issue to establish an\nisospectral definition of the phase-shift based on an energy-shift\napproach, which necessarily involves a prescription to order the\neigenvalues $E_{\\alpha}^0$ and set their pairing with the kinetic\nenergies $\\epsilon_n$.\n\nIn section \\ref{sec:numerical} we will illustrate through numerical\ncalculations that when bound-states are allowed by the interaction the\nphase-shifts evaluated using the energy-shift approach do not comply\nto Levinson's theorem \\cite{Ma:2006zzc} at low-energies if a naive\npairing is set just by ordering the spectrum of eigenvalues\n$E_{\\alpha}^0$ in ascending order as the kinetic energies\n$\\epsilon_n$; we further show that the specific ordering of the\nspectrum induced by the SRG evolution with the Wegner generator in the\ninfrared limit $s \\to \\infty$ remarkably provides a prescription to\nevaluate the phase-shifts using the energy-shift approach which allows\nto obtain results that fulfill Levinson's theorem in the presence of\nbound-states. In section \\ref{sec:nucl} we dicuss the inequivalent\nbehaviour of both the Wilson and the Wegner generators in simple\nvariational calculations beyond some critical SRG cutoff approaching\nthe infrared limit.\n\n\n\n\\subsubsection{Stability analysis of the infrared fixed points}\n\nAs we have pointed out, the uniqueness of the solution of the SRG flow\nequations on a finite $N$-dimensional discrete space implies that a\nvery specific final ordering of the eigenvalues of the hamiltonian is\nobtained in the infrared limit $s \\to \\infty$ ($\\lambda \\to 0$). Of\ncourse, the uniqueness of the solution further implies that the\ninfrared fixed point to which the SRG evolved hamiltonian is steadily\ndriven must be asymptotically stable. In this section we will carry\nout a perturbative stability analysis of the infrared fixed points for\nboth the Wilson and the Wegner generators, which is based on a\nlinearization of the SRG flow equations similar to that described in\nRef.~\\cite{Brockett1991}, as an attempt to determine {\\it a priory}\nthe final ordering of the spectrum induced by the SRG evolution in the\ninfrared limit. As we will see, the perturbative analysis is\nwell-succeeded in predicting the ordering of the spectrum only in the\ncase of the Wilson generator, although the results for both generators\nare consistent with the analytical proof of diagonalization of the SRG\nevolved hamiltonian presented in\nRefs~\\cite{Furnstahl:2012fn,Jurgenson:2009}.\n\nLet us consider a perturbation of the matrix-elements of the SRG\nevolved hamiltonian $H_{nm}(s)$ near an infrared fixed point $H_{nm}\n(s \\to \\infty) = \\delta_{nm} E_n$, namely\n\n\\begin{eqnarray}\nH_{nm} (s) = \\delta_{nm} E_n + \\Delta H_{nm}(s) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwith the matrix-elements of the perturbation $\\Delta H_{nm}(s)$ required to satisfy the condition $\\Delta H_{nm}(s \\to \\infty) = 0$.\n\nBy inserting the perturbed hamiltonian into the SRG flow equation and taking only the terms to first-order in the perturbation we can obtain a set of linearized flow equations for the matrix-elements $\\Delta H_{nm}(s)$. In the case of the Wilson generator $G_s=T$, we get from Eq.~(\\ref{eq:discWil})\n\n\\begin{eqnarray}\n\\frac{d \\Delta H_{nm}(s)}{ds}  = - (\\epsilon_n - \\epsilon_m) (E_n - E_m) \\Delta H_{nm}(s) \\; .\n\\end{eqnarray}\n\n\\noindent\nThe solutions of these equations for the diagonal matrix-elements ($n = m$) are just constants which actually vanish due to the condition $\\Delta H_{nn}(s \\to \\infty)=0$, namely $\\Delta H_{nn}(s) \\equiv C_{nn}=0$, while for the non-diagonal matrix-elements ($n \\neq m$) the solutions are given by\n\n\\begin{eqnarray}\n\\Delta H_{nm}(s) = C_{nm} e^{-s(\\epsilon_n - \\epsilon_m) (E_n - E_m)} \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere the integration constants $C_{nm}$ will depend on the initial conditions set for the matrix-elements $H_{nm}(s)$ of the perturbed hamiltonian. Thus, we have\n\n\\begin{eqnarray}\nH_{nm} (s)  = E_n \\delta_{nm}+ C_{nm} e^{-s(\\epsilon_n-\\epsilon_m)(E_n-E_m)} + \\dots \\; .\n\\end{eqnarray}\n\n\\noindent\nClearly, in the absence of degeneracies the off-diagonal matrix-elements will be ensured to monotonically decrease with $s$ provided $(\\epsilon_n - \\epsilon_m) (E_n-E_m) > 0$. This implies that from all $N!$ possible final orderings of the spectrum only the one in which the eigenvalues $E_n$ are arranged according to the kinetic energies $\\epsilon_n$, i.e. in ascending order, corresponds to an asymptotically stable infrared fixed point. Thus, in the Wilson generator case the perturbative stability analysis to first-order in the perturbation allows to predict beforehand the specific final ordering of the spectrum induced by the SRG evolution in the infrared limit.\n\nIn the case of the Wegner generator $G_s=H^{D}_s$, we get from Eq.~(\\ref{eq:discWeg})\n\n\\begin{eqnarray}\n\\frac{d \\Delta H_{nm}(s)}{ds} = -(E_n-E_m)^2 \\Delta H_{nm}(s) \\; .\n\\end{eqnarray}\n\n\\noindent\nwhich yields the solution\n\n\\begin{eqnarray}\n\\Delta H_{nm}(s) = C_{nm} e^{-s(E_n-E_m)^2} \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that\n\n\\begin{eqnarray}\nH_{nm} (s)  = E_n \\delta_{nm}+ C_{nm} e^{-s(E_n-E_m)^2} + \\dots \\; .\n\\end{eqnarray}\n\n\\noindent\nAs one can see, in this case the off-diagonal matrix-elements will monotonically decrease with $s$ (in the absence of degeneracies) regardless the ordering of the eigenvalues and so in principle all $N!$ possible final orderings of the spectrum correspond to asymptotically stable infrared fixed points. Thus, in the Wegner generator case the specific final ordering of the spectrum induced by the SRG evolution in the infrared limit cannot be determined {\\it a priory} through the perturbative stability analysis to first-order in the perturbation and we have to rely on numerical analysis.\n\n\n\n\\section{A simple toy model for the $NN$ interaction}\n\\label{sec:toy}\n\nWe intend to explore the infrared limit of the SRG evolution $(\\lambda\n\\to 0)$. Quite generally, the equations to be discussed involve heavy\nnumerical calculations with a discretized continuum spectrum in the\ncase of nuclear physics. The problem is that most of the\nhigh-precision potentials, which fit $NN$ scattering data up to the\npion-production threshold ($\\sqrt{m_\\pi M_N} \\sim 350~{\\rm MeV}$),\nhave a very long tail in momentum space which requires many points and\nlarge momentum cutoffs not to miss important contributions. As a\nconsequence the flow equation gets extremely stiff as the SRG\ncutoff $\\lambda$ approaches zero, such that the computational effort\nbecomes unduly expensive. Actually, there is currently a gap in SRG\ncalculations below $\\lambda \\sim 1~ {\\rm fm}^{-1}$ for high-precision\n\\cite{Wiringa:1994wb,Stoks:1994wp} and\nChEFT~\\cite{Entem:2003ft,Epelbaum:2004fk} $NN$ potentials.\n\nTherefore, we will illustrate most of our points by using a simple toy\nmodel for the $NN$ interaction which reduces the computational time\nand allow us to push the SRG evolution towards the infrared limit in a\nway which is not practical with realistic interactions. The simplicity\nof the toy model does not affect the main features of the $NN$\ninteraction in the $S$-wave channels and gives us the opportunity to\ninvestigate the infrared fixed point of the SRG flow equations with\nany generator. Here we concentrate on the Wilson and the Wegner\ngenerators.\n\nOur framework is defined by a toy model for the $NN$ force in the $^1S_0$ and the $^3S_1$ channels which consists of a separable gaussian potential, given by\n\n\n", "index": 11, "text": "\\begin{equation}\nV(p, p') = C~ g_L(p) g_L(p') = C~ \\exp \\left[ -\\left( p^{2}+p'^2 \\right)/L^2 \\right] \\; .\n\\label{gaupot}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"V(p,p^{\\prime})=C~{}g_{L}(p)g_{L}(p^{\\prime})=C~{}\\exp\\left[-\\left(p^{2}+p^{%&#10;\\prime 2}\\right)/L^{2}\\right]\\;.\" display=\"block\"><mrow><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><mi>C</mi></mpadded><mo>⁢</mo><msub><mi>g</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>g</mi><mi>L</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msup><mi>p</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><mi>C</mi></mpadded><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mrow><mrow><mo>(</mo><mrow><msup><mi>p</mi><mn>2</mn></msup><mo>+</mo><msup><mi>p</mi><mrow><mi mathsize=\"142%\" mathvariant=\"normal\">′</mi><mo>⁣</mo><mn>2</mn></mrow></msup></mrow><mo>)</mo></mrow><mo>/</mo><msup><mi>L</mi><mn>2</mn></msup></mrow></mrow><mo rspace=\"5.3pt\">]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\\noindent\nwhere $E$ is the scattering energy, and match the resulting on-shell $T$-matrix to the ERE expansion,\n\n\\begin{eqnarray}\nT^{-1}(k,k;k^2)=-\\left[-\\frac{1}{a_0}\n+\\frac{1}{2}~r_e~k^2 + {\\cal O}(k^4)-i~k \\right] =-\\left[k~{\\rm cot}~\\delta(k)-i~k \\right]\\; ,\n\\label{eq:ERE}\n\\end{eqnarray}\n\n\\noindent\nwhere $k=\\sqrt{E}$ is the on-shell momentum in the CM frame and $\\delta(k)$ stands for the phase-shifts. In order to avoid the numerical integration on a contour in the complex plane, we switch to the LS equation for the partial-wave reactance matrix $K$ with standing-wave boundary conditions,\n\n\n", "itemtype": "equation", "pos": 43471, "prevtext": "\n\n\\noindent\nThe parameters $C$ and $L$ are determined from the solution of the LS equation for the on-shell transition matrix $T$ by fitting the experimental values of the parameters of the Effective Range Expansion (ERE) to second order in the on-shell momentum, i.e. the scattering length $a_0$ and the effective range $r_e$. Namely, we solve the partial-wave LS equation for the $T$-matrix with the toy model potential,\n\n\n", "index": 13, "text": "\\begin{equation}\nT(p,p';E)=V(p,p')+\\frac{2}{\\pi}\\; \\int_{0}^{\\infty} \\; dq \\; q^2 \\;\n\\frac{V(p,q)}{E-q^2+i \\; \\epsilon} \\; T(q,p';E) \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"T(p,p^{\\prime};E)=V(p,p^{\\prime})+\\frac{2}{\\pi}\\;\\int_{0}^{\\infty}\\;dq\\;q^{2}%&#10;\\;\\frac{V(p,q)}{E-q^{2}+i\\;\\epsilon}\\;T(q,p^{\\prime};E)\\;,\" display=\"block\"><mrow><mrow><mrow><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo>;</mo><mi>E</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+2.8pt\"><mfrac><mn>2</mn><mi>π</mi></mfrac></mpadded><mo>⁢</mo><mrow><mpadded width=\"+2.8pt\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup></mpadded><mrow><mrow><mo>𝑑</mo><mpadded width=\"+2.8pt\"><mi>q</mi></mpadded></mrow><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>q</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mrow><mi>E</mi><mo>-</mo><msup><mi>q</mi><mn>2</mn></msup></mrow><mo>+</mo><mrow><mpadded width=\"+2.8pt\"><mi>i</mi></mpadded><mo>⁢</mo><mi>ϵ</mi></mrow></mrow></mfrac></mpadded><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo>;</mo><mi>E</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\\noindent\nwhere ${\\cal P}$ denotes the Cauchy principal value. The relation between the $K$-matrix and the $T$-matrix on-shell is given by\n\n\n", "itemtype": "equation", "pos": 44224, "prevtext": "\n\\noindent\nwhere $E$ is the scattering energy, and match the resulting on-shell $T$-matrix to the ERE expansion,\n\n\\begin{eqnarray}\nT^{-1}(k,k;k^2)=-\\left[-\\frac{1}{a_0}\n+\\frac{1}{2}~r_e~k^2 + {\\cal O}(k^4)-i~k \\right] =-\\left[k~{\\rm cot}~\\delta(k)-i~k \\right]\\; ,\n\\label{eq:ERE}\n\\end{eqnarray}\n\n\\noindent\nwhere $k=\\sqrt{E}$ is the on-shell momentum in the CM frame and $\\delta(k)$ stands for the phase-shifts. In order to avoid the numerical integration on a contour in the complex plane, we switch to the LS equation for the partial-wave reactance matrix $K$ with standing-wave boundary conditions,\n\n\n", "index": 15, "text": "\\begin{equation}\nK(p,p';k^2)=V(p,p')+\\frac{2}{\\pi}\\; {\\cal P}\\int_{0}^{\\infty} \\; dq \\; q^2 \\;\n\\frac{V(p,q)}{k^2-q^2} \\; K(q,p';k^2) \\; ,\n\\label{LSKNN}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"K(p,p^{\\prime};k^{2})=V(p,p^{\\prime})+\\frac{2}{\\pi}\\;{\\cal P}\\int_{0}^{\\infty}%&#10;\\;dq\\;q^{2}\\;\\frac{V(p,q)}{k^{2}-q^{2}}\\;K(q,p^{\\prime};k^{2})\\;,\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo>;</mo><msup><mi>k</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mpadded width=\"+2.8pt\"><mfrac><mn>2</mn><mi>π</mi></mfrac></mpadded><mo>⁢</mo><mi class=\"ltx_font_mathcaligraphic\">𝒫</mi><mo>⁢</mo><mrow><mpadded width=\"+2.8pt\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup></mpadded><mrow><mrow><mo>𝑑</mo><mpadded width=\"+2.8pt\"><mi>q</mi></mpadded></mrow><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mi>q</mi><mn>2</mn></msup></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msup><mi>k</mi><mn>2</mn></msup><mo>-</mo><msup><mi>q</mi><mn>2</mn></msup></mrow></mfrac></mpadded><mo>⁢</mo><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo>,</mo><msup><mi>p</mi><mo>′</mo></msup><mo>;</mo><msup><mi>k</mi><mn>2</mn></msup><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nFollowing the method introduced by Steele and Furnstahl~\\cite{Steele:1998un}, we fit the difference between the inverse on-shell $K$-matrices corresponding to the toy model potential and the ERE expansion to an interpolating polynomial of degree $k^2$ for a spread of very small on-shell momenta ($k \\le 0.1~{\\rm fm^{-1}}$), namely\n\n\\begin{eqnarray}\n\\Delta K^{-1}=K^{-1}(k,k;k^2) - K^{-1}_{\\rm ERE}(k,k;k^2) = A_0 + A_2~k^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nand then minimize the coefficients $A_0$ and $A_2$ with respect to the variations of the parameters $C$ and $L$.\n\nIn the case of the separable gaussian potential toy model, given by\nEq.~(\\ref{gaupot}), it is straightforward to determine the\nphase-shifts $\\delta(k)$ from the solution of the LS equation for the\n$T$-matrix using the {\\it ansatz}\n\n\\begin{eqnarray}\nT(p,p';k^2) = g_L(p) ~t(k)~ g_L(p') \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $t(k)$ is called the reduced on-shell $T$-matrix. This leads to\nthe simple relation (valid for separable potenials only)\n\n\\begin{eqnarray}\n k \\cot \\delta(k)= - \\frac{1}{V(k,k)} \\left[1- \\frac{2}{\\pi}\\;\n{\\cal P}\\int_0^\\infty dq~q^2 \\frac{1}{k^2-q^2} V(q,q) \\right] \\; .\n\\label{phasetoy}\n\\end{eqnarray}\n\n\nIn Table \\ref{tab:toy} we display the values of the parameters for the toy model potential in the $^1S_0$ and the $^3S_1$ channels used in our numerical calculations, which are adjusted to reproduce the corresponding experimental values of $a_0$ and $r_e$ by the method described above.\n\n\n\\begin{table}[h]\n\\caption{Parameters for the toy model potential in the $^1S_0$ and the $^3S_1$ channels used in the numerical calculations.}\n\\vskip 0.3cm\n\\centering\n\\begin{tabular}{c c c c c c c }\n\\hline\\hline\n - & $a_0~({\\rm fm})$  &  $r_e~({\\rm fm})$  & $ C~({\\rm fm})$ & $1/L^{2}~({\\rm fm}^{2})$  \\\\\n\\hline\\hline\n$^1S_0$   & -23.74  & 2.77 & -1.915884  &  0.6913 \\\\\n$^3S_1$   & 5.42    & 1.75 & -2.300641  &  0.4151 \\\\\n\\hline\n\\end{tabular}\n\\label{tab:toy}\n\\end{table}\n\n\nThe phase-shifts for the toy model potential in the $^1S_0$ and the\n$^3S_1$ channels evaluated from Eq.~(\\ref{phasetoy}) are shown in\nFig.~\\ref{fig:1}, together with the results obtained from the 1993\nNijmegen partial-wave analysis (PWA) \\cite{Stoks:1993tb} or the more\nrecent 2013\nupgrades~\\cite{Perez:2013mwa,Perez:2013jpa,Perez:2013oba,Perez:2014yla}. As\none can see, despite the simplicity of the potential and the fact that\nthe $^3S_1$ channel is not treated as a coupled channel, our toy model\nfor the $NN$ interaction provides a reasonable qualitative description\nof the $S$-wave phase-shifts. Moreover, the on-shell $T$-matrix for\nthe $^3S_1$ channel toy model potential has a pole located at an\nimaginary momentum $k= i~\\gamma=i~0.2314~{\\rm fm^{-1}}$, corresponding\nto a satisfactory Deuteron binding-energy $B_d \\simeq 2 ~ {\\rm MeV}$.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig1a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.65cm]{fig1b.pdf}\n\\end{center}\n\\caption{Phase-shifts for the toy model potential in the $^1S_0$ and the $^3S_1$ channels compared to the results obtained from the Nijmegen PWA \\cite{Stoks:1993tb}.}\n\\label{fig:1}\n\\end{figure}\n\n\n\n\n\\section{SRG on a finite momentum grid}\n\\label{sec:SRG-grid}\n\n\\subsection{Momentum-space grid}\n\nFor most cases of interest the SRG flow equations are solved numerically on a finite momentum grid with $N$ integration points\n$p_n$ and weights $w_n$ ($n=1, \\dots N$) by implementing a high-momentum ultraviolet (UV) cutoff, $p_{\\rm max}=\\Lambda$, and an\ninfrared (IR) momentum cutoff, $p_{\\rm min} = \\Delta p$. The integration rule becomes\n\n\\begin{eqnarray}\n\\int_{\\Delta p}^\\Lambda dp f(p) \\to \\sum_{n=1}^N w_n f(p_n) \\; .\n\\end{eqnarray}\n\n\nTaking Chebychev-Gauss points~\\cite{demidovich1973computational}, for\nexample, we get after re-scaling to the interval $[0,\\Lambda]$,\n\n\\begin{eqnarray}\np_n = \\frac{\\Lambda}{2}\\left\\{ 1- \\cos \\left[ \\frac{\\pi}N (n-1/2) \\right] \\right\\}\n\\;  , \\qquad\nw_n =  \\frac{\\Lambda}{2} \\frac{\\pi}{N} \\sin \\left[\\frac{\\pi}N (n-1/2) \\right] \\; ,\n\\end{eqnarray}\n\n\\noindent\nand thus\n\\begin{eqnarray}\np_{\\rm min} = p_1 =  \\Lambda \\sin^2 \\left( \\frac{\\pi}{4N}\\right)\n\\;  , \\qquad\np_{\\rm max} = p_N =  \\Lambda \\sin^2 \\left[ \\frac{\\pi}{2N} (N-1/2) \\right]  \\; .\n\\end{eqnarray}\n\n\\noindent\nFor a large grid and for $n << N$ we have $p_n= \\Lambda (\\pi n/2N)^2/2$ which differs from the spherical box quantization. As it is well known, this grid choice guarantees an exact result for polynomials in p to order $M \\le N$, i.e.\n\n\\begin{eqnarray}\n\\int_{\\Delta p}^\\Lambda dp \\frac{P_M (p)}{\\sqrt{\\Lambda^2-p^2}}  = \\sum_{n=1}^N w_n \\frac{P_M(p_n)}{\\sqrt{\\Lambda^2-p_n^2}} \\; .\n\\end{eqnarray}\n\n\\noindent\nThe completeness relation in discretized partial-wave relative momentum-space basis is given by\n\n\\begin{eqnarray}\n\\frac{2}{\\pi}\\sum_{n=1}^N w_n ~p_n^2 ~| p_n \\rangle \\langle p_n |={\\bf 1} \\; .\n\\label{completeness}\n\\end{eqnarray}\n\n\nOnce we have the finite momentum grid we may seek to diagonalize the hamiltonian, whose matrix-elements read\n\n\\begin{eqnarray}\nH(p_n,p_m)=p_n^2 ~ \\delta_{nm} + \\frac{2}{\\pi}w_n~p_n^2 ~V_{nm}  \\; ,\n\\label{gridev}\n\\end{eqnarray}\n\n\\noindent\nwhere $V_{nm}$ denotes the matrix-elements of the potential $V(p_n,p_m)$. The discrete eigenvalue equations on the finite momentum grid are given by\n\n\\begin{eqnarray}\np_n^2 ~\\psi_\\alpha (p_n) + \\frac{2}{\\pi}\\sum_k w_k ~p_k^2 ~V_{nk}\n~\\psi_\\alpha(p_k) = P_\\alpha^2 ~ \\psi_\\alpha (p_n) \\; ,\n\\label{gridev}\n\\end{eqnarray}\n\nwhere $P_\\alpha^2$ and $\\psi_\\alpha (p_n)$ stand respectively for the eigenvalues and the eigenfunctions of the hamiltonian.\n\nThe weight factors $w_n$ complicate the discrete eigenvalue equations and hide the hermiticity of the hamiltonian. Making a change of variables\n\n\\begin{eqnarray}\n\\psi_\\alpha(p_n) = \\frac{\\varphi_\\alpha(p_n)}{p_n \\sqrt{2 w_n/\\pi}} \\; ,\n\\end{eqnarray}\n\n\\noindent\nwe have\n\n\\begin{eqnarray}\np_n^2 ~\\varphi_\\alpha (p_n) + \\frac{2}{\\pi}\\sum_k \\sqrt{w_n} ~p_n\n~V_{nk} ~\\sqrt{w_k}~ p_k ~ \\varphi_\\alpha(p_k) = P_\\alpha^2 ~\n\\varphi_\\alpha (p_n) \\; .\n\\end{eqnarray}\n\n\\noindent\nThus the square-integrability condition reads\n\n\\begin{eqnarray}\n\\frac2{\\pi}\\sum_{n=1}^N w_n p_n^2 | \\psi(p_n) |^2 = \\sum_{n=1}^N |\n\\varphi(p_n) |^2 \\; ,\n\\end{eqnarray}\n\n\\noindent\nand the multiplication of operators corresponds to the plain matrix multiplication\n\n\n", "itemtype": "equation", "pos": 44531, "prevtext": "\n\\noindent\nwhere ${\\cal P}$ denotes the Cauchy principal value. The relation between the $K$-matrix and the $T$-matrix on-shell is given by\n\n\n", "index": 17, "text": "\\begin{equation}\nK^{-1}(k,k;k^2) = T^{-1}(k,k;k^2) \\; - \\; i \\, k = - \\; k \\cot \\delta(k)\\; .\n\\label{KTrel}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"K^{-1}(k,k;k^{2})=T^{-1}(k,k;k^{2})\\;-\\;i\\,k=-\\;k\\cot\\delta(k)\\;.\" display=\"block\"><mrow><mrow><mrow><msup><mi>K</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>k</mi><mo>;</mo><msup><mi>k</mi><mn>2</mn></msup><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msup><mi>T</mi><mrow><mo>-</mo><mn>1</mn></mrow></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>k</mi><mo>;</mo><msup><mi>k</mi><mn>2</mn></msup><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"5.3pt\">-</mo><mrow><mpadded width=\"+1.7pt\"><mi>i</mi></mpadded><mo>⁢</mo><mi>k</mi></mrow></mrow><mo>=</mo><mrow><mo rspace=\"5.3pt\">-</mo><mrow><mi>k</mi><mo>⁢</mo><mrow><mi>cot</mi><mo>⁡</mo><mi>δ</mi></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhere\n\n\\begin{eqnarray}\n\\bar{A}_{nm} = \\frac{2}{\\pi} ~ p_n \\sqrt{w_n} ~ A_{nm} ~p_m \\sqrt{w_m} \\; .\n\\end{eqnarray}\n\n\\noindent\nIn terms of this new basis the discrete eigenvalue equations become very simple,\nwithout the disturbing extra factors, as it was shown in Section~\\ref{sec:discrete}. Note that in the free case, $V_{nm}=0$, we have $\\psi_\\alpha(p_n)\\sim \\delta_{\\alpha,n}$, so that labeling states as distorted states\nstemming from a given free state, $p_n \\to P_n $, means we have an {\\it interacting momentum}. Moreover, in the particular case of a diagonal potential, i.e. $~V_{nm}=\\delta_{nm}~V_n~$, Eq.~(\\ref{gridev}) yields a relation which resembles a self-energy equation,\n\n\\begin{eqnarray}\np_n^2  ~ + ~  \\frac{2}{\\pi} ~ w_n ~ p_n^2 ~  V_n = P_n^2  \\; ,\n\\label{self}\n\\end{eqnarray}\n\n\\noindent\nwhere $P_n^2$ denotes the eigenvalues of the hamiltonian.\n\n\n\n\\subsection{SRG flow equations}\n\nThe SRG flow equations on the finite momentum grid for the matrix-elements of the potential in a given partial wave follow from inserting the completeness relation, Eq.~(\\ref{completeness}), into the SRG flow equation in operator form, Eq.~(\\ref{wegfloweq}). In the case of the Wilson generator we get\n\n\n", "itemtype": "equation", "pos": 50967, "prevtext": "\n\n\\noindent\nFollowing the method introduced by Steele and Furnstahl~\\cite{Steele:1998un}, we fit the difference between the inverse on-shell $K$-matrices corresponding to the toy model potential and the ERE expansion to an interpolating polynomial of degree $k^2$ for a spread of very small on-shell momenta ($k \\le 0.1~{\\rm fm^{-1}}$), namely\n\n\\begin{eqnarray}\n\\Delta K^{-1}=K^{-1}(k,k;k^2) - K^{-1}_{\\rm ERE}(k,k;k^2) = A_0 + A_2~k^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nand then minimize the coefficients $A_0$ and $A_2$ with respect to the variations of the parameters $C$ and $L$.\n\nIn the case of the separable gaussian potential toy model, given by\nEq.~(\\ref{gaupot}), it is straightforward to determine the\nphase-shifts $\\delta(k)$ from the solution of the LS equation for the\n$T$-matrix using the {\\it ansatz}\n\n\\begin{eqnarray}\nT(p,p';k^2) = g_L(p) ~t(k)~ g_L(p') \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $t(k)$ is called the reduced on-shell $T$-matrix. This leads to\nthe simple relation (valid for separable potenials only)\n\n\\begin{eqnarray}\n k \\cot \\delta(k)= - \\frac{1}{V(k,k)} \\left[1- \\frac{2}{\\pi}\\;\n{\\cal P}\\int_0^\\infty dq~q^2 \\frac{1}{k^2-q^2} V(q,q) \\right] \\; .\n\\label{phasetoy}\n\\end{eqnarray}\n\n\nIn Table \\ref{tab:toy} we display the values of the parameters for the toy model potential in the $^1S_0$ and the $^3S_1$ channels used in our numerical calculations, which are adjusted to reproduce the corresponding experimental values of $a_0$ and $r_e$ by the method described above.\n\n\n\\begin{table}[h]\n\\caption{Parameters for the toy model potential in the $^1S_0$ and the $^3S_1$ channels used in the numerical calculations.}\n\\vskip 0.3cm\n\\centering\n\\begin{tabular}{c c c c c c c }\n\\hline\\hline\n - & $a_0~({\\rm fm})$  &  $r_e~({\\rm fm})$  & $ C~({\\rm fm})$ & $1/L^{2}~({\\rm fm}^{2})$  \\\\\n\\hline\\hline\n$^1S_0$   & -23.74  & 2.77 & -1.915884  &  0.6913 \\\\\n$^3S_1$   & 5.42    & 1.75 & -2.300641  &  0.4151 \\\\\n\\hline\n\\end{tabular}\n\\label{tab:toy}\n\\end{table}\n\n\nThe phase-shifts for the toy model potential in the $^1S_0$ and the\n$^3S_1$ channels evaluated from Eq.~(\\ref{phasetoy}) are shown in\nFig.~\\ref{fig:1}, together with the results obtained from the 1993\nNijmegen partial-wave analysis (PWA) \\cite{Stoks:1993tb} or the more\nrecent 2013\nupgrades~\\cite{Perez:2013mwa,Perez:2013jpa,Perez:2013oba,Perez:2014yla}. As\none can see, despite the simplicity of the potential and the fact that\nthe $^3S_1$ channel is not treated as a coupled channel, our toy model\nfor the $NN$ interaction provides a reasonable qualitative description\nof the $S$-wave phase-shifts. Moreover, the on-shell $T$-matrix for\nthe $^3S_1$ channel toy model potential has a pole located at an\nimaginary momentum $k= i~\\gamma=i~0.2314~{\\rm fm^{-1}}$, corresponding\nto a satisfactory Deuteron binding-energy $B_d \\simeq 2 ~ {\\rm MeV}$.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig1a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.65cm]{fig1b.pdf}\n\\end{center}\n\\caption{Phase-shifts for the toy model potential in the $^1S_0$ and the $^3S_1$ channels compared to the results obtained from the Nijmegen PWA \\cite{Stoks:1993tb}.}\n\\label{fig:1}\n\\end{figure}\n\n\n\n\n\\section{SRG on a finite momentum grid}\n\\label{sec:SRG-grid}\n\n\\subsection{Momentum-space grid}\n\nFor most cases of interest the SRG flow equations are solved numerically on a finite momentum grid with $N$ integration points\n$p_n$ and weights $w_n$ ($n=1, \\dots N$) by implementing a high-momentum ultraviolet (UV) cutoff, $p_{\\rm max}=\\Lambda$, and an\ninfrared (IR) momentum cutoff, $p_{\\rm min} = \\Delta p$. The integration rule becomes\n\n\\begin{eqnarray}\n\\int_{\\Delta p}^\\Lambda dp f(p) \\to \\sum_{n=1}^N w_n f(p_n) \\; .\n\\end{eqnarray}\n\n\nTaking Chebychev-Gauss points~\\cite{demidovich1973computational}, for\nexample, we get after re-scaling to the interval $[0,\\Lambda]$,\n\n\\begin{eqnarray}\np_n = \\frac{\\Lambda}{2}\\left\\{ 1- \\cos \\left[ \\frac{\\pi}N (n-1/2) \\right] \\right\\}\n\\;  , \\qquad\nw_n =  \\frac{\\Lambda}{2} \\frac{\\pi}{N} \\sin \\left[\\frac{\\pi}N (n-1/2) \\right] \\; ,\n\\end{eqnarray}\n\n\\noindent\nand thus\n\\begin{eqnarray}\np_{\\rm min} = p_1 =  \\Lambda \\sin^2 \\left( \\frac{\\pi}{4N}\\right)\n\\;  , \\qquad\np_{\\rm max} = p_N =  \\Lambda \\sin^2 \\left[ \\frac{\\pi}{2N} (N-1/2) \\right]  \\; .\n\\end{eqnarray}\n\n\\noindent\nFor a large grid and for $n << N$ we have $p_n= \\Lambda (\\pi n/2N)^2/2$ which differs from the spherical box quantization. As it is well known, this grid choice guarantees an exact result for polynomials in p to order $M \\le N$, i.e.\n\n\\begin{eqnarray}\n\\int_{\\Delta p}^\\Lambda dp \\frac{P_M (p)}{\\sqrt{\\Lambda^2-p^2}}  = \\sum_{n=1}^N w_n \\frac{P_M(p_n)}{\\sqrt{\\Lambda^2-p_n^2}} \\; .\n\\end{eqnarray}\n\n\\noindent\nThe completeness relation in discretized partial-wave relative momentum-space basis is given by\n\n\\begin{eqnarray}\n\\frac{2}{\\pi}\\sum_{n=1}^N w_n ~p_n^2 ~| p_n \\rangle \\langle p_n |={\\bf 1} \\; .\n\\label{completeness}\n\\end{eqnarray}\n\n\nOnce we have the finite momentum grid we may seek to diagonalize the hamiltonian, whose matrix-elements read\n\n\\begin{eqnarray}\nH(p_n,p_m)=p_n^2 ~ \\delta_{nm} + \\frac{2}{\\pi}w_n~p_n^2 ~V_{nm}  \\; ,\n\\label{gridev}\n\\end{eqnarray}\n\n\\noindent\nwhere $V_{nm}$ denotes the matrix-elements of the potential $V(p_n,p_m)$. The discrete eigenvalue equations on the finite momentum grid are given by\n\n\\begin{eqnarray}\np_n^2 ~\\psi_\\alpha (p_n) + \\frac{2}{\\pi}\\sum_k w_k ~p_k^2 ~V_{nk}\n~\\psi_\\alpha(p_k) = P_\\alpha^2 ~ \\psi_\\alpha (p_n) \\; ,\n\\label{gridev}\n\\end{eqnarray}\n\nwhere $P_\\alpha^2$ and $\\psi_\\alpha (p_n)$ stand respectively for the eigenvalues and the eigenfunctions of the hamiltonian.\n\nThe weight factors $w_n$ complicate the discrete eigenvalue equations and hide the hermiticity of the hamiltonian. Making a change of variables\n\n\\begin{eqnarray}\n\\psi_\\alpha(p_n) = \\frac{\\varphi_\\alpha(p_n)}{p_n \\sqrt{2 w_n/\\pi}} \\; ,\n\\end{eqnarray}\n\n\\noindent\nwe have\n\n\\begin{eqnarray}\np_n^2 ~\\varphi_\\alpha (p_n) + \\frac{2}{\\pi}\\sum_k \\sqrt{w_n} ~p_n\n~V_{nk} ~\\sqrt{w_k}~ p_k ~ \\varphi_\\alpha(p_k) = P_\\alpha^2 ~\n\\varphi_\\alpha (p_n) \\; .\n\\end{eqnarray}\n\n\\noindent\nThus the square-integrability condition reads\n\n\\begin{eqnarray}\n\\frac2{\\pi}\\sum_{n=1}^N w_n p_n^2 | \\psi(p_n) |^2 = \\sum_{n=1}^N |\n\\varphi(p_n) |^2 \\; ,\n\\end{eqnarray}\n\n\\noindent\nand the multiplication of operators corresponds to the plain matrix multiplication\n\n\n", "index": 19, "text": "\\begin{equation}\n\\langle A, B \\rangle = \\left(\\frac{2}{\\pi}\\right)^2 \\int_0^\\infty\np^2 dp \\int_0^\\infty k^2 dk A(k,p)^* B(p,k) \\to\n\\left(\\frac{2}{\\pi}\\right)^2 \\sum_{n,k=1}^N w_n w_k p_n^2 p_k^2\nA_{nk}^* B_{kn} \\; \\equiv \\sum_{n,m=1}^N \\bar{A}^*_{nk} ~\n\\bar{B}_{kn} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"\\langle A,B\\rangle=\\left(\\frac{2}{\\pi}\\right)^{2}\\int_{0}^{\\infty}p^{2}dp\\int_%&#10;{0}^{\\infty}k^{2}dkA(k,p)^{*}B(p,k)\\to\\left(\\frac{2}{\\pi}\\right)^{2}\\sum_{n,k=%&#10;1}^{N}w_{n}w_{k}p_{n}^{2}p_{k}^{2}A_{nk}^{*}B_{kn}\\;\\equiv\\sum_{n,m=1}^{N}\\bar%&#10;{A}^{*}_{nk}~{}\\bar{B}_{kn}\\;,\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><mi>A</mi><mo>,</mo><mi>B</mi><mo stretchy=\"false\">⟩</mo></mrow><mo>=</mo><mrow><msup><mrow><mo>(</mo><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><msup><mi>p</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>𝑑</mo><mi>p</mi></mrow><mo>⁢</mo><mrow><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mrow><msup><mi>k</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo>𝑑</mo><mi>k</mi></mrow><mo>⁢</mo><mi>A</mi><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>k</mi><mo>,</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mo>*</mo></msup><mo>⁢</mo><mi>B</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo>,</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>→</mo><mrow><msup><mrow><mo>(</mo><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>n</mi><mo>,</mo><mi>k</mi></mrow><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><msub><mi>w</mi><mi>n</mi></msub><mo>⁢</mo><msub><mi>w</mi><mi>k</mi></msub><mo>⁢</mo><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>p</mi><mi>k</mi><mn>2</mn></msubsup><mo>⁢</mo><msubsup><mi>A</mi><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow><mo>*</mo></msubsup><mo>⁢</mo><mpadded width=\"+2.8pt\"><msub><mi>B</mi><mrow><mi>k</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>≡</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow><mo>=</mo><mn>1</mn></mrow><mi>N</mi></munderover><mrow><mpadded width=\"+3.3pt\"><msubsup><mover accent=\"true\"><mi>A</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow><mo>*</mo></msubsup></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><msub><mover accent=\"true\"><mi>B</mi><mo stretchy=\"false\">¯</mo></mover><mrow><mi>k</mi><mo>⁢</mo><mi>n</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nand in the case of the Wegner generator,\n\n\n", "itemtype": "equation", "pos": 52470, "prevtext": "\n\n\\noindent\nwhere\n\n\\begin{eqnarray}\n\\bar{A}_{nm} = \\frac{2}{\\pi} ~ p_n \\sqrt{w_n} ~ A_{nm} ~p_m \\sqrt{w_m} \\; .\n\\end{eqnarray}\n\n\\noindent\nIn terms of this new basis the discrete eigenvalue equations become very simple,\nwithout the disturbing extra factors, as it was shown in Section~\\ref{sec:discrete}. Note that in the free case, $V_{nm}=0$, we have $\\psi_\\alpha(p_n)\\sim \\delta_{\\alpha,n}$, so that labeling states as distorted states\nstemming from a given free state, $p_n \\to P_n $, means we have an {\\it interacting momentum}. Moreover, in the particular case of a diagonal potential, i.e. $~V_{nm}=\\delta_{nm}~V_n~$, Eq.~(\\ref{gridev}) yields a relation which resembles a self-energy equation,\n\n\\begin{eqnarray}\np_n^2  ~ + ~  \\frac{2}{\\pi} ~ w_n ~ p_n^2 ~  V_n = P_n^2  \\; ,\n\\label{self}\n\\end{eqnarray}\n\n\\noindent\nwhere $P_n^2$ denotes the eigenvalues of the hamiltonian.\n\n\n\n\\subsection{SRG flow equations}\n\nThe SRG flow equations on the finite momentum grid for the matrix-elements of the potential in a given partial wave follow from inserting the completeness relation, Eq.~(\\ref{completeness}), into the SRG flow equation in operator form, Eq.~(\\ref{wegfloweq}). In the case of the Wilson generator we get\n\n\n", "index": 21, "text": "\\begin{equation}\n\\frac{d V_{nm}(s)}{ds} = -(p_n^2-p_m^2)^2 V_{nm}(s) +\n\\frac{2}{\\pi}\\sum_{k}w_k~ p_k^2 (p_n^2+p_m^2-2 p_k^2) V_{nk}(s) V_{km}(s)  \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"\\frac{dV_{nm}(s)}{ds}=-(p_{n}^{2}-p_{m}^{2})^{2}V_{nm}(s)+\\frac{2}{\\pi}\\sum_{k%&#10;}w_{k}~{}p_{k}^{2}(p_{n}^{2}+p_{m}^{2}-2p_{k}^{2})V_{nk}(s)V_{km}(s)\\;,\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mo>-</mo><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>p</mi><mi>m</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder><mrow><mpadded width=\"+3.3pt\"><msub><mi>w</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>p</mi><mi>k</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>+</mo><msubsup><mi>p</mi><mi>m</mi><mn>2</mn></msubsup></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msubsup><mi>p</mi><mi>k</mi><mn>2</mn></msubsup></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>k</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhere $e_n(s)=p_n^2 + \\frac{2}{\\pi} w_n ~p_n^2 ~V_s(p_n,p_n)$\n\nThe eigenvalue problem on the finite momentum grid for the SRG-evolved hamiltonian $H_{\\lambda} = U_{\\lambda}~H~U_{\\lambda}^{\\dagger}$ may be formulated as\n\n\\begin{eqnarray}\nH_{\\lambda}~ | \\alpha,\\lambda \\rangle = P_\\alpha^2 ~| \\alpha,\\lambda \\rangle   \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $| \\alpha,\\lambda \\rangle$ are the eigenstates of $H_{\\lambda}$. The matrix-elements of the hamiltonian $H_{\\lambda}$ and the corresponding eigenfunctions $\\psi_{\\alpha,\\lambda}$ in momentum-space representation are given respectively by\n\n\n", "itemtype": "equation", "pos": 52689, "prevtext": "\n\n\\noindent\nand in the case of the Wegner generator,\n\n\n", "index": 23, "text": "\\begin{equation}\n\\frac{d V_{nm}(s)}{ds} = -(p_n^2-p_m^2)\\left[e_n(s) - e_m(s)\\right] V_{nm}(s)+\\frac{2}{\\pi}\\sum_{k}w_k~ p_k^2 \\left[e_n(s)+e_m(s)-2 e_k(s) \\right] V_{nk}(s) V_{km}(s)  \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"\\frac{dV_{nm}(s)}{ds}=-(p_{n}^{2}-p_{m}^{2})\\left[e_{n}(s)-e_{m}(s)\\right]V_{%&#10;nm}(s)+\\frac{2}{\\pi}\\sum_{k}w_{k}~{}p_{k}^{2}\\left[e_{n}(s)+e_{m}(s)-2e_{k}(s)%&#10;\\right]V_{nk}(s)V_{km}(s)\\;,\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>s</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>p</mi><mi>m</mi><mn>2</mn></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><msub><mi>e</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msub><mi>e</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>k</mi></munder><mrow><mpadded width=\"+3.3pt\"><msub><mi>w</mi><mi>k</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>p</mi><mi>k</mi><mn>2</mn></msubsup><mo>⁢</mo><mrow><mo>[</mo><mrow><mrow><mrow><msub><mi>e</mi><mi>n</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><msub><mi>e</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msub><mi>e</mi><mi>k</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>]</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>k</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>k</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nand\n\n\n", "itemtype": "equation", "pos": 53497, "prevtext": "\n\n\\noindent\nwhere $e_n(s)=p_n^2 + \\frac{2}{\\pi} w_n ~p_n^2 ~V_s(p_n,p_n)$\n\nThe eigenvalue problem on the finite momentum grid for the SRG-evolved hamiltonian $H_{\\lambda} = U_{\\lambda}~H~U_{\\lambda}^{\\dagger}$ may be formulated as\n\n\\begin{eqnarray}\nH_{\\lambda}~ | \\alpha,\\lambda \\rangle = P_\\alpha^2 ~| \\alpha,\\lambda \\rangle   \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $| \\alpha,\\lambda \\rangle$ are the eigenstates of $H_{\\lambda}$. The matrix-elements of the hamiltonian $H_{\\lambda}$ and the corresponding eigenfunctions $\\psi_{\\alpha,\\lambda}$ in momentum-space representation are given respectively by\n\n\n", "index": 25, "text": "\\begin{equation}\nH_{\\lambda}(p_n,p_m) = p_n^2 ~ \\delta_{nm} + \\frac{2}{\\pi} w_n ~p_n^2 ~V_{\\lambda}(p_n,p_m)  \\;\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"H_{\\lambda}(p_{n},p_{m})=p_{n}^{2}~{}\\delta_{nm}+\\frac{2}{\\pi}w_{n}~{}p_{n}^{2%&#10;}~{}V_{\\lambda}(p_{n},p_{m})\\;\" display=\"block\"><mrow><mrow><msub><mi>H</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo>,</mo><msub><mi>p</mi><mi>m</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mpadded width=\"+3.3pt\"><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup></mpadded><mo>⁢</mo><msub><mi>δ</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub></mrow><mo>+</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><mpadded width=\"+3.3pt\"><msub><mi>w</mi><mi>n</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+3.3pt\"><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup></mpadded><mo>⁢</mo><msub><mi>V</mi><mi>λ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo>,</mo><msub><mi>p</mi><mi>m</mi></msub><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nA bound-state with (negative) eigenvalue $P_\\alpha^2 =- B_\\alpha$\ncorresponds to a pole in the scattering amplitude at imaginary\nmomentum $P_\\alpha= i~ \\gamma$. Because of the commutator structure of the SRG flow equation the isospectrality property still holds on the grid and therefore the eigenvalues $P^{2}_{\\alpha}$ of $H_{\\lambda}$ are $\\lambda$-independent, i.e.\n\n\\begin{eqnarray}\n\\frac{d P_\\alpha}{d \\lambda}=0  \\; .\n\\end{eqnarray}\n\n\nAs we have discussed in section \\ref{sec:discrete}, although the\nisospectrality property ensures that the eigenvalues of the\nhamiltonian remain invariant along the SRG trajectory, the ordering of\nthe states may depend on the specific choice of the SRG generator\n$G_s$. This yields to an interesting feature observed systematically\nin SRG calculations when bound-states are allowed by the\ninteraction. In the presence of bound-states (real or spurious),\nhamiltonians evolved using the Wilson and the Wegner generators begin\nto flow differently when the SRG cutoff $\\lambda$ approaches some\ncritical momentum $\\Lambda_c$, which corresponds to the threshold\nscale where the bound-state emerges \\cite{Glazek:2008pg,Wendt:2011qj}\n(one should note that the critical momentum $\\Lambda_c$ is distinct\nfrom the characteristic bound-state momentum scale $\\gamma$). This is\nexplicitly verified by a block-diagonal generator\nanalysis~\\cite{Arriola:2014fqa} (see also an analysis based just on\nscattering information~\\cite{Arriola:2014aia} using Effective Field\nTheory ideas). In the Wilson generator case the bound-state remains\ncoupled to the low-momentum scales as $\\lambda$ approaches\n$\\Lambda_c$, such that the bound-state eigenvalue is pushed towards\nthe lowest momentum available on the grid, $p_1$, which corresponds to\nthe IR momentum cutoff $\\Delta p$. Moreover, matrix-elements of the\npotential at low-momentum diverge when $\\Delta p \\to 0$ in order to\nforce the bound-state eigenvalue to smaller momenta, such that the SRG\nevolution may become numerically unstable. In the Wegner generator\ncase the bound-state decouples from the low-momentum scales as\n$\\lambda$ approaches $\\Lambda_c$, being placed on the diagonal of the\nhamiltonian as an isolated negative eigenvalue at a momentum\n$p_{n_{\\rm BS}}$ between the lowest momentum on the grid $p_1$ and the\ncritical momentum $\\Lambda_c$. As pointed out in\nRef.~\\cite{Wendt:2011qj}, the {\\it a priori} determination of the\nposition at which the bound-state is placed on the diagonal when using\nthe Wegner generator is still an open problem. It is important to note\nthat when the SRG cutoff $\\lambda$ is kept well above the critical\nmomentum $\\Lambda_c$ or in the absence of bound-states the SRG\nevolutions using the Wilson and the Wegner generators are nearly\nidentical, a behavior that can be traced to the dominance of the\nkinetic energy.\n\n\n\n\\section{The scattering problem on a finite momentum grid}\n\\label{sec:scatt-grid}\n\nSo far we have dealt with the evolution of the hamiltonian according\nto the SRG flow equations, which take a manageable form in the discrete\nmomentum basis. In this section we exploit the same basis to analyze\nthe scattering problem and point out several specific features\nunveiled in our previous work~\\cite{Arriola:2014aia} and extending them.\n\nOf course, the momentum grid should in principle be arbitrary. In the\nnext section we consider a physically motivated procedure based on\nconsidering a spherical box which introduces a quantization condition\nfor the momentum and also allows a straightforward determination of\nthe phase-shifts at the quantized momentum values. However, this\nfinite box scheme makes the choice of the grid to depend on the\nangular momentum. Afterwards we will consider the standard and fixed\ngaussian integration grid which is valid for all partial waves,\nalthough the identification of the phase-shifts is less obvious.\n\n\n\n\\subsection{LS equation and phase-shifts}\n\nFor the case of nuclear hamiltonians and more specifically for the\n$NN$ situation, the scattering problem requires defining phase-shifts.\nUnfortunately, the standard methods to handle the scattering problem\nin momentum-space do it through the numerical solution of the LS\nequation, which introduce a momentum grid but do not allow to compute\nthe phase-shifts on the {\\it same} grid points. In fact there appear\ntwo different grids where a difference between the so-called\nobservation points in discrete energy values and the momenta on\ndiscrete values are not in one-to-one correspondence. For our\npurposes, it becomes necessary to use a method where the phase-shifts can\nbe defined on the momentum grid {\\it without} extra observation\npoints.\n\nIn operator form, the LS equation for the $T$-matrix of a two-body system reads\n\n\\begin{eqnarray}\nT(E) &=& V + V~G_{0}^{+}(E)~T(E) \\; ,\n\\label{LS}\n\\end{eqnarray}\n\n\\noindent\nwhere $E$ is the scattering energy and $G_{0}^{+}(E) = (E - h_0 + i\n\\epsilon)^{-1}$ is the free Green's function with outgoing-wave\nboundary conditions given in terms of the free hamiltonian $h_0$\n(which corresponds to the kinetic energy operator $T$).\n\nThe LS equation for the $T$-matrix on the finite momentum grid is\nobtained by taking the matrix-elements in the discretized partial-wave\nrelative momentum-space basis and reads\n\n\\begin{eqnarray}\nT_{nm}(p) = V_{nm} + \\frac{2}{\\pi} \\sum_{k=1}^N w_k \\frac{p_k^2}{p^2-p_k^2+ i \\epsilon} V_{nk} T_{km}(p) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $p^2$ is the scattering energy $E$. Note that the momentum $p$\ncorresponding to the observation point can in principle be chosen\nindependently of the momentum grid. The on-shell limit is obtained by\ntaking $p=p_n$ on the grid. We switch to the $R$-matrix, which on the\ngrid yields the LS equation for the half-on-shell amplitude\n\n\\begin{eqnarray}\nR_{nm}(p_n) = V_{nm} + \\frac{2}{\\pi} \\sum_{k \\neq n} w_k \\frac{p_k^2}{p_n^2-p_k^2} V_{nk} R_{km}(p_n) \\; ,\n\\label{LSreaction}\n\\end{eqnarray}\n\n\\noindent\nwhere the excluded sum embodies the principal value prescription of the continuum version, Eq.~(\\ref{LSKNN}). This equation can be solved by inversion for any grid point $p_n$ and thus we obtain the LS phase-shift~\\footnote{The explicit, and apparently pedantic, LS label in $\\delta^{\\rm LS}(p_n)$ is not redundant; it does reflect the dependence on the choice of the LS equation, the grid and the number of grid points. This will become clear below when we show the inequivalence of these phase-shifts on a finite momentum grid along the SRG trajectories.}\n\n\\begin{eqnarray}\n- ~ \\frac{\\tan \\delta^{\\rm LS}(p_n)}{p_n} = R_{nn} (p_n) \\; .\n\\label{LSphase}\n\\end{eqnarray}\n\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig2a.pdf} \\hspace{0.5cm}\n\\includegraphics[width=7.65cm]{fig2b.pdf}\n\\end{center}\n\\caption{Phase-shifts for the toy model separable gaussian potential in the $^1S_0$ and the $^3S_1$ channels evaluated from the solution of the LS equation on the grid {\\it at the grid points} for a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$. For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).}\n\\label{fig:2}\n\\end{figure}\n\n\nIn Fig.~\\ref{fig:2} we show the phase-shifts for the toy model separable gaussian\npotential in the $^1S_0$ and the $^3S_1$ channels evaluated from the solution of the LS equation on the grid {\\it at the observation grid points} for a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$, compared to the exact results obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).\n\n\n\n\\subsection{Energy-shift in a box: coordinate space}\n\nWhile the momentum grid provides a viable alternative to\nsolve both the SRG and the scattering equations, since it\ncorresponds to a discretization of the integration rule, it is useful\nto consider a physically motivated situation where this momentum\ndiscretization naturally appears. Thus, we analyze the effects of\nhaving a large spherical box in three dimensions for a central\npotential. The case of a cubic box, which would be relevant for finite\nvolume lattice calculations, has the disadvantage of breaking the\nsymmetries of the problem and will be studied elsewhere.\n\nLet us consider for simplicity a local and finite range potential\n$V(r)$ with a range larger than a certain distance $a$. For the\n$S$-wave at large distances, i.e. outside of the range of the\npotential, we have\n\n\\begin{eqnarray}\nu(r) = \\sin\\left[pr+\\delta(p)\\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nIf the size of the box $L$ is larger than the range $a$ of the potential then\nthe condition of the particle confined to be inside the finite box is\n\n\\begin{eqnarray}\nu(L)=0 \\to p_n L + \\delta(p_n) = n \\pi  \\;  ,\n\\end{eqnarray}\n\n\\noindent\nwhich is a quantization condition for the allowed momentum $p$.  Thus,\nthe effect of the finite box is to discretize the momenta.  In the\nfree case we have $p_{n,0} L = n \\pi $, and then we may write the\nshift in momentum due to the interaction as follows\n\n\\begin{eqnarray}\n\\Delta p_n= p_n -p_{n,0} = - \\frac1{L} \\delta(p_n) \\to - \\frac1{L} \\delta(p) +{\\cal O}(L^{-2}) \\; ,\n\\label{eq:p-box}\n\\end{eqnarray}\n\n\\noindent\nwhere in the last line we assume a large box and a smooth behavior of\nthe phase-shift. This means that the spectrum gets a distortion which\nscales inverse proportional to the size of the box. Note that this\nresult is strictly valid for large box sizes. In the case where the\nbox size is not much larger than the range of the potential, but still\n$L \\gtrsim a $ the quantization condition is actually a non-linear\neigenvalue equation.\n\nThe interesting thing is that integrals over momentum get discretized and one has\n\n\\begin{eqnarray}\n\\int \\frac{dp}{2\\pi} f(p) \\to \\frac1{L} \\sum_n f( \\frac{n \\pi}{L}) \\; .\n\\end{eqnarray}\n\n\\noindent\nFor instance if we sum over functions of eigenvalues of the hamiltonian\n\n\\begin{eqnarray}\n\\sum_n F(E_n) = \\sum_n F(E_n^{(0)}) - \\frac{1}{L} \\sum_n F'(E_n^{(0)}) \\delta(p_{n,0})  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich can be re-written as\n\n\\begin{eqnarray}\n{\\rm Tr} F(H) = {\\rm Tr} F(H_0) - \\int \\frac{dp}{2\\pi}  F'(E) \\delta(p)  \\; .\n\\label{eq:trace}\n\\end{eqnarray}\n\n\nThe procedure above can be generalized to all partial waves, since far from the potential we have\n\n\\begin{eqnarray}\nu_l(r)/r = \\sin \\delta_l(p) ~ j_l( pr) -  \\sin \\delta_l(p) ~ y_l(pr) \\; ,\n\\end{eqnarray}\n\n\\noindent\nso that the box boundary condition yields\n\n\\begin{eqnarray}\n\\sin \\delta_l(p) ~ j_l( p L) -  \\sin \\delta_l(p) ~ y_l(p L)=0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nand obviously the momenta are quantized but also depend on angular momentum.\n\n\n\n\\subsection{From energy-shift to phase-shift}\n\nThe previous analysis motivated Lifshitz many years ago, when studying\nthe impurities in a crystal lattice, to propose a generalization of\nthe quantization condition based on an arbitrary finite momentum\ngrid. This approach, also pursued independently by\nDeWitt~\\cite{DeWitt:1956be} and Fukuda and\nNewton~\\cite{Fukuda:1956zz}, has been taken over in nuclear physics\nfor the analysis of the few-body scattering problem by Kukulin and\ncollaborators in a series of recent and remarkable\nworks~\\cite{kukulin2009discrete,Rubtsova:2010zz,Pomerantsev:2014ija,Rubtsova:2015owa}. The\nbasic idea is to solve the scattering problem without solving the\nscattering equations but just the eigenvalue equations for the\ndiscretized hamiltonian in the continuum limit. One should note that\nwhile the box quantization condition corresponds to a specific\nmomentum grid choice, $p_n = n \\pi/L $ and $w_n = \\pi/L$ in the free\ncase, a general momentum grid does not have an obvious meaning.\n\nOne important feature of the previous form of the LS equation for the\n$R$-matrix on a finite momentum grid, Eq.~(\\ref{LSreaction}), is that\nthe Cauchy principal value for the integral becomes an excluded\nsummation which is not symmetric since the distance above and below\nthe pole differs, i.e. $p_{n+1}^2-p_n^2 \\neq p_n^2-p_{n-1}^2$. This\ninduces some finite asymmetry which is ultimately pointwise removed in\nthe continuum since it scales as $w_n$. However, when summing up the\nspectrum with weight $w_n$ the net effect is finite. Thus, if we\nconsider the matrix $R_{nm}(p)$ as a function of the external\nmomentum $p=p_n$ on the grid corresponding to the scattering energy\n$p_n^2$, we get trivially from Eq.~(\\ref{LSreaction}) that\n$R_{nn}(p_n)=V_n$ for a diagonal potential $V_{nm}=\\delta_{nm}~V_n$,\nsuch that Eq.~(\\ref{self}) can be written in the form\n\n\\begin{eqnarray}\np_n^2+ \\frac2\\pi w_n p_n^2 ~ R_{nn}(p_n) = P_n^2  \\;  .\n\\end{eqnarray}\n\n\\noindent\nA comparison of this relation in the continuum limit, $w_n \\to 0$, with the treatment presented in the previous section for the large box quantization in coordinate space suggests the identification\n\n\n", "itemtype": "equation", "pos": 53641, "prevtext": "\n\n\\noindent\nand\n\n\n", "index": 27, "text": "\\begin{equation}\n\\psi_{\\alpha,\\lambda} (p_n) = \\langle n | \\alpha,\\lambda \\rangle  \\, .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"\\psi_{\\alpha,\\lambda}(p_{n})=\\langle n|\\alpha,\\lambda\\rangle\\,.\" display=\"block\"><mrow><mrow><mrow><msub><mi>ψ</mi><mrow><mi>α</mi><mo>,</mo><mi>λ</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>n</mi><mo stretchy=\"false\">|</mo><mrow><mi>α</mi><mo>,</mo><mi>λ</mi></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">⟩</mo></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhich provides an energy-shift formula to define the phase-shift,\n\n\n", "itemtype": "equation", "pos": 66615, "prevtext": "\n\n\\noindent\nA bound-state with (negative) eigenvalue $P_\\alpha^2 =- B_\\alpha$\ncorresponds to a pole in the scattering amplitude at imaginary\nmomentum $P_\\alpha= i~ \\gamma$. Because of the commutator structure of the SRG flow equation the isospectrality property still holds on the grid and therefore the eigenvalues $P^{2}_{\\alpha}$ of $H_{\\lambda}$ are $\\lambda$-independent, i.e.\n\n\\begin{eqnarray}\n\\frac{d P_\\alpha}{d \\lambda}=0  \\; .\n\\end{eqnarray}\n\n\nAs we have discussed in section \\ref{sec:discrete}, although the\nisospectrality property ensures that the eigenvalues of the\nhamiltonian remain invariant along the SRG trajectory, the ordering of\nthe states may depend on the specific choice of the SRG generator\n$G_s$. This yields to an interesting feature observed systematically\nin SRG calculations when bound-states are allowed by the\ninteraction. In the presence of bound-states (real or spurious),\nhamiltonians evolved using the Wilson and the Wegner generators begin\nto flow differently when the SRG cutoff $\\lambda$ approaches some\ncritical momentum $\\Lambda_c$, which corresponds to the threshold\nscale where the bound-state emerges \\cite{Glazek:2008pg,Wendt:2011qj}\n(one should note that the critical momentum $\\Lambda_c$ is distinct\nfrom the characteristic bound-state momentum scale $\\gamma$). This is\nexplicitly verified by a block-diagonal generator\nanalysis~\\cite{Arriola:2014fqa} (see also an analysis based just on\nscattering information~\\cite{Arriola:2014aia} using Effective Field\nTheory ideas). In the Wilson generator case the bound-state remains\ncoupled to the low-momentum scales as $\\lambda$ approaches\n$\\Lambda_c$, such that the bound-state eigenvalue is pushed towards\nthe lowest momentum available on the grid, $p_1$, which corresponds to\nthe IR momentum cutoff $\\Delta p$. Moreover, matrix-elements of the\npotential at low-momentum diverge when $\\Delta p \\to 0$ in order to\nforce the bound-state eigenvalue to smaller momenta, such that the SRG\nevolution may become numerically unstable. In the Wegner generator\ncase the bound-state decouples from the low-momentum scales as\n$\\lambda$ approaches $\\Lambda_c$, being placed on the diagonal of the\nhamiltonian as an isolated negative eigenvalue at a momentum\n$p_{n_{\\rm BS}}$ between the lowest momentum on the grid $p_1$ and the\ncritical momentum $\\Lambda_c$. As pointed out in\nRef.~\\cite{Wendt:2011qj}, the {\\it a priori} determination of the\nposition at which the bound-state is placed on the diagonal when using\nthe Wegner generator is still an open problem. It is important to note\nthat when the SRG cutoff $\\lambda$ is kept well above the critical\nmomentum $\\Lambda_c$ or in the absence of bound-states the SRG\nevolutions using the Wilson and the Wegner generators are nearly\nidentical, a behavior that can be traced to the dominance of the\nkinetic energy.\n\n\n\n\\section{The scattering problem on a finite momentum grid}\n\\label{sec:scatt-grid}\n\nSo far we have dealt with the evolution of the hamiltonian according\nto the SRG flow equations, which take a manageable form in the discrete\nmomentum basis. In this section we exploit the same basis to analyze\nthe scattering problem and point out several specific features\nunveiled in our previous work~\\cite{Arriola:2014aia} and extending them.\n\nOf course, the momentum grid should in principle be arbitrary. In the\nnext section we consider a physically motivated procedure based on\nconsidering a spherical box which introduces a quantization condition\nfor the momentum and also allows a straightforward determination of\nthe phase-shifts at the quantized momentum values. However, this\nfinite box scheme makes the choice of the grid to depend on the\nangular momentum. Afterwards we will consider the standard and fixed\ngaussian integration grid which is valid for all partial waves,\nalthough the identification of the phase-shifts is less obvious.\n\n\n\n\\subsection{LS equation and phase-shifts}\n\nFor the case of nuclear hamiltonians and more specifically for the\n$NN$ situation, the scattering problem requires defining phase-shifts.\nUnfortunately, the standard methods to handle the scattering problem\nin momentum-space do it through the numerical solution of the LS\nequation, which introduce a momentum grid but do not allow to compute\nthe phase-shifts on the {\\it same} grid points. In fact there appear\ntwo different grids where a difference between the so-called\nobservation points in discrete energy values and the momenta on\ndiscrete values are not in one-to-one correspondence. For our\npurposes, it becomes necessary to use a method where the phase-shifts can\nbe defined on the momentum grid {\\it without} extra observation\npoints.\n\nIn operator form, the LS equation for the $T$-matrix of a two-body system reads\n\n\\begin{eqnarray}\nT(E) &=& V + V~G_{0}^{+}(E)~T(E) \\; ,\n\\label{LS}\n\\end{eqnarray}\n\n\\noindent\nwhere $E$ is the scattering energy and $G_{0}^{+}(E) = (E - h_0 + i\n\\epsilon)^{-1}$ is the free Green's function with outgoing-wave\nboundary conditions given in terms of the free hamiltonian $h_0$\n(which corresponds to the kinetic energy operator $T$).\n\nThe LS equation for the $T$-matrix on the finite momentum grid is\nobtained by taking the matrix-elements in the discretized partial-wave\nrelative momentum-space basis and reads\n\n\\begin{eqnarray}\nT_{nm}(p) = V_{nm} + \\frac{2}{\\pi} \\sum_{k=1}^N w_k \\frac{p_k^2}{p^2-p_k^2+ i \\epsilon} V_{nk} T_{km}(p) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $p^2$ is the scattering energy $E$. Note that the momentum $p$\ncorresponding to the observation point can in principle be chosen\nindependently of the momentum grid. The on-shell limit is obtained by\ntaking $p=p_n$ on the grid. We switch to the $R$-matrix, which on the\ngrid yields the LS equation for the half-on-shell amplitude\n\n\\begin{eqnarray}\nR_{nm}(p_n) = V_{nm} + \\frac{2}{\\pi} \\sum_{k \\neq n} w_k \\frac{p_k^2}{p_n^2-p_k^2} V_{nk} R_{km}(p_n) \\; ,\n\\label{LSreaction}\n\\end{eqnarray}\n\n\\noindent\nwhere the excluded sum embodies the principal value prescription of the continuum version, Eq.~(\\ref{LSKNN}). This equation can be solved by inversion for any grid point $p_n$ and thus we obtain the LS phase-shift~\\footnote{The explicit, and apparently pedantic, LS label in $\\delta^{\\rm LS}(p_n)$ is not redundant; it does reflect the dependence on the choice of the LS equation, the grid and the number of grid points. This will become clear below when we show the inequivalence of these phase-shifts on a finite momentum grid along the SRG trajectories.}\n\n\\begin{eqnarray}\n- ~ \\frac{\\tan \\delta^{\\rm LS}(p_n)}{p_n} = R_{nn} (p_n) \\; .\n\\label{LSphase}\n\\end{eqnarray}\n\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig2a.pdf} \\hspace{0.5cm}\n\\includegraphics[width=7.65cm]{fig2b.pdf}\n\\end{center}\n\\caption{Phase-shifts for the toy model separable gaussian potential in the $^1S_0$ and the $^3S_1$ channels evaluated from the solution of the LS equation on the grid {\\it at the grid points} for a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$. For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).}\n\\label{fig:2}\n\\end{figure}\n\n\nIn Fig.~\\ref{fig:2} we show the phase-shifts for the toy model separable gaussian\npotential in the $^1S_0$ and the $^3S_1$ channels evaluated from the solution of the LS equation on the grid {\\it at the observation grid points} for a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$, compared to the exact results obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).\n\n\n\n\\subsection{Energy-shift in a box: coordinate space}\n\nWhile the momentum grid provides a viable alternative to\nsolve both the SRG and the scattering equations, since it\ncorresponds to a discretization of the integration rule, it is useful\nto consider a physically motivated situation where this momentum\ndiscretization naturally appears. Thus, we analyze the effects of\nhaving a large spherical box in three dimensions for a central\npotential. The case of a cubic box, which would be relevant for finite\nvolume lattice calculations, has the disadvantage of breaking the\nsymmetries of the problem and will be studied elsewhere.\n\nLet us consider for simplicity a local and finite range potential\n$V(r)$ with a range larger than a certain distance $a$. For the\n$S$-wave at large distances, i.e. outside of the range of the\npotential, we have\n\n\\begin{eqnarray}\nu(r) = \\sin\\left[pr+\\delta(p)\\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nIf the size of the box $L$ is larger than the range $a$ of the potential then\nthe condition of the particle confined to be inside the finite box is\n\n\\begin{eqnarray}\nu(L)=0 \\to p_n L + \\delta(p_n) = n \\pi  \\;  ,\n\\end{eqnarray}\n\n\\noindent\nwhich is a quantization condition for the allowed momentum $p$.  Thus,\nthe effect of the finite box is to discretize the momenta.  In the\nfree case we have $p_{n,0} L = n \\pi $, and then we may write the\nshift in momentum due to the interaction as follows\n\n\\begin{eqnarray}\n\\Delta p_n= p_n -p_{n,0} = - \\frac1{L} \\delta(p_n) \\to - \\frac1{L} \\delta(p) +{\\cal O}(L^{-2}) \\; ,\n\\label{eq:p-box}\n\\end{eqnarray}\n\n\\noindent\nwhere in the last line we assume a large box and a smooth behavior of\nthe phase-shift. This means that the spectrum gets a distortion which\nscales inverse proportional to the size of the box. Note that this\nresult is strictly valid for large box sizes. In the case where the\nbox size is not much larger than the range of the potential, but still\n$L \\gtrsim a $ the quantization condition is actually a non-linear\neigenvalue equation.\n\nThe interesting thing is that integrals over momentum get discretized and one has\n\n\\begin{eqnarray}\n\\int \\frac{dp}{2\\pi} f(p) \\to \\frac1{L} \\sum_n f( \\frac{n \\pi}{L}) \\; .\n\\end{eqnarray}\n\n\\noindent\nFor instance if we sum over functions of eigenvalues of the hamiltonian\n\n\\begin{eqnarray}\n\\sum_n F(E_n) = \\sum_n F(E_n^{(0)}) - \\frac{1}{L} \\sum_n F'(E_n^{(0)}) \\delta(p_{n,0})  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich can be re-written as\n\n\\begin{eqnarray}\n{\\rm Tr} F(H) = {\\rm Tr} F(H_0) - \\int \\frac{dp}{2\\pi}  F'(E) \\delta(p)  \\; .\n\\label{eq:trace}\n\\end{eqnarray}\n\n\nThe procedure above can be generalized to all partial waves, since far from the potential we have\n\n\\begin{eqnarray}\nu_l(r)/r = \\sin \\delta_l(p) ~ j_l( pr) -  \\sin \\delta_l(p) ~ y_l(pr) \\; ,\n\\end{eqnarray}\n\n\\noindent\nso that the box boundary condition yields\n\n\\begin{eqnarray}\n\\sin \\delta_l(p) ~ j_l( p L) -  \\sin \\delta_l(p) ~ y_l(p L)=0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nand obviously the momenta are quantized but also depend on angular momentum.\n\n\n\n\\subsection{From energy-shift to phase-shift}\n\nThe previous analysis motivated Lifshitz many years ago, when studying\nthe impurities in a crystal lattice, to propose a generalization of\nthe quantization condition based on an arbitrary finite momentum\ngrid. This approach, also pursued independently by\nDeWitt~\\cite{DeWitt:1956be} and Fukuda and\nNewton~\\cite{Fukuda:1956zz}, has been taken over in nuclear physics\nfor the analysis of the few-body scattering problem by Kukulin and\ncollaborators in a series of recent and remarkable\nworks~\\cite{kukulin2009discrete,Rubtsova:2010zz,Pomerantsev:2014ija,Rubtsova:2015owa}. The\nbasic idea is to solve the scattering problem without solving the\nscattering equations but just the eigenvalue equations for the\ndiscretized hamiltonian in the continuum limit. One should note that\nwhile the box quantization condition corresponds to a specific\nmomentum grid choice, $p_n = n \\pi/L $ and $w_n = \\pi/L$ in the free\ncase, a general momentum grid does not have an obvious meaning.\n\nOne important feature of the previous form of the LS equation for the\n$R$-matrix on a finite momentum grid, Eq.~(\\ref{LSreaction}), is that\nthe Cauchy principal value for the integral becomes an excluded\nsummation which is not symmetric since the distance above and below\nthe pole differs, i.e. $p_{n+1}^2-p_n^2 \\neq p_n^2-p_{n-1}^2$. This\ninduces some finite asymmetry which is ultimately pointwise removed in\nthe continuum since it scales as $w_n$. However, when summing up the\nspectrum with weight $w_n$ the net effect is finite. Thus, if we\nconsider the matrix $R_{nm}(p)$ as a function of the external\nmomentum $p=p_n$ on the grid corresponding to the scattering energy\n$p_n^2$, we get trivially from Eq.~(\\ref{LSreaction}) that\n$R_{nn}(p_n)=V_n$ for a diagonal potential $V_{nm}=\\delta_{nm}~V_n$,\nsuch that Eq.~(\\ref{self}) can be written in the form\n\n\\begin{eqnarray}\np_n^2+ \\frac2\\pi w_n p_n^2 ~ R_{nn}(p_n) = P_n^2  \\;  .\n\\end{eqnarray}\n\n\\noindent\nA comparison of this relation in the continuum limit, $w_n \\to 0$, with the treatment presented in the previous section for the large box quantization in coordinate space suggests the identification\n\n\n", "index": 29, "text": "\\begin{equation}\nR_{nn}(p_n)  = \\frac{\\pi}{2} ~ \\frac{\\left( P^2_n - p^2_n \\right)}{ w_n~p^2_n}  \\to\n-\\frac{\\delta^{\\rm ES}(p_n)}{p_n} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"R_{nn}(p_{n})=\\frac{\\pi}{2}~{}\\frac{\\left(P^{2}_{n}-p^{2}_{n}\\right)}{w_{n}~{}%&#10;p^{2}_{n}}\\to-\\frac{\\delta^{\\rm ES}(p_{n})}{p_{n}}\\;,\" display=\"block\"><mrow><mrow><mrow><msub><mi>R</mi><mrow><mi>n</mi><mo>⁢</mo><mi>n</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><mfrac><mi>π</mi><mn>2</mn></mfrac></mpadded><mo>⁢</mo><mfrac><mrow><mo>(</mo><mrow><msubsup><mi>P</mi><mi>n</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup></mrow><mo>)</mo></mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi>w</mi><mi>n</mi></msub></mpadded><mo>⁢</mo><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup></mrow></mfrac></mrow><mo>→</mo><mrow><mo>-</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><msup><mi>δ</mi><mi>ES</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><msub><mi>p</mi><mi>n</mi></msub></mfrac></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nOf course, both the energy-shift (ES) and the LS definitions for the\nphase-shift lead to the same results in the continuum limit, $w_n \\to\n0$. However, for a finite momentum grid there are important\ndifferences which are relevant for the SRG evolution, namely, for\nunitary transformations on the grid the energy-shift definition of the\nphase-shift provides invariant results along the SRG trajectory unlike\nthe LS phase-shift (see below). One should also note that the\nenergy-shift formula for the phase-shift is not unique. We could\ninstead use a momentum-shift formula very much in agreement with the\nfinite box treatment. Quite generally, all these possible formulas\nbecome equivalent in the continuum limit, but for a finite number $N$\nof grid points we should expect differences. It would be highly\ninteresting to design formulas where improved accuracies for finite\n$N$ are displayed. We leave this interesting topic for future\nresearch. Finally, it is important to note that for a finite momentum\ngrid with dimension $N$ there are $N!$ possible permutations for the\neigenvalues $P^2_n$ obtained from the diagonalization of the\nhamiltonian and so the evaluation of phase-shifts using the\nenergy-shift approach necessarily involves an ordering prescription.\n\n\n\n\\subsection{Phase-equivalence and inequivalence}\n\\label{phaseineq}\n\nAs pointed out before the original motivation for the application of the SRG in the context of nuclear physics was to\nsoften the $NN$ interaction while keeping the phase-shifts invariant. In our previous work \\cite{Arriola:2014aia} we have shown that on a finite momentum grid phase-equivalence does not hold along the SRG trajectory for the LS definition, while for the isospectral definition based on the energy-shift formula phase-equivalence is preserved. In this section we elaborate more on this issue.\n\nFirst, let us consider the eigenstate decomposition of the LS equation for the $T$-matrix on a finite momentum grid with the SRG-evolved potential, which can be written in operator form as\n\n\\begin{eqnarray}\nT(E)= V_{\\lambda} + V_{\\lambda} (p^2 - H_{\\lambda}+ i \\epsilon)^ {-1} V_{\\lambda} \\; .\n\\end{eqnarray}\n\n\\noindent\nTaking the matrix-elements in the discretized partial-wave relative momentum-space basis and inserting a complete set of eigenstates of the SRG-evolved hamiltonian $H_{\\lambda}=U_{\\lambda}HU_{\\lambda}^\\dagger$, namely\n\n\\begin{eqnarray}\n\\sum_{\\alpha} ~| \\alpha,\\lambda \\rangle \\langle \\alpha,\\lambda|={\\bf 1} \\; , \n\\label{completeness}\n\\end{eqnarray}\n\n\\noindent\nwe obtain\n\n\\begin{eqnarray}\nT_{nm}(p) = V_{nm}(\\lambda) +\\left(\\frac{2}{\\pi}\\right)^2 \\sum_{k=1}^N \\sum_{l=1}^N \\left(w_k ~p_k^2 \\right) \\left(w_l~p_l^2\\right)~\\sum_{\\alpha} V_{nk}(\\lambda)\\frac{\\psi_{\\alpha,\\lambda} (p_k)~\n\\psi_{\\alpha,\\lambda} (p_l)}{p^2-P_\\alpha^2 + i~\\epsilon}V_{lm}(\\lambda) \\; ,\n\\label{LSsrgT}\n\\end{eqnarray}\n\n\\noindent\nSwitching to the $R$-matrix at the grid points $p=p_n$, we get\n\n\\begin{eqnarray}\nR_{nm}(p_n) = V_{nm}(\\lambda) +\\left(\\frac{2}{\\pi}\\right)^2 \\sum_{k\\neq n}\\sum_{l} \\left(w_k ~p_k^2 \\right) \\left(w_l~p_l^2\\right)~\\sum_{\\alpha} V_{nk}(\\lambda)\\frac{\\psi_{\\alpha,\\lambda} (p_k)~\n\\psi_{\\alpha,\\lambda} (p_l)}{p_n^2-P_\\alpha^2}V_{lm}(\\lambda) \\; .\n\\label{LSsrgR}\n\\end{eqnarray}\n\n\\noindent\nA surprising result is that for unitarily equivalent operators on the\ngrid, such as those generated by the SRG evolution, the phase-shifts\ncomputed from the solution of the LS equation are {\\it not} the same;\ni.e. $\\delta_{N}^{\\rm LS}(p_n,H) \\neq \\delta_{N}^{\\rm LS}(p_n,\nU_{\\lambda}HU_{\\lambda}^\\dagger) $.  This is evident from\nEqs.~(\\ref{LSsrgT}) and (\\ref{LSsrgR}), where we can see explicitly\nthat the LS phase-shifts depend {\\it both} on the eigenvalues\n$P_\\alpha^2$, which are isospectral, and the eigenfunctions\n$\\psi_{\\alpha,\\lambda} (p_{k})$, which in turn change along the SRG\nevolution trajectory and so are {\\it not} independent of the SRG\ncutoff $\\lambda$. Of course, in the continuum limit one has $\\lim_{N\n  \\to \\infty} \\delta_{N}^{\\rm LS}(p_n, H) = \\lim_{N \\to\n  \\infty}\\delta_{N}^{\\rm LS}(p_n, U_{\\lambda}H~U_{\\lambda}^\\dagger)\n$. Thus, for many purposes we will apply relatively small grids just\nin order to exploit isospectrality.\n\nOn the other hand, the SRG-evolved potential becomes diagonal in the infrared limit $\\lambda \\to 0$,\n\n\\begin{eqnarray}\n\\lim_{\\lambda\\to 0} V_{nm}(\\lambda) = \\delta_{nm}~V_{n}(\\lambda \\to 0)   \\;  ,\n\\end{eqnarray}\n\n\\noindent\nand hence we get\n\n\\begin{eqnarray}\nV_{n}(\\lambda \\to 0) = R_{nn}(p_n) \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that the infrared fixed-point of the SRG evolution can be related to the energy-shift formula Eq.~(\\ref{ES-formula}),\n\n\\begin{eqnarray}\nV_{n}(\\lambda \\to 0) = \\frac{\\left(P^2_n - p^2_n \\right)}{\\frac{2}{\\pi} ~ w_n~p^2_n}= -\\frac{\\delta^{\\rm ES}(p_n)}{p_n} \\; ,\n\\label{eigenpot}\n\\end{eqnarray}\n\n\\noindent\nthus providing an isospectral definition for the phase-shifts which therefore preserves phase-equivalence along the SRG trajectory. We refer to $V_n(\\lambda \\to 0)$ and $\\delta^{\\rm ES}(p_n)$ as the \"eigenpotential\" and the \"eigenphases\" since they are obtained directly from the eigenvalues of the hamiltonian, $P^2_n$. It should be mentioned that in the coupled channel case (which actually occurs for the $^3S_1 - ^3D_1$ Deuteron channel) one needs not only the eigenvalues but also the eigenvectors\nto determine both the eigenphases and the mixing angles, as discussed in Refs.~\\cite{kukulin2009discrete,Rubtsova:2010zz}.\n\n\n\n\n\n\n\n\\subsection{Trace Identities and Levinson's theorem}\n\nAccording to Parisi~\\cite{parisi1988statistical} the trace identities\nare one of the most beautiful results in quantum mechanics. One of the\nadvantages of using the momentum grid basis is the almost\nstraightforward derivation of the finite energy sum rules in potential\nscattering found in Ref.~\\cite{Graham:2001iv} which are a\ngeneralization of the trace\nidentities~\\cite{parisi1988statistical}. While the analyticity of\ninteractions was extensively used there, our derivation is almost\ncompletely trivial, and we will just show here some particular examples\ngrasping the basic essence of the approach. \n\nWe can compute the following expressions involving the trace of the\nhamiltonian $H=T+V$ on a finite momentum grid with $N$ integration points\n$p_n \\in [0,\\Lambda]$ and weights $w_n$ ($n=1, \\dots N$),\n\n\\begin{eqnarray}\nI_k = {\\rm Tr}~ (T+V)^k - {\\rm Tr}~ T^k \\; ,\n\\end{eqnarray}\n\n\\noindent\nfor any integer $k$. On one hand we can saturate with the spectrum including possible\nbound-states and on the other hand with the momentum states, which yields\n\n\\begin{eqnarray}\nI_k\n&=& \\sum_\\alpha (-\\gamma_\\alpha^2)^k + \\sum_{n} \\frac{2}{\\pi} w_n p_n^2 p_n^{2k-2}~\nk\\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right]= \\sum_{n,m,\\dots} \\left[p_n^2 \\delta_{nm}+\\frac{2}{\\pi}w_n p_n^2 V_{nm}\\right]^k - \\sum_{n} \\left[p_n^2\\right]^k\\; .\n\\label{tracek}\n\\end{eqnarray}\n\n\nFor $k=1$ we obtain\n\n\\begin{eqnarray}\nI_1 = \\sum_\\alpha (-\\gamma_\\alpha^2) + \\sum_{n} \\frac{2}{\\pi} w_n\np_n^2 \\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right] = \\sum_{n} \\frac{2}{\\pi}\nw_n p_n^2 V_n \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich in the continuum yields\n\n\\begin{eqnarray}\nI_1  \\to \\sum_\\alpha (-\\gamma_\\alpha^2) + \\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 \\left[-\\frac{\\delta(p)}{p}\\right] =\n\\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 V(p,p) \\; .\n\\end{eqnarray}\n\n\\noindent\nIn terms of the first Born approximation for the phase-shifts, $\\delta^B(p)$, this can be written as\n\n\\begin{eqnarray}\n\\sum_\\alpha (-\\gamma_\\alpha^2) + \\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 \\left[\\frac{-\\delta(p)+ \\delta^B (p)}{p}\\right] =0  \\; . \n\\end{eqnarray}\n\n\\noindent\nThis still holds for the finite $\\Lambda$. Taking the infinite cutoff\nlimit $\\Lambda \\to \\infty$ we get the form of the finite energy sum\nrule of Ref.~\\cite{Graham:2001iv}. Note that our result does not\nrequire taking the $\\Lambda \\to \\infty$ limit and hence no assumption\non analyticity is required for finite $\\Lambda$.\n\nFor $k=2$ we obtain\n\n\\begin{eqnarray}\nI_2 = \\sum_\\alpha (-\\gamma_\\alpha^2)^2 + 2 \\sum_{n} \\frac{2}{\\pi}w_n p_n^4 \\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right] = 2 \\sum_{n}\n\\frac{2}{\\pi} w_n p_n^4 V_n + \\sum_{n,m} \\left[\\frac{2}{\\pi}w_n p_n^2 V_{nm}\\right]\\left[ \\frac{2}{\\pi} w_m p_m^2 V_{mn}\\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nSimilarly to the case $k=1$, in the continuum this can be written as of Ref.~\\cite{Graham:2001iv} in terms of the second Born approximation for the phase-shifts, $\\delta^{B2} (p)$,\n\n\\begin{eqnarray}\n\\sum_\\alpha (-\\gamma_\\alpha^2)^2 + \\frac{4}{\\pi} \\int_0^\\Lambda dp~p^4 \\left[\\frac{-\\delta(p)+ \\delta^{B2} (p)}{p}\\right] =0 \\; .\n\\end{eqnarray}\n\n\nThe case $k=0$ is a bit more tricky and obtained by taking the limit $k \\to 0$ in Eq.~(\\ref{tracek}),\n\n\\begin{eqnarray}\nI_0= \\sum_\\alpha (-\\gamma_\\alpha^2)^0 + \\lim_{k \\to 0} \\sum_{n} \\frac{2}{\\pi} w_n p_n^2 p_n^{2k-2} k\n\\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right]=\\sum_{n} (1)_{T+V}-\\sum_{n} (1)_{T}= 0 \\; .\n\\label{trace0}\n\\end{eqnarray}\n\n\\noindent\nThe last equality just expresses the conservation of dimensions\nregardless of the interaction. The first term ater the first equality\nis simply the number of bound-states. The term with the phase-shift\ncan be transformed by using the identity $ 2 k p_n^{2k-2} = d p_n^{2k}\n/dp_n^2$ going to the continuum and integrating by parts. Thus in the\ncontinuum limit\n\n\\begin{eqnarray}\nN_B  + \\frac{\\delta(\\Lambda)-\\delta(0)}{\\pi}=0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich becomes the usual Levinson's theorem for $\\Lambda \\to \\infty$.\nReinstating the finite momentum grid we get \n\n\\begin{eqnarray}\n\\delta(p_1)-\\delta(p_N)=N_B ~\\pi  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $N_B$ is the number of bound-states allowed by the\ninteraction. \n\n\n\n\n\n\\section{Numerical results}\n\\label{sec:numerical}\n\n\n\\subsection{SRG evolution}\n\nWe solve the SRG flow equations for the toy model potential numerically on a finite momentum grid with $N=50$ gaussian points and a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$. The discretization of the momentum-space leads to a system of $N^2$ non-linear first-order coupled differential equations which is solved numerically by using an adaptative variable-step fifth-order Runge-Kutta algorithm. The SRG cutoff $\\lambda$ is varied in a range from $0.05$ to $2.0~{\\rm fm}^{-1}$.\n\nIn Fig.~\\ref{fig:3} we show the SRG evolution of the diagonal and the\nfully off-diagonal matrix-elements of the toy model potential in the\n$^1S_0$ channel using the Wilson and the Wegner generators. As\nexpected, since there are no bound-states in this channel, the SRG\nevolutions using both generators are nearly identical. As the\npotential evolves with the SRG cutoff $\\lambda$ the off-diagonal\nmatrix-elements are gradually suppressed such that the potential is\ndriven towards the diagonal form. This can be seen very clearly from\nthe density plots displayed in Fig.~\\ref{fig:4}.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig3a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig3b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig3c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig3d.pdf}\n\\end{center}\n\\caption{SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators. Left panels: diagonal matrix-elements; Right panels: fully off-diagonal matrix-elements.\n}\n\\label{fig:3}\n\\end{figure}\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=14cm]{fig4a.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=14cm]{fig4b.pdf}\n\\end{center}\n\\caption{Density plots for the SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:4}\n\\end{figure}\n\nIn Fig.~\\ref{fig:5} we show the SRG evolution of the diagonal and the fully off-diagonal matrix-elements of the toy model potential in the $^3S_1$ channel using the Wilson and the Wegner generators. For both generators the potential is driven towards a diagonal form though, as expected for the $^3S_1$ channel, the SRG evolutions become very different when the SRG cutoff $\\lambda$ goes below the critical momentum scale $\\Lambda_c \\sim 0.3 ~{\\rm fm}^{-1}$ where the Deuteron bound-state emerges. In the case of the Wilson generator, the low-momentum matrix-elements of the SRG-evolved potential are driven to large negative values, since the Deuteron bound-state is pushed towards the lowest momentum $p_1$ available on the grid. In the case of the Wegner generator, the Deuteron bound-state decouples from the low-momentum scales when the SRG cutoff $\\lambda$ goes below the critical momentum $\\Lambda_c$ and is placed at a higher momentum $p_{n_{\\rm BS}}$. We observe in our SRG calculations for the toy model potential on a finite grid that the position at which the bound-state is placed changes when using different values for the number of grid points $N$ and/or the UV cutoff $\\Lambda$, similar to what is observed in Ref.~\\cite{Wendt:2011qj} for the SRG evolution of LO ChEFT interactions with large momentum cutoffs $\\Lambda_{\\rm EFT}$, in which the (spurious) bound-state position also changes with the cutoff. Here, for a grid with $N=50$ points and $\\Lambda=2~{\\rm fm}^{-1}$, the bound-state is placed at the momentum $p_{n_{\\rm BS}}= p_9\\sim 0.145~{\\rm fm}^{-1}$. Moreover, the matrix-elements of the SRG-evolved potential corresponding to momenta $p_n < p_{n_{\\rm BS}}$ jump to positive values approaching the $^3S_1$ channel scattering length $a_{^3S_1} = 5.4~{\\rm fm}$. The difference between the SRG evolutions of the toy model potential in the $^3S_1$ channel using the Wilson and the Wegner generators can be seen very clearly from the density plots displayed in Fig.~\\ref{fig:6}.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig5a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig5b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.6cm]{fig5c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig5d.pdf}\n\\end{center}\n\\caption{SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators. Left panels: diagonal matrix-elements; Right panels: fully off-diagonal matrix-elements.}\n\\label{fig:5}\n\\end{figure}\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=14cm]{fig6a.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=14cm]{fig6b.pdf}\n\\end{center}\n\\caption{Density plots for the SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:6}\n\\end{figure}\n\n\n\n\\subsection{SRG regimes}\n\nIn most studies the convergence pattern of the SRG evolution towards the infrared fixed-point is determined by the stability\nof single matrix-elements of the evolved potential. This corresponds to a pointwise notion of convergence. However, as we have discussed above, the proper and monotonous decreasing quantities are the operator norms.  It is interesting to illustrate to what extent the Frobenius norm and the departure from the infrared limit behave as a function of the SRG cutoff $\\lambda$. This is shown in Fig.~\\ref{fig:7}. As one can observe, the stationary condition is reached at about $\\lambda = 0.1~{\\rm fm}^{-1}$. This already provides the relevant scale below which the infrared regime sets in for the finite momentum grid. Actually, the operator norms suggest a new density plot for the quantity\n\n\\begin{eqnarray}\n\\frac{2}{\\pi} ~ p p' \\sqrt{\\Delta p \\Delta p'} ~ V_{\\lambda}(p,p') \\rightarrow  \\frac{2}{\\pi} ~ p_n p_m \\sqrt{w_n w_m} ~ V_{\\lambda}(p_n,p_m)  \\; ,\n\\label{wdens}\n\\end{eqnarray}\n\n\\noindent\ninstead of the standard one involving only $V_{\\lambda}(p,p') \\rightarrow V_{\\lambda}(p_n,p_m)$.  These are the normalized SRG-evolved potentials on the grid, according to our previous discussion.\n\nThe {\\it weighted} density plots corresponding to Eq.~(\\ref{wdens}) for the SRG evolution of the toy model potential in the $^1S_0$ and the $^3S_1$ channels are depicted respectively in Figs.~\\ref{fig:8} and ~\\ref{fig:9}. Note the enhancement of the diagonal region and the suppression of low-energy states as the SRG cutoff $\\lambda$ decreases. This is particularly noticeable around the Deuteron bound-state in the Wegner generator case and around zero momentum in the Wilson generator case. We believe these pictures reflect more faithfully the SRG evolution pattern according to the metric induced by the operator norm relevant for the\nconvergence of the equations.\n\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig7a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig7b.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=7.5cm]{fig7c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig7d.pdf}\n\\end{center}\n\\caption{Operator norms for the SRG-evolved toy model separable gaussian potential in the $^1S_0$ and the $^3S_1$ channels ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) for the Wilson and the Wegner generators as a function of the SRG cutoff $\\lambda$. The infrared regime takes place below $\\lambda \\sim 0.1 ~ {\\rm fm}^{-1}$.}\n\\label{fig:7}\n\\end{figure}\n\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=14cm]{fig8a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=14cm]{fig8b.pdf}\n\\end{center}\n\\caption{Weighted density plots for the SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:8}\n\\end{figure}\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=14cm]{fig9a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=14cm]{fig9b.pdf}\n\\end{center}\n\\caption{Weighted density plots for the SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:9}\n\\end{figure}\n\n\n\n\\subsection{SRG evolution in the infrared limit and the scattering problem on a finite momentum grid}\n\nIn the previous sections we have discussed both the SRG flow equations in the infrared limit and the scattering problem on a finite momentum grid independently. In this section we discuss in detail the relation between these two apparently disconnected topics through a surprising result involving Levinson's theorem which we have already described in a previous work \\cite{Arriola:2014aia}. As mentioned above the SRG flow equations are isospectral, i.e. they maintain the spectrum of the hamiltonian invariant along the SRG trajectory. Nevertheless, the definition of the spectrum in the continuum requires some care since strictly speaking there is no finite energy-shift but the states become dense. This is illustrated by the finite box quantization formula Eq.~(\\ref{eq:p-box}) together with Eq.~(\\ref{eq:trace}). Therefore, if we regularize the continuum by a finite momentum grid there appears an inevitable energy-shift due to the interaction and all states in the Hilbert space become normalizable. However, once the finite momentum grid is introduced there is no scattering process and some of the wave operator properties usually assumed for continuum states, such as the intertwining property of the Moller operator, do not hold~\\cite{muga1989stationary}. Actually, in the case of a hamiltonian allowing for bound-states the energy-shift does not disappear in the continuum. The question is what is the net effect of the energy-shift for positive energy and would-be scattering states when the continuum is approached as a limiting procedure starting from the finite momentum grid.\n\n\n\\subsubsection{SRG induced ordering of the spectrum and the energy-shift approach}\n\nThe final ordering of the spectrum induced by the SRG evolution in the infrared limit $\\lambda \\to 0$ can be depicted through the flow of the diagonal matrix-elements of the hamiltonian along the SRG trajectory. In Fig.~\\ref{fig:14} we show the SRG evolution of the lowest diagonal matrix-elements of the toy model hamiltonian $H_{\\lambda}(p_n,p_n)$ ($n=1,...,6$) in the $^1S_0$ and $^3S_1$ channels, for a momentum grid with $N=20$ points and $\\Lambda=2~{\\rm fm}^{-1}$. As one can observe, for the $^1S_0$ channel there is no crossing amongst the diagonal matrix-elements of the hamiltonian evolved with both generators as the SRG cutoff $\\lambda$ approaches the infrared limit, indicating that the initial ascending order is maintained all along the SRG trajectory. For the $^3S_1$ channel, on the other hand, there are crossings with both generators as the SRG cutoff $\\lambda$ approaches the critical momentum scale $\\Lambda_c \\sim 0.3 ~{\\rm fm}^{-1}$. In the Wilson generator case, the initial ascending order is asymptotically restored in the infrared limit $\\lambda\\to 0$ ~\\cite{Timoteo:2011tt,Arriola:2013gya} with the lowest momentum diagonal matrix-element $H_{\\lambda}(p_1,p_1)$ flowing into the Deuteron bound-state. In the Wegner generator case a re-ordering occurs, such that the diagonal matrix-element $H_{\\lambda}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})$ flows into the Deuteron bound-state in the limit $\\lambda\\to 0$. For this calculation with $N=20$ grid points and $\\Lambda=2~{\\rm fm}^{-1}$ the momentum at which the bound-state is placed on the diagonal of the hamiltonian corresponds to $p_{n_{\\rm BS}}\\to p_5 \\sim 0.254~{\\rm fm}^{-1}$. Note that the diagonal matrix-element $H_{\\lambda}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})$ flowing into the Deuteron bound-state is the one that starts to decrease rapidly towards negative values when the SRG cutoff $\\lambda$ approaches $\\Lambda_c$, indicating the break-up of the kinetic energy dominance,\ni.e.\n\n\\begin{eqnarray}\np_{n_{\\rm {BS}}}^2 < \\frac{2}{\\pi}~w(p_{n_{\\rm {BS}}})~p_{n_{\\rm {BS}}}^2~|V_{\\lambda < \\Lambda_c}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})|  \\; .\n\\end{eqnarray}\n\n\\noindent\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig14a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig14b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig14c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig14d.pdf}\n\\end{center}\n\\caption{SRG evolution of the lowest diagonal matrix-elements of the toy-model hamiltonian $H_{\\lambda}(p_n,p_n)$ ($n=1,...,6$) in the $^1S_0$ channel and the $^3S_1$ channel ($N=20$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators.}\n\\label{fig:14}\n\\end{figure}\n\n\nIn Fig.~\\ref{fig:10} we show the diagonal matrix-elements of the toy model potential in the $^1S_0$ and the $^3S_1$\nchannels evolved with both the Wilson and the Wegner generators up to the SRG cutoff $\\lambda = 0.05~\\rm{fm}^{-1}$, compared to the corresponding eigenpotentials $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ and $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ evaluated from the energy-shifts through Eq.~(\\ref{eigenpot}). The eigenpotential $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ is computed with the eigenvalues arranged in ascending order, which corresponds to the order induced by the SRG evolution in the $^1S_0$ channel with both generators. The eigenpotential $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ is computed both with the eigenvalues arranged in ascending order, which corresponds to the order induced by the SRG evolution in the $^3S_1$ channel with the Wilson generator, and in the order induced by the SRG evolution with the Wegner generator, which is obtained by placing the Deuteron bound-state at $p_{n_{\\rm BS}}$. As expected by construction, the potentials evolved up to the SRG cutoff $\\lambda = 0.05~\\rm{fm}^{-1}$ nearly match the corresponding eigenpotentials. This result clearly shows that the SRG evolved potential indeed converges in the infrared limit $\\lambda \\to 0$ to the eigenpotential $V_{n}(\\lambda \\rightarrow 0)$ computed with the eigenvalues arranged according to the proper SRG induced ordering. Note that for the $^1S_0$ channel the eigenpotential at the lowest momentum $p_1$ on the grid approaches the scattering length, i.e. $V_{1}^{^1S_0}(\\lambda \\rightarrow 0)\\to a_{^1S_0} = -23.7~{\\rm fm}$, such that the correct behavior at low-momentum in the on-shell limit is obtained. For the $^3S_1$ channel, on the other hand, the correct behavior, with $V_{1}^{^3S_1}(\\lambda \\rightarrow 0)\\to a_{^3S_1} = 5.4~{\\rm fm}$, is obtained only when the eigenpotential is computed with the eigenvalues arranged in the order induced by the SRG evolution with the Wegner generator.\n\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig10a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig10b.pdf}\n\\end{center}\n\\caption{Diagonal matrix-elements of the toy model separable gaussian potential in the $^1S_0$ channel and the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) evolved with the Wilson and the Wegner generators up to the SRG cutoff $\\lambda=0.05~{\\rm fm^{-1}}$. For comparison, we also show the eigenpotentials $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ and $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ computed with the eigenvalues arranged according to the corresponding SRG induced orderings.}\n\\label{fig:10}\n\\end{figure}\n\n\\subsubsection{Ordering prescription and Levinson's theorem}\n\nIn Fig.~\\ref{fig:ps-LSgrid} we show the phase-shifts $\\delta_\\lambda^{\\rm LS}(p_n)$ evaluated from the solution of the LS equation on a finite momentum grid {\\it at the grid points} ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) for the toy model potential in the $^1S_0$ and $^3S_1$ channels evolved through the SRG transformation with the Wilson and the Wegner generators for several values of the SRG cutoff $\\lambda$. As one can observe, Levinson's theorem~\\cite{Ma:2006zzc} is fulfilled on the finite momentum grid for both channels, i.e.\n\n\n", "itemtype": "equation", "pos": 66848, "prevtext": "\n\n\\noindent\nwhich provides an energy-shift formula to define the phase-shift,\n\n\n", "index": 31, "text": "\\begin{equation}\n\\delta^{\\rm ES}(p_n) =  - \\frac{\\pi}{2} ~ \\frac{\\left( P^2_n - p^2_n \\right)}{ w_n~p_n} \\; .\n\\label{ES-formula}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\delta^{\\rm ES}(p_{n})=-\\frac{\\pi}{2}~{}\\frac{\\left(P^{2}_{n}-p^{2}_{n}\\right)%&#10;}{w_{n}~{}p_{n}}\\;.\" display=\"block\"><mrow><mrow><mrow><msup><mi>δ</mi><mi>ES</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mpadded width=\"+3.3pt\"><mfrac><mi>π</mi><mn>2</mn></mfrac></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mfrac><mrow><mo>(</mo><mrow><msubsup><mi>P</mi><mi>n</mi><mn>2</mn></msubsup><mo>-</mo><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup></mrow><mo>)</mo></mrow><mrow><mpadded width=\"+3.3pt\"><msub><mi>w</mi><mi>n</mi></msub></mpadded><mo>⁢</mo><msub><mi>p</mi><mi>n</mi></msub></mrow></mfrac></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwith $N_B=0$ for the $^1S_0$ channel and $N_B=1$ for the $^3S_1$ channel. However, one can also clearly see that the LS phase-shifts on the finite grid are not independent of the SRG cutoff $\\lambda$. As pointed out in section \\ref{phaseineq}, while the lack of phase-equivalence disappears in the continuum limit, i.e. for $N \\to \\infty$, the isospectral definition of the phase-shifts on the finite momentum grid based on the energy-shift formula Eq.~(\\ref{ES-formula}), which we refer to as the {\\it eigenphases} $\\delta^{\\rm ES}(p_n)$, preserves phase-equivalence along the SRG trajectory for {\\it any} number of grid points $N$. Furthermore, as we will show below, a proper prescription to order the spectrum of $N$ discrete eigenvalues $P_{n}^2$ of the diagonalized hamiltonian when using the energy-shift approach is required to obtain eigenphases which also fulfill Levinson's theorem, particularly when bound-states are allowed by the interaction as in the case of the toy model potential in the $^3S_1$ channel.\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{phases-LSgrid-1S0-wil.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-3S1-wil.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-1S0-weg.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-3S1-weg.pdf}\n\\end{center}\n\\caption{Phase-shifts $\\delta_\\lambda^{\\rm LS}(p_n)$ evaluated from the solution of the LS equation on a finite momentum grid  {\\it at the grid points} ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) for the toy model separable gaussian potential in the $^1S_0$ and $^3S_1$ channels evolved through the SRG transformation with the Wilson and the Wegner generators for several values of the SRG cutoff $\\lambda$.}\n\\label{fig:ps-LSgrid}\n\\end{figure}\n\n\nOne possible ordering prescription is that derived by Kukulin et al.~\\cite{kukulin2009discrete,Rubtsova:2010zz} for a hamiltonian allowing for $N_B$ bound-states. According to this prescription, the eigenvalues $P_{n}^2$ of the hamiltonian are arranged in ascending order and then left-shifted $N_B$ positions with respect to the eigenvalues $p_{n}^2$ of the kinetic energy operator $T$, which yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Kuk}^{\\rm ES}(p_n) = - \\pi \\frac{P_{n+N_B}^2-p_n^2}{2 w_n p_n} \\; ,\n\\label{deltakuk}\n\\end{eqnarray}\n\n\\noindent\nwith $n=1, \\cdots , ~ N-N_B$. Note that Kukulin's prescription implies that the $N_B$ negative bound-state eigenvalues are just removed, such as to avoid discontinuities in the calculation of the eigenphases.\n\nIn the case of the $^1S_0$ channel there is no need to shift the eigenvalues $P_{n}^2$, since there are no bound-states ($N_B=0$). Thus, we can evaluate the eigenphases $\\delta^{\\rm ES}(p_n)$ from the energy-shift formula just by arranging the eigenvalues in ascending order, which corresponds to the order induced by the SRG evolution in the $^1S_0$ channel with both the Wilson and the Wegner generators. The resulting eigenphases for the toy-model potential on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) are shown in Fig.~\\ref{fig:11}, compared to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). As one can see, the ascending order prescription allows to obtain eigenphases which display the correct behavior in the entire range of momenta, thus complying to Levinson's theorem, i.e. $\\delta^{\\rm ES}(p_1)- \\delta^{\\rm ES}(p_N) \\sim 0$.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig11.pdf}\n\\end{center}\n\\caption{Eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy-model separable gaussian potential in the $^1S_0$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues arranged in ascending order. For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).}\n\\label{fig:11}\n\\end{figure}\n\n\nIn the case of the $^3S_1$ channel, which allows for the Deuteron bound-state ($N_B=1$), we have considered three different prescriptions to evaluate the eigenphases $\\delta^{\\rm ES}(p_n)$ from the energy-shift formula:\n\\\\ \\\\\n\\noindent\n(i) eigenvalues $P_{n}^2$ arranged according to Kukulin's prescription, i.e. in ascending order and shifted one position to the left such as to remove the negative Deuteron bound-state eigenvalue.\n\\\\ \\\\\n\\noindent\n(ii) eigenvalues $P_{n}^2$ arranged according to the order induced by the SRG evolution in the $^3S_1$ channel with the Wilson generator, i.e. in ascending order, which corresponds to Kukulin's prescription with no left-shifting of the eigenvalues and yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Wil}^{\\rm ES}(p_n) = - \\pi \\frac{P_{n}^2-p_n^2}{2 w_n p_n} \\; ,\n\\label{deltawil}\n\\end{eqnarray}\n\n\\noindent\nNote that in this prescription the negative Deuteron bound-state eigenvalue is placed on the diagonal of the hamiltonian at the lowest momentum on the grid $p_1$.\n\\\\ \\\\\n\\noindent\n(iii) eigenvalues $P_{n}^2$ arranged according to the order induced by\nthe SRG evolution in the $^3S_1$ channel with the Wegner generator,\ni.e. with the negative Deuteron bound-state eigenvalue placed at the\nmomentum $p_{n_{\\rm BS}}$ on the diagonal of the hamiltonian and the\nremaining positive eigenvalues in ascending order. The discontinuity\nin the eigenphases at the momentum $p_{n_{\\rm BS}}$ can be avoided\njust by removing the Deuteron bound-state, as in Kukulin's\nprescription, or by interpolating between the neighboring values,\nwhich yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Weg}^{\\rm ES}(p_n) =\n\\begin{cases}\n- \\pi \\frac{P_{n+1}^2-p_n^2}{2 w_n p_n} \\quad {\\rm if}\\; \\quad n < n_{\\rm BS}  \\\\ \\\\\n- \\pi \\frac{\\bar P_{n_{\\rm BS}}^2-p_n^2}{2 w_n p_n} \\; \\quad {\\rm if} \\quad n=n_{\\rm BS} \\\\ \\\\\n- \\pi \\frac{P_n^2-p_n^2}{2 w_n p_n} \\qquad {\\rm if}\\; \\quad n > n_{\\rm BS}\n\\end{cases}\n\\label{deltaweg}\n\\end{eqnarray}\n\n\\noindent\nwhere $\\bar P_{n_{\\rm BS}}^2=(P_{n_{\\rm BS}+1}^2+P_{n_{\\rm BS}-1}^2)/2$. Note that in this prescription only the eigenvalues $P_{n}^2$ corresponding to momenta $p_n < p_{n_{\\rm BS}}$ are shifted one position to the left.\n\\\\\n\nIn Fig.~\\ref{fig:12} we show the eigenphases for the toy-model potential on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues $P_{n}^2$ of the hamiltonian  arranged according to the three prescriptions outlined above, compared to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). As one can see, the eigenphases obtained with prescription (i) and prescription (ii), which are shown respectively in the top-left and the top-right panels, clearly violate Levinson's theorem. Prescription (i) yields eigenphases which have a proper low-momenta behavior but become distorted at high-momenta due to the left-shifting of the eigenvalues. Prescription (ii), on the other hand, yields eigenphases which have a proper high-momenta behavior but are distorted at low-momenta due to the presence of the Deuteron bound-state~\\footnote{The point corresponding to the lowest momentum $p_1$ on the grid, at which the Deuteron bound-state eigenvalue is placed on the diagonal of the hamiltonian, is out of scale and so is omitted from the plot.}. One should note that both in the case of prescription (i) and prescription (ii) the distortion of the eigenphases is generated by a mismatch between the eigenvalues $P_{n}^2$ of the hamiltonian and the eigenvalues $p_{n}^2$ of the kinetic energy operator $T$, respectively at high-momenta and low-momenta. As shown in the bottom-left panel, prescription (iii) yields eigenphases which have a proper behavior both at low-momenta and high-momenta, since the left-shifting is applied {\\it only} to the eigenvalues corresponding to momenta $p_n < p_{n_{\\rm BS}}$. As mentioned before, the position $p_{n_{\\rm BS}}$ of the Deuteron bound-state eigenvalue induced by the SRG evolution with the Wegner generator depends both on the number of grid points $N$ and the cutoff $\\Lambda$. In the bottom-right panel, we compare the results obtained with the three prescriptions for $N=50$ grid points. As one can see, the eigenphases obtained with prescription (iii) indeed match those obtained with prescription (i) and prescription (ii) respectively for momenta below and above $p_{n_{\\rm BS}}$. Thus, we find that the final ordering of the spectrum of discrete eigenvalues $P_{n}^2$ of the toy-model hamiltonian induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$) remarkably provides a prescription which allows to obtain isospectral phase-shifts from the energy-shift formula that comply to Levinson's theorem in the presence of the Deuteron bound-state.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig12c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig12a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig12b.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig12d.pdf}\n\\end{center}\n\\caption{Eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy model separable gaussian potential in the $^3S_1$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues arranged according to Kukulin's prescription (i), the order induced by the SRG evolution with the Wilson generator (ii), i.e. in ascending order, and the order induced by the SRG evolution with the Wegner generator (iii). For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). In the bottom-right panel we compare the results obtained with prescriptions (i), (ii) and (iii) for $N=50$ grid points.}\n\\label{fig:12}\n\\end{figure}\n\n\nThe effectiveness of ordering prescription (iii) can be traced to the decoupling of the Deuteron bound-state from the low-momentum scales when the toy-model potential in the $^3S_1$ channel is evolved through the SRG transformation using the Wegner generator. The key point is that by placing the Deuteron bound-state eigenvalue at the position $p_{n_{\\rm BS}}$ induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$) we obtain eigenphases from the energy-shift formula which display the correct behavior in the entire range of momenta (within the expected uncertainties of the finite momentum grid). One should note, however, that such an ordering does not necessarily correspond to the optimal one. We have evaluated the eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy model potential in the $^3S_1$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) using prescription (iii) but varying the position of the Deuteron bound-state eigenvalue $p_{n_{\\rm BS}}$, and compared the results to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). By computing the corresponding root mean square (RMS) errors as a function of $p_{n_{\\rm BS}}$, we find that for each value of the number of grid points $N$ there is a well-defined minimum. As one can see in Fig.~\\ref{fig:15}, the position $p_{n_{\\rm BS}}^{\\rm opt}$ minimizing the RMS errors, which seems to converge in the continuum limit to the characteristic Deuteron momentum scale $\\gamma = 0.23~{\\rm fm}^{-1}$, is different from that induced by the SRG evolution with Wegner generator in the infrared limit.\n\nAs pointed out before, the final ordering of the spectrum induced by the SRG evolution in the infrared limit may depend on the choice of the SRG generator when bound-states are allowed by the interaction. In this way, it is possible that a specific generator exists for which the position of the Deuteron bound-state induced by the SRG evolution corresponds to $p_{n_{\\rm BS}}^{\\rm opt}$, thus providing the optimal ordering prescription for the energy-shift approach.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig15.pdf}\n\\end{center}\n\\caption{Comparison between the position of the Deuteron bound-state which minimizes the RMS errors in the eigenphases $\\delta^{\\rm ES}(p_n)$ with respect to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$) and the position induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$), for different number of grid points $N$.}\n\\label{fig:15}\n\\end{figure}\n\n\n\n\\section{Consequences of the fixed points for nuclear binding: Triton and Helium nuclei}\n\\label{sec:nucl}\n\nThe ambiguities arising from off-shell uncertainties has been the main\nsource of problems in Nuclear Physics calculations. There are a\nvariety of $NN$ potentials in the literature providing a high-quality\ndescription of scattering data and Deuteron properties. They produce,\nhowever, different results when comparing to nuclear matter and\nnuclear structure calculations. So far, we have dealt with the\ntwo-body problem. Of course, much of the motivation to undertake the\nSRG evolution concerns the applications to nuclear structure. Our\npurpose here is to illustrate the different implications of the SRG\nusing the Wegner and the Wilson generators along the lines discussed\nabove using our simple toy model potential. Most calculations in\nNuclear Physics use a mean field reference state, which is often a\nharmonic oscillator (HO) shell-model state, upon which correlations\nare built, namely $|\\Psi \\rangle = U | \\phi \\rangle $, where $U$ is\nsome unitary transformation.  The SRG interpretation is that\ncorrelations are shifted from the reference state to the interaction\nvia the unitary transformation $U$.\n\nWithin the shell-model we will restrict to the cases with $A=3$ and $A=4$, which correspond respectively to the Triton and the $\\alpha$-particle, as only $S$-wave interactions are required. In order to simplify matters as much as\npossible we will describe the states as $t \\equiv (1s)^3$ and $ \\alpha\n\\equiv (1s)^4$ respectively,\n\n\\begin{eqnarray}\n\\psi_{t, \\uparrow} (p_1,p_2,p_3)  &\\equiv& \\left[ \\prod_{i=1}^3\\varphi_{1s} (p_i) \\right]\n {\\cal A} (p \\uparrow , n \\uparrow\n, n \\downarrow ) \\; , \\\\\n\\psi_{t, \\downarrow} (p_1,p_2,p_3)  &\\equiv& \\left[ \\prod_{i=1}^3\\varphi_{1s} (p_i) \\right]\n {\\cal A} (p \\downarrow , n \\uparrow\n, n \\downarrow ) \\; , \\\\\n\\psi_{\\alpha} (p_1,p_2,p_3,p_4)  &\\equiv& \\left[ \\prod_{i=1}^4\\varphi_{1s} (p_i) \\right]\n{\\cal A} (p \\uparrow , n \\uparrow , p \\downarrow , n \\downarrow) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere ${\\cal A}$ is a normalized antisymmmetrizer and $\\varphi_{1s}$ is\nthe ${\\rm HO}-1s$ wave-function with a $b$ parameter, given by\n\n\\begin{eqnarray}\n\\sqrt{\\frac{2}{\\pi}} \\varphi_{1s}(p) = \\frac{2 \\sqrt{b^3} e^{-\\frac{1}{2} b^2 p^2}}{\\sqrt[4]{\\pi }} \\; .\n\\end{eqnarray}\n\n\\noindent\nThe energy calculation for the $A=3$ and $A=4$ systems at rest, $\\sum_{i=1}^A p_i=0$,\nis straightforward and reads\n\n\\begin{eqnarray}\n\\{ E_t(\\lambda), E_\\alpha(\\lambda)\\}=\\{-B_t,-B_\\alpha\\} = \\min_b \\left[\n  (A-1) \\left\\langle \\frac{p^2}{2M} \\right\\rangle_{1s} + \\frac{A(A-1)}{2} \\frac12\n  \\langle V_{^1S_0,\\lambda} + V_{^3 S_1,\\lambda} \\rangle_{{\\rm rel},1s} \\right]\n\\Big|_{A=3,4} \\; .\n\\label{eq:b34}\n\\end{eqnarray}\n\n\\noindent\nThe single particle kinetic energy reads\n\n\\begin{eqnarray}\n\\left\\langle \\frac{p^2}{2M} \\right\\rangle_{1s} = \\frac2{\\pi}\n  \\int_0^\\infty p^2 \\, dp \\, \\left[\\varphi_{1s}(p)\\right]^2\n  \\frac{p^2}{2M} \\; ,\n\\end{eqnarray}\n\n\\noindent\nand the potential matrix-element is defined as\n\n\\begin{eqnarray}\n\\langle \\phi_{\\rm rel} | V_{\\lambda} | \\phi_{\\rm rel} \\rangle =\n \\frac2{\\pi} \\int_0^\\infty dp \\,  [p^2 \\phi_{\\rm rel} (p) ]\n\\frac2{\\pi}\\int_0^\\infty dp'\\, [p'^2 \\phi_{\\rm rel} (p') ] ~ V_{\\lambda}(p',p) \\;,\n\\end{eqnarray}\n\n\\noindent\nwhere the {\\it relative} wave function is given by (note the $\\sqrt{2}$\nfactor),\n\n\n", "itemtype": "equation", "pos": 92860, "prevtext": "\n\n\\noindent\nOf course, both the energy-shift (ES) and the LS definitions for the\nphase-shift lead to the same results in the continuum limit, $w_n \\to\n0$. However, for a finite momentum grid there are important\ndifferences which are relevant for the SRG evolution, namely, for\nunitary transformations on the grid the energy-shift definition of the\nphase-shift provides invariant results along the SRG trajectory unlike\nthe LS phase-shift (see below). One should also note that the\nenergy-shift formula for the phase-shift is not unique. We could\ninstead use a momentum-shift formula very much in agreement with the\nfinite box treatment. Quite generally, all these possible formulas\nbecome equivalent in the continuum limit, but for a finite number $N$\nof grid points we should expect differences. It would be highly\ninteresting to design formulas where improved accuracies for finite\n$N$ are displayed. We leave this interesting topic for future\nresearch. Finally, it is important to note that for a finite momentum\ngrid with dimension $N$ there are $N!$ possible permutations for the\neigenvalues $P^2_n$ obtained from the diagonalization of the\nhamiltonian and so the evaluation of phase-shifts using the\nenergy-shift approach necessarily involves an ordering prescription.\n\n\n\n\\subsection{Phase-equivalence and inequivalence}\n\\label{phaseineq}\n\nAs pointed out before the original motivation for the application of the SRG in the context of nuclear physics was to\nsoften the $NN$ interaction while keeping the phase-shifts invariant. In our previous work \\cite{Arriola:2014aia} we have shown that on a finite momentum grid phase-equivalence does not hold along the SRG trajectory for the LS definition, while for the isospectral definition based on the energy-shift formula phase-equivalence is preserved. In this section we elaborate more on this issue.\n\nFirst, let us consider the eigenstate decomposition of the LS equation for the $T$-matrix on a finite momentum grid with the SRG-evolved potential, which can be written in operator form as\n\n\\begin{eqnarray}\nT(E)= V_{\\lambda} + V_{\\lambda} (p^2 - H_{\\lambda}+ i \\epsilon)^ {-1} V_{\\lambda} \\; .\n\\end{eqnarray}\n\n\\noindent\nTaking the matrix-elements in the discretized partial-wave relative momentum-space basis and inserting a complete set of eigenstates of the SRG-evolved hamiltonian $H_{\\lambda}=U_{\\lambda}HU_{\\lambda}^\\dagger$, namely\n\n\\begin{eqnarray}\n\\sum_{\\alpha} ~| \\alpha,\\lambda \\rangle \\langle \\alpha,\\lambda|={\\bf 1} \\; , \n\\label{completeness}\n\\end{eqnarray}\n\n\\noindent\nwe obtain\n\n\\begin{eqnarray}\nT_{nm}(p) = V_{nm}(\\lambda) +\\left(\\frac{2}{\\pi}\\right)^2 \\sum_{k=1}^N \\sum_{l=1}^N \\left(w_k ~p_k^2 \\right) \\left(w_l~p_l^2\\right)~\\sum_{\\alpha} V_{nk}(\\lambda)\\frac{\\psi_{\\alpha,\\lambda} (p_k)~\n\\psi_{\\alpha,\\lambda} (p_l)}{p^2-P_\\alpha^2 + i~\\epsilon}V_{lm}(\\lambda) \\; ,\n\\label{LSsrgT}\n\\end{eqnarray}\n\n\\noindent\nSwitching to the $R$-matrix at the grid points $p=p_n$, we get\n\n\\begin{eqnarray}\nR_{nm}(p_n) = V_{nm}(\\lambda) +\\left(\\frac{2}{\\pi}\\right)^2 \\sum_{k\\neq n}\\sum_{l} \\left(w_k ~p_k^2 \\right) \\left(w_l~p_l^2\\right)~\\sum_{\\alpha} V_{nk}(\\lambda)\\frac{\\psi_{\\alpha,\\lambda} (p_k)~\n\\psi_{\\alpha,\\lambda} (p_l)}{p_n^2-P_\\alpha^2}V_{lm}(\\lambda) \\; .\n\\label{LSsrgR}\n\\end{eqnarray}\n\n\\noindent\nA surprising result is that for unitarily equivalent operators on the\ngrid, such as those generated by the SRG evolution, the phase-shifts\ncomputed from the solution of the LS equation are {\\it not} the same;\ni.e. $\\delta_{N}^{\\rm LS}(p_n,H) \\neq \\delta_{N}^{\\rm LS}(p_n,\nU_{\\lambda}HU_{\\lambda}^\\dagger) $.  This is evident from\nEqs.~(\\ref{LSsrgT}) and (\\ref{LSsrgR}), where we can see explicitly\nthat the LS phase-shifts depend {\\it both} on the eigenvalues\n$P_\\alpha^2$, which are isospectral, and the eigenfunctions\n$\\psi_{\\alpha,\\lambda} (p_{k})$, which in turn change along the SRG\nevolution trajectory and so are {\\it not} independent of the SRG\ncutoff $\\lambda$. Of course, in the continuum limit one has $\\lim_{N\n  \\to \\infty} \\delta_{N}^{\\rm LS}(p_n, H) = \\lim_{N \\to\n  \\infty}\\delta_{N}^{\\rm LS}(p_n, U_{\\lambda}H~U_{\\lambda}^\\dagger)\n$. Thus, for many purposes we will apply relatively small grids just\nin order to exploit isospectrality.\n\nOn the other hand, the SRG-evolved potential becomes diagonal in the infrared limit $\\lambda \\to 0$,\n\n\\begin{eqnarray}\n\\lim_{\\lambda\\to 0} V_{nm}(\\lambda) = \\delta_{nm}~V_{n}(\\lambda \\to 0)   \\;  ,\n\\end{eqnarray}\n\n\\noindent\nand hence we get\n\n\\begin{eqnarray}\nV_{n}(\\lambda \\to 0) = R_{nn}(p_n) \\; ,\n\\end{eqnarray}\n\n\\noindent\nsuch that the infrared fixed-point of the SRG evolution can be related to the energy-shift formula Eq.~(\\ref{ES-formula}),\n\n\\begin{eqnarray}\nV_{n}(\\lambda \\to 0) = \\frac{\\left(P^2_n - p^2_n \\right)}{\\frac{2}{\\pi} ~ w_n~p^2_n}= -\\frac{\\delta^{\\rm ES}(p_n)}{p_n} \\; ,\n\\label{eigenpot}\n\\end{eqnarray}\n\n\\noindent\nthus providing an isospectral definition for the phase-shifts which therefore preserves phase-equivalence along the SRG trajectory. We refer to $V_n(\\lambda \\to 0)$ and $\\delta^{\\rm ES}(p_n)$ as the \"eigenpotential\" and the \"eigenphases\" since they are obtained directly from the eigenvalues of the hamiltonian, $P^2_n$. It should be mentioned that in the coupled channel case (which actually occurs for the $^3S_1 - ^3D_1$ Deuteron channel) one needs not only the eigenvalues but also the eigenvectors\nto determine both the eigenphases and the mixing angles, as discussed in Refs.~\\cite{kukulin2009discrete,Rubtsova:2010zz}.\n\n\n\n\n\n\n\n\\subsection{Trace Identities and Levinson's theorem}\n\nAccording to Parisi~\\cite{parisi1988statistical} the trace identities\nare one of the most beautiful results in quantum mechanics. One of the\nadvantages of using the momentum grid basis is the almost\nstraightforward derivation of the finite energy sum rules in potential\nscattering found in Ref.~\\cite{Graham:2001iv} which are a\ngeneralization of the trace\nidentities~\\cite{parisi1988statistical}. While the analyticity of\ninteractions was extensively used there, our derivation is almost\ncompletely trivial, and we will just show here some particular examples\ngrasping the basic essence of the approach. \n\nWe can compute the following expressions involving the trace of the\nhamiltonian $H=T+V$ on a finite momentum grid with $N$ integration points\n$p_n \\in [0,\\Lambda]$ and weights $w_n$ ($n=1, \\dots N$),\n\n\\begin{eqnarray}\nI_k = {\\rm Tr}~ (T+V)^k - {\\rm Tr}~ T^k \\; ,\n\\end{eqnarray}\n\n\\noindent\nfor any integer $k$. On one hand we can saturate with the spectrum including possible\nbound-states and on the other hand with the momentum states, which yields\n\n\\begin{eqnarray}\nI_k\n&=& \\sum_\\alpha (-\\gamma_\\alpha^2)^k + \\sum_{n} \\frac{2}{\\pi} w_n p_n^2 p_n^{2k-2}~\nk\\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right]= \\sum_{n,m,\\dots} \\left[p_n^2 \\delta_{nm}+\\frac{2}{\\pi}w_n p_n^2 V_{nm}\\right]^k - \\sum_{n} \\left[p_n^2\\right]^k\\; .\n\\label{tracek}\n\\end{eqnarray}\n\n\nFor $k=1$ we obtain\n\n\\begin{eqnarray}\nI_1 = \\sum_\\alpha (-\\gamma_\\alpha^2) + \\sum_{n} \\frac{2}{\\pi} w_n\np_n^2 \\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right] = \\sum_{n} \\frac{2}{\\pi}\nw_n p_n^2 V_n \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich in the continuum yields\n\n\\begin{eqnarray}\nI_1  \\to \\sum_\\alpha (-\\gamma_\\alpha^2) + \\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 \\left[-\\frac{\\delta(p)}{p}\\right] =\n\\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 V(p,p) \\; .\n\\end{eqnarray}\n\n\\noindent\nIn terms of the first Born approximation for the phase-shifts, $\\delta^B(p)$, this can be written as\n\n\\begin{eqnarray}\n\\sum_\\alpha (-\\gamma_\\alpha^2) + \\frac{2}{\\pi} \\int_0^\\Lambda dp~p^2 \\left[\\frac{-\\delta(p)+ \\delta^B (p)}{p}\\right] =0  \\; . \n\\end{eqnarray}\n\n\\noindent\nThis still holds for the finite $\\Lambda$. Taking the infinite cutoff\nlimit $\\Lambda \\to \\infty$ we get the form of the finite energy sum\nrule of Ref.~\\cite{Graham:2001iv}. Note that our result does not\nrequire taking the $\\Lambda \\to \\infty$ limit and hence no assumption\non analyticity is required for finite $\\Lambda$.\n\nFor $k=2$ we obtain\n\n\\begin{eqnarray}\nI_2 = \\sum_\\alpha (-\\gamma_\\alpha^2)^2 + 2 \\sum_{n} \\frac{2}{\\pi}w_n p_n^4 \\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right] = 2 \\sum_{n}\n\\frac{2}{\\pi} w_n p_n^4 V_n + \\sum_{n,m} \\left[\\frac{2}{\\pi}w_n p_n^2 V_{nm}\\right]\\left[ \\frac{2}{\\pi} w_m p_m^2 V_{mn}\\right] \\; .\n\\end{eqnarray}\n\n\\noindent\nSimilarly to the case $k=1$, in the continuum this can be written as of Ref.~\\cite{Graham:2001iv} in terms of the second Born approximation for the phase-shifts, $\\delta^{B2} (p)$,\n\n\\begin{eqnarray}\n\\sum_\\alpha (-\\gamma_\\alpha^2)^2 + \\frac{4}{\\pi} \\int_0^\\Lambda dp~p^4 \\left[\\frac{-\\delta(p)+ \\delta^{B2} (p)}{p}\\right] =0 \\; .\n\\end{eqnarray}\n\n\nThe case $k=0$ is a bit more tricky and obtained by taking the limit $k \\to 0$ in Eq.~(\\ref{tracek}),\n\n\\begin{eqnarray}\nI_0= \\sum_\\alpha (-\\gamma_\\alpha^2)^0 + \\lim_{k \\to 0} \\sum_{n} \\frac{2}{\\pi} w_n p_n^2 p_n^{2k-2} k\n\\left[-\\frac{\\delta^{\\rm ES}(p_n)}{p_n}\\right]=\\sum_{n} (1)_{T+V}-\\sum_{n} (1)_{T}= 0 \\; .\n\\label{trace0}\n\\end{eqnarray}\n\n\\noindent\nThe last equality just expresses the conservation of dimensions\nregardless of the interaction. The first term ater the first equality\nis simply the number of bound-states. The term with the phase-shift\ncan be transformed by using the identity $ 2 k p_n^{2k-2} = d p_n^{2k}\n/dp_n^2$ going to the continuum and integrating by parts. Thus in the\ncontinuum limit\n\n\\begin{eqnarray}\nN_B  + \\frac{\\delta(\\Lambda)-\\delta(0)}{\\pi}=0  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich becomes the usual Levinson's theorem for $\\Lambda \\to \\infty$.\nReinstating the finite momentum grid we get \n\n\\begin{eqnarray}\n\\delta(p_1)-\\delta(p_N)=N_B ~\\pi  \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere $N_B$ is the number of bound-states allowed by the\ninteraction. \n\n\n\n\n\n\\section{Numerical results}\n\\label{sec:numerical}\n\n\n\\subsection{SRG evolution}\n\nWe solve the SRG flow equations for the toy model potential numerically on a finite momentum grid with $N=50$ gaussian points and a high-momentum UV cutoff $\\Lambda=2~{\\rm fm}^{-1}$. The discretization of the momentum-space leads to a system of $N^2$ non-linear first-order coupled differential equations which is solved numerically by using an adaptative variable-step fifth-order Runge-Kutta algorithm. The SRG cutoff $\\lambda$ is varied in a range from $0.05$ to $2.0~{\\rm fm}^{-1}$.\n\nIn Fig.~\\ref{fig:3} we show the SRG evolution of the diagonal and the\nfully off-diagonal matrix-elements of the toy model potential in the\n$^1S_0$ channel using the Wilson and the Wegner generators. As\nexpected, since there are no bound-states in this channel, the SRG\nevolutions using both generators are nearly identical. As the\npotential evolves with the SRG cutoff $\\lambda$ the off-diagonal\nmatrix-elements are gradually suppressed such that the potential is\ndriven towards the diagonal form. This can be seen very clearly from\nthe density plots displayed in Fig.~\\ref{fig:4}.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig3a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig3b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig3c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig3d.pdf}\n\\end{center}\n\\caption{SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators. Left panels: diagonal matrix-elements; Right panels: fully off-diagonal matrix-elements.\n}\n\\label{fig:3}\n\\end{figure}\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=14cm]{fig4a.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=14cm]{fig4b.pdf}\n\\end{center}\n\\caption{Density plots for the SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:4}\n\\end{figure}\n\nIn Fig.~\\ref{fig:5} we show the SRG evolution of the diagonal and the fully off-diagonal matrix-elements of the toy model potential in the $^3S_1$ channel using the Wilson and the Wegner generators. For both generators the potential is driven towards a diagonal form though, as expected for the $^3S_1$ channel, the SRG evolutions become very different when the SRG cutoff $\\lambda$ goes below the critical momentum scale $\\Lambda_c \\sim 0.3 ~{\\rm fm}^{-1}$ where the Deuteron bound-state emerges. In the case of the Wilson generator, the low-momentum matrix-elements of the SRG-evolved potential are driven to large negative values, since the Deuteron bound-state is pushed towards the lowest momentum $p_1$ available on the grid. In the case of the Wegner generator, the Deuteron bound-state decouples from the low-momentum scales when the SRG cutoff $\\lambda$ goes below the critical momentum $\\Lambda_c$ and is placed at a higher momentum $p_{n_{\\rm BS}}$. We observe in our SRG calculations for the toy model potential on a finite grid that the position at which the bound-state is placed changes when using different values for the number of grid points $N$ and/or the UV cutoff $\\Lambda$, similar to what is observed in Ref.~\\cite{Wendt:2011qj} for the SRG evolution of LO ChEFT interactions with large momentum cutoffs $\\Lambda_{\\rm EFT}$, in which the (spurious) bound-state position also changes with the cutoff. Here, for a grid with $N=50$ points and $\\Lambda=2~{\\rm fm}^{-1}$, the bound-state is placed at the momentum $p_{n_{\\rm BS}}= p_9\\sim 0.145~{\\rm fm}^{-1}$. Moreover, the matrix-elements of the SRG-evolved potential corresponding to momenta $p_n < p_{n_{\\rm BS}}$ jump to positive values approaching the $^3S_1$ channel scattering length $a_{^3S_1} = 5.4~{\\rm fm}$. The difference between the SRG evolutions of the toy model potential in the $^3S_1$ channel using the Wilson and the Wegner generators can be seen very clearly from the density plots displayed in Fig.~\\ref{fig:6}.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig5a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig5b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.6cm]{fig5c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig5d.pdf}\n\\end{center}\n\\caption{SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators. Left panels: diagonal matrix-elements; Right panels: fully off-diagonal matrix-elements.}\n\\label{fig:5}\n\\end{figure}\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=14cm]{fig6a.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=14cm]{fig6b.pdf}\n\\end{center}\n\\caption{Density plots for the SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:6}\n\\end{figure}\n\n\n\n\\subsection{SRG regimes}\n\nIn most studies the convergence pattern of the SRG evolution towards the infrared fixed-point is determined by the stability\nof single matrix-elements of the evolved potential. This corresponds to a pointwise notion of convergence. However, as we have discussed above, the proper and monotonous decreasing quantities are the operator norms.  It is interesting to illustrate to what extent the Frobenius norm and the departure from the infrared limit behave as a function of the SRG cutoff $\\lambda$. This is shown in Fig.~\\ref{fig:7}. As one can observe, the stationary condition is reached at about $\\lambda = 0.1~{\\rm fm}^{-1}$. This already provides the relevant scale below which the infrared regime sets in for the finite momentum grid. Actually, the operator norms suggest a new density plot for the quantity\n\n\\begin{eqnarray}\n\\frac{2}{\\pi} ~ p p' \\sqrt{\\Delta p \\Delta p'} ~ V_{\\lambda}(p,p') \\rightarrow  \\frac{2}{\\pi} ~ p_n p_m \\sqrt{w_n w_m} ~ V_{\\lambda}(p_n,p_m)  \\; ,\n\\label{wdens}\n\\end{eqnarray}\n\n\\noindent\ninstead of the standard one involving only $V_{\\lambda}(p,p') \\rightarrow V_{\\lambda}(p_n,p_m)$.  These are the normalized SRG-evolved potentials on the grid, according to our previous discussion.\n\nThe {\\it weighted} density plots corresponding to Eq.~(\\ref{wdens}) for the SRG evolution of the toy model potential in the $^1S_0$ and the $^3S_1$ channels are depicted respectively in Figs.~\\ref{fig:8} and ~\\ref{fig:9}. Note the enhancement of the diagonal region and the suppression of low-energy states as the SRG cutoff $\\lambda$ decreases. This is particularly noticeable around the Deuteron bound-state in the Wegner generator case and around zero momentum in the Wilson generator case. We believe these pictures reflect more faithfully the SRG evolution pattern according to the metric induced by the operator norm relevant for the\nconvergence of the equations.\n\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig7a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig7b.pdf} \\\\ \\vspace{0.7cm}\n\\includegraphics[width=7.5cm]{fig7c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig7d.pdf}\n\\end{center}\n\\caption{Operator norms for the SRG-evolved toy model separable gaussian potential in the $^1S_0$ and the $^3S_1$ channels ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) for the Wilson and the Wegner generators as a function of the SRG cutoff $\\lambda$. The infrared regime takes place below $\\lambda \\sim 0.1 ~ {\\rm fm}^{-1}$.}\n\\label{fig:7}\n\\end{figure}\n\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=14cm]{fig8a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=14cm]{fig8b.pdf}\n\\end{center}\n\\caption{Weighted density plots for the SRG evolution of the toy model separable gaussian potential in the $^1S_0$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:8}\n\\end{figure}\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=14cm]{fig9a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=14cm]{fig9b.pdf}\n\\end{center}\n\\caption{Weighted density plots for the SRG evolution of the toy model separable gaussian potential in the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson (top panel) and the Wegner (bottom panel) generators.}\n\\label{fig:9}\n\\end{figure}\n\n\n\n\\subsection{SRG evolution in the infrared limit and the scattering problem on a finite momentum grid}\n\nIn the previous sections we have discussed both the SRG flow equations in the infrared limit and the scattering problem on a finite momentum grid independently. In this section we discuss in detail the relation between these two apparently disconnected topics through a surprising result involving Levinson's theorem which we have already described in a previous work \\cite{Arriola:2014aia}. As mentioned above the SRG flow equations are isospectral, i.e. they maintain the spectrum of the hamiltonian invariant along the SRG trajectory. Nevertheless, the definition of the spectrum in the continuum requires some care since strictly speaking there is no finite energy-shift but the states become dense. This is illustrated by the finite box quantization formula Eq.~(\\ref{eq:p-box}) together with Eq.~(\\ref{eq:trace}). Therefore, if we regularize the continuum by a finite momentum grid there appears an inevitable energy-shift due to the interaction and all states in the Hilbert space become normalizable. However, once the finite momentum grid is introduced there is no scattering process and some of the wave operator properties usually assumed for continuum states, such as the intertwining property of the Moller operator, do not hold~\\cite{muga1989stationary}. Actually, in the case of a hamiltonian allowing for bound-states the energy-shift does not disappear in the continuum. The question is what is the net effect of the energy-shift for positive energy and would-be scattering states when the continuum is approached as a limiting procedure starting from the finite momentum grid.\n\n\n\\subsubsection{SRG induced ordering of the spectrum and the energy-shift approach}\n\nThe final ordering of the spectrum induced by the SRG evolution in the infrared limit $\\lambda \\to 0$ can be depicted through the flow of the diagonal matrix-elements of the hamiltonian along the SRG trajectory. In Fig.~\\ref{fig:14} we show the SRG evolution of the lowest diagonal matrix-elements of the toy model hamiltonian $H_{\\lambda}(p_n,p_n)$ ($n=1,...,6$) in the $^1S_0$ and $^3S_1$ channels, for a momentum grid with $N=20$ points and $\\Lambda=2~{\\rm fm}^{-1}$. As one can observe, for the $^1S_0$ channel there is no crossing amongst the diagonal matrix-elements of the hamiltonian evolved with both generators as the SRG cutoff $\\lambda$ approaches the infrared limit, indicating that the initial ascending order is maintained all along the SRG trajectory. For the $^3S_1$ channel, on the other hand, there are crossings with both generators as the SRG cutoff $\\lambda$ approaches the critical momentum scale $\\Lambda_c \\sim 0.3 ~{\\rm fm}^{-1}$. In the Wilson generator case, the initial ascending order is asymptotically restored in the infrared limit $\\lambda\\to 0$ ~\\cite{Timoteo:2011tt,Arriola:2013gya} with the lowest momentum diagonal matrix-element $H_{\\lambda}(p_1,p_1)$ flowing into the Deuteron bound-state. In the Wegner generator case a re-ordering occurs, such that the diagonal matrix-element $H_{\\lambda}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})$ flows into the Deuteron bound-state in the limit $\\lambda\\to 0$. For this calculation with $N=20$ grid points and $\\Lambda=2~{\\rm fm}^{-1}$ the momentum at which the bound-state is placed on the diagonal of the hamiltonian corresponds to $p_{n_{\\rm BS}}\\to p_5 \\sim 0.254~{\\rm fm}^{-1}$. Note that the diagonal matrix-element $H_{\\lambda}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})$ flowing into the Deuteron bound-state is the one that starts to decrease rapidly towards negative values when the SRG cutoff $\\lambda$ approaches $\\Lambda_c$, indicating the break-up of the kinetic energy dominance,\ni.e.\n\n\\begin{eqnarray}\np_{n_{\\rm {BS}}}^2 < \\frac{2}{\\pi}~w(p_{n_{\\rm {BS}}})~p_{n_{\\rm {BS}}}^2~|V_{\\lambda < \\Lambda_c}(p_{n_{\\rm {BS}}},p_{n_{\\rm {BS}}})|  \\; .\n\\end{eqnarray}\n\n\\noindent\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig14a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig14b.pdf} \\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig14c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig14d.pdf}\n\\end{center}\n\\caption{SRG evolution of the lowest diagonal matrix-elements of the toy-model hamiltonian $H_{\\lambda}(p_n,p_n)$ ($n=1,...,6$) in the $^1S_0$ channel and the $^3S_1$ channel ($N=20$ and $\\Lambda=2~{\\rm fm}^{-1}$) using the Wilson and the Wegner generators.}\n\\label{fig:14}\n\\end{figure}\n\n\nIn Fig.~\\ref{fig:10} we show the diagonal matrix-elements of the toy model potential in the $^1S_0$ and the $^3S_1$\nchannels evolved with both the Wilson and the Wegner generators up to the SRG cutoff $\\lambda = 0.05~\\rm{fm}^{-1}$, compared to the corresponding eigenpotentials $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ and $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ evaluated from the energy-shifts through Eq.~(\\ref{eigenpot}). The eigenpotential $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ is computed with the eigenvalues arranged in ascending order, which corresponds to the order induced by the SRG evolution in the $^1S_0$ channel with both generators. The eigenpotential $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ is computed both with the eigenvalues arranged in ascending order, which corresponds to the order induced by the SRG evolution in the $^3S_1$ channel with the Wilson generator, and in the order induced by the SRG evolution with the Wegner generator, which is obtained by placing the Deuteron bound-state at $p_{n_{\\rm BS}}$. As expected by construction, the potentials evolved up to the SRG cutoff $\\lambda = 0.05~\\rm{fm}^{-1}$ nearly match the corresponding eigenpotentials. This result clearly shows that the SRG evolved potential indeed converges in the infrared limit $\\lambda \\to 0$ to the eigenpotential $V_{n}(\\lambda \\rightarrow 0)$ computed with the eigenvalues arranged according to the proper SRG induced ordering. Note that for the $^1S_0$ channel the eigenpotential at the lowest momentum $p_1$ on the grid approaches the scattering length, i.e. $V_{1}^{^1S_0}(\\lambda \\rightarrow 0)\\to a_{^1S_0} = -23.7~{\\rm fm}$, such that the correct behavior at low-momentum in the on-shell limit is obtained. For the $^3S_1$ channel, on the other hand, the correct behavior, with $V_{1}^{^3S_1}(\\lambda \\rightarrow 0)\\to a_{^3S_1} = 5.4~{\\rm fm}$, is obtained only when the eigenpotential is computed with the eigenvalues arranged in the order induced by the SRG evolution with the Wegner generator.\n\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig10a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig10b.pdf}\n\\end{center}\n\\caption{Diagonal matrix-elements of the toy model separable gaussian potential in the $^1S_0$ channel and the $^3S_1$ channel ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) evolved with the Wilson and the Wegner generators up to the SRG cutoff $\\lambda=0.05~{\\rm fm^{-1}}$. For comparison, we also show the eigenpotentials $V_{n}^{^1S_0}(\\lambda \\rightarrow 0)$ and $V_{n}^{^3S_1}(\\lambda \\rightarrow 0)$ computed with the eigenvalues arranged according to the corresponding SRG induced orderings.}\n\\label{fig:10}\n\\end{figure}\n\n\\subsubsection{Ordering prescription and Levinson's theorem}\n\nIn Fig.~\\ref{fig:ps-LSgrid} we show the phase-shifts $\\delta_\\lambda^{\\rm LS}(p_n)$ evaluated from the solution of the LS equation on a finite momentum grid {\\it at the grid points} ($N=50$ and $\\Lambda=2~{\\rm fm}^{-1}$) for the toy model potential in the $^1S_0$ and $^3S_1$ channels evolved through the SRG transformation with the Wilson and the Wegner generators for several values of the SRG cutoff $\\lambda$. As one can observe, Levinson's theorem~\\cite{Ma:2006zzc} is fulfilled on the finite momentum grid for both channels, i.e.\n\n\n", "index": 33, "text": "\\begin{equation}\n\\delta_\\lambda^{\\rm LS}(p_1)-\\delta_\\lambda^{\\rm LS}(p_N)= N_B ~ \\pi \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\delta_{\\lambda}^{\\rm LS}(p_{1})-\\delta_{\\lambda}^{\\rm LS}(p_{N})=N_{B}~{}\\pi\\;,\" display=\"block\"><mrow><mrow><mrow><mrow><msubsup><mi>δ</mi><mi>λ</mi><mi>LS</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mn>1</mn></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><msubsup><mi>δ</mi><mi>λ</mi><mi>LS</mi></msubsup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>N</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>=</mo><mrow><mpadded width=\"+3.3pt\"><msub><mi>N</mi><mi>B</mi></msub></mpadded><mo>⁢</mo><mpadded width=\"+2.8pt\"><mi>π</mi></mpadded></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nEq.~(\\ref{eq:b34}) can be interpreted in terms of the number of\npairs in the $^1S_0$ and $^3S_1$ states being $n_{^1S_0,~t}=n_{^3S_1,~t}=3/2$ for the Triton and $n_{^1S_0,~\\alpha}=n_{^3S_1,~\\alpha} = 6/2 $ for the $\\alpha$-particle.\n\nWithin this shell-model calculation scheme we may also define a variational Deuteron energy,\n\n\n", "itemtype": "equation", "pos": 109062, "prevtext": "\n\n\\noindent\nwith $N_B=0$ for the $^1S_0$ channel and $N_B=1$ for the $^3S_1$ channel. However, one can also clearly see that the LS phase-shifts on the finite grid are not independent of the SRG cutoff $\\lambda$. As pointed out in section \\ref{phaseineq}, while the lack of phase-equivalence disappears in the continuum limit, i.e. for $N \\to \\infty$, the isospectral definition of the phase-shifts on the finite momentum grid based on the energy-shift formula Eq.~(\\ref{ES-formula}), which we refer to as the {\\it eigenphases} $\\delta^{\\rm ES}(p_n)$, preserves phase-equivalence along the SRG trajectory for {\\it any} number of grid points $N$. Furthermore, as we will show below, a proper prescription to order the spectrum of $N$ discrete eigenvalues $P_{n}^2$ of the diagonalized hamiltonian when using the energy-shift approach is required to obtain eigenphases which also fulfill Levinson's theorem, particularly when bound-states are allowed by the interaction as in the case of the toy model potential in the $^3S_1$ channel.\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{phases-LSgrid-1S0-wil.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-3S1-wil.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-1S0-weg.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{phases-LSgrid-3S1-weg.pdf}\n\\end{center}\n\\caption{Phase-shifts $\\delta_\\lambda^{\\rm LS}(p_n)$ evaluated from the solution of the LS equation on a finite momentum grid  {\\it at the grid points} ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) for the toy model separable gaussian potential in the $^1S_0$ and $^3S_1$ channels evolved through the SRG transformation with the Wilson and the Wegner generators for several values of the SRG cutoff $\\lambda$.}\n\\label{fig:ps-LSgrid}\n\\end{figure}\n\n\nOne possible ordering prescription is that derived by Kukulin et al.~\\cite{kukulin2009discrete,Rubtsova:2010zz} for a hamiltonian allowing for $N_B$ bound-states. According to this prescription, the eigenvalues $P_{n}^2$ of the hamiltonian are arranged in ascending order and then left-shifted $N_B$ positions with respect to the eigenvalues $p_{n}^2$ of the kinetic energy operator $T$, which yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Kuk}^{\\rm ES}(p_n) = - \\pi \\frac{P_{n+N_B}^2-p_n^2}{2 w_n p_n} \\; ,\n\\label{deltakuk}\n\\end{eqnarray}\n\n\\noindent\nwith $n=1, \\cdots , ~ N-N_B$. Note that Kukulin's prescription implies that the $N_B$ negative bound-state eigenvalues are just removed, such as to avoid discontinuities in the calculation of the eigenphases.\n\nIn the case of the $^1S_0$ channel there is no need to shift the eigenvalues $P_{n}^2$, since there are no bound-states ($N_B=0$). Thus, we can evaluate the eigenphases $\\delta^{\\rm ES}(p_n)$ from the energy-shift formula just by arranging the eigenvalues in ascending order, which corresponds to the order induced by the SRG evolution in the $^1S_0$ channel with both the Wilson and the Wegner generators. The resulting eigenphases for the toy-model potential on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) are shown in Fig.~\\ref{fig:11}, compared to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). As one can see, the ascending order prescription allows to obtain eigenphases which display the correct behavior in the entire range of momenta, thus complying to Levinson's theorem, i.e. $\\delta^{\\rm ES}(p_1)- \\delta^{\\rm ES}(p_N) \\sim 0$.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig11.pdf}\n\\end{center}\n\\caption{Eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy-model separable gaussian potential in the $^1S_0$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues arranged in ascending order. For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$).}\n\\label{fig:11}\n\\end{figure}\n\n\nIn the case of the $^3S_1$ channel, which allows for the Deuteron bound-state ($N_B=1$), we have considered three different prescriptions to evaluate the eigenphases $\\delta^{\\rm ES}(p_n)$ from the energy-shift formula:\n\\\\ \\\\\n\\noindent\n(i) eigenvalues $P_{n}^2$ arranged according to Kukulin's prescription, i.e. in ascending order and shifted one position to the left such as to remove the negative Deuteron bound-state eigenvalue.\n\\\\ \\\\\n\\noindent\n(ii) eigenvalues $P_{n}^2$ arranged according to the order induced by the SRG evolution in the $^3S_1$ channel with the Wilson generator, i.e. in ascending order, which corresponds to Kukulin's prescription with no left-shifting of the eigenvalues and yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Wil}^{\\rm ES}(p_n) = - \\pi \\frac{P_{n}^2-p_n^2}{2 w_n p_n} \\; ,\n\\label{deltawil}\n\\end{eqnarray}\n\n\\noindent\nNote that in this prescription the negative Deuteron bound-state eigenvalue is placed on the diagonal of the hamiltonian at the lowest momentum on the grid $p_1$.\n\\\\ \\\\\n\\noindent\n(iii) eigenvalues $P_{n}^2$ arranged according to the order induced by\nthe SRG evolution in the $^3S_1$ channel with the Wegner generator,\ni.e. with the negative Deuteron bound-state eigenvalue placed at the\nmomentum $p_{n_{\\rm BS}}$ on the diagonal of the hamiltonian and the\nremaining positive eigenvalues in ascending order. The discontinuity\nin the eigenphases at the momentum $p_{n_{\\rm BS}}$ can be avoided\njust by removing the Deuteron bound-state, as in Kukulin's\nprescription, or by interpolating between the neighboring values,\nwhich yields\n\n\\begin{eqnarray}\n\\delta_{\\rm Weg}^{\\rm ES}(p_n) =\n\\begin{cases}\n- \\pi \\frac{P_{n+1}^2-p_n^2}{2 w_n p_n} \\quad {\\rm if}\\; \\quad n < n_{\\rm BS}  \\\\ \\\\\n- \\pi \\frac{\\bar P_{n_{\\rm BS}}^2-p_n^2}{2 w_n p_n} \\; \\quad {\\rm if} \\quad n=n_{\\rm BS} \\\\ \\\\\n- \\pi \\frac{P_n^2-p_n^2}{2 w_n p_n} \\qquad {\\rm if}\\; \\quad n > n_{\\rm BS}\n\\end{cases}\n\\label{deltaweg}\n\\end{eqnarray}\n\n\\noindent\nwhere $\\bar P_{n_{\\rm BS}}^2=(P_{n_{\\rm BS}+1}^2+P_{n_{\\rm BS}-1}^2)/2$. Note that in this prescription only the eigenvalues $P_{n}^2$ corresponding to momenta $p_n < p_{n_{\\rm BS}}$ are shifted one position to the left.\n\\\\\n\nIn Fig.~\\ref{fig:12} we show the eigenphases for the toy-model potential on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues $P_{n}^2$ of the hamiltonian  arranged according to the three prescriptions outlined above, compared to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). As one can see, the eigenphases obtained with prescription (i) and prescription (ii), which are shown respectively in the top-left and the top-right panels, clearly violate Levinson's theorem. Prescription (i) yields eigenphases which have a proper low-momenta behavior but become distorted at high-momenta due to the left-shifting of the eigenvalues. Prescription (ii), on the other hand, yields eigenphases which have a proper high-momenta behavior but are distorted at low-momenta due to the presence of the Deuteron bound-state~\\footnote{The point corresponding to the lowest momentum $p_1$ on the grid, at which the Deuteron bound-state eigenvalue is placed on the diagonal of the hamiltonian, is out of scale and so is omitted from the plot.}. One should note that both in the case of prescription (i) and prescription (ii) the distortion of the eigenphases is generated by a mismatch between the eigenvalues $P_{n}^2$ of the hamiltonian and the eigenvalues $p_{n}^2$ of the kinetic energy operator $T$, respectively at high-momenta and low-momenta. As shown in the bottom-left panel, prescription (iii) yields eigenphases which have a proper behavior both at low-momenta and high-momenta, since the left-shifting is applied {\\it only} to the eigenvalues corresponding to momenta $p_n < p_{n_{\\rm BS}}$. As mentioned before, the position $p_{n_{\\rm BS}}$ of the Deuteron bound-state eigenvalue induced by the SRG evolution with the Wegner generator depends both on the number of grid points $N$ and the cutoff $\\Lambda$. In the bottom-right panel, we compare the results obtained with the three prescriptions for $N=50$ grid points. As one can see, the eigenphases obtained with prescription (iii) indeed match those obtained with prescription (i) and prescription (ii) respectively for momenta below and above $p_{n_{\\rm BS}}$. Thus, we find that the final ordering of the spectrum of discrete eigenvalues $P_{n}^2$ of the toy-model hamiltonian induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$) remarkably provides a prescription which allows to obtain isospectral phase-shifts from the energy-shift formula that comply to Levinson's theorem in the presence of the Deuteron bound-state.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig12c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig12a.pdf}\\\\ \\vspace{0.6cm}\n\\includegraphics[width=7.5cm]{fig12b.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig12d.pdf}\n\\end{center}\n\\caption{Eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy model separable gaussian potential in the $^3S_1$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) evaluated from the energy-shift formula with the eigenvalues arranged according to Kukulin's prescription (i), the order induced by the SRG evolution with the Wilson generator (ii), i.e. in ascending order, and the order induced by the SRG evolution with the Wegner generator (iii). For comparison, we also show the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). In the bottom-right panel we compare the results obtained with prescriptions (i), (ii) and (iii) for $N=50$ grid points.}\n\\label{fig:12}\n\\end{figure}\n\n\nThe effectiveness of ordering prescription (iii) can be traced to the decoupling of the Deuteron bound-state from the low-momentum scales when the toy-model potential in the $^3S_1$ channel is evolved through the SRG transformation using the Wegner generator. The key point is that by placing the Deuteron bound-state eigenvalue at the position $p_{n_{\\rm BS}}$ induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$) we obtain eigenphases from the energy-shift formula which display the correct behavior in the entire range of momenta (within the expected uncertainties of the finite momentum grid). One should note, however, that such an ordering does not necessarily correspond to the optimal one. We have evaluated the eigenphases $\\delta^{\\rm ES}(p_n)$ for the toy model potential in the $^3S_1$ channel on a finite momentum grid ($\\Lambda=2~{\\rm fm}^{-1}$ and different number of grid points $N$) using prescription (iii) but varying the position of the Deuteron bound-state eigenvalue $p_{n_{\\rm BS}}$, and compared the results to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$). By computing the corresponding root mean square (RMS) errors as a function of $p_{n_{\\rm BS}}$, we find that for each value of the number of grid points $N$ there is a well-defined minimum. As one can see in Fig.~\\ref{fig:15}, the position $p_{n_{\\rm BS}}^{\\rm opt}$ minimizing the RMS errors, which seems to converge in the continuum limit to the characteristic Deuteron momentum scale $\\gamma = 0.23~{\\rm fm}^{-1}$, is different from that induced by the SRG evolution with Wegner generator in the infrared limit.\n\nAs pointed out before, the final ordering of the spectrum induced by the SRG evolution in the infrared limit may depend on the choice of the SRG generator when bound-states are allowed by the interaction. In this way, it is possible that a specific generator exists for which the position of the Deuteron bound-state induced by the SRG evolution corresponds to $p_{n_{\\rm BS}}^{\\rm opt}$, thus providing the optimal ordering prescription for the energy-shift approach.\n\n\n\n\\begin{figure}[t]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig15.pdf}\n\\end{center}\n\\caption{Comparison between the position of the Deuteron bound-state which minimizes the RMS errors in the eigenphases $\\delta^{\\rm ES}(p_n)$ with respect to the exact phase-shifts obtained from the solution of the standard LS equation in the continuum limit ($N \\to \\infty$) and the position induced by the SRG evolution with the Wegner generator in the infrared limit ($\\lambda \\to 0$), for different number of grid points $N$.}\n\\label{fig:15}\n\\end{figure}\n\n\n\n\\section{Consequences of the fixed points for nuclear binding: Triton and Helium nuclei}\n\\label{sec:nucl}\n\nThe ambiguities arising from off-shell uncertainties has been the main\nsource of problems in Nuclear Physics calculations. There are a\nvariety of $NN$ potentials in the literature providing a high-quality\ndescription of scattering data and Deuteron properties. They produce,\nhowever, different results when comparing to nuclear matter and\nnuclear structure calculations. So far, we have dealt with the\ntwo-body problem. Of course, much of the motivation to undertake the\nSRG evolution concerns the applications to nuclear structure. Our\npurpose here is to illustrate the different implications of the SRG\nusing the Wegner and the Wilson generators along the lines discussed\nabove using our simple toy model potential. Most calculations in\nNuclear Physics use a mean field reference state, which is often a\nharmonic oscillator (HO) shell-model state, upon which correlations\nare built, namely $|\\Psi \\rangle = U | \\phi \\rangle $, where $U$ is\nsome unitary transformation.  The SRG interpretation is that\ncorrelations are shifted from the reference state to the interaction\nvia the unitary transformation $U$.\n\nWithin the shell-model we will restrict to the cases with $A=3$ and $A=4$, which correspond respectively to the Triton and the $\\alpha$-particle, as only $S$-wave interactions are required. In order to simplify matters as much as\npossible we will describe the states as $t \\equiv (1s)^3$ and $ \\alpha\n\\equiv (1s)^4$ respectively,\n\n\\begin{eqnarray}\n\\psi_{t, \\uparrow} (p_1,p_2,p_3)  &\\equiv& \\left[ \\prod_{i=1}^3\\varphi_{1s} (p_i) \\right]\n {\\cal A} (p \\uparrow , n \\uparrow\n, n \\downarrow ) \\; , \\\\\n\\psi_{t, \\downarrow} (p_1,p_2,p_3)  &\\equiv& \\left[ \\prod_{i=1}^3\\varphi_{1s} (p_i) \\right]\n {\\cal A} (p \\downarrow , n \\uparrow\n, n \\downarrow ) \\; , \\\\\n\\psi_{\\alpha} (p_1,p_2,p_3,p_4)  &\\equiv& \\left[ \\prod_{i=1}^4\\varphi_{1s} (p_i) \\right]\n{\\cal A} (p \\uparrow , n \\uparrow , p \\downarrow , n \\downarrow) \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhere ${\\cal A}$ is a normalized antisymmmetrizer and $\\varphi_{1s}$ is\nthe ${\\rm HO}-1s$ wave-function with a $b$ parameter, given by\n\n\\begin{eqnarray}\n\\sqrt{\\frac{2}{\\pi}} \\varphi_{1s}(p) = \\frac{2 \\sqrt{b^3} e^{-\\frac{1}{2} b^2 p^2}}{\\sqrt[4]{\\pi }} \\; .\n\\end{eqnarray}\n\n\\noindent\nThe energy calculation for the $A=3$ and $A=4$ systems at rest, $\\sum_{i=1}^A p_i=0$,\nis straightforward and reads\n\n\\begin{eqnarray}\n\\{ E_t(\\lambda), E_\\alpha(\\lambda)\\}=\\{-B_t,-B_\\alpha\\} = \\min_b \\left[\n  (A-1) \\left\\langle \\frac{p^2}{2M} \\right\\rangle_{1s} + \\frac{A(A-1)}{2} \\frac12\n  \\langle V_{^1S_0,\\lambda} + V_{^3 S_1,\\lambda} \\rangle_{{\\rm rel},1s} \\right]\n\\Big|_{A=3,4} \\; .\n\\label{eq:b34}\n\\end{eqnarray}\n\n\\noindent\nThe single particle kinetic energy reads\n\n\\begin{eqnarray}\n\\left\\langle \\frac{p^2}{2M} \\right\\rangle_{1s} = \\frac2{\\pi}\n  \\int_0^\\infty p^2 \\, dp \\, \\left[\\varphi_{1s}(p)\\right]^2\n  \\frac{p^2}{2M} \\; ,\n\\end{eqnarray}\n\n\\noindent\nand the potential matrix-element is defined as\n\n\\begin{eqnarray}\n\\langle \\phi_{\\rm rel} | V_{\\lambda} | \\phi_{\\rm rel} \\rangle =\n \\frac2{\\pi} \\int_0^\\infty dp \\,  [p^2 \\phi_{\\rm rel} (p) ]\n\\frac2{\\pi}\\int_0^\\infty dp'\\, [p'^2 \\phi_{\\rm rel} (p') ] ~ V_{\\lambda}(p',p) \\;,\n\\end{eqnarray}\n\n\\noindent\nwhere the {\\it relative} wave function is given by (note the $\\sqrt{2}$\nfactor),\n\n\n", "index": 35, "text": "\\begin{equation}\n\\phi_{\\rm rel}(p)= \\varphi_{\\rm 1s} \\left(p,b/\\sqrt{2}\\right)\\; .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"\\phi_{\\rm rel}(p)=\\varphi_{\\rm 1s}\\left(p,b/\\sqrt{2}\\right)\\;.\" display=\"block\"><mrow><mrow><mrow><msub><mi>ϕ</mi><mi>rel</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>φ</mi><mrow><mn>1</mn><mo>⁢</mo><mi mathvariant=\"normal\">s</mi></mrow></msub><mo>⁢</mo><mrow><mo>(</mo><mi>p</mi><mo>,</mo><mrow><mi>b</mi><mo>/</mo><msqrt><mn>2</mn></msqrt></mrow><mo rspace=\"5.3pt\">)</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nwhich unlike the exact one will depend on the SRG cutoff $\\lambda$. For $\\lambda \\to \\infty$\nthe Deuteron is unbound by $0.2 ~ {\\rm MeV}$, and the binding-energy obtained for the\nTriton is $B_t^{\\rm Var} = 5.9661 ~ {\\rm MeV}$ to be compared with the\nexact Faddeev equation result $B_t = 6.65543 ~ {\\rm MeV}$, whereas the\n$\\alpha$-particle yields $B_\\alpha^{\\rm Var} = 32.1054 ~ {\\rm MeV}$.\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7cm]{fig16a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16b.pdf}\\\\\\vspace{0.6cm}\n\\includegraphics[width=7cm]{fig16c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16d.pdf}\\\\\\vspace{0.6cm}\n\\includegraphics[width=7cm]{fig16e.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16f.pdf}\n\\end{center}\n\\caption{Shell-model variational energies for Deuteron, Triton and Helium obtained from the toy-model separable gaussian potentials ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) evolved through the SRG transformation using the Wilson and the Wegner generators as a function of the SRG cutoff $\\lambda$.  }\n\\label{fig:binding}\n\\end{figure}\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig17a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig17b.pdf}\n\\end{center}\n\\caption{Tjon-lines obtained from the toy-model separable gaussian potentials ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) evolved through the SRG transformation using the Wilson and the Wegner generators. We compare with the asymptotic lines\n$E_\\alpha = 4 E_t - 3 E_d$ and $E_\\alpha = 2 E_t$. }\n\\label{fig:Tjon}\n\\end{figure}\n\n\nIt is interesting to analyze the SRG evolution from $\\lambda \\to \\infty$ down to $\\lambda \\to 0$,\ndisregarding here explicit three-body or four-body forces (see Ref.~\\cite{Arriola:2013gya} for\nsome further details on this issue). In Fig.~\\ref{fig:binding} we see\nthe effect of the SRG evolution on a simple variational calculation for\nthe cases with $A=2,3,4$. Here and for illustration purposes we take a grid with $\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$ gauss points. A very similar behavior in the region $\\lambda \\gtrsim 1 {\\rm fm}^{-1}$ is found for both\nthe Wilson and the Wegner generators. However, as we can see, in the region of small $\\lambda$ the\nbehavior for the Wilson and the Wegner generators is quite different and,\nnear $\\lambda \\sim 0.2~ {\\rm fm}^{-1}$, a clear jump in the energies is observed. To\nunderstand how this surprising result comes about let us consider the\ncalculation of the energy in further detail for the finite momentum\ngrid which is used for the SRG evolution. The kinetic and potential\nenergy contributions become\n\n\n", "itemtype": "equation", "pos": 109499, "prevtext": "\n\n\\noindent\nEq.~(\\ref{eq:b34}) can be interpreted in terms of the number of\npairs in the $^1S_0$ and $^3S_1$ states being $n_{^1S_0,~t}=n_{^3S_1,~t}=3/2$ for the Triton and $n_{^1S_0,~\\alpha}=n_{^3S_1,~\\alpha} = 6/2 $ for the $\\alpha$-particle.\n\nWithin this shell-model calculation scheme we may also define a variational Deuteron energy,\n\n\n", "index": 37, "text": "\\begin{equation}\nE_d(\\lambda)= \\min_b ~ \\langle p^2/M + V_{^3S_1,\\lambda} \\rangle_{{\\rm rel},1s} \\; ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E19.m1\" class=\"ltx_Math\" alttext=\"E_{d}(\\lambda)=\\min_{b}~{}\\langle p^{2}/M+V_{{}^{3}S_{1},\\lambda}\\rangle_{{\\rm&#10;rel%&#10;},1s}\\;,\" display=\"block\"><mrow><msub><mi>E</mi><mi>d</mi></msub><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mpadded width=\"+3.3pt\"><munder><mi>min</mi><mi>b</mi></munder></mpadded><mpadded width=\"+2.8pt\"><msub><mrow><mo stretchy=\"false\">⟨</mo><msup><mi>p</mi><mn>2</mn></msup><mo>/</mo><mi>M</mi><mo>+</mo><msub><mi>V</mi><mrow><mmultiscripts><mi>S</mi><mn>1</mn><none/><mprescripts/><none/><mn>3</mn></mmultiscripts><mo>,</mo><mi>λ</mi></mrow></msub><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>rel</mi><mo>,</mo><mrow><mn>1</mn><mo>⁢</mo><mi>s</mi></mrow></mrow></msub></mpadded><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nand\n\n", "itemtype": "equation", "pos": 112231, "prevtext": "\n\n\\noindent\nwhich unlike the exact one will depend on the SRG cutoff $\\lambda$. For $\\lambda \\to \\infty$\nthe Deuteron is unbound by $0.2 ~ {\\rm MeV}$, and the binding-energy obtained for the\nTriton is $B_t^{\\rm Var} = 5.9661 ~ {\\rm MeV}$ to be compared with the\nexact Faddeev equation result $B_t = 6.65543 ~ {\\rm MeV}$, whereas the\n$\\alpha$-particle yields $B_\\alpha^{\\rm Var} = 32.1054 ~ {\\rm MeV}$.\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7cm]{fig16a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16b.pdf}\\\\\\vspace{0.6cm}\n\\includegraphics[width=7cm]{fig16c.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16d.pdf}\\\\\\vspace{0.6cm}\n\\includegraphics[width=7cm]{fig16e.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7cm]{fig16f.pdf}\n\\end{center}\n\\caption{Shell-model variational energies for Deuteron, Triton and Helium obtained from the toy-model separable gaussian potentials ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) evolved through the SRG transformation using the Wilson and the Wegner generators as a function of the SRG cutoff $\\lambda$.  }\n\\label{fig:binding}\n\\end{figure}\n\n\n\n\\begin{figure}[h]\n\\begin{center}\n\\includegraphics[width=7.5cm]{fig17a.pdf}\\hspace{0.5cm}\n\\includegraphics[width=7.5cm]{fig17b.pdf}\n\\end{center}\n\\caption{Tjon-lines obtained from the toy-model separable gaussian potentials ($\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$) evolved through the SRG transformation using the Wilson and the Wegner generators. We compare with the asymptotic lines\n$E_\\alpha = 4 E_t - 3 E_d$ and $E_\\alpha = 2 E_t$. }\n\\label{fig:Tjon}\n\\end{figure}\n\n\nIt is interesting to analyze the SRG evolution from $\\lambda \\to \\infty$ down to $\\lambda \\to 0$,\ndisregarding here explicit three-body or four-body forces (see Ref.~\\cite{Arriola:2013gya} for\nsome further details on this issue). In Fig.~\\ref{fig:binding} we see\nthe effect of the SRG evolution on a simple variational calculation for\nthe cases with $A=2,3,4$. Here and for illustration purposes we take a grid with $\\Lambda=2~{\\rm fm}^{-1}$ and $N=50$ gauss points. A very similar behavior in the region $\\lambda \\gtrsim 1 {\\rm fm}^{-1}$ is found for both\nthe Wilson and the Wegner generators. However, as we can see, in the region of small $\\lambda$ the\nbehavior for the Wilson and the Wegner generators is quite different and,\nnear $\\lambda \\sim 0.2~ {\\rm fm}^{-1}$, a clear jump in the energies is observed. To\nunderstand how this surprising result comes about let us consider the\ncalculation of the energy in further detail for the finite momentum\ngrid which is used for the SRG evolution. The kinetic and potential\nenergy contributions become\n\n\n", "index": 39, "text": "\\begin{equation}\n\\left\\langle \\frac{p^2}{2M} \\right\\rangle_{1s} \\to  \\frac{2}{\\pi} \\sum_n w_n p_n^2 \\frac{p_n^2}{M}  \\phi_{N,\\rm rel} (p_n)^2 \\;\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E20.m1\" class=\"ltx_Math\" alttext=\"\\left\\langle\\frac{p^{2}}{2M}\\right\\rangle_{1s}\\to\\frac{2}{\\pi}\\sum_{n}w_{n}p_{%&#10;n}^{2}\\frac{p_{n}^{2}}{M}\\phi_{N,\\rm rel}(p_{n})^{2}\\;\" display=\"block\"><mrow><msub><mrow><mo>⟨</mo><mfrac><msup><mi>p</mi><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><mi>M</mi></mrow></mfrac><mo>⟩</mo></mrow><mrow><mn>1</mn><mo>⁢</mo><mi>s</mi></mrow></msub><mo>→</mo><mrow><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>n</mi></munder><mrow><msub><mi>w</mi><mi>n</mi></msub><mo>⁢</mo><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>⁢</mo><mfrac><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mi>M</mi></mfrac><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>N</mi><mo>,</mo><mi>rel</mi></mrow></msub><mo>⁢</mo><mpadded width=\"+2.8pt\"><msup><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02360.tex", "nexttext": "\n\n\\noindent\nThe ${\\rm HO}-1s$ states need to be renormalized on the grid as follows,\n\n\\begin{eqnarray}\n\\varphi_{1s,N} (p_n) = Z_N \\varphi_{1s} (p_n) \\; ,  \\qquad Z_N^2 = \\frac{2}{\\pi}\n\\sum_n w_n p_n^2 \\left[ \\varphi_{1s}(p_n) \\right]^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nIf one takes the infrared limit $\\lambda \\to 0$, the potential becomes diagonal\nand one gets\n\n\\begin{eqnarray}\n\\langle \\phi_{\\rm rel} |  V_{\\lambda \\to 0} | \\phi_{\\rm rel} \\rangle \\to\n\\left(\\frac2{\\pi} \\right)^2 \\sum_{n} w_n^2 p_n^4 \\phi_{\\rm rel} (p_n)^2 V_{n}(\\lambda \\to 0)\\; .\n\\end{eqnarray}\n\n\\noindent\nWe see the weight squared factor $w_n^2$ and {\\it naively} in the $\\Lambda$-fixed and $N \\to \\infty $ continuum limit, we obtain\n\n\\begin{eqnarray}\nV(N \\to \\infty)=\\langle \\phi_{\\rm rel} | V_{\\lambda \\to 0} | \\phi_{\\rm rel} \\rangle_{N \\to \\infty} \\to\n\\left(\\frac2{\\pi} \\right) \\frac{\\Lambda}{N} \\int_0^\\Lambda p^4 \\phi_{\\rm rel} (p)^2\\left[\\frac{-\\delta(p)}{p} \\right]\\to 0 \\; ,\n\\end{eqnarray}\n\n\\noindent\nregardless on the HO parameter b. Thus, the kinetic energy gets\nminimal for $b \\to \\infty$ and hence the minimum takes place at zero\nenergy. While this argument agrees with the behavior for the Wegner generator observed\nin Fig.~\\ref{fig:binding} it fails to reproduce the trend found for\nthe Wilson generator.  The flaw in the argument can be seen more clearly in the Deuteron case, where\n\n\\begin{eqnarray}\n\\lim_{\\lambda \\to 0} E_d (\\lambda)=  \\frac{2}{\\pi} \\sum_n w_n p_n^2 \\frac{P_n^2}{M}  \\phi_{\\rm rel,N} (p_n)^2 \\; .\n\\end{eqnarray}\n\n\\noindent\nNote that with the exception of the Deuteron state $P_d^2 =\n-\\gamma_d^2$ all others fulfill $P_n^2 >0$. The difference, however,\nis in the location of the bound-state after the SRG evolution. The bound-state is located at the lowest point on the grid for\nthe Wilson generator and at some intermediate point for the Wegner\ngenerator,\n\n\\begin{eqnarray}\nP_d^2 = P_1^2 \\quad ({\\rm Wilson~ generator}) \\qquad {\\rm and} \\qquad P_d^2 = P_{n_B}^2 \\quad ({\\rm\n  Wegner~ generator}) \\; .\n\\end{eqnarray}\n\n\\noindent\nHowever, the trial wave function is peaked at the origin,\nwhich on the finite momentum grid corresponds to the lowest momentum\n$p_1$. Using the fact that all $P_n^2 >0$ with the exception of the\nbound-state we obtain\n\n\\begin{eqnarray}\n\\lim_{\\lambda \\to 0} E_d (\\lambda) &\\ge& \\frac{2}{\\pi} w_1 p_1^2\n\\frac{P_1^2}{M} \\phi_{\\rm rel,N} (p_1)^2 = -\\frac{\\gamma_d^2}{M}\n\\frac{w_1 p_1^2 e^{-p_1^2 b^2}}{\\sum_n w_n p_n^2 e^{-p_n^2 b^2}} \\to\n-\\frac{\\gamma_d^2}{M}\\qquad {\\rm (Wilson~ generator)} \\; , \\\\\n\\lim_{\\lambda \\to 0} E_d (\\lambda) &\\ge& \\frac{2}{\\pi} w_{n_B} p_{n_B}^2 \\frac{P_{n_B}^2}{M}\n\\phi_{\\rm rel,N} (p_{n_B})^2 = -\\frac{\\gamma_d^2}{M} \\frac{w_{n_B} p_{n_B}^2\n  e^{-p_{n_B}^2 b^2}}{\\sum_n w_n p_n^2 e^{-p_n^2 b^2}}\\to 0 \\qquad {\\rm (Wegner~ generator)} \\; .\n\\end{eqnarray}\n\n\\noindent\nOf course, this argument holds in the infrared limit $\\lambda \\to 0$~\\footnote{A\n  qualifying remark here becomes necessary: a distinction between the\n  infrared limit $\\lambda \\to 0^+$ and the value $\\lambda=0$ should be made as\n  we are dealing with variational wave functions.}. For finite\n$\\lambda$, as long as the bound-state is not either shifted or\nanchored at some fixed place, the behavior for both generators will not\nessentially differ.  The dramatic evolution of the potential can be more\nclearly seen by inspecting the sequence previously displayed. We\nsee that the jump in the Deuteron energy in the case of the Wegner generator is\ndirectly related to the crossing of the hamiltonian diagonal matrix-element corresponding to the bound-state. A similar argument for the variational shell-model calculations for the cases with $A=3$\nand $A=4$ yields the results\n\n\\begin{eqnarray}\n&&\\lim_{\\lambda \\to 0 } E_d(\\lambda) = -B_d \\, ,\\qquad\n\\lim_{\\lambda \\to 0 } E_t(\\lambda) = -\\frac32 B_d \\, , \\qquad\n  \\lim_{\\lambda \\to 0 } E_\\alpha (\\lambda) = - 3 B_d \\, , \\qquad {\\rm (Wilson~ generator)} \\; , \\\\\n&&\\lim_{\\lambda \\to 0 } E_d(\\lambda) = 0 \\, ,\\qquad \\quad\n\\lim_{\\lambda \\to 0 } E_t(\\lambda) = 0 \\, , \\qquad \\qquad\n  \\lim_{\\lambda \\to 0 } E_\\alpha (\\lambda) = 0\\, , \\qquad \\qquad {\\rm (Wegner~ generator)} \\; ,\n\\end{eqnarray}\n\n\\noindent\nwhich is checked by the numerical calculations as shown in\nFig.~\\ref{fig:binding}. Note that the\nonly contribution in the infrared limit $\\lambda \\to 0$ stems in this case from the two-body\nbound-state. The continuum contributions in both the $^1S_0$ and\n$^3S_1$ channels vanish.\n\nFor completeness, let us mention that as we evolve along the SRG\ntrajectory we also find linear correlations in two regimes\n\n\\begin{eqnarray}\n\\Delta B_\\alpha / \\Delta B_t \\sim 2 ~ ~ (\\lambda \\to 0)\n\\qquad {\\rm and} \\qquad\n\\Delta B_\\alpha / \\Delta B_t \\sim 4 ~ ~ (\\lambda \\sim 1) \\; .\n\\end{eqnarray}\n\n\\noindent\nThe corresponding Tjon-lines are depicted in Fig.~\\ref{fig:Tjon}.  The\ngap in the Wegner generator case can be clearly identified. We compare\nwith the asymptotic lines $E_\\alpha = 4 E_t - 3 E_d$ and $E_\\alpha = 2\nE_t$ which were identified in our previous work~\\cite{Arriola:2013gya}\ninvoking three-body forces. The extrapolation of this formula gives\n$B_\\alpha = 4 \\times 8.482 - 3 \\times 2.225 = 27.53~{\\rm MeV}$, while\nthe experimental value is $B_\\alpha^{\\rm exp} = 28.296 ~ {\\rm\n  MeV})$. As we see, the sharp intersection between the two lines\nhappens exactly at the SRG cutoff $\\lambda$ where the jumps in the\nbinding energies are observed in Fig.~\\ref{fig:binding}, which\ncorresponds to the critical values $E_t=3 E_d/2$ and $E_\\alpha=3\nE_d$. The phenomenon we observe resembles closely an avoided crossing\npattern, a phenomenon familiar from molecular physics in the\nBorn-Oppenheimer approximation~\\cite{landau2013quantum}, where the\nadiabatic parameter is the Triton binding-energy, $E_t$. As we see,\nthe variational calculation takes the minimal energy from the two\npossible branches in the Wilson generator case since the variational\n$(1s)^4$ state for the $\\alpha$-particle contains $dd$ states with\nopposite spin polarization at rest. Hence, the critical point\ncorresponds to the break up process $\\alpha \\to dd$.  As we see from\nFig.~\\ref{fig:Tjon}, this break-up component is absent in the Wegner\ngenerator case and one jumps to the free $4N$ state at rest at\n$\\lambda \\to 0$.\n\nOur results generate a Tjon-line, with a slope 4 for the SRG cutoff\nbelow $\\lambda \\sim 1 {\\rm fm}^{-1}$. We remind that this is the\nregime which so far remained unaccessible for realistic interactions,\nbasically due to numerical difficulties triggered by the long momentum\ntail of the potentials. Of course, while the generic features found here are expected\nto become universal as we approach the infrared, the accuracy of our\nresults regarding the specific implications for nuclear binding should\nbe tested, particularly since our solution is just a variational\napproximation. A thorough analysis of both the $A=3,4,16,40$ as well\nas neutron and nuclear matter extending preliminary results for\nrealistic potentials~\\cite{Arriola:2013nja} along the present lines\nwill be presented elsewhere.\n\n\n\n\n\n\n\n\n\n\\section{Summary, conclusions and outlook}\n\\label{sec:summary}\n\nThe SRG flow equations provide an example of an isospectral flow,\ni.e. a transformation which preserves the eigenvalues of the\nhamiltonian but rotates the eigenfunctions in such a way that\ntransition matrix elements are increasingly and exponentially\nsuppressed in the corresponding energy differences. This approach has\noffered new opportunities in Nuclear Physics as it allows the\npossibility of describing phase-equivalent interactions which\nconveniently become more diagonal. The practical implementation of the\nSRG approach usually requires a discretization in momentum space.\n\nOur analysis has therefore been performed on a finite momentum grid\nwhich makes the problem computationally manageable but also leads to\nspecific features related to the formulation of the scattering\nproblem. In particular two unitarily equivalent hamiltonians do not\nprovide the same phase-shifts obtained by the solution of the LS\nequation on the grid. Therefore, we have adopted the energy-shift\ndefinition of the discretized Hamiltonian suggested many years ago by\nLifschits and extensively developped by Kukulin {\\it et al.} in\nmore recent years within the context of the few-body problem. We have\nfound suitable formulas correctly incorporating Levinson's theorem. As\na by-product we have also deduced momentum grid based generalized trace\nidentities or finite energy sum rules put forward by Jaffe {\\it et\n  al.} on the basis of analyticity.\n\nThe energy-shift definition of the phase-shift is invariant along the\nSRG trajectory but for the case of different generators such as those of Wegner\nand Wilson the behaviour when approaching the infrared limit turns out\nto be significantly different when bound-states are present. For\n$N$-dimensional hamiltonians the SRG flow has always one unique stable\nfixed point. In the case of the Wilson generator there are $N!$ fixed\npoints for non-degenerate hamiltonians but only one is exponentially\nstable. In the case of the Wegner generator all $N!$ fixed points are\nstable.\n\nWith a simple toy model for the nuclear force, we explored the infrared\nlimit of the SRG evolution with both the Wilson and the Wegner generators.\nWhile the fixed point is the same for the two generators\nwhen no bound-state is supported by the interaction, we have two\ndistinct fixed points when a bound-state is allowed. The evolution\nwith the Wegner generator provides the correct behavior of the\ninteraction in the infrared limit $\\lambda \\to 0$ and defines an ordering of the\neigenvalues which can be used to compute the phase-shifts complying to\nLevinson's theorem without solving the scattering equation. We provide\na consistent prescription to shift the eigenvalues in order to obtain\nthe nuclear force in the infrared limit $\\lambda \\to 0$ and also to compute the\nphase-shifts from the eigenvalues with the correct behavior in both low-\nand high-momentum regions.\n\nEven though the ordering of states induced by the SRG evolution with the\nWegner generator make the phase-shift at low-momentum compliant to\nLevinson's theorem, there is an optimal ordering which gives the smoothest phase-shifts around the bound-state scale.  The optimal ordering corresponds to a shift of the eigenvalues below the bound-state scale\nwhile keeping the ascending order above it. The optimal value for the\nposition of the deuteron bound-state, which minimizes the RMS errors, seems to approach the characteristic deuteron momentum scale $\\gamma = 0.23~{\\rm fm}^{-1}$. Of course, it must be verified through explicit calculations if this a general result, which holds for any weakly or strongly coupled bound-state.\n\nWith the SRG evolution carried out towards $\\lambda \\to 0$, the difference\nbetween the $^1S_0$ and $^3S_1$ channels due to the Deuteron bound-state\ncan be seen very clearly. The infrared limit of the SRG evolution with\nthe Wilson generator actually corresponds to an ascending order for the\neigenvalues of the interaction, while the Wegner generator preserves the\nascending order only above the bound-state scale.\n\nWe have also analyzed the $A=3$ and $A=4$ systems within a simple\nharmonic oscillator scheme where the main differences between\ndifferent generators may be clearly appreciated as the critical scale\nis approached. There appear two branches $E_\\alpha= 4 E_t - 3 E_d$ and\n$E_\\alpha= 2 E_t $ and the system takes the lowest energy at any rate\namong all possible states contained in the trial wave function. Our\nresults generate a Tjon-line which matches the expression $E_\\alpha= 4\nE_t - 3 E_d$ found by invoking three-body forces in our previous work\nfor the SRG cutoff below $\\lambda \\sim 1 {\\rm fm}^{-1}$ (the factor 4\ncorresponds to 4 triplets)~\\cite{Arriola:2013gya}. We remind that this\nis the regime which so far remained unaccessible for realistic\ninteractions. The accuracy of the Tjon formula is rather satisfactory\nand a complementary investigation going beyond the simple variational\nansatz and including specifically many-body forces would be most\nilluminating. The application of the on-shell interactions to\nfew-nucleon systems, light nuclei and nuclear many-body problems\n(neutron and nuclear matter) for realistic interactions is beyond the\nscope of this work but is certainly an interesting study we will\npursue in forthcoming works on the light of the present findings.\n\n\n\\section*{Acknowledgements}\n\nE.R.A. would like to thank the Spanish Mineco (Grant FIS2014-59386-P) and\nJunta de Andalucia (grant FQM225).  S.S. and V.S.T. are supported by\nFAPESP (grant 2014/04975-9). V.S.T. also thanks FAEPEX (grant\n1165/2014) and CNPq (grant 310980/2012-7) for financial support.\n\n\\clearpage\n\n\\section*{References}\n\n\\begin{thebibliography}{10}\n\\expandafter\\ifx\\csname url\\endcsname\\relax\n  \\def\\url#1{\\texttt{#1}}\\fi\n\\expandafter\\ifx\\csname urlprefix\\endcsname\\relax\\def\\urlprefix{URL }\\fi\n\\expandafter\\ifx\\csname href\\endcsname\\relax\n  \\def\\href#1#2{#2} \n\\def\\path#1{#1}\\fi\n\n\n\\bibitem{Glazek:1993rc}\nS.~D. Glazek, K.~G. Wilson, {Renormalization of Hamiltonians}, Phys. Rev. D48\n  (1993) 5863--5872.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRevD.48.5863}\n  {\\path{doi:10.1103/PhysRevD.48.5863}}.\n\n\\bibitem{Glazek:1994qc}\nS.~D. Glazek, K.~G. Wilson, {Perturbative renormalization group for\n  Hamiltonians}, Phys. Rev. D49 (1994) 4214--4218.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRevD.49.4214}\n  {\\path{doi:10.1103/PhysRevD.49.4214}}.\n\n\\bibitem{wegner1994flow}\nF.~Wegner, {Flow-equations for Hamiltonians}, Annalen der physik 506~(2) (1994)\n  77--91.\n\n\\bibitem{Kehrein:2006ti}\nS.~Kehrein, {The flow equation approach to many-particle systems}, Springer,\n  2006.\n\n\\bibitem{Bogner:2006pc}\nS.~K. Bogner, R.~J. Furnstahl, R.~J. Perry, {Similarity Renormalization Group\n  for Nucleon-Nucleon Interactions}, Phys. Rev. C75 (2007) 061001.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0611045}\n  {\\path{arXiv:nucl-th/0611045}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.75.061001}\n  {\\path{doi:10.1103/PhysRevC.75.061001}}.\n\n\\bibitem{Bogner:2009bt}\nS.~K. Bogner, R.~J. Furnstahl, A.~Schwenk, {From low-momentum interactions to\n  nuclear structure}, Prog. Part. Nucl. Phys. 65 (2010) 94--147.\n\\newblock \\href {http://arxiv.org/abs/0912.3688} {\\path{arXiv:0912.3688}},\n  \\href {http://dx.doi.org/10.1016/j.ppnp.2010.03.001}\n  {\\path{doi:10.1016/j.ppnp.2010.03.001}}.\n\n\\bibitem{Furnstahl:2012fn}\nR.~Furnstahl, {The Renormalization Group in Nuclear Physics},\n  Nucl.Phys.Proc.Suppl. 228 (2012) 139--175.\n\\newblock \\href {http://arxiv.org/abs/1203.1779} {\\path{arXiv:1203.1779}},\n  \\href {http://dx.doi.org/10.1016/j.nuclphysbps.2012.06.005}\n  {\\path{doi:10.1016/j.nuclphysbps.2012.06.005}}.\n\n\\bibitem{Furnstahl:2013oba}\nR.~Furnstahl, K.~Hebeler, {New applications of renormalization group methods in\n  nuclear physics}, Rept.Prog.Phys. 76 (2013) 126301.\n\\newblock \\href {http://arxiv.org/abs/1305.3800} {\\path{arXiv:1305.3800}},\n  \\href {http://dx.doi.org/10.1088/0034-4885/76/12/126301}\n  {\\path{doi:10.1088/0034-4885/76/12/126301}}.\n\n\\bibitem{Wiringa:1994wb}\nR.~B. Wiringa, V.~Stoks, R.~Schiavilla, {An Accurate nucleon-nucleon potential\n  with charge independence breaking}, Phys.Rev. C51 (1995) 38--51.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/9408016}\n  {\\path{arXiv:nucl-th/9408016}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.51.38}\n  {\\path{doi:10.1103/PhysRevC.51.38}}.\n\n\\bibitem{Stoks:1994wp}\nV.~G.~J. Stoks, R.~A.~M. Klomp, C.~P.~F. Terheggen, J.~J. de~Swart,\n  {Construction of high quality N N potential models}, Phys. Rev. C49 (1994)\n  2950--2962.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/9406039}\n  {\\path{arXiv:nucl-th/9406039}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.49.2950}\n  {\\path{doi:10.1103/PhysRevC.49.2950}}.\n\n\\bibitem{Entem:2003ft}\nD.~R. Entem, R.~Machleidt, {Accurate Charge-Dependent Nucleon-Nucleon Potential\n  at Fourth Order of Chiral Perturbation Theory}, Phys. Rev. C68 (2003) 041001.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0304018}\n  {\\path{arXiv:nucl-th/0304018}}, \\href\n  {http://dx.doi.org/10.1103/PhysRevC.68.041001}\n  {\\path{doi:10.1103/PhysRevC.68.041001}}.\n\n\\bibitem{Epelbaum:2004fk}\nE.~Epelbaum, W.~Glockle, U.-G. Meissner, {The Two-nucleon system at\n  next-to-next-to-next-to-leading order}, Nucl.Phys. A747 (2005) 362--424.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0405048}\n  {\\path{arXiv:nucl-th/0405048}}, \\href\n  {http://dx.doi.org/10.1016/j.nuclphysa.2004.09.107}\n  {\\path{doi:10.1016/j.nuclphysa.2004.09.107}}.\n\n\\bibitem{Wendt:2013bla}\nK.~A. Wendt, {Similarity Renormalization Group Evolution of Three-Nucleon\n  Forces in a Hyperspherical Momentum Representation}, Phys.Rev. C87~(6) (2013)\n  061001.\n\\newblock \\href {http://arxiv.org/abs/1304.1431} {\\path{arXiv:1304.1431}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.87.061001}\n  {\\path{doi:10.1103/PhysRevC.87.061001}}.\n\n\\bibitem{Frederico:1999ps}\nT.~Frederico, V.~Timoteo, L.~Tomio, {Renormalization of the one pion exchange\n  interaction}, Nucl.Phys. A653 (1999) 209--221.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/9902052}\n  {\\path{arXiv:nucl-th/9902052}}, \\href\n  {http://dx.doi.org/10.1016/S0375-9474(99)00234-1}\n  {\\path{doi:10.1016/S0375-9474(99)00234-1}}.\n\n\\bibitem{Timoteo:2005ia}\nV.~Timoteo, T.~Frederico, A.~Delfino, L.~Tomio, {Recursive renormalization of\n  the singlet one-pion-exchange plus point-like interactions}, Phys.Lett. B621\n  (2005) 109--118.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0508006}\n  {\\path{arXiv:nucl-th/0508006}}, \\href\n  {http://dx.doi.org/10.1016/j.physletb.2005.06.044}\n  {\\path{doi:10.1016/j.physletb.2005.06.044}}.\n\n\\bibitem{Timoteo:2011mm}\nV.~Timoteo, T.~Frederico, A.~Delfino, L.~Tomio, {Nucleon-nucleon scattering\n  within a multiple subtractive renormalization approach}, Phys.Rev. C83 (2011)\n  064005.\n\\newblock \\href {http://arxiv.org/abs/1006.1942} {\\path{arXiv:1006.1942}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.83.064005}\n  {\\path{doi:10.1103/PhysRevC.83.064005}}.\n\n\\bibitem{Szpigel:2012bc}\nS.~Szpigel, V.~S. Timoteo, {Power counting and renormalization group invariance\n  in the subtracted kernel method for the two-nucleon system}, J.Phys. G39\n  (2012) 105102.\n\\newblock \\href {http://arxiv.org/abs/1112.5972} {\\path{arXiv:1112.5972}},\n  \\href {http://dx.doi.org/10.1088/0954-3899/39/10/105102}\n  {\\path{doi:10.1088/0954-3899/39/10/105102}}.\n\n\\bibitem{Szpigel:2011bj}\nS.~Szpigel, V.~S. Timoteo, F.~d.~O. Duraes, {Similarity Renormalization Group\n  Evolution of Chiral Effective Nucleon-Nucleon Potentials in the Subtracted\n  Kernel Method Approach}, Annals Phys. 326 (2011) 364--405.\n\\newblock \\href {http://arxiv.org/abs/1003.4663} {\\path{arXiv:1003.4663}},\n  \\href {http://dx.doi.org/10.1016/j.aop.2010.11.007}\n  {\\path{doi:10.1016/j.aop.2010.11.007}}.\n\n\\bibitem{Arriola:2013nja}\nE.~Ruiz~Arriola, V.~Timoteo, S.~Szpigel, {Nuclear Symmetries of the similarity\n  renormalization group for nuclear forces}, PoS CD12 (2013) 106.\n\\newblock \\href {http://arxiv.org/abs/1302.3978} {\\path{arXiv:1302.3978}}.\n\n\\bibitem{Timoteo:2012tt}\nV.~Timoteo, S.~Szpigel, E.~Ruiz~Arriola, {Symmetries of the Similarity\n  Renormalization Group for Nuclear Forces}, Phys.Rev. C86 (2012) 034002.\n\\newblock \\href {http://arxiv.org/abs/1108.1162} {\\path{arXiv:1108.1162}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.86.034002}\n  {\\path{doi:10.1103/PhysRevC.86.034002}}.\n\n\\bibitem{Arriola:2014aia}\nE.~Ruiz~Arriola, S.~Szpigel, V.~Timoteo, {The infrared limit of the Similarity\n  Renormalization Group evolution and Levinson's theorem}, Phys.Lett. B735\n  (2014) 149--156.\n\\newblock \\href {http://arxiv.org/abs/1404.4940} {\\path{arXiv:1404.4940}},\n  \\href {http://dx.doi.org/10.1016/j.physletb.2014.06.032}\n  {\\path{doi:10.1016/j.physletb.2014.06.032}}.\n\n\\bibitem{Ma:2006zzc}\nZ.-Q. Ma, {The Levinson theorem}, J.Phys. A39 (2006) R625--R659.\n\\newblock \\href {http://dx.doi.org/10.1088/0305-4470/39/48/R01}\n  {\\path{doi:10.1088/0305-4470/39/48/R01}}.\n\n\\bibitem{Arriola:2013gya}\nE.~Ruiz~Arriola, S.~Szpigel, V.~Timoteo, {Fixed points of the Similarity\n  Renormalization Group and the Nuclear Many-Body Problem}, Few Body Syst. 55\n  (2014) 971--975.\n\\newblock \\href {http://arxiv.org/abs/1310.8246} {\\path{arXiv:1310.8246}},\n  \\href {http://dx.doi.org/10.1007/s00601-014-0858-7}\n  {\\path{doi:10.1007/s00601-014-0858-7}}.\n\n\\bibitem{Delfino:2007zu}\nA.~Delfino, T.~Frederico, V.~S. Timoteo, L.~Tomio, {The Few scales of nuclei\n  and nuclear matter}, Phys. Lett. B634 (2006) 185.\n\\newblock \\href {http://arxiv.org/abs/0704.0481} {\\path{arXiv:0704.0481}},\n  \\href {http://dx.doi.org/10.1016/j.physletb.2006.01.046}\n  {\\path{doi:10.1016/j.physletb.2006.01.046}}.\n\n\\bibitem{Hammer:2012id}\nH.-W. Hammer, A.~Nogga, A.~Schwenk, {Three-body forces: From cold atoms to\n  nuclei}, Rev. Mod. Phys. 85 (2013) 197.\n\\newblock \\href {http://arxiv.org/abs/1210.4273} {\\path{arXiv:1210.4273}},\n  \\href {http://dx.doi.org/10.1103/RevModPhys.85.197}\n  {\\path{doi:10.1103/RevModPhys.85.197}}.\n\n\\bibitem{Arriola:2014tva}\nE.~Ruiz~Arriola, S.~Szpigel, V.~S. Timoteo, {Unitary neutron matter in the\n  on-shell limit}\\href {http://arxiv.org/abs/1412.2077}\n  {\\path{arXiv:1412.2077}}.\n\n\\bibitem{Arriola:2015hra}\nE.~Ruiz~Arriola, S.~Szpigel, V.~S. Timoteo, {The BCS pairing gap in the\n  on-shell limit of the Similarity Renormalization Group}\\href\n  {http://arxiv.org/abs/1507.02475} {\\path{arXiv:1507.02475}}.\n\n\\bibitem{Anderson:2008mu}\nE.~Anderson, et~al., {Block Diagonalization using SRG Flow Equations}, Phys.\n  Rev. C77 (2008) 037001.\n\\newblock \\href {http://arxiv.org/abs/0801.1098} {\\path{arXiv:0801.1098}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.77.037001}\n  {\\path{doi:10.1103/PhysRevC.77.037001}}.\n\n\\bibitem{Arriola:2013yca}\nE.~Ruiz~Arriola, S.~Szpigel, V.~S. Timoteo, {Implicit Versus Explicit\n  Renormalization of the $NN$ Force: An S-Wave Toy Model}, Few Body Syst. 55\n  (2014) 989--992.\n\\newblock \\href {http://arxiv.org/abs/1310.8526} {\\path{arXiv:1310.8526}},\n  \\href {http://dx.doi.org/10.1007/s00601-014-0811-9}\n  {\\path{doi:10.1007/s00601-014-0811-9}}.\n\n\\bibitem{Arriola:2013era}\nE.~Ruiz~Arriola, S.~Szpigel, V.~Timoteo, {Implicit vs Explicit Renormalization\n  and Effective Interactions}, Phys.Lett. B728 (2014) 596--601.\n\\newblock \\href {http://arxiv.org/abs/1307.1231} {\\path{arXiv:1307.1231}},\n  \\href {http://dx.doi.org/10.1016/j.physletb.2013.12.038}\n  {\\path{doi:10.1016/j.physletb.2013.12.038}}.\n\n\\bibitem{kukulin2009discrete}\nV.~I. Kukulin, V.~N. Pomerantsev, O.~A. Rubtsova, {Discrete representation of\n  the spectral shift function and the multichannel s-matrix}, JETP letters\n  90~(5) (2009) 402.\n\n\\bibitem{Rubtsova:2010zz}\nO.~Rubtsova, V.~Kukulin, V.~Pomerantsev, A.~Faessler, {New approach toward a\n  direct evaluation of the multichannel multienergy S matrix without solving\n  the scattering equations}, Phys.Rev. C81 (2010) 064003.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRevC.81.064003}\n  {\\path{doi:10.1103/PhysRevC.81.064003}}.\n\n\\bibitem{Pomerantsev:2014ija}\nV.~Pomerantsev, V.~Kukulin, O.~Rubtsova, {New general approach in few-body\n  scattering calculations: Solving discretized Faddeev equations on a graphics\n  processing unit}, Phys.Rev. C89~(6) (2014) 064008.\n\\newblock \\href {http://arxiv.org/abs/1404.5253} {\\path{arXiv:1404.5253}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.89.064008}\n  {\\path{doi:10.1103/PhysRevC.89.064008}}.\n\n\\bibitem{Rubtsova:2015owa}\nO.~A. Rubtsova, V.~I. Kukulin, V.~N. Pomerantsev, {Wave-packet continuum\n  discretization for quantum scattering}, Annals Phys. 360 (2015) 613--654.\n\\newblock \\href {http://arxiv.org/abs/1501.02531} {\\path{arXiv:1501.02531}},\n  \\href {http://dx.doi.org/10.1016/j.aop.2015.04.028}\n  {\\path{doi:10.1016/j.aop.2015.04.028}}.\n\n\\bibitem{Graham:2001iv}\nN.~Graham, R.~Jaffe, M.~Quandt, H.~Weigel, {Finite energy sum rules in\n  potential scattering}, Annals Phys. 293 (2001) 240.\n\\newblock \\href {http://arxiv.org/abs/quant-ph/0104136}\n  {\\path{arXiv:quant-ph/0104136}}, \\href\n  {http://dx.doi.org/10.1006/aphy.2001.6173}\n  {\\path{doi:10.1006/aphy.2001.6173}}.\n\n\\bibitem{Timoteo:2011tt}\nV.~S. Timoteo, S.~Szpigel, E.~R. Arriola, {Symmetries of the Similarity\n  Renormalization Group for Nuclear Forces}, Phys.Rev. C86 (2012) 034002.\n\\newblock \\href {http://arxiv.org/abs/1108.1162} {\\path{arXiv:1108.1162}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.86.034002}\n  {\\path{doi:10.1103/PhysRevC.86.034002}}.\n\n\\bibitem{Dainton:2013axa}\nB.~Dainton, R.~Furnstahl, R.~Perry, {Universality in Similarity Renormalization\n  Group Evolved Potential Matrix Elements and T-Matrix Equivalence}, Phys.Rev.\n  C89 (2014) 014001.\n\\newblock \\href {http://arxiv.org/abs/1310.6690} {\\path{arXiv:1310.6690}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.89.014001}\n  {\\path{doi:10.1103/PhysRevC.89.014001}}.\n\n\\bibitem{Jurgenson:2009}\nE.~D. Jurgenson, {Applications of the Similarity Renormalization Group to the\n  Nuclear Interaction, PhD Thesis}\\href {http://arxiv.org/abs/0912.2937}\n  {\\path{arXiv:0912.2937}}.\n\n\\bibitem{Bogner:2001gq}\nS.~K. Bogner, T.~T.~S. Kuo, A.~Schwenk, D.~R. Entem, R.~Machleidt, {Towards a\n  unique low momentum nucleon nucleon interaction}, Phys. Lett. B576 (2003)\n  265--272.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0108041}\n  {\\path{arXiv:nucl-th/0108041}}, \\href\n  {http://dx.doi.org/10.1016/j.physletb.2003.10.012}\n  {\\path{doi:10.1016/j.physletb.2003.10.012}}.\n\n\\bibitem{Li:2011sr}\nW.~Li, E.~Anderson, R.~Furnstahl, {The Similarity Renormalization Group with\n  Novel Generators}, Phys.Rev. C84 (2011) 054002.\n\\newblock \\href {http://arxiv.org/abs/1106.2835} {\\path{arXiv:1106.2835}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.84.054002}\n  {\\path{doi:10.1103/PhysRevC.84.054002}}.\n\n\\bibitem{Dicaire:2014fra}\nN.~M. Dicaire, C.~Omand, P.~Navratil, {Alternative similarity renormalization\n  group generators in nuclear structure calculations}, Phys.Rev. C90~(3) (2014)\n  034302.\n\\newblock \\href {http://arxiv.org/abs/1406.1815} {\\path{arXiv:1406.1815}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.90.034302}\n  {\\path{doi:10.1103/PhysRevC.90.034302}}.\n\n\\bibitem{Szpigel:2010bj}\nS.~Szpigel, V.~S. Timoteo, F.~O. Duraes, {Similarity Renormalization Group\n  Evolution of Chiral Effective Nucleon-Nucleon Potentials in the Subtracted\n  Kernel Method Approach}, Annals Phys. 326 (2011) 364.\n\\newblock \\href {http://arxiv.org/abs/1003.4663} {\\path{arXiv:1003.4663}},\n  \\href {http://dx.doi.org/10.1016/j.aop.2010.11.007}\n  {\\path{doi:10.1016/j.aop.2010.11.007}}.\n\n\\bibitem{Szpigel:1999gf}\nS.~Szpigel, R.~J. Perry, {Simple applications of effective field theory and\n  similarity renormalization group methods}\\href\n  {http://arxiv.org/abs/nucl-th/9906031} {\\path{arXiv:nucl-th/9906031}}.\n\n\\bibitem{Jones:2013cba}\nB.~D. Jones, R.~J. Perry, {Similarity flow of a neutral scalar coupled to a\n  fixed source}, ArXiv:nucl-th/1305.6599\\href {http://arxiv.org/abs/1305.6599}\n  {\\path{arXiv:1305.6599}}.\n\n\\bibitem{kolmogorov1999elements}\nA.~N. Kolmogorov, S.~Fomin, Elements of the theory of functions and functional\n  analysis, Vol.~1, Courier Corporation, 1999.\n\n\\bibitem{Weinberg:1963zza}\nS.~Weinberg, {Quasiparticles and the Born Series}, Phys.Rev. 131 (1963)\n  440--460.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRev.131.440}\n  {\\path{doi:10.1103/PhysRev.131.440}}.\n\n\\bibitem{Bogner:2006tw}\nS.~Bogner, R.~Furnstahl, S.~Ramanan, A.~Schwenk, {Convergence of the Born\n  series with low-momentum interactions}, Nucl.Phys. A773 (2006) 203--220.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/0602060}\n  {\\path{arXiv:nucl-th/0602060}}, \\href\n  {http://dx.doi.org/10.1016/j.nuclphysa.2006.05.004}\n  {\\path{doi:10.1016/j.nuclphysa.2006.05.004}}.\n\n\\bibitem{Perez:2014bua}\nR.~Navarro~P\\'erez, J.~Amaro, E.~Ruiz~Arriola, {Low energy chiral two pion\n  exchange potential with statistical uncertainties}, Phys.Rev. C91~(5) (2015)\n  054002.\n\\newblock \\href {http://arxiv.org/abs/1411.1212} {\\path{arXiv:1411.1212}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.91.054002}\n  {\\path{doi:10.1103/PhysRevC.91.054002}}.\n\n\\bibitem{demidovich1973computational}\nB.~P. Demidovich, I.~A. Maron, G.~Yankovsky, Computational mathematics, Mir\n  publishers Moscow, 1973.\n\n\\bibitem{Brockett1991}\nR.~W. Brockett, {Dynamical Systems That Sort Lists, Diagonalize Matrices and\n  Solve Linear Programming Problems}, Linear Algebra and Its Applications 146\n  (1991) 79--91.\n\n\\bibitem{Steele:1998un}\nJ.~V. Steele, R.~Furnstahl, {Regularization methods for nucleon-nucleon\n  effective field theory}, Nucl.Phys. A637 (1998) 46--62.\n\\newblock \\href {http://arxiv.org/abs/nucl-th/9802069}\n  {\\path{arXiv:nucl-th/9802069}}, \\href\n  {http://dx.doi.org/10.1016/S0375-9474(98)00219-X}\n  {\\path{doi:10.1016/S0375-9474(98)00219-X}}.\n\n\\bibitem{Stoks:1993tb}\nV.~G.~J. Stoks, R.~A.~M. Kompl, M.~C.~M. Rentmeester, J.~J. de~Swart, {Partial\n  wave analysis of all nucleon-nucleon scattering data below 350-MeV}, Phys.\n  Rev. C48 (1993) 792--815.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRevC.48.792}\n  {\\path{doi:10.1103/PhysRevC.48.792}}.\n\n\\bibitem{Perez:2013mwa}\nR.~Navarro~P\\'erez, J.~Amaro, E.~Ruiz~Arriola, {Partial Wave Analysis of\n  Nucleon-Nucleon Scattering below pion production threshold}, Phys.Rev.\n  C88~(6) (2013) 024002.\n\\newblock \\href {http://arxiv.org/abs/1304.0895} {\\path{arXiv:1304.0895}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.88.024002,\n  10.1103/PhysRevC.88.069902} {\\path{doi:10.1103/PhysRevC.88.024002,\n  10.1103/PhysRevC.88.069902}}.\n\n\\bibitem{Perez:2013jpa}\nR.~Navarro~P\\'erez, J.~Amaro, E.~Ruiz~Arriola, {Coarse-grained potential\n  analysis of neutron-proton and proton-proton scattering below the pion\n  production threshold}, Phys.Rev. C88~(6) (2013) 064002.\n\\newblock \\href {http://arxiv.org/abs/1310.2536} {\\path{arXiv:1310.2536}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.88.064002}\n  {\\path{doi:10.1103/PhysRevC.88.064002}}.\n\n\\bibitem{Perez:2013oba}\nR.~N. Perez, J.~Amaro, E.~R. Arriola, {Coarse grained NN potential with Chiral\n  Two Pion Exchange}, Phys.Rev. C89 (2014) 024004.\n\\newblock \\href {http://arxiv.org/abs/1310.6972} {\\path{arXiv:1310.6972}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.89.024004}\n  {\\path{doi:10.1103/PhysRevC.89.024004}}.\n\n\\bibitem{Perez:2014yla}\nR.~Navarro~Perez, J.~Amaro, E.~Ruiz~Arriola, {Statistical Error analysis of\n  Nucleon-Nucleon phenomenological potentials}, Phys.Rev. C89 (2014) 064006.\n\\newblock \\href {http://arxiv.org/abs/1404.0314} {\\path{arXiv:1404.0314}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.89.064006}\n  {\\path{doi:10.1103/PhysRevC.89.064006}}.\n\n\\bibitem{Glazek:2008pg}\nS.~D. Glazek, R.~J. Perry, {The impact of bound states on similarity\n  renormalization group transformations}, Phys. Rev. D78 (2008) 045011.\n\\newblock \\href {http://arxiv.org/abs/0803.2911} {\\path{arXiv:0803.2911}},\n  \\href {http://dx.doi.org/10.1103/PhysRevD.78.045011}\n  {\\path{doi:10.1103/PhysRevD.78.045011}}.\n\n\\bibitem{Wendt:2011qj}\nK.~A. Wendt, R.~J. Furnstahl, R.~J. Perry, {Decoupling of Spurious Deep Bound\n  States with the Similarity Renormalization Group}, Phys. Rev. C83 (2011)\n  034005.\n\\newblock \\href {http://arxiv.org/abs/1101.2690} {\\path{arXiv:1101.2690}},\n  \\href {http://dx.doi.org/10.1103/PhysRevC.83.034005}\n  {\\path{doi:10.1103/PhysRevC.83.034005}}.\n\n\\bibitem{Arriola:2014fqa}\nE.~Ruiz~Arriola, S.~Szpigel, V.~TimÃ³teo, {Implicit and explicit\n  renormalization: two complementary views of effective interactions}, Annals\n  Phys. 353 (2014) 129--149.\n\\newblock \\href {http://arxiv.org/abs/1407.8449} {\\path{arXiv:1407.8449}},\n  \\href {http://dx.doi.org/10.1016/j.aop.2014.11.010}\n  {\\path{doi:10.1016/j.aop.2014.11.010}}.\n\n\\bibitem{DeWitt:1956be}\nB.~S. DeWitt, {Transition from discrete to continuous spectra}, Phys.Rev. 103\n  (1956) 1565--1571.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRev.103.1565}\n  {\\path{doi:10.1103/PhysRev.103.1565}}.\n\n\\bibitem{Fukuda:1956zz}\nN.~Fukuda, R.~Newton, {Energy Level Shifts in a Large Enclosure}, Phys.Rev. 103\n  (1956) 1558--1564.\n\\newblock \\href {http://dx.doi.org/10.1103/PhysRev.103.1558}\n  {\\path{doi:10.1103/PhysRev.103.1558}}.\n\n\\bibitem{parisi1988statistical}\nG.~Parisi, Statistical field theory, Addison-Wesley, 1988.\n\n\\bibitem{muga1989stationary}\nJ.~Muga, R.~Levine, Stationary scattering theories, Physica Scripta 40~(2)\n  (1989) 129.\n\n\\bibitem{landau2013quantum}\nL.~D. Landau, E.~M. Lifshitz, Quantum mechanics: non-relativistic theory,\n  Vol.~3, Elsevier, 2013.\n\n\\end{thebibliography}\n\n\n", "itemtype": "equation", "pos": 112406, "prevtext": "\n\n\\noindent\nand\n\n", "index": 41, "text": "\\begin{equation}\n\\langle \\phi_{\\rm rel} |  V_{\\lambda} | \\phi_{\\rm rel} \\rangle \\to\n \\left(\\frac2{\\pi} \\right)^2 \\sum_{n,m} w_n w_m\n[p_n^2 \\phi_{\\rm rel,N} (p_n)]\n[p_m^2 \\phi_{\\rm rel,N} (p_m)] V_{nm}(\\lambda) \\; .\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E21.m1\" class=\"ltx_Math\" alttext=\"\\langle\\phi_{\\rm rel}|V_{\\lambda}|\\phi_{\\rm rel}\\rangle\\to\\left(\\frac{2}{\\pi}%&#10;\\right)^{2}\\sum_{n,m}w_{n}w_{m}[p_{n}^{2}\\phi_{\\rm rel,N}(p_{n})][p_{m}^{2}%&#10;\\phi_{\\rm rel,N}(p_{m})]V_{nm}(\\lambda)\\;.\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">⟨</mo><msub><mi>ϕ</mi><mi>rel</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi>V</mi><mi>λ</mi></msub><mo fence=\"true\" stretchy=\"false\">|</mo><msub><mi>ϕ</mi><mi>rel</mi></msub><mo stretchy=\"false\">⟩</mo></mrow><mo>→</mo><mrow><msup><mrow><mo>(</mo><mfrac><mn>2</mn><mi>π</mi></mfrac><mo>)</mo></mrow><mn>2</mn></msup><mo>⁢</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>n</mi><mo>,</mo><mi>m</mi></mrow></munder><mrow><msub><mi>w</mi><mi>n</mi></msub><mo>⁢</mo><msub><mi>w</mi><mi>m</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msubsup><mi>p</mi><mi>n</mi><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>rel</mi><mo>,</mo><mi mathvariant=\"normal\">N</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>n</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><msubsup><mi>p</mi><mi>m</mi><mn>2</mn></msubsup><mo>⁢</mo><msub><mi>ϕ</mi><mrow><mi>rel</mi><mo>,</mo><mi mathvariant=\"normal\">N</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>p</mi><mi>m</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msub><mi>V</mi><mrow><mi>n</mi><mo>⁢</mo><mi>m</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>λ</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]