[{"file": "1601.00278.tex", "nexttext": "\nwhere $\\gamma$ is the drag coefficient giving the deterministic friction force, and $\\bf \\eta$ is a stochastic noise term\ndescribing the random kicks from the medium constituents and satisfies\n\\begin{eqnarray}\n \\eta_i(t)\\eta_j(t')=\\kappa(T,p)\\delta_{ij}\\delta(t-t')\n\\end{eqnarray}\nin nonrelativistic case with $\\kappa$ being the momentum-space diffusion coefficient (mean-squared momentum transfer per\nunit time) or\n\\begin{eqnarray}\n \\eta_i(t)\\eta_j(t')=[\\kappa_L \\hat p^i \\hat p^j +\\kappa_T(\\delta_{ij}-\\hat p^i \\hat p^j)]\\delta(t-t')\n\\end{eqnarray}\nin relativistic case with $\\kappa_{L/T}$ being the\nlongitudinal and transverse momentum-space diffusion coefficients. One can decompose $\\bf \\eta$ into $\\eta_L$ and $\\eta_T$ representing random momentum kicks in\nlongitudinal and transverse direction with respect to the heavy quark motion.\n\nIn a generalized version of the Langevin approach, energy loss due to the medium-induced gluon radiation is included by adding a\nrecoil force~\\cite{cao}\n\n", "itemtype": "equation", "pos": 5680, "prevtext": "\n\n\n\\begin{frontmatter}\n\n\n\\dochead{}\n\n\\title{Heavy Quark and Quarkonium Transport in High Energy Nuclear Collisions}\n\n\\author{Kai Zhou$^{1,2,3}$, Wei Dai$^1$, Nu Xu$^{4,5}$, and Pengfei Zhuang$^1$}\n\n\n\\address{$^1$ Physics Department, Tsinghua University and Collaborative Innovation Center of Quantum Matter, Beijing 100084, China\\\\\n         $^2$ Institute for Theoretical Physics, Johann Wolfgang Goethe-University, Max-von-Laue-Str. 1, D-60438 Frankfurt am Main, Germany\\\\\n         $^3$ Frankfurt Institute for Advanced Studies, Ruth-Moufang-Str. 1, D-60438 Frankfurt am Main, Germany\\\\\n         $^4$ Nuclear Science Division, Lawrence Berkeley National Laboratory, Berkeley, CA 94720, USA\\\\\n         $^5$ Key Laboratory of Quark and Lepton Physics (MOE) and Institute of Particle Physics, Central China Normal University, Wuhan 430079, China}\n\n\\begin{abstract}\nThe strong interaction between heavy quarks and the quark gluon plasma makes the open and hidden charm hadrons be sensitive probes of the deconfinement phase transition in high energy nuclear collisions. Both the cold and hot nuclear matter effects change with the colliding energy and significantly influence the heavy quark and charmonium yield and their transverse momentum distributions. The ratio of averaged quarkonium transverse\nmomentum square and the elliptic flow reveal the nature of the QCD medium created in heavy ion collisions at SPS, RHIC and LHC energies.\n\\end{abstract}\n\n\\begin{keyword}\nHeavy Flavor, Quarkonium, Transport, Nuclear Collision, Quark Gluon Plasma\n\\end{keyword}\n\n\n\\end{frontmatter}\n\n\n\n\\section{Introduction}\n\\label{s1}\n\nThe strongly interacting Quantum Chromodynamics (QCD) system is expected\nto experience a phase transition from hadronic matter to a new state of partonic matter, the so called quark-gluon plasma (QGP).\nThe existence of the partonic phase has been well established in $\\sqrt{s_{NN}}$= 200 GeV Au+Au collisions at\nRHIC as well as in $\\sqrt{s_{NN}}$= 2.76 TeV Pb+Pb collisions at LHC. The study of high energy nuclear collisions\nhas entered a new era where current physics programs at both RHIC and LHC focus on the properties of the new form\nof matter and how the hot matter undergoes the deconfinement transition. Since the new state of matter can exist only in the early stage of the collisions and cannot be directly observed in the final state, one needs sensitive probes to demonstrate the formation of the new state. Heavy flavor hadrons, including open and hidden charm or beauty hadrons, are widely considered as such probes. Different from light hadrons which are constructed from the constituents of the hot matter on the phase transition hypersurface and carry the collective properties of the matter, heavy quarks are mainly produced through hard processes in the initial\nstage of the collisions, due to their large masses compared to the scale of QCD and the temperature of the medium. Then the initially produced quarkonia and the rest of the heavy quarks will pass through the whole medium and carry its properties in the final state.\nBy comparing the open charm production in A+A collisions with that in elementary p+p collisions, we can extract\ninformation about the energy loss of heavy quarks\nduring their propagation through the hot medium. On the other hand, due to\ncolor screening at finite temperature and density, quarkonium suppression in nuclear collisions has\nbeen proposed to provide an unambiguous signature of QGP formation.\n\n\n\\section{Heavy Quark Transport}\n\\label{s2}\n\nIn high energy nuclear collisions, heavy quarks are investigated through measuring the decay products of open heavy mesons, like pions and kaons, or semi-leptonic\ndecay electrons and muons, or reconstructed non-prompt charmonia from $B$ decay. Due to the large mass, one would intuitively expect that, heavy quarks can hardly participate the medium collective motion and their thermalization should be difficult in comparison with light quarks. However, at both RHIC and LHC heavy quarks follow availably the flow\nof the medium and possess a large elliptic flow $v_2$. This discovery indicates an extremely strong interaction between heavy quarks and the hot and dense medium, especially near the hadronization time when the collective flow of the bulk medium has already built up.\nAt the moment, what is the exact mechanism of the in-medium interaction of heavy quarks is still an open question and extensively studied\nin both perturbative and nonperturbative approaches. For very hard heavy quarks with $p_T\\gg m_Q$, the medium induced gluon radiation is expected to dominate the energy loss mechanism, since there should be no big difference between\nheavy and light quarks in ultra-relativistic domain where quark mass is negligible. Due to the dead cone effect induced by the large\nmass scale at small or intermediate $p_T$ range, the radiative process is reduced and the collisional energy loss\nis invoked.\n\nIn the hot QCD medium, the typical momentum transfer in heavy quark interactions is of the order of the Debye mass $m_D\\sim gT$. At the\ncurrent colliding energies, it is smaller than the heavy quark mass (strictly speaking, the thermal momentum), a Fokker-Planck approach\nor Langevin approach is then suitable to treat the Brown motion of heavy quarks in medium, which can be deduced from the corresponding Boltzmann\nequation without mean field interaction, see for instance Ref.~\\cite{svetitsky} for details. In such stochastic treatment, the heavy quark in-medium interaction and the medium properties are encoded in the equation through the transport coefficients. In the Langevin approach, the three-momentum of an individual heavy quark evolves as\n\n", "index": 1, "text": "\\begin{equation}\n \\frac{d{\\bf p}}{dt}=-\\gamma(T,p){\\bf p}+{\\bf \\eta}(t),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\frac{d{\\bf p}}{dt}=-\\gamma(T,p){\\bf p}+{\\bf\\eta}(t),\" display=\"block\"><mrow><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>𝐩</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mi>γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>𝐩</mi></mrow></mrow><mo>+</mo><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nwith ${\\bf \\mathnormal{f}_g}=-d{\\bf p}_g/dt$, and the momentum of radiated gluons are sampled according to the gluon radiation spectrum\nevaluated from pQCD higher twist calculation. To effectively introduce a balance between the gluon radiation and the inverse\nabsorption, a lower cut-off ($\\pi T$) is set in the gluon radiation spectrum.\n\nTo ensure the thermal equilibrium in the limit of long time evolution, the drag coefficient $\\gamma$\nshould be related to the momentum diffusion coefficient $\\kappa$ (or $\\kappa_{L/T}$ in relativistic case) through\ngeneralized Einstein fluctuation-dissipation relation. In the case of weak coupling, the momentum\ndiffusion can be calculated in the frame of perturbative QCD at different levels, for instance at the leading order~\\cite{svetitsky}, leading order with hard thermal loop resummation~\\cite{moore,alberico}, next to leading order~\\cite{huot}, and leading order with hard thermal loop resummation and running coupling~\\cite{peigne,gossiaux,uphoff}. For nonperturbative diffusion coefficient in strong coupling, there are calculations from lattice QCD simulation~\\cite{banerjee}, thermodynamic T-matrix\napproach~\\cite{riek}, AdS/CFT correspondence~\\cite{gubser} and the semi-Quark-Gluon Monopole Plasma (sQGMP)\nscheme~\\cite{xu}. To describe simultaneously the nuclear modification factor $R_{AA}$ and elliptic flow $v_2$ of open heavy mesons,\nthe drag coefficient in the Langevin approach needs to have a strong enhancement around the critical temperature $T_c$. The sQGMP model\npresents a consistent framework showing both soft bulk viscous and hard jet quenching with a smooth crossover from perturbative region\nto nonperturbative region. The enhancement around $T_c$ for $\\hat q/T^3$ and dropping off for $\\eta/s$ are mainly due to the emergence of color-magnetic monopoles near $T_c$\nwhich are the pertinent degrees of freedom with\nlong wavelength probably assuring the confinement transition. However, only the high $p_T$ heavy flavors can be described in\nthis framework. For the low $p_T$ part, the coalescence mechanism for a heavy quark to statistically pick up a light quark on the hadronization hyper surface can also contribute to the large\ncollective flow.\n\nFrom the lattice QCD simulation~\\cite{kaczmarek3}, there is a very large additional entropy around $T_c$ associated with\na heavy quark pair and it increases with the heavy quark distance in some range, reflecting an entanglement\nbetween the heavy quark and the medium which induces numerous states for the heavy quark pair. Focusing on heavy quarks\n(or considering long distance limit for heavy quark pairs), this indicates that, heavy quarks are strongly\ncoupled to the medium, especially near $T_c$. Phenomenologically, a hybrid treatment to separate the heavy quark evolution into two steps according to the temperature of the medium and take into account\nthe strong interaction near $T_c$ would be helpful to understand the heavy quark motion in QGP.\n\n\n\\section{Heavy Quark Potential}\n\\label{s3}\n\nWe now discuss the potential between a pair of heavy quark and anti-quark which is a traditional observable for understanding the QCD confinement. The often used non-relativistic Cornell potential~\\cite{koma} in vacuum contains a Coulomb part ($\\sim 1/r$) and a linear term ($\\sim \\sigma r$), the former is significant at small separation and the latter becomes dominant at large distance. The Cornell potential describes well the quarkonium spectroscopy in vacuum and thus provides a well-defined background to further test the medium effects at finite temperature and density. From the microscopic QCD theory itself, the Cornell potential can be understood\nusing the effective field theories NRQCD and pNRQCD in $1/m_Q$ expansion~\\cite{barchielli}, where $m_Q$ is the heavy quark mass. When we put the heavy quark pair into a\nQGP phase, the color screening will limit the range of the attractive binding force between the two quarks. When the screening radius $r_D$, which is inversely proportional to the temperature of the QGP, becomes smaller than the bound state radius, the pair will melt into the medium~\\cite{matsui}. This inspires the sequential melting scenario that the quarkonium states with different binding energy have different melting temperature and disappear in the hot medium sequentially. The experiment data on $\\Upsilon$ suppression at RHIC~\\cite{star} and excited states at LHC~\\cite{cms}\nsupport the sequential melting scenario.\n\nAt finite temperature, based on the Euclidean correlator of the Polyakov loops, the static heavy\nquark free energy $F(T,r)$ is calculated in lattice QCD in quenched~\\cite{kaczmarek1} and (2+1)-flavor QCD case~\\cite{kaczmarek2}, from which the internal energy\n$U(T,r)$ can be derived through thermodynamic relations,\n\n", "itemtype": "equation", "pos": 6763, "prevtext": "\nwhere $\\gamma$ is the drag coefficient giving the deterministic friction force, and $\\bf \\eta$ is a stochastic noise term\ndescribing the random kicks from the medium constituents and satisfies\n\\begin{eqnarray}\n \\eta_i(t)\\eta_j(t')=\\kappa(T,p)\\delta_{ij}\\delta(t-t')\n\\end{eqnarray}\nin nonrelativistic case with $\\kappa$ being the momentum-space diffusion coefficient (mean-squared momentum transfer per\nunit time) or\n\\begin{eqnarray}\n \\eta_i(t)\\eta_j(t')=[\\kappa_L \\hat p^i \\hat p^j +\\kappa_T(\\delta_{ij}-\\hat p^i \\hat p^j)]\\delta(t-t')\n\\end{eqnarray}\nin relativistic case with $\\kappa_{L/T}$ being the\nlongitudinal and transverse momentum-space diffusion coefficients. One can decompose $\\bf \\eta$ into $\\eta_L$ and $\\eta_T$ representing random momentum kicks in\nlongitudinal and transverse direction with respect to the heavy quark motion.\n\nIn a generalized version of the Langevin approach, energy loss due to the medium-induced gluon radiation is included by adding a\nrecoil force~\\cite{cao}\n\n", "index": 3, "text": "\\begin{equation}\n \\frac{d{\\bf p}}{dt}=-\\gamma(T,p){\\bf p}+{\\bf \\eta}(t)+\\bf \\mathnormal{f}_g\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\frac{d{\\bf p}}{dt}=-\\gamma(T,p){\\bf p}+{\\bf\\eta}(t)+\\bf\\mathnormal{f}_{g}\" display=\"block\"><mrow><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>𝐩</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo>=</mo><mrow><mrow><mo>-</mo><mrow><mi>γ</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>p</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mi>𝐩</mi></mrow></mrow><mo>+</mo><mrow><mi>η</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>t</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><msub><mi>f</mi><mi>𝐠</mi></msub></mrow></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nwhere the difference between $F$ and $U$ is the entropy $S(T,r)=-\\partial F/\\partial T$ associated with the heavy quark pair.\nThe free energy from lattice simulation shows a saturation at large distance $r$ and finite temperature $T$, which is compatible with the\nDebye screening expectation for heavy quark interaction. The question is what is the relation between the lattice calculated free energy and the heavy quark potential $V(T,r)$ which controls the quarkonium dissociation. By solving the Schroedinger equation for the heavy quark pair, the dissociation temperature for $J/\\psi$ in the limit of $V=F$ is $T_{J/\\psi}\\simeq 1.2 T_c$ with $T_c$ being the critical temperature of the deconfinement phase transition, while in the other limit of $V=U$ $J/\\psi$s can survive in the\ndeconfined plasma up to the temperature $T_{J/\\psi}\\simeq 2.1 T_c$, showing a much more strong binding. Phenomenologically, the comparison between a model calculation and the experimental data on excited $\\Upsilon$ states is\nsensitive to the choice of the heavy quark potential~\\cite{liu}. On the other hand, based on the directly\ncalculated quarkonium correlator $G(r,\\tau)$ from lattice QCD, the in-medium quarkonium spectrum can be evaluated\nby the Maximum Entropy Method (with still a large uncertainty in the reconstruction), and the dissociation temperature can\nbe estimated from the disappearance of the peak of the spectral function. For $J/\\psi$, the melting point is located at $T_{J/\\psi}\\simeq 1.5 T_c$ from the recent hot QCD simulation~\\cite{ding}.\n\nOne should note that the above potential analysis assumes the medium to be stable and isotropic. However, in a realistic heavy ion collision,\ndue to the fast expansion and non-zero viscosity of the system, the produced medium would exhibit a local anisotropy in momentum space. Stronger\nattraction is found to be aligned along the longitudinal direction in an anisotropic medium~\\cite{dumitru},\nwhich will enhance the quarkonium surviving temperature compared to the isotropic case. The relativistic correction\nto the potential model will also enhance the $J/\\psi$ dissociation temperature by $7\\% - 13\\%$ depending on the choice of the potential~\\cite{guo}.\n\nApart from the screening of the attractive binding between heavy quarks, the bound states would also suffer a scattering\ndissociation by the medium constituents, which is not captured by the above analysis and should manifest as a thermal\nwidth in the spectral function. From thermal field theory, a static heavy quark potential at finite temperature is recently evaluated by\nFourier transformation of the hard thermal loop resumed gluon propagator~\\cite{laine}. Due to the complexity of the\ngluon self energy, an imaginary part is automatically developed for the heavy quark potential at $T\\gg 1/r\\sim m_D$,\n\n", "itemtype": "equation", "pos": 11663, "prevtext": "\nwith ${\\bf \\mathnormal{f}_g}=-d{\\bf p}_g/dt$, and the momentum of radiated gluons are sampled according to the gluon radiation spectrum\nevaluated from pQCD higher twist calculation. To effectively introduce a balance between the gluon radiation and the inverse\nabsorption, a lower cut-off ($\\pi T$) is set in the gluon radiation spectrum.\n\nTo ensure the thermal equilibrium in the limit of long time evolution, the drag coefficient $\\gamma$\nshould be related to the momentum diffusion coefficient $\\kappa$ (or $\\kappa_{L/T}$ in relativistic case) through\ngeneralized Einstein fluctuation-dissipation relation. In the case of weak coupling, the momentum\ndiffusion can be calculated in the frame of perturbative QCD at different levels, for instance at the leading order~\\cite{svetitsky}, leading order with hard thermal loop resummation~\\cite{moore,alberico}, next to leading order~\\cite{huot}, and leading order with hard thermal loop resummation and running coupling~\\cite{peigne,gossiaux,uphoff}. For nonperturbative diffusion coefficient in strong coupling, there are calculations from lattice QCD simulation~\\cite{banerjee}, thermodynamic T-matrix\napproach~\\cite{riek}, AdS/CFT correspondence~\\cite{gubser} and the semi-Quark-Gluon Monopole Plasma (sQGMP)\nscheme~\\cite{xu}. To describe simultaneously the nuclear modification factor $R_{AA}$ and elliptic flow $v_2$ of open heavy mesons,\nthe drag coefficient in the Langevin approach needs to have a strong enhancement around the critical temperature $T_c$. The sQGMP model\npresents a consistent framework showing both soft bulk viscous and hard jet quenching with a smooth crossover from perturbative region\nto nonperturbative region. The enhancement around $T_c$ for $\\hat q/T^3$ and dropping off for $\\eta/s$ are mainly due to the emergence of color-magnetic monopoles near $T_c$\nwhich are the pertinent degrees of freedom with\nlong wavelength probably assuring the confinement transition. However, only the high $p_T$ heavy flavors can be described in\nthis framework. For the low $p_T$ part, the coalescence mechanism for a heavy quark to statistically pick up a light quark on the hadronization hyper surface can also contribute to the large\ncollective flow.\n\nFrom the lattice QCD simulation~\\cite{kaczmarek3}, there is a very large additional entropy around $T_c$ associated with\na heavy quark pair and it increases with the heavy quark distance in some range, reflecting an entanglement\nbetween the heavy quark and the medium which induces numerous states for the heavy quark pair. Focusing on heavy quarks\n(or considering long distance limit for heavy quark pairs), this indicates that, heavy quarks are strongly\ncoupled to the medium, especially near $T_c$. Phenomenologically, a hybrid treatment to separate the heavy quark evolution into two steps according to the temperature of the medium and take into account\nthe strong interaction near $T_c$ would be helpful to understand the heavy quark motion in QGP.\n\n\n\\section{Heavy Quark Potential}\n\\label{s3}\n\nWe now discuss the potential between a pair of heavy quark and anti-quark which is a traditional observable for understanding the QCD confinement. The often used non-relativistic Cornell potential~\\cite{koma} in vacuum contains a Coulomb part ($\\sim 1/r$) and a linear term ($\\sim \\sigma r$), the former is significant at small separation and the latter becomes dominant at large distance. The Cornell potential describes well the quarkonium spectroscopy in vacuum and thus provides a well-defined background to further test the medium effects at finite temperature and density. From the microscopic QCD theory itself, the Cornell potential can be understood\nusing the effective field theories NRQCD and pNRQCD in $1/m_Q$ expansion~\\cite{barchielli}, where $m_Q$ is the heavy quark mass. When we put the heavy quark pair into a\nQGP phase, the color screening will limit the range of the attractive binding force between the two quarks. When the screening radius $r_D$, which is inversely proportional to the temperature of the QGP, becomes smaller than the bound state radius, the pair will melt into the medium~\\cite{matsui}. This inspires the sequential melting scenario that the quarkonium states with different binding energy have different melting temperature and disappear in the hot medium sequentially. The experiment data on $\\Upsilon$ suppression at RHIC~\\cite{star} and excited states at LHC~\\cite{cms}\nsupport the sequential melting scenario.\n\nAt finite temperature, based on the Euclidean correlator of the Polyakov loops, the static heavy\nquark free energy $F(T,r)$ is calculated in lattice QCD in quenched~\\cite{kaczmarek1} and (2+1)-flavor QCD case~\\cite{kaczmarek2}, from which the internal energy\n$U(T,r)$ can be derived through thermodynamic relations,\n\n", "index": 5, "text": "\\begin{equation}\nU(T,r)=F(T,r)-T\\frac{\\partial F}{\\partial T}=F(T,r)+TS(T,r),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"U(T,r)=F(T,r)-T\\frac{\\partial F}{\\partial T}=F(T,r)+TS(T,r),\" display=\"block\"><mrow><mrow><mrow><mi>U</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>T</mi><mo>⁢</mo><mfrac><mrow><mo>∂</mo><mo>⁡</mo><mi>F</mi></mrow><mrow><mo>∂</mo><mo>⁡</mo><mi>T</mi></mrow></mfrac></mrow></mrow><mo>=</mo><mrow><mrow><mi>F</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>+</mo><mrow><mi>T</mi><mo>⁢</mo><mi>S</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>T</mi><mo>,</mo><mi>r</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nwhere $m_D$ is the gluon Debye screening mass. This imaginary part smears the spectral peaks and leads to\na finite thermal width reflecting the thermal medium effects,\n\n", "itemtype": "equation", "pos": 14574, "prevtext": "\nwhere the difference between $F$ and $U$ is the entropy $S(T,r)=-\\partial F/\\partial T$ associated with the heavy quark pair.\nThe free energy from lattice simulation shows a saturation at large distance $r$ and finite temperature $T$, which is compatible with the\nDebye screening expectation for heavy quark interaction. The question is what is the relation between the lattice calculated free energy and the heavy quark potential $V(T,r)$ which controls the quarkonium dissociation. By solving the Schroedinger equation for the heavy quark pair, the dissociation temperature for $J/\\psi$ in the limit of $V=F$ is $T_{J/\\psi}\\simeq 1.2 T_c$ with $T_c$ being the critical temperature of the deconfinement phase transition, while in the other limit of $V=U$ $J/\\psi$s can survive in the\ndeconfined plasma up to the temperature $T_{J/\\psi}\\simeq 2.1 T_c$, showing a much more strong binding. Phenomenologically, the comparison between a model calculation and the experimental data on excited $\\Upsilon$ states is\nsensitive to the choice of the heavy quark potential~\\cite{liu}. On the other hand, based on the directly\ncalculated quarkonium correlator $G(r,\\tau)$ from lattice QCD, the in-medium quarkonium spectrum can be evaluated\nby the Maximum Entropy Method (with still a large uncertainty in the reconstruction), and the dissociation temperature can\nbe estimated from the disappearance of the peak of the spectral function. For $J/\\psi$, the melting point is located at $T_{J/\\psi}\\simeq 1.5 T_c$ from the recent hot QCD simulation~\\cite{ding}.\n\nOne should note that the above potential analysis assumes the medium to be stable and isotropic. However, in a realistic heavy ion collision,\ndue to the fast expansion and non-zero viscosity of the system, the produced medium would exhibit a local anisotropy in momentum space. Stronger\nattraction is found to be aligned along the longitudinal direction in an anisotropic medium~\\cite{dumitru},\nwhich will enhance the quarkonium surviving temperature compared to the isotropic case. The relativistic correction\nto the potential model will also enhance the $J/\\psi$ dissociation temperature by $7\\% - 13\\%$ depending on the choice of the potential~\\cite{guo}.\n\nApart from the screening of the attractive binding between heavy quarks, the bound states would also suffer a scattering\ndissociation by the medium constituents, which is not captured by the above analysis and should manifest as a thermal\nwidth in the spectral function. From thermal field theory, a static heavy quark potential at finite temperature is recently evaluated by\nFourier transformation of the hard thermal loop resumed gluon propagator~\\cite{laine}. Due to the complexity of the\ngluon self energy, an imaginary part is automatically developed for the heavy quark potential at $T\\gg 1/r\\sim m_D$,\n\n", "index": 7, "text": "\\begin{equation}\nV_{HTL}(r\\sim\\frac{1}{m_D})=-\\frac{4}{3}\\frac{\\alpha_s}{r}(e^{-m_D r}+m_D)+i\\frac{8}{3}\\alpha_sT\\int_0^{\\infty}dt(1-\\frac{sin(m_D r t)}{m_D r t})\\frac{t}{(t^2+1)^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"V_{HTL}(r\\sim\\frac{1}{m_{D}})=-\\frac{4}{3}\\frac{\\alpha_{s}}{r}(e^{-m_{D}r}+m_{%&#10;D})+i\\frac{8}{3}\\alpha_{s}T\\int_{0}^{\\infty}dt(1-\\frac{sin(m_{D}rt)}{m_{D}rt})%&#10;\\frac{t}{(t^{2}+1)^{2}},\" display=\"block\"><mrow><msub><mi>V</mi><mrow><mi>H</mi><mo>⁢</mo><mi>T</mi><mo>⁢</mo><mi>L</mi></mrow></msub><mrow><mo stretchy=\"false\">(</mo><mi>r</mi><mo>∼</mo><mfrac><mn>1</mn><msub><mi>m</mi><mi>D</mi></msub></mfrac><mo stretchy=\"false\">)</mo></mrow><mo>=</mo><mo>-</mo><mfrac><mn>4</mn><mn>3</mn></mfrac><mfrac><msub><mi>α</mi><mi>s</mi></msub><mi>r</mi></mfrac><mrow><mo stretchy=\"false\">(</mo><msup><mi>e</mi><mrow><mo>-</mo><mrow><msub><mi>m</mi><mi>D</mi></msub><mo>⁢</mo><mi>r</mi></mrow></mrow></msup><mo>+</mo><msub><mi>m</mi><mi>D</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>+</mo><mi>i</mi><mfrac><mn>8</mn><mn>3</mn></mfrac><msub><mi>α</mi><mi>s</mi></msub><mi>T</mi><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi mathvariant=\"normal\">∞</mi></msubsup><mi>d</mi><mi>t</mi><mrow><mo stretchy=\"false\">(</mo><mn>1</mn><mo>-</mo><mfrac><mrow><mi>s</mi><mo>⁢</mo><mi>i</mi><mo>⁢</mo><mi>n</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>m</mi><mi>D</mi></msub><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>t</mi></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><msub><mi>m</mi><mi>D</mi></msub><mo>⁢</mo><mi>r</mi><mo>⁢</mo><mi>t</mi></mrow></mfrac><mo stretchy=\"false\">)</mo></mrow><mfrac><mi>t</mi><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msup><mi>t</mi><mn>2</mn></msup><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mfrac><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nwith $\\Psi$ being the in-medium charmonium wave function. The underlying physics of this finite width is interpreted as the Landau damping of the low frequency gauge field. In terms of the nonrelativistic field theory pNRQCD,\nthe heavy quark potential is evaluated, and an additional color singlet-to-octet thermal break-up mechanism is found to\ncontribute to the quarkonium thermal width~\\cite{brambilla}, especially in the temperature range where $m_D$ is smaller than the binding\nenergy. Motivated by the effective field theory calculation, a lattice regularized QCD simulation based on NRQCD Lagrangian\nis recently performed~\\cite{burnier1}. The heavy quark potential is extracted from the simulated spectral function,\nwhere the spectral peak and width are respectively related to the real and imaginary part of the potential. It shows\nthat, the imaginary part of the potential $\\text{Im} V$ is compatible with the perturbative result~\\cite{laine}, and\nthe real part $\\text{Re} V$ from HotQCD collaboration with $N_f=2+1$ flavors is closer to the free energy $F$.\nBy parameterizing the potential in a generalized Gauss law approach and putting it into the Schroedinger equation, the\ndissociation temperature for $J/\\psi$ is $T_{J/\\psi}\\simeq 1.37 T_c$~\\cite{burnier2}.\n\nTo understand the lattice QCD result from a point of view of many-body physics, a non-perturbative T-matrix approach is\ndeveloped~\\cite{mannarelli}. In this approach, by fitting the lattice calculated free energy, the heavy quark\npotential is recently evaluated~\\cite{liu2} by taking a diagrammatic treatment through defining the potential within a\nscattering equation. The extracted potential is found to be in between the free energy $F$ and the internal energy $U$ but very close\nto $U$. Interestingly, the derivative of the complex potential, namely the binding force between the two heavy quarks, is stronger than both\nfrom free energy and internal energy, implying a remnant confining string tension in the medium related with a long-range\ncorrelation.\n\nSince the produced QGP in heavy ion collisions expands rapidly and thus cools down fast, the potential analysis might not\nbe valid, because the heavy quark pair would hardly keep in a fixed eigenstate of the evolving Hamiltonian of the heavy quark system. Even further, whether a separate treatment for quarkonium evolution by taking the QGP only as a background really works is somehow questionable. Due to the large entropy associated to a quarkonium in medium observed in lattice QCD ~\\cite{kaczmarek3}, especially near $T_c$, the entropic force~\\cite{kharzeev} induced coupling between medium constituent and heavy quarks might be stronger than the binding between the two heavy quarks. This makes\nthe treatment of the heavy quark bound state as an color neutral entity unjustifiable, it should be influenced by the surrounding medium, since\neach heavy quark in the bound state is strongly entangled with the medium. An entropic self-destruction scenario is proposed and results in a stronger dissociation around the critical temperature $T_c$. Taking into account the entropic force, the quarkonium binding potential is argued to\nbe the free energy $F$~\\cite{satz}, since the extra binding through the difference between $F$ and $U$ is cancelled by the repulsive entropic force.\n\n\n\\section{Nuclear Matter Effects on Quarkonia}\n\\label{s4}\n\nQuarkonium suppression has been extensively studied both experimentally and theoretically since the first work by Matsui and Satz~\\cite{matsui}.\nFrom the experimental data and the corresponding theoretical interpretations, it is now realized that, apart from the color screening, some other medium\neffects come into play during the quarkonium evolution which make the picture for charmonium production in heavy ion collisions complicated. They\nare usually classified into cold and hot nuclear matter effects.\n\nBefore the initially produced quarkonia pass through the hot medium, they are already affected by the cold nuclear matter effects, including (1) nuclear absorption or normal suppression,\nnamely that the quarkonia are eaten up by collisions with the surrounding primary nucleons~\\cite{abreu}; (2) Cronin effect, namely that prior to any hard scattering the initial partons acquire additional transverse momentum via multi-scattering with nucleons, and then the $p_T$ broadening will be inherited\nby the produced quarkonia through hard processes~\\cite{cronin}; (3) nuclear shadowing effect, namely that the parton distribution function (PDF) in nucleus differs from that in a free nucleon, and the suppressed or enhanced parton distributions, depending on the momentum fraction of the partons, will change the initial quarkonium production~\\cite{mueller,vogt}. A deep understanding of the parton distributions in nuclei requires the knowledge from e+p and e+A collisions~\\cite{frankfurt}.\nThese cold nuclear matter effects are expected to be fixed through p+A collisions, under the assumption that no hot medium is created in such collisions.\n\nAfter entering the created partonic medium, the color screening will alter the binding inside the bound state.\nDifferent suppression mechanisms work here in different temperature domains. When the temperature is\nhigher than the charmonium dissociation temperature, no bound states survive, all the quarkonium states melt into the medium. Below this melting threshold,\nthere is still charmonium suppression through collisions with the medium constituents like gluon dissociation~\\cite{bhanot} and quasi-free dissociation~\\cite{grandchamp}, which respectively correspond to singlet-to-octet transition and Landau damping in terms\nof effective field theory. Microscopically, knowing the parton induced break-up cross section $\\sigma_{\\Psi}$,\nthe dissociation rate or thermal width can be expressed as\n\n", "itemtype": "equation", "pos": 14940, "prevtext": "\nwhere $m_D$ is the gluon Debye screening mass. This imaginary part smears the spectral peaks and leads to\na finite thermal width reflecting the thermal medium effects,\n\n", "index": 9, "text": "\\begin{equation}\n \\Gamma=\\int \\Psi^{\\dag}[\\text {Im}V]\\Psi,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"\\Gamma=\\int\\Psi^{{\\dagger}}[\\text{Im}V]\\Psi,\" display=\"block\"><mrow><mrow><mi mathvariant=\"normal\">Γ</mi><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msup><mi mathvariant=\"normal\">Ψ</mi><mo>†</mo></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mrow><mtext>Im</mtext><mo>⁢</mo><mi>V</mi></mrow><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mi mathvariant=\"normal\">Ψ</mi></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nfor gluon dissociation and\n\n", "itemtype": "equation", "pos": 20843, "prevtext": "\nwith $\\Psi$ being the in-medium charmonium wave function. The underlying physics of this finite width is interpreted as the Landau damping of the low frequency gauge field. In terms of the nonrelativistic field theory pNRQCD,\nthe heavy quark potential is evaluated, and an additional color singlet-to-octet thermal break-up mechanism is found to\ncontribute to the quarkonium thermal width~\\cite{brambilla}, especially in the temperature range where $m_D$ is smaller than the binding\nenergy. Motivated by the effective field theory calculation, a lattice regularized QCD simulation based on NRQCD Lagrangian\nis recently performed~\\cite{burnier1}. The heavy quark potential is extracted from the simulated spectral function,\nwhere the spectral peak and width are respectively related to the real and imaginary part of the potential. It shows\nthat, the imaginary part of the potential $\\text{Im} V$ is compatible with the perturbative result~\\cite{laine}, and\nthe real part $\\text{Re} V$ from HotQCD collaboration with $N_f=2+1$ flavors is closer to the free energy $F$.\nBy parameterizing the potential in a generalized Gauss law approach and putting it into the Schroedinger equation, the\ndissociation temperature for $J/\\psi$ is $T_{J/\\psi}\\simeq 1.37 T_c$~\\cite{burnier2}.\n\nTo understand the lattice QCD result from a point of view of many-body physics, a non-perturbative T-matrix approach is\ndeveloped~\\cite{mannarelli}. In this approach, by fitting the lattice calculated free energy, the heavy quark\npotential is recently evaluated~\\cite{liu2} by taking a diagrammatic treatment through defining the potential within a\nscattering equation. The extracted potential is found to be in between the free energy $F$ and the internal energy $U$ but very close\nto $U$. Interestingly, the derivative of the complex potential, namely the binding force between the two heavy quarks, is stronger than both\nfrom free energy and internal energy, implying a remnant confining string tension in the medium related with a long-range\ncorrelation.\n\nSince the produced QGP in heavy ion collisions expands rapidly and thus cools down fast, the potential analysis might not\nbe valid, because the heavy quark pair would hardly keep in a fixed eigenstate of the evolving Hamiltonian of the heavy quark system. Even further, whether a separate treatment for quarkonium evolution by taking the QGP only as a background really works is somehow questionable. Due to the large entropy associated to a quarkonium in medium observed in lattice QCD ~\\cite{kaczmarek3}, especially near $T_c$, the entropic force~\\cite{kharzeev} induced coupling between medium constituent and heavy quarks might be stronger than the binding between the two heavy quarks. This makes\nthe treatment of the heavy quark bound state as an color neutral entity unjustifiable, it should be influenced by the surrounding medium, since\neach heavy quark in the bound state is strongly entangled with the medium. An entropic self-destruction scenario is proposed and results in a stronger dissociation around the critical temperature $T_c$. Taking into account the entropic force, the quarkonium binding potential is argued to\nbe the free energy $F$~\\cite{satz}, since the extra binding through the difference between $F$ and $U$ is cancelled by the repulsive entropic force.\n\n\n\\section{Nuclear Matter Effects on Quarkonia}\n\\label{s4}\n\nQuarkonium suppression has been extensively studied both experimentally and theoretically since the first work by Matsui and Satz~\\cite{matsui}.\nFrom the experimental data and the corresponding theoretical interpretations, it is now realized that, apart from the color screening, some other medium\neffects come into play during the quarkonium evolution which make the picture for charmonium production in heavy ion collisions complicated. They\nare usually classified into cold and hot nuclear matter effects.\n\nBefore the initially produced quarkonia pass through the hot medium, they are already affected by the cold nuclear matter effects, including (1) nuclear absorption or normal suppression,\nnamely that the quarkonia are eaten up by collisions with the surrounding primary nucleons~\\cite{abreu}; (2) Cronin effect, namely that prior to any hard scattering the initial partons acquire additional transverse momentum via multi-scattering with nucleons, and then the $p_T$ broadening will be inherited\nby the produced quarkonia through hard processes~\\cite{cronin}; (3) nuclear shadowing effect, namely that the parton distribution function (PDF) in nucleus differs from that in a free nucleon, and the suppressed or enhanced parton distributions, depending on the momentum fraction of the partons, will change the initial quarkonium production~\\cite{mueller,vogt}. A deep understanding of the parton distributions in nuclei requires the knowledge from e+p and e+A collisions~\\cite{frankfurt}.\nThese cold nuclear matter effects are expected to be fixed through p+A collisions, under the assumption that no hot medium is created in such collisions.\n\nAfter entering the created partonic medium, the color screening will alter the binding inside the bound state.\nDifferent suppression mechanisms work here in different temperature domains. When the temperature is\nhigher than the charmonium dissociation temperature, no bound states survive, all the quarkonium states melt into the medium. Below this melting threshold,\nthere is still charmonium suppression through collisions with the medium constituents like gluon dissociation~\\cite{bhanot} and quasi-free dissociation~\\cite{grandchamp}, which respectively correspond to singlet-to-octet transition and Landau damping in terms\nof effective field theory. Microscopically, knowing the parton induced break-up cross section $\\sigma_{\\Psi}$,\nthe dissociation rate or thermal width can be expressed as\n\n", "index": 11, "text": "\\begin{equation}\n\\Gamma_{\\Psi}=\\int\\frac{d^3{\\bf k}}{(2\\pi)^3}v_{rel}\\sigma_\\Psi(s,T)f_g({\\bf k}),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\Gamma_{\\Psi}=\\int\\frac{d^{3}{\\bf k}}{(2\\pi)^{3}}v_{rel}\\sigma_{\\Psi}(s,T)f_{g%&#10;}({\\bf k}),\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Γ</mi><mi mathvariant=\"normal\">Ψ</mi></msub><mo>=</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mfrac><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>𝐤</mi></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mfrac><mo>⁢</mo><msub><mi>v</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>σ</mi><mi mathvariant=\"normal\">Ψ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>f</mi><mi>g</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\nfor quasi-free dissociation with $f_{p,g}({\\bf k})$ the parton thermal distribution in medium. Inversely, this provides\na way to extract the microscopic dissociation cross section from the dissociation rate~\\cite{brambilla,escobedo,brambilla2}.\n\nAnother hot medium effect related to the quarkonium suppression is the quarkonium regeneration inside the hot medium~\\cite{pbm,thews,rapp,yan} through the recombination of those uncorrelated heavy quarks. With increasing colliding energy, the suppression of the initially produced quarkonia becomes more and more strong, but the regeneration contribution increases due to the abundant heavy quarks in the medium at high energies. The balance between the suppression and the regeneration controls the quarkonium production in high energy nuclear collisions. There are different ways to treat the suppression and regeneration. Within the statistical\nhadronization model~\\cite{pbm}, the quarkonia are statistically produced at the\nhadronization transition from kinetically equilibrated medium, and all the initially produced quarkonia are assumed to be absorbed by the medium. Considering the fact that\n$J/\\psi$ and $\\Upsilon$ can survive in the medium with temperature above the critical temperature $T_c$ and below the dissociation temperature $T_{J/\\psi} (T_\\Upsilon$), a continuous regeneration\nscheme is proposed in kinetic formalism~\\cite{thews} where quarkonia can be both dissociated\nand regenerated continuously inside the QGP medium. In a strongly coupled QGP phase, the charm quark diffusion constant is very small, and the binding force between the two quarks inside a charmonium is still strong~\\cite{shuryak}, especially near $T_c$,  a generalized Langevin approach with additional binding force (${\\bf F}=-\\nabla V$) is proposed\nto evaluate the charmonium evolution, where the regeneration from correlated charm quarks is included.\nMore generally, being motivated by the fact that the QGP produced in heavy ion collisions is a rapid cooling system, open quantum\nsystem formalisms are developed for studying quarkonia in nuclear collisions~\\cite{akamatsu} which exclude the adiabatic condition used in usual treatments.\nSimilar to the open quantum system approaches, a Hamiltonian based\napproach is developed, and through a chain of well-controlled approximations it finally arrives at a generalized\nLangevin formalism, with which both the quarkonium dissociation and regeneration are calculable~\\cite{blaizot}.\n\n\n\\section{Quarkonium Transverse Momentum Distribution}\n\\label{s5}\n\nTransverse motion is developed during the dynamical evolution of\nthe system. It has been well documented in the light quark sectors\nfor heavy ion collisions at all energies. In\norder to understand the production and suppression mechanisms and\nextract the properties of the medium, it is proposed to construct a new\nratio for the second moment of the transverse momentum distribution.\nThe ratio $r_{AA}$ is defined as~\\cite{zhou1,zhou2}\n\n", "itemtype": "equation", "pos": 20984, "prevtext": "\nfor gluon dissociation and\n\n", "index": 13, "text": "\\begin{equation}\n\\Gamma_{\\Psi}=\\sum_{i=g,q,\\bar q}\\int\\frac{d^3{\\bf k}}{(2\\pi)^3}v_{rel}\\sigma_\\Psi(s,T)f_i({\\bf k})(1\\pm f_i({\\bf k})),\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\Gamma_{\\Psi}=\\sum_{i=g,q,\\bar{q}}\\int\\frac{d^{3}{\\bf k}}{(2\\pi)^{3}}v_{rel}%&#10;\\sigma_{\\Psi}(s,T)f_{i}({\\bf k})(1\\pm f_{i}({\\bf k})),\" display=\"block\"><mrow><mrow><msub><mi mathvariant=\"normal\">Γ</mi><mi mathvariant=\"normal\">Ψ</mi></msub><mo>=</mo><mrow><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>i</mi><mo>=</mo><mrow><mi>g</mi><mo>,</mo><mi>q</mi><mo>,</mo><mover accent=\"true\"><mi>q</mi><mo stretchy=\"false\">¯</mo></mover></mrow></mrow></munder><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><mfrac><mrow><msup><mi>d</mi><mn>3</mn></msup><mo>⁢</mo><mi>𝐤</mi></mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>3</mn></msup></mfrac><mo>⁢</mo><msub><mi>v</mi><mrow><mi>r</mi><mo>⁢</mo><mi>e</mi><mo>⁢</mo><mi>l</mi></mrow></msub><mo>⁢</mo><msub><mi>σ</mi><mi mathvariant=\"normal\">Ψ</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>s</mi><mo>,</mo><mi>T</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>±</mo><mrow><msub><mi>f</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐤</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.00278.tex", "nexttext": "\n\nThe quarkonium motion in heavy ion collisions can be described by a transport equation~\\cite{zhu,yan} with initial condition determined by the superposition of p+p collisions and modification from the cold nuclear matter effects. The loss and gain terms on the right hand side of the transport equation are controlled by the quarkonium suppression and generation~\\cite{liu3,tang}. Fig.\\ref{fig1} shows the calculated $J/\\psi$ $r_{AA}$~\\cite{zhou2} as a function of collision\ncentrality ($N_{part}$) for collisions at SPS, RHIC and\nLHC. There is a clear rise in\n$r_{AA}$ in peripheral collisions at all colliding energies. It\nis believed due to the Cronin effect before\nthe quarkonium formation~\\cite{cronin} and it is more\nimportant for collisions at lower energy.\n\n\\begin{center}\n\\begin{figure}[h]\n\\includegraphics[width=0.6\\textwidth]{fig1.eps}\n\\caption{(color online)  $J/\\psi\\ r_{AA}=\\langle p_t^2\\rangle_{AA}/\\langle\np_t^2\\rangle_{pp}$ as a function of collision centrality ($N_{part}$)\nfor collisions at SPS (open triangles)\\cite{spsptraa}, RHIC (open\ncircles)\\cite{rhic2007} and LHC (filled circles)\\cite{aliceptraa}.\nLeft and right plot are results from mid-rapidity and\nforward-rapidity, respectively.  The solid and dashed lines indicate\nthe model results with and without considering the shadowing\neffect~\\cite{eks}. }\n\\label{fig1}\n\\end{figure}\n\\end{center}\n\n\nThe centrality dependence of $r_{AA}$ clearly reflects the\nunderlying $J/\\psi$ production and suppression mechanisms in high\nenergy nuclear collisions. At lower collision energy where the charm\ncross section is small and the regeneration is negligible, almost\nall of the observed $J/\\psi$s are produced at the initial impact. In\nthis case, the Cronin\neffect~\\cite{cronin} is dominant and tends to increase the\ntransverse momenta of the finally observed quarkonia. As a result\n$r_{AA}$ is always above unity and increases monotonically versus\ncollision centrality, see left panel of Fig.~\\ref{fig1}. In the\ntruly high energy heavy ion collisions, on the other hand, charm\nquarks are copiously produced and the regeneration for quarkonia can be significant. Although these heavy quarks\nare initially produced via hard process with large transverse\nmomenta, they loss energy when interacting with the medium.\nSince the temperature is high in such violent collisions,\nespecially in the most central collisions, almost all initially\nproduced $J/\\psi$s are destroyed and the regenerated $J/\\psi$s\ndominate the final production. As shown in the left panel of\nFig.\\ref{fig1}, the predicted $r_{AA}$ for heavy ion collisions at\nLHC is less than unity and decreases toward more central collisions.\nThe prediction has been confirmed by the experimental results at\nsomewhat forward rapidity window as shown in the right plot of\nFig.\\ref{fig1}~\\cite{aliceptraa}. The strong competition between the\ninitial parton scattering and the regeneration at RHIC energy leads\nto a flat centrality dependence of $r_{AA}$ at mid-rapidity,\nshown as open circles in the left plot. Shift a bit away from the\nmid rapidity, see the right plot of Fig.\\ref{fig1}, the ratio at\nRHIC is increasing versus centrality signaling the importance of\ninitial scattering at the RHIC energy. One may ask oneself if the\nabove result of $r_{AA}$ is due to the initial shadowing effect\nwhich changes the parton distributions in nuclei. Different from the integrated\nyield, the averaged transverse momentum is a normalized quantity,\ntherefore the shadowing induced change in the parton\ndistribution is minimized. As shown in Fig.\\ref{fig1},  the small difference between the\nsolid and dashed lines, the hatched band, is the results of shadowing effect~\\cite{eks}.\n\nThe elliptic flow is a measure of the collective motion and sensitive to the thermalization of the quarkonia. It describes the asymmetry of the quarkonium transverse motion,\n\\begin{eqnarray}\n v_2=\\langle \\frac{p^2_x-p^2_y}{p^2_x+p^2_y}\\rangle = \\langle \\cos 2\\phi \\rangle.\n\\end{eqnarray}\nThe initially produced $J/\\psi$s only\npossess a very small elliptic flow from the geometry induced leakage effect~\\cite{leakage}. The regeneration\non the other hand depends much on the heavy quark evolution. The large $v_2$ of charm quarks due to the strong interaction with the medium can be inherited by the regenerated $J/\\psi$s. The transport approach can explain~\\cite{liu4,zhou2} well the disappeared elliptic flow at RHIC energy~\\cite{flow1} and the sizeable elliptic flow at LHC energy~\\cite{flow2}.\n\n\n\\section{Conclusion}\n\\label{s6}\n\nHeavy quarks and quarkonia are sensitive probes of the quark gluon plasma created in high energy nuclear collisions, due to their strong interaction with the constituents of the hot medium.\nBy taking into account the cold and hot nuclear matter effects on their evolution in the partonic and hadronic phases, we can describe most of the experimental data by adjusting some parameters in phenological models. However, there exist still some puzzles which are beyond our expectations, like the simultaneous treatment of the heavy quark $R_{AA}$ and $v_2$, the double ratio of $\\psi'$ to $J/\\psi$ yield in some special rapidity, the strong charmonium enhancement in peripheral collisions, and the partial thermalization of charmonia in small systems.\n\\noindent {\\bf Acknowledgement:}\nThe work is supported by the NSFC and MOST grant Nos. 11335005, 11575093, 2013CB922000 and 2014CB845400, and the Helmholtz\nInternational Center for FAIR within the framework of the LOEWE program launched by the State of Hesse.\n\n\\begin{thebibliography}{99}\n\\bibitem{svetitsky} B.~Svetitsky, Phys. Rev. {\\bf D37}, 2484(1988).\n\\bibitem{cao} S.~Cao, G.~Qin, S.~Bass, Phys. Rev. {\\bf C88}, 044907(2013).\n\\bibitem{moore} G.~Moore and D.~Teaney, Phys. Rev. {\\bf C71}, 064904(2005).\n\\bibitem{alberico} W.~Alberico, {\\it et al.}, Eur. Phys. J. {\\bf C71}, 1666(2011).\n\\bibitem{huot} S.Caron-Huot and G.Moore, Phys. Rev. Lett. {\\bf 100}, 052301(2008).\n\\bibitem{peigne} S.~Peigne and A.~Peshier, Phys. Rev. {\\bf C77}, 114017(2008).\n\\bibitem{gossiaux} P.~Gossiaux and J.~Aichelin, Phys. Rev. {\\bf C78}, 014904(2008).\n\\bibitem{uphoff} J.Uphoff, {\\it et al.}, Phys. Rev. {\\bf C84}, 024908(2011).\n\\bibitem{banerjee} D.~Banerjee, {\\it et al.}, Phys. Rev. {\\bf D85}, 014510(2012); H.~Ding, {\\it et al.}, J. Phys. {\\bf G38}, 124070(2011); A.~Francis, {\\it et al.}, Phys. Rev. {\\bf D92},\n                 116003(2015).\n\\bibitem{riek} F.~Riek and R.~Rapp, Phys. Rev. {\\bf C82}, 035201(2010); H. van Hees, {\\it et al.}, Phys. Rev. Lett. {\\bf 100}, 192301(2008).\n\\bibitem{gubser} S.~Gubser, Nucl. Phys. {\\bf B790}, 175(2008); D.~Son and D.~Teaney, JHEP {\\bf 0907}, 021(2009).\n\\bibitem{xu} J.~Xu, J.~Liao and M.~Gyulassy, Chin. Phys. Lett. {\\bf 32}, 092501(2015).\n\\bibitem{kaczmarek3} O.~Kaczmarek and F.~Zantow, PoS LAT {\\bf 2005}, 192(2006).\n\\bibitem{koma} see for instance, Y.~Koma, M.~Koma and H.~Wittig, Phys. Rev. Lett. {\\bf 97}, 122003(2006).\n\\bibitem{barchielli} A.~Barchielli, E.~Montaldi and G.M.~Prosperi, Nucl. Phys. {\\bf B296}, 625(1988); A.~Vairo, Nucl. Phys. Proc. Suppl. {\\bf 86}, 521-524(2000); N.~Brambilla, {\\it et al.},\n                     Rev. Mod. Phys. {\\bf 77}, 1423(2005).\n\\bibitem{matsui} T.~Matsui and H.~Satz, Phys. Lett. {\\bf B178}, 417(1986).\n\\bibitem{star} L.~Adamczyk {\\it et al.} [STAR Collaboration], Phys. Lett. {\\bf B735}, 127(2014).\n\\bibitem{cms} S.Chatrchyan {\\it et al.} [CMS Collaboration], Phys. Rev. Lett. {\\bf 107}, 052302(2011).\n\\bibitem{kaczmarek1} O.~Kaczmarek, F.~Karsch, F.~Zantow, and P.~Petreczky, Phys. Rev. {D70}, 074505(2004).\n\\bibitem{kaczmarek2} O.~Kaczmarek, Eur. Phys. J. {\\bf C61}, 811-817(2009).\n\\bibitem{liu} Y.~Liu, B.~Chen, N.~Xu, and P.~Zhuang, Phys. Lett. {B697}, 32(2011).\n\\bibitem{ding} H.~Ding, A.~Francis, O.~Kaczmarek, F.~Karsch, H.~Satz, and W.~Soeldner, Phys. Rev. {\\bf D86}, 014509(2012).\n\\bibitem{dumitru} A.~Dumitru, Y.~Guo, A.~Mocsy, and M.~Strickland, Phys. Rev. {\\bf D79}, 054019(2009).\n\\bibitem{guo} X.~Guo, S.~Shi and P.~Zhuang, Phys. Lett. {\\bf B718}, 143(2012).\n\\bibitem{laine} M.~Laine, O.~Philipsen, P.~Romatschke, and M.~Tassler, JHEP {\\bf 0703}, 054(2007).\n\\bibitem{brambilla} N.~Brambilla, {\\it et al.}, JHEP {\\bf 1112}, 116(2011).\n\\bibitem{burnier1} Y.~Burnier, O.~Kaczmarek and A.~Rothkopf, Phys. Rev. Lett. {\\bf 114}, 082001(2015).\n\\bibitem{burnier2} Y.~Burnier, O.~Kaczmarek and A.~Rothkopf, arXiv:1509.07366.\n\\bibitem{mannarelli} M.~Mannarelli and R.~Rapp, Phys. Rev. {\\bf C72}, 064905(2005).\n\\bibitem{liu2} S.Y.F.~Liu and R.~Rapp, Nucl. Phys. {\\bf A941}, 170(2015).\n\\bibitem{kharzeev} D.E.~Kharzeev, Phys. Rev. {\\bf D90}, 074007(2014).\n\\bibitem{satz} H.~Satz, Eur. Phys. J. {\\bf C75}, 193(2015).\n\\bibitem{abreu} M.~Abreu {\\it et al.} [NA38 Collaboration], Phys. Lett. {B466}, 408(1999).\n\\bibitem{cronin} J.~Cronin, H.~Frisch, M.~Shochet, J.~Boymond, P.~Pirou¨¦, and R.~Sumner, Phys. Rev. {\\bf D11}, 3105(1975); J.~Hufner, Y.~Kurihara and H.~Pirner, Phys. Lett. {\\bf B215}, 218(1988).\n\\bibitem{mueller} A.~Mueller and J.~Qiu, Nucl. Phys. {\\bf B268}, 427(1986).\n\\bibitem{vogt} R.~Vogt, Int. J. Mod. Phys. {\\bf E12}, 211(2003).\n\\bibitem{frankfurt} L.~Frankfurt and M.~Strikman, Nucl. Phys. Proc. Suppl.{\\bf 79}, 671(1999).\n\\bibitem{bhanot} G.~Bhanot and M.~Peskin, Nucl. Phys. {\\bf B156}, 365(1979); Nucl. Phys. {\\bf B156}, 391(1979).\n\\bibitem{grandchamp} L.~Grandchamp and R.~Rapp, Phys. Lett. {B523}, 60(2001).\n\\bibitem{escobedo} M.~Escobedo, J. Phys. Conf. Ser. {\\bf 503}, 012026(2014).\n\\bibitem{brambilla2} N.~Brambilla, {\\it et al.}, JHEP {\\bf 1305}, 130(2013).\n\\bibitem{pbm} P.~Braun-Munzinger and J.~Stachel, Phys. Lett. {B490}, 196(2000); A.~Adronic, P.~Braun-Munzinger, K.~Redlich, and J.~Stachel, Phys. Lett. {\\bf B652}, 259(2007).\n\\bibitem{thews} R.~Thews, M.~Schroedter and J.~Rafelski, Phys. Rev. {\\bf C63}, 054905(2001).\n\\bibitem{rapp} L.~Grandchamp and R.~Rapp, Nucl. Phys. {\\bf A709}, 415(2002).\n\\bibitem{yan} L.~Yan, P.~Zhuang and N.~Xu, Phys. Rev. Lett.{\\bf 97}, 232301(2006).\n\\bibitem{shuryak} C.~Young and E.~Shuryak, Phys. Rev. {\\bf C79}, 034907(2009); Phys. Rev. {\\bf C81}, 034905(2010).\n\\bibitem{akamatsu} Y.~Akamatsu, Phys. Rev. {\\bf D87}, 045016(2013); C.~Young and K.~Dusling, Phys. Rev. {\\bf C87}, 065206(2013);\n                   A.~Beraudo, J.~Blaizot, P.~Faccioli, and G.~Garberoglio, Nucl. Phys. {\\bf A846}, 104(2010); R.~Katz and P.~Gossiaux, arXiv:1504.08087.\n\\bibitem{blaizot} J.~Blaizot, D.De Boni, P.~Faccioli, and G.~Garberoglio, Nucl. Phys. {\\bf A946}, 49(2016).\n\\bibitem{zhou1} K.~Zhou, N.~Xu and P.~Zhuang, Nucl. Phys. {\\bf A834}, 249c-252c(2010).\n\\bibitem{zhou2} K.~Zhou, N.~Xu, Z.~Xu, and P.~Zhuang, Phys. Rev. {\\bf C89}, 054911(2014).\n\\bibitem{zhu} X.~Zhu, P.~Zhuang and N.~Xu, Phys. Lett. {\\bf B607}, 107(2005).\n\\bibitem{liu3} Y.~Liu, Z.~Qu, N.~Xu, and P.~Zhuang, Phys. Lett. {\\bf B678}, 72(2009).\n\\bibitem{tang} Z.~Tang, N.~Xu, K.~Zhou, and P.~Zhuang, J. Phys. {\\bf G41}, 124006(2014).\n\\bibitem{spsptraa} N.~Topilskaya {\\it et al.} [NA50 Collaboration], Nucl. Phys. {\\bf A715}, 675(2003).\n\\bibitem{rhic2007} A.~Adare {\\bf et al.} [PHENIX Collaboration], Phys. Rev. Lett, {\\bf 98}, 232301(2007).\n\\bibitem{aliceptraa} E.~Scomparin {\\it et al.} [ALICE Collaboration], Quark Matter 2012 talk.\n\\bibitem{eks} K.~Eskola, V.~Kolhinen, and C.~Salgado, Eur. Phys. J. {\\bf C9}, 61(1999).\n\\bibitem{leakage} J.~Hufner and P.~Zhuang, Phys. Lett. {\\bf B559}, 193(2003).\n\\bibitem{liu4} Y.~Liu, N.~Xu, and P.~Zhuang, Nucl. Phys. {\\bf A834}, 317c(2010).\n\\bibitem{flow1} L.~Adamczyk {\\it et al.} [STAR Collaboration], Phys. Rew. Lett. {\\bf 111}, 052301(2013).\n\\bibitem{flow2} E.~Abbas {\\it et al.} [ALICE Collaboration], Phys. Rew. Lett. {\\bf 111}, 162301(2013).\n\\end{thebibliography}\n\n\n\n", "itemtype": "equation", "pos": 24109, "prevtext": "\nfor quasi-free dissociation with $f_{p,g}({\\bf k})$ the parton thermal distribution in medium. Inversely, this provides\na way to extract the microscopic dissociation cross section from the dissociation rate~\\cite{brambilla,escobedo,brambilla2}.\n\nAnother hot medium effect related to the quarkonium suppression is the quarkonium regeneration inside the hot medium~\\cite{pbm,thews,rapp,yan} through the recombination of those uncorrelated heavy quarks. With increasing colliding energy, the suppression of the initially produced quarkonia becomes more and more strong, but the regeneration contribution increases due to the abundant heavy quarks in the medium at high energies. The balance between the suppression and the regeneration controls the quarkonium production in high energy nuclear collisions. There are different ways to treat the suppression and regeneration. Within the statistical\nhadronization model~\\cite{pbm}, the quarkonia are statistically produced at the\nhadronization transition from kinetically equilibrated medium, and all the initially produced quarkonia are assumed to be absorbed by the medium. Considering the fact that\n$J/\\psi$ and $\\Upsilon$ can survive in the medium with temperature above the critical temperature $T_c$ and below the dissociation temperature $T_{J/\\psi} (T_\\Upsilon$), a continuous regeneration\nscheme is proposed in kinetic formalism~\\cite{thews} where quarkonia can be both dissociated\nand regenerated continuously inside the QGP medium. In a strongly coupled QGP phase, the charm quark diffusion constant is very small, and the binding force between the two quarks inside a charmonium is still strong~\\cite{shuryak}, especially near $T_c$,  a generalized Langevin approach with additional binding force (${\\bf F}=-\\nabla V$) is proposed\nto evaluate the charmonium evolution, where the regeneration from correlated charm quarks is included.\nMore generally, being motivated by the fact that the QGP produced in heavy ion collisions is a rapid cooling system, open quantum\nsystem formalisms are developed for studying quarkonia in nuclear collisions~\\cite{akamatsu} which exclude the adiabatic condition used in usual treatments.\nSimilar to the open quantum system approaches, a Hamiltonian based\napproach is developed, and through a chain of well-controlled approximations it finally arrives at a generalized\nLangevin formalism, with which both the quarkonium dissociation and regeneration are calculable~\\cite{blaizot}.\n\n\n\\section{Quarkonium Transverse Momentum Distribution}\n\\label{s5}\n\nTransverse motion is developed during the dynamical evolution of\nthe system. It has been well documented in the light quark sectors\nfor heavy ion collisions at all energies. In\norder to understand the production and suppression mechanisms and\nextract the properties of the medium, it is proposed to construct a new\nratio for the second moment of the transverse momentum distribution.\nThe ratio $r_{AA}$ is defined as~\\cite{zhou1,zhou2}\n\n", "index": 15, "text": "\\begin{equation}\nr_{AA}=\\frac{\\langle p_t^2 \\rangle_{AA}}{\\langle p_t^2\n\\rangle_{pp}}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"r_{AA}=\\frac{\\langle p_{t}^{2}\\rangle_{AA}}{\\langle p_{t}^{2}\\rangle_{pp}}.\" display=\"block\"><mrow><mrow><msub><mi>r</mi><mrow><mi>A</mi><mo>⁢</mo><mi>A</mi></mrow></msub><mo>=</mo><mfrac><msub><mrow><mo stretchy=\"false\">⟨</mo><msubsup><mi>p</mi><mi>t</mi><mn>2</mn></msubsup><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>A</mi><mo>⁢</mo><mi>A</mi></mrow></msub><msub><mrow><mo stretchy=\"false\">⟨</mo><msubsup><mi>p</mi><mi>t</mi><mn>2</mn></msubsup><mo stretchy=\"false\">⟩</mo></mrow><mrow><mi>p</mi><mo>⁢</mo><mi>p</mi></mrow></msub></mfrac></mrow><mo>.</mo></mrow></math>", "type": "latex"}]