[{"file": "1601.06942.tex", "nexttext": "\n\nwhere $L_y$ is the nanoribbon length, $F_{k_y,j,k_y^\\prime,j^\\prime}=[1+\\cos(\\theta_{k_y,j}-\\theta_{k_y^\\prime,{j^\\prime}})]/2$\nis the form factor coming from the overlap of the single-particle nanoribbon wave functions, with\n$\\theta_{k_y,j} = \\tan^{-1}(k_y/k_j)$, $V_{\\text{e-h}}(q)$ is the effective electron-hole pairing interaction, and\n $E_j(k_y) =[(\\epsilon_j(k_y) -\\mu)^2+\\Delta_j(k_y) ^2]^{1/2}$\n is the single-particle energy dispersion in the superfluid state\n  for subband $j$.  The wave-vector $k_y^\\prime$ is bounded by\nthe Brillouin zone boundary $\\pm k_c$.  We truncate the sum over the subband index  at $j^\\prime=j_c$, where $j_c$ is the lowest subband with a minimum above the graphene nanoribbon work function energy, taken  to be $\\sim 4.5$ eV.\nThe chemical potential $\\mu$ is fixed by the density equation,\n\n\\begin{eqnarray}\nn &=& \\frac{2}{W L_y}\\sum_{j}^{j_c}\\sum_{k_y}^{k_c} v_j(k_y)^2\\ ;\n\\label{gapeqn2}\\\\\n\\label{vk2}\nv_j(k_y)^2 &=& \\frac{1}{2}\\left[1 - \\frac{\\epsilon_j(k_y)-\\mu }{E_j(k_y) }\\right]\\ .\n\\end{eqnarray}\n\nThe  factor $2$ in Eq.\\ (\\ref{gapeqn2}) is due to the spin degeneracy.\n\nIn the calculations we neglect screening, an\napproximation that is justified\n{\\it a posteriori} as follows.  The screening is expected to be weak when the superfluidity lies\nin the strongly-coupled BEC or BCS-BEC crossover regimes because  the superfluid gap in these regimes of pairing is  comparable to the  Fermi energy, resulting in a\nlarge smearing of the Fermi surface, and compact electron-hole pairs  compared with their average spacing.  This makes their  mutual  interactions\n dipolar and weak.   In the BEC or BCS-BEC crossover\nregimes we can thus expect screening to be weak, and so we  neglect it.  However for weak-coupled BCS superfluidity, screening\nis known to be a strong effect,  which would make our  unscreened approximation a poor one in the BCS regime.  These effects have been documented  in the related system of\nsuperfluidity in coupled electron-hole sheets with parabolic energy band\ndispersion \\cite{Perali2013,Maezono2013}.\n\nThus in Eq.\\ (\\ref{gapeqn}) we approximate the  electron-hole  pairing attraction   $V_{\\text{e-h}}(q) $ by the bare Coulomb interaction.  For electrons and holes confined in nanoribbons of width $W$, separated by an insulating h-BN barrier of thickness $d$ and dielectric constant  $\\kappa=3$, we obtain \\cite{Brey2007},\n\n\n", "itemtype": "equation", "pos": 9001, "prevtext": "\n\n\\flushbottom\n\\maketitle\n\n\\thispagestyle{empty}\n\n\\section*{Introduction}\n\nSuperfluidity of spatially separated electrons and holes was predicted nearly\nhalf a century ago \\cite{Lozovik} but up to now experimental observation\nof this exotic state has been elusive at zero magnetic field, notwithstanding\nmultiple attempts on very different systems. The discovery of the wonder\nmaterial graphene in conjunction with the large band gap insulator hexagonal\nboron nitride (h-BN) has raised new hopes for realization of this new\ncollective many body state.\nRecently, superconductivity at temperatures above liquid Helium\nhas been reported in doped monolayer graphene\nby four groups, amplifying  interest in\nquantum coherent phenomena in graphene. \\cite{SuperGr}\n\nMonolayer graphene is an atomically flat, gapless semiconductor with near\nidentical conduction and valence bands.\nSpatially separated electron-doped and hole-doped\nmonolayers can be completely insulated from each other with just a few atomic layers of h-BN \\cite{Gorbachev2012,Geim2013}.  With such small spatial\nseparations,\nelectron-hole pairing by direct Coulomb attraction\nwould be expected to be strong \\cite{Mink,Min2008,comment}.  However\nthe linear dispersion of the monolayer graphene\nenergy bands results in very strong Coulomb screening of the electron-hole pairing\nattraction, and this suppresses superfluidity in coupled electron-hole graphene monolayers  \\cite{Lozovik2012,Gorbachev2012}.\nTo overcome the strong screening,  Refs.\\  {\\hspace{-1 ex} \\nocite{{Perali2013}}\\citenum{{Perali2013}}}\nand {\\hspace{-1 ex} \\nocite{{Zarenia2014}}\\citenum{{Zarenia2014}}} proposed using coupled electron-hole\ngraphene multilayers.  Using multilayers takes advantage of the  nonlinear dispersion\nof their energy bands  \\cite{McCann,Min2008b},  and the\nexistence of a  gap between the conduction and valence bands when a gate potential is applied.\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig1.eps}\n\\caption{(a)  Lowest single-particle energy subbands $\\epsilon_j(k_y), j=1,2,\\dots$ in an armchair graphene nanoribbon of width $W=2$ nm.\n(b) Corresponding density of states DOS$(E)$ in  nanoribbon. Van Hove singularities are visible at  bottom of each subband.}\n\\label{DOS}\n\\end{figure}\n\n\nHere we propose a new design to boost electron-hole pairing and the\nonset of superfluidity using nanoribbons etched in monolayer\ngraphene.\nMonolayer sheets of graphene are promising candidates for applications in transparent conductive\nfilms, electronic and opto-electronic devices, actuators, sensors, composites,\nand more.  However a serious limitation of graphene monolayers is that field-effect transistor (FET) devices are not possible because the massless nature of the electrons prevents electron\nconfinement in graphene.\nQuasi-one-dimensional graphene nanoribbons with tuneable  band gaps  resolve this  issue, with important implications for the fabrication of novel and ultrafast\nelectronic nanodevices.   For example, FET devices with 100 GHz switching frequencies\nhave been fabricated using graphene nanoribbons \\cite{Lin2010}.\nThe nanoribbon edges can be terminated using a variety of different atoms, which opens up application opportunities, in particular for nanoribbons in polymer hosts for\nfabrication of novel composite materials \\cite{Dimiev2011,Dimiev2013}.\nFinally, graphene nanoribbons are showing great promise  as electrode materials for batteries and supercapacitors \\cite{Li2013}.\n\nThe electronic properties of graphene nanoribbons depend on the type of edge\ntermination \\cite{Kim2007}. We focus on armchair-edge terminated nanoribbons since (i) their subbands\nare parabolic around their minima (Fig.\\ \\ref{DOS}(a)), (ii) there is a sizeable semiconductor-like\nenergy gap between the conduction\nand valence bands, and (iii) the valley degeneracy of monolayer graphene is lifted.\nThese properties combine to greatly reduce the strength of screening of the  electron-hole pairing\ninteraction. Note that uniform armchair graphene nanoribbons of\nwidths  $W\\ll 10$ nm have recently been fabricated \\cite{Cai}.\n\nFigure  \\ref{schematic} shows the device we are proposing.  It consists of two armchair-edge terminated monolayer graphene nanoribbons, one electron-doped and the other hole-doped,    separated by a few atomic layers of a h-BN insulating barrier. The nanoribbons are independently contacted, and\ntop and back metal gates control the carrier densities.\n\n \\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig2.eps}\n\\caption{Proposed device.  Upper electron-doped and lower hole-doped armchair-edge terminated graphene nanoribbons of  widths $W$ separated by h-BN insulator of thickness $d$. Top and back gates control electron and hole densities.  Gates are separated from  nanoribbons by  h-BN layers. Nanoribbons are independently contacted.\n}\n\\label{schematic}\n\\end{figure}\n\n\n \\begin{figure}[h]\n\\centering\n\\includegraphics[width=9cm]{fig3.eps}\n\\caption{Maximum superfluid gap $\\overline{\\Delta}\\,^{\\mathrm{max}}$ averaged over the subbands. $d$ is thickness of the insulating barrier separating the nanoribbons.   Nanoribbon width is $W=2$ nm.  Densities at which $E_F$ enters the bottom of a new subband $\\epsilon_j$ are indicated by the vertical lines.}\n\\label{Deltamaxvsd}\n\\end{figure}\n\n\nIn addition to reducing the effect of screening,  electron-hole pairing\nstrengths will be further boosted in our proposed system by\nthe enhanced density of states near the minimum of each subband that arises from the van\nHove singularities of the quasi-one-dimensional nanoribbons, and also by the\nquantum confinement of the carriers in the nanoribbons.\nEnhancement of superconducting gaps and critical temperature\nin striped systems due to shape\nresonances and quantum confinement at the nanoscale was\npredicted in Refs.\\ {\\hspace{-1 ex} \\nocite{{Perali1996,Bianconi1997,Bianconi1998}}\\citenum{{Perali1996,Bianconi1997,Bianconi1998}}}.\nSuperconductivity has been observed in quasi-one-dimensional systems\nincluding Sn and Al metallic nanowires and  carbon nanotubes,\nwith enhanced transition temperatures as compared with their bulk values  \\cite{Shanenko2006}.\n\n\\section*{Methods}\nWe take the $y$-direction parallel to the nanoribbons, with the carriers\nconfined in the transverse $x$-direction.  Figure 1(b) shows the\nsingle-particle energy subbands obtained in the continuum model,\n$\\epsilon_j(k_y)= (\\sqrt{3}t a_0/2) \\sqrt{k_y^2+k_j^2}$,  \\ $j =1,2,\\dots$\nfor an armchair graphene nanoribbon of width\n$W=2$ nm.    The intralayer hopping energy $t=2.7$ eV\\ \\ \\cite{Brey2006}\nand the graphene lattice constant $a_0=0.24$ nm. $k_j=\\left[j\\pi/W\\right]-\\left[4\\pi/(3\\sqrt{3}a_0)\\right]$ is the quantized wave-number\nfor the $j$-subband in the $x$-direction.  Figure\n\\ref{DOS}(b)  shows the corresponding density of states DOS$(E)$.\nThe van Hove singularities coincide with the bottom of each subband.\n\nNot only the  finite width of the nanoribbons but also their multiple occupied subbands make the system only\nquasi-one-dimensional.  In addition, in the superfluid state the energy gap mixes close-by subbands.  The quasi-one-dimensionality together with the subband mixing  will\nsuppress order parameter fluctuations that are responsible for\ndestroying superfluidity in a pure one-dimensional system.  For these reasons we can\ncalculate  properties of the superfluid ground state\nusing mean field theory.\n\nRecently Ref.\\ {\\hspace{-1 ex} \\nocite{{Abergel}}\\citenum{{Abergel}}} discussed a quasi-condensate of excitons\nin coupled electron-hole one-dimensional wires using the weak-coupled BCS\ngap equation in the low density limit with only the lowest subband\ncontributing to the pairing, and with screening neglected.  Since only one\nchannel was considered, there are no shape resonance effects\nat finite densities.  Also, because of the one dimensionality, fluctuations of the order parameter\nshould be severe  and would strongly suppress\nsuperfluidity.   Interestingly, Ref.\\ {\\hspace{-1 ex} \\nocite{{Abergel}}\\citenum{{Abergel}}} argues that even in the one-channel case, the finite size of the\nnanoribbons would allow for short range superfluid correlations.\nIn our case the many available channels due to the multiple subbands involved\nin the pairing  allow for a  suppression of the critical\nfluctuations and it should be straightforward to observe conventional long range superfluidity.\n\nOur calculations are for coupled electron-hole armchair graphene\nnanoribbons of equal width $W$ and equal  (two-dimensional) electron and hole densities $n=( r_0W)^{-1}$, where $r_0$ is the average  inter-particle spacing  along the\nnanoribbon.   The\nsubbands $\\epsilon_j(k_y),\\  j=1,2,\\dots$ are identical for the  electrons and holes.\n\nBecause of the multiple subband structure, the zero temperature mean field equations for the superfluid state acquire an additional index for the subband $j$.  The equations for the wave-vector dependent superfluid energy\ngaps $\\Delta_j(k_y) $\nfor subbands $j$ become,\n\n\n", "index": 1, "text": "\\begin{equation}\n\\Delta_j(k_y)  = -\\frac{1}{L_y}\\sum_{j^\\prime}^{j_c}\\sum_{k_y^\\prime}^{k_c} F_{k_y,j,k_y^\\prime,j^\\prime}\n V_{\\text{e-h}}(k_y-k_y^\\prime)  \\frac{\\Delta_{j^\\prime}(k_y^\\prime)}{2E_{j^\\prime}(k_y^\\prime)}\\ ,\n\\label{gapeqn}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"\\Delta_{j}(k_{y})=-\\frac{1}{L_{y}}\\sum_{j^{\\prime}}^{j_{c}}\\sum_{k_{y}^{\\prime%&#10;}}^{k_{c}}F_{k_{y},j,k_{y}^{\\prime},j^{\\prime}}V_{\\text{e-h}}(k_{y}-k_{y}^{%&#10;\\prime})\\frac{\\Delta_{j^{\\prime}}(k_{y}^{\\prime})}{2E_{j^{\\prime}}(k_{y}^{%&#10;\\prime})}\\ ,\" display=\"block\"><mrow><mrow><mrow><msub><mi mathvariant=\"normal\">Δ</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>y</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><msub><mi>L</mi><mi>y</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msup><mi>j</mi><mo>′</mo></msup><msub><mi>j</mi><mi>c</mi></msub></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><msubsup><mi>k</mi><mi>y</mi><mo>′</mo></msubsup><msub><mi>k</mi><mi>c</mi></msub></munderover><mrow><msub><mi>F</mi><mrow><msub><mi>k</mi><mi>y</mi></msub><mo>,</mo><mi>j</mi><mo>,</mo><msubsup><mi>k</mi><mi>y</mi><mo>′</mo></msubsup><mo>,</mo><msup><mi>j</mi><mo>′</mo></msup></mrow></msub><mo>⁢</mo><msub><mi>V</mi><mtext>e-h</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>k</mi><mi>y</mi></msub><mo>-</mo><msubsup><mi>k</mi><mi>y</mi><mo>′</mo></msubsup></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mpadded width=\"+5pt\"><mfrac><mrow><msub><mi mathvariant=\"normal\">Δ</mi><msup><mi>j</mi><mo>′</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>k</mi><mi>y</mi><mo>′</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mn>2</mn><mo>⁢</mo><msub><mi>E</mi><msup><mi>j</mi><mo>′</mo></msup></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msubsup><mi>k</mi><mi>y</mi><mo>′</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac></mpadded></mrow></mrow></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.06942.tex", "nexttext": "\nFollowing Fig.\\ 1 of Ref. {\\hspace{-1 ex} \\nocite{{Brey2007}}\\citenum{{Brey2007}}}, we expect that  interband matrix elements will be small compared with  intraband matrix elements.  Thus in  Eq.\\ (\\ref{gapeqn}) we neglect the crosspairing terms,  where Cooper pairs would form with carriers\nfrom different subbands.\n\n\\section*{Results}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=15cm]{fig4.eps}\n\\caption{\n(a) Maximum superfluid gap $\\Delta^{\\mathrm{max}}_j$ for subbands $j=1,2\\dots$ as  function of density $n$.  The dotted line shows the total Fermi energy $E_F$.\nNanoribbon\nwidths $W=2$ nm and barrier thickness $d=5$ nm. The densities at which $E_F$ enters the bottom of a new subband are indicated by the vertical lines.  Note that  the $\\Delta^{\\mathrm{max}}_j$ are all of order $E_F$.   Right panels (b) - (d): momentum-dependent gaps $\\Delta_j(k_y)$ for subbands $j$ at densities marked by the arrows in panel (a) (at which $\\mu=\\varepsilon_{2},\\varepsilon_3,\\varepsilon_4$).}\n\\label{Deltasubband}\n\\end{figure}\n\nFigure \\ref{Deltamaxvsd} shows the maximum superfluid gap $\\overline{\\Delta}\\,^{\\mathrm{max}}$ as a function of the density $n$, averaged over the multiple subbands of the nanoribbons, calculated using Eqs.\\ \\ref{gapeqn} to \\ref{Vunscr}.\n$\\overline{\\Delta}\\,^{\\mathrm{max}}$ is the maximum value of the wave-vector\ndependent $\\overline{\\Delta}(k_y)$ averaged with respect to the subband\nindex $j$.\nThe nanoribbon width is $W=2$ nm, and $d$ is the thickness of the insulating barrier.\nThe densities at which the Fermi energy enters the bottom of a new subband\n$\\epsilon_j$, $j=1,2,\\dots$, are indicated by the vertical lines.\n\nIn Fig.\\ \\ref{Deltamaxvsd} we notice a local boost in\n$\\overline{\\Delta}\\,^{\\mathrm{max}}$ near the minimum of each subband for barrier\nthickness $d=5$ nm.  This boost\narises from shape resonance effects associated with the van Hove singularities\n(Fig.\\ \\ref{DOS}(b)) and the quantum size effects in the pairing interaction.\nHowever, for thinner barriers $d{\\,\\hbox{\\lower0.6ex\\hbox{$\\sim$}\\llap{\\raise0.6ex\\hbox{$<$}}}\\,} 4$ nm, where the  electron-hole pairing becomes progressively stronger,  the shape resonance effects are masked by a mixing of the subbands caused by the large superfluid gap.\nAs $\\overline{\\Delta}\\,^{\\mathrm{max}}$ grows larger than the\ntypical spacing between subbands, the system becomes decreasing less one-dimensional\nin character, thanks to the many channels available both  for Cooper pairing and for\nforming the  superfluid condensate.\n\n\n\n \\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig5.eps}\n\\caption{Ratio of chemical potential $\\mu$ to Fermi energy $E_F$ as function of density $n$.  $d$ is thickness of the insulating barrier separating the nanoribbons.  Nanoribbon width $W=2$ nm.  The vertical lines show the densities at which $E_F$ enters the bottom of a  subband.}\n \\label{muoveref}\n \\end{figure}\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig6.eps}\n\\caption{\nPair correlation length $\\overline{\\xi}/r_0$ averaged over subbands as function of $n$, the carrier density.  $d$ is  thickness of the insulating barrier separating the nanoribbons.  Nanoribbon width $W=2$ nm.  }\n \\label{xi}\n \\end{figure}\n\nFigure \\ref{Deltasubband}(a) shows the maximum superfluid\ngap $\\Delta^{\\texttt{max}}_j$ for the separate subbands $j$ as a\nfunction of  $n$ for nanoribbon width  $W=2$ nm and barrier\nthickness $d=5$ nm.\nFor comparison, the total Fermi energy $E_F$ of the non-interacting nanoribbon system at density $n$  is also shown.\nThe vertical lines  mark the densities at which\n$E_F$ enters a new subband.\nFor the lowest conduction subbands, there is a notable local boost in\n$\\Delta^{\\texttt{max}}_j$  as $E_F$ enters a new subband.\nThis boost takes the form of a shape resonance in the superfluid gaps\nassociated with a particular subband.\nHowever even\nfor the lowest subbands, we lose some  fine structure of the shape\nresonances because of mixing  by the gap of close lying subbands.\nOver the density range shown, the $\\Delta^{\\texttt{max}}_j$ remain always of order $E_F$, and hence they lie in the strongly coupled regime.\n\nFigures \\ref{Deltasubband}(b)-(d), show the\nmomentum-dependence of the subband gaps $\\Delta_j(k_y)$ for\ndensities at which the chemical potential\n$\\mu$ enters a new low-lying  subband (marked  in Fig.\\   \\ref{Deltasubband}(a) by the vertical arrows).\nThe peaks in $\\Delta_j(k_y)$ are broad on the scale of $k_F=\\pi/(2 r_0)$, the inverse of the average interparticle spacing, which\nconfirms that we are in the BCS-BEC crossover regime of compact electron-hole pairs.\nIn panels (c) and (d) of Fig.\\ \\ref{Deltasubband}, the multiple peaks of $\\Delta_j(k_y)$ are associated with the different Fermi energies of the subbands $(k_F)_j$, displaying a remaining fermionic character of the Cooper pairing in the BCS-BEC crossover regime.\n\nFigure \\ref{muoveref} shows the chemical potential $\\mu$\nas a function of density $n$  for\nnanoribbon width $W=2$ nm and  barrier thickness $d$.   $\\mu$ is normalized to the\ncorresponding Fermi energy of the non-interacting nanoribbon system at density $n$.\nThe chemical potential is strongly renormalized with respect to\nthe Fermi energy over the full  range of $n$ and $d$ shown.   When $E_F$ enters a subband,\n$\\mu$ has a dip.  This is in contrast to the peak seen in the superfluid gap, and it is a shape antiresonance\ncaused by the shape-resonance-generated peak in the gap.\nAs $d$ is decreased and the pairing strength weakens, $\\mu$ increases towards  $E_F$ and the shape (anti)resonances become sizeable, indicating\nthat the system has entered the BCS-BEC crossover regime.\nIn the case of $d=2$nm,  $\\mu\\ll E_F$ and the shape (anti)resonances are completely  smoothed out.  This is a result\nof  large superfluid gaps and it signals that the system is in the  strong pairing BEC regime.\nWhen the density increases, the system always\nevolves towards the weaker pairing BCS regime for all values of $d$, with $\\mu$ eventually arriving at $E_F$.\n\nThe average pair size of the Cooper pairs $\\xi_j$ in\nsubband $j$ is defined as the expectation value of the square of the\nrelative coordinate of the Cooper pairs with respect to the square of the\nBCS wave function projected in the subband.  This definition was originally\nintroduced in Ref.\\ {\\hspace{-1 ex} \\nocite{{Pistolesi1994}}\\citenum{{Pistolesi1994}}} to investigate the different regimes of pairing in high-$T_c$\nsuperconductivity in cuprates as a function of density.  It has been extended to a multigap superconductor\nthroughout the BCS-BEC crossover in Ref.\\  {\\hspace{-1 ex} \\nocite{{Guidini2014}}\\citenum{{Guidini2014}}} and to a multigap quasi-one-dimensional superfluid of\nultracold fermions confined in cigar-shaped traps \\cite{Shanenko2012}.\nIn  wave-vector space,\n\n\n", "itemtype": "equation", "pos": 11647, "prevtext": "\n\nwhere $L_y$ is the nanoribbon length, $F_{k_y,j,k_y^\\prime,j^\\prime}=[1+\\cos(\\theta_{k_y,j}-\\theta_{k_y^\\prime,{j^\\prime}})]/2$\nis the form factor coming from the overlap of the single-particle nanoribbon wave functions, with\n$\\theta_{k_y,j} = \\tan^{-1}(k_y/k_j)$, $V_{\\text{e-h}}(q)$ is the effective electron-hole pairing interaction, and\n $E_j(k_y) =[(\\epsilon_j(k_y) -\\mu)^2+\\Delta_j(k_y) ^2]^{1/2}$\n is the single-particle energy dispersion in the superfluid state\n  for subband $j$.  The wave-vector $k_y^\\prime$ is bounded by\nthe Brillouin zone boundary $\\pm k_c$.  We truncate the sum over the subband index  at $j^\\prime=j_c$, where $j_c$ is the lowest subband with a minimum above the graphene nanoribbon work function energy, taken  to be $\\sim 4.5$ eV.\nThe chemical potential $\\mu$ is fixed by the density equation,\n\n\\begin{eqnarray}\nn &=& \\frac{2}{W L_y}\\sum_{j}^{j_c}\\sum_{k_y}^{k_c} v_j(k_y)^2\\ ;\n\\label{gapeqn2}\\\\\n\\label{vk2}\nv_j(k_y)^2 &=& \\frac{1}{2}\\left[1 - \\frac{\\epsilon_j(k_y)-\\mu }{E_j(k_y) }\\right]\\ .\n\\end{eqnarray}\n\nThe  factor $2$ in Eq.\\ (\\ref{gapeqn2}) is due to the spin degeneracy.\n\nIn the calculations we neglect screening, an\napproximation that is justified\n{\\it a posteriori} as follows.  The screening is expected to be weak when the superfluidity lies\nin the strongly-coupled BEC or BCS-BEC crossover regimes because  the superfluid gap in these regimes of pairing is  comparable to the  Fermi energy, resulting in a\nlarge smearing of the Fermi surface, and compact electron-hole pairs  compared with their average spacing.  This makes their  mutual  interactions\n dipolar and weak.   In the BEC or BCS-BEC crossover\nregimes we can thus expect screening to be weak, and so we  neglect it.  However for weak-coupled BCS superfluidity, screening\nis known to be a strong effect,  which would make our  unscreened approximation a poor one in the BCS regime.  These effects have been documented  in the related system of\nsuperfluidity in coupled electron-hole sheets with parabolic energy band\ndispersion \\cite{Perali2013,Maezono2013}.\n\nThus in Eq.\\ (\\ref{gapeqn}) we approximate the  electron-hole  pairing attraction   $V_{\\text{e-h}}(q) $ by the bare Coulomb interaction.  For electrons and holes confined in nanoribbons of width $W$, separated by an insulating h-BN barrier of thickness $d$ and dielectric constant  $\\kappa=3$, we obtain \\cite{Brey2007},\n\n\n", "index": 3, "text": "\\begin{equation}\nV_{\\text{e-h}}(q) = \\frac{-2e^2}{\\kappa W^2}\\int_{0}^W \\!\\!\\!\\! \\int_{0}^W\\!\\!\\!\\!\\! dx^\\prime dx K_0(|q|\\sqrt{(x-x^\\prime)^2+d^2}).\n\\label{Vunscr}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"V_{\\text{e-h}}(q)=\\frac{-2e^{2}}{\\kappa W^{2}}\\int_{0}^{W}\\!\\!\\!\\!\\int_{0}^{W}%&#10;\\!\\!\\!\\!\\!dx^{\\prime}dxK_{0}(|q|\\sqrt{(x-x^{\\prime})^{2}+d^{2}}).\" display=\"block\"><mrow><mrow><mrow><msub><mi>V</mi><mtext>e-h</mtext></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>q</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mrow><mo>-</mo><mrow><mn>2</mn><mo>⁢</mo><msup><mi>e</mi><mn>2</mn></msup></mrow></mrow><mrow><mi>κ</mi><mo>⁢</mo><msup><mi>W</mi><mn>2</mn></msup></mrow></mfrac><mo>⁢</mo><mrow><mpadded width=\"-6.8pt\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>W</mi></msubsup></mpadded><mrow><mpadded width=\"-8.5pt\"><msubsup><mo largeop=\"true\" symmetric=\"true\">∫</mo><mn>0</mn><mi>W</mi></msubsup></mpadded><mrow><mrow><mo>𝑑</mo><msup><mi>x</mi><mo>′</mo></msup></mrow><mo>⁢</mo><mrow><mo>𝑑</mo><mi>x</mi></mrow><mo>⁢</mo><msub><mi>K</mi><mn>0</mn></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mo stretchy=\"false\">|</mo><mi>q</mi><mo stretchy=\"false\">|</mo></mrow><mo>⁢</mo><msqrt><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>-</mo><msup><mi>x</mi><mo>′</mo></msup></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mo>+</mo><msup><mi>d</mi><mn>2</mn></msup></mrow></msqrt></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.06942.tex", "nexttext": "\nwhere $u_j(k_y)^2=1-v_j(k_y)^2$.\n\nFigure \\ref{xi} shows the pair correlation length $\\overline{\\xi}/r_0$ as a function of density.  $\\overline{\\xi}/r_0$ is the partial average pair size for each subband averaged over the subbands.    The nanoribbon width\n$W=2$ nm. We designate $\\overline{\\xi}/r_0<0.25$ as the BEC regime,  $0.25<\\overline{\\xi}/r_0<4$ the BCS-BEC crossover regime, and  $\\overline{\\xi}/r_0>4$ the BCS regime.\nAs discussed, our approximation of neglecting screening is expected to be a good one for  densities lying in the BCS-BEC crossover and BEC regimes.\nAs expected, the density range for the strongly-coupled\nregime contracts with increasing barrier thickness $d$ because the pairing becomes weaker.\n\nWe have neglected effects from impurities and disorder.  We expect these effects to be small since while there is no\ndirect information on impurity and disorder effects in graphene nanoribbons,\nbut based on properties of analogous  coupled\nelectron-hole graphene monolayers, charge impurities concentrations up to\n$n_i < k_F/(\\pi d)$ are not expected  to destroy superfluidity  \\cite{Bistritzer}.\nAt graphene-hBN interfaces, the charge impurity density\n$n_i{\\,\\hbox{\\lower0.6ex\\hbox{$\\sim$}\\llap{\\raise0.6ex\\hbox{$>$}}}\\,} 10^{10}$ cm$^{-2}$ \\cite{Martin}, so for  $d {\\,\\hbox{\\lower0.6ex\\hbox{$\\sim$}\\llap{\\raise0.6ex\\hbox{$<$}}}\\,} 5$ nm, the inequality is satisfied provided $n {\\,\\hbox{\\lower0.6ex\\hbox{$\\sim$}\\llap{\\raise0.6ex\\hbox{$>$}}}\\,} 3\\times 10^6$ cm$^{-2}$.  This density  is orders of\nmagnitude less than current experimental densities.\n\n\\section*{Conclusions}\n\nThe superfluid gaps in our coupled electron-hole nanoribbon systems\nare large  in absolute value and comparable to the Fermi energy.  The quasi-one-dimensional confinement and the superfluid shape resonances due to quantum size\neffects both play an important role here.  The van Hove singularities in the densities of states act\nnon-linearly through the gap\nequation to significantly enhance the magnitude of the superfluid gaps.\nIn the range of nanoribbon densities and barrier separations considered, we find that the electron-hole superfluid is for the most part in the strongly coupled pairing regime, and so Coulomb screening effects are expected to be weak.\n\nWhen the superfluid gaps are comparable to the subband energy separations, the gaps\nmix the subbands and this results in a rounding of the shape resonances. This effect is most pronounced for small separations between the nanoribbons where  the  electron-hole coupling is particularly strong.\nFor larger separations, the electron-hole coupling is weaker and the superfluid gaps are smaller.  This results in weaker\nsubband mixing.  When this is the case, the shape resonances are sharper which strengthens the\nlocal amplification of the gaps.\n\nIn our quasi-one-dimensional system there is no direct\nlink between the superfluid transition temperature and\nthe size of the superfluid gaps calculated within mean field.\nIn our proposed device the zero temperature superfluid gaps are comparable\nto the Fermi energy, and can be of order of hundreds of meV.\nThus high transition temperature electron-hole superfluidity\ncould be expected, with  properties that are tuneable by changing the density.  The device configurations we propose are experimentally realizable with currently available technologies.  A superlattice formed of such nanoribbon devices\ncould further stabilize the electron-hole superfluid phase over  large areas.\n\n\n\\begin{thebibliography}{99}\n\n\\bibitem{Lozovik} Lozovik, Yu. E. \\& Yudson, V. I. Feasibility of superfluidity of paired spacially separated electrons and holes: a new superconductivity mechanism. {\\em Pis$'$ma Zh. Eksp. Teor. Fiz.} {\\bf 22}, 556-559 (1975) [{\\em JETP Lett.} {\\bf 22}, 274-276 (1975)].\n\n\\bibitem{SuperGr} Cartlidge, E. Graphene superconductivity seen. {\\em Physics World} {\\bf 28}, 10 (2015).\n\n\\bibitem{Gorbachev2012} Gorbachev, R. V. {\\em et  al.} Strong Coulomb drag and broken symmetry in double-layer graphene. {\\em Nature Phys.} {\\bf 8}, 896-901 (2012).\n\n\\bibitem{Geim2013} Geim, A. K. \\& Grigorieva, I. V.  Van der Waals heterostructures. {\\em Nature} {\\bf 499}, 419-425 (2013).\n\n\\bibitem{Mink} Mink, M. P., Stoof, H. T. C., Duine, R. A., \\& MacDonald, A. H. Influence of remote bands on exciton condensation in double-layer graphene. {\\em Phys. Rev. B} {\\bf 84}, 155409 (2011).\n\n\\bibitem{Min2008} Min, H., Bistritzer, R., Su, J., \\& MacDonald, A. H. Room-temperature superfluidity in graphene bilayers. {\\em Phys. Rev. B} {\\bf 78}, 121401(R) (2008).\n\n\\bibitem{comment} Bistritzer, R., Min, H., Su, J. -J., \\& MacDonald, A. H., Comment on ``Electron screening and excitonic condensation in double-layer graphene systems.''. http://arxiv.org/abs/0810.0331v1 (2008).\n\n\\bibitem{Lozovik2012} Lozovik, Yu. E., Ogarkov,  S. L., \\& Sokolik, A. A. Condensation of electron-hole pairs in a two-layer graphene system: Correlation effects. {\\em Phys. Rev. B} {\\bf 86}, 045429 (2012).\n\n\\bibitem{Perali2013} Perali, A., Neilson,  D., \\& Hamilton,  A. R., High-Temperature Superfluidity in Double-Bilayer Graphene. {\\em Phys. Rev. Lett.} {\\bf 110}, 146803 (2013).\n\n\\bibitem{Zarenia2014} Zarenia, M., Perali,  A., Neilson, D., \\& Peeters, F. M. Enhancement of electron-hole superfluidity in double few-layer graphene. {\\em Scientific Reports} {\\bf4}, 7319 (2014).\n\n\\bibitem{McCann} McCann, E. \\& Fal\\'{}ko,  V. I. Landau-Level Degeneracy and Quantum Hall Effect in a Graphite Bilayer. {\\em Phys. Rev. Lett.} {\\bf 96}, 086805 (2006).\n\n\\bibitem{Min2008b} Min, H. \\& MacDonald, A. H. Chiral decomposition in the electronic structure of graphene multilayers. {\\em Phys. Rev. B} {\\bf 77}, 155416 (2008).\n\n\\bibitem{Lin2010} Lin, Y. {\\em et al.} 100-GHz Transistors from Wafer-Scale Epitaxial Graphene. {\\em Science} {\\bf 327}, 662 (2010).\n\n\\bibitem{Dimiev2011} Dimiev, A. {\\em et al.} Low Loss, High Permittivity Composites Made from Graphene Nanoribbons. {\\em ACS Appl. Mater. Interfaces} {\\bf 3}, 4657-4661 (2011).\n\n\\bibitem{Dimiev2013} Dimiev, A. M. {\\em et al.} Permittivity of dielectric composite materials comprising graphene nanoribbons, The effect of nanostructure. {\\em ACS Appl. Mater. Interfaces} {\\bf 5}, 7567-7573 (2013).\n\n\\bibitem{Li2013} Li, L., Raji, A-R. O., \\& Tour, J. M. Graphene-Wrapped MnO$_2$-Graphene Nanoribbons as Anode Materials for high performance lithium batteries. {\\em Adv. Mater.} {\\bf 25} 6298-6302 (2013).\n\n\\bibitem{Kim2007} Han, M. Y., \\\"{O}zyilmaz, B., Zhang, Y., \\& Kim, Ph. Energy Band-Gap Engineering of Graphene Nanoribbons. {\\em Phys. Rev. Lett.} {\\bf 98}, 206805 (2007).\n\n\\bibitem{Cai} Cai, J. {\\em et  al.} Atomically precise bottom-up fabrication of graphene nanoribbons. {\\em Nature} {\\bf 466}, 470-473 (2010).\n\n\\bibitem{Perali1996} Perali, A., Bianconi,  A., Lanzara, A., \\& Saini, N. L. The gap amplification at a shape resonance in a superlattice of quantum stripes: A mechanism for high T$_\\mathrm{c}$. {\\em Solid State Commun.} {\\bf 100}, 181-186 (1996).\n\n\\bibitem{Bianconi1997} Bianconi, A., Valletta,  A., Perali,  A., Saini,  N. L. High T$_\\mathrm{c}$ superconductivity in a superlattice of quantum stripes. {\\em Solid State Commun.} {\\bf 102}, 369-374 (1997).\n\n\\bibitem{Bianconi1998} Bianconi, A., Valletta,  A., Perali,  A., Saini,  N. L. Superconductivity of a striped phase at the atomic limit. {\\em Physica C} {\\bf 296}, 269-280 (1998).\n\n\\bibitem{Shanenko2006} Shanenko,  A. A., Croitoru, M. D., Zgirski, M., Peeters, F. M., \\& Arutyunov, K. Size-dependent enhancement of superconductivity in Al and Sn nanowires: Shape-resonance effect. {\\em Phys. Rev. B} {\\bf 74}, 052502 (2006).\n\n\\bibitem{Brey2006} Brey, L. \\& Fertig, H. A. Electronic states of graphene nanoribbons studied with the Dirac equation {\\em Phys. Rev. B} {\\bf 73}, 235411 (2006).\n\n\\bibitem{Abergel} Abergel, D. S. L. Excitonic condensation in spatially separated one-dimensional systems.  {\\em Appl. Phys. Lett.} {\\bf 106}, 213103 (2015).\n\n\\bibitem{Maezono2013} Maezono, R., R\\'{i}os,  P. L., Ogawa,  T. and Needs, R. J.  Excitons and biexcitons in symmetric electron-hole bilayers. {\\em Phys. Rev. Lett.} {\\bf 110}, 216407 (2013).\n\n\\bibitem{Brey2007} Brey, L. \\& Fertig, H. A. Elementary electronic excitations in graphene nanoribbons. {\\em Phys. Rev. B} {\\bf 75}, 125434 (2007).\n\n\\bibitem{Pistolesi1994} Pistolesi, F., \\& Strinati, G. C. Evolution from BCS superconductivity to Bose condensation: role of the parameter $k_F\\xi$.\n{\\em Phys. Rev. B} {\\bf 49}, 6356 (1994).\n\n\\bibitem{Guidini2014} Guidini A., \\& Perali, A. Band-edge BCS-BEC crossover\nin a two-band superconductor: physical properties and detection parameters.\n{\\em Supercond. Sci. Technol.} {\\bf 27}, 124002 (2014).\n\n\\bibitem{Shanenko2012} Shanenko, A. A. {\\em et  al.} Atypical BCS-BEC crossover induced by quantum-size effects. {\\em Phys. Rev. A} {\\bf 86}, 033612 (2012).\n\n\\bibitem{Bistritzer} Bistritzer, R. \\& MacDonald, A. H. Influence of Disorder on Electron-Hole Pair Condensation in Graphene Bilayers. {\\em Phys. Rev. Lett.} {\\bf 101},\n256406 (2008).\n\n\\bibitem{Martin} Martin, J. {\\em et  al.} Observation of electron-hole puddles in graphene using a scanning single-electron transistor. {\\em Nature Phys.} {\\bf 4}, 144-148 (2008).\n\n\\end{thebibliography}\n\n\\section*{Acknowledgements}\n\nM.Z. acknowledges support by the Flemish Science\nFoundation (FWO-Vl), the University Research Fund (BOF),\nand the European Science Foundation (POLATOM).\nA.P. and D.N. acknowledge support by the University of Camerino\nFAR project CESEMN.\nThe authors thank the colleagues involved in the MultiSuper\nInternational Network (http://www.multisuper.org) for exchange of ideas and\nsuggestions for this work.\n\n\n", "itemtype": "equation", "pos": 18638, "prevtext": "\nFollowing Fig.\\ 1 of Ref. {\\hspace{-1 ex} \\nocite{{Brey2007}}\\citenum{{Brey2007}}}, we expect that  interband matrix elements will be small compared with  intraband matrix elements.  Thus in  Eq.\\ (\\ref{gapeqn}) we neglect the crosspairing terms,  where Cooper pairs would form with carriers\nfrom different subbands.\n\n\\section*{Results}\n\n\\begin{figure}[t]\n\\centering\n\\includegraphics[width=15cm]{fig4.eps}\n\\caption{\n(a) Maximum superfluid gap $\\Delta^{\\mathrm{max}}_j$ for subbands $j=1,2\\dots$ as  function of density $n$.  The dotted line shows the total Fermi energy $E_F$.\nNanoribbon\nwidths $W=2$ nm and barrier thickness $d=5$ nm. The densities at which $E_F$ enters the bottom of a new subband are indicated by the vertical lines.  Note that  the $\\Delta^{\\mathrm{max}}_j$ are all of order $E_F$.   Right panels (b) - (d): momentum-dependent gaps $\\Delta_j(k_y)$ for subbands $j$ at densities marked by the arrows in panel (a) (at which $\\mu=\\varepsilon_{2},\\varepsilon_3,\\varepsilon_4$).}\n\\label{Deltasubband}\n\\end{figure}\n\nFigure \\ref{Deltamaxvsd} shows the maximum superfluid gap $\\overline{\\Delta}\\,^{\\mathrm{max}}$ as a function of the density $n$, averaged over the multiple subbands of the nanoribbons, calculated using Eqs.\\ \\ref{gapeqn} to \\ref{Vunscr}.\n$\\overline{\\Delta}\\,^{\\mathrm{max}}$ is the maximum value of the wave-vector\ndependent $\\overline{\\Delta}(k_y)$ averaged with respect to the subband\nindex $j$.\nThe nanoribbon width is $W=2$ nm, and $d$ is the thickness of the insulating barrier.\nThe densities at which the Fermi energy enters the bottom of a new subband\n$\\epsilon_j$, $j=1,2,\\dots$, are indicated by the vertical lines.\n\nIn Fig.\\ \\ref{Deltamaxvsd} we notice a local boost in\n$\\overline{\\Delta}\\,^{\\mathrm{max}}$ near the minimum of each subband for barrier\nthickness $d=5$ nm.  This boost\narises from shape resonance effects associated with the van Hove singularities\n(Fig.\\ \\ref{DOS}(b)) and the quantum size effects in the pairing interaction.\nHowever, for thinner barriers $d{\\,\\hbox{\\lower0.6ex\\hbox{$\\sim$}\\llap{\\raise0.6ex\\hbox{$<$}}}\\,} 4$ nm, where the  electron-hole pairing becomes progressively stronger,  the shape resonance effects are masked by a mixing of the subbands caused by the large superfluid gap.\nAs $\\overline{\\Delta}\\,^{\\mathrm{max}}$ grows larger than the\ntypical spacing between subbands, the system becomes decreasing less one-dimensional\nin character, thanks to the many channels available both  for Cooper pairing and for\nforming the  superfluid condensate.\n\n\n\n \\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig5.eps}\n\\caption{Ratio of chemical potential $\\mu$ to Fermi energy $E_F$ as function of density $n$.  $d$ is thickness of the insulating barrier separating the nanoribbons.  Nanoribbon width $W=2$ nm.  The vertical lines show the densities at which $E_F$ enters the bottom of a  subband.}\n \\label{muoveref}\n \\end{figure}\n\n\n\\begin{figure}[h]\n\\centering\n\\includegraphics[width=8cm]{fig6.eps}\n\\caption{\nPair correlation length $\\overline{\\xi}/r_0$ averaged over subbands as function of $n$, the carrier density.  $d$ is  thickness of the insulating barrier separating the nanoribbons.  Nanoribbon width $W=2$ nm.  }\n \\label{xi}\n \\end{figure}\n\nFigure \\ref{Deltasubband}(a) shows the maximum superfluid\ngap $\\Delta^{\\texttt{max}}_j$ for the separate subbands $j$ as a\nfunction of  $n$ for nanoribbon width  $W=2$ nm and barrier\nthickness $d=5$ nm.\nFor comparison, the total Fermi energy $E_F$ of the non-interacting nanoribbon system at density $n$  is also shown.\nThe vertical lines  mark the densities at which\n$E_F$ enters a new subband.\nFor the lowest conduction subbands, there is a notable local boost in\n$\\Delta^{\\texttt{max}}_j$  as $E_F$ enters a new subband.\nThis boost takes the form of a shape resonance in the superfluid gaps\nassociated with a particular subband.\nHowever even\nfor the lowest subbands, we lose some  fine structure of the shape\nresonances because of mixing  by the gap of close lying subbands.\nOver the density range shown, the $\\Delta^{\\texttt{max}}_j$ remain always of order $E_F$, and hence they lie in the strongly coupled regime.\n\nFigures \\ref{Deltasubband}(b)-(d), show the\nmomentum-dependence of the subband gaps $\\Delta_j(k_y)$ for\ndensities at which the chemical potential\n$\\mu$ enters a new low-lying  subband (marked  in Fig.\\   \\ref{Deltasubband}(a) by the vertical arrows).\nThe peaks in $\\Delta_j(k_y)$ are broad on the scale of $k_F=\\pi/(2 r_0)$, the inverse of the average interparticle spacing, which\nconfirms that we are in the BCS-BEC crossover regime of compact electron-hole pairs.\nIn panels (c) and (d) of Fig.\\ \\ref{Deltasubband}, the multiple peaks of $\\Delta_j(k_y)$ are associated with the different Fermi energies of the subbands $(k_F)_j$, displaying a remaining fermionic character of the Cooper pairing in the BCS-BEC crossover regime.\n\nFigure \\ref{muoveref} shows the chemical potential $\\mu$\nas a function of density $n$  for\nnanoribbon width $W=2$ nm and  barrier thickness $d$.   $\\mu$ is normalized to the\ncorresponding Fermi energy of the non-interacting nanoribbon system at density $n$.\nThe chemical potential is strongly renormalized with respect to\nthe Fermi energy over the full  range of $n$ and $d$ shown.   When $E_F$ enters a subband,\n$\\mu$ has a dip.  This is in contrast to the peak seen in the superfluid gap, and it is a shape antiresonance\ncaused by the shape-resonance-generated peak in the gap.\nAs $d$ is decreased and the pairing strength weakens, $\\mu$ increases towards  $E_F$ and the shape (anti)resonances become sizeable, indicating\nthat the system has entered the BCS-BEC crossover regime.\nIn the case of $d=2$nm,  $\\mu\\ll E_F$ and the shape (anti)resonances are completely  smoothed out.  This is a result\nof  large superfluid gaps and it signals that the system is in the  strong pairing BEC regime.\nWhen the density increases, the system always\nevolves towards the weaker pairing BCS regime for all values of $d$, with $\\mu$ eventually arriving at $E_F$.\n\nThe average pair size of the Cooper pairs $\\xi_j$ in\nsubband $j$ is defined as the expectation value of the square of the\nrelative coordinate of the Cooper pairs with respect to the square of the\nBCS wave function projected in the subband.  This definition was originally\nintroduced in Ref.\\ {\\hspace{-1 ex} \\nocite{{Pistolesi1994}}\\citenum{{Pistolesi1994}}} to investigate the different regimes of pairing in high-$T_c$\nsuperconductivity in cuprates as a function of density.  It has been extended to a multigap superconductor\nthroughout the BCS-BEC crossover in Ref.\\  {\\hspace{-1 ex} \\nocite{{Guidini2014}}\\citenum{{Guidini2014}}} and to a multigap quasi-one-dimensional superfluid of\nultracold fermions confined in cigar-shaped traps \\cite{Shanenko2012}.\nIn  wave-vector space,\n\n\n", "index": 5, "text": "\\begin{equation}\n\\label{csi_pair_eq}\n\\xi_j=\\left[ \\frac{\\sum_{k_y} |\\nabla _{k_y} (u_j(k_y)v_j(k_y))|^2}{\\sum_{k_y} (u_j(k_y)v_i(k_y))^2}\\right]^{\\frac{1}{2}}\\ ,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"\\xi_{j}=\\left[\\frac{\\sum_{k_{y}}|\\nabla_{k_{y}}(u_{j}(k_{y})v_{j}(k_{y}))|^{2}%&#10;}{\\sum_{k_{y}}(u_{j}(k_{y})v_{i}(k_{y}))^{2}}\\right]^{\\frac{1}{2}}\\ ,\" display=\"block\"><mrow><mrow><msub><mi>ξ</mi><mi>j</mi></msub><mo>=</mo><mpadded width=\"+5pt\"><msup><mrow><mo>[</mo><mfrac><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><msub><mi>k</mi><mi>y</mi></msub></msub><msup><mrow><mo stretchy=\"false\">|</mo><mrow><msub><mo>∇</mo><msub><mi>k</mi><mi>y</mi></msub></msub><mo>⁡</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>u</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>y</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>v</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>y</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">|</mo></mrow><mn>2</mn></msup></mrow><mrow><msub><mo largeop=\"true\" symmetric=\"true\">∑</mo><msub><mi>k</mi><mi>y</mi></msub></msub><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>u</mi><mi>j</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>y</mi></msub><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>v</mi><mi>i</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>k</mi><mi>y</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac><mo>]</mo></mrow><mfrac><mn>1</mn><mn>2</mn></mfrac></msup></mpadded></mrow><mo>,</mo></mrow></math>", "type": "latex"}]