[{"file": "1601.01113.tex", "nexttext": "\nwhere ${\\texttt{a}}$ ranges over agents, with $[{\\texttt{a}}]\\phi$ standing for ``agent ${\\texttt{a}}$ knows $\\phi$'', and $\\alpha$ ranges over actions with $[\\alpha]\\phi$ standing for ``$\\phi$ holds after $\\alpha$''. $1_\\alpha$ represents the precondition of the action $\\alpha$ in the sense of \\cite{bms}. Negation is expressed by ${\\phi}\\rightarrow\\bot$.\n\n\\medskip\\noindent\\textbf{Operational rules. } Display calculi are sequent calculi in which the rules follow a particular format that guarantees good proof theoretic properties such as cut elimination. One of the major benefits is modularity: different calculi can be combined and rules can be added while the good properties are preserved.\n\n\nThe rules of the calculus are formulated in such a way that, in order to apply a rule to a formula, the formula needs to be `in display'. For example, the following or-introduction on the left (where contexts are denoted by $W,X,Y,Z$ and formulas by $A,B$)\n\n\n", "itemtype": "equation", "pos": 11730, "prevtext": "\n\n\\mainmatter\n\n\\title{Tool support for reasoning in display calculi}\n\n\\titlerunning{Reasoning in display calculi}\n\n\\author{Samuel Balco \\inst{1}\\thanks{Supported by an EPSRC-funded Vacation Bursary in Summer 2014 and the University of Leicester Career Development Service Graduate Gateways programme in Summer 2015.} \n\\and \nSabine Frittella \\inst{2} \n\\and \nGiuseppe Greco \\inst{2}\n\\and \nAlexander Kurz \\inst{3}\n\\and \nAlessandra Palmigiano\\inst{2}\\inst{4}}\n\n\\authorrunning{Balco \\and Frittella \\and  Greco \\and  Kurz \\and  Palmigiano}\n\n\\institute{\nDepartment of Computer Science, University of Oxford \n\\and\nFaculty of Technology, Policy and Management, Delft University of Technology\n\\and\nDepartment of Computer Science, University of Leicester \n\\and\nDepartment of Pure and Applied Mathematics, University of Johannesburg\n}\n\n\\maketitle\n\n\\begin{abstract} \nWe present a tool for reasoning in and about propositional sequent calculi. One aim is to support reasoning in calculi that contain a hundred rules or more, so that even relatively small pen and paper derivations become tedious and error prone. As an example, we implement the display calculus D.EAK of  dynamic epistemic logic. Second, we provide embeddings of  the calculus in the theorem prover Isabelle for formalising proofs about D.EAK. As a case study we show that the solution of the muddy children puzzle is derivable for any number of muddy children. Third, there is a set of meta-tools, that allows us to adapt the tool for a wide variety of user defined calculi.\n\\end{abstract}\n\n\n\n\\section{Introduction}\n\n\\medskip\\noindent\\textbf{Applied logic. }\nAn important development in logic, and in particular of logic in computer science, has been the move away from logic to logics. The need for automation of reasoning in AI or verification led to the design of hundreds of bespoke logics with good algorithmic properties for particular tasks. This development is particularly conspicuous in modal logic, the classic instance of which, Kripke's modal logic \\textbf{K}, is decidable just because it is a certain fragment of first-order logic \\cite{mlhandbook:BB}. To compensate for the lack of expressiveness that comes with decidability, one develops modal logics focussed on different aspects such as time, probability, space, etc. See \\cite{mlhandbook} for an overview of examples and techniques.\n\n\n\n\n\\medskip\\noindent\\textbf{The proof theory of modal logic} has had many successes, for example the tableaux methods of description logics with its applications to knowledge representation and ontologies \\cite{mlhandbook:F,mlhandbook:HHSS,mlhandbook:BL}.\n\nNevertheless, for many of the more sophisticated modal logics good proof systems are not known. A notable exception is the cut free sequent calculus of \\cite{Dyckhoff} for  dynamic epistemic logic  (without common knowledge). But given the diversity of modal logics and the importance of proof systems for reasoning about applications, it is desirable to have a systematic and uniform approach to the construction of modal proof systems with good proof theoretic properties.  \n\n\\medskip\\noindent\\textbf{Display calculi. } Following work on so-called display calculi \\cite{Belnap,Kracht,Gore96,Wansing,Gore98}, we engaged\nin the systematic study of display calculi of dynamic modal logics in \\cite{DEAK,Multitype,PDL}. The principal advantage of display calculi is that they are built in a modular way and important proof theoretic properties such as cut-elimination are preserved under combination of logics (if the combined logic is still displayable). \n\n\\medskip\\noindent\\textbf{Dynamic Epistemic Logic. } As a case study for the feasibility of this approach we developed a display calculus D.EAK for the  dynamic epistemic logic \\cite{Ditmarsch} of Baltag-Moss-Solecki \\cite{bms} without common knowledge. On the one hand this logic contains features that are a challenge from a proof theoretic point of view. On the other hand, dynamic epistemic logic has many applications, both in computer science and in other areas. One particular interest is the verification of security protocols that involves epistemic notions. In this paper, as a case study of intermediate complexity, we give a full proof of the muddy children puzzle. A nice collection of more epistemic puzzles is available in \\cite{DitmarschK15}.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\\medskip\\noindent\\textbf{Modularity. }\nOne aspect of the modularity of display calculi is that the logic is axiomatised by the structural rules, which can be added or removed in a flexible way. For example, even though D.EAK is based on classical propositional logic it can as well be based on intuitionistic or substructural logics by removing some of the structural rules. Another aspect of modularity is that it is easy to combine different such display calculi. But modularity also comes at cost. For example, D.EAK has more than a hundred rules. This poses no conceptual problems as the space of rules is well structured according to clear proof theoretic principles, but it does pose the practical problem of conducting the proofs and writing them down without making mistakes. Consequently, already for proof theoretic studies alone, tool support will be valuable.\n\n\\medskip\\noindent\\textbf{Contributions. }\nOne aim of the tool is to support researchers working on the proof theory of display calculi. The typical derivations may by relatively small, but they must be presented in a user interface in Latex in a style familiar to the working proof theorist. Moreover, in order to facilitate experimenting with different rules and calculi, meta-tools are needed that construct a calculus toolbox from a  given calculus description file.\n\nThe second aim is to support investigations into the question whether a calculus is suited to reasoning in some application area. To perform relevant case studies, one must deal with much bigger derivations and additional features such as abbreviations and derived rules are necessary. Another challenge is that applications may require additional reasoning outside the given calculus, for which we provide an interface with the theorem prover Isabelle.  \n\nMore specifically, in the work presented in this paper, we focus on D.EAK and aim for applications to epistemic protocols. In detail, we provide the following.\n\n\n\n\\begin{itemize}\n\n\\item A calculus description language that allows the specification of the  terms and rules as well as of their typesetting in ASCII, Isabelle and LaTeX in a calculus description file.\n\\item A program creating from a calculus description file the calculus toolbox, which comprises the following.\n\\begin{itemize}\n\\item A shallow embedding of the calculus in the theorem prover Isabelle. The shallow embedding encodes the terms and the rules of the calculus and allows us to verify in the theorem prover whether a sequent is derivable in D.EAK.\n\\item A deep embedding of the calculus in Isabelle. The deep embedding also has a datatype for derivations and allows us to prove theorems about derivations. \n\\item A user interface (UI) that supports\n\\begin{itemize}\n\\item interactive creation of proof trees,\n\\item simple automatic proof search (currently only up to depth 5),\n\\item export of proof trees to LaTeX and Isabelle,\n\\item the use of derived rules, abbreviations, and tactics.\n\\end{itemize}\n\\end{itemize}\n\\item A full formalisation of the proof system for dynamic epistemic logic of \\cite{DEAK}, which is the first display calculus of the logic of Baltag-Moss-Solecki \\cite{bms} (without common knowledge).\n\\item A fully formal proof (implemented in Isabelle) of the muddy children puzzle.\n\\item A set of meta-tools that enables a user to change the calculus.\n\\end{itemize}\n\n\\medskip\\noindent\\textbf{Case study: Muddy children}\n The first version of the tool presented at ALCOP 2015 supported the interactive construction of the proof trees in \\cite{DEAK} and their output to \\LaTeX. These proofs are not longer than a few dozen steps and of interest to establish  the mathematical result of completeness of the D.EAK. \n \nThe muddy children puzzle was chosen because it is a well-known example of an epistemic protocol and required us to extend the tool from one supporting short proofs of theoretical value to larger proofs in an application domain.\n \nOn the UI side, we added features including abbreviations, macros (derived rules), and two useful tactics. On the Isabelle side, we added a shallow embedding of D.EAK in which we do the inductive proof that the well-known solution of the muddy children puzzle holds for arbitrary number of children. Whereas most of the proof is done in D.EAK using the UI and then automatically translating to Isabelle, the induction itself is based on the higher order logic of Isabelle/HOL.\n\n\\medskip\\noindent\\textbf{Related work. } The papers \\cite{DawsonG01,DawsonG02} on proving cut elimination of display calculi in Isabelle have been a source of inspiration. Indeed, proving in Isabelle the variations \\cite{DEAK,Multitype,PDL} of Belnap's cut-elimination theorem remains one of our aims and we consider what we present in this paper as a necessary first step: Due to the notational overhead resulting from encoding the mathematical description of D.EAK into its  Isabelle formalisation, we found constructing even the simplest derivations in Isabelle too burdensome without tool support.\n\n\n\n\\medskip\\noindent The papers \\cite{Lescanne06,LescanneP07,Lescanne13} implement epistemic logic in the proof assistant Coq. It would be very interesting to conduct the work of this paper based on Coq to enable an in depth comparison.\n\n\\medskip\\noindent\\textbf{Comparison of Isabelle to other proof assistants. } Isabelle has the following advantages for us.\n\\begin{enumerate}\n\\item Isabelle supports the proof language Isar supporting a style of writing proofs that is close to mathematical practice. \n\\item Isabelle provides the so-called sledgehammer method, which uses specialised automatic theorem provers that are able to discharge much of the tedious, low level reasoning. \n\\item Isabelle can export theories into programming languages such as Scala. This allows us to build the user interface directly on the deep embedding of the calculus in Isabelle, thus reusing verified code.\n\\end{enumerate}\nAs far as we know Isabelle is the only proof assistant featuring all of the above. This will be important to us in Section~\\ref{sec:mc}, where we use (1) and (2) in order to write the mathematical parts of the proof of the solution of the muddy children puzzle in a mathematical style close to \\cite{MaPS14} and we use (3) and the user interface to build the derivations in D.EAK.\n\n\n\\medskip\\noindent\\textbf{Outline. } Section~\\ref{sec:deak}  reviews what one needs to know about D.EAK. Section~\\ref{sec:deak-tool} presents the main components of the DEAK calculus toolbox. Section~\\ref{sec:mc} discusses the implementation of the muddy children puzzle. Section~\\ref{sec:meta-tool} explains the efforts we have made to keep the tool parametric in the calculus. Section~\\ref{sec:conclusion} discusses directions of future research we plan to pursue.\n\n\\medskip\\noindent\\textbf{Acknowledgements. }  At several crucial points, we profited from expert advice on Isabelle by Tom Ridge, Thomas Tuerk and Christian Urban. We thank Roy Crole and Hans van Ditmarsch for valuable comments on an earlier draft.\n\n\n\\section{The display calculus D.EAK}\\label{sec:deak}\nThis section gives some background on D.EAK; for a complete description we refer to \\cite{DEAK} (where it is called D'.EAK). \n\n\\medskip\\noindent\\textbf{Formulas.} D.EAK is a proof system for (intuitionistic or classical) dynamic epistemic logic the formulas of which are defined by induction as follows:\n\n\n", "index": 1, "text": "\\begin{equation}\\label{eq:fma}\n\\begin{tabular}{|c|}\n\\hline\n$\\ {\\phi} ::= \\textsf{AtProp} \\mid \\bot \\mid \\top \\mid {\\phi} \\wedge {\\phi} \\mid {\\phi} \\vee {\\phi} \\mid {\\phi}\\rightarrow{\\phi} \\mid [{\\texttt{a}}]{\\phi} \\mid [\\alpha]{\\phi} \\mid \\langle {\\texttt{a}}\\rangle\\phi \\mid \\langle \\alpha\\rangle\\phi \\mid 1_\\alpha\\ \\ $\\\\\n\\hline\n\\end{tabular}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1.m1\" class=\"ltx_Math\" alttext=\"\\ {\\phi}::=\\textsf{AtProp}\\mid\\bot\\mid\\top\\mid{\\phi}\\wedge{\\phi}\\mid{\\phi}\\vee%&#10;{\\phi}\\mid{\\phi}\\rightarrow{\\phi}\\mid[{\\texttt{a}}]{\\phi}\\mid[\\alpha]{\\phi}%&#10;\\mid\\langle{\\texttt{a}}\\rangle\\phi\\mid\\langle\\alpha\\rangle\\phi\\mid 1_{\\alpha}\\ \\ \" display=\"inline\"><mrow><mpadded lspace=\"5pt\" width=\"+5pt\"><mi>ϕ</mi></mpadded><mo>:</mo><mo>:=</mo><mtext>𝖠𝗍𝖯𝗋𝗈𝗉</mtext><mo>∣</mo><mo>⊥</mo><mo>∣</mo><mo>⊤</mo><mo>∣</mo><mi>ϕ</mi><mo>∧</mo><mi>ϕ</mi><mo>∣</mo><mi>ϕ</mi><mo>∨</mo><mi>ϕ</mi><mo>∣</mo><mi>ϕ</mi><mo>→</mo><mi>ϕ</mi><mo>∣</mo><mrow><mo stretchy=\"false\">[</mo><mtext>𝚊</mtext><mo stretchy=\"false\">]</mo></mrow><mi>ϕ</mi><mo>∣</mo><mrow><mo stretchy=\"false\">[</mo><mi>α</mi><mo stretchy=\"false\">]</mo></mrow><mi>ϕ</mi><mo>∣</mo><mrow><mo stretchy=\"false\">⟨</mo><mtext>𝚊</mtext><mo stretchy=\"false\">⟩</mo></mrow><mi>ϕ</mi><mo>∣</mo><mrow><mo stretchy=\"false\">⟨</mo><mi>α</mi><mo stretchy=\"false\">⟩</mo></mrow><mi>ϕ</mi><mo>∣</mo><msub><mn>1</mn><mi>α</mi></msub><mo mathvariant=\"italic\" separator=\"true\"> </mo></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nis not permitted in a display calculus, since the formula $A\\vee B$ must be introduced in isolation as, for example, in our rule\n\n", "itemtype": "equation", "pos": 13048, "prevtext": "\nwhere ${\\texttt{a}}$ ranges over agents, with $[{\\texttt{a}}]\\phi$ standing for ``agent ${\\texttt{a}}$ knows $\\phi$'', and $\\alpha$ ranges over actions with $[\\alpha]\\phi$ standing for ``$\\phi$ holds after $\\alpha$''. $1_\\alpha$ represents the precondition of the action $\\alpha$ in the sense of \\cite{bms}. Negation is expressed by ${\\phi}\\rightarrow\\bot$.\n\n\\medskip\\noindent\\textbf{Operational rules. } Display calculi are sequent calculi in which the rules follow a particular format that guarantees good proof theoretic properties such as cut elimination. One of the major benefits is modularity: different calculi can be combined and rules can be added while the good properties are preserved.\n\n\nThe rules of the calculus are formulated in such a way that, in order to apply a rule to a formula, the formula needs to be `in display'. For example, the following or-introduction on the left (where contexts are denoted by $W,X,Y,Z$ and formulas by $A,B$)\n\n\n", "index": 3, "text": "\\begin{equation}\\label{eq:or-seq}\n\n\\text{\n{\\small{\n\n\n\\AX$W,A {\\mbox{$\\ \\vdash\\ $}} X$\n\\AX$Z,B {\\mbox{$\\ \\vdash\\ $}} Y$\n\\LeftLabel{$\\ (\\vee_L')$ \\ }\n\\BI$W,Z,A \\vee B {\\mbox{$\\ \\vdash\\ $}} X \\,, Y$\n\\DisplayProof \\\\\n\n\n}}}\n\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1.m1\" class=\"ltx_Math\" alttext=\"W,A{\\mbox{$\\ \\vdash\\ $}}X\" display=\"inline\"><mrow><mrow><mi>W</mi><mo>,</mo><mi>A</mi></mrow><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>X</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1.m2\" class=\"ltx_Math\" alttext=\"Z,B{\\mbox{$\\ \\vdash\\ $}}Y\" display=\"inline\"><mrow><mrow><mi>Z</mi><mo>,</mo><mi>B</mi></mrow><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>Y</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1.m3\" class=\"ltx_Math\" alttext=\"\\ (\\vee_{L}^{\\prime})\" display=\"inline\"><mrow><mo lspace=\"7.5pt\" stretchy=\"false\">(</mo><msubsup><mo>∨</mo><mi>L</mi><mo>′</mo></msubsup><mo stretchy=\"false\">)</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1.m4\" class=\"ltx_Math\" alttext=\"W,Z,A\\vee B{\\mbox{$\\ \\vdash\\ $}}X\\,,Y\" display=\"inline\"><mrow><mrow><mi>W</mi><mo>,</mo><mi>Z</mi><mo>,</mo><mrow><mi>A</mi><mo>∨</mo><mi>B</mi></mrow></mrow><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mrow><mpadded width=\"+1.7pt\"><mi>X</mi></mpadded><mo>,</mo><mi>Y</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\n\n\\medskip\\noindent\\textbf{Display rules. } In order to derived a rule such as $(\\vee_L')$ from the rule $(\\vee_L)$, it becomes necessary to isolate formulas by moving contexts to the other side. This is achieved, by pairing the structural connectives such as ``,'' (written `;' in D.EAK) with so-called adjoint (aka residuated) operators such as ``$>$'' and adding bidirectional display rules\n\\begin{center}\n{\\small{\n\\begin{tabular}{|rl|}\n\\hline\n\\AX$X\\, ; Y {\\mbox{$\\ \\vdash\\ $}} Z$\n\\LeftLabel{\\ $(;, >)$}\n\\doubleLine\n\\UI$Y {\\mbox{$\\ \\vdash\\ $}} X > Z$\n\\DisplayProof & \\ \\ \\ \\ \\ \\ \n\\AX$Z {\\mbox{$\\ \\vdash\\ $}} X\\, ; Y$\n\\RightLabel{$(>, ;)$\\ }\n\\doubleLine\n\\UI$X > Z {\\mbox{$\\ \\vdash\\ $}} Y$\n\\DisplayProof \\\\\n\\hline\n\\end{tabular}}}\n\\end{center}\nwhich, in this instance, allow us to isolate $Y$ on the left or right of the turnstile. \n\n\\medskip\\noindent \n\nThe name display calculus derives from the requirement that in a display calculus the so-called display property needs to hold: Each substructure can be isolated on the left-hand side, or, exclusively, on the right-hand side. This is the reason why we can confine ourselves, without loss of generality, to the special form of operational rules discussed above.\n\n\\medskip\\noindent\\textbf{Structures. }\nA systematic way of setting this up for the set of formulas \\eqref{eq:fma} is to introduce structural connectives corresponding to the operational connectives as follows. \n\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|}\n \\hline\n \\scriptsize{Structural} & {\\multicolumn}{2}{c|}{$<$}   & {\\multicolumn}{2}{c|}{$>$} & {\\multicolumn}{2}{c|}{$;$} & {\\multicolumn}{2}{c|}{I}  \n &{\\multicolumn}{2}{c|}{$\\{\\alpha\\}$}       & {\\multicolumn}{2}{c|}{${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$} & {\\multicolumn}{2}{c|}{$\\Phi_\\alpha$}   \n &{\\multicolumn}{2}{c|}{$\\{{\\texttt{a}}\\}$}       & {\\multicolumn}{2}{c|}{${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\}$}\\,}$}   \\\\\n \\hline\n \\scriptsize{\\ Operational\\ } & $\\, {\\mbox{\\rotatebox[origin=c]{180}{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}}\\, $ & $\\, \\leftarrow\\, $ & $\\, {\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}\\, $ & $\\, \\rightarrow\\, $  & $\\, \\wedge\\, $ & $\\, \\vee\\, $  & $\\, \\top\\, $ & $\\, \\bot\\, $    \n &  $\\, {\\langle}\\alpha{\\rangle}\\, $ & $\\, {\\lbrack}\\mkern2mu\\alpha\\mkern1mu{\\rbrack}\\, $  & $\\, {\\,\\rotatebox[origin=c]{90}{$\\langle\\rotatebox[origin=c]{-90}{$\\alpha$}\\rangle$}\\,}\\, $ & $\\, {\\,\\rotatebox[origin=c]{90}{$[\\mkern1.8mu\\rotatebox[origin=c]{-90}{$\\alpha$}\\mkern1.8mu]$}\\,}\\, $  & $\\, 1_\\alpha\\, $ & $\\, \\phantom{1_\\alpha}\\, $\n &  $\\, {\\langle}{\\texttt{a}}{\\rangle}\\, $ & $\\, {\\lbrack}\\mkern1.8mu{{\\texttt{a}}}\\mkern1.8mu{\\rbrack}\\, $   & $\\, {\\,\\rotatebox[origin=c]{90}{$\\langle\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\rangle$}\\,}\\, $  & $\\, {\\,\\rotatebox[origin=c]{90}{$[\\mkern1.8mu{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}}\\mkern1.8mu]$}\\,}\\,  $\\\\\n\\hline\n\\end{tabular}\n\\end{center}\nThis leads to a two tiered calculus which has formulas and structures, with structures generalising contexts and being built from structural connectives. \n\nWe briefly comment on the particular choice of structural connectives above.\nKeeping with the aim of modularity, D.EAK was designed in such a way that one can drop the exchange rule for `;' and treat non-commutative conjunction and disjunction. This means that we need two adjoints of `;' denoted by $>$ and $<$.\n\n\\footnote{\n\nFor example, taking into account the correspondence between operational and structural connectives, the rule $(;,>)$ above says precisely that the operation that maps $C$ to $A\\rightarrow C$ is right-adjoint to the operation that maps $B$ to $A\\wedge B$. Similarly, $(>,:)$ expresses that  $A{\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}} \\_$ is left adjoint to $A\\vee\\_$.\n\n} \n\nFollowing the symmetries inherent in this substructural analysis of logic suggests to add the operational connectives ${\\mbox{\\rotatebox[origin=c]{180}{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}}$, $\\leftarrow$, ${\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}$, but they are not needed in the following. Similarly, the modal operators $[\\alpha]$ and $[{\\texttt{a}}]$ have structural counterparts $\\{\\alpha\\}$ and $\\{{\\texttt{a}}\\}$ which in turn have adjoints ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$ and ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\}$}\\,}$. \nThe formulas \\eqref{eq:fma} do not have operational connectives corresponding to the structural connectives ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$ and ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\aga$}\\}$}\\,}$, but they can be added and are indeed useful (in terms of Kripke semantics, the adjoint of a box modality $\\Box$ for a relation $R$ is the diamond modality for the converse relation $R^{-1}$ often denoted by $\\blacklozenge$).\n\n\\medskip\\noindent\\textbf{Structural rules. } \nThe rules of D.EAK can be divided into operational rules and display rules, as discussed above, and structural rules, to which we turn now. The operational rules such as $(\\vee_L)$ specify how to introduce a logical operation. Display rules such as $(;>)$  are used to isolate formulas or structures to which we want to apply a specific rule. The logical axiomatisation sits in the structural rules. Apart from the structural rules like weakening, exchange, and contraction for `;' we have also other structural rules such as the display rules discussed above and rules that express properties such as `actions are partial functions' axiomatised by the rule\n\n\n", "itemtype": "equation", "pos": 13412, "prevtext": "\nis not permitted in a display calculus, since the formula $A\\vee B$ must be introduced in isolation as, for example, in our rule\n\n", "index": 5, "text": "\\begin{equation}\\label{or-deak}\n\\text{\n{\\small{\n\\begin{tabular}{|c|}\n\\hline\n\\AX$A {\\mbox{$\\ \\vdash\\ $}} X$\n\\AX$B {\\mbox{$\\ \\vdash\\ $}} Y$\n\\LeftLabel{$\\ \\ (\\vee_L)\\ $}\\RightLabel{\\ \\ }\n\\BI$A \\vee B {\\mbox{$\\ \\vdash\\ $}} X \\,; Y\\ $\n\\DisplayProof \\\\\n\\hline\n\\end{tabular}\n}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1.m1\" class=\"ltx_Math\" alttext=\"A{\\mbox{$\\ \\vdash\\ $}}X\" display=\"inline\"><mrow><mi>A</mi><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>X</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1.m2\" class=\"ltx_Math\" alttext=\"B{\\mbox{$\\ \\vdash\\ $}}Y\" display=\"inline\"><mrow><mi>B</mi><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>Y</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1.m3\" class=\"ltx_Math\" alttext=\"\\ \\ (\\vee_{L})\\ \" display=\"inline\"><mrow><mo lspace=\"12.5pt\" stretchy=\"false\">(</mo><msub><mo>∨</mo><mi>L</mi></msub><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1.m4\" class=\"ltx_Math\" alttext=\"A\\vee B{\\mbox{$\\ \\vdash\\ $}}X\\,;Y\\ \" display=\"inline\"><mrow><mrow><mi>A</mi><mo>∨</mo><mi>B</mi></mrow><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mrow><mpadded width=\"+1.7pt\"><mi>X</mi></mpadded><mo>;</mo><mpadded width=\"+5pt\"><mi>Y</mi></mpadded></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nand such as `if ${\\texttt{a}}$ knows $Y$, then $Y$ is true' axiomatised by\n\n", "itemtype": "equation", "pos": 19716, "prevtext": "\n\n\\medskip\\noindent\\textbf{Display rules. } In order to derived a rule such as $(\\vee_L')$ from the rule $(\\vee_L)$, it becomes necessary to isolate formulas by moving contexts to the other side. This is achieved, by pairing the structural connectives such as ``,'' (written `;' in D.EAK) with so-called adjoint (aka residuated) operators such as ``$>$'' and adding bidirectional display rules\n\\begin{center}\n{\\small{\n\\begin{tabular}{|rl|}\n\\hline\n\\AX$X\\, ; Y {\\mbox{$\\ \\vdash\\ $}} Z$\n\\LeftLabel{\\ $(;, >)$}\n\\doubleLine\n\\UI$Y {\\mbox{$\\ \\vdash\\ $}} X > Z$\n\\DisplayProof & \\ \\ \\ \\ \\ \\ \n\\AX$Z {\\mbox{$\\ \\vdash\\ $}} X\\, ; Y$\n\\RightLabel{$(>, ;)$\\ }\n\\doubleLine\n\\UI$X > Z {\\mbox{$\\ \\vdash\\ $}} Y$\n\\DisplayProof \\\\\n\\hline\n\\end{tabular}}}\n\\end{center}\nwhich, in this instance, allow us to isolate $Y$ on the left or right of the turnstile. \n\n\\medskip\\noindent \n\nThe name display calculus derives from the requirement that in a display calculus the so-called display property needs to hold: Each substructure can be isolated on the left-hand side, or, exclusively, on the right-hand side. This is the reason why we can confine ourselves, without loss of generality, to the special form of operational rules discussed above.\n\n\\medskip\\noindent\\textbf{Structures. }\nA systematic way of setting this up for the set of formulas \\eqref{eq:fma} is to introduce structural connectives corresponding to the operational connectives as follows. \n\n\\begin{center}\n\\begin{tabular}{|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|c|}\n \\hline\n \\scriptsize{Structural} & {\\multicolumn}{2}{c|}{$<$}   & {\\multicolumn}{2}{c|}{$>$} & {\\multicolumn}{2}{c|}{$;$} & {\\multicolumn}{2}{c|}{I}  \n &{\\multicolumn}{2}{c|}{$\\{\\alpha\\}$}       & {\\multicolumn}{2}{c|}{${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$} & {\\multicolumn}{2}{c|}{$\\Phi_\\alpha$}   \n &{\\multicolumn}{2}{c|}{$\\{{\\texttt{a}}\\}$}       & {\\multicolumn}{2}{c|}{${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\}$}\\,}$}   \\\\\n \\hline\n \\scriptsize{\\ Operational\\ } & $\\, {\\mbox{\\rotatebox[origin=c]{180}{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}}\\, $ & $\\, \\leftarrow\\, $ & $\\, {\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}\\, $ & $\\, \\rightarrow\\, $  & $\\, \\wedge\\, $ & $\\, \\vee\\, $  & $\\, \\top\\, $ & $\\, \\bot\\, $    \n &  $\\, {\\langle}\\alpha{\\rangle}\\, $ & $\\, {\\lbrack}\\mkern2mu\\alpha\\mkern1mu{\\rbrack}\\, $  & $\\, {\\,\\rotatebox[origin=c]{90}{$\\langle\\rotatebox[origin=c]{-90}{$\\alpha$}\\rangle$}\\,}\\, $ & $\\, {\\,\\rotatebox[origin=c]{90}{$[\\mkern1.8mu\\rotatebox[origin=c]{-90}{$\\alpha$}\\mkern1.8mu]$}\\,}\\, $  & $\\, 1_\\alpha\\, $ & $\\, \\phantom{1_\\alpha}\\, $\n &  $\\, {\\langle}{\\texttt{a}}{\\rangle}\\, $ & $\\, {\\lbrack}\\mkern1.8mu{{\\texttt{a}}}\\mkern1.8mu{\\rbrack}\\, $   & $\\, {\\,\\rotatebox[origin=c]{90}{$\\langle\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\rangle$}\\,}\\, $  & $\\, {\\,\\rotatebox[origin=c]{90}{$[\\mkern1.8mu{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}}\\mkern1.8mu]$}\\,}\\,  $\\\\\n\\hline\n\\end{tabular}\n\\end{center}\nThis leads to a two tiered calculus which has formulas and structures, with structures generalising contexts and being built from structural connectives. \n\nWe briefly comment on the particular choice of structural connectives above.\nKeeping with the aim of modularity, D.EAK was designed in such a way that one can drop the exchange rule for `;' and treat non-commutative conjunction and disjunction. This means that we need two adjoints of `;' denoted by $>$ and $<$.\n\n\\footnote{\n\nFor example, taking into account the correspondence between operational and structural connectives, the rule $(;,>)$ above says precisely that the operation that maps $C$ to $A\\rightarrow C$ is right-adjoint to the operation that maps $B$ to $A\\wedge B$. Similarly, $(>,:)$ expresses that  $A{\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}} \\_$ is left adjoint to $A\\vee\\_$.\n\n} \n\nFollowing the symmetries inherent in this substructural analysis of logic suggests to add the operational connectives ${\\mbox{\\rotatebox[origin=c]{180}{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}}$, $\\leftarrow$, ${\\mbox{$\\,{\\rotatebox[origin=c]{-90}{\\raisebox{0.12ex}{${\\wedge}$}}{\\mkern-2mu{\\rule[0.5865ex]{1.38ex}{0.1ex}}}}\\,$}}$, but they are not needed in the following. Similarly, the modal operators $[\\alpha]$ and $[{\\texttt{a}}]$ have structural counterparts $\\{\\alpha\\}$ and $\\{{\\texttt{a}}\\}$ which in turn have adjoints ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$ and ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{${\\texttt{a}}$}\\}$}\\,}$. \nThe formulas \\eqref{eq:fma} do not have operational connectives corresponding to the structural connectives ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\alpha$}\\}$}\\,}$ and ${\\,\\rotatebox[origin=c]{90}{$\\{\\rotatebox[origin=c]{-90}{$\\aga$}\\}$}\\,}$, but they can be added and are indeed useful (in terms of Kripke semantics, the adjoint of a box modality $\\Box$ for a relation $R$ is the diamond modality for the converse relation $R^{-1}$ often denoted by $\\blacklozenge$).\n\n\\medskip\\noindent\\textbf{Structural rules. } \nThe rules of D.EAK can be divided into operational rules and display rules, as discussed above, and structural rules, to which we turn now. The operational rules such as $(\\vee_L)$ specify how to introduce a logical operation. Display rules such as $(;>)$  are used to isolate formulas or structures to which we want to apply a specific rule. The logical axiomatisation sits in the structural rules. Apart from the structural rules like weakening, exchange, and contraction for `;' we have also other structural rules such as the display rules discussed above and rules that express properties such as `actions are partial functions' axiomatised by the rule\n\n\n", "index": 7, "text": "\\begin{equation}\n\\text{\n{\\small{\n\\begin{tabular}{|c|}\n\\hline\n\\AX$X {\\mbox{$\\ \\vdash\\ $}} Y$\n\\RightLabel{\\emph{}}\n\\UI$\\{\\alpha\\} X{\\mbox{$\\ \\vdash\\ $}} \\{\\alpha\\} Y$\n\\DisplayProof\\\\\n\\hline\n\\end{tabular}\n}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1.m1\" class=\"ltx_Math\" alttext=\"X{\\mbox{$\\ \\vdash\\ $}}Y\" display=\"inline\"><mrow><mi>X</mi><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>Y</mi></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1.m2\" class=\"ltx_Math\" alttext=\"\\{\\alpha\\}X{\\mbox{$\\ \\vdash\\ $}}\\{\\alpha\\}Y\" display=\"inline\"><mrow><mrow><mrow><mo stretchy=\"false\">{</mo><mi>α</mi><mo stretchy=\"false\">}</mo></mrow><mo>⁢</mo><mi>X</mi></mrow><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mi>α</mi><mo stretchy=\"false\">}</mo></mrow><mo>⁢</mo><mi>Y</mi></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\n\n\\medskip\\noindent\\textbf{Modularity of D.EAK and related calculi. }  We have seen that D.EAK  has a large number of connectives. But they arise according to clear principles: operational connectives have structural counterparts which in turn have adjoints. Similarly, the fact that D.EAK has over a hundred rules poses no problems from a conceptual point as the rules fall into clearly delineated classes each serving their own purpose. It is exactly this feature which enables the modularity of the display logic approach to the proof theory of sequent calculi. But, from a practical point of view of creating proof trees or of composing a number of different calculi, this large number of connectives and rules makes working with these calculi difficult. Moreover, the  encoding of terms and proof trees needed for automatic processing will not be readable to humans who would expect to manipulate latexed prooftrees in an easy interactive way. How we propose to solve these problems will be discussed in the next section.\n\n\\section{The DEAK calculus toolbox}\\label{sec:deak-tool}\n\nThe aim of the DEAK calculus tool \\cite{Balco:DEAK} is to support research on the proof theory of dynamic epistemic logic as well as to conduct case studies exploring possible applications.  It provides a shallow and a deep embedding of D.EAK into Isabelle and a user interface implemented in Scala. \n\nThe shallow embedding has an inductive datatype for the terms of the calculus and encodes the rules via a predicate describing which terms are derivable. It is used to prove correct the solution of the muddy children puzzle in Section~\\ref{sec:mc}.\n\nThe deep embedding also has datatypes for rules and derivations and provides functionality such as rule application (match and replace) as well as automatic proof search and tactics. The corresponding Isabelle code is exported to Scala and used in the user interface.\n\nD.EAK proof trees can be constructed interactively in a graphical user interface  by manipulating trees typeset in LaTeX. Proof trees can be exported to LaTeX/pdf and Isabelle.   This was essential for creating the Isabelle proof in Section~\\ref{sec:mc}. Examples can be found in the the folder \\texttt{LaTeX} in \\cite{Balco:MC}: The \\texttt{.cs} files contain the proofs as done in the UI and the \\texttt{.tex}-files the exported LaTeX code. The tag \\texttt{cleaned\\_up} was added after a small amount of manual post-processing of the \\texttt{.tex}-files.\n\n\n\n\n\\subsection{Shallow embedding (SE)  in Isabelle}\\label{sec:se}\n\nThe shallow embedding of the calculus D.EAK is available in the files \\texttt{DEAK\\_SE.thy} and \\texttt{DEAK\\_SE\\_core.thy}. The file \\texttt{DEAK\\_SE\\_core.thy} contains the definitions of the terms via datatypes \\texttt{Atprop, Formula, Structure, Sequent}. For example,\n\n\\begin{pyglist}[language = isabelle]\ndatatype Sequent = Sequent Structure Structure (\"_ â\u008a¢ _\")\n\\end{pyglist}\n\n\\noindent declares that an element of datatype \\texttt{Sequent} consists of two structures. The annotation \\texttt{(\"\\_ â\u008a¢ \\_\")} allows us to use the familiar infix notation $\\vdash$ in the Isabelle IDE. \n\nThe file \\texttt{DEAK\\_SE.thy} encodes the rules of the calculus by defining a predicate \\texttt{derivable}\n\n\\begin{pyglist}[language = isabelle]\ninductive derivable :: \"Locale list => Sequent => bool\"  (\"_ â\u008a¢d _\")\n\\end{pyglist}\n\n\\noindent by induction over the rules of D.EAK. For example, the rule $(\\vee_L)$ above is encoded as\n\n\\begin{pyglist}[language = isabelle]\nOr_L:  \"l â\u008a¢d (B â\u008a¢ Y) â\u009f¹ l â\u008a¢d (A â\u008a¢ X) â\u009f¹ l â\u008a¢d (A â\u0088¨ B â\u008a¢ X ; Y)\"\n\\end{pyglist}\n\n\\noindent which expresses in the higher-order logic of Isabelle/HOL that if $B\\vdash Y$ and $A\\vdash X$ are derivable, then $A\\vee B\\vdash X;Y$ is derivable.\n\nNote that $A,B,X,Y$ are variables of Isabelle. The rule will be applied using the built-in reasoning mechanism of Isabelle/HOL which includes pattern matching. \n\nThe datatype \\texttt{Locale} is used to carry around all the information needed in a proof that is not directly available, in a bottom up proof search, from the sequent on which we want to perform a rule.\n\nFor example, in order to perform a cut, we need to specify the cut formula. In the UI, when constructing a prooftree interactively, it will be given by the user. Internally, cut-formulas are of type \\texttt{Locale}  and the cut-rule is given by\n\n\\begin{pyglist}[language = json]\n\"(CutFormula f)â\u0088\u0088set l â\u009f¹ lâ\u008a¢d(X â\u008a¢ f) â\u009f¹ lâ\u008a¢d(f â\u008a¢Y) â\u009f¹ lâ\u008a¢d(X â\u008a¢Y)\"\n\\end{pyglist}\n\nSimilarly, the rules that describe the interaction of the knowledge of agents with epistemic actions depend on the so-called action structures, which define the actions, but are not part of the calculus itself. These action structures, therefore, are also encoded by data of type \\texttt{Locale}.\n\nBefore coming to the deep embedding next, we would like to emphasise, that in order to prove in the shallow embedding, that a certain sequent is derivable in D.EAK, one shows in theorem prover Isabelle/HOL that the sequent is in the extension of the predicate \\texttt{derivable}. The proof itself is not available as data that can be manipulated. For example, with the shallow embedding, it will not be possible to write an Isabelle function that transforms a proof into a cut-free proof. (Cut-elimination is a topic we had to defer to future work, but we do make use of the deep embedding in the user interface.) \n\n\\subsection{Deep embedding (DE) in Isabelle}\n\nThe deep embedding is available in the files \\texttt{DEAK.thy} and \\texttt{DEAK\\_core.thy}. The latter contains the encoding of the terms of D.EAK, which differs only slightly from the one of the shallow embedding. It also contains functions match and replace, plus some easy lemmas about their behaviour. The functions match and replace are used  in \\texttt{DEAK.thy} to define how rules are applied to sequents.\n\n\\texttt{DEAK.thy} starts out by defining the datatypes \\texttt{Rule} and \\texttt{Prooftree}. The function \\texttt{der} implements how to reason backwards from a goal:\n\\begin{pyglist}[language=isabelle]\nfun der :: \"Locale â\u0087\u0092 Rule â\u0087\u0092 Sequent â\u0087\u0092 (Rule * Sequent list)\"\n\\end{pyglist}\n\n\\noindent takes a locale, a rule $r$, and a sequent $s$ and outputs the list of premises needed to prove the $s$ via $r$.\n\n\\footnote{It is at this point where our implementation of the deep embedding is currently tailored towards substructural logics: For each rule $r$ and each sequent $s$, there is only one list of premises to consider. Generalising the deep embedding to sequent calculi with rules such as \\eqref{eq:or-seq} would require a modification: If we interpret the structure $W,X,A\\vee B$ in \\eqref{eq:or-seq} not as a structure (ie tree) but as a list, then matching the rule \\eqref{eq:or-seq} against a sequent would typically not determine the sublists matching $W$ and $X$ in a unique way. More information is available at \\cite{Balco:tutorial}.} \n\nThis function is then used to define the predicate \\texttt{isProofTree} and other functions that are used by the UI.\n\nOne reason to define the deep embedding in Isabelle (and not e.g. directly in the UI) is that we want to use it in future work to implement, and prove correct, cut elimination for D.EAK and related calculi.\n\n\\subsection{Functionality of the user interface (UI)}\n\nFor the reasons described at the end of Section~\\ref{sec:deak}, the UI is an essential part of the tool. The UI provides the following functionality:\n\\begin{itemize}\n\\item\n    LaTeX typesetting of the terms of the calculus, with user specified syntactic sugar.\n\\item\n    Graphical representation of proof trees in LaTeX\n\\item\n    Exporting proof trees to LaTeX/pdf and to Isabelle (both SE and DE).\n\\item\n    Automatic proof search (to a modest depth of 5).\n\\item\n    Interactive proof tree creation and modification, including merging proof trees, deleting portions of proof trees, and applying rules. \n\\item Tactics for deriving the generalised identity and atom rules.\n\\item User defined abbreviations and macros (derived rules). \n\\end{itemize}\n\\noindent\nThe UI is implemented in Scala. There were several reasons for choosing Scala, one of which is Isabelle's code export functionality which translates functions written in Isabelle theory files to be exported into functional languages such as Scala or Haskell, amongst others. This meant that the underlying formalisation of terms, rules and proof trees of the deep embedding of the calculus and the functions necessary for building and verifying proof trees could be built in Isabelle and then exported for the UI into Scala.\n\nAnother advantage of using Scala is the fact that it is based on Java and runs on the JVM, which makes code execution fast enough, and, more importantly,  is cross platform and allows the use of Java libraries. This was especially useful when creating the graphical interface for manipulating proof trees, as the UI depends on two libraries, JLaTeXMath\n\nand abego TreeLayout\n\n, which allow for easy typesetting and pretty-printing of the proof trees as well as simple visual creation and modification of proof trees in the UI.\n\n\\section{Case study: The muddy children puzzle}\\label{sec:mc}\n\nThe muddy children puzzle is a classical example of reasoning in dynamic epistemic logic, since it highlights how epistemic actions such as public announcements modify the knowledge of agents. We will recall the puzzle  in some detail below. The solution will state that, after $k$ rounds of all agents announcing ``I don't know'', all agents do in fact know.\n\nThe correctness of the solution has been established, for all $k\\in\\mathbb{N}$ using induction,  by informal mathematical proof \\cite{FHMV} and by mathematical proofs about a formalisation in a Hilbert calculus \\cite{MaPS14}. It has also been automatically verified, for small values of $k$, using techniques from model checking \\cite{HalpernVardi}  and automated theorem proving \\cite{Dyckhoff,Truffaut:msc}.\n\nHere, we prove in Isabelle/HOL that for all $k$ the solution is derivable in D.EAK.\n\n\\subsection{The muddy children puzzle}\nThere are $n>0$ children and $0 < k \\leq n$ of them have mud on their foreheads. Each child sees (and hence knows) which of the others is dirty. But they cannot see (and therefore do not know at the beginning) whether they are dirty themselves (thus the number $n$ is known to them but $k$ is not). The first epistemic action is the father announcing (publicly and truthfully) that at least one of the children is dirty. From then on the protocol proceeds in rounds. In each round all children announce (simultaneously, publicly, truthfully) whether they know that they are dirty or not. How many rounds need to be played until the dirty children know that they are dirty?\n\n\n\\medskip\\noindent In case $n=1,k=1$ the only child knows that it must be dirty, since the announcement by the father, as all announcements in this protocol, are assumed to be truthful. We write this as \n\n\n", "itemtype": "equation", "pos": 20012, "prevtext": "\nand such as `if ${\\texttt{a}}$ knows $Y$, then $Y$ is true' axiomatised by\n\n", "index": 9, "text": "\\begin{equation}\n\\text{\n{\\small{\n\\begin{tabular}{|c|}\n\\hline\n\\AX$X {\\mbox{$\\ \\vdash\\ $}}  \\{{\\texttt{a}}\\} Y$\n\\RightLabel{\\emph{}}\n\\UI$X{\\mbox{$\\ \\vdash\\ $}} Y$\n\\DisplayProof\\\\\n\\hline\n\\end{tabular}\n}}}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1.m1\" class=\"ltx_Math\" alttext=\"X{\\mbox{$\\ \\vdash\\ $}}\\{{\\texttt{a}}\\}Y\" display=\"inline\"><mrow><mi>X</mi><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mrow><mrow><mo stretchy=\"false\">{</mo><mtext>𝚊</mtext><mo stretchy=\"false\">}</mo></mrow><mo>⁢</mo><mi>Y</mi></mrow></mrow></math>\n<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1.m2\" class=\"ltx_Math\" alttext=\"X{\\mbox{$\\ \\vdash\\ $}}Y\" display=\"inline\"><mrow><mi>X</mi><mo lspace=\"7.5pt\" rspace=\"7.5pt\">⊢</mo><mi>Y</mi></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\n\n where $D_j$ is an atomic proposition encoding that child $j$ is dirty, $\\Box_j p$ means child $j$ knows $p$ and $[{\\textsf{father}}]p$ means that $p$ after father's announcement.\n\n\\medskip\\noindent The case $n>1$ and $k=1$ is similar. Let $j$ be the dirty child. It sees, and therefore knows, that all the other children are clean. Since, after father's announcement, child $j$ knows that there is at least one dirty child, it must be $j$, and $j$ knows it.\n\n\\medskip\\noindent In case $n>1$ and $k=2$ let $J=\\{j,h\\}$ be the set of dirty children. After father's announcement both $j$ and $h$ see one dirty child. But they do not know whether they are dirty themselves. So, according to the protocol, they announce that they do not know whether they are dirty. From the fact that $h$ announced $\\neg\\Box_h D_h$, child $j$ can conclude $D_j$, that is, we have $\\Box_j D_j$.\nTo see this, $j$ reasons that if $j$ was clean, then $h$ would be in the situation of the previous paragraph, that is, we had $\\Box_h D_h$, in contradiction to the truthfulness of the announcement of $h$.\nSummarising, we have shown \n\n\n", "itemtype": "equation", "pos": 31172, "prevtext": "\n\n\\medskip\\noindent\\textbf{Modularity of D.EAK and related calculi. }  We have seen that D.EAK  has a large number of connectives. But they arise according to clear principles: operational connectives have structural counterparts which in turn have adjoints. Similarly, the fact that D.EAK has over a hundred rules poses no problems from a conceptual point as the rules fall into clearly delineated classes each serving their own purpose. It is exactly this feature which enables the modularity of the display logic approach to the proof theory of sequent calculi. But, from a practical point of view of creating proof trees or of composing a number of different calculi, this large number of connectives and rules makes working with these calculi difficult. Moreover, the  encoding of terms and proof trees needed for automatic processing will not be readable to humans who would expect to manipulate latexed prooftrees in an easy interactive way. How we propose to solve these problems will be discussed in the next section.\n\n\\section{The DEAK calculus toolbox}\\label{sec:deak-tool}\n\nThe aim of the DEAK calculus tool \\cite{Balco:DEAK} is to support research on the proof theory of dynamic epistemic logic as well as to conduct case studies exploring possible applications.  It provides a shallow and a deep embedding of D.EAK into Isabelle and a user interface implemented in Scala. \n\nThe shallow embedding has an inductive datatype for the terms of the calculus and encodes the rules via a predicate describing which terms are derivable. It is used to prove correct the solution of the muddy children puzzle in Section~\\ref{sec:mc}.\n\nThe deep embedding also has datatypes for rules and derivations and provides functionality such as rule application (match and replace) as well as automatic proof search and tactics. The corresponding Isabelle code is exported to Scala and used in the user interface.\n\nD.EAK proof trees can be constructed interactively in a graphical user interface  by manipulating trees typeset in LaTeX. Proof trees can be exported to LaTeX/pdf and Isabelle.   This was essential for creating the Isabelle proof in Section~\\ref{sec:mc}. Examples can be found in the the folder \\texttt{LaTeX} in \\cite{Balco:MC}: The \\texttt{.cs} files contain the proofs as done in the UI and the \\texttt{.tex}-files the exported LaTeX code. The tag \\texttt{cleaned\\_up} was added after a small amount of manual post-processing of the \\texttt{.tex}-files.\n\n\n\n\n\\subsection{Shallow embedding (SE)  in Isabelle}\\label{sec:se}\n\nThe shallow embedding of the calculus D.EAK is available in the files \\texttt{DEAK\\_SE.thy} and \\texttt{DEAK\\_SE\\_core.thy}. The file \\texttt{DEAK\\_SE\\_core.thy} contains the definitions of the terms via datatypes \\texttt{Atprop, Formula, Structure, Sequent}. For example,\n\n\\begin{pyglist}[language = isabelle]\ndatatype Sequent = Sequent Structure Structure (\"_ â\u008a¢ _\")\n\\end{pyglist}\n\n\\noindent declares that an element of datatype \\texttt{Sequent} consists of two structures. The annotation \\texttt{(\"\\_ â\u008a¢ \\_\")} allows us to use the familiar infix notation $\\vdash$ in the Isabelle IDE. \n\nThe file \\texttt{DEAK\\_SE.thy} encodes the rules of the calculus by defining a predicate \\texttt{derivable}\n\n\\begin{pyglist}[language = isabelle]\ninductive derivable :: \"Locale list => Sequent => bool\"  (\"_ â\u008a¢d _\")\n\\end{pyglist}\n\n\\noindent by induction over the rules of D.EAK. For example, the rule $(\\vee_L)$ above is encoded as\n\n\\begin{pyglist}[language = isabelle]\nOr_L:  \"l â\u008a¢d (B â\u008a¢ Y) â\u009f¹ l â\u008a¢d (A â\u008a¢ X) â\u009f¹ l â\u008a¢d (A â\u0088¨ B â\u008a¢ X ; Y)\"\n\\end{pyglist}\n\n\\noindent which expresses in the higher-order logic of Isabelle/HOL that if $B\\vdash Y$ and $A\\vdash X$ are derivable, then $A\\vee B\\vdash X;Y$ is derivable.\n\nNote that $A,B,X,Y$ are variables of Isabelle. The rule will be applied using the built-in reasoning mechanism of Isabelle/HOL which includes pattern matching. \n\nThe datatype \\texttt{Locale} is used to carry around all the information needed in a proof that is not directly available, in a bottom up proof search, from the sequent on which we want to perform a rule.\n\nFor example, in order to perform a cut, we need to specify the cut formula. In the UI, when constructing a prooftree interactively, it will be given by the user. Internally, cut-formulas are of type \\texttt{Locale}  and the cut-rule is given by\n\n\\begin{pyglist}[language = json]\n\"(CutFormula f)â\u0088\u0088set l â\u009f¹ lâ\u008a¢d(X â\u008a¢ f) â\u009f¹ lâ\u008a¢d(f â\u008a¢Y) â\u009f¹ lâ\u008a¢d(X â\u008a¢Y)\"\n\\end{pyglist}\n\nSimilarly, the rules that describe the interaction of the knowledge of agents with epistemic actions depend on the so-called action structures, which define the actions, but are not part of the calculus itself. These action structures, therefore, are also encoded by data of type \\texttt{Locale}.\n\nBefore coming to the deep embedding next, we would like to emphasise, that in order to prove in the shallow embedding, that a certain sequent is derivable in D.EAK, one shows in theorem prover Isabelle/HOL that the sequent is in the extension of the predicate \\texttt{derivable}. The proof itself is not available as data that can be manipulated. For example, with the shallow embedding, it will not be possible to write an Isabelle function that transforms a proof into a cut-free proof. (Cut-elimination is a topic we had to defer to future work, but we do make use of the deep embedding in the user interface.) \n\n\\subsection{Deep embedding (DE) in Isabelle}\n\nThe deep embedding is available in the files \\texttt{DEAK.thy} and \\texttt{DEAK\\_core.thy}. The latter contains the encoding of the terms of D.EAK, which differs only slightly from the one of the shallow embedding. It also contains functions match and replace, plus some easy lemmas about their behaviour. The functions match and replace are used  in \\texttt{DEAK.thy} to define how rules are applied to sequents.\n\n\\texttt{DEAK.thy} starts out by defining the datatypes \\texttt{Rule} and \\texttt{Prooftree}. The function \\texttt{der} implements how to reason backwards from a goal:\n\\begin{pyglist}[language=isabelle]\nfun der :: \"Locale â\u0087\u0092 Rule â\u0087\u0092 Sequent â\u0087\u0092 (Rule * Sequent list)\"\n\\end{pyglist}\n\n\\noindent takes a locale, a rule $r$, and a sequent $s$ and outputs the list of premises needed to prove the $s$ via $r$.\n\n\\footnote{It is at this point where our implementation of the deep embedding is currently tailored towards substructural logics: For each rule $r$ and each sequent $s$, there is only one list of premises to consider. Generalising the deep embedding to sequent calculi with rules such as \\eqref{eq:or-seq} would require a modification: If we interpret the structure $W,X,A\\vee B$ in \\eqref{eq:or-seq} not as a structure (ie tree) but as a list, then matching the rule \\eqref{eq:or-seq} against a sequent would typically not determine the sublists matching $W$ and $X$ in a unique way. More information is available at \\cite{Balco:tutorial}.} \n\nThis function is then used to define the predicate \\texttt{isProofTree} and other functions that are used by the UI.\n\nOne reason to define the deep embedding in Isabelle (and not e.g. directly in the UI) is that we want to use it in future work to implement, and prove correct, cut elimination for D.EAK and related calculi.\n\n\\subsection{Functionality of the user interface (UI)}\n\nFor the reasons described at the end of Section~\\ref{sec:deak}, the UI is an essential part of the tool. The UI provides the following functionality:\n\\begin{itemize}\n\\item\n    LaTeX typesetting of the terms of the calculus, with user specified syntactic sugar.\n\\item\n    Graphical representation of proof trees in LaTeX\n\\item\n    Exporting proof trees to LaTeX/pdf and to Isabelle (both SE and DE).\n\\item\n    Automatic proof search (to a modest depth of 5).\n\\item\n    Interactive proof tree creation and modification, including merging proof trees, deleting portions of proof trees, and applying rules. \n\\item Tactics for deriving the generalised identity and atom rules.\n\\item User defined abbreviations and macros (derived rules). \n\\end{itemize}\n\\noindent\nThe UI is implemented in Scala. There were several reasons for choosing Scala, one of which is Isabelle's code export functionality which translates functions written in Isabelle theory files to be exported into functional languages such as Scala or Haskell, amongst others. This meant that the underlying formalisation of terms, rules and proof trees of the deep embedding of the calculus and the functions necessary for building and verifying proof trees could be built in Isabelle and then exported for the UI into Scala.\n\nAnother advantage of using Scala is the fact that it is based on Java and runs on the JVM, which makes code execution fast enough, and, more importantly,  is cross platform and allows the use of Java libraries. This was especially useful when creating the graphical interface for manipulating proof trees, as the UI depends on two libraries, JLaTeXMath\n\nand abego TreeLayout\n\n, which allow for easy typesetting and pretty-printing of the proof trees as well as simple visual creation and modification of proof trees in the UI.\n\n\\section{Case study: The muddy children puzzle}\\label{sec:mc}\n\nThe muddy children puzzle is a classical example of reasoning in dynamic epistemic logic, since it highlights how epistemic actions such as public announcements modify the knowledge of agents. We will recall the puzzle  in some detail below. The solution will state that, after $k$ rounds of all agents announcing ``I don't know'', all agents do in fact know.\n\nThe correctness of the solution has been established, for all $k\\in\\mathbb{N}$ using induction,  by informal mathematical proof \\cite{FHMV} and by mathematical proofs about a formalisation in a Hilbert calculus \\cite{MaPS14}. It has also been automatically verified, for small values of $k$, using techniques from model checking \\cite{HalpernVardi}  and automated theorem proving \\cite{Dyckhoff,Truffaut:msc}.\n\nHere, we prove in Isabelle/HOL that for all $k$ the solution is derivable in D.EAK.\n\n\\subsection{The muddy children puzzle}\nThere are $n>0$ children and $0 < k \\leq n$ of them have mud on their foreheads. Each child sees (and hence knows) which of the others is dirty. But they cannot see (and therefore do not know at the beginning) whether they are dirty themselves (thus the number $n$ is known to them but $k$ is not). The first epistemic action is the father announcing (publicly and truthfully) that at least one of the children is dirty. From then on the protocol proceeds in rounds. In each round all children announce (simultaneously, publicly, truthfully) whether they know that they are dirty or not. How many rounds need to be played until the dirty children know that they are dirty?\n\n\n\\medskip\\noindent In case $n=1,k=1$ the only child knows that it must be dirty, since the announcement by the father, as all announcements in this protocol, are assumed to be truthful. We write this as \n\n\n", "index": 11, "text": "$$[{\\textsf{father}}]\\Box_1 D_1,$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"[{\\textsf{father}}]\\Box_{1}D_{1},\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">[</mo><mtext>𝖿𝖺𝗍𝗁𝖾𝗋</mtext><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">□</mi><mn>1</mn></msub><mo>⁢</mo><msub><mi>D</mi><mn>1</mn></msub></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nwhere $[{\\textsf{no}}]$ is the modal operator corresponding to the children announcing that they don't know whether they are dirty. \n\n\\medskip\\noindent The cases for $k>2$ follow similarly, so that we obtain for all dirty children $j$\n\n", "itemtype": "equation", "pos": 32315, "prevtext": "\n\n where $D_j$ is an atomic proposition encoding that child $j$ is dirty, $\\Box_j p$ means child $j$ knows $p$ and $[{\\textsf{father}}]p$ means that $p$ after father's announcement.\n\n\\medskip\\noindent The case $n>1$ and $k=1$ is similar. Let $j$ be the dirty child. It sees, and therefore knows, that all the other children are clean. Since, after father's announcement, child $j$ knows that there is at least one dirty child, it must be $j$, and $j$ knows it.\n\n\\medskip\\noindent In case $n>1$ and $k=2$ let $J=\\{j,h\\}$ be the set of dirty children. After father's announcement both $j$ and $h$ see one dirty child. But they do not know whether they are dirty themselves. So, according to the protocol, they announce that they do not know whether they are dirty. From the fact that $h$ announced $\\neg\\Box_h D_h$, child $j$ can conclude $D_j$, that is, we have $\\Box_j D_j$.\nTo see this, $j$ reasons that if $j$ was clean, then $h$ would be in the situation of the previous paragraph, that is, we had $\\Box_h D_h$, in contradiction to the truthfulness of the announcement of $h$.\nSummarising, we have shown \n\n\n", "index": 13, "text": "$$[{\\textsf{father}}][{\\textsf{no}}]\\Box_j D_j,$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex2.m1\" class=\"ltx_Math\" alttext=\"[{\\textsf{father}}][{\\textsf{no}}]\\Box_{j}D_{j},\" display=\"block\"><mrow><mrow><mrow><mo stretchy=\"false\">[</mo><mtext>𝖿𝖺𝗍𝗁𝖾𝗋</mtext><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">[</mo><mtext>𝗇𝗈</mtext><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><msub><mi mathvariant=\"normal\">□</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>D</mi><mi>j</mi></msub></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nFor example, for $n=k=100$, after 99 rounds of announcements  ``I don't know whether I am dirty'' by the children, they all do know that they are dirty. \n\n\\subsection{Muddy children in Isabelle}\nOur proof in Isabelle follows \\cite[Prop.24]{MaPS14}, which gives a mathematical proof that for all $n,k>0$ there is, in a Hilbert system equivalent to D.EAK, a derivation  of \n\\eqref{eq:fathernoboxdj} from the assumption\n\n\n\n", "itemtype": "equation", "pos": 32600, "prevtext": "\nwhere $[{\\textsf{no}}]$ is the modal operator corresponding to the children announcing that they don't know whether they are dirty. \n\n\\medskip\\noindent The cases for $k>2$ follow similarly, so that we obtain for all dirty children $j$\n\n", "index": 15, "text": "\\begin{equation}\\label{eq:fathernoboxdj}\n[{\\textsf{father}}][{\\textsf{no}}]^{k-1}\\,\\Box_j D_j\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"[{\\textsf{father}}][{\\textsf{no}}]^{k-1}\\,\\Box_{j}D_{j}\" display=\"block\"><mrow><mrow><mo stretchy=\"false\">[</mo><mtext>𝖿𝖺𝗍𝗁𝖾𝗋</mtext><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">[</mo><mtext>𝗇𝗈</mtext><mo stretchy=\"false\">]</mo></mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></msup></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">□</mi><mi>j</mi></msub><mo>⁢</mo><msub><mi>D</mi><mi>j</mi></msub></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nwhich encodes the rules of the protocol. Specifically, ${\\textsf{dirty}}(n,J)$ encodes for each $J\\subseteq\\{1,\\ldots n\\}$ that precisely the children $j\\in J$ are dirty, ${\\textsf{vision}}(n)$ expresses that each child knows whether any of the other children are dirty, \n${\\textsf{E}}(n)(\\phi)$ means that `every one of the $n$ children knows $\\phi$' and $f^k$ indicates $k$-fold integration of the function $f$ so that ${\\textsf{E}}(n)^k({\\textsf{vision}}(n))$ says that `each child knowing whether the others are dirty' is common knowledge up to depth $k$.\n\n\\medskip\\noindent This means that we need to prove by induction on $n$ and $k$ that for  all $n,k$ there is a derivation in the calculus D.EAK of the sequent \n\n", "itemtype": "equation", "pos": 33129, "prevtext": "\nFor example, for $n=k=100$, after 99 rounds of announcements  ``I don't know whether I am dirty'' by the children, they all do know that they are dirty. \n\n\\subsection{Muddy children in Isabelle}\nOur proof in Isabelle follows \\cite[Prop.24]{MaPS14}, which gives a mathematical proof that for all $n,k>0$ there is, in a Hilbert system equivalent to D.EAK, a derivation  of \n\\eqref{eq:fathernoboxdj} from the assumption\n\n\n\n", "index": 17, "text": "\\begin{gather}\\label{eq:mc-assumptions}\n{\\textsf{dirty}}(n,J) \\ \\wedge \\ {\\textsf{E}}(n)^k({\\textsf{vision}}(n))\n\\end{gather}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"\\displaystyle{\\textsf{dirty}}(n,J)\\ \\wedge\\ {\\textsf{E}}(n)^{k}({\\textsf{%&#10;vision}}(n))\" display=\"block\"><mrow><mrow><mtext>𝖽𝗂𝗋𝗍𝗒</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>J</mi><mo rspace=\"7.5pt\" stretchy=\"false\">)</mo></mrow></mrow><mo rspace=\"7.5pt\">∧</mo><mrow><mtext>𝖤</mtext><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><mi>k</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mtext>𝗏𝗂𝗌𝗂𝗈𝗇</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.01113.tex", "nexttext": "\nwhere the actions ${\\textsf{father}}$ and ${\\textsf{no}}$ also depend on the parameter $n$.\n\n\\medskip\\noindent For the cases $k=1,2$ the proofs can be done with a reasonable effort in the UI of the tool, filling in all the details of the proof of \\cite{MaPS14}. \t\n\n\\medskip\\noindent But as a propositional calculus, D.EAK does not allow us to do  induction. Therefore we use the shallow embedding of D.EAK  and do the induction in the logic of Isabelle. The expressions ${\\textsf{dirty}}(n,J)$ and ${\\textsf{E}}(n)^k({\\textsf{vision}}(n))$ and $[{\\textsf{father}}][{\\textsf{no}}]^{k-1}\\,\\Box_j D_j$ then are Isabelle functions that map the parameters $n,k$ to formulas (in the shallow embedding) of D.EAK, see the file \\texttt{muddy-children.thy} \\cite{Balco:MC}.\n\n\\medskip\\noindent The first part of  \\texttt{muddy-children.thy} contains the definitions of the formulas discussed above and establishes some of their basic properties. The actual proof is given as lemma \\texttt{dirtyChildren}. We have taken care to follow \\cite{MaPS14} closely, so that the proof of its Proposition~24 can be read as a high-level specification of the proof in Isabelle of lemma \\texttt{dirtyChildren}. \n\n\n\\medskip\\noindent The proof in \\texttt{muddy-children.thy} differs from its specification in \\cite{MaPS14} only in a few minor ways. Instead of assuming the axiom of introspection $[{\\texttt{a}}]p\\to p$, we added the corresponding structural rules to the calculus. This seems justified as it is a fundamental property of knowledge we are using and also illustrates a use of modularity. Instead of introducing separate atomic propositions for dirty and clean, we treat clean as an abbreviation for not dirty, which relieves us from axiomatising the relationship between dirty and clean explicitly. But if we want an intuitionistic proof, we need to add to our assumptions that `not not dirty' implies dirty.\n\n\n\\subsection{Conclusions from the case study}\n\nIt took approximately 4 person-weeks to implement the proof of \\cite[Prop.24]{MaPS14} in Isabelle. Part of this went into providing some `infrastructure' contained in the files \\texttt{NatToString.thy} and \\texttt{DEAKDerivedRules.thy} that could be reused for other case studies. On the other hand, we should say that it took maybe half a year to learn Isabelle and we couldn't have learned it from documentation and tutorials alone. At crucial points we profited from expert advice by Thomas Tuerk, Tom Ridge and Christian Urban.\n\nFor the construction of the proof in Isabelle, we made extensive use of the UI. Large parts of the Isabelle proof were constructed in the UI and exported to Isabelle.\n\nOne use one can make of the formal proof is to investigate which proof principles are actually needed. For example, examining the proof in \\texttt{muddy-children.thy}, it is easy to establish that the only point where a non-intuitionistic principle is used is to prove $\\neg\\neg D_j\\to D_j$. Instead we could have added this formula (which only says that ``not clean implies dirty'') to the logical description of the puzzle \\eqref{eq:mc-assumptions}.\n\nIt may be worth pointing out that this analysis is based on the substructural analysis of classical logic on which D.EAK is built. In accordance with the principle of modularity discussed in the introduction, a proof in D.EAK is intuitionistic if and only \n\nif it does not use the so-called Grishin rules \\texttt{Grishin\\_L} and \\texttt{Grishin\\_R} (as defined in \\texttt{DEAK.json}). Thus a simple text search for `Grishin' in \\texttt{muddy-children.thy} suffices.\n\n\n\n\\section{Building your own calculus tool}\\label{sec:meta-tool}\nAs discussed in Section~\\ref{sec:deak-tool}, the DEAK toolbox consists of a set of Isabelle theory files that formalize the terms and encode the rules of this calculus, providing a base for reasoning about the properties of the calculus in the Isabelle theorem prover. The toolbox also includes a UI for building proof trees in the calculus.\n\nOn top of this, we provide the calculus toolbox, a meta-toolbox, which consists of a set of scripts and utilities used for maintaining and modifying the DEAK calculus tool and for building your own calculus tool.\n\n\n\nThe main component of the meta-toolbox is the build script, which takes in a description file of the terms and the rules of the calculus and expands this concise definition into multiple Isabelle theories and Scala code. Due to this centralised definition of the calculus, adding rules or logical connectives becomes much easier, as any changes made to the calculus affect multiple Isabelle and Scala files. The meta-toolbox thus allows for a more structured and uniform maintenance of the different encodings along with the UI.\n\nA detailed documentation \\cite{Balco:CT} and tutorial \\cite{Balco:tutorial} is available.\n\n\n\\subsection{Describing a calculus}\nWe highlight some elements of how to describe a calculus such as D.EAK in the format that can be read by the calculus toolbox. \n\nThe calculus is described in a file using the JavaScript Object Notation (JSON), in our example \\texttt{DEAK.json}. This file specifies the types (Formula, Structure, Sequent, \\dots), the operational and structural connectives, and the rules. For example, linking up with the discussion in Section~\\ref{sec:deak-tool}, in\n\n\\begin{pyglist}[language = json]\n\"Sequent\": {\n  \"type\" : [\"Structure\", \"Structure\"],\n  \"isabelle\" : \"_ \\\\<turnstile> _\",\n  \"ascii\" : \"_ |- _\",\n  \"latex\" : \"_ {\\\\ {\\\\textcolor{magenta}\\\\boldsymbol{\\\\vdash}\\\\ } _\",\n  \"precedence\": [311,311,310]\n\\end{pyglist}\n\n\\noindent\\texttt{\"type\"} specifies that a sequent consists of two structures.\n\n\\footnote{The presence of the \\texttt{\\textbackslash\\textbackslash} instead of just one \\texttt{\\textbackslash} is unfortunate but \\texttt{\\textbackslash} is a reserved character that needs to be escaped using \\texttt{\\textbackslash}.}\n\nThe next three lines specify how sequents will be typeset in Isabelle, ASCII and LaTeX. To make proofs readable in the UI, it is important that the user can specify bespoke sugared notation using, for example, LaTeX commands such as colours and fonts. \n\nNext we explain how rules are encoded. The encoding is divided into two parts. In the first part, under the heading \\texttt{\"calc\\_structure\\_rules\" } the rules are declared. For example, we find \n\n\\begin{pyglist}[language = json]\n\"Or_L\" : {\n  \"ascii\" : \"Or_L\",\n  \"latex\" : \"\\\\vee_L\"\n}\n\\end{pyglist}\n\n\\noindent telling us how the names of the rule are typeset in ASCII and LaTeX. The rule \\eqref{or-deak} itself is described in the second part under the heading \\texttt{\"rules\"} by\n\\begin{pyglist}[language = json]\n\"Or_L\" : [\"F?A \\\\/ F?B |- ?X ; ?Y\", \"F?A |- ?X\", \"F?B |- ?Y\"],\n\\end{pyglist}\n\n\\noindent the first sequent of which is the conclusion, the following being the premises of the rule. The \\texttt{?} has been defined in \\texttt{DEAK.json} to indicate the placeholders (aka free variables or meta-variables) that are instantiated when applying the rule. The \\texttt{F} marks placeholders that can be instantiated by formulas only.\n\nThe description of \\texttt{Or\\_L} above suffices to compile it to Isabelle. But some rules of D.EAK need to be implemented subject to restrictions expressed separately. For example the so-called atom rule formalises that in D.EAK actions do not change facts (but they may change knowledge). Thus, whereas the rule is encoded as \n\n\\begin{pyglist}[language = json]\n\"Atom\" : [\"?X |- ?Y\", \"\"],\n\\end{pyglist}\n\n\\noindent we need to enforce the condition that \\texttt{?X |- ?Y} is of the form $\\Gamma p \\vdash \\Delta p$, where $p$ is an atomic proposition and $\\Gamma,\\Delta$ are strings of action modalities. This is done by noting in the calculus description file the dependence on a condition called \\texttt{atom} as follows.\n\n\\begin{pyglist}[language = json]\n\"Atom\" : {\n  \"ascii\" : \"Atom\",\n  \"latex\" : \"Atom\",\n  \"condition\" : \"atom\"\t\t\t\n},\n\\end{pyglist}\n\n\\noindent The condition itself is then implemented directly in Isabelle. \n\nFor bottom-up proof search, the deep embedding provides a function that, given a sequent and a rule, computes the list of premises (if the rule is applicable). For the cut rule, this is implemented by looking for a cut-formula in the corresponding \\texttt{Locale}, see Section~\\ref{sec:se}.\n\n\\begin{pyglist}[language = json]\n\"RuleCut\" : {\n \"SingleCut\" : {\n  \"ascii\" : \"Cut\",\n  \"latex\" : \"Cut\",\n  \"locale\" : \"CutFormula f\",\n  \"premise\" : \"(\\\\<lambda>x. Some [((?\\\\<^sub>S ''X'') ...\",\n  \"se_rule\" : \"l \\\\<turnstile>d (X \\\\<turnstile>\\\\<^sub>S f ...\"\n  }\n },\n\\end{pyglist}\n\n\\noindent After \\texttt{\"premise\"} we find the Isabelle definition of the DE-version of the rule and after \\texttt{\"se\\_rule\"} the SE-version of the rule.\n\nThe most complicated rules of D.EAK are those  which describe the interaction of action and knowledge modalities and we are not going to describe them here. They need all of the additional components \\texttt{condition}, \\texttt{locale}, \\texttt{premise}, \n\\texttt{se\\_rule}, to deal with side conditions which depend on actions being agent-labeled relations on actions.\n\nThe ability to easily change the calculus description file will be useful in the future, but also appeared already in this work. Compared to the version of D.EAK from \\cite{DEAK}, we noticed during the work on the muddy children puzzle that we wanted to add rules \\texttt{Refl\\_ForwK} expressing $[{\\texttt{a}}]p\\to p$ (i.e.\\ that the knowledge-relation is reflexive) and rules \\texttt{Pre\\_L} and \\texttt{Pre\\_R} allowing us to replace in a proof the constant representing the precondition of an action by the actual formula expressing the precondition.\n\n\n\\subsection{The build script, the template files, and the watcher utility}\n\nTo build the tool from the calculus description file \\texttt{DEAK.json}, one runs the Python script, passing the description file to the script via the \\texttt{-{}-calculus} flag. This produces the Isabelle code for the shallow and deep embedding and the Scala code for the UI. By default, this tool-code is output to a directory called \\texttt{gen\\_calc}. \n\n\\medskip\\noindent\\textbf{Template files. } The tool-code is generated from both the calculus description file and template files. Template files contain the code that cannot be directly compiled from the calculus description file, for example, the code of the UI. But whereas the code of the UI, in the folder\n\\texttt{gui}, is \nindependent of the particular calculus, the parser \\texttt{Parser.scala} and the print class \\texttt{Print.scala} consist of code written by the developer as well as code automatically generated from the calculus description file. Similarly, whereas parts of \\texttt{DEAK.thy} are compiled from the calculus description file, other parts, such as the lemmas and their proofs are written by the developer.\n\n\n\\medskip\\noindent\\textbf{The Isabelle and Scala builder. } In order to support the weaving of automatically generated code into the template files, there are two domain specific languages defined in the files \\texttt{isabuilder.py} and \\texttt{scalabuilder.py}. For example, in the template file \\texttt{Calc\\_core.thy}, from which \\texttt{DEAK.thy} is generated, the line\n\n\\begin{pyglist}[language = isabelle]\n(*calc_structure*)\n\\end{pyglist}\n\n\\noindent prompts the build script to call a method defined in \\texttt{isabuilder.py} which inserts the Isabelle definition of the terms of the calculus into \\texttt{DEAK.thy}.\n\n\\medskip\\noindent\\textbf{The watcher utility. } In order to make the maintenance of the template files easier there is a watcher utility which allows, instead of directly modifying the template files, to work on the generated code. For example, if we want to change how proof search works, we would make the changes to the Isabelle file \\texttt{DEAK.thy} and not directly to the template file \\texttt{Calc\\_core.thy}. The watcher utility, when launched, runs in the background and monitors the specified folder. Any changes made to a file inside this folder are registered and the utility decompiles this file back into its corresponding template, each time a modification occurs. The watcher utility decompiles a file by looking for any sections of the file that have been automatically generated, and replacing these definitions by the special comments that tell the build script where to put the auto-generated code. In order for the decompiling to work correctly, the auto-generated code must be enclosed by special delimiters. Looking back at the example of \\texttt{(*calc\\_structure*)}, when the template file is processed by the build script and expanded with the definitions from a specific calculus description file, the produced code is enclosed by the following delimiters:\n\n\\begin{pyglist}[language = isabelle]\n(*calc_structure-BEGIN*)\nauto-generated code ...\n(*calc_structure-END*)\n\\end{pyglist}\n\n\\noindent\nHence, when the watcher utility decompiles a file into a template, it simply replaces anything of the form \\texttt{(*<identifier>-BEGIN*) ... (*<identifier>-END*)} by the string \\texttt{(*<identifier>*)}.\n\n\n\\section{Conclusions}\\label{sec:conclusion}\nWe find that the tool already makes a valuable contribution to our own, so far largely theoretical research. The main directions of future work consist in extending the tool to support more ambitious projects on the proof theory as well as on the application side. These may include the following concrete projects.\n\n\\begin{itemize}\n\\item Proving more theorems in and about D.EAK:\n\\begin{itemize}\n\\item  case studies similar to muddy children but with dynamic updates more complicated than public announcement,\n\\item proving cut elimination of D.EAK in Isabelle.\n\\end{itemize}\n\\item Treating the multi-type version of D.EAK \\cite{Multitype}.\n\\item Extending to other calculi. In particular, our methodology naturally applies to fragments of classical logics such as intuitionistic and linear logics which have many applications in computer science. \n\\item Providing an interface for the calculus description file, possibly supporting the integration of different calculi.\n\\item Making the tool more powerful by\n\\begin{itemize}\n\\item extending available tactics,\n\\item improving the currently very rudimentary automated proof search.\n\\end{itemize}\n\\item Prove bigger case studies of more substantial epistemic protocols. How will the tool need to change to scale it up to bigger applications?\n\\end{itemize}\n\n\\noindent\nBecause in this paper we were interested in studying calculi such as D.EAK \n\nthe propositional part about dynamic and epistemic operators and the higher order part of Isabelle are strictly separated, interfaced by the tool-generated shallow embedding. One should investigate building the dynamic and epistemic part directly into the higher-order logic of Isabelle. This would allow us to formalize properties such as  ``after $m$ rounds of ${\\textsf{no}}$ each child knows that there are at least $m$ dirty children'' directly instead of encoding them as functions that map parameters such as $m$ to formulas of propositional logic. On the other hand, one will loose information coming from the detailed understanding of a propositional, substructural, modular\ndisplay calculus such as D.EAK.\n\n\\medskip Possibly the most important topic of further research concerns the fact that display calculi are not directly suitable for automatic proof search. On the other hand they have the advantages of modularity we discussed. So the question is whether we can---along the lines of \\cite{GorePT09}---go from display calculi constructed according to a clear proof theoretic methodology to deep inference calculi well suited for proof search. That automatic proof search is a direction worth pursuing for dynamic epistemic logics has been shown in \\cite{Truffaut:msc}: for the calculus of \\cite{Dyckhoff} a depth first search augmented with simple heuristics was able to automatically find a proof of the muddy children puzzle for up to 4 dirty children, see \\cite[\\textsection 6.4.3]{Truffaut:msc}.\n\n\\medskip Another important problem concerns how to integrate common knowledge. \nThis is a well-known difficult problem. Some proposed solutions use infinitary rules, other use finitary rules are non-standard and non-modular. We plan to extend D.EAK with common knowledge while keeping it modular.\n\n\n\n\\newpage\n\\bibliographystyle{abbrv}\n\n\n\\begin{thebibliography}{10}\n\n\\bibitem{mlhandbook:BL}\nF.~Baader and C.~Lutz.\n\\newblock {Description Logic}.\n\\newblock In {\\em Handbook of Modal Logic}. 2006.\n\n\\bibitem{Balco:tutorial}\nS.~Balco.\n\\newblock Building a sequent calculus toolbox.\n\\newblock Available at\n  \\url{http://goodlyrottenapple.me/2015/09/02/sequent-tutorial/}.\n\n\\bibitem{Balco:CT}\nS.~Balco.\n\\newblock The calculus toolbox.\n\\newblock Download and documentation at\n  \\url{https://github.com/goodlyrottenapple/calculus-toolbox}.\n\n\\bibitem{Balco:DEAK}\nS.~Balco.\n\\newblock The {DEAK} calculus tool.\n\\newblock Download and documentation at\n  \\url{https://github.com/goodlyrottenapple/DEAK-calculus-tool}.\n\n\\bibitem{Balco:MC}\nS.~Balco and S.~Frittella.\n\\newblock Muddy children.thy.\n\\newblock Isabelle 2015 theory file available at\n  \\url{https://github.com/goodlyrottenapple/muddy-children}.\n\n\\bibitem{bms}\nA.~Baltag, L.~S. Moss, and S.~Solecki.\n\\newblock The logic of public announcements, common knowledge and private\n  suspicious.\n\\newblock Technical Report SEN-R9922, CWI, Amsterdam, 1999.\n\n\\bibitem{Belnap}\nN.~Belnap.\n\\newblock Display logic.\n\\newblock {\\em Journal of Philosophical Logic}, 11:375--417, 1982.\n\n\\bibitem{mlhandbook:BB}\nP.~Blackburn and J.~van Benthem.\n\\newblock Modal logic: A semantic perspective.\n\\newblock In {\\em Handbook of Modal Logic}. 2006.\n\n\\bibitem{mlhandbook}\nP.~Blackburn, J.~van Benthem, and F.~Wolter, editors.\n\\newblock {\\em Handbook of Modal Logic}.\n\\newblock Elsevier, 2006.\n\n\\bibitem{DawsonG01}\nJ.~E. Dawson and R.~Gor{\\'{e}}.\n\\newblock Embedding display calculi into logical frameworks: Comparing twelf\n  and isabelle.\n\\newblock {\\em Electr. Notes Theor. Comput. Sci.}, 42:89--103, 2001.\n\n\\bibitem{DawsonG02}\nJ.~E. Dawson and R.~Gor{\\'{e}}.\n\\newblock Formalised cut admissibility for display logic.\n\\newblock In {\\em Theorem Proving in Higher Order Logics, 15th International\n  Conference, TPHOLs 2002, Hampton, VA, USA, August 20-23, 2002, Proceedings},\n  pages 131--147, 2002.\n\n\\bibitem{Dyckhoff}\nR.~Dyckhoff, M.~Sadrzadeh, and J.~Truffaut.\n\\newblock Algebra, proof theory and applications for an intuitionistic logic of\n  propositions, actions and adjoint modal operators.\n\\newblock {\\em ACM Transactions on Computational Logic}, 14(4), 2013.\n\n\\bibitem{FHMV}\nR.~Fagin, J.~Y. Halpern, Y.~Moses, and M.~Y. Vardi.\n\\newblock {\\em Reasoning About Knowledge}.\n\\newblock MIT Press, 1995.\n\n\\bibitem{mlhandbook:F}\nM.~Fitting.\n\\newblock {Modal Proof Theory}.\n\\newblock In {\\em Handbook of Modal Logic}. 2006.\n\n\\bibitem{PDL}\nS.~Frittella, G.~Greco, A.~Kurz, and A.~Palmigiano.\n\\newblock Multi-type display calculus for propositional dynamic logic.\n\\newblock DOI:10.1093/logcom/exu064, 2014.\n\n\\bibitem{Multitype}\nS.~Frittella, G.~Greco, A.~Kurz, A.~Palmigiano, and V.~Sikimi\\'{c}.\n\\newblock A multi-type display calculus for dynamic epistemic logic.\n\\newblock DOI:10.1093/logcom/exu068, 2014.\n\n\\bibitem{DEAK}\nS.~Frittella, G.~Greco, A.~Kurz, A.~Palmigiano, and V.~Sikimi\\'{c}.\n\\newblock A proof-theoretic semantic analysis of dynamic epistemic logic.\n\\newblock {\\em Journal of Logic and Computation}, 2015.\n\\newblock DOI:10.1093/logcom/exu063.\n\n\\bibitem{Gore96}\nR.~Gor{\\'e}.\n\\newblock On the completeness of classical modal display logic.\n\\newblock {\\em In H Wansing, editor, Proof Theory of Modal Logic}, volume 2 of\n  Applied Logic:137--140, 1996.\n\n\\bibitem{Gore98}\nR.~Gor\\'e.\n\\newblock Substructural logics on display.\n\\newblock {\\em Logic Journal of IGPL}, 6(3):451--504, 1998.\n\n\\bibitem{GorePT09}\nR.~Gor{\\'{e}}, L.~Postniece, and A.~Tiu.\n\\newblock Taming displayed tense logics using nested sequents with deep\n  inference.\n\\newblock In {\\em Automated Reasoning with Analytic Tableaux and Related\n  Methods, 18th International Conference, {TABLEAUX} 2009, Oslo, Norway, July\n  6-10, 2009. Proceedings}, pages 189--204, 2009.\n\n\\bibitem{HalpernVardi}\nJ.~Y. Halpern and M.~Y. Vardi.\n\\newblock Model checking vs. theorem proving: {A} manifesto.\n\\newblock In {\\em Proceedings of the 2nd International Conference on Principles\n  of Knowledge Representation and Reasoning (KR'91). Cambridge, MA, USA, April\n  22-25, 1991.}, pages 325--334, 1991.\n\n\\bibitem{mlhandbook:HHSS}\nI.~Horrocks, U.~Hustadt, U.~Sattler, and R.~Schmitt.\n\\newblock {Computational Modal Logic}.\n\\newblock In {\\em Handbook of Modal Logic}. 2006.\n\n\\bibitem{Kracht}\nM.~Kracht.\n\\newblock Power and weakness of the modal display calculus.\n\\newblock In {\\em Proof theory of modal logic}, pages 93--121. Kluwer, 1996.\n\n\\bibitem{Lescanne06}\nP.~Lescanne.\n\\newblock Mechanizing common knowledge logic using {COQ}.\n\\newblock {\\em Ann. Math. Artif. Intell.}, 48(1-2):15--43, 2006.\n\n\\bibitem{Lescanne13}\nP.~Lescanne.\n\\newblock Common knowledge logic in a higher order proof assistant.\n\\newblock In {\\em Programming Logics - Essays in Memory of Harald Ganzinger},\n  pages 271--284, 2013.\n\n\\bibitem{LescanneP07}\nP.~Lescanne and J.~Puiss{\\'{e}}gur.\n\\newblock Dynamic logic of common knowledge in a proof assistant.\n\\newblock {\\em CoRR}, abs/0712.3146, 2007.\n\n\\bibitem{MaPS14}\nM.~Ma, A.~Palmigiano, and M.~Sadrzadeh.\n\\newblock Algebraic semantics and model completeness for intuitionistic public\n  announcement logic.\n\\newblock {\\em Annals of Pure and Applied Logic}, 165(4):963--995, 2014.\n\n\\bibitem{Truffaut:msc}\nJ.~Truffaut.\n\\newblock Implementation and improvements of a cut-free sequent calculus for\n  dynamic epistemic logic, 2011.\n\\newblock MSc thesis, University of Oxford.\n\n\\bibitem{DitmarschK15}\nH.~P. van Ditmarsch and B.~Kooi.\n\\newblock {\\em One Hundred Prisoners and a Light Bulb}.\n\\newblock Springer, 2015.\n\n\\bibitem{Ditmarsch}\nH.~P. van Ditmarsch, W.~van~der Hoek, and B.~Kooi.\n\\newblock {\\em Dynamic Epistemic Logic}.\n\\newblock Springer, 2007.\n\n\\bibitem{Wansing}\nH.~Wansing.\n\\newblock {\\em Displaying Modal Logic}.\n\\newblock Kluwer, 1998.\n\n\\end{thebibliography}\n\n\\appendix\n\n\n", "itemtype": "equation", "pos": 33975, "prevtext": "\nwhich encodes the rules of the protocol. Specifically, ${\\textsf{dirty}}(n,J)$ encodes for each $J\\subseteq\\{1,\\ldots n\\}$ that precisely the children $j\\in J$ are dirty, ${\\textsf{vision}}(n)$ expresses that each child knows whether any of the other children are dirty, \n${\\textsf{E}}(n)(\\phi)$ means that `every one of the $n$ children knows $\\phi$' and $f^k$ indicates $k$-fold integration of the function $f$ so that ${\\textsf{E}}(n)^k({\\textsf{vision}}(n))$ says that `each child knowing whether the others are dirty' is common knowledge up to depth $k$.\n\n\\medskip\\noindent This means that we need to prove by induction on $n$ and $k$ that for  all $n,k$ there is a derivation in the calculus D.EAK of the sequent \n\n", "index": 19, "text": "\\begin{equation}\\label{eq:mc}\n {\\textsf{dirty}}(n,J) , {\\textsf{E}}(n)^k({\\textsf{vision}}(n))\\vdash [{\\textsf{father}}][{\\textsf{no}}]^{k-1}\\,\\Box_j D_j \\ .\n \\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{\\textsf{dirty}}(n,J),{\\textsf{E}}(n)^{k}({\\textsf{vision}}(n))\\vdash[{\\textsf%&#10;{father}}][{\\textsf{no}}]^{k-1}\\,\\Box_{j}D_{j}\\ .\" display=\"block\"><mrow><mrow><mrow><mrow><mtext>𝖽𝗂𝗋𝗍𝗒</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo>,</mo><mi>J</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>,</mo><mrow><mtext>𝖤</mtext><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow><mi>k</mi></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mtext>𝗏𝗂𝗌𝗂𝗈𝗇</mtext><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>n</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>⊢</mo><mrow><mrow><mo stretchy=\"false\">[</mo><mtext>𝖿𝖺𝗍𝗁𝖾𝗋</mtext><mo stretchy=\"false\">]</mo></mrow><mo>⁢</mo><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">[</mo><mtext>𝗇𝗈</mtext><mo stretchy=\"false\">]</mo></mrow><mrow><mi>k</mi><mo>-</mo><mn>1</mn></mrow></msup></mpadded><mo>⁢</mo><msub><mi mathvariant=\"normal\">□</mi><mi>j</mi></msub><mo>⁢</mo><mpadded width=\"+5pt\"><msub><mi>D</mi><mi>j</mi></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}]