[{"file": "1601.02347.tex", "nexttext": "\nIn our notation the lower case Roman letters denote the annuli and the upper case Roman letters denote the spectral bins. The quantities ${\\bf D}_{iJ}$ and ${\\bf B}_{iJ}$ are the counts detected in the spectrum in the $J^{\\rm th}$ spectral bin of the $i^{\\rm th}$ annulus of the source, and the corresponding weighted spectrum from the blank sky observation, respectively. \n\nThe photon count (${\\bf C}_{iJ}$) in each annulus is a sum of contributions from different spherical shells of radius larger than that of the \nparticular annulus. Since the outermost annulus receives photons only from the last shell, its photon count can be taken to be that of the \noutermost shell. The canonical deprojection technique relies on removing the spectral \ncontributions of the outer shells from the given annulus with the appropriate volume factors to obtain the photon counts of the shell. \nThe procedure is then applied iteratively to the inner annuli to obtain the count rates corresponding to individual shells. The individual \nshells can then be fitted to obtain the gas number density $n_i$ and temperature $T_i$\nin the $i^{\\rm th}$ shell. \n\nSince in this method the errors in the photon-count in the outer shell systematically propagate inward, the resulting individual shell counts \nare actually correlated with each other. However, it is difficult to take this correlation into account, since every $i^{\\rm th}$ shell spectrum is fitted \nindividually for $n_i$ and $T_i$, and not collectively as ${\\bf n}, {\\bf T}$, where ${\\bf n}$ and ${\\bf T}$ are the $N$-dimensional \ndensity and temperature vectors. The usual practice is to use Monte Carlo methods to estimate the range of \n$n$ and $T$ in each shell allowed by the data. \n\nSince we are primarily interested in the central regions of galaxy clusters, it is useful to be able to systematically isolate the inner \nshells by statistically marginalising over the outer shells to obtain the best possible estimate for the inner shells (the choice of inner shells is described \nin section \\ref{S:mcmc_method}). For this we first need \nto construct the likelihood function for data based on the free-form model ${\\bf n}, {\\bf T}$. Then using Bayesian statistics, we can construct \nthe posterior probability for the model parameters.  \n\nTo construct the probability distribution function for the unknown parameters of the shell $n_i, T_i$, we begin with the expression for the \n{\\it model} of the counts for each annulus through \n\n", "itemtype": "equation", "pos": 10711, "prevtext": "\n\\title [Decoding the centres of clusters using MCMC] \n{Decoding X-ray observations from centres of galaxy clusters using MCMC}\n\\author[Kiran Lakhchaura, Tarun Deep Saini and Prateek Sharma]\n       {Kiran Lakhchaura$^{1}$\\thanks{E-mail : kiran@physics.iisc.ernet.in}, \n        Tarun Deep Saini$^{1}$\\thanks{E-mail : tarun@physics.iisc.ernet.in} and Prateek Sharma$^{1}$\\thanks{E-mail : prateek@physics.iisc.ernet.in}\\\\\n$^1$   Department of Physics,\nIndian Institute of Science, Bangalore 560012, India \\\\\n} \n\\maketitle\n\n\\begin{abstract} \nTraditionally the thermodynamic profiles (gas density, temperature, etc.) of galaxy clusters are obtained by assuming spherical symmetry and\nmodeling projected X-ray spectra in each annulus. The outer annuli contribute to the inner ones and their contribution needs to be subtracted to obtain\nthe temperature and density of spherical shells. The usual deprojection methods lead to propagation of errors from outside to in and do not\nmodel the covariance of parameters in different radial shells.\nIn this paper we describe a method based on a free-form model of clusters with cluster parameters (density, temperature) given in spherical shells, \nwhich we {\\it jointly} forward fit to the X-ray data by constructing a Bayesian posterior probability distribution that we sample using the MCMC technique. \nBy systematically marginalising over the nuisance outer shells, we estimate the inner entropy profiles of clusters and fit them to various models for a sample \nof Chandra X-ray observations of 17 clusters. We show that the entropy profiles in almost all of our clusters are best described as cored power laws. \nA small subsample is found to be either consistent with a power law, or alternatively their cores are not fully resolved (smaller than, or about few kpc). \nWe find marginal evidence for bimodality in the central values of entropy \n(and cooling time) corresponding to cool-core and non cool-core clusters. The minimum value of the ratio of the cooling time and the free-fall time \n(min[$t_{\\rm cool}/t_{\\rm ff}$]; correlation is much weaker with core entropy) is anti-correlated with $H\\alpha$ and radio luminosity. $H\\alpha$ emitting cold \ngas is absent in our clusters with min$(t_{\\rm cool}/t_{\\rm ff})\\gtrsim 10$.\n\\end{abstract}\n\n\\begin{keywords}\nX-rays: galaxies: clusters -- galaxies: clusters: intracluster medium -- methods: statistical\n\\end{keywords}\n\n\\section{Introduction} \n\nObservations of large scale distribution of galaxies (e.g., \\citealt{col01}) and numerical simulations of gravitational structure formation (e.g., \\citealt{dav85}) show that the \nmass in the universe is distributed in\nthe form of a cosmic foam, with pancakes, filaments, voids, and groups and clusters. Galaxy clusters, which form at the intersections of massive cosmological \nfilaments, are the most massive, spherical, virialized objects in the universe. Galaxy clusters, containing up to 1000s of mostly red galaxies, lie at the exponential\nend of the halo mass distribution, and hence their abundance is a sensitive function of cosmological parameters such as the amplitude of perturbations at \nrecombination and the cosmological matter fraction (e.g., \\citealt{eke96}; see \\citealt{all11} for a recent review).\n\nGalaxy cluster observations also shed light on galaxy formation, in particular the role of the extended hot halo gas, which is left behind as a consequence of galaxy\nformation (\\citealt{whi78}). Unlike galaxy clusters in which the hot gas density is high, the hot gas halo is very difficult to observe in lower mass halos. However, it is\npresent, and is expected to be spread out beyond the viral radius, accounting for most of the galactic `missing' baryons (e.g., \\citealt{and10,sha12b}). The diffuse \nhot halo is also a reservoir from which the cold gas needed for ongoing star formation is accreted, and into which metals due to supernovae are deposited (see \\citealt{put12} for a review).\n\nThe galaxy cluster core, where the cooling time of the hot gas is shorter than the Hubble time, is most interesting from the perspective of galaxy formation.\nObservations show that cluster cores exist in at least two states: cool-cores (CC) and non-cool-cores (NCC). Cool cores have short ($\\lesssim$ 1 Gyr) cooling \ntimes (e.g., \\citealt{cro08,cav09,hud10}); some authors also talk about intermediate or weak cool-core clusters (e.g., \\citealt{san08,ros10}). There is some merit in \nstudying the entropy of hot gas because (at least in simple 1-D models; this breaks down in 2/3-D as mixing, condensation and dropout have a non-trivial impact \non hot gas entropy) it only changes at the virial shock and in the central cooling/heating regions (e.g., \\citealt{toz01,voi03}).  The core entropy is also a measure\nof preheating of the intergalactic medium (IGM) at the epoch when the central gas was accreted into dark matter halos (e.g., \\citealt{kai91}).\n\nThere is disagreement in the literature on the nature of entropy profiles in cluster cores. The extreme views being that all clusters have constant entropy cores \n(\\citealt{cav09}; $K\\equiv T_{\\rm keV}/n_e^{2/3} = K_0$ at smallest radii; $T_{\\rm keV}$ is the temperature in keV and $n_e$ is the electron number density) \nand all centres have power law entropy profiles (we call them cusps, $K \\propto r^{\\alpha1}$ at \nsmallest radii; \\citealt{pan14}). Of course, latter is a more general form and includes former as a special case ($\\alpha 1=0$). The slope of the entropy/density profile\nin the core constrains the models of active galactic nucleus (AGN) feedback in cluster cores. For example, a decreasing entropy toward the centre implies that \nthe Bondi accretion rate onto the black hole is higher; similar conditions may also lead to (the more plausible) cold feedback (\\citealt{piz05}), triggered when the ratio\nof the cooling time and the free-fall time ($t_{\\rm cool}/t_{\\rm ff}$) becomes $\\lesssim 10$ (\\citealt{sha12a,gas13}). \nAlso, there are predictions from numerical simulations for the hot gas \nentropy profile; e.g., \\citet{pra15} suggest that the entropy profile for lower core entropy is steeper (with larger $\\alpha$; \ntop-left panel of their Fig. 11). Some papers have argued that $t_{\\rm cool}/t_{\\rm ff}$ (\\citealt{mcc12,sha12a,voi15}) is the physical parameter that \ndelineates hot gas halos in which cold gas condensation, star-formation and \nAGN activity occur from those in which they are absent. Such theoretical predictions can be tested by appropriately analyzing the X-ray data from cluster \ncores and by comparing with cold gas and radio observations.\n\nSince the clusters are seen in projection, to reconstruct the three dimensional thermodynamic profiles of a cluster requires deprojection of data. To keep the \nreconstruction bias free, a free-form model of the cluster (that allows $n_e$ and $T$ to vary arbitrarily with radius) is preferred in comparison to analytical fits. \nThe cluster can be divided into $N$ spherical shells that are seen in projection as $N$ annuli. The number density and temperature in the shells are \nthe $2N$ parameters of the free-form fit to the cluster (we also try some models in which the shell metallicity is kept as a free parameter; see \nsection \\ref{S:test_clus_res}). The canonical method \\citep[e.g.,][]{russ08} employs the elegant idea that since the last radial annulus draws \nphotons only from the last shell, the last shell parameters can be obtained directly. Then subtracting the contribution of the last shell from the next inner shell, one can sequentially obtain the parameters of each shell. The number of parameters fitted at any step is just two (three if metallicity is allowed to vary in shells), \nso this method is very efficient.  \nAlthough this method works well for most cases, one important drawback of this method is that the errors in the parameters of the outer shells do not \nget propagated to the inner shells. Moreover, the correlation inherent in such propagation is also lost, and a large error in the outer shells can, \nin principle, have a large impact on the thermodynamic profiles inferred for the inner shells of the cluster. Oscillations in deprojected temperature \nsometimes seen due to poor quality X-ray spectra may be manifestations of wrong temperatures estimated in outer shells affecting inner shells.\n\nTo avoid this drawback, in this paper, we {\\it jointly fit the parameters of all the shells to the cluster data through forward fitting}. This increases the number of parameters considerably. We construct the Bayesian posterior probability distribution function for the $2N$ parameters of a cluster. To sample the posterior probability distribution, we use Markov Chain Monte Carlo (MCMC) method and extract the most likely density, temperature, entropy, etc. profiles in cluster cores and their (co)variances. We call our method jMCMC (`j' stands for the joint fitting of all shell parameters). Since the central thermodynamic profiles for clusters are the most interesting for studying cooling and star formation in clusters, we marginalize over model parameters at outer radii to obtain much more precise estimates in the core ($R \\sim$ 10 kpc). \n\nLike all such models, we make the assumption that the X-ray emitting gas is spherically symmetric. This is manifestly a simplification as most cool-core (which are generally more relaxed) clusters show X-ray cavities and radio bubbles (see \\citealt{mcn07} for a review). Quantifying systematic bias introduced due to the assumption of spherical symmetry is left for future.\n\nWe present our method and its tests in section \\ref{S:method}. Section \\ref{S:samp_res} presents our sample and results from from fitting flat core entropy profiles.\nSingle and double power law profiles are presented in Appendix \\ref{S:sgl_powlaw_fit} \\& \\ref{S:dbl_powlaw_fit}. Readers not interested in technical details may\ndirectly proceed to section \\ref{S:discussion} in which we discuss astrophysical implications of our results. We conclude in section \\ref{S:conclusions}.\n\n\\section{Method}\n\\label{S:method}\n\nThe X-ray data comprises photon counts at a position on the sky as a function of frequency. We divide the projected counts into $N$ annuli and $M$ spectral channels. The number of annuli and spectral channels are chosen to ensure that each channel gets a minimum of 25 counts to ensure Gaussian statistics for the photon noise. We define the radius $R_i$ of an annulus as the distance from the centre of the cluster to the centre of the annulus. The three dimensional spherical shells are assigned the same radii as the annuli. The annulus/shell number increases from the centre outwards. The observed counts in the $i^{\\rm th}$ annulus is given by\n\n", "index": 1, "text": "\\begin{equation}\n{\\bf C}_{iJ}= {\\bf D}_{iJ} - {\\bf B}_{iJ}\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E1.m1\" class=\"ltx_Math\" alttext=\"{\\bf C}_{iJ}={\\bf D}_{iJ}-{\\bf B}_{iJ}\\,.\" display=\"block\"><mrow><mrow><msub><mi>𝐂</mi><mrow><mi>i</mi><mo>⁢</mo><mi>J</mi></mrow></msub><mo>=</mo><mrow><msub><mi>𝐃</mi><mrow><mi>i</mi><mo>⁢</mo><mi>J</mi></mrow></msub><mo>-</mo><mpadded width=\"+1.7pt\"><msub><mi>𝐁</mi><mrow><mi>i</mi><mo>⁢</mo><mi>J</mi></mrow></msub></mpadded></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $\\dot{{\\bf C}}^{\\rm th}(n_{k},T_{k},E)$ is the model photon count flux for the $k^{\\rm th}$ shell at energy $E$ per unit time per unit source volume \nfor gas density $n_{k}$ and temperature $T_{k}$. $\\dot{{\\bf C}}^{\\rm th}$ is calculated using the {\\it wabs} photoelectric absorption model \\citep{mor83} \nand the Astrophysical Plasma Emission Code \\citep[{\\it apec};][]{smi01} in the X-ray spectral analysis package \\citep[XSPEC; see][]{arn96}. \nThe redshift (z), metallicity ($Z$) and \nneutral hydrogen column density along the source direction ($N_{H}$), are assumed to be constant (in section \\ref{S:test_clus_res} we show that fixing the\nmetallicity across shells is a good approximation for our purposes). \n$R_k(E,J)$ is the probability of a photon with energy $E$ to be detected in the detector channel $J$, and $A_k(E)$ is the effective area of the \ndetector at energy $E$ for the $k^{\\rm th}$ annulus. $ V_{\\rm proj}(i,k)$ is the projected volume of the $k^{\\rm th}$ shell intercepted by the $i^{\\rm th}$ annulus \n$(k \\geq i)$; and $\\Delta t$ is the exposure time of the observation.    \n\n", "itemtype": "equation", "pos": 13262, "prevtext": "\nIn our notation the lower case Roman letters denote the annuli and the upper case Roman letters denote the spectral bins. The quantities ${\\bf D}_{iJ}$ and ${\\bf B}_{iJ}$ are the counts detected in the spectrum in the $J^{\\rm th}$ spectral bin of the $i^{\\rm th}$ annulus of the source, and the corresponding weighted spectrum from the blank sky observation, respectively. \n\nThe photon count (${\\bf C}_{iJ}$) in each annulus is a sum of contributions from different spherical shells of radius larger than that of the \nparticular annulus. Since the outermost annulus receives photons only from the last shell, its photon count can be taken to be that of the \noutermost shell. The canonical deprojection technique relies on removing the spectral \ncontributions of the outer shells from the given annulus with the appropriate volume factors to obtain the photon counts of the shell. \nThe procedure is then applied iteratively to the inner annuli to obtain the count rates corresponding to individual shells. The individual \nshells can then be fitted to obtain the gas number density $n_i$ and temperature $T_i$\nin the $i^{\\rm th}$ shell. \n\nSince in this method the errors in the photon-count in the outer shell systematically propagate inward, the resulting individual shell counts \nare actually correlated with each other. However, it is difficult to take this correlation into account, since every $i^{\\rm th}$ shell spectrum is fitted \nindividually for $n_i$ and $T_i$, and not collectively as ${\\bf n}, {\\bf T}$, where ${\\bf n}$ and ${\\bf T}$ are the $N$-dimensional \ndensity and temperature vectors. The usual practice is to use Monte Carlo methods to estimate the range of \n$n$ and $T$ in each shell allowed by the data. \n\nSince we are primarily interested in the central regions of galaxy clusters, it is useful to be able to systematically isolate the inner \nshells by statistically marginalising over the outer shells to obtain the best possible estimate for the inner shells (the choice of inner shells is described \nin section \\ref{S:mcmc_method}). For this we first need \nto construct the likelihood function for data based on the free-form model ${\\bf n}, {\\bf T}$. Then using Bayesian statistics, we can construct \nthe posterior probability for the model parameters.  \n\nTo construct the probability distribution function for the unknown parameters of the shell $n_i, T_i$, we begin with the expression for the \n{\\it model} of the counts for each annulus through \n\n", "index": 3, "text": "\\begin{equation}\n\\begin{split}\n{\\bf M}_{iJ} = \\sum_{k=i}^{N} \\sum_{E} {\\dot{\\bf C}^{\\rm th}}(&{n_k},T_k,E) \nR_k(E,J) A_{k}(E) V_{\\rm proj}(i,k)\\; \\Delta t\\,,\n\\end{split}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E2.m1\" class=\"ltx_Math\" alttext=\"\\begin{split}\\displaystyle{\\bf M}_{iJ}=\\sum_{k=i}^{N}\\sum_{E}{\\dot{\\bf C}^{\\rm&#10;th%&#10;}}(&amp;\\displaystyle{n_{k}},T_{k},E)R_{k}(E,J)A_{k}(E)V_{\\rm proj}(i,k)\\;\\Delta t%&#10;\\,,\\end{split}\" display=\"block\"><mtable columnspacing=\"0pt\" displaystyle=\"true\"><mtr><mtd columnalign=\"right\"><mrow><msub><mi>𝐌</mi><mrow><mi>i</mi><mo>⁢</mo><mi>J</mi></mrow></msub><mo>=</mo><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>k</mi><mo>=</mo><mi>i</mi></mrow><mi>N</mi></munderover><munder><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>E</mi></munder><msup><mover accent=\"true\"><mi>𝐂</mi><mo>˙</mo></mover><mi>th</mi></msup><mo stretchy=\"false\">(</mo></mrow></mtd><mtd columnalign=\"left\"><mrow><msub><mi>n</mi><mi>k</mi></msub><mo>,</mo><msub><mi>T</mi><mi>k</mi></msub><mo>,</mo><mi>E</mi><mo stretchy=\"false\">)</mo><mi>R</mi><msub><mi/><mi>k</mi></msub><mo stretchy=\"false\">(</mo><mi>E</mi><mo>,</mo><mi>J</mi><mo stretchy=\"false\">)</mo><mi>A</mi><msub><mi/><mi>k</mi></msub><mo stretchy=\"false\">(</mo><mi>E</mi><mo stretchy=\"false\">)</mo><mi>V</mi><msub><mi/><mi>proj</mi></msub><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>k</mi><mo rspace=\"5.3pt\" stretchy=\"false\">)</mo><mi mathvariant=\"normal\">Δ</mi><mpadded width=\"+1.7pt\"><mi>t</mi></mpadded><mo>,</mo></mrow></mtd></mtr></mtable></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $V(i,k)=(4\\pi/3)(R_{ko}^2 - R_{ii}^2)^{3/2}$, $R_{ii}$ and $R_{ko}$ being the inner and outer radii of the $i^{\\rm th}$ and $k^{\\rm th}$ shells, \nrespectively \\citep[see][]{kri83}. \n\nIn terms of the model parameters ${\\bf n}, {\\bf T}$, the $\\chi^2$  is given by\n\n", "itemtype": "equation", "pos": 14549, "prevtext": "\nwhere $\\dot{{\\bf C}}^{\\rm th}(n_{k},T_{k},E)$ is the model photon count flux for the $k^{\\rm th}$ shell at energy $E$ per unit time per unit source volume \nfor gas density $n_{k}$ and temperature $T_{k}$. $\\dot{{\\bf C}}^{\\rm th}$ is calculated using the {\\it wabs} photoelectric absorption model \\citep{mor83} \nand the Astrophysical Plasma Emission Code \\citep[{\\it apec};][]{smi01} in the X-ray spectral analysis package \\citep[XSPEC; see][]{arn96}. \nThe redshift (z), metallicity ($Z$) and \nneutral hydrogen column density along the source direction ($N_{H}$), are assumed to be constant (in section \\ref{S:test_clus_res} we show that fixing the\nmetallicity across shells is a good approximation for our purposes). \n$R_k(E,J)$ is the probability of a photon with energy $E$ to be detected in the detector channel $J$, and $A_k(E)$ is the effective area of the \ndetector at energy $E$ for the $k^{\\rm th}$ annulus. $ V_{\\rm proj}(i,k)$ is the projected volume of the $k^{\\rm th}$ shell intercepted by the $i^{\\rm th}$ annulus \n$(k \\geq i)$; and $\\Delta t$ is the exposure time of the observation.    \n\n", "index": 5, "text": "\\begin{equation}\nV_{\\rm proj}(i,k)=V(i,k+1) -V(i+1,k+1)-V(i,k)+V(i+1,k),\n\\label{eq:vol}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E3.m1\" class=\"ltx_Math\" alttext=\"V_{\\rm proj}(i,k)=V(i,k+1)-V(i+1,k+1)-V(i,k)+V(i+1,k),\" display=\"block\"><mrow><mrow><mrow><msub><mi>V</mi><mi>proj</mi></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>i</mi><mo>+</mo><mn>1</mn></mrow><mo>,</mo><mrow><mi>k</mi><mo>+</mo><mn>1</mn></mrow><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>i</mi><mo>,</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>+</mo><mrow><mi>V</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mi>i</mi><mo>+</mo><mn>1</mn></mrow><mo>,</mo><mi>k</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $\\sigma_{iJ} = \\sqrt{{\\bf D}_{iJ}}$ is the Poisson error in the counts detected in the $J^{\\rm th}$ channel of the $i^{\\rm th}$ annulus \nin the source observation. In this expression the summation over $J$ matches the observed spectrum for the $i^{\\rm th}$ annulus, and \nthe summation over $i$ gives the combined match for the full data across all radial bins. The Bayesian posterior probability distribution \nfunction (PDF) of the model is then given by \n\n", "itemtype": "equation", "pos": 14920, "prevtext": "\nwhere $V(i,k)=(4\\pi/3)(R_{ko}^2 - R_{ii}^2)^{3/2}$, $R_{ii}$ and $R_{ko}$ being the inner and outer radii of the $i^{\\rm th}$ and $k^{\\rm th}$ shells, \nrespectively \\citep[see][]{kri83}. \n\nIn terms of the model parameters ${\\bf n}, {\\bf T}$, the $\\chi^2$  is given by\n\n", "index": 7, "text": "\\begin{equation}\n\\large{ { \\large \\chi^2 ({\\bf n}, {\\bf T})} = \\large\\sum_{i=1}^{N} \\large\\sum_{J} \\left ( \\frac{{\\bf C}_{iJ} - {\\bf M}_{iJ}} {\\sigma_{iJ}} \\right)^{2}}\\\\\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E4.m1\" class=\"ltx_Math\" alttext=\"\\large{{\\large\\chi^{2}({\\bf n},{\\bf T})}=\\large\\sum_{i=1}^{N}\\large\\sum_{J}%&#10;\\left(\\frac{{\\bf C}_{iJ}-{\\bf M}_{iJ}}{\\sigma_{iJ}}\\right)^{2}}\\\\&#10;\" display=\"block\"><mrow><mrow><msup><mi mathsize=\"120%\">χ</mi><mn mathsize=\"120%\">2</mn></msup><mo>⁢</mo><mrow><mo maxsize=\"120%\" minsize=\"120%\">(</mo><mi mathsize=\"120%\">𝐧</mi><mo mathsize=\"120%\" stretchy=\"false\">,</mo><mi mathsize=\"120%\">𝐓</mi><mo maxsize=\"120%\" minsize=\"120%\">)</mo></mrow></mrow><mo mathsize=\"120%\" stretchy=\"false\">=</mo><mrow><munderover><mo largeop=\"true\" mathsize=\"120%\" movablelimits=\"false\" stretchy=\"false\" symmetric=\"true\">∑</mo><mrow><mi mathsize=\"120%\">i</mi><mo mathsize=\"120%\" stretchy=\"false\">=</mo><mn mathsize=\"120%\">1</mn></mrow><mi mathsize=\"120%\">N</mi></munderover><mrow><munder><mo largeop=\"true\" mathsize=\"120%\" movablelimits=\"false\" stretchy=\"false\" symmetric=\"true\">∑</mo><mi mathsize=\"120%\">J</mi></munder><msup><mrow><mo>(</mo><mfrac><mrow><msub><mi mathsize=\"120%\">𝐂</mi><mrow><mi mathsize=\"120%\">i</mi><mo>⁢</mo><mi mathsize=\"120%\">J</mi></mrow></msub><mo mathsize=\"120%\" stretchy=\"false\">-</mo><msub><mi mathsize=\"120%\">𝐌</mi><mrow><mi mathsize=\"120%\">i</mi><mo>⁢</mo><mi mathsize=\"120%\">J</mi></mrow></msub></mrow><msub><mi mathsize=\"120%\">σ</mi><mrow><mi mathsize=\"120%\">i</mi><mo>⁢</mo><mi mathsize=\"120%\">J</mi></mrow></msub></mfrac><mo>)</mo></mrow><mn mathsize=\"120%\">2</mn></msup></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $P({\\bf n}, {\\bf T})$ is the prior PDF for the model parameters. Since we {\\it jointly} fit all shell parameters and use MCMC to sample \nthe PDF, we call our approach joint-MCMC or jMCMC.\n\n\\subsection{MCMC method}\n\\label{S:mcmc_method}\n\nWe are specifically interested in the behaviour of entropy close to the centre of galaxy clusters, therefore we divide the radial bins roughly into central \nand outer parts, and marginalise over the parameters of the outer part. The observed entropy profiles show departure from single power law (straight line in\nlog-log plot) both at small and large radii. We retain all the annuli in the interior of a cluster until the annulus beyond which they depart from a power \nlaw and treat them as the inner region, which we fit to various models.\n\nGiven the large number of radial bins, it is \nhard to use eq.~\\ref{eq:pdf} directly, since marginalisation through direct integration of parameters of the outer part of the cluster is computationally expensive. \nA popular method for marginalising is the Markov-Chain Monte Carlo (MCMC) technique using the Metropolis-Hastings algorithm \\citep{met53, hast70}. This method \nemploys a random walk through the parameter space while maintaining the condition for detailed balance \\citep[see, e.g.,][for details]{press03}. After \nsome burn-in steps that are discarded, the random walk starts sampling the underlying PDF, so the parameter values from the random walk \nbehave as if they were drawn from the PDF. The random walk produces a chain of points in the parameter space \n${\\bf n_{\\tau}}, {\\bf T_{\\tau}}$, where $\\tau$ denotes the order in the chain. These samples (chains), being drawn from the target PDF (eq.~\\ref{eq:pdf}), \ncan be used to compute various integrals over the PDF by constructing the appropriate sample means. \n\nFrom the chain in the parameter space, we estimate the parameters\n$n_i, T_i$ for the $i^{\\rm th}$ shell by computing the sample means $(\\bar{n}_i, \\bar{T}_i)$. For example\n\n", "itemtype": "equation", "pos": 15568, "prevtext": "\nwhere $\\sigma_{iJ} = \\sqrt{{\\bf D}_{iJ}}$ is the Poisson error in the counts detected in the $J^{\\rm th}$ channel of the $i^{\\rm th}$ annulus \nin the source observation. In this expression the summation over $J$ matches the observed spectrum for the $i^{\\rm th}$ annulus, and \nthe summation over $i$ gives the combined match for the full data across all radial bins. The Bayesian posterior probability distribution \nfunction (PDF) of the model is then given by \n\n", "index": 9, "text": "\\begin{equation}\nP( {\\bf n}, {\\bf T} \\, | \\, {\\bf D}) \\propto \\exp \\left( -\\frac{\\chi^2 ({\\bf n}, {\\bf T}) }{2}  \\right) P( {\\bf n}, {\\bf T} )\\,,\n\\label{eq:pdf}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E5.m1\" class=\"ltx_Math\" alttext=\"P({\\bf n},{\\bf T}\\,|\\,{\\bf D})\\propto\\exp\\left(-\\frac{\\chi^{2}({\\bf n},{\\bf T}%&#10;)}{2}\\right)P({\\bf n},{\\bf T})\\,,\" display=\"block\"><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐧</mi><mo>,</mo><mpadded width=\"+1.7pt\"><mi>𝐓</mi></mpadded><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mi>𝐃</mi><mo stretchy=\"false\">)</mo></mrow><mo>∝</mo><mi>exp</mi><mrow><mo>(</mo><mo>-</mo><mfrac><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>𝐧</mi><mo>,</mo><mi>𝐓</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mn>2</mn></mfrac><mo>)</mo></mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><mi>𝐧</mi><mo>,</mo><mi>𝐓</mi><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $N_s$ is the number of samples. The (co)variances can be estimated by subtracting the mean from the individual MCMC sample values, and using the following expression for variance\n\n", "itemtype": "equation", "pos": 17731, "prevtext": "\nwhere $P({\\bf n}, {\\bf T})$ is the prior PDF for the model parameters. Since we {\\it jointly} fit all shell parameters and use MCMC to sample \nthe PDF, we call our approach joint-MCMC or jMCMC.\n\n\\subsection{MCMC method}\n\\label{S:mcmc_method}\n\nWe are specifically interested in the behaviour of entropy close to the centre of galaxy clusters, therefore we divide the radial bins roughly into central \nand outer parts, and marginalise over the parameters of the outer part. The observed entropy profiles show departure from single power law (straight line in\nlog-log plot) both at small and large radii. We retain all the annuli in the interior of a cluster until the annulus beyond which they depart from a power \nlaw and treat them as the inner region, which we fit to various models.\n\nGiven the large number of radial bins, it is \nhard to use eq.~\\ref{eq:pdf} directly, since marginalisation through direct integration of parameters of the outer part of the cluster is computationally expensive. \nA popular method for marginalising is the Markov-Chain Monte Carlo (MCMC) technique using the Metropolis-Hastings algorithm \\citep{met53, hast70}. This method \nemploys a random walk through the parameter space while maintaining the condition for detailed balance \\citep[see, e.g.,][for details]{press03}. After \nsome burn-in steps that are discarded, the random walk starts sampling the underlying PDF, so the parameter values from the random walk \nbehave as if they were drawn from the PDF. The random walk produces a chain of points in the parameter space \n${\\bf n_{\\tau}}, {\\bf T_{\\tau}}$, where $\\tau$ denotes the order in the chain. These samples (chains), being drawn from the target PDF (eq.~\\ref{eq:pdf}), \ncan be used to compute various integrals over the PDF by constructing the appropriate sample means. \n\nFrom the chain in the parameter space, we estimate the parameters\n$n_i, T_i$ for the $i^{\\rm th}$ shell by computing the sample means $(\\bar{n}_i, \\bar{T}_i)$. For example\n\n", "index": 11, "text": "\\begin{equation}\n\\bar{n}_i = \\frac{1}{N_s} \\sum_{\\tau=1}^{N_s} n_{i\\tau}\\,, \n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E6.m1\" class=\"ltx_Math\" alttext=\"\\bar{n}_{i}=\\frac{1}{N_{s}}\\sum_{\\tau=1}^{N_{s}}n_{i\\tau}\\,,\" display=\"block\"><mrow><mrow><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>N</mi><mi>s</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>τ</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>s</mi></msub></munderover><mpadded width=\"+1.7pt\"><msub><mi>n</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub></mpadded></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nA straightforward generalization of this gives the covariance between any two parameters, for example\n\n", "itemtype": "equation", "pos": 18008, "prevtext": "\nwhere $N_s$ is the number of samples. The (co)variances can be estimated by subtracting the mean from the individual MCMC sample values, and using the following expression for variance\n\n", "index": 13, "text": "\\begin{equation}\n{\\rm var}(n_i) = \\frac{1}{N_s} \\sum_{\\tau=1}^{N_s} (n_{i\\tau} - \\bar{n}_i)^2 \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E7.m1\" class=\"ltx_Math\" alttext=\"{\\rm var}(n_{i})=\\frac{1}{N_{s}}\\sum_{\\tau=1}^{N_{s}}(n_{i\\tau}-\\bar{n}_{i})^{%&#10;2}\\,.\" display=\"block\"><mrow><mrow><mrow><mi>var</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>N</mi><mi>s</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>τ</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>s</mi></msub></munderover><mpadded width=\"+1.7pt\"><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mpadded></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\n\n \n\\subsubsection{Implementing MCMC}\n\\label{S:MCMC}\nThe calculation of model ${\\bf M}_{iJ}$ using XSPEC makes the MCMC runs slow. Fortunately, for most clusters $n$ and $T$ fall into a well-known narrow \nrange. Our prior probability function  $P({\\bf n}, {\\bf T})$ (eq. \\ref{eq:pdf}) is chosen to be uniform in the box defined by \n$0.0001 < n_i < 1$ and $0.1 < T_i < 15$, where the \nunits of $n$  and $T$ are cm$^{-3}$ and keV, respectively. The number density $n$ is divided into $500$ logarithmic intervals, and $T$ is divided into \n$150$ linear intervals. The grid size for ${\\bf n}, {\\bf T}$  is much smaller than the typical error bars on the parameter values. We pre-calculate \ntemplate of ${\\dot{\\bf C}^{\\rm th}}$ on this grid. \n\nWe use Gibbs sampling for generating chains, so the random walk is constructed by updating individual parameters sequentially. \nThe proposal density along any single parameter being updated is chosen to be Gaussian\n\n", "itemtype": "equation", "pos": 18223, "prevtext": "\nA straightforward generalization of this gives the covariance between any two parameters, for example\n\n", "index": 15, "text": "\\begin{equation}\n{\\rm cov}(n_i, T_k) = \\frac{1}{N_s} \\sum_{\\tau=1}^{N_s} (n_{i\\tau} - \\bar{n}_i)(T_{k\\tau} - \\bar{T}_k) \\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E8.m1\" class=\"ltx_Math\" alttext=\"{\\rm cov}(n_{i},T_{k})=\\frac{1}{N_{s}}\\sum_{\\tau=1}^{N_{s}}(n_{i\\tau}-\\bar{n}_%&#10;{i})(T_{k\\tau}-\\bar{T}_{k})\\,.\" display=\"block\"><mrow><mrow><mrow><mi>cov</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mi>i</mi></msub><mo>,</mo><msub><mi>T</mi><mi>k</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><msub><mi>N</mi><mi>s</mi></msub></mfrac><mo>⁢</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mrow><mi>τ</mi><mo>=</mo><mn>1</mn></mrow><msub><mi>N</mi><mi>s</mi></msub></munderover><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>n</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>n</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>T</mi><mrow><mi>k</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>-</mo><msub><mover accent=\"true\"><mi>T</mi><mo stretchy=\"false\">¯</mo></mover><mi>k</mi></msub></mrow><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nHere $x$ denotes any single parameter of the full set of parameters $n_i, T_i$;  $x_\\tau$ is the updated value and $x_{\\tau-1}$ is the current value. At any \ngiven step, we update the value of a single parameter,  keeping all the rest fixed, by generating a random number from the proposal distribution given above. \nThe proposed point is retained in the chain with the probability \n\n", "itemtype": "equation", "pos": 19314, "prevtext": "\n\n \n\\subsubsection{Implementing MCMC}\n\\label{S:MCMC}\nThe calculation of model ${\\bf M}_{iJ}$ using XSPEC makes the MCMC runs slow. Fortunately, for most clusters $n$ and $T$ fall into a well-known narrow \nrange. Our prior probability function  $P({\\bf n}, {\\bf T})$ (eq. \\ref{eq:pdf}) is chosen to be uniform in the box defined by \n$0.0001 < n_i < 1$ and $0.1 < T_i < 15$, where the \nunits of $n$  and $T$ are cm$^{-3}$ and keV, respectively. The number density $n$ is divided into $500$ logarithmic intervals, and $T$ is divided into \n$150$ linear intervals. The grid size for ${\\bf n}, {\\bf T}$  is much smaller than the typical error bars on the parameter values. We pre-calculate \ntemplate of ${\\dot{\\bf C}^{\\rm th}}$ on this grid. \n\nWe use Gibbs sampling for generating chains, so the random walk is constructed by updating individual parameters sequentially. \nThe proposal density along any single parameter being updated is chosen to be Gaussian\n\n", "index": 17, "text": "\\begin{equation}\nq(x) = \\frac{1}{\\sqrt{2\\pi} \\sigma} \\exp \\left[-\\frac{(x_\\tau-x_{\\tau-1})^2}{2\\sigma^2} \\right]\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E9.m1\" class=\"ltx_Math\" alttext=\"q(x)=\\frac{1}{\\sqrt{2\\pi}\\sigma}\\exp\\left[-\\frac{(x_{\\tau}-x_{\\tau-1})^{2}}{2%&#10;\\sigma^{2}}\\right]\\,.\" display=\"block\"><mrow><mrow><mrow><mi>q</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mfrac><mn>1</mn><mrow><msqrt><mrow><mn>2</mn><mo>⁢</mo><mi>π</mi></mrow></msqrt><mo>⁢</mo><mi>σ</mi></mrow></mfrac><mo>⁢</mo><mrow><mi>exp</mi><mo>⁡</mo><mrow><mo>[</mo><mrow><mo>-</mo><mfrac><msup><mrow><mo stretchy=\"false\">(</mo><mrow><msub><mi>x</mi><mi>τ</mi></msub><mo>-</mo><msub><mi>x</mi><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup><mrow><mn>2</mn><mo>⁢</mo><msup><mi>σ</mi><mn>2</mn></msup></mrow></mfrac></mrow><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nIn this expression we have chosen $s_k$ as the parameter being updated and $n_{\\tau-1}$ and $T_{\\tau-1}$ are all the other parameters not equal to $s_k$;\n$P$ is the posterior PDF (eq. \\ref{eq:pdf}). A comma \nhas been added in the subscript for greater clarity. If the point is accepted, then we replace $s_{k,\\tau}$ with the nearest grid value in our template, since our \ntemplate ${\\dot{\\bf C}^{\\rm th}}$ are calculated on a grid. The procedure is then repeated for all the other parameters sequentially to construct the chain.\n\nSince our parameter space is compact, if the proposal point falls out of the box then we use periodic boundary condition to bring it back into the box. \nA moment's reflection shows that this does not affect the symmetry of the proposal density $q(x|x^*) = q(x^*|x)$, which is required to keep the condition for detailed balance. Although different $\\sigma$s were chosen\nfor the number density and temperature, their values were kept the same across the radial bins. Their values were chosen to ensure an acceptance rate of roughly 20--30 per cent, and typical $\\sigma$ values were larger than the grid size in $n$ and $T$.\n\n\\subsubsection{Central entropy profile}\n\\label{S:cent_entr_prof}\nAny physical quantity that depends explicitly on thermodynamic variables can be estimated in a manner similar to the one described above to \nestimate $n_i, T_i$ by using the original chain in the parameter space to construct a subsidiary chain through\n\n", "itemtype": "equation", "pos": 19828, "prevtext": "\nHere $x$ denotes any single parameter of the full set of parameters $n_i, T_i$;  $x_\\tau$ is the updated value and $x_{\\tau-1}$ is the current value. At any \ngiven step, we update the value of a single parameter,  keeping all the rest fixed, by generating a random number from the proposal distribution given above. \nThe proposed point is retained in the chain with the probability \n\n", "index": 19, "text": "\\begin{equation}\np = \\min \\left [ 1, \\frac{P(s_{k,\\tau} ; {\\bf n}_{\\tau-1}, {\\bf T}_{\\tau-1} \\, | \\,{\\bf D})}{P(s_{k,\\tau-1} ; {\\bf n}_{\\tau-1}, {\\bf T}_{\\tau-1} \\, | \\,{\\bf D})}  \\right ]\\,.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E10.m1\" class=\"ltx_Math\" alttext=\"p=\\min\\left[1,\\frac{P(s_{k,\\tau};{\\bf n}_{\\tau-1},{\\bf T}_{\\tau-1}\\,|\\,{\\bf D}%&#10;)}{P(s_{k,\\tau-1};{\\bf n}_{\\tau-1},{\\bf T}_{\\tau-1}\\,|\\,{\\bf D})}\\right]\\,.\" display=\"block\"><mrow><mrow><mi>p</mi><mo>=</mo><mrow><mi>min</mi><mo>⁡</mo><mrow><mo>[</mo><mn>1</mn><mo>,</mo><mfrac><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mrow><mi>k</mi><mo>,</mo><mi>τ</mi></mrow></msub><mo>;</mo><msub><mi>𝐧</mi><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></msub><mo>,</mo><mpadded width=\"+1.7pt\"><msub><mi>𝐓</mi><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></msub></mpadded><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mi>𝐃</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mrow><mi>P</mi><mrow><mo stretchy=\"false\">(</mo><msub><mi>s</mi><mrow><mi>k</mi><mo>,</mo><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></mrow></msub><mo>;</mo><msub><mi>𝐧</mi><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></msub><mo>,</mo><mpadded width=\"+1.7pt\"><msub><mi>𝐓</mi><mrow><mi>τ</mi><mo>-</mo><mn>1</mn></mrow></msub></mpadded><mo rspace=\"4.2pt\" stretchy=\"false\">|</mo><mi>𝐃</mi><mo stretchy=\"false\">)</mo></mrow></mrow></mfrac><mo rspace=\"4.2pt\">]</mo></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere the function can depend on the full range of parameters or on only a few of them. As an example, the entropy in each radial bin can be estimated by constructing the following subsidiary chain ($n_e$ is electron density simply related to the total number density once metallicity is known)\n\n", "itemtype": "equation", "pos": 21506, "prevtext": "\nIn this expression we have chosen $s_k$ as the parameter being updated and $n_{\\tau-1}$ and $T_{\\tau-1}$ are all the other parameters not equal to $s_k$;\n$P$ is the posterior PDF (eq. \\ref{eq:pdf}). A comma \nhas been added in the subscript for greater clarity. If the point is accepted, then we replace $s_{k,\\tau}$ with the nearest grid value in our template, since our \ntemplate ${\\dot{\\bf C}^{\\rm th}}$ are calculated on a grid. The procedure is then repeated for all the other parameters sequentially to construct the chain.\n\nSince our parameter space is compact, if the proposal point falls out of the box then we use periodic boundary condition to bring it back into the box. \nA moment's reflection shows that this does not affect the symmetry of the proposal density $q(x|x^*) = q(x^*|x)$, which is required to keep the condition for detailed balance. Although different $\\sigma$s were chosen\nfor the number density and temperature, their values were kept the same across the radial bins. Their values were chosen to ensure an acceptance rate of roughly 20--30 per cent, and typical $\\sigma$ values were larger than the grid size in $n$ and $T$.\n\n\\subsubsection{Central entropy profile}\n\\label{S:cent_entr_prof}\nAny physical quantity that depends explicitly on thermodynamic variables can be estimated in a manner similar to the one described above to \nestimate $n_i, T_i$ by using the original chain in the parameter space to construct a subsidiary chain through\n\n", "index": 21, "text": "\\begin{equation}\nf_\\tau = f(n_{i{\\tau}}, T_{i{\\tau}})\\,,\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E11.m1\" class=\"ltx_Math\" alttext=\"f_{\\tau}=f(n_{i{\\tau}},T_{i{\\tau}})\\,,\" display=\"block\"><mrow><mrow><msub><mi>f</mi><mi>τ</mi></msub><mo>=</mo><mrow><mi>f</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>n</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>,</mo><msub><mi>T</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo rspace=\"4.2pt\" stretchy=\"false\">)</mo></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "   \n\nTo isolate the behaviour of entropy near the centre of a cluster, we focus our attention on a few central annuli (for how these are chosen, \nsee the first paragraph of section \\ref{S:mcmc_method}), say $i=1, N_c$, where $N_c < N$. \nWe then estimate the \nexpectation values and covariance matrix for these entropies $\\bar{K}_i$ and ${\\rm cov(i,j) \\equiv \\rm cov}(K_i, K_j)$. In principle we can now plot $\\bar{K}_i$ with \nerror bars to display the range of entropy profiles allowed by the data. However, this is not optimal, and we find it useful to condense the large information available \nin the covariance matrix by fitting the entropy to an analytic profile. We find that the clusters analysed by us display two kinds of behaviour: a) central cores and \nb) central cusps. Therefore, we choose the following models for the central entropy profile: (i) a flat core profile after \\citealt{cav09}\n\n", "itemtype": "equation", "pos": -1, "prevtext": "\nwhere the function can depend on the full range of parameters or on only a few of them. As an example, the entropy in each radial bin can be estimated by constructing the following subsidiary chain ($n_e$ is electron density simply related to the total number density once metallicity is known)\n\n", "index": 23, "text": "\\begin{equation}\nK_{i{\\tau}} = T_{i{\\tau}} n_{e, i{\\tau}}^{-2/3}.\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E12.m1\" class=\"ltx_Math\" alttext=\"K_{i{\\tau}}=T_{i{\\tau}}n_{e,i{\\tau}}^{-2/3}.\" display=\"block\"><mrow><mrow><msub><mi>K</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>=</mo><mrow><msub><mi>T</mi><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></msub><mo>⁢</mo><msubsup><mi>n</mi><mrow><mi>e</mi><mo>,</mo><mrow><mi>i</mi><mo>⁢</mo><mi>τ</mi></mrow></mrow><mrow><mo>-</mo><mrow><mn>2</mn><mo>/</mo><mn>3</mn></mrow></mrow></msubsup></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\n(ii) a single power law profile\n\n", "itemtype": "equation", "pos": 22855, "prevtext": "   \n\nTo isolate the behaviour of entropy near the centre of a cluster, we focus our attention on a few central annuli (for how these are chosen, \nsee the first paragraph of section \\ref{S:mcmc_method}), say $i=1, N_c$, where $N_c < N$. \nWe then estimate the \nexpectation values and covariance matrix for these entropies $\\bar{K}_i$ and ${\\rm cov(i,j) \\equiv \\rm cov}(K_i, K_j)$. In principle we can now plot $\\bar{K}_i$ with \nerror bars to display the range of entropy profiles allowed by the data. However, this is not optimal, and we find it useful to condense the large information available \nin the covariance matrix by fitting the entropy to an analytic profile. We find that the clusters analysed by us display two kinds of behaviour: a) central cores and \nb) central cusps. Therefore, we choose the following models for the central entropy profile: (i) a flat core profile after \\citealt{cav09}\n\n", "index": 25, "text": "\\begin{equation}\nK(R) = K_0 + K_{100} \\left(\\frac{R}{100~\\rm{kpc}} \\right)^\\alpha;\n\\label{eq:flat_core_model}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E13.m1\" class=\"ltx_Math\" alttext=\"K(R)=K_{0}+K_{100}\\left(\\frac{R}{100~{}\\rm{kpc}}\\right)^{\\alpha};\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>K</mi><mn>0</mn></msub><mo>+</mo><mrow><msub><mi>K</mi><mn>100</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><mrow><mpadded width=\"+3.3pt\"><mn>100</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac><mo>)</mo></mrow><mi>α</mi></msup></mrow></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nand (iii) a double power law profile\n\n", "itemtype": "equation", "pos": 23012, "prevtext": "\n(ii) a single power law profile\n\n", "index": 27, "text": "\\begin{equation}\nK(R) = K_1 \\left(\\frac{R}{100~\\rm{kpc}} \\right)^{\\alpha 1};\n\\label{eq:spl_model}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E14.m1\" class=\"ltx_Math\" alttext=\"K(R)=K_{1}\\left(\\frac{R}{100~{}\\rm{kpc}}\\right)^{\\alpha 1};\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><msub><mi>K</mi><mn>1</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><mrow><mpadded width=\"+3.3pt\"><mn>100</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mi>α</mi><mo>⁢</mo><mn>1</mn></mrow></msup></mrow></mrow><mo>;</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\n\nAt this point we treat $\\bar{K}_i$ as observed values of entropy. To fit the analytic expressions to these values, we construct the Fisher matrix from the inverse \nof the covariance matrix calculated above, $ F_{ij} = {\\rm cov}(i,j)^{-1}$. The $\\chi^2$ to fit the model is then given by\n\n", "itemtype": "equation", "pos": 23162, "prevtext": "\nand (iii) a double power law profile\n\n", "index": 29, "text": "\\begin{equation}\nK(R) = K_1 \\left(\\frac{R}{100~\\rm{kpc}} \\right)^{\\alpha 1} + K_2 \\left(\\frac{R}{100~\\rm{kpc}} \\right)^{\\alpha 2} .\n\\label{eq:dbl_model}\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E15.m1\" class=\"ltx_Math\" alttext=\"K(R)=K_{1}\\left(\\frac{R}{100~{}\\rm{kpc}}\\right)^{\\alpha 1}+K_{2}\\left(\\frac{R}%&#10;{100~{}\\rm{kpc}}\\right)^{\\alpha 2}.\" display=\"block\"><mrow><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>R</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mrow><mrow><msub><mi>K</mi><mn>1</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><mrow><mpadded width=\"+3.3pt\"><mn>100</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mi>α</mi><mo>⁢</mo><mn>1</mn></mrow></msup></mrow><mo>+</mo><mrow><msub><mi>K</mi><mn>2</mn></msub><mo>⁢</mo><msup><mrow><mo>(</mo><mfrac><mi>R</mi><mrow><mpadded width=\"+3.3pt\"><mn>100</mn></mpadded><mo>⁢</mo><mi>kpc</mi></mrow></mfrac><mo>)</mo></mrow><mrow><mi>α</mi><mo>⁢</mo><mn>2</mn></mrow></msup></mrow></mrow></mrow><mo>.</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nUsing this and eq.~\\ref{eq:pdf}, a Bayesian posterior PDF for the fit parameters (e.g., $K_0$, $K_{100}$ and $\\alpha$ for the flat core profile) is obtained \nthrough a second MCMC analysis. Using the full covariance \nmatrix takes into account the radial variation of entropy in individual chains, something that is not captured by using only the marginalised errors on the individual \nshell entropies.\n\n\\subsection{Benchmarking the jMCMC method}\n\\label{S:sim_data_and_test_cluster}\n\nWe tested our jMCMC analysis on simulated as well as actual data. Simulated projected spectra were generated using XSPEC. We also used the \\textit{Chandra} \nobservations of the cool-core cluster A2597 to further test the usefulness of our method for actual data. The procedure used for generating the simulated data, \nand the Chandra observations of A2597 are described in the following sections.\n\n\\subsubsection{Simulated Spectra}\n\\label{S:sim_spectra}\n\n\\setcounter{figure}{0}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.99\\linewidth]{figures/temp_density_100ks_chandra_response_mcmc.ps}\n\\caption{Density (triangles) and temperature (diamonds) profiles obtained from the jMCMC analysis of the 100 ks simulated cluster spectra described in \nsection \\ref{S:sim_spectra}. For comparison the input density and temperature profiles used for generating the simulated spectra are also shown.}\n\\label{fig:100ks_n_T_profs}\n\\end{center}\n\\end{figure}\n\nSimulated spectra for spherically symmetric shells of a cluster were generated using the \\textit{apec} model and the \n\\textit{fakeit} command in XSPEC. Profiles of intracluster gas density and temperature  (shown with lines in Fig. \\ref{fig:100ks_n_T_profs}) \nwere generated assuming an NFW dark-matter potential (with concentration parameter $c_{200}=3.3$, $M_{200}=5.24 \\times 10^{14} M_\\odot$; \\citealt{nav96}) \nand a flat-core entropy profile (eq. \\ref{eq:flat_core_model}; \n$K_0=37.9$ keV cm$^2$; $K_{100}=117.9$ keV cm$^2$ and $\\alpha=1.11$). These density and temperature profiles \nwere then used as inputs for simulating spectra from spherical shells, assuming a constant value of density and temperature  in each shell. \nThe elemental abundance was frozen to a constant value of one-third solar for all the shells, and a redshift (z) value of 0.05 was assumed for the cluster. \nThe instrumental response files (Redistribution Matrix Files and Ancillary Response Files) required by the \\textit{fakeit} command were \nproduced using the CIAO task \\textit{specextract} \nfor an actual \\textit{Chandra} observation with \\textit{weight$=$no}. \nSpectra were simulated for an exposure time of 100 ks. \nThe gas number density, $n(R)$, was used for obtaining the normalization of the APEC model ($\\eta$), and the two are related through\n\n", "itemtype": "equation", "pos": 23618, "prevtext": "\n\nAt this point we treat $\\bar{K}_i$ as observed values of entropy. To fit the analytic expressions to these values, we construct the Fisher matrix from the inverse \nof the covariance matrix calculated above, $ F_{ij} = {\\rm cov}(i,j)^{-1}$. The $\\chi^2$ to fit the model is then given by\n\n", "index": 31, "text": "\\begin{equation}\n\\chi^2 = \\sum^{N_c}_i \\sum^{N_c}_j (K(R_i) - \\bar{K}_i) F_{ij}(K(R_j) - \\bar{K}_j)\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E16.m1\" class=\"ltx_Math\" alttext=\"\\chi^{2}=\\sum^{N_{c}}_{i}\\sum^{N_{c}}_{j}(K(R_{i})-\\bar{K}_{i})F_{ij}(K(R_{j})%&#10;-\\bar{K}_{j})\" display=\"block\"><mrow><msup><mi>χ</mi><mn>2</mn></msup><mo>=</mo><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>i</mi><msub><mi>N</mi><mi>c</mi></msub></munderover><mrow><munderover><mo largeop=\"true\" movablelimits=\"false\" symmetric=\"true\">∑</mo><mi>j</mi><msub><mi>N</mi><mi>c</mi></msub></munderover><mrow><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mi>i</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msub><mover accent=\"true\"><mi>K</mi><mo stretchy=\"false\">¯</mo></mover><mi>i</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow><mo>⁢</mo><msub><mi>F</mi><mrow><mi>i</mi><mo>⁢</mo><mi>j</mi></mrow></msub><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mrow><mrow><mi>K</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><msub><mi>R</mi><mi>j</mi></msub><mo stretchy=\"false\">)</mo></mrow></mrow><mo>-</mo><msub><mover accent=\"true\"><mi>K</mi><mo stretchy=\"false\">¯</mo></mover><mi>j</mi></msub></mrow><mo stretchy=\"false\">)</mo></mrow></mrow></mrow></mrow></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $D_A$ is the angular diameter distance, $n_e$ and $n_p$ are the electron and proton number densities, and for one-third solar abundance \n$n_e=0.53n$ and $n_p=n_e/1.2$. Assuming a \nconstant gas density in each shell, the integral in the above equation reduces to ${n_e}^2 V/1.2$; where $V$ is the volume of the shell.\n\n As the observed emission from an astronomical object is always seen in  projection along the line of sight, we produced projected spectra for all the \nannuli. For the $i^{\\rm th}$ shell the projected spectrum was obtained by combining the simulated spectra from all the outer $k \\geq i$ shells,  \nweighted according to their projected volumes intercepted by the $i^{\\rm th}$ shell (eq. \\ref{eq:vol}). The projected spectra \nwere combined in radial bins in order to contain \na minimum of 10000 counts in each shell. For each spectrum, channels were combined together in spectral bins so that each bin contains a minimum of \n25 counts, so that the assumption of a $\\chi^2$-distribution with Gaussian errors is valid.\n\n\\subsubsection{Test Cluster}\n\\label{S:test_cluster}\n\n\\begin{table}\n \\caption{Cluster sample.}\n\\label{tab:clus_samp}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{l l l l l}\n\\hline\nCluster & z&$\\alpha$(J2000), $\\delta$(J2000)&Obsn.&Exp.\\\\\nName&&&ID&Time (ks)\\\\\n\\hline\n\\hline\n  A85&0.0557&00 41 37.8, -09 20 33&15173&43.08\\\\\n A133&0.0603&01 02 39.0, -21 57 15&2203&35.91\\\\\n A478&0.0881&04 13 20.7, +10 28 35&1669&42.94\\\\\nA1650&0.0823&12 58 36.76, -01 43 34.2&5823&40.13\\\\\nA1795&0.0625&13 49 00.5, +26 35 07 &493&19.88\\\\\nA2029&0.0775&15 10 58.7, +05 45 42&4977&78.91\\\\\nA2142&0.0899&15 58 20.00, +27 14 00.3&15186&91.07\\\\\nA2204& 0.151&16 32 45.7, +05 34 43&7940&78.16\\\\\nA2244&0.0996&17 02 34.01, +34 04 41.1&4179&57.72\\\\\nA2597$^\\dag$&0.0824&23 25 19.70, -12 07 27.7&7329&60.90\\\\\nA3112&0.0759&03 17 52.4, -44 14 35&13135&42.80\\\\\nHydra-A&0.0549&09 18 05.65, -12 05 44&576&19.52\\\\\n A754&0.0535&09 08 50.1, -09 38 12&577&44.77\\\\\nA2256&0.0581&17 03 43.5, +78 43 03&16129&44.49\\\\ \nA3158&0.0583&03 42 39.6, -53 37 50&3712&31.35\\\\\nA3667&0.0552&20 12 33.68, -56 50 26.3&5751&130.60\\\\\nZWCL1215&0.0767&12 17 40.6, +03 39 45&4184&12.22\\\\\n\\hline\n$^\\dag$ Test cluster\n\\end{tabular}}\n\\end{table}  \n\nWe tested our jMCMC method for actual X-ray data using \\textit{Chandra} observations of the test cluster A2597. \nA log of the \\textit{Chandra} Observation of A2597 is given in Table \\ref{tab:clus_samp}. The \ndata for this observation were obtained from the High Energy Astrophysics Science Archive Research centre (HEASARC). The CIAO version 4.7 and CALDB \nversion 4.6.7 were used for analyzing the data. The data were reprocessed using the standard \\textit{chandra\\_repro} tool to produce the level 2 \nreduced event files (evt2) from the level 1 event files (evt1). Background event files matching with the source observation were produced using \nMaxim Markevitch's blank-sky background database\\footnote{see, http://cxc.cfa.harvard.edu/contrib/maxim/acisbg}. The source observation was cleaned \nof any flare contamination using the \\textit{lc\\_clean} script so as to match the \nblanksky background maps. Point sources were removed based on a visual inspection of the images. \nSpectra and corresponding response files were \ngenerated for a number of circular annuli centred on the cluster's X-ray peak using the CIAO task \\textit{specextract}. The width of the annuli \nwas chosen such that each annulus had at least 10000 counts in the 0.7-7.0 keV energy range\\footnote{For some of the clusters \nthis condition was slightly relaxed in order to have at least one annulus within $R\\leq$10 kpc while for some of the bright clusters the \ncondition was more constrained and the minimum counts were increased in order to have not more than 25 annuli in the cluster.}. \nThe spectral channels were combined in bins to have \nminimum 25 counts in each bin.\\\\\n\n\n  To check  the robustness of our method we performed various tests on the test cluster A2597. For most of our analyses the elemental \nabundance, $Z$, in all the annuli spectra was assumed to be equal to the average elemental abundance of the cluster obtained from the analysis of the cluster's full spectrum in XSPEC. To check for the effect of a variable $Z$, we added $Z_i$ as an additional parameter for the $i^{\\rm th}$ shell along with $n_i$ and $T_i$. To keep the size of model spectra (${\\bf M}_{iJ}$) manageable we reduced the number of $n$ and $T$ grid points to half for this test (i.e., from 500 and 150 to 250 and 75; see section \\ref{S:MCMC}). The $Z$ parameter was added as a third-axis to this box with 5 linearly distributed values between 0.2 to 1.0 times the solar elemental abundance value. \n\nHaving too many annuli in our analysis makes it computationally slow, and can lead to large errors in the parameters. On the other hand, having few annuli can \nlead to the inner regions of the cluster not being resolved properly. Therefore, we tested for the effect \nof varying the number of annuli used for the analysis. Minimum $\\sim$17000 counts in each annulus led to 13 annuli in A2597. The minimum counts were increased to $\\sim$30000 and decreased to $\\sim$12000 to have a total of 6 and 18 annuli, respectively. \nWe carried out the jMCMC analysis of A2597 with 6, 13 and 18 annuli. We also investigated the effect of changing the length of MCMC chains. The results from all these tests \nare discussed in section \\ref{S:test_clus_res}.\\\\\n\n\n\\subsection{Results for simulated spectra and A2597}\n\\label{S:results}\njMCMC analysis was carried out for the simulated and actual data as described in sections \\ref{S:mcmc_method}  \\& \\ref{S:sim_data_and_test_cluster}. \n\\label{S:sim_spec_res}\nFig.~\\ref{fig:100ks_n_T_profs} shows the density and temperature \nprofiles obtained from the jMCMC analysis of the 100 ks simulated spectra. For comparison the actual input profiles are also shown. \nThe jMCMC profiles are found to be consistent with the input profiles, and are unbiased.\n\n\\subsubsection{A2597}\n\\label{S:test_clus_res}\nWe performed various tests on A2597 to optimize the jMCMC algorithm. Based on the results of these tests we made certain choices that apply to the \nrest of the cluster sample presented later.\n\n\\begin{itemize}\n\n\\setcounter{figure}{1}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_density_Z_variation.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_temp_Z_variation.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_entropy_Z_variation.ps}\n\\caption{Electron density, temperature and entropy profiles obtained from the jMCMC analysis of the Chandra observations of the \ntest cluster A2597. Profiles obtained with fixed and variable elemental abundance are shown using black and red colors, \nrespectively.}\n\\label{fig:test_clus_13shell_res}\n\\end{figure*}\n\n\\item {{\\it Fixed vs. variable elemental abundance}:} \nThe electron number density, temperature and entropy profiles obtained from the jMCMC analysis of the test cluster A2597 are shown in \nFig.~\\ref{fig:test_clus_13shell_res}. The profiles obtained with a variable elemental abundance are also shown. The Fig. shows \nthat a free elemental abundance does not affect the density and entropy profiles significantly. \nAs we are mostly interested in the entropy profiles of the clusters, \nwe have {\\it fixed the elemental abundance} for the analysis of the remaining clusters at their respective average values obtained \nfrom spectrum integrated over all shells. This is essentially done for computational reasons.\n\n\\setcounter{figure}{2}\n\\begin{figure}\n \\includegraphics[width=0.98\\linewidth]{figures/A2597_entropy_shell_number_comparison.ps}\n\\caption{Entropy profiles obtained from the jMCMC analysis of the \ntest cluster using 6 (blue), 13 (black) and 18 (red) annuli. The flat-core model fits are also shown using dashed lines.}\n\\label{fig:test_clus_different_annuli_res}\n\\end{figure}\n\n\\item {{\\it The number of annuli}:} The test cluster was analysed with different number of annuli and the resulting entropy profiles \nare shown in Fig. \\ref{fig:test_clus_different_annuli_res}. It can be seen that varying the number of annuli does not change the \ngeneral shape of the entropy profile, especially at resolved radii. However, note that with just 6 annuli one can not constrain the \nprofile shape very well. For example, the flattening of the entropy profile towards the centre seen with 13 and 18 annuli, does not seem \nto be very prominent in the profile with just 6 annuli. On the other hand, having 18 annuli leads to large errors in the inner entropy values \nand therefore can lead to a poor fit. In general, for the rest of the sample, we try to optimise in terms of best resolution of the cluster core profiles.\n\n\\setcounter{figure}{3}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_temp_variable_chain_length.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_density_variable_chain_length.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_entropy_variable_chain_length.ps}\n\\caption{Temperature, electron density and entropy profiles obtained from the jMCMC analysis of the test \ncluster using 2000 (black), 5000 (blue), 10000 (red) and 20000 (green) steps along each \nparameter direction in the MCMC random walk.}\n\\label{fig:test_clus_different_cl_res}\n\\end{figure*}\n\n\\item {{\\it Number of steps}:} We tried different numbers of steps (2000, 5000, 10000 and 20000) in the MCMC random walk along {\\it each} parameter direction \nfor the test cluster, and the temperature, electron density and entropy profiles obtained are shown in Fig. \\ref{fig:test_clus_different_cl_res}. The profiles \nare found to be mostly consistent with each other. However, it can be seen that using 2000 steps gives slightly larger error bars, especially in the \ntemperature profile, and the mean values also seem to be slightly shifted from the rest of the profiles. Profiles for larger number of steps are found to be almost \nidentical. Although for the test cluster 5000 steps seems to be an optimum value at which the results seem to be converging, considering that \nmany of our clusters have poor count statistics, we chose 100000 steps as a safe value for our analysis.\n\n\\end{itemize}\n\n\n\\subsection{Comparison with other methods} \n\\label{S:method_comp}\n\n\\setcounter{figure}{4}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_temp_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_density_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_entropy_mcmc_vs_Cavagnolo_vs_Panagoulia_loglog.ps} \n\\caption{Temperature, electron number density and entropy profiles obtained using different analysis methods \nfor the 100 ks simulated spectra. Results from jMCMC, C09's and P14's methods are shown \nusing black, red and blue colors. The input electron density, temperature and entropy profiles used for generating \nthe simulated spectra are also shown using black solid lines. The dashed black, red and blue lines in the third panel \nshow the flat-core model (eq.~\\ref{eq:flat_core_model}) fits to the jMCMC, C09 and P14 entropy profiles, respectively.}\n\\label{fig:100ks_sim_different_method}\n\\end{figure*}\n\nThere are two recent analyses of radial entropy profiles which differ from each other: \\cite{cav09} (henceforth, C09) and \\cite{pan14} \n(henceforth, P14). In \\cite{cav09} temperature profiles are directly obtained from the analysis of the 0.7-7.0 keV {\\it projected} spectra. \nHigh resolution surface-brightness profiles and spectra in the 0.7-2.0 keV range were then used for obtaining high-resolution profiles of \ndeprojected electron densities. The projected temperature profiles are interpolated to match the resolution of the density \nprofiles. The density and temperature profiles are then combined to obtain the entropy profiles. The main advantage of C09's approach is that \nit gives an excellent resolution in the cluster core. The problem with their analysis is that the use of projected spectra leads to an \noverestimation of the temperature (and hence, entropy) in the central region. An earlier paper, \\citet{don06},\ncompared the entropy profiles using projected and deprojected temperatures and found them to be similar (this is not quite correct; see left panels of Figs. \\ref{fig:100ks_sim_different_method} \\& \\ref{fig:test_clus_different_method}).\n\\cite{pan14} deproject the spectra using the \\textit{DSDEPROJ} routine described in \\cite{russ08}. Profiles of \nelectron density and temperature were obtained from the spectral analysis of the deprojected spectra, and were combined to obtain the entropy profiles. \n\n\\setcounter{figure}{5}\n\\begin{figure*}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_temp_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_density_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_entropy_mcmc_vs_Cavagnolo_vs_Panagoulia_loglog.ps}\n\\caption{Temperature, electron number density and entropy profiles obtained using different analysis methods \nfor the test cluster. Results from jMCMC analysis, C09's method and P14's method are shown \nusing black, red and blue colors. The dashed black, red and blue lines in the third panel show the flat-core \nmodel (eq.~\\ref{eq:flat_core_model}) fits to the jMCMC, C09 and P14 entropy profiles, respectively.}\n\\label{fig:test_clus_different_method}\n\\end{figure*}\n\n\nThe temperature, electron density and entropy profiles obtained using \njMCMC, C09's and P14's analysis methods for the simulated spectra and the test cluster \nare shown in Figs. \\ref{fig:100ks_sim_different_method} and \\ref{fig:test_clus_different_method}, respectively. \nC09's method is found to overestimate the temperature in the inner annuli which is expected since the method makes \nuse of projected spectra and hence inner annuli are affected by the hotter shells lying outside. \nSimilarly the temperature at larger radii is underestimated. Results from jMCMC analysis \nand P14's method are found to be in good agreement with each other. For the test cluster, both these methods \nseem to overestimate the density in the outermost annulus. However, this is a common artifact of deprojection analyses \ndue to the excess emission from shells outside the outermost annulus contributing to its emission.\\\\\n\n\\subsection{Entropy profile  with/without correlations}\n\\label{S:entr_fit_witho_correl}\n\n\\setcounter{figure}{6}\n\\begin{figure*}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_alpha.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_k100.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_entropy_flat_core_fit_using_mcmc.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_alpha_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_k100_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_entropy_flat_core_fit_using_mcmc_without_correlation.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_alpha_with_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_k100_with_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_entropy_flat_core_fit_using_mcmc_with_correlation.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_alpha_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_k100_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_entropy_flat_core_fit_using_mcmc_without_correlation.ps}\\\\ \n\\caption{Entropy profile fitting, with (first row) and without (second row) correlation between the shell entropies ($T_{\\rm keV}/n_e^{2/3}$) \nfor the test cluster. Entropy profile of A3112 with and without correlation are also given in the third and fourth rows, respectively. \nThe contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards. \nGreyscale denotes the PDF density.}\n\\label{fig:entr_fit_witho_correl}\n\\end{figure*}\n\nOne of the main drawbacks of the standard deprojection methods is that they do not take into account the correlations between the \ndeprojected parameters obtained for the different shells. To demonstrate this effect we fitted the entropy profile of the test cluster \nobtained from the jMCMC analysis using a flat-core model (eq. \\ref{eq:flat_core_model}), \nas described in section \\ref{S:cent_entr_prof}. The expectation values of entropy for each shell $\\bar{K_i}$ and the entropy covariance \nmatrix ${\\rm cov}(K_i, K_j)$ were calculated, which were then used in another MCMC analysis to obtain chains of $K_0$, $K_{100}$ and $\\alpha$. \nTo see the effect of no correlation between the entropies of different shells, we also \ncarried out the same exercise with the non-diagonal terms of the entropy covariance matrix set to zero. \n\nThe $K_0$-$\\alpha$ \nand $K_0$-$K_{100}$ scatter plots and the resulting flat-core fits obtained from the two methods (with and without cross-covariance) \nare shown in the first two rows \nof Fig. \\ref{fig:entr_fit_witho_correl}. The expectation values of $K_0$, $K_{100}$ and $\\alpha$ obtained using the full entropy \ncovariance matrix are 11.31$\\pm$0.78 keV cm$^2$, 101.47$\\pm$1.51 keV cm$^2$ and 1.37$\\pm$0.04, respectively, and those \nobtained using only the diagonal terms are 11.84$\\pm$0.86 keV cm$^2$, 99.71$\\pm$2.68 keV cm$^2$ and 1.42$\\pm$0.06, respectively. \nIgnoring correlation between the entropies of different shells in the test cluster, therefore, does not seem to have any \nsignificant effect on the fitted parameters. The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the two methods, \nhowever, do show some difference. For clusters with large covariances between the shell entropies, the effect of including \ncorrelations can be significant, as is seen for the cluster A3112, taken from the cluster sample analysed in this paper. \nThe $K_0$, $K_{100}$ and $\\alpha$ values obtained for A3112, with and without considering correlation between shell entropies, \nare 2.04$\\pm$0.42 keV cm$^2$, 135.14$\\pm$1.47 keV cm$^2$ and 0.95$\\pm$0.01, and \n2.35$\\pm$0.46 keV cm$^2$, 129.17$\\pm$2.18 keV cm$^2$ and 0.94$\\pm$0.02, respectively. \nThe value of $K_{100}$ for A3112, obtained from the two methods are, therefore, found to be significantly different. \nThe $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots for A3112 and the resulting flat-core fits obtained from the two methods (with \nand without cross-covariance) are shown in the last two rows of Fig. \\ref{fig:entr_fit_witho_correl}.\n\n\n\n\\section{Sample Selection \\& Results}\n\n\\label{S:samp_res}\n\n  We carried out the jMCMC analysis on the \\textit{Chandra} X-ray observations of a sample of clusters selected \n  from the statistically complete low-redshift sample of \\cite{san10}. Our sample includes 17 clusters and spans \n  a redshift range of 0.0535 to 0.151. The sample and the details of the observations used, are \n  given in Table \\ref{tab:clus_samp}. Results from some of the clusters from the low-z sample of \\cite{san10} are not \n  shown in this paper mostly due to poor count statistics in their X-ray observations leading to too few annuli in the \n  entropy profiles.\n\nThe cluster sample was analysed using the jMCMC method. The ${\\bf n_e}, {\\bf T}$ chains resulting from the jMCMC analysis were combined \nto produce subsidiary entropy chains using ${\\bf K} = {\\bf T}{\\bf n_e}^{-2/3}$. For each cluster, the elemental abundance in each annulus \nwas fixed at the average value obtained from the analysis of the full cluster spectrum. The resulting entropy profiles were then fitted \nusing flat-core and power law models, as described below. \n\n\\subsection{Flat-Core model}\n\\label{S:flat_core_fit}\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_entropy_flat_core_fit_using_mcmc.ps}\\\\   \n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n   \\caption{The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the flat-core entropy model (eq.~\\ref{eq:flat_core_model}) fitting for \n   FC (flat-core) sample. \n   The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards.\n   Greyscale denotes the PDF density.}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_entropy_flat_core_fit_using_mcmc.ps}\\\\ \n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_entropy_flat_core_fit_using_mcmc.ps}\\\\   \n  \\caption{(Contd.)}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\caption{(Contd.)}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\\begin{table}\n \\caption{Flat-core entropy model (eq. \\ref{eq:flat_core_model}) for FC (flat-core) and PL (power law) samples. \n Here, DOF = number of annuli $-$ number of fit parameters (3 for a flat-core fit).\n}\n\\label{tab:flat_core_results_smpl1}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{c c c c c}\n\\hline\nCluster Name & $K_{0}$ & $K_{100}$ & $\\alpha$ & $\\chi^{2}_{\\rm red}$ (DOF)\\\\\n & (keV cm$^{2}$) & (keV cm$^{2}$) & & \\\\\n\\hline\n\\hline\n FC sample & & & & \\\\\n\\hline\n A133 & 13.43$\\pm$0.40 & 226.68$\\pm$10.77 & 1.76$\\pm$0.05 & 3.85 (5)\\\\\nA1650 & 79.57$\\pm$9.55 & 108.65$\\pm$15.34 & 1.62$\\pm$0.25 & 0.53 (4) \\\\\nA1795 & 28.68$\\pm$2.96 & 107.23$\\pm$17.25 & 2.03$\\pm$0.44 & 1.06 (11)\\\\\nA2142 & 47.82$\\pm$11.77 & 150.26$\\pm$14.08 & 1.17$\\pm$0.17 & 0.57 (6) \\\\\nA2204 & 7.83$\\pm$0.64 & 258.65$\\pm$15.81 & 1.98$\\pm$0.08 & 3.34 (4) \\\\\nA2244 & 50.42$\\pm$13.42 & 116.76$\\pm$15.93 & 0.96$\\pm$0.16 & 1.067 (4) \\\\\nA2597$^\\dag$ & 11.20$\\pm$0.75 & 100.73$\\pm$1.60 & 1.40$\\pm$0.04 & 1.17 (8)\\\\\nHydra-A & 11.47$\\pm$1.29 & 116.46$\\pm$2.26 & 1.25$\\pm$0.06 & 18.53 (6) \\\\\n A754 & 263.02$\\pm$23.95 & 60.29$\\pm$25.76 & 1.82$\\pm$0.41 & 1.07 (10)\\\\\nA2256 & 299.79$\\pm$21.04 & 17.75$\\pm$15.74 & 2.52$\\pm$1.02 & 8.36 (5) \\\\\nA3158 & 229.69$\\pm$16.93 & 21.16$\\pm$17.89 & 4.32$\\pm$1.95 & 1.69 (3) \\\\\nA3667 & 183.58$\\pm$16.17 & 61.11$\\pm$17.14 & 1.51$\\pm$0.28 & 3.71 (6)\\\\\nZWCL1215 & 305.73$\\pm$68.02 & 54.17$\\pm$32.68 & 1.90$\\pm$0.57 & 0.95 (5) \\\\\n\\hline\nPL sample & & & & \\\\\n\\hline\n  A85 & 3.39$\\pm$0.65 & 168.90$\\pm$2.23 & 1.00$\\pm$0.02 & 1.67 (8)\\\\\n A478 & 3.53$\\pm$0.84 & 124.82$\\pm$2.39 & 1.03$\\pm$0.03 & 1.71 (13) \\\\\nA2029 & -1.73$\\pm$0.57 & 177.16$\\pm$1.75 & 0.81$\\pm$0.01 & 4.32 (12)\\\\\nA3112 & 2.04$\\pm$0.42 & 135.14$\\pm$1.47 & 0.95$\\pm$0.01 & 12.74 (8)\\\\\n\\hline\n$^\\dag$Test cluster\n\\end{tabular}}\n\\end{table}\n\nThe entropy profiles of the cluster sample were fitted with the flat-core model (eq.~\\ref{eq:flat_core_model}), using the \nentropy covariance matrices and the jMCMC method, as described in section \\ref{S:cent_entr_prof}. \nThe resulting $K_0$, $K_{100}$, $\\alpha$ chains obtained for individual clusters plotted in the $K_0$-$\\alpha$ and \n$K_0$-$K_{100}$ planes along with their flat-core profile fits, are shown in Fig. \\ref{fig:flat_core_entr_fit_samp1}. \nAlmost all clusters of the sample show a positive correlation between $K_0$ and $\\alpha$, and an anti-correlation \nbetween $K_0$ and $K_{100}$. This (anti-)correlation is not sample correlation across clusters but only holds for \nindividual clusters. The similarity of this correlation trend across clusters signifies the robustness of our technique \nand data quality, indicating that the parameters of these clusters are well determined in comparison to those where\nthe confidence regions show large scatter. Even in latter cases the general trends in correlation are present.\n\nFor the non-cool-core clusters with large errors in their entropy profiles (viz., A754, A3667, A3158, ZWCL1215 and A2256), \nthe $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots are found to be highly irregular and do not show any particular trend. \nThe expectation values of $K_0$, $K_{100}$ and $\\alpha$ (with the associated variances) and the reduced chi-squared values \nobtained for the individual clusters are given in Table \\ref{tab:flat_core_results_smpl1}. For a small subsample of the clusters (power law or PL sample \ncomprising of A85, A2029, A478 and A3112; the remaining sample will be called flat-core or FC sample), \nthe flattening in the core was not that obvious. The results for the subsample are given in Fig. \n\\ref{fig:flat_core_entr_fit_samp2} and Table \\ref{tab:flat_core_results_smpl1}. PL sample also shows a positive \ncorrelation between $K_0$ and $\\alpha$, and an anti-correlation between $K_0$ and $K_{100}$. The cluster A2029 is found to show an inverted \nentropy core; i.e., the entropy profile seems to steepen instead of flattening near the centre. The mean value of $K_0$ for this cluster is found \nto be negative and, therefore, is unphysical.\n\nSince a flat-core profile (eq.~\\ref{eq:flat_core_model}) provides a better fit to entropy data of most of our clusters (F-test is shown in Table \\ref{tab:f_test_results}), \nwe have moved the discussion of single and double power law fits to Appendix \\ref{S:sgl_powlaw_fit} \\& \\ref{S:dbl_powlaw_fit}, respectively.\n\n\\setcounter{figure}{8}\n\\begin{figure*}\n \\centering  \n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\caption{The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the flat-core entropy model (eq.~\\ref{eq:flat_core_model}) fitting for PL sample. \n   The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards.\n   Greyscale denotes PDF density.}\n  \\label{fig:flat_core_entr_fit_samp2}\n\\end{figure*}\n\n  \n\\section{Discussion}\n\\label{S:discussion}\n\nAs mentioned in the introduction, entropy, cooling time and $t_{\\rm cool}/t_{\\rm ff}$ profiles carry useful information about the\nphysical processes in cluster cores. These profiles are sensitive to processes such as thermal conduction and \nmultiphase condensation. In this section we discuss the implications of our results.\n\n\\subsection{Comparison with previous works}\nThe canonical method of peeling off spherically symmetric shells to obtain deprojected spectra do not take care of covariance of parameters corresponding to different shells. Using jMCMC method for data analysis enables clear visualization of the model parameter space. The \nmethod, however, has not been much used for analysing X-ray data of clusters. A joint Bayesian analysis of the \\textit{Chandra} and \\textit{ROSAT} data of the galaxy group NGC4325 was carried out by \\cite{russ07} using the MCMC method. The analysis was performed using a \\textquoteleft{}forward fitting\\textquoteright{} approach in which the gas density and temperature were assumed to have known parametrised functional forms. While using parametrised models for density and temperature has several advantages, such as multiple datasets can be fitted together and the models can be extrapolated to large distances, its main disadvantage is that it introduces inherent biases in the results. \n\nWe note that \\textit{DSDEPROJ} (\\citealt{russ08}) may suffer from an intrinsic instability due to the following possibility: when the contribution from the outermost shell is subtracted from the next, any over/under estimate of photon counts---especially at high energies that best constrain the temperature---may cause an under/over estimate of photon counts deduced for the next shell. Since the correction appears with opposite signs in adjacent radial bins, albeit with diminishing volume factors, it may lead to an alternating over/under estimate of photon counts across the radial bins that may show up as oscillating inferred temperature, even if the gas is not multiphase. This effect may be more pronounced for clusters with poor quality data with large Poisson noise. This problem can be avoided if we do not treat the data in annuli separately, but jointly across all radial bins. \n\nOur proposed method is based on constructing a joint Bayesian posterior distribution for the free-form model parameters of a cluster. It naturally \nkeeps an account of the all the correlations inherent in fitting the parameters across different shells, since the shells contribute photons to all annuli in their interior. To explore this multi-parameter posterior distribution in a space of high dimensionality, we use the MCMC method, which produces parameter chains that are drawn from the posterior probability distribution. Using these chains we then construct the entropy profiles of clusters. To isolate the deep interior of a cluster, we marginalise over the parameters of the outermost shells. Since a single element of a chain gives us an entropy profile in a cluster, we account for its overall shape by accounting for the covariance of entropies measured in different radial shells of a cluster, which we then fit to different models (eqs. \\ref{eq:flat_core_model}-\\ref{eq:dbl_model}). \\citet{russ08} have argued that the oscillations mentioned above may also be caused by fitting a single-temperature model to a multiphase gas. It is straightforward to include multi-temperature plasma in our MCMC method, provided we have sufficiently high-quality data.\n\nIn a recent paper \\cite{san14} have described a new MCMC based code MBPROJ that is in spirit very similar to our method. \nUnlike our method, which works only for those clusters that have high quality data since we use multiple spectral bins to fit the spectrum, by choosing only three spectral bins, MBPROJ can work even for clusters that have only a few thousand counts. \nIt does that by making the assumption that the gas is in hydrostatic equilibrium; however, this assumption can be relaxed in the code to make it similar to \nour approach. To the best of our knowledge MBPROJ has not been used to analyse the entropy profiles of clusters as we have done in this work.  \n\n\\subsection{Entropy core versus cusp}\n\nAs discussed in section~\\ref{S:method_comp}, our method agrees with the method adopted in P14 for simulated and the test cluster. Although our method \ndoes not agree with C09, the differences are well explained by the fact that not deprojecting temperature leads to an increase in temperature \ninferred at the centre of clusters. Therefore, the method adopted in C09 is inherently biased to measure higher entropies at the cores of cluster, \nwhile P14 seems to be unbiased. However, the method of P14 does not account for the propagation of errors as the layers of a cluster are peeled \noff. \n\nGiven that the results from our analysis for the test cluster and simulated spectra agree with P14's method, it is surprising that, in complete \ncontrast, we find that most of the clusters analysed by us are actually \nbetter described by a cored power law model. Although, this is in overall agreement with  C09, our tests show that our core entropy values \nare smaller than theirs for the coolest clusters (see top-left panel of Fig. \\ref{fig:comp_voit}).\nNote that all the non-cool core clusters (shown in red; defined here as clusters with $K_0> 100$ keV cm$^2$) are consistent with flat cores. \nAs expected, their central entropies are also higher. The blue curves corresponding to cool cores, however, \nwhile mostly displaying flat cores, do have a sub-sample of about  four clusters that are somewhat consistent with a single power law without any \ncore (Fig. \\ref{fig:flat_core_entr_fit_samp2}). \nHowever, their core entropy is so small ($K_0 \\simeq 1$ keV cm$^2$) that they could be well described as overall single power laws. \nTherefore, the question of core versus cusp depends somewhat on the scales that we are interested in.\n\n\\setcounter{figure}{9}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/entropy_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/entropy_flat_core_profiles.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/K0_vs_alpha_combined_mod.ps}\n  \\caption{Entropy profiles of the full cluster sample obtained from the jMCMC fits (left) and the their flat-core \n  profile fits (centre). The best-fit K$_{0}$ vs. $\\alpha$ values obtained from flat-core fits \n  is shown in the right panel. Cool-core ($K_0 > 100$ keV cm$^2$) and non-cool-core ($K_0<100$ keV cm$^2$) \n  clusters are shown using blue and red colors, respectively.}\n  \\label{fig:flat_core_prof_full_sampl}\n\\end{figure*}\n\nAnother discrepancy between P14 and C09 is the presence or absence of bimodality in the central values of entropy in clusters (see also \\citealt{pra10}). \nAlthough our sample \nof clusters is small, the second panel of Fig.~\\ref{fig:flat_core_prof_full_sampl} shows an apparent gap between the red and blue curves close to \nthe centre of the clusters. This is indicated more clearly (with error bars) in the third panel. Most of the blue points are clustered at small \n$K_0$, with smaller values of $\\alpha$ (this is in contrast to \\citealt{san09} who find a steeper entropy in cool cores). \nThen we see an apparent gap at about $K_0 \\simeq 100 \\, {\\rm keV cm^2}$. The statistical significance of \nthis gap is marginal due to small number of clusters in our sample, but seems to be in general agreement with the results of P14.\nMuch  further work is required to explore the issue of bimodality, and in the future we shall add more clusters  to our sample to \nadequately address it. \n\nWhile our results are broadly consistent with C09, our method is a significant improvement in terms of how we handle statistics. We are unable to fully\nexplain our lack of agreement with P14, even though our tests show that our results match well on simulated data and a sample cluster, despite the \ndifference in the two approaches. Most clusters in our sample have cores and not cusps; especially, the non-cool clusters display only cores. A \nfew cool-core clusters are probably flat cored too, but with very small core radius, so our fits are only marginally able to capture the core. \n\n\n\\setcounter{figure}{10}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_sgl_pow_law_fit_using_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_sgl_pow_law_fit_using_mcmc_with_large_radial_bin.ps}\n   \\caption{Entropy profiles of the cluster A478 with small (left) and large (right) central radial bins, fitted with single \n   power law models (dotted lines). An excess \n   entropy (flattening) is seen in the innnermost  annulus when a smaller radial bin size is used.}\n  \\label{fig:large_radial_bin_effect}\n\\end{figure*}\n\nP14's results are in complete disagreement with C09, and the former have argued that the difference is mainly \ndue to the use of projected temperature profiles, large central radial bins (which might smooth out central gradients \nleading to flattening of entropy profiles) and assumption of single phase gas in the central regions by the latter. \nThe first issue has been addressed in the present work as we have used deprojected temperature profiles in our analysis. In contrast to \nP14, in our analysis  \nwe found that using larger central radial bins for some of our clusters actually favours power law instead of flat-core \nprofiles; an example of this is shown in Fig. \\ref{fig:large_radial_bin_effect}.\n\nThere are some difference between our and P14's approach when it comes to fitting entropy profiles in the core. We, like C09, fit the parametric \nforms (power law, double power law, flat core) for {\\it individual} clusters but P14 use a {\\it common power law for all the clusters and groups in \ntheir sample} (see their Figs. 2 \\& 3). From the left panel of Fig.~\\ref{fig:flat_core_prof_full_sampl} we can see that a single power law indeed provides \na good {\\it common} fit for all the lowest entropy profiles. However, as we show in detail, individual cluster entropy profiles almost always flatten toward \nthe center. Another, and potentially more significant, difference is that our sample has clusters with temperature greater than 3 keV (see Table 1 in \n\\citealt{san10}) but P14's sample has several groups with temperature $\\leq 1.2$ keV (see their Fig. 3). Their groups sample shows a good agreement\nwith a single power law in the core compared to the full sample shown in their Fig. 2. The lowest entropy clusters (which are well fit by \na power law) in P14 may be dominated by small scale coronae associated with the massive central galaxy (e.g., see \\citealt{sun09}; see also Fig. 2 in \\citealt{sha12b}) rather than \nthe typical large cool cores.\n\n\\subsection{Cooling time \\& free-fall time}\n\n\\setcounter{figure}{11}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/pressure_mcmc_fitted_profiles.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/tcool_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/tcool_by_tff_mcmc.ps}\n  \\caption{Left: The pressure profiles of the full cluster sample obtained from the jMCMC analysis (triangles) with the best-fit models (eq. \\ref{eq:pfit}) \n  shown using lines. \n  Different colors are used for different clusters. Middle and Right: The $t_{\\rm cool}$ and $t_{\\rm cool}/t_{\\rm ff}$ profiles of the full cluster sample. Again, \n  cool-core and non-cool-core clusters are shown using blue and red colors.}\n  \\label{fig:press_prof_full_sampl}\n\\end{figure*}\n\nThe cooling time and the gravitational free-fall time are important parameters that govern the properties of cluster cores (e.g., \\citealt{mcc12,sha12a}).\nIn fact, \\citet{mit09} argue that the central cooling times better characterize the properties of cluster cores. We therefore obtain the cooling time and \n$t_{\\rm cool}/t_{\\rm ff}$ profiles from our best-fit  shell density and temperature values. While the cooling time is just a function of density, temperature and \nelemental abundance (the quantities obtained from X-ray observations) and is easy to obtain (middle panel of Fig. \\ref{fig:press_prof_full_sampl}), the free-fall time requires \nthe knowledge of gravitational acceleration profile. One way to\nobtain gravitational acceleration is by assuming hydrostatic equilibrium (e.g., see \\citealt{ras06}). While this is a good assumption for relaxed, cool-core \nclusters, non-cool clusters are generally mergers in which this assumption fails.\n\nWe obtain pressure profiles by combining density and temperature data. Since these pressure values are not always decreasing with radius \n(which is impossible for hydrostatic equilibrium), we fit an empirical form to obtain smooth pressure profiles\n\n", "itemtype": "equation", "pos": 26504, "prevtext": "\nUsing this and eq.~\\ref{eq:pdf}, a Bayesian posterior PDF for the fit parameters (e.g., $K_0$, $K_{100}$ and $\\alpha$ for the flat core profile) is obtained \nthrough a second MCMC analysis. Using the full covariance \nmatrix takes into account the radial variation of entropy in individual chains, something that is not captured by using only the marginalised errors on the individual \nshell entropies.\n\n\\subsection{Benchmarking the jMCMC method}\n\\label{S:sim_data_and_test_cluster}\n\nWe tested our jMCMC analysis on simulated as well as actual data. Simulated projected spectra were generated using XSPEC. We also used the \\textit{Chandra} \nobservations of the cool-core cluster A2597 to further test the usefulness of our method for actual data. The procedure used for generating the simulated data, \nand the Chandra observations of A2597 are described in the following sections.\n\n\\subsubsection{Simulated Spectra}\n\\label{S:sim_spectra}\n\n\\setcounter{figure}{0}\n\\begin{figure}\n\\begin{center}\n\\includegraphics[width=0.99\\linewidth]{figures/temp_density_100ks_chandra_response_mcmc.ps}\n\\caption{Density (triangles) and temperature (diamonds) profiles obtained from the jMCMC analysis of the 100 ks simulated cluster spectra described in \nsection \\ref{S:sim_spectra}. For comparison the input density and temperature profiles used for generating the simulated spectra are also shown.}\n\\label{fig:100ks_n_T_profs}\n\\end{center}\n\\end{figure}\n\nSimulated spectra for spherically symmetric shells of a cluster were generated using the \\textit{apec} model and the \n\\textit{fakeit} command in XSPEC. Profiles of intracluster gas density and temperature  (shown with lines in Fig. \\ref{fig:100ks_n_T_profs}) \nwere generated assuming an NFW dark-matter potential (with concentration parameter $c_{200}=3.3$, $M_{200}=5.24 \\times 10^{14} M_\\odot$; \\citealt{nav96}) \nand a flat-core entropy profile (eq. \\ref{eq:flat_core_model}; \n$K_0=37.9$ keV cm$^2$; $K_{100}=117.9$ keV cm$^2$ and $\\alpha=1.11$). These density and temperature profiles \nwere then used as inputs for simulating spectra from spherical shells, assuming a constant value of density and temperature  in each shell. \nThe elemental abundance was frozen to a constant value of one-third solar for all the shells, and a redshift (z) value of 0.05 was assumed for the cluster. \nThe instrumental response files (Redistribution Matrix Files and Ancillary Response Files) required by the \\textit{fakeit} command were \nproduced using the CIAO task \\textit{specextract} \nfor an actual \\textit{Chandra} observation with \\textit{weight$=$no}. \nSpectra were simulated for an exposure time of 100 ks. \nThe gas number density, $n(R)$, was used for obtaining the normalization of the APEC model ($\\eta$), and the two are related through\n\n", "index": 33, "text": "\\begin{equation}\n \\eta = \\frac{10^{-14} \\int{n_e n_p dV} }{4 \\pi {D_{A}}^{2} (1+{\\rm z})^2},\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E17.m1\" class=\"ltx_Math\" alttext=\"\\eta=\\frac{10^{-14}\\int{n_{e}n_{p}dV}}{4\\pi{D_{A}}^{2}(1+{\\rm z})^{2}},\" display=\"block\"><mrow><mrow><mi>η</mi><mo>=</mo><mfrac><mrow><msup><mn>10</mn><mrow><mo>-</mo><mn>14</mn></mrow></msup><mo>⁢</mo><mrow><mo largeop=\"true\" symmetric=\"true\">∫</mo><mrow><msub><mi>n</mi><mi>e</mi></msub><mo>⁢</mo><msub><mi>n</mi><mi>p</mi></msub><mo>⁢</mo><mrow><mo>𝑑</mo><mi>V</mi></mrow></mrow></mrow></mrow><mrow><mn>4</mn><mo>⁢</mo><mi>π</mi><mo>⁢</mo><mmultiscripts><mi>D</mi><mi>A</mi><none/><none/><mn>2</mn></mmultiscripts><mo>⁢</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mn>1</mn><mo>+</mo><mi mathvariant=\"normal\">z</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mn>2</mn></msup></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhich is simpler compared to the `universal' pressure profile suggested by \\citet{arn10}. The left panel of Fig. \\ref{fig:press_prof_full_sampl} shows the pressure data and the best-fit\npressure profiles for our cluster sample. Pressure (both data points and fits) decreases toward the centre for some non-cool clusters because of bulk flows \nand large turbulent velocities. Gravitational acceleration is obtained from differentiating pressure fits as \n\n", "itemtype": "equation", "pos": 68868, "prevtext": "\nwhere $D_A$ is the angular diameter distance, $n_e$ and $n_p$ are the electron and proton number densities, and for one-third solar abundance \n$n_e=0.53n$ and $n_p=n_e/1.2$. Assuming a \nconstant gas density in each shell, the integral in the above equation reduces to ${n_e}^2 V/1.2$; where $V$ is the volume of the shell.\n\n As the observed emission from an astronomical object is always seen in  projection along the line of sight, we produced projected spectra for all the \nannuli. For the $i^{\\rm th}$ shell the projected spectrum was obtained by combining the simulated spectra from all the outer $k \\geq i$ shells,  \nweighted according to their projected volumes intercepted by the $i^{\\rm th}$ shell (eq. \\ref{eq:vol}). The projected spectra \nwere combined in radial bins in order to contain \na minimum of 10000 counts in each shell. For each spectrum, channels were combined together in spectral bins so that each bin contains a minimum of \n25 counts, so that the assumption of a $\\chi^2$-distribution with Gaussian errors is valid.\n\n\\subsubsection{Test Cluster}\n\\label{S:test_cluster}\n\n\\begin{table}\n \\caption{Cluster sample.}\n\\label{tab:clus_samp}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{l l l l l}\n\\hline\nCluster & z&$\\alpha$(J2000), $\\delta$(J2000)&Obsn.&Exp.\\\\\nName&&&ID&Time (ks)\\\\\n\\hline\n\\hline\n  A85&0.0557&00 41 37.8, -09 20 33&15173&43.08\\\\\n A133&0.0603&01 02 39.0, -21 57 15&2203&35.91\\\\\n A478&0.0881&04 13 20.7, +10 28 35&1669&42.94\\\\\nA1650&0.0823&12 58 36.76, -01 43 34.2&5823&40.13\\\\\nA1795&0.0625&13 49 00.5, +26 35 07 &493&19.88\\\\\nA2029&0.0775&15 10 58.7, +05 45 42&4977&78.91\\\\\nA2142&0.0899&15 58 20.00, +27 14 00.3&15186&91.07\\\\\nA2204& 0.151&16 32 45.7, +05 34 43&7940&78.16\\\\\nA2244&0.0996&17 02 34.01, +34 04 41.1&4179&57.72\\\\\nA2597$^\\dag$&0.0824&23 25 19.70, -12 07 27.7&7329&60.90\\\\\nA3112&0.0759&03 17 52.4, -44 14 35&13135&42.80\\\\\nHydra-A&0.0549&09 18 05.65, -12 05 44&576&19.52\\\\\n A754&0.0535&09 08 50.1, -09 38 12&577&44.77\\\\\nA2256&0.0581&17 03 43.5, +78 43 03&16129&44.49\\\\ \nA3158&0.0583&03 42 39.6, -53 37 50&3712&31.35\\\\\nA3667&0.0552&20 12 33.68, -56 50 26.3&5751&130.60\\\\\nZWCL1215&0.0767&12 17 40.6, +03 39 45&4184&12.22\\\\\n\\hline\n$^\\dag$ Test cluster\n\\end{tabular}}\n\\end{table}  \n\nWe tested our jMCMC method for actual X-ray data using \\textit{Chandra} observations of the test cluster A2597. \nA log of the \\textit{Chandra} Observation of A2597 is given in Table \\ref{tab:clus_samp}. The \ndata for this observation were obtained from the High Energy Astrophysics Science Archive Research centre (HEASARC). The CIAO version 4.7 and CALDB \nversion 4.6.7 were used for analyzing the data. The data were reprocessed using the standard \\textit{chandra\\_repro} tool to produce the level 2 \nreduced event files (evt2) from the level 1 event files (evt1). Background event files matching with the source observation were produced using \nMaxim Markevitch's blank-sky background database\\footnote{see, http://cxc.cfa.harvard.edu/contrib/maxim/acisbg}. The source observation was cleaned \nof any flare contamination using the \\textit{lc\\_clean} script so as to match the \nblanksky background maps. Point sources were removed based on a visual inspection of the images. \nSpectra and corresponding response files were \ngenerated for a number of circular annuli centred on the cluster's X-ray peak using the CIAO task \\textit{specextract}. The width of the annuli \nwas chosen such that each annulus had at least 10000 counts in the 0.7-7.0 keV energy range\\footnote{For some of the clusters \nthis condition was slightly relaxed in order to have at least one annulus within $R\\leq$10 kpc while for some of the bright clusters the \ncondition was more constrained and the minimum counts were increased in order to have not more than 25 annuli in the cluster.}. \nThe spectral channels were combined in bins to have \nminimum 25 counts in each bin.\\\\\n\n\n  To check  the robustness of our method we performed various tests on the test cluster A2597. For most of our analyses the elemental \nabundance, $Z$, in all the annuli spectra was assumed to be equal to the average elemental abundance of the cluster obtained from the analysis of the cluster's full spectrum in XSPEC. To check for the effect of a variable $Z$, we added $Z_i$ as an additional parameter for the $i^{\\rm th}$ shell along with $n_i$ and $T_i$. To keep the size of model spectra (${\\bf M}_{iJ}$) manageable we reduced the number of $n$ and $T$ grid points to half for this test (i.e., from 500 and 150 to 250 and 75; see section \\ref{S:MCMC}). The $Z$ parameter was added as a third-axis to this box with 5 linearly distributed values between 0.2 to 1.0 times the solar elemental abundance value. \n\nHaving too many annuli in our analysis makes it computationally slow, and can lead to large errors in the parameters. On the other hand, having few annuli can \nlead to the inner regions of the cluster not being resolved properly. Therefore, we tested for the effect \nof varying the number of annuli used for the analysis. Minimum $\\sim$17000 counts in each annulus led to 13 annuli in A2597. The minimum counts were increased to $\\sim$30000 and decreased to $\\sim$12000 to have a total of 6 and 18 annuli, respectively. \nWe carried out the jMCMC analysis of A2597 with 6, 13 and 18 annuli. We also investigated the effect of changing the length of MCMC chains. The results from all these tests \nare discussed in section \\ref{S:test_clus_res}.\\\\\n\n\n\\subsection{Results for simulated spectra and A2597}\n\\label{S:results}\njMCMC analysis was carried out for the simulated and actual data as described in sections \\ref{S:mcmc_method}  \\& \\ref{S:sim_data_and_test_cluster}. \n\\label{S:sim_spec_res}\nFig.~\\ref{fig:100ks_n_T_profs} shows the density and temperature \nprofiles obtained from the jMCMC analysis of the 100 ks simulated spectra. For comparison the actual input profiles are also shown. \nThe jMCMC profiles are found to be consistent with the input profiles, and are unbiased.\n\n\\subsubsection{A2597}\n\\label{S:test_clus_res}\nWe performed various tests on A2597 to optimize the jMCMC algorithm. Based on the results of these tests we made certain choices that apply to the \nrest of the cluster sample presented later.\n\n\\begin{itemize}\n\n\\setcounter{figure}{1}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_density_Z_variation.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_temp_Z_variation.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_entropy_Z_variation.ps}\n\\caption{Electron density, temperature and entropy profiles obtained from the jMCMC analysis of the Chandra observations of the \ntest cluster A2597. Profiles obtained with fixed and variable elemental abundance are shown using black and red colors, \nrespectively.}\n\\label{fig:test_clus_13shell_res}\n\\end{figure*}\n\n\\item {{\\it Fixed vs. variable elemental abundance}:} \nThe electron number density, temperature and entropy profiles obtained from the jMCMC analysis of the test cluster A2597 are shown in \nFig.~\\ref{fig:test_clus_13shell_res}. The profiles obtained with a variable elemental abundance are also shown. The Fig. shows \nthat a free elemental abundance does not affect the density and entropy profiles significantly. \nAs we are mostly interested in the entropy profiles of the clusters, \nwe have {\\it fixed the elemental abundance} for the analysis of the remaining clusters at their respective average values obtained \nfrom spectrum integrated over all shells. This is essentially done for computational reasons.\n\n\\setcounter{figure}{2}\n\\begin{figure}\n \\includegraphics[width=0.98\\linewidth]{figures/A2597_entropy_shell_number_comparison.ps}\n\\caption{Entropy profiles obtained from the jMCMC analysis of the \ntest cluster using 6 (blue), 13 (black) and 18 (red) annuli. The flat-core model fits are also shown using dashed lines.}\n\\label{fig:test_clus_different_annuli_res}\n\\end{figure}\n\n\\item {{\\it The number of annuli}:} The test cluster was analysed with different number of annuli and the resulting entropy profiles \nare shown in Fig. \\ref{fig:test_clus_different_annuli_res}. It can be seen that varying the number of annuli does not change the \ngeneral shape of the entropy profile, especially at resolved radii. However, note that with just 6 annuli one can not constrain the \nprofile shape very well. For example, the flattening of the entropy profile towards the centre seen with 13 and 18 annuli, does not seem \nto be very prominent in the profile with just 6 annuli. On the other hand, having 18 annuli leads to large errors in the inner entropy values \nand therefore can lead to a poor fit. In general, for the rest of the sample, we try to optimise in terms of best resolution of the cluster core profiles.\n\n\\setcounter{figure}{3}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_temp_variable_chain_length.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_density_variable_chain_length.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/A2597_entropy_variable_chain_length.ps}\n\\caption{Temperature, electron density and entropy profiles obtained from the jMCMC analysis of the test \ncluster using 2000 (black), 5000 (blue), 10000 (red) and 20000 (green) steps along each \nparameter direction in the MCMC random walk.}\n\\label{fig:test_clus_different_cl_res}\n\\end{figure*}\n\n\\item {{\\it Number of steps}:} We tried different numbers of steps (2000, 5000, 10000 and 20000) in the MCMC random walk along {\\it each} parameter direction \nfor the test cluster, and the temperature, electron density and entropy profiles obtained are shown in Fig. \\ref{fig:test_clus_different_cl_res}. The profiles \nare found to be mostly consistent with each other. However, it can be seen that using 2000 steps gives slightly larger error bars, especially in the \ntemperature profile, and the mean values also seem to be slightly shifted from the rest of the profiles. Profiles for larger number of steps are found to be almost \nidentical. Although for the test cluster 5000 steps seems to be an optimum value at which the results seem to be converging, considering that \nmany of our clusters have poor count statistics, we chose 100000 steps as a safe value for our analysis.\n\n\\end{itemize}\n\n\n\\subsection{Comparison with other methods} \n\\label{S:method_comp}\n\n\\setcounter{figure}{4}\n\\begin{figure*}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_temp_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_density_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.33\\linewidth]{figures/100ks_chandra_response_entropy_mcmc_vs_Cavagnolo_vs_Panagoulia_loglog.ps} \n\\caption{Temperature, electron number density and entropy profiles obtained using different analysis methods \nfor the 100 ks simulated spectra. Results from jMCMC, C09's and P14's methods are shown \nusing black, red and blue colors. The input electron density, temperature and entropy profiles used for generating \nthe simulated spectra are also shown using black solid lines. The dashed black, red and blue lines in the third panel \nshow the flat-core model (eq.~\\ref{eq:flat_core_model}) fits to the jMCMC, C09 and P14 entropy profiles, respectively.}\n\\label{fig:100ks_sim_different_method}\n\\end{figure*}\n\nThere are two recent analyses of radial entropy profiles which differ from each other: \\cite{cav09} (henceforth, C09) and \\cite{pan14} \n(henceforth, P14). In \\cite{cav09} temperature profiles are directly obtained from the analysis of the 0.7-7.0 keV {\\it projected} spectra. \nHigh resolution surface-brightness profiles and spectra in the 0.7-2.0 keV range were then used for obtaining high-resolution profiles of \ndeprojected electron densities. The projected temperature profiles are interpolated to match the resolution of the density \nprofiles. The density and temperature profiles are then combined to obtain the entropy profiles. The main advantage of C09's approach is that \nit gives an excellent resolution in the cluster core. The problem with their analysis is that the use of projected spectra leads to an \noverestimation of the temperature (and hence, entropy) in the central region. An earlier paper, \\citet{don06},\ncompared the entropy profiles using projected and deprojected temperatures and found them to be similar (this is not quite correct; see left panels of Figs. \\ref{fig:100ks_sim_different_method} \\& \\ref{fig:test_clus_different_method}).\n\\cite{pan14} deproject the spectra using the \\textit{DSDEPROJ} routine described in \\cite{russ08}. Profiles of \nelectron density and temperature were obtained from the spectral analysis of the deprojected spectra, and were combined to obtain the entropy profiles. \n\n\\setcounter{figure}{5}\n\\begin{figure*}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_temp_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_density_mcmc_vs_Cavagnolo_vs_Panagoulia.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A2597_entropy_mcmc_vs_Cavagnolo_vs_Panagoulia_loglog.ps}\n\\caption{Temperature, electron number density and entropy profiles obtained using different analysis methods \nfor the test cluster. Results from jMCMC analysis, C09's method and P14's method are shown \nusing black, red and blue colors. The dashed black, red and blue lines in the third panel show the flat-core \nmodel (eq.~\\ref{eq:flat_core_model}) fits to the jMCMC, C09 and P14 entropy profiles, respectively.}\n\\label{fig:test_clus_different_method}\n\\end{figure*}\n\n\nThe temperature, electron density and entropy profiles obtained using \njMCMC, C09's and P14's analysis methods for the simulated spectra and the test cluster \nare shown in Figs. \\ref{fig:100ks_sim_different_method} and \\ref{fig:test_clus_different_method}, respectively. \nC09's method is found to overestimate the temperature in the inner annuli which is expected since the method makes \nuse of projected spectra and hence inner annuli are affected by the hotter shells lying outside. \nSimilarly the temperature at larger radii is underestimated. Results from jMCMC analysis \nand P14's method are found to be in good agreement with each other. For the test cluster, both these methods \nseem to overestimate the density in the outermost annulus. However, this is a common artifact of deprojection analyses \ndue to the excess emission from shells outside the outermost annulus contributing to its emission.\\\\\n\n\\subsection{Entropy profile  with/without correlations}\n\\label{S:entr_fit_witho_correl}\n\n\\setcounter{figure}{6}\n\\begin{figure*}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_alpha.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_k100.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_entropy_flat_core_fit_using_mcmc.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_alpha_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_K0_vs_k100_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/test_cluster_entropy_flat_core_fit_using_mcmc_without_correlation.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_alpha_with_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_k100_with_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_entropy_flat_core_fit_using_mcmc_with_correlation.ps}\\\\\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_alpha_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_K0_vs_k100_without_correlation.ps}\n \\includegraphics[width=0.32\\linewidth]{figures/A3112_entropy_flat_core_fit_using_mcmc_without_correlation.ps}\\\\ \n\\caption{Entropy profile fitting, with (first row) and without (second row) correlation between the shell entropies ($T_{\\rm keV}/n_e^{2/3}$) \nfor the test cluster. Entropy profile of A3112 with and without correlation are also given in the third and fourth rows, respectively. \nThe contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards. \nGreyscale denotes the PDF density.}\n\\label{fig:entr_fit_witho_correl}\n\\end{figure*}\n\nOne of the main drawbacks of the standard deprojection methods is that they do not take into account the correlations between the \ndeprojected parameters obtained for the different shells. To demonstrate this effect we fitted the entropy profile of the test cluster \nobtained from the jMCMC analysis using a flat-core model (eq. \\ref{eq:flat_core_model}), \nas described in section \\ref{S:cent_entr_prof}. The expectation values of entropy for each shell $\\bar{K_i}$ and the entropy covariance \nmatrix ${\\rm cov}(K_i, K_j)$ were calculated, which were then used in another MCMC analysis to obtain chains of $K_0$, $K_{100}$ and $\\alpha$. \nTo see the effect of no correlation between the entropies of different shells, we also \ncarried out the same exercise with the non-diagonal terms of the entropy covariance matrix set to zero. \n\nThe $K_0$-$\\alpha$ \nand $K_0$-$K_{100}$ scatter plots and the resulting flat-core fits obtained from the two methods (with and without cross-covariance) \nare shown in the first two rows \nof Fig. \\ref{fig:entr_fit_witho_correl}. The expectation values of $K_0$, $K_{100}$ and $\\alpha$ obtained using the full entropy \ncovariance matrix are 11.31$\\pm$0.78 keV cm$^2$, 101.47$\\pm$1.51 keV cm$^2$ and 1.37$\\pm$0.04, respectively, and those \nobtained using only the diagonal terms are 11.84$\\pm$0.86 keV cm$^2$, 99.71$\\pm$2.68 keV cm$^2$ and 1.42$\\pm$0.06, respectively. \nIgnoring correlation between the entropies of different shells in the test cluster, therefore, does not seem to have any \nsignificant effect on the fitted parameters. The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the two methods, \nhowever, do show some difference. For clusters with large covariances between the shell entropies, the effect of including \ncorrelations can be significant, as is seen for the cluster A3112, taken from the cluster sample analysed in this paper. \nThe $K_0$, $K_{100}$ and $\\alpha$ values obtained for A3112, with and without considering correlation between shell entropies, \nare 2.04$\\pm$0.42 keV cm$^2$, 135.14$\\pm$1.47 keV cm$^2$ and 0.95$\\pm$0.01, and \n2.35$\\pm$0.46 keV cm$^2$, 129.17$\\pm$2.18 keV cm$^2$ and 0.94$\\pm$0.02, respectively. \nThe value of $K_{100}$ for A3112, obtained from the two methods are, therefore, found to be significantly different. \nThe $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots for A3112 and the resulting flat-core fits obtained from the two methods (with \nand without cross-covariance) are shown in the last two rows of Fig. \\ref{fig:entr_fit_witho_correl}.\n\n\n\n\\section{Sample Selection \\& Results}\n\n\\label{S:samp_res}\n\n  We carried out the jMCMC analysis on the \\textit{Chandra} X-ray observations of a sample of clusters selected \n  from the statistically complete low-redshift sample of \\cite{san10}. Our sample includes 17 clusters and spans \n  a redshift range of 0.0535 to 0.151. The sample and the details of the observations used, are \n  given in Table \\ref{tab:clus_samp}. Results from some of the clusters from the low-z sample of \\cite{san10} are not \n  shown in this paper mostly due to poor count statistics in their X-ray observations leading to too few annuli in the \n  entropy profiles.\n\nThe cluster sample was analysed using the jMCMC method. The ${\\bf n_e}, {\\bf T}$ chains resulting from the jMCMC analysis were combined \nto produce subsidiary entropy chains using ${\\bf K} = {\\bf T}{\\bf n_e}^{-2/3}$. For each cluster, the elemental abundance in each annulus \nwas fixed at the average value obtained from the analysis of the full cluster spectrum. The resulting entropy profiles were then fitted \nusing flat-core and power law models, as described below. \n\n\\subsection{Flat-Core model}\n\\label{S:flat_core_fit}\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_entropy_flat_core_fit_using_mcmc.ps}\\\\   \n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n   \\caption{The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the flat-core entropy model (eq.~\\ref{eq:flat_core_model}) fitting for \n   FC (flat-core) sample. \n   The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards.\n   Greyscale denotes the PDF density.}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_entropy_flat_core_fit_using_mcmc.ps}\\\\ \n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_entropy_flat_core_fit_using_mcmc.ps}\\\\   \n  \\caption{(Contd.)}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\n\\setcounter{figure}{7}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\caption{(Contd.)}\n  \\label{fig:flat_core_entr_fit_samp1}\n\\end{figure*}\n\n\\begin{table}\n \\caption{Flat-core entropy model (eq. \\ref{eq:flat_core_model}) for FC (flat-core) and PL (power law) samples. \n Here, DOF = number of annuli $-$ number of fit parameters (3 for a flat-core fit).\n}\n\\label{tab:flat_core_results_smpl1}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{c c c c c}\n\\hline\nCluster Name & $K_{0}$ & $K_{100}$ & $\\alpha$ & $\\chi^{2}_{\\rm red}$ (DOF)\\\\\n & (keV cm$^{2}$) & (keV cm$^{2}$) & & \\\\\n\\hline\n\\hline\n FC sample & & & & \\\\\n\\hline\n A133 & 13.43$\\pm$0.40 & 226.68$\\pm$10.77 & 1.76$\\pm$0.05 & 3.85 (5)\\\\\nA1650 & 79.57$\\pm$9.55 & 108.65$\\pm$15.34 & 1.62$\\pm$0.25 & 0.53 (4) \\\\\nA1795 & 28.68$\\pm$2.96 & 107.23$\\pm$17.25 & 2.03$\\pm$0.44 & 1.06 (11)\\\\\nA2142 & 47.82$\\pm$11.77 & 150.26$\\pm$14.08 & 1.17$\\pm$0.17 & 0.57 (6) \\\\\nA2204 & 7.83$\\pm$0.64 & 258.65$\\pm$15.81 & 1.98$\\pm$0.08 & 3.34 (4) \\\\\nA2244 & 50.42$\\pm$13.42 & 116.76$\\pm$15.93 & 0.96$\\pm$0.16 & 1.067 (4) \\\\\nA2597$^\\dag$ & 11.20$\\pm$0.75 & 100.73$\\pm$1.60 & 1.40$\\pm$0.04 & 1.17 (8)\\\\\nHydra-A & 11.47$\\pm$1.29 & 116.46$\\pm$2.26 & 1.25$\\pm$0.06 & 18.53 (6) \\\\\n A754 & 263.02$\\pm$23.95 & 60.29$\\pm$25.76 & 1.82$\\pm$0.41 & 1.07 (10)\\\\\nA2256 & 299.79$\\pm$21.04 & 17.75$\\pm$15.74 & 2.52$\\pm$1.02 & 8.36 (5) \\\\\nA3158 & 229.69$\\pm$16.93 & 21.16$\\pm$17.89 & 4.32$\\pm$1.95 & 1.69 (3) \\\\\nA3667 & 183.58$\\pm$16.17 & 61.11$\\pm$17.14 & 1.51$\\pm$0.28 & 3.71 (6)\\\\\nZWCL1215 & 305.73$\\pm$68.02 & 54.17$\\pm$32.68 & 1.90$\\pm$0.57 & 0.95 (5) \\\\\n\\hline\nPL sample & & & & \\\\\n\\hline\n  A85 & 3.39$\\pm$0.65 & 168.90$\\pm$2.23 & 1.00$\\pm$0.02 & 1.67 (8)\\\\\n A478 & 3.53$\\pm$0.84 & 124.82$\\pm$2.39 & 1.03$\\pm$0.03 & 1.71 (13) \\\\\nA2029 & -1.73$\\pm$0.57 & 177.16$\\pm$1.75 & 0.81$\\pm$0.01 & 4.32 (12)\\\\\nA3112 & 2.04$\\pm$0.42 & 135.14$\\pm$1.47 & 0.95$\\pm$0.01 & 12.74 (8)\\\\\n\\hline\n$^\\dag$Test cluster\n\\end{tabular}}\n\\end{table}\n\nThe entropy profiles of the cluster sample were fitted with the flat-core model (eq.~\\ref{eq:flat_core_model}), using the \nentropy covariance matrices and the jMCMC method, as described in section \\ref{S:cent_entr_prof}. \nThe resulting $K_0$, $K_{100}$, $\\alpha$ chains obtained for individual clusters plotted in the $K_0$-$\\alpha$ and \n$K_0$-$K_{100}$ planes along with their flat-core profile fits, are shown in Fig. \\ref{fig:flat_core_entr_fit_samp1}. \nAlmost all clusters of the sample show a positive correlation between $K_0$ and $\\alpha$, and an anti-correlation \nbetween $K_0$ and $K_{100}$. This (anti-)correlation is not sample correlation across clusters but only holds for \nindividual clusters. The similarity of this correlation trend across clusters signifies the robustness of our technique \nand data quality, indicating that the parameters of these clusters are well determined in comparison to those where\nthe confidence regions show large scatter. Even in latter cases the general trends in correlation are present.\n\nFor the non-cool-core clusters with large errors in their entropy profiles (viz., A754, A3667, A3158, ZWCL1215 and A2256), \nthe $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots are found to be highly irregular and do not show any particular trend. \nThe expectation values of $K_0$, $K_{100}$ and $\\alpha$ (with the associated variances) and the reduced chi-squared values \nobtained for the individual clusters are given in Table \\ref{tab:flat_core_results_smpl1}. For a small subsample of the clusters (power law or PL sample \ncomprising of A85, A2029, A478 and A3112; the remaining sample will be called flat-core or FC sample), \nthe flattening in the core was not that obvious. The results for the subsample are given in Fig. \n\\ref{fig:flat_core_entr_fit_samp2} and Table \\ref{tab:flat_core_results_smpl1}. PL sample also shows a positive \ncorrelation between $K_0$ and $\\alpha$, and an anti-correlation between $K_0$ and $K_{100}$. The cluster A2029 is found to show an inverted \nentropy core; i.e., the entropy profile seems to steepen instead of flattening near the centre. The mean value of $K_0$ for this cluster is found \nto be negative and, therefore, is unphysical.\n\nSince a flat-core profile (eq.~\\ref{eq:flat_core_model}) provides a better fit to entropy data of most of our clusters (F-test is shown in Table \\ref{tab:f_test_results}), \nwe have moved the discussion of single and double power law fits to Appendix \\ref{S:sgl_powlaw_fit} \\& \\ref{S:dbl_powlaw_fit}, respectively.\n\n\\setcounter{figure}{8}\n\\begin{figure*}\n \\centering  \n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_flat_core_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K0_vs_alpha.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K0_vs_k100.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_entropy_flat_core_fit_using_mcmc.ps}\\\\  \n  \\caption{The $K_0$-$\\alpha$ and $K_0$-$K_{100}$ scatter plots obtained from the flat-core entropy model (eq.~\\ref{eq:flat_core_model}) fitting for PL sample. \n   The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards.\n   Greyscale denotes PDF density.}\n  \\label{fig:flat_core_entr_fit_samp2}\n\\end{figure*}\n\n  \n\\section{Discussion}\n\\label{S:discussion}\n\nAs mentioned in the introduction, entropy, cooling time and $t_{\\rm cool}/t_{\\rm ff}$ profiles carry useful information about the\nphysical processes in cluster cores. These profiles are sensitive to processes such as thermal conduction and \nmultiphase condensation. In this section we discuss the implications of our results.\n\n\\subsection{Comparison with previous works}\nThe canonical method of peeling off spherically symmetric shells to obtain deprojected spectra do not take care of covariance of parameters corresponding to different shells. Using jMCMC method for data analysis enables clear visualization of the model parameter space. The \nmethod, however, has not been much used for analysing X-ray data of clusters. A joint Bayesian analysis of the \\textit{Chandra} and \\textit{ROSAT} data of the galaxy group NGC4325 was carried out by \\cite{russ07} using the MCMC method. The analysis was performed using a \\textquoteleft{}forward fitting\\textquoteright{} approach in which the gas density and temperature were assumed to have known parametrised functional forms. While using parametrised models for density and temperature has several advantages, such as multiple datasets can be fitted together and the models can be extrapolated to large distances, its main disadvantage is that it introduces inherent biases in the results. \n\nWe note that \\textit{DSDEPROJ} (\\citealt{russ08}) may suffer from an intrinsic instability due to the following possibility: when the contribution from the outermost shell is subtracted from the next, any over/under estimate of photon counts---especially at high energies that best constrain the temperature---may cause an under/over estimate of photon counts deduced for the next shell. Since the correction appears with opposite signs in adjacent radial bins, albeit with diminishing volume factors, it may lead to an alternating over/under estimate of photon counts across the radial bins that may show up as oscillating inferred temperature, even if the gas is not multiphase. This effect may be more pronounced for clusters with poor quality data with large Poisson noise. This problem can be avoided if we do not treat the data in annuli separately, but jointly across all radial bins. \n\nOur proposed method is based on constructing a joint Bayesian posterior distribution for the free-form model parameters of a cluster. It naturally \nkeeps an account of the all the correlations inherent in fitting the parameters across different shells, since the shells contribute photons to all annuli in their interior. To explore this multi-parameter posterior distribution in a space of high dimensionality, we use the MCMC method, which produces parameter chains that are drawn from the posterior probability distribution. Using these chains we then construct the entropy profiles of clusters. To isolate the deep interior of a cluster, we marginalise over the parameters of the outermost shells. Since a single element of a chain gives us an entropy profile in a cluster, we account for its overall shape by accounting for the covariance of entropies measured in different radial shells of a cluster, which we then fit to different models (eqs. \\ref{eq:flat_core_model}-\\ref{eq:dbl_model}). \\citet{russ08} have argued that the oscillations mentioned above may also be caused by fitting a single-temperature model to a multiphase gas. It is straightforward to include multi-temperature plasma in our MCMC method, provided we have sufficiently high-quality data.\n\nIn a recent paper \\cite{san14} have described a new MCMC based code MBPROJ that is in spirit very similar to our method. \nUnlike our method, which works only for those clusters that have high quality data since we use multiple spectral bins to fit the spectrum, by choosing only three spectral bins, MBPROJ can work even for clusters that have only a few thousand counts. \nIt does that by making the assumption that the gas is in hydrostatic equilibrium; however, this assumption can be relaxed in the code to make it similar to \nour approach. To the best of our knowledge MBPROJ has not been used to analyse the entropy profiles of clusters as we have done in this work.  \n\n\\subsection{Entropy core versus cusp}\n\nAs discussed in section~\\ref{S:method_comp}, our method agrees with the method adopted in P14 for simulated and the test cluster. Although our method \ndoes not agree with C09, the differences are well explained by the fact that not deprojecting temperature leads to an increase in temperature \ninferred at the centre of clusters. Therefore, the method adopted in C09 is inherently biased to measure higher entropies at the cores of cluster, \nwhile P14 seems to be unbiased. However, the method of P14 does not account for the propagation of errors as the layers of a cluster are peeled \noff. \n\nGiven that the results from our analysis for the test cluster and simulated spectra agree with P14's method, it is surprising that, in complete \ncontrast, we find that most of the clusters analysed by us are actually \nbetter described by a cored power law model. Although, this is in overall agreement with  C09, our tests show that our core entropy values \nare smaller than theirs for the coolest clusters (see top-left panel of Fig. \\ref{fig:comp_voit}).\nNote that all the non-cool core clusters (shown in red; defined here as clusters with $K_0> 100$ keV cm$^2$) are consistent with flat cores. \nAs expected, their central entropies are also higher. The blue curves corresponding to cool cores, however, \nwhile mostly displaying flat cores, do have a sub-sample of about  four clusters that are somewhat consistent with a single power law without any \ncore (Fig. \\ref{fig:flat_core_entr_fit_samp2}). \nHowever, their core entropy is so small ($K_0 \\simeq 1$ keV cm$^2$) that they could be well described as overall single power laws. \nTherefore, the question of core versus cusp depends somewhat on the scales that we are interested in.\n\n\\setcounter{figure}{9}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/entropy_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/entropy_flat_core_profiles.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/K0_vs_alpha_combined_mod.ps}\n  \\caption{Entropy profiles of the full cluster sample obtained from the jMCMC fits (left) and the their flat-core \n  profile fits (centre). The best-fit K$_{0}$ vs. $\\alpha$ values obtained from flat-core fits \n  is shown in the right panel. Cool-core ($K_0 > 100$ keV cm$^2$) and non-cool-core ($K_0<100$ keV cm$^2$) \n  clusters are shown using blue and red colors, respectively.}\n  \\label{fig:flat_core_prof_full_sampl}\n\\end{figure*}\n\nAnother discrepancy between P14 and C09 is the presence or absence of bimodality in the central values of entropy in clusters (see also \\citealt{pra10}). \nAlthough our sample \nof clusters is small, the second panel of Fig.~\\ref{fig:flat_core_prof_full_sampl} shows an apparent gap between the red and blue curves close to \nthe centre of the clusters. This is indicated more clearly (with error bars) in the third panel. Most of the blue points are clustered at small \n$K_0$, with smaller values of $\\alpha$ (this is in contrast to \\citealt{san09} who find a steeper entropy in cool cores). \nThen we see an apparent gap at about $K_0 \\simeq 100 \\, {\\rm keV cm^2}$. The statistical significance of \nthis gap is marginal due to small number of clusters in our sample, but seems to be in general agreement with the results of P14.\nMuch  further work is required to explore the issue of bimodality, and in the future we shall add more clusters  to our sample to \nadequately address it. \n\nWhile our results are broadly consistent with C09, our method is a significant improvement in terms of how we handle statistics. We are unable to fully\nexplain our lack of agreement with P14, even though our tests show that our results match well on simulated data and a sample cluster, despite the \ndifference in the two approaches. Most clusters in our sample have cores and not cusps; especially, the non-cool clusters display only cores. A \nfew cool-core clusters are probably flat cored too, but with very small core radius, so our fits are only marginally able to capture the core. \n\n\n\\setcounter{figure}{10}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_sgl_pow_law_fit_using_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_sgl_pow_law_fit_using_mcmc_with_large_radial_bin.ps}\n   \\caption{Entropy profiles of the cluster A478 with small (left) and large (right) central radial bins, fitted with single \n   power law models (dotted lines). An excess \n   entropy (flattening) is seen in the innnermost  annulus when a smaller radial bin size is used.}\n  \\label{fig:large_radial_bin_effect}\n\\end{figure*}\n\nP14's results are in complete disagreement with C09, and the former have argued that the difference is mainly \ndue to the use of projected temperature profiles, large central radial bins (which might smooth out central gradients \nleading to flattening of entropy profiles) and assumption of single phase gas in the central regions by the latter. \nThe first issue has been addressed in the present work as we have used deprojected temperature profiles in our analysis. In contrast to \nP14, in our analysis  \nwe found that using larger central radial bins for some of our clusters actually favours power law instead of flat-core \nprofiles; an example of this is shown in Fig. \\ref{fig:large_radial_bin_effect}.\n\nThere are some difference between our and P14's approach when it comes to fitting entropy profiles in the core. We, like C09, fit the parametric \nforms (power law, double power law, flat core) for {\\it individual} clusters but P14 use a {\\it common power law for all the clusters and groups in \ntheir sample} (see their Figs. 2 \\& 3). From the left panel of Fig.~\\ref{fig:flat_core_prof_full_sampl} we can see that a single power law indeed provides \na good {\\it common} fit for all the lowest entropy profiles. However, as we show in detail, individual cluster entropy profiles almost always flatten toward \nthe center. Another, and potentially more significant, difference is that our sample has clusters with temperature greater than 3 keV (see Table 1 in \n\\citealt{san10}) but P14's sample has several groups with temperature $\\leq 1.2$ keV (see their Fig. 3). Their groups sample shows a good agreement\nwith a single power law in the core compared to the full sample shown in their Fig. 2. The lowest entropy clusters (which are well fit by \na power law) in P14 may be dominated by small scale coronae associated with the massive central galaxy (e.g., see \\citealt{sun09}; see also Fig. 2 in \\citealt{sha12b}) rather than \nthe typical large cool cores.\n\n\\subsection{Cooling time \\& free-fall time}\n\n\\setcounter{figure}{11}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/pressure_mcmc_fitted_profiles.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/tcool_mcmc.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/tcool_by_tff_mcmc.ps}\n  \\caption{Left: The pressure profiles of the full cluster sample obtained from the jMCMC analysis (triangles) with the best-fit models (eq. \\ref{eq:pfit}) \n  shown using lines. \n  Different colors are used for different clusters. Middle and Right: The $t_{\\rm cool}$ and $t_{\\rm cool}/t_{\\rm ff}$ profiles of the full cluster sample. Again, \n  cool-core and non-cool-core clusters are shown using blue and red colors.}\n  \\label{fig:press_prof_full_sampl}\n\\end{figure*}\n\nThe cooling time and the gravitational free-fall time are important parameters that govern the properties of cluster cores (e.g., \\citealt{mcc12,sha12a}).\nIn fact, \\citet{mit09} argue that the central cooling times better characterize the properties of cluster cores. We therefore obtain the cooling time and \n$t_{\\rm cool}/t_{\\rm ff}$ profiles from our best-fit  shell density and temperature values. While the cooling time is just a function of density, temperature and \nelemental abundance (the quantities obtained from X-ray observations) and is easy to obtain (middle panel of Fig. \\ref{fig:press_prof_full_sampl}), the free-fall time requires \nthe knowledge of gravitational acceleration profile. One way to\nobtain gravitational acceleration is by assuming hydrostatic equilibrium (e.g., see \\citealt{ras06}). While this is a good assumption for relaxed, cool-core \nclusters, non-cool clusters are generally mergers in which this assumption fails.\n\nWe obtain pressure profiles by combining density and temperature data. Since these pressure values are not always decreasing with radius \n(which is impossible for hydrostatic equilibrium), we fit an empirical form to obtain smooth pressure profiles\n\n", "index": 35, "text": "\\begin{equation}\n\\label{eq:pfit}\nP(x)=\\frac{P_0 }{ (x/a)^{\\alpha 1} + (x/a)^{\\alpha 2} },\n\\end{equation}\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.E18.m1\" class=\"ltx_Math\" alttext=\"P(x)=\\frac{P_{0}}{(x/a)^{\\alpha 1}+(x/a)^{\\alpha 2}},\" display=\"block\"><mrow><mrow><mrow><mi>P</mi><mo>⁢</mo><mrow><mo stretchy=\"false\">(</mo><mi>x</mi><mo stretchy=\"false\">)</mo></mrow></mrow><mo>=</mo><mfrac><msub><mi>P</mi><mn>0</mn></msub><mrow><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>/</mo><mi>a</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>α</mi><mo>⁢</mo><mn>1</mn></mrow></msup><mo>+</mo><msup><mrow><mo stretchy=\"false\">(</mo><mrow><mi>x</mi><mo>/</mo><mi>a</mi></mrow><mo stretchy=\"false\">)</mo></mrow><mrow><mi>α</mi><mo>⁢</mo><mn>2</mn></mrow></msup></mrow></mfrac></mrow><mo>,</mo></mrow></math>", "type": "latex"}, {"file": "1601.02347.tex", "nexttext": "\nwhere $\\rho$ is the gas mass density. Since pressure fits can have $dp/dr>0$, $g_{\\rm HSE}$ can be negative, resulting in an imaginary \n$t_{\\rm ff} \\equiv (2 r /g)^{1/2}$; we ignore such meaningless points in our analysis.\nAgain, the red color corresponds to non-cool core clusters, while blue is for cool-core clusters. \nBlue curves extend more toward smaller radii than the red ones because high/low central entropy/density means that non-cool clusters are not very \nbright at the centre and hence are difficult to resolve. \n\nWe show $t_{\\rm cool}/t_{\\rm ff}$ profiles for our cluster sample in the right panel of Fig. \\ref{fig:press_prof_full_sampl}. From various recent studies\n(\\citealt{wag14,ban14,tre15,voi15}),\nit appears that this ratio plays a key role in determining the amount of cold gas and AGN feedback in cluster cores. Cold gas condensation and signatures of AGN \nfeedback (in form of radio emission and X-ray cavities) are expected if this ratio falls below a critical value close to 10 (\\citealt{mee15,cho15}). Moreover, \nclusters are not expected to fall too much below this threshold as extreme feedback due to cold gas condensation is triggered in that case which pushes\nthe gas out and maintains min($t_{\\rm cool}/t_{\\rm ff}$) close to the critical value. Indeed, in all our cases $t_{\\rm cool}/t_{\\rm ff} \\gtrsim 4$.\n\n\\setcounter{figure}{12}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/K0_MCMC_vs_K0_ACCEPT.eps}\n  \\includegraphics[width=0.32\\textwidth]{figures/LHa_vs_tctf.eps}\n  \\includegraphics[width=0.32\\textwidth]{figures/LR_vs_tctf.eps}\n  \\includegraphics[width=0.32\\textwidth]{figures/K0_vs_mintctf.eps}\n    \\includegraphics[width=0.32\\textwidth]{figures/LHa_vs_K0.eps}\n  \\includegraphics[width=0.32\\textwidth]{figures/LR_vs_K0.eps}\n  \\caption{Correlation between various important quantities derived from our analysis ($K_0$ and min$(t_{\\rm cool}/t_{\\rm ff})$ are derived from jMCMC; see middle panel of Fig. \\ref{fig:flat_core_prof_full_sampl} and the right panel of Fig. \\ref{fig:press_prof_full_sampl}) and from the ACCEPT sample (where radio and $H\\alpha$ luminosities are listed). Although our sample is a small subset of their, our trends are generally similar to \\citet{voi15a}. Top-left panel shows that the core entropy values for our coolest cores are systematically smaller than those in the ACCEPT sample. We have a smaller fraction of non-cool cores compared to C09. }\n  \\label{fig:comp_voit}\n\\end{figure*}\n\nThe top-left panel of Fig. \\ref{fig:comp_voit} shows the core entropy derived from C09 (ACCEPT) as a function of the same quantity derived from our jMCMC\nanalysis. For core entropy ($K_0$) larger than 10 keV cm$^2$ the two methods agree with each other. However, for the lowest core entropies obtained from \nour jMCMC analysis the ACCEPT core entropies seem to flatten out (i.e., are significantly larger). We can speculate on the saturation of core entropy in C09's \nanalysis. First, of course, C09 uses projected temperatures which overestimates the entropy in the core. However, this is not large enough to explain\nthe observed discrepancy in the coolest cores. C09 fit the flat-core entropy profile (eq. \\ref{eq:flat_core_model}) over {\\it all} their radial shells but {\\it we integrate\nthe PDF over the outermost radial shells} and then obtain the marginalized densities and temperatures for the inner shells (extending up to $\\lesssim 300$ \nkpc). Only after this, do we fit a flat-core entropy profile over these shells. The entropy values in the outermost shells for the discrepant coolest cores show \na steepening of the entropy profile in the outermost shells. Thus, having to fit larger entropy value for the outermost shells may lead to an overestimate of \nthe core entropy ($K_0$). More work is needed to fully understand this discrepancy.\n\nDifferent panels of Fig. \\ref{fig:comp_voit} show correlation of X-ray properties derived from our analysis and observations from other wavebands (obtained from \nACCEPT\\footnote{\\url{www.pa.msu.edu/astro/MC2/accept/}} tables; \\citealt{cav09}), namely, $H\\alpha$ and radio. We also compare our results \nwith those of \\citet{voi15a}. Like them, we find that the {\\it amount} of $H\\alpha$ luminosity is anti-correlated with min($t_{\\rm cool}/t_{\\rm ff}$), albeit \nwith some scatter. A similar trend is seen for radio luminosity but the spread is larger. Anti-correlation is not as strong with the core entropy ($K_0$).\nThe large scatter is consistent with the cyclic behaviour observed in cool core simulations (compare with Fig. 14 of \\citealt{pra15}; note that these are \ndata from a single simulation and do not span as large a range in $K_0$ and min[$t_{\\rm cool}/t_{\\rm ff}$] as seen in our Fig. \\ref{fig:comp_voit}). \nOne aspect in which we differ from \\citet{voi15a} is that, unlike them, we do not see $H\\alpha$ emitting systems with min($t_{\\rm cool}/t_{\\rm ff} \\gtrsim\n10$); they have several $H\\alpha$ emitting clusters with largest min$(t_{\\rm cool}/t_{\\rm ff} ) \\gtrsim 20$. This discrepancy is closely related to the saturation\nof core entropy for coolest clusters in C09 (and hence under/over-estimation of core density/cooling time), discussed in the previous paragraph.\n Other factor that can systematically bias their $t_{\\rm cool} \\propto T/\\Lambda(T)$ high is the fact that they use {\\it projected} temperatures which are larger \nthan the actual temperatures (which our jMCMC method faithfully reproduces) in spherical shells (see left panels of Figs. \n\\ref{fig:100ks_sim_different_method} \\& \\ref{fig:test_clus_different_method}). Another difference is the computation of $t_{\\rm ff}$ which depends on how well the pressure fit approximates the pressure data (see left panel of Fig. \\ref{fig:press_prof_full_sampl}). One more minor difference from \\citet{voi15} \nis that we have two clusters with \nmin$(t_{\\rm cool}/t_{\\rm ff})<10$ with no $H\\alpha$ detection. Sorting out these disagreements is left for future. \n\n\\section{Conclusions}\n\\label{S:conclusions}\nFollowing are the key conclusions of our paper:\n\\begin{itemize}\n\\item jMCMC method is a statistically accurate method to recover the density and temperature profiles in cluster cores, which accounts for covariance\nbetween density and temperature of different shells. For clusters with good data, the results are comparable to the standard deprojection.\nFor poor quality data we expect our method to give robust results, for example the absence of oscillatory instability in deprojected temperature.\n\\item Most cluster cores favour a flat entropy core and not a power law (neither a single or a double power law), on the scales of 10 kpc. \nA single power law is clearly favoured in only one of the clusters in our sample. One must specify a scale when talking about flattening of the entropy profile \nas some clusters and groups show a decrease in entropy at scales $\\lesssim$ few kpc, corresponding to small coronae associated with BCGs.\n\\item The entropy and cooling time distributions may indicate bimodality but more clusters are required to reach definitive conclusions.\n\\item The minimum value of $t_{\\rm cool}/t_{\\rm ff}$ appear to govern the presence of $H\\alpha$ and radio emission in cluster cores. The {\\it amount} of \ncold gas is anti-correlated with min($t_{\\rm cool}/t_{\\rm ff}$), but with a large scatter.\n\\item The core entropy for coolest cores is systematically overestimated by C09 as compared to our jMCMC method, resulting in a lower density, a longer\ncooling time, and a larger min$(t_{\\rm cool}/t_{\\rm ff})$. The discrepancies in the observational reconstruction of thermodynamic profiles need to be sorted \nout before a detailed comparison with theoretical models can be made.\n\n\\end{itemize}\n\n\\label{lastpage}\n\n\\bigskip\n\\noindent {\\bf Acknowledgements:}  This work is partly supported by the DST-India grant no. Sr/S2/HEP-048/2012 (which also supports KL) and an India-Israel\njoint research grant (6-10/2014[IC]).\n\n\n\\begin{thebibliography}{}\n\n\\bibitem[\\protect\\citeauthoryear{Allen et al.} {2011}]{all11}\nAllen S. W., Everard A. E., \\& Mantz A. B. 2011, ARAA, 49, 409\n\n\\bibitem[\\protect\\citeauthoryear{Anderson \\& Bregman} {2010}]{and10}\nAnderson M. \\& Bregman J. N. 2010, ApJ, 714, 320\n\n\\bibitem[\\protect\\citeauthoryear{Arnaud}{1996}]{arn96} Arnaud \nK.~A., 1996, ASPC, 101, 17\n\n\\bibitem[\\protect\\citeauthoryear{Banerjee \\& Sharma}{2014}]{ban14} \nBanerjee N., Sharma P., 2014, MNRAS, 443, 687\n\n\\bibitem[\\protect\\citeauthoryear{Arnaud}{2010}]{arn10} Arnaud \nM.,  Pratt G.~W., Piffaretti R., B\\\"ohringer H., Croston J.~H., \\& Pointecouteau E., 2010, A\\&A, 517, A92\n\n\\bibitem[\\protect\\citeauthoryear{Cavagnolo et al.} {2009}]{cav09}\nCavagnolo K. W., Donahue M., Voit G. M., \\& Sun M. 2009, ApJS, 182, 12 \n\n\\bibitem[\\protect\\citeauthoryear{Choudhury \\& Sharma}{2015}]{cho15} \nChoudhury P.~P., Sharma P., 2015, arXiv:1512.01217\n\n\\bibitem[\\protect\\citeauthoryear{Colless et al.} {2001}]{col01}\nCollies M., Dalton G., Maddox S. et al. 2001, MNRAS, 328, 1039\n\n\\bibitem[\\protect\\citeauthoryear{Croston et al.} {2008}]{cro08}\nCroston J. H., Pratt G. W., B\\\"ohringer H. et al. 2008, A\\&A, 487, 431\n\n\\bibitem[\\protect\\citeauthoryear{Davis et al.} {1985}]{dav85}\nDavis M., Efstathiou G., Frenk C. S., \\& White S. D. M. 1985, ApJ, 292, 371\n\n\\bibitem[\\protect\\citeauthoryear{Donahue et \nal.}{2006}]{don06} Donahue M., Horner D.~J., Cavagnolo K.~W., \nVoit G.~M., 2006, ApJ, 643, 730 \n\n\\bibitem[\\protect\\citeauthoryear{Eke et al.} {1996}]{eke96}\nEke V. R., Cole S., \\& Frenk C. S. 1996, MNRAS, 282, 263\n\n\\bibitem[\\protect\\citeauthoryear{Gaspari et al.} {2013}]{gas13}\nGaspari M., Ruszkowski M., \\& Oh S.~P., 2013, MNRAS, 432, 3401 \n\n\\bibitem[\\protect\\citeauthoryear{Hastings}{1970}]{hast70}\nHastings W. K., 1970, Biometrika, 57, 97 \n\n\\bibitem[\\protect\\citeauthoryear{Hudson et al.} {2010}]{hud10}\nHudson D. S., Mittal R., Reiprich T. H. et al. 2010, A\\&A, 513, A37\n\n\\bibitem[\\protect\\citeauthoryear{Kaiser et al.} {1991}]{kai91}\nKaiser N., 1991, ApJ, 383, 104\n\n\\bibitem[\\protect\\citeauthoryear{Kriss, Cioffi, \n\\& Canizares}{1983}]{kri83} Kriss G.~A., Cioffi D.~F., Canizares C.~R., 1983, ApJ, 272, 439 \n\n\\bibitem[\\protect\\citeauthoryear{McCourt et al.} {2012}]{mcc12}\nMcCourt M., Sharma P., Quataert E., Parrish I. J. 2012, MNRAS, 419, 3319\n\n\\bibitem[\\protect\\citeauthoryear{McNamara \\& Nulsen} {2007}]{mcn07}\nMcNamara B. R., Nulsen P. E. J. 2007, ARAA, 45, 117\n\n\\bibitem[\\protect\\citeauthoryear{Meece et al.}{2015}]{mee15} \nMeece G.~R., O'Shea B. W., \\& Voit, G. M., 2015, ApJ, 808, 43\n\n\\bibitem[\\protect\\citeauthoryear{Metropolis et al.}{1953}]{met53} Metropolis, N., \nRosenbluth, A.~W., Rosenbluth, M.~N., Teller, A.~H., \n\\& Teller, E.\\ 1953, The Journal of Chemical Physics, 21, 1087 \n\n\\bibitem[\\protect\\citeauthoryear{Morrison \n\\& McCammon}{1983}]{mor83} Morrison R., McCammon D., 1983, ApJ, 270, 119 \n\n\\bibitem[\\protect\\citeauthoryear{Mittal et al.}{2009}]{mit09}\nMittal R., Hudson D. S., Reiprich T. H., \\& Clarke T. 2009, A\\&A, 501, 835\n\n\\bibitem[\\protect\\citeauthoryear{Navarro et al.}{1996}]{nav96}\nNavarro J.~F., Frenk C.~S., \\& White S.~D.~M., 1996, 462, 563\n\n\\bibitem[\\protect\\citeauthoryear{Panagoulia et al.}{2014}]{pan14}\nPanagoulia E. K., Fabian A. C., \\& Sanders J. S. 2013, MNRAS, 2014, 438, 2341\n\n\\bibitem[\\protect\\citeauthoryear{Pizzolato \\& Soker} {2005}]{piz05}\nPizzolato F. \\& Soker N., 2005, ApJ, 632, 821\n\n\\bibitem[\\protect\\citeauthoryear{Prasad et al.} {2015}]{pra15}\nPrasad D., Sharma P., \\& Babul A. 2015, ApJ, 811, 108\n\n\\bibitem[\\protect\\citeauthoryear{Pratt et al.} {2010}]{pra10}\nPratt G. W., Arnaud M., Piffaretti R. et al. 2010, A\\&A, 511, A85\n\n\\bibitem[\\protect\\citeauthoryear{Press et al.}{2003}]{press03} William H. Press, Saul A. Teukolsky, William T. Vetterling, and Brian P. Flannery. 2007. Numerical Recipes 3rd Edition: The Art of Scientific Computing (3 ed.). Cambridge University Press, New York, NY, USA\n\n\\bibitem[\\protect\\citeauthoryear{Putman et al.}{2012}]{put12}\nPutman M. E., Peek J. E. G., \\& Joung, M. R. 2012, ARAA, 2012, 50, 491\n\n\\bibitem[\\protect\\citeauthoryear{Rasia et al.} {2006}]{ras06}\nRasia E., Ettori S., Moscardini L., Mazzotta P., Brogan S., Dolag K., Tormen G., Cheng L.~M., \\& Diaferio A., 2006, MNRAS, 369, 2013\n\n\\bibitem[\\protect\\citeauthoryear{Rossetti \\& Molendi} {2010}]{ros10}\nRossetti M. \\& Molendi S. 2010, A\\&A, 520, A83\n\n\\bibitem[\\protect\\citeauthoryear{Russell, Ponman, \n\\& Sanderson}{2007}]{russ07} Russell P.~A., Ponman T.~J., Sanderson A.~J.~R., 2007, MNRAS, 378, 1217\n\n\\bibitem[\\protect\\citeauthoryear{Russell, Sanders, \n\\& Fabian}{2008}]{russ08} Russell H.~R., Sanders J.~S., Fabian A.~C., 2008, MNRAS, 390, 1207 \n\n\\bibitem[\\protect\\citeauthoryear{Sanders et \nal.}{2014}]{san14} Sanders J.~S., Fabian A.~C., \nHlavacek-Larrondo J., Russell H.~R., Taylor G.~B., Hofmann F., Tremblay G., \nWalker S.~A., 2014, MNRAS, 444, 1497 \n\n\\bibitem[\\protect\\citeauthoryear{Sanderson et \nal.}{2014}]{san09} Sanderson J.~R., O'Sullivan E., \\& Ponman T. J., 2009, MNRAS, 395, 764 \n\n\\bibitem[\\protect\\citeauthoryear{Santos et al.} {2008}]{san08}\nSantos J. S., Rosati P., Tozzi P., et al. 2008, A\\&A, 483, 35\n\n\\bibitem[\\protect\\citeauthoryear{Santos et \nal.}{2010}]{san10} Santos J.~S., Tozzi P., Rosati P., B{\\\"o}hringer H., 2010, A\\&A, 521, A64 \n\n\\bibitem[\\protect\\citeauthoryear{Sharma et al.} {2012a}]{sha12a}\nSharma P., McCourt M., Quataert E., Parrish I. J. 2012,  MNRAS, 420, 3174\n\n\\bibitem[\\protect\\citeauthoryear{Sharma et al.} {2012b}]{sha12b}\nSharma P., McCourt M., Parrish I. J., \\& Quataert, E. 2012,  MNRAS, 427, 1219\n\n\\bibitem[\\protect\\citeauthoryear{Smith et al.}{2001}]{smi01} \nSmith R.~K., Brickhouse N.~S., Liedahl D.~A., Raymond J.~C., 2001, ApJ, \n556, L91\n\n\\bibitem[\\protect\\citeauthoryear{Sun} {2009}]{sun09}\nSun M., 20009, ApJ, 704, 1586\n\n\\bibitem[\\protect\\citeauthoryear{Tozzi \\& Norman} {2001}]{toz01}\nTozzi P. \\& Norman C.  2001, ApJ, 546, 63\n\n\\bibitem[\\protect\\citeauthoryear{Tremblay et al.} {2015}]{tre15}\nTremblay G., O'Dea C.~P., Baum S.,  et al., 2015, MNRAS, 451, 3768\n\n\\bibitem[\\protect\\citeauthoryear{Voit et al.}{2003}]{voi03} \nVoit G.~M., Balogh M.~L., Bower R. G., Lacey C. G., Bryan G.~L., 2005, MNRAS, 364, 909\n\n\\bibitem[\\protect\\citeauthoryear{Voit \\& Donahue} {2015}]{voi15a}\nVoit G. M., Donahue M., 2015, ApJL, 799, L1\n\n\\bibitem[\\protect\\citeauthoryear{Voit et al.} {2015}]{voi15}\nVoit G. M., Donahue M., Bryan G. L., \\& McDonald M., 2015, Nature, 519, 203\n\n\\bibitem[\\protect\\citeauthoryear{Wagh et al.} {2014}]{wag14}\nWagh B., Sharma P., \\& McCourt M., 2014, MNRAS, 439, 2822\n  \n\\bibitem[\\protect\\citeauthoryear{White \\& Rees}{1978}]{whi78}\nWhite S. D. M. \\& Rees M. J. 1978, 183, 341\n\n\\end{thebibliography}\n\n\\bigskip\n\n\\appendix\n\n\\section{Single power law model}\n\\label{S:sgl_powlaw_fit}\n\n\\begin{table}\n \\caption{Single power law entropy model fitting (eq. \\ref{eq:spl_model}) for PL sample.}\n\\label{tab:sgl_powlaw_results}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{c c c c}\n\\hline\nCluster Name & $K_{1}$ & $\\alpha 1$ & $\\chi^{2}_{\\rm red}$ (DOF)\\\\\n & (keV cm$^{2}$) & & \\\\\n\\hline\n\\hline\n  A85 & 173.27$\\pm$2.06 & 0.92$\\pm$0.01 & 4.09 (9)\\\\\n A478 & 130.50$\\pm$1.92 & 0.95$\\pm$0.01 & 2.65 (14)\\\\\nA2029 & 173.28$\\pm$1.24 & 0.84$\\pm$0.01 & 4.75 (13)\\\\\nA3112 & 144.64$\\pm$0.94 & 1.44$\\pm$0.01 & 18.24 (9)\\\\\n\\hline\n\\end{tabular}}\n\\end{table}\n\nSince the entropy profiles of PL sample  showed almost linear shapes in the log-log plot, single power law model \n(eq. \\ref{eq:spl_model}) fits were tested for these clusters.  The resulting $K_1$-$\\alpha1$ scatter plots, along with the \nsingle power law profile fits are shown in Fig. \\ref{fig:sgl_pl_entr_fit_samp2}. All the clusters of PL sample\nshow a weak positive correlation between $K_1$ and $\\alpha_1$, except for A2029, which does not show any correlation \nbetween them. The expectation values of \n$K_1$ and $\\alpha1$ (with the associated variances) and the reduced chi-squared values \nobtained from the fits are given in Table \\ref{tab:sgl_powlaw_results}. The flat-core and single power law model \nfits for PL sample were compared using F-test and the results are given in Table \\ref{tab:f_test_results}. \nFlat-core fits seem to be preferred compared to single power law fits even for all the clusters of PL sample. However, \nsince for the cluster A2029, flat-core model fitting leads to negative $K_0$, single power law \nfit may be a preferred.\n\n\n\\setcounter{figure}{13}\n\\begin{figure*}\n \\centering  \n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K1000_vs_alpha0.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_entropy_sgl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K1000_vs_alpha0.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_sgl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K1000_vs_alpha0.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_entropy_sgl_pow_law_fit_using_mcmc.ps}\\\\   \n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K1000_vs_alpha0.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_entropy_sgl_pow_law_fit_using_mcmc.ps}\\\\ \n  \\caption{The $K_1$-$\\alpha 1$ scatter plots obtained from the single power law entropy model fitting for PL sample. \n   The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards. \n   Greyscale denotes the PDF density.}\n  \\label{fig:sgl_pl_entr_fit_samp2}\n\\end{figure*}\n\n\n\\section{Double power law model}\n\\label{S:dbl_powlaw_fit}\n\n\\begin{table}\n\\setlength{\\tabcolsep}{1pt}\n \\caption{Double power law entropy model fitting (eq. \\ref{eq:dbl_model}).}\n\\label{tab:dbl_powlaw_results}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{c c c c c c}\n\\hline\nCluster & $K_{1}$ & $\\alpha 1$ & $K_2$ & $\\alpha 2$ & $\\chi^{2}_{\\rm red}$ (DOF)\\\\\nName& (keV cm$^{2}$) & & (keV cm$^{2}$) & & \\\\\n\\hline\n\\hline\n  A85&41.54$\\pm$29.70&0.49$\\pm$0.20&129.16$\\pm$30.52&1.12$\\pm$0.10&6.37 (7)\\\\\n A133&17.74$\\pm$3.12&0.09$\\pm$0.06&227.66$\\pm$10.25&1.86$\\pm$0.09&5.21 (4)\\\\\n A478&11.89$\\pm$8.03&0.29$\\pm$0.18&115.96$\\pm$8.72&1.07$\\pm$0.05&2.40 (12)\\\\\nA1650&130.57$\\pm$28.38&0.26$\\pm$0.13&58.66$\\pm$27.60&2.34$\\pm$0.81&1.35 (3)\\\\\nA1795&53.42$\\pm$17.21&0.26$\\pm$0.15&80.57$\\pm$23.89&2.26$\\pm$0.57&0.59 (10)\\\\\nA2029& 0.40$\\pm$0.30&0.33$\\pm$0.72&169.85$\\pm$12.42&0.87$\\pm$0.13&8.89 (11)\\\\\nA2142&1n20.90$\\pm$37.81&0.39$\\pm$0.16&75.18$\\pm$39.20&1.94$\\pm$0.94&1.44 (5)\\\\\nA2204&10.31$\\pm$2.49&0.09$\\pm$0.08&261.27$\\pm$14.05&2.03$\\pm$0.09&5.24 (3)\\\\\nA2244s&139.65$\\pm$18.94&0.38$\\pm$0.10&25.58$\\pm$18.50&2.32$\\pm$1.08&2.06 (3)\\\\\nA2597&16.11$\\pm$4.16&0.12$\\pm$0.08&95.33$\\pm$4.77&1.46$\\pm$0.07&1.65 (7)\\\\\nA3112&5.18$\\pm$4.83&0.18$\\pm$0.15&131.91$\\pm$5.07&0.96$\\pm$0.02&18.24 (7)\\\\\nHydra-A&16.15$\\pm$4.57&0.11$\\pm$0.09&102.80$\\pm$4.84&1.30$\\pm$0.07&3.94 (5)\\\\\n A754&293.24$\\pm$29.94&0.23$\\pm$0.15&39.03$\\pm$22.42&1.78$\\pm$0.52&1.31 (9)\\\\\nA2256&298.16$\\pm$22.35&0.15$\\pm$0.11&11.95$\\pm$12.81&2.47$\\pm$1.06& 4.63 (4)\\\\ \nA3158&261.57$\\pm$33.76&0.22$\\pm$0.17&0.25$\\pm$25.58&3.23$\\pm$2.00&5.36 (2)\\\\\nA3667&211.91$\\pm$18.63&0.15$\\pm$0.10&35.60$\\pm$16.64&1.83$\\pm$0.47&4.97 (5)\\\\\nZWCL1215&305.90$\\pm$38.00&0.32$\\pm$0.18&39.10$\\pm$25.08&1.68$\\pm$0.61& 0.41 (4)\\\\\n\\hline\n\\end{tabular}}\n\\end{table}\n\n\nOne of the main results of P14 has been that the entropy profiles of all clusters in their sample were found to be best-fitted \nusing single/double power law models. Therefore, we have also tried double power law (eq. \\ref{eq:dbl_model}) \nfits for our full cluster sample\\footnote{The flat-core model can also be interpreted as a special case of the double power law \nmodel with $K_1 = K_0$, $\\alpha 1 = 0$,  $K_2 = K_{100}$ and $\\alpha 2 = \\alpha $.}. To avoid any degeneracy between the two power laws, \nwe have forced the conditions $\\alpha 1 < \\alpha 2$ and $\\alpha 1, \\alpha 2 > 0$ , so that the first power law fits the central region \n(where almost all the clusters \nshow flattening) and the second power law fits the outer parts of the clusters. The resulting $K_1$-$\\alpha 1$ and $K_2$-$\\alpha 2$  \nscatter plots, along with the double power law profile fits are shown in Fig. \\ref{fig:dbl_pl_entr_fit}. \nNearly all the clusters of the sample show a positive correlation between $K_1$ and $\\alpha 1$, and a negative correlation between $K_2$ \nand $\\alpha 2$. The cluster, A2029, which showed an inverted core in the flat-core fit, shows a poor fit with the double power law \nmodel; the $K_1$-$\\alpha 1$ scatter plot for this cluster seems to be highly irregular although the $K_2$-$\\alpha 2$ plot looks \nsymmetric with no visible correlation between the two quantities. The expectation values of \n$K_1$, $\\alpha 1$, $K_2$ and $\\alpha2$ (with errors estimated using variances) and the reduced chi-squared values \nobtained from the fits are given in Table \\ref{tab:dbl_powlaw_results}. A comparison of the flat-core and double power law model fits \nfor the full sample based on F-test is given in Table \\ref{tab:f_test_results}. \nFor all the clusters of the sample, except for four, flat-core model is found to provide significantly better fit than the double power law model.\n\n\\setcounter{figure}{14}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A85_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A133_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A478_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1650_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A1795_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\caption{The $K_1$-$\\alpha 1$ and $K_2$-$\\alpha 2$ scatter plots obtained from the double power law entropy model fitting for the full cluster sample. The contours mark the 50\\%, 90\\% and 99\\% inclusion levels based on the density of points starting from the innermost contour outwards. Greyscale denotes the \n   PDF density.}\n  \\label{fig:dbl_pl_entr_fit}\n\\end{figure*}  \n\n\\setcounter{figure}{14}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2029_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2142_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2204_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2244_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2597_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\caption{(Contd.)}\n  \\label{fig:dbl_pl_entr_fit}\n\\end{figure*}\n\n\n\\setcounter{figure}{14}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3112_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/Hydra_A_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A754_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A2256_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3158_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\caption{(Contd.)}\n  \\label{fig:dbl_pl_entr_fit}\n\\end{figure*}\n\n\n\n\\setcounter{figure}{14}\n\\begin{figure*}\n \\centering\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/A3667_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K1001_vs_alpha1.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_K1002_vs_alpha2.ps}\n  \\includegraphics[width=0.32\\textwidth]{figures/ZWCL1215_entropy_dbl_pow_law_fit_using_mcmc.ps}\\\\\n  \\caption{(Contd.)}\n  \\label{fig:dbl_pl_entr_fit}\n\\end{figure*}\n\n\\begin{table}\n \\caption{Upper Panel: Comparison of results from single-power law (SPL) and flat-core (FC) models based on F-test for the PL sample.\n Lower Panel: Comparison of results from flat-core (FC) and double power law (DPL) models based on F-test for the complete sample.\n F-value is calculated as F$=(\\chi^2_1/{\\rm DOF}_1)/(\\chi^2_2/{\\rm DOF}_2)-1$. The last column gives the probability \n that model 2 is an improvement over model 1.}\n\\label{tab:f_test_results}\n\\vskip 0.5cm\n\\centering\n{\\scriptsize\n\\begin{tabular}{c c c c c c c}\n\\hline\nCluster & $\\chi^2_1$ & DOF$_1$ & $\\chi^2_2$ & DOF$_2$ & F-value & Prob. (\\%) \\\\\nName & & & & & & \\\\\n\\hline\n\\hline\n & (SPL) & & (FC) & & & \\\\\n\\hline\n  A85 & 36.81  &  9 &  13.36 &  8 & 14.04 & 99.44 \\\\\n A478 & 37.10  &  14 &  22.23 & 13 & 8.70 & 98.87 \\\\\nA2029  & 61.75  & 13 &  51.84 & 12 & 2.29 & 84.43 \\\\\nA3112 & 164.16 &  9 & 101.92 &  8 & 4.89 & 94.20 \\\\\n\\hline\n & (FC) & & (DPL) & & & \\\\\n\\hline\n  A85 & 13.36  &  8 &  44.59 &  7 & -4.90 & 0.00 \\\\\n A133 & 19.25  &  5 &  20.84 &  4 & -0.31 & 0.00 \\\\\n A478 & 22.23  & 13 &  28.80 & 12 & -2.73 & 0.00 \\\\\nA1650 &  2.12  &  4 &   4.05 &  3 & -1.43 & 0.00 \\\\\nA1795 & 11.66  & 11 &   5.90 & 10 &  9.76 & 98.92 \\\\\nA2029 & 51.84  & 12 &  97.79 & 11 & -5.17 & 0.00 \\\\\nA2142 &  3.42  &  6 &   7.20 &  5 & -2.63 & 0.00 \\\\\nA2204 & 13.36  &  4 &  15.72 &  3 & -0.45 & 0.00 \\\\\nA2244 &  4.28  &  4 &   6.18 &  3 & -0.92 & 0.00 \\\\\nA2597 &  9.36  &  8 &  11.55 &  7 & -1.32 & 0.00 \\\\\nA3112 & 101.92 &  8 & 127.68 &  7 & -1.41 & 0.00 \\\\\nHydra-A & 111.18 & 6 & 19.75 &  5 & 23.15 & 99.52 \\\\\n A754 & 10.70  & 10 &  11.79 &  9 & -0.83 & 0.00 \\\\\nA2256 & 41.80  &  5 &  18.52 &  4 &  5.03 & 91.16 \\\\\nA3158 &  5.07  &  3 &  10.72 &  2 & -1.05 & 0.00 \\\\ \nA3667 & 22.26 &   6 &  24.85 &  5 & -0.52 & 0.00 \\\\\nZWCL1215 & 4.75 & 5 &   1.64 &  4 &  7.59 & 94.88 \\\\\n\\hline\n\\end{tabular}}\n\\end{table}\n\n\n\n\n\n\n", "itemtype": "equation", "pos": 69426, "prevtext": "\nwhich is simpler compared to the `universal' pressure profile suggested by \\citet{arn10}. The left panel of Fig. \\ref{fig:press_prof_full_sampl} shows the pressure data and the best-fit\npressure profiles for our cluster sample. Pressure (both data points and fits) decreases toward the centre for some non-cool clusters because of bulk flows \nand large turbulent velocities. Gravitational acceleration is obtained from differentiating pressure fits as \n\n", "index": 37, "text": "$$\ng_{\\rm HSE} \\equiv -\\frac{1}{\\rho} \\frac{dP}{dr},\n$$\n", "mathml": "<math xmlns=\"http://www.w3.org/1998/Math/MathML\" id=\"S0.Ex1.m1\" class=\"ltx_Math\" alttext=\"g_{\\rm HSE}\\equiv-\\frac{1}{\\rho}\\frac{dP}{dr},\" display=\"block\"><mrow><mrow><msub><mi>g</mi><mi>HSE</mi></msub><mo>≡</mo><mrow><mo>-</mo><mrow><mfrac><mn>1</mn><mi>ρ</mi></mfrac><mo>⁢</mo><mfrac><mrow><mi>d</mi><mo>⁢</mo><mi>P</mi></mrow><mrow><mi>d</mi><mo>⁢</mo><mi>r</mi></mrow></mfrac></mrow></mrow></mrow><mo>,</mo></mrow></math>", "type": "latex"}]